{
  "imDbId": "tt0096657",
  "title": "Mr. Bean",
  "fullTitle": "Mr. Bean (TV Series 1990–1995)",
  "type": "TVSeries",
  "year": "1990",
  "items": [
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2271225",
      "warningSpoilers": false,
      "date": "29 June 2010",
      "rate": "10",
      "helpful": "44 out of 48 found this helpful.",
      "title": "Perhaps the funniest show I have ever seen...I do wish they'd make more",
      "content": "I can understand why Rowan Atkinson doesn't make more Bean TV shows--he's probably rich as can be (based on his car collection) and the movies (which are far inferior) make a ton of money. I still wish they'd make more of these delightful shows, as they are possibly the funniest show ever made--it's THAT good.One of the reasons I enjoy Bean so much is because my daughter is deaf and we can both equally enjoy the shows, as you really don't need closed captions for it. And, importantly, this makes the show amazingly easy to export abroad. It's so amazing how the show is able to make you laugh even without the use of much language--just wacky situations and terrific pantomime by Atkinson.The bottom line is that if you don't like this show, you are either dead or have absolutely no sense of humor! I have not only watched the episodes repeatedly but have shown them to my students and they never fail to elicit tons of laughs--and the teens want to see them again and again. And who can blame them? The show is so clever and well made."
    },
    {
      "username": "wellthatswhatithinkanyway",
      "userUrl": "https://www.imdb.com/user/ur0345596",
      "reviewLink": "https://www.imdb.com/review/rw1514626",
      "warningSpoilers": false,
      "date": "5 November 2006",
      "rate": "10",
      "helpful": "67 out of 73 found this helpful.",
      "title": "Great humour and a grand step away from all the crassness and vulgarity of modern humour",
      "content": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning Mr Bean (Rowan Atkinson) is in this world, but not of this world. His mind simply doesn't seem to comprehend things the way an average person would and his life is one long disaster because of this, getting himself into constant mishaps and far out, zany situations, which he is left to sort out on his own as he doesn't seem to mix with anyone and he rarely speaks. But he never gives up and, despite the simplest of tasks being a constant struggle for him, applying his own zany methods of solving the problem always pays off for him in the end.To look at the sorry state of modern British humour, with all it's focus of sex and general vulgarity, you'd be forgiven for forgetting that a show like Mr Bean was made at one time. There's nothing unsuitable going on here, just good, clean U rated humour of the type Tommy Cooper and the like made in the 50s. And I find it just as laugh out loud funny now in my early 20s as I did when I was a young boy in the early 90s.Although I can look at it a little deeper now and see there must be more to this character than than meets the eye. There must be a reason why he does things the way he does and things seem to keep going wrong for him. As others have noted, it looks like he may have a type of autism. In fact I'm so convinced about it that I really think were a professional psychologist to analyse him, I think Mr Bean could be the first famous, fictional character to be diagnosed with something like Asperger's Syndrome.If you'd like to see some truly hilarious British humour at it's very best before it all became obsessed with sex and vulgarity, then this would come highly recommended. Shows like Little Britain do work because it's well realised but it's really just as vulgar as the rest. Shows like this show we were more restrained and civilised once, and hopefully we might start putting out this type of humour more again sometime soon. *****"
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw1101181",
      "warningSpoilers": false,
      "date": "12 June 2005",
      "rate": "",
      "helpful": "59 out of 67 found this helpful.",
      "title": "Thank God for English TV shows",
      "content": "\"Mr. Bean\" is one of those shows that you couldn't forget even if you tried (not that you'd want to try). The title character (Rowan Atkinson) is a perfectly ordinary man who either never seems to do anything right, or always finds the hardest and most inefficient way to do it. Rarely speaking, he gets himself into all sorts of wacky situations.One of the funniest predicaments was at a hotel. Mr. Bean was following a man in the restaurant, taking twice as much as the other man. Sitting down at a table, Mr. Bean began wolfing everything down, only to learn that the food had gone bad. Feeling ill, he goes back to his room and falls asleep. He wakes up a few hours later and accidentally locks himself out of his room. Now he has to wander around the hotel naked.Actually, he ends up naked a lot, and usually there are other people around. But the point is, Mr. Bean is completely cracked. Whether going swimming, trying to tend to a baby, going to the beach, or hosting a New Year's party, he always manages to do everything in a way that most people would never imagine, and most often ends up embarrassing himself.As the British say, smashing."
    },
    {
      "username": "Beta_Gallinger",
      "userUrl": "https://www.imdb.com/user/ur15711750",
      "reviewLink": "https://www.imdb.com/review/rw1802588",
      "warningSpoilers": false,
      "date": "18 January 2008",
      "rate": "9",
      "helpful": "41 out of 43 found this helpful.",
      "title": "An excellent comedy series, filled with visual gags that can make you laugh over and over again!",
      "content": "\"Mr. Bean\", starring the legendary Rowan Atkinson, was a huge hit during its run in the 1990s, and I probably first saw it when I was around ten, shortly after it ended, so I was seeing reruns. I certainly wasn't much of a fan at the time, and didn't see too many episodes. I didn't really get into the show until my late teens, just a few years ago, which was when I finally watched every episode. Unlike before, it made me laugh many times, and since then, that has always been the case during repeat viewings of episodes! Mr. Bean is a mysterious, self-centred, antisocial, extremely naive buffoon whose best friend is his Teddy! He is pretty much isolated from society, and life is not easy for him, as he constantly struggles with very simple things! This is because he lacks some fairly basic knowledge, and has the mind of a child. He finds himself in various kinds of trouble wherever he goes, and comes up with very bizarre ways to try and solve the problems he faces! Not only does he often cause trouble for himself, but sometimes for other people as well, which he often doesn't tend to realize! In other words, Mr. Bean is a walking disaster! The humour in this show is very visual, and there is very little dialogue. The gags are almost always sight gags, which is mostly what the show is about. While there may be an occasional lacklustre gag, I would say the vast majority of them are funny, often hilarious, (there are so many highlights)! While \"Mr. Bean\" is certainly not the most sophisticated comedy ever made, it's still great for many of those who like visual humour, and due to the very limited dialogue, you don't even have to speak fluent English to enjoy the show, which is why it has received such a world-wide reputation! The show ran for a few years, but the episodes were made very gradually, so only fourteen were made in total. Nonetheless, it is a classic series, and deserves its wide appeal!"
    },
    {
      "username": "Big Movie Fan",
      "userUrl": "https://www.imdb.com/user/ur1486405",
      "reviewLink": "https://www.imdb.com/review/rw0264876",
      "warningSpoilers": false,
      "date": "28 February 2002",
      "rate": "",
      "helpful": "46 out of 51 found this helpful.",
      "title": "CANNOT STOP LAUGHING WHEN WATCHING THIS SERIES",
      "content": "Mr. Bean is funny purely and simply because he is a total buffoon. There's not much dialogue in this film but it's enjoyable to watch Bean's facial expressions and the situations he ends up in.A lot of funny scenes take place in his car (how he passed a driving test is beyond me). In one episode he brushes his teeth and gets dressed-whilst he is driving.Another funny thing is that Mr Bean doesn't seem to have much family or friends-except for his teddy bear. Bean is fiercely protective of his teddy bear and it makes me laugh watching scenes with him in.I could go into detail about other funny scenes in the series but all I'll say is go out and buy the videos. They really are amusing."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2256943",
      "warningSpoilers": false,
      "date": "30 May 2010",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "A complete delight, never ceases to be hilarious and original",
      "content": "Okay, Mr Bean mayn't be the most sophisticated comedy series ever, and it sure is one of the funniest. I do agree there may be the occasional gag that doesn't quite work, but an overwhelming majority of them work brilliantly. Mr Bean does have minimal dialogue so a lot of the humour comes from the visual gags and slapstick. That is not a bad thing whatsoever, because it actually works wonders.The story ideas are really interesting and are always constructed really well. The photography, scenery and costumes are great to look at, and the music is delightful. Other than the gags and slapstick, it is Mr Bean himself who makes the series. Mr Bean is naive, self-centred and clueless, he can't do anything right, but we love him anyway. Rowan Atkinson is perfect at conveying these character qualities; I thought he was brilliant in Black Adder, but he was just amazing in this. His facial expressions and the situations his character gets into are simply priceless. The guest appearances are also excellent, but it is Atkinson's show all the way.Overall, a complete delight of a comedy series. It is hilarious and original, like a comedy series should be, if anything though I think it should have lasted longer. 10/10 Bethany Cox"
    },
    {
      "username": "film-critic",
      "userUrl": "https://www.imdb.com/user/ur1601212",
      "reviewLink": "https://www.imdb.com/review/rw1019817",
      "warningSpoilers": false,
      "date": "13 February 2005",
      "rate": "",
      "helpful": "35 out of 39 found this helpful.",
      "title": "Ecce homo que est faba.",
      "content": "What exciting television adventure to England wouldn't be the same without a quick glimpse of the hysterical Mr. Bean? Superbly played by comedian Rowan Atkinson, Mr. Bean takes us into the doldrums of day to day life to show us that even the smallest gesture can be the funniest. He whirlwinds us through England in the most unconventional way, either in his sporty yellow car (with lock), or in his dentist office, or his doctor's office, or around the countryside stopping at several childish playgrounds. No matter where he takes you, the laughs are sure to follow and remain with you for a very long time.Atkinson has mastered the ability to bring this verbally challenged character to life in ways that comedians today falter. Atkinson weaves this richly developed character into simple settings where he transforms into part social satirist and part MacGyver of the common man. His ability to take any common item and transform it into a new bit of comedy is rare today. The fact that you never knew what Mr. Bean was going to grab next on the set always allowed endless moments of joy. Now, I can watch him over and over again thanks to A&E and the power of DVD. Released as a set, I can see Mr. Bean morning, evening, and late afternoon whenever I have the urge to laugh at life.This series is enjoyable for the newest Bean follower to even those of us that have been following him around for years. While some novice viewers may be disappointed to see the cuts that A&E made to some of the episodes, the packaging and supplemental features should suffice. It is packed full of fun information about Bean, especially a very informative feature on how Bean was created by Atkinson himself. It also allows us to see some of Comic Relief UK that showcased the talent of Mr. Bean right next to Alan Cummings himself. The extras are just more icing on an already sugar-packed cake.Overall, this collection is amazing. I love Mr. Bean and the style of humor that he brings to each episode and situation. He is funny without being crass or vulgar, allowing us to build so many new dimensions on this simple character. Atkinson is a master in his trade and has created a character that will be remembered for years to come. So, if you are a fan of slapstick humor with intellectual stimulation, than Mr. Bean is right up your alley. The set is not expensive, so I say go ahead and splurge on a DVD that you will never regret purchasing. You are definitely in for a hysterical treat! Mr. Bean is a role model for all and the true face of comedy! Grade: ***** out of *****"
    },
    {
      "username": "cool_cool_1",
      "userUrl": "https://www.imdb.com/user/ur8120040",
      "reviewLink": "https://www.imdb.com/review/rw1443315",
      "warningSpoilers": false,
      "date": "9 August 2006",
      "rate": "10",
      "helpful": "40 out of 44 found this helpful.",
      "title": "Classic UK comedy , forever funny!!!!",
      "content": "Mr Bean was great fun, i loved it, every episode was really funny, Rowan Atkinson was perfect for this role, he's a funny looking bloke and his facial expressions were hilarious!!! The series was so successful that they even made a Mr Bean movie in 1997, which was also pretty funny by the way!! It's funny seeing all the adventures and situations he gets himself into, this series was a classic for sure, and i still watch an episode from time to time.Mr Bean is well worth a 10/10 in my book, fans of offbeat comedy must check this out."
    },
    {
      "username": "British_Revolver",
      "userUrl": "https://www.imdb.com/user/ur5057222",
      "reviewLink": "https://www.imdb.com/review/rw1143264",
      "warningSpoilers": false,
      "date": "5 August 2005",
      "rate": "",
      "helpful": "80 out of 87 found this helpful.",
      "title": "Genius!",
      "content": "\"Mr. Bean\" is one of the funniest shows ever created. American shows need to be more like the British ones. Rowan Atkinson is a very creative actor and this is the role that he was made to do. Whenever I see a car similar to his' now, I'll just remember it as the best supporting object that's never won an Emmy (sadly). But anyways, everybody should watch this show no matter what. Because of this show, I now have new ways of doing things and such.And last, but not least, is the teddy bear Mr. Bean always carries around. He's another one that should win an Emmy for his performance.So for anybody reading this, go to the nearest video store and buy \"Mr. Bean.\""
    },
    {
      "username": "Barnabasat45",
      "userUrl": "https://www.imdb.com/user/ur1100596",
      "reviewLink": "https://www.imdb.com/review/rw0264883",
      "warningSpoilers": false,
      "date": "15 April 2001",
      "rate": "",
      "helpful": "64 out of 71 found this helpful.",
      "title": "MR.BEAN--A PORTRAIT OF COMEDIC GENIUS",
      "content": "Most Britcom imports that I have seen over the years have always brought laughter. It the mid 90's PBS began running episodes of Mr. Bean. Rowin Atkinson, far better known in the UK and Europe then here in the States, is one of the most talented actors and comedians anywhere. He has to be. To take a character that is normally mute, always plotting mischief, and goes on more hair brained schemes and adventures then the entire Monty Python crew is,as Mr. Bean would put it,\" Absolutely Brilliant\".Even the most hardened sceptic will find this series so overwhelming funny that they would scream for more. Alas, there were only 13 episodes filmed. Rowin Atkinson has stated that he felt there was nothing more for Mr. Bean to do. Too bad. I can see a series, such as this going on for hundreds of episodes.If you want to have a really good time with a wonderfully lovable goof ball, Watch this BBC classic!"
    },
    {
      "username": "Gunn",
      "userUrl": "https://www.imdb.com/user/ur0020866",
      "reviewLink": "https://www.imdb.com/review/rw2020360",
      "warningSpoilers": false,
      "date": "9 February 2009",
      "rate": "10",
      "helpful": "15 out of 16 found this helpful.",
      "title": "One of the Funniest Characters of the 20th Century!",
      "content": "Rowan Atkinson's Mr. Bean ranks right up there with Laurel & Hardy, Buster Keaton, the Marx Brothers and other comedy greats. I have never seen people laugh out loud so heartily and literally fall out of their chairs as when I introduced them to Mr. Bean via my videos and now DVDs. I'll never forget the first time my brother saw him. He was over for a visit and I asked him if he'd ever seen Mr. Bean? \"Who?\" he said. So I got out my video and showed him the one where Mr. Bean is in church and starts to nod off. My brother laughed so hard he fell out of the chair and was holding his stomach from laughing so hard. He became an instant fan of Mr. Bean. We all know how hilarious these episodes are, but the fun is in sharing them with others. I have seen so many people laugh 'til it hurts! Favorite episodes are: the visit of the Queen, the Hotel room stay, late for the Dentist appointment, the Christmas episode (a classic...plus kids love it!) and the New Year Party. Rowan Atkinson is a comic genius!"
    },
    {
      "username": "janqb",
      "userUrl": "https://www.imdb.com/user/ur1748355",
      "reviewLink": "https://www.imdb.com/review/rw0264896",
      "warningSpoilers": false,
      "date": "29 February 2004",
      "rate": "",
      "helpful": "101 out of 116 found this helpful.",
      "title": "Mr. Bean Takes You Away",
      "content": "Many reviewers here compare the Mr. Bean TV series to \"The Simpsons\", \"King of the Hill\", and other comedy shows. Though many shows at times employ slapstick, \"Mr. Bean\" is very different from the majority of these shows and their characters. The most glaring contrast is between what constitutes as humor in \"The Simpsons\" and \"Mr. Bean\". \"The Simpsons\" can sometime present gory themes in an offhanded way (eg, Itchy & Scratchy), making ethically questionable images and situations funny to the audience. The humor in part lies in the blase way in which the characters treat something like murder, torture, etc. However, I don't find that very enjoyable. That is why I applaud Rowan Atkinson for proving that slapstick humor can still be funny without turning murder and torture into light-hearted entertainment. Mr. Bean maintains an innocence that, for me, is a welcomed relief from the harshness of the TV landscape in general. From reality TV shows where participants backstab each other for money to shows like \"South Park\" and \"The Simpsons\" that fuel their comedy with questionable material, TV land can be a harsh place thesedays.Many people may feel that Mr. Bean is childish and foolish, but his is by far a gentler character than many you would meet on TV nowadays. I don't wax nostalgic for shows like \"Leave It to Beaver\" or any of those black and white TV shows where everyone is super cheery and pretend death and homosexuality don't exist. But need we go to the other extreme and portray the world as treacherous, dangerous, and continuously in conflict? Maybe what some people want when they get home from work is to sit down on the couch with a cup of hot cocoa and forget all their problems as they indulge in the foolish yet heartwarming character that is Mr. Bean.Mr. Bean takes you away from your divorcing parents, your backstabbing co-worker, your bills piling up on the table, your annoying household chores, the clogged drain in the kitchen, your sister's frantic wedding plans, and all the depressing murders and robberies on the nightly news. Mr. Bean takes you away from all this for 25 glorious minutes and into his simple-yet-complicated little world where the biggest problem is learning how not to bite off more than you can chew.It is nice to go to a simpler place where problems don't get more complicated than a stuck fly while trying to impress the queen."
    },
    {
      "username": "Jdc102",
      "userUrl": "https://www.imdb.com/user/ur0214643",
      "reviewLink": "https://www.imdb.com/review/rw0264885",
      "warningSpoilers": false,
      "date": "25 July 2001",
      "rate": "",
      "helpful": "45 out of 54 found this helpful.",
      "title": "A truly Hilarious Series",
      "content": "This show is a classic. Rowan Atkinson is so funny in this role, and Mr. Bean is one funny character. This is one show that you can see again and again and still laugh. I only wish they made more of these because they are great."
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5549795",
      "warningSpoilers": false,
      "date": "14 March 2020",
      "rate": "",
      "helpful": "16 out of 20 found this helpful.",
      "title": "A classic, funny series.",
      "content": "Among the few of the classics that lives up to the hype, it may even exceed it, for eventually we all know such a person and don't wish to know more about him or her. 9 June 2019 Mr. Bean Atkinson, as confessed, has been preparing for this role since the very beginning. What started as a time-filling sketch, it is quite an elevation considering what this character; more than the series, has achieved. Rowan Atkinson, the actor and more or less the creator of this global phenomenon, has previously worked in similar arenas in stages, miming, what basically could be considered as a stand up, his appearances have always been about the performance more than the content. And with a physical language that bars no boundaries, this global outreach actually comes with a never-ending clause. Primarily, to Atkinson. Since he could always claim his throne and the blames could easily be passed upon. But filtering or criticizing themselves, the creators have only shot definite amount of these sketchy scenes, in order to maintain the quality. And so pure the material is, that even after decades later, it hasn't gotten rusty yet. And it presumably never will. Since none of these scenarios seem effortful or tedious to the audience, the depicted gags are actually a part of a common man's routine in his day-to-day life. And looking at those activities with an eye of an anarchistic 9 year old boy, Atkinson has managed to embed his name among pioneers like Buster Keaton and Charlie Chaplin. But even something sensational as such, comes with few flaws. Lopping off the editing and execution of this series, the shift of these chapters into one typical sitcom can easily be seen. Running out of ideas and occasionally compromising to the commercial aspect of the fame (Christmas episode), the series loses the subtlety for a brief period. When the neck starts going towards the noose rather than the other way around, that is when Mr. Bean grows simpleton, in a sense that it relies upon nothing but the performer and its inspiringly absurd performance."
    },
    {
      "username": "sashank_kini-1",
      "userUrl": "https://www.imdb.com/user/ur14156875",
      "reviewLink": "https://www.imdb.com/review/rw1840848",
      "warningSpoilers": false,
      "date": "16 March 2008",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "I love beans!",
      "content": "Mr. Bean has always been my favorite. No matte how many times you watch the same thing, the show never gets monotonous or repetitive. Mr. Bean is one of the greatest comedians in the world who doesn't need to even speak to make people laugh. His gestures, his facial expressions and his face itself is so funny to watch. The situations which he faces on the show is simply hilarious and the way he handles them is even greater. There is simply no reason why this show shouldn't receive a 10 because it is fabulous. Its something that would even make the most serious or sad person in the universe laugh. Some of my all time favorites episodes from the show are: 1) When Mr. Bean lodges at a hotel 2) The one where he watches the scary film 3) Mind the baby ( The diaper scene especially). In fact, all the episodes are so good that it is really difficult to criticize the show. Mr.Bean can go to any heights to prove that he is funny, including completely stripping himself in one of the episodes. the way he handled that situation was simply mind blowing. 10 out of 10."
    },
    {
      "username": "Sylviastel",
      "userUrl": "https://www.imdb.com/user/ur0033913",
      "reviewLink": "https://www.imdb.com/review/rw1853103",
      "warningSpoilers": false,
      "date": "6 April 2008",
      "rate": "9",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Almost Brilliant Comedy!",
      "content": "Rowan Atkinson delivers an unforgettable performance as the clueless Mr. Bean who never goes far without his Teddy Bear. The appeal of Mr. Bean is largely his childish behavior and innocence. We don't know if he came from the sky or another planet. He is the kind of strange character that you can't make up quite easily. He is often alone and used to it. He has a hard time communicating through speech which might be why we only hear his grunts at times. There are other characters who speak to him and he responds. The character of Mr. Bean is a mystery and still is. He lives alone and does the unthinkable when he can do the sensible thing. Mr. Bean is rather an odd man out who does not mind it much. He rather live a simple life with his yellow car and teddy bear and hopes to get to work on time."
    },
    {
      "username": "Tamphex",
      "userUrl": "https://www.imdb.com/user/ur16895145",
      "reviewLink": "https://www.imdb.com/review/rw1759292",
      "warningSpoilers": false,
      "date": "6 November 2007",
      "rate": "10",
      "helpful": "17 out of 18 found this helpful.",
      "title": "I honestly can't remember...",
      "content": "...the last time I laughed this much. It's a testament to the talent of Rowan Atkinson that he has managed to create a comic character with several layers and a clearly defined personality - without hardly ever speaking a word. The whole success of the program rests on Atkinson's shoulders, but he carries it with ease. Despite the fact that the show only ran for one season, anyone even vaguely in touch with pop culture recognizes the rubber-faced social 'tard, so great is the talent and effort put into the performance. At times exasperating, at times lovable, Mr Bean is an innocent, unlucky chap who also happens to be evil incarnate. The brilliance of this character cannot be put into words, you have to see for yourself.The show gets almost too depressing at times, like in the infamous New Year's Eve sketch, or when Bean celebrates his birthday by going alone to a restaurant, offering himself a congratulatory card signed by himself, and being served a stake he doesn't quite fancy. Still, there are times when you can't help but feel impressed by the inventive methods by which Bean gets himself out of trouble, like when he disposes of said stake in numerous clever-ish ways, or when he changes into swimming trunks without taking his trousers off first! Whatever your reaction to Bean and his unorthodox lifestyle, you're bound to throw fits of laughter while watching. Finally, I'd like to point out that although \"Bean\" is classified as a program for children, it is just as enjoyable for any grown-up with a sense of humour. Because the more \"adult\" jokes will go over the heads of the little ones and the intelligent slapstick (yes, there is such a thing) is funny no matter what age you are, \"Bean\" is the truest definition of a family show. This is justly a classic and it always brightens up my day."
    },
    {
      "username": "general-melchett",
      "userUrl": "https://www.imdb.com/user/ur11358844",
      "reviewLink": "https://www.imdb.com/review/rw1581471",
      "warningSpoilers": false,
      "date": "24 January 2007",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Bean - one of the best comedy characters ever!",
      "content": "Mr. Bean has shaped the face of British TV comedy. He has proved that you do not need wicked words or wit, a massive budget, a great deal of intelligence or even any intelligence to make something brilliant. And Mr. Bean is one of those characters who you just can't forget. Some of these episodes had me in stitches - yes, they're not realistic at all and they're all pretty stupid, but to be honest, realism is one of the barriers Bean has broken on its way to greatness. Rowan Atkinson and co. always manage to cook up interesting new ideas - and hilarious new gags - remember when Mr. Bean drove his green Mini whilst sitting on a sofa on the roof? Mr. Bean is one of those things that never gets weak - the movie wasn't as good as this, but Bean has introduced a distinct new sense of humour to the world, and kids and adults alike will marvel at its immense fun factor. \"Extras\" and \"Little Britain\" can be damned - this is British comedy at its best and most original. These escapades never get old! 10/10"
    },
    {
      "username": "WeAreLive",
      "userUrl": "https://www.imdb.com/user/ur79460801",
      "reviewLink": "https://www.imdb.com/review/rw4159629",
      "warningSpoilers": false,
      "date": "9 May 2018",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Funniest show ever",
      "content": "I remember when I was about 9 and I really loved watch Mr Bean when I was really. I wasn't born when it was out but I saw reruns on ITV and sometimes Cartoon Network would air it. If you haven't seen this show I am telling you now you are really missing out.If you are looking for a good comedy to watch I would honestly recommend Mr Bean even today."
    },
    {
      "username": "bellino-angelo2014",
      "userUrl": "https://www.imdb.com/user/ur57910549",
      "reviewLink": "https://www.imdb.com/review/rw6114193",
      "warningSpoilers": false,
      "date": "21 September 2020",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Probably the funniest TV show that has ever been made, and it never gets old!",
      "content": "I have always loved MR BEAN, first the cartoons and then the live action version, and I also liked the two movies. And the reason is simple: Rowan Atkinson's physical humour makes everyone laugh because it's so simple and you would always root for him no matter what he does.Here's the formula for the typical MR BEAN episode: Mr Bean wants to do something, but something goes in his way. Then, with his naiveness and brilliance combined, he always succeds. I don't need to explain the situations that happen in the episodes since it's a show known all over the world.If you never saw this TV show before, what are you waiting for? At the first occasion watch it, and only if you are the biggest curmudgeon of all you won't love it!"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2864519",
      "warningSpoilers": false,
      "date": "6 September 2013",
      "rate": "9",
      "helpful": "5 out of 7 found this helpful.",
      "title": "The New Buster Keaton and Charlie Chaplin",
      "content": "Rowan Atkinson has created one of the most original characters in modern times. Ever since the invention of talkies, there have been few iconic silent characters. We had Harpo Marx, but he came with his brothers. This is truly a unique creation.The best thing is that he is not a nice guy. His selfishness is half the fun. His childlike persona contrasts perfectly with his selfish actions.The least appreciated part of Rowan's performance is his physicality. It takes a lot to do so much physical humor and look so easy doing it. In fact, that's the reason that Rowan is unlikely to continue this character as a long term project."
    },
    {
      "username": "callanvass",
      "userUrl": "https://www.imdb.com/user/ur2403537",
      "reviewLink": "https://www.imdb.com/review/rw1143452",
      "warningSpoilers": true,
      "date": "6 August 2005",
      "rate": "10",
      "helpful": "7 out of 10 found this helpful.",
      "title": "One Of My Favorite T.V Shows Of All Time, Rowan Atkinson Is Simply A Genius!, And It's Only Fitting That I Chose This For My 1000 Review!",
      "content": "This is one of my favorite T.V shows of all time, Rowan Atkinson is simply a genius!, and it's only fitting that i chose this to be my 1000 review!. I can't begin to tell you how much i love Mr. Bean he's the man, and what amazes me, is how he gets out of these incredibly difficult situations, and he is always so creative,plus Robyn Driscoll also deserves accolades!, he is also a genius!. My favorite bit that he has done is the Amazing Adventures of Mr. Bean and while all the rest of them are amazing, this remains my true favorite, plus i wish the show didn't stop so soon!. Each episode is brilliantly written, and they were all masterfully directed, plus Each episode is a classic in my eyes!. This show is incredibly popular, and i can definitely see why, as it's quite possibly the funniest show ever. The character actors all played there roles really well, especially Robyn Driscoll and Matilda Ziegler (as Irma). This is one of my favorite T.V shows of all time Rowan Atkinso is simply put a genius and an incredibly talented comedian (possibly the best!), and it's only fitting that i chose this to be my 1000 review f you haven't seen this show , drop what your doing right now and go check it out, you will not regret it trust me it's one of the best T.V shows ever!,and i will continue to watch the show over and over again, i never tire of it!, Mr. Bean Rules!. ***** out of 5"
    },
    {
      "username": "jboothmillard",
      "userUrl": "https://www.imdb.com/user/ur4248714",
      "reviewLink": "https://www.imdb.com/review/rw1082023",
      "warningSpoilers": true,
      "date": "17 May 2005",
      "rate": "10",
      "helpful": "8 out of 14 found this helpful.",
      "title": "Mr. Bean",
      "content": "When I was younger, and today, Mr. Bean is a work of genius. Three-time BAFTA nominated Rowan Atkinson stars as the almost silent (miming) human looking alien dropped onto Earth causing chaos and mischief wherever he goes. He has tried to do an exam, put his pants on in front of blind man (he didn't know he was blind), gone to church, tried to dive at a swimming pool, made lunch on a park bench, seen a scary movie, changed in his car, had a picnic with a fly intruding, spent Christmas with his girlfriend (Matilda Ziegler), looked after a baby in Portsmouth, been to Room 426 of The Queens Hotel in Portsmouth, won a pet contest with his Teddy, driven on top of his Mini on a new chair, and even met and knocked out the Queen. Guests included Rudolph Walker, Richard Briers, Angus Deayton, Nick Hancock from They Think It's All Over, Caroline Quentin, The Day Today's David Schneider, Richard Wilson, The Fast Show's Eryl Maynard and The Vicar of Dibley's Roger Lloyd-Pack. It was nominated the BAFTAs for Best Comedy (Programme or Series) and Best Light Entertainment Programme. Rowan Atkinson was number 18 on The 50 Greatest British Actors, he was number 24 on The Comedians' Comedian, and he was number 8 on Britain's Favourite Comedian. Outstanding!"
    },
    {
      "username": "thebigeasy555",
      "userUrl": "https://www.imdb.com/user/ur6877305",
      "reviewLink": "https://www.imdb.com/review/rw1597227",
      "warningSpoilers": false,
      "date": "12 February 2007",
      "rate": "9",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Pure Comedic Genius",
      "content": "Rowan Atkinson's creation Mr.Bean has stood the test of time and will be forever etched upon the memory of those who viewed it.Living alone and appearing not to have a job of any description Mr.Bean goes around doing day to day activities in a rather comedic fashion.The mistake prone Mr.Bean induces heartfelt laughter when put even in the most simplest situations.Though he barely spoke any coherent words his jovial actions more than made up for this.Even when driving in his beloved Mini Mr.Bean still manages to cause inadvertent chaos.Not very much is known about his background but his ability to draw tears of laughter from the audience at his funny shenanigans is well known.Before he found fame Nick Hancock can be seen in a couple of the episodes"
    },
    {
      "username": "manchester_england2004",
      "userUrl": "https://www.imdb.com/user/ur4407113",
      "reviewLink": "https://www.imdb.com/review/rw2102871",
      "warningSpoilers": false,
      "date": "28 July 2009",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Easily the best British sitcom of the 1990s!",
      "content": "The 1990s was a great decade for British sitcom with many popular creations such as ONE FOOT IN THE GRAVE, ABSOLUTELY FABOULOUS THE THIN BLUE LINE, THE BRITTAS EMPIRE and MEN BEHAVING BADLY arriving onto TV screens for the first time.However, MR. BEAN is, hands down, the greatest sitcom of the 1990s.MR. BEAN represents the first major attempt at a throwback to the era of silent greats such as Charlie Chaplin and Buster Keaton for several decades. It brings to the audience a single character - Mr. Bean - played to perfection by Rowan Atkinson.Many people who have commented on this page as well as on the message boards on this and other websites have engaged in debates about whether or not Mr. Bean has a mental disability or has significant learning difficulties arising from such a disability. However, I believe this debate is unnecessary because I highly doubt that the creators of this show expected anyone in the audience for a single moment to even consider Mr. Bean in such a context.Mr. Bean is shown to be a character who seems to have very few friends, rarely speaks and chooses to solve problems by himself with no guidance from others. Some of his methods to approaching day-to-day tasks such as preparing lunch or going to the dentist are approached in a manner bizarre to anyone watching the show. This is where the humour derives from. Mr. Bean is not necessarily someone with a mental disability, he may just be an eccentric person accustomed to dealing with things his own way. And naturally some of his methods to completing a single task often result in disaster, which we then see Mr. Bean try to resolve.Sometimes, we see Mr. Bean show a mean or petty streak, often trying to compete with those around him or play pranks on those least expecting it. But no real harm comes to anyone at the end of the day and outcomes are always reassuring.Unlike most examples of British comedy in the past 30 years, MR. BEAN is simple, inoffensive, harmless U-rated entertainment suitable for everyone in the family to enjoy. It is for this reason why the TV series became a big hit in dozens of countries throughout the world. It is also why it will still be remembered in several decades from now when lots of other TV shows will have come, gone and been forgotten.Some critics claim the show only appeals to children yet I laugh just as much at Mr. Bean's antics now as I did when I first saw the episodes as a kid in the 1990s. Rowan Atkinson has used his natural ability to create effective visual gags that seem just as funny on repeat viewings as they did the first time.The TV series has to date spawned two spin-off movies, BEAN and MR. BEAN'S HOLIDAY. As one familiar with the type of humour shown in the TV series would expect, it does not translate to success on the big screen. The two movies do little justice to the TV series and fail to truly capture the magic of the episodes. The greatest failing in both movies perhaps resides in the change of setting. In both movies, the producers take Mr. Bean out of his normal British surroundings into America (the first movie) and France (the second movie). As a result, the movie characters around Mr. Bean respond differently to his behaviour than their TV series counterparts. Both movies re-use gags from the TV series, and the evidence shows that the gags were done right the first time. In the second movie, Mr. Bean is shown to be behaving out-of-character with some aspects of his personality exaggerated to the point where some gags seem dumb rather than funny. At various times, I found myself thinking that the character I was watching was not Mr. Bean but a pale caricature. It is clear that Rowan Atkinson was not enjoying himself as much as he did in the TV series. His heart just wasn't in the performance. After the second movie came out, he stated publicly that he would not play Mr. Bean again. I realise how he felt.Returning to the TV series, each episode shows evidence of meticulous planning in terms of writing and execution in every single scene. Even the weakest episode is still highly enjoyable and well ahead of the two movies.My favourite episodes are the first three - these set the high standard that was to continue. I consider the final episode to be the weakest but still hilarious nonetheless.To summarise, MR. BEAN is a truly superb sitcom suitable for all the family. Rowan Atkinson is a true comic genius and the evidence is in the 14 episodes of this TV series. My recommendation - watch and enjoy. But only see the movies if you consider yourself a die-hard fan after seeing the TV series."
    }
  ],
  "errorMessage": ""
}