{
  "imDbId": "tt0988824",
  "title": "Naruto: Shippuden",
  "fullTitle": "Naruto: Shippuden (TV Series 2007–2017)",
  "type": "TVSeries",
  "year": "2007",
  "items": [
    {
      "username": "ououzaza",
      "userUrl": "https://www.imdb.com/user/ur69956152",
      "reviewLink": "https://www.imdb.com/review/rw6042203",
      "warningSpoilers": false,
      "date": "29 August 2020",
      "rate": "9",
      "helpful": "56 out of 69 found this helpful.",
      "title": "It is the greatest anime for me.",
      "content": "I love this anime so much. The story is surprisingly well-planned and everything is just sooo good. Some characters might be neglected but that's tolerable. It's still my favourite anime."
    },
    {
      "username": "hunoldinho",
      "userUrl": "https://www.imdb.com/user/ur23976404",
      "reviewLink": "https://www.imdb.com/review/rw2888269",
      "warningSpoilers": false,
      "date": "16 October 2013",
      "rate": "10",
      "helpful": "210 out of 238 found this helpful.",
      "title": "One of the best animes you can find",
      "content": "This anime has everything. Plot: The story is absolutely beautiful. You have epic fights combined with deep emotions and unpredictable story changes that will blow your mind. The only critique I could find about the story is that in the anime some parts are described in very simple pictures, f.e. after a character pulled a very cunning move within combat, in order to let the younger audience understand what has happened. But then again I wouldn't want them to miss out on this anime just because they feel it is too complex, so I guess one can overlook this. (It doesn't happen too often to be really bothering anyways.) Everything that happens also fits really well into the universe of Naruto, meaning that within this world's reality everything that happens makes sense. It is also amazing to see the different characters evolve and grow both in maturity as well as in strength. I have even caught myself cheering like a total nerd when a character has learned a new move or went over his own boundaries. However, I feel that the side characters are being neglected in terms of development, since they really can't compete with the main character's strength at all after a certain point. Character design:Marvellous. There are dozens of different characters and everyone is unique. Even the side characters have distinguishable features, and the main characters show a character depth that many Hollywood movies could learn from nowadays. Let's take the villain Orochimaru for example. He is easily the most well-designed antagonist I have seen in any motion picture, even in all the books I read I can't find a character like him. Pure evil. Cunning, bizarre and frightening. On top of his unpredictable actions and twisted motives, the music appearing together with him just rounds up the presentation of this character, and to me, makes it unforgettable. Music:It's pretty simple: The music in Naruto is incredible. When I showed some of the tracks to a friend who doesn't watch it, even she was amazed. If you don't believe me go to youtube and check some of them out, but be careful, it might lead to you watching the whole series if you haven't already! Animation:They did an amazing job animating Naruto. It's really beautiful to see how everything comes to life after reading the manga in black and white, and the animation of Naruto can compete with most recent animated movies. Many scenes are animated so well that you just want to watch them over and over again, especially some of the fights where the graphics and \"camera angles\" really come to shine. All together, I would give it a 10/10 currently, as the overall experience with this show has simply blown me away and I can't really find anything really bad to say about it."
    },
    {
      "username": "achyutha037",
      "userUrl": "https://www.imdb.com/user/ur24589038",
      "reviewLink": "https://www.imdb.com/review/rw2599015",
      "warningSpoilers": false,
      "date": "19 April 2012",
      "rate": "10",
      "helpful": "227 out of 266 found this helpful.",
      "title": "The Best Anime Show; Best Music; and Best characters",
      "content": "Before Naruto, i was a die-hard fan of Dragon Ball series. I thought no anime would be as great as it is. There are Many people who still consider it to be superior of all anime shows. But In front of Naruto Shippuden, nothing is better.Naruto was good, but it aimed for children and +. But the sequel Shippuden, has aimed for Universal Audience. Naruto has grown more mature, and he is not always running behind Sakura. In this series you'll get to know more about the characters past, especially Naruto. The Antagonists are more deadly and powerful. The series has some HEART WRENCHING MOMENTS in it. I had to see them at least 100 times per day. In certain scenes, i almost cried. Major Plus point is the Background Music. It is OUTSTANDING. No anime had/had this type of Music. I admit that certain Filler episodes are just boring, but they always carry certain TYPE of message with them. This anime is the GOD of all anime's and NO other anime will ever defeat it.... No.1 anime.I give it a solid 10/10..."
    },
    {
      "username": "Mappers-Buckles",
      "userUrl": "https://www.imdb.com/user/ur125669761",
      "reviewLink": "https://www.imdb.com/review/rw6344641",
      "warningSpoilers": true,
      "date": "7 December 2020",
      "rate": "9",
      "helpful": "43 out of 49 found this helpful.",
      "title": "A good anime, but.....",
      "content": "This anime in my opinion is one of the best animes in history, it has an incredible animation, incredible story, very good soundtrack and concepts that keep you in the plot, the only problem I see is that they add unnecessary things, in other words: Stuffing. This series would be perfect if writers didn't have the need to do things that didn't add emotion to the plot or would be easily forgotten, if the filling chapters weren't in this series was very good. Still side of all that this series is amazing, especially in the ninja war."
    },
    {
      "username": "Felfo",
      "userUrl": "https://www.imdb.com/user/ur5056082",
      "reviewLink": "https://www.imdb.com/review/rw1653327",
      "warningSpoilers": false,
      "date": "10 May 2007",
      "rate": "10",
      "helpful": "138 out of 170 found this helpful.",
      "title": "3 years passed since the original series, Naruto now is more mature and has learned new techniques",
      "content": "\"Naruto: Shippûden\" keeps up with the original series. With a bigger budget now, the drawings and effects are improved, music once again is excellent, so the quality of the overall product is impeccable. As for the story itself: Naruto comes back from his training with Jiraiya (one of the legendary ninjas) and has grown, so he is more mature after those 3 years. Now we get to see the old characters again, so finally all that time expecting with the \"filler saga\" has come to and end, this is the original Naruto, the hero's come-back. Sasuke Uchiha, Kakashi Hatake, Sakura Haruno, Tsunade etc., are all back. All the things we liked from the original series are here and we will get to know what happens with all the story arcs we love, Specially what happens with Sasuke."
    },
    {
      "username": "deepakputhraya",
      "userUrl": "https://www.imdb.com/user/ur26037173",
      "reviewLink": "https://www.imdb.com/review/rw2452295",
      "warningSpoilers": false,
      "date": "2 July 2011",
      "rate": "9",
      "helpful": "117 out of 145 found this helpful.",
      "title": "I just can't believe there is a anime as interesting and amazing as this...",
      "content": "This is one of the best anime I have seen so far. The plot is brilliant like the previous one. The animation is much better than the previous one and the dialogues are simply amazing. The battle scenes and the way Naruto and the rest come up with tactics are marvellous. The new characters are 'awesome'(can't think of a better word). There are loads of emotional moments in this series, some that make you laugh, some that make you angry and some that make you cry.I'll warn you, you'll get angry on some of the characters so much that you'll bite your nails till it starts bleeding and you wont realise it(or you might)! The thing that bothers me the most(which will bother you too) is there is only one new episode that releases every week and I just can't wait for the next episode! I am up-to date with both the manga and the episodes, and it seems like a million years from now that they'll finish the episodes(at this rate). I wish I could get a time machine!(you'll wish too!(very soon))Just watch it if you have watched Naruto because you will miss the best and exiting parts of this anime.There are loads of surprises and loads of excitement waiting for you.On the whole I'd say Naruto: 8.5/10 Naruto Shippuden: 9.5/10"
    },
    {
      "username": "vks_vishwa",
      "userUrl": "https://www.imdb.com/user/ur13998624",
      "reviewLink": "https://www.imdb.com/review/rw2907998",
      "warningSpoilers": false,
      "date": "19 November 2013",
      "rate": "10",
      "helpful": "45 out of 57 found this helpful.",
      "title": "Amazing Sequel",
      "content": "Its a great and amazing story to be seen. An outstanding feeling to view the characters, their lives, emotions, decisions, etc. The whole story as suggested, revolves around the main character Naruto. Shippuden means hurricane, that symbolizes the strength Naruto gains over the years of training. He is supported various friends, teachers and other characters who are even strangers to him. Being an underdog in the early years, desperate to be recognized, works harder than anyone. Due to certain internal powers, he creates magic every time, he is tested. By deeds, he shows the others the way to be chosen i.e., not by tradition, etc. but by your heart. Even the psychology behind the friends' behavior, enemy behaviors are explained in such a simple and emotional manner that you also believe that these things are bound to happen even with you in the given situation. With action packed animations, stories & bonding, the series distinguishes itself with others."
    },
    {
      "username": "bumblesquirt",
      "userUrl": "https://www.imdb.com/user/ur43010619",
      "reviewLink": "https://www.imdb.com/review/rw2788615",
      "warningSpoilers": false,
      "date": "27 April 2013",
      "rate": "10",
      "helpful": "96 out of 112 found this helpful.",
      "title": "An incredibly diverse and gripping story with unparalleled character development",
      "content": "Had to add a review since some of them I read were quite frankly ridiculous.The story continues were it left off and takes no time at all in getting right into it. It then goes on to get better and better and better. Character growth, development and change is incomparable to any other manga/story/book you will ever read, with some serious plot twists while constantly offering reasoning and back story completely justifying them all. Reviews down rating due to fillers is ridiculous, obviously the studio and channels need to make money and fill air time, and obviously 1 manga is not as long as 1 anime, common sense should then counter any grudge held due to fillers. Other reviews stating it's gone on for too long or stories/characters are being recycled - I wont go into too much explanation on flawing this review, it's so far off the mark all I need say is this individual has clearly not understood the intricate's of the characters and the history. In summary it's my opinion that Naruto is one of the most epic and dynamic stories to exist to this date. It is not anything like DBZ or similar 'OP Powaz anime'. Though it does have a large emphasis on fighting, Naruto is primarily about characters and story. It is a must watch AND a must read to everyone with above average intelligence. Others will enjoy it immensely too, but without a doubt the more intelligent you are the more you will enjoy it."
    },
    {
      "username": "grip31-747-460214",
      "userUrl": "https://www.imdb.com/user/ur45343888",
      "reviewLink": "https://www.imdb.com/review/rw2838247",
      "warningSpoilers": false,
      "date": "24 July 2013",
      "rate": "10",
      "helpful": "87 out of 103 found this helpful.",
      "title": "Genuinely AMAZINGGG!!!!",
      "content": "I had to make an account just to write a review about this show. I feel an 8.1 is an outrage because Naruto is just something so special.I use the term genuinely amazing to describe it because it honestly manages to amaze me at every turn, not just because of the crazy things that happen or the fighting or the the deeply complex story, but because of a subtle touch in all those things. Every time i get comfortable with what's going on it just puts me on another ride i didn't even imagine, even the portions of the story where i can predict something it somehow manages to surprise me still. The \"number one at surprising people\" motto is a perfect way to describe Naruto as a character but more importantly as a show.So many amazing characters with such interesting back stories, every fight is so well thought out you don't know how the next one will top it, music is beautiful and spot onn, but i think the best part of it is the story. It incorporates such dark themes, discrimination in a world where everyone actually isn't equal, and how the characters deal with each other with so many different powers and abilities, is almost overwhelming.I could go on and on but i'm gonna stop now and just say SKIP THE FILLERS. It's really not that hard, just google it and skip those episodes. They are probably the sole reason the ratings aren't as high as they should be, and they just totally dilute the amazingness of the real story."
    },
    {
      "username": "Cafelar",
      "userUrl": "https://www.imdb.com/user/ur94986533",
      "reviewLink": "https://www.imdb.com/review/rw5624160",
      "warningSpoilers": false,
      "date": "9 April 2020",
      "rate": "7",
      "helpful": "10 out of 12 found this helpful.",
      "title": "Dissonant",
      "content": "It inherits some fun from the child Naruto, creates incredible expectations and has breathtaking fights, but ends in a hurried and somewhat disappointing way.It is worth watching, but some episodes and the final fight can be skipped without regret."
    },
    {
      "username": "thomasjay-2201",
      "userUrl": "https://www.imdb.com/user/ur68612934",
      "reviewLink": "https://www.imdb.com/review/rw4232062",
      "warningSpoilers": false,
      "date": "9 July 2018",
      "rate": "10",
      "helpful": "21 out of 31 found this helpful.",
      "title": "Long Form storytelling at its finest",
      "content": "An absolute masterpiece for the very first episode of the initial series Shippuden and its later setting is one of the ways the \"brand\" has had such a period of success giving compelling characters and arcs as well as showing perfectly the growth of many of the individuals that create the cast. For all it's flaws (particularly related to pacing and filler) there's a thousand reasons which solidify the shows status as a deserving modern classic amongst the greatest of all time"
    },
    {
      "username": "playstrong",
      "userUrl": "https://www.imdb.com/user/ur53164859",
      "reviewLink": "https://www.imdb.com/review/rw5523072",
      "warningSpoilers": false,
      "date": "2 March 2020",
      "rate": "8",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Fighting with fillers never stops! If you win that fight, you will see amazing series.",
      "content": "Just fed up with fillers, quit so many times watching this series. Back in 2011 I had to stop so many times because there were 1 manga canon episode on 4 fillers. Now, almost 9 years later when I can skip all that crap, feeling is amazing! High quality production, amazing emotions, deep story, characters that bind with your soul, amazing! Skip fillers and its 10/10"
    },
    {
      "username": "renoz88",
      "userUrl": "https://www.imdb.com/user/ur32221128",
      "reviewLink": "https://www.imdb.com/review/rw5227285",
      "warningSpoilers": false,
      "date": "1 November 2019",
      "rate": "10",
      "helpful": "54 out of 61 found this helpful.",
      "title": "Pure gold!",
      "content": "I'm sitting here hollow and sad that there is no more episodes! To be honest, I cried at the END! Without the best anime overall! It had everything! (And I've seen a few!)Wish I could forget everything I SEE the show again for the first time!"
    },
    {
      "username": "djalildjodjo",
      "userUrl": "https://www.imdb.com/user/ur77183071",
      "reviewLink": "https://www.imdb.com/review/rw5291203",
      "warningSpoilers": false,
      "date": "30 November 2019",
      "rate": "10",
      "helpful": "11 out of 14 found this helpful.",
      "title": "The real art is Naruto",
      "content": "In fact the writer created in the story, it is an integrated story in terms of events with the addition of drama with a little comedy, even the episodes of the filler was fun for me not all but most, in this anime you can not hate any of the characters"
    },
    {
      "username": "Sibi_5181",
      "userUrl": "https://www.imdb.com/user/ur67026002",
      "reviewLink": "https://www.imdb.com/review/rw3692421",
      "warningSpoilers": false,
      "date": "24 April 2017",
      "rate": "10",
      "helpful": "18 out of 26 found this helpful.",
      "title": "Lots of Motivation and emotional Scenes! (No Spoilers)",
      "content": "It's a mistake that i didn't watch this anime when i was child.... Such a beautiful anime with various characters, all characters were shown importance instead of protagonist alone! Each and every scene was perfect according to the Manga! Some fillers were great to watch too! You guys must watch if you haven't! It'll change your way of thinking towards our humanity with those motivations given on this anime. Cheers! :)"
    },
    {
      "username": "akalankapagoda",
      "userUrl": "https://www.imdb.com/user/ur34104715",
      "reviewLink": "https://www.imdb.com/review/rw3084544",
      "warningSpoilers": false,
      "date": "10 September 2014",
      "rate": "10",
      "helpful": "109 out of 129 found this helpful.",
      "title": "The Best Anime for the Mind",
      "content": "Well the story starts with typical story start lines introducing us to the Naruto universe telling us the story of a boy. Whoa but when it goes on it completely turns into a thrilling nail-biting, heart-touching, mind-teasing epic series taking us deep into humanity through the imaginative Naruto universe questioning our view on the world and people.This was one of the most influential stories I have ever witnessed. I wanted more, so I looked for best anime around to see if I can find something even better. What I found was, most of the other anime are bound around power, adrenaline rush, love and sacrifice, .etc . But in Naruto, apart from the all the things that I mentioned above it mainly focuses on what humanity is, where can it go wrong and what it might take to fix it.That being said, don't misunderstand, the battles are epic. When I mean epic, I mean EPIC!!! For me the best part is, no matter how powerful opponents are, the one with the sharp mind comes on top with mind-blowing strategies. For nerds who watch Anime like me, this is the best part.And oh! to see the maturity of the characters in the series from the childhood of being total knuckleheads to genuinely matured full fledged Shinobi(Ninja) is surely an amazing journey to take. One which must not be missed by the genuine minds around the globe."
    },
    {
      "username": "debpramanik",
      "userUrl": "https://www.imdb.com/user/ur98875976",
      "reviewLink": "https://www.imdb.com/review/rw6638289",
      "warningSpoilers": false,
      "date": "26 February 2021",
      "rate": "10",
      "helpful": "16 out of 20 found this helpful.",
      "title": "Cannot be rated",
      "content": "Somethings can't be rated, Naruto is one of them, Thank you for everything."
    },
    {
      "username": "molobelalesedi",
      "userUrl": "https://www.imdb.com/user/ur142379856",
      "reviewLink": "https://www.imdb.com/review/rw7530283",
      "warningSpoilers": false,
      "date": "9 November 2021",
      "rate": "6",
      "helpful": "12 out of 17 found this helpful.",
      "title": "Filler episodes, the series",
      "content": "This series has a nice array of villains. My only grievance with it is that it is full of filler episodes. That is what annoys me.Naruto and Sasuke are rivals . Both having sad and tragic backgrounds.The Pain arc and the Itachi Uchiha Arc are my best and highlights of this series. That alone makes it worth watching.Prepare to shed a tear and have Itachi school you in philosophy."
    },
    {
      "username": "the_rocker-1",
      "userUrl": "https://www.imdb.com/user/ur17314501",
      "reviewLink": "https://www.imdb.com/review/rw2284063",
      "warningSpoilers": false,
      "date": "23 July 2010",
      "rate": "9",
      "helpful": "75 out of 93 found this helpful.",
      "title": "Starts of alright..but afterwards it becomes amazing...this anime is a must see !!!",
      "content": "I wrote this review because there was no updated review on IMDb.The first of Naruo Shippuden three seasons were alright they weren't bad but also they weren't that good They dragged the story too much the pacing was slow and by slow I mean really slow ,the battle scenes took several episodes where they can be done with one or two and that almost killed the show ,it's too bad because the story and the characters and very interesting. But after season 3 the anime improve in every aspect the no more slow paced story, spaced battles everything gets better animation, action scenes, sound track and especially the story , I mean it's like it's a totally different anime from what it's started(in a good way of curse) and up till now it keeps getting better and better.Story: The story have humor, action ,tragedy , romance and twists in it and the anime present it so well it makes it worth your while to bear with the first three seasons and some fillers here and there(which are not that bad).In case of characters: most of characters are well designed and easy to relate to ,even some of the Villains ,every characters is unique in his/her own way and have depth.The animations are good...not the best out there but pretty decent for a TV series.Sound track is amazing and fits well in the scenes especially the fighting scenes.So eventually if you are a Naruto fan, you can't miss this anime, it started not that good but it became one of the best anime I've watched. I gave it 9/10 despite the disappointing slow paced first three seasons (~70 episodes)because afterward it gets so good that it covers it up the mess in the first 3 seasons."
    },
    {
      "username": "shubhammrt",
      "userUrl": "https://www.imdb.com/user/ur89574431",
      "reviewLink": "https://www.imdb.com/review/rw6544346",
      "warningSpoilers": false,
      "date": "30 January 2021",
      "rate": "10",
      "helpful": "9 out of 12 found this helpful.",
      "title": "MASTERPIECE!!!",
      "content": "Simply Just avoide fillers , some are really good but for binge watchers like me it could be sometime boring so you can always watch them at the end. This anime is lengthy that's for sure but it's worth your time so just go for it."
    },
    {
      "username": "blackmamba99971",
      "userUrl": "https://www.imdb.com/user/ur18437585",
      "reviewLink": "https://www.imdb.com/review/rw2566753",
      "warningSpoilers": true,
      "date": "16 February 2012",
      "rate": "10",
      "helpful": "18 out of 33 found this helpful.",
      "title": "He's grown up",
      "content": "Naruto, a simple, sometimes daft, but very caring person who would give his life to save his friends. This series I have watched from the beginning, to see this little guy turn into a full blown shin-obi in such little time. Now he is learning to use his inner demon called the nine tailed fox. A demon which was sealed into his body when he was a baby by his father to save the hidden leaf village, and also, so other shin-obi nations could not attain the power within. Yet as he grew up, he was ostracized by his own people, and classmates when he entered the shin-obi academy. Looked on as simply the class clown because of his continuous pranks, he felt alone with no one to guide him. However through his antics, he still felt close to his fellow classmates because of it. But would always go home alone to an empty house. Through out his life, his education basically sucked for bad grades. But always seemed to become something of an enigma because of his strong desire to help others. Thus starts him on his path to become the next Hokage of the leaf. Now in the present, he is seventeen years old. And learning to delve deeper into his own soul to overtake and control the nine tailed fox within. With this new powerful weapon, he can have the advantage against a long time rival ex classmate named Sasuke Uchiha. A person who has gone beyond evil in his attempts to destroy the hidden leaf at any cost. Naruto with his friends defeated a section of a group called the Akatsuki. A group of powerful members who have been more than a handful for the leaf. Including one which completely levelled the leaf with one strike. As rebuilding of the leaf started, Naruto then discovers through help of some strange looking sage frogs, that he can attain full control over his Demon. But to do so, would mean to beat his other evil half. With his victory in hand, he now becomes a new transformed man, from a simple shin-obi to a sage, and soon to be Hokage in the near future. His powers grow even more now than ever since his battles within in soul. With his close friends, teachers, Tsunade, and past masters who helped him become a true shin-obi, Naruto is now on the verge of clashing with Sasuke once again. Whether or not he defeats his foe, he simply will not allow Sasuke to hurt those he loves. Especially Sakura. This is a great series, lots of fights, comedy, great music, laughs, sadness, and the ability to show what family is all about. Even though he grew up without parents, he still has more than his share of family within the hidden leaf. Recommended for all to watch, quite possibly the most successful series next to bleach and one piece, and now among the top three to be the longest running anime series to date."
    },
    {
      "username": "TheOneThatYouWanted",
      "userUrl": "https://www.imdb.com/user/ur52600820",
      "reviewLink": "https://www.imdb.com/review/rw3583113",
      "warningSpoilers": false,
      "date": "19 November 2016",
      "rate": "8",
      "helpful": "15 out of 28 found this helpful.",
      "title": "The end is near............. or not? Who cares, it is over",
      "content": "It is an end of an era, more or less. Bravo, they did a great job ending it, even though they still haven't really ended it. Well, I stopped watching so it ended for me. Seriously, the guys behind Naruto should just end it. Baruto looks promising but give us a break already, stop milking beloved franchises into the ground. Dragonball Super made a joke out of the DBZ universe and Baruto could do just the same thing to Naruto. Anyway, if you are planning on watching this series or watching it again then I recommend doing what I did, skipping all of the filler episodes. Seriously, a fillerless viewing of this show is literally animated art as far as I am concerned."
    },
    {
      "username": "badassarcher",
      "userUrl": "https://www.imdb.com/user/ur51735068",
      "reviewLink": "https://www.imdb.com/review/rw5194722",
      "warningSpoilers": false,
      "date": "17 October 2019",
      "rate": "9",
      "helpful": "14 out of 19 found this helpful.",
      "title": "\" When a man learns to love, he must bear the risk of hatred \"",
      "content": "In my opinion, the quote above ( said by a character in the anime ) represents what the main theme of Naruto is about, the duality of man, the blurred lines between love and hatred, good and evil ...Naruto is the telling of a human story in a well crafted ninja universe , where every character is complex, has motives and goals and is shaped by them. The reason why I like Naruto is because it's emotionnally impactful, unlike most Shonen anime where epic battles and overpowered enemies are the main concern , this anime is so beautiful , sad , heartbreaking at times , funny , happy , in other words , expect to feel a bunch of emotions when watching this masterpiece .Without spoiling anything , I think Naruto is the only anime where I understand the villains , they're not just some one dimensional character who wants to wreak havoc because why not, the villains here are deeply flawed characters who are products of a dysfunctional world and who want to do good in their own weird yet understandable way , which makes you wonder if they're evil at all or just doing what they're determined to do .This anime contains so many powerful quotes , philosophical themes , and life lessons for everyone whether you're a 10 or 40 y.o, it's going to impact you no matter your beliefs, background and ideologies .The music is a crucial element in modern storytelling , and this anime is a perfect example on how to elevate a story through music , be it a sad scene , a fight scene , I always find myself enjoying the music .Naruto will always have a special place in my heart because I started watching it as a kid and finished it when I became an adult , so it has accompanied me during my own journey through life and its hardships .Anyway I can't recommend this anime enough , it's a masterpiece , a human achievement that I will definitely pass on to the next generation because it's timeless ."
    },
    {
      "username": "ritonobono",
      "userUrl": "https://www.imdb.com/user/ur62640835",
      "reviewLink": "https://www.imdb.com/review/rw3346148",
      "warningSpoilers": false,
      "date": "30 October 2015",
      "rate": "6",
      "helpful": "10 out of 15 found this helpful.",
      "title": "Too many damn fillers...",
      "content": "Okay, it's gotten ridiculous. The amount of fillers in this anime is through the roof. Not only that, but the action sequences in this anime are so over the top it lessens the impact on me and since each fight is so stretched out it makes you almost beg for the fight to end. Honestly, Naruto hasn't changed much. He's gotten stupider and his voice has for some reason gotten more irksome. Sakura isn't much better than before. The only major difference is that she can heal people now (big deal...pfft). You'd think after a while they'd have learned something, but the series is mostly something retarded happens, we get a filler, another dumb arc, filler, etc. It's lost it's edge, I honestly think this series should just be put down, it's lasted long enough and it needs to end!"
    },
    {
      "username": "anuraganurag",
      "userUrl": "https://www.imdb.com/user/ur39872358",
      "reviewLink": "https://www.imdb.com/review/rw3361994",
      "warningSpoilers": true,
      "date": "27 November 2015",
      "rate": "10",
      "helpful": "27 out of 34 found this helpful.",
      "title": "motivating and a life changer",
      "content": "I was very skeptic about watching an anime even though my friends recommended it. i was busy in watching some other serials. then one day i watched one of its most emotional scenes (naruto meeting his mom for the first time). even though i didn't know the history of any of the characters, still it made me cry. but, it was this scene that forced me to watch the entire naruto and naruto shippuden . i recently completed watching the whole series for the 3rd time and i think i will watch it again for the 4th time. its not just a regular anime its a life changing experience. you would be able to see characters being shaped, morals being established, the bond of friendship being forged and experience the will of fire.music is addictive, sweet, emotional, and the best among all the other anime i have watched.fillers make the show a little slow, you may skip the fillers but some fillers are awesome too. if you have not watched it yet, you have no idea what you are missing. watch it immediately."
    }
  ],
  "errorMessage": ""
}