{
  "imDbId": "tt0804503",
  "title": "Mad Men",
  "fullTitle": "Mad Men (TV Series 2007–2015)",
  "type": "TVSeries",
  "year": "2007",
  "items": [
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8192071",
      "warningSpoilers": false,
      "date": "31 May 2022",
      "rate": "9",
      "helpful": "64 out of 65 found this helpful.",
      "title": "Brilliant!!",
      "content": "Mad Men was such a terrific show that is absolutely just as good as everyone says it is. I never watched it when it was originally on but after hearing so many great things about it I finally gave it a chance and streamed it. I was blown away but how much I loved it. There's a reason it won so many awards when it was on...because it's terrific! The acting, writing, directing, production, attention to detail, etc are all among the best in television history! I can see why some people may not like it because it does starts off a little slow but give it a few episodes because it absolutely pays off and then you won't want to stop watching it until you binge the entire series!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8575517",
      "warningSpoilers": false,
      "date": "29 September 2022",
      "rate": "9",
      "helpful": "44 out of 45 found this helpful.",
      "title": "As good as everyone says!",
      "content": "There's a reason Mad Men won so many awards when it was on...because it's terrific. I never watched it when it was originally on but after hearing so many great things about it I finally gave it a chance and streamed it. I was blown away but how much I loved it.! The acting, writing, directing, production, attention to detail, etc are all among the best in television history! Mad Men was such a terrific show that is just as good as everyone says it is. I can see why some people may not like it because it does starts off a little slow but give it a few episodes because it absolutely pays off and then you won't want to stop watching it until you binge the entire series."
    },
    {
      "username": "nansjune",
      "userUrl": "https://www.imdb.com/user/ur105944460",
      "reviewLink": "https://www.imdb.com/review/rw8768724",
      "warningSpoilers": false,
      "date": "31 December 2022",
      "rate": "10",
      "helpful": "19 out of 19 found this helpful.",
      "title": "Perfection, cultural phenomenon",
      "content": "Essentially mad men is a soap opera, a really really good soap opera. Everything about the show is an absolute joy. The writing is amongst the top ten of any TV show ever. The acting is flawless.I particularly enjoyed the social commentary. Watching the out of date attitudes, mores, habits, niceties and not so niceties it makes you to look at your own time with more criticality. The world of mad men is both better and worse than today and helps show you why.For generation X'ers and millennials without a conscripted war, the odious modern office is their D-day, Vietnam, or Korea and mad men is their M. A. S. H."
    },
    {
      "username": "Instant_Palmer",
      "userUrl": "https://www.imdb.com/user/ur39322316",
      "reviewLink": "https://www.imdb.com/review/rw3307440",
      "warningSpoilers": false,
      "date": "30 August 2015",
      "rate": "10",
      "helpful": "132 out of 154 found this helpful.",
      "title": "The journey is a most interesting one in Don Draper's Universe 💯",
      "content": "The journey is a most interesting one in Don Draper's universe that occupies a time (1960s) in American culture when changes occurred in warp speed. No Pollyanna view of the world, 'Mad Men' explores the full spectrum of human relationships, personality types, and emotions.The show's creator Matthew Weiner (previously executive producer/writer of 'The Sopranos') takes viewers on a high-ball roller coaster of human experiences that explore pursuit of bliss, the depths of where one can go, and the winding roads of inner angst one must often travel.'Mad Men' is the ultimate ensemble drama series with grown-up adult themes that drill deep into the human psyche and often self-destructive behavior patterns of the 1960s post-WWII Greatest Generation that populated the high-flying, high-pressure Madison Avenue ad agencies.Those ad agencies created the culturally iconic images cast through television, radio and print media during that turbulent, mass-consumption decade in American society, when Baby Boomers started taking over the reigns of influence in America, much of it in conflict with Greatest Gen thinking.There is nothing low key about 'Mad Men'. Tension and conflict is layered throughout the series. Weiner covers a lot of territory of the human experience that exists inside complex personalities and their relationships, and the intense emotions that often accompany them.As it stands now, \"YES\", 'Mad Men' is the best TV drama series of all-time; I don't believe there is even a close second.The show received 4 consecutive \"Outstanding Drama Series\" Emmys (21 total Emmy wins out of 116 nominations) to close out it's relatively brief pre-determined tenure of 7 seasons.Those who have seen every episode in sequence, experience a level of high-quality TV viewing that sets the bar to the pinnacle, and rivals the best theatrical movies in production, casting, acting, and story-telling.Matthew Weiner's unique concept alone puts it into a must-try category.For those who have seen the entire series, it is even better the second, third time around (and one gains value in more rapid linear viewing, rather than having to wait months to see the next season, or a week to watch the next episode).Marathon binge-viewing of consecutive episodes can be exhausting, but the series' irresistible gravitational force inevitably draws you back into the center of Draper's universe to watch the next episode - You just can't look away.View 'Mad Men' from episode one, season one. The trip is well worth the time.👍👍"
    },
    {
      "username": "killercola",
      "userUrl": "https://www.imdb.com/user/ur131769494",
      "reviewLink": "https://www.imdb.com/review/rw7947885",
      "warningSpoilers": false,
      "date": "13 March 2022",
      "rate": "10",
      "helpful": "28 out of 30 found this helpful.",
      "title": "Remarkable",
      "content": "One of the greatest shows ever made. The Sopranos, The Wire, Breaking Bad, Better Call Saul, Game of Thrones, Mad Men. That's it. That's the list. If you haven't watched this show you're missing one of the absolute best shows ever made. Top notch acting, costume design, writing, acting, period piece. Watch it."
    },
    {
      "username": "ben-mckimm",
      "userUrl": "https://www.imdb.com/user/ur33572331",
      "reviewLink": "https://www.imdb.com/review/rw8445747",
      "warningSpoilers": false,
      "date": "14 August 2022",
      "rate": "9",
      "helpful": "30 out of 33 found this helpful.",
      "title": "Wow",
      "content": "I'm not easy to please with TV shows. I find typical TV writing tropes to be intolerable so when I say something is brilliant, it's high praise. I tried to watch mad men a couple of years ago but couldn't make it past a few episodes but I decided to give it another try recently and it's absolutely blown me away.It's so realistic in it's portrayal of human beings that I can imagine lots of people feels it's poorly written. There are no real villains, no heroes, no outlandish twists... It's just humans being naturally complicated. There are times when you emphasise with everyone and then othere where you can't stand them.I almost fell out of love with it during season 6 but they pulled it out of the bag for season 7."
    },
    {
      "username": "bekiwij",
      "userUrl": "https://www.imdb.com/user/ur147603133",
      "reviewLink": "https://www.imdb.com/review/rw8137764",
      "warningSpoilers": false,
      "date": "13 May 2022",
      "rate": "10",
      "helpful": "20 out of 21 found this helpful.",
      "title": "Captivating",
      "content": "I loved the show. It was not the kind of show I would watch normally but I don't regret it. This show covers a lot of issues we had in the society Back in the day. How things changed ! Beauty standards. Marriage and Infidelity. Drug abuse. Smoking and drinking while pregnant. Unwanted Abandoned kids and the consequences of unnecessary social pressure to live up to the standards. Most importantly how life changes , people mature and finding the true purpose of their lives!Loved it! I highly recommend it to anyone who loves drama !"
    },
    {
      "username": "atinkerer",
      "userUrl": "https://www.imdb.com/user/ur12297519",
      "reviewLink": "https://www.imdb.com/review/rw8660149",
      "warningSpoilers": false,
      "date": "6 November 2022",
      "rate": "9",
      "helpful": "26 out of 26 found this helpful.",
      "title": "\"You're Born Alone, And You Die Alone\" - Don Draper",
      "content": "The central character in this show is a deeply damaged man called Don. He has a strong survival instinct, but he's incapable of loving or even trusting. He is running scared. He compensates for his insecurity and emptiness by pursuing primal things that soothing his ego. He has to feel that he's in control, even though he's living on the edge. He tries to be the \"Alpha Male\" conquering all around him. In reality, he is a juggler about to drop all the balls.The others in this show are complex human beings whose characters dictate how their lives evolve and ultimately end up.One interesting character that you follow throughout the series is Peggy. She enters the world of advertising as a total innocent, but as the show progresses, you'll see her become a worldly and powerful business woman.The show is full of examples of the attitudes and mindset of the 1960s. The type writer was designed \"so even a woman can learn how to use it\". Everybody smokes, a lot. It's ok for kids to play with plastic bags over their heads. Women are treated in a way that would surely be considered sexual harassment in today's world. These unacceptable things jump out at you and startle you, and give you a flavor of that era.The show was a hit for a reason. It's very good!"
    },
    {
      "username": "thejdrage",
      "userUrl": "https://www.imdb.com/user/ur131092653",
      "reviewLink": "https://www.imdb.com/review/rw7686258",
      "warningSpoilers": false,
      "date": "26 December 2021",
      "rate": "10",
      "helpful": "13 out of 14 found this helpful.",
      "title": "I just want to know how this could not be a 10",
      "content": "When I saw the 8.5, I had to comment on why it wasn't a 10. Holy crap! Come on people! Talk about a series that sucked us in and had us always wanting more!!! Well, it as a 10 in my book."
    },
    {
      "username": "crewbie",
      "userUrl": "https://www.imdb.com/user/ur7194274",
      "reviewLink": "https://www.imdb.com/review/rw2121359",
      "warningSpoilers": false,
      "date": "3 September 2009",
      "rate": "9",
      "helpful": "426 out of 501 found this helpful.",
      "title": "Start from the beginning - you wouldn't watch a foreign film without subtitles, would you?",
      "content": "The brilliance is all in the subtext. There are many hilarious moments that are only funny if you've been paying attention and understand where the character is coming from. There are also many tragic moments that would pass you by if you didn't know what came before. Many lines have double or even triple meanings. Watch this from the beginning, with a friend. Believe me, you will want to discuss each episode afterward to figure out some of the nuances of what happened.The main Mad Man is the confident womanizer Don Draper, who is head of the Creative department at a mid-sized ad agency in 1960s Madison Avenue. I admit, at first I kind of hated him, but as the viewer learns more about him and his past, I learned to - not love him exactly - but like him and want to watch him endlessly. He is a complicated character who can be a very good man, but also a very bad man.Don Draper is joined by a rich cast of supporting characters, many of whom deserve a show of their own: The ambitious young Campbell who is utterly sleazy most of the time, but has occasional moments of growth and even cuteness.Peggy Olson starts out as Draper's secretary, but her growth into a strong, confident woman mirrors what is happening for Woman in the 60's. Silver fox Stirling - he may be morally bankrupt but gets some of the best lines. I could go on . . .The 60's clothes, hairstyles, decor, and current events provide an interesting backdrop for what is essentially a character piece. The setting provides both the occasional laugh (cigarettes being advertised as \"healthy\") and the more than occasional cringe (how could dumping trash from a picnic in the park right on the grass ever seem okay?!).If you need fast-paced action or a laugh track, this definitely isn't the show for you. But, if you like character development and subtlety in your television shows, rent the first seasons on DVD and settle in. You won't regret it."
    },
    {
      "username": "DVK1234",
      "userUrl": "https://www.imdb.com/user/ur3321493",
      "reviewLink": "https://www.imdb.com/review/rw7769784",
      "warningSpoilers": true,
      "date": "17 January 2022",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Sad I've Watched the Entire Series",
      "content": "What a great series. Kudos to Jon Hamm, John Slattery, Vincent Kartheiser, January Jones, Elizabeth Moss, Christina Hendricks. What superb acting.So many layers to this show.The time period, the issues around the 60s and early 70s were all developed in the stories.I really enjoyed the ending. Don Draper has a moment of spiritual enlightenment that results in the best commercial ever made. Genius."
    },
    {
      "username": "patrickwelty",
      "userUrl": "https://www.imdb.com/user/ur22543083",
      "reviewLink": "https://www.imdb.com/review/rw7977005",
      "warningSpoilers": false,
      "date": "17 March 2022",
      "rate": "9",
      "helpful": "21 out of 22 found this helpful.",
      "title": "A broken man hiding in a broken society",
      "content": "Don is broken. But in the outside he's unbreakable.A slow burn with great story telling and cinematography leads to a top 5 show of all time.The period piece depicts the pure madness of New York and ad agencies where the winner decides how the consumer will perceive a brand. The product doesn't matter it's the message and the way something is perceived that matters. Not much has changed since then.Love, war, violence, money, hate and greed all heavy present themes.Less words are better says Madmen writers. Quiet and subtle moments make the biggest impacts all set alongside the strong but tormented Don.Superior casting, writing and set results in a show for the ages that stands the test of the times."
    },
    {
      "username": "John_Truby",
      "userUrl": "https://www.imdb.com/user/ur13341006",
      "reviewLink": "https://www.imdb.com/review/rw2188127",
      "warningSpoilers": false,
      "date": "8 January 2010",
      "rate": "",
      "helpful": "132 out of 169 found this helpful.",
      "title": "Ambitious with good cause",
      "content": "Mad Men is one of the best-written and most ambitious TV shows in some time. It is worth close study, not just for learning how to create a well-structured show but also how to write one that is truly original and potentially groundbreaking. Story world, or arena, is one of the key structural elements in any TV drama (see the TV Drama Class for how to create this element, as well as the other essential structural elements of a successful show). It is where the story takes place and it usually exists within some specific arena that not only delineates a recognizable unit but also has a set of rules, activities and values that defines the characters. One of the strengths of Mad Men is its story world. Instead of the usual arena of cops, lawyers, or doctors, Mad Men takes us into a Manhattan advertising agency in 1960. Besides being totally unique in TV, this story world is extremely detailed. And the detailing isn't simply a matter of the set design, which is fabulous. It is written into every episode. The writers weave all manner of cultural icons of the late 50s-early 60s, including TV shows, ads, and fashion. This has two great advantages. One is the pleasure of recognition. If you were a kid at that time, as I was, the show is a virtual time machine. And even if you weren't, the authenticity and texture immerse you in the world and make you feel that \"You are there!\" The other great advantage is that this past world tricks the audience into believing that this is how it really was back then. The first thing we notice when we see all of these details is how much the world has changed. Everybody smoked back then. The men were in charge and the women were all secretaries and housewives. That sets up the kicker. By first thinking how much we've changed, we then realize, with even more impact, all the ways we haven't. This story, set in 1960, is really about today, or more exactly, the ways that human nature only puts on a new skin and the same fundamental challenges of creating a meaningful life must be faced by each of us, every moment of every day. Another structural element that immediately jumps out at you if you want to create a TV show or write for one is the desire line. In Mad Men the desire that structures each episode is fairly nebulous, and that's probably going to cut into the show's popularity (I hope I'm wrong on this one). Desire is the main reason almost all TV shows are set in the cop, lawyer, and doctor arenas. These jobs give their shows a simple and repeatable desire line that tracks the episode every week. Catch the criminal. Win the case. Save the life. But of course this is extremely limiting. Most people don't spend their daily lives solving crimes, prosecuting bad guys, and saving lives. So while the desire line on this show may be more nebulous, it is far closer to what most Americans do in their daily lives. These Mad Men are in the business of selling, which, as Arthur Miller pointed out long ago, is the archetypal American action. But they aren't selling a particular product. They're selling desire, some image of the good life that, because it is a fabricated ideal, is always just out of reach. Writer Matthew Weiner's brilliant conception for this show is to connect the selling of desire to America to the personal and work lives of the ad men themselves. The ad men want the image of the good life in America that they are selling to be true, even if they intellectually make fun of the poor suckers out there who buy it. Main character Don Draper is handsome and talented, with a beautiful wife and two cute little kids. But he has some secrets he's keeping  like a mistress in the city  and he feels a terrible void he has no idea how to shake. Draper is a master at manipulating desire and creating facades, so when he tries to live the promise for real, the \"good life\" falls apart in his hands. We are in Far from Heaven and American Beauty territory here. And the second episode even had Draper give his own version of the Existentialist credo of Sartre and Camus that was seeping into pop culture during the late 50s (how's that for a sweet detail on a TV show?). We'll have to see whether Mad Men can extend beyond a few episodes without imploding. Besides the lack of a clean desire line, the subject of hollow suburban existence will make it extremely difficult for the writers to develop the show over the long term without beating a spiritually dead horse. In the meantime, I'm going to sit back and enjoy some great dramatic writing, and nowadays TV is the only place you'll find it."
    },
    {
      "username": "Holt344",
      "userUrl": "https://www.imdb.com/user/ur80693802",
      "reviewLink": "https://www.imdb.com/review/rw5055646",
      "warningSpoilers": false,
      "date": "12 August 2019",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "One of the best drama TV-Shows in history, a piece of art",
      "content": "This is truly one of the best drama series in the history of television as it has everything a drama should have: great characters and ensemble cast, superb writing, mind blowing sets and costumes. It's a character driven story that follows Don Draper and the people around him for ten years from 1960 to 1970 and the writing in these 7 seasons have been interesting and enjoyable to follow. Matthew Veiner created a piece of art with his unique and spectacular writing, mixing fiction with non fiction made him get freedom and with that he could create the many characters that the show has to offer and they are all realistic and believable characters, it's some of the best characters in a show that I've seen.How Matthew Veiner and his crew have recreated New York in its 60's have been something incredible to see as it's detailed from the clothes that the people wear to how they act and the whole world has a feeling that is hard to capture but the crew behind Mad Men succeeded. So what are you in for if you choose to watch this piece of art, more than one of the best drama's in TV history you get to see the fine acting of the whole ensemble cast and mostly Jon Hamm, the man that plays Don Draper, everyone did incredible and emmy worthy performances."
    },
    {
      "username": "ramo140",
      "userUrl": "https://www.imdb.com/user/ur11987212",
      "reviewLink": "https://www.imdb.com/review/rw8006732",
      "warningSpoilers": false,
      "date": "26 March 2022",
      "rate": "9",
      "helpful": "18 out of 20 found this helpful.",
      "title": "Interesting but flawed",
      "content": "There is a lot to enjoy in the show. The main cast is amazing. Hendricks and Jones are gorgeous and steal every scene. Slattery provides a lot of great comic relief. The show is very similar to the crown in construction. Many episodes revolve around a certain event or theme. The overarching plots are meandering and leave a lot to be desired. A lot of events seem random and out of the blue. And the last chunk of episodes were extremely disappointing. The finale was just watching the characters make random decisions or enter non-sensical relationships. The middle seasons however does have stellar episodes that are worth of a rewatch.My ranking of the seasons would be: 1) S3-6 9/10 2) S1-2 8/10 3) S7A 7/10 4) S7B 5/10."
    },
    {
      "username": "Nooshin_Navidi",
      "userUrl": "https://www.imdb.com/user/ur23869746",
      "reviewLink": "https://www.imdb.com/review/rw2309109",
      "warningSpoilers": false,
      "date": "11 September 2010",
      "rate": "9",
      "helpful": "139 out of 174 found this helpful.",
      "title": "Impeccable...",
      "content": "This is a perfect show in every sense. The opening credits & animated intro are themselves works of art, and the creative direction makes the series so visually exquisite that you can't take your eyes off the screen even for a moment lest you miss one of the many perfect vignettes. The haunting opening music sets the stage for masterful sound design, ranging from each episode's musical selections to the subtlest of ambient sounds. The camera-work is nothing short of stunning; it loves each character and makes even the background action interesting. Talented cast and every character is watchable & believable.For a period piece, 'Mad Men' is remarkably fresh. The show is set in 1960, following a decade of post-WWII recovery which, with the help of rampant consumerism, transformed America from an industrial society into a \"leisure society\". One of the most rewarding things about the show is how we get to witness the many cracks which had already begun to form in the manicured facade of the '50s, slowly making way for America's rebellion against the manufactured \"good life\", and resulting in the social & political upheaval of the 1960s and 1970s.We get to have intimate glimpses into the various components of this process--money, power, politics, sex, race, gender roles-- in a way that makes us feel as if we're actually there in the room with the characters. The show also does a magnificent job of portraying the simultaneous liberation and objectification of women as consumerism rapidly transformed their role in society.Each and every well-developed character on this show takes his/her turn to unfold in delicate layers. This unfolding is done with pin-point precision and subtlety, and without ever spoon-feeding us. And every new nugget of information is a highly relevant piece of this very addictive puzzle.~NN"
    },
    {
      "username": "saabrian-1",
      "userUrl": "https://www.imdb.com/user/ur8108941",
      "reviewLink": "https://www.imdb.com/review/rw8041815",
      "warningSpoilers": true,
      "date": "8 April 2022",
      "rate": "9",
      "helpful": "18 out of 18 found this helpful.",
      "title": "Almost perfect",
      "content": "Such a well crafted drama. The characters were so frustrating in that whenever you thought they had overcome this or that character flaw, they would relapse. But that's human nature. People rarely change their fundamental nature.My only complaint is that Bobby was the only member of the Draper/Francis family that always remained shallow and superficial despite being on the show for the entire time. Sally evolved into a really interesting character who challenged Don in a way that not even his wives did. She become more than just a dumb kid. That the writers didn't do the same for her brother was a missed opportunity."
    },
    {
      "username": "ChubbyChecker",
      "userUrl": "https://www.imdb.com/user/ur5922369",
      "reviewLink": "https://www.imdb.com/review/rw4330331",
      "warningSpoilers": false,
      "date": "9 September 2018",
      "rate": "8",
      "helpful": "41 out of 49 found this helpful.",
      "title": "Mundane, yet somehow brilliant",
      "content": "I'll be the first to admit that Mad Men is a show about watching people go to work and live their lives. It should be dull and uninteresting, yet somehow it managed to grip me for a whole 7 seasons and left me wanting more.The setting is a big part of it. The historical interest of the time (JFK's assassination, the moon landing, England winning the World Cup, to name a few key points in the show) is enough to keep many gripped. It's more than that though. The characters in themselves are worth following and you get invested in them as the seasons progress.To be frank I didn't like the first season. I just didn't get the formula and was getting close to giving up on the show. I'm glad I didn't though as it only improves from the second season onward."
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw4507388",
      "warningSpoilers": false,
      "date": "12 December 2018",
      "rate": "10",
      "helpful": "14 out of 17 found this helpful.",
      "title": "A modern classic set in a '60s advertising agency",
      "content": "Set in the changing world of advertising in the 1960s this series is centred on the employees of one agency as they work to gain new contracts and maintain the ones they have and deal with take-overs and buy-outs. There are many major characters but most important is Don Draper; a man with the magic touch in his business who is far from perfect; he cheats on his wife, drinks rather too much and has a secret that could get him in a lot of trouble if it came to light. We also have Peggy Olsen; a secretary who quickly becomes the only woman on the creative team; office manager Joan Harris; the ambitious Pete Campbell and Roger Sterling, the somewhat amoral partner with an eye for the ladies. The series doesn't only follow the characters at work; we see their home lives; Don's family, particularly his wife Betty and daughter Sally, are as important as his colleagues.If you are looking for action and expect stuff to happen all the time this might not be for you; but if you want a great character led drama that really captures the feel of the era in which it is set then this might be just what you are looking for. The characters might not be the most likeable but their flaws make them feel real. The ongoing story nicely incorporates the news stories that would affect the national consciousness at the time as well as the changing attitudes to race and sexuality. The cast is superlative; most obviously John Hamm who is great as Don but Elisabeth Moss, Christina Hendricks, Vincent Kartheiser, January Jones and John Slattery whose characters stand out. Kiernan Shipka deserves separate mention as she does a great job as Sally; a role she started when she was about six years old. The series provides plenty of drama but also a good number of laughs and one gory shock involving a lawnmower and a foot! Overall I would definitely recommend this superior series."
    },
    {
      "username": "reza-2155",
      "userUrl": "https://www.imdb.com/user/ur135897917",
      "reviewLink": "https://www.imdb.com/review/rw8373041",
      "warningSpoilers": false,
      "date": "26 July 2022",
      "rate": "9",
      "helpful": "22 out of 22 found this helpful.",
      "title": "great tv drama",
      "content": "The first thing I will say about the mad men series is that the pure drama is really the purest drama that I have seen and it is really spectacular. I enjoyed watching it. In this series, the sequences move properly and the main actor is also great. Jon Hamm is very good. I admire him and also Elisabeth Moss acting is very good and all the actors are good and at the end I strongly recommend watching this series to all drama lovers."
    },
    {
      "username": "samialej",
      "userUrl": "https://www.imdb.com/user/ur145432890",
      "reviewLink": "https://www.imdb.com/review/rw8057314",
      "warningSpoilers": false,
      "date": "13 April 2022",
      "rate": "8",
      "helpful": "21 out of 22 found this helpful.",
      "title": "One of the best shows ever with it's up and downs.",
      "content": "Mad Men is the kind of show you want to watch if you are having doubts of your career and life.The characters and perfectly developed and none of them fall flat. The show is real and crude and portrays many aspects of the professional and personal life of a person.Some episodes are flat and some scenes are not necessary but this show is something to look at."
    },
    {
      "username": "alexnapo",
      "userUrl": "https://www.imdb.com/user/ur30949982",
      "reviewLink": "https://www.imdb.com/review/rw3664662",
      "warningSpoilers": false,
      "date": "18 March 2017",
      "rate": "10",
      "helpful": "163 out of 177 found this helpful.",
      "title": "Faboulous",
      "content": "When I started watching Mad Men, the rhythm of it felt slow.Pretty quickly did I realize how much more powerful the slow story & plot development rhythm would be, allowing us to discover the characters, mostly in seasons 1 and 2, and then really be in the thick of it in subsequent seasons.Indeed, this series has pushed character development so far that they are the entire and only reason why this series is interesting. The actual events happening at the advertising agency is a pretext to throw more things at those characters and have them deal with it. In fact, the characters are so interesting that there is practically no violence needed (except a few minor events) over 7 seasons to keep this series going. I find that tremendously respectable to be able to craft a series in this way, not using gun shots and bombs to make it lively.Finally, I have not lived in the early 60's time period the series is set in, but I can only say that it's all seemed to me very interesting and all these \"vintinge\" props and costumes, hair style and such made it all the more fascinating to watch.Absolutely great work."
    },
    {
      "username": "twostronghearts",
      "userUrl": "https://www.imdb.com/user/ur157474420",
      "reviewLink": "https://www.imdb.com/review/rw8593650",
      "warningSpoilers": false,
      "date": "7 October 2022",
      "rate": "10",
      "helpful": "29 out of 30 found this helpful.",
      "title": "Amazing",
      "content": "Have any states yet legalized marriage between human beings and TV shows? If so, I'm going to throw a few things in a bag and run off with 'Mad Men,' the new drama on AMC set in the world of advertising at the dawn of the sixties - and encompassing New York life, and marriage, and sex, and repression, and what America was and was not. It is gorgeous in every way. As it should be - it's the spawn of all those handsome, stylish office movies that were made in the fifties. Like those movies, 'Mad Men' is smart and tremendously attractive, and it stirs you more than it probably should. It may not be deep, but if you're a certain age and have a certain sensibility and certain fantasies of what New York used to be like (thanks to those movies) it hits a deep place in you, like a straight-up Martini made of memory and desire."
    },
    {
      "username": "Kirpianuscus",
      "userUrl": "https://www.imdb.com/user/ur61197531",
      "reviewLink": "https://www.imdb.com/review/rw5912638",
      "warningSpoilers": false,
      "date": "17 July 2020",
      "rate": "",
      "helpful": "8 out of 9 found this helpful.",
      "title": "remarkable",
      "content": "I saw it as a mix of flavors. The atmosphere, the accuracy of details, the fair and precise portraits of characters , the fine, admirable craft of each episode and the stories as lessons about survive, fix of crisis, appearences as best options and forms of sophisticated vulnerabities use. A remarkable serie."
    },
    {
      "username": "phd_travel",
      "userUrl": "https://www.imdb.com/user/ur22484170",
      "reviewLink": "https://www.imdb.com/review/rw2813521",
      "warningSpoilers": false,
      "date": "16 June 2013",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Iconic",
      "content": "This is a television series unlike any other before and for those who take the trouble to follow it faithfully, it is truly rewarding. Set in an advertising agency in the 60s and the lives of the people working their and their families will be known as a historical masterpiece of capturing the essence of the era on screen. The production standards set a standard for any future series set in the past.The dialog is often so surprising and well written you hang on every word. The characters are so completely rounded flawed and interesting that you feel they are real.Don Draper (Jon Hamm) the ad man who can't say no is one of the most interesting and flawed characters on television. Vincent Kartheiser as the entitled Pete Campbell is hilarious. John Slattery as Roger Sterling the founding partner of the firm is a scene stealer.The beautiful and talented female cast are all excellent and their position at home and work at that time is captured in all the different characters. Elisabeth Moss at Peggy Olsen the young female secretary who becomes a copywriter. Christina Hendricks as Joan Holloway the office manager is such a moving and expressive actress. She deserves an Emmy or Golden Globe. January Jones as Don's ex wife Betty is so many things - silly vain lacking in maternal instincts, she fascinates endlessly. Jessica Pare as Megan Don's present wife is the opposite of Betty but just as interesting. Kiernan Shipka as Sally, Don's daughter, the victim of her parents' sins is terrific for such a young actress.The supporting cast that has come and gone are excellent especially Julia Ormond as Megan's sophisticated cynical mother.There are some episodes and plot lines that are dull and unnecessary mainly in the earlier seasons. But when it's good it's the best series on television. I just wish each season were longer. Hope it goes on as long as possible."
    }
  ],
  "errorMessage": ""
}