{
  "imDbId": "tt0804503",
  "title": "Mad Men",
  "fullTitle": "Mad Men (TV Series 2007–2015)",
  "type": "TVSeries",
  "year": "2007",
  "episodes": [
    {
      "id": "tt1059578",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "Smoke Gets in Your Eyes",
      "image": "https://m.media-amazon.com/images/M/MV5BMjMxNTY5NDM2MV5BMl5BanBnXkFtZTcwODc5ODAzOQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "19 Jul. 2007",
      "plot": "New York City, 1960s. In the ego-driven Golden Age of advertising, everyone is selling something and nothing is what it seems.",
      "imDbRating": "8.1",
      "imDbRatingCount": "5024"
    },
    {
      "id": "tt1049715",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "Ladies Room",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA2NTk3NDg3Ml5BMl5BanBnXkFtZTgwNTA4MjgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "26 Jul. 2007",
      "plot": "Don continues to conceal his complicated personal life, even in the face of Roger's invitation to open up.",
      "imDbRating": "7.5",
      "imDbRatingCount": "3720"
    },
    {
      "id": "tt1049716",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "Marriage of Figaro",
      "image": "https://m.media-amazon.com/images/M/MV5BNWYwZjhjOGMtYjg5ZC00YTViLTg4MmYtNGYzMzNmOTBiNjdmXkEyXkFqcGdeQXVyNjUxMjc1OTM@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "2 Aug. 2007",
      "plot": "Pete returns home from his honeymoon excited about his new marriage but conflicted about his past encounter with Peggy.",
      "imDbRating": "7.6",
      "imDbRatingCount": "3474"
    },
    {
      "id": "tt1040713",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "New Amsterdam",
      "image": "https://m.media-amazon.com/images/M/MV5BNjcwNWYwZWUtOGIzZi00NzVlLWI1YWUtZGQwYmMxZmVkMTM1XkEyXkFqcGdeQXVyMDgyNjA5MA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "9 Aug. 2007",
      "plot": "Pete Campbell oversteps the mark when he pitches an idea for ad campaign to the head of Bethlehem Steel without telling Don Draper. Draper wants him fired but learns a lesson in corporate politics. Pete's wife wants to buy a Manhattan apartment but he has to approach his cold and distant parents for a loan. Pete's in-laws, however, are more forthcoming.",
      "imDbRating": "7.9",
      "imDbRatingCount": "3267"
    },
    {
      "id": "tt1097127",
      "seasonNumber": "1",
      "episodeNumber": "5",
      "title": "5G",
      "image": "https://m.media-amazon.com/images/M/MV5BMjEzNzA2NDM1NV5BMl5BanBnXkFtZTgwNDM0NTczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "16 Aug. 2007",
      "plot": "Don Draper is shaken when his past life comes back to haunt him. After his picture appears in a local newspaper, Adam Whitman, a man who claims to be his younger brother, approaches him. Don, or Dick as his brother knows him, initially denies everything but in the end admits to having taken on a new name. He refuses however to have anything to do with him and tries to buy his silence. When one of the ad men gets a short story published, Pete Campbell is frustrated that his own stories have yet to see the light of day. When his wife approaches an old beau to see if he ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "3197"
    },
    {
      "id": "tt1042049",
      "seasonNumber": "1",
      "episodeNumber": "6",
      "title": "Babylon",
      "image": "https://m.media-amazon.com/images/M/MV5BNTkwMzkyMDYwMl5BMl5BanBnXkFtZTgwNzgxNjczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "23 Aug. 2007",
      "plot": "The Agency is looking to land an advertising contract to promote tourism to Israel. Don and his team try to come up with a theme but know so little about the country that they're stumped. So Don calls Rachel Menken to see if she has any ideas. Roger Sterling is getting tired of sneaking around with Joan Holloway and suggests she should get her own apartment but she knows better. Peggy comes up with an advertising concept during a testing session for a new line of lipsticks and she's subsequently asked to write copy.",
      "imDbRating": "7.9",
      "imDbRatingCount": "3155"
    },
    {
      "id": "tt1050979",
      "seasonNumber": "1",
      "episodeNumber": "7",
      "title": "Red in the Face",
      "image": "https://m.media-amazon.com/images/M/MV5BMTAyNjU0NDc5MzVeQTJeQWpwZ15BbWU4MDE5OTQ3MzIx._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "30 Aug. 2007",
      "plot": "When Don invites Roger home for dinner, too much alcohol fuels repercussions between Don and Betty and between Don and Roger. Joan puts Roger off for the weekend, spending time with her roommate Carol instead. Pete exchanges a wedding gift for a rifle, and then shares a hunting fantasy with Peggy. Bertram Cooper arranges for the Nixon campaign to meet with him, Roger, Don, and Pete.",
      "imDbRating": "8.1",
      "imDbRatingCount": "3020"
    },
    {
      "id": "tt1097128",
      "seasonNumber": "1",
      "episodeNumber": "8",
      "title": "The Hobo Code",
      "image": "https://m.media-amazon.com/images/M/MV5BY2UzOGUyOWMtMmFkOC00MjkzLWJmYWYtZGM4ZWIyNjU4YTdlXkEyXkFqcGdeQXVyMDgyNjA5MA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "6 Sep. 2007",
      "plot": "Pete Campbell and Peggy Olson start an office romance. Peggy's copy for the lipstick account goes over well and the men in the firm congratulate her. A new telephone receptionist, Lois Saddler, takes a liking to Salvatore Romano but his own interests seem to lie elsewhere. Don Draper gets an unexpected bonus from Bert Cooper and wants to take Midge on a surprise trip to Paris. She seems too involved with her beatnik friends however. Don reflects on his unhappy childhood and in flashbacks he reveals some life lessons he learned early on when a hobo spent the day ...",
      "imDbRating": "8.3",
      "imDbRatingCount": "3141"
    },
    {
      "id": "tt1097298",
      "seasonNumber": "1",
      "episodeNumber": "9",
      "title": "Shoot",
      "image": "https://m.media-amazon.com/images/M/MV5BNzlhYWYyYjktMTI0OC00OTRkLTg0YzktMDA5NjE5MDIyODkwXkEyXkFqcGdeQXVyODYwOTMxMA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "13 Sep. 2007",
      "plot": "Don is courted by Jim Hobart, head of a larger ad firm who offers him more money and more creative resources to join them. Betty Draper rekindles her interest in modeling after Hobart suggests she should try it. She doesn't realize it's all part of the strategy to get Don on board. Peggy Olsen is fretting over her weight gain but doesn't appreciate Joan's advice about getting ahead in the office. The ad team tries to counter the advertising coming out of the Kennedy campaign. Pete Campbell comes up with an idea to keep Kennedy's image off TV in key States.",
      "imDbRating": "8.2",
      "imDbRatingCount": "3001"
    },
    {
      "id": "tt1094472",
      "seasonNumber": "1",
      "episodeNumber": "10",
      "title": "Long Weekend",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA1NzQxMzczNl5BMl5BanBnXkFtZTgwMDQyNjczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "27 Sep. 2007",
      "plot": "It's Labor Day weekend and most of the men are sending their wives away for a few days. Don Draper's wife Betty is dreading the thought, as her father and his new girlfriend, whom she detests, will be staying with them. With the election approaching, the team at Sterling Cooper is gloomy since the Nixon campaign has not been following their advice. Roger Sterling was hoping to spend Friday night with Joan Holloway but having just seen the movie The Apartment (1960), she is feeling a bit used. She plans a night on the town with her old college friend who has some surprising information ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "2900"
    },
    {
      "id": "tt1108366",
      "seasonNumber": "1",
      "episodeNumber": "11",
      "title": "Indian Summer",
      "image": "https://m.media-amazon.com/images/M/MV5BMWVmY2EzMTktMjJmOS00NGYxLThmZjYtNDFhNjRjNGE1ZmI0XkEyXkFqcGdeQXVyNDIyNjA2MTk@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "4 Oct. 2007",
      "plot": "Peggy is given the opportunity to write copy for a new weight loss device that everyone knows is useless. She finds an interesting use for it, however. Afraid of losing the Lucky Strike cigarette account, Bert Cooper gets Roger Sterling to come in for a one-hour meeting but he has another attack. Don Draper becomes a partner and takes over for his friend Roger, but some of the ad men are sharpening their resumes nonetheless. Pete Campbell wants a promotion but Draper doesn't seem too interested. Pete sneaks into Don's office and takes home a parcel sent by Adam ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "2772"
    },
    {
      "id": "tt1102103",
      "seasonNumber": "1",
      "episodeNumber": "12",
      "title": "Nixon vs. Kennedy",
      "image": "https://m.media-amazon.com/images/M/MV5BZTYxMGFjYzQtNzI1ZS00ZjVjLWI4MjMtNTRmNjAyNTcxMDgwXkEyXkFqcGdeQXVyNjUxMjc1OTM@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "11 Oct. 2007",
      "plot": "Election night arrives and the staff of Sterling Cooper has a party while watching the returns. The election is close and it's obviously going to be a long night. Now a senior partner in the firm, Don Draper must hire a new head of account services, a post that Pete Campbell yearns for. Aware of Draper's secret past, he tries to strong-arm him into giving him the job. With his secret out, Don panics and he asks Rachel Menken to run away with him. Regaining his composure, Don calls Pete's bluff leading to a confrontation with Bert Cooper.",
      "imDbRating": "9.0",
      "imDbRatingCount": "3388"
    },
    {
      "id": "tt1105057",
      "seasonNumber": "1",
      "episodeNumber": "13",
      "title": "The Wheel",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ3MTg2MTYzNl5BMl5BanBnXkFtZTcwODk5ODAzOQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "18 Oct. 2007",
      "plot": "Don and Betty Draper have an argument when it becomes apparent that he doesn't want to spend Thanksgiving with her family and she plans on going only with the children. He also learns some information about his brother Adam. Pete Campbell confirms that he has landed an account from his father-in-law for a new skin care product called Clearasil. He objects however when Don gives the account to Peggy Olson, whom he has just promoted to junior copywriter. Peggy proves her mettle in auditions for the weight loss device but later is feeling unwell and goes to the hospital ...",
      "imDbRating": "9.0",
      "imDbRatingCount": "3631"
    }
  ],
  "errorMessage": ""
}