{
  "imDbId": "tt0804503",
  "title": "Mad Men",
  "fullTitle": "Mad Men (TV Series 2007–2015)",
  "type": "TVSeries",
  "year": "2007",
  "language": "en",
  "titleInLanguage": "Mad Men",
  "url": "https://en.wikipedia.org/wiki/Mad_Men",
  "plotShort": {
    "plainText": "Mad Men is an American period drama television series created by Matthew Weiner and produced by Lionsgate Television. It ran on the cable network AMC from July 19, 2007, to May 17, 2015, lasting for seven seasons and 92 episodes. The show is set from March 1960 to November 1970.\r\nMad Men begins at the fictional Sterling Cooper advertising agency on Madison Avenue in Manhattan, New York City, and continues at the new firm of Sterling Cooper Draper Pryce (later named Sterling Cooper & Partners) near the Time-Life Building at 1271 Sixth Avenue. According to the pilot episode, the phrase \"Mad men\" was a slang term coined in the 1950s by advertisers working on Madison Avenue to refer to themselves, \"Mad\" being short for \"Madison\" (in reality, the only documented use of the phrase from that time may have been in the late-1950s writings of James Kelly, an advertising executive and writer).\r\nThe series's main character is the charismatic advertising executive Don Draper (played by Jon Hamm), who is initially the talented creative director at Sterling Cooper. He is erratic and mysterious but is widely regarded throughout the advertising world as a genius; some of the most famous advertisement campaigns in history are shown to be his creations. Later, Don becomes a founding partner at Sterling Cooper Draper Pryce but begins a struggle as his highly calculated identity falls into a period of decline. The plot of the show tracks the people in his personal and professional lives. As the series progresses, it depicts the changing moods and social mores of the United States throughout the 1960s and early 1970s.\r\nMad Men received widespread critical acclaim for its writing, acting, directing, visual style and historical authenticity; it won many awards, including 16 Emmys and five Golden Globes. The show was also the first basic cable series to receive the Emmy Award for Outstanding Drama Series, winning the award each year of its first four seasons (2008–2011). It is widely regarded as one of the greatest television series of all time and as part of the early 21st century Golden Age of Television.",
    "html": "<p>Mad Men is an American period drama television series created by Matthew Weiner and produced by Lionsgate Television. It ran on the cable network AMC from July 19, 2007, to May 17, 2015, lasting for seven seasons and 92 episodes. The show is set from March 1960 to November 1970.</p><p>Mad Men begins at the fictional Sterling Cooper advertising agency on Madison Avenue in Manhattan, New York City, and continues at the new firm of Sterling Cooper Draper Pryce (later named Sterling Cooper & Partners) near the Time-Life Building at 1271 Sixth Avenue. According to the pilot episode, the phrase \"Mad men\" was a slang term coined in the 1950s by advertisers working on Madison Avenue to refer to themselves, \"Mad\" being short for \"Madison\" (in reality, the only documented use of the phrase from that time may have been in the late-1950s writings of James Kelly, an advertising executive and writer).</p><p>The series's main character is the charismatic advertising executive Don Draper (played by Jon Hamm), who is initially the talented creative director at Sterling Cooper. He is erratic and mysterious but is widely regarded throughout the advertising world as a genius; some of the most famous advertisement campaigns in history are shown to be his creations. Later, Don becomes a founding partner at Sterling Cooper Draper Pryce but begins a struggle as his highly calculated identity falls into a period of decline. The plot of the show tracks the people in his personal and professional lives. As the series progresses, it depicts the changing moods and social mores of the United States throughout the 1960s and early 1970s.</p><p>Mad Men received widespread critical acclaim for its writing, acting, directing, visual style and historical authenticity; it won many awards, including 16 Emmys and five Golden Globes. The show was also the first basic cable series to receive the Emmy Award for Outstanding Drama Series, winning the award each year of its first four seasons (2008–2011). It is widely regarded as one of the greatest television series of all time and as part of the early 21st century Golden Age of Television.</p>"
  },
  "plotFull": {
    "plainText": "Mad Men is an American period drama television series created by Matthew Weiner and produced by Lionsgate Television. It ran on the cable network AMC from July 19, 2007, to May 17, 2015, lasting for seven seasons and 92 episodes. The show is set from March 1960 to November 1970.\r\nMad Men begins at the fictional Sterling Cooper advertising agency on Madison Avenue in Manhattan, New York City, and continues at the new firm of Sterling Cooper Draper Pryce (later named Sterling Cooper & Partners) near the Time-Life Building at 1271 Sixth Avenue. According to the pilot episode, the phrase \"Mad men\" was a slang term coined in the 1950s by advertisers working on Madison Avenue to refer to themselves, \"Mad\" being short for \"Madison\" (in reality, the only documented use of the phrase from that time may have been in the late-1950s writings of James Kelly, an advertising executive and writer).\r\nThe series's main character is the charismatic advertising executive Don Draper (played by Jon Hamm), who is initially the talented creative director at Sterling Cooper. He is erratic and mysterious but is widely regarded throughout the advertising world as a genius; some of the most famous advertisement campaigns in history are shown to be his creations. Later, Don becomes a founding partner at Sterling Cooper Draper Pryce but begins a struggle as his highly calculated identity falls into a period of decline. The plot of the show tracks the people in his personal and professional lives. As the series progresses, it depicts the changing moods and social mores of the United States throughout the 1960s and early 1970s.\r\nMad Men received widespread critical acclaim for its writing, acting, directing, visual style and historical authenticity; it won many awards, including 16 Emmys and five Golden Globes. The show was also the first basic cable series to receive the Emmy Award for Outstanding Drama Series, winning the award each year of its first four seasons (2008–2011). It is widely regarded as one of the greatest television series of all time and as part of the early 21st century Golden Age of Television.\r\nProduction\r\nConception\r\nIn 2000, while working as a staff writer for Becker, Matthew Weiner wrote the first draft as a spec script for the pilot of what would later be called Mad Men. Television showrunner David Chase recruited Weiner to work as a writer on his HBO series The Sopranos after reading the pilot script in 2002. \"It was lively, and it had something new to say,\" Chase said. \"Here was someone who had written a story about advertising in the 1960s, and was looking at recent American history through that prism.\"\r\nWeiner and his representatives at Industry Entertainment and ICM tried to sell the pilot script to HBO, which expressed an interest, but insisted that David Chase be named executive producer. Chase declined, despite his enthusiasm for Weiner's writing and the pilot script. HBO CEO Richard Plepler later became a fan of the show and congratulated AMC on their success with it. In 2017 he named passing on Mad Men as his biggest regret from his time at HBO, calling it \"inexcusable\" and attributing the decision to \"hubris.\"\r\nWeiner then moved on to Showtime, which also passed. Lacking a suitable network buyer, they tabled sales efforts until years later, when a talent manager on Weiner's team, Ira Liss, pitched the series to AMC's Vice President of Development, Christina Wayne. The Sopranos was completing its final season then, and the cable network happened to be getting into the market for new series programming. \"The network was looking for distinction in launching its first original series,\" according to AMC Networks president Ed Carroll, \"and we took a bet that quality would win out over formulaic mass appeal.\"\r\nInfluences\r\nWeiner listed Alfred Hitchcock as a major influence on the visual style of the series, especially the film North by Northwest. He also was influenced by director Wong Kar-wai in the music, mise en scène, and editorial style. Weiner noted in an interview that M*A*S*H and Happy Days, two television shows produced in the 1970s about the 1950s, provided a \"touchstone for culture\" and a way to \"remind people that they have a misconception about the past, any past.\" He also said that \"Mad Men would have been some sort of crisp, soapy version of The West Wing if not for The Sopranos.\" Peggy's \"psychic scar for the entire show, after giving away that baby,\" Weiner said, is \"the kind of thing that would have never occurred to me before I was on The Sopranos.\"\r\nPre-production\r\nTim Hunter, the director of a half-dozen episodes from the show's first two seasons, called Mad Men a \"very well-run show.\" He said:\r\nThey have a lot of production meetings during pre-production. The day the script comes in we all meet for a first page turn, and Matt starts telling us how he envisions it. Then there's a \"tone\" meeting a few days later where Matt tells us how he envisions it. And then there's a final full crew production meeting where Matt again tells us how he envisions it ...\r\nFilming and production design\r\nThe pilot episode was shot at Silvercup Studios in New York City and various locations around the city; subsequent episodes were filmed at Los Angeles Center Studios. It is available in high definition for showing on AMC HD and on video-on-demand services available from various cable affiliates.\r\nThe writers, including Weiner, amassed volumes of research on the period in which Mad Men takes place so as to make most aspects of the series—including detailed set design, costume design, and props—historically accurate, producing an authentic visual style that garnered critical praise. On the scenes featuring smoking, Weiner stated: \"Doing this show without smoking would've been a joke. It would've been sanitary and it would've been phony.\" Each episode had a budget between US$2–2.5 million; the pilot episode's budget was over $3 million.\r\nWeiner collaborated with cinematographer Phil Abraham and production designers Robert Shaw (who worked on the pilot only) and Dan Bishop to develop a visual style that was \"influenced more by cinema than television.\" Alan Taylor, a veteran director of The Sopranos, directed the pilot and also helped establish the series's visual tone. To cast an \"air of mystery\" around Don Draper, Taylor tended to shoot from behind him or would frame him partially obscured. Many scenes set at Sterling Cooper were shot lower-than-eyeline to incorporate the ceilings into the composition of frame; this reflects the photography, graphic design and architecture of the period. Taylor felt that neither steadicam nor handheld camera work would be appropriate to the \"visual grammar of that time, and that aesthetic didn't mesh with classic approach\"—accordingly, the sets were designed to be practical for dolly work.\r\nFinances\r\nAccording to a 2011 Miller Tabak + Company estimate published in Barron's, Lions Gate Entertainment received an estimated $2.71 million from AMC for each episode, a little less than the $2.84 million each episode costs to produce.\r\nIn March 2011, after negotiations between the network and the series's creator, AMC picked up Mad Men for a fifth season, which premiered on March 25, 2012. Weiner reportedly signed a $30 million contract, which would keep him at the helm of the show for three more seasons. A couple of weeks later, a Marie Claire interview with January Jones was published, noting the limits to that financial success when it comes to the actors: \"We don't get paid very much on the show and that's well-documented. On the other hand, when you do television you have a steady paycheck each week, so that's nice.\"\r\nMiller Tabak analyst David Joyce wrote that sales from home video and iTunes could amount to $100 million in revenue during the show's expected seven-year run, with international syndication sales bringing in an additional estimated $700,000 per episode. That does not include the $71 to $100 million estimated to come from a Netflix streaming video deal announced in April 2011.\r\nEpisode credit and title sequences\r\nThe opening title sequence features credits superimposed over a graphic animation of a businessman falling from a height, surrounded by skyscrapers with reflections of period advertising posters and billboards, accompanied by a short edit of the instrumental \"A Beautiful Mine\" by RJD2. The businessman appears as a black-and-white silhouette. The titles, created by production house Imaginary Forces, pay homage to graphic designer Saul Bass's skyscraper-filled opening titles for Alfred Hitchcock's North by Northwest (1959) and falling man movie poster for Vertigo (1958); Weiner has listed Hitchcock as a major influence on the visual style of the series. In a 2010 issue of TV Guide, the show's opening title sequence ranked No. 9 on a list of TV's top 10 credits sequences, as selected by readers.\r\nDavid Carbonara composed the original score for the series. Mad Men – Original Score Vol. 1 was released on January 13, 2009.\r\nAt the end of almost every episode, the show either fades to black or smash cuts to black as period music, or a theme by series composer David Carbonara, plays during the ending credits; at least one episode ends with silence or ambient sounds. A few episodes have ended with more recent popular music, or with a diegetic song dissolving into the credits music. Apple Corps authorized the use of The Beatles song \"Tomorrow Never Knows\" for the Season 5 episode \"Lady Lazarus\", and the same track was used over the closing credits. Lionsgate, which produces Mad Men, paid $250,000 for the use of the song in the episode. Bob Dylan's \"Don't Think Twice It's All Right\" ended the last episode of Season 1.\r\nCrew\r\nIn addition to creating the series, Matthew Weiner was the show runner, head writer, and an executive producer; he contributed to each episode through writing or co-writing the scripts, casting various roles, and approving costume and set designs. He was notorious for being selective about all aspects of the series, and maintained a high level of secrecy about production details. Tom Palmer served as a co-executive producer and writer on the first season. Scott Hornbacher (who later became an executive producer), Todd London, Lisa Albert, Andre Jacquemetton, and Maria Jacquemetton were producers on the first season. Palmer, Albert, Andre Jacquemetton, and Maria Jacquemetton were also writers on the first season. Bridget Bedard, Chris Provenzano, and writer's assistant Robin Veith completed the first-season writing team.\r\nLisa Albert, Andre Jacquemetton and Maria Jacquemetton returned as supervising producers for the second season. Veith also returned and was promoted to staff writer. Hornbacher replaced Palmer as co-executive producer for the second season. Consulting producers David Isaacs, Marti Noxon, Rick Cleveland, and Jane Anderson joined the crew for the second season. Weiner, Albert, Andre Jacquemetton, Maria Jacquemetton, Veith, Noxon, Cleveland, and Anderson were all writers for the second season. New writer's assistant Kater Gordon was the season's other writer. Isaacs, Cleveland, and Anderson left the crew at the end of the second season.\r\nAlbert remained a supervising producer for the third season but Andre Jacquemetton and Maria Jacquemetton became consulting producers. Hornbacher was promoted again, this time to executive producer. Veith returned as a story editor and Gordon became a staff writer. Noxon remained a consulting producer and was joined by new consulting producer Frank Pierson. Dahvi Waller joined the crew as a co-producer. Weiner, Albert, Andre Jacquemetton, Maria Jacquemetton, Veith, Noxon, and Waller were all writers for the third season. New writer's assistant Erin Levy, executive story editor Cathryn Humphris, script co-ordinator Brett Johnson and freelance writer Andrew Colville completed the third season writing staff.\r\nAlan Taylor, Phil Abraham, Jennifer Getzinger, Lesli Linka Glatter, Tim Hunter, Andrew Bernstein, and Michael Uppendahl were regular directors for the series. Matthew Weiner directed each of the season finales. Cast members John Slattery, Jared Harris and Jon Hamm also directed episodes.\r\nAs of the third season, seven of the nine writers for the show were women, in contrast to Writers Guild of America 2006 statistics that showed male writers outnumbered female writers by 2 to 1. As Maria Jacquemetton noted:\r\nWe have a predominately female writing staff—women from their early 20s to their 50s—and plenty of female department heads and directors. Matt Weiner and Scott Hornbacher hire people they believe in, based on their talent and their experience. \"Can you capture this world? Can you bring great storytelling?\"\r\nCast and characters\r\nMad Men focuses mostly on Don Draper, although it features an ensemble cast representing several segments of society in 1960s New York. Mad Men places emphasis on recollective progression as a means of revealing the characters' past.\r\nDon Draper\r\nDon Draper (Jon Hamm): Draper is the series' main protagonist. He is the creative director and junior partner of Sterling Cooper Advertising Agency and, as of the sixth season, a partner of Sterling Cooper & Partners. He is a hard-drinking, chain-smoking executive with a shadowy past who has achieved success in advertising. At the start of the series, Don is married to Elizabeth \"Betty\" Draper, with whom he has three children: Sally, Bobby, and Gene. Don keeps a lot of things hidden from Betty, along with his extensive history of adultery. Despite Don's best efforts, Betty gradually starts catching on, and when she learns about both his cheating and secret past, it leads to their separation and eventual divorce. It is gradually revealed over several seasons that Draper's real name is Richard \"Dick\" Whitman. During the Korean War, Whitman assumed the identity of his CO, Lieutenant Don Draper, who was killed in front of Whitman when their entire unit was ambushed. In the ensuing chaos, Whitman dropped his lit lighter on some fuel which caused some fuel drums to explode, killing Draper and injuring Whitman. Draper was due to be sent home, so Whitman found a way to escape his impoverished, dysfunctional family by switching dog tags with him.\r\nPeggy Olson\r\nPeggy Olson (Elisabeth Moss): Peggy rises from being Draper's secretary to being a copywriter with her own office. She becomes pregnant with Pete Campbell's child, a pregnancy that neither she nor her family or co-workers seem to notice, until she goes to the emergency room due to illness, and they tell her she is in labor. Campbell is unaware of her pregnancy until the end of Season 2, when Peggy tells him that she gave the baby up for adoption. In Season 3, she is approached by Duck Phillips to leave Sterling Cooper, but turns him down, despite the fact that his persistence leads to a romantic relationship. While he rarely acknowledges it, Don appreciates Peggy's abilities, leading him to choose her to go with him to Sterling Cooper Draper Pryce. She is given more freedom to come up with her own creative advertising ideas, with Don always pushing her to be better. During Season 5, Peggy feels increasingly unappreciated and patronized by Draper. In the episode \"The Other Woman\" she leaves SCDP to accept an offer to become head copywriter at Cutler, Gleason, and Chaough, though the agency merges with SCDP in Season 6, which once again places her under Don's leadership. In the final season, she transitions to the McCann Erickson agency and eventually finds her true feelings for Stan Rizzo.\r\nPete Campbell\r\nPete Campbell (Vincent Kartheiser): A young, ambitious account executive from an old New York family with connections and a privileged background. Often displaying recurring lapses in experience and judgment, his ruthless climb to the top causes him to attempt to blackmail Don with the Dick Whitman information he has learned, but it does not work. Pete and Don are antagonistic some of the time, but later develop a grudging respect for each other, culminating in Don's approaching Pete over Ken Cosgrove when forming a new agency. Campbell and his wife, Trudy (Alison Brie), were unable to conceive a child early in their marriage, and he only learned of his child with Peggy at the Season 2 finale. He and Trudy do conceive a daughter, Tammy, late in Season 4. At the end of Season 3, dissatisfied with his treatment at Sterling Cooper regarding a promotion, he secretly plans to leave the firm. Unaware of this, Don approaches Pete with an offer to join his new firm as long as Pete brings accounts worth $8 million in billings. Pete decides to join Don, with the condition that he be made a partner, though his surname does not appear in the new firm's name (Sterling Cooper Draper Pryce). Pete is one of the few characters in the show who does not smoke cigarettes, though he is seen smoking marijuana on one occasion. He looks up to Don in many ways, as both cheat on their wives and are not above manipulating or blackmailing. While Pete and Trudy separate in Season 6 after another one of his affairs, the two reconcile at the end of the series as he takes a lucrative offer with Learjet in Wichita, Kansas.\r\nBetty Draper\r\nBetty Draper (January Jones): Don Draper's wife and mother of their three children: Sally, Bobby, and Eugene Scott. Raised in the Philadelphia suburb of Elkins Park, Pennsylvania and a graduate of Bryn Mawr College, she met Don when she was a model in Manhattan and married him soon thereafter. At the start of the series, they have been married for seven years (since 1953) and live in Ossining, New York. Over the course of the first two seasons, Betty gradually becomes aware of her husband's womanizing. After a brief separation, Betty allows Don to return home when she learns she is pregnant with their third child, but not before having a one-night stand of her own. She leaves for Reno, Nevada, at the end of Season 3, in December 1963, with the intention of divorcing Don. At the start of Season 4, in November 1964, she has divorced Don and married Henry Francis. She and her children and new husband move to Rye. Betty's relationship with her children, particularly Sally, is often strained. At the end of Season 7, Betty learns that she has an advanced stage of lung cancer and is given six months to a year to live, even with aggressive treatment. She quickly accepts that her life will soon be over and makes plans for her funeral and her children's future care.\r\nJoan Holloway\r\nJoan Holloway (Christina Hendricks): Joan is the office manager and head of the secretarial pool at Sterling Cooper. She had a long-term affair with Roger Sterling until his two heart attacks (Season 1) caused him to end the relationship. In Season 2, she becomes engaged to Dr. Greg Harris (Samuel Page), and by Season 3, they are married and at his request she quits her job at Sterling Cooper. Their marriage is tested by her growing desire to continue her career despite his opposition, but his lack of skill as a surgeon and consequent difficulties securing work force her to return to work at a department store, prompting her to call Roger to ask for his help in finding an office job. Because of her invaluable organizational and managerial skills, she is hired for the new agency formed by Don, Roger, Lane, and Bert. Meanwhile, Greg's desire to further his career as a surgeon leads him to obtain a commission in the Army, and early in Season 4 he is sent to basic training and then to Vietnam. While her husband is deployed, she and Roger have one sexual encounter, which results in her becoming pregnant. She initially decides to terminate the pregnancy, but changes her mind and gives birth shortly before the beginning of Season 5, with her husband unaware that he is not the father. Greg returns from Vietnam during Season 5, but he and Joan separate, after he announces to her that he is returning to Vietnam for another tour of duty regardless of her feelings on the matter, and are divorced by the end of the season. By the close of Season 5, Joan has become a junior partner at SCDP in exchange for agreeing to sleep with a Jaguar executive to help land the account, which leads to conflict with Don in the Season 6, during which he ends the account with Jaguar just before SCDP makes a public offering. She is furious over the loss of potential earnings and the fact that her sacrifice has been for nothing. At the close of the series, she is subject to harassment by McCann executives, agrees to a buyout of her partnership stake, and starts a production company called Holloway Harris.\r\nRoger Sterling\r\nRoger Sterling (John Slattery); recurring Season 1, regular Seasons 2–7: Roger is one of the two senior partners of Sterling Cooper and former mentor to Don Draper. His father founded the firm with Bertram Cooper, hence his name comes before Cooper's in the firm's title. A picture in Cooper's office shows Roger as a child alongside Cooper as a young adult. In Season 2, Bertram Cooper mentions that \"the late Mrs. Cooper\" introduced Sterling to his wife, Mona, whom Sterling is in the process of divorcing in favor of Don's former secretary, 20-year-old Jane. Sterling, a World War II Navy veteran, was a notorious womanizer (living like he was \"on shore leave\") until two heart attacks changed his perspective, although they did not affect his drinking or smoking habits, which remained excessive. His experiences in the Pacific theater led him to harbor a strong contempt for the Japanese and refuse to do business with them, as seen in Season 4. Prior to his marriage to Jane, Roger had a long affair with Joan. In Season 4, he and Joan have a brief romantic encounter and Joan becomes pregnant. It is revealed in Season 3 that sometime in the early-1950s, when Don was a salesman at a furrier, and eager to break into advertising, Roger met him and, through that connection, Don was hired at Sterling Cooper. Season 4 has Roger less involved with the day-to-day activities at SCDP than he was at Sterling Cooper. His primary function is to manage the Lucky Strike account, which is responsible for over half of SCDP's billings. In the episode \"Chinese Wall,\" it's revealed that Lucky Strike is moving its account to a rival agency, forcing a dramatic downsizing of the firm. During Season 5, Roger is given new accounts to handle. He refocuses his efforts and lands a big account with Chevrolet Motor Company. He offers to financially support his son but Joan does not believe that he is reliable. By the end of the sixth season she agrees to let Roger into Kevin's life but not hers. At the close of the series, Roger indicates to her that half of his estate will go to Kevin in his will. Roger eventually marries Megan Draper's mother, Marie, and their honeymoon in Paris is part of the final montage in the series.\r\nKenneth \"Ken\" Cosgrove\r\nKenneth \"Ken\" Cosgrove (Aaron Staton): A young account executive originally from Vermont. Outside the office, Ken is an aspiring author who had a short story published in The Atlantic, which is a source of some envy by his co-workers, particularly the competitive Paul Kinsey and jealous Pete Campbell. According to his bio in The Atlantic, Ken attended Columbia University. His wife is Cynthia. He has one admirer, art director Salvatore \"Sal\" Romano, who secretly has a crush on him. Ken was promoted in the beginning of Season 3 to Account Director, a role he shared with Pete Campbell. Later on, the more easy-going Ken is promoted over the more ambitious Campbell to Senior Vice President of Account Services. However, at the end of Season 3, Draper and Sterling choose Pete over Ken for their new agency. During Season 4, Ken joins SCDP after working for McCann Erickson, which had bought Sterling Cooper, and BBD&O. When Pete learns of Ken's return, he is initially upset with Lane Pryce for not telling him, since Pryce had authorized Ken's previous promotion over Pete. However, when Ken agrees to serve under Pete as accounts manager at SCDP, the two reconcile over lunch and Pete comes to realize that Ken is a practical choice to help bring new business to the firm. In Season 5 it is discovered that Ken secretly writes science fiction short stories. In Season 6, he is wounded in the eye during a hunting accident with SCDP clients, Chevrolet. By Season 7, he shows increased stress over the state of the agency, and with the acquisition of SC&P by McCann Erickson, Ken is fired. However, he assumes his father-in-law's position at Dow Chemical and thus becomes a client for the remainder of the series run.\r\nHarold \"Harry\" Crane\r\nHarold \"Harry\" Crane (Rich Sommer): A bespectacled media buyer and head of Sterling Cooper's television department, which is created at Harry's initiative. Unlike his mostly Ivy League fellows, Harry went to the University of Wisconsin. Harry joins his colleagues in drinking and flirtations, though he is a dedicated husband and father. However, he does have a drunken one-night stand with Pete's secretary in Season 1, which leads to a brief separation from his wife Jennifer. Although he is well-meaning, Harry has a tendency to make poor decisions and avoid confrontations, which contributes to the dismissal of Sal Romano in Season 3. He is ultimately coerced by Draper and Cooper into joining Sterling Cooper Draper Pryce, although he comes to the realization that it is the right move on his own. When Sterling Cooper was in the process of being sold, Harry mistakenly thinks they are considering opening a West Coast office and believes that he would be the person to move to California. Harry later becomes a bit of a braggart, who is overly fond of discussing his Hollywood connections. In Season 5 he has abandoned his faithfulness to his wife as he discusses having affairs while abroad on business and is easily seduced by Paul's Hare Krishna girlfriend Lakshmi in his office. He also becomes increasingly image-conscious and petty, culminating in Season 6 when he explodes at Joan after she fires his secretary Scarlet for falsifying her time card, venting his frustration over her being made partner when he was not. By Season 7, the question of his being named partner is discussed again and endorsed by Jim Cutler, but the sale of SC&P to McCann Erickson eliminates that possibility. He also propositions Megan Draper in exchange for helping promote her acting career, but is rejected.\r\nPaul Kinsey\r\nPaul Kinsey (Michael Gladis); regular Seasons 1–3, guest star Season 5: A creative copywriter and Princeton University alumnus, the bearded, pipe-smoking Paul prides himself on his politically liberal views. Some time before the series began he had a relationship with Joan Holloway which ended badly, largely because Paul talked about it too much. Paul tried, unsuccessfully, to date Peggy soon after she was hired by Sterling Cooper. Through most of the second season, Paul dated Sheila White, an African-American woman from South Orange, New Jersey. They break up while in Oxford, Mississippi, where they had gone as Freedom Riders to oppose segregation in the South. It is a source of pride for Kinsey to live in the low-income, southern section of Montclair, New Jersey; Joan, however, mocks him as a shallow poseur. He is highly competitive, an attribute revealed to have soured a few friendships while he was in college, and which causes friction with Peggy, who quickly proves to be a superior copywriter to him. He is furious upon discovering that Don chose Peggy for the new agency over him. Paul did not appear after the third season finale until he reappeared in the tenth episode of Season 5, revealing himself to Harry as a disciple of Krishna Consciousness. Paul asks Harry to look at a Star Trek script he wrote, which Harry thinks is awful. Harry later realizes that Paul's girlfriend is manipulating him because of his recruiting skills within the Krishna movement, and encourages Paul to follow his dreams. He gives Paul $500 and tells him to get to Los Angeles as soon as possible.\r\nSalvatore \"Sal\" Romano\r\nSalvatore \"Sal\" Romano (Bryan Batt); regular Seasons 1–3: The Italian-American former art director at Sterling Cooper. Sal is a closeted homosexual. Reluctant to act upon his homosexuality, he twice avoids sexual encounters with men. By 1962, Sal has married Kitty, who seems unaware of Sal's sexual orientation, yet begins to realize that something is amiss in their relationship. Sal's secret crush on Ken Cosgrove comes close to being revealed during a dinner in Sal's apartment. Later, when a recently hired young advertising exec, Kurt, casually announces his homosexuality, Sal remains silent while his fellow co-workers speak disparagingly about Kurt. In the premiere of Season 3, Sal has a brief interrupted homosexual encounter with a hotel employee while in Baltimore, the end of which Don accidentally witnesses. Don, who was in the midst of a heterosexual encounter of his own at the same hotel, finesses this uncomfortable situation through a coded conversation about their current client, London Fog. He suggests the tagline \"Limit your exposure\". Later in Season 3, Sal rebuffs the sexual advances of Lee Garner Jr., the drunken playboy son of Lucky Strike's founder and a key client. Angered by the rejection, the client demands Sal be removed from the campaign and Roger fires Sal in order to appease the client and keep his $25 million account. In a conversation right after the firing, Don explains the agency cannot risk losing Lucky Strike and implies Sal should have gone along with Garner Jr. At the end of the episode, Sal is seen calling his wife Kitty from a phone booth in an area frequented by gay men cruising for sex. On the phone, Sal explains to Kitty he will be working late that night. Sal never appears again in the series.\r\nBertram \"Bert\" Cooper\r\nBertram \"Bert\" Cooper (Robert Morse); recurring Seasons 1–2, regular Seasons 3–7: The somewhat eccentric senior partner at Sterling Cooper. He leaves the day-to-day running of the firm to Sterling and Draper but is keenly aware of the firm's operations. Bertram is a Republican. He is fascinated by Japanese culture, requiring everybody, including clients, to remove their shoes before walking into his office, which is decorated with Japanese art. He is also a fan of the writings of Ayn Rand. Among his eccentricities, Bert frequently walks through the offices in his socks and intensely dislikes gum-chewing and smoking, an oddity for the time, especially considering Lucky Strike cigarettes is a major client through Season 4. He owns a ranch in Montana and is a widower with no children. Don approaches him about buying back the agency at the end of the third season, which evolves into their forming the new Sterling Cooper firm. In Season 4, Roger Sterling, being a WWII veteran of the Pacific theater, is outraged at the possibility of taking on a Japanese client, Honda. In a heated office meeting with some of the other executives including Peter Campbell, who had the lead, Roger says to Bert, \"Why don't we just get Dr. Lyle Evans in here?\" and storms out of the room, leaving Peter Campbell dumbfounded, asking, \"Who the hell is Dr. Lyle Evans?\" Interestingly enough, a few episodes later, a drunk and lonely Don who is pulling an all-nighter at the office with Peggy, stumbles upon an audio tape recording of Roger Sterling's memoirs that reveals that Bert received a war injury to his groin and was castrated by an incompetent doctor, named Lyle Evans. Later in Season 4, in the episode \"Blowing Smoke\", when the agency is forced to radically downsize its staff following the loss of the Lucky Strike account, Bert tells the others that he is quitting the business. He is not seen for the rest of the season but is back at work at the beginning of Season 5, although without an office. In Episode 10, Pete refers to the men's room as \"Cooper's office.\" Bert's sister Alice is a silent partner in Sterling Cooper. By the sixth season, Bert is increasingly frustrated with Don's erratic behavior and joins the other partners in placing him on a leave of absence. During the seventh season, he agrees to let Don return under an agreed set of stipulations. He dies while watching the Apollo 11 moon landing on television. He appears to Don in two dream sequences following his death.\r\nSally Draper\r\nSally Beth Draper (Kiernan Shipka); recurring Seasons 1–3, regular Seasons 4–7: The eldest child of Don and Betty Draper; her relationship with her mother is often strained. Sally is a minor character through the first two seasons but assumes a larger role during the third season as she approaches adolescence. She forms a strong bond with her grandfather, Gene Hofstadt, when he comes to live with the Drapers and is devastated by his sudden death. She also becomes distraught when Don and Betty break the news that they are getting a divorce, reproaching her father for breaking his promise to always be there and accusing her mother of making him leave. She develops a friendship with Glen, a boy who lives down the street from her (and of whom her mother does not approve). Betty is extremely jealous of this relationship and seeks to sabotage it, deciding to move the family to Rye, New York and firing Carla, the housekeeper, when she lets Glen in the house to say goodbye to Sally. In Season 5, Sally is shown to continue her friendship with Glen through phone calls and secret meetings. When Don marries Megan Calvet, Sally establishes a mostly positive relationship with Megan. During the sixth season, Sally is accepted to Miss Porter's School but gets suspended after being caught buying alcohol with a fake ID. In the final season, Sally's disillusion with both of her parents is evident but changes upon the news of Betty's cancer diagnosis.\r\nRachel Katz\r\nRachel Katz (née Menken) (Maggie Siff); regular Season 1, guest star Seasons 2 and 7: The Jewish head of a department store who comes to Sterling Cooper in search of an advertising agency to revamp her business's image. She is initially cool towards Don Draper, who bristles at her assertive, independent image but they warm to each other and eventually begin an affair. In the course of their affair, Don tells her things he has not shared with Midge Daniels (his previous mistress) or his wife. When Don is blackmailed by Pete Campbell, he comes to Rachel with the suggestion that they run away together to Los Angeles. She reminds him of his duty to his children and questions whether he would want to abandon his children after having grown up without a father. When Don persists, Rachel comes to the realization that he didn't want to run away with her, he simply wanted to run away. Ironically, her calling him a coward and urging him to think more clearly inspires him to persuade Pete to stand down. The relationship seems to collapse from that point on, and Cooper complains to Don about how upset he has made her. Don and Rachel end the affair at some point between the first and second seasons. He encounters her again in Season 2 while out to eat with Bobbie Barrett, finding out that Rachel has moved on and married a man named Tilden Katz. Though it appears that Don is only momentarily shaken by the news of her marriage, several episodes later, after drinking heavily with Roger and Freddie Rumsen, he gives his name as \"Tilden Katz\" to the bouncer of an underground club Roger is trying to get them into. In Season 7, Don sees Rachel in a vision while auditioning actresses for a fur commercial, but when he attempts to contact her, he learns that Rachel had two children and that she died from leukemia.\r\nLane Pryce\r\nLane Pryce (Jared Harris); recurring Season 3, regular Seasons 4–5: The English financial officer installed by Sterling Cooper's new British parent company. He first appears in the first episode of Season 3. His role is that of a strict taskmaster who brings spending under control, in particular by cutting out frivolous expenses. His efforts are so successful, he is to be sent to India to enact cost-cutting measures, a move which Pryce is not looking forward to after having settled in with his wife and child in New York. An unfortunate accident at work handicaps his replacement, thus allowing Pryce to keep his current position. He warms to American culture, and foresees some form of cultural and societal changes in American race relations. When the British parent company is sold at the end of Season 3, Pryce realizes he has become expendable and negotiates to become a founding partner in the new agency that Don Draper, Bert Cooper and Roger Sterling want to form. At Draper's suggestion, Pryce frees Sterling, Cooper, and Draper from their contractual non-compete clauses by firing them, then is fired himself, enabling the four of them to start their own firm. When hard times hit SCDP after Lucky Strike, their largest client, leaves them in Season 4, Pryce liquidates his portfolio in order to pay his share of the cash infusion required by the bank as collateral for a loan that keeps SCDP afloat. His finances already tight, he faces a crisis when the British Inland Revenue demand immediate payment of back taxes on the gain from the sale of his portfolio in Season 5. In order to pay the debt, Pryce secretly negotiates a $50,000 line of credit on behalf of the firm and announces to the partners that SCDP has a $50,000 profit and is able to pay bonuses. In anticipation of the bonus, Pryce forges Draper's signature on an early bonus check to himself, and views it as a 13-day loan which will be made good once the bonuses are paid. However, the partners decide to forgo their bonuses despite Pryce's pleading. In the penultimate episode of Season 5, Cooper discovers the canceled check and confronts Draper, who in turn confronts Pryce, demanding his resignation. That weekend, Pryce types out a resignation letter and hangs himself in his office.\r\nMegan Draper\r\nMegan Draper (née Calvet) (Jessica Paré); recurring Season 4, regular Seasons 5–7: Don's wife (as of the beginning of Season 5) and a junior copy writer at SCDP. Initially Megan is a receptionist at SCDP, but following the death of Miss Blankenship, she takes over as Don Draper's secretary. In the Season 4 finale, Don takes Megan on a trip to California to take care of his kids. In spite of being involved with Faye Miller, a marketing research consultant who works with SCDP, he proposes marriage to Megan and she accepts. In the episode \"Lady Lazarus,\" she leaves the firm to pursue her dream of acting, and (with the help of Don) lands her first acting gig in one of SCDP's commercials by the Season 5 finale. Don seems to be more honest with Megan than he was with Betty, apparently telling Megan about his true identity between Seasons 4 and 5. At the same time, he retains some of those possessive qualities he displayed during his previous marriage, although Megan is more stubborn and combative than Betty. Megan relocates permanently to California to pursue her acting career and she and Don divorce during Season 7. Megan is originally from Montreal, and French is her first language.\r\nStan Rizzo\r\nStan Rizzo (Jay R. Ferguson); recurring Season 4, regular Seasons 5–7: The art director at Sterling Cooper Draper Pryce. Before coming to the company, he worked for Lyndon B. Johnson's 1964 Presidential campaign. He and Peggy are often at odds with each other due to his abrasive attitude, although the two later develop a strong working relationship after Peggy challenges Stan over working in the nude for a campaign, which Stan gruffly concedes to her. Stan is one of the few members of the SCDP creative department who survive the staff cuts. He makes the transition to McCann Erickson in Season 7 and tells Peggy of his love for her at the conclusion of the series, which Peggy reciprocates.\r\nHenry Francis\r\nHenry Francis (Christopher Stanley); recurring Seasons 3–4, regular Seasons 5–7: A political adviser with close connections to New York Governor Nelson Rockefeller and the Republican Party, it is later revealed that he serves as the Director of Public Relations and Research in the Governor's Office. He is instantly infatuated with the six-months-pregnant Betty Draper when he meets her at the Sterlings' Kentucky Derby party as she is waiting by the women's restroom. Later, he is called upon by Betty Draper and some of her friends to use his influence to save a local reservoir, and he and Betty develop a personal connection. Betty reciprocates Henry's attention because she increasingly feels no connection with Don due to his non-stop infidelities, lies over his true identity, and his dismissive and sometimes verbally abusive attitude towards her. After the death of Betty's beloved father, the much older Henry also serves as a replacement father-figure for her. Henry and Betty have only a few brief and furtive meetings before Henry proposes marriage in the wake of the Kennedy assassination. Season 3 ends with the two of them on a plane with baby Gene, presumably flying to Reno so Betty can obtain a quick divorce from Don. At the start of Season 4, we see that Henry and Betty have married and Henry has rather uncomfortably taken up residence in the Drapers' house, living with Betty and her three children and paying rent to Don. He tries to soothe Betty as she continues to react angrily to Don and his irresponsibility towards the children, but gets more fed up over time. Betty, on her part, feels unaccepted by Henry's family, especially when she is unable to control Sally during a family visit to Henry's mother's house. At the end of Season 4, they decide to move to Rye, NY. Their relationship during Season 5 seems to be more affectionate, though Henry still periodically loses his temper with Betty. The news of Betty's cancer in Season 7 devastates him and despite her desire to keep the illness from the children, Henry informs Sally of her mother's condition.\r\nTed Chaough\r\nTed Chaough (Kevin Rahm); recurring Seasons 4–5, regular Seasons 6–7: A self-proclaimed rival of Don Draper in the advertising world, his agency—Cutler Gleason and Chaough (CGC)—was in competition with SCDP for an account with Honda. Don tricked Ted into making an expensive presentation to Honda executives, which backfired on Ted as he violated Honda's presentation rules (no finished work or commercials allowed at the presentation). Though the two agencies are comparable in size, he seems obsessed with competing against Don. Ted also tried to woo Pete Campbell over to his agency. After Don writes his New York Times ad about dropping business with cigarette companies, Ted makes a prank call to Don pretending to be Robert F. Kennedy. When he returns in Season 5 to recruit Peggy to leave SCDP and join his advertising firm, he remains very confident but is much less obnoxious than in his previous appearances; he does not indulge his typical dislike and jealousy of Don to Peggy, and that helps her decide to accept his offer, which in the season finale has him assigning her a huge amount of material involving an account for cigarettes aimed at female consumers. During Season 6, Ted and Don impulsively decide to merge their smaller firms so as to compete with the larger ones; however, this leads to numerous small struggles for power between them. In the Season 6 finale, Ted moves to a California SC&P office to have a \"new start\" after a short-lived affair with Peggy. He returns in Season 7 after the McCann purchase and settles into the culture of the firm.\r\nMichael Ginsberg\r\nMichael Ginsberg (Ben Feldman); recurring Season 5, regular Seasons 6–7: First appearing in the episode \"Tea Leaves\" (Season 5, Episode 3), Michael is hired as a part-time copywriter by Sterling Cooper Draper Pryce. He is initially hired to service the Mohawk account, and proves himself to be both prolific and innovative. He quickly becomes an essential part of the creative team and surpasses Peggy Olson midway through the season as the firm's most productive writer, while Peggy becomes mired in the Heinz story arc. Ginsberg is an idiosyncratic, socially awkward character who tends to speak his mind, which can be both a help and hindrance to him. Indeed, his position at the firm is threatened at times, including at his interview, when Peggy decides not to employ him for fear of his being too extroverted for Don's tastes. However, this decision is reversed by Roger, who has already told Mohawk that they have taken him on. As the firm's only Jewish copywriter, Roger uses this to his advantage to help Jewish clients, like Manischewitz. His role at SCDP becomes more integral after Peggy leaves the agency, though he commands almost none of the respect and support from Don that she did. His paranoia about the newly installed computer in the office drives him insane, eventually cutting off his own nipple as a gift to Peggy; he is then taken to a psychiatric hospital.\r\nRobert \"Bobby\" Draper\r\nRobert \"Bobby\" Draper (Mason Vale Cotton; previously Maxwell Huckabee, Aaron Hart, and Jared Gilmore) recurring Seasons 1–5; regular Seasons 6–7: The middle child of Don and Betty Draper. He was referred to by his mother Betty as a \"little liar.\" Bobby was mentioned as being 5 years old in the Season 2 episode \"The Mountain King,\" making his birthdate between October 1956 and September 1957. Despite not having many story lines during the series, Bobby is shown to be affected by his parents' divorce but grows fond of Don's and Betty's new spouses, Megan and Henry, respectively. In Season 6, he expresses sympathy towards Black people just after the assassination of Martin Luther King, Jr. and fears Henry might be shot. By Season 7, Bobby grows troubled over the increased arguments between Betty and Henry.\r\nEpisodes\r\nThemes and motifs\r\nMad Men depicts parts of American society of the 1960s, including cigarette smoking, drinking, sexism, feminism, adultery, homophobia, antisemitism and racism. Themes of alienation, social mobility and ruthlessness set the tone of the show. MSNBC noted that the series \"mostly remains disconnected from the outside world, so the politics and cultural trends of the time are illustrated through people and their lives, not broad, sweeping arguments\".\r\nAccording to Weiner, he chose the 1960s because:\r\nvery time I would try and find something interesting that I wanted to do, it happened in 1960. It will blow your mind if you look at the year on the almanac. And it's not just the election. The pill came out in March 1960, that's really what I wanted it to be around.… That's the largest change in the entire world. Seriously, it's just astounding. Especially if you look at the movies from the 50s. Once it was acceptable to talk about this idea that teenagers were having sex, which they have been doing, obviously, since time immemorial, there were all these movies like Blue Denim and Peyton Place.…he central tension in every movie that does not take place on the battlefield is about a girl getting pregnant. So all of a sudden that entire issue has been removed from society. That was what I was interested in in 1960.\r\nIdentity and memory\r\nTelevision commentators have noted the series's study of identity. This theme is explored most candidly through Don Draper's identity fraud during the Korean War, in which he takes on an officer's name to desert the army. Tim Goodman considers identity to be the show's leitmotiv, calling Don Draper \"a man who's been living a lie for a long time. He's built to be a loner. And over the course of three seasons we've watched him carry this existential angst through a fairy-tale life of his own creation.\" As noted by Gawker:\r\nNot only is the agency of Sterling Cooper Draper Pryce in the business of spinning them—or at least warping the truth—to sell product, but the main character, Don Draper, is built on a lie. Just like one of his campaigns, his whole identity is a sweet fabrication, a kind of candy floss spun out of opportunity, innuendo, and straight-up falsehood.\r\nThe New Republic writer Ruth Franklin said that \"The show's method is to take us behind the scenes of the branding of American icons—Lucky Strike cigarettes, Hilton hotels, Life cereal—to show us not how the products themselves were created, but how their 'very sexy…very magical' images were dreamed up.\" She went on to say that, \"In this way, we are all Don Drapers, obsessed with selling an image rather than tending to what lies underneath. Draper's fatal flaw is his lack of psychological awareness: He is at once perfectly tuned into the desires of America and entirely out of touch with his own character.\" One reviewer said that \"Identity is a key theme in Mad Men, and nobody is ever quite who they appear to be. Each one is filled with thwarted ambitions and frustrated dreams, none more so than Don Draper himself, whose closet, it's gradually revealed over Seasons 1 and 2, is filled with proverbial skeletons.\"\r\nGender and sexuality\r\nThe show presents a workplace culture in which men frequently enter sexual relationships with women in which it is assumed that female employees are sexually available for their male bosses and in which jokes about the desirability of one's wife dying are told by husbands in front of their own wives. Most of the main characters have cheated on their wives. Marie Wilson, in an op-ed for The Washington Post, said that:\r\nt is difficult and painful to see the ways in which women and men dealt with each other and with power. It's painful because this behavior is not as far back in our past as we would like to think. Our daughters continually get the messages that power still comes through powerful men. And unfortunately being pretty is still a quality that can get you on the ladder—though it still won't take you to the top.\r\nAccording to the Los Angeles Times:\r\nhe sexism, in particular, is almost suffocating, and not in the least fun to watch. But it's the force against which the most compelling female characters struggle, and the opposition that defines them. The interaction with everyday misogyny and condescension—the housewife whose shrink reports to her husband, the ad woman who's cut out of the after-hours wheeling and dealing—gives the characters purpose and shape.\r\nIn Salon, Nelle Engoron argued that while Mad Men seems to illuminate gender issues, its male characters get off \"scot-free\" for their drinking and adultery, while the female characters are often punished. Stephanie Coontz of The Washington Post said that women \"portrayed the sexism of that era so unflinchingly, they told me, that they could not bear to watch.\" Some women interviewed mentioned that they had experienced the same \"numbness of Betty Draper\" and witnessed the \"sense of male entitlement similar to Don's.\"\r\nAviva Dove-Viebahn wrote that \"Mad Men straddles the line between a nuanced portrayal of how sexism and patriarchal entitlement shape lives, careers and social interactions in the 1960s and a glorified rendering of the 'fast-paced, chauvinistic world of 1960s advertising and all that comes with it.'\" Melissa Witkowski, writing for The Guardian, argued that Peggy's ascendancy was marred because the show \"strongly implies that no woman had ever been a copywriter at Sterling Cooper prior to Peggy, but the circumstances of her promotion imply that this was merely because no woman had ever happened to have shown talent in front of a man before,\" pointing out that Peggy's career path bore little resemblance to the stories of successful ad women of the time such as Mary Wells Lawrence and Jean Wade Rindlaub. In 2013, the U.S. President Obama said \"Peggy Olson gave him insight into how his strong-willed grandmother dealt with life in a man's world.\"\r\nAlcoholism\r\nAs the show's time progresses into the 1960s, the show portrays a world of liquor-stocked offices, boozy lunches and alcohol-soaked dinners. One incident in Season 2 finds advertising executive Freddy Rumsen being sent to rehab after urinating on himself. During the fourth season, Don Draper starts to realize he has a major drinking problem. In the sixties, bad behavior resulting from drinking was often considered macho and even romantic, rather than as result of addiction. One reviewer called the fourth season a \"sobering tale of drunken excess\" as the Don Draper character struggled with his addiction to alcohol.\r\nAdvertisement executive Jerry Della Femina said of the show:\r\nf anything, it's underplayed. There was a tremendous amount of drinking. Three-martini lunches were the norm…while we were still looking at the menu, the third would arrive.… The only thing that saved us was that the clients and agencies that we were going back to drank as much as we did.… Bottles in desk drawers were not the exception but the rule.\r\nCounterculture\r\nThe Los Angeles Times opined that Mad Men excels at \"stories of characters fighting to achieve personal liberation in the restless years before the advent of the full-blown culture wars.\" One reviewer was excited that the fourth season, through Peggy, brought \"the introduction to the Counterculture (Andy Warhol as the King of Pop and Leader of the Band), with all the loud music, joint-passing, underground movies so present in those times. Peggy's visit to a loft, with a Life Magazine photo editor-friend, placed her squarely in the center of the exciting creativity so rampant in the underground and also so rebellious against the mainstream.\" The Huffington Post focused on one scene where \"Peggy joins her new beatnik friends in the lobby while Pete stays behind with the SCDP partners to relish…his newly captured $6 million account. As they embark on their opposite trajectories, the camera lingers on their knowing glances. Here is where we find emotional truth.\"\r\nRacism\r\nCritics contend that post-racial beliefs complicate the show by only visualizing people of color at work and rarely in their homes or from their point of view. Several writers have argued that the show distorts history by not showing black admen, noting real-life successful African American advertising executives who got their start in the 1960s such as Clarence Holte, Georg Olden, and Caroline Robinson Jones. Latoya Peterson, writing in Slate magazine's Double X, argued that Mad Men was glossing over racial issues.\r\nSlate writer Tanner Colby praised the show's treatment of race and Madison Avenue as historically accurate, especially the storyline in the third season episode \"The Fog\" in which Pete Campbell's idea to market certain products specifically towards African-Americans is struck down by the company. Slate also referred to the fourth season episode, \"The Beautiful Girls\", in which Don shoots down Peggy Olson's suggestion of Harry Belafonte as a spokesman for Fillmore Auto, after Fillmore Auto faced a boycott for not hiring black employees. Colby also pointed to an exposé published in a 1963 issue of Ad Age that revealed that \"out of over 20,000 employees, the report identified only 25 blacks working in any kind of professional or creative capacity, i.e., nonclerical or custodial.\" Colby wrote, \"Mad Men isn't cowardly for avoiding race. Quite the opposite. It's brave for being honest about Madison Avenue's cowardice.\"\r\nSmoking\r\nCigarette smoking, more common in the United States of the 1960s than it is now, is featured throughout the series; many characters can be seen smoking several times over the course of an episode. In the pilot, representatives of Lucky Strike cigarettes come to Sterling Cooper looking for a new advertising campaign in the wake of a Reader's Digest report that smoking will lead to illnesses, including lung cancer. Talk of smoking being harmful to health and physical appearance is usually dismissed or ignored. In the fourth season, after Lucky Strike fires Sterling Cooper Draper Pryce as its ad agency, Draper writes an advertisement in The New York Times titled \"Why I'm Quitting Tobacco\", which announces SCDP's refusal to take tobacco accounts. The finale finds the agency in talks with the American Cancer Society. In the series's penultimate episode, Betty Draper is diagnosed with terminal lung cancer, after having been depicted as a heavy smoker throughout the series. The actors smoke herbal cigarettes, not tobacco cigarettes; Matthew Weiner said in an interview with The New York Times that the reason is that \"you don't want actors smoking real cigarettes. They get agitated and nervous. I've been on sets where people throw up, they've smoked so much.\"\r\nReception\r\nCritical response\r\nMad Men received widespread critical acclaim throughout its run, and is generally included on critics' lists of the greatest television shows of all time. The American Film Institute selected it as one of the top ten television programs of 2007, 2008, 2009, 2010, and 2012 (having aired no episodes during 2011) and it was named the best television show of 2007 by the Television Critics Association and several national publications, including the Chicago Tribune, The New York Times, the Pittsburgh Post-Gazette, TIME Magazine, and TV Guide.\r\nOn the review aggregator website Metacritic, the first season scored 77/100; the second season scored 88/100; the third season scored 87/100; the fourth season scored 92/100; the fifth season scored 89/100; the sixth season scored 88/100; the seventh season, part one scored 85/100; and the seventh season, part two scored 83/100. It was ranked 21st in TV Guide's 2013 list of the 60 best TV series ever, and the Writers Guild of America named it seventh in a list of the 101 best-written shows in the history of television. Rob Sheffield of Rolling Stone called Mad Men \"the greatest TV drama of all time.\" In 2022, Rolling Stone ranked Mad Men as the seventh-greatest TV show of all time.\r\nA New York Times reviewer called the series groundbreaking for \"luxuriating in the not-so-distant past.\" Regarding Season 3, Matthew Gilbert of The Boston Globe wrote \"it's an absolutely gorgeous, amber-tinted vision of the early 1960s\" and added \"detailed with enough 1950s-era accoutrements to seem authentically Camelot.\"\r\nThe San Francisco Chronicle called Mad Men \"stylized, visually arresting…an adult drama of introspection and the inconvenience of modernity in a man's world.\"\r\nA Chicago Sun-Times reviewer described the series as an \"unsentimental portrayal of complicated 'whole people' who act with the more decent 1960 manners America has lost, while also playing grab-ass and crassly defaming subordinates.\" The reaction at Entertainment Weekly was similar, noting how in the period in which Mad Men takes place, \"play is part of work, sexual banter isn't yet harassment, and America is free of self-doubt, guilt, and countercultural confusion.\" The Los Angeles Times said that the show had found \"a strange and lovely space between nostalgia and political correctness.\" The show also received critical praise for its historical accuracy – mainly its depictions of gender and racial bias, sexual dynamics in the workplace, and the high prevalence of smoking and drinking.\r\nThe Washington Post agreed with most other reviews in regard to Mad Men's visual style, but disliked what was referred to as \"lethargic\" pacing of the storylines. A review of the first season DVD set in the London Review of Books by Mark Greif was much less laudatory. Greif stated that the series was an \"unpleasant little entry in the genre of Now We Know Better\" as the cast was a series of historical stereotypes that failed to do anything except \"congratulate the present.\" In a February 2011 review of the show's first four seasons, critic Daniel Mendelsohn wrote a critical review that called Mad Men a \"drama with aspirations to treating social and historical 'issues'—the show is melodramatic rather than dramatic.\"\r\nIn 2019, The Guardian, which ranked the show 3rd on its list of the 100 best TV shows of the 21st century, stated that by spanning the entire 60s, Mad Men showed \"the mammoth social shifts in an ad agency in minute detail, and became…a meditation on how modern America came to be made, one iconic advert at a time.\"\r\nRatings\r\nViewership for the premiere at 10:00 pm on July 19, 2007, was higher than any other AMC original series at that time, and attained a 1.4 household rating, with 1.2 million households and 1.65 million total viewers. The numbers for the first season premiere were more than doubled for the heavily promoted second season premiere, which received 2.06 million viewers. A major drop in viewership for the episode following the second season premiere prompted concern from some television critics. However, 1.75 million people viewed the second season finale, which was up 20% over the season 2 average, and significantly more than the 926,000 people who viewed the first season finale. The cumulative audience for the episode was 2.9 million viewers, when the two re-broadcasts at 11:00 pm and 1:00 am were factored in.\r\nThe third season premiere, which aired August 16, 2009, garnered 2.8 million views on its first run, and 0.78 million with the 11:00 pm and 1:00 am repeats. In 2009, Mad Men was second in Nielsen's list of Top 10 timeshifted primetime TV programs, with a 57.7% gain in viewers, second only to the final season of Battlestar Galactica.\r\nThe fourth season premiere received 2.9 million viewers, and was up five percent from the ratings for the debut of season 3 and up 61 percent from the third season average, and became the most watched-episode in AMC history until its fifth season premiere, and later, the series premieres of The Walking Dead and Better Call Saul.\r\nThe fifth season premiere, \"A Little Kiss\", was the most watched episode of Mad Men of all time to date, receiving 3.54 million viewers and 1.6 million viewers in the 18–49 demographic. Before the fifth season, Mad Men had never achieved above a 1.0 in the 18–49 demographic. Charlie Collier, AMC's president, said that:\r\nFor each of the five Mad Men seasons Matthew Weiner and his team have crafted a beautifully told story and each season a larger audience has responded; a rare accomplishment. We couldn't be more proud of this program, the brilliant writers, cast and crew, and the entire team on each side of the camera.\r\nThe fifth season finale, \"The Phantom\", was watched by 2.7 million viewers, which was the highest ratings for a Mad Men finale until the series finale aired on May 17, 2015. In 2012, the series was second in Nielsen's list of Top 10 timeshifted primetime TV programs, with a 127% gain in viewers.\r\nOn April 7, 2013, the sixth season premiered to 3.37 million viewers, and a 1.1 adults 18–49. This was down from the fifth season premiere, but up from the fifth season finale. The sixth season finale on June 23, 2013, attracted 2.69 million total viewers, and achieved a 0.9 adults 18–49 demographic rating; on par with the fifth season finale. This helped bring the season average up to 2.49 million viewers, down just slightly from the season five average.\r\nThe first part of the seventh season, titled \"The Beginning\", premiered on April 13, 2014, and garnered 2.27 million total viewers and a 0.8 adults 18–49 rating. This was down 48 percent in viewers and 38 percent in adults 18–49 from the sixth season premiere, and down from the sixth season finale. The first part of season seven concluded on May 25, 2014, to 1.94 million viewers and a 0.7 adults 18–49 rating, down in both from the season 6 finale. This brought the average for the first part of the season down to 2.01 million viewers. The second part of season seven, titled \"The End of an Era\", premiered on April 5, 2015, to 2.27 million viewers and a 0.8 adults 18–49 rating; identical to the season 7 premiere. The series finale of Mad Men aired on May 17, 2015, to 3.29 million viewers and a 1.1 adults 18–49 rating. 1.7 million of these viewers were aged 25–54, and 1.4 million were ages 18–49, making it the highest viewed and highest rated episode since the sixth season premiere. This episode brought up the part two average to 2.12 million viewers, and brought up the overall season seven average to 2.06 million viewers.\r\nAuthenticity\r\nWith Mad Men, Weiner and his creative team have \"received critical acclaim for its historical authenticity and visual style\" although opinions on Mad Men vary among people who worked in advertising during the 1960s. According to Robert Levinson, a consultant for Mad Men who worked at BBDO from 1960 to 1980, \"what captured was so real. The drinking was commonplace, the smoking was constant, the relationships between the executives and the secretaries was exactly right\". Jerry Della Femina, who worked as a copywriter in that era and later founded his own agency, said that the show is accurate in its depiction of \"the smoking, the prejudice and the bigotry\".\r\nAllen Rosenshine, a copywriter who went on to lead BBDO, called the show a \"total fabrication\", saying that \"if anybody talked to women the way these goons do, they'd have been out on their ass\". George Lois, who worked at Doyle Dane Bernbach for a year, before starting his own ad agency in 1960, said:\r\nMad Men is nothing more than the fulfilment of every possible stereotype of the early 1960s bundled up nicely to convince consumers that the sort of morally repugnant behavior exhibited by its characters…is glamorous and vintage.…nlike the TV 'Mad Men,' we worked full, exhausting, joyous days: pitching new business, creating ideas, \"comping\" them up, storyboarding them, selling them, photographing them, and directing commercials. And our only 'extracurricular activity' was chasing fly balls and dunking basketballs on our agency softball and basketball teams!\r\nAndrew Cracknell, author of The Real Mad Men: The Renegades of Madison Avenue and the Golden Age of Advertising, also thought the show lacked authenticity, stating, \"One thing of which they all are all equally contemptuous\", in regards to the industry's elite, \"is the output of Sterling Cooper. But then they have every right. None of them would ever have wanted to work for Draper and none of his departments would have got a job at any of their agencies. Particularly Draper himself. Too phony.\"\r\nAccording to an analysis of the language used in Mad Men by Benjamin Schmidt, a visiting graduate fellow at the Cultural Observatory at Harvard University, the vocabulary and phrases used in the show are not all quite authentic to the period, despite attempts to use contemporary vocabulary. Using a computer program, he determined that the show uses relatively few words that are clearly anachronistic but that there are many words and phrases used that are far more common in modern speech, than in the speech of the era (\"need to\", \"feel good about\", \"euthanize\", etc). In aggregate these words and constructions give a misleading impression of the speech patterns of the time. He notes that the use of modern business language (leverage, signing bonus, etc.) unknown or little used at the time \"creeps in with striking regularity.\"\r\nLegacy and influence\r\nMad Men was credited with setting off a wave of renewed interest in the fashion and culture of the early 1960s. According to The Guardian in 2008, the show was responsible for a revival in men's suits, especially suits resembling those of that period, with higher waistbands and shorter jackets; as well as \"everything from tortoise shell glasses to fedoras.\" According to the website BabyCenter, the show led to the name \"Betty\" soaring in popularity for baby girls in the United States in 2010. According to The Arizona Republic, a resurgence in interest for Mid-century modern furnishings and decor also coincided with the emergence of the show. New York Times theater critic Ben Brantley wrote in 2011 that the success of Mad Men had turned \"the booze-guzzling, chain-smoking, babe-chasing 1960s\" into \"Broadway's decade du jour\", citing three 1960s-set musicals that had appeared on Broadway in the past year: revivals of Promises, Promises and How to Succeed in Business Without Really Trying, and a new musical, Catch Me If You Can. Brantley also wrote, \"I'm presuming that Mad Men is the reason this Promises, Promises is set not in the late '60s, as the original was, but in 1962.\"\r\nThe 2009 TNT series Trust Me, which ran for one season, was set at a modern-day advertising agency; television critic Tom Shales called it a cross between Mad Men and another television show, Nip/Tuck. Two network television series that premiered in 2011, the short-lived The Playboy Club and the one-season Pan Am, both set in 1963, were frequently referred to as imitations of Mad Men. The British TV drama The Hour, which also premiered in 2011, and is set in 1956, was also described as influenced by Mad Men. The 2014 Syfy miniseries Ascension was described as \"Mad Men in space\". Don Draper's rendition of the Frank O'Hara poem \"Mayakovsky\" from Meditations in an Emergency, at the end of \"For Those Who Think Young\" (season two, episode one), led to the poet's work entering the top 50 sales on Amazon.com.\r\nThe appearance of Christina Hendricks as office manager Joan, is said to have sparked a renewed interest in a voluptuous look for women and to be partly responsible for, among other things, a 10 percent increase in breast augmentation in the United Kingdom in 2010.\r\nThe nostalgia for the fashions and social norms of the early 1960s engendered by Mad Men was criticized by some commentators. Amy Benfer, writing in 2009 for Salon, asked, \"But isn't it a little odd that a show that, among other things, warns about the dangers of seeing the past in too amber a light has spawned an industry devoted to fetishizing nostalgia for that same flawed past?\"\r\nIn the 2014 State of the Union Address, President Barack Obama, in speaking out against unequal pay for women, said \"It's time to do away with workplace policies that belong in a Mad Men episode.\" Matthew Weiner released a statement saying that he \"supports the president,\" and that he was \"honored that our show is part of a much-needed national conversation.\" In 2015, a sculpture of a bench dedicated to Mad Men featuring the image of Don Draper from the opening credit sequence was unveiled in front of the Time-Life Building.\r\nThe show's success is also credited with sparking the resurgence of the AMC cable television channel.\r\nAwards and accolades\r\nMad Men was the recipient of many nominations and awards from various organizations, including the American Film Institute, Emmys and Creative Arts Emmys from the Academy of Television Arts & Sciences, a Peabody Award from the Peabody Board at the Grady College of Journalism and Mass Communication, Satellite Awards from the International Press Academy, and British Academy Television Awards from the British Academy of Film and Television Arts. Numerous nominations and award were also received from guilds and societies such as the Art Directors Guild, Casting Society of America, Cinema Audio Society, Costume Designers Guild, Directors Guild of America, Motion Picture Sound Editors, Producers Guild of America, Screen Actors Guild, Television Critics Association, and Writers Guild of America.\r\nAward highlights include winning the Primetime Emmy Award for Outstanding Drama Series four times, for each of its first four seasons; its fourth win tied the record for serial dramas set earlier by Hill Street Blues (1981–84), L.A. Law (1987, 1989–91), and The West Wing (2000–03). In 2012 Mad Men set a record for the most Emmy nominations, 17, without winning. A 2015 The Hollywood Reporter survey of 2,800 actors, producers, directors, and other industry people named it as their #9 favorite show.\r\nMarketing\r\nSeason premiere campaigns\r\nIn promotions for the series, AMC aired commercials and a behind-the-scenes documentary on the making of Mad Men before its premiere. The commercials mostly show the one (usually brief) sex scene from each episode of the season. The commercials, as well as the documentary, featured the song \"You Know I'm No Good\" by Amy Winehouse. The documentary, in addition to trailers and sneak peeks of upcoming episodes, were released on the official AMC website. Mad Men was also made available at the iTunes Store on July 20, 2007, along with the \"making of\" documentary.\r\nFor the second season, AMC undertook the largest marketing campaign it had ever launched, intending to reflect the \"cinematic quality\" of the series. The Grand Central Terminal subway shuttle to Times Square was decorated with life-size posters of Jon Hamm as Don Draper, and quotes from the first season. Inside Grand Central, groups of people dressed in period clothing would hand out \"Sterling Cooper\" business cards to promote the July 27 season premiere. Window displays were arranged at 14 Bloomingdale's stores for exhibition throughout July, and a 45' by 100' wallscape was posted at the corner of Hollywood and Highland in downtown Hollywood. Television commercials on various cable and local networks, full-page print ads, and a 30-second trailer in Landmark Theaters throughout July were also run in promotion of the series. Television promotions for the second season featured the song \"The Truth\" by Handsome Boy Modeling School.\r\nThe advertising campaign for the fifth season of Mad Men was conceived by the network as a way to promote the series after the 17-month break between seasons. A teaser campaign began in which posters, using images of the enigmatic \"falling man\" from the opening credits, were spread out on buildings in New York and Los Angeles. The New York Times ran a story about the image's similarity to the 9/11 falling man image. Some 9/11 victims' family members accused the campaign of being insensitive. However, one family member accused the paper of creating a \"kerfuffle where none exists\", as well as using 9/11 family members to \"write a story that refers only to your own feelings\". AMC responded with a statement that said, \"The image of Don Draper tumbling through space has been used since the show began in 2007 to represent a man whose life is in turmoil. The image used in the campaign is intended to serve as a metaphor for what is happening in Don Draper's fictional life and in no way references actual events.\"\r\nThe advertising campaign also included the use of posters that proclaimed \"Adultery Is Back.\" The Atlantic Wire criticized the AMC campaign, saying \"Not that we're some creaky old traditionalists who value monogamy above all else, but making that of all things the selling point for a brilliant, beautiful show seems a little silly.\"\r\nOnline promotion\r\nPromotion for Seasons 4 and 5 saw Mad Men and AMC partnering with Banana Republic for the Mad Men Casting Call, in which users submit photos of themselves in Mad Men style and one winner receives the opportunity for a walk-on role in an upcoming season. Promotion for Seasons 3 and 4 included \"Mad Men Yourself\", an interactive game in which the user can choose clothing and accessories for an avatar similar to the appearance of Mad Men characters, drawn in the sixties-inspired style of illustrator Dyna Moe. \"Mad Men Cocktail Culture\" was also featured, an iPhone app that challenges users to create the perfect drink as featured in Mad Men episodes. Another interactive game launched prior to Season 3, the \"Sterling Cooper Draper Pryce Job Interview\", allowed users to answer questions based on various scenarios and then offered them a position in the Sterling Cooper Draper Pryce office. Season 3 also included \"Which Mad Man Are You?\", an interactive game in which users could find out which Mad Men character they were most like based on their answers to questions about various work and life situations. Users can take trivia quizzes based on the years in which the Mad Men episodes take place and find recipes for 1960s-era drinks on the Mad Men Cocktail Guide. AMC's Mad Men website also features exclusive sneak peek and behind the scenes videos, episodic and behind-the-scenes photo galleries, episode and character guides, a blog, and a community forum.\r\nHome media\r\nInspired by the iconic Zippo brand, the DVD box set of the first season of Mad Men was designed like a flip-open Zippo lighter; Zippo subsequently developed two designs of lighters with \"Mad Men\" logos to be sold at the company headquarters and online. The DVD box set, as well as a Blu-ray disc set, was released July 1, 2008; it features a total of 23 audio commentaries on the season's 13 episodes from various members of the cast and crew.\r\nLicensed merchandise\r\nFor the third season, the clothing store Banana Republic partnered with Mad Men to create window displays at its U.S. stores, showing clothing inspired by the fashion of the show. The store also ran a \"casting call\" competition, in which participants were asked to mail photos of themselves in period fashion for a chance at a walk-on part in the show; two winners were announced in October 2010.\r\nAnother clothing promotion from the series's third season includes a \"Mad-Men Edition\" suit offered by American clothing retailer Brooks Brothers. The suit is designed by the show's costume designer, Janie Bryant, and is based on an actual style sold by Brooks Brothers in the early 1960s.\r\nIn spring 2010, Mattel released a series of limited-edition collectible Barbie and Ken dolls based on the characters Don and Betty Draper, Joan Holloway, and Roger Sterling.\r\nThe fourth season saw the announcement of a collaboration between Janie Bryant and Californian-based company, Nailtini, to produce a limited-edition line of Mad Men nail polish. The four shades are entitled Bourbon Satin, French 75, Deauville and Stinger and are reported to have been inspired by the fabrics used to make cocktail dresses in the 1960s. The Mad Men nail polish line went on sale in the U.S. in late 2010.\r\nAdvertisements and product placement\r\nMad Men featured a significant number of products and brands that existed both in the 1960s and at the time of airing, many of them shown as advertising clients, including Lucky Strike, Bethlehem Steel, Heineken, Volkswagen, Cadillac, Playtex, Chanel, Spam, Utz, Maidenform, Gillette, American Airlines and Clearasil. This led to widespread speculation that many or all of the products and brands on the show were the result of paid product placement. In fact, nearly all real products featured were included solely for purposes of realism, with no product placement deals behind them. Showrunner Matthew Weiner said in an interview: \"There is very little, and it is an illusion that is propagated by the network to try and get more business. It never works out ... Literally I've named four in four seasons and there have probably been a hundred products on the show. Half of them are made up, no one's paying to be on the show.\" According to Weiner, the companies that did pay for product placement are Jack Daniel's, Heineken, Unilever, and Hilton, though the last was only a payment of gratitude after a storyline involving Hilton had already aired.\r\nJack Daniel's was mentioned by name in the fifth episode. Soon afterward, the consumer-rights activist group Commercial Alert filed a complaint with the United States Distilled Spirits Council alleging that Jack Daniel's was violating liquor advertising standards since the show features \"depictions of overt sexual activity\" as well as irresponsible intoxication.\r\nHeineken is seen in the show as a client seeking to bring its beer to the attention of American consumers. Heineken was also the sole advertiser for the U.S. premiere of the last episode of Season 2, which featured only one commercial.\r\nDuring the fourth season, Unilever created a series of six retro commercials that were aired during the show in the United States. The ads are set at the fictional Smith Winter Mitchell advertising agency and take place during the same time period as Mad Men. The products discussed in the ads are Dove, Breyers, Hellmann's, Klondike, Suave, and Vaseline.\r\nWeiner stated that he was not opposed to product placement, if it can increase a show's budget or eliminate advertising breaks. However, he found the product placement for Mad Men to be a frustrating experience: he called the Heineken deal \"a disaster\" because Heineken's legal department objected to depictions of irresponsible drinking in the show, and he said he was \"disgusted\" by the Unilever commercials, which were filmed on the Mad Men set against his will. Because of these frustrations, Weiner stated in 2012 that he would \"never again\" agree to product placement for Mad Men.\r\nIn two cases, the show made use of real ads or ad slogans; these happened to be the first and last ads shown on Mad Men. In the first episode, Don Draper comes up with the slogan \"It's Toasted\" for Lucky Strike; this was a real slogan used by the brand, albeit one that in real life was coined in 1917. In the series finale, it is implied that Don created the famous 1971 Coca-Cola commercial known as \"Hilltop\". The series did not have to pay for the use of this ad. Other ads that appeared on the show have some similarities to actual ads from the time.\r\nIn 2017, Heinz ran an advertising campaign that used ads created for the brand by Don Draper in a 2013 episode.",
    "html": "<p>Mad Men is an American period drama television series created by Matthew Weiner and produced by Lionsgate Television. It ran on the cable network AMC from July 19, 2007, to May 17, 2015, lasting for seven seasons and 92 episodes. The show is set from March 1960 to November 1970.</p><p>Mad Men begins at the fictional Sterling Cooper advertising agency on Madison Avenue in Manhattan, New York City, and continues at the new firm of Sterling Cooper Draper Pryce (later named Sterling Cooper & Partners) near the Time-Life Building at 1271 Sixth Avenue. According to the pilot episode, the phrase \"Mad men\" was a slang term coined in the 1950s by advertisers working on Madison Avenue to refer to themselves, \"Mad\" being short for \"Madison\" (in reality, the only documented use of the phrase from that time may have been in the late-1950s writings of James Kelly, an advertising executive and writer).</p><p>The series's main character is the charismatic advertising executive Don Draper (played by Jon Hamm), who is initially the talented creative director at Sterling Cooper. He is erratic and mysterious but is widely regarded throughout the advertising world as a genius; some of the most famous advertisement campaigns in history are shown to be his creations. Later, Don becomes a founding partner at Sterling Cooper Draper Pryce but begins a struggle as his highly calculated identity falls into a period of decline. The plot of the show tracks the people in his personal and professional lives. As the series progresses, it depicts the changing moods and social mores of the United States throughout the 1960s and early 1970s.</p><p>Mad Men received widespread critical acclaim for its writing, acting, directing, visual style and historical authenticity; it won many awards, including 16 Emmys and five Golden Globes. The show was also the first basic cable series to receive the Emmy Award for Outstanding Drama Series, winning the award each year of its first four seasons (2008–2011). It is widely regarded as one of the greatest television series of all time and as part of the early 21st century Golden Age of Television.</p><br/><h3>Production</h3><h4>Conception</h4><p>In 2000, while working as a staff writer for Becker, Matthew Weiner wrote the first draft as a spec script for the pilot of what would later be called Mad Men. Television showrunner David Chase recruited Weiner to work as a writer on his HBO series The Sopranos after reading the pilot script in 2002. \"It was lively, and it had something new to say,\" Chase said. \"Here was someone who had written a story about advertising in the 1960s, and was looking at recent American history through that prism.\"</p><p>Weiner and his representatives at Industry Entertainment and ICM tried to sell the pilot script to HBO, which expressed an interest, but insisted that David Chase be named executive producer. Chase declined, despite his enthusiasm for Weiner's writing and the pilot script. HBO CEO Richard Plepler later became a fan of the show and congratulated AMC on their success with it. In 2017 he named passing on Mad Men as his biggest regret from his time at HBO, calling it \"inexcusable\" and attributing the decision to \"hubris.\"</p><p>Weiner then moved on to Showtime, which also passed. Lacking a suitable network buyer, they tabled sales efforts until years later, when a talent manager on Weiner's team, Ira Liss, pitched the series to AMC's Vice President of Development, Christina Wayne. The Sopranos was completing its final season then, and the cable network happened to be getting into the market for new series programming. \"The network was looking for distinction in launching its first original series,\" according to AMC Networks president Ed Carroll, \"and we took a bet that quality would win out over formulaic mass appeal.\"</p><h4>Influences</h4><p>Weiner listed Alfred Hitchcock as a major influence on the visual style of the series, especially the film North by Northwest. He also was influenced by director Wong Kar-wai in the music, mise en scène, and editorial style. Weiner noted in an interview that M*A*S*H and Happy Days, two television shows produced in the 1970s about the 1950s, provided a \"touchstone for culture\" and a way to \"remind people that they have a misconception about the past, any past.\" He also said that \"Mad Men would have been some sort of crisp, soapy version of The West Wing if not for The Sopranos.\" Peggy's \"psychic scar for the entire show, after giving away that baby,\" Weiner said, is \"the kind of thing that would have never occurred to me before I was on The Sopranos.\"</p><h4>Pre-production</h4><p>Tim Hunter, the director of a half-dozen episodes from the show's first two seasons, called Mad Men a \"very well-run show.\" He said:</p><blockquote>They have a lot of production meetings during pre-production. The day the script comes in we all meet for a first page turn, and Matt starts telling us how he envisions it. Then there's a \"tone\" meeting a few days later where Matt tells us how he envisions it. And then there's a final full crew production meeting where Matt again tells us how he envisions it ...</blockquote><h4>Filming and production design</h4><p>The pilot episode was shot at Silvercup Studios in New York City and various locations around the city; subsequent episodes were filmed at Los Angeles Center Studios. It is available in high definition for showing on AMC HD and on video-on-demand services available from various cable affiliates.</p><p>The writers, including Weiner, amassed volumes of research on the period in which Mad Men takes place so as to make most aspects of the series—including detailed set design, costume design, and props—historically accurate, producing an authentic visual style that garnered critical praise. On the scenes featuring smoking, Weiner stated: \"Doing this show without smoking would've been a joke. It would've been sanitary and it would've been phony.\" Each episode had a budget between US$2–2.5 million; the pilot episode's budget was over $3 million.</p><p>Weiner collaborated with cinematographer Phil Abraham and production designers Robert Shaw (who worked on the pilot only) and Dan Bishop to develop a visual style that was \"influenced more by cinema than television.\" Alan Taylor, a veteran director of The Sopranos, directed the pilot and also helped establish the series's visual tone. To cast an \"air of mystery\" around Don Draper, Taylor tended to shoot from behind him or would frame him partially obscured. Many scenes set at Sterling Cooper were shot lower-than-eyeline to incorporate the ceilings into the composition of frame; this reflects the photography, graphic design and architecture of the period. Taylor felt that neither steadicam nor handheld camera work would be appropriate to the \"visual grammar of that time, and that aesthetic didn't mesh with classic approach\"—accordingly, the sets were designed to be practical for dolly work.</p><h4>Finances</h4><p>According to a 2011 Miller Tabak + Company estimate published in Barron's, Lions Gate Entertainment received an estimated $2.71 million from AMC for each episode, a little less than the $2.84 million each episode costs to produce.</p><p>In March 2011, after negotiations between the network and the series's creator, AMC picked up Mad Men for a fifth season, which premiered on March 25, 2012. Weiner reportedly signed a $30 million contract, which would keep him at the helm of the show for three more seasons. A couple of weeks later, a Marie Claire interview with January Jones was published, noting the limits to that financial success when it comes to the actors: \"We don't get paid very much on the show and that's well-documented. On the other hand, when you do television you have a steady paycheck each week, so that's nice.\"</p><p>Miller Tabak analyst David Joyce wrote that sales from home video and iTunes could amount to $100 million in revenue during the show's expected seven-year run, with international syndication sales bringing in an additional estimated $700,000 per episode. That does not include the $71 to $100 million estimated to come from a Netflix streaming video deal announced in April 2011.</p><h4>Episode credit and title sequences</h4><p>The opening title sequence features credits superimposed over a graphic animation of a businessman falling from a height, surrounded by skyscrapers with reflections of period advertising posters and billboards, accompanied by a short edit of the instrumental \"A Beautiful Mine\" by RJD2. The businessman appears as a black-and-white silhouette. The titles, created by production house Imaginary Forces, pay homage to graphic designer Saul Bass's skyscraper-filled opening titles for Alfred Hitchcock's North by Northwest (1959) and falling man movie poster for Vertigo (1958); Weiner has listed Hitchcock as a major influence on the visual style of the series. In a 2010 issue of TV Guide, the show's opening title sequence ranked No. 9 on a list of TV's top 10 credits sequences, as selected by readers.</p><p>David Carbonara composed the original score for the series. Mad Men – Original Score Vol. 1 was released on January 13, 2009.</p><p>At the end of almost every episode, the show either fades to black or smash cuts to black as period music, or a theme by series composer David Carbonara, plays during the ending credits; at least one episode ends with silence or ambient sounds. A few episodes have ended with more recent popular music, or with a diegetic song dissolving into the credits music. Apple Corps authorized the use of The Beatles song \"Tomorrow Never Knows\" for the Season 5 episode \"Lady Lazarus\", and the same track was used over the closing credits. Lionsgate, which produces Mad Men, paid $250,000 for the use of the song in the episode. Bob Dylan's \"Don't Think Twice It's All Right\" ended the last episode of Season 1.</p><h4>Crew</h4><p>In addition to creating the series, Matthew Weiner was the show runner, head writer, and an executive producer; he contributed to each episode through writing or co-writing the scripts, casting various roles, and approving costume and set designs. He was notorious for being selective about all aspects of the series, and maintained a high level of secrecy about production details. Tom Palmer served as a co-executive producer and writer on the first season. Scott Hornbacher (who later became an executive producer), Todd London, Lisa Albert, Andre Jacquemetton, and Maria Jacquemetton were producers on the first season. Palmer, Albert, Andre Jacquemetton, and Maria Jacquemetton were also writers on the first season. Bridget Bedard, Chris Provenzano, and writer's assistant Robin Veith completed the first-season writing team.</p><p>Lisa Albert, Andre Jacquemetton and Maria Jacquemetton returned as supervising producers for the second season. Veith also returned and was promoted to staff writer. Hornbacher replaced Palmer as co-executive producer for the second season. Consulting producers David Isaacs, Marti Noxon, Rick Cleveland, and Jane Anderson joined the crew for the second season. Weiner, Albert, Andre Jacquemetton, Maria Jacquemetton, Veith, Noxon, Cleveland, and Anderson were all writers for the second season. New writer's assistant Kater Gordon was the season's other writer. Isaacs, Cleveland, and Anderson left the crew at the end of the second season.</p><p>Albert remained a supervising producer for the third season but Andre Jacquemetton and Maria Jacquemetton became consulting producers. Hornbacher was promoted again, this time to executive producer. Veith returned as a story editor and Gordon became a staff writer. Noxon remained a consulting producer and was joined by new consulting producer Frank Pierson. Dahvi Waller joined the crew as a co-producer. Weiner, Albert, Andre Jacquemetton, Maria Jacquemetton, Veith, Noxon, and Waller were all writers for the third season. New writer's assistant Erin Levy, executive story editor Cathryn Humphris, script co-ordinator Brett Johnson and freelance writer Andrew Colville completed the third season writing staff.</p><p>Alan Taylor, Phil Abraham, Jennifer Getzinger, Lesli Linka Glatter, Tim Hunter, Andrew Bernstein, and Michael Uppendahl were regular directors for the series. Matthew Weiner directed each of the season finales. Cast members John Slattery, Jared Harris and Jon Hamm also directed episodes.</p><p>As of the third season, seven of the nine writers for the show were women, in contrast to Writers Guild of America 2006 statistics that showed male writers outnumbered female writers by 2 to 1. As Maria Jacquemetton noted:</p><blockquote>We have a predominately female writing staff—women from their early 20s to their 50s—and plenty of female department heads and directors. Matt Weiner and Scott Hornbacher hire people they believe in, based on their talent and their experience. \"Can you capture this world? Can you bring great storytelling?\"</blockquote><br/><h3>Cast and characters</h3><p>Mad Men focuses mostly on Don Draper, although it features an ensemble cast representing several segments of society in 1960s New York. Mad Men places emphasis on recollective progression as a means of revealing the characters' past.</p><h4>Don Draper</h4><p>Don Draper (Jon Hamm): Draper is the series' main protagonist. He is the creative director and junior partner of Sterling Cooper Advertising Agency and, as of the sixth season, a partner of Sterling Cooper & Partners. He is a hard-drinking, chain-smoking executive with a shadowy past who has achieved success in advertising. At the start of the series, Don is married to Elizabeth \"Betty\" Draper, with whom he has three children: Sally, Bobby, and Gene. Don keeps a lot of things hidden from Betty, along with his extensive history of adultery. Despite Don's best efforts, Betty gradually starts catching on, and when she learns about both his cheating and secret past, it leads to their separation and eventual divorce. It is gradually revealed over several seasons that Draper's real name is Richard \"Dick\" Whitman. During the Korean War, Whitman assumed the identity of his CO, Lieutenant Don Draper, who was killed in front of Whitman when their entire unit was ambushed. In the ensuing chaos, Whitman dropped his lit lighter on some fuel which caused some fuel drums to explode, killing Draper and injuring Whitman. Draper was due to be sent home, so Whitman found a way to escape his impoverished, dysfunctional family by switching dog tags with him.</p><h4>Peggy Olson</h4><p>Peggy Olson (Elisabeth Moss): Peggy rises from being Draper's secretary to being a copywriter with her own office. She becomes pregnant with Pete Campbell's child, a pregnancy that neither she nor her family or co-workers seem to notice, until she goes to the emergency room due to illness, and they tell her she is in labor. Campbell is unaware of her pregnancy until the end of Season 2, when Peggy tells him that she gave the baby up for adoption. In Season 3, she is approached by Duck Phillips to leave Sterling Cooper, but turns him down, despite the fact that his persistence leads to a romantic relationship. While he rarely acknowledges it, Don appreciates Peggy's abilities, leading him to choose her to go with him to Sterling Cooper Draper Pryce. She is given more freedom to come up with her own creative advertising ideas, with Don always pushing her to be better. During Season 5, Peggy feels increasingly unappreciated and patronized by Draper. In the episode \"The Other Woman\" she leaves SCDP to accept an offer to become head copywriter at Cutler, Gleason, and Chaough, though the agency merges with SCDP in Season 6, which once again places her under Don's leadership. In the final season, she transitions to the McCann Erickson agency and eventually finds her true feelings for Stan Rizzo.</p><h4>Pete Campbell</h4><p>Pete Campbell (Vincent Kartheiser): A young, ambitious account executive from an old New York family with connections and a privileged background. Often displaying recurring lapses in experience and judgment, his ruthless climb to the top causes him to attempt to blackmail Don with the Dick Whitman information he has learned, but it does not work. Pete and Don are antagonistic some of the time, but later develop a grudging respect for each other, culminating in Don's approaching Pete over Ken Cosgrove when forming a new agency. Campbell and his wife, Trudy (Alison Brie), were unable to conceive a child early in their marriage, and he only learned of his child with Peggy at the Season 2 finale. He and Trudy do conceive a daughter, Tammy, late in Season 4. At the end of Season 3, dissatisfied with his treatment at Sterling Cooper regarding a promotion, he secretly plans to leave the firm. Unaware of this, Don approaches Pete with an offer to join his new firm as long as Pete brings accounts worth $8 million in billings. Pete decides to join Don, with the condition that he be made a partner, though his surname does not appear in the new firm's name (Sterling Cooper Draper Pryce). Pete is one of the few characters in the show who does not smoke cigarettes, though he is seen smoking marijuana on one occasion. He looks up to Don in many ways, as both cheat on their wives and are not above manipulating or blackmailing. While Pete and Trudy separate in Season 6 after another one of his affairs, the two reconcile at the end of the series as he takes a lucrative offer with Learjet in Wichita, Kansas.</p><h4>Betty Draper</h4><p>Betty Draper (January Jones): Don Draper's wife and mother of their three children: Sally, Bobby, and Eugene Scott. Raised in the Philadelphia suburb of Elkins Park, Pennsylvania and a graduate of Bryn Mawr College, she met Don when she was a model in Manhattan and married him soon thereafter. At the start of the series, they have been married for seven years (since 1953) and live in Ossining, New York. Over the course of the first two seasons, Betty gradually becomes aware of her husband's womanizing. After a brief separation, Betty allows Don to return home when she learns she is pregnant with their third child, but not before having a one-night stand of her own. She leaves for Reno, Nevada, at the end of Season 3, in December 1963, with the intention of divorcing Don. At the start of Season 4, in November 1964, she has divorced Don and married Henry Francis. She and her children and new husband move to Rye. Betty's relationship with her children, particularly Sally, is often strained. At the end of Season 7, Betty learns that she has an advanced stage of lung cancer and is given six months to a year to live, even with aggressive treatment. She quickly accepts that her life will soon be over and makes plans for her funeral and her children's future care.</p><h4>Joan Holloway</h4><p>Joan Holloway (Christina Hendricks): Joan is the office manager and head of the secretarial pool at Sterling Cooper. She had a long-term affair with Roger Sterling until his two heart attacks (Season 1) caused him to end the relationship. In Season 2, she becomes engaged to Dr. Greg Harris (Samuel Page), and by Season 3, they are married and at his request she quits her job at Sterling Cooper. Their marriage is tested by her growing desire to continue her career despite his opposition, but his lack of skill as a surgeon and consequent difficulties securing work force her to return to work at a department store, prompting her to call Roger to ask for his help in finding an office job. Because of her invaluable organizational and managerial skills, she is hired for the new agency formed by Don, Roger, Lane, and Bert. Meanwhile, Greg's desire to further his career as a surgeon leads him to obtain a commission in the Army, and early in Season 4 he is sent to basic training and then to Vietnam. While her husband is deployed, she and Roger have one sexual encounter, which results in her becoming pregnant. She initially decides to terminate the pregnancy, but changes her mind and gives birth shortly before the beginning of Season 5, with her husband unaware that he is not the father. Greg returns from Vietnam during Season 5, but he and Joan separate, after he announces to her that he is returning to Vietnam for another tour of duty regardless of her feelings on the matter, and are divorced by the end of the season. By the close of Season 5, Joan has become a junior partner at SCDP in exchange for agreeing to sleep with a Jaguar executive to help land the account, which leads to conflict with Don in the Season 6, during which he ends the account with Jaguar just before SCDP makes a public offering. She is furious over the loss of potential earnings and the fact that her sacrifice has been for nothing. At the close of the series, she is subject to harassment by McCann executives, agrees to a buyout of her partnership stake, and starts a production company called Holloway Harris.</p><h4>Roger Sterling</h4><p>Roger Sterling (John Slattery); recurring Season 1, regular Seasons 2–7: Roger is one of the two senior partners of Sterling Cooper and former mentor to Don Draper. His father founded the firm with Bertram Cooper, hence his name comes before Cooper's in the firm's title. A picture in Cooper's office shows Roger as a child alongside Cooper as a young adult. In Season 2, Bertram Cooper mentions that \"the late Mrs. Cooper\" introduced Sterling to his wife, Mona, whom Sterling is in the process of divorcing in favor of Don's former secretary, 20-year-old Jane. Sterling, a World War II Navy veteran, was a notorious womanizer (living like he was \"on shore leave\") until two heart attacks changed his perspective, although they did not affect his drinking or smoking habits, which remained excessive. His experiences in the Pacific theater led him to harbor a strong contempt for the Japanese and refuse to do business with them, as seen in Season 4. Prior to his marriage to Jane, Roger had a long affair with Joan. In Season 4, he and Joan have a brief romantic encounter and Joan becomes pregnant. It is revealed in Season 3 that sometime in the early-1950s, when Don was a salesman at a furrier, and eager to break into advertising, Roger met him and, through that connection, Don was hired at Sterling Cooper. Season 4 has Roger less involved with the day-to-day activities at SCDP than he was at Sterling Cooper. His primary function is to manage the Lucky Strike account, which is responsible for over half of SCDP's billings. In the episode \"Chinese Wall,\" it's revealed that Lucky Strike is moving its account to a rival agency, forcing a dramatic downsizing of the firm. During Season 5, Roger is given new accounts to handle. He refocuses his efforts and lands a big account with Chevrolet Motor Company. He offers to financially support his son but Joan does not believe that he is reliable. By the end of the sixth season she agrees to let Roger into Kevin's life but not hers. At the close of the series, Roger indicates to her that half of his estate will go to Kevin in his will. Roger eventually marries Megan Draper's mother, Marie, and their honeymoon in Paris is part of the final montage in the series.</p><h4>Kenneth \"Ken\" Cosgrove</h4><p>Kenneth \"Ken\" Cosgrove (Aaron Staton): A young account executive originally from Vermont. Outside the office, Ken is an aspiring author who had a short story published in The Atlantic, which is a source of some envy by his co-workers, particularly the competitive Paul Kinsey and jealous Pete Campbell. According to his bio in The Atlantic, Ken attended Columbia University. His wife is Cynthia. He has one admirer, art director Salvatore \"Sal\" Romano, who secretly has a crush on him. Ken was promoted in the beginning of Season 3 to Account Director, a role he shared with Pete Campbell. Later on, the more easy-going Ken is promoted over the more ambitious Campbell to Senior Vice President of Account Services. However, at the end of Season 3, Draper and Sterling choose Pete over Ken for their new agency. During Season 4, Ken joins SCDP after working for McCann Erickson, which had bought Sterling Cooper, and BBD&O. When Pete learns of Ken's return, he is initially upset with Lane Pryce for not telling him, since Pryce had authorized Ken's previous promotion over Pete. However, when Ken agrees to serve under Pete as accounts manager at SCDP, the two reconcile over lunch and Pete comes to realize that Ken is a practical choice to help bring new business to the firm. In Season 5 it is discovered that Ken secretly writes science fiction short stories. In Season 6, he is wounded in the eye during a hunting accident with SCDP clients, Chevrolet. By Season 7, he shows increased stress over the state of the agency, and with the acquisition of SC&P by McCann Erickson, Ken is fired. However, he assumes his father-in-law's position at Dow Chemical and thus becomes a client for the remainder of the series run.</p><h4>Harold \"Harry\" Crane</h4><p>Harold \"Harry\" Crane (Rich Sommer): A bespectacled media buyer and head of Sterling Cooper's television department, which is created at Harry's initiative. Unlike his mostly Ivy League fellows, Harry went to the University of Wisconsin. Harry joins his colleagues in drinking and flirtations, though he is a dedicated husband and father. However, he does have a drunken one-night stand with Pete's secretary in Season 1, which leads to a brief separation from his wife Jennifer. Although he is well-meaning, Harry has a tendency to make poor decisions and avoid confrontations, which contributes to the dismissal of Sal Romano in Season 3. He is ultimately coerced by Draper and Cooper into joining Sterling Cooper Draper Pryce, although he comes to the realization that it is the right move on his own. When Sterling Cooper was in the process of being sold, Harry mistakenly thinks they are considering opening a West Coast office and believes that he would be the person to move to California. Harry later becomes a bit of a braggart, who is overly fond of discussing his Hollywood connections. In Season 5 he has abandoned his faithfulness to his wife as he discusses having affairs while abroad on business and is easily seduced by Paul's Hare Krishna girlfriend Lakshmi in his office. He also becomes increasingly image-conscious and petty, culminating in Season 6 when he explodes at Joan after she fires his secretary Scarlet for falsifying her time card, venting his frustration over her being made partner when he was not. By Season 7, the question of his being named partner is discussed again and endorsed by Jim Cutler, but the sale of SC&P to McCann Erickson eliminates that possibility. He also propositions Megan Draper in exchange for helping promote her acting career, but is rejected.</p><h4>Paul Kinsey</h4><p>Paul Kinsey (Michael Gladis); regular Seasons 1–3, guest star Season 5: A creative copywriter and Princeton University alumnus, the bearded, pipe-smoking Paul prides himself on his politically liberal views. Some time before the series began he had a relationship with Joan Holloway which ended badly, largely because Paul talked about it too much. Paul tried, unsuccessfully, to date Peggy soon after she was hired by Sterling Cooper. Through most of the second season, Paul dated Sheila White, an African-American woman from South Orange, New Jersey. They break up while in Oxford, Mississippi, where they had gone as Freedom Riders to oppose segregation in the South. It is a source of pride for Kinsey to live in the low-income, southern section of Montclair, New Jersey; Joan, however, mocks him as a shallow poseur. He is highly competitive, an attribute revealed to have soured a few friendships while he was in college, and which causes friction with Peggy, who quickly proves to be a superior copywriter to him. He is furious upon discovering that Don chose Peggy for the new agency over him. Paul did not appear after the third season finale until he reappeared in the tenth episode of Season 5, revealing himself to Harry as a disciple of Krishna Consciousness. Paul asks Harry to look at a Star Trek script he wrote, which Harry thinks is awful. Harry later realizes that Paul's girlfriend is manipulating him because of his recruiting skills within the Krishna movement, and encourages Paul to follow his dreams. He gives Paul $500 and tells him to get to Los Angeles as soon as possible.</p><h4>Salvatore \"Sal\" Romano</h4><p>Salvatore \"Sal\" Romano (Bryan Batt); regular Seasons 1–3: The Italian-American former art director at Sterling Cooper. Sal is a closeted homosexual. Reluctant to act upon his homosexuality, he twice avoids sexual encounters with men. By 1962, Sal has married Kitty, who seems unaware of Sal's sexual orientation, yet begins to realize that something is amiss in their relationship. Sal's secret crush on Ken Cosgrove comes close to being revealed during a dinner in Sal's apartment. Later, when a recently hired young advertising exec, Kurt, casually announces his homosexuality, Sal remains silent while his fellow co-workers speak disparagingly about Kurt. In the premiere of Season 3, Sal has a brief interrupted homosexual encounter with a hotel employee while in Baltimore, the end of which Don accidentally witnesses. Don, who was in the midst of a heterosexual encounter of his own at the same hotel, finesses this uncomfortable situation through a coded conversation about their current client, London Fog. He suggests the tagline \"Limit your exposure\". Later in Season 3, Sal rebuffs the sexual advances of Lee Garner Jr., the drunken playboy son of Lucky Strike's founder and a key client. Angered by the rejection, the client demands Sal be removed from the campaign and Roger fires Sal in order to appease the client and keep his $25 million account. In a conversation right after the firing, Don explains the agency cannot risk losing Lucky Strike and implies Sal should have gone along with Garner Jr. At the end of the episode, Sal is seen calling his wife Kitty from a phone booth in an area frequented by gay men cruising for sex. On the phone, Sal explains to Kitty he will be working late that night. Sal never appears again in the series.</p><h4>Bertram \"Bert\" Cooper</h4><p>Bertram \"Bert\" Cooper (Robert Morse); recurring Seasons 1–2, regular Seasons 3–7: The somewhat eccentric senior partner at Sterling Cooper. He leaves the day-to-day running of the firm to Sterling and Draper but is keenly aware of the firm's operations. Bertram is a Republican. He is fascinated by Japanese culture, requiring everybody, including clients, to remove their shoes before walking into his office, which is decorated with Japanese art. He is also a fan of the writings of Ayn Rand. Among his eccentricities, Bert frequently walks through the offices in his socks and intensely dislikes gum-chewing and smoking, an oddity for the time, especially considering Lucky Strike cigarettes is a major client through Season 4. He owns a ranch in Montana and is a widower with no children. Don approaches him about buying back the agency at the end of the third season, which evolves into their forming the new Sterling Cooper firm. In Season 4, Roger Sterling, being a WWII veteran of the Pacific theater, is outraged at the possibility of taking on a Japanese client, Honda. In a heated office meeting with some of the other executives including Peter Campbell, who had the lead, Roger says to Bert, \"Why don't we just get Dr. Lyle Evans in here?\" and storms out of the room, leaving Peter Campbell dumbfounded, asking, \"Who the hell is Dr. Lyle Evans?\" Interestingly enough, a few episodes later, a drunk and lonely Don who is pulling an all-nighter at the office with Peggy, stumbles upon an audio tape recording of Roger Sterling's memoirs that reveals that Bert received a war injury to his groin and was castrated by an incompetent doctor, named Lyle Evans. Later in Season 4, in the episode \"Blowing Smoke\", when the agency is forced to radically downsize its staff following the loss of the Lucky Strike account, Bert tells the others that he is quitting the business. He is not seen for the rest of the season but is back at work at the beginning of Season 5, although without an office. In Episode 10, Pete refers to the men's room as \"Cooper's office.\" Bert's sister Alice is a silent partner in Sterling Cooper. By the sixth season, Bert is increasingly frustrated with Don's erratic behavior and joins the other partners in placing him on a leave of absence. During the seventh season, he agrees to let Don return under an agreed set of stipulations. He dies while watching the Apollo 11 moon landing on television. He appears to Don in two dream sequences following his death.</p><h4>Sally Draper</h4><p>Sally Beth Draper (Kiernan Shipka); recurring Seasons 1–3, regular Seasons 4–7: The eldest child of Don and Betty Draper; her relationship with her mother is often strained. Sally is a minor character through the first two seasons but assumes a larger role during the third season as she approaches adolescence. She forms a strong bond with her grandfather, Gene Hofstadt, when he comes to live with the Drapers and is devastated by his sudden death. She also becomes distraught when Don and Betty break the news that they are getting a divorce, reproaching her father for breaking his promise to always be there and accusing her mother of making him leave. She develops a friendship with Glen, a boy who lives down the street from her (and of whom her mother does not approve). Betty is extremely jealous of this relationship and seeks to sabotage it, deciding to move the family to Rye, New York and firing Carla, the housekeeper, when she lets Glen in the house to say goodbye to Sally. In Season 5, Sally is shown to continue her friendship with Glen through phone calls and secret meetings. When Don marries Megan Calvet, Sally establishes a mostly positive relationship with Megan. During the sixth season, Sally is accepted to Miss Porter's School but gets suspended after being caught buying alcohol with a fake ID. In the final season, Sally's disillusion with both of her parents is evident but changes upon the news of Betty's cancer diagnosis.</p><h4>Rachel Katz</h4><p>Rachel Katz (née Menken) (Maggie Siff); regular Season 1, guest star Seasons 2 and 7: The Jewish head of a department store who comes to Sterling Cooper in search of an advertising agency to revamp her business's image. She is initially cool towards Don Draper, who bristles at her assertive, independent image but they warm to each other and eventually begin an affair. In the course of their affair, Don tells her things he has not shared with Midge Daniels (his previous mistress) or his wife. When Don is blackmailed by Pete Campbell, he comes to Rachel with the suggestion that they run away together to Los Angeles. She reminds him of his duty to his children and questions whether he would want to abandon his children after having grown up without a father. When Don persists, Rachel comes to the realization that he didn't want to run away with her, he simply wanted to run away. Ironically, her calling him a coward and urging him to think more clearly inspires him to persuade Pete to stand down. The relationship seems to collapse from that point on, and Cooper complains to Don about how upset he has made her. Don and Rachel end the affair at some point between the first and second seasons. He encounters her again in Season 2 while out to eat with Bobbie Barrett, finding out that Rachel has moved on and married a man named Tilden Katz. Though it appears that Don is only momentarily shaken by the news of her marriage, several episodes later, after drinking heavily with Roger and Freddie Rumsen, he gives his name as \"Tilden Katz\" to the bouncer of an underground club Roger is trying to get them into. In Season 7, Don sees Rachel in a vision while auditioning actresses for a fur commercial, but when he attempts to contact her, he learns that Rachel had two children and that she died from leukemia.</p><h4>Lane Pryce</h4><p>Lane Pryce (Jared Harris); recurring Season 3, regular Seasons 4–5: The English financial officer installed by Sterling Cooper's new British parent company. He first appears in the first episode of Season 3. His role is that of a strict taskmaster who brings spending under control, in particular by cutting out frivolous expenses. His efforts are so successful, he is to be sent to India to enact cost-cutting measures, a move which Pryce is not looking forward to after having settled in with his wife and child in New York. An unfortunate accident at work handicaps his replacement, thus allowing Pryce to keep his current position. He warms to American culture, and foresees some form of cultural and societal changes in American race relations. When the British parent company is sold at the end of Season 3, Pryce realizes he has become expendable and negotiates to become a founding partner in the new agency that Don Draper, Bert Cooper and Roger Sterling want to form. At Draper's suggestion, Pryce frees Sterling, Cooper, and Draper from their contractual non-compete clauses by firing them, then is fired himself, enabling the four of them to start their own firm. When hard times hit SCDP after Lucky Strike, their largest client, leaves them in Season 4, Pryce liquidates his portfolio in order to pay his share of the cash infusion required by the bank as collateral for a loan that keeps SCDP afloat. His finances already tight, he faces a crisis when the British Inland Revenue demand immediate payment of back taxes on the gain from the sale of his portfolio in Season 5. In order to pay the debt, Pryce secretly negotiates a $50,000 line of credit on behalf of the firm and announces to the partners that SCDP has a $50,000 profit and is able to pay bonuses. In anticipation of the bonus, Pryce forges Draper's signature on an early bonus check to himself, and views it as a 13-day loan which will be made good once the bonuses are paid. However, the partners decide to forgo their bonuses despite Pryce's pleading. In the penultimate episode of Season 5, Cooper discovers the canceled check and confronts Draper, who in turn confronts Pryce, demanding his resignation. That weekend, Pryce types out a resignation letter and hangs himself in his office.</p><h4>Megan Draper</h4><p>Megan Draper (née Calvet) (Jessica Paré); recurring Season 4, regular Seasons 5–7: Don's wife (as of the beginning of Season 5) and a junior copy writer at SCDP. Initially Megan is a receptionist at SCDP, but following the death of Miss Blankenship, she takes over as Don Draper's secretary. In the Season 4 finale, Don takes Megan on a trip to California to take care of his kids. In spite of being involved with Faye Miller, a marketing research consultant who works with SCDP, he proposes marriage to Megan and she accepts. In the episode \"Lady Lazarus,\" she leaves the firm to pursue her dream of acting, and (with the help of Don) lands her first acting gig in one of SCDP's commercials by the Season 5 finale. Don seems to be more honest with Megan than he was with Betty, apparently telling Megan about his true identity between Seasons 4 and 5. At the same time, he retains some of those possessive qualities he displayed during his previous marriage, although Megan is more stubborn and combative than Betty. Megan relocates permanently to California to pursue her acting career and she and Don divorce during Season 7. Megan is originally from Montreal, and French is her first language.</p><h4>Stan Rizzo</h4><p>Stan Rizzo (Jay R. Ferguson); recurring Season 4, regular Seasons 5–7: The art director at Sterling Cooper Draper Pryce. Before coming to the company, he worked for Lyndon B. Johnson's 1964 Presidential campaign. He and Peggy are often at odds with each other due to his abrasive attitude, although the two later develop a strong working relationship after Peggy challenges Stan over working in the nude for a campaign, which Stan gruffly concedes to her. Stan is one of the few members of the SCDP creative department who survive the staff cuts. He makes the transition to McCann Erickson in Season 7 and tells Peggy of his love for her at the conclusion of the series, which Peggy reciprocates.</p><h4>Henry Francis</h4><p>Henry Francis (Christopher Stanley); recurring Seasons 3–4, regular Seasons 5–7: A political adviser with close connections to New York Governor Nelson Rockefeller and the Republican Party, it is later revealed that he serves as the Director of Public Relations and Research in the Governor's Office. He is instantly infatuated with the six-months-pregnant Betty Draper when he meets her at the Sterlings' Kentucky Derby party as she is waiting by the women's restroom. Later, he is called upon by Betty Draper and some of her friends to use his influence to save a local reservoir, and he and Betty develop a personal connection. Betty reciprocates Henry's attention because she increasingly feels no connection with Don due to his non-stop infidelities, lies over his true identity, and his dismissive and sometimes verbally abusive attitude towards her. After the death of Betty's beloved father, the much older Henry also serves as a replacement father-figure for her. Henry and Betty have only a few brief and furtive meetings before Henry proposes marriage in the wake of the Kennedy assassination. Season 3 ends with the two of them on a plane with baby Gene, presumably flying to Reno so Betty can obtain a quick divorce from Don. At the start of Season 4, we see that Henry and Betty have married and Henry has rather uncomfortably taken up residence in the Drapers' house, living with Betty and her three children and paying rent to Don. He tries to soothe Betty as she continues to react angrily to Don and his irresponsibility towards the children, but gets more fed up over time. Betty, on her part, feels unaccepted by Henry's family, especially when she is unable to control Sally during a family visit to Henry's mother's house. At the end of Season 4, they decide to move to Rye, NY. Their relationship during Season 5 seems to be more affectionate, though Henry still periodically loses his temper with Betty. The news of Betty's cancer in Season 7 devastates him and despite her desire to keep the illness from the children, Henry informs Sally of her mother's condition.</p><h4>Ted Chaough</h4><p>Ted Chaough (Kevin Rahm); recurring Seasons 4–5, regular Seasons 6–7: A self-proclaimed rival of Don Draper in the advertising world, his agency—Cutler Gleason and Chaough (CGC)—was in competition with SCDP for an account with Honda. Don tricked Ted into making an expensive presentation to Honda executives, which backfired on Ted as he violated Honda's presentation rules (no finished work or commercials allowed at the presentation). Though the two agencies are comparable in size, he seems obsessed with competing against Don. Ted also tried to woo Pete Campbell over to his agency. After Don writes his New York Times ad about dropping business with cigarette companies, Ted makes a prank call to Don pretending to be Robert F. Kennedy. When he returns in Season 5 to recruit Peggy to leave SCDP and join his advertising firm, he remains very confident but is much less obnoxious than in his previous appearances; he does not indulge his typical dislike and jealousy of Don to Peggy, and that helps her decide to accept his offer, which in the season finale has him assigning her a huge amount of material involving an account for cigarettes aimed at female consumers. During Season 6, Ted and Don impulsively decide to merge their smaller firms so as to compete with the larger ones; however, this leads to numerous small struggles for power between them. In the Season 6 finale, Ted moves to a California SC&P office to have a \"new start\" after a short-lived affair with Peggy. He returns in Season 7 after the McCann purchase and settles into the culture of the firm.</p><h4>Michael Ginsberg</h4><p>Michael Ginsberg (Ben Feldman); recurring Season 5, regular Seasons 6–7: First appearing in the episode \"Tea Leaves\" (Season 5, Episode 3), Michael is hired as a part-time copywriter by Sterling Cooper Draper Pryce. He is initially hired to service the Mohawk account, and proves himself to be both prolific and innovative. He quickly becomes an essential part of the creative team and surpasses Peggy Olson midway through the season as the firm's most productive writer, while Peggy becomes mired in the Heinz story arc. Ginsberg is an idiosyncratic, socially awkward character who tends to speak his mind, which can be both a help and hindrance to him. Indeed, his position at the firm is threatened at times, including at his interview, when Peggy decides not to employ him for fear of his being too extroverted for Don's tastes. However, this decision is reversed by Roger, who has already told Mohawk that they have taken him on. As the firm's only Jewish copywriter, Roger uses this to his advantage to help Jewish clients, like Manischewitz. His role at SCDP becomes more integral after Peggy leaves the agency, though he commands almost none of the respect and support from Don that she did. His paranoia about the newly installed computer in the office drives him insane, eventually cutting off his own nipple as a gift to Peggy; he is then taken to a psychiatric hospital.</p><h4>Robert \"Bobby\" Draper</h4><p>Robert \"Bobby\" Draper (Mason Vale Cotton; previously Maxwell Huckabee, Aaron Hart, and Jared Gilmore) recurring Seasons 1–5; regular Seasons 6–7: The middle child of Don and Betty Draper. He was referred to by his mother Betty as a \"little liar.\" Bobby was mentioned as being 5 years old in the Season 2 episode \"The Mountain King,\" making his birthdate between October 1956 and September 1957. Despite not having many story lines during the series, Bobby is shown to be affected by his parents' divorce but grows fond of Don's and Betty's new spouses, Megan and Henry, respectively. In Season 6, he expresses sympathy towards Black people just after the assassination of Martin Luther King, Jr. and fears Henry might be shot. By Season 7, Bobby grows troubled over the increased arguments between Betty and Henry.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">July 19, 2007</td><td style=\"padding:0 8px\">October 18, 2007</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">July 27, 2008</td><td style=\"padding:0 8px\">October 26, 2008</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">August 16, 2009</td><td style=\"padding:0 8px\">November 8, 2009</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">July 25, 2010</td><td style=\"padding:0 8px\">October 17, 2010</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 25, 2012</td><td style=\"padding:0 8px\">June 10, 2012</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 7, 2013</td><td style=\"padding:0 8px\">June 23, 2013</td></tr><tr style=\"height:100%\"><th scope=\"row\" rowspan=\"2\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>7</span></span></span></span></th><td colspan=\"1\" rowspan=\"2\">14</td><td colspan=\"1\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 13, 2014</td><td style=\"padding:0 8px\">May 25, 2014</td></tr><tr style=\"height:100%\"><td colspan=\"1\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 5, 2015</td><td style=\"padding:0 8px\">May 17, 2015</td></tr></tbody></table><br/><h3>Themes and motifs</h3><p>Mad Men depicts parts of American society of the 1960s, including cigarette smoking, drinking, sexism, feminism, adultery, homophobia, antisemitism and racism. Themes of alienation, social mobility and ruthlessness set the tone of the show. MSNBC noted that the series \"mostly remains disconnected from the outside world, so the politics and cultural trends of the time are illustrated through people and their lives, not broad, sweeping arguments\".</p><p>According to Weiner, he chose the 1960s because:</p><blockquote>very time I would try and find something interesting that I wanted to do, it happened in 1960. It will blow your mind if you look at the year on the almanac. And it's not just the election. The pill came out in March 1960, that's really what I wanted it to be around.… That's the largest change in the entire world. Seriously, it's just astounding. Especially if you look at the movies from the 50s. Once it was acceptable to talk about this idea that teenagers were having sex, which they have been doing, obviously, since time immemorial, there were all these movies like Blue Denim and Peyton Place.…he central tension in every movie that does not take place on the battlefield is about a girl getting pregnant. So all of a sudden that entire issue has been removed from society. That was what I was interested in in 1960.</blockquote><h4>Identity and memory</h4><p>Television commentators have noted the series's study of identity. This theme is explored most candidly through Don Draper's identity fraud during the Korean War, in which he takes on an officer's name to desert the army. Tim Goodman considers identity to be the show's leitmotiv, calling Don Draper \"a man who's been living a lie for a long time. He's built to be a loner. And over the course of three seasons we've watched him carry this existential angst through a fairy-tale life of his own creation.\" As noted by Gawker:</p><blockquote>Not only is the agency of Sterling Cooper Draper Pryce in the business of spinning them—or at least warping the truth—to sell product, but the main character, Don Draper, is built on a lie. Just like one of his campaigns, his whole identity is a sweet fabrication, a kind of candy floss spun out of opportunity, innuendo, and straight-up falsehood.</blockquote><p>The New Republic writer Ruth Franklin said that \"The show's method is to take us behind the scenes of the branding of American icons—Lucky Strike cigarettes, Hilton hotels, Life cereal—to show us not how the products themselves were created, but how their 'very sexy…very magical' images were dreamed up.\" She went on to say that, \"In this way, we are all Don Drapers, obsessed with selling an image rather than tending to what lies underneath. Draper's fatal flaw is his lack of psychological awareness: He is at once perfectly tuned into the desires of America and entirely out of touch with his own character.\" One reviewer said that \"Identity is a key theme in Mad Men, and nobody is ever quite who they appear to be. Each one is filled with thwarted ambitions and frustrated dreams, none more so than Don Draper himself, whose closet, it's gradually revealed over Seasons 1 and 2, is filled with proverbial skeletons.\"</p><h4>Gender and sexuality</h4><p>The show presents a workplace culture in which men frequently enter sexual relationships with women in which it is assumed that female employees are sexually available for their male bosses and in which jokes about the desirability of one's wife dying are told by husbands in front of their own wives. Most of the main characters have cheated on their wives. Marie Wilson, in an op-ed for The Washington Post, said that:</p><blockquote>t is difficult and painful to see the ways in which women and men dealt with each other and with power. It's painful because this behavior is not as far back in our past as we would like to think. Our daughters continually get the messages that power still comes through powerful men. And unfortunately being pretty is still a quality that can get you on the ladder—though it still won't take you to the top.</blockquote><p>According to the Los Angeles Times:</p><blockquote>he sexism, in particular, is almost suffocating, and not in the least fun to watch. But it's the force against which the most compelling female characters struggle, and the opposition that defines them. The interaction with everyday misogyny and condescension—the housewife whose shrink reports to her husband, the ad woman who's cut out of the after-hours wheeling and dealing—gives the characters purpose and shape.</blockquote><p>In Salon, Nelle Engoron argued that while Mad Men seems to illuminate gender issues, its male characters get off \"scot-free\" for their drinking and adultery, while the female characters are often punished. Stephanie Coontz of The Washington Post said that women \"portrayed the sexism of that era so unflinchingly, they told me, that they could not bear to watch.\" Some women interviewed mentioned that they had experienced the same \"numbness of Betty Draper\" and witnessed the \"sense of male entitlement similar to Don's.\"</p><p>Aviva Dove-Viebahn wrote that \"Mad Men straddles the line between a nuanced portrayal of how sexism and patriarchal entitlement shape lives, careers and social interactions in the 1960s and a glorified rendering of the 'fast-paced, chauvinistic world of 1960s advertising and all that comes with it.'\" Melissa Witkowski, writing for The Guardian, argued that Peggy's ascendancy was marred because the show \"strongly implies that no woman had ever been a copywriter at Sterling Cooper prior to Peggy, but the circumstances of her promotion imply that this was merely because no woman had ever happened to have shown talent in front of a man before,\" pointing out that Peggy's career path bore little resemblance to the stories of successful ad women of the time such as Mary Wells Lawrence and Jean Wade Rindlaub. In 2013, the U.S. President Obama said \"Peggy Olson gave him insight into how his strong-willed grandmother dealt with life in a man's world.\"</p><h4>Alcoholism</h4><p>As the show's time progresses into the 1960s, the show portrays a world of liquor-stocked offices, boozy lunches and alcohol-soaked dinners. One incident in Season 2 finds advertising executive Freddy Rumsen being sent to rehab after urinating on himself. During the fourth season, Don Draper starts to realize he has a major drinking problem. In the sixties, bad behavior resulting from drinking was often considered macho and even romantic, rather than as result of addiction. One reviewer called the fourth season a \"sobering tale of drunken excess\" as the Don Draper character struggled with his addiction to alcohol.</p><p>Advertisement executive Jerry Della Femina said of the show:</p><blockquote>f anything, it's underplayed. There was a tremendous amount of drinking. Three-martini lunches were the norm…while we were still looking at the menu, the third would arrive.… The only thing that saved us was that the clients and agencies that we were going back to drank as much as we did.… Bottles in desk drawers were not the exception but the rule.</blockquote><h4>Counterculture</h4><p>The Los Angeles Times opined that Mad Men excels at \"stories of characters fighting to achieve personal liberation in the restless years before the advent of the full-blown culture wars.\" One reviewer was excited that the fourth season, through Peggy, brought \"the introduction to the Counterculture (Andy Warhol as the King of Pop and Leader of the Band), with all the loud music, joint-passing, underground movies so present in those times. Peggy's visit to a loft, with a Life Magazine photo editor-friend, placed her squarely in the center of the exciting creativity so rampant in the underground and also so rebellious against the mainstream.\" The Huffington Post focused on one scene where \"Peggy joins her new beatnik friends in the lobby while Pete stays behind with the SCDP partners to relish…his newly captured $6 million account. As they embark on their opposite trajectories, the camera lingers on their knowing glances. Here is where we find emotional truth.\"</p><h4>Racism</h4><p>Critics contend that post-racial beliefs complicate the show by only visualizing people of color at work and rarely in their homes or from their point of view. Several writers have argued that the show distorts history by not showing black admen, noting real-life successful African American advertising executives who got their start in the 1960s such as Clarence Holte, Georg Olden, and Caroline Robinson Jones. Latoya Peterson, writing in Slate magazine's Double X, argued that Mad Men was glossing over racial issues.</p><p>Slate writer Tanner Colby praised the show's treatment of race and Madison Avenue as historically accurate, especially the storyline in the third season episode \"The Fog\" in which Pete Campbell's idea to market certain products specifically towards African-Americans is struck down by the company. Slate also referred to the fourth season episode, \"The Beautiful Girls\", in which Don shoots down Peggy Olson's suggestion of Harry Belafonte as a spokesman for Fillmore Auto, after Fillmore Auto faced a boycott for not hiring black employees. Colby also pointed to an exposé published in a 1963 issue of Ad Age that revealed that \"out of over 20,000 employees, the report identified only 25 blacks working in any kind of professional or creative capacity, i.e., nonclerical or custodial.\" Colby wrote, \"Mad Men isn't cowardly for avoiding race. Quite the opposite. It's brave for being honest about Madison Avenue's cowardice.\"</p><h4>Smoking</h4><p>Cigarette smoking, more common in the United States of the 1960s than it is now, is featured throughout the series; many characters can be seen smoking several times over the course of an episode. In the pilot, representatives of Lucky Strike cigarettes come to Sterling Cooper looking for a new advertising campaign in the wake of a Reader's Digest report that smoking will lead to illnesses, including lung cancer. Talk of smoking being harmful to health and physical appearance is usually dismissed or ignored. In the fourth season, after Lucky Strike fires Sterling Cooper Draper Pryce as its ad agency, Draper writes an advertisement in The New York Times titled \"Why I'm Quitting Tobacco\", which announces SCDP's refusal to take tobacco accounts. The finale finds the agency in talks with the American Cancer Society. In the series's penultimate episode, Betty Draper is diagnosed with terminal lung cancer, after having been depicted as a heavy smoker throughout the series. The actors smoke herbal cigarettes, not tobacco cigarettes; Matthew Weiner said in an interview with The New York Times that the reason is that \"you don't want actors smoking real cigarettes. They get agitated and nervous. I've been on sets where people throw up, they've smoked so much.\"</p><br/><h3>Reception</h3><h4>Critical response</h4><p>Mad Men received widespread critical acclaim throughout its run, and is generally included on critics' lists of the greatest television shows of all time. The American Film Institute selected it as one of the top ten television programs of 2007, 2008, 2009, 2010, and 2012 (having aired no episodes during 2011) and it was named the best television show of 2007 by the Television Critics Association and several national publications, including the Chicago Tribune, The New York Times, the Pittsburgh Post-Gazette, TIME Magazine, and TV Guide.</p><p>On the review aggregator website Metacritic, the first season scored 77/100; the second season scored 88/100; the third season scored 87/100; the fourth season scored 92/100; the fifth season scored 89/100; the sixth season scored 88/100; the seventh season, part one scored 85/100; and the seventh season, part two scored 83/100. It was ranked 21st in TV Guide's 2013 list of the 60 best TV series ever, and the Writers Guild of America named it seventh in a list of the 101 best-written shows in the history of television. Rob Sheffield of Rolling Stone called Mad Men \"the greatest TV drama of all time.\" In 2022, Rolling Stone ranked Mad Men as the seventh-greatest TV show of all time.</p><p>A New York Times reviewer called the series groundbreaking for \"luxuriating in the not-so-distant past.\" Regarding Season 3, Matthew Gilbert of The Boston Globe wrote \"it's an absolutely gorgeous, amber-tinted vision of the early 1960s\" and added \"detailed with enough 1950s-era accoutrements to seem authentically Camelot.\"</p><p>The San Francisco Chronicle called Mad Men \"stylized, visually arresting…an adult drama of introspection and the inconvenience of modernity in a man's world.\"</p><p>A Chicago Sun-Times reviewer described the series as an \"unsentimental portrayal of complicated 'whole people' who act with the more decent 1960 manners America has lost, while also playing grab-ass and crassly defaming subordinates.\" The reaction at Entertainment Weekly was similar, noting how in the period in which Mad Men takes place, \"play is part of work, sexual banter isn't yet harassment, and America is free of self-doubt, guilt, and countercultural confusion.\" The Los Angeles Times said that the show had found \"a strange and lovely space between nostalgia and political correctness.\" The show also received critical praise for its historical accuracy – mainly its depictions of gender and racial bias, sexual dynamics in the workplace, and the high prevalence of smoking and drinking.</p><p>The Washington Post agreed with most other reviews in regard to Mad Men's visual style, but disliked what was referred to as \"lethargic\" pacing of the storylines. A review of the first season DVD set in the London Review of Books by Mark Greif was much less laudatory. Greif stated that the series was an \"unpleasant little entry in the genre of Now We Know Better\" as the cast was a series of historical stereotypes that failed to do anything except \"congratulate the present.\" In a February 2011 review of the show's first four seasons, critic Daniel Mendelsohn wrote a critical review that called Mad Men a \"drama with aspirations to treating social and historical 'issues'—the show is melodramatic rather than dramatic.\"</p><p>In 2019, The Guardian, which ranked the show 3rd on its list of the 100 best TV shows of the 21st century, stated that by spanning the entire 60s, Mad Men showed \"the mammoth social shifts in an ad agency in minute detail, and became…a meditation on how modern America came to be made, one iconic advert at a time.\"</p><h4>Ratings</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th rowspan=\"2\">Season</th><th rowspan=\"2\">Timeslot (<span>ET</span>)</th><th rowspan=\"2\">Episodes</th><th colspan=\"2\">Premiered</th><th colspan=\"2\">Ended</th><th rowspan=\"2\">Average viewers<br>(in millions)</th></tr><tr><th>Date</th><th style=\"font-size: smaller; line-height: 100%;\">Premiere viewers<br>(in millions)</th><th>Date</th><th style=\"font-size: smaller; line-height: 100%;\">Finale viewers<br>(in millions)</th></tr><tr><th><span>Season 1</span></th><td>Thursday 10:00 pm</td><td>13</td><td>July 19, 2007</td><td>1.65</td><td>October 18, 2007</td><td>0.93</td><td>0.90</td></tr><tr><th><span>Season 2</span></th><td rowspan=\"7\">Sunday 10:00 pm</td><td>13</td><td>July 27, 2008</td><td>2.06</td><td>October 26, 2008</td><td>1.75</td><td>1.52</td></tr><tr><th><span>Season 3</span></th><td>13</td><td>August 16, 2009</td><td>2.76</td><td>November 8, 2009</td><td>2.32</td><td>1.80</td></tr><tr><th><span>Season 4</span></th><td>13</td><td>July 25, 2010</td><td>2.90</td><td>October 17, 2010</td><td>2.44</td><td>2.27</td></tr><tr><th><span>Season 5</span></th><td>13</td><td>March 25, 2012</td><td>3.54</td><td>June 10, 2012</td><td>2.70</td><td>2.61</td></tr><tr><th><span>Season 6</span></th><td>13</td><td>April 7, 2013</td><td>3.37</td><td>June 23, 2013</td><td>2.69</td><td>2.49</td></tr><tr><th><span>Season 7, Part 1</span></th><td>7</td><td>April 13, 2014</td><td>2.27</td><td>May 25, 2014</td><td>1.94</td><td>2.01</td></tr><tr><th><span>Season 7, Part 2</span></th><td>7</td><td>April 5, 2015</td><td>2.27</td><td>May 17, 2015</td><td>3.29</td><td>2.12</td></tr></tbody></table><p>Viewership for the premiere at 10:00 pm on July 19, 2007, was higher than any other AMC original series at that time, and attained a 1.4 household rating, with 1.2 million households and 1.65 million total viewers. The numbers for the first season premiere were more than doubled for the heavily promoted second season premiere, which received 2.06 million viewers. A major drop in viewership for the episode following the second season premiere prompted concern from some television critics. However, 1.75 million people viewed the second season finale, which was up 20% over the season 2 average, and significantly more than the 926,000 people who viewed the first season finale. The cumulative audience for the episode was 2.9 million viewers, when the two re-broadcasts at 11:00 pm and 1:00 am were factored in.</p><p>The third season premiere, which aired August 16, 2009, garnered 2.8 million views on its first run, and 0.78 million with the 11:00 pm and 1:00 am repeats. In 2009, Mad Men was second in Nielsen's list of Top 10 timeshifted primetime TV programs, with a 57.7% gain in viewers, second only to the final season of Battlestar Galactica.</p><p>The fourth season premiere received 2.9 million viewers, and was up five percent from the ratings for the debut of season 3 and up 61 percent from the third season average, and became the most watched-episode in AMC history until its fifth season premiere, and later, the series premieres of The Walking Dead and Better Call Saul.</p><p>The fifth season premiere, \"A Little Kiss\", was the most watched episode of Mad Men of all time to date, receiving 3.54 million viewers and 1.6 million viewers in the 18–49 demographic. Before the fifth season, Mad Men had never achieved above a 1.0 in the 18–49 demographic. Charlie Collier, AMC's president, said that:</p><blockquote>For each of the five Mad Men seasons Matthew Weiner and his team have crafted a beautifully told story and each season a larger audience has responded; a rare accomplishment. We couldn't be more proud of this program, the brilliant writers, cast and crew, and the entire team on each side of the camera.</blockquote><p>The fifth season finale, \"The Phantom\", was watched by 2.7 million viewers, which was the highest ratings for a Mad Men finale until the series finale aired on May 17, 2015. In 2012, the series was second in Nielsen's list of Top 10 timeshifted primetime TV programs, with a 127% gain in viewers.</p><p>On April 7, 2013, the sixth season premiered to 3.37 million viewers, and a 1.1 adults 18–49. This was down from the fifth season premiere, but up from the fifth season finale. The sixth season finale on June 23, 2013, attracted 2.69 million total viewers, and achieved a 0.9 adults 18–49 demographic rating; on par with the fifth season finale. This helped bring the season average up to 2.49 million viewers, down just slightly from the season five average.</p><p>The first part of the seventh season, titled \"The Beginning\", premiered on April 13, 2014, and garnered 2.27 million total viewers and a 0.8 adults 18–49 rating. This was down 48 percent in viewers and 38 percent in adults 18–49 from the sixth season premiere, and down from the sixth season finale. The first part of season seven concluded on May 25, 2014, to 1.94 million viewers and a 0.7 adults 18–49 rating, down in both from the season 6 finale. This brought the average for the first part of the season down to 2.01 million viewers. The second part of season seven, titled \"The End of an Era\", premiered on April 5, 2015, to 2.27 million viewers and a 0.8 adults 18–49 rating; identical to the season 7 premiere. The series finale of Mad Men aired on May 17, 2015, to 3.29 million viewers and a 1.1 adults 18–49 rating. 1.7 million of these viewers were aged 25–54, and 1.4 million were ages 18–49, making it the highest viewed and highest rated episode since the sixth season premiere. This episode brought up the part two average to 2.12 million viewers, and brought up the overall season seven average to 2.06 million viewers.</p><h4>Authenticity</h4><p>With Mad Men, Weiner and his creative team have \"received critical acclaim for its historical authenticity and visual style\" although opinions on Mad Men vary among people who worked in advertising during the 1960s. According to Robert Levinson, a consultant for Mad Men who worked at BBDO from 1960 to 1980, \"what captured was so real. The drinking was commonplace, the smoking was constant, the relationships between the executives and the secretaries was exactly right\". Jerry Della Femina, who worked as a copywriter in that era and later founded his own agency, said that the show is accurate in its depiction of \"the smoking, the prejudice and the bigotry\".</p><p>Allen Rosenshine, a copywriter who went on to lead BBDO, called the show a \"total fabrication\", saying that \"if anybody talked to women the way these goons do, they'd have been out on their ass\". George Lois, who worked at Doyle Dane Bernbach for a year, before starting his own ad agency in 1960, said:</p><blockquote>Mad Men is nothing more than the fulfilment of every possible stereotype of the early 1960s bundled up nicely to convince consumers that the sort of morally repugnant behavior exhibited by its characters…is glamorous and vintage.…nlike the TV 'Mad Men,' we worked full, exhausting, joyous days: pitching new business, creating ideas, \"comping\" them up, storyboarding them, selling them, photographing them, and directing commercials. And our only 'extracurricular activity' was chasing fly balls and dunking basketballs on our agency softball and basketball teams!</blockquote><p>Andrew Cracknell, author of The Real Mad Men: The Renegades of Madison Avenue and the Golden Age of Advertising, also thought the show lacked authenticity, stating, \"One thing of which they all are all equally contemptuous\", in regards to the industry's elite, \"is the output of Sterling Cooper. But then they have every right. None of them would ever have wanted to work for Draper and none of his departments would have got a job at any of their agencies. Particularly Draper himself. Too phony.\"</p><p>According to an analysis of the language used in Mad Men by Benjamin Schmidt, a visiting graduate fellow at the Cultural Observatory at Harvard University, the vocabulary and phrases used in the show are not all quite authentic to the period, despite attempts to use contemporary vocabulary. Using a computer program, he determined that the show uses relatively few words that are clearly anachronistic but that there are many words and phrases used that are far more common in modern speech, than in the speech of the era (\"need to\", \"feel good about\", \"euthanize\", etc). In aggregate these words and constructions give a misleading impression of the speech patterns of the time. He notes that the use of modern business language (leverage, signing bonus, etc.) unknown or little used at the time \"creeps in with striking regularity.\"</p><h4>Legacy and influence</h4><p>Mad Men was credited with setting off a wave of renewed interest in the fashion and culture of the early 1960s. According to The Guardian in 2008, the show was responsible for a revival in men's suits, especially suits resembling those of that period, with higher waistbands and shorter jackets; as well as \"everything from tortoise shell glasses to fedoras.\" According to the website BabyCenter, the show led to the name \"Betty\" soaring in popularity for baby girls in the United States in 2010. According to The Arizona Republic, a resurgence in interest for Mid-century modern furnishings and decor also coincided with the emergence of the show. New York Times theater critic Ben Brantley wrote in 2011 that the success of Mad Men had turned \"the booze-guzzling, chain-smoking, babe-chasing 1960s\" into \"Broadway's decade du jour\", citing three 1960s-set musicals that had appeared on Broadway in the past year: revivals of Promises, Promises and How to Succeed in Business Without Really Trying, and a new musical, Catch Me If You Can. Brantley also wrote, \"I'm presuming that Mad Men is the reason this Promises, Promises is set not in the late '60s, as the original was, but in 1962.\"</p><p>The 2009 TNT series Trust Me, which ran for one season, was set at a modern-day advertising agency; television critic Tom Shales called it a cross between Mad Men and another television show, Nip/Tuck. Two network television series that premiered in 2011, the short-lived The Playboy Club and the one-season Pan Am, both set in 1963, were frequently referred to as imitations of Mad Men. The British TV drama The Hour, which also premiered in 2011, and is set in 1956, was also described as influenced by Mad Men. The 2014 Syfy miniseries Ascension was described as \"Mad Men in space\". Don Draper's rendition of the Frank O'Hara poem \"Mayakovsky\" from Meditations in an Emergency, at the end of \"For Those Who Think Young\" (season two, episode one), led to the poet's work entering the top 50 sales on Amazon.com.</p><p>The appearance of Christina Hendricks as office manager Joan, is said to have sparked a renewed interest in a voluptuous look for women and to be partly responsible for, among other things, a 10 percent increase in breast augmentation in the United Kingdom in 2010.</p><p>The nostalgia for the fashions and social norms of the early 1960s engendered by Mad Men was criticized by some commentators. Amy Benfer, writing in 2009 for Salon, asked, \"But isn't it a little odd that a show that, among other things, warns about the dangers of seeing the past in too amber a light has spawned an industry devoted to fetishizing nostalgia for that same flawed past?\"</p><p>In the 2014 State of the Union Address, President Barack Obama, in speaking out against unequal pay for women, said \"It's time to do away with workplace policies that belong in a Mad Men episode.\" Matthew Weiner released a statement saying that he \"supports the president,\" and that he was \"honored that our show is part of a much-needed national conversation.\" In 2015, a sculpture of a bench dedicated to Mad Men featuring the image of Don Draper from the opening credit sequence was unveiled in front of the Time-Life Building.</p><p>The show's success is also credited with sparking the resurgence of the AMC cable television channel.</p><h4>Awards and accolades</h4><p>Mad Men was the recipient of many nominations and awards from various organizations, including the American Film Institute, Emmys and Creative Arts Emmys from the Academy of Television Arts & Sciences, a Peabody Award from the Peabody Board at the Grady College of Journalism and Mass Communication, Satellite Awards from the International Press Academy, and British Academy Television Awards from the British Academy of Film and Television Arts. Numerous nominations and award were also received from guilds and societies such as the Art Directors Guild, Casting Society of America, Cinema Audio Society, Costume Designers Guild, Directors Guild of America, Motion Picture Sound Editors, Producers Guild of America, Screen Actors Guild, Television Critics Association, and Writers Guild of America.</p><p>Award highlights include winning the Primetime Emmy Award for Outstanding Drama Series four times, for each of its first four seasons; its fourth win tied the record for serial dramas set earlier by Hill Street Blues (1981–84), L.A. Law (1987, 1989–91), and The West Wing (2000–03). In 2012 Mad Men set a record for the most Emmy nominations, 17, without winning. A 2015 The Hollywood Reporter survey of 2,800 actors, producers, directors, and other industry people named it as their #9 favorite show.</p><br/><h3>Marketing</h3><h4>Season premiere campaigns</h4><p>In promotions for the series, AMC aired commercials and a behind-the-scenes documentary on the making of Mad Men before its premiere. The commercials mostly show the one (usually brief) sex scene from each episode of the season. The commercials, as well as the documentary, featured the song \"You Know I'm No Good\" by Amy Winehouse. The documentary, in addition to trailers and sneak peeks of upcoming episodes, were released on the official AMC website. Mad Men was also made available at the iTunes Store on July 20, 2007, along with the \"making of\" documentary.</p><p>For the second season, AMC undertook the largest marketing campaign it had ever launched, intending to reflect the \"cinematic quality\" of the series. The Grand Central Terminal subway shuttle to Times Square was decorated with life-size posters of Jon Hamm as Don Draper, and quotes from the first season. Inside Grand Central, groups of people dressed in period clothing would hand out \"Sterling Cooper\" business cards to promote the July 27 season premiere. Window displays were arranged at 14 Bloomingdale's stores for exhibition throughout July, and a 45' by 100' wallscape was posted at the corner of Hollywood and Highland in downtown Hollywood. Television commercials on various cable and local networks, full-page print ads, and a 30-second trailer in Landmark Theaters throughout July were also run in promotion of the series. Television promotions for the second season featured the song \"The Truth\" by Handsome Boy Modeling School.</p><p>The advertising campaign for the fifth season of Mad Men was conceived by the network as a way to promote the series after the 17-month break between seasons. A teaser campaign began in which posters, using images of the enigmatic \"falling man\" from the opening credits, were spread out on buildings in New York and Los Angeles. The New York Times ran a story about the image's similarity to the 9/11 falling man image. Some 9/11 victims' family members accused the campaign of being insensitive. However, one family member accused the paper of creating a \"kerfuffle where none exists\", as well as using 9/11 family members to \"write a story that refers only to your own feelings\". AMC responded with a statement that said, \"The image of Don Draper tumbling through space has been used since the show began in 2007 to represent a man whose life is in turmoil. The image used in the campaign is intended to serve as a metaphor for what is happening in Don Draper's fictional life and in no way references actual events.\"</p><p>The advertising campaign also included the use of posters that proclaimed \"Adultery Is Back.\" The Atlantic Wire criticized the AMC campaign, saying \"Not that we're some creaky old traditionalists who value monogamy above all else, but making that of all things the selling point for a brilliant, beautiful show seems a little silly.\"</p><h4>Online promotion</h4><p>Promotion for Seasons 4 and 5 saw Mad Men and AMC partnering with Banana Republic for the Mad Men Casting Call, in which users submit photos of themselves in Mad Men style and one winner receives the opportunity for a walk-on role in an upcoming season. Promotion for Seasons 3 and 4 included \"Mad Men Yourself\", an interactive game in which the user can choose clothing and accessories for an avatar similar to the appearance of Mad Men characters, drawn in the sixties-inspired style of illustrator Dyna Moe. \"Mad Men Cocktail Culture\" was also featured, an iPhone app that challenges users to create the perfect drink as featured in Mad Men episodes. Another interactive game launched prior to Season 3, the \"Sterling Cooper Draper Pryce Job Interview\", allowed users to answer questions based on various scenarios and then offered them a position in the Sterling Cooper Draper Pryce office. Season 3 also included \"Which Mad Man Are You?\", an interactive game in which users could find out which Mad Men character they were most like based on their answers to questions about various work and life situations. Users can take trivia quizzes based on the years in which the Mad Men episodes take place and find recipes for 1960s-era drinks on the Mad Men Cocktail Guide. AMC's Mad Men website also features exclusive sneak peek and behind the scenes videos, episodic and behind-the-scenes photo galleries, episode and character guides, a blog, and a community forum.</p><h4>Home media</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" rowspan=\"2\">DVD/Blu-ray release</th><th rowspan=\"2\">Episodes</th><th rowspan=\"2\">Originally aired</th><th colspan=\"3\" style=\"width:400px;\">Release date</th></tr><tr><th>Region 1</th><th>Region 2</th><th>Region 4</th></tr><tr><td style=\"background:#222; width:10px;\"></td><td style=\"text-align:center;\"><span>Season One</span></td><td style=\"text-align:center;\">13</td><td style=\"text-align:center;\">2007</td><td style=\"text-align:center;\">July 1, 2008</td><td style=\"text-align:center;\">June 30, 2008</td><td style=\"text-align:center;\">November 26, 2008</td></tr><tr><td style=\"background:#FF624A; width:10px;\"></td><td style=\"text-align:center;\"><span>Season Two</span></td><td style=\"text-align:center;\">13</td><td style=\"text-align:center;\">2008</td><td style=\"text-align:center;\">July 14, 2009</td><td style=\"text-align:center;\">July 13, 2009</td><td style=\"text-align:center;\">August 19, 2009</td></tr><tr><td style=\"background:#88321A; width:10px;\"></td><td style=\"text-align:center;\"><span>Season Three</span></td><td style=\"text-align:center;\">13</td><td style=\"text-align:center;\">2009</td><td style=\"text-align:center;\">March 23, 2010</td><td style=\"text-align:center;\">April 26, 2010</td><td style=\"text-align:center;\">June 2, 2010</td></tr><tr><td style=\"background:#9c9c9c; width:10px;\"></td><td style=\"text-align:center;\"><span>Season Four</span></td><td style=\"text-align:center;\">13</td><td style=\"text-align:center;\">2010</td><td style=\"text-align:center;\">March 29, 2011</td><td style=\"text-align:center;\">March 28, 2011</td><td style=\"text-align:center;\">April 6, 2011</td></tr><tr><td style=\"background:#62202c; width:10px;\"></td><td style=\"text-align:center;\"><span>Season Five</span></td><td style=\"text-align:center;\">13</td><td style=\"text-align:center;\">2012</td><td style=\"text-align:center;\">October 16, 2012</td><td style=\"text-align:center;\">November 5, 2012</td><td style=\"text-align:center;\">November 14, 2012</td></tr><tr><td style=\"background:#6699CE; width:10px;\"></td><td style=\"text-align:center;\"><span>Season Six</span></td><td style=\"text-align:center;\">13</td><td style=\"text-align:center;\">2013</td><td style=\"text-align:center;\">November 5, 2013</td><td style=\"text-align:center;\">November 4, 2013</td><td style=\"text-align:center;\">November 7, 2013</td></tr><tr><td style=\"background:#362F8E; width:10px;\"></td><td style=\"text-align:center;\"><span>The Final Season, Part 1</span></td><td style=\"text-align:center;\">7</td><td style=\"text-align:center;\">2014</td><td style=\"text-align:center;\">October 21, 2014</td><td style=\"text-align:center;\">November 3, 2014</td><td style=\"text-align:center;\">November 6, 2014</td></tr><tr><td style=\"background:#FDE7AD; width:10px;\"></td><td style=\"text-align:center;\"><span>The Final Season, Part 2</span></td><td style=\"text-align:center;\">7</td><td style=\"text-align:center;\">2015</td><td style=\"text-align:center;\">October 13, 2015</td><td style=\"text-align:center;\">October 19, 2015</td><td style=\"text-align:center;\">November 5, 2015</td></tr></tbody></table><p>Inspired by the iconic Zippo brand, the DVD box set of the first season of Mad Men was designed like a flip-open Zippo lighter; Zippo subsequently developed two designs of lighters with \"Mad Men\" logos to be sold at the company headquarters and online. The DVD box set, as well as a Blu-ray disc set, was released July 1, 2008; it features a total of 23 audio commentaries on the season's 13 episodes from various members of the cast and crew.</p><h4>Licensed merchandise</h4><p>For the third season, the clothing store Banana Republic partnered with Mad Men to create window displays at its U.S. stores, showing clothing inspired by the fashion of the show. The store also ran a \"casting call\" competition, in which participants were asked to mail photos of themselves in period fashion for a chance at a walk-on part in the show; two winners were announced in October 2010.</p><p>Another clothing promotion from the series's third season includes a \"Mad-Men Edition\" suit offered by American clothing retailer Brooks Brothers. The suit is designed by the show's costume designer, Janie Bryant, and is based on an actual style sold by Brooks Brothers in the early 1960s.</p><p>In spring 2010, Mattel released a series of limited-edition collectible Barbie and Ken dolls based on the characters Don and Betty Draper, Joan Holloway, and Roger Sterling.</p><p>The fourth season saw the announcement of a collaboration between Janie Bryant and Californian-based company, Nailtini, to produce a limited-edition line of Mad Men nail polish. The four shades are entitled Bourbon Satin, French 75, Deauville and Stinger and are reported to have been inspired by the fabrics used to make cocktail dresses in the 1960s. The Mad Men nail polish line went on sale in the U.S. in late 2010.</p><br/><h3>Advertisements and product placement</h3><p>Mad Men featured a significant number of products and brands that existed both in the 1960s and at the time of airing, many of them shown as advertising clients, including Lucky Strike, Bethlehem Steel, Heineken, Volkswagen, Cadillac, Playtex, Chanel, Spam, Utz, Maidenform, Gillette, American Airlines and Clearasil. This led to widespread speculation that many or all of the products and brands on the show were the result of paid product placement. In fact, nearly all real products featured were included solely for purposes of realism, with no product placement deals behind them. Showrunner Matthew Weiner said in an interview: \"There is very little, and it is an illusion that is propagated by the network to try and get more business. It never works out ... Literally I've named four in four seasons and there have probably been a hundred products on the show. Half of them are made up, no one's paying to be on the show.\" According to Weiner, the companies that did pay for product placement are Jack Daniel's, Heineken, Unilever, and Hilton, though the last was only a payment of gratitude after a storyline involving Hilton had already aired.</p><p>Jack Daniel's was mentioned by name in the fifth episode. Soon afterward, the consumer-rights activist group Commercial Alert filed a complaint with the United States Distilled Spirits Council alleging that Jack Daniel's was violating liquor advertising standards since the show features \"depictions of overt sexual activity\" as well as irresponsible intoxication.</p><p>Heineken is seen in the show as a client seeking to bring its beer to the attention of American consumers. Heineken was also the sole advertiser for the U.S. premiere of the last episode of Season 2, which featured only one commercial.</p><p>During the fourth season, Unilever created a series of six retro commercials that were aired during the show in the United States. The ads are set at the fictional Smith Winter Mitchell advertising agency and take place during the same time period as Mad Men. The products discussed in the ads are Dove, Breyers, Hellmann's, Klondike, Suave, and Vaseline.</p><p>Weiner stated that he was not opposed to product placement, if it can increase a show's budget or eliminate advertising breaks. However, he found the product placement for Mad Men to be a frustrating experience: he called the Heineken deal \"a disaster\" because Heineken's legal department objected to depictions of irresponsible drinking in the show, and he said he was \"disgusted\" by the Unilever commercials, which were filmed on the Mad Men set against his will. Because of these frustrations, Weiner stated in 2012 that he would \"never again\" agree to product placement for Mad Men.</p><p>In two cases, the show made use of real ads or ad slogans; these happened to be the first and last ads shown on Mad Men. In the first episode, Don Draper comes up with the slogan \"It's Toasted\" for Lucky Strike; this was a real slogan used by the brand, albeit one that in real life was coined in 1917. In the series finale, it is implied that Don created the famous 1971 Coca-Cola commercial known as \"Hilltop\". The series did not have to pay for the use of this ad. Other ads that appeared on the show have some similarities to actual ads from the time.</p><p>In 2017, Heinz ran an advertising campaign that used ads created for the brand by Don Draper in a 2013 episode.</p><br/>"
  },
  "errorMessage": ""
}