{
  "imDbId": "tt1534360",
  "title": "Ezel",
  "fullTitle": "Ezel (TV Series 2009–2011)",
  "type": "TVSeries",
  "year": "2009",
  "items": [
    {
      "username": "ahmedgorshy",
      "userUrl": "https://www.imdb.com/user/ur106582401",
      "reviewLink": "https://www.imdb.com/review/rw5963849",
      "warningSpoilers": false,
      "date": "3 August 2020",
      "rate": "10",
      "helpful": "57 out of 59 found this helpful.",
      "title": "Ezel Review",
      "content": "Before I start writing the review I will tell you just one thing, just watch it Watch it First, I followed nearly 20 Turkish series, and none of them is able to compare to Ezel Why ? Simply because he preferred them, this show is better than a persona series. This series is the least that can be compared to it is Diet Death Note in terms of intelligence, manipulation and shocking twest at the end of each episode, amazing music and great drama, and most important of all, the depth of the story, in addition to romance, is the best in Turkish series, better than any romance at all, even if you are not a fan Romance, you can only honor this show . A brief summary of my words is that there are a few series that deserve real concluding and watching, including Ezel, so watch it quickly and do not care about anything else. Ahmed gorshy Review My rate for the first season is 9.0/10 My rate for season 2 is 9.7/10"
    },
    {
      "username": "monstablocka",
      "userUrl": "https://www.imdb.com/user/ur96728439",
      "reviewLink": "https://www.imdb.com/review/rw4528551",
      "warningSpoilers": false,
      "date": "23 December 2018",
      "rate": "10",
      "helpful": "46 out of 46 found this helpful.",
      "title": "Dope !",
      "content": "Turkish \"Monte Christo\"... top notch ! 10/10 ! A must see..."
    },
    {
      "username": "ahmetkozan",
      "userUrl": "https://www.imdb.com/user/ur48829349",
      "reviewLink": "https://www.imdb.com/review/rw3441845",
      "warningSpoilers": false,
      "date": "29 March 2016",
      "rate": "10",
      "helpful": "74 out of 79 found this helpful.",
      "title": "Revenge! That Will Bring Them Together...",
      "content": "Ezel is a Turkish crime drama TV series. It's an impressive series.Betrayal dissever them. Revenge that will bring them together. Each betrayal begins with love. There is much more than a story in this series. There are individual stories of each character. Ramiz Uncle's story... Kenan Birkan's story... Eysan and Omar's story... This is the favorite part of the series. One of the important things of the series also preached. Ramiz Uncle's preachers... Nobody is not good also not bad. And flashback scenes. Flashback scenes sine qua. I congratulate series team. Artists selected very good. Kenan Imirzalioglu, Cansu Dere, Haluk Bilginer, Sarp Akkaya, Baris Falay and a lot of artists. This series has a different place for me. Tuncel Kurtiz a great actor. Rest in peace... 10/10"
    },
    {
      "username": "Canberk94",
      "userUrl": "https://www.imdb.com/user/ur27043385",
      "reviewLink": "https://www.imdb.com/review/rw4454620",
      "warningSpoilers": false,
      "date": "12 November 2018",
      "rate": "10",
      "helpful": "44 out of 46 found this helpful.",
      "title": "Netflix has only season 1! Season 2 is on youtube!",
      "content": "I see some confused netflix audience here, saying the series has no end. However, Netflix has only first season.All the episodes of the original Turkish Ezel is 2 HOURS LONG with 72 episodes, 72x2=144 hours. Netflix took first 36 episodes, 36x2=72 hours, and cut them in half, 1 hour, and made you watch. You only watched first 36 episodes, 72 hours of 144 hours, of original Ezel. Write youtube: \"ezel english jane p 35\" something and start watching the 2nd season.In the second season Kenan Birkan, the enemy of Ramiz Dayi is shown finally, and they start fighting.As a Turkish citizen I also like Ezel very much. Ezel is one of my masterpiece listed series. I also suggest these those like mind games: \"The Mentalist\" \"Hunter x Hunter 2011\" \"Reverend Insanity\" \"Breaking Bad\" \"Death note\""
    },
    {
      "username": "Peanut7139",
      "userUrl": "https://www.imdb.com/user/ur83191163",
      "reviewLink": "https://www.imdb.com/review/rw4473506",
      "warningSpoilers": false,
      "date": "22 November 2018",
      "rate": "10",
      "helpful": "26 out of 28 found this helpful.",
      "title": "One of the great Turkish shows I have ever seen!",
      "content": "Amazing to say the most about this show! I didn't want this show to end. Acting amazing and the story-line. They found the best person to play this role and it worked. All the actors and actresses worked perfectly together. I did enjoy the fact that you are not going to get away with what you did. I'm coming for all of you. Way to go Ezel! Amazing writing and amazing acting. You don't get a true ending to the story. I wish shows wouldn't leave you out there and you don't get to know what is going to happen, or if it ever does. This show is worth the watch and will leave you with a wow factor. I enjoyed it and will watch again later when I can't remember how the episodes go. Great work and thanks to the writers of this show and the producers. Please give us more of your work!"
    },
    {
      "username": "djeka-38458",
      "userUrl": "https://www.imdb.com/user/ur63312588",
      "reviewLink": "https://www.imdb.com/review/rw4015109",
      "warningSpoilers": false,
      "date": "27 December 2017",
      "rate": "10",
      "helpful": "35 out of 39 found this helpful.",
      "title": "Great serial,story and acting",
      "content": "I watch again after 7 years.Such amazing storz,great acting,Ezel is such strong and weak in the same time.Ali is my favorite,actor for Oscar.Ejsan is so beautiful but iritant person for me.Music is amazing.Ezel is most pretty man ever. Its sad story at all,but this is not USA stupid comedy. I recomend this serial foe everyone. You ll not mistake love from Serbia"
    },
    {
      "username": "botrytis",
      "userUrl": "https://www.imdb.com/user/ur26079470",
      "reviewLink": "https://www.imdb.com/review/rw2499487",
      "warningSpoilers": false,
      "date": "7 October 2011",
      "rate": "9",
      "helpful": "65 out of 83 found this helpful.",
      "title": "Finally, a Masterpiece on the surface...",
      "content": "Well, at that time, when the show began just got my attention on the unique camera editing that fascinated me on the first place, then I got my eyes on the cast, well, i have to say, that I've never been able to see Turkish or similar Show before, but it was interesting how well they can play their role, and their character, that plays another role in their role, funny huh? The whole story is a mystery, and it reveals truths really slowly, but there are always new problems, questions, that we have to wait for being answered, but we have not to worry about the explanations, they come at the right time, believe me. The whole \"movie\" is exciting, we never get bored, during watching it we are always in stress, but in the good way, and thanks god we never know what happens, it's just a new thing, what never let you down, well, maybe sometimes we find it little long, it has 71 episodes, and every episode lasts approx. 2 hours. Nevermind, It's still a fascinating experience, that I never regret, I'm happy, that I see TV Show history in a new perspective, thankfully for this great Series: Ezel."
    },
    {
      "username": "stellarinteractive",
      "userUrl": "https://www.imdb.com/user/ur87401082",
      "reviewLink": "https://www.imdb.com/review/rw4143558",
      "warningSpoilers": false,
      "date": "26 April 2018",
      "rate": "9",
      "helpful": "16 out of 17 found this helpful.",
      "title": "Extremelly watchable Turkish Tv series.",
      "content": "In my country, showing various Turkish TV series some kind of practice. Many of them are just, how to say politely, bad to extremely bad quantity but not quality tv series. But this is different.I don't like Turkish TV series, some are too predictable, some are just bad in any aspect, some are more than bad and there is one that is better than many TV series around the world. It's Ezel.Great balanced Turkish tv series is what audience need. All Turkish director should look at this project (Ezel) and learn from it. Balance is important. Balance between action, drama, mystery etc. is important! That is what Ezel has. Balance. (i am starting to be boring with this balance, but that is what we need, really).By the way, i watched every episode of Ezel. I really enjoyed it and you will not regret watching the whole tv series."
    },
    {
      "username": "bmmutlu",
      "userUrl": "https://www.imdb.com/user/ur24753201",
      "reviewLink": "https://www.imdb.com/review/rw2378323",
      "warningSpoilers": false,
      "date": "28 January 2011",
      "rate": "10",
      "helpful": "59 out of 76 found this helpful.",
      "title": "very nice and very dynamic story; great cast",
      "content": "i enjoy watching it, it is my favorite TV series... this is not only for ladies or oldies or youngs, I think this is targeted 25-45 age average... No doubt this is one of the best TV series in Turkey for the moment. Unlike other love based drama series (aski mennu) or only action based ones (kurtlar vadisi), this has nice balance of everything in the story... Lots of main players... very good character analysis. yes story is little bit turning around with same people and Ezel never strong enough to take the revenge but in 2nd season things are changing... that's good. i like the soundtrack of the series... i like DAYI's talkings advices... second season flashbacks to Dayi's stories is very nice... like another movie in a movie... places are very nicely selected in Istanbul fun, love, action everything is there..well done!!"
    },
    {
      "username": "ahjaslmomaga",
      "userUrl": "https://www.imdb.com/user/ur88541427",
      "reviewLink": "https://www.imdb.com/review/rw4176273",
      "warningSpoilers": false,
      "date": "24 May 2018",
      "rate": "10",
      "helpful": "25 out of 26 found this helpful.",
      "title": "Until this moment, this television series is considered the best ever.",
      "content": "It's a television action oriented to the world, I advise everyone to follow it."
    },
    {
      "username": "Sermi85",
      "userUrl": "https://www.imdb.com/user/ur25152274",
      "reviewLink": "https://www.imdb.com/review/rw2411055",
      "warningSpoilers": true,
      "date": "9 April 2011",
      "rate": "10",
      "helpful": "54 out of 68 found this helpful.",
      "title": "Brilliant - despite being (loosely) based on Le Comte de Monte Cristo...",
      "content": "Generally speaking, I hate films and television series based on Dumas père's marvellous \"Le Comte de Monte Cristo\" - not because I dislike the novel (it's one of my favourites) but because most of the screen adaptations of the book compare so unfavourably to the source material that one has one's doubts as to whether the scriptwriters actually ever read the book. Almost invariably, the story lines follow the same patterns, altering the aspects of the book that make it great, without being daring enough to create good original material.Ezel is different - it doesn't even try to follow the details of the novel (it takes in present day Turkey and Cyprus, not 19th century Paris, and the characters bear little resemblance to their prototypes), but it smartly captures those aspects of the narrative that made the book great to begin with, while coming up with plenty of worthwhile original plot twists on its own.So what makes the series so great? First, the non-linear narrative makes this serialized television at its best (interestingly, Dumas originally planned to begin Monte Cristo with the revenge story, and tell the background story through \"flashbacks\", which is the route the screenwriters take here).Second, both the casting and character development are fantastic. A major problem with most Monte Cristo adaptations is that the main character is either played either as being something of a hot-head or so self-pitying that the viewer wonders how he could possibly have the self-control and intelligence to conceive or carry out an elaborate plot of vengeance. Kenan Imirzalioglu's Ezel, however, avoids both those pitfalls. He's all cold, carefully controlled rage - but the viewer never forgets that somewhere deep down, Omer (his original identity) lives on. Cansu Dere, in a role that is the antithesis of her part in \"Sila\", is equally excellent as his morally compromised love interest. Eyşan is not precisely what one would call a nice person - but as played with tragic vulnerability by Dere, the viewer can believe that she wants to be a good person, if only she knew how, and one finds oneself rooting for her redemption. It's difficult to think of a more complex or stereotype-breaking character on television than Eyşan. The rest of the cast is also extremely well-suited to their parts, and the villains do not suffer from that ubiquitous disease suffered by most television villains - one-dimensionality. Baris Falay's delightfully over-the-top performance as Ali (I mean that in a good way) is nicely balanced out by Yigit Özsener's creepily understated menace as Cengiz. Tuncel Kurtiz gives what may be the best performance of his long and distinguished career as Ezel's prison \"mentor\", while Sedef Avci is luminous as Eyşan's doomed younger sister. Third, there are the production values. The series is visually sleek, but substance is never sacrificed for style. The costume designers also seem to be having fun, dressing Imirzalioglu in slick high-end designer suits and Dere in the sort of outfits only models (or characters played by them) can carry off. Finally, the soundtrack is incredible - it compares favourably in terms of quality and originality with great film scores like that from \"The Godfather\", \"The Mission\", and \"Doctor Zhivago\", creating exactly the right emotional pitch of excitement and suspense. The series lives up to its hype."
    },
    {
      "username": "threedeeguru",
      "userUrl": "https://www.imdb.com/user/ur10844819",
      "reviewLink": "https://www.imdb.com/review/rw2577835",
      "warningSpoilers": false,
      "date": "8 March 2012",
      "rate": "10",
      "helpful": "46 out of 63 found this helpful.",
      "title": "Much better than LOST!!!",
      "content": "I would like to mention that, I \"was\" a Lost fan and started to watch from day 1 without any episode or minutes of it being lost. I was so amazed for the 5-6 years of the show, and had a joke about the ending of the series, which I wouldn't think it would end so bluntly as a 100% correct guess of my joke. I thought I was so betrayed in the end, and became an anti-fan of it.Now why did I mention about Lost in a comment supposed to be about the Turkish series Ezel? It is short and simple, in the end of the series, I was satisfied with the results, and it was clever and not much obvious as it was on Lost.I would recommend everyone this series who like mind games. It is not like a mind-game lookalike like the series Lost."
    },
    {
      "username": "vandaiwanowski",
      "userUrl": "https://www.imdb.com/user/ur69843219",
      "reviewLink": "https://www.imdb.com/review/rw3702800",
      "warningSpoilers": true,
      "date": "7 May 2017",
      "rate": "10",
      "helpful": "17 out of 20 found this helpful.",
      "title": "Excellent, I adored Ezel",
      "content": "Ezel changed my life, I cannot add much to what has already been said about the cast, characters and plot. What I can say that it hit me hard, deeply emotional yet funny at times. Ali (The Pliers) cracked me up both good, bad, happy and sad.As for Ezel, I have to say I adored him, not as Omer so much but as he matured into Ezel his tortured soul,torn between right and wrong. Ezel was like looking into the mirror of my soul a reflection of past. The music haunts me Ezel will stay with me forever, thank you Turkish TV. I cannot wait for series 2 on NetflixI have just finished series 2 on Youtube, thank you JanaP and other Translators, you put in a lot of very hard work.Was just as thrilled with season 2, as Dayi and Kenan background unfolded. Yes you really need intelligence to appreciate and follow Ezel. Agree with previous comments around that as well as the program staying with you it burrows in and stays with you. Yes the ending was very sad at the same time left open for each person to come to their own conclusion, Ali Abi was brilliant in series 2, truly sorry for his betrayal. Loved that he, Azad and baby Teflo had happy ending. Can was lucky to end up with them. Cengis....what can you say, I would have got rid of him long before. So glad Ezel and Ali let him go!loved the train scene, Ezel and Asyan together forever, I don't think it could have ended any other way. I cannot explain the effect Ezel has on you....it does change the way you think and live your life!! Perhaps as suggested by others it hits some people on a much deeper level.For those who watch TV for pure light entertainment alone Ezel may not be for you. It take deep concentration and understanding and hits you emotionally. Thank you for giving me the Ezel experience and taking me along the journey. Xx"
    },
    {
      "username": "salehbaghdadian",
      "userUrl": "https://www.imdb.com/user/ur103359013",
      "reviewLink": "https://www.imdb.com/review/rw6315065",
      "warningSpoilers": false,
      "date": "27 November 2020",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Best Turk tv show",
      "content": "Excellent job, good script, great staff, from the best production company in Turkey ay yapim ."
    },
    {
      "username": "ahjaslmomaga",
      "userUrl": "https://www.imdb.com/user/ur88541427",
      "reviewLink": "https://www.imdb.com/review/rw4176276",
      "warningSpoilers": false,
      "date": "24 May 2018",
      "rate": "10",
      "helpful": "19 out of 21 found this helpful.",
      "title": "legendary TV work",
      "content": "The TV series ever & for ever. Never similar television work will come ever."
    },
    {
      "username": "milzaauthor",
      "userUrl": "https://www.imdb.com/user/ur66303435",
      "reviewLink": "https://www.imdb.com/review/rw3449653",
      "warningSpoilers": false,
      "date": "11 April 2016",
      "rate": "10",
      "helpful": "79 out of 87 found this helpful.",
      "title": "Greatest TV series ever made",
      "content": "I never watched Turkish series before, I got used to see the latinamerican series and the ones made in USA and Canada. Never expected something like this could have been done, the series is a mixture of mystery, drama, action, and literature. The film edition is amazing, absolutely extraordinary camera work, never ever saw angles and colors like that ones before. Poetry is essential part of the series, the speaking of the characters is crazy, and every episode is perfectly ensambled from beginning to end. I think this series can show the soul and the mind of human beings as if they are expressed in material terms. If you love reading and thinking this series is for you, you have to put all your attention and don't let go any detail. I just have to say I loved the script, the actors, the locations, the camera, the feelings this gave me, etc. It's addictive. I don't think there will be something like this again."
    },
    {
      "username": "kemal-tattoo",
      "userUrl": "https://www.imdb.com/user/ur24434997",
      "reviewLink": "https://www.imdb.com/review/rw2349595",
      "warningSpoilers": false,
      "date": "7 December 2010",
      "rate": "10",
      "helpful": "107 out of 128 found this helpful.",
      "title": "Best TV Series Ever Made in Turkey!",
      "content": "A great TV series. But not only in Turkish TV standards. It's tremendous mix of action, crime and drama. Ezel is loosely based on Alexander Dumas' masterpiece Count of Monte Cristo. After betrayal his best friends and love of his life, Omer returns with a new face, new identity and with a flawless revenge plan. And a new name: Ezel.But story is not like what it seems. It has so many themes and back stories. Direction is quite different than other TV series. Narrative with flashbacks quite effective. Every episode is like a movie. Wonderfully written script is full of secrets and surprises. You just can't predict what is going to happen next.All the actors are magnificent. (But Cansu Dere is trying so hard. She is god awful actress.) Especially Kenan Imirzalioglu (which is the best actor of his generation) and Tuncel Kurtiz are awesome. Tuncel Kurtiz's character Ramiz Karaeski is a phenomenon. He is like a god and full of mysteries. You have to see it to believe it.I would strongly suggest that anyone who has not yet seen it give it a try. Definitely is the best TV series ever made in Turkey."
    },
    {
      "username": "tuncermuhammed",
      "userUrl": "https://www.imdb.com/user/ur24217983",
      "reviewLink": "https://www.imdb.com/review/rw2394783",
      "warningSpoilers": false,
      "date": "6 March 2011",
      "rate": "10",
      "helpful": "52 out of 66 found this helpful.",
      "title": "watching with a great pleasure!",
      "content": "First of all, l would like to thank the Turkish film industry for Ezel. I watched all the episodes without ever getting bored! Each episode comes with excitement, adrenaline and adventure in breath-taking, and scenes that you definitely feel like \"wow\" !You are expected to understand the first episodes fully to be able to follow the subject of the other episodes. Otherwise it is not easy to understand what is going on in any episode. So viewers should keep in mind that the issues in Ezel are not independent of each other.Last but not least, in the second season you will see some guest actors and actresses. Though each episode is a bit long (one and a half hours) you will be not feeling more than one hour."
    },
    {
      "username": "oguzhan_wert",
      "userUrl": "https://www.imdb.com/user/ur125141706",
      "reviewLink": "https://www.imdb.com/review/rw6172898",
      "warningSpoilers": false,
      "date": "13 October 2020",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Hands down best Drama series ever",
      "content": "This Turkish Drama series was just too Good.From the beginning to the end it kept you excited and u could feel the Characters.It was nicely filmed and acted and the Drama was Epic.By far the best Turkish Drama series made.Ramiz dayi and Ezel are the best played and most well done Characters."
    },
    {
      "username": "makscoric",
      "userUrl": "https://www.imdb.com/user/ur89515978",
      "reviewLink": "https://www.imdb.com/review/rw6601508",
      "warningSpoilers": false,
      "date": "16 February 2021",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "This masterpiece is comparable to Breaking Bad.",
      "content": "Guys do not give it a bad rating! If you watched it on Netflix, the 72nd episode was not the end! There is Season 2, but not on Netflix or other platforms. You do not even know what you missed... Season 2 is even better than Season 1. Phenomenal!!!"
    },
    {
      "username": "becitdavut",
      "userUrl": "https://www.imdb.com/user/ur50472131",
      "reviewLink": "https://www.imdb.com/review/rw5257116",
      "warningSpoilers": false,
      "date": "14 November 2019",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Best of the best of the best of the best.",
      "content": "A masterpiece with acting, screenplay and music. If I made a list of my favorite series, I would put Breaking Bad and Ezel in the first place."
    },
    {
      "username": "mferraro-76402",
      "userUrl": "https://www.imdb.com/user/ur82151290",
      "reviewLink": "https://www.imdb.com/review/rw3853199",
      "warningSpoilers": false,
      "date": "8 November 2017",
      "rate": "",
      "helpful": "25 out of 30 found this helpful.",
      "title": "Dubbing",
      "content": "I've only just begun watching the series and have high expectations after reading the other reviews. Can I just say....I'd much rather read subtitles, that listen to dubbed (voice over) commentary. Besides annoying, I like to hear the actors/actresses voices and language. Does anyone else agree?"
    },
    {
      "username": "mphsflynn",
      "userUrl": "https://www.imdb.com/user/ur107677399",
      "reviewLink": "https://www.imdb.com/review/rw5119081",
      "warningSpoilers": false,
      "date": "14 September 2019",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Awesome. Wish all were on Netfix",
      "content": "I loved the available episodes on Netflix. Now trying to find remainder on YouTube!"
    },
    {
      "username": "krisztinaobrien",
      "userUrl": "https://www.imdb.com/user/ur44576452",
      "reviewLink": "https://www.imdb.com/review/rw5396571",
      "warningSpoilers": false,
      "date": "10 January 2020",
      "rate": "7",
      "helpful": "3 out of 4 found this helpful.",
      "title": "Amazing as long as its cut to hr long episodes",
      "content": "Turks know how to act and do soap/ drama series. i watched many and an advocate. However, turkish serieses have to be severely shortened. Unnecessarily meaningless episodes (bulk up) must be edited out, if it is to win western taste. Ezel is a clear winner, even though its a bit Twin Peaks in the end. It is a \"must watch\""
    },
    {
      "username": "keta-chumburidze",
      "userUrl": "https://www.imdb.com/user/ur57856583",
      "reviewLink": "https://www.imdb.com/review/rw3222170",
      "warningSpoilers": false,
      "date": "18 April 2015",
      "rate": "10",
      "helpful": "33 out of 44 found this helpful.",
      "title": "The best series ever made!",
      "content": "EZEL! i have seen many series, especially American, and i loved it. but one day i have seen Ezel! and all the series blocked in my mind except this. this is drama, every episode is a like film. and it is the most emotional series i have ever seen. it is about players and killers, mind games, when u watch this u are stresses(in a good way) it is about everything: revenge, regret, love, hate, friendship, family, loyalty, betray, and it techs u so many thing, it is also the wisest series, i have grown up with this series and learn much.. and the character are really, they are people not a fictional robots, and this is main why i love it so much, cast is perfect, all of them plays super-hipper that u believe every word they say. i love all the character in Ezel, even wicked, because maybe they are bad but they are human too, even killers, reg regret they love, i cant say anymore this isn't just interesting TV series which gives you nothing. Ezel taught me so much that i every day thanks god to give this present, EZEL, to me. but in this series are many things that May don't understand a young child ever 13 years old,if you decide to watch this you must understand, you must listen to every word and to pay attention every dynamic they do. I WANT TO SAY I AM CRAZY ON ABOUT THIS SERIES, THIS ISNOT ONLU SERIES TO ME, THIS BECAME THE CRUCIAL PART OF MY LIFE, IF YOU WATCH THIS YPU WLL NEVER REGRET, AND IT WILL STAY IN YOU LIFE FOREVER! watch Ezel, and you will be more intelligent, clever, experienced, IT ISNOT JUST SERIESM IT IS WONDER, IT IS 8TH WONDER OF THE WORLD. I have especially feelings with it!!!!!!!!!!! watch this and if our understands everything in Ezel, you are really intelligent! i love it1"
    }
  ],
  "errorMessage": ""
}