{
  "imDbId": "tt1534360",
  "title": "Ezel",
  "fullTitle": "Ezel (TV Series 2009–2011)",
  "type": "TVSeries",
  "year": "2009",
  "language": "en",
  "titleInLanguage": "Ezel (TV series)",
  "url": "https://en.wikipedia.org/wiki/Ezel_(TV_series)",
  "plotShort": {
    "plainText": "Ezel (Turkish pronunciation:) is a Turkish crime thriller TV series that was initially broadcast by Show TV in fall 2009. In 2010 it was transferred to ATV. It has gained a considerably large fan base in Turkey since. Series stars Kenan İmirzalıoğlu, Cansu Dere and Yiğit Özşener in leads. Although it is set in modern-day Istanbul, filming also took place in North Cyprus, Croatia, and England. The series is an adaptation of Alexandre Dumas' 1844 novel The Count of Monte Cristo.",
    "html": "<p>Ezel (Turkish pronunciation:) is a Turkish crime thriller TV series that was initially broadcast by Show TV in fall 2009. In 2010 it was transferred to ATV. It has gained a considerably large fan base in Turkey since. Series stars Kenan İmirzalıoğlu, Cansu Dere and Yiğit Özşener in leads. Although it is set in modern-day Istanbul, filming also took place in North Cyprus, Croatia, and England. The series is an adaptation of Alexandre Dumas' 1844 novel The Count of Monte Cristo.</p>"
  },
  "plotFull": {
    "plainText": "Ezel (Turkish pronunciation:) is a Turkish crime thriller TV series that was initially broadcast by Show TV in fall 2009. In 2010 it was transferred to ATV. It has gained a considerably large fan base in Turkey since. Series stars Kenan İmirzalıoğlu, Cansu Dere and Yiğit Özşener in leads. Although it is set in modern-day Istanbul, filming also took place in North Cyprus, Croatia, and England. The series is an adaptation of Alexandre Dumas' 1844 novel The Count of Monte Cristo.\r\nSynopsis\r\nBetrayed by his trusted friends and the woman he loved, Ömer Uçar returns as Ezel to exact his vengeance.\r\nSummary\r\nIn 1997 in Istanbul, Turkey, Ömer Uçar (Ismail Filiz) and his family lived a comfortable lower middle-class life, until one day his life was changed forever. Ömer had two best friends that he had known for years, Ali and Cengiz. Ömer worked with Ali (Barış Falay) as a motor mechanic, and Cengiz (Yiğit Özşener) when Ömer met and fell in love with Eyşan (Cansu Dere). Ali and Cengiz soon become convinced by Serdar Tezcan (Salih Kalyon), who is also Eyşan's father, to rob a casino. Serdar devises the whole scheme, and figures that it will require four people to pull off a successful robbery. Cengiz was up first in the plot to rob the casino, he was the mole and was working there in order to gain access. Ali comes into play next as the ruthless killer on the night of the robbery. The third accomplice is Eyşan (Cansu Dere), the skilled con-woman who manipulates men for their money as a career and this time her victim would be Ömer. In Serdar's plan, Ömer would be the fourth person to complete the job. Ömer is blamed for the robbery by way of implanting false evidence, misleading the police and ceasing all other investigations on the matter. Serdar's primary motive was the money, though his love for a good con also played a role. Eyşan's, Cengiz' and Ali's motives would be revealed later in the series.\r\nAli and Cengiz at the time believed that Ömer would only get a few years in jail for stealing the money; however, the robbery went wrong and Ali had to shoot and kill the security guard. The same gun that was used in the robbery was pointed at Ömer by Cengiz just a few days before the crime. After having too many drinks, Cengiz, in a drunken state and wearing gloves, points the gun at Ömer, after which he manages to take the gun away from Cengiz only to leave his prints on the gun, sealing his fate. Further evidence to implicate Ömer to the crime is a jacket that he had previously worn which was also dumped with the gun ensuring the police a swift arrest.\r\nIn 1997, when Ömer was blamed for the crime, the commissar (Mesut Akusta) went to the prison cell where Ömer was in there for a couple hours. Whilst the chief commissar was inside the cell, he kept inquiring about the whereabouts of the money, even though Ömer kept denying having done the robbery. Because of his lack of cooperation, Ömer was beaten up for hours. Afterwards, during Ömer's trial, the judge showed the picture of the murder weapon used in the robbery, a gun, and a picture of a similarly related jacket. Although Ömer was still insisting that he was innocent, a witness was called to the stand. That witness was revealed to be Eyşan, who falsely testified that it was Ömer who robbed the casino and murdered the security guard. In anger, he escaped from the clutches of the\r\nEyşan's testimony was to re-establish the evidence and accusations, cementing her betrayal. The plan worked successfully and all the while Ali, Cengiz, Serdar and Eyşan got away with murder and millions of dollars. Ömer went to jail for the crime he didn't commit the day after he proposed to Eyşan. During his incarceration, Ömer had some very hard times, being beaten almost daily by the chief prison warden who was convinced that Ömer had indeed committed the crime, and wanted to know the exact whereabouts of the money. His family was even threatened, and so his hatred for his old friends grew for what they had done to him. Ömer's only luck was to be taken under the wing of Ramiz Karaeski (referred to as Uncle Ramiz, played by Tuncel Kurtiz), once a powerful mafia type figure who treated Ömer like one of his sons and offered him some protection while imprisoned.\r\nIn 2005, Ömer had his face badly cut by the chief warden with two other guards by using a riot in the prison as an excuse to beat Ömer, so he would tell where the money was. Ömer pretended to tell him, so that when the warden dismissed the other guards, a fight to the death meant the head warden was killed. With help from Ramiz, it was made known that Ömer had died but his face was unrecognisable, when actually Ömer escaped the jail and had full plastic surgery. Ömer Uçar then changes his name to Ezel Bayraktar (meaning \"eternity\" in Turkish) (Kenan İmirzalıoğlu), and returns to get his revenge, unknown to his previous friends, Eyşan and Cengiz (who are now married and have a son), and Ali (who is head of security at Cengiz's hotel) The once simple boy becomes a man exceptionally skilled at gambling, reading people, and fighting, and has considerably high class in society. He is helped by his assistants Kamil (Güray Kip) and Sebnem (Bade İşçil), as well as his prison mentor Ramiz Karaeski.\r\nEyşan's motive for framing Ömer was to save her sister Bahar's life. Serdar explained to Eyşan that Bahar was terminally ill and would need expensive treatment out of the country at better medical facilities, such as in England. The money would be the only way to pay for that treatment. A torn Eyşan ultimately chose to send her love to what she thought would be a short prison sentence in exchange for her sister's recovery. Cengiz went along with the plan because he fell in love with Eyşan the moment he saw her, and he would do anything she asked. Besides, Cengiz figured that with Ömer in prison he would have a clear path to winning Eyşan's heart.\r\nAli's motive was the big mystery. Like Eyşan, he greatly regretted sending Ömer to prison, and much later in the series it was revealed that he did so only at Eyşan's prodding. She reminded him that Ali's own father had gone to prison years earlier, having taken the blame for Ali's accidental fatal shooting of a young boy when Ali was a teenager. Ali's father made his son promise him to \"become a big man,\" and so Ali figured his time was running out, and the casino robbery would give him the money and power that would fulfill his promise to his father.\r\nAs the first season closes, Ömer, now Ezel, eventually reveals his identify to his former friends, after he believes that he has punished them enough. A second plot comes to the forefront, however, and intertwines with the first. A new villain emerges, more powerful than Ramiz in terms of connections, considered the most powerful man in Turkey, in fact: Kenan Birkan. It turns out that Ramiz and Kenan were best friends 30 years earlier, bitterly torn apart by their common love interest, Selma. It is also revealed that even though Ramiz genuinely loves Ömer/Ezel like a son, part of why he groomed him was to create a good and trustworthy right-hand man to help him battle Kenan.\r\nAs the second and final season winds to an ultimate conclusion, the plot moves along at a furious pace, with main characters killed off in substantially every episode. In the final episode (71), the only ones left standing are Ezel, Eyşan, their young son, Ezel's mother and father, Ali, his wife (Ramiz' daughter) Azad, their baby boy Tevfik aka \"Tefo\" (named after Ali's deceased right-hand man and dear friend), Bade (Ezel's brief love interest), and Sebnem, Tevfik's widow. Ezel (Ömer) and Eyşan have recaptured their love, but an insanely jealous Cengiz rapes Eyşan and nearly kills her, informing the police that Ezel did it. As she lies in the hospital in critical condition, Eyşan reveals that it was Cengiz and not Ezel who did that to her. Meanwhile, Ezel and Ali catch up with Cengiz at a lighthouse and kill him. Ezel then returns to the hospital where the doctors tell him that Eyşan has only a few hours left to live. She wants to die in Ömer's arms.\r\nIn a vague and rather metaphysical conclusion, Ezel and Eyşan ride on a train as Eyşan's eyes close and it appears that she has died. Ezel then drinks some liquid from a ring that Ramiz had given him with the instructions never to \"wear the ring\" (i.e., drink from it) unless he was ready for a new life. Ezel's eyes also close and he tells Eyşan that he is coming to be with her, and that Bahar (who had been killed much earlier in the series) is waiting for them, too. The camera pans to other passengers on the train, the beloved friends and family of Ömer and Eyşan that had been killed, including Ramiz, Bahar, and Ezel's little brother, Mert.\r\nIn the final scene, a young man on a motorcycle pulls up to the lighthouse and tells the guard \"I am here to see my father.\" When asked to identify himself, the young man reveals he is Ömer's son. As he approaches the door, the camera shows a silhouette of a man opening the door, and making a gesture as if to scratch his head, much like Ömer/Ezel used to. The audience is left wondering what really happened: Whether that is Ezel, whether he died on that train with Eyşan, or whether he lived. Whether that liquid in the ring was poison or not. Whether or not the train scene, in fact, was real or imagined. That all leaves the possibility of a third season wide open, even though most of the characters have been killed off.\r\nLocation\r\nThe story is set in Istanbul, Turkey. Filming took place in North Cyprus, Croatia, England and Bosnia and Herzegovina.\r\nCast\r\nAwards\r\n\r\nEzel in other languages\r\nEzel was translated multiple times and broadcast in foreign channels, most notably to :\r\nAlbania on RTV Klan in 2011\r\nArgentina on Telefe from 11 May 2015\r\nAzerbaijan on ARB from 20 September 2020\r\nBangladesh on Deepto TV from 13 November 2018\r\nBosnia and Herzegovina on BHRT in 2011\r\nBrazil on Rede Bandeirantes in 2016\r\nBulgaria on Nova TV in 2012\r\nChile on Chilean TV channel Mega in 2014\r\nColombia on Caracol Televisión in 2015\r\nCroatia on RTL Televizija in 2011, 2012\r\nCzech Republic on Prima Love in 2011\r\nGreece on ANT1 TV in 2011\r\nHungary on RTL Klub in 2011\r\nIran on Gem TV in 2010 and Gem Classic in 2011\r\nIraq on Kurdsat in 2016 and 2017\r\nIsrael on Viva Plus\r\nKazakhstan on Habar in 2011\r\nKosovo on RTV21 in 2013\r\nLithuania on LNK in 2013–2014\r\nMorocco on 2M\r\nNorth Macedonia on Sitel TV in 2011\r\nPakistan on Geo Kahani in 2013\r\nPeru on Latina in 2015\r\nRomania on Kanal D Romania in 2010–2011\r\nSaudi Arabia on MBC4 in 2012\r\nSerbia on Prva from 18 June 2012 to 14 October 2012\r\nSlovakia on TV Doma from 10 April 2012 to 3 December 2012\r\nSpain on Nova (Spain TV channel) 2018\r\nSri Lanka on Swarnavahini as Wes in 2018, it is an adaptation of The Count of Monte Cristo and an influence of Ezel television series.\r\nTunisia on Nessma TV 2019\r\nUnited Arab Emirates on Abu Dhabi Al Oula in 2010\r\nUnited States on Netflix\r\nThe movie has been sold to over 100 countries.\r\nSpin-offs\r\nArmenia's leading TV channel, Shant TV, purchased the script rights to the show and produced its own TV series featuring local actors and actresses who resemble their Turkish peers. The Armenian producers hid the fact that the show was originally a Turkish production, fearing protests from the Armenian audience.\r\nThe series was also adapted by Romanian TV channel Pro TV under the title Vlad.",
    "html": "<p>Ezel (Turkish pronunciation:) is a Turkish crime thriller TV series that was initially broadcast by Show TV in fall 2009. In 2010 it was transferred to ATV. It has gained a considerably large fan base in Turkey since. Series stars Kenan İmirzalıoğlu, Cansu Dere and Yiğit Özşener in leads. Although it is set in modern-day Istanbul, filming also took place in North Cyprus, Croatia, and England. The series is an adaptation of Alexandre Dumas' 1844 novel The Count of Monte Cristo.</p><br/><h3>Synopsis</h3><p>Betrayed by his trusted friends and the woman he loved, Ömer Uçar returns as Ezel to exact his vengeance.</p><br/><h3>Summary</h3><p>In 1997 in Istanbul, Turkey, Ömer Uçar (Ismail Filiz) and his family lived a comfortable lower middle-class life, until one day his life was changed forever. Ömer had two best friends that he had known for years, Ali and Cengiz. Ömer worked with Ali (Barış Falay) as a motor mechanic, and Cengiz (Yiğit Özşener) when Ömer met and fell in love with Eyşan (Cansu Dere). Ali and Cengiz soon become convinced by Serdar Tezcan (Salih Kalyon), who is also Eyşan's father, to rob a casino. Serdar devises the whole scheme, and figures that it will require four people to pull off a successful robbery. Cengiz was up first in the plot to rob the casino, he was the mole and was working there in order to gain access. Ali comes into play next as the ruthless killer on the night of the robbery. The third accomplice is Eyşan (Cansu Dere), the skilled con-woman who manipulates men for their money as a career and this time her victim would be Ömer. In Serdar's plan, Ömer would be the fourth person to complete the job. Ömer is blamed for the robbery by way of implanting false evidence, misleading the police and ceasing all other investigations on the matter. Serdar's primary motive was the money, though his love for a good con also played a role. Eyşan's, Cengiz' and Ali's motives would be revealed later in the series.</p><p>Ali and Cengiz at the time believed that Ömer would only get a few years in jail for stealing the money; however, the robbery went wrong and Ali had to shoot and kill the security guard. The same gun that was used in the robbery was pointed at Ömer by Cengiz just a few days before the crime. After having too many drinks, Cengiz, in a drunken state and wearing gloves, points the gun at Ömer, after which he manages to take the gun away from Cengiz only to leave his prints on the gun, sealing his fate. Further evidence to implicate Ömer to the crime is a jacket that he had previously worn which was also dumped with the gun ensuring the police a swift arrest.</p><p>In 1997, when Ömer was blamed for the crime, the commissar (Mesut Akusta) went to the prison cell where Ömer was in there for a couple hours. Whilst the chief commissar was inside the cell, he kept inquiring about the whereabouts of the money, even though Ömer kept denying having done the robbery. Because of his lack of cooperation, Ömer was beaten up for hours. Afterwards, during Ömer's trial, the judge showed the picture of the murder weapon used in the robbery, a gun, and a picture of a similarly related jacket. Although Ömer was still insisting that he was innocent, a witness was called to the stand. That witness was revealed to be Eyşan, who falsely testified that it was Ömer who robbed the casino and murdered the security guard. In anger, he escaped from the clutches of the</p><p>Eyşan's testimony was to re-establish the evidence and accusations, cementing her betrayal. The plan worked successfully and all the while Ali, Cengiz, Serdar and Eyşan got away with murder and millions of dollars. Ömer went to jail for the crime he didn't commit the day after he proposed to Eyşan. During his incarceration, Ömer had some very hard times, being beaten almost daily by the chief prison warden who was convinced that Ömer had indeed committed the crime, and wanted to know the exact whereabouts of the money. His family was even threatened, and so his hatred for his old friends grew for what they had done to him. Ömer's only luck was to be taken under the wing of Ramiz Karaeski (referred to as Uncle Ramiz, played by Tuncel Kurtiz), once a powerful mafia type figure who treated Ömer like one of his sons and offered him some protection while imprisoned.</p><p>In 2005, Ömer had his face badly cut by the chief warden with two other guards by using a riot in the prison as an excuse to beat Ömer, so he would tell where the money was. Ömer pretended to tell him, so that when the warden dismissed the other guards, a fight to the death meant the head warden was killed. With help from Ramiz, it was made known that Ömer had died but his face was unrecognisable, when actually Ömer escaped the jail and had full plastic surgery. Ömer Uçar then changes his name to Ezel Bayraktar (meaning \"eternity\" in Turkish) (Kenan İmirzalıoğlu), and returns to get his revenge, unknown to his previous friends, Eyşan and Cengiz (who are now married and have a son), and Ali (who is head of security at Cengiz's hotel) The once simple boy becomes a man exceptionally skilled at gambling, reading people, and fighting, and has considerably high class in society. He is helped by his assistants Kamil (Güray Kip) and Sebnem (Bade İşçil), as well as his prison mentor Ramiz Karaeski.</p><p>Eyşan's motive for framing Ömer was to save her sister Bahar's life. Serdar explained to Eyşan that Bahar was terminally ill and would need expensive treatment out of the country at better medical facilities, such as in England. The money would be the only way to pay for that treatment. A torn Eyşan ultimately chose to send her love to what she thought would be a short prison sentence in exchange for her sister's recovery. Cengiz went along with the plan because he fell in love with Eyşan the moment he saw her, and he would do anything she asked. Besides, Cengiz figured that with Ömer in prison he would have a clear path to winning Eyşan's heart.</p><p>Ali's motive was the big mystery. Like Eyşan, he greatly regretted sending Ömer to prison, and much later in the series it was revealed that he did so only at Eyşan's prodding. She reminded him that Ali's own father had gone to prison years earlier, having taken the blame for Ali's accidental fatal shooting of a young boy when Ali was a teenager. Ali's father made his son promise him to \"become a big man,\" and so Ali figured his time was running out, and the casino robbery would give him the money and power that would fulfill his promise to his father.</p><p>As the first season closes, Ömer, now Ezel, eventually reveals his identify to his former friends, after he believes that he has punished them enough. A second plot comes to the forefront, however, and intertwines with the first. A new villain emerges, more powerful than Ramiz in terms of connections, considered the most powerful man in Turkey, in fact: Kenan Birkan. It turns out that Ramiz and Kenan were best friends 30 years earlier, bitterly torn apart by their common love interest, Selma. It is also revealed that even though Ramiz genuinely loves Ömer/Ezel like a son, part of why he groomed him was to create a good and trustworthy right-hand man to help him battle Kenan.</p><p>As the second and final season winds to an ultimate conclusion, the plot moves along at a furious pace, with main characters killed off in substantially every episode. In the final episode (71), the only ones left standing are Ezel, Eyşan, their young son, Ezel's mother and father, Ali, his wife (Ramiz' daughter) Azad, their baby boy Tevfik aka \"Tefo\" (named after Ali's deceased right-hand man and dear friend), Bade (Ezel's brief love interest), and Sebnem, Tevfik's widow. Ezel (Ömer) and Eyşan have recaptured their love, but an insanely jealous Cengiz rapes Eyşan and nearly kills her, informing the police that Ezel did it. As she lies in the hospital in critical condition, Eyşan reveals that it was Cengiz and not Ezel who did that to her. Meanwhile, Ezel and Ali catch up with Cengiz at a lighthouse and kill him. Ezel then returns to the hospital where the doctors tell him that Eyşan has only a few hours left to live. She wants to die in Ömer's arms.</p><p>In a vague and rather metaphysical conclusion, Ezel and Eyşan ride on a train as Eyşan's eyes close and it appears that she has died. Ezel then drinks some liquid from a ring that Ramiz had given him with the instructions never to \"wear the ring\" (i.e., drink from it) unless he was ready for a new life. Ezel's eyes also close and he tells Eyşan that he is coming to be with her, and that Bahar (who had been killed much earlier in the series) is waiting for them, too. The camera pans to other passengers on the train, the beloved friends and family of Ömer and Eyşan that had been killed, including Ramiz, Bahar, and Ezel's little brother, Mert.</p><p>In the final scene, a young man on a motorcycle pulls up to the lighthouse and tells the guard \"I am here to see my father.\" When asked to identify himself, the young man reveals he is Ömer's son. As he approaches the door, the camera shows a silhouette of a man opening the door, and making a gesture as if to scratch his head, much like Ömer/Ezel used to. The audience is left wondering what really happened: Whether that is Ezel, whether he died on that train with Eyşan, or whether he lived. Whether that liquid in the ring was poison or not. Whether or not the train scene, in fact, was real or imagined. That all leaves the possibility of a third season wide open, even though most of the characters have been killed off.</p><br/><h3>Location</h3><p>The story is set in Istanbul, Turkey. Filming took place in North Cyprus, Croatia, England and Bosnia and Herzegovina.</p><br/><h3>Cast</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Actors</th><th>Characters</th></tr><tr><td><span>Kenan İmirzalıoğlu</span></td><td>Ezel Bayraktar</td></tr><tr><td><span class=\"new\">Ema Park</span></td><td>Sęymą</td></tr><tr><td><span class=\"new\">İsmail Filiz</span></td><td>Ömer Uçar</td></tr><tr><td><span>Cansu Dere</span></td><td>Eyşan Atay</td></tr><tr><td><span>Yiğit Özşener</span></td><td>Cengiz Atay</td></tr><tr><td><span>Barış Falay</span></td><td>\"Kerpeten\" Ali Kırgız</td></tr><tr><td><span>Tuncel Kurtiz</span></td><td>Ramiz Karaeski</td></tr><tr><td><span>Sarp Akkaya</span></td><td>Tevfik Zaim</td></tr><tr><td>Bade İşçil</td><td>Şebnem Zaim</td></tr><tr><td><span class=\"mw-redirect\">Sedef Avcı</span></td><td>Bahar Tezcan</td></tr><tr><td><span>Haluk Bilginer</span></td><td>Kenan Birkan</td></tr><tr><td><span class=\"new\">Salih Kalyon</span></td><td>Serdar Tezcan</td></tr><tr><td><span>İpek Bilgin</span></td><td>Meliha Uçar</td></tr><tr><td><span class=\"new\">Beyazıt Gülercan</span></td><td>Mümtaz Uçar</td></tr><tr><td><span>Burak Dakak</span> <span class=\"new\">Kemal Uçar</span></td><td>Mert Uçar</td></tr><tr><td><span>Burçin Terzioğlu</span></td><td>Azad Karaeski</td></tr><tr><td>Güray Kip</td><td>Kamil Çamlıca</td></tr><tr><td>Utku Barış Serma</td><td>Can Atay / Can Uçar (Bayraktar/Tezcan)</td></tr><tr><td>Rıza Kocaoğlu</td><td>Temmuz Kocaoğlu</td></tr><tr><td><span>Kıvanç Tatlıtuğ</span></td><td>Sekiz Karaeski</td></tr><tr><td><span>Berrak Tüzünataç</span></td><td>Bade Uysal</td></tr><tr><td><span class=\"new\">Nurhan Özenen</span></td><td>Selma Hünel</td></tr><tr><td><span class=\"new\">Levent Can</span></td><td>Kaya</td></tr><tr><td>Bengü Benian</td><td>Nükhet Özbağ</td></tr></tbody></table><br/><h3>Awards</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Category</th><th>Winner</th><th>Award</th></tr><tr><td>2010</td><td style=\"width:250px; text-align:center;\">Best Turkish Series</td><td style=\"width:200px; text-align:center;\"><i>Ezel</i></td><td style=\"width:200px; text-align:center;\">Golden Butterfly Awards</td></tr><tr><td>2010</td><td style=\"width:250px; text-align:center;\">Best Actor</td><td style=\"width:200px; text-align:center;\"><span>Kenan İmirzalıoğlu</span></td><td style=\"width:200px; text-align:center;\">Golden Butterfly Awards</td></tr><tr><td>2010</td><td style=\"width:250px; text-align:center;\">Best Series of the Year</td><td style=\"width:200px; text-align:center;\"><i>Ezel</i></td><td style=\"width:200px; text-align:center;\"><span>Galatasaray University</span></td></tr><tr><td>2010</td><td style=\"width:250px; text-align:center;\">Best Actor</td><td style=\"width:200px; text-align:center;\">Kenan İmirzalıoğlu</td><td style=\"width:200px; text-align:center;\"><span>Galatasaray University</span></td></tr><tr><td>2010</td><td style=\"width:250px; text-align:center;\">Best Series of the Year</td><td style=\"text-align:center;\" rowspan=\"7\"><i>Ezel</i></td><td style=\"width:200px; text-align:center;\"><span>Bahçeşehir University</span></td></tr><tr><td>2010</td><td style=\"width:250px; text-align:center;\">Best Series of the Year</td><td style=\"width:200px; text-align:center;\"><span>Yıldız Technical University</span></td></tr><tr><td>2010</td><td style=\"width:250px; text-align:center;\">Best Series of the Year</td><td style=\"width:200px; text-align:center;\"><span>Istanbul Technical University</span></td></tr><tr><td>2010</td><td style=\"width:250px; text-align:center;\">Best Series of the Year</td><td style=\"width:200px; text-align:center;\">Kabataşlılar Association</td></tr><tr><td>2010</td><td style=\"width:250px; text-align:center;\">Best Series of the Year</td><td style=\"width:200px; text-align:center;\">Burç Special College</td></tr><tr><td>2010</td><td style=\"width:250px; text-align:center;\">Best Scripted Format</td><td style=\"width:200px; text-align:center;\">C21/FRAPA Format Awards</td></tr><tr><td>2012</td><td style=\"width:250px; text-align:center;\">Best Drama Special Prize</td><td style=\"width:200px; text-align:center;\"><span>Seoul International Drama Awards</span></td></tr></tbody></table><p></p><br/><h3>Ezel in other languages</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>needs expansion</b> with: an organized table of content, accompanied with some available citations. You can help by <span class=\"external text\">adding to it</span>.  <span class=\"date-container\"><i>(<span class=\"date\">June 2017</span>)</i></span></div></td></tr></tbody></table><p>Ezel was translated multiple times and broadcast in foreign channels, most notably to :</p><ul><li>Albania on RTV Klan in 2011</li><li>Argentina on Telefe from 11 May 2015</li><li>Azerbaijan on ARB from 20 September 2020</li><li>Bangladesh on Deepto TV from 13 November 2018</li><li>Bosnia and Herzegovina on BHRT in 2011</li><li>Brazil on Rede Bandeirantes in 2016</li><li>Bulgaria on Nova TV in 2012</li><li>Chile on Chilean TV channel Mega in 2014</li><li>Colombia on Caracol Televisión in 2015</li><li>Croatia on RTL Televizija in 2011, 2012</li><li>Czech Republic on Prima Love in 2011</li><li>Greece on ANT1 TV in 2011</li><li>Hungary on RTL Klub in 2011</li><li>Iran on Gem TV in 2010 and Gem Classic in 2011</li><li>Iraq on Kurdsat in 2016 and 2017</li><li>Israel on Viva Plus</li><li>Kazakhstan on Habar in 2011</li><li>Kosovo on RTV21 in 2013</li><li>Lithuania on LNK in 2013–2014</li><li>Morocco on 2M</li><li>North Macedonia on Sitel TV in 2011</li><li>Pakistan on Geo Kahani in 2013</li><li>Peru on Latina in 2015</li><li>Romania on Kanal D Romania in 2010–2011</li><li>Saudi Arabia on MBC4 in 2012</li><li>Serbia on Prva from 18 June 2012 to 14 October 2012</li><li>Slovakia on TV Doma from 10 April 2012 to 3 December 2012</li><li>Spain on Nova (Spain TV channel) 2018</li><li>Sri Lanka on Swarnavahini as Wes in 2018, it is an adaptation of The Count of Monte Cristo and an influence of Ezel television series.</li><li>Tunisia on Nessma TV 2019</li><li>United Arab Emirates on Abu Dhabi Al Oula in 2010</li><li>United States on Netflix</li></ul><p>The movie has been sold to over 100 countries.</p><br/><h3>Spin-offs</h3><p>Armenia's leading TV channel, Shant TV, purchased the script rights to the show and produced its own TV series featuring local actors and actresses who resemble their Turkish peers. The Armenian producers hid the fact that the show was originally a Turkish production, fearing protests from the Armenian audience.</p><p>The series was also adapted by Romanian TV channel Pro TV under the title Vlad.</p><br/>"
  },
  "errorMessage": ""
}