{
  "imDbId": "tt2560140",
  "title": "Attack on Titan",
  "fullTitle": "Attack on Titan (TV Series 2013–2023)",
  "type": "TVSeries",
  "year": "2013",
  "items": [
    {
      "username": "IPyaarCinema",
      "userUrl": "https://www.imdb.com/user/ur69153149",
      "reviewLink": "https://www.imdb.com/review/rw6025774",
      "warningSpoilers": false,
      "date": "25 August 2020",
      "rate": "10",
      "helpful": "503 out of 571 found this helpful.",
      "title": "Greatest Anime",
      "content": "Review By Kamal KStory 10/10It continunes few days after where we left off last season and it focuses more on political drama and dilemmas inside the walls. This season gets straight to the point and introduces new villain named Kenny that turns out to be somehow related to Levi. There are many parties trying to get Eren and Historia. For what reason? It is yet to be reveald. Mystery we all feel in love with is still there and there are even more questions, but don't let that distract you from the fact that this season ,even tho is only few episodes in, already has some major reveals in it. Pacing is amazing and i wasn't bored for a moment while watching. Things are only getting more interesting when Erwin reveals how he's planning to ovethrow the governmant without using the force. This season has a very refreshing and different plot compared to previous ones as we can see from the lack of titans and focuse on the issues inside the walls rather than beyond. However it's still as, if not more interesting than before. There is world buidling,mystery,back stabbing and some major questions answered which there is hopfully more to come.Animation 10/10As we can see characters in this season look a little bit different or older which some might not like but i do personally. It's a fresh change. They look closer to their manga designes. Some might notice that they removed those thick black lines around characters faces which made AOT art stand out even more. Don't get me wrong, it still does but that was something that was missing which kept me from giving it 10/10. Animation is brilliant for this season (it's Attack on Titan after all :D) and like every season it only got better. . Perfect combination between 3D background and 2D animation along with masterfull camera movement made this scene look like a movie. There is even one frame where levi is facing the wall and you can see his reflection in the window. Just goes to show how much detail and time was put in to this scene. After i done some research i found out that it took the animator of this scene 1 whole month to complete it. Just that one scene alone. All props to Arifumi Imai. Great job. Hopfully it keeps this quality because this season is said to be 24 episodes long.Sound 10/10I mean, is there anything to say? AoT is notorious for it's amazing OST and sound quality. Voice actors are great as always and the sound that stand out to me the most was the sound of falling shell from kenny on the roof in ep.1. It was just so satisfying :D. And again mad props to Hiroyuki Sawano (the composer) for the epic and emotional music.Characters 10/10What i like about AoT characters is the fact that they interact so naturally and nothing from their conversation seems forced which is immediately showcased in the very first scene in ep. 1. That cabin scene where jean and eren argue,sasha tries to steal bread, mikasa still does work even tho she's injured and armin cares for her deeply. And of course Levi the clean freak comes in at the end :p They are such fun and lively characters. This season already had some major development for our cast. We got to see Erwin's and Hisotira's backstories which also delved deeper in their characters motives. Both backstories were heartbreaking and made me care a lot more for them. Hisotira is slowly taking of her \"Christa Lenz\" facade (is that how you say it? lol) and Erwin is proving again and again why everyone loves him and would follow him to death. His childhood story is very similar to how our society and governmant wokrs today which is very scary. And we all need to remember that isayama is criticizing this type of government and society with these topics. Instead of just walking of Erwin comes back to Dimo Rivees's wife and comforts her saying he'll avange him. Erwin is charismatic,great leader, intellignet and someone that you just want to follow. Since the young age he was corious and as he call himself a \"gambler\". He is someone that would give everything for the humanity. Or is he? I think there is a lot more to his character. Hange got some development too. Eren is maturing and seems a lot more chill this season but unfortunately he is kiddnaped again :( Poor guy he just can't catch a break. In ep.1 he helps historia to overcome here pain and shows again just how honest he is by telling her \"I like you more this way, just a stupidly normal honest girl\". Also hugeee development for armin. To think that he would be capable of killing a human.. this will deffinitely have a huge impact on his character in the future. The way he selfreflects and his philosohpical speach about morals is great, it really makes you think. He kinda has a point too. He shows one more time how mentally strong he is even tho he lacks physicial strength. This time is just on another level. Now lets talk about our new villain. KENYYYYYYYYYYY. I love this guy lol. The way he roasts and insults levi and the cowboy vibe he gives. I love it. He immediately showcases that he is not a joke by blowing nifa's head off just like that. He also seems very mysterious. The way he treats levi is almost as if he looks down upon him. Speaking of Levi here is what i think: That chase scene where he's running away from kenny is not just a great action sequence it also represents Levi running from his past. Kenny=His past. Running from kenny or his past. This arc is also big development and challange for him now that he has to act as a leader/commander because erwin is absent or busy. There was also some smaller developments for connie (motivating himself to take on the beast titan),jean (struggling to remain human which almost costs him life, also selfreflecting), sanes (showing how he didn't want to do the things that he has done and over the time he just got used to it, also he was kinda easy to symphatise with too and his devotion to king is may be morally wrong but aslo admirable, the way he feels destroyed after finding out that he was actually the one that betrayed the king is also worth mentioning), flegel (stepping up becoming a boss saying how he'll protect the people of his city), zachary (showcasing that he cares more about himself rather than humanity and how he always hated the governmant because they looked up on everyone).Enjoyment 10/10I never enjoyed AoT more. It's great.This season has perfect balance between story telling, character development and action.Overall 10/10"
    },
    {
      "username": "aboalhyjaa",
      "userUrl": "https://www.imdb.com/user/ur69239269",
      "reviewLink": "https://www.imdb.com/review/rw8003745",
      "warningSpoilers": false,
      "date": "25 March 2022",
      "rate": "10",
      "helpful": "242 out of 274 found this helpful.",
      "title": "1 episode left..",
      "content": "Ive been watching this show since 2016, and I wanted to write a review for it but I couldn't because with every new episode i have a mixed feelings and i can't determine where am i from this show. But now, with only 1 episode left, i can finally write whats in my heart.In AOT, you dont have to support the \"good\" against the \"evil\", because simply there's no such thing in this world. Usually, an any work whether if its a movie, tv show or an anime, there's sides and you as a viewer have the choice to support whatever you like good or bad. Most people choose the good side, some choose the bad one. This type of work represents almost 75% of all the works out there. So some of us have adjusted to the idea of good and bad sides.The other 25% are shows, movies and animes like AOT, they are psychologically complexed with a lot of twists and most importantly no good or bad sides. These kind of animes describes the world and our reality in such a scary truthful way, it mixes your emotions and feelings and you dont know what to think, makes you consider a thousand time before calling a character good or bad, this is AOT.After completing most of the show i can say, that AOT reached a high level of realism. That you dont have to determine in which side are you.One advice for anyone who hasn't saw AOT or is still in the beginning, dont take sides, just enjoy the anime because I believe its the best anime in the world."
    },
    {
      "username": "WarFirel",
      "userUrl": "https://www.imdb.com/user/ur67695279",
      "reviewLink": "https://www.imdb.com/review/rw4402488",
      "warningSpoilers": false,
      "date": "17 October 2018",
      "rate": "10",
      "helpful": "668 out of 765 found this helpful.",
      "title": "Next 12 episodes of season 3 will be AMAZING",
      "content": "The best part of the series is coming in april 2019, all of the entire show is not compare to what is coming now, nobody is ready for that."
    },
    {
      "username": "umlaziking",
      "userUrl": "https://www.imdb.com/user/ur110613987",
      "reviewLink": "https://www.imdb.com/review/rw5804113",
      "warningSpoilers": false,
      "date": "6 June 2020",
      "rate": "10",
      "helpful": "322 out of 376 found this helpful.",
      "title": "My god",
      "content": "This series is really ahead of its time, its brilliant and its definitely the best tv show ive ever watched in my life. The fact that it has an imdb of 8.8 is a disgrace, it deserves way better than that especially after the glorious season 3 part 2. This anime is way better than rick and morty, way better than even game of thrones, but the ppl in charge of imdb give it a way lower ratings than those two?......balls. This anime deserves a lot more respect."
    },
    {
      "username": "BadgerStorm4345",
      "userUrl": "https://www.imdb.com/user/ur113370202",
      "reviewLink": "https://www.imdb.com/review/rw5830941",
      "warningSpoilers": false,
      "date": "17 June 2020",
      "rate": "10",
      "helpful": "196 out of 226 found this helpful.",
      "title": "The Greatest Animanga of all Time",
      "content": "Attack on Titan is king at world building and story. With ultra realistic consequences missing from a lot of animation, Attack on Titan stands out as it has an incredibly dark world with actually stakes. The aspects of horror and adrenaline when there's an action scene is stellar. The characters, action and music could carry episodes but don't have to because the show is already that good. Characters have depth and feel like real people, they die constantly and never feel 100% safe. The action is some of the best action in any show. Mystery aspects make even moments that could come off as bland feel so much more impactful. This is perhaps one of the best stories ever written. The Music makes this epic world feel vast and important, while also sounding phenomenal. Attack on Titan is a masterpiece of our generation and my favorite TV Show of all time."
    },
    {
      "username": "WarFirel",
      "userUrl": "https://www.imdb.com/user/ur67695279",
      "reviewLink": "https://www.imdb.com/review/rw5381310",
      "warningSpoilers": false,
      "date": "4 January 2020",
      "rate": "10",
      "helpful": "463 out of 529 found this helpful.",
      "title": "Season 4, what can we expect?",
      "content": "A lot of people have this question, can season 4 beat season 3 part 2? And the answer is yes! Isn't full of action, is like a combination of all the seasons, great plot, the best charachter development in all the serie, great action, and a lot of plot twist. October 2020, please I need you right now!"
    },
    {
      "username": "dee.reid",
      "userUrl": "https://www.imdb.com/user/ur0892646",
      "reviewLink": "https://www.imdb.com/review/rw3077833",
      "warningSpoilers": true,
      "date": "30 August 2014",
      "rate": "10",
      "helpful": "266 out of 312 found this helpful.",
      "title": "Titanic \"Attack on Titan\"",
      "content": "It's true - every great thing I've ever heard about the Japanese Anime' series \"Attack on Titan\" is true. A friend of mine recommended this series to me a while back, and I finally just got around to watching the first half of the first season on DVD. I can only hope it gets better from here.In the year 845 in the distant future (?), mankind is at war with the Titans, massive humanoid creatures of unknown origin, are of varying size and strength, and who appear to possess very little in the way of intelligence - yet share a ravenous appetite for human flesh. The remnants of human civilization have barricaded themselves behind massive walled cities as their only form of defense against the Titans, who attack at random and seemingly without any thought or purpose.At the beginning of the series, over a hundred years have passed without a major attack from the Titans. But that relative peace is shattered when one day a massive new breed of Titan called a \"Colossal\" smashes through the walls of the southern city of Shinganshina. In Shinganshina, we're introduced to three childhood friends - Eren Jaeger, his adoptive sister Mikasa Ackermann, and their mutual friend Armin Arlert. During the attack, Eren witnesses his mother being devoured by one of the creatures.Two years later (and in using an important plot point bearing similarity to Robert A. Heinlein's \"Starship Troopers\"), the three then enlist in the military to help fight in the war against the Titans. By the time they graduate from the military academy in the year 850 and have joined the fight to save humanity, Mikasa proves to be the most physically skilled at killing Titans (who despite their apparent resistance to physical injury and tend to regenerate quickly from whatever wounds they do sustain in battle, do have one weak spot on the back of their neck). Armin is the weakest of the three, yet is later revealed to be an expert battlefield strategist and tactician. And lastly, there's the wild-card of Eren Jaeger, who is soon revealed to have a unique ability that may just help turn the tide of the war against the Titans in favor of humanity.\"Attack on Titan\" is adapted from the best-selling, critically acclaimed Japanese Manga series of the same name created by Hajime Isayama and published by Kodansha in Japan. This is one of the most gripping, thrilling, and harrowing Anime' series I've seen in a long while. Perhaps the most credit belongs to series director Tetsuro Araki, who was also behind the superior \"Death Note\" and \"Highschool of the Dead\" (the latter of which I never saw, but have already read the original Manga).\"Attack on Titan\" places many different elements into the mix, from horror, to dark fantasy, to the post-apocalyptic thriller, to the futuristic war film. \"Attack on Titan\" is also not an Anime' series for young children. The series is quite gruesome in its depiction of violence - against humans and Titans alike - and there's lots of blood. Yet in spite of what I just wrote, the series is admirably restrained in its depiction of the most graphic carnage - preferring to leave such things to the imagination of the viewer.Some have compared \"Attack on Titan\" as being Japan's equivalent to the American TV horror series \"The Walking Dead\" (which I also adore). I can honestly see some of the comparisons, since both \"Attack on Titan\" and \"The Walking Dead\" possess gripping characters and story-lines. Despite the vastly different subject matter, both series do ultimately depict a bleak future for humanity in the face of certain apocalyptic doom. Yet in spite of it all, in both series there is a faint glimmer of hope, and a case is made for humanity's continued survival (if not to continue to remain the dominant species left on Earth).I can say that \"Attack on Titan\" does have a new fan in this thoroughly impressed viewer. I can't wait to see the second half of season one.10/10P.S.: The opening theme song - \"Guren no Yumiya\" (literally translated from Japanese as \"Crimson Bow And Arrow\")/\"Feuerroter Pfeil Und Bogen\" (German spelling) - by Linked Horizon is one of the most thrilling opening songs I've ever heard in a Japanese Anime' series. Too bad it's not used throughout the whole series (my only serious gripe so far)..."
    },
    {
      "username": "talaveraf",
      "userUrl": "https://www.imdb.com/user/ur8037801",
      "reviewLink": "https://www.imdb.com/review/rw7297851",
      "warningSpoilers": false,
      "date": "2 September 2021",
      "rate": "10",
      "helpful": "199 out of 219 found this helpful.",
      "title": "My experience as a 42yrs. Old....",
      "content": "Growing up in the 80's 90's during the time of top anime stories and always getting into arguments with my friends and my son that those were the golden anime era and now I have to admit. This is if not the best story telling I witness in all my years. This show raise the bars with each episode, with unpredictable twist and turns you won't see coming. After completing season 4 mid season finally I must say I'm happy to be alive witnessing a master peace in the making. Can't wait for the finally!"
    },
    {
      "username": "thePopcornExplorer",
      "userUrl": "https://www.imdb.com/user/ur36922988",
      "reviewLink": "https://www.imdb.com/review/rw8033615",
      "warningSpoilers": false,
      "date": "4 April 2022",
      "rate": "10",
      "helpful": "145 out of 167 found this helpful.",
      "title": "Master of Storytelling",
      "content": "I am not the regular anime fan, I've seen some really good ones but Attack on Titan sits on a whole other level of amazing writing.The way the story unfolds is so well written and engaging, that I was hooked since the first season where the plot seemed to be a very basic revenge story between humans stuck living inside mysterious walls and their nemesis, humanoid titans which seems to exist with the sole purpose of eating humans alive.It's hard to make a detailed review without giving up on spoilers, I've shared the premises, but Attack on Titan is so much more than that... From the parallelisms with the real world depicting themes like war, greed, complacency, the inherit curiosity for exploration all the way to the grey characters and their respective development, I can only say good things about this anime.Ambiguity is an ever present concept in our lives, and this show depicts it like very few do, this associated with how brilliant the characters evolve throughout all 4 seasons its remarkable, you can empathize with someone that made the most awful things and that shows how brilliant the creator is.Adding to all the above, you will be facing many mind blowing twists and unexpected dark turns on the story, with one of the best animation work I've ever seen on screen, specially the most recent episodes - considering this started almost 10 years ago!Outstanding soundtrack, I get the chills on many of the fight scenes and of course it goes without saying that the fights themselves are brilliant, nerve wracking and make you so hyped with all of the elements of the action combined, really a one of a kind TV show.I am eagerly waiting for the final part next year I don-t know if it wrap up badly but up until this point it's a flawless masterpiece and I don't say that lightly."
    },
    {
      "username": "Mappers-Buckles",
      "userUrl": "https://www.imdb.com/user/ur125669761",
      "reviewLink": "https://www.imdb.com/review/rw7313120",
      "warningSpoilers": false,
      "date": "6 September 2021",
      "rate": "10",
      "helpful": "235 out of 259 found this helpful.",
      "title": "A historic anime",
      "content": "Incredible, I honestly have to say that this could be the best anime ever due to its development and plot. Shingeki No Kyojin has one of the best character developments and plot in history (note that this series does not have fill), he even the secondary and third characters have a great importance in the story, but also has that sense of terror, action and drama that by the way is incredibly well done, makes you live the situation that the characters go through and transmit their emotions to you in a very human way. It has an excellent background story that is simply memorable.Every decision they make is of minor importance to the series and should not be missed, their deaths and the surprise of knowing who are the real antagonists add a magical touchThe first season has a slight start, it ends up being a spectacular season, it is not the best but it is an amazing season with an incredible animation and plot, here you will be introduced to the first antagonist of the series. 9.4/10The second season I think was epic, this is when you start to see the faces of the real villains (get ready for Senshi Tmp 2 Ep 6 which according to me is the best of the second season, an overwhelming chapter) Shingeki no Kyojin explains it to you perfectly without leaving gaps in the plot, an incredible season. 9.6/10The third season is truly phenomenal, has a good start and lets you know the problems you will have in a society by not agreeing with something or the difficult decisions you must make to ensure your survival. After this, too many things are clarified without detours, the chapters that stood out most were Perfect Game (Tmp 3, Ep 16), Hero (Tmp 3, Ep 17), Midnight Sun (Tmp 3, Ep 18) and That Day (Tmp 3, Ep 20) (That day has no action or features our main characters, but this chapter amazes me, its development is spectacular and the way they explain everything is overwhelming, honestly, the best development chapter in the history of anime). 9.8/10Season four is the start of the finale. A season practically perfect, in this season everything comes to light answering every question of the viewer, leaves no gaps in the plot and has a beautiful animation, besides that is incredibly shocking and demonstrates the incredible development in our protagonists, Eren has the best character development I think. For me the best chapters were in my opinion Declaration of War (Tmp 4, Ep 5) (Declaration of War is one of the most impactful chapters of development), The War Hammer Titan (Tmp 4, Ep 6), Assault (Tmp 4, Ep 7), Assassin's Bullet (Tmp 4, Ep 7) (Assassin's Bullet left me speechless...) and Above and Below (Tmp 4, Ep 16), has not yet finished this season, but still for me it is spectacular. 9.9/ 10 This season is the best.In my opinion your average would be 9.3/10. Sincerely from my point of view, the best anime ever, a work of art from post-apocalyptic fiction."
    },
    {
      "username": "ThePleb",
      "userUrl": "https://www.imdb.com/user/ur131144355",
      "reviewLink": "https://www.imdb.com/review/rw6792070",
      "warningSpoilers": true,
      "date": "8 April 2021",
      "rate": "10",
      "helpful": "243 out of 269 found this helpful.",
      "title": "Legendary show.",
      "content": "Isayama knows how to write a story.Attack on Titan is by far the most well-written, well thought out shows of the modern era.Following the story of Eren Yeager, we watch as he slowly descends farther down this rabbit hole until he hits his breaking point.Starting from season 1, I thought I could predict the outcome of this story. One tone story. Obvious character plots. Wrong. Wrong. Wrong!As a viewer, you are forced to watch 90% of your established characters vanish, vicious plot loops that blow your mind, and emotional scenes that guaranteed will make your heart stop.Seasons 1-3 feel like a complete story. Isayama tells a beautiful story of sacrifice to save the island of Paradis from titans.Season 4 feels like a sequel that wasn't needed but deserved to be made. Season 4 introduces the idea of how traumatized our main character has actually become. Watching him descend to insanity is painful but understandable. At the end you are torn between supporting and disliking Eren. It's written to make you feel as if you are no longer watching Attack on Titan.Overall, this heart wrenching story is unbeatable when it comes to plot. Attack on Titan might be the best masterpiece of this era. If you haven't watched it, what's wrong with you? If you have and disliked it from episodes 1-8, keep watching. It is well worth the pain."
    },
    {
      "username": "marveller-66",
      "userUrl": "https://www.imdb.com/user/ur124499942",
      "reviewLink": "https://www.imdb.com/review/rw6683268",
      "warningSpoilers": false,
      "date": "11 March 2021",
      "rate": "10",
      "helpful": "99 out of 115 found this helpful.",
      "title": "The most INCREDIBLE show i have ever watched.",
      "content": "Now that it's nearing it's part 1 ending, i'm so not okay. Binge-watched the whole show in a week or two and it's absolutely phenomenal. To be honest, i haven't even read a single chapter of AOT (Manga). And yet i've become a huge fan of this show. I'm waiting for part 1 to end (although i never wish it to end), so that i can read it completely all 33 Volumes. I could've read it before watching the anime but i hesitated. Because i wanted to know what it'd be like to watch this without reading the Manga.It's incredible how they managed to make it so special. This show is one of the greatest i have seen. I have watched almost 30 tv shows including Breaking Bad and Game of Thrones in the last couple of years. They were both an amazing show, had huge impact on viewers and general audiences. At the time, for me, GOT was the best of the best. But when i watched this, i'm kinda gradually giving it to AOT. Because it's perfect, every season and almost every episodes.Although i got a glimpse of what is to come in the next episode. But i didn't read it completely. Still waiting to read. Anyway, i can't wait for the next one, \"Savagery\" to come out. It's going to be beyond epic. I'm quite sure. I'd have rather rated this more than 10 if it was possible.(Season I : 9.3) (Season II : 9.7)(Season III : 9.8) (Season IV : 9.8)Musical Score : 100/100Characters : 105/100Animation : 99/100Story : 110/100."
    },
    {
      "username": "navodwijerulz",
      "userUrl": "https://www.imdb.com/user/ur123599138",
      "reviewLink": "https://www.imdb.com/review/rw6029315",
      "warningSpoilers": false,
      "date": "26 August 2020",
      "rate": "10",
      "helpful": "389 out of 452 found this helpful.",
      "title": "I wish there was a reply button for some of the reviews here! Anything less than a 9 out of 10 for this masterpiece is stupid",
      "content": "Some of the people have rated this show a 1 out of 10. And I understand why. The Plot is so well written, you won't even know the real storyline until season 3 or whatever. On the outside it seems a pretty simple story. Demons vs humans. Who will win? That is hardly the story at all... and even thinking that, I watched through the first 2 seasons. And even then I was hooked because of great story building and great great climaxes and actions and all. I thought season 1 ending was insane. Then season 2 came. I thought It was even crazier. Then season 3! A literal masterpiece... specially the second arc. and the 4th season is expected to be God Level. And I expect nothing less from the greatest anime of all time. That's how good the story is! It's complex yes. Greatest Plot I have ever seen on a show. I love breaking bad, I love Avatar the last air-bender, I love Game of thrones. But The story line, music, and the voice acting are all 10/10 easily. Do yourself a favor, don't judge it by it's cover, get through some quality anime till you reach God level story telling. You will thank me when you reach the season 3 finale, GUARANTEED!"
    },
    {
      "username": "imdb-58910",
      "userUrl": "https://www.imdb.com/user/ur98099654",
      "reviewLink": "https://www.imdb.com/review/rw4606187",
      "warningSpoilers": false,
      "date": "25 January 2019",
      "rate": "10",
      "helpful": "239 out of 288 found this helpful.",
      "title": "The most amazing anime I´ve ever seen!",
      "content": "This anime grabbed me in the first episode and it didn´t release me to the end. I´ve seen all the episodes several times but it still can make me feel like for the first time. It has gripping story, fantastic music and really good animation. Someone can tell that animated serials are for children so if you have one of these people in your friendlist, tell them about this anime. It´s full of blood, gore, cutted extremities and death so they will probably change their mind. The serial stars Yûki Kaji (Eren Yeager), Marina Inoue (Armin Arlert), Yui Ishikawa (Mikasa Ackermann) and many other good voice actors and actress. In the story main characters and other people live in the town surrounded by tall walls. The walls protect people from some kind of creepy humanoid monsters called titan. And those titans really like to kill and eat humans so there are much violent too. But you can´t look at this anime only in bad way. It´s also about friendship, loyalty and many strong feeling made between people in hard situations. It´s about the will of life, political intrigues, freedom and amazing fights against human eating creatures. This anime is great work and nobody can change MY mind."
    },
    {
      "username": "ahmxii",
      "userUrl": "https://www.imdb.com/user/ur97095758",
      "reviewLink": "https://www.imdb.com/review/rw7662493",
      "warningSpoilers": false,
      "date": "19 December 2021",
      "rate": "10",
      "helpful": "90 out of 107 found this helpful.",
      "title": "Mind Blowing!!",
      "content": "The show conveys every emotion well, making it easy for fans to get attached to the characters. With death around every corner, you can hear the fear and sadness the characters feel.Even awkward situations - like the embarrassment of telling your crush how you feel - are well captured in the show. You can't help but sympathize with the characters because they seem so human. Paired with the high level of character development, you truly build a strong bond with your favorite characters.Overall, there is very little to complain about the show other than the fact it is ending. It is worth all the sleepless nights and elevated stress levels incurred with every episode. Even if you are not a fan of action-packed shows, you will still appreciate the drama and suspense built into every episode. The only people I would not recommend it to are squeamish people or anyone that has a big test they need to study for."
    },
    {
      "username": "snkkylo",
      "userUrl": "https://www.imdb.com/user/ur93962916",
      "reviewLink": "https://www.imdb.com/review/rw5013474",
      "warningSpoilers": false,
      "date": "23 July 2019",
      "rate": "10",
      "helpful": "195 out of 235 found this helpful.",
      "title": "8.8? Joking right?",
      "content": "This is the first Show that has 9+ ratings on almost every episodes! But overall rating is 8.8? It doesn't make sense, obviously 1 🌟 are from haters who has never watched a single episode of this Greatest Show ever, they think that Rating this Show 1 🌟 would make them cool. LOL"
    },
    {
      "username": "Kuldeep_Tiwari",
      "userUrl": "https://www.imdb.com/user/ur102912350",
      "reviewLink": "https://www.imdb.com/review/rw5223334",
      "warningSpoilers": false,
      "date": "30 October 2019",
      "rate": "10",
      "helpful": "158 out of 187 found this helpful.",
      "title": "*on the TOP+",
      "content": "I am writing this review after watching more than 70+ anime series containig food wars, bleech, Fullmetal alchemist +brotherhood, code geass, dath note,Dragon ball Z ⚽ , MHA, parasyte maxim, 0ne punch man 👊, hunter x hunter, etc, etceven i can say it is the BEST anime i ever seen *top notch animation *best action scenes ever in anime *Top class music (especially back opera) *amazing characters (levi, hanzi zoe, erwin Smith,etc leavin top 3 main characters*) *most importantly story is unique, captative, full of thrillers and even mercilessin end i can only say its a masterpiece. if you haven't seen it you must give it a shot."
    },
    {
      "username": "BoydudeReviews",
      "userUrl": "https://www.imdb.com/user/ur55532299",
      "reviewLink": "https://www.imdb.com/review/rw4243583",
      "warningSpoilers": false,
      "date": "18 July 2018",
      "rate": "10",
      "helpful": "99 out of 120 found this helpful.",
      "title": "A thrilling, action-paced anime, with alot of heart.",
      "content": "Backstory Review: This show is fantastic, but let me give you a little backstory on my opinian with anime.. Sonic X was the first anime I ever watched. I was 7 years old and loved it, but it didn't really get me into anime. I then started watching the Beyblade Metal Saga and liked it, but again, that didn't get me into anime. After seeing alot of youtube videos and hearing people go on and on about this show, I decided to give it a shot. It was the teens react video that got me to watch this show. And right from the opening scene, I knew deep down that this show was going to be amazing and I was right. After watching the first season back in 2014, I decided to check other animes out and give them a watch. These were Naruto, Death Note, Fullmetal Alchimist Brotherhood, Hunter X Hunter, Bleach,, Erased, Cowboy Bebop, Sword Art Online, Durama, Gunslinger Girl, Black Lagoon, My Hero Academia and now just recently, Black Clover. Some of these shows were actually really good. I really liked Erased, Death Note, Full Metal BrotherHood, and Naruto, minus the filler. But after rewatching the Attack on Titan anime in subbed, I was truly shocked to find out that despite all the animes I have seen, Attack on Titan is still the best.Anime Review: Attack on Titan is about humanity being surrounded by large stone walls that keep out titans. However, the largest titan humanity has ever seen has destroyed the walls and all hell breaks lose. The lead character, Eren Jeager vows to kill all the titans after they destroyed his hometown and together with his childhood freinds Armin Arlet and Mikasa Ackerman, join tthe 104th Scouts and eventually the survey corps. WHat this shows does is that it starts off peacefull and normal, having the same tropps from regualr anime and flips it on it's head. The true horror and brutallity these titans cause will give you nightmares. The plot maybe simple, but it is exucuted in a manor that is unthinkabale, in a brilliant way. The shows is possibly the only show I have seen in anime were the supporting cast are just as interesting and likable than the main. All with their own story to tell. The animation and visuals are the best I have seen in anime tv seires. The soundtrack is amazing ans well as the voice acting. I will admit that I did start off this show watching it in english dub, as that was how I always watched anime. But 4 years later, I decided to rewatch the whole show in japanese in time for season 3 and I must say that the original japanese voice acting enhances the Attack on Titan experiance. The english dubbing isn't half bad. I felt like, at first that the english voice worked bette ron the characters than the japoanese voice, particuallty Eran, Armin and Mikasa. But watching it in japanese, throughout, I can saftely say and recommned you watch this show in Japanese with english subtitles. I found out that some lines and dialogue can come accros 'cringy' and 'screechy' in english but it doesn't feel that way in japanese. It feels very natural. But you can decide which is better. Conclusion: I know that this is a very long review, but II could have talked for hours on why you need to watch this show, but I don't want to spoil so much. All I can say without spoiling the show is that \" not all is what it seems to be\". The shows goes in completely different directions that I orignannly thogut that I thought I was going mad. The plot thickens as you get deeper and deeper. After You watch season 1, 2 and the new season 3, read the manga becuase the plot thikens even more and you don't want to be spoiled. Overall, a brutally beautiful anime, with stunning visuals, a stella cast, both japanese and english and has posibly the best soundtrack in an anime, with wondeful editing. I thank the autor and writer of Attack on Titan, Hajime Isayama for writhgn this brutally beautiful series and the director of the anime, Tetsuro Araki for directing this and the onscreen writer, Yasuko Kobayashi for adapting the manga for the small screen and composer, Hiroyuki Sawano for the wondeful soundtrack. Also, thanks to the cast and crew and especially the Wit Studio and Production I.G for animation this wondeful anime. I 100% strongly agree you watch this show. :)"
    },
    {
      "username": "Morejambo54",
      "userUrl": "https://www.imdb.com/user/ur112234773",
      "reviewLink": "https://www.imdb.com/review/rw6385028",
      "warningSpoilers": true,
      "date": "21 December 2020",
      "rate": "10",
      "helpful": "71 out of 85 found this helpful.",
      "title": "OMFG",
      "content": "This was the second anime I'd watched, after one punch man, and this is what truly got me hooked. It incredible! The action, the characters...everything. None of the seasons disappointed me and after every episode I wanted to watch the next. One of the seasons did end quite unexpectedly which was a bit disappointing but everything turned out well. Captain Levi is the single greatest character without even saying anything, just look at him...he's awesome! Eren was a bit annoying to start as he does just shout the whole time but you get used to it. Armin also annoyed at the start, he was just a bit weak and blah and Mikasa just kept following Eren. This doesn't matter in the end as the characters mature and face more difficult challenges. The most annoying, yet amazing writing, part was when Armin was injected with the fluid instead of Erwin. This was a great choice by the writers but not by the characters. Erwin was a natural leader that they all needed and sure Armin is smart but Erwin would be so cool as the colossal Titan! Best anime ever 10/10 watch it now if you haven't already!!!!"
    },
    {
      "username": "maddiebuggie",
      "userUrl": "https://www.imdb.com/user/ur117143265",
      "reviewLink": "https://www.imdb.com/review/rw5684068",
      "warningSpoilers": true,
      "date": "27 April 2020",
      "rate": "10",
      "helpful": "84 out of 102 found this helpful.",
      "title": "Attack on titans review",
      "content": "The animation is really good and well done. I haven't watched too much action anime yet but want to and this one was good. At first I thought it would be overrated and overhyped and people were saying it was good when it wasn't. But it turns out everyone was right this show was great. This anime is very emotional. So if you don't like crying then this might not be for you. There is a lot of action and drama that happens in this story. It went from zero to hundred in no time so they did a great job. The plot wasn't too fast but at the same time it wasn't too slow. So they got the pacing of the story just right. They did great character development for sure. The main girl character and Aaron had a great relationship and their chemistry. I was sad when I thought Aaron had died but it turned out he didn't die so I want happiness when he comes back. It wasn't a totally surprise when he came back he was the main character and as soon as he got eaten I had the thought that he might cut his way out. I mean the way he came back was a little different but he was still back. I wanted to watch each episode and see what was happening. I wanted to know the answer to my question that I had like where was Aaron father? Who was the second Titan human that was in the show? And so on. It is a great show to watch with family. If there would be one thing I would change I would make the theme music that plays at the beginning of the anime to difference but still strong and wartime and angry, sad and all of that. Basically I would change the song to fit the show more. There was a lot of people who tried to change the world and make a difference in there world in the show."
    },
    {
      "username": "anishkumarjnv",
      "userUrl": "https://www.imdb.com/user/ur129136116",
      "reviewLink": "https://www.imdb.com/review/rw6567043",
      "warningSpoilers": false,
      "date": "5 February 2021",
      "rate": "10",
      "helpful": "68 out of 80 found this helpful.",
      "title": "You are wasting your time to read review",
      "content": "Because this masterpiece can't describe in words......."
    },
    {
      "username": "EVON1TY",
      "userUrl": "https://www.imdb.com/user/ur47939660",
      "reviewLink": "https://www.imdb.com/review/rw8926139",
      "warningSpoilers": false,
      "date": "13 March 2023",
      "rate": "10",
      "helpful": "21 out of 23 found this helpful.",
      "title": "So detailed, complex and immersive character and world creation.",
      "content": "This anime has one of the most intense, detailed and unique characters. Normally the characters evolving, changing and that makes you love the characters that once you hate. Like Jaime Lannister, he's changing slowly and so good. You're loving him more every season. But in Attack on Titan, you are loving them because you're realizing they were right. They didn't change, only you realized what's going on. You were assuming some character was the great villain. But in this immersive anime, don't be sure that much. I know some characters are changing. Their motivations and purposes are changing, that could also make you feel like that but most of the times it isn't the characters, the world is changing. The anime gives the meaning to their purpose.There is so much characters with different motivations. Some of them even fights themselves but you nearly like them all. How can any story make you love the both sides?Attack on Titan has so special and unique world design. I don't know any similiar world design. From the first season to the end, you are just exploring another universe, And because of how well it's written, you're finding it stunning.These are why this anime is so special. Even an anime hater could like this easily.The drawings are got better in every season. In my opinion drawings was a bit weak in the first season. In the next seasons the drawings evolved to another level. Also Voice Acting Performances are quite amazing as you know. They have chosen really well."
    },
    {
      "username": "tinlittlenerd",
      "userUrl": "https://www.imdb.com/user/ur126024077",
      "reviewLink": "https://www.imdb.com/review/rw7702803",
      "warningSpoilers": false,
      "date": "30 December 2021",
      "rate": "10",
      "helpful": "43 out of 50 found this helpful.",
      "title": "Attack on GOAT",
      "content": "We're about a week away from S4 part 2 and I haven't stopped thinking about this show since I watched it a few months ago. It is truly one of the best the genre has to offer.The pacing is some of the best I've seen. There's no filler and you'll never have to go long without a new story beat to get the plot moving. Plot twists are frequent but not cheap. There's no a-ha moments at the end of an episode just to make you watch another 24 minutes of monologue. Twists are meaningful and well-developed. You'll appreciate the story even more a second time through when you recognize all the little hints that build up to those reveals.Admittedly, the story does take a while to pick up. Characters don't develop much depth in the first season and likewise the themes addressed early on are fairly elementary. AOT's idea of world-building in the first two seasons is to present a lot of questions and give very few answers. However, the pay-off when these questions are finally answered in seasons 3 and 4 can not be understated. Every single scene matters and anything that is mentioned is a plot point later on in the show, even if it takes a while to get there. The show is known for having some of, if not the best foreshadowing in the medium. You need to rewatch the show at least one other time to appreciate all the nuances in characters' body language or side comments in particular situations.The action/animation is a strong point throughout the entire series. Even still shots of the landscape are a joy to stop and look at. The motion animation for ODM gear scenes in seasons 1-3 are particularly captivating to me. Most well-animated fights in other anime are just a wide shot of the battle field with flashes of bright colors and cubes bursting out of the ground, but fights in AOT transition between so many different angles and shots that you can't miss a single frame of action. In seasons 3 and 4 the large scale battles are particularly interesting because of the amount of strategy involved. Both sides of the conflict have entirely unique advantages and disadvantages and it's wonderful to see how both sides play their cards during these drawn out fights.Once the show settles into its own it's impossible to put down. The fights are brilliant, the themes are incredibly nuanced, the characters are well developed, and the plot will always keep you on toes.For those who care, the show is great subbed or dubbed. I watched it my first time dubbed because I didn't like reading during fight scenes, but on my second go through I watched it subbed. Both are incredibly well done, don't both trying to debate which is better. Watch it however you prefer.No matter how you watch it, Attack on Titan is a show I can't recommend enough and I'm thrilled to be able to watch the final season as it comes out."
    },
    {
      "username": "Randell_2010-100-115448",
      "userUrl": "https://www.imdb.com/user/ur55068875",
      "reviewLink": "https://www.imdb.com/review/rw4268054",
      "warningSpoilers": false,
      "date": "4 August 2018",
      "rate": "10",
      "helpful": "125 out of 151 found this helpful.",
      "title": "Simply Badass",
      "content": "This show is almost absolute perfection. I was completely immersed into the show from episode one. In fact I stayed up for hours when I first started it and was not able to stop watching. On season three now and I can't wait to see where this show takes us."
    }
  ],
  "errorMessage": ""
}