{
  "imDbId": "tt0944947",
  "title": "Game of Thrones",
  "fullTitle": "Game of Thrones (TV Series 2011–2019)",
  "type": "TVSeries",
  "year": "2011",
  "items": [
    {
      "username": "dholliday-imdb",
      "userUrl": "https://www.imdb.com/user/ur59092557",
      "reviewLink": "https://www.imdb.com/review/rw4877695",
      "warningSpoilers": false,
      "date": "21 May 2019",
      "rate": "8",
      "helpful": "2,970 out of 3,307 found this helpful.",
      "title": "Seasons 1-6: outstanding. 7: daft but good. 8: disappointing",
      "content": "Let's say you're reading these reviews and haven't watched GoT yet, but now that it's finished are considering the marathon. What's the consensus? In this case, the consensus is accurate, and that is:Seasons 1-6: outstanding. Deep world-building, intelligent dialogue, epic set-pieces worthy of Hollywood, expert acting, detailed plotting, genuine surprises, great soundtrack used sparingly. GoT is worth watching for these seasons, definitely.Season 7: you suddenly notice the writing and plotting has taken a sharp dive downwards in quality. There are inexplicable ideas, inconsistent characterisation and soap-opera dramas. But at least the entertainment value is still very high, so it gets a pass.Season 8: this drop chasms down to depths you didn't think possible. The writing has got so amateurish that the still-fantastic production values are no longer enough to save it. If you ever enjoyed Lost but were amazed at how bad the final season was, you're in familiar territory here.The biggest problem with the final season was it took us out of the story and got us thinking about its many weaknesses. We lost our suspension of disbelief. Fatal for fiction. It also ruined the series-arcs to the point where a rewatch of the entire series is pointless.So can I recommend a GoT marathon for newcomers? Yes, the first 6 seasons are worth the disappointments later on. But best series of all time it is not. It could've been, but dropping the ball in the final stretch puts it behind the following superior series more worthy of your marathon:Battlestar Galactica (2003-2008)Twin Peaks (all 3 seasons, plus the movie)Breaking Bad"
    },
    {
      "username": "SaifOVGU",
      "userUrl": "https://www.imdb.com/user/ur60301707",
      "reviewLink": "https://www.imdb.com/review/rw5621450",
      "warningSpoilers": false,
      "date": "9 April 2020",
      "rate": "10",
      "helpful": "922 out of 1,050 found this helpful.",
      "title": "Can you just make the remake the season finale?",
      "content": "I'm feeling so heartbroken to see everyone criticising my favourite show of all time. And yes of course that's because of the bad making of the season finale, I can totally understand that. After all these years hardwork, creating and developing each and every character from bottom to top, memories, emotions throughout the process all went to vain for one bad making. It's so painful to accept it for the audience who invested lots of time watching the show from the starting and then finishing it like this! It's a long long journey. I don't even remember the day I started watching it and since then I waited the next year to come for the new season. I can't say anything more. Only one last request, could you please delete the whole season 8 and make a new version of it? Please?"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3853874",
      "warningSpoilers": false,
      "date": "9 November 2017",
      "rate": "10",
      "helpful": "308 out of 370 found this helpful.",
      "title": "This is a television show?",
      "content": "Was over-time on a gradual binge of watching 'Game of Thrones' from the first episode (gradual because of being so busy), having heard nothing but amazing things about it from friends, family and IMDb reviewers. Plus with such a great cast of talent and a brilliant book series, how could it possibly go wrong? The good news is that 'Game of Thrones' didn't go wrong. Quite the opposite. Not only is it a rare television show that does its original source material justice and treats it with respect but it is on its own merits one of the finest, most addictive and consistently compelling shows in recent years. A television show so brilliant that one has to actually check that it was made for television when everything is done to such a high level that it puts many films made today to shame. This is one of the strongest examples of an acclaimed show that deserves every ounce of the praise it's garnered.Visually, 'Game of Thrones' looks amazing. The scenery is throughout spectacular, the sets are hugely atmospheric and beautiful on the eyes with a real meticulous eye for detail and the costumes suit the characters to a tee. Then there are the special effects that are some of the best of any television programme and are not overused or abused, the scale, the detail and how they actually have character and soul are better than those in a lot of the big-budget blockbusters. As well the cinematography and editing, which are cinematic quality as well.One cannot talk about 'Game of Thrones' without mentioning the thematically, orchestrally and atmospherically multi-layered music scoring and the unforgettable main theme. Again, worthy of a high-budget fantasy/action/drama film.It is hard not to be bowled over by the quality of the writing, outstanding isn't a strong enough adjective to describe how good the writing is. It always has a natural flow, is layered and thought-provoking and demonstrates a wide range of emotions such as suspenseful tension, poignant pathos and witty humour. The story-lines are paced so beautifully, structured with such nuance and attention to coherence, a high emotional level and touch upon complex and sensitive themes with intelligence and tact.Whenever there's a set-piece or more action-oriented scene there's always a reason, never there for the sake of it. Not only are the set-pieces done with a lot epic scale, superb staging, excitement and dramatic tension but underneath all the scale and flashy attention to detail there is a lot of heart and a multi-layered one. They're not overlong, nor are there out of place elements.Characters are a huge part of the appeal too. 'Game of Thrones' has characters that are so well developed and as close to real life as one can get despite being in a fantasy world. These characters are not hero and villain archetypes (Joffrey is the only one close to that, the difference though is that he is an extremely interesting one with a lot of development who ranks well beyond one hundred percent on the threat level scale), they have much more to them and have strengths and flaws. Decisions are logical and one doesn't like any character any less when a decision is not the right one because mistakes are acknowledged and learnt from.'Game of Thrones' cast is full of talented names and, thanks to so well rounded characters and such great writing, nothing but the very best is gotten out of them. Even those who are not favourites of mine. Big acting standouts are Peter Dinklage, Sean Bean, Lena Headey and Jack Gleeson (Joffrey being the king of all young characters with not a redeeming bone in their body).In conclusion, absolutely outstanding and a rare television show worthy of being a cinematic modern classic. This review may sound superlatively hyperbolic, but to me 'Game of Thrones' is that good. 10/10 Bethany Cox"
    },
    {
      "username": "Dan_W_Reviews",
      "userUrl": "https://www.imdb.com/user/ur162010843",
      "reviewLink": "https://www.imdb.com/review/rw8857014",
      "warningSpoilers": false,
      "date": "6 February 2023",
      "rate": "9",
      "helpful": "53 out of 58 found this helpful.",
      "title": "Captivating and Gripping but a Disappointing Final Season",
      "content": "Game of Thrones boasts an intricate plot with complex characters, stunning cinematography, and intense action sequences, especially its many battles and fights. It's hard to deny that it wasn't a cultural phenomenon that captivated me and many others for eight seasons.I've rated Game of Thrones a nine out of ten for its well-written and multi-layered storytelling, and its fantastic production value. However, despite still having amazing visuals and extremely high production value, like many fans, I was disappointed and to an extent frustrated by the final season's storytelling and how certain plot points were handled, which has lowered my rating from a ten to a nine. Despite this, Game of Thrones still remains for me a must-watch series and I would still highly recommend it to any fan of the fantasy or drama genre in general."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8848687",
      "warningSpoilers": false,
      "date": "3 February 2023",
      "rate": "10",
      "helpful": "64 out of 73 found this helpful.",
      "title": "Absolutely Amazing!!",
      "content": "What can be said about Game of Thrones that hasn't already been said? It's universally thought of as one of the best series in the history of television. Look up any \"best shows ever\" list and I promise you'll find Game of Thrones near the top of every list you'll find. Obviously everyone knows the last episode was absolutely awful, even most of the actors have come out and said they didn't like it. Having said that, it doesn't take away from the show being amazing. One bad show doesn't take away from the other 72 episodes that were almost perfect! I've watched the entire series all the way through twice now and if anything I just appreciate this show even more."
    },
    {
      "username": "afura-78800",
      "userUrl": "https://www.imdb.com/user/ur132323361",
      "reviewLink": "https://www.imdb.com/review/rw8789461",
      "warningSpoilers": false,
      "date": "9 January 2023",
      "rate": "10",
      "helpful": "44 out of 49 found this helpful.",
      "title": "One of the best series ever made",
      "content": "I finally finished watching game of thrones and all I can say is that this is one of the best shows ever created. This show has just everything you want to have in a show like nice special effects, awesome story, very talented actors, good surpise moments and effects, incredible landscapes and so on.I found every single episode very entertaining and thrilling, it's hard to stop it once you start watching it. If you like middle age series with fantasy elements, gore (it's very brutal) and a good story then you can not go wrong with this show.The show has also the perfect length in my opinion, it is not too short but also not too long. For me definitely one of my top 10 shows of all time."
    },
    {
      "username": "gillmurphydogg",
      "userUrl": "https://www.imdb.com/user/ur160563229",
      "reviewLink": "https://www.imdb.com/review/rw8859852",
      "warningSpoilers": false,
      "date": "8 February 2023",
      "rate": "9",
      "helpful": "43 out of 48 found this helpful.",
      "title": "Historical",
      "content": "This series - hard to believe it's over a decade old! It's one of the greatest of all times. Without giving much away, the latter season felt a bit rushed, but certainly there are no loose ends in this unforgettable medieval fantasy series. The warring factions are captivating and all have their own vibe. The original and screenplay writers do a great job of bringing the vibrant universe to life. The acting and direction are top notch. The film score is absolutely cinematic and helps set the scene. The set design and costumes are perfect and all seem real. If you've been living under a rock, it's time to watch this show!"
    },
    {
      "username": "samxxx-671-826221",
      "userUrl": "https://www.imdb.com/user/ur43050969",
      "reviewLink": "https://www.imdb.com/review/rw4886015",
      "warningSpoilers": false,
      "date": "25 May 2019",
      "rate": "8",
      "helpful": "1,779 out of 1,964 found this helpful.",
      "title": "A perfect example of: Falling in Love with the Wrong Guy",
      "content": "It was a master piece. It was written to the perfection. It was mesmerizing. It was gripping. It was so shocking that if someone is binge watching this show he/she will need a time-off in between to get their head around things and accept some messed up, yet mind blowing development.But yet, I cant hate it enough after final season. Its like you came to know that you were in love with the wrong one all along. It was like looking at a completely different person. It was like seeing your own dreams and expectations get destroyed. It was not a let down, it was a BETRAYAL!"
    },
    {
      "username": "jacobnoble-02524",
      "userUrl": "https://www.imdb.com/user/ur82926046",
      "reviewLink": "https://www.imdb.com/review/rw4841248",
      "warningSpoilers": true,
      "date": "10 May 2019",
      "rate": "9",
      "helpful": "2,021 out of 2,385 found this helpful.",
      "title": "Game of Thrones",
      "content": "I would give this an easy 10/10.. if season 8 didn't exist. But it does, unfortunately.Season 1-6 10/10 Amazing, complex dialogue and intriguing logical story lines with strong character developments, shocking emotional moments and insane action scenes.Season 7- 8/10 - still really good but seemed rushed and had some illogical moments that made no sense like the Ayra/Sansa fall out and the time/teleporting issues beyond the wall which revealed some lazy writing. But all in all filled with great moments and good set up for the final season.Season 8- 2/10. I actually don't know where or start. Season 8 is a joke. Terrible writing. Nothing makes sense. The writers have butchered most character developments and given hardly any satisfying conclusions to their story arcs.Brans story had no pay off at all and his whole role as the 3 eyed raven proved pointless against the Night King.Jaime's redemption arc was cut off instantly with real no reason.The Night Kings death was underwhelming. Infact all of episode 3 was poor, with no real structure and poorly written end to the main story line of the show. The battle was shockingly illogical and horrendous tactics. Zero white walker fights, limited deaths and ridiculous plot armour. Also editing was poor- some moments characters would be surrounded by hundreds of wights but then the next shot they were all gone. The plot armour ruined the battle of Winterfell. 'All' the Dothraki wiped out in seconds yet Samwell Tarly can fend them off. Laughable.No Sansa and Cersei interaction of any sort which I would have liked to have seen. Although I appreciate this is just my personal disappointment rather than poor writing.-Rhaegal taken down by first 3 shots, yet Drogon dodges an Iron fleets worth of Scorpions at Kings Landing, just to serve the plot. I guess Euron forgot about Dany's dragon and her forces.-Jon does nothing all season (why was he resurrected if he didn't end the long night or atleast become King? The whole point of his resurrection is because the lord of light claimed he was needed alive). Speaking of Jon, what was the point of his lineage? It didn't change anything apart from give us unconvincing tension between him and Danaerys. I kind of like Danaerys going mad but it needed a lot more time and thought put into it - It went too far too fast with no substantial development to justify her killing thousands of innocent people. Again, Laughable. It needed seasons of planning and transitioning her character. After Dany's death it just skipped to Tyrion's trial and no one seemed phased over her death.Anything that required any thought from the Writers was done off screen, like Arya and Sansa finding out about Jon's lineage.Cersei, the clever mastermind who always has a deceitful plan up her sleeve does nothing but stand looking out of a window all season. What a waste of a character.Ayra does not use her faceless abilities. How cool would it have been for something like Ayra shockingly kills Jaime in order to get his face and uses it to get close to cersei, she thinks she is safe then is stabbed whilst in the arms of her 'brother' who reveals to be Ayra. Atleast something like that may have been more satisfying a few bricks falling onto her.Bran becomes king. Urghhh. He literally said countless times he could not be lord of winterfell or rule anymore. Why the sudden change of heart? No explanation? Oh typical.Prince that was promised? Oh yeh let's forget about that too. Haha we fooled you audience.However, my main issue was not with what happened but with how it all happened. Rushed and made no sense.Major let downs and bad dialogue throughout. There are some good moments like Brienne being Knighted, but even that becomes ruined when she sleeps with Jaime- their relationship was so much nicer just being about honour and respect for one another. Have to appreciate effort by cast, visual and music crew and the few decent scenes as a whole.Overall- 9/10 purely on S1-7."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8837559",
      "warningSpoilers": false,
      "date": "30 January 2023",
      "rate": "10",
      "helpful": "58 out of 67 found this helpful.",
      "title": "One of the best shows ever created!",
      "content": "I know that people say this about a ton of different shows but Game of Thrones is absolutely, without a doubt, one of the best TV shows ever created...it's damn near perfect (except for maybe the last few episodes) and easily one of my all-time favorite shows! Yeah, the last few episodes of Season 8 weren't that good and the ending was just awful but the first 7 1/2 seasons were so amazing that it still gets a 10 from me! It's one of the rare shows where I can watch it all the way from the first episode to the last and never get bored. I'm pretty sure there's never been a show more talked about or more loved in the history of television than GOT. All you have to do is read through the reviews to see how loved this show really is! Again, this show is absolutely amazing!"
    },
    {
      "username": "christopherbirk-ny",
      "userUrl": "https://www.imdb.com/user/ur54829788",
      "reviewLink": "https://www.imdb.com/review/rw8717826",
      "warningSpoilers": false,
      "date": "5 December 2022",
      "rate": "10",
      "helpful": "37 out of 40 found this helpful.",
      "title": "Epic and amazing!",
      "content": "That's really all there is to say: Epic and amazing! Touches on all the right elements and does it with perfect execution. Stellar cast that seems born to play those roles.Also, not sure why season 7 and especially 8 gets so much hate on here. I suspect there'll always be people upset about \"the way things ended\", but it think all seasons are equally amazing, so don't let the harsh words people have, discourage you from watching. Truly a great show that I can watch again anytime.It also, somehow manages to be diverse and inclusive, the way tv shows and movies struggle to do the same today - and without being a lecture or shoving things and themes in \"just because\". It actually gets that right too - and whatever lessons the show may have, they're tastefully done and without patronizing the viewers. So one of the last shows I've seen that respects its audience and doesn't force narratives but rather let's them take on a life of their own."
    },
    {
      "username": "kunkell",
      "userUrl": "https://www.imdb.com/user/ur98270490",
      "reviewLink": "https://www.imdb.com/review/rw5229401",
      "warningSpoilers": false,
      "date": "2 November 2019",
      "rate": "6",
      "helpful": "1,291 out of 1,492 found this helpful.",
      "title": "Imagine an Ice Cream Shop",
      "content": "So imagine you go into an ice cream shop and you order a sundae. They've got all kinds of nice stuff going on, beautiful delicious soft serve vanilla bean ice cream, some hot fudge, freshly cracked up peanuts, woah what is that?? A brownie? Some delicious house made whipped cream... Man this sundae is gonna be spectacular. Wow what more could you ask for? Cherry on top? Bring it on!!And then all of a sudden they put an anchovy on top, and then another, and then a couple more, and then squirt some Dijon mustard on for good measure.You don't even want the sundae anymore, in fact, you can't even look back on how nice that sundae used to be without thinking about all the stupid s*** they did at the very end just when it was going so well.That's essentially Game of Thrones. I tried to rewatch it, but as I got through the first season I began looking at where all the pieces land at the end it's literally impossible to go back to. There are just so many ruined character arcs, so much pointlessness, and every time I come back here I drop it one more star it seems like. Game of Thrones is a beautiful anchovy sundae."
    },
    {
      "username": "alshamari-marwa",
      "userUrl": "https://www.imdb.com/user/ur46993949",
      "reviewLink": "https://www.imdb.com/review/rw5753201",
      "warningSpoilers": false,
      "date": "19 May 2020",
      "rate": "9",
      "helpful": "221 out of 276 found this helpful.",
      "title": "Extraordinary untill season 8",
      "content": "This is the first series i would recommend to anybody , it is an amazing piece of work , the most stunning TV series you will ever watch. Why i gave it 9/10 because of the last season, it's still good but very disappointing compared to all the seasons. YOU will enjoy every episode"
    },
    {
      "username": "type-a1pha",
      "userUrl": "https://www.imdb.com/user/ur55596018",
      "reviewLink": "https://www.imdb.com/review/rw4883638",
      "warningSpoilers": false,
      "date": "24 May 2019",
      "rate": "7",
      "helpful": "361 out of 459 found this helpful.",
      "title": "Shame of Thrones",
      "content": "The ending of this series is a disservice to the public!The first seasons are great as they are based on the books source material and, apparently, the writers are good enough at adapting other people ideas. After season four there's a decline, not so manifest at first since the goodness of the source material still lingers around. It's more of a slow deterioration, a spiral into shallow writing that peaks in a last season devoid of content and value. Where at first grand scale developments, societal issues and world-spanning intrigues dominated the narration with characters being the pawns of the true overarching story, later in the seasons characters and stereotypical interactions take the stage and the interesting, long developing issues that made the story captivating get resolved in the most unrewarding ways possible. It's incoherent, detached, uninspired writing. It's everything that is bad in mainstream media.All of this because the writers decided they had enough with the show and grew bored with it. So they wanted to wrap it up as soon as possible in order to go on and ruin the Star Wars franchise (more than it already is). Thanks for your disservice!It needs to be mentioned that the overall production, sound design, acting, cinematography, all of these are quite extraordinary and elevate the show quite a bit, even when the writing declines. The quality is amazing. It probably is still worth watching for its entertainment value. It just doesn't pay off. The ending season ruins quite literally everything."
    },
    {
      "username": "drana-86716",
      "userUrl": "https://www.imdb.com/user/ur144390954",
      "reviewLink": "https://www.imdb.com/review/rw8706600",
      "warningSpoilers": true,
      "date": "1 December 2022",
      "rate": "10",
      "helpful": "31 out of 34 found this helpful.",
      "title": "Underrated Actors and Worse Ending",
      "content": "First of all reading a book and watching a show are two different things. People who likes to read doesn't mean they will like the show based on that book and vice versa. Movies and shows are mainly for commercial purposes as it target much larger audiences than ardent book readers.IN MY OPINION worthy characters like Dany or Jon Snow should be on the Iron Throne. They were the heroes and they deserved it. What did Bran or Sansa Stark do to be King or Queen?? If Bran told Jon's reality in the end then nothing would have happened. He told Sam before the long night. He was a real player!! Lol!!Sansa was basically jealous of Dany. I wonder within few days after Jon and Ramsay battle how she got attached with the Northerners that she can't see them bending the knee. Just wanted to be a Queen. How many years of experience did she have of ruling??People who did everything where they were?? One got murdered and the other was sent North of the wall.I still can't figure out that someone lost her half army one dragon still writers thought that she can't be trusted by Winterfell. There was no logic at all!!Going against the wishes of people in season 8 has ruined the show!! I wish they changed the ending!! I have spent 8-9 years on this show not for this!!Great story!! Great Actors!! But there are some actors who I think didn't get the proper due or fame. Actor who played Stannis, for example, was very good. The expressions which no director or writer can tell the actor to enact or behave in certain way. Same goes for Tywin, Ned Stark and others. Because of short appearances in the show, I believe, they didn't get noticed. People forget about them while main characters like Dany, Jon etc. Get noticed!! They are good too!! No doubt about that!!"
    },
    {
      "username": "msorik",
      "userUrl": "https://www.imdb.com/user/ur31140835",
      "reviewLink": "https://www.imdb.com/review/rw8731902",
      "warningSpoilers": false,
      "date": "12 December 2022",
      "rate": "10",
      "helpful": "32 out of 36 found this helpful.",
      "title": "A real (pre/se)quel...",
      "content": "Pure rubbish what they are calling a prequel...but I hear a sequel is coming-with Snow! Characters we actually care about bc the storylines were so good. Simply the best series ever on TV! I cannot contain it nor lie about it I would love to see Sansa back...it's all good between cousins even in the Bible! I don't think I can handle a man in the wilderness story, it will have again missed what people enjoyed about it. Bring back the sisters, etc. And give us good stories and DO NOT resuscitate the dragon lady! It will be almost next to impossible to write a good story again but I wish them the best."
    },
    {
      "username": "andrew-york80",
      "userUrl": "https://www.imdb.com/user/ur34809374",
      "reviewLink": "https://www.imdb.com/review/rw8974728",
      "warningSpoilers": false,
      "date": "6 April 2023",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Entirely Entertaining",
      "content": "Watched for the first time on blue ray. Definitely unsuitable for non-adults due to the gory violence, themes of torture, murder, nudity, profanity and more. Ive read the books, and even met the author a couple of times, but enjoyed this more although a 8 series long its a fair chunk of time to get through. Understandably, the book series was not finished when the series ended so series 7/8 are perhaps the weakest as they tried to tied things up and yes the last episode of series 8 is a snoozfest but overall its a masterpiece of television adaptation. I waited a long time to buy this as I dislike sky and the price to buy was so high for a long time, but finally took the plunge and have no regrets buying now."
    },
    {
      "username": "danielkpkp",
      "userUrl": "https://www.imdb.com/user/ur118310150",
      "reviewLink": "https://www.imdb.com/review/rw5731695",
      "warningSpoilers": false,
      "date": "12 May 2020",
      "rate": "9",
      "helpful": "862 out of 942 found this helpful.",
      "title": "It could have been the best TV series ever made...",
      "content": "Till season 7 very likely the best TV show ever made in terms of suspense, character development, plot, effects, acting.... 10/10 with no doubt! But S6E10 is probably the point where you should stop and imagine your own ending. It is guaranteed better and has more character development. Otherwise you may end up rating it down by more than just one and are overcome by disappointment..."
    },
    {
      "username": "Amthermandes",
      "userUrl": "https://www.imdb.com/user/ur9755277",
      "reviewLink": "https://www.imdb.com/review/rw8766807",
      "warningSpoilers": false,
      "date": "30 December 2022",
      "rate": "10",
      "helpful": "30 out of 36 found this helpful.",
      "title": "Completely and utterly genius, despite the anticlimactic ending",
      "content": "This show is one in a million. It's one of the few shows that either meet or transcend the public hype. Yes, it's that good. No, it's not for everyone. It's chock full of extreme violence, gore, and the nudity is rampant and unnecessary, but aside from the extreme adult content, it's absolutely worth the hype.Granted, this is also one of those shows to talk about at work around the water cooler as the show is running. Almost no other show matches the value it had during its airtime to discuss it with your friends, family and coworkers. Over time, it might lose a bit of its luster. But it will never cease to be one of the greatest shows ever written. They'll still be talking about this one centuries from now.Sometimes, it is difficult to follow. There are a lot of characters and story arcs of which to keep track. Somehow, this only adds to the replay value. Personally, I've now seen the first 5 seasons 4 times, seasons 1-6 thrice, and the entire series twice. And I still plan to watch it all again and again.It's popular for a reason. You can hate it because for that very reason, but you'd be a fool to, because there's a lot you'd be missing out on. I love this show with a passion.My only advice is, that if you haven't yet experienced it, to keep yourself away from any and all possible spoilers. Avoid all reviews with spoilers, avoid the internet, just watch it.I can't tell you how many times I got chills, or teared up. One example, is the last few minutes of season 2 episode 3. I still get chills after the final horn blasts. And that's just one example. I have about 278 at least."
    },
    {
      "username": "Average_Critic",
      "userUrl": "https://www.imdb.com/user/ur161233681",
      "reviewLink": "https://www.imdb.com/review/rw8808258",
      "warningSpoilers": false,
      "date": "18 January 2023",
      "rate": "9",
      "helpful": "38 out of 41 found this helpful.",
      "title": "Probably the Best TV Show ever to be destroyed!",
      "content": "I started watching this show merely because people around me asked me to. By the end of Season 1 it really had me invested my time and curiosity. Later seasons got me completely hooked and made me a kind of free marketing agent for this show since I was telling my friends to watch this show.I believe the graph of the show starts at the lowest point and from ending season 1 gets a drastic rise. In my opinion it peaks at Season 4 and slowly declines from there. From Season 7 it drops completely and utterly.The last season had my huffing and puffing at every turning point, I would like to appreciate the cinematography of Season 8 which is by far the best in the whole show. The music I would say was best in season 6 and 7.It remains my favorite show till date, and yet the perfect example of 'Messing up something absolutely beautiful'."
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw3054426",
      "warningSpoilers": false,
      "date": "22 July 2014",
      "rate": "8",
      "helpful": "446 out of 628 found this helpful.",
      "title": "Fantasy has never seemed so real",
      "content": "I don't believe there has ever been anything like 'Game of Thrones' on TV. The sheer amount of quality and talent in this series is staggering. The actors (and I mean really ALL the actors), the costumes, the visual effects, the make-up: everybody working on this show seems to have wanted to make Television-history. And the writing is just phenomenal.'Game of Thrones' may belong to the 'Fantasy' genre, but the world of Westeros and its surrounding lands has been so amazingly well thought through and is inhabited by characters that are so well drawn and credible that everything you watch feels real. Every \"country\", every city, tribe or family has such a richly detailed history and even mythology that it just never feels like it was made up. Of course, that was all already there in the books – but translating that so perfectly to a TV-show and with such care as was done here really is a rare achievement.Yet for all its grandeur, scale and breath-taking visuals, what really makes Martin's outstanding work come to life on the small screen is the fantastic ensemble of actors. At the core of this show (any show, really) are the characters. Tyrion, Cersei, Dany, Jamie and John (and all the – many – others) don't lose anything of their complexity; the amazing cast succeeds in showing all their respective characters' inner conflicts and often questionable motivations and virtually no one comes across as one-dimensional (except maybe for Joffrey).There have been a couple of great TV-shows over the last years, but when it comes to scale AND quality, 'Game of Thrones' is – at the moment – in a league of its own. A joy to watch: breath-taking, epic – and highly addictive – Television. 10 stars out of 10.Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite Films: http://www.IMDb.com/list/mkjOKvqlSBs/Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/"
    },
    {
      "username": "rnd-31098",
      "userUrl": "https://www.imdb.com/user/ur129743783",
      "reviewLink": "https://www.imdb.com/review/rw8486689",
      "warningSpoilers": false,
      "date": "25 August 2022",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Could have had a better ending.",
      "content": "You feel like you are inside the series when you watch it. Great series to watch. Season 8 ending could have been far better. The background scores are worth appreciating. Becomes a bit slow in between. It is a must one time watch."
    },
    {
      "username": "rexmatthewj",
      "userUrl": "https://www.imdb.com/user/ur122459646",
      "reviewLink": "https://www.imdb.com/review/rw8884571",
      "warningSpoilers": false,
      "date": "21 February 2023",
      "rate": "9",
      "helpful": "17 out of 19 found this helpful.",
      "title": "\"Winter is coming.\"",
      "content": "Game of Thrones, based on the book series A Song of Ice and Fire by George R. R. Martin, is a fantasy drama series that first premiered on HBO in 2011. The series quickly gained a massive following and became one of the most talked-about shows of the decade.Plot: The plot of Game of Thrones follows multiple noble families as they vie for control of the Seven Kingdoms of Westeros. The show is known for its complex and intricate plotlines, which are filled with political intrigue, backstabbing, and plenty of action. While the series starts off fairly slow, it picks up steam as the various plotlines start to converge. One of the most impressive things about the show is its ability to keep viewers guessing - just when you think you know where a storyline is headed, it takes a surprising turn.Acting: The acting in Game of Thrones is generally very strong. The show features a large ensemble cast, and while there are a few weaker performances, for the most part, the actors bring their A-game. Notably, Peter Dinklage's portrayal of Tyrion Lannister is a standout performance, earning him several Emmy awards. The show also features some excellent child actors, which can be a rarity in TV.Cinematography: The cinematography in Game of Thrones is stunning. The show is shot in various locations around the world, and the landscapes are breathtaking. The battle scenes are particularly impressive, with sweeping shots of armies clashing on the field. Additionally, the show makes great use of special effects to bring its fantasy elements to life.Direction: Game of Thrones is well-directed, with many memorable and impactful scenes. One of the show's standout moments is the \"Red Wedding\" episode, which is incredibly well-executed and emotionally devastating. While there are a few missteps in the series (particularly in the later seasons), for the most part, the direction is strong.Music: The music in Game of Thrones is iconic, with composer Ramin Djawadi creating some of the most recognizable TV themes of all time. The score is epic and grand, and it adds a lot to the show's overall feel.Overall, Game of Thrones is a landmark TV series that changed the game for fantasy TV. While there are certainly flaws in the show (particularly in the later seasons), it's hard to deny the impact that it had on popular culture. The show is well-acted, well-directed, and beautifully shot, with a plot that keeps viewers engaged and guessing until the very end. If you're a fan of fantasy or epic dramas, Game of Thrones is definitely worth checking out."
    },
    {
      "username": "Hitchcoc",
      "userUrl": "https://www.imdb.com/user/ur0278527",
      "reviewLink": "https://www.imdb.com/review/rw4025216",
      "warningSpoilers": false,
      "date": "6 January 2018",
      "rate": "10",
      "helpful": "47 out of 61 found this helpful.",
      "title": "A Need Fulfilled",
      "content": "I am writing this because according to the IMDB User Ratings, I have not commented. I have reviewed all the individual episodes, but not the show as a whole. There is little that I can add to the impact of this show. I am proud to be on the same planet as those who created and put this work into fruition. When one looks at the technical accomplishments and the multiple plot strains that have been kept in balance, it is truly a wonder. I know that there are those who can never get past the \"book did this\" and \"the book did that.\" We have to come to realize that it is impossible to recreate every nuance that fiction allows and that occasionally characters must be dropped and events assumed. For me, I have approached these as the artistic creations they are--as film (and television, at that). I have the books. I've not read them but plan to at some point. I doubt at this late stage of my life there will ever be another series to match this. I like fantasy but am not ruled by it as a genre. But this is for us all. If you've not seen it, treat yourself."
    }
  ],
  "errorMessage": ""
}