{
  "imDbId": "tt0944947",
  "title": "Game of Thrones",
  "fullTitle": "Game of Thrones (TV Series 2011–2019)",
  "type": "TVSeries",
  "year": "2011",
  "language": "en",
  "titleInLanguage": "Game of Thrones",
  "url": "https://en.wikipedia.org/wiki/Game_of_Thrones",
  "plotShort": {
    "plainText": "Game of Thrones is an American fantasy drama television series created by David Benioff and D. B. Weiss for HBO. It is an adaptation of A Song of Ice and Fire, a series of fantasy novels by George R. R. Martin, the first of which is A Game of Thrones. The show was shot in the United Kingdom, Canada, Croatia, Iceland, Malta, Morocco, and Spain. It premiered on HBO in the United States on April 17, 2011, and concluded on May 19, 2019, with 73 episodes broadcast over eight seasons.\r\nSet on the fictional continents of Westeros and Essos, Game of Thrones has a large ensemble cast and follows several story arcs throughout the course of the show. The first major arc concerns the Iron Throne of the Seven Kingdoms of Westeros through a web of political conflicts among the noble families either vying to claim the throne or fighting for independence from whoever sits on it. The second focuses on the last descendant of the realm's deposed ruling dynasty, who has been exiled to Essos and is plotting to return and reclaim the throne. The third follows the Night's Watch, a military order defending the realm against threats from beyond Westeros's northern border.\r\nGame of Thrones attracted a record viewership on HBO and has a broad, active, and international fan base. Critics have praised the series for its acting, complex characters, story, scope, and production values, although its frequent use of nudity and violence (including sexual violence) has been subject to criticism. The final season received significant critical backlash for its reduced length and creative decisions, with many considering it a disappointing conclusion. The series received 59 Primetime Emmy Awards, the most by a drama series, including Outstanding Drama Series in 2015, 2016, 2018 and 2019. Its other awards and nominations include three Hugo Awards for Best Dramatic Presentation, a Peabody Award, and five nominations for the Golden Globe Award for Best Television Series – Drama.\r\nA prequel series, House of the Dragon, premiered on HBO in 2022.",
    "html": "<p>Game of Thrones is an American fantasy drama television series created by David Benioff and D. B. Weiss for HBO. It is an adaptation of A Song of Ice and Fire, a series of fantasy novels by George R. R. Martin, the first of which is A Game of Thrones. The show was shot in the United Kingdom, Canada, Croatia, Iceland, Malta, Morocco, and Spain. It premiered on HBO in the United States on April 17, 2011, and concluded on May 19, 2019, with 73 episodes broadcast over eight seasons.</p><p>Set on the fictional continents of Westeros and Essos, Game of Thrones has a large ensemble cast and follows several story arcs throughout the course of the show. The first major arc concerns the Iron Throne of the Seven Kingdoms of Westeros through a web of political conflicts among the noble families either vying to claim the throne or fighting for independence from whoever sits on it. The second focuses on the last descendant of the realm's deposed ruling dynasty, who has been exiled to Essos and is plotting to return and reclaim the throne. The third follows the Night's Watch, a military order defending the realm against threats from beyond Westeros's northern border.</p><p>Game of Thrones attracted a record viewership on HBO and has a broad, active, and international fan base. Critics have praised the series for its acting, complex characters, story, scope, and production values, although its frequent use of nudity and violence (including sexual violence) has been subject to criticism. The final season received significant critical backlash for its reduced length and creative decisions, with many considering it a disappointing conclusion. The series received 59 Primetime Emmy Awards, the most by a drama series, including Outstanding Drama Series in 2015, 2016, 2018 and 2019. Its other awards and nominations include three Hugo Awards for Best Dramatic Presentation, a Peabody Award, and five nominations for the Golden Globe Award for Best Television Series – Drama.</p><p>A prequel series, House of the Dragon, premiered on HBO in 2022.</p>"
  },
  "plotFull": {
    "plainText": "Game of Thrones is an American fantasy drama television series created by David Benioff and D. B. Weiss for HBO. It is an adaptation of A Song of Ice and Fire, a series of fantasy novels by George R. R. Martin, the first of which is A Game of Thrones. The show was shot in the United Kingdom, Canada, Croatia, Iceland, Malta, Morocco, and Spain. It premiered on HBO in the United States on April 17, 2011, and concluded on May 19, 2019, with 73 episodes broadcast over eight seasons.\r\nSet on the fictional continents of Westeros and Essos, Game of Thrones has a large ensemble cast and follows several story arcs throughout the course of the show. The first major arc concerns the Iron Throne of the Seven Kingdoms of Westeros through a web of political conflicts among the noble families either vying to claim the throne or fighting for independence from whoever sits on it. The second focuses on the last descendant of the realm's deposed ruling dynasty, who has been exiled to Essos and is plotting to return and reclaim the throne. The third follows the Night's Watch, a military order defending the realm against threats from beyond Westeros's northern border.\r\nGame of Thrones attracted a record viewership on HBO and has a broad, active, and international fan base. Critics have praised the series for its acting, complex characters, story, scope, and production values, although its frequent use of nudity and violence (including sexual violence) has been subject to criticism. The final season received significant critical backlash for its reduced length and creative decisions, with many considering it a disappointing conclusion. The series received 59 Primetime Emmy Awards, the most by a drama series, including Outstanding Drama Series in 2015, 2016, 2018 and 2019. Its other awards and nominations include three Hugo Awards for Best Dramatic Presentation, a Peabody Award, and five nominations for the Golden Globe Award for Best Television Series – Drama.\r\nA prequel series, House of the Dragon, premiered on HBO in 2022.\r\nPremise\r\nPlot\r\nGame of Thrones is roughly based on the storylines of the A Song of Ice and Fire book series by George R. R. Martin, set in the fictional Seven Kingdoms of Westeros and the continent of Essos. The series follows several simultaneous plot lines. The first story arc follows a war of succession among competing claimants for control of the Iron Throne of the Seven Kingdoms, with other noble families fighting for independence from the throne. The second concerns the exiled scion's actions to reclaim the throne; the third chronicles the threat of the impending winter, as well as the legendary creatures and fierce peoples of the North.\r\nCast and characters\r\nGame of Thrones has an ensemble cast which has been estimated to be the largest on television. In 2014, several actors' contracts were renegotiated to include a seventh-season option. By the final season, five of the main cast members made $1 million per episode, making them among the highest paid television performers.\r\nEddard \"Ned\" Stark (Sean Bean) is the head of House Stark. He and his wife, Catelyn (Michelle Fairley), have five children: Robb (Richard Madden), Sansa (Sophie Turner), Arya (Maisie Williams), Bran (Isaac Hempstead-Wright), and Rickon (Art Parkinson). Ned also has an illegitimate son, Jon Snow (Kit Harington), who, along with his scholarly friend, Samwell Tarly (John Bradley), serve in the Night's Watch under Lord Commander Jeor Mormont (James Cosmo). The Wildlings living north of the Wall include the young Gilly (Hannah Murray) and the warriors Tormund Giantsbane (Kristofer Hivju) and Ygritte (Rose Leslie).\r\nOthers associated with House Stark include Ned's ward Theon Greyjoy (Alfie Allen), Ned's vassal Roose Bolton (Michael McElhatton), and Roose's illegitimate son, Ramsay (Iwan Rheon). Robb accepts help from the healer Talisa Maegyr (Oona Chaplin), while elsewhere, Arya befriends the blacksmith's apprentice Gendry Rivers (Joe Dempsie) and the assassin Jaqen H'ghar (Tom Wlaschiha). In the Stormlands, the tall warrior Brienne of Tarth (Gwendoline Christie) serves on the Rainbow Guard.\r\nIn King's Landing, Ned's old friend, King Robert I Baratheon (Mark Addy), shares a loveless political marriage with Cersei Lannister (Lena Headey). Her younger twin brother, Ser Jamie (Nikolaj Coster-Waldau), serves on the Kingsguard. The third and youngest Lannister sibling is the dwarf Tyrion (Peter Dinklage), who is attended by his mistress Shae (Sibel Kekilli) and the sellsword Bronn (Jerome Flynn). Cersei's father is Tywin (Charles Dance), head of House Lannister and richest man in Westeros. Cersei has two sons: Joffrey (Jack Gleeson) and Tommen (Dean-Charles Chapman). Joffrey is guarded by the scar-faced warrior Sandor \"The Hound\" Clegane (Rory McCann).\r\nThe king's Small Council of advisors includes, among others, the crafty Master of Coin, Lord Petyr \"Littlefinger\" Baelish (Aidan Gillen), and the eunuch spymaster, Lord Varys (Conleth Hill). In Dragonstone, Robert's younger brother, Stannis (Stephen Dillane), is advised by the foreign priestess Melisandre (Carice van Houten) and former smuggler Ser Davos Seaworth (Liam Cunningham). In the Reach, the Tyrell family, led by its matriarch Olenna (Diana Rigg), is represented at court by Margaery (Natalie Dormer), the matriarch's granddaughter. The High Sparrow (Jonathan Pryce) is eventually given power as a religious leader. In the southern principality of Dorne, the warrior Ellaria Sand (Indira Varma) seeks vengeance against the Lannisters.\r\nAcross the Narrow Sea, in Pentos, siblings Viserys Targaryen (Harry Lloyd) and Daenerys Targaryen (Emilia Clarke) (colloquially referred to as \"Dany\") are in exile, with the former plotting to reclaim his father's throne. Daenerys is forced into marrying Khal Drogo (Jason Momoa), a leader of the nomadic Dothraki. Her retinue eventually comes to include the exiled knight Ser Jorah Mormont (Iain Glen), her aide Missandei (Nathalie Emmanuel), the sellsword Daario Naharis (Michiel Huisman), and the elite soldier Grey Worm (Jacob Anderson).\r\nThemes\r\nThe series has been praised by both television critics and historians for what was perceived as a sort of medieval realism. George R. R. Martin set out to make the story feel more like historical fiction than contemporary fantasy, with less emphasis on magic and sorcery and more on battles, political intrigue, and the characters, believing that magic should be used moderately in the epic fantasy genre. Martin has said that, \"the true horrors of human history derive not from orcs and Dark Lords, but from ourselves\". Academics have classified the series as neo-medieval which focuses on the overlapping of medieval history and popular fantasy. A common theme in the fantasy genre is the battle between good and evil, which Martin says does not mirror the real world. Martin explores the relationship between good and evil through the questions of redemption and character change. The series allows the audience to view different characters from their perspective, unlike in many other fantasies.\r\nIn early seasons, under the influence of the A Song of Ice and Fire books, main characters were regularly killed off, and this was credited with developing tension among viewers. Martin stated in an interview that he wanted to depict war and violence in a realistic way, which sometimes mean the hero or main characters could be injured or killed. In later seasons, critics pointed out that certain characters had developed \"plot armor\" to survive in unlikely circumstances and attributed this to Game of Thrones deviating from the novels to become more of a traditional television series. In a 2012 study, out of 40 recent television drama shows, Game of Thrones ranked second in deaths per episode, averaging 14. A scientific study conducted in 2018 stated that about 60% of the major characters died as a result of violence and war.\r\nInspirations and derivations\r\nAlthough the series's first season closely follows the events of the first novel, there were significant changes made for later seasons. According to Benioff, the TV adaptation is \"about adapting the series as a whole and following the map George laid out for us and hitting the major milestones, but not necessarily each of the stops along the way\". Aspects of the novels' plots and their adaptations are based upon settings, characters, and events in European history. Most of Westeros is reminiscent of high medieval Europe, from its geography and castles to its cultures, the feudal system, palace intrigues, and the knights' tournaments. Like medieval Europe, most of the houses in the series use the patriarchal system of power. The series also includes elements of gothic fiction, including torture tropes.\r\nA principal inspiration for the novels is the English Wars of the Roses (1455–1485) between the houses of Lancaster and York, reflected in Martin's houses of Lannister and Stark. The scheming Cersei Lannister evokes Isabella, the \"She-Wolf of France\" (1295–1358). She and her family, as portrayed in Maurice Druon's historical novel series, The Accursed Kings, were a main inspiration of Martin's. Other historical antecedents of series elements include: Hadrian's Wall (which becomes Martin's Wall), the Roman Empire, and the legend of Atlantis (ancient Valyria), Byzantine Greek fire (\"wildfire\"), Icelandic sagas of the Viking Age (the Ironborn), the Mongol hordes (the Dothraki), the Hundred Years' War, and the Italian Renaissance. The series's popularity has been attributed, in part, to Martin's skill at fusing these elements into a seamless, credible version of alternate history.\r\nProduction\r\nConception and development\r\nThe A Song of Ice and Fire series of novels was popular before Game of Thrones. The series has sold more than 90 million copies worldwide with the novels being translated into 45 different languages. George R. R. Martin received multiple fantasy writing awards and nominations, including a World Fantasy Award and multiple Locus Awards, for the series. Writing for Time magazine in 2005 after the release of A Feast for Crows, journalist Lev Grossman called Martin the \"American Tolkien\", stating he is a \"major force for evolution in fantasy\".\r\nIn January 2006, David Benioff had a telephone conversation with Martin's literary agent about the books he represented. Having been a fan of fantasy fiction when he was younger, he became interested in A Song of Ice and Fire, which he had not read. The literary agent sent Benioff the series's first four books. Benioff read a few hundred pages of the first novel, A Game of Thrones, shared his enthusiasm with D. B. Weiss, and suggested that they adapt Martin's novels into a television series; Weiss finished the first novel in \"maybe 36 hours\". They pitched the series to HBO after a five-hour meeting with Martin (himself a veteran screenwriter) in a restaurant on Santa Monica Boulevard. According to Benioff, they won Martin over by knowing the answer to his question, \"Who is Jon Snow's mother?\"\r\nI had worked in Hollywood myself for about 10 years, from the late '80s to the '90s. I'd been on the staff of The Twilight Zone and Beauty and the Beast. All of my first drafts tended to be too big or too expensive. I always hated the process of having to cut. I said, 'I'm sick of this, I'm going to write something that's as big as I want it to be, and it's going to have a cast of characters that go into the thousands, and I'm going to have huge castles, and battles, and dragons.\r\n—George R. R. Martin, author\r\nBefore being approached by Benioff and Weiss, Martin had had meetings with other scriptwriters, most of whom wanted to adapt the series as a feature film. Martin, however, deemed it \"unfilmable\", saying that the size of one of his novels is as long as The Lord of the Rings, which had been adapted as three feature films. Benioff agreed it would be impossible to turn the novels into a feature film as their scale is too big for a feature film, and dozens of characters would have to be discarded. Benioff added, \"a fantasy movie of this scope, financed by a major studio, would almost certainly need a PG-13 rating. That means no sex, no blood, no profanity. Fuck that.\" Martin was pleased with the suggestion that they adapt it as an HBO series, saying that he \"never imagined it anywhere else\".\r\nThe series began development in January 2007. HBO acquired the television rights to the novels, with Benioff and Weiss as the series' executive producers and Martin as a co-executive producer. The intention was for each novel to yield a season's worth of episodes. Initially, Martin would write one episode per season while Benioff and Weiss would write the rest. Jane Espenson and Bryan Cogman were added later to write one episode each for the first season. The first and second drafts of the pilot script by Benioff and Weiss were submitted in August 2007 and June 2008, respectively. Although HBO liked both drafts, a pilot was not ordered until November 2008. The pilot episode, \"Winter Is Coming\", was shot in 2009; after its poor reception following a private viewing, HBO demanded an extensive re-shoot (about 90 percent of the episode, with cast and directorial changes). The pilot reportedly cost HBO $5–10 million to produce, while the first season's budget was estimated at $50–60 million. For the second season, the series received a 15-percent budget increase for the climactic battle in \"Blackwater\" (which had an $8 million budget). Between 2012 and 2015, the average budget per episode increased from $6 million to \"at least\" $8 million. The sixth-season budget was over $10 million per episode, for a season total of over $100 million, a record for a series's production cost. By the final season, the production budget per episode was estimated to be $15 million.\r\nCasting\r\nNina Gold and Robert Sterne were the series' primary casting directors. Through a process of auditions and readings, the main cast was assembled. The only exceptions were Peter Dinklage and Sean Bean, whom the writers wanted from the start; they were announced as joining the pilot in 2009. Other actors signed for the pilot were Kit Harington as Jon Snow, Jack Gleeson as Joffrey Baratheon, Harry Lloyd as Viserys Targaryen, and Mark Addy as Robert Baratheon. According to Benioff and Weiss, Addy was the easiest actor to cast for the series because of his audition performance. Some characters in the pilot were recast for the first season. The role of Catelyn Stark was played initially by Jennifer Ehle, but the role was recast with Michelle Fairley. The character of Daenerys Targaryen was also recast, with Emilia Clarke replacing Tamzin Merchant. The rest of the first season's cast was selected in the second half of 2009.\r\nAlthough many of the cast returned after the first season, the producers had many new characters to cast in each of the following seasons. Because of the large number of new characters, Benioff and Weiss postponed introducing several key characters in the second season and merged several characters into one, or assigned plot functions to different characters. Some recurring characters were recast over the years; for example, Gregor Clegane was played by three different actors, while Dean-Charles Chapman played both Tommen Baratheon and a minor Lannister character.\r\nWriting\r\nGame of Thrones used seven writers over its six seasons. Benioff and Weiss wrote most of each season's episodes. A Song of Ice and Fire author George R. R. Martin wrote one episode in each of the first four seasons. Martin did not write an episode for the later seasons, since he wanted to focus on completing the sixth novel (The Winds of Winter). Jane Espenson co-wrote one first-season episode as a freelance writer.\r\nCogman, initially a script coordinator for the series, was promoted to producer for the fifth season. Cogman, who wrote at least one episode for the first five seasons, was the only other writer in the writers' room with Benioff and Weiss. Before Cogman's promotion, Vanessa Taylor—a writer during the second and third seasons—worked closely with Benioff and Weiss. Dave Hill joined the writing staff for the fifth season after working as an assistant to Benioff and Weiss. Although Martin was not in the writers' room, he read the script outlines and made comments.\r\nBenioff and Weiss sometimes assigned characters to particular writers; for example, Cogman was assigned to Arya Stark for the fourth season. The writers spent several weeks writing a character outline, including what material from the novels to use and the overarching themes. After these individual outlines were completed, they spent another two to three weeks discussing each main character's individual arc and arranging them episode by episode. A detailed outline was created, with each of the writers working on part of it to create a script for each episode. Cogman, who wrote two episodes for the fifth season, took a month and a half to complete both scripts. They were then read by Benioff and Weiss, who made notes, and parts of the script were rewritten. All ten episodes were written before filming began since they were shot out of order by two units in different countries. Benioff and Weiss wrote their episodes together; one wrote the first half of the script with the other writing the second half. They then passed the drafts back and forth to make notes and do rewrites.\r\nAdaptation schedule and episodes\r\nAfter Game of Thrones story line began outpacing the published novels in the sixth season, the series was based on a plot outline of the future novels provided by Martin along with original content. Before season four, Martin stated there was an issue with the television series being released before the source material could be written. According to Benioff, Martin gave the showrunners an outline on the final two books of the series. In April 2016, the showrunners' plan was to shoot 13 more episodes after the sixth season: seven episodes in the seventh season and six episodes in the eighth. Later that month, the series was renewed for a seventh season with a seven-episode order. HBO announced in June 2016 that the eighth season would be the final for the series.\r\nThe first two seasons adapted one novel each. For the later seasons, its creators saw Game of Thrones as an adaptation of A Song of Ice and Fire as a whole rather than the individual novels, enabling them to move events across novels as the screen adaptation required.\r\nFilming\r\nPrincipal photography for the first season was scheduled to begin on July 26, 2010; the primary location was the Paint Hall Studios in Belfast, Northern Ireland. Exterior scenes in Northern Ireland were filmed at Sandy Brae in the Mourne Mountains (standing in for Vaes Dothrak); Castle Ward (Winterfell); Saintfield Estates (the Winterfell godswood); Tollymore Forest (outdoor scenes); Cairncastle (the execution site); the Magheramorne quarry (Castle Black); and Shane's Castle (the tourney grounds). Doune Castle in Stirling, Scotland, was also used in the original pilot episode for scenes at Winterfell. The producers initially considered filming the entire series in Scotland, but decided on Northern Ireland because of the availability of studio space and tax credits.\r\nThe first season's southern scenes were filmed in Malta, a change in location from the pilot episode's Moroccan sets. The city of Mdina was used for King's Landing. Filming also took place at Fort Manoel (representing the Sept of Baelor); at the Azure Window on the island of Gozo (the Dothraki wedding site); and at San Anton Palace, Fort Ricasoli, Fort St. Angelo and St. Dominic monastery (all used for scenes in the Red Keep). Filming of the second season's southern scenes shifted from Malta to Croatia, where the city of Dubrovnik and nearby locations allowed exterior shots of a walled, coastal medieval city. The Walls of Dubrovnik and Fort Lovrijenac were used for scenes in King's Landing, though exteriors of some local buildings in the series, for example, the Red Keep and the Sept of Baelor, are computer generated. The island of Lokrum, the St. Dominic monastery in the coastal town of Trogir, the Rector's Palace in Dubrovnik, and the Dubac quarry (a few kilometers east) were used for scenes set in Qarth. Scenes set north of the Wall, in the Frostfangs, and at the Fist of the First Men, were filmed in November 2011 in Iceland on the Vatnajökull glacier near Smyrlabjörg, the Svínafellsjökull glacier near Skaftafell, and the Mýrdalsjökull glacier near Vik on Höfðabrekkuheiði. Filming also occurred at the harbor in Ballintoy, Northern Ireland.\r\nThird-season production returned to Dubrovnik, with the Walls of Dubrovnik, Fort Lovrijenac, and nearby locations again used for scenes in King's Landing and the Red Keep. Trsteno Arboretum, a new location, is the garden of the Tyrells in King's Landing. The third season also returned to Morocco (including the city of Essaouira) to film Daenerys's scenes in Essos. Dimmuborgir and the Grjótagjá cave in Iceland were used as well. One scene, with a live bear, was filmed in Los Angeles. The production used three units (Dragon, Wolf and Raven) filming in parallel, six directing teams, 257 cast members and 703 crew members. The fourth season returned to Dubrovnik and included new locations, including Diocletian's Palace in Split, Klis Fortress north of Split, Perun quarry east of Split, the Mosor mountain range and Baška Voda farther south. Thingvellir National Park in Iceland was used for the fight between Brienne and the Hound. The fifth season added Seville, Spain, used for scenes of Dorne, and Córdoba.\r\nThe sixth season, which began filming in July 2015, returned to Spain and filmed in Navarra, Guadalajara, Seville, Almeria, Girona and Peniscola. Filming also returned to Dubrovnik, Croatia. The filming of the seven episodes of season seven began on August 31, 2016, at Titanic Studios in Belfast, with other filming in Iceland, Northern Ireland and many locations in Spain, including Seville, Cáceres, Almodovar del Rio, Santiponce, Zumaia and Bermeo. Filming continued until the end of February 2017, as necessary, to ensure winter weather in some European locations. Filming for season eight began in October 2017 and concluded in July 2018. New filming locations included Moneyglass and Saintfield in Northern Ireland for \"The Long Night\" battle scenes.\r\nEffect on locations\r\nNorthern Ireland Screen, a UK government agency financed by Invest NI and the European Regional Development Fund, helped fund Game of Thrones. Tourism Ireland has a Game of Thrones-themed marketing campaign similar to New Zealand's Tolkien-related advertising. According to First Minister Arlene Foster, the series has given Northern Ireland the most publicity in its history apart from The Troubles. The production of Game of Thrones and other TV series boosted Northern Ireland's creative industries, contributing to an estimated 12.4 percent growth in arts, entertainment and recreation jobs between 2008 and 2013 (compared with 4.3 percent in the rest of the UK during the same period). After filming had finished, HBO converted its filming locations in Northern Ireland into tourist attractions to be opened in 2019. By 2019, 350,000 visitors, or one sixth of all tourists, came to Northern Ireland annually because of Game of Thrones.\r\nTourism organizations elsewhere reported increases in bookings after their locations appeared in Game of Thrones. Between 2014 and 2016, Hotels.com reported hotel bookings increased by 285 percent in Iceland and 120 percent in Dubrovnik. In 2016, bookings doubled in Ouarzazate, Morocco, the location of Daenerys' season three scenes. Dubrovnik also saw an increase in overnight tourist stays after episodes aired. However, the increase in tourism driven by the series—estimated to be responsible for half of its annual increase over many years—led to concerns about \"over-tourism\" and its mayor imposing limits on tourist numbers in the city. Following the series finale, HBO announced in April 2019 a new exhibition and tourist attraction containing show props and set pieces. The attraction, titled Game of Thrones Studio Tour, will be located at former show filming location Linen Mill Studios outside Belfast. Studies showed that the series had an overall positive economic impacts for both Northern Ireland and Dubrovnik. Despite the positive economic results, some academics note the impact and damage from Game of Thrones–related tourist activities could have on historical sites and other locations of cultural value.\r\nDirecting\r\nEach ten-episode season of Game of Thrones had four to six directors, who usually directed back-to-back episodes. Alan Taylor directed seven episodes, the most of any director. Alex Graves, David Nutter, Mark Mylod, and Jeremy Podeswa directed six episodes each. Daniel Minahan directed five episodes, and Michelle MacLaren, Alik Sakharov, and Miguel Sapochnik directed four each; MacLaren is the only female director of the entire series's run. Brian Kirk directed three episodes during the first season, and Tim Van Patten directed the series's first two episodes. Neil Marshall directed two episodes, both with large battle scenes: \"Blackwater\" and \"The Watchers on the Wall\". Other directors include Jack Bender, David Petrarca, Daniel Sackheim, Michael Slovis and Matt Shakman. David Benioff and D. B. Weiss have directed two episodes together but were credited with only one each, which was determined after a coin toss. For season eight, David Nutter and Miguel Sapochnik, who worked on previous episodes, directed the first five episodes. Benioff and Weiss were credited as both the writers and directors of the show finale \"The Iron Throne\".\r\nProduction design\r\nMichele Clapton was the costume designer for Game of Thrones' first five seasons before she was replaced by April Ferry. Clapton returned to the series as its costume designer for the seventh season. For the first three seasons, Paul Engelen was Game of Thrones' main makeup designer and prosthetic makeup artist with Melissa Lackersteen, Conor O'Sullivan, and Rob Trenton. At the beginning of the fourth season, Engelen's team was replaced by Jane Walker and her crew, composed of Ann McEwan and Barrie and Sarah Gower. Over 130 makeup artists and prosthetic designers worked on the show.\r\nThe designs for the series's costumes were inspired by several sources, such as Japanese and Persian armor. Dothraki dress resembles that of the Bedouin (one was made of fish skins to resemble dragon scales), and the Wildlings wear animal skins like the Inuit. Wildling bone armor is made from molds of actual bones and is assembled with string and latex resembling catgut. Although the extras who played Wildlings and the Night's Watch often wore hats (normal in a cold climate), members of the principal cast usually did not so viewers could recognize them. Björk's Alexander McQueen high-neckline dresses inspired Margaery Tyrell's funnel-neck outfit, and prostitutes' dresses were designed for easy removal. All the clothing used during the production was aged for two weeks, so it had a realistic appearance on high-definition television.\r\nAbout two dozen wigs were used by the actresses. Made of human hair and up to 61 centimetres (2 ft) in length, they cost up to $7,000 each and were washed and styled like real hair. Applying the wigs was time-consuming; Emilia Clarke, for example, required about two hours to style her brunette hair with a platinum-blonde wig and braids. Other actors, such as Jack Gleeson and Sophie Turner, received frequent hair coloring. For characters such as Daenerys (Clarke) and her Dothraki, their hair, wigs and costumes were processed to appear as if they had not been washed for weeks.\r\nVisual effects\r\nFor the large number of visual effects used in the series, HBO hired British-based BlueBolt and Irish-based Screen Scene for season one. Most of the environment builds were done as 2.5D projections, giving viewers perspective while keeping the programming from being overwhelming. In 2011, the season one finale, \"Fire and Blood\", was nominated for a Primetime Emmy Award for Outstanding Special Visual Effects. The visual effects crew consisted of both on-set VFX supervisors and concept artists along with visual effect editors in post-production.\r\nBecause the effects became more complex in subsequent seasons (including CGI creatures, fire, and water), German-based Pixomondo became the lead visual effects producer; nine of its twelve facilities contributed to the project for season two, with Stuttgart the lead studio. Scenes were also produced by British-based Peanut FX, Canadian-based Spin VFX, and US-based Gradient Effects. \"Valar Morghulis\" and \"Valar Dohaeris\" earned Pixomondo Primetime Emmy Awards for Outstanding Special Visual Effects in 2012 and 2013, respectively.\r\nHBO added German-based Mackevision to the project in season four. The season four finale, \"The Children\", won the 2014 Emmy Award for Visual Effects. Additional producers for season four included Canadian-based Rodeo FX, German-based Scanline VFX and US-based BAKED FX. The muscle and wing movements of the adolescent dragons in seasons four and five were based largely on those of a chicken. Pixomondo retained a team of 22 to 30 people focused solely on visualizing Daenerys Targaryen's dragons, with the average production time per season of 20 to 22 weeks. For the fifth season, HBO added Canadian-based Image Engine and US-based Crazy Horse Effects to its list of main visual-effects producers. Visual effect supervisor Joe Bauer said that the VFX team worked on more than \"10,000 shots of visual effects\" throughout all eight seasons. More than 300 artists worked on the show's visual effects team. The show won eight Creative Arts Emmy Awards for visual effects, winning for Outstanding Special Visual Effects in seven consecutive seasons.\r\nTitle sequence\r\nThe series's title sequence was created for HBO by production studio Elastic. Creative director Angus Wall and his collaborators received the 2011 Primetime Emmy Award for Main Title Design for the sequence, which depicts a three-dimensional map of the series's fictional world. The map is projected on the inside of a sphere which is centrally lit by a small sun in an armillary sphere. As the camera moves across the map, focusing on the locations of the episode's events, clockwork mechanisms intertwine and allow buildings and other structures to emerge from the map. Accompanied by the title music, the names of the principal cast and creative staff appear. The sequence concludes after about 90 seconds with the title card and brief opening credits detailing the episode's writer(s) and director. Its composition changes as the story progresses, with new locations replacing those featuring less prominently or not at all. Entertainment Weekly named the title sequence one of the best on television, calling it an \"all-inclusive cruise of Westeros\".\r\nMusic\r\nRamin Djawadi composed the series's music. The first season's soundtrack, written about ten weeks before the series's premiere, was published by Varèse Sarabande in June 2011. Soundtrack albums for subsequent seasons have been released, with tracks by the National, the Hold Steady and Sigur Rós. Djawadi composed reoccurring themes for each of the major houses and some main characters. Some themes evolved over time. Daenerys Targaryen's theme was simple and became more complex after each season. At first, her theme was played by a single instrument, a cello, and Djawadi later incorporated more instruments into it. Djawadi was nominated twice for a Grammy Award for Best Score Soundtrack for Visual Media for his work on the show. In addition to the originally scored music, Columbia Records released the For the Throne: Music Inspired by the HBO Series Game of Thrones companion album on April 26, 2019.\r\nLanguage\r\nThe Westerosi characters of Game of Thrones speak British-accented English, often (but not consistently) with the accent of the English region corresponding to the character's Westerosi region. The Northerner Eddard Stark speaks in actor Sean Bean's native northern accent, and the southern lord Tywin Lannister speaks with a southern accent, while characters from Dorne speak English with a Spanish accent. Characters foreign to Westeros often have a non-British accent.\r\nAlthough the common language of Westeros is represented as English, the producers charged linguist David J. Peterson with constructing Dothraki and Valyrian languages based on the few words in the novels. Before production, Peterson wrote 300 pages of Dothraki language material, including translation and word function. Dothraki and Valyrian dialogue is often subtitled in English. Language-learning company Duolingo began offering courses in High Valyrian in 2017, of which 1.2 million people signed up for between 2017 and 2020.\r\nAvailability\r\nBroadcast\r\nGame of Thrones was broadcast by HBO in the United States and by its local subsidiaries or other pay television services in other countries, at the same time as in the US or weeks (or months) later. Broadcasters carrying Game of Thrones included Fox Showcase in Australia; HBO Canada, Super Écran, and Showcase in Canada; HBO Latin America in Latin America; Sky Television Network's SoHo and Neon in New Zealand and Sky Atlantic in the United Kingdom and Ireland. In India, two versions of the series were aired; Star World aired a censored version of the series on television at the same time as the US, while an uncensored version was made available for live viewing on the Hotstar app.\r\nOn January 23, 2015, the last two episodes of season four were shown in 205 IMAX theaters across the United States, the first television series to be shown in this format. The show earned $686,000 at the box office on its opening day and $1.5 million during its opening weekend; the week-long release grossed $1,896,092. Before the season eight premiere, HBO screened \"The Spoils of War\" episode from season seven in movie theaters in New York, Los Angeles, and \"Chicago\".\r\nHome media and streaming\r\nThe ten episodes of the first season of Game of Thrones were released as a DVD and Blu-ray box set on March 6, 2012. The box set includes extra background and behind-the-scenes material but no deleted scenes, since nearly all the footage shot for the first season was used. The box set sold over 350,000 copies in the week following its release, the largest first-week DVD sales ever for an HBO series. The series also set an HBO-series record for digital-download sales. A collector's-edition box set was released in November 2012, combining the DVD and Blu-ray versions of the first season with the first episode of season two. A paperweight in the shape of a dragon egg is included in the set.\r\nDVD-Blu-ray box sets and digital downloads of the second season became available on February 19, 2013. First-day sales broke HBO records, with 241,000 box sets sold and 355,000 episodes downloaded. The third season was made available for purchase as a digital download on the Australian iTunes Store, parallel to the US premiere, and was released on DVD and Blu-ray in region 1 on February 18, 2014. The fourth season was released on DVD and Blu-ray on February 17, 2015, and the fifth season on March 15, 2016. Blu-ray and DVD versions of the sixth season were released on November 15, 2016. Beginning in 2016, HBO began issuing Steelbook Blu-ray sets, which include both Dolby TrueHD 7.1 and Dolby Atmos audio options. In 2018, the first season was released in 4K HDR on Ultra HD Blu-ray. Blu-ray and DVD versions of the seventh season were released on December 12, 2017. The final season was released on DVD and Blu-ray on December 3, 2019. The home release also included behind-the-scenes footage and cast commentary. A box set containing all eight seasons, including a cast reunion hosted by Conan O'Brien, was released on DVD and Blu-ray on December 3, 2019, and was also released on 4K Ultra HD Blu-ray on November 3, 2020.\r\nIn August 2022, the complete series was released in 4K, Dolby Vision HDR and Dolby Atmos on HBO Max.\r\nCopyright infringement\r\nGame of Thrones has been widely pirated, primarily outside the US. According to the file-sharing news website TorrentFreak, it was the most pirated television series from 2012 to 2019 (except 2018, when no new episodes were broadcast), and Guinness World Records named it the most-pirated television program in 2015. Illegal downloads increased to about seven million in the first quarter of 2015, up 45 percent from 2014. An unnamed episode was downloaded about 4.28 million times through public BitTorrent trackers in 2012, roughly equal to its number of broadcast viewers. Piracy rates were particularly high in Australia prompting the US Ambassador to Australia, Jeff Bleich, to issue a statement in 2013 condemning the practice there. Delays in availability by non-HBO broadcasters before 2015 and the cost of subscriptions to their services have been cited as causes for the series's illegal distribution. According to TorrentFreak, a subscription to a service broadcasting Game of Thrones cost up to $25 per month in the United States, up to £26 per episode in the UK and up to $52 per episode in Australia.\r\nIn 2013, to combat unauthorized downloads, HBO said it intended to make its content more widely available within a week of the US premiere (including HBO Go). In 2015, the fifth season was simulcast to 170 countries and to HBO Now users. On April 11, the day before the season premiere, screener copies of the first four episodes of the fifth season leaked to a number of file-sharing websites. Within a day of the leak, the files were downloaded over 800,000 times; in one week the illegal downloads reached 32 million, with the season five premiere—\"The Wars to Come\"— pirated 13 million times. The season five finale (\"Mother's Mercy\") was the most simultaneously shared file in the history of the BitTorrent file sharing protocol, with over 250,000 sharers and over 1.5 million downloads in eight hours. HBO did not send screeners to the press for the sixth season to prevent the spread of unlicensed copies and spoilers. Season seven was either illegally streamed or downloaded over 1 billion times, with the season averaging 14.7 billion illegal views, and the season finale garnering over 120 million illegal views within its first 72 hours. According to anti-piracy company MUSO, the eighth season was illegally downloaded or viewed most in India and China. Illegal viewership for the final season was double the number of legal viewers, with 55 million illegal downloads for the season eight premiere \"Winterfell\", compared to 17.4 million who watched on HBO platforms.\r\nObservers, including series director David Petrarca and Time Warner CEO Jeff Bewkes, said that illegal downloads did not hurt the series's prospects; it benefited from \"buzz\" and social commentary, and the high piracy rate did not significantly translate into lost subscriptions. According to Polygon, HBO's relaxed attitude towards piracy and the sharing of login credentials amounted to a premium-television \"free-to-play\" model. At a 2015 Oxford Union panel discussion, series co-creator David Benioff said that he was just glad that people watched the series; illegally downloaded episodes sometimes interested viewers enough to buy a copy, especially in countries where Game of Thrones was not televised. Series co-creator D. B. Weiss had mixed feelings, saying that the series was expensive to produce and \"if it doesn't make the money back, then it ceases to exist\". However, he was pleased that so many people \"enjoy the show so much they can't wait to get their hands on it.\"\r\nReception\r\nCritical response\r\nGeneral\r\nGame of Thrones, particularly the first six seasons, received critical acclaim, although the series's frequent use of nudity and violence has been criticized. The series has an overall rating of 89 percent on Rotten Tomatoes and 86 on Metacritic. Some critics and publications have called the show among the best HBO series of all time. The series was highly anticipated by fans before its premiere. James Poniewozik said the pilot episode set \"a very large table\", while Ti Singh of Den of Geek said the show \"is here to stay\".\r\nFirst-season reviewers said the series had high production values, a fully realized world and compelling characters. According to Variety, \"There may be no show more profitable to its network than 'Game of Thrones' is to HBO. Fully produced by the pay cabler and already a global phenomenon after only one season, the fantasy skein was a gamble that has paid off handsomely.\" The second season was also well received. Entertainment Weekly praised its \"vivid, vital, and just plain fun\" storytelling and, according to The Hollywood Reporter, the series made a \"strong case for being one of TV's best series\"; its seriousness made it the only drama comparable to Mad Men or Breaking Bad.\r\nThe critical response for the middle seasons were also positive. Matt Fowler of IGN said the series was \"still quite marvelous\" praising the character development. TV Guide named the third season's penultimate episode \"The Rains of Castamere\" as number three on their 65 Best Episodes of the 21st Century. The critical acclaim continued into season four, with Darren Franich of Entertainment Weekly calling the season \" the height of the show's icon-generating powers\". The Independent stated that the show deviated significantly from the novels however the \"changes benefited the show and condensed the substantial source text admirably well\". The critical response to season five was again positive, however, some commentators criticized the sexual assault in the \"Unbowed, Unbent, Unbroken\" episode. Season six also received favorable reviews. Time criticized the repetitive story lines early in the season, however, its reviewer praised the \"Battle of the Bastards\" episode as \"one of the show's very best\". One reviewer also said there were \"more woman-friendly\" themes throughout the season, with another singling out Arya Stark's story arc.\r\nThe show's final two seasons, especially season eight, received more criticism. Season seven was praised for its action sequences and focused central characters, but received criticism for its pace and plot developments that were said to have \"defied logic\". Writing for Vox, Emily VanDerWerff cited the departure from the source material as a reason for the \"circular storytelling\". Critical reception for season eight was mixed. The Guardian said there was the \"rushed business\" of the plot which \"failed to do justice to its characters or its actors\". Writing for The Hollywood Reporter, Maureen Ryan condemned the season's reductive treatment of women, and \"decisions set up and executed with little or no foresight or thoughtfulness\", declaring the penultimate episode as \"Game of Thrones at its worst\". Fan reaction was mixed for the final season. A petition on Change.org started by some fans requested that the final season be remade with different writers. Casey Bloys, HBO's president of programming, said at a Television Critics Association event \"the petition shows a lot of enthusiasm and passion for the show but it wasn't something we seriously considered\". Despite the criticism of the writing, the music and visual effects were praised. In 2023, Game of Thrones was included on The Guardian's list of worst TV endings of all time.\r\nThe cast performances were praised throughout the show's run. Peter Dinklage's \"charming, morally ambiguous, and self-aware\" portrayal of Tyrion, which earned him Emmy and Golden Globe awards, was acclaimed. \"In many ways, Game of Thrones belongs to Dinklage\", wrote Mary McNamara of the Los Angeles Times before Tyrion became the series's central figure in season two. Several critics highlighted performances by actresses and children. Lena Headey's portrayal of the \"riveting\" Cersei Lannister also received praise. Maisie Williams was singled out as well and her season two work with veteran actor Charles Dance (Tywin Lannister). Stephen Dillane received positive reviews for his performance as Stannis Baratheon, especially in the fifth season, with one critic noting \"Whether you like Stannis or not, you have to admit that Stephen Dillane delivered a monumental performance this season.\" The series was also praised for the portrayal of handicapped and disabled characters. One commentator stated that Tyrion Lannister is a \"departure from the archetypal dwarf\" often found in other fantasy stories like The Lord of the Rings.\r\nDarren Franich of Entertainment Weekly gave the series a 'B' rating, saying that it was ultimately \"okay\". With both \"transcendent moments\" and \"miserable phases\", it was \"beloved enough to be criticized by everyone for something\". Franich described seasons three and four as \"relentless\", seasons six's ending having a \"killer one-two punch\", while seasons seven and eight were \"indifferent\". The New York Times gave the series a mixed review after the season three finale, criticizing the number of characters, their lack of complexity and a meandering plot. The show, however, appeared on many \"best of\" lists for the end of the 2010s. Alan Sepinwall, writing for Rolling Stone, placed the series on his \"50 Best TV Shows of the 2010s\" list, saying its \"ability to most of the time keep all of its disparate threads feeling vital and tied to one another, remains a staggering achievement\".\r\nConcerns over depiction of sex and violence\r\nDespite its otherwise enthusiastic reception by critics, Game of Thrones has been criticized for the amount of female nudity, violence, and sexual violence it depicts, and for the manner in which it depicts these themes. George R. R. Martin responded that he felt obliged to be truthful about history and human nature, and that rape and sexual violence are common in war; and that omitting them from the narrative would have rung false and undermined one of his novels' themes, its historical realism. HBO said that they \"fully support the vision and artistry of Dan and David's exceptional work and we feel this work speaks for itself\". The show has reportedly been censored or banned for sexual or violent content in countries like China, India, Iran, Jordan, Singapore, Turkey, United Arab Emirates, and Vietnam.\r\nThe amount of sex and nudity in the series, especially in scenes incidental to the plot, was the focus of much of the criticism aimed at it in its first and second seasons. Stephen Dillane, who portrays Stannis Baratheon, likened the series's frequent explicit scenes to \"German porn from the 1970s\". The series's use of \"sexposition\", plot delivery accompanied by sex or nudity, was criticized as distracting. Saturday Night Live parodied this aspect of the adaptation in a sketch that portrayed a 13-year-old boy as a Game of Thrones consultant, whose main concern was showing as many breasts as possible.\r\nThe episode \"The Bear and the Maiden Fair\" in the third season featured the lengthy torture and eventual emasculation of Theon Greyjoy, which prompted criticism. New York magazine called the scene \"torture porn\". According to one commentator, although the series' violence tended to serve a narrative purpose, Theon's torture in \"The Bear and the Maiden Fair\" was excessive as well. One commentator noted that Greyjoy's emasculation was one of the only sexual assault scenes where a male was the victim. A scene in the fourth season's episode \"Breaker of Chains\", in which Jaime Lannister rapes his sister and lover Cersei, triggered a broad public discussion about the series' depiction of sexual violence against women. According to Dave Itzkoff of The New York Times, the scene caused outrage, in part because of comments by director Alex Graves that the scene became \"consensual by the end\". Sonia Saraiya of The A.V. Club wrote that the series's choice to portray this sexual act, and a similar one between Daenerys Targaryen and Khal Drogo in the first season—both described as consensual in the source novels—as a rape appeared to be an act of \"exploitation for shock value\".\r\nIn the fifth season's episode \"Unbowed, Unbent, Unbroken\", Sansa Stark is raped by Ramsay Bolton. Most reviewers and publications found the scene gratuitous and artistically unnecessary. In response to the scene, pop culture website The Mary Sue announced that it would cease coverage of the series because of the repeated use of rape as a plot device, and US Senator Claire McCaskill said that she would no longer watch it. The episode was the lowest rated on Rotten Tomatoes until the season eight episode \"The Bells\". As the later seasons saw Daenerys, Sansa, and Cersei assume ruling positions, Alyssa Rosenberg of The Washington Post noted that the series could be seen as a \"long-arc revenge fantasy about what happens when women who have been brutalized and raped gain power\". Much of the criticism after the series finale was centered around the handling of the female character storylines. One commentator cited the male gaze as one of main sources of the \"romanticized female rape\" and general nudity throughout the series. Another commentator stated the use of both sex and violence helps perpetuate misogyny within the Game of Thrones universe.\r\nLighting\r\nThe lighting, or lack of light, in darker scenes has been a recurring point of criticism since season six of the series. In 2016, Bustle's Caitlyn Callegari listed 31 examples of scenes where the lighting caused viewers problems ranging from not being able to tell a character's hair color to being unable to see what was going on. Some reviewers have noted this is part of a wider trend among shows that are made by people who have experience working primarily on films, suggesting they \"haven't grasped the nuances (or lack thereof)\" of television as a medium, especially the differences between watching a scene on a television screen versus watching it on the big screen in a movie theater.\r\nIn a 2017 interview, Robert McLachlan, a cinematographer working on the show, explained the lack of lighting as an artistic choice saying \"we're trying to be as naturalistic as possible\". The criticism reached a high point during \"The Long Night\", the third episode of season eight. Barely minutes into the episode, viewers took to social media sites such as Twitter to express their discontent over the fact that they were having severe difficulties watching the battle and trying to figure out what was going on.\r\nCultural influence\r\nAlthough Game of Thrones was initially dismissed by some critics, its success has been credited with an increase in the fantasy genre's popularity. The series's popularity led to increased sales of the A Song of Ice and Fire novels (republished in tie-in editions), which remained at the top of bestseller lists for months. On the eve of the second season's premiere, CNN said, \"after this weekend, you may be hard pressed to find someone who isn't a fan of some form of epic fantasy\" and cited Ian Bogost as saying that the series continues a trend of successful screen adaptations beginning with Peter Jackson's The Lord of the Rings film trilogy (2001–2003) and the Harry Potter films (2001–2011) establishing fantasy as a mass-market genre; they are \"gateway drugs to fantasy fan culture\". The show's success led to the commissioning of several fantasy television series, including The Wheel of Time and The Lord of the Rings: The Rings of Power by Amazon Studios. According to Neil Gaiman, whose novels Good Omens and American Gods were adapted for television, Game of Thrones helped to change attitudes towards fantasy on television, but mainly it made big budgets for fantasy series more acceptable.\r\nThe success of the genre has been attributed by writers to a longing for escapism in popular culture, frequent female nudity and a skill in balancing lighthearted and serious topics (dragons and politics, for example) which provided it with a prestige enjoyed by conventional, top-tier drama series. According to The Daily Beast, Game of Thrones was a favorite of sitcom writers and the series has been referred to in other television series. With other fantasy series, it has been cited as a reason for an increase in the purchase (and abandonment) of huskies and other wolf-like dogs.\r\nGame of Thrones has added to the popular vocabulary. A first-season scene in which Petyr Baelish explains his motives (or background) while prostitutes have sex in the background gave rise to the word \"sexposition\" for providing exposition with sex and nudity. Dothraki, the series's nomadic horsemen, was ranked fourth in a September 2012 Global Language Monitor list of words from television most used on the internet. The series and its characters have also been referenced by politicians and academics to commentate on modern-day geopolitics, economic inequality, and climate change.\r\nIn 2019, singer-songwriter Taylor Swift told Entertainment Weekly that several songs on her 2017 album Reputation were inspired by Game of Thrones characters and plots. \"Khaleesi\" became more popular as a name for baby girls in the United States. In the novels and the TV series, \"khaleesi\" is not a name, but the title of the wife of a \"khal\" (warlord) in the Dothraki language, held by Daenerys Targaryen. Other names from characters in the series, like Daenerys, also became popular baby names.\r\nGame of Thrones has also become a subject of both academic and scientific inquiry. In 2016, researchers published a paper analyzing emotional sentiment in online public discourse associated with the unfolding storyline during the fourth season. The Mathematical Association of America published a journal in 2016 that applied the multidisciplinary field of network science to create a social network for the show's characters and their relationships. The analysis purported to be able to distinguish discussions about an episode's storyline from media critiques or assessments of a specific actor's performance. In 2018, Australian scientists conducted a survival analysis and examined the mortality among 330 important characters during the first seven seasons of Game of Thrones. In 2019, the Australian Red Cross conducted a study using international humanitarian law to determine which of the Game of Thrones' characters had committed the most war crimes during the first seven seasons of the show.\r\nAnimals have also been named after the show. Three species of mud dragons; Echinoderes daenerysae, Echinoderes rhaegal and Echinoderes drogoni, a bee fly; Paramonovius nightking, three species of scarab beetles; Gymnetis drogoni, Gymnetis rhaegali and Gymnetis viserioni, and a brittle star, Ophiohamus georgemartini, due to its sharp thorns resembling those depicted on the Game of Thrones crown.\r\nFandom\r\nA Song of Ice and Fire and Game of Thrones have a broad, active international fan base. In 2012 Vulture ranked the series's fans as the most devoted in popular culture, more so than those of Lady Gaga, Justin Bieber, Harry Potter or Star Wars. Fans include political leaders such as former US president Barack Obama, former British prime minister David Cameron, former Australian prime minister Julia Gillard and Dutch foreign minister Frans Timmermans, who framed European politics using quotes from Martin's novels in a 2013 speech.\r\nBBC News said in 2013 that \"the passion and the extreme devotion of fans\" had created a phenomenon, unlike anything related to other popular TV series, manifesting itself in fan fiction, Game of Thrones-themed burlesque routines and parents naming their children after series characters; writers quoted attributed this success to the rich detail, moral ambiguity, sexual explicitness and epic scale of the series and novels. The previous year, \"Arya\" was the fastest-rising girl's name in the US after it had jumped in popularity from 711th to 413th place.\r\nAs of 2013, about 58 percent of series viewers were male and 42 percent female, and the average male viewer was 41 years old. According to SBS Broadcasting Group marketing director Helen Kellie, Game of Thrones has a high fan-engagement rate; 5.5 percent of the series's 2.9 million Facebook fans talked online about the series in 2012, compared to 1.8 percent of the over ten million fans of True Blood (HBO's other fantasy series). Vulture.com cited Westeros.org and WinterIsComing.net (news and discussion forums), ToweroftheHand.com (which organizes communal readings of the novels) and Podcastoficeandfire.com as fan sites dedicated to the TV and novel series; and podcasts cover Game of Thrones.\r\nAwards\r\nGame of Thrones has won numerous awards throughout its run, including 59 Emmy Awards, eight Screen Actors Guild Awards and a Peabody Award. It holds the record for total Emmy Award wins for a scripted television series (surpassing the record of 37 wins held by Frasier since 2004) and for most Emmy nominations for a drama series, with 161. In 2019, the show's final season established a new record for most Emmy nominations received in a year with 32, breaking the 25-year-long record of 26 nominations established by NYPD Blue in 1994. In 2013, the Writers Guild of America listed Game of Thrones as the 40th best written series in television history. In 2015, The Hollywood Reporter placed it at number four on their best TV shows ever list, while in 2016 the series was placed seventh on Empire's \"The 50 best TV shows ever\". The same year, Rolling Stone named it the twelfth \"greatest TV Show of all time\". In 2013, at the Media Access Awards, George R. R. Martin accepted the Visionary Award from the Writers With Disabilities committee of the Writers Guild of America, for its positive portrayal of character with disabilities.\r\nViewership\r\nGame of Thrones was considered a ratings success for HBO throughout all eight seasons. The show premiere was watched by 2.2 million, and the first season averaged 2.5 million viewers per episode. For its second season, the series had an average gross audience of 11.6 million viewers. The third season was seen by 14.2 million viewers, making Game of Thrones the second-most-viewed HBO series (after The Sopranos). HBO said that Game of Thrones' average gross audience of 18.4 million viewers (later adjusted to 18.6 million) had passed The Sopranos for the viewership record. The season five episode \"The House of Black and White\" was simulcasted in 173 countries, becoming the \"largest TV drama telecast\" according to Guinness World Records.\r\nBy the sixth season the average per-episode gross viewing figure had increased to over 25 million, with nearly 40 percent of viewers watching on HBO digital platforms. In 2016, a New York Times study of the 50 TV shows with the most Facebook likes found that Game of Thrones was \"much more popular in cities than in the countryside, probably the only show involving zombies that is\". By season seven, the average viewer numbers had grown to 32.8 million per episode across all platforms. The series finale was viewed by 19.3 million people across HBO's platforms, becoming the network's most watched episode. The lead-out show also benefited from the finale's record viewership.\r\nGame of Thrones also set viewership records outside the United States on pay-television channels in the United Kingdom (with a 2016 average audience of more than five million on all platforms) and Australia (with a cumulative average audience of 1.2 million). Video streaming research company Parrot Analytics stated that after the US, the season eight premiere demand was \"particularly strong in the United Kingdom and France\". Nielsen Media Research noted the show was popular among 18 to 49 key demographic with strong female viewership for a fantasy series. The show also benefited from time shifting viewership. Between season one and season seven, 7-day viewers, the number of both DVR and video on demand views during the week after the episode broadcast, grew from 3.3 million to 13.7 million. Following the show finale, commentators said many viewers might cancel their premium television and streaming subscriptions. HBO parent company WarnerMedia reported that subscription revenue declined only 0.9 percent between April and June 2019.\r\nOther media\r\nVideo games\r\nThe series and the novels have inspired several video games.\r\nMerchandise and exhibition\r\nHBO has licensed a variety of merchandise based on Game of Thrones, including games, replica weapons and armor, jewelry, bobblehead dolls by Funko, beer by Ommegang and apparel. High-end merchandise includes a $10,500 Ulysse Nardin wristwatch and a $30,000 resin replica of the Iron Throne. In 2013 and 2014, a traveling exhibition of costumes, props, armor and weapons from the series visited major cities in Europe and the Americas. Starting 2018, Diageo released several Game of Thrones themed whiskies.\r\nRelated shows\r\nThronecast\r\nThronecast: The Official Guide to Game of Thrones, a series of podcasts presented by Geoff Lloyd and produced by Koink, were released on the Sky Atlantic website and the UK iTunes store during the series's run; a new podcast, with analysis and cast interviews, was released after each episode. In 2014 and 2015, HBO commissioned Catch the Throne, two rap albums about the series. A companion book, Inside HBO's Game of Thrones by series writer Bryan Cogman, was published on September 27, 2012. The 192-page book, illustrated with concept art and behind-the-scenes photographs, covers the creation of the series's first two seasons and its principal characters and families.\r\nAfter the Thrones\r\nAfter the Thrones was a live aftershow during which hosts Andy Greenwald and Chris Ryan discussed episodes of the series. It aired on HBO Now, the Monday following each season six episode. The Game of Thrones Live Concert Experience, a North American 28-city orchestral tour which performed the series's soundtrack with composer Ramin Djawadi, began in February 2017 and concluded in April 2017. A second tour followed in 2018 across cities in Europe and North America.\r\nHome media extras\r\nEach season's Blu-ray and DVD set contains several short still motion animated sequences titled Histories and Lore, narrated by the cast, in character, as they detail events in the history of Westeros. For the seventh season, this was to include the animated prequel series Game of Thrones: Conquest & Rebellion, illustrated in a different animation style than previous videos. The series focuses on Aegon Targaryen's conquest of the Seven Kingdoms of Westeros. A week after the series finale, HBO released a behind-the-scenes documentary entitled Game of Thrones: The Last Watch. The program documented the production of season 8 along with read-throughs and interviews with the cast.\r\nSuccessors\r\nIn May 2017, after years of speculation about possible successor series, HBO commissioned Max Borenstein, Jane Goldman, Brian Helgeland, Carly Wray, and Bryan Cogman to develop five individual Game of Thrones successor series; the writers were to be working individually with George R. R. Martin, who also co-wrote two of the scripts. D. B. Weiss and David Benioff said that they would not be involved with any of the projects.\r\nMartin said that all the concepts under discussion were prequels, although he believes the term \"successor show\" applies better to these projects, as they are not Game of Thrones spin-offs in the traditional sense. He ruled out Robert's Rebellion (the overthrow of Daenerys's father by Robert Baratheon) as a possible idea and revealed that some may be set outside Westeros. In September 2018, speaking about the four projects (i.e. not about the Goldman's project), HBO president of programming Casey Bloys said that some of them had been abandoned completely, while others remained as possibilities for the future; Martin said that: \"at least two of them are solidly based on material in Fire and Blood\". In May 2019, Martin stated that two of the projects were still in the script stage, but were \"edging closer\". In April 2019, Cogman confirmed his prequel would not be moving forward.\r\nIn January 2021, it was revealed that HBO were developing another prequel series to be based on Martin's novella series Tales of Dunk and Egg. Steve Conrad was attached as writer and executive producer of the Tales of Dunk and Egg series in November 2021. In March 2021, it was reported that three additional Game of Thrones spin-offs were in development at HBO; they include 10,000 Ships, a reference to the voyages made by warrior queen Princess Nymeria, who later founds Dorne; 9 Voyages, about the voyages of Corlys Velaryon on the Sea Snake; and a project based on Flea Bottom, the poorest slum in King's Landing.\r\nIn June 2022, it was reported that a Jon Snow sequel series with Kit Harington to reprise his role was in early development at HBO. The working title is Snow and Martin confirmed his involvement with the project and that Harington initiated the idea. Also in June, Martin said there were still three other live-action series in development: 10,000 Ships (written by Amanda Segal), 9 Voyages aka Sea Snake (written by Bruno Heller), and the Dunk & Egg prequel series (written by Steven Conrad), tentatively titled either The Hedge Knight or Knight of the Seven Kingdoms.\r\nBloodmoon\r\nOn June 8, 2018, HBO commissioned a pilot to a Game of Thrones prequel series from Goldman as showrunner and Martin as co-creator. The prequel was to take place in the Age of Heroes, a period that begins roughly 10,000 years before the events of Game of Thrones. Notable events of that period include the foundation of powerful Houses, the Long Night when the White Walkers first descended upon Westeros, and the Andal Invasion when the Andals invaded from Essos and conquered most of Westeros. Martin suggested The Long Night as a title for the series. S. J. Clarkson was announced to direct and executive produce the pilot, while Naomi Watts was cast as the female lead playing \"a charismatic socialite hiding a dark secret\". Other series regulars were to include: Josh Whitehouse, Toby Regbo, Ivanno Jeremiah, Georgie Henley, Naomi Ackie, Denise Gough, Jamie Campbell Bower, Sheila Atim, Alex Sharp, Miranda Richardson, Marquis Rodriguez, John Simm, Richard McCabe, John Heffernan, and Dixie Egerickx. In September 2019, Martin claimed the pilot was in post-production but in October 2019, it was announced that HBO had decided not to move forward with the series.\r\nHouse of the Dragon\r\nIn September 2019, Deadline Hollywood reported that a second prequel from Martin and Ryan Condal that \"tracks the beginning of the end for House Targaryen\" was close to receiving a pilot order from HBO; the project is not considered an original sixth script, as it builds upon Cogman's idea from 2017. This prequel, titled House of the Dragon, was commissioned as a complete series on October 29, 2019. The 10-episode series is to be based on material from Fire and Blood, executive produced by Martin, Vince Gerardis, Condal, and Miguel Sapochnik; the latter two are to be its showrunners as well. In January 2020, HBO stated that the series is scheduled for a 2022 release and that the writing process has begun. Casting for the series started in July 2020. In October 2020, it was revealed that Paddy Considine was cast as King Viserys I Targaryen. In December 2020, three more castings were announced: Olivia Cooke as Alicent Hightower, Emma D'Arcy as Rhaenyra Targaryen, and Matt Smith as Daemon Targaryen. In February 2021, HBO chief content officer Casey Bloys stated that the show would start production in April, with filming occurring in England. In February 2021, Steve Toussaint, Eve Best, Rhys Ifans, and Sonoya Mizuno were confirmed to also be starring in the series. In March 2022, HBO announced a series premiere date of August 21, 2022, followed by the release of the official teaser trailer.\r\nAnimated series\r\nIn January 2021, an adult animated drama series was announced to be in development at HBO Max. In July 2021, two more animated series were in development at HBO Max, with one being set in Yi Ti, a nation in Essos loosely based on Imperial China. The series' working title is The Golden Empire.",
    "html": "<p>Game of Thrones is an American fantasy drama television series created by David Benioff and D. B. Weiss for HBO. It is an adaptation of A Song of Ice and Fire, a series of fantasy novels by George R. R. Martin, the first of which is A Game of Thrones. The show was shot in the United Kingdom, Canada, Croatia, Iceland, Malta, Morocco, and Spain. It premiered on HBO in the United States on April 17, 2011, and concluded on May 19, 2019, with 73 episodes broadcast over eight seasons.</p><p>Set on the fictional continents of Westeros and Essos, Game of Thrones has a large ensemble cast and follows several story arcs throughout the course of the show. The first major arc concerns the Iron Throne of the Seven Kingdoms of Westeros through a web of political conflicts among the noble families either vying to claim the throne or fighting for independence from whoever sits on it. The second focuses on the last descendant of the realm's deposed ruling dynasty, who has been exiled to Essos and is plotting to return and reclaim the throne. The third follows the Night's Watch, a military order defending the realm against threats from beyond Westeros's northern border.</p><p>Game of Thrones attracted a record viewership on HBO and has a broad, active, and international fan base. Critics have praised the series for its acting, complex characters, story, scope, and production values, although its frequent use of nudity and violence (including sexual violence) has been subject to criticism. The final season received significant critical backlash for its reduced length and creative decisions, with many considering it a disappointing conclusion. The series received 59 Primetime Emmy Awards, the most by a drama series, including Outstanding Drama Series in 2015, 2016, 2018 and 2019. Its other awards and nominations include three Hugo Awards for Best Dramatic Presentation, a Peabody Award, and five nominations for the Golden Globe Award for Best Television Series – Drama.</p><p>A prequel series, House of the Dragon, premiered on HBO in 2022.</p><br/><h3>Premise</h3><h4>Plot</h4><p>Game of Thrones is roughly based on the storylines of the A Song of Ice and Fire book series by George R. R. Martin, set in the fictional Seven Kingdoms of Westeros and the continent of Essos. The series follows several simultaneous plot lines. The first story arc follows a war of succession among competing claimants for control of the Iron Throne of the Seven Kingdoms, with other noble families fighting for independence from the throne. The second concerns the exiled scion's actions to reclaim the throne; the third chronicles the threat of the impending winter, as well as the legendary creatures and fierce peoples of the North.</p><h4>Cast and characters</h4><p>Game of Thrones has an ensemble cast which has been estimated to be the largest on television. In 2014, several actors' contracts were renegotiated to include a seventh-season option. By the final season, five of the main cast members made $1 million per episode, making them among the highest paid television performers.</p><p>Eddard \"Ned\" Stark (Sean Bean) is the head of House Stark. He and his wife, Catelyn (Michelle Fairley), have five children: Robb (Richard Madden), Sansa (Sophie Turner), Arya (Maisie Williams), Bran (Isaac Hempstead-Wright), and Rickon (Art Parkinson). Ned also has an illegitimate son, Jon Snow (Kit Harington), who, along with his scholarly friend, Samwell Tarly (John Bradley), serve in the Night's Watch under Lord Commander Jeor Mormont (James Cosmo). The Wildlings living north of the Wall include the young Gilly (Hannah Murray) and the warriors Tormund Giantsbane (Kristofer Hivju) and Ygritte (Rose Leslie).</p><p>Others associated with House Stark include Ned's ward Theon Greyjoy (Alfie Allen), Ned's vassal Roose Bolton (Michael McElhatton), and Roose's illegitimate son, Ramsay (Iwan Rheon). Robb accepts help from the healer Talisa Maegyr (Oona Chaplin), while elsewhere, Arya befriends the blacksmith's apprentice Gendry Rivers (Joe Dempsie) and the assassin Jaqen H'ghar (Tom Wlaschiha). In the Stormlands, the tall warrior Brienne of Tarth (Gwendoline Christie) serves on the Rainbow Guard.</p><p>In King's Landing, Ned's old friend, King Robert I Baratheon (Mark Addy), shares a loveless political marriage with Cersei Lannister (Lena Headey). Her younger twin brother, Ser Jamie (Nikolaj Coster-Waldau), serves on the Kingsguard. The third and youngest Lannister sibling is the dwarf Tyrion (Peter Dinklage), who is attended by his mistress Shae (Sibel Kekilli) and the sellsword Bronn (Jerome Flynn). Cersei's father is Tywin (Charles Dance), head of House Lannister and richest man in Westeros. Cersei has two sons: Joffrey (Jack Gleeson) and Tommen (Dean-Charles Chapman). Joffrey is guarded by the scar-faced warrior Sandor \"The Hound\" Clegane (Rory McCann).</p><p>The king's Small Council of advisors includes, among others, the crafty Master of Coin, Lord Petyr \"Littlefinger\" Baelish (Aidan Gillen), and the eunuch spymaster, Lord Varys (Conleth Hill). In Dragonstone, Robert's younger brother, Stannis (Stephen Dillane), is advised by the foreign priestess Melisandre (Carice van Houten) and former smuggler Ser Davos Seaworth (Liam Cunningham). In the Reach, the Tyrell family, led by its matriarch Olenna (Diana Rigg), is represented at court by Margaery (Natalie Dormer), the matriarch's granddaughter. The High Sparrow (Jonathan Pryce) is eventually given power as a religious leader. In the southern principality of Dorne, the warrior Ellaria Sand (Indira Varma) seeks vengeance against the Lannisters.</p><p>Across the Narrow Sea, in Pentos, siblings Viserys Targaryen (Harry Lloyd) and Daenerys Targaryen (Emilia Clarke) (colloquially referred to as \"Dany\") are in exile, with the former plotting to reclaim his father's throne. Daenerys is forced into marrying Khal Drogo (Jason Momoa), a leader of the nomadic Dothraki. Her retinue eventually comes to include the exiled knight Ser Jorah Mormont (Iain Glen), her aide Missandei (Nathalie Emmanuel), the sellsword Daario Naharis (Michiel Huisman), and the elite soldier Grey Worm (Jacob Anderson).</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><b>Main cast and characters</b></caption><tbody><tr><td><ul class=\"gallery mw-gallery-packed\" style=\"line-height:130%\"><li class=\"gallerybox\" style=\"width: 117.33333333333px\"><div style=\"width: 117.33333333333px\">\t\t\t<div class=\"thumb\" style=\"width: 115.33333333333px;\"><div style=\"margin:0px auto;\"></div></div>\t\t\t<div class=\"gallerytext\"><p><span>Peter Dinklage</span> (<span>Tyrion Lannister</span>)</p>\t\t\t</div>\t\t</div></li>\t\t<li class=\"gallerybox\" style=\"width: 91.333333333333px\"><div style=\"width: 91.333333333333px\">\t\t\t<div class=\"thumb\" style=\"width: 89.333333333333px;\"><div style=\"margin:0px auto;\"></div></div>\t\t\t<div class=\"gallerytext\"><p><span>Lena Headey</span> (<span>Cersei Lannister</span>)</p>\t\t\t</div>\t\t</div></li>\t\t<li class=\"gallerybox\" style=\"width: 98.666666666667px\"><div style=\"width: 98.666666666667px\">\t\t\t<div class=\"thumb\" style=\"width: 96.666666666667px;\"><div style=\"margin:0px auto;\"></div></div>\t\t\t<div class=\"gallerytext\"><p><span>Nikolaj Coster-Waldau</span> (Ser <span>Jaime Lannister</span>)</p>\t\t\t</div>\t\t</div></li>\t\t<li class=\"gallerybox\" style=\"width: 101.33333333333px\"><div style=\"width: 101.33333333333px\">\t\t\t<div class=\"thumb\" style=\"width: 99.333333333333px;\"><div style=\"margin:0px auto;\"></div></div>\t\t\t<div class=\"gallerytext\"><p><span>Emilia Clarke</span> (<span>Daenerys Targaryen</span>)</p>\t\t\t</div>\t\t</div></li>\t\t<li class=\"gallerybox\" style=\"width: 95.333333333333px\"><div style=\"width: 95.333333333333px\">\t\t\t<div class=\"thumb\" style=\"width: 93.333333333333px;\"><div style=\"margin:0px auto;\"></div></div>\t\t\t<div class=\"gallerytext\"><p><span>Kit Harington</span> (<span>Jon Snow</span>)</p>\t\t\t</div>\t\t</div></li>\t\t<li class=\"gallerybox\" style=\"width: 94.666666666667px\"><div style=\"width: 94.666666666667px\">\t\t\t<div class=\"thumb\" style=\"width: 92.666666666667px;\"><div style=\"margin:0px auto;\"></div></div>\t\t\t<div class=\"gallerytext\"><p><span>Sophie Turner</span> (<span>Sansa Stark</span>)</p>\t\t\t</div>\t\t</div></li>\t\t<li class=\"gallerybox\" style=\"width: 99.333333333333px\"><div style=\"width: 99.333333333333px\">\t\t\t<div class=\"thumb\" style=\"width: 97.333333333333px;\"><div style=\"margin:0px auto;\"></div></div>\t\t\t<div class=\"gallerytext\"><p><span>Maisie Williams</span> (<span>Arya Stark</span>)</p>\t\t\t</div>\t\t</div></li>\t\t<li class=\"gallerybox\" style=\"width: 130px\"><div style=\"width: 130px\">\t\t\t<div class=\"thumb\" style=\"width: 128px;\"><div style=\"margin:0px auto;\"></div></div>\t\t\t<div class=\"gallerytext\"><p><span>Iain Glen</span> (Ser <span>Jorah Mormont</span>)</p>\t\t\t</div>\t\t</div></li>\t\t<li class=\"gallerybox\" style=\"width: 98.666666666667px\"><div style=\"width: 98.666666666667px\">\t\t\t<div class=\"thumb\" style=\"width: 96.666666666667px;\"><div style=\"margin:0px auto;\"></div></div>\t\t\t<div class=\"gallerytext\"><p><span>Alfie Allen</span> (<span>Theon Greyjoy</span>)</p>\t\t\t</div>\t\t</div></li></ul></td></tr><tr><td style=\"text-align:left\"></td></tr></tbody></table><h4>Themes</h4><p>The series has been praised by both television critics and historians for what was perceived as a sort of medieval realism. George R. R. Martin set out to make the story feel more like historical fiction than contemporary fantasy, with less emphasis on magic and sorcery and more on battles, political intrigue, and the characters, believing that magic should be used moderately in the epic fantasy genre. Martin has said that, \"the true horrors of human history derive not from orcs and Dark Lords, but from ourselves\". Academics have classified the series as neo-medieval which focuses on the overlapping of medieval history and popular fantasy. A common theme in the fantasy genre is the battle between good and evil, which Martin says does not mirror the real world. Martin explores the relationship between good and evil through the questions of redemption and character change. The series allows the audience to view different characters from their perspective, unlike in many other fantasies.</p><p>In early seasons, under the influence of the A Song of Ice and Fire books, main characters were regularly killed off, and this was credited with developing tension among viewers. Martin stated in an interview that he wanted to depict war and violence in a realistic way, which sometimes mean the hero or main characters could be injured or killed. In later seasons, critics pointed out that certain characters had developed \"plot armor\" to survive in unlikely circumstances and attributed this to Game of Thrones deviating from the novels to become more of a traditional television series. In a 2012 study, out of 40 recent television drama shows, Game of Thrones ranked second in deaths per episode, averaging 14. A scientific study conducted in 2018 stated that about 60% of the major characters died as a result of violence and war.</p><h4>Inspirations and derivations</h4><p>Although the series's first season closely follows the events of the first novel, there were significant changes made for later seasons. According to Benioff, the TV adaptation is \"about adapting the series as a whole and following the map George laid out for us and hitting the major milestones, but not necessarily each of the stops along the way\". Aspects of the novels' plots and their adaptations are based upon settings, characters, and events in European history. Most of Westeros is reminiscent of high medieval Europe, from its geography and castles to its cultures, the feudal system, palace intrigues, and the knights' tournaments. Like medieval Europe, most of the houses in the series use the patriarchal system of power. The series also includes elements of gothic fiction, including torture tropes.</p><p>A principal inspiration for the novels is the English Wars of the Roses (1455–1485) between the houses of Lancaster and York, reflected in Martin's houses of Lannister and Stark. The scheming Cersei Lannister evokes Isabella, the \"She-Wolf of France\" (1295–1358). She and her family, as portrayed in Maurice Druon's historical novel series, The Accursed Kings, were a main inspiration of Martin's. Other historical antecedents of series elements include: Hadrian's Wall (which becomes Martin's Wall), the Roman Empire, and the legend of Atlantis (ancient Valyria), Byzantine Greek fire (\"wildfire\"), Icelandic sagas of the Viking Age (the Ironborn), the Mongol hordes (the Dothraki), the Hundred Years' War, and the Italian Renaissance. The series's popularity has been attributed, in part, to Martin's skill at fusing these elements into a seamless, credible version of alternate history.</p><br/><h3>Production</h3><h4>Conception and development</h4><p>The A Song of Ice and Fire series of novels was popular before Game of Thrones. The series has sold more than 90 million copies worldwide with the novels being translated into 45 different languages. George R. R. Martin received multiple fantasy writing awards and nominations, including a World Fantasy Award and multiple Locus Awards, for the series. Writing for Time magazine in 2005 after the release of A Feast for Crows, journalist Lev Grossman called Martin the \"American Tolkien\", stating he is a \"major force for evolution in fantasy\".</p><p>In January 2006, David Benioff had a telephone conversation with Martin's literary agent about the books he represented. Having been a fan of fantasy fiction when he was younger, he became interested in A Song of Ice and Fire, which he had not read. The literary agent sent Benioff the series's first four books. Benioff read a few hundred pages of the first novel, A Game of Thrones, shared his enthusiasm with D. B. Weiss, and suggested that they adapt Martin's novels into a television series; Weiss finished the first novel in \"maybe 36 hours\". They pitched the series to HBO after a five-hour meeting with Martin (himself a veteran screenwriter) in a restaurant on Santa Monica Boulevard. According to Benioff, they won Martin over by knowing the answer to his question, \"Who is Jon Snow's mother?\"</p><blockquote>I had worked in Hollywood myself for about 10 years, from the late '80s to the '90s. I'd been on the staff of The Twilight Zone and Beauty and the Beast. All of my first drafts tended to be too big or too expensive. I always hated the process of having to cut. I said, 'I'm sick of this, I'm going to write something that's as big as I want it to be, and it's going to have a cast of characters that go into the thousands, and I'm going to have huge castles, and battles, and dragons.</blockquote><p>—George R. R. Martin, author</p><p>Before being approached by Benioff and Weiss, Martin had had meetings with other scriptwriters, most of whom wanted to adapt the series as a feature film. Martin, however, deemed it \"unfilmable\", saying that the size of one of his novels is as long as The Lord of the Rings, which had been adapted as three feature films. Benioff agreed it would be impossible to turn the novels into a feature film as their scale is too big for a feature film, and dozens of characters would have to be discarded. Benioff added, \"a fantasy movie of this scope, financed by a major studio, would almost certainly need a PG-13 rating. That means no sex, no blood, no profanity. Fuck that.\" Martin was pleased with the suggestion that they adapt it as an HBO series, saying that he \"never imagined it anywhere else\".</p><p>The series began development in January 2007. HBO acquired the television rights to the novels, with Benioff and Weiss as the series' executive producers and Martin as a co-executive producer. The intention was for each novel to yield a season's worth of episodes. Initially, Martin would write one episode per season while Benioff and Weiss would write the rest. Jane Espenson and Bryan Cogman were added later to write one episode each for the first season. The first and second drafts of the pilot script by Benioff and Weiss were submitted in August 2007 and June 2008, respectively. Although HBO liked both drafts, a pilot was not ordered until November 2008. The pilot episode, \"Winter Is Coming\", was shot in 2009; after its poor reception following a private viewing, HBO demanded an extensive re-shoot (about 90 percent of the episode, with cast and directorial changes). The pilot reportedly cost HBO $5–10 million to produce, while the first season's budget was estimated at $50–60 million. For the second season, the series received a 15-percent budget increase for the climactic battle in \"Blackwater\" (which had an $8 million budget). Between 2012 and 2015, the average budget per episode increased from $6 million to \"at least\" $8 million. The sixth-season budget was over $10 million per episode, for a season total of over $100 million, a record for a series's production cost. By the final season, the production budget per episode was estimated to be $15 million.</p><h4>Casting</h4><p>Nina Gold and Robert Sterne were the series' primary casting directors. Through a process of auditions and readings, the main cast was assembled. The only exceptions were Peter Dinklage and Sean Bean, whom the writers wanted from the start; they were announced as joining the pilot in 2009. Other actors signed for the pilot were Kit Harington as Jon Snow, Jack Gleeson as Joffrey Baratheon, Harry Lloyd as Viserys Targaryen, and Mark Addy as Robert Baratheon. According to Benioff and Weiss, Addy was the easiest actor to cast for the series because of his audition performance. Some characters in the pilot were recast for the first season. The role of Catelyn Stark was played initially by Jennifer Ehle, but the role was recast with Michelle Fairley. The character of Daenerys Targaryen was also recast, with Emilia Clarke replacing Tamzin Merchant. The rest of the first season's cast was selected in the second half of 2009.</p><p>Although many of the cast returned after the first season, the producers had many new characters to cast in each of the following seasons. Because of the large number of new characters, Benioff and Weiss postponed introducing several key characters in the second season and merged several characters into one, or assigned plot functions to different characters. Some recurring characters were recast over the years; for example, Gregor Clegane was played by three different actors, while Dean-Charles Chapman played both Tommen Baratheon and a minor Lannister character.</p><h4>Writing</h4><p>Game of Thrones used seven writers over its six seasons. Benioff and Weiss wrote most of each season's episodes. A Song of Ice and Fire author George R. R. Martin wrote one episode in each of the first four seasons. Martin did not write an episode for the later seasons, since he wanted to focus on completing the sixth novel (The Winds of Winter). Jane Espenson co-wrote one first-season episode as a freelance writer.</p><p>Cogman, initially a script coordinator for the series, was promoted to producer for the fifth season. Cogman, who wrote at least one episode for the first five seasons, was the only other writer in the writers' room with Benioff and Weiss. Before Cogman's promotion, Vanessa Taylor—a writer during the second and third seasons—worked closely with Benioff and Weiss. Dave Hill joined the writing staff for the fifth season after working as an assistant to Benioff and Weiss. Although Martin was not in the writers' room, he read the script outlines and made comments.</p><p>Benioff and Weiss sometimes assigned characters to particular writers; for example, Cogman was assigned to Arya Stark for the fourth season. The writers spent several weeks writing a character outline, including what material from the novels to use and the overarching themes. After these individual outlines were completed, they spent another two to three weeks discussing each main character's individual arc and arranging them episode by episode. A detailed outline was created, with each of the writers working on part of it to create a script for each episode. Cogman, who wrote two episodes for the fifth season, took a month and a half to complete both scripts. They were then read by Benioff and Weiss, who made notes, and parts of the script were rewritten. All ten episodes were written before filming began since they were shot out of order by two units in different countries. Benioff and Weiss wrote their episodes together; one wrote the first half of the script with the other writing the second half. They then passed the drafts back and forth to make notes and do rewrites.</p><h4>Adaptation schedule and episodes</h4><p>After Game of Thrones story line began outpacing the published novels in the sixth season, the series was based on a plot outline of the future novels provided by Martin along with original content. Before season four, Martin stated there was an issue with the television series being released before the source material could be written. According to Benioff, Martin gave the showrunners an outline on the final two books of the series. In April 2016, the showrunners' plan was to shoot 13 more episodes after the sixth season: seven episodes in the seventh season and six episodes in the eighth. Later that month, the series was renewed for a seventh season with a seven-episode order. HBO announced in June 2016 that the eighth season would be the final for the series.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>Game of Thrones</i> adaptation and season schedule</caption><tbody><tr><th scope=\"col\">Season</th><th scope=\"col\">Ordered</th><th scope=\"col\">Filming</th><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th><th scope=\"col\">Novel(s) adapted</th><th scope=\"col\"><abbr title=\"Reference(s)\">Ref(s)</abbr></th></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>Season 1</span></th><td>March 2, 2010</td><td>Second half of 2010</td><td>April 17, 2011</td><td>June 19, 2011</td><td><i><span>A Game of Thrones</span></i></td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>Season 2</span></th><td>April 19, 2011</td><td>Second half of 2011</td><td>April 1, 2012</td><td>June 3, 2012</td><td><i><span>A Clash of Kings</span></i></td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>Season 3</span></th><td>April 10, 2012</td><td>July–November 2012</td><td>March 31, 2013</td><td>June 9, 2013</td><td><i><span>A Storm of Swords</span></i></td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>Season 4</span></th><td>April 2, 2013</td><td>July–November 2013</td><td>April 6, 2014</td><td>June 15, 2014</td><td><i>A Storm of Swords</i></td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>Season 5</span></th><td>April 8, 2014</td><td>July–December 2014</td><td>April 12, 2015</td><td>June 14, 2015</td><td><i><span>A Feast for Crows</span></i>, <i><span>A Dance with Dragons</span></i> and original content</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>Season 6</span></th><td>April 8, 2014</td><td>July–December 2015</td><td>April 24, 2016</td><td>June 26, 2016</td><td>Outline from <i><span>The Winds of Winter</span></i> and original content</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>Season 7</span></th><td>April 21, 2016</td><td>August 2016–February 2017</td><td>July 16, 2017</td><td>August 27, 2017</td><td rowspan=\"2\">Outline from <i><span class=\"mw-redirect\">A Dream of Spring</span></i> and original content</td><td style=\"text-align:center;\"></td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>Season 8</span></th><td>July 30, 2016</td><td>October 2017–July 2018</td><td>April 14, 2019</td><td>May 19, 2019</td><td style=\"text-align:center;\"></td></tr></tbody></table><p>The first two seasons adapted one novel each. For the later seasons, its creators saw Game of Thrones as an adaptation of A Song of Ice and Fire as a whole rather than the individual novels, enabling them to move events across novels as the screen adaptation required.</p><h4>Filming</h4><p>Principal photography for the first season was scheduled to begin on July 26, 2010; the primary location was the Paint Hall Studios in Belfast, Northern Ireland. Exterior scenes in Northern Ireland were filmed at Sandy Brae in the Mourne Mountains (standing in for Vaes Dothrak); Castle Ward (Winterfell); Saintfield Estates (the Winterfell godswood); Tollymore Forest (outdoor scenes); Cairncastle (the execution site); the Magheramorne quarry (Castle Black); and Shane's Castle (the tourney grounds). Doune Castle in Stirling, Scotland, was also used in the original pilot episode for scenes at Winterfell. The producers initially considered filming the entire series in Scotland, but decided on Northern Ireland because of the availability of studio space and tax credits.</p><p>The first season's southern scenes were filmed in Malta, a change in location from the pilot episode's Moroccan sets. The city of Mdina was used for King's Landing. Filming also took place at Fort Manoel (representing the Sept of Baelor); at the Azure Window on the island of Gozo (the Dothraki wedding site); and at San Anton Palace, Fort Ricasoli, Fort St. Angelo and St. Dominic monastery (all used for scenes in the Red Keep). Filming of the second season's southern scenes shifted from Malta to Croatia, where the city of Dubrovnik and nearby locations allowed exterior shots of a walled, coastal medieval city. The Walls of Dubrovnik and Fort Lovrijenac were used for scenes in King's Landing, though exteriors of some local buildings in the series, for example, the Red Keep and the Sept of Baelor, are computer generated. The island of Lokrum, the St. Dominic monastery in the coastal town of Trogir, the Rector's Palace in Dubrovnik, and the Dubac quarry (a few kilometers east) were used for scenes set in Qarth. Scenes set north of the Wall, in the Frostfangs, and at the Fist of the First Men, were filmed in November 2011 in Iceland on the Vatnajökull glacier near Smyrlabjörg, the Svínafellsjökull glacier near Skaftafell, and the Mýrdalsjökull glacier near Vik on Höfðabrekkuheiði. Filming also occurred at the harbor in Ballintoy, Northern Ireland.</p><p>Third-season production returned to Dubrovnik, with the Walls of Dubrovnik, Fort Lovrijenac, and nearby locations again used for scenes in King's Landing and the Red Keep. Trsteno Arboretum, a new location, is the garden of the Tyrells in King's Landing. The third season also returned to Morocco (including the city of Essaouira) to film Daenerys's scenes in Essos. Dimmuborgir and the Grjótagjá cave in Iceland were used as well. One scene, with a live bear, was filmed in Los Angeles. The production used three units (Dragon, Wolf and Raven) filming in parallel, six directing teams, 257 cast members and 703 crew members. The fourth season returned to Dubrovnik and included new locations, including Diocletian's Palace in Split, Klis Fortress north of Split, Perun quarry east of Split, the Mosor mountain range and Baška Voda farther south. Thingvellir National Park in Iceland was used for the fight between Brienne and the Hound. The fifth season added Seville, Spain, used for scenes of Dorne, and Córdoba.</p><p>The sixth season, which began filming in July 2015, returned to Spain and filmed in Navarra, Guadalajara, Seville, Almeria, Girona and Peniscola. Filming also returned to Dubrovnik, Croatia. The filming of the seven episodes of season seven began on August 31, 2016, at Titanic Studios in Belfast, with other filming in Iceland, Northern Ireland and many locations in Spain, including Seville, Cáceres, Almodovar del Rio, Santiponce, Zumaia and Bermeo. Filming continued until the end of February 2017, as necessary, to ensure winter weather in some European locations. Filming for season eight began in October 2017 and concluded in July 2018. New filming locations included Moneyglass and Saintfield in Northern Ireland for \"The Long Night\" battle scenes.</p><h4>Effect on locations</h4><p>Northern Ireland Screen, a UK government agency financed by Invest NI and the European Regional Development Fund, helped fund Game of Thrones. Tourism Ireland has a Game of Thrones-themed marketing campaign similar to New Zealand's Tolkien-related advertising. According to First Minister Arlene Foster, the series has given Northern Ireland the most publicity in its history apart from The Troubles. The production of Game of Thrones and other TV series boosted Northern Ireland's creative industries, contributing to an estimated 12.4 percent growth in arts, entertainment and recreation jobs between 2008 and 2013 (compared with 4.3 percent in the rest of the UK during the same period). After filming had finished, HBO converted its filming locations in Northern Ireland into tourist attractions to be opened in 2019. By 2019, 350,000 visitors, or one sixth of all tourists, came to Northern Ireland annually because of Game of Thrones.</p><p>Tourism organizations elsewhere reported increases in bookings after their locations appeared in Game of Thrones. Between 2014 and 2016, Hotels.com reported hotel bookings increased by 285 percent in Iceland and 120 percent in Dubrovnik. In 2016, bookings doubled in Ouarzazate, Morocco, the location of Daenerys' season three scenes. Dubrovnik also saw an increase in overnight tourist stays after episodes aired. However, the increase in tourism driven by the series—estimated to be responsible for half of its annual increase over many years—led to concerns about \"over-tourism\" and its mayor imposing limits on tourist numbers in the city. Following the series finale, HBO announced in April 2019 a new exhibition and tourist attraction containing show props and set pieces. The attraction, titled Game of Thrones Studio Tour, will be located at former show filming location Linen Mill Studios outside Belfast. Studies showed that the series had an overall positive economic impacts for both Northern Ireland and Dubrovnik. Despite the positive economic results, some academics note the impact and damage from Game of Thrones–related tourist activities could have on historical sites and other locations of cultural value.</p><h4>Directing</h4><p>Each ten-episode season of Game of Thrones had four to six directors, who usually directed back-to-back episodes. Alan Taylor directed seven episodes, the most of any director. Alex Graves, David Nutter, Mark Mylod, and Jeremy Podeswa directed six episodes each. Daniel Minahan directed five episodes, and Michelle MacLaren, Alik Sakharov, and Miguel Sapochnik directed four each; MacLaren is the only female director of the entire series's run. Brian Kirk directed three episodes during the first season, and Tim Van Patten directed the series's first two episodes. Neil Marshall directed two episodes, both with large battle scenes: \"Blackwater\" and \"The Watchers on the Wall\". Other directors include Jack Bender, David Petrarca, Daniel Sackheim, Michael Slovis and Matt Shakman. David Benioff and D. B. Weiss have directed two episodes together but were credited with only one each, which was determined after a coin toss. For season eight, David Nutter and Miguel Sapochnik, who worked on previous episodes, directed the first five episodes. Benioff and Weiss were credited as both the writers and directors of the show finale \"The Iron Throne\".</p><h4>Production design</h4><p>Michele Clapton was the costume designer for Game of Thrones' first five seasons before she was replaced by April Ferry. Clapton returned to the series as its costume designer for the seventh season. For the first three seasons, Paul Engelen was Game of Thrones' main makeup designer and prosthetic makeup artist with Melissa Lackersteen, Conor O'Sullivan, and Rob Trenton. At the beginning of the fourth season, Engelen's team was replaced by Jane Walker and her crew, composed of Ann McEwan and Barrie and Sarah Gower. Over 130 makeup artists and prosthetic designers worked on the show.</p><p>The designs for the series's costumes were inspired by several sources, such as Japanese and Persian armor. Dothraki dress resembles that of the Bedouin (one was made of fish skins to resemble dragon scales), and the Wildlings wear animal skins like the Inuit. Wildling bone armor is made from molds of actual bones and is assembled with string and latex resembling catgut. Although the extras who played Wildlings and the Night's Watch often wore hats (normal in a cold climate), members of the principal cast usually did not so viewers could recognize them. Björk's Alexander McQueen high-neckline dresses inspired Margaery Tyrell's funnel-neck outfit, and prostitutes' dresses were designed for easy removal. All the clothing used during the production was aged for two weeks, so it had a realistic appearance on high-definition television.</p><p>About two dozen wigs were used by the actresses. Made of human hair and up to 61 centimetres (2 ft) in length, they cost up to $7,000 each and were washed and styled like real hair. Applying the wigs was time-consuming; Emilia Clarke, for example, required about two hours to style her brunette hair with a platinum-blonde wig and braids. Other actors, such as Jack Gleeson and Sophie Turner, received frequent hair coloring. For characters such as Daenerys (Clarke) and her Dothraki, their hair, wigs and costumes were processed to appear as if they had not been washed for weeks.</p><h4>Visual effects</h4><p>For the large number of visual effects used in the series, HBO hired British-based BlueBolt and Irish-based Screen Scene for season one. Most of the environment builds were done as 2.5D projections, giving viewers perspective while keeping the programming from being overwhelming. In 2011, the season one finale, \"Fire and Blood\", was nominated for a Primetime Emmy Award for Outstanding Special Visual Effects. The visual effects crew consisted of both on-set VFX supervisors and concept artists along with visual effect editors in post-production.</p><p>Because the effects became more complex in subsequent seasons (including CGI creatures, fire, and water), German-based Pixomondo became the lead visual effects producer; nine of its twelve facilities contributed to the project for season two, with Stuttgart the lead studio. Scenes were also produced by British-based Peanut FX, Canadian-based Spin VFX, and US-based Gradient Effects. \"Valar Morghulis\" and \"Valar Dohaeris\" earned Pixomondo Primetime Emmy Awards for Outstanding Special Visual Effects in 2012 and 2013, respectively.</p><p>HBO added German-based Mackevision to the project in season four. The season four finale, \"The Children\", won the 2014 Emmy Award for Visual Effects. Additional producers for season four included Canadian-based Rodeo FX, German-based Scanline VFX and US-based BAKED FX. The muscle and wing movements of the adolescent dragons in seasons four and five were based largely on those of a chicken. Pixomondo retained a team of 22 to 30 people focused solely on visualizing Daenerys Targaryen's dragons, with the average production time per season of 20 to 22 weeks. For the fifth season, HBO added Canadian-based Image Engine and US-based Crazy Horse Effects to its list of main visual-effects producers. Visual effect supervisor Joe Bauer said that the VFX team worked on more than \"10,000 shots of visual effects\" throughout all eight seasons. More than 300 artists worked on the show's visual effects team. The show won eight Creative Arts Emmy Awards for visual effects, winning for Outstanding Special Visual Effects in seven consecutive seasons.</p><h4>Title sequence</h4><p>The series's title sequence was created for HBO by production studio Elastic. Creative director Angus Wall and his collaborators received the 2011 Primetime Emmy Award for Main Title Design for the sequence, which depicts a three-dimensional map of the series's fictional world. The map is projected on the inside of a sphere which is centrally lit by a small sun in an armillary sphere. As the camera moves across the map, focusing on the locations of the episode's events, clockwork mechanisms intertwine and allow buildings and other structures to emerge from the map. Accompanied by the title music, the names of the principal cast and creative staff appear. The sequence concludes after about 90 seconds with the title card and brief opening credits detailing the episode's writer(s) and director. Its composition changes as the story progresses, with new locations replacing those featuring less prominently or not at all. Entertainment Weekly named the title sequence one of the best on television, calling it an \"all-inclusive cruise of Westeros\".</p><h4>Music</h4><p>Ramin Djawadi composed the series's music. The first season's soundtrack, written about ten weeks before the series's premiere, was published by Varèse Sarabande in June 2011. Soundtrack albums for subsequent seasons have been released, with tracks by the National, the Hold Steady and Sigur Rós. Djawadi composed reoccurring themes for each of the major houses and some main characters. Some themes evolved over time. Daenerys Targaryen's theme was simple and became more complex after each season. At first, her theme was played by a single instrument, a cello, and Djawadi later incorporated more instruments into it. Djawadi was nominated twice for a Grammy Award for Best Score Soundtrack for Visual Media for his work on the show. In addition to the originally scored music, Columbia Records released the For the Throne: Music Inspired by the HBO Series Game of Thrones companion album on April 26, 2019.</p><h4>Language</h4><p>The Westerosi characters of Game of Thrones speak British-accented English, often (but not consistently) with the accent of the English region corresponding to the character's Westerosi region. The Northerner Eddard Stark speaks in actor Sean Bean's native northern accent, and the southern lord Tywin Lannister speaks with a southern accent, while characters from Dorne speak English with a Spanish accent. Characters foreign to Westeros often have a non-British accent.</p><p>Although the common language of Westeros is represented as English, the producers charged linguist David J. Peterson with constructing Dothraki and Valyrian languages based on the few words in the novels. Before production, Peterson wrote 300 pages of Dothraki language material, including translation and word function. Dothraki and Valyrian dialogue is often subtitled in English. Language-learning company Duolingo began offering courses in High Valyrian in 2017, of which 1.2 million people signed up for between 2017 and 2020.</p><br/><h3>Availability</h3><h4>Broadcast</h4><p>Game of Thrones was broadcast by HBO in the United States and by its local subsidiaries or other pay television services in other countries, at the same time as in the US or weeks (or months) later. Broadcasters carrying Game of Thrones included Fox Showcase in Australia; HBO Canada, Super Écran, and Showcase in Canada; HBO Latin America in Latin America; Sky Television Network's SoHo and Neon in New Zealand and Sky Atlantic in the United Kingdom and Ireland. In India, two versions of the series were aired; Star World aired a censored version of the series on television at the same time as the US, while an uncensored version was made available for live viewing on the Hotstar app.</p><p>On January 23, 2015, the last two episodes of season four were shown in 205 IMAX theaters across the United States, the first television series to be shown in this format. The show earned $686,000 at the box office on its opening day and $1.5 million during its opening weekend; the week-long release grossed $1,896,092. Before the season eight premiere, HBO screened \"The Spoils of War\" episode from season seven in movie theaters in New York, Los Angeles, and \"Chicago\".</p><h4>Home media and streaming</h4><p>The ten episodes of the first season of Game of Thrones were released as a DVD and Blu-ray box set on March 6, 2012. The box set includes extra background and behind-the-scenes material but no deleted scenes, since nearly all the footage shot for the first season was used. The box set sold over 350,000 copies in the week following its release, the largest first-week DVD sales ever for an HBO series. The series also set an HBO-series record for digital-download sales. A collector's-edition box set was released in November 2012, combining the DVD and Blu-ray versions of the first season with the first episode of season two. A paperweight in the shape of a dragon egg is included in the set.</p><p>DVD-Blu-ray box sets and digital downloads of the second season became available on February 19, 2013. First-day sales broke HBO records, with 241,000 box sets sold and 355,000 episodes downloaded. The third season was made available for purchase as a digital download on the Australian iTunes Store, parallel to the US premiere, and was released on DVD and Blu-ray in region 1 on February 18, 2014. The fourth season was released on DVD and Blu-ray on February 17, 2015, and the fifth season on March 15, 2016. Blu-ray and DVD versions of the sixth season were released on November 15, 2016. Beginning in 2016, HBO began issuing Steelbook Blu-ray sets, which include both Dolby TrueHD 7.1 and Dolby Atmos audio options. In 2018, the first season was released in 4K HDR on Ultra HD Blu-ray. Blu-ray and DVD versions of the seventh season were released on December 12, 2017. The final season was released on DVD and Blu-ray on December 3, 2019. The home release also included behind-the-scenes footage and cast commentary. A box set containing all eight seasons, including a cast reunion hosted by Conan O'Brien, was released on DVD and Blu-ray on December 3, 2019, and was also released on 4K Ultra HD Blu-ray on November 3, 2020.</p><p>In August 2022, the complete series was released in 4K, Dolby Vision HDR and Dolby Atmos on HBO Max.</p><h4>Copyright infringement</h4><p>Game of Thrones has been widely pirated, primarily outside the US. According to the file-sharing news website TorrentFreak, it was the most pirated television series from 2012 to 2019 (except 2018, when no new episodes were broadcast), and Guinness World Records named it the most-pirated television program in 2015. Illegal downloads increased to about seven million in the first quarter of 2015, up 45 percent from 2014. An unnamed episode was downloaded about 4.28 million times through public BitTorrent trackers in 2012, roughly equal to its number of broadcast viewers. Piracy rates were particularly high in Australia prompting the US Ambassador to Australia, Jeff Bleich, to issue a statement in 2013 condemning the practice there. Delays in availability by non-HBO broadcasters before 2015 and the cost of subscriptions to their services have been cited as causes for the series's illegal distribution. According to TorrentFreak, a subscription to a service broadcasting Game of Thrones cost up to $25 per month in the United States, up to £26 per episode in the UK and up to $52 per episode in Australia.</p><p>In 2013, to combat unauthorized downloads, HBO said it intended to make its content more widely available within a week of the US premiere (including HBO Go). In 2015, the fifth season was simulcast to 170 countries and to HBO Now users. On April 11, the day before the season premiere, screener copies of the first four episodes of the fifth season leaked to a number of file-sharing websites. Within a day of the leak, the files were downloaded over 800,000 times; in one week the illegal downloads reached 32 million, with the season five premiere—\"The Wars to Come\"— pirated 13 million times. The season five finale (\"Mother's Mercy\") was the most simultaneously shared file in the history of the BitTorrent file sharing protocol, with over 250,000 sharers and over 1.5 million downloads in eight hours. HBO did not send screeners to the press for the sixth season to prevent the spread of unlicensed copies and spoilers. Season seven was either illegally streamed or downloaded over 1 billion times, with the season averaging 14.7 billion illegal views, and the season finale garnering over 120 million illegal views within its first 72 hours. According to anti-piracy company MUSO, the eighth season was illegally downloaded or viewed most in India and China. Illegal viewership for the final season was double the number of legal viewers, with 55 million illegal downloads for the season eight premiere \"Winterfell\", compared to 17.4 million who watched on HBO platforms.</p><p>Observers, including series director David Petrarca and Time Warner CEO Jeff Bewkes, said that illegal downloads did not hurt the series's prospects; it benefited from \"buzz\" and social commentary, and the high piracy rate did not significantly translate into lost subscriptions. According to Polygon, HBO's relaxed attitude towards piracy and the sharing of login credentials amounted to a premium-television \"free-to-play\" model. At a 2015 Oxford Union panel discussion, series co-creator David Benioff said that he was just glad that people watched the series; illegally downloaded episodes sometimes interested viewers enough to buy a copy, especially in countries where Game of Thrones was not televised. Series co-creator D. B. Weiss had mixed feelings, saying that the series was expensive to produce and \"if it doesn't make the money back, then it ceases to exist\". However, he was pleased that so many people \"enjoy the show so much they can't wait to get their hands on it.\"</p><br/><h3>Reception</h3><h4>Critical response</h4><h4>General</h4><p>Game of Thrones, particularly the first six seasons, received critical acclaim, although the series's frequent use of nudity and violence has been criticized. The series has an overall rating of 89 percent on Rotten Tomatoes and 86 on Metacritic. Some critics and publications have called the show among the best HBO series of all time. The series was highly anticipated by fans before its premiere. James Poniewozik said the pilot episode set \"a very large table\", while Ti Singh of Den of Geek said the show \"is here to stay\".</p><p>First-season reviewers said the series had high production values, a fully realized world and compelling characters. According to Variety, \"There may be no show more profitable to its network than 'Game of Thrones' is to HBO. Fully produced by the pay cabler and already a global phenomenon after only one season, the fantasy skein was a gamble that has paid off handsomely.\" The second season was also well received. Entertainment Weekly praised its \"vivid, vital, and just plain fun\" storytelling and, according to The Hollywood Reporter, the series made a \"strong case for being one of TV's best series\"; its seriousness made it the only drama comparable to Mad Men or Breaking Bad.</p><p>The critical response for the middle seasons were also positive. Matt Fowler of IGN said the series was \"still quite marvelous\" praising the character development. TV Guide named the third season's penultimate episode \"The Rains of Castamere\" as number three on their 65 Best Episodes of the 21st Century. The critical acclaim continued into season four, with Darren Franich of Entertainment Weekly calling the season \" the height of the show's icon-generating powers\". The Independent stated that the show deviated significantly from the novels however the \"changes benefited the show and condensed the substantial source text admirably well\". The critical response to season five was again positive, however, some commentators criticized the sexual assault in the \"Unbowed, Unbent, Unbroken\" episode. Season six also received favorable reviews. Time criticized the repetitive story lines early in the season, however, its reviewer praised the \"Battle of the Bastards\" episode as \"one of the show's very best\". One reviewer also said there were \"more woman-friendly\" themes throughout the season, with another singling out Arya Stark's story arc.</p><p>The show's final two seasons, especially season eight, received more criticism. Season seven was praised for its action sequences and focused central characters, but received criticism for its pace and plot developments that were said to have \"defied logic\". Writing for Vox, Emily VanDerWerff cited the departure from the source material as a reason for the \"circular storytelling\". Critical reception for season eight was mixed. The Guardian said there was the \"rushed business\" of the plot which \"failed to do justice to its characters or its actors\". Writing for The Hollywood Reporter, Maureen Ryan condemned the season's reductive treatment of women, and \"decisions set up and executed with little or no foresight or thoughtfulness\", declaring the penultimate episode as \"Game of Thrones at its worst\". Fan reaction was mixed for the final season. A petition on Change.org started by some fans requested that the final season be remade with different writers. Casey Bloys, HBO's president of programming, said at a Television Critics Association event \"the petition shows a lot of enthusiasm and passion for the show but it wasn't something we seriously considered\". Despite the criticism of the writing, the music and visual effects were praised. In 2023, Game of Thrones was included on The Guardian's list of worst TV endings of all time.</p><p>The cast performances were praised throughout the show's run. Peter Dinklage's \"charming, morally ambiguous, and self-aware\" portrayal of Tyrion, which earned him Emmy and Golden Globe awards, was acclaimed. \"In many ways, Game of Thrones belongs to Dinklage\", wrote Mary McNamara of the Los Angeles Times before Tyrion became the series's central figure in season two. Several critics highlighted performances by actresses and children. Lena Headey's portrayal of the \"riveting\" Cersei Lannister also received praise. Maisie Williams was singled out as well and her season two work with veteran actor Charles Dance (Tywin Lannister). Stephen Dillane received positive reviews for his performance as Stannis Baratheon, especially in the fifth season, with one critic noting \"Whether you like Stannis or not, you have to admit that Stephen Dillane delivered a monumental performance this season.\" The series was also praised for the portrayal of handicapped and disabled characters. One commentator stated that Tyrion Lannister is a \"departure from the archetypal dwarf\" often found in other fantasy stories like The Lord of the Rings.</p><p>Darren Franich of Entertainment Weekly gave the series a 'B' rating, saying that it was ultimately \"okay\". With both \"transcendent moments\" and \"miserable phases\", it was \"beloved enough to be criticized by everyone for something\". Franich described seasons three and four as \"relentless\", seasons six's ending having a \"killer one-two punch\", while seasons seven and eight were \"indifferent\". The New York Times gave the series a mixed review after the season three finale, criticizing the number of characters, their lack of complexity and a meandering plot. The show, however, appeared on many \"best of\" lists for the end of the 2010s. Alan Sepinwall, writing for Rolling Stone, placed the series on his \"50 Best TV Shows of the 2010s\" list, saying its \"ability to most of the time keep all of its disparate threads feeling vital and tied to one another, remains a staggering achievement\".</p><h4>Concerns over depiction of sex and violence</h4><p>Despite its otherwise enthusiastic reception by critics, Game of Thrones has been criticized for the amount of female nudity, violence, and sexual violence it depicts, and for the manner in which it depicts these themes. George R. R. Martin responded that he felt obliged to be truthful about history and human nature, and that rape and sexual violence are common in war; and that omitting them from the narrative would have rung false and undermined one of his novels' themes, its historical realism. HBO said that they \"fully support the vision and artistry of Dan and David's exceptional work and we feel this work speaks for itself\". The show has reportedly been censored or banned for sexual or violent content in countries like China, India, Iran, Jordan, Singapore, Turkey, United Arab Emirates, and Vietnam.</p><p>The amount of sex and nudity in the series, especially in scenes incidental to the plot, was the focus of much of the criticism aimed at it in its first and second seasons. Stephen Dillane, who portrays Stannis Baratheon, likened the series's frequent explicit scenes to \"German porn from the 1970s\". The series's use of \"sexposition\", plot delivery accompanied by sex or nudity, was criticized as distracting. Saturday Night Live parodied this aspect of the adaptation in a sketch that portrayed a 13-year-old boy as a Game of Thrones consultant, whose main concern was showing as many breasts as possible.</p><p>The episode \"The Bear and the Maiden Fair\" in the third season featured the lengthy torture and eventual emasculation of Theon Greyjoy, which prompted criticism. New York magazine called the scene \"torture porn\". According to one commentator, although the series' violence tended to serve a narrative purpose, Theon's torture in \"The Bear and the Maiden Fair\" was excessive as well. One commentator noted that Greyjoy's emasculation was one of the only sexual assault scenes where a male was the victim. A scene in the fourth season's episode \"Breaker of Chains\", in which Jaime Lannister rapes his sister and lover Cersei, triggered a broad public discussion about the series' depiction of sexual violence against women. According to Dave Itzkoff of The New York Times, the scene caused outrage, in part because of comments by director Alex Graves that the scene became \"consensual by the end\". Sonia Saraiya of The A.V. Club wrote that the series's choice to portray this sexual act, and a similar one between Daenerys Targaryen and Khal Drogo in the first season—both described as consensual in the source novels—as a rape appeared to be an act of \"exploitation for shock value\".</p><p>In the fifth season's episode \"Unbowed, Unbent, Unbroken\", Sansa Stark is raped by Ramsay Bolton. Most reviewers and publications found the scene gratuitous and artistically unnecessary. In response to the scene, pop culture website The Mary Sue announced that it would cease coverage of the series because of the repeated use of rape as a plot device, and US Senator Claire McCaskill said that she would no longer watch it. The episode was the lowest rated on Rotten Tomatoes until the season eight episode \"The Bells\". As the later seasons saw Daenerys, Sansa, and Cersei assume ruling positions, Alyssa Rosenberg of The Washington Post noted that the series could be seen as a \"long-arc revenge fantasy about what happens when women who have been brutalized and raped gain power\". Much of the criticism after the series finale was centered around the handling of the female character storylines. One commentator cited the male gaze as one of main sources of the \"romanticized female rape\" and general nudity throughout the series. Another commentator stated the use of both sex and violence helps perpetuate misogyny within the Game of Thrones universe.</p><h4>Lighting</h4><p>The lighting, or lack of light, in darker scenes has been a recurring point of criticism since season six of the series. In 2016, Bustle's Caitlyn Callegari listed 31 examples of scenes where the lighting caused viewers problems ranging from not being able to tell a character's hair color to being unable to see what was going on. Some reviewers have noted this is part of a wider trend among shows that are made by people who have experience working primarily on films, suggesting they \"haven't grasped the nuances (or lack thereof)\" of television as a medium, especially the differences between watching a scene on a television screen versus watching it on the big screen in a movie theater.</p><p>In a 2017 interview, Robert McLachlan, a cinematographer working on the show, explained the lack of lighting as an artistic choice saying \"we're trying to be as naturalistic as possible\". The criticism reached a high point during \"The Long Night\", the third episode of season eight. Barely minutes into the episode, viewers took to social media sites such as Twitter to express their discontent over the fact that they were having severe difficulties watching the battle and trying to figure out what was going on.</p><h4>Cultural influence</h4><p>Although Game of Thrones was initially dismissed by some critics, its success has been credited with an increase in the fantasy genre's popularity. The series's popularity led to increased sales of the A Song of Ice and Fire novels (republished in tie-in editions), which remained at the top of bestseller lists for months. On the eve of the second season's premiere, CNN said, \"after this weekend, you may be hard pressed to find someone who isn't a fan of some form of epic fantasy\" and cited Ian Bogost as saying that the series continues a trend of successful screen adaptations beginning with Peter Jackson's The Lord of the Rings film trilogy (2001–2003) and the Harry Potter films (2001–2011) establishing fantasy as a mass-market genre; they are \"gateway drugs to fantasy fan culture\". The show's success led to the commissioning of several fantasy television series, including The Wheel of Time and The Lord of the Rings: The Rings of Power by Amazon Studios. According to Neil Gaiman, whose novels Good Omens and American Gods were adapted for television, Game of Thrones helped to change attitudes towards fantasy on television, but mainly it made big budgets for fantasy series more acceptable.</p><p>The success of the genre has been attributed by writers to a longing for escapism in popular culture, frequent female nudity and a skill in balancing lighthearted and serious topics (dragons and politics, for example) which provided it with a prestige enjoyed by conventional, top-tier drama series. According to The Daily Beast, Game of Thrones was a favorite of sitcom writers and the series has been referred to in other television series. With other fantasy series, it has been cited as a reason for an increase in the purchase (and abandonment) of huskies and other wolf-like dogs.</p><p>Game of Thrones has added to the popular vocabulary. A first-season scene in which Petyr Baelish explains his motives (or background) while prostitutes have sex in the background gave rise to the word \"sexposition\" for providing exposition with sex and nudity. Dothraki, the series's nomadic horsemen, was ranked fourth in a September 2012 Global Language Monitor list of words from television most used on the internet. The series and its characters have also been referenced by politicians and academics to commentate on modern-day geopolitics, economic inequality, and climate change.</p><p>In 2019, singer-songwriter Taylor Swift told Entertainment Weekly that several songs on her 2017 album Reputation were inspired by Game of Thrones characters and plots. \"Khaleesi\" became more popular as a name for baby girls in the United States. In the novels and the TV series, \"khaleesi\" is not a name, but the title of the wife of a \"khal\" (warlord) in the Dothraki language, held by Daenerys Targaryen. Other names from characters in the series, like Daenerys, also became popular baby names.</p><p>Game of Thrones has also become a subject of both academic and scientific inquiry. In 2016, researchers published a paper analyzing emotional sentiment in online public discourse associated with the unfolding storyline during the fourth season. The Mathematical Association of America published a journal in 2016 that applied the multidisciplinary field of network science to create a social network for the show's characters and their relationships. The analysis purported to be able to distinguish discussions about an episode's storyline from media critiques or assessments of a specific actor's performance. In 2018, Australian scientists conducted a survival analysis and examined the mortality among 330 important characters during the first seven seasons of Game of Thrones. In 2019, the Australian Red Cross conducted a study using international humanitarian law to determine which of the Game of Thrones' characters had committed the most war crimes during the first seven seasons of the show.</p><p>Animals have also been named after the show. Three species of mud dragons; Echinoderes daenerysae, Echinoderes rhaegal and Echinoderes drogoni, a bee fly; Paramonovius nightking, three species of scarab beetles; Gymnetis drogoni, Gymnetis rhaegali and Gymnetis viserioni, and a brittle star, Ophiohamus georgemartini, due to its sharp thorns resembling those depicted on the Game of Thrones crown.</p><h4>Fandom</h4><p>A Song of Ice and Fire and Game of Thrones have a broad, active international fan base. In 2012 Vulture ranked the series's fans as the most devoted in popular culture, more so than those of Lady Gaga, Justin Bieber, Harry Potter or Star Wars. Fans include political leaders such as former US president Barack Obama, former British prime minister David Cameron, former Australian prime minister Julia Gillard and Dutch foreign minister Frans Timmermans, who framed European politics using quotes from Martin's novels in a 2013 speech.</p><p>BBC News said in 2013 that \"the passion and the extreme devotion of fans\" had created a phenomenon, unlike anything related to other popular TV series, manifesting itself in fan fiction, Game of Thrones-themed burlesque routines and parents naming their children after series characters; writers quoted attributed this success to the rich detail, moral ambiguity, sexual explicitness and epic scale of the series and novels. The previous year, \"Arya\" was the fastest-rising girl's name in the US after it had jumped in popularity from 711th to 413th place.</p><p>As of 2013, about 58 percent of series viewers were male and 42 percent female, and the average male viewer was 41 years old. According to SBS Broadcasting Group marketing director Helen Kellie, Game of Thrones has a high fan-engagement rate; 5.5 percent of the series's 2.9 million Facebook fans talked online about the series in 2012, compared to 1.8 percent of the over ten million fans of True Blood (HBO's other fantasy series). Vulture.com cited Westeros.org and WinterIsComing.net (news and discussion forums), ToweroftheHand.com (which organizes communal readings of the novels) and Podcastoficeandfire.com as fan sites dedicated to the TV and novel series; and podcasts cover Game of Thrones.</p><h4>Awards</h4><p>Game of Thrones has won numerous awards throughout its run, including 59 Emmy Awards, eight Screen Actors Guild Awards and a Peabody Award. It holds the record for total Emmy Award wins for a scripted television series (surpassing the record of 37 wins held by Frasier since 2004) and for most Emmy nominations for a drama series, with 161. In 2019, the show's final season established a new record for most Emmy nominations received in a year with 32, breaking the 25-year-long record of 26 nominations established by NYPD Blue in 1994. In 2013, the Writers Guild of America listed Game of Thrones as the 40th best written series in television history. In 2015, The Hollywood Reporter placed it at number four on their best TV shows ever list, while in 2016 the series was placed seventh on Empire's \"The 50 best TV shows ever\". The same year, Rolling Stone named it the twelfth \"greatest TV Show of all time\". In 2013, at the Media Access Awards, George R. R. Martin accepted the Visionary Award from the Writers With Disabilities committee of the Writers Guild of America, for its positive portrayal of character with disabilities.</p><h4>Viewership</h4><p>Game of Thrones was considered a ratings success for HBO throughout all eight seasons. The show premiere was watched by 2.2 million, and the first season averaged 2.5 million viewers per episode. For its second season, the series had an average gross audience of 11.6 million viewers. The third season was seen by 14.2 million viewers, making Game of Thrones the second-most-viewed HBO series (after The Sopranos). HBO said that Game of Thrones' average gross audience of 18.4 million viewers (later adjusted to 18.6 million) had passed The Sopranos for the viewership record. The season five episode \"The House of Black and White\" was simulcasted in 173 countries, becoming the \"largest TV drama telecast\" according to Guinness World Records.</p><p>By the sixth season the average per-episode gross viewing figure had increased to over 25 million, with nearly 40 percent of viewers watching on HBO digital platforms. In 2016, a New York Times study of the 50 TV shows with the most Facebook likes found that Game of Thrones was \"much more popular in cities than in the countryside, probably the only show involving zombies that is\". By season seven, the average viewer numbers had grown to 32.8 million per episode across all platforms. The series finale was viewed by 19.3 million people across HBO's platforms, becoming the network's most watched episode. The lead-out show also benefited from the finale's record viewership.</p><p>Game of Thrones also set viewership records outside the United States on pay-television channels in the United Kingdom (with a 2016 average audience of more than five million on all platforms) and Australia (with a cumulative average audience of 1.2 million). Video streaming research company Parrot Analytics stated that after the US, the season eight premiere demand was \"particularly strong in the United Kingdom and France\". Nielsen Media Research noted the show was popular among 18 to 49 key demographic with strong female viewership for a fantasy series. The show also benefited from time shifting viewership. Between season one and season seven, 7-day viewers, the number of both DVR and video on demand views during the week after the episode broadcast, grew from 3.3 million to 13.7 million. Following the show finale, commentators said many viewers might cancel their premium television and streaming subscriptions. HBO parent company WarnerMedia reported that subscription revenue declined only 0.9 percent between April and June 2019.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\" style=\"text-align: left;\"><div class=\"mbox-text-span\">Graphs are temporarily unavailable due to technical issues.</div></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" rowspan=\"2\" style=\"padding-left:.8em;padding-right:.8em\">Season</th><th colspan=\"10\" style=\"padding-left:.8em;padding-right:.8em\">Episode number</th><th scope=\"col\" rowspan=\"2\" style=\"padding-left:.8em;padding-right:.8em\">Average</th></tr><tr><th scope=\"col\">1</th><th scope=\"col\">2</th><th scope=\"col\">3</th><th scope=\"col\">4</th><th scope=\"col\">5</th><th scope=\"col\">6</th><th scope=\"col\">7</th><th scope=\"col\">8</th><th scope=\"col\">9</th><th scope=\"col\">10</th></tr><tr><th style=\"background-color:#295354;width:10px\"></th><th scope=\"row\">1</th><td style=\"width:35px\">2.22</td><td style=\"width:35px\">2.20</td><td style=\"width:35px\">2.44</td><td style=\"width:35px\">2.45</td><td style=\"width:35px\">2.58</td><td style=\"width:35px\">2.44</td><td style=\"width:35px\">2.40</td><td style=\"width:35px\">2.72</td><td style=\"width:35px\">2.66</td><td style=\"width:35px\">3.04</td><td>2.52</td></tr><tr><th style=\"background-color:#D09916;width:10px\"></th><th scope=\"row\">2</th><td style=\"width:35px\">3.86</td><td style=\"width:35px\">3.76</td><td style=\"width:35px\">3.77</td><td style=\"width:35px\">3.65</td><td style=\"width:35px\">3.90</td><td style=\"width:35px\">3.88</td><td style=\"width:35px\">3.69</td><td style=\"width:35px\">3.86</td><td style=\"width:35px\">3.38</td><td style=\"width:35px\">4.20</td><td>3.80</td></tr><tr><th style=\"background-color:#54575A;width:10px\"></th><th scope=\"row\">3</th><td style=\"width:35px\">4.37</td><td style=\"width:35px\">4.27</td><td style=\"width:35px\">4.72</td><td style=\"width:35px\">4.87</td><td style=\"width:35px\">5.35</td><td style=\"width:35px\">5.50</td><td style=\"width:35px\">4.84</td><td style=\"width:35px\">5.13</td><td style=\"width:35px\">5.22</td><td style=\"width:35px\">5.39</td><td>4.97</td></tr><tr><th style=\"background-color:#222222;width:10px\"></th><th scope=\"row\">4</th><td style=\"width:35px\">6.64</td><td style=\"width:35px\">6.31</td><td style=\"width:35px\">6.59</td><td style=\"width:35px\">6.95</td><td style=\"width:35px\">7.16</td><td style=\"width:35px\">6.40</td><td style=\"width:35px\">7.20</td><td style=\"width:35px\">7.17</td><td style=\"width:35px\">6.95</td><td style=\"width:35px\">7.09</td><td>6.84</td></tr><tr><th style=\"background-color:#68411C;width:10px\"></th><th scope=\"row\">5</th><td style=\"width:35px\">8.00</td><td style=\"width:35px\">6.81</td><td style=\"width:35px\">6.71</td><td style=\"width:35px\">6.82</td><td style=\"width:35px\">6.56</td><td style=\"width:35px\">6.24</td><td style=\"width:35px\">5.40</td><td style=\"width:35px\">7.01</td><td style=\"width:35px\">7.14</td><td style=\"width:35px\">8.11</td><td>6.88</td></tr><tr><th style=\"background-color:#31485C;width:10px\"></th><th scope=\"row\">6</th><td style=\"width:35px\">7.94</td><td style=\"width:35px\">7.29</td><td style=\"width:35px\">7.28</td><td style=\"width:35px\">7.82</td><td style=\"width:35px\">7.89</td><td style=\"width:35px\">6.71</td><td style=\"width:35px\">7.80</td><td style=\"width:35px\">7.60</td><td style=\"width:35px\">7.66</td><td style=\"width:35px\">8.89</td><td>7.69</td></tr><tr><th style=\"background-color:#091411;width:10px\"></th><th scope=\"row\">7</th><td style=\"width:35px\">10.11</td><td style=\"width:35px\">9.27</td><td style=\"width:35px\">9.25</td><td style=\"width:35px\">10.17</td><td style=\"width:35px\">10.72</td><td style=\"width:35px\">10.24</td><td style=\"width:35px\">12.07</td><td data-sort-value=\"\" class=\"table-na\" colspan=\"3\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\">–</td><td>10.26</td></tr><tr><th style=\"background-color:#3D424A;width:10px\"></th><th scope=\"row\">8</th><td style=\"width:35px\">11.76</td><td style=\"width:35px\">10.29</td><td style=\"width:35px\">12.02</td><td style=\"width:35px\">11.80</td><td style=\"width:35px\">12.48</td><td style=\"width:35px\">13.61</td><td data-sort-value=\"\" class=\"table-na\" colspan=\"4\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\">–</td><td>11.99</td></tr></tbody></table><br/><h3>Other media</h3><h4>Video games</h4><p>The series and the novels have inspired several video games.</p><h4>Merchandise and exhibition</h4><p>HBO has licensed a variety of merchandise based on Game of Thrones, including games, replica weapons and armor, jewelry, bobblehead dolls by Funko, beer by Ommegang and apparel. High-end merchandise includes a $10,500 Ulysse Nardin wristwatch and a $30,000 resin replica of the Iron Throne. In 2013 and 2014, a traveling exhibition of costumes, props, armor and weapons from the series visited major cities in Europe and the Americas. Starting 2018, Diageo released several Game of Thrones themed whiskies.</p><br/><h3>Related shows</h3><h4>Thronecast</h4><p>Thronecast: The Official Guide to Game of Thrones, a series of podcasts presented by Geoff Lloyd and produced by Koink, were released on the Sky Atlantic website and the UK iTunes store during the series's run; a new podcast, with analysis and cast interviews, was released after each episode. In 2014 and 2015, HBO commissioned Catch the Throne, two rap albums about the series. A companion book, Inside HBO's Game of Thrones by series writer Bryan Cogman, was published on September 27, 2012. The 192-page book, illustrated with concept art and behind-the-scenes photographs, covers the creation of the series's first two seasons and its principal characters and families.</p><h4>After the Thrones</h4><p>After the Thrones was a live aftershow during which hosts Andy Greenwald and Chris Ryan discussed episodes of the series. It aired on HBO Now, the Monday following each season six episode. The Game of Thrones Live Concert Experience, a North American 28-city orchestral tour which performed the series's soundtrack with composer Ramin Djawadi, began in February 2017 and concluded in April 2017. A second tour followed in 2018 across cities in Europe and North America.</p><h4>Home media extras</h4><p>Each season's Blu-ray and DVD set contains several short still motion animated sequences titled Histories and Lore, narrated by the cast, in character, as they detail events in the history of Westeros. For the seventh season, this was to include the animated prequel series Game of Thrones: Conquest & Rebellion, illustrated in a different animation style than previous videos. The series focuses on Aegon Targaryen's conquest of the Seven Kingdoms of Westeros. A week after the series finale, HBO released a behind-the-scenes documentary entitled Game of Thrones: The Last Watch. The program documented the production of season 8 along with read-throughs and interviews with the cast.</p><h4>Successors</h4><p>In May 2017, after years of speculation about possible successor series, HBO commissioned Max Borenstein, Jane Goldman, Brian Helgeland, Carly Wray, and Bryan Cogman to develop five individual Game of Thrones successor series; the writers were to be working individually with George R. R. Martin, who also co-wrote two of the scripts. D. B. Weiss and David Benioff said that they would not be involved with any of the projects.</p><p>Martin said that all the concepts under discussion were prequels, although he believes the term \"successor show\" applies better to these projects, as they are not Game of Thrones spin-offs in the traditional sense. He ruled out Robert's Rebellion (the overthrow of Daenerys's father by Robert Baratheon) as a possible idea and revealed that some may be set outside Westeros. In September 2018, speaking about the four projects (i.e. not about the Goldman's project), HBO president of programming Casey Bloys said that some of them had been abandoned completely, while others remained as possibilities for the future; Martin said that: \"at least two of them are solidly based on material in Fire and Blood\". In May 2019, Martin stated that two of the projects were still in the script stage, but were \"edging closer\". In April 2019, Cogman confirmed his prequel would not be moving forward.</p><p>In January 2021, it was revealed that HBO were developing another prequel series to be based on Martin's novella series Tales of Dunk and Egg. Steve Conrad was attached as writer and executive producer of the Tales of Dunk and Egg series in November 2021. In March 2021, it was reported that three additional Game of Thrones spin-offs were in development at HBO; they include 10,000 Ships, a reference to the voyages made by warrior queen Princess Nymeria, who later founds Dorne; 9 Voyages, about the voyages of Corlys Velaryon on the Sea Snake; and a project based on Flea Bottom, the poorest slum in King's Landing.</p><p>In June 2022, it was reported that a Jon Snow sequel series with Kit Harington to reprise his role was in early development at HBO. The working title is Snow and Martin confirmed his involvement with the project and that Harington initiated the idea. Also in June, Martin said there were still three other live-action series in development: 10,000 Ships (written by Amanda Segal), 9 Voyages aka Sea Snake (written by Bruno Heller), and the Dunk & Egg prequel series (written by Steven Conrad), tentatively titled either The Hedge Knight or Knight of the Seven Kingdoms.</p><h4>Bloodmoon</h4><p>On June 8, 2018, HBO commissioned a pilot to a Game of Thrones prequel series from Goldman as showrunner and Martin as co-creator. The prequel was to take place in the Age of Heroes, a period that begins roughly 10,000 years before the events of Game of Thrones. Notable events of that period include the foundation of powerful Houses, the Long Night when the White Walkers first descended upon Westeros, and the Andal Invasion when the Andals invaded from Essos and conquered most of Westeros. Martin suggested The Long Night as a title for the series. S. J. Clarkson was announced to direct and executive produce the pilot, while Naomi Watts was cast as the female lead playing \"a charismatic socialite hiding a dark secret\". Other series regulars were to include: Josh Whitehouse, Toby Regbo, Ivanno Jeremiah, Georgie Henley, Naomi Ackie, Denise Gough, Jamie Campbell Bower, Sheila Atim, Alex Sharp, Miranda Richardson, Marquis Rodriguez, John Simm, Richard McCabe, John Heffernan, and Dixie Egerickx. In September 2019, Martin claimed the pilot was in post-production but in October 2019, it was announced that HBO had decided not to move forward with the series.</p><h4>House of the Dragon</h4><p>In September 2019, Deadline Hollywood reported that a second prequel from Martin and Ryan Condal that \"tracks the beginning of the end for House Targaryen\" was close to receiving a pilot order from HBO; the project is not considered an original sixth script, as it builds upon Cogman's idea from 2017. This prequel, titled House of the Dragon, was commissioned as a complete series on October 29, 2019. The 10-episode series is to be based on material from Fire and Blood, executive produced by Martin, Vince Gerardis, Condal, and Miguel Sapochnik; the latter two are to be its showrunners as well. In January 2020, HBO stated that the series is scheduled for a 2022 release and that the writing process has begun. Casting for the series started in July 2020. In October 2020, it was revealed that Paddy Considine was cast as King Viserys I Targaryen. In December 2020, three more castings were announced: Olivia Cooke as Alicent Hightower, Emma D'Arcy as Rhaenyra Targaryen, and Matt Smith as Daemon Targaryen. In February 2021, HBO chief content officer Casey Bloys stated that the show would start production in April, with filming occurring in England. In February 2021, Steve Toussaint, Eve Best, Rhys Ifans, and Sonoya Mizuno were confirmed to also be starring in the series. In March 2022, HBO announced a series premiere date of August 21, 2022, followed by the release of the official teaser trailer.</p><h4>Animated series</h4><p>In January 2021, an adult animated drama series was announced to be in development at HBO Max. In July 2021, two more animated series were in development at HBO Max, with one being set in Yi Ti, a nation in Essos loosely based on Imperial China. The series' working title is The Golden Empire.</p><br/>"
  },
  "errorMessage": ""
}