{
  "imDbId": "tt0407362",
  "title": "Battlestar Galactica",
  "fullTitle": "Battlestar Galactica (TV Series 2004–2009)",
  "type": "TVSeries",
  "year": "2004",
  "items": [
    {
      "username": "morethanwho",
      "userUrl": "https://www.imdb.com/user/ur23762478",
      "reviewLink": "https://www.imdb.com/review/rw2359040",
      "warningSpoilers": true,
      "date": "27 December 2010",
      "rate": "10",
      "helpful": "1,399 out of 1,481 found this helpful.",
      "title": "What makes us human?",
      "content": "BSG is a wonderful sci-fi series! In the midst of the battles between the human kind and the robots, the dark sides of the people are exposed whereas the robots display in themselves what humanity should be. The desire to survive, the yearning for the Earth, and the hope for the future drive both the humans and the robots as the distinctions between them gradually disappear.The casting was exceptional and the performances were more than convincing. The actors did excellent jobs in expressing the emotional struggles within and without. The dynamic and unpredictable story lines demanded feats of acting skills and they all performed to high standards. There were a lot of breath-halting cliffhangers, palm-sweating suspense, and eye-widening surprises.At times, some of the narrations seemed to be a bit preachy. There were times when the decisions of the people on the ship were too predictable and childish. I had an impression that the ending was rather rushed.BSG kept asking us the same question \"What makes us human?\" In this regards, this TV series reminded me of a book called 'Somewhere carnal over 40 winks'.I hope for more of realistic sci-fi series like BSG in the future."
    },
    {
      "username": "Blumanowar",
      "userUrl": "https://www.imdb.com/user/ur23402006",
      "reviewLink": "https://www.imdb.com/review/rw5142910",
      "warningSpoilers": false,
      "date": "25 September 2019",
      "rate": "10",
      "helpful": "38 out of 54 found this helpful.",
      "title": "Wow, now reviews in 9 years... this is an old show worth discovering, Fantastic!",
      "content": "I've just finished Season one on Amazon Prime and I must say this is the best sci-fi show I've seen in years. And I've seen all the SyFy channel shows and new SciFi movies of the last few years. I cannot wait to watch the remaining shows. Better by far than the original Star Trek series or movies... it makes Expanse, Dark Matter and other new shows look inept (and I'd resigned myself to fact that those were about as good as we were going to get)... if you haven't seen this series, let me tell you the writing and acting is first class. It's even a little sexy, something you rarely see in SciFi. I'm loving it!!!!"
    },
    {
      "username": "Iok",
      "userUrl": "https://www.imdb.com/user/ur1612987",
      "reviewLink": "https://www.imdb.com/review/rw0975618",
      "warningSpoilers": false,
      "date": "10 December 2004",
      "rate": "",
      "helpful": "1,512 out of 2,208 found this helpful.",
      "title": "Sci-fi for Grown-Ups",
      "content": "Before I proceed, I'll just add a quick comment for those slating the series without seeing it: please, stop it. Instead, wait and see what the new show is about and give it a chance. Unless of course, you want to miss one of the best dramas currently airing...BSG is a very human story. Yet unlike Star Trek, they're not resolved by the end of the episode. Here the characters are real people who make mistakes, grow and learn from their errors. Or maybe they don't... The point is that in the new BSG, the impact of the loss of the Colonies is something everybody must deal with, be it on a resource-management level to dealing with the loss of their families. The impact of the Cylon attack - never explored in the original series - is a major emphasis in the show and the viewer genuinely does get the feeling of the \"rag tag fleet.\"Don't get me wrong, I enjoyed the original series as much as anybody, but it was a product of its time and audience-slot. The new BSG is a much more adult production, both in terms of the writing and performances and the intended audience.Additionally, the show is very non-sci-fi, but in a good way. Whenever any \"science\" turns up, it's integrated in such a way as to have minimal impact on the plot and, unlike Star Trek, it isn't used as a Deus Ex Machina to simply resolve the \"crisis of the week.\" In fact, I'd go as far as to say the show is closer to 24 or The West Wing than it is Star Trek or Babylon 5, with the focus being much more on the people and their individual actions, rather than a wide-scale \"space opera.\"Performances are all strong, with James Callis being the real star. His tortured performance as the guilt-stricken Baltar are a joy to watch as he flips from near-hysterical lunatic to scheming toad to smooth womaniser. Olmos has the presence to give Adama the air of authority required. Sackhoff's performance as Starbuck is \"subtly obvious\" - she plays the brash, cocky pilot a little too well, something that's explained in later episodes. And Bamber's Apollo is a mix of heroic action and self-doubt which balances well. Mention must also go to McDonnell's President Roslin who, over the course of the series, has grown in stature and presence in a very subtle manner.Quite simply, Battlestar Galactica is one of the most consistently strong shows I've ever seen. Considering this is only the first of (hopefully) many seasons, it's amazing to see how the show has \"hit the ground running,\" with each episode being an improvement on the last. And considering the high standard of the first one, that's quite the achievement.Watch it. You won't be disappointed."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3562914",
      "warningSpoilers": false,
      "date": "16 October 2016",
      "rate": "8",
      "helpful": "18 out of 24 found this helpful.",
      "title": "Extremely addictive, but not without its imperfections",
      "content": "This is going to be very similarly worded to my review for the 'Battlestar Galactica' pilot from 2003, but that's due to having so much of the same great things. 1978's 'Battlestar Galactica' was, and still is, a lot of fun to watch and has a lot of great things, such as most of the production values, the music and the cast. Flaws and all, there is still a soft spot for the show.At the same time, it was a long way from a flawless show, with the problems more noticeable to an adult audience, such as annoying child actors, the character of Muffit II, the tone not always being focused and too many homages that distracted from the main plot-line. When 'Battlestar Galactica' was good, it was great, as seen with \"War of the Gods\" which took a darker approach and ended up epitomising what the show is all about. When the show was not good, like with \"The Young Lords\", it was cringe-worthy.There was the worry as to whether the pilot mini-series and this show would fall into the same camp as 'Galactica 1980', which had one great episode, \"The Return of Starbuck\", and one great scene, the attack of the Cylons on Los Angeles, but is down there as one of the most pointless and unnecessary shows ever made. Not only making the mistakes as the original 'Battlestar Galactica' did but amplifying them and making more on the way.Watching the pilot and this show in its entirety over-time, neither go anywhere near in the territory of being another 'Galactica 1980'. Will be going out on a limb, but both are improvements over the original 'Battlestar Galactica', but other than having the same title and names they are very different and should be judged separately. Speaking of the show, there are improvements over the pilot, Tigh, who was a flat character in the pilot, is much more interesting and developed and Starbuck is more toned down while still showing a sassy, tough and no-nonsense personality.The shaky camera work occasionally getting excessively for no real reason flaw is still present however, and if you want accurate science fiction or computer science look elsewhere, the science is barely there and lazily researched when there and the computer science is convoluted gibberish. There are also things done worse here, the special effects are not as good as the rest of the production values, not cheap but do look rather rushed. The character of Roslin is also much more likable and heartfelt in the pilot, here the character while showing glimpses of the affecting and complex personality traits shown in the pilot also has an off-putting holier than thou and hypocritical attitude and Mary McDonnell overdoes it at times in the acting, especially some shrill line delivery and her facial expressions.Judging the seasons, Seasons 1 and 2 are absolutely phenomenal and some of the most riveting television ever made. Season 3 started off great but lost some of its momentum halfway through, while Season 4 was very disappointing with things taking a bizarre and very confused turn, characters being over-written and out of character and then ideas started getting resolved in a flat and simplistic manner and in ways all too convenient and too much by chance.On the other hand, let's talk about what is so good about 'Battlestar Galactica' (2004) in its prime and why to me it's an improvement on the 1970s show.The tone is much more consistent. It's dark, bold, moody and sombre compared to the more light-hearted and admittedly sometimes cheesy tone of the original, and while it was different it was interesting and avoided generally being clinical and cold. It clearly knows what tone it's trying to take, without trying to be too many things all at once which would fall into the traps of being bloated and under-explored, and what target audience it's aiming to appease to, without trying too hard to appeal to them. The characters have much more depth, with complex and nuanced personalities (the heroes have flaws as well as strengths, while the more villainous characters are more than standard villains with a sympathetic and humane edge while also being a threat). Baltar in particular is brilliantly developed.The Cylons are more consistently characterised, being more of a threat rather than being indecisively written, and there are no annoying child actors or any character down there with the likes of Muffit II or Doctor Zee from 'Galactica 1980'. The production values are top notch mostly, especially in the stylish and moodily atmospheric photography when not excessively shaky, the dynamic and foreboding lighting and awe-inspiring sets. The music is haunting and moody with also with melancholy and nuanced pathos without being overly-bombastic or sappy, approaches that would have sounded wrong within the show. The action also crackles thrillingly.Writing is as layered and complex as the characters, as well as being more focused tonally and the story-lines more consistent. It's very insightful and thought-provoking, and resists going into overload of cheese or mawkish sentimentality. The political, military and social commentaries are powerful. While taking time to develop, the stories when the show was in its prime are still incredibly compelling with a lot going on while still being very much cohesive. There is no padding and the concept is always obvious with little getting in the way. The acting is very good, especially from dignified and authoritative Edward James Olmos and James Callis who brings a lot of dimension to a character much more complex than just your standard villain.On the whole, not without imperfections and Season 4 really does not live up to the first two seasons but 'Battlestar Galactica' is still extremely addictive and intriguing stuff. 7.5/10 Bethany Cox"
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw2569982",
      "warningSpoilers": false,
      "date": "22 February 2012",
      "rate": "9",
      "helpful": "26 out of 37 found this helpful.",
      "title": "I've watched it all before and I'll watch it all again!",
      "content": "Having watched the original series as a child I put off watching this for some time expecting it to be a virtual remake but with CGI and characters who had been gender switched for no obvious reason... I'm glad I eventually decided to watch it though as I could not have been more wrong! This is nothing like the light hearted original that I loved as a child; series creator Ronald D. Moore has taken the original premise and made something much darker and much more grown up. As with the original the series starts with the destruction of the Twelve Colonies where humanity has settled and the survivors head off into space in search of the mythical thirteenth colony; Earth. Here the similarities end though; the Cylons that destroyed the colonies weren't crated by aliens; they were created by humanity and rebelled against their masters. As well as the familiar Centurions we soon learn that there are some Cylons that can't be distinguished from people and some of those don't even realise they are Cylons. As humanity flees they will have to struggle against both Cylons and themselves if they are to survive and find their new home.I really enjoyed this series; the story may have been familiar but the characters were much deeper than in the version I saw as a child and there wasn't the feeling that if a character was a regular they would inevitably survive; in fact many major characters die including some that manage to survive for several seasons. The cast did a fantastic job; most notably Edward James Olmos, Mary McDonnell, Katie Sackhoff, Grace Park, Jamie Bamber, Michael Hogan, Tricia Helfer and James Callis... and even listing this many stand out performances seems unfair on the rest as just about everybody was great! Fans of the original series will be pleased to see Richard 'Apollo' Hatch return; this time his character, Tom Zarek, is far from heroic. I don't usually think to comment on the music for a series but here I must as composer Bear McCreary did such a fine job and later on some of the music is actually integral to the plot. As with all series there are some weaker episodes but even the poor Galactica episodes are better than much of what is on television. When the series finished I was left wanting more but all the key story threads had been tied up and it was good that it ended while it was still good rather than overstaying its welcome. If you haven't seen this series yet I strongly recommend it; just remember to watch the miniseries before series one as that sets up the whole story."
    },
    {
      "username": "reb-warrior",
      "userUrl": "https://www.imdb.com/user/ur24292397",
      "reviewLink": "https://www.imdb.com/review/rw6626621",
      "warningSpoilers": true,
      "date": "22 February 2021",
      "rate": "7",
      "helpful": "24 out of 34 found this helpful.",
      "title": "Compelling at times. A chore to get through at other times.",
      "content": "It started off with a great season one, but gradually deteriorated over time. Season three was the worst.Kara and Apollo were the worst characters. They were the \"star\" characters and got the most screentime. They both were domestic abusers of each other, and the writers tried to write that as romantic. Yeah, frak off. Kara was a bully and an idiot most of the time. Apollo was the most boring character on the show. He was so vanilla, that he was a yawn. The writers didn't know what to do with him and kept giving him new job titles until eventually, he devolved into a politician. These two were both a drain on the show, especially in season 3.Hate that Caprica Six lost her mojo after resurrecting. Remember how the mini series began? She killed a baby and orchestrated the genocide of the human on Caprica. Later she got involved with Saul which was forced, awkward, and stupid. This relationship was completely swept under the rug late in the last season.The Final Five seemed like an \"omg, what a shocking twist,\" moment. Then went downhill after that. Ellen as the final one seemed like a joke. So she's a part of the scientists that created the resurrection? LMAO. Gimme a break. Speaking of which, I had to go online to read some sites in order to understand the Cylon history and how the Final Five were explained. The show didn't do a good job of it. Everything went so fast that I didn't have time to think about it and connect the dots when Sam, Ellen, and Cavil explained everything. Of course, they only made this up in the last season. Sheesh.The Opera House scene at the end of season 4, seemed kind of anti-climatic. The repeating vision and all that build-up for that? Kind of weak. Tho I did appreciate Baltar's reasoning with Cavil. My favorite character is Baltar. Great acting by the actor. Baltar was interesting, funny, and introspective. His philosophizing and squirming \"not to get caught\" made him fun to watch. Not to mention all the scenes with Six in his head.Sharon/Boomer should have been the most compelling characters on the show. Unfortunately, I found her too vanilla. Even when Boomer was deceptive and doing bad stuff, she was still vanilla. The actress wasn't very charismatic, and I think that's what made the characters ho-hum to me. Helo was great. He was one of the humans I really liked. A voice for the underdog, and yet stayed true to the commands he received.D'Anna Biers was my favorite Cylon. She was different from the rest which were either rebels or the colony. She had her own path. I found her intriguing and fun. I wished they had more of her in the show. Imagine having Lucy Lawless and not utilizing her more. Great actress. She has a huge fanbase that would have stuck with the show through thick and thin just to see her. Another character that I really liked was Lampkin. He was fun and interesting. A charismatic character and actor. Definitely wished there was more of him in the show.What the frak happened to you Chief? For the first three seasons, you were a pretty decent character. Then they made you a Cylon. They got rid of your wife. They got rid of your kid. Last I saw of you, you were sitting on the ground after killing Tory. We didn't even get to see what path in life you were heading into on New Earth.I only started liking Laura sometime in the third season. Same with Saul. Imagine Saul is one of the final five. So he was a scientist? Seems so laughable. They never should have made him a Cylon. Kara was an angel? They made it up in the last season. That was just poor writing. I think it would have been better if Laura and Kara had been Cylons. With Laura being the top-dog Cylon. Also, I love the idea of Adama falling for a Cylon.Adama wasn't my favorite character. But he was in the least the top five or six. I think more importantly the actor had a presence that dominated the screen. He brought a certain gravitas that worked for the character. I definitely like Adama, but sometimes was annoyed by him. Such as when he didn't listen to Helo about the Sagittarian situation or ignored the prophecies Laura mentions. I didn't care for drunk Adama. And the father/son stuff between him and Apollo got tired.As for the ending, well it makes sense in a lot of ways. \"This had happened before and will happen again.\" Seems like a dire warning about AI. But is the problem really with AI, or is it with human beings? I'd say the latter. The ending seemed a little kumbayah for my tastes. I kept waiting for the other foot to fall but it never did. Seemed kinda dumb Apollo's idea to give up their technology. I mean they know about the Cylons. The planet would be without protection. Neo-Luddism for the Capricans. Seems similar to the Sagittarians. No, I believe the answer was to learn from their mistakes and go forward and evolve. The answer stared them right in the face from the beginning. The Cylons including the Centurians were sentient beings and they needed to work together, not make war with each other. Also what about the people that were left behind on Caprica? No way that the few survivors Starbuck came with were the only ones. She was only at a small location on the big giant planet. No one wants to rescue/help them? Also when the Cylons all went to New Caprica to occupy it, did they all leave old Caprica? I'm kinda confused about that.I found the show compelling to watch at times. The idea of it is so interesting. The worst thing for me was the \"Kara and Apollo show.\" That was such a drain, especially in season three that despite the show being compelling I almost quit. But I wanted to see how the show would wrap up, so then it became a chore just to get through it to reach the end. As far as I'm concerned they ruined the show in many ways. I think that's why people probably walking away from it when it aired. Oddly enough, I loved Apollo and Starbuck in the old 78' version. Anyway, I gave this a 7/10."
    },
    {
      "username": "Felis_lynx",
      "userUrl": "https://www.imdb.com/user/ur106224997",
      "reviewLink": "https://www.imdb.com/review/rw5041460",
      "warningSpoilers": true,
      "date": "5 August 2019",
      "rate": "10",
      "helpful": "53 out of 69 found this helpful.",
      "title": "Still the King of the Genre",
      "content": "Before \"The Expanse\" appeared on my radar, I would have called BSG the best SciFi series without competition. Now it gracefully shares the throne.This show is also referred to as the \"reimagined\" version of Battlestar Galactica, and I think this is an accurate description considering that one cannot really call it a remake. I have to admit that I never watched the original BSG series from the late 1970s. If I'm being honest, I don't think I ever will. However, it's interesting to see how both shows managed to address the geopolitical context of their time in their own, unique way. The original BSG was known to be a parable of the Cold War (with the robotic, swarm-intelligent Cylons clearly representing the Soviets). In contrast, the reimagined BSG has tackled its post 9/11 context and explores themes like religious fanaticism (the monotheistic Cylons), which is juxtaposed with the more liberal, polytheistic society of the human colonies. It speaks volumes that the main threat to the human colonial society is not just the incessant pursuit of the cylons, but the militarization, securitization, and decay of democratic institutions amongst the human survivors. One of the most interesting parts of the show looks at the problem of occupation from the perspective of the occuppied and the collaborators in their midst - some scenes are characteristically filmed with the greenish tint of night-vision cameras that could as well show CNN footage of raiding houses in Fallujah, Iraq.It is much to the credit of the show that none of these political allusions are entirely obvious or unequivocal. BSG is not a show that aims to make political statements, it's rather a show that draws attention to the fact that things are never as easy or clear-cut as we would like them to be - and that in political and military affairs, the road to hell is often paved with the best of intentions.On this note, the genre of BSG is not just science fictions, it's (more specifically) military science fiction. The creators of the show seem to have developed an entire body of theory and doctrine on ship-to-ship combat in space. While I don't want to enter any endless discussion of \"realism\", I personally found the way BSG portrays combat in outer space very fascinating and (within the confines of the show) consistent. Suffice it to say, it is heavily influenced by a meticulous study World War II naval battles. While CGI technology was not what it is today, most of the scenes in space are aesthetically very pleasing and the space battles are amongst the most engaging I have ever seen in this genre.On a more general level, the looks and visual atmosphere of BSG are just as impressive as the complex and well-crafted storyline. Ships feel appropriately claustrophobic, they are heavily armored hulks of steel with wires, metallic bulkheads, and flickering neon lights - in many ways the exact opposite of what you might find in \"Star Trek\". The few planetary surfaces of the show are equally unique, from the over-saturated green of the fallen Garden Eden of Cobol and the sickly yellow tint of irradiated Caprica to the barren planes of New Caprica and the bubbling miasma of the \"Algae Planet\".The entire storyline of the show is truly remarkable. After the existential shock of the opening episodes, which depicted nothing less than the nuclear holocaust of an interplanetary human civilization, the show remained thrilling and very tense - almost as if there was a dark, constant undercurrent running through every single episode. At the same time, the introduction of both mystical and mysterious elements - BSG later became famous for it's \"circular view of history\" - captured my imagination. I still shudder thinking about the strangely meaningful, yet utterly senseless, dadaistic poetry of the human-cylon hybrids who have gone mad from what was never meant to be fused (\"End of line\"). The different models of the \"skin jobs\" are equally fascinating, especially after it dawns upon the viewer that each of these (slightly different) non-individuals follows the same patterns and maximes of behaviour (e.g. Lioben always lies).The same fascination extends to the human characters: One of my all-time favorites was William Adama, the intransigant patriarch, sometimes a fatherly caretaker, sometimes a ruthless military commander with tyrannic tendencies. (Take note of some of the later scenes where Adama and his XO Tigh engage into serious orgies of boozing that usually degerate into the spiteful ramblings of disappointed old men). The brilliantly acted Kara Thrace, whose inner struggles and desparation were almost palpable, is another great example of this show's memorable spectrum of characters.Bottom line: This show is a must-see for every fan of intelligent science fiction. It is also warmy recommended to anybody who does not fit this description."
    },
    {
      "username": "runamokprods",
      "userUrl": "https://www.imdb.com/user/ur6981752",
      "reviewLink": "https://www.imdb.com/review/rw2516101",
      "warningSpoilers": false,
      "date": "9 November 2011",
      "rate": "",
      "helpful": "19 out of 27 found this helpful.",
      "title": "Simply brilliant drama, not just sci-fi",
      "content": "One of my favorite television series of all time along with 'The Wire' and 'Breaking Bad'. Like 'The Wire' this is a complex, Dickensian study of human nature, not afraid of asking big questions, and meticulously plotted like a great novel, so that each episode is a chapter in a much larger whole. Just as 'The Wire' used the overly familiar cliché' world of the cop show to jump off from and shatter our preconceptions, and 'Battlestar Galactica' uses the sci-fi series, and the idea of human versus robot wars the same way. This is thinking person's sci fi, in the tradition of Arthur C. Clarke, or Isaac Asimov. It's about why we are how we are, what it means to be a human being, morality under constant pressure in times of war, fathers and sons, impossible loves, metaphors for modern and recent politics and real world situations. My wife, far from a sci-fi fan was hooked after 3 episodes, and we tore through 5 years of shows in just a few days. It's that addicting.The acting is all at least quite good, and some cast members are remarkable, creating characters full of depth, complexity and contradiction. The writing is terrific, allowing the characters to change and grow, but always in ways that make sense, creating seemingly inexplicable conundrums, only to find surprising, sometimes shocking – but ultimately logical and satisfying - ways to explain where they've taken us. The special effects are generally very impressive for TV, even if they're not really why you watch this show. It also has some of the most tense episodes of television I've ever seen, and some of the season enders left me completely wrung out and blown away. I was sad to get to the last episode, just as one is sad to finish a great book.Speaking of ending, the one serious let down for me was the very last episode. Certainly no disaster, but for perhaps the only time in the series, some of the answers felt disappointingly flat and simplistic. But that wasn't enough to take away from the tremendous esteem with which I hold the show. One that is surely worth your time."
    },
    {
      "username": "PeterWorthers",
      "userUrl": "https://www.imdb.com/user/ur1591989",
      "reviewLink": "https://www.imdb.com/review/rw1869508",
      "warningSpoilers": false,
      "date": "5 May 2008",
      "rate": "10",
      "helpful": "236 out of 395 found this helpful.",
      "title": "The Greatest Sc-Fi show ever, So say we all.",
      "content": "I am a die hard devoted Trekker. No other show can come close to the series I hold so dear to my heart.... or can it? I watched the mini series on sci-fi expecting to be disappointed. What happened in reality was a show I will honestly say is second to none, the best science fiction out there. The story lines are top notch, the struggles make you feel for the characters, you really get into this show. (that and I have never found a robot so hot before. Did I just say that out loud?) The way the camera moves makes you feel like you are looking out a port hole at the action outside. Its not like other shows, this is hard hitting, nitty-gritty sci-fi. Unlike what we have been led to think the future is not all bright and promising , the future is bleak, hard and depressing. The technology we thought would make our lives easier will in fact be the end of our lives (FEAR THE MACHINE!!) Bad toaster. It is 4 seasons (and final sadly) in and still as entertaining as ever. It will be a sad day for geeks everywhere when the series finale airs. But at least we can live in the knowledge that we were here to see the series to end all series. So Say We All."
    },
    {
      "username": "Ghostbusterx",
      "userUrl": "https://www.imdb.com/user/ur5173444",
      "reviewLink": "https://www.imdb.com/review/rw2153280",
      "warningSpoilers": false,
      "date": "6 November 2009",
      "rate": "10",
      "helpful": "417 out of 556 found this helpful.",
      "title": "Quite simply the best sci-fi show ever made",
      "content": "When George Lucas announced that he was to make the Star Wars prequels I had this preconception of a darker, better acted, and more more grown up version of the movies that were made in the late seventies - early eighties. Instead we got a bunch of kids movies, littered with some of the most terrible cinematic decisions ever put on celluloid.And then the re-imagined Battlestar Galactica came along, which I must add, I watched from start to finish only after the show had made it's debut on mainstream television.I was initially sceptical of whether this would be any good, but after having reached the finale I can honestly say that this is quite simply the best sci-fi show ever made. The scripts are top notch, the acting superb with a real heart and soul, and characters that, even with their faults, will be remembered with great affection by the viewers for many years to come.This is the template for all future TV shows. I't does not overstay it's welcome, knows when to stop, and constantly delivers fresh, new ideas as the seasons progress.Series 1 was a great introduction; series 2 built on the initial success and delivered some of the shows highlights; season 3 was awesome for the first half (until the writers strike kicked in just after half way - but still highly entertaining); and season 4 put the icing on the cake with what I consider to be a tremendous and satisfying end to this great series.The only downside was that I wished it could have continued, but I guess it is better to exit on a high and leave the crowd wanting more.For me this has stripped Star Wars of it's crown and raised the bar where although it may one day be equalled, will never be bettered.Awesome"
    },
    {
      "username": "eightman-06788",
      "userUrl": "https://www.imdb.com/user/ur65401393",
      "reviewLink": "https://www.imdb.com/review/rw5054677",
      "warningSpoilers": false,
      "date": "12 August 2019",
      "rate": "9",
      "helpful": "24 out of 34 found this helpful.",
      "title": "Just a wonderful series",
      "content": "If you are a sci-fi fan, it a must watch. The writing and casting is fantastic. Great ensemble, great plot."
    },
    {
      "username": "KineticSeoul",
      "userUrl": "https://www.imdb.com/user/ur22171966",
      "reviewLink": "https://www.imdb.com/review/rw3468154",
      "warningSpoilers": true,
      "date": "12 May 2016",
      "rate": "8",
      "helpful": "10 out of 14 found this helpful.",
      "title": "A sci-fi space opera that really delves into humanity",
      "content": "So my friend tried to get me into this show and for the most part, I am glad he did. This show was like a less nihilistic, bleak and hopeless sci-fi version of \"Game of Thrones\" in my opinion. While having space wars, it deals with philosophy, theology, ex machina, motives and ideals. While the peoples have to deal with seeking peace, spirituality, inner longing and desires while dealing with their own mortality. The story does get a bit more complex as the show goes on, when the line starts to get less binary. And you start to see things from different perspectives and what makes each of the character tick. I didn't particularly like most of the characters and they switched from being likable to being way too dramatic, pretentious and annoying. But then there are episodes that make those characters shine and brings out the parts of heroic selflessness while also standing their ground. So after finishing the show I thought about it a bit and I thought that is what makes them human. Because not everyone can be completely likable 100 percent of the time. But when it comes time to step up to the plate, the ones that has at least some integrity will step up. The CGI is a bit outdated, but the space battles really isn't the core of the show or the most interesting parts when it comes to the story. I would still like to see a similar version of this show except with mechs. The show does get a bit repetitive and really starts to feel like it's dragging after few episodes into the 3rd season. However near the end of the 4th season, it did well done job of trying to wrap everything up. I even liked the ending, because despite it being a beloved show by many they didn't try to wrap things up in a neat little box. But still gave a sense that there is still hope...And I liked that. Overall, this is a pretty darn good sci-fi space opera that is worth digging into.8.3/10"
    },
    {
      "username": "generationofswine",
      "userUrl": "https://www.imdb.com/user/ur14520497",
      "reviewLink": "https://www.imdb.com/review/rw4613707",
      "warningSpoilers": false,
      "date": "29 January 2019",
      "rate": "10",
      "helpful": "15 out of 23 found this helpful.",
      "title": "An Honest Review",
      "content": "I can understand the initial backlash against Starbuck, it seemed like an unneeded change in a reboot that might be full of unneeded changes that could take away from the original in the same way that \"V\" would.Only the reboot turned out to be legendary and though I feel appropriately dirty saying it--for love of the 1978--but 2004 Starbuck turned out to be so much better than the clean ladies man. She was tough and grungy and awesome in the vein of the top shelf sci-fi heroes.And now there is a new political backlash, years later, that seems to hate for the reasons of destroying anything that has a nerd following and I don't understand the need for that.Anyway, leave that political junk at the door, sit down, and bing a series that is as beautiful as it is emotional and adventurous. It marks a high point for everything epically great that science fiction can be."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2854246",
      "warningSpoilers": true,
      "date": "20 August 2013",
      "rate": "9",
      "helpful": "14 out of 22 found this helpful.",
      "title": "Reboot is so much more original than the original",
      "content": "The aging Battlestar Galactica is destined to be decommissioned. The 12 colonies are surprised by the Cylons who launched an all-out attack. The attack devastates the new defense computers. Galactica's older technology is immune. The crew led by Admiral William Adama salvages the last of humanity as they journey towards the fabled 13th colony, Earth.The original 1978 TV series is a camp classic. Coming after the success of Star Wars, everybody was simply trying to copy. While it worked as TV, the original TV show did degenerate rather quickly and lasted only one season. It has since become a sci-fi cult classics. So the question was would a reboot even work. The genius here is to take the 1978 TV show seriously and the result is a dark moody concoction.Along with established stars like Edward James Olmos and Mary McDonnell, as well as Brit imports like Jamie Bamber, we're introduced to newbie Katee Sackhoff as a sexy now-female Starbuck. Add in new battle scene visuals and human form Cylons. It is edgy and deep. It takes risk and often is rewarded. This is now the new classic."
    },
    {
      "username": "Laight",
      "userUrl": "https://www.imdb.com/user/ur0350076",
      "reviewLink": "https://www.imdb.com/review/rw3292601",
      "warningSpoilers": true,
      "date": "7 August 2015",
      "rate": "8",
      "helpful": "16 out of 25 found this helpful.",
      "title": "Most Schizophrenic TV Show Ever",
      "content": "The first season of Battlestar Galactica was terrific.The second season was really good.The third season was good. The fourth season was terrible. Absolutely terrible. The creators lost their focus and turned out episode after episode of drivel. What had been one of the most extraordinary story-driven shows in the history of TV turned into a character drama -- but these people were never characters. What made them, and the series, so powerful is that they were archetypes. They each stood for a different kind of human behavior pattern, and we watched as the actors each played out that behavior in the face of a catastrophic event... and a compelling plot.Then, in the last season, for no good reason, the show places character over story and goes so far off the rails that it basically becomes unwatchable. These were never real characters. Abandoning all semblance of plot at this point made no sense at all. The show fell apart.Such as shame to see a show go from almost perfect to unwatchable.And finally: just a note about the deservedly despised ending: on top of all the other mistakes...um...well... they set almost 40,000 people from an advanced civilization free on earth in 150,000 BC and expect them to live for more than a week? What are they going to eat? Where are they going to live? How are they going to survive all the infections and other hazards of life back then in BC times without medicine or guidance? And on top of that, there is no fossil record of all their metal technology whatsoever in the history of archeology, but science is able to trace their lineage back to microscopic mitochondria? And finally finally, that last scene in contemporary Times Square with Caprica 6 and Gaius may have been the absolute last worst three minutes of a show in history. And then with the final camera shots, it all turns out all the show was ever really about little mechanical toys from Japan that will some day destroy earth. Yeah. They should have ended the show in season 3."
    },
    {
      "username": "lordzedd-3",
      "userUrl": "https://www.imdb.com/user/ur5344228",
      "reviewLink": "https://www.imdb.com/review/rw1583813",
      "warningSpoilers": true,
      "date": "27 January 2007",
      "rate": "1",
      "helpful": "525 out of 1,123 found this helpful.",
      "title": "What a load of PC BS",
      "content": "That' right, a bloody soap opera, what the hell were they thinking? Let's do the check list of what they did right with this Galactica remake, I can count that on one hand. Better effects and cooler Cylons. That's it! What's with this Politically Correct B.S.? I'm all for having female pilots. But why make major changes on key characters, I mean Adama was Spanish, Starbuck wasn't a woman and Boomer was a African American Male, not a Asian American Female. That's one, two killing off Boomer for a Cylon replacement. Then she falls for a human and has a baby, how much of soap opera do you call that? Next, the Cylons were created by a race of alien reptiles which they turned on and made extinct. Like they want to do to us. Did want to be too sci-fi-ish? Did they watch the original show, it was a science fiction. It's suppose to be a science fiction! Now let's talk about the bullets. Lasers are sci-fi anymore, they actually exist! Plus, it's not sci-fi about laser battles in space, it's science fact that a bullet would not work in a area of non-gravity, like SPACE! So, having a space battle with bullets makes no sense what so ever. If you got hooked on this crapper then stop watching it. Go cold turkey and realize that the show is a turkey. I give it...THE NOOSE!"
    },
    {
      "username": "joachimokeefe",
      "userUrl": "https://www.imdb.com/user/ur1148847",
      "reviewLink": "https://www.imdb.com/review/rw1974979",
      "warningSpoilers": false,
      "date": "13 November 2008",
      "rate": "1",
      "helpful": "247 out of 521 found this helpful.",
      "title": "Melodramatic adolescent pap of no value, depth or significance whatever.",
      "content": "I started to watch BSG from the beginning with no assumptions or expectations, vaguely remembering the lame Lorne Greene original. I'd been told that it was great drama, asking deep questions about humanity and existence, and that it was absorbing and involving entertainment.Well excuse me, it's not any of those things. It's not even 'so bad it's good'. To gain my interest, a drama has to have characters that intrigue, or that I quickly love or hate, or to consistently subvert my expectations of the story or of the genre, and preferably all of these. It has to possess something I feel strongly about. All BSG has is third-rate actors with dreadful hairdos interacting with meta-cut-price sets while reciting pretentious, predictable blather, and my strongest reaction is to notice the flaws in it. An example: Commander Adama, or the actor playing him, does not know how to use his glasses. You're either long-sighted or short-sighted: Adama is both or neither, depending on whether the actor needs a prop or not. Why does this jar? you might ask - because I don't care whether Adama lives or dies: the character is so shallow and the script so turgid, that my disbelief is never suspended. His crew love him, obviously, but why? He just continues to come across as a miserable cuss with bad skin, and that's down to actor, director and script being awful. Maybe they love him because he's less miserable than the ugly miserable deputy from Central Baldy Casting for Stargate Villain Rejects. Later Adama doesn't shave for days, but his Tony Curtis hairdo remains pristine. (Is super-hold hair gel part of the Galactica retro-regime?). Nobody thought about this in production. Obviously they didn't care, any more than the producers did that they were doing anything but taking the money for the minimum effort. Apparently they thought it was a bold move to make Starbuck female. If it was, that's the only bold thing they did.I would even root for the Cylons if they appeared the least bit menacing, or interesting, but they are a formulaic assembly of clichés, the CGI being totally overwrought; and as for the 'conflicted' master scientist character - 'wuss' isn't contemptuous enough to describe this pathetic attempt to reinvent the ultra-camp Dr. Smith off 'Lost In Space'. John Malkovich might have done something with the part, I surmise, but all these 'Days of Our Lives' jobbing actors play it so earnestly. I cannot find the words to describe how badly written and portrayed his MILF Cylon sidekick is. Do not waste your time or money with this tedious, humourless (sic), atrocious tripe."
    },
    {
      "username": "RiffRaffMcKinley",
      "userUrl": "https://www.imdb.com/user/ur9480570",
      "reviewLink": "https://www.imdb.com/review/rw1627876",
      "warningSpoilers": false,
      "date": "31 March 2007",
      "rate": "1",
      "helpful": "455 out of 977 found this helpful.",
      "title": "Worst \"Update\" of Classic Television in History",
      "content": "And I mean it. The new \"Battlestar Galactica\" lacks all the charming, cheesy, enjoyable fun of the criminally underrated original. Wait-- I shouldn't be calling it the original. It was the only \"Galactica\" we need! Sorry, gentlemen, but Cylons are hideous, polished robots-- not Playboy centerfolds. And Starbuck is a man, not a woman. Nothing good gets translated from the original into this heap of rubbish that remains one of the luckiest televised serials of all time. On another level, let's talk about those performances.... Do these people even care? Are they trying to get home, or are they trying to get to wherever their next paycheck-- which they by no means deserve for this giant trash pile-- is waiting cozily for them? I call upon all people who have respect for television classics to boycott one of man's worst ideas in recent history."
    },
    {
      "username": "rhob1960",
      "userUrl": "https://www.imdb.com/user/ur12222587",
      "reviewLink": "https://www.imdb.com/review/rw2134924",
      "warningSpoilers": false,
      "date": "1 October 2009",
      "rate": "10",
      "helpful": "128 out of 206 found this helpful.",
      "title": "One of the best SF Series ever",
      "content": "When I heard that the Science Fiction Channel (I refuse to acknowledge their new name), I was less than thrilled. The original series was, to put it bluntly, crap. They took a great idea, the near genocide of a species and let it rot. Rather than keeping it within the boundaries they set, Glen Larson and company made it basically, the fugitive in space. I won't go into how there was no science in this at all, no jump engines, no warp, no FTL of any kind. Of how they knew nothing about any astronomy, or the stupid measurements that meant nothing. The writing was horrible, many episodes were just rip offs of movies, the acting barely tolerable. So I was less than thrilled. However, when I heard that Ron Moore, one of the geniuses behind Deep Space Nine, the best of all the Star Trek spin-offs, was doing it. I was interested. Then, when I saw the miniseries, I was hooked. Galactica is a brilliant show that brought humanity back to Science Fiction. As the show went on and more and more plot threads were revealed, the show was shown to be complex, the kind of TV that's been lacking and can only be held up with excellent shows like Dexter and Breaking Bad. Brilliant in every aspect, Galactica is the kind of show that cannot be understood in one viewing, it has to be watched again and again. Galactica led the way for a resurgence of intelligent Science Fiction, with shows like Fringe and Flash Forward following it's example. Four seasons was for some, too short, but for me a perfect length. I eagerly await THE PLAN."
    },
    {
      "username": "huh_oh_i_c",
      "userUrl": "https://www.imdb.com/user/ur3303928",
      "reviewLink": "https://www.imdb.com/review/rw1329513",
      "warningSpoilers": false,
      "date": "31 March 2006",
      "rate": "",
      "helpful": "555 out of 1,199 found this helpful.",
      "title": "very poorly written!",
      "content": "Have you also noticed that virtually EVERY negative comment has an approval of 50 percent? This is very strange. It's almost always HALF of the people who saw the comment who agree that the negative comment was useful to them. Very tricky. Why is that? It's almost as if the producers have some poor intern watching this page and letting him click on 'postive' versus every time some clicks on 'negative'?This show is crap and I for one am glad that so many peeps think it's crap too. They really make heinous errors against Science Fiction general 'guidelines' (and even regular story writing), which come down to: 1. Don't make characters' motivations earth-like 2. Most certainly, don't make characters' motivations American-like. 3. EVEN MORE certainly, don't make characters motivations like mid-western bible-belters!!! Above ALL: Don't let them say 'JESUS' as a swear word. Not because it's blasphemous (I could care less), but because it is insulting your audience' intelligence in the worst possible way: How can it be that a culture thousands years older than ours know about Jesus? 4. Most certainly, don't make characters dress like Westerners/Americans. I mean, 20th century SUITS??? that presidential aide, the Security Detail? Handguns? Get real. Half the fun of watching Star Trek and Star Wars is the cool red and black uniforms and Natalie Portmans brilliant lavish dresses. I am not against the sex, which is largely invisible anyway, actually in the first 13 episodes I saw only one time peeps having sex, Baltar is just imagining it and wanking of, so ... For all those red staters, crying for a G-rating, go watch Nickelodeon or something.So the art in making good Science Fiction is to create character which have motivations which are truly alien to us. For example, writing about aliens that had evolved from plants, would have very different motivation for doing anything than us. And the most heinous error they made, is the bleaching of the show. I mean, there are virtually NO black characters in this show. This is unacceptable, especially since the black characters that ARE on the show are negative and/or very flat. The show is very 20th century American in THAT."
    },
    {
      "username": "tfc",
      "userUrl": "https://www.imdb.com/user/ur0695014",
      "reviewLink": "https://www.imdb.com/review/rw1015883",
      "warningSpoilers": true,
      "date": "6 February 2005",
      "rate": "5",
      "helpful": "603 out of 1,229 found this helpful.",
      "title": "Who cares if Humans are good or Cylons are bad if the plot sucks vacuum?",
      "content": "Alas, after reading the comments, most users believe the new Battlestar Galactica (BSG) is fantastic and riveting, I must have missed something. Having seen almost every episodes of the new BSG series, I have come to the following conclusion. The new BSG has been re-imaged and reinterpreted so radically from the old BSG that it is mostly futile to debate which series is better or worse. The new BSG will stand on its own merits and we should totally ignore the old BSG. That being said, what do I think about the new BSG? It is a nice scifi show. It's not great, it's not bad, it's just . . . nice. There are some nice computer FX of battles, Space ships, robots, and scenes. There is just enough action, angst, \"love\", humor, death, and misery in each episode. The actors are doing a nice job with the materials given. The story plots are nice scifi formulas with scifi type words added to the nice dialog. The humans are nice and the Cylons are nice. Oh, how nice. Another hour of my life, gone.To be blunt; each new BSG episode to date is like big servings of meatloaf plots (with bits of FX bell peppers added) selected from the vast smorgasbord of scifi. Scifi with little thought or plot. Scifi lite. This belief comes from several items I have noticed since the beginning. The main one is, in the attempt to make the new BSG a very human, realistic, gritty, and \"adult\" (i.e. sex/language) story, I now could care less about the antihero characters personal problems, their quirks or their dismal fate. In an attempt to make the Cylons more mysterious, insidious, and enigmatic (yet some how threatening), they are tedious at best. If the new BSG sets become any more low tech, bleak and grey, the new BSG might as well start filming indoor scenes in an old steel mill and save some money. In the fight between the Human and Cylons, I would cheer for a double kill and, if the Cylons won, oh well. This laissez-faire attitude comes from BSG's general lack of a interesting or defined good vs. evil struggle. It is my opinion that virtue and morals are best shown when contrasted against their opposites. The greater the evil, the more an average person seems heroic (i.e. Lord of the Rings). This may seem simplistic but, it's the bad guys who make the story. Having antihero types fighting former pleasure robots who found God and want laid, does not inspire heroic epics but apathy. I wonder, what if we are really suppose to like the Cylons? And, humans are really the bad guys? Going out on a limb, I bet the God of the Cylons is some big omniscient mainframe. Nevertheless, if this series happens to come near a point, or plot, could someone let us know. In the future, I hope this show succeeds in proving me wrong and I need to recant my words.If I had a wish list to improve the new BSG:Commander Adama: lighten up, crack a smile, and get a dog for a friend rather than Tigh. Read a \"Book.\" President Roslin: Enjoy your power, delegate your light work, leave Adama alone for five seconds and get a new doctor with some modern equipment. Starbuck: Relax, take a bubble bath, we know you're tough. Quit trying to out drink Tigh, out do Number Six, and out fly Apollo. Apollo: Nothing really comes to mind. Baltar: Stop letting Number Six play with your slide rule and get to work you sissy! Number Six: Stop being a fashion model, leave Baltar's naughty bits alone, and be an evil Cylon. Boomer: Stop pouting and get a life outside the hanger. Col. Tigh: When all the booze runs out and you stop being salty, go find God, the Cylons did. Cylons: Show me the money! If you Cylons have evolved, prove it. So far there seems to be enough Cylons to fill a bus and there are only a few Basestars. CG FX can do multiples robots and basestars at little or no extra cost. Cylon/Human babies, I hope this idea does not die in the crib (ha-ha). Writers: Tell me a entertaining SCIENCE FICTION \"what if\" story. Not some revamped soap opera that happens to take place in space with special effects, CG, and strange words tossed in as an after thought. Show some color, get rid of the ties, do not over use \"frak\" or off the shelf technology. Every time you try to cut corners, it shows."
    },
    {
      "username": "ebiros2",
      "userUrl": "https://www.imdb.com/user/ur3225430",
      "reviewLink": "https://www.imdb.com/review/rw1439467",
      "warningSpoilers": false,
      "date": "5 August 2006",
      "rate": "1",
      "helpful": "391 out of 878 found this helpful.",
      "title": "Unhealthy aspects of this show requires some thoughts",
      "content": "I don't know of any other sci-fi series that polarized its viewer's opinion the way this show did, and when I looked at the bonus material on the DVD, I could now see why Ron Moore was so stressing its virtues, because comments in the bonus material was a direct rebuttal to the criticisms that was going around on the internet.First of all, let me tell you that I had nothing against this series or Ron Moore when the series started. I've actually paid $45 and bought the entire season 1 DVD set not knowing what to expect, and Ron Moore is the one who wrote one of my favorite Star Trek TNG's episode \"Tapestry\", so I had no bias in that regards either, but....This series sends negative message to the audiences who may still be at their young and impressionable age. The negative messages are the following: If you are angry, and troubled, then somehow you are a serious (and important) person ( take the characters of Adama, Tigh, and Roslyn, they are all harboring a dormant hostility 100% of the time. Other characters are also on and off hostile overtly or covertly ). If the plot is about \"unexpected danger\" somehow it's more realistic (not only the battle situation is almost 100% constructed out of this one theme, the interaction between people are almost 100% constructed out of this plot ploy also). People who may turn against you on a dime are depicted as the \"norm\" in this series. I don't want to live in a society where people would have an idea that such society is a normal society. This BSG series is filled with these unhealthy paradigms. The visual tone is rehash of all the \"darker\" Sci-Fi fantasies of the '90s, but what Ron Moore has missed was that in the 2000s, the mood is lightening up much more, and this reliance on \"darkness\" (as he was proudly saying in the DVD bonus material \"It is darker. It is more story driven.\") is starting to be a passé. Take \"Batman Returns\" for instance. The visuals of the Gotham City is dark and gloomy, but the people in the story have more optimistic outlook, and are genuinely trying to make matters better, which gives hope that even in a dump there's hope if there are few good people like this.I don't want our youth (and adults) to think that if they acted \"angry\" and \"troubled\" people around them will see them as serious, and important person, but this program is filled with this kind of innuendos. In the real society, such people are just \"unhappy\" people who also makes other people unhappy, and I hope television shows which are viewed by its audience almost uncensored would stop depicting such characters as \"heros\". My opinion is ditto for the plot. If it's filled with people in trouble, then somehow it's a \"story driven\" plot line. Hogwash.Other unspeakable inconsistencies of just making things look like they're from antique auction have been mentioned by number of reviewers here, so I won't go into them, but I am against the philosophy of just making things look \"ugly (or old)\" and equating that as being more realistic.The original BSG at least had quality that didn't just make things more ugly and call it realism. It might have been cheesy by today's standard, but they did take a poke at the best vision of the future that they could have at the time and presented it to the TV audience. I know that people who saw it the first time was awed by its visual effects. For its effort at depicting the best future technologies, I think the original BSG series deserves an A+. I can't say the same for this BSG series. Everything is a borrowed idea from somewhere, and it tries to say that it's more realistic by making things uglier. It gets a C- for originality.I think many of the people who had negative opinions about this show have also sensed the unhealthy undercurrent of this show. I hope that Sci-Fi channel and all future sci-fi series producers will take a serious look at this and try to produce a genuinely original product that is of their own idea and effort which really does convey original message to its audience.Finally for one interesting comment another reviewer have made: Why are negative comments for this show here at IMDb all have near perfect 50/50 approval and disapproval ratio ? It makes you wonder doesn't it ?p.s. It's now 2011, 5 years since I've wrote the original comment, and I could say that I was right about my original assessment that these guys had no originality, from the course that the series seems have taken after season 2 - it just fizzled and fell apart as far as I can tell. My conclusion that I wrote 5 years ago still stands:I hope that Sci-Fi channel and all future sci-fi series producers will take a serious look at this and try to produce a genuinely original product that is of their own idea and effort which really does convey original message to its audience. - with good quality."
    },
    {
      "username": "marcogeracao-91704",
      "userUrl": "https://www.imdb.com/user/ur92998418",
      "reviewLink": "https://www.imdb.com/review/rw4731850",
      "warningSpoilers": false,
      "date": "19 March 2019",
      "rate": "10",
      "helpful": "14 out of 18 found this helpful.",
      "title": "You decide",
      "content": "I was immediately hooked after the pilot, it was that simple. I am a scifi fanatic but, as I grew up, I started demanding more complex movies and series beyond that flimsy scifi rhetoric and technobabble. BSG has it all and keeps it for 4 seasons. In fact, I'm yet to see something even close to BSG quality on TV.People will try to find weaknesses and point out plot holes. They usually end up begging questions again and again or giving opinions about how it should have been made. Come on... that's laughable to say the least. It's all fallacious talk.But please, I dare you, watch the pilot and tell me you had the guts to not keep watching the show."
    },
    {
      "username": "prateekgupta-91531",
      "userUrl": "https://www.imdb.com/user/ur62245246",
      "reviewLink": "https://www.imdb.com/review/rw4935419",
      "warningSpoilers": false,
      "date": "15 June 2019",
      "rate": "10",
      "helpful": "109 out of 128 found this helpful.",
      "title": "A Cult Classic, I'd choose over GoT",
      "content": "This is a cult classic, that I believe everyone should watch. I was in the middle of the third season when GoT final season aired, and I couldn't put this down long enough to watch GoT!It's intense, deeply philosophical, and felt like something I was willing to commit more energy into than into any relationship I've had, ever! (While that says a thing or two about me, it definitely says A LOT about this series)"
    },
    {
      "username": "neacorp",
      "userUrl": "https://www.imdb.com/user/ur20178964",
      "reviewLink": "https://www.imdb.com/review/rw2046591",
      "warningSpoilers": true,
      "date": "2 April 2009",
      "rate": "2",
      "helpful": "124 out of 239 found this helpful.",
      "title": "A horror fantasy drama.",
      "content": "When they aren't fighting killer robots they fight themselves, but at least the writers showed nicely how people crack in a confined space after a disaster. As long as you try to not yell at the shaky camera you can still watch this.I just finished watching the last episode and I was incredibly shocked: \"That's it?!\" Yes, a horrible drama with fantasies instead of science. Oh it started swell as Lost, but at the end of season 2 it got lamer and lamer. They should have had an idea how they would end it all from the start. The writers deserved none of the pay for what they scribbled for a script after the writers strike.It rocketed awesomely of into deep space. A handful of ships with the last humans trying to find Earth while escaping killer robots. It was nice, it was intriguing, but then it went too far. Suddenly people started having visions how to find Earth and stuff. By the end fantasy magic overwhelmed science.How do you find a killer android? Do you put a metal detector to its head and hear it go BING? No. You need blood samples that only one man can decode. So the androids aren't really androids, just humans with a wireless Internet connection who think they are robots.In the end they took some lame stuff out of Star Trek. Lots of class M planets around. ENDLESS amount of fighters and bombers and like in Voyager they only build one from scratch. Same goes for troopers and pilots. I understand where you get volunteers, but where do you get the gear, guns, BULLETS and missiles?! Killer robots ALWAYS know where to find them. Stuff like this tends to come up often. I still can't believe they managed to cram 48000 people, a cat and a dog into that tiny fleet.The drama mostly rotated around the elite of the fleet: admiral, president, friends and family. Neglecting saving the human race they were selfish to order suicide missions. They are so ignorant, selfish and dumb that I started hating them all so much I laughed when they found Earth to be a post-apocalyptic wasteland. What to do next? How about go looking for a neighboring habitable planet and settle down? No. We wait till a little girl gets stolen, and we send the last strike force to rescue her. More died in the process.The end was baby sh**. Oh they eventually found the real Earth by randomly pushing buttons in a musical pattern. Ironically the planet was ONE jump away from a black hole and the main killer robot base. And Earth was inhabited by tribal humans who are our ancestors. And it turns out that all the pixies in Baltars and 6's heads were angels (or maybe demons). Starbuck was actually a ghost for an entire season. Boomer kept sabotaging stuff for 3 seasons but was redeemed in the end. And they sent all their ships into the sun for no sane reason. And the friendly killer robots who couldn't reproduce or think by themselves flew away to explore space. Yes, and I'm a toddler who likes these sort of stories.Buy a tripod you maniacs! And never show this fantasy for a science again! I feel like I wasted several month of my life on this show. I never saw the original and I don't want to now."
    }
  ],
  "errorMessage": ""
}