{
  "imDbId": "tt0407362",
  "title": "Battlestar Galactica",
  "fullTitle": "Battlestar Galactica (TV Series 2004–2009)",
  "type": "TVSeries",
  "year": "2004",
  "episodes": [
    {
      "id": "tt0519761",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "33",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc0MzUyNzYyNV5BMl5BanBnXkFtZTgwNjY5MjI4MjI@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "14 Jan. 2005",
      "plot": "The Galactica and the other remaining ships - with about 50,000 people aboard them all - are being pursued by the Cylons. They are forced to jump into hyper space every 33 minutes. Somehow, the Cylons know where they are going and appear exactly 33 minutes after the Galactica arrives. The crew hasn't slept for over 130 hours now and everyone is exhausted. They rejoice when they finally make a jump and the Cylons fail to appear at the 33 minute mark. They are also prone to make mistakes and realize they've left behind a ship, the Olympic Carrier, with 1300 passengers ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "3144"
    },
    {
      "id": "tt0519792",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "Water",
      "image": "https://m.media-amazon.com/images/M/MV5BMjM4MjY0NTI4N15BMl5BanBnXkFtZTgwODgxMTEzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "14 Jan. 2005",
      "plot": "President Roslin arrives on Galactica as Boomer's Cylon side asserts itself, forcing her to sabotage Galactica's water supply against her will. A series of explosions leads to the loss of 60% of the water reserves and Commander Adama is compelled to introduce rationing and begin a search of nearby planetary systems for any H20 deposits.",
      "imDbRating": "7.7",
      "imDbRatingCount": "2380"
    },
    {
      "id": "tt0519763",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "Bastille Day",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU0MzA0MzE0Ml5BMl5BanBnXkFtZTgwOTgxMTEzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "21 Jan. 2005",
      "plot": "Deciding to use the thousand prisoners on a prison transport ship to mine the ice on the planet they've found, Galactica's plans are upset when a political prisoner onboard leads an uprising, taking hostages. He questions the legitimacy of Roslin's government and demands free elections to be held in the fleet.",
      "imDbRating": "7.6",
      "imDbRatingCount": "2302"
    },
    {
      "id": "tt0519762",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "Act of Contrition",
      "image": "https://m.media-amazon.com/images/M/MV5BNTEzNDE5ODE5NV5BMl5BanBnXkFtZTgwNDUyMTEzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "28 Jan. 2005",
      "plot": "There's a party on Galactica's flight deck as Flat-Top just had his thousandth landing. Something goes terribly wrong however when a drone accidentally goes off and explodes in a group of pilots. 13 are dead. During the ceremony Kara Thrace starts thinking about her dead fiancée Zak Adama. And those memories even get clearer when Adama orders her to start training new pilots. She seems very uncomfortable in doing so. The favor she did for Zak by letting him pass basic flight seems to bother her more and more. Angrily she stops training pilots after just one day. ...",
      "imDbRating": "7.7",
      "imDbRatingCount": "2228"
    },
    {
      "id": "tt0519793",
      "seasonNumber": "1",
      "episodeNumber": "5",
      "title": "You Can't Go Home Again",
      "image": "https://m.media-amazon.com/images/M/MV5BMTY4NDAyNTE4Nl5BMl5BanBnXkFtZTgwMTIyMTEzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "4 Feb. 2005",
      "plot": "Starbuck has been shot down over a barren moon, and must be rescued before she runs out of oxygen. Adama become obsessed with trying to save her even when all hope seems lost, putting the fleet at risk. Meanwhile, Starbuck finds the Cylon Raider she shot down, and tries to learn how to fly it so she can escape.",
      "imDbRating": "8.2",
      "imDbRatingCount": "2283"
    },
    {
      "id": "tt0519778",
      "seasonNumber": "1",
      "episodeNumber": "6",
      "title": "Litmus",
      "image": "https://m.media-amazon.com/images/M/MV5BMjIzOTU1ODkzMl5BMl5BanBnXkFtZTgwMDUyMTEzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "11 Feb. 2005",
      "plot": "A humanoid Cylon straps himself with explosives and commits a suicide bombing in a crowded hallway on Galactica. Roslin and Adama are forced to publicly reveal that the Cylons now have models that look like humans, and a wave of paranoia spreads over the fleet as everyone starts being suspected of being a Cylon.",
      "imDbRating": "7.6",
      "imDbRatingCount": "2100"
    },
    {
      "id": "tt0519786",
      "seasonNumber": "1",
      "episodeNumber": "7",
      "title": "Six Degrees of Separation",
      "image": "https://m.media-amazon.com/images/M/MV5BMzc2ODU1MzgxMF5BMl5BanBnXkFtZTgwMzgxMTEzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "18 Feb. 2005",
      "plot": "After Baltar has an argument with the vision of Number Six he sees in his head, a physical copy of Cylon model Number Six shows up in Galactica's CIC claiming to be a woman named Shelley Godfrey who has evidence that proves that Baltar has betrayed humanity...except that she's trying to frame him for an act of pre-attack sabotage.",
      "imDbRating": "7.7",
      "imDbRatingCount": "2075"
    },
    {
      "id": "tt0519769",
      "seasonNumber": "1",
      "episodeNumber": "8",
      "title": "Flesh and Bone",
      "image": "https://m.media-amazon.com/images/M/MV5BZTBjOTc5ZDktODkzZS00MGE1LWEwNjgtNDRhN2YwOGI1NjhiXkEyXkFqcGdeQXVyMzE5MDUxODM@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "25 Feb. 2005",
      "plot": "A humanoid Cylon is captured in the fleet, a copy of the Leoben model, who claims that he has planted a nuclear bomb in the Fleet before he was captured. Starbuck is tasked with interrogating him, which soon becomes a battle of wills as Starbuck has her marines to torture the Cylon to try to break him.",
      "imDbRating": "8.0",
      "imDbRatingCount": "2083"
    },
    {
      "id": "tt0519790",
      "seasonNumber": "1",
      "episodeNumber": "9",
      "title": "Tigh Me Up, Tigh Me Down",
      "image": "https://m.media-amazon.com/images/M/MV5BMjE0OTg4MDQ3NF5BMl5BanBnXkFtZTgwMzQyMTEzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "4 Mar. 2005",
      "plot": "After the interrogated Cylon gave Roslin the idea that Adama might be a Cylon, Roslin becomes suspicious of him. Unexpectedly, Colonel Tigh's estranged wife Ellen turns up alive in the fleet, apparently miraculously, raising the possibility that she might be a Cylon.",
      "imDbRating": "7.5",
      "imDbRatingCount": "2041"
    },
    {
      "id": "tt0519789",
      "seasonNumber": "1",
      "episodeNumber": "10",
      "title": "The Hand of God",
      "image": "https://m.media-amazon.com/images/M/MV5BNjU2MDcyNTk4MV5BMl5BanBnXkFtZTgwNTEyMTEzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "11 Mar. 2005",
      "plot": "The fleet is running out of tylium fuel and will soon not have enough to keep running from the Cylons, when they find an asteroid with several years worth of tylium ore...unfortunately, the Cylons have already built a mining base on it.",
      "imDbRating": "8.4",
      "imDbRatingCount": "2085"
    },
    {
      "id": "tt0519765",
      "seasonNumber": "1",
      "episodeNumber": "11",
      "title": "Colonial Day",
      "image": "https://m.media-amazon.com/images/M/MV5BNjI0NDEwMTQ0OV5BMl5BanBnXkFtZTYwNjczNzEz._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "18 Mar. 2005",
      "plot": "President Roslin has rebuilt a new Quorum of Twelve, the legislative branch of the government, but terrorist leader/political dissident Tom Zarek is elected as a member, and immediately motions that the Quorum vote to appoint a new Vice President, and runs for the office.",
      "imDbRating": "7.6",
      "imDbRatingCount": "1952"
    },
    {
      "id": "tt0519774",
      "seasonNumber": "1",
      "episodeNumber": "12",
      "title": "Kobol's Last Gleaming: Part 1",
      "image": "https://m.media-amazon.com/images/M/MV5BMzMyMjcwNzc5NV5BMl5BanBnXkFtZTgwMzUyMTEzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "25 Mar. 2005",
      "plot": "Galactica stumbles upon Kobol, the long-lost home world of humanity that the 13 Tribes came from, which legend says holds the only clues to the location of Earth. Roslin convinces Starbuck to steal the captured Cylon raider and return to Cylon-occupied Caprica with it to retrieve a religious artifact that will unlock the secrets on Kobol.",
      "imDbRating": "8.3",
      "imDbRatingCount": "1996"
    },
    {
      "id": "tt0519775",
      "seasonNumber": "1",
      "episodeNumber": "13",
      "title": "Kobol's Last Gleaming: Part 2",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ0NzM4MzkwOV5BMl5BanBnXkFtZTgwNDQyMTEzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "1 Apr. 2005",
      "plot": "Infuriated that Roslin usurped his command by ordering Starbuck to steal the captured Raider, Adama decides that his only option is to storm Colonial One with marines and terminate her presidency. Starbuck reaches Caprica and finds the Arrow of Apollo in a museum, but she has to go through a copy of Number Six to get it.",
      "imDbRating": "8.8",
      "imDbRatingCount": "2154"
    }
  ],
  "errorMessage": ""
}