{
  "imDbId": "tt0407362",
  "title": "Battlestar Galactica",
  "fullTitle": "Battlestar Galactica (TV Series 2004–2009)",
  "type": "TVSeries",
  "year": "2004",
  "episodes": [
    {
      "id": "tt0993910",
      "seasonNumber": "4",
      "episodeNumber": "1",
      "title": "He That Believeth in Me",
      "image": "https://m.media-amazon.com/images/M/MV5BMTA4MjQ4Nzg2NTleQTJeQWpwZ15BbWU4MDc4MDAyMzIx._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "4 Apr. 2008",
      "plot": "During a seemingly hopeless battle, Kara Thrace appears in a pristine Viper, claiming that she has been to Earth and can lead the Fleet there -- but the terminal Laura Roslin believes otherwise. Meanwhile, four of the so-called Final Five are forced to tackle the repercussions of their newfound nature, while Gaius Baltar discovers he has a commune of nubile female cultists who believe him to be an agent of the \"one true God\".",
      "imDbRating": "8.4",
      "imDbRatingCount": "1838"
    },
    {
      "id": "tt0993921",
      "seasonNumber": "4",
      "episodeNumber": "2",
      "title": "Six of One",
      "image": "https://m.media-amazon.com/images/M/MV5BMjMyMjkxMDg1OV5BMl5BanBnXkFtZTgwMTExMDIzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "11 Apr. 2008",
      "plot": "Starbuck (Katee Sackhoff) and Laura Roslin (Mary McDonnell) face off with a gun between them, Lee Adama (Jamie Bamber) says goodbye to the Galactica, violent conflict breaks out between the seven models aboard Cylon Basestar, and Gaius Baltar (James Callis) is directly pulled into the \"Final Five\" situation.",
      "imDbRating": "7.9",
      "imDbRatingCount": "1572"
    },
    {
      "id": "tt0993925",
      "seasonNumber": "4",
      "episodeNumber": "3",
      "title": "The Ties That Bind",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU3OTkyOTk1Ml5BMl5BanBnXkFtZTgwMDExMDIzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "18 Apr. 2008",
      "plot": "The aftermath of a coup among the Cylons leads to further violence, Lee finds himself facing off against Roslin during his first meeting with the Quorum of Twelve as the new representative of Caprica, and Cally discovers the horrible truth about her husband Galen Tyrol. Meanwhile, Starbuck aimlessly searches for Earth with Anders and other Galactica officers.",
      "imDbRating": "7.9",
      "imDbRatingCount": "1584"
    },
    {
      "id": "tt0993926",
      "seasonNumber": "4",
      "episodeNumber": "4",
      "title": "Escape Velocity",
      "image": "https://m.media-amazon.com/images/M/MV5BMTg1NzExNDI0MV5BMl5BanBnXkFtZTcwOTkxODU2MQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "25 Apr. 2008",
      "plot": "Gaius Baltar causes intense unrest within the fleet when he begins to openly promote belief in the Cylon god. Colonel Tigh, Galen Tyrol, and Tory Foster argue over how far they should go to ensure their secret is not revealed.",
      "imDbRating": "7.4",
      "imDbRatingCount": "1508"
    },
    {
      "id": "tt0993927",
      "seasonNumber": "4",
      "episodeNumber": "5",
      "title": "The Road Less Traveled",
      "image": "https://m.media-amazon.com/images/M/MV5BMjM0MTc1NDkyNl5BMl5BanBnXkFtZTgwODAxMDIzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "2 May 2008",
      "plot": "When a Heavy-Raider manned by Leoben Conoy docks aboard the Demetrius, confrontations form between the crew over the possibility of a truce with Cylon rebels, while Starbuck puts her trust in an old enemy.",
      "imDbRating": "7.5",
      "imDbRatingCount": "1476"
    },
    {
      "id": "tt0993928",
      "seasonNumber": "4",
      "episodeNumber": "6",
      "title": "Faith",
      "image": "https://m.media-amazon.com/images/M/MV5BMjgwNTQyNzU4MV5BMl5BanBnXkFtZTgwNzAxMDIzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "9 May 2008",
      "plot": "A vicious injury ends the mutiny attempt aboard the Demetrius, Kara leads her crew to the Cylon rebel's Basestar, and Roslin begins to understand Gaius Baltar's appeal to his followers. Meanwhile, Anders attempts to secretly find answers to his purpose as a member of the Final Five.",
      "imDbRating": "8.0",
      "imDbRatingCount": "1550"
    },
    {
      "id": "tt0993929",
      "seasonNumber": "4",
      "episodeNumber": "7",
      "title": "Guess What's Coming to Dinner",
      "image": "https://m.media-amazon.com/images/M/MV5BMzI3MzExNjU2OV5BMl5BanBnXkFtZTgwNjAxMDIzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "16 May 2008",
      "plot": "A shaky alliance between the Colonial Fleet and Cylon rebels is put to the test when the two groups combine efforts to take out a Cylon \"Resurrection Hub\". Meanwhile, Athena loses control when Hera becomes unnaturally drawn to Natalie.",
      "imDbRating": "8.5",
      "imDbRatingCount": "1659"
    },
    {
      "id": "tt0993930",
      "seasonNumber": "4",
      "episodeNumber": "8",
      "title": "Sine Qua Non",
      "image": "https://m.media-amazon.com/images/M/MV5BMTk0MzQ1MjE3OF5BMl5BanBnXkFtZTgwNTAxMDIzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "30 May 2008",
      "plot": "President Roslin's abduction by the Cylon Hybrid triggers a bitter power struggle within the Colonial Fleet.",
      "imDbRating": "7.7",
      "imDbRatingCount": "1494"
    },
    {
      "id": "tt0993931",
      "seasonNumber": "4",
      "episodeNumber": "9",
      "title": "The Hub",
      "image": "https://m.media-amazon.com/images/M/MV5BNTI2ODczNzE2OF5BMl5BanBnXkFtZTgwMzAxMDIzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "6 Jun. 2008",
      "plot": "The Hybrid keeps jumping the basestar, and Roslin has visions. The three, D'Anna, is un-boxed. Humans and Cylons engage in a battle to destroy the Resurrection Hub. Baltar is badly wounded and Roslin has to decide whether or not to help him.",
      "imDbRating": "8.6",
      "imDbRatingCount": "1624"
    },
    {
      "id": "tt0993911",
      "seasonNumber": "4",
      "episodeNumber": "10",
      "title": "Revelations",
      "image": "https://m.media-amazon.com/images/M/MV5BMjIwNzM5MDEyNV5BMl5BanBnXkFtZTcwNjcxMzU3MQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "13 Jun. 2008",
      "plot": "D'Anna demands that the four Cylons in the fleet be sent to the basestar. Only Tory goes, while the remaining three are suddenly drawn to Kara's Viper by the music. The route to Earth is finally found.",
      "imDbRating": "9.1",
      "imDbRatingCount": "2033"
    },
    {
      "id": "tt1239323",
      "seasonNumber": "4",
      "episodeNumber": "11",
      "title": "Sometimes a Great Notion",
      "image": "https://m.media-amazon.com/images/M/MV5BMTUzNTQxOTQ2NV5BMl5BanBnXkFtZTgwMzQwODEzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "16 Jan. 2009",
      "plot": "Scouting the planet reveals that there is no life except plants. The destruction occurred about 2,000 years earlier. Among the ruins, skeletons and wrecks of a different kind of Centurions are found. But closer examination of the skeletons reveals they are Cylon! Could the 13th Tribe really have been all Cylons? Chief Tyrol, Colonel Tigh, Sam Anders and Tory remember living on the planet and dying there. How did they get to the colonies? Starbuck finds a piece of her Viper, and despite Leoben's warnings, starts to look for the cockpit... Roslin loses her faith in the ...",
      "imDbRating": "8.7",
      "imDbRatingCount": "1794"
    },
    {
      "id": "tt0993913",
      "seasonNumber": "4",
      "episodeNumber": "12",
      "title": "A Disquiet Follows My Soul",
      "image": "https://m.media-amazon.com/images/M/MV5BMjE0MjcyNzA4OF5BMl5BanBnXkFtZTcwODkxNjcyMg@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "23 Jan. 2009",
      "plot": "Adama considers Saul and Tyrol's suggestion that the Fleet should integrate Cylon jump technology since it will triple the distance they will be able to cover before they run out of fuel. But the Cylon's condition is that they will be allowed to join the Fleet, for safety against Cavil, who's still out there. Ultimately, the decision is up to President Roslin, but Zarek calls the Quorum and gets them to carry the motion that no Cylon be allowed aboard any Colonial vessel unless permitted by the ship's captain. Tyrol learns from Dr. Cottle that Cally had their child ...",
      "imDbRating": "7.7",
      "imDbRatingCount": "1493"
    },
    {
      "id": "tt0993914",
      "seasonNumber": "4",
      "episodeNumber": "13",
      "title": "The Oath",
      "image": "https://m.media-amazon.com/images/M/MV5BMTczNzg0NjY3N15BMl5BanBnXkFtZTgwMDkwMDIzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "30 Jan. 2009",
      "plot": "The Fleet refuses to cooperate with Cylon engineers and Adama decides to put an end to it. He sends the Quorum a message stating that unless they wish to join Zarek in the cell, they get their people in line. However, Gaeta has already freed Zarek with the help of other would-be-revolutionists. They allow Zarek to leave Galactica on a raptor. He lands on Colonial One and enters a gathering of the Quorum. Meanwhile, Anders gets ambushed and captured. At the CIC, Gaeta cleverly manipulates everyone else until the time is at hand for the revolution to begin.",
      "imDbRating": "9.0",
      "imDbRatingCount": "1902"
    },
    {
      "id": "tt0993915",
      "seasonNumber": "4",
      "episodeNumber": "14",
      "title": "Blood on the Scales",
      "image": "https://m.media-amazon.com/images/M/MV5BMTMzMDYxMDQxOF5BMl5BanBnXkFtZTcwODk3NjAzMg@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "6 Feb. 2009",
      "plot": "Roslin is on board a raptor en route to the Rebel Cylon Base Star, but Gaeta has ordered to engage and destroy it. The marines have used a stun grenade on Adama and Tigh. Roslin manages to get a wireless transmission out for everyone to hear and learn what Gaeta has done. She and the others barely make it to the Base Star, where she convinces Tory and the other Cylons to use the Fleet as a cover in order to prevent Gaeta from attacking it. She also believes that Adama will be able to save the rest of the Final Four. Temporarily safe, the Rebel Cylons start voting on ...",
      "imDbRating": "9.1",
      "imDbRatingCount": "2059"
    },
    {
      "id": "tt0993916",
      "seasonNumber": "4",
      "episodeNumber": "15",
      "title": "No Exit",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA1MDc4ODE4M15BMl5BanBnXkFtZTgwMzkwMDIzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "13 Feb. 2009",
      "plot": "Eighteen months ago: Saul poisons Ellen, who then finds herself downloaded into a new body aboard a Cylon Base Star, with a single Centaurion keeping watch over her. After the initial shock, she has a revelation as she remembers things she had forgotten. Present Day: Dr. Cottle is operating on Anders, who has a bullet lodged in his brain. Anders starts to remember things he had forgotten. Eighteen months ago: Cavil comes to see Ellen, who calls him John, because that's his \"real\" name. Cavil says he hates that name. John was the first Cylon model *Ellen* created. She ...",
      "imDbRating": "8.4",
      "imDbRatingCount": "1609"
    },
    {
      "id": "tt0993917",
      "seasonNumber": "4",
      "episodeNumber": "16",
      "title": "Deadlock",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc3MDMyODIyNV5BMl5BanBnXkFtZTcwOTc4MTQzMg@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "20 Feb. 2009",
      "plot": "Ellen and Boomer travel to the Galactica. Saul is entranced at the sight of his wife while Adama puts Boomer in the brig. Ellen is not so pleased when she learns that Caprica Six is pregnant by Saul. Her interference and jealousy leads Six to have a miscarriage. Sam Anders survived the operation but now seems to be brain dead. Ellen is disappointed that the Final Five cannot be completely reunited. By majority vote, the Five agree that they will go off on their own, leaving the Colonial Fleet behind. Adama has agreed to have the cracks in the Galactica's hull repaired...",
      "imDbRating": "7.4",
      "imDbRatingCount": "1461"
    },
    {
      "id": "tt0993918",
      "seasonNumber": "4",
      "episodeNumber": "17",
      "title": "Someone to Watch Over Me",
      "image": "https://m.media-amazon.com/images/M/MV5BMTcwMTY2ODgzNl5BMl5BanBnXkFtZTcwMjAyMjUzMg@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "27 Feb. 2009",
      "plot": "Kara meets a pianist who reminds her of her father. She tries to play a melody she remembers from her childhood, and a drawing made by Hera helps her. Meanwhile, Boomer is to be tried for treason. Tyrol takes her side, and helps her escape.",
      "imDbRating": "8.2",
      "imDbRatingCount": "1677"
    },
    {
      "id": "tt0993919",
      "seasonNumber": "4",
      "episodeNumber": "18",
      "title": "Islanded in a Stream of Stars",
      "image": "https://m.media-amazon.com/images/M/MV5BMjMzNDk5MjcyN15BMl5BanBnXkFtZTgwNDExMDIzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "6 Mar. 2009",
      "plot": "With Hera now likely in the hands of John Cavil, Admiral Adama sends out search teams to locate The Colony, the Cylon home world if you will, that Ellen Tigh says is the only place she imagines she could be. Adama reluctantly comes to the conclusion that the Galactica has reached the end of its days. He orders all repair activities halted and decides to strip the ship and share everything that is salvageable with the rest of the fleet. Starbuck meanwhile shares with Gaius Baltar what she found on the uninhabitable Earth. He subsequently - and quite publicly - ...",
      "imDbRating": "7.8",
      "imDbRatingCount": "1448"
    },
    {
      "id": "tt0993920",
      "seasonNumber": "4",
      "episodeNumber": "19",
      "title": "Daybreak: Part 1",
      "image": "https://m.media-amazon.com/images/M/MV5BMTIzNzI0MzIyMV5BMl5BanBnXkFtZTcwMjc3MzkzMg@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "13 Mar. 2009",
      "plot": "The Colony is located sitting on the edge of a black hole with only one point of entry in what is a very large debris field. Knowing that the Galactica has reached the end of the line, Admiral Adama asks for volunteers to mount a raid on the Cylon base, realizing it may be the ship's last jump. In flashbacks prior to the Cylon invasion, key moments in the lives of several of the crew are presented. These include include the first time Kara Thrace and Lee Adama meet; Admiral Adama's struggle with his decision to retire from the colonial fleet; Gaius Baltar's ...",
      "imDbRating": "8.4",
      "imDbRatingCount": "1826"
    },
    {
      "id": "tt0993922",
      "seasonNumber": "4",
      "episodeNumber": "20",
      "title": "Daybreak: Part 2",
      "image": "https://m.media-amazon.com/images/M/MV5BMjM0ODMyMTQ1MF5BMl5BanBnXkFtZTgwNTAxNTE1NTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "20 Mar. 2009",
      "plot": "A stripped down Galactica attacks the Cylon's Colony ship in the hopes of rescuing Hera. The meaning of the shared dream in the Opera House on Kobol is revealed. Sam Anders is moved in his Hybrid tank to the CIC in the hopes that he will be able to assist the combatants. Their mission complete, Admiral Adama orders Starbuck to pick a destination - any destination - to which the ship can jump to get out of there. With that, the meaning of the tune and the musical notes are explained. Having successfully jumped, the old Galactica has truly reached the end of it's life. ...",
      "imDbRating": "9.0",
      "imDbRatingCount": "3052"
    },
    {
      "id": "tt12394444",
      "seasonNumber": "4",
      "episodeNumber": "21",
      "title": "Daybreak: Part 3",
      "image": "https://m.media-amazon.com/images/M/MV5BZWQ2NzhkMjAtMWQ5MS00MjQ0LTkwMTAtNTk3NDBlMjAzNjQ4XkEyXkFqcGdeQXVyMTUwMDQ5NjIy._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "25 Mar. 2009",
      "plot": "As conflicts reach a climax, Cylons and humans face a stark choice.",
      "imDbRating": "8.5",
      "imDbRatingCount": "497"
    }
  ],
  "errorMessage": ""
}