{
  "imDbId": "tt1865718",
  "title": "Gravity Falls",
  "fullTitle": "Gravity Falls (TV Series 2012–2016)",
  "type": "TVSeries",
  "year": "2012",
  "items": [
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw3057357",
      "warningSpoilers": true,
      "date": "27 July 2014",
      "rate": "9",
      "helpful": "98 out of 111 found this helpful.",
      "title": "Amazingly strange...and funny.",
      "content": "While I am 50 years old and WAY outside the target audience for this show, my 24 year-old daughter is hooked--so much so that she always insists that I watch \"Gravity Falls\" with her. And so this is how I came to see the show--and I assume most who have reviewed the show are much younger than I am!The plot is a lot like the old show \"Eerie, Indiana\" in that the main characters, who are kids, keep stumbling upon weird cases of the supernatural in this bizarre little town. However, and this is important, unlike \"Eerie, Indiana\", the characters are far more likable and funny. In particular, Mabel is a hoot--and is among the best things about the show--as is Gruncle Stan. But the others are all quite charming and weird. The writing, therefore, is a very strong suit about the series and, oddly, will appeal to just about all age groups. Sure, it's a show for kids--but oldsters like me will like it too, if they give it a chance. Well worth your time."
    },
    {
      "username": "newkidontheblock",
      "userUrl": "https://www.imdb.com/user/ur2790894",
      "reviewLink": "https://www.imdb.com/review/rw2746988",
      "warningSpoilers": false,
      "date": "1 February 2013",
      "rate": "9",
      "helpful": "128 out of 147 found this helpful.",
      "title": "Gravity Falls: a Diamond in the Disney Channel Rough",
      "content": "There are few things I hate more on television than the Disney Channel. This factory of mediocrity has churned out \"gems\" like The Suite Life with Zach and Cody and the unfortunately popular Hanna Montana. The Disney Channel is a place for Uncle Walt's successors to push talentless teens out in front of the world. Said teens get a few moments of fame and the Mouse gets another few million.Why do I make this cynical and cliché critique of the Disney Channel? Because I want to make sure every person who reads this understands how shocked and delighted I am by Gravity Falls.Gravity Falls takes place in a remote Oregon town of the same name. It features Dipper and Mabel Pines (voiced by Jason Ritter and Kristen Schaal respectively), a pair of twins, staying with their Great Uncle (or Grunkle, a term I believe needs to be used more often) Stan (voiced by show creator Alex Hirsch), a sleazy con-artist that runs a tourist trap called the Mystery Shack. Stan rips off gullible vacationers and townies with \"supernatural\" attractions and a less than stellar gift shop, overseen by man-child Soos (also voiced by Hirsch) and a down-to-earth slacker teenager Wendy (voiced by Linda Cardellini). It looks like a dull summer for the twins, but they soon find out that there is quite a lot of strange goings on in the little town.This show has that right mix of humor and adventure every family program ought to have. It's written in a way that can engage people of all ages without pandering to anyone.The voice actors were chosen masterfully, especially in Mabel Pines. I can't imagine anyone else but Schaal (who also voiced Trixie in Toy Story 3 and plays Mel in Flight of the Conchords)playing the bubbly, effervescent Mabel.This show also features DIY voice acting from Hirsch, a seemingly common occurrence in animated shows today (Regular Show creator JG Quintel voicing Mordecai and High Five Ghost and Adventure Time creator Pen Ward voicing Lumpy Space Princess as well as a myriad of side characters). Hirsch shows quite a bit of range voicing miserly Stan and obvious Soos.Gravity Falls is also able juxtapose the supernatural and the normal growing pains of adolescence. On a nearly weekly basis, the observant and intelligent Dipper finds a way to crack a mystery involving gnomes and crystals that change an object's size, yet he can't muster the courage to ask his crush, Wendy, on a date.There are a lot of TV shows and movies that try so hard to reach that sweet spot where they can appeal to kids, parents and young adults, but fall painfully short. Gravity Falls, though, hits that spot brilliantly.Like his fellow CalArts alumni Quintel and Ward, Hirsch's product is one made out of love and care and it's made clear in every episode. Most impressively, though, is that it gives me a reason to watch the Disney Channel."
    },
    {
      "username": "doomedmac",
      "userUrl": "https://www.imdb.com/user/ur111092901",
      "reviewLink": "https://www.imdb.com/review/rw5320544",
      "warningSpoilers": false,
      "date": "14 December 2019",
      "rate": "9",
      "helpful": "34 out of 39 found this helpful.",
      "title": "One of my all-time favorite shows",
      "content": "Really, really, really funny. Great, real, relatable, hilarious, heartwarming characters. Bill is a great villain, and I love almost every character.Give Gravity Falls a shot. You won't regret it."
    },
    {
      "username": "Animany94",
      "userUrl": "https://www.imdb.com/user/ur78948186",
      "reviewLink": "https://www.imdb.com/review/rw5329516",
      "warningSpoilers": false,
      "date": "18 December 2019",
      "rate": "10",
      "helpful": "31 out of 36 found this helpful.",
      "title": "Expertly written with so much care put to creating interesting stories.",
      "content": "Gravity Falls is one of those shows which both kids and adults can enjoy on their respective levels, because of how the writers carefully made up a premise including both fun, excitement, charm and emotional depth.And everything just flows perfectly and works both as one grand story and stand-alone episodes to be enjoyed by casual viewers. But you'll get so much more out of it watching it all from start to finish.And these characters are just so likable with all their quirks and all their personality. The twins Dipper and Mabel are so good together as an insecure and kind of serious boy and a happy-go-lucky and silly girl respectively who are sent to their jerk uncle Stan to spend the summer in his tourist attraction the Mystery Shack which ends up being packed with loads of strange things happening which ends up being bigger than they could ever dream of.And Stan is a perfect example of a likable jerk. I love him and how he gets away with it all and still learns a lot and grows so much during the time with Dipper, Mabel and the rest of the townsfolk.This is a fantastic show with great animation, great stories, great charm and lots of fun. You won't be disappointed."
    },
    {
      "username": "OnjiMooteDaMarle",
      "userUrl": "https://www.imdb.com/user/ur42414764",
      "reviewLink": "https://www.imdb.com/review/rw8357443",
      "warningSpoilers": false,
      "date": "22 July 2022",
      "rate": "8",
      "helpful": "22 out of 25 found this helpful.",
      "title": "The True Multiverse of Madness",
      "content": "WOW! I am 37 and how much I enjoyed this show. A better Stranger Things meets a better Doctor Strange Multiverse of Madness. Immensely crazy yet so warm. Definitely worthy of yours & your kids' time."
    },
    {
      "username": "eforest77",
      "userUrl": "https://www.imdb.com/user/ur35138110",
      "reviewLink": "https://www.imdb.com/review/rw2654866",
      "warningSpoilers": false,
      "date": "4 August 2012",
      "rate": "9",
      "helpful": "81 out of 94 found this helpful.",
      "title": "Fantastic",
      "content": "Gravity Falls is a new show on Disney Channel, and the only reason I heard about it was because of a friend I have on tumblr. While I haven't been a fan of Disney's recent...ventures, I have to say that Gravity Falls is absolutely fantastic.Gravity Falls is about two kids, Mabel and Dipper Pines, who are currently living in one of those \"middle of nowhere\" towns called Gravity Falls with their uncle Stan, who appears to have a very mysterious past. Plenty of other mysteries lurk in Gravity Falls, and you, as the viewer, look to figure them out along with Dipper and Mabel. Along with dealing with their eccentric uncle, the kids also encounter the extremely snarky Wendy as well as a host of other quirky residents.The tone of Gravity Falls's humour is very similar to Adventure Time - very strange and mostly situational, but I feel that a lot of the time the dialogue is much more clever and mature than that of Adventure Time's. The voice acting, animation and art style are also great, and the theme song of the show especially is fantastic.What I enjoy most about this show, however, is its tone. This show is a total mystery - there's clues hidden everywhere. I'm completely enthralled with finding everything out before it's addressed in the show - mainly Stan's past.This show is great, check it out!"
    },
    {
      "username": "berg-74532",
      "userUrl": "https://www.imdb.com/user/ur65932704",
      "reviewLink": "https://www.imdb.com/review/rw5435250",
      "warningSpoilers": false,
      "date": "25 January 2020",
      "rate": "10",
      "helpful": "23 out of 27 found this helpful.",
      "title": "I want MORE!!",
      "content": "Few kids shows can truly be enjoyed by adults and for obvious reasons. This show is incredible it's not dumbed down. The stories are entertaining the writing is excellent. If you have kids and struggle to find things that are entertaining for you without sex, language and story lines that you don't need to keep your finger on mute or the last channel key this easily fits the bill. I can't believe that this came and went before I was aware of it. It's truly a shame that it's only about 50 episodes and I have absolutely no doubt this will be fondly remembered and will be on lists of best shows forever."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw4965029",
      "warningSpoilers": false,
      "date": "29 June 2019",
      "rate": "9",
      "helpful": "31 out of 39 found this helpful.",
      "title": "brilliant",
      "content": "Twelve year old twins Dipper and Mabel Pines have been sent to Gravity Falls, Oregon to spend the summer with their great-uncle Gkunkle Stan. Stan had turned his home into a tourist trap, The Mystery Shack. Wendy and Soos work for Stan. Dipper finds a mysterious book detailing the strange creatures living in Gravity Falls.I love everything about this show. I love the premise, the characters, the theme song, and the various wacky creatures. While it's great for kids, the smart writing makes it even better for adults with kids' imagination. It is a brilliant show and the only flaw is its shorten lifespan."
    },
    {
      "username": "BabelAlexandria",
      "userUrl": "https://www.imdb.com/user/ur115227177",
      "reviewLink": "https://www.imdb.com/review/rw7340785",
      "warningSpoilers": false,
      "date": "13 September 2021",
      "rate": "10",
      "helpful": "25 out of 30 found this helpful.",
      "title": "Like Twin Peaks for Kids",
      "content": "Our first show on the Disney channel, and not what we were expecting. It's got a perfect mix of the funny and mildly creepy (but not terrifying), which makes appropriate viewing even for kids younger than the teen and tween groups. And yes, the parallels to Twin Peaks are too many to count and clearly influence the series' characters and plot. The appeal of the series also has much to do with the positive, supportive, if sometimes strained relationship between the twins Mabel and Dipper, and their connection to the hilarious shyster \"Grunkel\" Stan. Though the parallels are only partial, I'm sure that part of the reason my kiddos enjoyed this so much is because they see themselves in the main characters, and, just maybe, their grandfather in Stan, and their uncle in Soos.At the time of writing, it ranks as their #3 favorite series, behind Voltron and Avatar."
    },
    {
      "username": "bilalcansakalli",
      "userUrl": "https://www.imdb.com/user/ur106151810",
      "reviewLink": "https://www.imdb.com/review/rw7759965",
      "warningSpoilers": false,
      "date": "15 January 2022",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "WE NEED SEASON 3",
      "content": "Gravity Falls is one of the animations I watched in my childhood and liked very much. Dipper's intelligence and adventurousness, Mabel's positive attitude towards everyone and his constant humor, Stan's fondness for money and doing everything for money, as well as trying to take care of Dipper and Mabel as best he can, are the main characters of the series. It is very enjoyable to watch Dipper, who thinks he will be bored in the town, by having adventures and trying to solve mysteries. It's hilarious to watch Mabel help Dipper solve these mysteries. If you want to watch an animation full of mystery and adventure, Gravity Falls is for you."
    },
    {
      "username": "Johnny-the-Film-Sentinel-2187",
      "userUrl": "https://www.imdb.com/user/ur24085266",
      "reviewLink": "https://www.imdb.com/review/rw3752994",
      "warningSpoilers": true,
      "date": "13 July 2017",
      "rate": "10",
      "helpful": "22 out of 27 found this helpful.",
      "title": "Disney's best animated TV series since Gargoyles!",
      "content": "Gravity Falls is easily the best animated series Disney's made in a long time! It's got mystery, humour, slice-of-life drama and a complex examining of the dynamics of sibling relationships. Alex Hirsch gives us one of Disney's crowning achievements for the decade, and Disney XD's finest show to ever grace the channel. And a cartoon that is arguably part of the 'Golden-Age-of-Television' renaissance.The series starts off on a relatively light note: the Pines twins, Dipper and Mabel, stay with their Great-Uncle 'Grunkle' Stan for the summer break. Dipper accidentally discovers a mysterious book: and on the cover of it a six-fingered golden hand with the number 3 on it. In this book, there are mysteries about the town of Gravity Falls: and the things residing in it. Together Mabel and Dipper try to resolve these mysteries and, eventually, find out who the author of this mysterious book is.The first episode has dwarfs in it, the next one has a sea-monster in it, and the third is about sentient wax figures! And that's only scratching the surface of this show's weirdness and overarching mystery. Where does all this come from? Why is it all happening in the one town? And who wrote the book? So many questions.With all the questions brewing in the air, the payoffs are fantastic. And some of them you may see coming from a mile away, but some you won't be able to pick up so easily. Kids and adults will find something to enjoy here. It sounds cliché but it really is the case here. The jokes have just enough entendres in them that different demographics will get something out of them in varying degrees; and the same thing can be said about the drama: There's enough mystery and character development here that can be enjoyed in ways both kids and adults can uniquely appreciate, however different their tastes may be.Disney knew that this could give their Disney channels new life in the network-TV space: and what a piece of creator-driven work this is. Gravity Falls is a gorgeous blast of animated fun that never gets old or stale! It's a slice of TV suitable to be placed in the golden-age-of-television canon."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw8873888",
      "warningSpoilers": false,
      "date": "16 February 2023",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "One wildly creative summer",
      "content": "Am a huge fan of Disney, have seen all their animations and like to love a vast majority of them, almost all their sequels and remakes which were a lot more variable and many of their shows old and new (with infinitely stronger preference for the older shows). The Disney Channel actually was part of my childhood and actually was a good channel until they stopped airing all the good older shows and dominated scheduling with their sitcoms, and the channel has been in decline for years.The odd gem does come by and one of the biggest gems of them is 'Gravity Falls'. The concept was absolutely fascinating and loved the advertising so had no doubt it would be worth watching. To me 'Gravity Falls' is Disney's best show in a long time, not just animated but also overall. The best Disney Channel show since 'Phineas and Ferb', except even better and more consistent as well as more imaginative and less formula based, and one of the most refreshing animated shows in a while.Really like the animation, which is very vibrant in colour (the colours literally popping out without being too dizzying) and rich in background detail. The character designs are also creative. The music is always dynamic with the action and full of energy and atmosphere. The theme tune is very catchy. The voice acting is excellent all round, particularly Alex Hirsch and Kristen Schaal. The enthusiasm and nuances the voice cast bring when bringing their great characters to life are off the charts.Like other fans, it's the characters that are a big part of 'Gravity Falls' appeal. Can take and leave Grenda, who can be annoying, but loved everybody else. Absolutely love Mabel, her high spirited optimism is so infectious and puts me in such a happy mood (to me the positivity of her character is not overdone at all and instead it was refreshing). Grunkle Stan has a lot of depth too, funny, mysterious and also relatable. Bill Cipher stands out as one of the most interesting animated villains in recent years, managing to be both funny and frightening with clear motivations and viewpoints that aren't invalid.Dipper is easy to relate to, and the show does a fantastic job with fleshing out all the different relationships and character and situation conflicts. It was one of the best things about Season 1 and done even better in the second. The writing is smart, inventive and incredibly funny, reminding me very fondly of 'Adventure Time' with the dark, situational humour style. It is never juvenile or tasteless, which this reviewer has seen a lot in animation overtime, and the humour style means that adults can enjoy the show as well while not being complicated for younger viewers.Can't fault the storytelling either, the mystery elements are always intriguing and suspenseful while never feeling predictable, the adventurous elements thrill, the nostalgic elements charm and loved the complexity and maturity of it. All the stories go at an energetic pace and avoid repetition, while also exploring very emotionally investable themes (like the episode where Stan is arrested). Personally didn't feel there was too much filler to begin with, and how brilliantly and remarkably quickly the characters are set up and developed more than made up for it. Even if structurally the stories were slight, there was a lot going on in the character moments, developments and relationships always.Summing up, an absolute gem. 10/10."
    },
    {
      "username": "chloebetts",
      "userUrl": "https://www.imdb.com/user/ur135212298",
      "reviewLink": "https://www.imdb.com/review/rw7192884",
      "warningSpoilers": false,
      "date": "3 August 2021",
      "rate": "10",
      "helpful": "27 out of 33 found this helpful.",
      "title": "Needs more attention",
      "content": "THIS SHOW IS SLEPT ON. It is literally soooo good. When I thought it couldn't get any better, they hit me with another bang. Gravity Falls is top tier and needs more recognition."
    },
    {
      "username": "MissSimonetta",
      "userUrl": "https://www.imdb.com/user/ur28071275",
      "reviewLink": "https://www.imdb.com/review/rw3365918",
      "warningSpoilers": true,
      "date": "3 December 2015",
      "rate": "9",
      "helpful": "23 out of 29 found this helpful.",
      "title": "Intelligent and poignant, a true rarity altogether",
      "content": "With most family entertainment weighed down by formulas, idiocy, and merchandising appeal, it is so wonderful to have a show like Gravity Falls, a production with comedy and heart. It's accessible for kids while still having enough depth for those over the age of twelve, a true rarity on television, particularly Disney television.The characters are just excellent, feeling like real people rather than brainless caricatures. Adult characters are allowed to be funny without making them morons to make the children appear more intelligent, which is refreshing for this sort of show. The kids feel genuine, no sentimentality or over-powering in their characterization. The stories and overreaching arcs are well planned and keep one guessing.I also respect creator Alex Hirsch's decision to end the show at two seasons. As sad as it is, it's better to have two great seasons without a bad or even mediocre episode in the bunch rather than three extra seasons which go nowhere and bore you to death with filler like so many awful anime series or live action shows.If you have not tried GF out yet, then do so! I did not expect to enjoy it and yet here I am! Let's hope and pray Disney will give this wonderful series a DVD release."
    },
    {
      "username": "ontheis",
      "userUrl": "https://www.imdb.com/user/ur16446328",
      "reviewLink": "https://www.imdb.com/review/rw6004060",
      "warningSpoilers": false,
      "date": "17 August 2020",
      "rate": "10",
      "helpful": "29 out of 34 found this helpful.",
      "title": "Perfect nostalgic summer fun",
      "content": "One of my favorite (if not favorite) animated shows ever. Watching for a few minutes of the first episode, I thought it was for young children only, but I was so wrong. This show is perfect for anyone, maybe even more appreciated later in life. It's funny, every single episode is pure entertainment... The only flaw is that is so short! Maybe better to end it so it never fades and keep the charm, but still it has a great potential to be much much longer. At least I hope for more animated TV shows with the same vibe - Oregon summers, nature and magic! Can't wait for other things to come out by the creator!"
    },
    {
      "username": "aserdcerebral",
      "userUrl": "https://www.imdb.com/user/ur42568659",
      "reviewLink": "https://www.imdb.com/review/rw8284052",
      "warningSpoilers": false,
      "date": "28 June 2022",
      "rate": "9",
      "helpful": "10 out of 10 found this helpful.",
      "title": "I watched the first 4 episodes of this show and had 3 beautiful dreams within the same sleep",
      "content": "The first dream was about a communal camaraderie. The context was faded from memory when I woke up, but the pleasantry and feeling of cohesion persisted as I rose from bed when my 90 minute alarm went off.The second dream was about an omniscient overview of a happy couple, which might have been myself and a past or future partner. I watched them meet and with their initial locking of eyes formed an empathy so deep, clean and evergreen that they never knew conflict in the love that lasted them the rest of their lives.The third dream was.. that which my 90 minute alarm interrupted, so most of it evaporated with the shock of the sudden journey out of that oneiric utopia, but the calming pleasantness persisted.The show itself, so far, isn't about any of those subjects. But it is, at least in the Mabel character, about giving strangers as much chance to be good human beings as you permit yourself, and to withhold judgment as long as can be.I shan't attempt to intellectualize it any more than that.Now I'm not a particularly, or let's be honest, a measurably at all, passive person. My social style mostly consists of telling people what to do, because they trust that I do know. It's worked for me since I was a little prodigy, and I'm not about to change it up now.Consequently, 100% of my dreams are about control; the happy 90% where I have it in totality. The uncomfortable 8% where I share it. And the rest; nightmares.This sort of happy-go-lucky, passive dream was an unprecedented experience, and the most any work has ever communicated its message, I should hope, with purity and indelible truth to me.In technical terms, I shall say Gravity Falls uses its \"camera\" as a storytelling tool more precisely than most, if not all other comedy and animated shows; short decisive pans/tilts define the punchline. Telephoto compression underlines the humor beneath the frenetic action of a chase sequence, and such like.It's a very frame-by-frame kind of show, meaning each cut brings new meaning and each shot is consciously designed from the mise-en-scene (in this case, shapes, sizes, color and positioning choices) to the light to lensing choice, to precisely elicit a calibrated emotional response.It's a most perfectly-made work of art.But what matters even more is the beauty beneath and between the frames.As I haven't seen the whole thing yet, and parsed its overall meaning, I rate it 9/10."
    },
    {
      "username": "Ckn48",
      "userUrl": "https://www.imdb.com/user/ur20878403",
      "reviewLink": "https://www.imdb.com/review/rw6707319",
      "warningSpoilers": false,
      "date": "18 March 2021",
      "rate": "10",
      "helpful": "16 out of 19 found this helpful.",
      "title": "10🌟 Well Deserved",
      "content": "Our 7 year old introduced this to us Its brilliant It deserves a 3rd and 4th season. Seriously, give it a try!!!"
    },
    {
      "username": "D4V1D2411",
      "userUrl": "https://www.imdb.com/user/ur106641918",
      "reviewLink": "https://www.imdb.com/review/rw8189863",
      "warningSpoilers": false,
      "date": "30 May 2022",
      "rate": "10",
      "helpful": "13 out of 15 found this helpful.",
      "title": "It turns you into a kid once again",
      "content": "I still remember the impact this show had when it first aired, there were tons of videos of theories, on my school we talked about this same theories, and I used to watch all the episodes over and over. And that was only the first season, the second one came even stronger and I who had already grown up found even more value in the story, by how brilliant it was. I was super excited as a kid whenever a new episode aired and there were still tons of people talking about it and discussing what the future holded for the series. And the same thing happened with the second season, I used to watch all episodes over and over to no end and at the time, watching the finale, I thought it was the most epic and satisfactory way it could end and now, watching it all again, I still think that. Speaking for me, this wasnt only a series, but an experience that marked me for my life. I absolutely love this show, and surprisingly I think the only bad thing about it is that there were still tons of misteries and adventures we could have seen. But still, it doesnt change my feelings towards this show, one of the best in history."
    },
    {
      "username": "Shopaholic35",
      "userUrl": "https://www.imdb.com/user/ur50296294",
      "reviewLink": "https://www.imdb.com/review/rw3154087",
      "warningSpoilers": false,
      "date": "2 January 2015",
      "rate": "8",
      "helpful": "20 out of 25 found this helpful.",
      "title": "Surprisingly funny.",
      "content": "This show is actually really good. It's not just some silly kids show that has vapid lowbrow jokes. Everything is thought out and has a purpose. It actually reminds me of the Disney show The Replacements but better. It has the same smart comedy style that is suitable for adults and children alike. I was initially surprised how clever this show is as the ads and synopsis don't really do it justice, but it is much better than you would expect.Mabel is definitely my favourite character in the show. She's so hilarious and high spirited. I can't help but cringe and laugh every time she opens her mouth. The rest of the characters are fine but in my opinion Mabel is the comedic relief in a group of generic characters. But together they all work together to balance each other out so it works.So I swear, give it a go as it is actually very funny."
    },
    {
      "username": "Pictoron",
      "userUrl": "https://www.imdb.com/user/ur28729062",
      "reviewLink": "https://www.imdb.com/review/rw2658100",
      "warningSpoilers": false,
      "date": "12 August 2012",
      "rate": "10",
      "helpful": "114 out of 130 found this helpful.",
      "title": "Surprisingly Great!",
      "content": "I hate the Disney Channel and what it's become, however I watched this show, and was very entertained! It's not just the humor, but the mixture of surreal situations that connect with the story. Not to mention, THE CHARACTERS! They're all simply fun and the way they get along and interact with each other is great! The setting is pretty cool too, there's always the potential for something completely new and supernatural to occur. I've seen all the episodes so far (all 7) but for the time being, I will continue to keep up with the episodes, and altogether I'm just happy to see that there is still hope for the cartoons of today and the future cartoons."
    },
    {
      "username": "tinytots2",
      "userUrl": "https://www.imdb.com/user/ur144605672",
      "reviewLink": "https://www.imdb.com/review/rw7693804",
      "warningSpoilers": true,
      "date": "27 December 2021",
      "rate": "8",
      "helpful": "10 out of 11 found this helpful.",
      "title": "A captivating combination of comedy and mystery",
      "content": "An entertaining romp, this animated show follows the brother and sister duo Dipper and Mabel as they spend their summer vacation with their Uncle Stan in the town of Gravity Falls. The pair discover the abundance of paranormal activity around them and set out to uncover the underlying mysteries while also engaging in other side adventures. Episodes typically have self-contained plots for both Dipper and Mabel that interweave and interconnect with each other. In addition, many episodes progress the overarching plot about the origins of the supernatural phenomena; this ultimately culminates in a confrontation with an inter-dimensional demon.While it's made like a children's cartoon, Gravity Falls can be abundantly appreciated by adults as well. It has relatable and compelling characters whose personalities are brought out very well through the praiseworthy writing, art and voice acting. The interactions and conversations are very humorous and a diverse set of creative settings are explored over the show's course. The content also doesn't shy away from exploring deeper themes that are conveyed through various antagonists or different conflicts and challenges that the siblings face. And finally, there are lots of subtle hints, callbacks and references present in the scripts and backgrounds that boost the show's rewatchability.In terms of criticisms, my personal impression is that the plot pacing gets rushed in the second half of Season 2. Ford gets introduced rather late in the story and the character progression of notable side characters like Gideon and Patricia is hurried or truncated. There are also a few episodes that are forgettable, especially in Season 1, often due to the jarring tonal transitions from darker supernatural elements to light-hearted young adult subplots.But despite these subjective critiques of mine, I consider Gravity Falls to be a perfect family show. It has something for everyone and showcases an excellent playground for active imaginations."
    },
    {
      "username": "panoskonidis",
      "userUrl": "https://www.imdb.com/user/ur103624167",
      "reviewLink": "https://www.imdb.com/review/rw4994060",
      "warningSpoilers": false,
      "date": "14 July 2019",
      "rate": "10",
      "helpful": "49 out of 62 found this helpful.",
      "title": "Why are you reading the ratings ?",
      "content": "It's Gravity Falls. There is no point on seing the ratings of the people. You know there are all great rating because the show is just great. Again, IT'S GRAVITY FALLS !!!"
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6362048",
      "warningSpoilers": false,
      "date": "13 December 2020",
      "rate": "9",
      "helpful": "18 out of 23 found this helpful.",
      "title": "Gravity Falls",
      "content": "A great series, the best series produced by the Disney Channel, despite the fact that the first season was not at that level, but the second season was great and the series was greatly upgraded. Most of the series' characters were excellent. The relationships of the characters in the movie were excellent, especially between the twins and their uncle. The story of the series was excellent, the series's villain, they were very excellent The series' comedy was funny in most case es"
    },
    {
      "username": "The_Coffee_Frog",
      "userUrl": "https://www.imdb.com/user/ur91412471",
      "reviewLink": "https://www.imdb.com/review/rw8293704",
      "warningSpoilers": false,
      "date": "2 July 2022",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Mystery, Comedy and.....Grappling Hooks: One of the Greatest TV Shows of All Time.",
      "content": "In 2012, ten years ago, 'Gravity Falls' premiered and it captured my heart. Without sounding biased, 'Gravity Falls' is a show that means a lot to me, it's been part of my life for so long, that attempting to write any sort of review without bias is futile, but, in saying that bias or not, 'Gravity Falls' is one of the best TV shows of all time.The plot follows twins, Dipper and Mabel Pines, two twelve years old travel to their Great Uncle Stan's tourist trap in a small town called Gravity Falls, Oregon, where many strange things occur.The show contains many mysteries throughout its two seasons, though they are all extremely well thought out and most are solved before the show bows out, and though this show may be a 'kids' show' that by no means makes it entirely for children, can children watch it? Yes, but there are so many layers to enjoy this show on, much more than your average 'kids' show' and the mysteries are so well thought-out and compelling, it feels more like an HBO Drama than anything else. However, what truly makes 'Gravity Falls' so amazing, as well as the mysteries are the characters and humour, all of the main characters are all multi-dimensional and well written, and so is the humour, it reminds me so much of classic 'Simpsons' in how it tells its jokes.I could go on, but, I won't, just know that 'Gravity Falls' is a clever, engaging and funny masterpiece of television. So, go, on take a trip."
    },
    {
      "username": "Lukasmj",
      "userUrl": "https://www.imdb.com/user/ur158768880",
      "reviewLink": "https://www.imdb.com/review/rw8680960",
      "warningSpoilers": false,
      "date": "18 November 2022",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Perfect. Just perfect.",
      "content": "\"Gravity Falls\" is something that has never happened before and will most likely never happen again, because it's just so special.Rarely does a cartoon series manage to both entertain children with its whimsical humor and captivate adults with an exciting story.That's why the target group of the series can't be defined at all, because somehow it's all of them.The creator of the series said himself that he created a series that he would watch himself and didn't have a specific target group in mind.If you ask me, I'll say the series is perfect through and through for what it wants to be!"
    }
  ],
  "errorMessage": ""
}