{
  "imDbId": "tt0248654",
  "title": "Six Feet Under",
  "fullTitle": "Six Feet Under (TV Series 2001–2005)",
  "type": "TVSeries",
  "year": "2001",
  "items": [
    {
      "username": "alexkolokotronis",
      "userUrl": "https://www.imdb.com/user/ur16117882",
      "reviewLink": "https://www.imdb.com/review/rw2016350",
      "warningSpoilers": false,
      "date": "1 February 2009",
      "rate": "10",
      "helpful": "243 out of 259 found this helpful.",
      "title": "This Show Does The Impossible",
      "content": "When using superlatives with this show it is totally fair. This show does something all other movies, shows, etc cannot do: it can safely apply any genre and still function as a deep and very entertaining show. As everybody episode goes by the show only becomes more addictive. It taps into almost every aspect of life. Every emotion is shown; love, hate, forgiveness, triumph and the list goes on and on. In fact this show depicts life the most realistically. The strangeness and peculiarity of the many themes perfectly displays the confusion in life and how it affects us. The show displays confusion in the clearest way making it almost impossible not to some how relate to the characters in the show. Not to mention also the series ends on one finest note you will ever see not just satisfying the viewer but taking the show to a level far and above anything else I have ever seen before. This show does the impossible twice over."
    },
    {
      "username": "estelle58",
      "userUrl": "https://www.imdb.com/user/ur51201549",
      "reviewLink": "https://www.imdb.com/review/rw7524483",
      "warningSpoilers": false,
      "date": "7 November 2021",
      "rate": "10",
      "helpful": "38 out of 39 found this helpful.",
      "title": "A true classic!",
      "content": "Never gets old, never will.If you have never seen this gem, do yourself a favor and watch it.If you watched it almost 20 years ago, do yourself a favor, and watch it again."
    },
    {
      "username": "stonedonkies",
      "userUrl": "https://www.imdb.com/user/ur5032964",
      "reviewLink": "https://www.imdb.com/review/rw1156134",
      "warningSpoilers": false,
      "date": "22 August 2005",
      "rate": "",
      "helpful": "311 out of 330 found this helpful.",
      "title": "Raw, personal conflict was never so mesmerizing",
      "content": "Six Feet Under is meticulous, beautiful, daunting, and powerful. One way or another, it will connect with you, perhaps in places you didn't expect and aren't willing to expose. At times wrenching, at other times cathartic, but always staring back at you knowingly, this show stands head and shoulders above the advertising-driven fare that clogs network TV with mediocrity, token minorities, and jarring commercial breaks. It changed the way I view television, and I recommend it to anyone who's tired of the same old crap.After watching the series finale (which I won't spoil, don't worry), I sat in bed, unable to sleep. After poring over everything I'd seen over the past season, it struck me that SFU is the most raw and personal television show I've ever seen. Even more, there are no stand-alone episodes for easy syndication. Every single installment is part of a huge puzzle, or a few more miles on the Fisher family's road. I've always found Peter Krause to be a disappointingly flat performer, which is unfortunate because his character anchors the show, but the other actors are often transcendent. Regardless, every one of them radiates with a sometimes painfully familiar pathos. The cinematography is also staggering sometimes, taken from film rather than typical 3-camera TV work. If that's not enough, the music they choose to score the episodes is almost symbiotic; it seems ingrained into the film itself, even when you know it was just licensed.This is not really a family-friendly show, though, encompassing profanity, nudity, violence, drug use, \"alternative lifestyles\" ... So in other words, it's just like real life. And despite the interpersonal conflicts that fuel the narrative to the point of melodrama, the show isn't afraid to pause every once in a while and let the show communicate without dialogue.I feel very gratified to have watched SFU, and I've never felt that way about any other show in the almost-27 years I've been alive. Hopefully it will start a trend, if only on premium cable."
    },
    {
      "username": "plumberguy66",
      "userUrl": "https://www.imdb.com/user/ur1492550",
      "reviewLink": "https://www.imdb.com/review/rw0736475",
      "warningSpoilers": false,
      "date": "26 March 2002",
      "rate": "",
      "helpful": "220 out of 250 found this helpful.",
      "title": "Free Therapy",
      "content": "As I was reading through the comments about Six Feet Under I was struck by how many people expressed how this series made them FEEL. And how many people admitted to tearing up or even crying while watching the show. I admit I have done the same.From the very beginning no before that From the moment I heard that Six Feet Under was created by Alan Ball, I knew I would like this show. I figured how could the maker of American Beauty go wrong? Boy am I glad I figured that.To some degree I can relate to all of the characters on the show. And that speaks volumes because all of the characters on the show are kinda messed up in the head. And that is what I think speaks to so many people. I mean before Donahue was the most popular show on TV, I don't think most Americans even knew the word dysfunctional' as applied to the family unit. Then it seemed a badge of honor to wear. And it was ok to go about telling people that you are from a dysfunctional family just to be in'. Now after all this time and openness about our dysfunction, we begin to see how very much alike we all are. And that I feel is one of the binding elements of the watchers to this program. We sit each week and watch, basically, a part of ourselves work through personal issues, prejudices and shortcomings. Not always pretty, not always successfully but always openly, to us, the viewers. For me, to watch these characters struggle through some of their problems (which usually make mine look like a day at the beach) and let us come along with them to learn about their weaknesses and fallibilities and humanness is a lot like therapy for me. And in the end it only costs the subscription rate for HBO (no, I don't work for them).I have never been that attached to the boob-tube (my father's word for the television) before. I have never had a reason to be. The programs that where on never more that mildly held my attention until now. I HATE commercials, I think they speak down to the public. So now I have no excuses and for that I am grateful.Bottom line: I'm looking forward to the next few sessions uhm I mean seasons. That's my take, what's yours?"
    },
    {
      "username": "Bgb217",
      "userUrl": "https://www.imdb.com/user/ur1224804",
      "reviewLink": "https://www.imdb.com/review/rw0736480",
      "warningSpoilers": false,
      "date": "8 May 2002",
      "rate": "",
      "helpful": "321 out of 363 found this helpful.",
      "title": "Excellent, one of the best shows I've ever seen.",
      "content": "It's hard to describe to those who haven't watched this brilliant show what it's like. Six Feet Under is simply in my opinion, the best hour on television, and one of the best shows ever. Of all time. Brilliantly written, brilliantly told, brilliantly acted, brilliantly brilliant. I've never used brilliant so much in a review before. First off, it's a show about a very real family, with very real issues to deal with. The family, who have just recently lost the father consists of the mother Ruth, two sons Nate and David, and sister Claire. The two brothers run the business prviously owned by the father, a funeral parlor. I just love this show. There is not a single bad actor on the show, in every role. The family is probably one of the most real ever portrayed on TV, the characters being all easily relatable to, I myself can relate to two of them in particular. It's fresh, at times funny, at times sad, at times everything. Every single actor is amazing in their roles from Brenda to David to Keith to Ruth to Frederico to everybody. And the story lines are just so brilliant, dealing with life and it's purpose, seen throught the eyes of these people who work with death in a funeral home. It's just amazing. I could rave on and on for hours about how great this show is and how much I love it, but I have to stop sometime. If you haven't yet watched Six Feet Under please do yourself a favor and do. I love it and it's one of my all time favorite shows. Simply, yes, you guessed it, brilliant."
    },
    {
      "username": "eamon-hennedy",
      "userUrl": "https://www.imdb.com/user/ur2400652",
      "reviewLink": "https://www.imdb.com/review/rw0736515",
      "warningSpoilers": true,
      "date": "4 February 2004",
      "rate": "",
      "helpful": "100 out of 115 found this helpful.",
      "title": "Magnificent and Compelling.",
      "content": "A drama series about undertakers shouldn't really be compelling drama, but when I heard that this was to be a drama about undertakers created by the writer of American Beauty and developed by HBO I took notice. Those pedigrees instantly suggest a great series and I am happy to say I am not disappointed. First of all this is television of almost redefining brilliance. The series is hard edged (some of the death scenes of the clients (i.e the guess characters whose funeral takes center stage of each episode) tends to be quite graphic, such as the auto-erotica asphyxiation scenario), the language frequently strong (the c-word has been uttered frequently) and there are many number of sexual scenes. However, unlike HBO's other golden child, The Sopranos, Six Feet Under may be undeniably adult fare, this is a series with heart and emotional integrity and is frequently very moving, but does so without dipping into the realms of sentimentality. Don't kid yourself if you haven't seen this series yet, we're not in made for television film territory here. This is dark stuff, full of disturbing dream sequences, downright strange dream sequences and sex of every kind (heterosexual and homosexual both get an equal look in here).A great series would be nothing without great characters and Six Feet Under has them in abundance. The Fisher family are at the forefront of the story and each one has their inherent little pet foibles that mark them out as superb to watch. Nate is laid back and is starting a serious relationship with Brenda, his brother David is gay (for the first season heavily closeted), sister Clare is a teenager coping with peer pressure and boyfriend trouble, mother Ruth is severely insecure while father Nathaniel senior is, well, he's dead and his ghost shows up every so often to give guidance to his family, most often to David. Then there's Brenda, Nate's girlfriend who has a crazy, psychopath of a brother, and her subsequent problems with sex addiction. If this all sounds crazy, then you're right, Six Feet Under is crazy, but with television getting increasingly lazy by relying on formulaic reality television show, Six Feet Under is breath of fresh air. It's surreal, downright strange yet compelling and beautiful. The wonderful music score by Thomas Newman, the great scripts and wonderful direction, and let's not forget the fantastic Emmy nominated performances, all help to make this one of the most moving shows on television. The way that the family deal with the funeral at the heart of each episode and the way that the writers deal with the story makes Six Feet Under one of the most poignant shows on television today.A series that is disturbing, puzzling but eventually moving, this is truly one of a kind."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8576294",
      "warningSpoilers": false,
      "date": "29 September 2022",
      "rate": "8",
      "helpful": "18 out of 19 found this helpful.",
      "title": "Glad I finally gave this a chance!",
      "content": "I've been hearing about how great Six Feet Under is since it was on nearly 20 years ago and thought I'd finally give in and watch with the pandemic hitting and having so much free time. I'm glad I finally gave it a chance. I can now see why it won so many awards and why so many people love this show. It's about a messed up family who run a funeral home and the lives of each of the family members. Each episode begins with a death and shows the lives about that person and how they died. It really is an interesting show. While I wouldn't rank it among the best shows I've ever seen it's still a good show that's definitely worth watching. They say the writing and acting are some of the best in television history, especially Michael C. Hall & Peter Krause! It also has one of the best final episodes of any show ever."
    },
    {
      "username": "morphion2",
      "userUrl": "https://www.imdb.com/user/ur6176268",
      "reviewLink": "https://www.imdb.com/review/rw1207540",
      "warningSpoilers": false,
      "date": "2 November 2005",
      "rate": "",
      "helpful": "80 out of 91 found this helpful.",
      "title": "The Complete First Season Review - Superb",
      "content": "Screenwriter Alan Ball is most well-known for his 1999 film debut American Beauty (directed by another first-timer, England's Sam Mendes). His first work was a stunning success, captivating audiences all over the world and winning five Academy Awards. In 2001, the pilot for Ball's first television series Six Feet Under aired. While being considerably darker than audiences might have expected, the series soon found its fan base and secured a place in the list of all time greats.The show revolves around the Fishers, a rather isolated and dysfunctional family who run their own independent funeral home, and whose eldest son Nate (Peter Krause) is reunited with them in the wake of his father's untimely death. Once he is home, Nate learns that he has inherited the family business with his gay brother David (Michael C. Hall) and he has to learn how to again become a part of this bizarre family. Meanwhile, David, we learn, is struggling to reconcile his homosexuality with his home-taught Christian values, while his younger sister Claire (Lauren Ambrose) is forced to battle the hell of adolescence and the children's mother Ruth (Frances Conroy), a deeply devoted mother and wife, has to learn to face life without her husband. The complete first season sees the growth of the Fisher family as they slowly begin to disband their isolation and seek comfort, support and love from one another in the face of hardships and tragedy.Six Feet Under is what every show should strive to be  it is intelligent, witty, sincere, realistic and completely unashamed to show the dark, painful side of life, without being depressing or nihilistic. It deals with an unfathomable amount of very significant issues, but on such a personal and relatable level that it doesn't even begin to feel preachy or self-important. It explores society's position on gays, women, young people, the elderly, the mentally ill and looks very openly at religion and death. A series of this standard is a surprise even from the production company that brought us Angels in America and The Sopranos.One of the most fundamental principles for engaging an audience is to present engaging characters. Six Feet Under is a prime example: each character we're introduced to does take some getting used to, but all are wonderfully rich and complex and three-dimensional, balanced nicely by each other. Not only the Fishers but all their friends, acquaintances and lovers are well-developed, highly-involved and important to the show in its many layers. Nate's girlfriend Brenda (Rachael Griffiths) and her manic-depressive brother Billy (Jeremy Sisto), David's boyfriend Keith (Mathew St. Patrick) and the Fishers' Puerto Rican employee Rico (Freddy Rodriguez) are all fantastic characters that do far more than just complement the show's funeral home family.Alan Ball is a truly gifted writer and an even more amazing artist; his ability to create such a delightfully unique environment and then to build on that environment to such incredible heights is nothing short of genius. His signature style of dark humor is one of the best things about Six Feet Under; even in a show about such somber and sometimes even morbid material, laughter is not uncommon, as he is able to recognize that there is more to life than pain. Ball has, within 2 short years, proved that he is one of Hollywood's most talented minds, and we can all look forward to further work from him.More than any other television series in history, Six Feet Under is able to connect with its audience on a raw and emotional level that makes the sentimental soap operas of prime time television look like badly acted school plays. Joining the ranks of the most intelligent and heartfelt shows of today, it can rest assured that it will be remembered in the world of tomorrow as one of the most innovative and poignant shows of all time."
    },
    {
      "username": "TuckMN",
      "userUrl": "https://www.imdb.com/user/ur0009605",
      "reviewLink": "https://www.imdb.com/review/rw0736478",
      "warningSpoilers": true,
      "date": "29 April 2002",
      "rate": "",
      "helpful": "58 out of 70 found this helpful.",
      "title": "Arguably the best hour on television.",
      "content": "From the haunting opening strains of the incredible theme music by Thomas Newman (part of The Fabulous Newman Boys, Alfred, Lionel, Emil, David and Oscar-winner Randy -- probably the most talented Hollywood musical family ever) to the scene of the death that will be this week's client' of the Fisher family funeral home you know that you are in for a different type of viewing experience.The amazing Alan Ball has put together a staggering ensemble of actors, directors, writers, photographers and editors that, without fail, present one of the finest hours on television. The make-up department deserves a special commendation for the work they do on the sometimes horribly mutilated corpses' of the clients.'Peter Krause (Nate Fisher) who did such an excellent job in `Sports Night' and worked with Mr. Ball before in `Cybill' is the reluctant head of the family mortuary business. He carries the huge burden of having a potentially deadly problem with the vascular system in his brain -- and like all the Fishers -- is reluctant to share the information with the people in his life that most need to know... Specifically his fiancée, Brenda Chenowith, Golden Globe winner Rachel Griffiths, who most Americans were introduced to in the Australian film `Muriel's Wedding.' Brenda has her own secrets -- not the least of which is the effect that one of her massage clients -- a prostitute -- seems to be having on her.Lauren Ambrose (Claire Fisher) continues to grow weekly as a character. She is fiercely independent and just as unwilling to share her life with her family as the rest of the Fisher clan. Her bitingly satirical look at the world she grew up in comes out in her language and her on-line screen name: ICDeddPeople. (There actually is an AOL profile for that screen name which adds to the verisimilitude of her character.)Which of course brings us to David (Michael C. Hall) the gay son and real heart of the family. David has his own demons. Occasional drug use, unsafe sex and the need to be loved for who he is -- of course following in the family trait of not telling anyone about who he really is and what consumes him.These myriad pieces, strong characters and outstanding production values all come together brilliantly under the firm hand of Mr. Ball and provide a fascinating look into a life that we all know exists but most of us have never explored.The tag line says it all: `Your whole life is leading up to this...'"
    },
    {
      "username": "MaxBorg89",
      "userUrl": "https://www.imdb.com/user/ur5156288",
      "reviewLink": "https://www.imdb.com/review/rw1922584",
      "warningSpoilers": false,
      "date": "2 August 2008",
      "rate": "10",
      "helpful": "20 out of 23 found this helpful.",
      "title": "A masterful look at life through death",
      "content": "For five years Six Feet Under entranced, entertained and moved audiences all over the world with its black humor, sharp characterization and flawless cast. It is now justly remembered as one of the best programs in television history, and can undoubtedly be considered HBO's masterpiece, hand in hand with The Sopranos - that's how groundbreaking its five seasons and 63 episodes were and still are.The show was created by Alan Ball, the Oscar-winning writer of American Beauty, and it is easy to see how SFU is Beauty's small-screen companion piece: they're both poignant, funny, original studies of traditional American values and families gone wrong, two pitch-perfect satires that hit the target with unprecedented accuracy, unafraid to use foul language, sex, drugs and - a truly brilliant choice, this - dream sequences to achieve their goal.What the Burnhams did on the big screen, the Fishers do on the small: they appear to be normal, but are really too dysfunctional to even accept themselves. Of course, \"normality\" is a bit of an odd concept when your house is a funeral parlor and you spend day after day comforting strangers while wearing a mask of thinly veiled hypocrisy.From that situation Ball got the premise of the show: what if one day you had to bury a family member? When Nathan Samuel Fisher Sr. (Richard Jenkins), owner of Fisher & Sons, is run over by a bus in the first scene of the series, the rest of the family slowly falls apart: the adulterous widow Ruth (Frances Conroy) is overcome by guilt; the eldest son, Nate Jr. (Peter Krause) is forced to reluctantly join the business; his brother David (Michael C. Hall) is completely dedicated to the family trade, but also gay and a bit awkward when he has to express his feelings; and the youngest sibling (Claire) has a thing for experimenting with drugs and dating the wrong boys. Helping them, or possibly not, in their attempts to cope with the new situation, are Federico Diaz (Freddy Rodriguez), who embalms the corpses over at Fisher & Sons, Keith Charles (Mathew St. Patrick), an African-American police officer who is dating David, and Brenda Chenowith (Rachel Griffiths), Nate's girlfriend, who has to deal with a twisted brother of her own, the mentally disturbed Billy (Jeremy Sisto).Six Feet Under was an essential tool in dealing with one of the biggest taboos in television: death. Every Single episode begins with someone biting the dust, often in a darkly comic way (the porn-star who gets electrocuted by her cat in the fifth episode comes to mind). Subsequently, the Fishers have to arrange the burial, and in most cases the departed come back in ghostly form to offer advice (the most notable case is that of Nathaniel Fisher himself, who pops up regularly in all five seasons). Many people were shocked by the almost grotesque tone of the series (the pilot episode even had fake commercials for funeral products), but what they failed to understand is that Six Feet Under deals with death as a means to celebrate life. To fully embrace existence implies that at some point one must also discuss the end of it all, and like Alfred Hitchcock used to say in his own TV series, what better way to face death than with a smile on your face? In its own, twisted way, this show confirmed that once again laughter is the best medicine.That doesn't mean the series should be mistaken for a full-on comedy, though: like stablemate The Sopranos, Six Feet Under remains, at its core, a pure American tragedy, the black humor being there just as a partial relief from the bleaker events occurring throughout the show's five-year run. The drama is perfectly served not just by the outstanding writing, but also, fundamentally, by the actors: Krause and Hall received most of the early praise, the former for acting as the audience's guide into the Fishers' twisted world, the latter for playing a believable, three-dimensional gay person, as opposed to the deliberately excessive and flamboyant characters depicted in another HBO hit, Sex and the City. The truth is, everyone gives their best, both the show's regulars (Rodriguez and Griffiths in particular) and the magisterial guest stars, including Patricia Clarkson, Lili Taylor, James Cromwell and Kathy Bates (who also directed a few episodes, like Steve Buscemi in The Sopranos).With its unique perspective on life and death, which was controversially amusing and surprisingly serious at the same time, Six Feet Under stands out as one of the edgiest, most brilliant and thought-provoking products American TV has ever spawned, a series whose reflection on the American way of life has few rivals in any artistic category."
    },
    {
      "username": "killercola",
      "userUrl": "https://www.imdb.com/user/ur131769494",
      "reviewLink": "https://www.imdb.com/review/rw8003205",
      "warningSpoilers": false,
      "date": "25 March 2022",
      "rate": "10",
      "helpful": "28 out of 32 found this helpful.",
      "title": "The greatest show in history that never got the attention it deserved",
      "content": "It's that show. The unexpected hidden gem. During its time The Sopranos, Oz and The Wire garnered most of the attention on HBO. All of them great shows to be sure but Six Feet Under quietly premiered a new episode every Sunday night and would become one of the all time great shows with perhaps the greatest show finale ever. If you haven't seen this show you're doing yourself a disservice. Yes, it's that good."
    },
    {
      "username": "gus120970",
      "userUrl": "https://www.imdb.com/user/ur1117092",
      "reviewLink": "https://www.imdb.com/review/rw1209792",
      "warningSpoilers": true,
      "date": "6 November 2005",
      "rate": "",
      "helpful": "28 out of 32 found this helpful.",
      "title": "No exaggeration to call it a masterpiece",
      "content": "Now that Six Feet Under is complete, it can be viewed as a totality. Whether just a convenient way of bookending 5 seasons of television, the arc of the show's narrative - starting with the death of a family patriarch and the reassembly of a family; and effectively ending with the death of his son five years later and its dispersal, provides a satisfying moral and narrative symmetry which cuts across plot line and cliffhanger devices used to propel and sustain commercial television shows. Six Feet Under had indeed completed its artistic mission of staring death solidly in the eye and viewing its from almost every conceivable angle.There is nothing more prosaic, yet unfathomable in human existence than death. Life often consists of so many explorable, yet unrealised elements, whereas death is impenetrable but utterly inevitable.Attempting to say anything meaningful and original about the subject within the medium of television, with its time-slices, ad breaks and audience considerations is brave. To do it consistently, across 63 episodes, and collaboratively, is arguably, an artistic triumph.Television is devalued as an artistic medium. At best it is seen as a transmission medium for the cinematic form outside the cinema.But the character and philosophical development made possible across 63 hours of storytelling is not possible within the structure of the feature film or theatre.In that sense television is a valid medium with unique potential that perhaps 'Six Feet Under' has realised for the first time in its history.Is it hyperbole to draw a parallel to Mozart's unlocking of the potential of the orchestra in the same way? Television is probably as far away from high art in the hierarchy of human expression as it is possible to get, but future times may think differently.I am confident that even as far ahead as 200 years, the very best contemporary television will still be watched and treasured, and Six Feet Under will be one of those treasures."
    },
    {
      "username": "aabonander",
      "userUrl": "https://www.imdb.com/user/ur9130005",
      "reviewLink": "https://www.imdb.com/review/rw6532809",
      "warningSpoilers": false,
      "date": "27 January 2021",
      "rate": "10",
      "helpful": "67 out of 71 found this helpful.",
      "title": "Even more profound almost 20 years later",
      "content": "I watched Six Feet Under when it originally aired on HBO. Hard to believe that was almost 20 years ago. At the time I remember thinking this was the best thing I'd ever seen on television. It was too good for television. It just transcended anything I had ever seen. Over the years I've recommended the show to countless others. After recommending it to another friend recently I decided to rewatch the show. I finished the series in less than two weeks and it is still one of the best things I've ever seen on TV. The effect this show has on me is even more profound today than it was the first time I watched it. This show punches you in the gut. It makes you think. It makes you reflect. It makes you question your choices. It makes you evaluate life. A lot of incredibly great television series have come along since Six Feet Under originally aired but none of them will hit you as deep as this show."
    },
    {
      "username": "Legendddd",
      "userUrl": "https://www.imdb.com/user/ur139059812",
      "reviewLink": "https://www.imdb.com/review/rw7399174",
      "warningSpoilers": false,
      "date": "1 October 2021",
      "rate": "10",
      "helpful": "17 out of 18 found this helpful.",
      "title": "ICONIC",
      "content": "One of the best series I've watched in my life without a doubt enters my top 5."
    },
    {
      "username": "automation21",
      "userUrl": "https://www.imdb.com/user/ur1529651",
      "reviewLink": "https://www.imdb.com/review/rw0736485",
      "warningSpoilers": false,
      "date": "31 May 2002",
      "rate": "",
      "helpful": "228 out of 252 found this helpful.",
      "title": "Entrancing, confronting, charming, absolutely mindbending. Feels like an insult to call it television",
      "content": "And I rarely even watch television. I'm a book person.Not since the \"X-Files\" has a TV show been so intriguing. Every time I watch an episode, I am struck back be depth of storyline, the intricate characters and the left-of-the-middle storytelling. I literally cannot control myself from discussing each new episode with (bored) family members.SFU is a very introverted show - it resembles more a book or play than television. While the latter is extroverted and relies on events happening to characters (eg: the overboard emergencies of ER or the romances in soaps) to carry the story, Six Feet Under wants to communicate the deepest feelings and ideals of the people on screen. As a result, it not only stimulates the mind but also helps us analyse ourselves.In the hands of any other creators, this would make for a very dull hour of suburban spirituality, but Allan Ball's menagerie of ghosts, (past characters influencing the present) trippy daydream sequences, surreal atmosphere and some wicked black humour make for a very entertaining show and sell what would otherwise be a marketing disaster to the masses. On top of that, every component from acting to directing to screenplay is flawless. (the dead boy's ghost in \"a private life\" still chills me to the bone).Most, of all I admire the characters: some of the most complex and enchanting creatures ever to grace the idiot box. After a few episodes, they feel like a second family.While I do have my complaints about the amount of obscenity, (I can swear that sometimes the writers want to offend us just for fun) I have to give my show the highest commendations. There are, of course, moments when I feel like throwing my chair at the television, but that is simply the consequence of watching a show that challenges me, rather than offer cheap amusement.SFU may take a while to get into, but the rewards are bountiful."
    },
    {
      "username": "yann-pastor",
      "userUrl": "https://www.imdb.com/user/ur30300958",
      "reviewLink": "https://www.imdb.com/review/rw7184559",
      "warningSpoilers": false,
      "date": "1 August 2021",
      "rate": "10",
      "helpful": "20 out of 22 found this helpful.",
      "title": "The best series finale ever",
      "content": "The series is beautiful. It's ending a masterpiece. Without revealing anything here, it's worth watching the full series for that finale."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw7215957",
      "warningSpoilers": false,
      "date": "11 August 2021",
      "rate": "8",
      "helpful": "17 out of 21 found this helpful.",
      "title": "Really Good!",
      "content": "I've been hearing about how great Six Feet Under is since it was on nearly 20 years ago and thought I'd finally give in and watch with the pandemic hitting and having so much free time. I'm glad I did! I can now see why it won so many awards and why so many people love this show! I wouldn't rank it among the best shows I've ever seen but it is def really good. The writing and acting are some of the best in television history, especially Michael C. Hall & Peter Krause!"
    },
    {
      "username": "PoisonKeyblade",
      "userUrl": "https://www.imdb.com/user/ur7752337",
      "reviewLink": "https://www.imdb.com/review/rw1811847",
      "warningSpoilers": true,
      "date": "1 February 2008",
      "rate": "10",
      "helpful": "18 out of 23 found this helpful.",
      "title": "The best show ever!",
      "content": "Six Feet Under, HBO's most accomplished and consistently excellent show, ended a little more than two years ago. So why review the show, and learn about it now? Six Feet Under is much more than it seems. A rich show with several layers, it's all about people living their lives, making discoveries about themselves, and of course some drama, romance, and suspense thrown in for good measure. Not only is the show the best and most amazing show in television history, but it is also an incredible portrayal of human life and what it means to live. We live, we die, and the world keeps moving on. Six Feet Under is all about life and loss and all of the emotions, horrors, and realization that come with it. It is at times depressingly realistic, but it can also be beautifully true. There are so many beautiful things in this world, and if you just look or listen, you can find them. You can take joy in your life and make it worth living.The dialogue, the writing, and the acting make this show a real treasure, and there isn't a single flimsy patch in this perfectly built house. Every time a character has an argument or gives a big speech, everything is just perfectly laced with dark humor and an often cynical approach to life that everyone can openly relate to. We've all lost people that we care about, and we all have to move on. All of these situations and interactions seem so entirely human and possible that they really pull you in with their hard-hitting content. Which is also to say that this show doesn't hold anything back. It's raw. It's mean. It's real. There are practically no boundaries because that's exactly what life is; it's a big roller coaster ride of breaking rules, learning lessons, making mistakes, meeting new people, and new experiences. This show never teaches and preaches: it tells it like it is, and doesn't bother with subtlety.After the oldest member of the family, Nathaniel Fisher (Richard Jenkins), is killed suddenly in a car crash, all of the Fisher family is brought together under the strangest of circumstances. The family is very off-beat and bizarre, and each member lives (or lived) in the family house, a very large funeral home. There is: Ruth Fisher (Frances Conroy), caring, troubled mother who is still not sure what pleases her; Nate Fisher (Peter Krause), oldest son who was coming home for the holidays when tragedy struck; David Fisher (Michael C. Hall), closeted homosexual who takes over the family business in the wake of Nathaniel's tragedy; and Claire Fisher (Lauren Ambrose), quirky young high school student who becomes obsessed with photography. And of course, there is Federico Diaz (Freddy Rodriguez), facial restoration expert who works at the funeral home, Brenda Chenowith (Rachel Griffiths), a woman Nate meets in the first episode and becomes extremely attached to, and Keith Charles (Matthew St. Patrick), David's boyfriend and a mysterious figure to the rest of the family. The show is all about the budding family business, losing a loved one, Nate's reluctance to embrace his family, and David's reluctance of coming out, along with much more.The show is host to a series of spectacular performances from the likes of Michael C. Hall and Lauren Ambrose to the underrated Rainn Wilson and Peter Krause. Most of these episodes are filled to the brim with such heady emotional drama that if the wrong actors were participating, the show would be a total wreck. There are so many fantastical opportunities and guest appearances, and there were some truly amazing episodes every week. The people with smaller roles are even spectacular, and the ones that come in later in the series are simply to die for. Some of my favorite smaller-role characters: Bettina, played by Kathy Bates; Maggie, played Tina Holmes, Gabe, played by Eric Balfour; and Jimmy played by Peter Facinelli. It is also of note that nearly every cast member in any given episode contributes to the altogether perfect and realistic quality of this series.Six Feet Under might have ended in 2005, but its relevance to society and culture will probably not fade for quite some time. It remains the best show of all time simply because it was consistently superb, with not a single bad episode. The writing was the very best and there were constant references to previous seasons. With the finale, everything came full circle and we are left to reflect on our lives and the entire series. Each scene is so rich with detail and the final ten minutes are just stunning. After seeing this finale, this show truly moved from being extremely excellent to being the best show ever. After watching through the series twice now, it has become all the better because of the season finale. The characters are just so perfect and they are given what can only be described as extremely satisfying conclusions. There has arguably never been a more thought-provoking, realistic, moving, spectacular scene in the history of television. If you're a lover of Six Feet Under, here are some amazingly good recommendations: check out Dexter, Queer as Folk, Nip/Tuck, and Heroes."
    },
    {
      "username": "DagRos",
      "userUrl": "https://www.imdb.com/user/ur90308370",
      "reviewLink": "https://www.imdb.com/review/rw4245522",
      "warningSpoilers": false,
      "date": "20 July 2018",
      "rate": "10",
      "helpful": "18 out of 22 found this helpful.",
      "title": "Probably most underrated show - best TV series ever",
      "content": "I have seen all major TV series: Sopranos, Wire, Breaking Bad, Games of Thrones, Mad Men, Downton Abbey etc etc etc.. and this is the best show of them all without hesitation. This is an excellent drama about relationships, family, life and death. After having watched this series you will be a slightly different and better person. Don't miss this great opportunity! Don't be held back that this is an older series, invest your time and you will be greatly rewarded for doing so.Everything else about this series has been said in the reviews below. This is my first review on IMDB and I just felt I needed to post one after having watched this series, and hopefully bring some more attention to this fantastic masterpiece.Put this on the top of your list and start watching asap !"
    },
    {
      "username": "The_Wood",
      "userUrl": "https://www.imdb.com/user/ur1195884",
      "reviewLink": "https://www.imdb.com/review/rw0736474",
      "warningSpoilers": false,
      "date": "10 March 2002",
      "rate": "8",
      "helpful": "68 out of 102 found this helpful.",
      "title": "A show that grows on you.",
      "content": "Admittedly I didn't care for Six Feet Under the first time I saw it. Alan Ball's first few episodes seemed a little too reminiscent of American Beauty. It's not that I don't like American Beauty, in fact I love it; I just don't like to see clones. Once you get past the similar wicked wit the two share -- you'll find that Six Feet Under is completely different.Each episode goes into a different direction every week. These characters -- like real people, grow and make mistakes. This is a wonderful show that is about those who deal with death, but isn't it ironic how Six Feet Under is true to life."
    },
    {
      "username": "Victor Field",
      "userUrl": "https://www.imdb.com/user/ur0290901",
      "reviewLink": "https://www.imdb.com/review/rw0736496",
      "warningSpoilers": false,
      "date": "24 January 2003",
      "rate": "",
      "helpful": "40 out of 60 found this helpful.",
      "title": "We're not talking \"In Loving Memory\" here, people.",
      "content": "\"Six Feet Under\"'s second season was a notch below the first, but only a notch.The story of the lives and loves of the Fisher family, Alan Ball's creation (and sometimes writing) is certainly dark, but at the same time very layered, thoughtful, moving - by the end of the second season all the main characters have changed somewhat from what they were, and that's not meant as a criticism - and very funny. These are all qualities found in Ball's earlier script for \"American Beauty\" (who'd have thought he used to write for \"Cybill\"?), but there are people who can't abide the film while loving the series. Maybe it's the HBO connection... labels, who needs 'em?The closest the show ever gets to formula is the obligatory scene where the week's dead person is unveiled (the temptation to play spot-the-corpse-to-be is unavoidable, though the writers often wrongfoot the viewer); the understandable desire to give all the main players something to do meant season 2's impact was diluted a bit, mostly due to Mathew St. Patrick as Keith (did we HAVE to get his family involved?).Otherwise, the series is well nigh impossible to fault - the acting and writing are top of the range, the humour never gratuitously tasteless (and the fake commercials shown in the first episode have never returned, an early indication that this show may know when to quit), the series intriguingly inverts the usual male/female nudity ratio, as well as seeing homosexuality and drug use as aspects of life that are neither good nor ill (though no one will ever confuse this for \"Queer As Folk\" - Channel 4 or Showtime versions), and the title sequence illustrating the journey to the grave combined with Thomas Newman's sublime Emmy-winning theme music never fails to draw you in. For a show that's basically about death, this is full of life.\"In Loving Memory,\" in case you're wondering, was a 1970s British sitcom set in a funeral home. The difference between this and \"Six Feet Under\" is the difference between, say, Avril Lavigne and Reba McEntire."
    },
    {
      "username": "ingmarbeldman-753-927212",
      "userUrl": "https://www.imdb.com/user/ur23332602",
      "reviewLink": "https://www.imdb.com/review/rw5505133",
      "warningSpoilers": false,
      "date": "23 February 2020",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "After 20 years still relevant. Like it's made yesterday...",
      "content": "I have seen SFU three times in 10 years, 5 seasons,always within a week. Why actually? Why is this my favorite show?The show is a dark comedy about a seemingly unusual funeral home family, with additional family, friends and colleagues who, like the family, are equally disturbed and often depressed. But if you look deeper, the series is mainly about death. In all its forms. And that is as confrontational as it is liberating.The end..... Oh boy, that famous end, that brilliant end, in which there are so many bitter-sweet feelings of farewell, that even after a third viewing, i am overwelmed with my own mortality and love for life.SFU is more than a brilliant series. It is a lesson in accepting death. And that doesn't hurt every now and then."
    },
    {
      "username": "bbgrl93",
      "userUrl": "https://www.imdb.com/user/ur22761043",
      "reviewLink": "https://www.imdb.com/review/rw4403873",
      "warningSpoilers": false,
      "date": "17 October 2018",
      "rate": "9",
      "helpful": "28 out of 32 found this helpful.",
      "title": "One of the best show's of all time",
      "content": "This is by far one of the best shows I've seen. As with every show, there were a few episodes that were dry but overall it was really good and I couldn't resist binge watching episodes! The shows final finale was by far one of the best I've ever seen, couldn't help but shed some tears. They tie everything together perfectly, I would deff rewatch this series"
    },
    {
      "username": "jzappa",
      "userUrl": "https://www.imdb.com/user/ur8625456",
      "reviewLink": "https://www.imdb.com/review/rw2001982",
      "warningSpoilers": true,
      "date": "4 January 2009",
      "rate": "10",
      "helpful": "14 out of 19 found this helpful.",
      "title": "You Will Find Its Rewards Owed No More Than a Handful of Superlatives That Do Justice",
      "content": "Alan Ball's Peabody-winning seriocomic five-season saga is about a family with a particular blessing in disguise. Three siblings have spent their childhoods growing up with death ceaselessly in their home. And as a part of the business of death, they are on the receiving end of the grief and shock of murders, diseases, accidents and old age suffered by the loved ones of complete strangers (mostly). Each episode, save a baby's handful of significant ones, opens with the death of any given person, caused by anything from gang shootings or heart attack to too much LSD, and that death generally sets the pitch for its episode, pressing the characters to consider their present fortunes and hardships in a manner that is clarified by the death and its aftermath.Their customers' loved ones sprawled out in their birthday suits in the basement, which for decades has never had a break from the presence of lifeless rotting corpses with which the Fishers and their frustrated reconstructionist Rico become intimately acquainted during the exhuming process. This is the last environment in which most people---really, all people like Nathaniel Fisher, Sr.'s wife and children---would ever want to live their lives. However, they learn more about the realities of the world's two biggest fears, life and death, than the rest of us will ever confront. How does your old friend from high school run over himself? How does one deal with never knowing how and why your husband, wife, daughter, son, mother, father died so suddenly? The situations, circumstances, philosophies and moral dilemmas are endless.The catch-22 is that even though the Fishers and those close to them are reasonably wiser, they are not all necessarily stronger. Some become more reticent, or more resigned, or face more and more demons, or they cannot seem to do anything that doesn't feel like a waste of their time to exist.To a significant degree, the show is a square family drama, taking in hand such concerns as relationships, betrayal, and religion. In chorus, it is a show characterized by its unwavering spotlight on the upsetting matter of death. This notably Bergmanesque melodrama also has a pungent dose of black comedy, the element of surprise, unexpected juxtapositions and non- sequiturs. Time and again watching the show, one is shocked by its admirable run on the American air. US audiences don't tend to seek out shows in their free time about their worst fears, dealt with in heavy symbolic and cerebral ways and wracking you with longing, rage and tears. But the show is one of the healthiest, most cathartic things you could do in front of the television set. It makes you accept death. It causes you to reflect on the pros and cons of one's own situation just as the Fishers do every day. I, for one, am frequently bothered by the ambivalence of purpose to existence as a whole, and, while many would much rather escape into the worlds of Monk, Bones, Psych and other fluffy shows, I feel comforted by the likeminded company of these self-reflexive characters and their journeys through fatalism, existentialism, epiphany, joy and pain, especially when they do not belong to a commonly sensationalized world like crime or policework or sports. Rather, they are what many TV viewers I know would find repellant as characters to face each week. And these characters know this.There is not only a lot of tremendous talent but tremendous wisdom at work in this show, from the cast of both actors I already knew, like Rachel Griffiths, Freddy Rodriguez, James Cromwell, Patricia Clarkson and Kathy Bates, and remarkable actors I was just discovering, like Peter Krause, Michael C. Hall, Lauren Ambrose, Frances Conroy and Matthew St. Patrick, to the out-of-the-box master writers, Nancy Oliver and the show's Oscar-winning creator Ball.There are times when this show seems to drag, as surreal and genre-bending as it relentlessly is. Griffiths seems to always be having sex with someone. Lauren Ambrose indulges every narcissistic or pretentious pitfall of her, and my, generation. No one can seem to escape tactless, unpredictable pain and pain never seems to escape anyone's addicted control. Just know that if you persist till the show's finale, you will find its rewards owed no more than a handful of superlatives that do justice."
    },
    {
      "username": "StevenCouras",
      "userUrl": "https://www.imdb.com/user/ur3150910",
      "reviewLink": "https://www.imdb.com/review/rw2040478",
      "warningSpoilers": false,
      "date": "20 March 2009",
      "rate": "10",
      "helpful": "113 out of 124 found this helpful.",
      "title": "This moved me...please read...my opinion",
      "content": "I started watching this show cause it was on cable HBO on-demand a few months ago. I always heard good things about it. Plus I figured HBO has provided me with some of my favorite shows in the past few years (Entourage, The Sapranos, True Blood) so this should be pretty good.The show came out while I was in college, where we had no cable since I lived on campus but my friends and stuff that went home on the weekends raved about this show.So needless to say I gave it a try. I was hooked every month HBO on demand would give us 7 new episodes and I would watch them all within the first 3 days.4 months later I was up to the first half of season 4. Finishing those episodes pretty fast I went online and started watching the second half and all of season 5 online cause I could not stop, I was SO hooked.I just finished watching the final episode WOW.This show came full circle and ended so perfectly. Watching all 5 seasons, I was moved. The final 8 minutes I watched 4 times cause it was done so well, I was moved I lost a best friend of mine a year ago to a tragic accident. I think about her every day. Death has always scared me, its my biggest fear and watching this show sometimes made me go nuts with all the analyzing of death and life but I still watched and sometimes it made me feel better and gave me some perspective on the subject.I really related a lot to the character of Nate. He reminds me of me in a lot of ways and I liked Clair also but towards the end of the series I fully understood each character, their pain, their lives, everything I have family and friends just like them, we all do.This show really captures life. The bad and the good and the really bad and the moments in between.I am 26 years old, and I don't think their will ever be another show like this on TV ever again. I am even a little bit sad that I wont be keeping tabs on the Fisher family and their friends ever again now that the show is over.\"Everyone, Everything, Everywhere, ends\" and so did Six Feet Under.Thank you to the writers, producers, director, and actors for making this important show about life and death. It helped me in some ways with my own views on death and life Thank you."
    }
  ],
  "errorMessage": ""
}