{
  "imDbId": "tt0248654",
  "title": "Six Feet Under",
  "fullTitle": "Six Feet Under (TV Series 2001–2005)",
  "type": "TVSeries",
  "year": "2001",
  "episodes": [
    {
      "id": "tt0701973",
      "seasonNumber": "5",
      "episodeNumber": "1",
      "title": "A Coat of White Primer",
      "image": "https://m.media-amazon.com/images/M/MV5BNTVhMDQ2N2YtZGVjZC00ZmM3LTgzNDktNjgxNGIxNzc1YmI2XkEyXkFqcGdeQXVyNjE2NjAyNTg@._V1_Ratio1.8413_AL_.jpg",
      "year": "2005",
      "released": "6 Jun. 2005",
      "plot": "The insecure Andrea Kuhn is encouraged by her psychiatrist to disclose her true feeling to her family, and when she is happy being herself, her husband accidentally kills her after an argument. Ruth recalls how stress triggered a depressive psychosis in George and his treatment with electroshock. Brenda has a miscarriage in the eve of her wedding day. Billy invites Claire to move to his place. David and Keith are discussing the alternative for their baby, adoption or to rent a belly. Rico misses a steady relationship while dating women from an Internet site.",
      "imDbRating": "8.4",
      "imDbRatingCount": "1448"
    },
    {
      "id": "tt0701983",
      "seasonNumber": "5",
      "episodeNumber": "2",
      "title": "Dancing for Me",
      "image": "https://m.media-amazon.com/images/M/MV5BZGY4NGJkYWItYTE5Yy00N2YwLWIzMGUtOWQ2NmVhMjYwYWJlXkEyXkFqcGdeQXVyNjE2NjAyNTg@._V1_Ratio1.8095_AL_.jpg",
      "year": "2005",
      "released": "13 Jun. 2005",
      "plot": "While trying to reach the newspaper on the sidewalk, Samuel Wayne Hoviak, who was the best high-school friend of Nate, falls and his truck run over him. In the funeral service, Nate meets their other former best friend, Tom Wheeler; they recall their adolescence and realize that they are getting up. The bitter and deranged Ruth has no patience with George, and they receive his daughter Maggie. David proposes Claire to donate her eggs for the baby of his own with Keith, but she refuses. Claire feels her art rejected by the owner of a gallery and Billy misses his former...",
      "imDbRating": "8.0",
      "imDbRatingCount": "1362"
    },
    {
      "id": "tt0701993",
      "seasonNumber": "5",
      "episodeNumber": "3",
      "title": "Hold My Hand",
      "image": "https://m.media-amazon.com/images/M/MV5BOTA0NDgyNTA1OF5BMl5BanBnXkFtZTgwODMyNzM0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "20 Jun. 2005",
      "plot": "In 1954 Loretta Smith Sibley committed suicide in front of her son George. With the anniversary of September 9th approaching, George is haunted by her presence enough to distract him at home, repeats his habit of placing unwanted food in his pockets, telling Ruth he was saving it, and confesses to Maggie that he again needs therapy. Ruth also has to deal with Claire confronting her after she freezes her account since she's no longer in school. Billy buys her the camera she wanted to purchase herself as they consider leaving for Spain, but Ruth disapproves of the whole...",
      "imDbRating": "8.3",
      "imDbRatingCount": "1340"
    },
    {
      "id": "tt0702032",
      "seasonNumber": "5",
      "episodeNumber": "4",
      "title": "Time Flies",
      "image": "https://m.media-amazon.com/images/M/MV5BNDlmMWQ2NTktM2MxNy00NjAyLTg2ZTktM2IyMGE5ZmJkNDMyXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "27 Jun. 2005",
      "plot": "Lila Simmonds Coolidge passes away just before her 95th birthday...which she happened to share with Nate. This year, Nate's 40th is marked by the news that he'll be a dad, which he doesn't react to as enthusiastically as Brenda had hoped. Claire breaks off with Billy after a final night together because of his wild behavior off medication, while George's apologies to Ruth don't lessen her impatience toward his problems. Rico sleeps with Vanessa when he shows up to remind she forgot to pick their son up, but she ensures it will be the last time. At Nate's unwanted ...",
      "imDbRating": "8.7",
      "imDbRatingCount": "1491"
    },
    {
      "id": "tt0701986",
      "seasonNumber": "5",
      "episodeNumber": "5",
      "title": "Eat a Peach",
      "image": "https://m.media-amazon.com/images/M/MV5BZmZmYWQ0NDMtZmQ1Yy00YTljLWE5MTUtYTE0NjAwNmNhNGRjXkEyXkFqcGdeQXVyNjE2NjAyNTg@._V1_Ratio1.7937_AL_.jpg",
      "year": "2005",
      "released": "4 Jul. 2005",
      "plot": "Diabetic Daniel Holzenchenko succumbs to the call of canned peaches...and leaves behind 2 brothers and 2 sisters who seem unable to agree on anything from refreshments to music to be used at his funeral. While trying to mediate them, Nate also has to figure out how to convince Brenda not to tell Maya that she is her stepmother and her real mother Lisa is dead. David and Keith go to an adoption agency picnic where they meet Anthony, and choose to foster and possibly adopt him and his brother, when Mary's news about conception changes to news of an error. Ruth tells her...",
      "imDbRating": "8.2",
      "imDbRatingCount": "1301"
    },
    {
      "id": "tt0702024",
      "seasonNumber": "5",
      "episodeNumber": "6",
      "title": "The Rainbow of Her Reasons",
      "image": "https://m.media-amazon.com/images/M/MV5BMTYzMTQ2MjYzM15BMl5BanBnXkFtZTgwOTIxNzM0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "10 Jul. 2005",
      "plot": "Sarah O'Connor's best friend and Nate's first love Fiona Lenore Kleinschmidt falls down a mountain on a hiking trip with Sarah, causing she and her friends to stay a few days at the Fishers' and giving Ruth a good excuse not to show up to George's apartment for a few days...until Maggie notes she's put nothing of hers in the place. Claire applies for a temp agency job but the blandness of it is disappointing, especially with an art grant's rejection at about the same time. Anthony's older brother Durrel proves a rebellious, trouble-making thorn that Keith is all too ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "1442"
    },
    {
      "id": "tt0702027",
      "seasonNumber": "5",
      "episodeNumber": "7",
      "title": "The Silence",
      "image": "https://m.media-amazon.com/images/M/MV5BNDhlZTIxNDItZWZiNC00MDRlLWI2ZWYtYWRiODMyZDljN2U5XkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "17 Jul. 2005",
      "plot": "Maggie Sibley's friend and fellow Quaker Peter Thomas Burns suffers a heart attack while watching a play, and Nate becomes intrigued about her faith when she brings it up. Brenda's blood tests reveal that her and Nate's child has a higher-than-usual possibility for developing Down's Syndrome or other complications at birth, and the doctor recommends amniocentesis to eliminate these factors. Ruth, feeling a misfit among other women in the sudden free time offered her without George, is displeased to hear that he wants the briefest divorce possible since he's already ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "1324"
    },
    {
      "id": "tt0702007",
      "seasonNumber": "5",
      "episodeNumber": "8",
      "title": "Singing for Our Lives",
      "image": "https://m.media-amazon.com/images/M/MV5BODI1ZTdlMDQtZGJhYy00ZWYzLWFiOGItZGVkOTAwOTdjNWUxXkEyXkFqcGdeQXVyNjE2NjAyNTg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "24 Jul. 2005",
      "plot": "Pilar Sandoval attempts to Rollerblade a steep hill while walking her dogs but literally doesn't make it when she loses control and is hit by a car. Brenda is upset with Nate's fists-up attitude toward the daughter they'll have, and is suspicious that his latest wish to attend Quaker meetings is simply to join Maggie. David, Nate, and Rico try but fail to agree on how to invest on the business, but it gives Rico a good opportunity to focus on pursuing his relationship with Vanessa. Ruth's babysitting experience with Durrel and Anthony goes sour when they don't return ...",
      "imDbRating": "8.7",
      "imDbRatingCount": "1503"
    },
    {
      "id": "tt0701987",
      "seasonNumber": "5",
      "episodeNumber": "9",
      "title": "Ecotone",
      "image": "https://m.media-amazon.com/images/M/MV5BY2I4ZGIyZmItZGVmZC00ZjE3LTgyMzYtODdiOTY2YTljZTAxXkEyXkFqcGdeQXVyNjE2NjAyNTg@._V1_Ratio1.8730_AL_.jpg",
      "year": "2005",
      "released": "31 Jul. 2005",
      "plot": "Lawrence Hall Matheson chooses the wrong moment to check his pulse while jogging in a California \"ecotone\" - a cougar mauls him. Hospitalized following his seizure, an unconscious Nate dreams he returns home after he simply woke his asleep arm up and requested a divorce, while in reality Maggie struggles to answer medical questions and contact the family. David arrives only to learn that Anthony is terrified to be in a hospital, and Claire is accompanied the whole time by Ted, so she respects him despite the fact that he's Republican. The doctor, unfamiliar with Nate ...",
      "imDbRating": "9.5",
      "imDbRatingCount": "2439"
    },
    {
      "id": "tt0701975",
      "seasonNumber": "5",
      "episodeNumber": "10",
      "title": "All Alone",
      "image": "https://m.media-amazon.com/images/M/MV5BZTMwYTJkZTUtNzY1Ni00MmI0LTk3MjEtNjY1ZjA5OGEwMTM2XkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "7 Aug. 2005",
      "plot": "The family prepares for the worst funeral of their lives. Ruth makes things worse on David by taking out her pain on him until he stands up for himself, and Nate makes things worse for Brenda by reminding her she had the chance to marry Joe if she doubted him. Claire, troubled by the fact that mainly negative memories come to mind, again finds comfort in Ted, who explains that it's not unusual. In the middle of the preparations, Keith gets an emergency call from Roger to remove a breaking-and-entering actor...who reveals Roger taped their affair as he promised he ...",
      "imDbRating": "9.7",
      "imDbRatingCount": "2970"
    },
    {
      "id": "tt0702009",
      "seasonNumber": "5",
      "episodeNumber": "11",
      "title": "Static",
      "image": "https://m.media-amazon.com/images/M/MV5BYTMzZDQ5NzUtZjdlMS00YTA0LWI4MDEtN2FlMmNjZWE4N2I2XkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "14 Aug. 2005",
      "plot": "Iraqi War veteran Paul Ronald Duncan receives a euthanasia in the hospital - and Claire, on drugs, takes out her own loss on the family by denouncing the war in general but also them for letting their son serve. Later, after several days of drinking, she is fired and fights Ted for taking her keys, then later crashes her car by trying to avoid hitting a deer when going to visit the family's newest grave. David can't find a way to express his feelings so colorfully, so is still plagued by nightmares and daydreams 6 weeks after the funeral, mostly involving an ...",
      "imDbRating": "9.1",
      "imDbRatingCount": "1947"
    },
    {
      "id": "tt0701989",
      "seasonNumber": "5",
      "episodeNumber": "12",
      "title": "Everyone's Waiting",
      "image": "https://m.media-amazon.com/images/M/MV5BNzBkZGM1MmItZmFlOC00ZTAxLWI3ZWQtMmRhZGM3ZjZiMWI3XkEyXkFqcGdeQXVyNjE2NjAyNTg@._V1_Ratio1.8254_AL_.jpg",
      "year": "2005",
      "released": "21 Aug. 2005",
      "plot": "Nate and Brenda's daughter Willa is born, but 2 months early and at only 2 lb. 4 oz., requiring a prolonged hospital stay. Nate is convinced she won't make it and insists that he can't accept it if she does and is \"damaged\", shaking Brenda's own confidence. Rico encourages David to sell the funeral home but instead he and Keith buy out Rico's 25% so he can start his own. David agrees to temporarily leave home, and goes to the funeral home. There he's confronted by Nathaniel about considering leaving the business and for his gayness, and is forced to fight his ...",
      "imDbRating": "9.9",
      "imDbRatingCount": "10762"
    }
  ],
  "errorMessage": ""
}