{
  "imDbId": "tt0248654",
  "title": "Six Feet Under",
  "fullTitle": "Six Feet Under (TV Series 2001–2005)",
  "type": "TVSeries",
  "year": "2001",
  "episodes": [
    {
      "id": "tt0702005",
      "seasonNumber": "3",
      "episodeNumber": "1",
      "title": "Perfect Circles",
      "image": "https://m.media-amazon.com/images/M/MV5BYjBkNzgyMjctMThiYi00ZGY4LTlkMjYtYTQ3OTUzN2VhMzQzXkEyXkFqcGdeQXVyNjE2NjAyNTg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "2 Mar. 2003",
      "plot": "The surgeons are dismayed when Nate's blood vessel ruptures and he suffers a hemorrhage, and his blood pressure continues to rise, then Nate dies...At least, the family and Rico are in shock, grieving, while Nate himself is dining in a hated restaurant with his father, impatiently waiting to get to his own funeral. He arrives early, sick of the food, and sees his funeral (open-casket, not a memorial service after cremation as he wished)...then hears David speaking to him from the next room where he sees himself paralyzed and with speech problems struggling to relearn....",
      "imDbRating": "8.2",
      "imDbRatingCount": "1626"
    },
    {
      "id": "tt0702035",
      "seasonNumber": "3",
      "episodeNumber": "2",
      "title": "You Never Know",
      "image": "https://m.media-amazon.com/images/M/MV5BMzRlMjFiZTMtODJhOS00MzgyLWI1YWUtZjg4NDg1NmUyNWJlXkEyXkFqcGdeQXVyNjE2NjAyNTg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "9 Mar. 2003",
      "plot": "Telemarketers Andrew Wayne Milne, Matthew Clark Hazen, and Martin Jacobs are shot by their insane former co-worker Daniel Grant Showalter who then commits suicide. Fisher & Diaz gets both the Milne and the Showalter funerals - but Rico objects to having the killer's, especially on the same day his victim's is to be held, so makes David's life miserable by refusing to pick up his body or do his job quietly. Stuck picking it up himself, David misses therapy with Keith, and Frank Mushler encourages him to view his own feelings about David without him around to defend ...",
      "imDbRating": "7.8",
      "imDbRatingCount": "1379"
    },
    {
      "id": "tt0702015",
      "seasonNumber": "3",
      "episodeNumber": "3",
      "title": "The Eye Inside",
      "image": "https://m.media-amazon.com/images/M/MV5BMjMzMDIwODM5NV5BMl5BanBnXkFtZTgwMDMxNzM0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "16 Mar. 2003",
      "plot": "Callie Renee Morimer flees a group of jeering young men calling to her as she walks alone in the dark, who turn out to be some joking friends, but stops in the street and is hit by a car upon realizing it. David enjoys singing in the choir but turns down an opportunity to go to a member's open house - he and Keith are spending the weekend at a hotel out of town, but from the moment they get there David worries about seeming too obviously gay in front of the straight couples. Carol finally crosses a line when blaming Lisa's family for not allowing her to give her ...",
      "imDbRating": "7.9",
      "imDbRatingCount": "1362"
    },
    {
      "id": "tt0702002",
      "seasonNumber": "3",
      "episodeNumber": "4",
      "title": "Nobody Sleeps",
      "image": "https://m.media-amazon.com/images/M/MV5BMTA4ODg1Nzg3NDheQTJeQWpwZ15BbWU4MDA4MTczNDIx._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "23 Mar. 2003",
      "plot": "Robert Lamar Griffin's rare heart disease finally takes its fatal toll, leaving behind his boyfriend Kevin Lamb, a scene-designer of the opera company where he was a lighting-designer, who requests Fisher & Diaz to allow him to create a Chinese opera set for the funeral. David suspects Rico's views of homosexuality are narrow and defends it, while the couple's having been together so long offer new insight to his relationship with Keith. With Ruth's birthday approaching, Lisa prepares to throw her a party despite Nate's warning that she prefers her birthdays without ...",
      "imDbRating": "8.6",
      "imDbRatingCount": "1576"
    },
    {
      "id": "tt0702028",
      "seasonNumber": "3",
      "episodeNumber": "5",
      "title": "The Trap",
      "image": "https://m.media-amazon.com/images/M/MV5BMjMxMTY5MDQ4Nl5BMl5BanBnXkFtZTgwNjMxNzM0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "30 Mar. 2003",
      "plot": "A lost pair of hikers discover the wrecked remains of a car with the skeleton of the driver, William Aaron Jaffe, inside. Nate is surprised by the son who never knew him not seeming to be troubled by it, and worried by the remarried widow's remark that they weren't right for each other and married too hastily - his own relationship with Lisa has become strained when she encourages him to cut back on his spending and considers staying home with Maya for a few years, without even letting him be the first to know. Things are further complicated when Nate runs into Brenda...",
      "imDbRating": "7.9",
      "imDbRatingCount": "1341"
    },
    {
      "id": "tt0702001",
      "seasonNumber": "3",
      "episodeNumber": "6",
      "title": "Making Love Work",
      "image": "https://m.media-amazon.com/images/M/MV5BMTk3ZGQwOWYtZGNhZS00ODFmLWFjYmUtOWJhZmU0YWU3NjE4XkEyXkFqcGdeQXVyNjE2NjAyNTg@._V1_Ratio1.8413_AL_.jpg",
      "year": "2003",
      "released": "6 Apr. 2003",
      "plot": "Karen Postell Pepper suffers a hemorrhage to the nose while preparing to enter the \"Making Love Work\" TV studio with a question to ask Dr. Dave. Nate prepares to go on his first camping trip in 2 years (where he went without Brenda), with Lisa, Maya, and Dana, Todd, and their toddler daughter Spencer. By the time they arrive, though, he realizes he won't be able to drink 3 cans of beer that night or smoke cigarettes. Ruth becomes interested in Arthur the more she gets to know him, and rents a movie whose score he says he favors. David believes Russell is gay, though ...",
      "imDbRating": "7.9",
      "imDbRatingCount": "1417"
    },
    {
      "id": "tt0702033",
      "seasonNumber": "3",
      "episodeNumber": "7",
      "title": "Timing & Space",
      "image": "https://m.media-amazon.com/images/M/MV5BMDA3YzA5MzUtZjM5MC00ZGZjLWIwZTAtNTI3ZjlmMWMwN2U5XkEyXkFqcGdeQXVyNjE2NjAyNTg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "13 Apr. 2003",
      "plot": "Surrounded by his family, Bernard Asa Chenowith dies of stomach cancer, and when Nate learns of it he requests Lisa's permission to attend his funeral since Brenda was there after his father's. Lisa agrees, and Nate plans to leave Maya with Ruth, but she's out secretly stalking Arthur jogging. Claire chooses to go shopping with Russell at an arts store, where Russell buys her a gift of an expensive bottle of paint she refused to purchase. David takes a reluctant Keith to Terry's party, where he's humiliated at playing a game and eventually leaves David to take his ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "1332"
    },
    {
      "id": "tt0702010",
      "seasonNumber": "3",
      "episodeNumber": "8",
      "title": "Tears, Bones & Desire",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA3NjAyNDAzNF5BMl5BanBnXkFtZTgwMTkwNzM0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "20 Apr. 2003",
      "plot": "63-year-old polygamous family leader \"Daddy\" leaves behind 5 wives and numerous children of The People clan, making the Fishers intrigued about their spiritual and cultural beliefs, like their guarding his body throughout the embalming. Ruth gives Arthur an unwanted kiss and instantly breaks her vow not to do it again, so struggles to find a new way for her to express her passions for Arthur. Terry and Patrick invite themselves to Gay Paintball Day - which plays right into Keith's hands since he chooses to be on the opposite team as David as revenge for being taken to...",
      "imDbRating": "7.9",
      "imDbRatingCount": "1356"
    },
    {
      "id": "tt0702022",
      "seasonNumber": "3",
      "episodeNumber": "9",
      "title": "The Opening",
      "image": "https://m.media-amazon.com/images/M/MV5BNTdlOWZlMjMtZDBhNC00OGRlLTg0YTMtZjMyNGNkZjUzOGJjXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "27 Apr. 2003",
      "plot": "Melinda Mary Bloch shuts herself in he garage in her activated car by way of suicide, leaving behind only a guilty ex-lover who worries Rico when he mentions she'd actually received treatment for depression, and Nate when he admits he'd tried to end their relationship more than once but wound up staying longer than he wished. Lisa, who's been having arguments constantly with him, officially meets Brenda at Claire's art show where Billy also has a display, and Brenda confronts her about her sneaky meeting and assures her she isn't close to Nate. When she and Olivier ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "1303"
    },
    {
      "id": "tt0701988",
      "seasonNumber": "3",
      "episodeNumber": "10",
      "title": "Everyone Leaves",
      "image": "https://m.media-amazon.com/images/M/MV5BYWMwNzllZmItMmNkZS00M2FkLThhMTEtYTRkOWI3MjlhNWMxXkEyXkFqcGdeQXVyNjE2NjAyNTg@._V1_Ratio1.7937_AL_.jpg",
      "year": "2003",
      "released": "4 May 2003",
      "plot": "Jeanette Louise Bradford has an allergic reaction to a bee-sting in Balboa Park, causing Keith to go to San Diego for his aunt's funeral and David to join him, encouraging him to discuss sleeping with a third man with him and to confront his father on his abusive childhood after the funeral. Russell admits he was sleeping with Olivier and an angry, betrayed Claire demands he leave her alone from now on. She and Ruth talk with each other about their relationship problems when Ruth learns Arthur is a virgin so there's nothing new to be gained from spending time with him...",
      "imDbRating": "8.4",
      "imDbRatingCount": "1389"
    },
    {
      "id": "tt0701984",
      "seasonNumber": "3",
      "episodeNumber": "11",
      "title": "Death Works Overtime",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA4ODg3MDM3MF5BMl5BanBnXkFtZTgwOTYyNzM0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "11 May 2003",
      "plot": "Convience-store owner Dorothy Kim Su is fatally shot during a robbery. Nate is forced to file a missing-person report when he continues to hear nothing from Lisa. Construction-worker Edward Tully hits some electrical wires in the site where he's working during an earthquake, is electrocuted, and falls to his death. Nate calls David, where he's sleeping with Patrick, and tells him he's starting to panic, especially after the earthquake. Ruth has convinced herself, as usual, that everything, including Lisa, is fine, but doesn't convince Claire, who is set to believe ...",
      "imDbRating": "8.8",
      "imDbRatingCount": "1489"
    },
    {
      "id": "tt0702034",
      "seasonNumber": "3",
      "episodeNumber": "12",
      "title": "Twilight",
      "image": "https://m.media-amazon.com/images/M/MV5BMGVhZGJmMjItYjQ2My00NWVmLWIxMGUtMzU5YTE3ZWMyODk4XkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "18 May 2003",
      "plot": "Woman-killer Carl Desmond Williman finally receives the death penalty by a lethal injection in Texas, and his unemployed daughter hires Fisher & Diaz for the funeral, and sleeps with Nate since they're both miserable and want to escape their problems, but he treats her unsympathetically the following day out of sheer guilt. David breaks up with Keith after spending more time with Patrick. Claire chooses to get an abortion and calls Brenda when she learns she needs a driver, who accepts. Ruth considers marrying George but does decide to slow things down a bit after ...",
      "imDbRating": "8.4",
      "imDbRatingCount": "1376"
    },
    {
      "id": "tt0701995",
      "seasonNumber": "3",
      "episodeNumber": "13",
      "title": "I'm Sorry, I'm Lost",
      "image": "https://m.media-amazon.com/images/M/MV5BNmYzY2QzOWItMmRiMC00YmRlLWEyMzItMGM0NWIzMjRlZTBiXkEyXkFqcGdeQXVyNjE2NjAyNTg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "1 Jun. 2003",
      "plot": "A piece of \"blue ice\" broken off an airplane strikes Anahid Havanessian, whose husband goes to Fisher & Diaz for a funeral...but changes his mind when, frustrated with the government for hiding that such deaths are common and suspecting Nate's silence is indifference, he's snapped at by Nate, who then snaps at David and Rico for telling him he lost them money by not demanding payment for the meeting when they \"switched to the local chapel\". Walking in the early hours of the morning to clear his head without success, and drinking heavily and sleeping with a bar ...",
      "imDbRating": "9.1",
      "imDbRatingCount": "1832"
    }
  ],
  "errorMessage": ""
}