{
  "imDbId": "tt0773262",
  "title": "Dexter",
  "fullTitle": "Dexter (TV Series 2006–2013)",
  "type": "TVSeries",
  "year": "2006",
  "items": [
    {
      "username": "ahmedgorshy",
      "userUrl": "https://www.imdb.com/user/ur106582401",
      "reviewLink": "https://www.imdb.com/review/rw6269047",
      "warningSpoilers": false,
      "date": "14 November 2020",
      "rate": "10",
      "helpful": "225 out of 239 found this helpful.",
      "title": "Dexter Review",
      "content": "Thanks to the quarantine, I watched series that I never imagined I would ever see, one of these series Dexter, which I heard had a bad ending, so I decided not to watch it, what a nonsense I missed myself watching one of the best series ever. Dexter has eight seasons and a renewed new season to fix the poor ending and everyone's excited about it. All seasons are excellent, from the first to the seventh, with the exception of the last. You evaluate each season as follows. First 9.7 Second 9.6 Third 8.7 Fourth 9.9 Fifth 9.0 The sixth 8.9 Seventh 9.0 The ex Final season 7.0 Waiting for the new season"
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw6207217",
      "warningSpoilers": false,
      "date": "26 October 2020",
      "rate": "10",
      "helpful": "88 out of 95 found this helpful.",
      "title": "One of the best shows ever created!",
      "content": "Dexter is easily one of my favorite tv shows of all-time and one of the few shows I can watch all the way through several times over without getting bored. It's hard for me to put into words how much I love this show. The only thing that's not good about it is the ending. The ending was pretty bad but that still doesn't take away from how good the show is overall. You should watch this show for Michael C. Hall's performance as Dexter alone. He's amazing in this. This is a thrilling, one of a kind tv show that will keep you on the edge of your seat throughout the entire series. If you haven't seen this incredible show yet just make sure you give yourself enough time because you're going to want to binge watch it as fast as you can. Once you start watching you won't be able to stop!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8574449",
      "warningSpoilers": false,
      "date": "28 September 2022",
      "rate": "10",
      "helpful": "58 out of 62 found this helpful.",
      "title": "One of the best shows of all-time!",
      "content": "Dexter is absolutely, without a doubt, one of the best shows ever created! It follows Miami PD blood splatter expert Dexter Morgan (Michael C. Hall) as he both solves murders and commits them too. He only murders bad people who've gotten away from the law. Being a blood expert he's able to outmaneuver the police at every turn. It's a thrilling, one of a kind TV show that will keep you at the edge of your seat throughout the entire series. Michael C. Hall is perfect as Dexter and the rest of the supporting cast is just as fantastic! Yes, the ending was terrible but like Game of Thrones, Lost (or any other show with a bad final episode), a few bad episodes at the end doesn't spoil what an overall great show it was and that's what Dexter is...a GREAT show!"
    },
    {
      "username": "IPyaarCinema",
      "userUrl": "https://www.imdb.com/user/ur69153149",
      "reviewLink": "https://www.imdb.com/review/rw8573742",
      "warningSpoilers": true,
      "date": "28 September 2022",
      "rate": "8",
      "helpful": "25 out of 26 found this helpful.",
      "title": "Must Watch",
      "content": "This is really more a summation of the all 8 seasons. Dexter is compelling, no doubt about it. I really liked some of the characterizations (if choppy at first). Dexter is an interesting character, but, while making a sympathetic serial killer is an impressive feat, the show always kind of wobbled between dark and light, and I wasn't always rooting for him. The show kind of slipped in to a rhythm of finding a really messed up person who could bond with Dexter on a dark level, and then it all goes wrong, and Dexter has to kill the person. Actually, at least in the last couple of seasons, I was way more impressed by the Debra character, who suffers an almost Shakespearian tragic arc, which is almost inevitable given the show's premise. Debra was masterfully done, and I could almost palpably feel her pain.Season 1 - 8 Season 2 - 9 Season 3 - 8 Season 4 - 7 Season 5 - 7 Season 6 - 8 Season 7 - 8 Season 8 - 6."
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw6907197",
      "warningSpoilers": false,
      "date": "12 May 2021",
      "rate": "10",
      "helpful": "40 out of 44 found this helpful.",
      "title": "One of the best series ever!",
      "content": "Micheal C. Hall is mesmerizing brilliance throughout, interesting how he went from Six Feet Under on to this. The music is one of the best things I've ever heard it gets me excited! I've seen the series a few times before I'm even one of very few that likes the ending. Such great writing that is easy to crave for more even though a lot of it is morbid Dexter is so well made; I'm jittery that there is gonna be more."
    },
    {
      "username": "jjlawler-98324",
      "userUrl": "https://www.imdb.com/user/ur96869139",
      "reviewLink": "https://www.imdb.com/review/rw8454244",
      "warningSpoilers": false,
      "date": "16 August 2022",
      "rate": "10",
      "helpful": "23 out of 24 found this helpful.",
      "title": "Top 10 series of all time",
      "content": "Have watched the series through 3 times. Still a thrill ride. Each season keeps the audience engaged with audacious storylines. The finale one of the best. Sets up another gift of the new Dexter series 10 years later."
    },
    {
      "username": "oscarjneklund",
      "userUrl": "https://www.imdb.com/user/ur154260428",
      "reviewLink": "https://www.imdb.com/review/rw8311549",
      "warningSpoilers": false,
      "date": "8 July 2022",
      "rate": "9",
      "helpful": "21 out of 22 found this helpful.",
      "title": "Very Good! 💉",
      "content": "Great Tv-series with all the blood and revenge you will get, and even more. Dexter, a blood-splatter analysis at the police is a cold blooded, sociopathic serialkiller who kills in the darkest nights, but only the ones that deserves it! 🇺🇲"
    },
    {
      "username": "latinfineart",
      "userUrl": "https://www.imdb.com/user/ur48961864",
      "reviewLink": "https://www.imdb.com/review/rw8293014",
      "warningSpoilers": false,
      "date": "2 July 2022",
      "rate": "10",
      "helpful": "18 out of 19 found this helpful.",
      "title": "One of the best shows, ever!",
      "content": "Every season was great. The characters were so well written, they just kept evolving. Great cast, great production. John Lithgow and Edward James Elmos were outstanding villains. Michael C. Hall was amazing. Few shows in the history of TV have been this good.I rarely ever give a 10, and do not do it lightly. Deadwood, True Detective season one, Fargo season one, not many others."
    },
    {
      "username": "cbentrott",
      "userUrl": "https://www.imdb.com/user/ur64522292",
      "reviewLink": "https://www.imdb.com/review/rw8590966",
      "warningSpoilers": false,
      "date": "6 October 2022",
      "rate": "8",
      "helpful": "23 out of 24 found this helpful.",
      "title": "First few seasons are gold",
      "content": "I watched this in 2021, and it was still a fantastic show, even with all the TV that is out today. It has compelling storylines and dark characters that keep you coming back episode after episode. There are several twists that are unpredictable. The first four seasons were fantastic, and after that, it definitely slipped in quality. Some of the guest stars, particularly the villains, are great actors and fit into the cast seamlessly. Michael C. Hall is perfectly strange and feels at home in this role. His sister is a bit less of a classic actress, but her personality grew on me, and she's a crowd favorite. Overall, a memorable show."
    },
    {
      "username": "mimiybyazphil",
      "userUrl": "https://www.imdb.com/user/ur69379480",
      "reviewLink": "https://www.imdb.com/review/rw5671422",
      "warningSpoilers": false,
      "date": "24 April 2020",
      "rate": "10",
      "helpful": "23 out of 25 found this helpful.",
      "title": "Unforgettable!!",
      "content": "One of the best series of ALL time, period! Michael C Hall is one of the most underrated actors alive He was BRILLIANT in this role, as he was in HBOs Six Feet Under! It is not often one can watch a series, over and over, and see a NEW thing each time! Hate to sound cliche' but, \" They don't make them like this, ANYMORE!\""
    },
    {
      "username": "emvan",
      "userUrl": "https://www.imdb.com/user/ur0650697",
      "reviewLink": "https://www.imdb.com/review/rw1505304",
      "warningSpoilers": false,
      "date": "23 October 2006",
      "rate": "9",
      "helpful": "438 out of 556 found this helpful.",
      "title": "The Best Show on TV",
      "content": "After four episodes, I'm ready to proclaim this the best show currently on TV, one that may someday rank with the likes of _The Sopranos_ and the first season of _Twin Peaks_ as a contender for the second best TV show ever (after the incomparable _Buffy the Vampire Slayer_; one of the show's producers and writers is former Buffy writer Drew Z. Greenberg, and the cast includes Buffy / Angel mainstay Julie Benz).Dexter is a sociopath, someone with no human feelings and hence no natural, inner moral compass, and he has an unquenchable blood lust that drives him to kill. But he had the great grace to have been the adopted child of a police officer, who (as we see in terrific flashbacks) successfully instilled in him a complete moral code, which he adheres to on a strictly intellectual level. This is an utterly brilliant concept (which I assume derives from the novels it's based on), one that allows the writers to explore the nature of moral behavior and of what it means to be human (Dexter is, in a sense, an alien).Another thing the show is doing brilliantly is moving at different speeds in parallel. There is a primary apparent season-long story arc (concerning a cat-and-mouse game between Dexter and a serial killer), and a a secondary arc involving Dexter's sister's police career. The first handful of episodes include a very powerful completed arc concerning one of Dexter's police colleagues and a local crime lord, while two of the four episodes so far have also included a self-contained story spliced among (and playing off) the ongoing ones. I've seen the future of TV season structuring, and this is it.While the writing isn't quite up to the brilliance of the best of _House_, it's been excellent. The cast and production are terrific. The only reason you wouldn't want to watch this utterly brilliant show is the frequent use of extremely graphic images: there have probably been more severed body parts shown in these first four episodes than in the first four episodes of every other TV show on the air combined. If you can stomach that, tune it for a mesmerizing look at what makes us human -- or inhuman."
    },
    {
      "username": "kundanbbisht",
      "userUrl": "https://www.imdb.com/user/ur115235124",
      "reviewLink": "https://www.imdb.com/review/rw6208654",
      "warningSpoilers": false,
      "date": "26 October 2020",
      "rate": "9",
      "helpful": "47 out of 51 found this helpful.",
      "title": "Totally worth to watch each and every episodes",
      "content": "Despite being so many seasons, no one gonna feel bored or detached. Impressive and outstanding series."
    },
    {
      "username": "camels-55854",
      "userUrl": "https://www.imdb.com/user/ur64912163",
      "reviewLink": "https://www.imdb.com/review/rw8548053",
      "warningSpoilers": false,
      "date": "16 September 2022",
      "rate": "10",
      "helpful": "24 out of 25 found this helpful.",
      "title": "Re-watching for Halloween Season",
      "content": "Decided to re watch Dexter for this Halloween Season. It's truly addictive; however, I had forgotten how much I hated.the girlfriend Rita's character. She played a really good insensitive witch while perpetuating a sensitive facade to others in the series. Perhaps the writers intended for me to loathe her; perhaps not. You judge. Some episodes are brilliant and some, so so. After it became immediately popular, some of the stars that decided to join in on the dark fun, I loved, so be on the lookout for them. I won't spoil the surprises. This series is not for the faint of heart w. Explicit sex and serial killer actions."
    },
    {
      "username": "samuelandrewsmyth",
      "userUrl": "https://www.imdb.com/user/ur40931587",
      "reviewLink": "https://www.imdb.com/review/rw6189971",
      "warningSpoilers": false,
      "date": "19 October 2020",
      "rate": "10",
      "helpful": "18 out of 18 found this helpful.",
      "title": "So good I'm that I've watched it twice",
      "content": "Keeping it short,You're getting a serial killer who's made to kill evil.You'll love him and weirdly you'll be able to relate to him. Odd eh?Enjoy (ps watch out for Easter Eggs in the background of scenes secretly placed)"
    },
    {
      "username": "view_and_review",
      "userUrl": "https://www.imdb.com/user/ur3670492",
      "reviewLink": "https://www.imdb.com/review/rw6234415",
      "warningSpoilers": false,
      "date": "4 November 2020",
      "rate": "8",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Serial Killer with a Conscience",
      "content": "Dexter: the serial killer who works for the Miami police department and preys on criminals. Wow, what a man.I was hooked. Not only was I hooked, but I was impressed by how they could make each season so enthralling. I thought for sure that I'd get tired of Dexter getting into a jam and trying to figure out how to get his target while keeping his extra curricular activities secret."
    },
    {
      "username": "Fella_shibby",
      "userUrl": "https://www.imdb.com/user/ur18970655",
      "reviewLink": "https://www.imdb.com/review/rw6046390",
      "warningSpoilers": false,
      "date": "30 August 2020",
      "rate": "9",
      "helpful": "37 out of 47 found this helpful.",
      "title": "Like the ethereal guitar music, the show, the characters, the camaraderie between the siblings n the surrealistic n poignant finale episode will stay on ur mind.",
      "content": "Been on my radar for more than a decade. Jus finished watching all the 96 episodes in 30 days on Amazon Prime. It ain't a record but the addiction with the character Dexter made it possible for me n the other factor is the lockdown.The character Dexter is a lovely manipulator wher he acts accordingly to the situation. A true psychopath.This series will make u ask q whether the character is truly living a double life of that of a serial killer n that of a family man working for the Miami homicide department as a forensic expert.Although some of the scenes r far fetched, the series is very intriguing n captivating n that is only cos of the character Dexter played very well by Michael C Hall.Many fans were upset at the finale episode but i think the conclusion is fair. The finale stayed with me for days. It is surrealistic n poignant. It may haunt fans of Dexter Morgan.The ethereal guitar music, the double life of Dexter, the dark humor, the camaraderie between the siblings n the talking of Dexter with his dead father is amazingly done.The dark humor is hilarious. Ther were times that during murder scenes i was laughing n my wife was kinda wtf.E.g. A serial killer known as Tooth Fairy labels Dexter a sick mother*ucker.Also when Dexter praises the same killer regarding his act near a cop's/attorney's house n the reply of the killer is hilarious.The showdown between Dexter and Ray (horned helmet aka the Minotaur killer) is full of tension. The way Ray chases his victims in his maze before either brutally beating them or maiming them with an axe is terrifying.The finale episode of the 4th season came as a shock. Cudnt believe my eyes. Thot mayb it is jus a dream.Check out Christina Cox as the villainous cop, one helluva hot babe."
    },
    {
      "username": "aratron-00391",
      "userUrl": "https://www.imdb.com/user/ur68576793",
      "reviewLink": "https://www.imdb.com/review/rw6646141",
      "warningSpoilers": false,
      "date": "28 February 2021",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Dark comedy crime thriller masterpiece",
      "content": "I have watch this series twice and will watch it again. One of the best tv. shows ever. The cast is amazing Michael C. Hall is excellent. I would like to see him in more shows and films. You will enjoy Dexter just watch it. A great Dark film starring Michael c. hall is cold in july check this film out as well."
    },
    {
      "username": "bosimmons-44782",
      "userUrl": "https://www.imdb.com/user/ur127621936",
      "reviewLink": "https://www.imdb.com/review/rw8721276",
      "warningSpoilers": false,
      "date": "7 December 2022",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "this is my favorite show of all time",
      "content": "I love this show. Choosing Michael C Hall to play Dexter was the perfect choice. Having the inner monologue was a great choice to let us know what he is thinking and feeling. If you like watching a show where we get the insights of how a killer works this is the show for you. Now here is the thing. This is my favorite show but shows like Breaking Bad and Game of Thrones are better shows overall and I am not going to lie about that. The acting by the side characters are good but not great it does get better as the show goes on like any other show and it does have some dumb things like all crime shows have but having the main character be a killer is where the show is different then any other show. Dexter and Deb his sister are the best parts of the show she kills her role as wanting to become a better detective to prove to herself and others that she is as good as her father was. If i was going to really rate this show it is a 9 out of 10 but sense its my favorite show i have to give it a 10. Please give it watch if you wanna watch something that is different then other ones that you can watch right now."
    },
    {
      "username": "msperling",
      "userUrl": "https://www.imdb.com/user/ur3184739",
      "reviewLink": "https://www.imdb.com/review/rw1519086",
      "warningSpoilers": true,
      "date": "7 November 2006",
      "rate": "10",
      "helpful": "1,345 out of 1,467 found this helpful.",
      "title": "A Bloody Masterpiece!",
      "content": "Dexter will never disappoint. Each and every episode is a work of art, and it never gets boring or old. To start, we have excellent deliveries from Michael C. Hall as the serial killer (yet a like-able one) known as Dexter Morgan. Add \"The Excorcism Of Emily Rose\" star Jennifer Carpenter, who plays Dexter's sometimes moody sister, Deb.It's a hard accomplishment to get someone to actually love a serial killer. But Dexter is one of those few attempts that works. It's not forced upon you- the show doesn't shove the whole \"well this serial killer had a terrible childhood...\" in your face. And it doesn't need to in order to get you to love its main character. You just do.Michael C. Hall can play any emotion he's handed. Jennifer Carpenter fits her character perfectly, as does everyone else in the cast.Then there's the actual story lines. It's not cliché. It's actually scary and chilling. It keeps you guessing. It's one of those mysteries that is very difficult to solve, but it still keeps your interest.'Dexter' can also be hilarious when it wants to be, depressing when it wants to be and especially thrilling when it wants to be. And it doesn't come across as trying too hard.Strong writing, clever dialogue, talented stars. It all makes for a wonderful TV show. Definitely the best new show of the season and will become one of the best shows of all time."
    },
    {
      "username": "RJBrez",
      "userUrl": "https://www.imdb.com/user/ur59265736",
      "reviewLink": "https://www.imdb.com/review/rw6901283",
      "warningSpoilers": false,
      "date": "10 May 2021",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Let's hope the revival gives this series the ending it deserves.",
      "content": "Dexter fans are well aware of the atrocities that season 8 committed. How could a show that was so brilliant for years end so terribly? Well, in the midst of an awful 2020 we did get some great news. Dexter was coming back! Maybe it's only a limited run, maybe there will be more. All I care about it the fact that they have a chance to correct their mistakes.The first 6-7 seasons of Dexter is some of the best television you will ever see. Fantastic stories and character arcs by stars such as Julia Stiles, John Lithgow, Yvonne Strahovski, etc. If you haven't watched it yet, it's the perfect time to catch up before the revival."
    },
    {
      "username": "gEn3tic",
      "userUrl": "https://www.imdb.com/user/ur155190687",
      "reviewLink": "https://www.imdb.com/review/rw8387484",
      "warningSpoilers": false,
      "date": "31 July 2022",
      "rate": "10",
      "helpful": "20 out of 21 found this helpful.",
      "title": "my fav show of all time !!!",
      "content": "This is my fav show till now, no doubt. This is because inspite of so many eps and seasons it has never let me down. I was always so excited to watch the next ep. There may be some seasons better than others but none was bad. If you havent seen this show, do it asap if you like crime and mystery genres. It definitely left a void when i finished it. And the main char is also so effing cool."
    },
    {
      "username": "sarahloo-01175",
      "userUrl": "https://www.imdb.com/user/ur96952033",
      "reviewLink": "https://www.imdb.com/review/rw6437823",
      "warningSpoilers": false,
      "date": "3 January 2021",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "A complete masterpiece!",
      "content": "This show is put together like a perfect jigsaw, everything fits. If you enjoy a show that has heart stopping moments and is unpredictable, then this is for you. I absolutely loved it from beginning to end. The plot of the show is unique and has you completely hooked. It is full of addictive storylines and the characters in the show are great to watch. It is stacked with masses of intense moment's and highly emotional ones too. You will not be disappointed! It is fantastic."
    },
    {
      "username": "infiniter-1",
      "userUrl": "https://www.imdb.com/user/ur5079923",
      "reviewLink": "https://www.imdb.com/review/rw1488149",
      "warningSpoilers": false,
      "date": "1 October 2006",
      "rate": "10",
      "helpful": "715 out of 807 found this helpful.",
      "title": "A wonderful new look at the crime drama.",
      "content": "I read Lindsay's excellent books - Darkly Dreaming Dexter and Dearly Devoted Dexter - some time ago, and when I heard that there was to be a series based on the books, I was extremely excited. So much so, in fact, that I feared disappointment merely because my standards were so high.Thankfully, \"Dexter\" absolutely delivers. The show maintains the uncomfortable atmosphere of the novels with better fidelity than one could ever have expected, and Dexter (played by Hall) is all there.The visual elements from the show are stunning, to say the least. Disturbing, certainly, but more than that - fascinating. Watching the show, it's impossible to keep from finding a certain agreement in oneself for Dexter. He's a monster, and yet it's completely possible to identify with him.10 out of 10. This one has a permanent spot on my DVR."
    },
    {
      "username": "said_kurollo",
      "userUrl": "https://www.imdb.com/user/ur124871671",
      "reviewLink": "https://www.imdb.com/review/rw6447175",
      "warningSpoilers": false,
      "date": "5 January 2021",
      "rate": "9",
      "helpful": "25 out of 29 found this helpful.",
      "title": "Perfect serie with worst ending !!!",
      "content": "I think this serie is one of the best series ever. I mean the acting / drama / dexter's life. Everything is perfect. Except for the last season. They ruined the whole thing. But that doesn't mean that you don't have to watch the serie ! It absolutely worth."
    },
    {
      "username": "DaTruth510",
      "userUrl": "https://www.imdb.com/user/ur36567008",
      "reviewLink": "https://www.imdb.com/review/rw6834440",
      "warningSpoilers": false,
      "date": "21 April 2021",
      "rate": "10",
      "helpful": "13 out of 13 found this helpful.",
      "title": "3rd time watching whole series",
      "content": "I love this show! Didn't think i would be going through it a 3rd time but since season 9 is coming soon i thought i would. So far im on season 4 and i have to say DAMN Jennifer Carpeneter character can be so annoying. The smallest thing can give her a brwakdown at any moment and that gets a bit annoying pretty fast. Rita is more annoying than Deb. Show is still my second favorite show ever coming after Game of Thrones. Which ive also watched 3 times."
    }
  ],
  "errorMessage": ""
}