{
  "imDbId": "tt0773262",
  "title": "Dexter",
  "fullTitle": "Dexter (TV Series 2006–2013)",
  "type": "TVSeries",
  "year": "2006",
  "language": "en",
  "titleInLanguage": "Dexter (TV series)",
  "url": "https://en.wikipedia.org/wiki/Dexter_(TV_series)",
  "plotShort": {
    "plainText": "Dexter is an American crime drama television series that aired on Showtime from October 1, 2006, to September 22, 2013. Set in Miami, the series centers on Dexter Morgan (Michael C. Hall), a forensic technician specializing in bloodstain pattern analysis for the fictional Miami Metro Police Department, who leads a secret parallel life as a vigilante serial killer, hunting down murderers who have not been adequately punished by the justice system due to corruption or legal technicalities. The show's first season was derived from the novel Darkly Dreaming Dexter (2004), the first in a series of novels by Jeff Lindsay. It was adapted for television by James Manos Jr., who wrote the first episode. Subsequent seasons evolved independently of Lindsay's works.\r\nIn February 2008, reruns (edited down to a TV-14 rating) began to air on CBS in the wake of the shortage of original programming ensuing from the 2007–08 Writers Guild of America strike, thus the reruns on CBS ended after one run of the first season. The series enjoyed mostly positive reviews throughout its run. The first four seasons received universal acclaim, but reception dropped considerably as the series progressed. The show has received myriad awards, including two Golden Globes won by Hall and John Lithgow for their roles as Dexter Morgan and Arthur Mitchell, respectively. Season four aired its season finale on December 13, 2009, to a record-breaking audience of 2.6 million viewers, making it the most-watched original series episode ever on Showtime at that time.\r\nIn April 2013, Showtime announced that season eight would be the final season of Dexter. The season eight premiere was the most watched Dexter episode, with more than 3 million viewers total. The original broadcast of the series finale on September 22, 2013, drew 2.8 million viewers, the largest audience in Showtime's history.\r\nIn October 2020, it was announced that Dexter would return with a ten-episode limited series titled Dexter: New Blood, with Hall reprising the title role and Clyde Phillips as showrunner, a position he occupied during the original series' first four seasons. The first season premiered on November 7, 2021 and concluded on January 9, 2022. A continuation of New Blood is in development In January 2023, a prequel series, with the working title Dexter: Origins, was announced as being in development, with Clyde Phillips once again returning as showrunner. This series will follow a younger Dexter as he begins his career with the Miami Metro police department.",
    "html": "<p>Dexter is an American crime drama television series that aired on Showtime from October 1, 2006, to September 22, 2013. Set in Miami, the series centers on Dexter Morgan (Michael C. Hall), a forensic technician specializing in bloodstain pattern analysis for the fictional Miami Metro Police Department, who leads a secret parallel life as a vigilante serial killer, hunting down murderers who have not been adequately punished by the justice system due to corruption or legal technicalities. The show's first season was derived from the novel Darkly Dreaming Dexter (2004), the first in a series of novels by Jeff Lindsay. It was adapted for television by James Manos Jr., who wrote the first episode. Subsequent seasons evolved independently of Lindsay's works.</p><p>In February 2008, reruns (edited down to a TV-14 rating) began to air on CBS in the wake of the shortage of original programming ensuing from the 2007–08 Writers Guild of America strike, thus the reruns on CBS ended after one run of the first season. The series enjoyed mostly positive reviews throughout its run. The first four seasons received universal acclaim, but reception dropped considerably as the series progressed. The show has received myriad awards, including two Golden Globes won by Hall and John Lithgow for their roles as Dexter Morgan and Arthur Mitchell, respectively. Season four aired its season finale on December 13, 2009, to a record-breaking audience of 2.6 million viewers, making it the most-watched original series episode ever on Showtime at that time.</p><p>In April 2013, Showtime announced that season eight would be the final season of Dexter. The season eight premiere was the most watched Dexter episode, with more than 3 million viewers total. The original broadcast of the series finale on September 22, 2013, drew 2.8 million viewers, the largest audience in Showtime's history.</p><p>In October 2020, it was announced that Dexter would return with a ten-episode limited series titled Dexter: New Blood, with Hall reprising the title role and Clyde Phillips as showrunner, a position he occupied during the original series' first four seasons. The first season premiered on November 7, 2021 and concluded on January 9, 2022. A continuation of New Blood is in development In January 2023, a prequel series, with the working title Dexter: Origins, was announced as being in development, with Clyde Phillips once again returning as showrunner. This series will follow a younger Dexter as he begins his career with the Miami Metro police department.</p>"
  },
  "plotFull": {
    "plainText": "Dexter is an American crime drama television series that aired on Showtime from October 1, 2006, to September 22, 2013. Set in Miami, the series centers on Dexter Morgan (Michael C. Hall), a forensic technician specializing in bloodstain pattern analysis for the fictional Miami Metro Police Department, who leads a secret parallel life as a vigilante serial killer, hunting down murderers who have not been adequately punished by the justice system due to corruption or legal technicalities. The show's first season was derived from the novel Darkly Dreaming Dexter (2004), the first in a series of novels by Jeff Lindsay. It was adapted for television by James Manos Jr., who wrote the first episode. Subsequent seasons evolved independently of Lindsay's works.\r\nIn February 2008, reruns (edited down to a TV-14 rating) began to air on CBS in the wake of the shortage of original programming ensuing from the 2007–08 Writers Guild of America strike, thus the reruns on CBS ended after one run of the first season. The series enjoyed mostly positive reviews throughout its run. The first four seasons received universal acclaim, but reception dropped considerably as the series progressed. The show has received myriad awards, including two Golden Globes won by Hall and John Lithgow for their roles as Dexter Morgan and Arthur Mitchell, respectively. Season four aired its season finale on December 13, 2009, to a record-breaking audience of 2.6 million viewers, making it the most-watched original series episode ever on Showtime at that time.\r\nIn April 2013, Showtime announced that season eight would be the final season of Dexter. The season eight premiere was the most watched Dexter episode, with more than 3 million viewers total. The original broadcast of the series finale on September 22, 2013, drew 2.8 million viewers, the largest audience in Showtime's history.\r\nIn October 2020, it was announced that Dexter would return with a ten-episode limited series titled Dexter: New Blood, with Hall reprising the title role and Clyde Phillips as showrunner, a position he occupied during the original series' first four seasons. The first season premiered on November 7, 2021 and concluded on January 9, 2022. A continuation of New Blood is in development In January 2023, a prequel series, with the working title Dexter: Origins, was announced as being in development, with Clyde Phillips once again returning as showrunner. This series will follow a younger Dexter as he begins his career with the Miami Metro police department.\r\nPlot\r\nOrphaned at age three, when he witnessed his mother's brutal murder with a chainsaw, Dexter (Michael C. Hall) was adopted by Miami police officer Harry Morgan (James Remar). Recognizing the boy's trauma and the subsequent development of his sociopathic tendencies, Harry manipulated Dexter to channel his gruesome bloodlust into vigilantism, killing only heinous criminals who slip through the criminal justice system. To cover his prolific trail of homicides, Dexter gains employment as a forensic analyst, specializing in blood spatter pattern analysis, with the Miami Metro Police Department. Dexter is extremely cautious and circumspect; he wears gloves and uses plastic-wrapped \"kill rooms\", carves up the corpses, and disposes of them in the Atlantic Ocean's Gulf Stream to reduce his chances of detection. Dexter juggles his two personas, recognizing each as a distinct part of himself that must cohesively work as one. He depends on their interaction, as a means of survival and normality. Although his homicidal tendencies are deeply unflinching, as he originally claims (via narration), throughout the series he strives to feel (and in some cases does feel) normal emotions and maintains his appearance as a socially responsible human being.\r\nCast and crew\r\nCast\r\nBesides Hall playing the title character, the show's supporting cast includes Jennifer Carpenter as Dexter's adoptive sister and co-worker (and later boss) Debra, and James Remar as Dexter's adoptive father, Harry Morgan. Dexter's co-workers include Lauren Vélez as Lieutenant (later Captain) María LaGuerta, Dexter and Debra's supervisor, David Zayas as Detective Sergeant (later Lieutenant) Angel Batista, and C. S. Lee as lab tech Vince Masuka (promoted to title credits in season two).\r\nErik King portrayed the troubled Sgt James Doakes for the first two seasons of the show. Desmond Harrington joined the cast in season three as Joey Quinn; his name was promoted to the title credits as of season four. Geoff Pierson plays Captain Tom Matthews of Miami Metro Homicide. Julie Benz starred as Dexter's girlfriend, then wife, Rita in seasons one to four, with a guest appearance in season five. Rita's children, Astor and Cody, are played by Christina Robinson and Preston Bailey (who replaced Daniel Goldman after the first season). Dexter's infant son Harrison is played by twins, Evan and Luke Kruntchev, through season seven; in season eight, Harrison was played by Jadon Wells. Aimee Garcia plays Batista's younger sister, Jamie.\r\nNotable appearances in season one are Christian Camargo as Rudy and Mark Pellegrino as Rita's abusive ex-husband Paul. Jaime Murray portrayed Lila Tournay in season two, a physically attractive but unhinged British artist who becomes obsessed with Dexter. Keith Carradine, as Special FBI Agent Frank Lundy, and Jimmy Smits, as ADA Miguel Prado, each appeared in season-long character arcs in seasons two and three, respectively. David Ramsey, who plays confidential informant Anton Briggs in season three, returned in season four, becoming romantically involved with Debra Morgan. John Lithgow joined the cast in season four as the \"Trinity Killer\". Carradine returned in season four, reprising his role as newly retired FBI Special Agent Frank Lundy, who was hunting the Trinity Killer. Courtney Ford was featured in season four as an ambitious reporter who mixes business with pleasure, getting romantically involved with Quinn while simultaneously fishing for sources and stories. Julia Stiles joined the cast in season five as Lumen Pierce, a woman who gets involved in a complex relationship with Dexter after the tragedy that culminated the previous season. Season five also had Jonny Lee Miller cast as the motivational speaker Jordan Chase, Peter Weller cast as Stan Liddy, a corrupt narcotics cop, and Maria Doyle Kennedy cast as Sonya, Harrison's nanny. In season six, Mos Def was cast as Brother Sam, a convicted murderer turned born-again Christian, and Edward James Olmos and Colin Hanks guest-starred as Professor James Gellar and Travis Marshall, members of a murderous apocalyptic cult. Seasons seven and eight featured multiple guest stars, including Ray Stevenson as Ukrainian mob boss Isaak Sirko, a man with a personal vendetta against Dexter; Yvonne Strahovski as Hannah McKay, the former accomplice of a spree killer; Jason Gedrick as strip club owner George Novikov, also part of the mob; and Charlotte Rampling as Dr. Evelyn Vogel, a neuropsychiatrist who takes an interest in Dexter; Ronny Cox as the Tooth Fairy killer; Sean Patrick Flanery as Jacob Elway, a private investigator who Debra works for.\r\nMargo Martindale had a recurring role as Camilla Figg, a records office worker who was close friends with Dexter's adoptive parents. JoBeth Williams portrayed Rita's suspicious mother, Gail Brandon, in four episodes of season two. Anne Ramsay portrayed defense attorney Ellen Wolf, Miguel's nemesis. Valerie Cruz played a recurring role as Miguel's wife, Sylvia. In season six, Billy Brown was cast as transferred-in Detective Mike Anderson to replace Debra after her promotion to lieutenant. Josh Cooke played Louis Greene, a lab tech and Masuka's intern, in seasons six and seven, and Darri Ingolfsson played Oliver Saxon in season eight.\r\nCrew\r\nThe main creative forces behind the series were executive producers Daniel Cerone, Clyde Phillips, and Melissa Rosenberg. Cerone left the show after its second season. Executive producer and showrunner Phillips departed the series, after a record-setting season-four finale, to spend more time with his family; 24 co-executive producer Chip Johannessen took over Phillips' post. Head writer Melissa Rosenberg left after season four, as well.\r\nAfter the conclusion of season five, Chip Johannessen was revealed to be leaving the show after a single run, and Scott Buck would take over as showrunner from season six onward.\r\nProduction\r\nExterior filming\r\nAlthough the series is set in Miami, Florida, many of the exterior scenes are filmed in Los Angeles and Long Beach, California. Many landmark buildings and locations in Long Beach are featured throughout the series. The finale episode's airport scene takes place at Ontario International Airport in Ontario, California.\r\nMarketing\r\nIn preparation for the United Kingdom launch of the series, Fox UK experimented with an SMS-based viral marketing campaign. Mobile phone owners received the following unsolicited SMS messages addressed to them by name with no identifying information other than being from \"Dexter\": \"Hello (name). I'm heading to the UK sooner than you might think. Dexter.\" The SMS message was followed by an email directing the user to an online video \"news report\" about a recent spree of killings. Using on-the-fly video manipulation, the user's name and a personalized message were worked into the report—the former written in blood on a wall near the crime scene, the latter added to a note in an evidence bag carried past the camera. While the marketing campaign succeeded in raising the profile of the show, it proved unpopular with many mobile owners, who saw this as spam advertising aimed at mobile phones. In response to complaints about the SMS element of the campaign, Fox issued the following statement:\r\nThe text message you received was part of an internet viral campaign for our newest show Dexter. However, it was not us who sent you the text, but one of your friends. We do not have a database of viewer phone numbers. The text message went along with a piece on the net that you can then send on to other people you know. If you go to you will see the page that one of your friends has filled in to send you that message. Therefore I suggest you have a word with anyone who knows your mobile number and see who sent you this message. For the record, we did not make a record of any phone numbers used in this campaign.\r\nReception\r\nCritical reception\r\nAlthough reception to individual seasons has varied, the overall response to Dexter has been positive. The first, second, fourth, and seventh seasons received critical acclaim, the third and fifth seasons received generally positive reviews, while the sixth and eighth seasons received mixed to negative reviews. While remarking on some of the show's more formulaic elements (quirky detective, hero with dense workmates, convenient plot contrivances), Tad Friend of The New Yorker magazine remarked that when Dexter is struggling to connect with Rita or soliciting advice from his victims, \"the show finds its voice.\"\r\nThe review aggregator website Metacritic calculated a score of 77 from a possible 100 for season one, based on 27 reviews, making it the third-best reviewed show of the 2006 fall season. This score includes four 100 percent scores (from the New York Daily News, San Francisco Chronicle, Chicago Sun-Times and People Weekly magazine). Brian Lowry, who had written one of the three poor reviews Metacritic tallied for the show, recanted his negative review in a year-end column for the trade magazine Variety, after watching the full season. On Metacritic, season two has a score of 85 with all eleven reviews positive; season three scored 78 with 13 reviews; season four scored 77 with 14 reviews; season five scored 76 with eleven reviews; season six scored 62 with 10 reviews; season seven scored 81 with seven reviews; and season eight scored 71 with ten reviews.\r\nOn Rotten Tomatoes, season one has an 81 percent approval rating with a score of 8.18 out of 10, and the consensus: \"Its dark but novel premise may be too grotesque for some, but Dexter is a compelling, elegantly crafted horror-drama.\"; season two has a 96 percent approval rating with a score of 7.6 out of 10 and the consensus: \"The Bay Harbor Butcher secures his nefarious spot among the great television anti-heroes in a taut second season that is both painfully suspenseful and darkly hilarious\"; season three has a 71 percent approval rating with a score of 8.3 out of 10 and the consensus: \"America's most amiable serial killer has lost some of his dramatic edge, but this third outing continues Dexter's streak of delivering deliriously twisted entertainment\"; season four has an 88 percent approval rating with a score of 8.4 out of 10 and the consensus: \"The inherent comedy of Miami's favorite psychopath contending with domestic bliss and the unspeakable horror of John Lithgow's Trinity killer coalesce into one of Dexter's most sensational seasons\"; season five has an 88 percent approval rating with a score of 7.5 out of 10 and the consensus: \"Michael C. Hall's remarkable performance invites viewers into Dexter's heart of darkness in a sorrowful fifth season that explores whether a hollow man can become a real boy\"; season six has a 38 percent approval rating with a score of 6.1 out of 10 and the consensus: \"Heavy-handed symbolism, an unimpressive villain, and a redundant arc for America's favorite serial killer all conspire to make Dexter's sixth season its worst yet\"; season seven has an 82 percent approval rating with a score of 7.6 out of 10 and the consensus: \"Season seven represents a return to form for Dexter, characterized by a riveting storyline and a willingness to take some risks\"; and season eight has a 35 percent approval rating, a score of 5.4 out of 10, and the final consensus: \"The darkly dreaming Dexter lays to rest once and for all in a bitterly disappointing final season that is so hesitant to punish its anti-hero for his misdeeds, it opts to punish its audience instead.\"\r\nPopular reception\r\nThe season-three finale, on December 14, 2008, was watched by 1.51 million viewers, giving Showtime its highest ratings for any of its original series since 2004, when Nielsen started including original shows on premium channels in its ratings. The season-four finale aired on December 13, 2009, and was watched by 2.6 million viewers. It broke records for all of Showtime's original series and was their highest-rated telecast in over a decade. The season-five finale was watched by a slightly smaller number of people—2.5 million. The show was declared the ninth-highest rated show for the first ten years of IMDb.com Pro (2002–2012). The seventh season as a whole was the highest rated season of Dexter, watched by 6.1 million total weekly viewers across all platforms.\r\nAwards and nominations\r\nDexter was nominated for 24 Primetime Emmy Awards, including in the category of Outstanding Drama Series four times in a row, from 2008 to 2011, and Outstanding Lead Actor in a Drama Series (for Hall) five times in a row, from 2008 to 2012. It has also been nominated for ten Golden Globe Awards (winning two), seven Screen Actors Guild Awards and received a Peabody Award in 2007.\r\nOn December 14, 2006, Hall was nominated for a Golden Globe Award at the 64th Golden Globe Awards. In 2008, the show was nominated for a Primetime Emmy Award for Outstanding Drama Series for its second season (Showtime's first-ever drama to be nominated for the award), and its star for Outstanding Lead Actor in a Drama Series. It won neither, losing to Breaking Bad actor Bryan Cranston. In 2010, Hall and Lithgow, in their respective categories, each won a Golden Globe for their performances in season four.\r\nCultural impact\r\nU.S. broadcast\r\nIn December 2007, when CBS publicly announced that it was considering Dexter for broadcast reruns, the Parents Television Council (\"PTC\") protested the decision. When the network began posting promotional videos of the rebroadcast on YouTube on January 29, 2008, PTC president Timothy F. Winter, in a formal press release, again called for CBS to not air the show on broadcast television, saying that it \"should remain on a premium subscription cable network\" because \"the series compels viewers to empathize with a serial killer, to root for him to prevail, to hope he doesn't get discovered\". Winter called on the public to demand that local affiliates pre-empt Dexter and warned advertisers that the PTC would take action against any affiliates that sponsored the show.\r\nFollowing Winter's press release, CBS added parental advisory notices to its broadcast promotions and ultimately rated Dexter TV-14 for broadcast. On February 17, 2008, the show premiered edited primarily for \"language\" and scenes containing sex or the dismemberment of live victims. The PTC later objected to CBS' broadcasting of the final two episodes of season one in a two-hour block, and to the episodes' starting times, which were as early as 8 pm in some time zones.\r\nAssociation with real crimes\r\nSeveral comparisons and connections between the TV show and its protagonist have been drawn during criminal prosecutions. In 2009, 17-year-old Andrew Conley said the show inspired him to strangle his ten-year-old brother. In an affidavit filed in Ohio County court, in Indiana, police said Conley confessed that he \"watches a show called Dexter on Showtime, about a serial killer, and he stated, 'I feel just like him.'\"\r\nIn Spain, on July 25, 2009, a man and his girlfriend killed his brother and pregnant partner. The man owned the complete Dexter series DVD collection and the methods used to avoid leaving blood traces were inspired by the show.\r\nOn November 4, 2010, in Sweden, a 21-year-old woman known as Dexter-mördaren (\"The Dexter killer\") or Dexter-kvinnan (\"The Dexter woman\") killed her 49-year-old father by stabbing him in the heart. During questioning, the woman compared herself to Dexter Morgan, and a picture of the character would appear on her phone when her father called her. In July 2011, she was sentenced to seven years in prison.\r\nIn Norway, Shamrez Khan hired Håvard Nyfløt to kill Faiza Ashraf. Nyfløt claimed that Dexter inspired him, and he wanted to kill Khan in front of Faiza, similar to the television series, to \"stop evil\".\r\nAssociation was established between Mark Twitchell, of Edmonton, Alberta, Canada, during his first-degree murder trial, and the character of Dexter Morgan. After weeks of testimony and gruesome evidence presented in court, Twitchell was found guilty of the planned and deliberate murder of 38-year-old Johnny Altinger on April 12, 2011.\r\nBritish teenager Steven Miles, 17, was sentenced to 25 years in prison on October 2, 2014, for stabbing and dismembering his girlfriend Elizabeth Rose Thomas, 17, in Oxted, Surrey. Police discovered Thomas' body on January 24, 2014, and determined the cause of death to be a stab wound to the back. Miles was arrested on suspicion of murder. Miles pled guilty to the crime on September 9. According to Surrey Police, Miles had dismembered Thomas' body following her death, wrapping up limbs in plastic wrap, and had attempted to clean up the crime scene before he was found by a family member. Miles had been reported to be obsessed with the television series Dexter. Miles reportedly had an alter ego named Ed, whom Miles claims made him carry out the murder.\r\nIn New Orleans, Louisiana, 34-year-old Benjamin Beale was arrested after police discovered a decapitated body inside a freezer in a painted bus on January 11, 2022, whose body was confirmed to be Julia Dardar over a week later, who was the missing mother of two children. They even discovered a grim Dexter profile painting with guns and knives, as this murder was inspired by the \"Ice Truck Killer\" from the show's first season.\r\nOn May 18, 2022, in Delhi, India, 28-year-old Aaftab Ameen Poonawala strangled his live-in partner Shraddha Walkar after a heated argument, killing her. He chopped her body into 35 pieces and stored it in a large refrigerator, disposing of the pieces in a nearby forest over the next 18 days. The murder was inspired by the show.\r\nTheme song and series music\r\nThe opening title theme for Dexter was written by Rolfe Kent and scored by American composer Daniel Licht. The series music for each episode was overseen by Gary Calamar of Go Music and coordinated by Alyson Vidoli.\r\n\"Dexter Main Title\" (Rolfe Kent) – 1:40\r\n\"Tonight's the Night\" (Michael C. Hall, Daniel Licht) – 1:07\r\n\"Conoci La Paz\" (Beny Moré) – 3:03\r\n\"Uruapan Breaks\" (Kinky) – 2:21\r\n\"Flores Para Ti\" (Raw Artistic Soul featuring Rafael Cortez) – 5:16\r\n\"Blood\" (Michael C. Hall, Daniel Licht) – 0:59\r\n\"Con Mi Guaguanco\" (Ray Armando) – 7:12\r\n\"Perfidia\" (Mambo All-Stars) – 2:37\r\n\"Sometimes I Wonder\" (Michael C. Hall, Daniel Licht) – 0:29\r\n\"Born Free\" (Andy Williams) – 2:25\r\n\"Dexter Main Title\" (Kinky) – 1:41\r\n\"Escalation\" (Daniel Licht) – 2:09\r\n\"Shipyard\" (Daniel Licht) – 2:03\r\n\"Deborah Loves Rudy/The House\" (Daniel Licht) – 3:12\r\n\"I Can't Kill\" (Daniel Licht) – 2:21\r\n\"Voodoo Jailtime\" (Daniel Licht) – 2:58\r\n\"New Legs\" (Daniel Licht) – 2:01\r\n\"Photo Albums\" (Daniel Licht) – 3:22\r\n\"Courting the Night\" (Daniel Licht) – 1:22\r\n\"Hide Your Tears\" (Daniel Licht) – 1:36\r\n\"Wink\" (Daniel Licht) – 2:08\r\n\"Astor's Birthday Party\" (Daniel Licht) – 2:00\r\n\"Epilogue/Bloodroom\" (Daniel Licht) – 3:44\r\n\"Blood Theme\" (Daniel Licht) – 2:25\r\n\"Die This Way\" (Daniel Licht, Jon Licht) – 3:55\r\n\"Fight or Flight\" (Daniel Licht) – 1:41 (ITunes Bonus)\r\n\"Nowhere to Hide\" (Daniel Licht) – 1:43 (ITunes Bonus)\r\n\"The Ice Truck Killer\" (Daniel Licht) – 2:56 (ITunes Bonus)\r\n\"The Fortune\" (Daniel Licht) – 1:17 (ITunes Bonus)\r\n\"Second Season Suite\" (Daniel Licht) – 2:01 (ITunes Bonus)\r\nOther media\r\nDexter: Early Cuts\r\nDexter: Early Cuts is an animated web series that premiered on October 25, 2009. Hall reprises his role as the voice of Dexter.\r\nKTV Media International Bullseye Art produced and animated the webisodes, working closely with Showtime for sound editing, Interspectacular for direction, and illustrators Kyle Baker, Ty Templeton, Andrés Vera Martínez, and Devin Lawson for creating distinctive illustrations. The webisodes are animated in 2.5D style, where flat two-dimensional illustrations are brought to life in three-dimensional space. The first season was created and written by Dexter producer/writer Lauren Gussis. She was nominated for a Webby for her writing in the first season.\r\nThe first web series precedes the narrative of the show and revolves around Dexter hunting down the three victims that he mentions in the sixth episode of season one, \"Return to Sender\". Each victim's story is split into four two-minute chapters.\r\nA second season of the web series titled Dexter: Early Cuts: Dark Echo, one story in six chapters, premiered on October 25, 2010. It was written by Tim Schlattmann and illustrated by Bill Sienkiewicz and David Mack. The story begins immediately following Dexter's adoptive father Harry's death.\r\nSeason 3 centers around Dexter's first encounter with a pair of killers. Each story is told in several two to three-minute chapters.\r\nAlbum soundtrack\r\nIn August 2007, the album soundtrack entitled Dexter: Music from the Showtime Original Series was released featuring music from the television series. The album was produced by Showtime and distributed by Milan Records. The digital download version offers five additional bonus tracks from the show's first two seasons.\r\nComic book\r\nMarvel Comics released a Dexter limited series in July 2013. The comic books are written by creator Jeff Lindsay and drawn by Dalihbor Talajic. Another limited series, called Dexter: Down Under, was published in 2014.\r\nHome media releases\r\nGames\r\nOn September 13, 2009, Icarus Studios released a video game based on the events of season one, for the iPhone platform, via the iTunes app store. The game was released for the iPad on October 15, 2010, and for PCs on February 15, 2011. The cast and crew of Dexter were very supportive, with some of the cast providing full voice work for the game, including Hall. The game has received many positive reviews, including an 8/10 from IGN. No additional content for the game has been released or announced as planned; plans to release the game on the PlayStation 3 and Xbox 360 seem to have been canceled, as no recent information regarding the expansion of the game onto these platforms has been given and both consoles have been discontinued.\r\nIn July 2010, Showtime launched Dexter Game On during Comic-Con. The promotion relied on community involvement, part of which required participants to use the SCVNGR applications available for the Android, iPad, iPhone, and iPod Touch platforms to complete treks around the five cities where the game was available. The final trek led to a kill room, where the Infinity Killer had recently claimed a victim. A link was found in the room to a (fake) company called Sleep Superbly, which began an extensive Showtime-maintained alternate reality game that continued until Dexter's season-five premiere. The alternate reality game involves players working cooperatively to help catch the Infinity Killer and identify his victims; several other characters help. During the game, players communicate with the Infinity Killer, among many others. The game spans Craigslist, Facebook, Twitter, and countless unique sites created for the game. Players can even call phone numbers. The characters and companies are controlled by real people, adding an extra layer of realism and the ability for intelligent conversation. To maintain a realistic feeling in the game, Showtime does not put its name or advertisements on most sites or pages created for the game.\r\nIn September 2010, the Toronto-based company, GDC-GameDevCo Ltd., released a Dexter board game.\r\nOn August 13, 2015, the hidden object mobile game Dexter: Hidden Darkness was released for all iOS devices, with the announcement that Android support would be available soon. Players, acting as Dexter Morgan, solve crimes and hunt down killers to \"feed\" the dark passenger.\r\nMerchandise\r\nIn February 2010, EMCE Toys announced plans to release action figures based on the series.\r\nIn March 2010, Dark Horse Comics released a seven-inch bust of Dexter Morgan, as part of its Last Toys on the Left series. In April 2010, it released a bobblehead doll based on the show character, the Trinity Killer.\r\nA variety of merchandise items is available from Showtime including an apron, bin bags, blood slide beverage coasters and key rings, drinking glasses, mugs, pens made to look like syringes of blood, posters, and T-shirts.\r\nIn June 2021 Flashback announced a highly detailed 1⁄6th scale figure of Dexter Morgan.\r\nProp sales\r\nIn January 2014, in partnership with Hollywood Props, Dexter Corner created an auction site and sold hundreds of original props used in the series; part of the auction's proceeds were donated to the Leukemia & Lymphoma Society. Showtime has also offered a limited selection of props for sale.\r\nFranchise\r\nRevival\r\nIn October 2020, Showtime announced that Dexter would return with a 10-episode limited series, starring Michael C. Hall in his original role, with Clyde Phillips returning as showrunner. On November 17, 2020, it was announced Marcos Siega is set to direct six episodes of the limited series as well as executive produce alongside Hall, John Goldwyn, Sara Colleton, Bill Carraro, and Scott Reynolds. Production began in February 2021, with a fall 2021 premiere date. In January 2021, Clancy Brown was cast as Kurt Caldwell, Dexter's main antagonist and David Magidoff was cast as Teddy. In February 2021, Jamie Chung and Oscar Wahlberg were cast in recurring roles. In June 2021, it was announced that John Lithgow would reprise his role as Arthur Mitchell. In July 2021, it was revealed that Jennifer Carpenter would return as well, with both Lithgow and Carpenter appearing in their characters during flashback scenes. It premiered on November 7, 2021, on Showtime.\r\nFuture\r\nIn February 2023, it was announced that Dexter: New Blood will continue with a story centered around Dexter's son, Harrison Morgan. In the new season, a continuation of the series, the character struggles with his own violent nature and whether he will follow in his father's footsteps.\r\nA prequel series titled Dexter: Origins is also in development with a straight-to-series order. Depicting the earlier years of Dexter's life, the show will follow his years after college graduation, and his first introduction to various characters from the original series. Members of his family will feature as main characters.\r\nAdditional spin-off series, depicting the origins of various other characters from the original show including the Trinity Killer are also in development. The new franchise is being overlooked by Clyde Phillips, creator of Dexter. The multiple television shows will be developed through Showtime's merger with Paramount+.",
    "html": "<p>Dexter is an American crime drama television series that aired on Showtime from October 1, 2006, to September 22, 2013. Set in Miami, the series centers on Dexter Morgan (Michael C. Hall), a forensic technician specializing in bloodstain pattern analysis for the fictional Miami Metro Police Department, who leads a secret parallel life as a vigilante serial killer, hunting down murderers who have not been adequately punished by the justice system due to corruption or legal technicalities. The show's first season was derived from the novel Darkly Dreaming Dexter (2004), the first in a series of novels by Jeff Lindsay. It was adapted for television by James Manos Jr., who wrote the first episode. Subsequent seasons evolved independently of Lindsay's works.</p><p>In February 2008, reruns (edited down to a TV-14 rating) began to air on CBS in the wake of the shortage of original programming ensuing from the 2007–08 Writers Guild of America strike, thus the reruns on CBS ended after one run of the first season. The series enjoyed mostly positive reviews throughout its run. The first four seasons received universal acclaim, but reception dropped considerably as the series progressed. The show has received myriad awards, including two Golden Globes won by Hall and John Lithgow for their roles as Dexter Morgan and Arthur Mitchell, respectively. Season four aired its season finale on December 13, 2009, to a record-breaking audience of 2.6 million viewers, making it the most-watched original series episode ever on Showtime at that time.</p><p>In April 2013, Showtime announced that season eight would be the final season of Dexter. The season eight premiere was the most watched Dexter episode, with more than 3 million viewers total. The original broadcast of the series finale on September 22, 2013, drew 2.8 million viewers, the largest audience in Showtime's history.</p><p>In October 2020, it was announced that Dexter would return with a ten-episode limited series titled Dexter: New Blood, with Hall reprising the title role and Clyde Phillips as showrunner, a position he occupied during the original series' first four seasons. The first season premiered on November 7, 2021 and concluded on January 9, 2022. A continuation of New Blood is in development In January 2023, a prequel series, with the working title Dexter: Origins, was announced as being in development, with Clyde Phillips once again returning as showrunner. This series will follow a younger Dexter as he begins his career with the Miami Metro police department.</p><br/><h3>Plot</h3><p>Orphaned at age three, when he witnessed his mother's brutal murder with a chainsaw, Dexter (Michael C. Hall) was adopted by Miami police officer Harry Morgan (James Remar). Recognizing the boy's trauma and the subsequent development of his sociopathic tendencies, Harry manipulated Dexter to channel his gruesome bloodlust into vigilantism, killing only heinous criminals who slip through the criminal justice system. To cover his prolific trail of homicides, Dexter gains employment as a forensic analyst, specializing in blood spatter pattern analysis, with the Miami Metro Police Department. Dexter is extremely cautious and circumspect; he wears gloves and uses plastic-wrapped \"kill rooms\", carves up the corpses, and disposes of them in the Atlantic Ocean's Gulf Stream to reduce his chances of detection. Dexter juggles his two personas, recognizing each as a distinct part of himself that must cohesively work as one. He depends on their interaction, as a means of survival and normality. Although his homicidal tendencies are deeply unflinching, as he originally claims (via narration), throughout the series he strives to feel (and in some cases does feel) normal emotions and maintains his appearance as a socially responsible human being.</p><br/><h3>Cast and crew</h3><h4>Cast</h4><p>Besides Hall playing the title character, the show's supporting cast includes Jennifer Carpenter as Dexter's adoptive sister and co-worker (and later boss) Debra, and James Remar as Dexter's adoptive father, Harry Morgan. Dexter's co-workers include Lauren Vélez as Lieutenant (later Captain) María LaGuerta, Dexter and Debra's supervisor, David Zayas as Detective Sergeant (later Lieutenant) Angel Batista, and C. S. Lee as lab tech Vince Masuka (promoted to title credits in season two).</p><p>Erik King portrayed the troubled Sgt James Doakes for the first two seasons of the show. Desmond Harrington joined the cast in season three as Joey Quinn; his name was promoted to the title credits as of season four. Geoff Pierson plays Captain Tom Matthews of Miami Metro Homicide. Julie Benz starred as Dexter's girlfriend, then wife, Rita in seasons one to four, with a guest appearance in season five. Rita's children, Astor and Cody, are played by Christina Robinson and Preston Bailey (who replaced Daniel Goldman after the first season). Dexter's infant son Harrison is played by twins, Evan and Luke Kruntchev, through season seven; in season eight, Harrison was played by Jadon Wells. Aimee Garcia plays Batista's younger sister, Jamie.</p><p>Notable appearances in season one are Christian Camargo as Rudy and Mark Pellegrino as Rita's abusive ex-husband Paul. Jaime Murray portrayed Lila Tournay in season two, a physically attractive but unhinged British artist who becomes obsessed with Dexter. Keith Carradine, as Special FBI Agent Frank Lundy, and Jimmy Smits, as ADA Miguel Prado, each appeared in season-long character arcs in seasons two and three, respectively. David Ramsey, who plays confidential informant Anton Briggs in season three, returned in season four, becoming romantically involved with Debra Morgan. John Lithgow joined the cast in season four as the \"Trinity Killer\". Carradine returned in season four, reprising his role as newly retired FBI Special Agent Frank Lundy, who was hunting the Trinity Killer. Courtney Ford was featured in season four as an ambitious reporter who mixes business with pleasure, getting romantically involved with Quinn while simultaneously fishing for sources and stories. Julia Stiles joined the cast in season five as Lumen Pierce, a woman who gets involved in a complex relationship with Dexter after the tragedy that culminated the previous season. Season five also had Jonny Lee Miller cast as the motivational speaker Jordan Chase, Peter Weller cast as Stan Liddy, a corrupt narcotics cop, and Maria Doyle Kennedy cast as Sonya, Harrison's nanny. In season six, Mos Def was cast as Brother Sam, a convicted murderer turned born-again Christian, and Edward James Olmos and Colin Hanks guest-starred as Professor James Gellar and Travis Marshall, members of a murderous apocalyptic cult. Seasons seven and eight featured multiple guest stars, including Ray Stevenson as Ukrainian mob boss Isaak Sirko, a man with a personal vendetta against Dexter; Yvonne Strahovski as Hannah McKay, the former accomplice of a spree killer; Jason Gedrick as strip club owner George Novikov, also part of the mob; and Charlotte Rampling as Dr. Evelyn Vogel, a neuropsychiatrist who takes an interest in Dexter; Ronny Cox as the Tooth Fairy killer; Sean Patrick Flanery as Jacob Elway, a private investigator who Debra works for.</p><p>Margo Martindale had a recurring role as Camilla Figg, a records office worker who was close friends with Dexter's adoptive parents. JoBeth Williams portrayed Rita's suspicious mother, Gail Brandon, in four episodes of season two. Anne Ramsay portrayed defense attorney Ellen Wolf, Miguel's nemesis. Valerie Cruz played a recurring role as Miguel's wife, Sylvia. In season six, Billy Brown was cast as transferred-in Detective Mike Anderson to replace Debra after her promotion to lieutenant. Josh Cooke played Louis Greene, a lab tech and Masuka's intern, in seasons six and seven, and Darri Ingolfsson played Oliver Saxon in season eight.</p><h4>Crew</h4><p>The main creative forces behind the series were executive producers Daniel Cerone, Clyde Phillips, and Melissa Rosenberg. Cerone left the show after its second season. Executive producer and showrunner Phillips departed the series, after a record-setting season-four finale, to spend more time with his family; 24 co-executive producer Chip Johannessen took over Phillips' post. Head writer Melissa Rosenberg left after season four, as well.</p><p>After the conclusion of season five, Chip Johannessen was revealed to be leaving the show after a single run, and Scott Buck would take over as showrunner from season six onward.</p><br/><h3>Production</h3><h4>Exterior filming</h4><p>Although the series is set in Miami, Florida, many of the exterior scenes are filmed in Los Angeles and Long Beach, California. Many landmark buildings and locations in Long Beach are featured throughout the series. The finale episode's airport scene takes place at Ontario International Airport in Ontario, California.</p><h4>Marketing</h4><p>In preparation for the United Kingdom launch of the series, Fox UK experimented with an SMS-based viral marketing campaign. Mobile phone owners received the following unsolicited SMS messages addressed to them by name with no identifying information other than being from \"Dexter\": \"Hello (name). I'm heading to the UK sooner than you might think. Dexter.\" The SMS message was followed by an email directing the user to an online video \"news report\" about a recent spree of killings. Using on-the-fly video manipulation, the user's name and a personalized message were worked into the report—the former written in blood on a wall near the crime scene, the latter added to a note in an evidence bag carried past the camera. While the marketing campaign succeeded in raising the profile of the show, it proved unpopular with many mobile owners, who saw this as spam advertising aimed at mobile phones. In response to complaints about the SMS element of the campaign, Fox issued the following statement:</p><blockquote>The text message you received was part of an internet viral campaign for our newest show Dexter. However, it was not us who sent you the text, but one of your friends. We do not have a database of viewer phone numbers. The text message went along with a piece on the net that you can then send on to other people you know. If you go to you will see the page that one of your friends has filled in to send you that message. Therefore I suggest you have a word with anyone who knows your mobile number and see who sent you this message. For the record, we did not make a record of any phone numbers used in this campaign.</blockquote><br/><h3>Reception</h3><h4>Critical reception</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><span style=\"color:green\">Metacritic</span> and <span style=\"color:orange\">Rotten Tomatoes</span> scores per season</caption><tbody><tr><td><style data-mw-deduplicate=\"TemplateStyles:r1039153519\">@media all and (max-width:720px){body.skin-minerva .mw-parser-output .mw-graph{min-width:100%!important;max-width:100%;overflow-x:auto;overflow-y:visible}}.mw-parser-output .mw-graph-img{width:inherit;height:inherit}</style><style data-mw-deduplicate=\"TemplateStyles:r1097763485\">.mw-parser-output .ambox{border:1px solid #a2a9b1;border-left:10px solid #36c;background-color:#fbfbfb;box-sizing:border-box}.mw-parser-output .ambox+link+.ambox,.mw-parser-output .ambox+link+style+.ambox,.mw-parser-output .ambox+link+link+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+style+.ambox,.mw-parser-output .ambox+.mw-empty-elt+link+link+.ambox{margin-top:-1px}html body.mediawiki .mw-parser-output .ambox.mbox-small-left{margin:4px 1em 4px 0;overflow:hidden;width:238px;border-collapse:collapse;font-size:88%;line-height:1.25em}.mw-parser-output .ambox-speedy{border-left:10px solid #b32424;background-color:#fee7e6}.mw-parser-output .ambox-delete{border-left:10px solid #b32424}.mw-parser-output .ambox-content{border-left:10px solid #f28500}.mw-parser-output .ambox-style{border-left:10px solid #fc3}.mw-parser-output .ambox-move{border-left:10px solid #9932cc}.mw-parser-output .ambox-protection{border-left:10px solid #a2a9b1}.mw-parser-output .ambox .mbox-text{border:none;padding:0.25em 0.5em;width:100%}.mw-parser-output .ambox .mbox-image{border:none;padding:2px 0 2px 0.5em;text-align:center}.mw-parser-output .ambox .mbox-imageright{border:none;padding:2px 0.5em 2px 0;text-align:center}.mw-parser-output .ambox .mbox-empty-cell{border:none;padding:0;width:1px}.mw-parser-output .ambox .mbox-image-div{width:52px}html.client-js body.skin-minerva .mw-parser-output .mbox-text-span{margin-left:23px!important}@media(min-width:720px){.mw-parser-output .ambox{margin:0 10%}}</style><table class=\"box-Notice plainlinks metadata ambox ambox-notice\" role=\"presentation\" style=\"width:100%;margin:0;\"><tbody><tr><td class=\"mbox-text\" style=\"text-align: left;\"><div class=\"mbox-text-span\">Graphs are temporarily unavailable due to technical issues.</div></td></tr></tbody></table></td></tr></tbody></table><p>Although reception to individual seasons has varied, the overall response to Dexter has been positive. The first, second, fourth, and seventh seasons received critical acclaim, the third and fifth seasons received generally positive reviews, while the sixth and eighth seasons received mixed to negative reviews. While remarking on some of the show's more formulaic elements (quirky detective, hero with dense workmates, convenient plot contrivances), Tad Friend of The New Yorker magazine remarked that when Dexter is struggling to connect with Rita or soliciting advice from his victims, \"the show finds its voice.\"</p><p>The review aggregator website Metacritic calculated a score of 77 from a possible 100 for season one, based on 27 reviews, making it the third-best reviewed show of the 2006 fall season. This score includes four 100 percent scores (from the New York Daily News, San Francisco Chronicle, Chicago Sun-Times and People Weekly magazine). Brian Lowry, who had written one of the three poor reviews Metacritic tallied for the show, recanted his negative review in a year-end column for the trade magazine Variety, after watching the full season. On Metacritic, season two has a score of 85 with all eleven reviews positive; season three scored 78 with 13 reviews; season four scored 77 with 14 reviews; season five scored 76 with eleven reviews; season six scored 62 with 10 reviews; season seven scored 81 with seven reviews; and season eight scored 71 with ten reviews.</p><p>On Rotten Tomatoes, season one has an 81 percent approval rating with a score of 8.18 out of 10, and the consensus: \"Its dark but novel premise may be too grotesque for some, but Dexter is a compelling, elegantly crafted horror-drama.\"; season two has a 96 percent approval rating with a score of 7.6 out of 10 and the consensus: \"The Bay Harbor Butcher secures his nefarious spot among the great television anti-heroes in a taut second season that is both painfully suspenseful and darkly hilarious\"; season three has a 71 percent approval rating with a score of 8.3 out of 10 and the consensus: \"America's most amiable serial killer has lost some of his dramatic edge, but this third outing continues Dexter's streak of delivering deliriously twisted entertainment\"; season four has an 88 percent approval rating with a score of 8.4 out of 10 and the consensus: \"The inherent comedy of Miami's favorite psychopath contending with domestic bliss and the unspeakable horror of John Lithgow's Trinity killer coalesce into one of Dexter's most sensational seasons\"; season five has an 88 percent approval rating with a score of 7.5 out of 10 and the consensus: \"Michael C. Hall's remarkable performance invites viewers into Dexter's heart of darkness in a sorrowful fifth season that explores whether a hollow man can become a real boy\"; season six has a 38 percent approval rating with a score of 6.1 out of 10 and the consensus: \"Heavy-handed symbolism, an unimpressive villain, and a redundant arc for America's favorite serial killer all conspire to make Dexter's sixth season its worst yet\"; season seven has an 82 percent approval rating with a score of 7.6 out of 10 and the consensus: \"Season seven represents a return to form for Dexter, characterized by a riveting storyline and a willingness to take some risks\"; and season eight has a 35 percent approval rating, a score of 5.4 out of 10, and the final consensus: \"The darkly dreaming Dexter lays to rest once and for all in a bitterly disappointing final season that is so hesitant to punish its anti-hero for his misdeeds, it opts to punish its audience instead.\"</p><h4>Popular reception</h4><p>The season-three finale, on December 14, 2008, was watched by 1.51 million viewers, giving Showtime its highest ratings for any of its original series since 2004, when Nielsen started including original shows on premium channels in its ratings. The season-four finale aired on December 13, 2009, and was watched by 2.6 million viewers. It broke records for all of Showtime's original series and was their highest-rated telecast in over a decade. The season-five finale was watched by a slightly smaller number of people—2.5 million. The show was declared the ninth-highest rated show for the first ten years of IMDb.com Pro (2002–2012). The seventh season as a whole was the highest rated season of Dexter, watched by 6.1 million total weekly viewers across all platforms.</p><h4>Awards and nominations</h4><p>Dexter was nominated for 24 Primetime Emmy Awards, including in the category of Outstanding Drama Series four times in a row, from 2008 to 2011, and Outstanding Lead Actor in a Drama Series (for Hall) five times in a row, from 2008 to 2012. It has also been nominated for ten Golden Globe Awards (winning two), seven Screen Actors Guild Awards and received a Peabody Award in 2007.</p><p>On December 14, 2006, Hall was nominated for a Golden Globe Award at the 64th Golden Globe Awards. In 2008, the show was nominated for a Primetime Emmy Award for Outstanding Drama Series for its second season (Showtime's first-ever drama to be nominated for the award), and its star for Outstanding Lead Actor in a Drama Series. It won neither, losing to Breaking Bad actor Bryan Cranston. In 2010, Hall and Lithgow, in their respective categories, each won a Golden Globe for their performances in season four.</p><h4>Cultural impact</h4><h4>U.S. broadcast</h4><p>In December 2007, when CBS publicly announced that it was considering Dexter for broadcast reruns, the Parents Television Council (\"PTC\") protested the decision. When the network began posting promotional videos of the rebroadcast on YouTube on January 29, 2008, PTC president Timothy F. Winter, in a formal press release, again called for CBS to not air the show on broadcast television, saying that it \"should remain on a premium subscription cable network\" because \"the series compels viewers to empathize with a serial killer, to root for him to prevail, to hope he doesn't get discovered\". Winter called on the public to demand that local affiliates pre-empt Dexter and warned advertisers that the PTC would take action against any affiliates that sponsored the show.</p><p>Following Winter's press release, CBS added parental advisory notices to its broadcast promotions and ultimately rated Dexter TV-14 for broadcast. On February 17, 2008, the show premiered edited primarily for \"language\" and scenes containing sex or the dismemberment of live victims. The PTC later objected to CBS' broadcasting of the final two episodes of season one in a two-hour block, and to the episodes' starting times, which were as early as 8 pm in some time zones.</p><h4>Association with real crimes</h4><p>Several comparisons and connections between the TV show and its protagonist have been drawn during criminal prosecutions. In 2009, 17-year-old Andrew Conley said the show inspired him to strangle his ten-year-old brother. In an affidavit filed in Ohio County court, in Indiana, police said Conley confessed that he \"watches a show called Dexter on Showtime, about a serial killer, and he stated, 'I feel just like him.'\"</p><p>In Spain, on July 25, 2009, a man and his girlfriend killed his brother and pregnant partner. The man owned the complete Dexter series DVD collection and the methods used to avoid leaving blood traces were inspired by the show.</p><p>On November 4, 2010, in Sweden, a 21-year-old woman known as Dexter-mördaren (\"The Dexter killer\") or Dexter-kvinnan (\"The Dexter woman\") killed her 49-year-old father by stabbing him in the heart. During questioning, the woman compared herself to Dexter Morgan, and a picture of the character would appear on her phone when her father called her. In July 2011, she was sentenced to seven years in prison.</p><p>In Norway, Shamrez Khan hired Håvard Nyfløt to kill Faiza Ashraf. Nyfløt claimed that Dexter inspired him, and he wanted to kill Khan in front of Faiza, similar to the television series, to \"stop evil\".</p><p>Association was established between Mark Twitchell, of Edmonton, Alberta, Canada, during his first-degree murder trial, and the character of Dexter Morgan. After weeks of testimony and gruesome evidence presented in court, Twitchell was found guilty of the planned and deliberate murder of 38-year-old Johnny Altinger on April 12, 2011.</p><p>British teenager Steven Miles, 17, was sentenced to 25 years in prison on October 2, 2014, for stabbing and dismembering his girlfriend Elizabeth Rose Thomas, 17, in Oxted, Surrey. Police discovered Thomas' body on January 24, 2014, and determined the cause of death to be a stab wound to the back. Miles was arrested on suspicion of murder. Miles pled guilty to the crime on September 9. According to Surrey Police, Miles had dismembered Thomas' body following her death, wrapping up limbs in plastic wrap, and had attempted to clean up the crime scene before he was found by a family member. Miles had been reported to be obsessed with the television series Dexter. Miles reportedly had an alter ego named Ed, whom Miles claims made him carry out the murder.</p><p>In New Orleans, Louisiana, 34-year-old Benjamin Beale was arrested after police discovered a decapitated body inside a freezer in a painted bus on January 11, 2022, whose body was confirmed to be Julia Dardar over a week later, who was the missing mother of two children. They even discovered a grim Dexter profile painting with guns and knives, as this murder was inspired by the \"Ice Truck Killer\" from the show's first season.</p><p>On May 18, 2022, in Delhi, India, 28-year-old Aaftab Ameen Poonawala strangled his live-in partner Shraddha Walkar after a heated argument, killing her. He chopped her body into 35 pieces and stored it in a large refrigerator, disposing of the pieces in a nearby forest over the next 18 days. The murder was inspired by the show.</p><br/><h3>Theme song and series music</h3><p>The opening title theme for Dexter was written by Rolfe Kent and scored by American composer Daniel Licht. The series music for each episode was overseen by Gary Calamar of Go Music and coordinated by Alyson Vidoli.</p><ul><li>\"Dexter Main Title\" (Rolfe Kent) – 1:40</li><li>\"Tonight's the Night\" (Michael C. Hall, Daniel Licht) – 1:07</li><li>\"Conoci La Paz\" (Beny Moré) – 3:03</li><li>\"Uruapan Breaks\" (Kinky) – 2:21</li><li>\"Flores Para Ti\" (Raw Artistic Soul featuring Rafael Cortez) – 5:16</li><li>\"Blood\" (Michael C. Hall, Daniel Licht) – 0:59</li><li>\"Con Mi Guaguanco\" (Ray Armando) – 7:12</li><li>\"Perfidia\" (Mambo All-Stars) – 2:37</li><li>\"Sometimes I Wonder\" (Michael C. Hall, Daniel Licht) – 0:29</li><li>\"Born Free\" (Andy Williams) – 2:25</li><li>\"Dexter Main Title\" (Kinky) – 1:41</li><li>\"Escalation\" (Daniel Licht) – 2:09</li><li>\"Shipyard\" (Daniel Licht) – 2:03</li><li>\"Deborah Loves Rudy/The House\" (Daniel Licht) – 3:12</li><li>\"I Can't Kill\" (Daniel Licht) – 2:21</li><li>\"Voodoo Jailtime\" (Daniel Licht) – 2:58</li><li>\"New Legs\" (Daniel Licht) – 2:01</li><li>\"Photo Albums\" (Daniel Licht) – 3:22</li><li>\"Courting the Night\" (Daniel Licht) – 1:22</li><li>\"Hide Your Tears\" (Daniel Licht) – 1:36</li><li>\"Wink\" (Daniel Licht) – 2:08</li><li>\"Astor's Birthday Party\" (Daniel Licht) – 2:00</li><li>\"Epilogue/Bloodroom\" (Daniel Licht) – 3:44</li><li>\"Blood Theme\" (Daniel Licht) – 2:25</li><li>\"Die This Way\" (Daniel Licht, Jon Licht) – 3:55</li><li>\"Fight or Flight\" (Daniel Licht) – 1:41 (ITunes Bonus)</li><li>\"Nowhere to Hide\" (Daniel Licht) – 1:43 (ITunes Bonus)</li><li>\"The Ice Truck Killer\" (Daniel Licht) – 2:56 (ITunes Bonus)</li><li>\"The Fortune\" (Daniel Licht) – 1:17 (ITunes Bonus)</li><li>\"Second Season Suite\" (Daniel Licht) – 2:01 (ITunes Bonus)</li></ul><br/><h3>Other media</h3><h4>Dexter: Early Cuts</h4><p>Dexter: Early Cuts is an animated web series that premiered on October 25, 2009. Hall reprises his role as the voice of Dexter.</p><p>KTV Media International Bullseye Art produced and animated the webisodes, working closely with Showtime for sound editing, Interspectacular for direction, and illustrators Kyle Baker, Ty Templeton, Andrés Vera Martínez, and Devin Lawson for creating distinctive illustrations. The webisodes are animated in 2.5D style, where flat two-dimensional illustrations are brought to life in three-dimensional space. The first season was created and written by Dexter producer/writer Lauren Gussis. She was nominated for a Webby for her writing in the first season.</p><p>The first web series precedes the narrative of the show and revolves around Dexter hunting down the three victims that he mentions in the sixth episode of season one, \"Return to Sender\". Each victim's story is split into four two-minute chapters.</p><p>A second season of the web series titled Dexter: Early Cuts: Dark Echo, one story in six chapters, premiered on October 25, 2010. It was written by Tim Schlattmann and illustrated by Bill Sienkiewicz and David Mack. The story begins immediately following Dexter's adoptive father Harry's death.</p><p>Season 3 centers around Dexter's first encounter with a pair of killers. Each story is told in several two to three-minute chapters.</p><h4>Album soundtrack</h4><p>In August 2007, the album soundtrack entitled Dexter: Music from the Showtime Original Series was released featuring music from the television series. The album was produced by Showtime and distributed by Milan Records. The digital download version offers five additional bonus tracks from the show's first two seasons.</p><h4>Comic book</h4><p>Marvel Comics released a Dexter limited series in July 2013. The comic books are written by creator Jeff Lindsay and drawn by Dalihbor Talajic. Another limited series, called Dexter: Down Under, was published in 2014.</p><h4>Home media releases</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"4\" style=\"text-align:center\">DVD/Blu-ray releases</th></tr><tr><th>DVD Name</th><th>Release Date</th><th>Ep #</th><th style=\"text-align:left\">Additional Content</th></tr><tr><td>The Complete First Season</td><td>Region 1: August 21, 2007<br>Region 2: May 19, 2008<br>Region 4: February 14, 2008</td><td style=\"text-align:center;\">12</td><td><ul><li>2 Episode Audio Commentaries by the Cast</li><li>The Academy of Blood: A Killer Course!</li><li>Witnessed in Blood: A True Murder Investigation</li><li>N Technology</li><li>2 episodes of Showtime's <i><span class=\"mw-redirect\">Brotherhood</span></i></li></ul></td></tr><tr><td>The Complete Second Season</td><td>Region 1: August 19, 2008<br>Region 2: March 30, 2009<br>Region 4: August 21, 2008</td><td style=\"text-align:center;\">12</td><td><ul><li>2 episodes of Showtime's <i>Brotherhood</i>, Season 2</li><li>Via E-Bridge Technology</li><li>2 episodes from <i><span>The Tudors</span></i>, Season 2 &amp; <i><span>Californication</span></i></li></ul></td></tr><tr><td>The Complete Third Season</td><td>Region 1: August 18, 2009<br>Region 2: August 16, 2010<br>Region 4: August 20, 2009</td><td style=\"text-align:center;\">12</td><td><ul><li>Cast Interviews with Michael C. Hall, Lauren Velez, C.S Lee, David Zayas, Jennifer Carpenter, Julie Benz</li><li>Victims Match</li><li>Inside the Writers Room</li><li>Bringing Miami to LA</li><li>Miami's Finest</li><li>Photo Gallery</li><li>First two Episodes of <i><span>United States of Tara</span></i>, Season 1</li></ul></td></tr><tr><td>The Complete Fourth Season</td><td>Region 1: August 17, 2010<br>Region 2: November 29, 2010<br>Region 4: November 4, 2010</td><td style=\"text-align:center;\">12</td><td><ul><li><i><span>Californication</span></i>: Season 3: Episodes 1 &amp; 2</li><li><span class=\"mw-redirect\"><i>Lock 'N Load</i></span>: Season 1 – Episode 1</li><li><i><span>The Tudors</span></i>: Season 4 – Episodes 1 &amp; 2</li><li>Via E-Bridge Technology</li><li>Cast Interviews with Michael C. Hall, Clyde Phillips, David Zayas, John Lithgow, C.S Lee, Julie Benz, Lauren Velez, Jennifer Carpenter, James Remar</li></ul></td></tr><tr><td>The Complete Fifth Season</td><td>Region 1: August 16, 2011<br>Region 2: September 5, 2011<br>Region 4: August 18, 2011</td><td style=\"text-align:center;\">12</td><td><ul><li><i><span>Californication</span></i>: Season 4 – Episodes 1 &amp; 2</li><li>Interviews with: Michael C. Hall, Jennifer Carpenter, C.S. Lee, Lauren Vélez, Julia Stiles, James Remar, Desmond Harrington, Chip Johannessen, and David Zayas</li><li>Reflecting on Season 5: Julia Stiles</li><li><i><span>The Borgias</span></i>: Season 1 – Episodes 1 &amp; 2</li><li><i><span>Episodes</span></i>: Season 1 – Episodes 1 &amp; 2</li><li><i><span>Homeland</span></i>: Trailer</li></ul></td></tr><tr><td>The Complete Sixth Season</td><td>Region 1: August 14, 2012<br>Region 2: June 18, 2012<br>Region 4: June 20, 2012</td><td style=\"text-align:center;\">12</td><td><ul><li><i><span>House of Lies</span></i> Episodes 1 &amp; 2</li><li>Interviews with David Zayas, Michael C. Hall, Jennifer Carpenter, Lauren Vélez, CS Lee, Colin Hanks, and Desmond Harrington.</li></ul></td></tr><tr><td>The Complete Seventh Season</td><td>Region 1: May 14, 2013 <br>Region 2: June 3, 2013<br>Region 4: June 19, 2013</td><td style=\"text-align:center;\">12</td><td><ul><li><i><span class=\"mw-redirect\">Ray Donovan</span></i> Pilot Episode</li><li><i><span>The Borgias</span></i>: Season 2 – Episodes 1 &amp; 2</li><li>Biographies</li></ul></td></tr><tr><td>The Complete Eighth and Final Season</td><td>Region 1: November 14, 2013<br>Region 2: December 2, 2013<br>Region 4: November 27, 2013</td><td style=\"text-align:center;\">12</td><td><ul><li>From Cop To Killer, featurette</li><li>Behind the Scenes</li><li>With the Creators</li><li>Dissecting a Scene</li><li><i><span>Ray Donovan</span></i>: Season 1 – Episodes 1 &amp; 2</li></ul></td></tr><tr><th>Blu-ray Name</th><th>Release Date</th><th>Ep #</th><th>Additional Content</th></tr><tr><td>The Complete First Season</td><td>Region A: January 6, 2009<br>Region B: June 18, 2012</td><td style=\"text-align:center;\">12</td><td><ul><li>2 Episode Audio Commentaries by the Cast</li><li>The Academy of Blood: A Killer Course!</li><li>Witnessed in Blood: A True Murder Investigation</li><li>Podcast</li><li>First Episode of <i>Dexter</i>, Season 3<br>First two Episodes of United States of Tara, Season 1</li></ul></td></tr><tr><td>The Complete Second Season</td><td>Region A: May 5, 2009<br>Region B: June 18, 2012</td><td style=\"text-align:center;\">12</td><td><ul><li>Tools of the Trade</li><li>Podcasts</li><li>Featurette: \"Blood Fountains\"</li><li>Featurette: \"Dark Defender\"</li><li>One episode of the upcoming Showtime series <i><span>Nurse Jackie</span></i></li><li>One episode of the new Showtime series <i>United States of Tara</i></li></ul></td></tr><tr><td>The Complete Third Season</td><td>Region A: August 18, 2009<br>Region B: June 18, 2012</td><td style=\"text-align:center;\">12</td><td><ul><li>First two Episodes of <i><span>The Tudors</span></i>, Season 3</li><li>Dexter By Design – Book Experts</li><li>Cast Interviews with Michael C. Hall, Lauren Velez, C.S Lee, David Zayas, Jennifer Carpenter, Julie Benz</li><li>First two Episodes of <i>United States of Tara</i>, Season 1</li></ul></td></tr><tr><td>The Complete Fourth Season</td><td>Region A: August 17, 2010<br>Region B: November 4, 2010</td><td style=\"text-align:center;\">12</td><td><ul><li><i><span>Californication</span></i>: Season 3 – Episodes 1 &amp; 2</li><li><i><span>The Tudors</span></i>: Season 4 – Episodes 1 &amp; 2</li><li>2009 Comic Con Panel (Best Buy Exclusive)</li></ul></td></tr><tr><td>The Complete Fifth Season</td><td>Region A: August 16, 2011<br>Region B: August 18, 2011</td><td style=\"text-align:center;\">12</td><td><ul><li><i><span>The Borgias</span></i>: Season 1 – Episodes 1 &amp; 2</li><li><i><span>Episodes</span></i>: Season 1 – Episodes 1 &amp; 2</li><li>Interviews with: Michael C. Hall, Jennifer Carpenter, C.S. Lee, Lauren Vélez, Julia Stiles, James Remar, Desmond Harrington, Chip Johannessen, and David Zayas</li><li>Reflecting on Season 5: Julia Stiles</li></ul></td></tr><tr><td>The Complete Sixth Season</td><td>Region A: August 15, 2012<br>Region B: June 18, 2012</td><td style=\"text-align:center;\">12</td><td><small><span style=\"color: #2C2C2C\">TBA</span></small></td></tr><tr><td>The Complete Seventh Season</td><td>Region A: May 14, 2013<br>Region B: June 3, 2013</td><td style=\"text-align:center;\">12</td><td><small><span style=\"color: #2C2C2C\">TBA</span></small></td></tr><tr><td>The Complete Eighth and Final Season</td><td>Region A: November 12, 2013<br>Region B: November 27, 2013</td><td style=\"text-align:center;\">12</td><td><small><span style=\"color: #2C2C2C\">TBA</span></small></td></tr></tbody></table><h4>Games</h4><p>On September 13, 2009, Icarus Studios released a video game based on the events of season one, for the iPhone platform, via the iTunes app store. The game was released for the iPad on October 15, 2010, and for PCs on February 15, 2011. The cast and crew of Dexter were very supportive, with some of the cast providing full voice work for the game, including Hall. The game has received many positive reviews, including an 8/10 from IGN. No additional content for the game has been released or announced as planned; plans to release the game on the PlayStation 3 and Xbox 360 seem to have been canceled, as no recent information regarding the expansion of the game onto these platforms has been given and both consoles have been discontinued.</p><p>In July 2010, Showtime launched Dexter Game On during Comic-Con. The promotion relied on community involvement, part of which required participants to use the SCVNGR applications available for the Android, iPad, iPhone, and iPod Touch platforms to complete treks around the five cities where the game was available. The final trek led to a kill room, where the Infinity Killer had recently claimed a victim. A link was found in the room to a (fake) company called Sleep Superbly, which began an extensive Showtime-maintained alternate reality game that continued until Dexter's season-five premiere. The alternate reality game involves players working cooperatively to help catch the Infinity Killer and identify his victims; several other characters help. During the game, players communicate with the Infinity Killer, among many others. The game spans Craigslist, Facebook, Twitter, and countless unique sites created for the game. Players can even call phone numbers. The characters and companies are controlled by real people, adding an extra layer of realism and the ability for intelligent conversation. To maintain a realistic feeling in the game, Showtime does not put its name or advertisements on most sites or pages created for the game.</p><p>In September 2010, the Toronto-based company, GDC-GameDevCo Ltd., released a Dexter board game.</p><p>On August 13, 2015, the hidden object mobile game Dexter: Hidden Darkness was released for all iOS devices, with the announcement that Android support would be available soon. Players, acting as Dexter Morgan, solve crimes and hunt down killers to \"feed\" the dark passenger.</p><h4>Merchandise</h4><p>In February 2010, EMCE Toys announced plans to release action figures based on the series.</p><p>In March 2010, Dark Horse Comics released a seven-inch bust of Dexter Morgan, as part of its Last Toys on the Left series. In April 2010, it released a bobblehead doll based on the show character, the Trinity Killer.</p><p>A variety of merchandise items is available from Showtime including an apron, bin bags, blood slide beverage coasters and key rings, drinking glasses, mugs, pens made to look like syringes of blood, posters, and T-shirts.</p><p>In June 2021 Flashback announced a highly detailed 1⁄6th scale figure of Dexter Morgan.</p><h4>Prop sales</h4><p>In January 2014, in partnership with Hollywood Props, Dexter Corner created an auction site and sold hundreds of original props used in the series; part of the auction's proceeds were donated to the Leukemia & Lymphoma Society. Showtime has also offered a limited selection of props for sale.</p><br/><h3>Franchise</h3><h4>Revival</h4><p>In October 2020, Showtime announced that Dexter would return with a 10-episode limited series, starring Michael C. Hall in his original role, with Clyde Phillips returning as showrunner. On November 17, 2020, it was announced Marcos Siega is set to direct six episodes of the limited series as well as executive produce alongside Hall, John Goldwyn, Sara Colleton, Bill Carraro, and Scott Reynolds. Production began in February 2021, with a fall 2021 premiere date. In January 2021, Clancy Brown was cast as Kurt Caldwell, Dexter's main antagonist and David Magidoff was cast as Teddy. In February 2021, Jamie Chung and Oscar Wahlberg were cast in recurring roles. In June 2021, it was announced that John Lithgow would reprise his role as Arthur Mitchell. In July 2021, it was revealed that Jennifer Carpenter would return as well, with both Lithgow and Carpenter appearing in their characters during flashback scenes. It premiered on November 7, 2021, on Showtime.</p><h4>Future</h4><p>In February 2023, it was announced that Dexter: New Blood will continue with a story centered around Dexter's son, Harrison Morgan. In the new season, a continuation of the series, the character struggles with his own violent nature and whether he will follow in his father's footsteps.</p><p>A prequel series titled Dexter: Origins is also in development with a straight-to-series order. Depicting the earlier years of Dexter's life, the show will follow his years after college graduation, and his first introduction to various characters from the original series. Members of his family will feature as main characters.</p><p>Additional spin-off series, depicting the origins of various other characters from the original show including the Trinity Killer are also in development. The new franchise is being overlooked by Clyde Phillips, creator of Dexter. The multiple television shows will be developed through Showtime's merger with Paramount+.</p><br/>"
  },
  "errorMessage": ""
}