{
  "imDbId": "tt9140342",
  "title": "It's a Sin",
  "fullTitle": "It's a Sin (TV Series 2021–2021)",
  "type": "TVSeries",
  "year": "2021",
  "items": [
    {
      "username": "hamlet-16",
      "userUrl": "https://www.imdb.com/user/ur0210789",
      "reviewLink": "https://www.imdb.com/review/rw6524160",
      "warningSpoilers": true,
      "date": "25 January 2021",
      "rate": "8",
      "helpful": "312 out of 337 found this helpful.",
      "title": "oh wow",
      "content": "As a gay man who lived through the 80s and watched as friends and acquaintances \"went home\" this TV show brings it all back.It is almost unbearable in parts... the passing of Colin is devastating ... the scenes in the hospital in the final episode... all too familiar family disdain for their gay sons... the love of strangers ... the angels like Jill...Perhaps now some people will understand the deep wounds inflicted by some politicians and \"religious\" leaders of the day ... wounds that do not heal with time...So to Russell and his cast thank you....and to David Dennis Paul Tony Red Lee and so many guys ..too many guys ..... here's to you!"
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw6515315",
      "warningSpoilers": false,
      "date": "22 January 2021",
      "rate": "10",
      "helpful": "210 out of 242 found this helpful.",
      "title": "Excellent, unmissable drama.",
      "content": "I haven't been able to switch it off, thank goodness for All4! Channel four and RTD, you have truly delivered here with this wonderful five part series. Sexy, funny, moving, sad, it has a bit of everything going on.Despite all of the glitz and fun, there is a harshness that arrives like a knockout punch, how on Earth can something be so much fun, and then turn so bleak, what an astonishing mix.I would highly recommend it, great characters, great stories, and the production values are off the scale, the really have managed to bring the 1980's back to life.Russell T Davies, it breaks my heart that you aren't on hand to save Dr Who right now, but when you're making content like this, you keep at it.I loved it! 10/10."
    },
    {
      "username": "prhazell",
      "userUrl": "https://www.imdb.com/user/ur81079712",
      "reviewLink": "https://www.imdb.com/review/rw6518060",
      "warningSpoilers": false,
      "date": "23 January 2021",
      "rate": "10",
      "helpful": "514 out of 547 found this helpful.",
      "title": "Brilliant",
      "content": "I came out in 1982 and this bought all the memories flooding back , good and bad . From discovering my sexuality , discovering my parents were homophobes . Going out on the scene seemed like an adventure , alluring but underground , away from straight society . I visited San Francisco and the Castro in 1981 but was underage for the bars and unaware of the bath houses etc . I am glad of my naivety . I look back now almost 40 years and remember those who I have lost . 5 Episodes I wish it had been 12 ."
    },
    {
      "username": "W011y4m5",
      "userUrl": "https://www.imdb.com/user/ur71088443",
      "reviewLink": "https://www.imdb.com/review/rw6516208",
      "warningSpoilers": false,
      "date": "23 January 2021",
      "rate": "10",
      "helpful": "175 out of 199 found this helpful.",
      "title": "Raw, Cathartic & Poignant.",
      "content": "After binge-watching the entire series from start to finish, I can confidently conclude that this is one of the best (if not, THE best) show/s Russell T. Davies has ever created in his entire career; \"It's A Sin\" is both a powerfully joyous & appreciative celebration of the lives of the boys we lost to AIDS during the 80s / 90s (being thankful for the happy times people had with them, however fleeting) whilst also being a mournful, sombre remembrance - acknowledging the horrific implications of their premature losses, respecting their memories by immortalising them in stories (so they may be resurrected to live on through others) - that will outlast us all & possibly educate (or even inspire) future generations - whilst simultaneously contemplating the undiscovered potential of the crisis' victims & what they may have eventually become - if they'd had the opportunity (they so rightfully deserved) to live the lives they'd always intended to live... If each & every single one of them hadn't been so unjustly failed by the systems of power which were meant protect / ensure their safety. Hence, the series is unafraid to examine the brazen mistreatment of those within the LGBT community with a palpable sense of anger at the perpetrated injustices - that are rightfully depicted in a manner of utter condemnation - balancing that ominous portrayal of inhumanity against the hopefulness of other citizen's remarkable humanity - striking a complex & yet extremely effective tone, capturing the naive innocence, the wilful ignorance, the disinformation, the shame, the flawed coping mechanisms / inability to cope, the paranoia, the prejudice & the stigmas, the hopelessness & the endurance of the human spirit - in spite of overwhelming adversity... All culminating to form an overwhelmingly deep, morally ambiguous exploration in to the human condition, its flawed nature & how life / death situations bring out the best... But equally, the very worst too.What I love most about Russell's new drama is it additionally reminds us these were genuine people; behind every death across the country was a story that deserves to be told - of an individual who existed with unique hopes, aspirations, families, friends, relationships, personalities & passions etc. There are many alive today (men & women) who grieved & are still scarred by the wounds inflicted by this forgotten pandemic... Hopefully \"It's A Sin\" can act as a memorial to heal - especially considering the timing; now more than ever - during another viral pandemic when some people have seemingly grown tired & become desensitised to an exponential growth in mortality rates - trivialising daily numbers of deceased as nothing more than random facts & figures - this bold drama has arrived at the perfect moment to directly challenge those sorts of harmful misconceptions; it places us in the centre of the hospital wards to reaffirm \"never again: these are living, breathing civilians & their strife is worthy of our attention - do not look away; they are your loved ones\".Cast member Tracy-Ann Oberman described this mini-series as \"Russell's Schindler's List\" in an interview & she's right. Moreover, I'd compare it to HBO's Chernobyl & wish it the same levels of critical acclaim & success. After all, both analyse the human cost of deliberate negligence.To conclude, I'd describe this project as bold, beautiful, engaging, agonisingly painful, intimate, heartfelt, humbling, grounded in authenticity, surprisingly personal, honest & incredibly uncomfortable... But worth every single minute of your investment; I cannot recommend it enough."
    },
    {
      "username": "crimeandpancakes",
      "userUrl": "https://www.imdb.com/user/ur97894891",
      "reviewLink": "https://www.imdb.com/review/rw6516248",
      "warningSpoilers": false,
      "date": "23 January 2021",
      "rate": "10",
      "helpful": "257 out of 280 found this helpful.",
      "title": "This is hard to put in words.",
      "content": "This was an education. It's brilliant, it's fun, there's an outstanding cast and it is absolutely heart breaking. I hope everyone involved in this show is so so proud. Sorry this isn't much of a review, it's hard to put in words how I feel after watching this. Just give it a go, with an open heart and learn and respect. You will laugh and you will cry."
    },
    {
      "username": "liberty_lee",
      "userUrl": "https://www.imdb.com/user/ur109561994",
      "reviewLink": "https://www.imdb.com/review/rw6522990",
      "warningSpoilers": true,
      "date": "24 January 2021",
      "rate": "9",
      "helpful": "65 out of 76 found this helpful.",
      "title": "Heartwarming and heartbreaking",
      "content": "You may need a tissue for your tears when you watch this. Really good 80s vibe, the characters are likeable and funny. It made me more aware of something I didnt know alot about, as I was a child in the 80s. It was interesting, intriguing, sweet and tragic. I think I cried at one point in every episode, twice in the last one. The main guys are so likeable, and jill, and Collins mum, some really heartwarming moments in every episode. Theres lots of sex, incase that bothers anyone. The last scene, as, my poor heart. I really hope that there were gay men and women in the 80s that had supportive parents or friends, I really hope that people didnt have to die alone of shame, I'm heartbroken for those men who died, for love, for fun, for lack of information, and for their families and friends. I hope no one ever dies from shame. Heartbreaking moments."
    },
    {
      "username": "mrjdarcher",
      "userUrl": "https://www.imdb.com/user/ur40947448",
      "reviewLink": "https://www.imdb.com/review/rw6515980",
      "warningSpoilers": false,
      "date": "23 January 2021",
      "rate": "9",
      "helpful": "94 out of 115 found this helpful.",
      "title": "Eye opening",
      "content": "I watched this and was shocked at how brothers, sons were treaded in the 80's and 90's for being ill.The writing and screen play was brilliant. This can be a little graphic, but that paints a picture. Doesn't matter what you believe or think, everyone deserves love.This is the type of thing we should have seen at school rather than Philadelphia. Time to accept and love one another."
    },
    {
      "username": "lambiepie-2",
      "userUrl": "https://www.imdb.com/user/ur0874373",
      "reviewLink": "https://www.imdb.com/review/rw6634472",
      "warningSpoilers": true,
      "date": "25 February 2021",
      "rate": "10",
      "helpful": "31 out of 39 found this helpful.",
      "title": "An Amazing BBC Series on a Not So Wonderful Time in the 80s (UPDATED)",
      "content": "I binged on this series in America on HBOMax, and I found it terrific. I grew up in this time, and they do hit on the points.Much of this was tough to watch, to be reminded of again, but there needs to be a memory. In the 80s, two prominent issues were going on: Crack/Drug Wars and HIV/AIDS. Those looking back on the times recall the music, the 'greed is good' mentality and fun. And it was. But it was also defined by the previous two issues mentioned as well.While this was focusing on the gay male community, I can 100% identify with Jill Baxter's character (played wonderfully by Lydia West). I did what she did back then - first, I was TOTALLY misinformed about HIV/AIDS and was so afraid when finding out, then studying as much as I could about it. After Rock Hudson died in 1985, I ended up wanting to help. I volunteered on phones, helped collect donations at the grocery stores to get toothpaste, soap, shampoo, disposable shavers - things they needed, and volunteers would drop off. I, too, in the early '90s, walked through a hospital 'wing' of AIDS patients while visiting my best friend in his last days. I'm sure I seemed annoying 'buzzing' around my male gay friends being heterosexual too. Still, I was there with them. Not as a label, but as a human being. From beginning to end, and even inserting myself with those I didn't know. I remember.I had many gay male friends back then. As young as I was, it didn't matter what their sexuality was; we had a great time as a group, a few of us like brothers and sisters. 1981-1984 we went dancing and clubbing, met after work or in the clubs. And some eventually 'went missing,' found out later they \"got sick,\" and they've 90% 'gone home'/died now. I miss them, and I thought about them all watching this. That's how spot-on much of this is. The five-part series touches upon so much (and I understand it was supposed to be eight episodes or so, but it was a hard sell to get it on their air and ended up at 5). The thing is, I cannot begin to know or feel exactly how these men felt. I can tell how I felt around them and watching stuff unfold and how I felt with and for them. It was my coming of age. \"It's a Sin\" is a look at how the \"middle generation\" (there IS a middle generation as they were NOT Baby-Boomers or Gen X'ers, but that's another story) came of age.In \"It's A Sin,\" not all of the gay males are stereotypical characters. They each were motivated differently, and I observed how it separated the five male characters' lives and norms. I wish they did go with the eight parts because I am sure there is more character development with their families. For example - Ritchie, the lead, you figure out quickly. And there ARE some stereotypical aspects of the character. But you get to see sides of this from other characters too. The Gregory/Gloria character and his 'richer government-connected family' did have more to lose if anyone found out what his son had died of. You see that family's grief at Gregory's end. You know what they did -- to 'erase' him -- but unless you understand WHY they did what they did when Gregory died, it may be confusing. I'm guessing his story may have been edited, but it would have been essential for folks to get how people thought in those times of the families. They were placed under pressure as well as their ignorance about it. Jus wish they delved into I a bit more.There is Roscoe, who may seem stereotypical. He wasn't to me, and I loved the \"slap\" scene in the beginning. However, his issues also concern immigration and how he and his family still looked to their original Country norms on dealing with him.I did wish to learn more about Ash and HIS family as he was bright & sensitive. He seemed to have been able to \"blend in\" at times with the heterosexuals. Then not, so it seemed he too held back much. And the segments of Collin's story (played so realistically by Callum Scott-Howells and will be up for a BAFTA, no doubt!) choked me up. The character was a workaholic, quiet (repression), followed the rules - which made his end so tragic, crushing. What happened to him wasn't all 'homosexual' related to me. I know many of a heterosexual going through that, which is why it was tough to see even more. I had to take a few minutes before going onto the next segment in the series, as Collin's story hit me very hard.And then the lead, Ritchie. As promiscuity goes, he was shown as way over the top. But in perspective, he did leave home, he did find himself, and he was open to BE himself in London. He now could study what he wanted. He found a best friend in Jill, a real one he could be himself. Jill - became his family. Ritchie has THE BEST scene explaining the misinformation about HIV/AIDS and how he thinks he is young and invincible (yep!) and didn't believe any of it. His newly found sexual freedoms were not to be cut short. Again, I can only see this from where I stand, but at that age, leaving home-and although Ritchie was their golden, (spoiled) child- he couldn't wait to be set free and when free - liked and loved. In \"It's A Sin,\" there are MANY times we see that's what Ritchie wanted, and not just in \"sex.\" While the writing was on the wall with Ritchie, his story doesn't make it less tragic.Another area the series touched upon a tad (I wish it delved in a bit more) of something that I disliked the most at that time. It was the death of one and how the family scavenged and REFUSED to take care of them during the sickness or acknowledge their partner. We see his funeral, and the family at the funeral didn't want to mention he left behind his boyfriend. Subsequently, for families/folks who did 'kinda' say it back then, they listed them as a \"Longtime Companion\" in the obits. (And that is another film worth checking out as well). I witnessed a few of those families shutting out those long-term relationships. Those types of families did nothing to help their afflicted children. They wouldn't even talk or visit them. But they were on hand to take it all from the partner who took care of them. Those families were one of the most horrific parts of this in the 80s.It was a scary, crazy time as information was all over the place from 1978-1985, and his little series touches on much of it. Scientists and researchers tried to find the sources and cures, which gives those who didn't live through it a good glimpse. I liked the main ensemble cast (Olly Alexander as Richard/Richie, my goodness! Start polishing your BAFTA! Omari Douglas as Roscoe, Nathaniel Curtis as Ash). They sold their parts to me, did a great job. I found the women very strong. Actress Keely Hawes as Ritchie's mom - I disliked her being so naive and doting in the beginning, hated her with a passion at the end. Her performance was just that powerful. Actress Seyan Sarvan deserves kudos, too, for playing her small role as the Lawyer/Advocate for Collin. That was a pivotal scene to get out a fundamental law that many who had AIDS in the UK didn't get to know or use.I also wish to add this about the other performances - Neil Patrick Harris in Episode 1 was fantastic to begin this tale and start the heartbreak over what was coming. Oustanding actor! Steven Fry, coming in as a Government closeted mucky-muck, was good too. But as an American, I was a bit lost on some of the stuff he was doing (like the dinner with Roscoe and the other men at the table. I just assumed they were all closeted mucky-mucks with their protegees. I could be wrong.) Neil and Stephen both well-known faces/names, good roles that were moving the tale along.\"It's A Sin\" gets high marks from me. It was very close to what I was around at the time. I loved the stories and the excellent cast that came together as its own little family, as well as knowing how tough it was to get it on TV. Don't miss this. While heartbreaking, while bringing up 'the real times of the 80s', this is a great series."
    },
    {
      "username": "rhmacl",
      "userUrl": "https://www.imdb.com/user/ur16760123",
      "reviewLink": "https://www.imdb.com/review/rw6658116",
      "warningSpoilers": false,
      "date": "3 March 2021",
      "rate": "10",
      "helpful": "27 out of 33 found this helpful.",
      "title": "Do. Not. Miss!",
      "content": "Outstanding, but I'm biased. This story could be about me, my experiences as a young gay man in California. I was also 30 in 1991, and this show captures the myriad emotions, fears, hopes, that occupied my mind at the time. AIDS killed so many of my cohort or clique and while slaughtering them it really f#cked with the minds of those it didn't kill.This series sorts all those conflicting memories feelings and emotions out. It reminded me how we sank into the realization of what AIDS was, how we tried to deny it, tried to deny the power it had over us, and how we coped once we overcame our initial dismay. The camaraderie of good friends who became warriors against the disease and ignorance and bias that it seemed to draw into focus. The caring, caregiving, and love we dredged out of ourselves as we all simultaneously redirected our lives in order to be present to the vast suffering.Thank you to all involved in this production for making by far the hardest most soul-sucking, painful, and sad era of my stupid little life a little easier to remember and appreciate. I saw friends I have forgotten about in each character, a trait here and there, speaking out and forcing me back to those heartbreaking AND heartwarming experiences. Still a lot of pain, and perhaps compartmentalized into too small a space in my mind. But thank you for giving them a little bit of life again."
    },
    {
      "username": "dcarroll74",
      "userUrl": "https://www.imdb.com/user/ur57756206",
      "reviewLink": "https://www.imdb.com/review/rw6516202",
      "warningSpoilers": false,
      "date": "23 January 2021",
      "rate": "10",
      "helpful": "37 out of 48 found this helpful.",
      "title": "Wonderful Drama",
      "content": "A refreshing, eye opening drama, reflecting the 1980's, as it was. No frills, punch in the stomach pain, for those who were made feel less than human because, they didn't conform to the \"ideal\", straight, love.40 years later, the haters are still with us however, thankfully their numbers are getting smaller. When this series is complete, I hope the numbers will be less.Excellent script, wonderful cast, great crew and sets, make this THE drama of 2021, even with stiff competition from other series currently running. Because this is still relevant today as it was 40 years ago; it strikes bare knuckle home, to everyone."
    },
    {
      "username": "sidney_amsterdam",
      "userUrl": "https://www.imdb.com/user/ur10544063",
      "reviewLink": "https://www.imdb.com/review/rw6663244",
      "warningSpoilers": false,
      "date": "5 March 2021",
      "rate": "10",
      "helpful": "35 out of 43 found this helpful.",
      "title": "My life",
      "content": "It about my own life, like many other older gaymen These mini series brought me back to my memories which are hidden deep inside my brain Shocking and wonderfully made 10 stars"
    },
    {
      "username": "atractiveeyes",
      "userUrl": "https://www.imdb.com/user/ur55939461",
      "reviewLink": "https://www.imdb.com/review/rw6637050",
      "warningSpoilers": false,
      "date": "26 February 2021",
      "rate": "9",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Great",
      "content": "This is a nice well made limited series. Although it's funny sometimes it's so sad, heartbreaking, emotional and tackles an important cause. Characters are all likable and the chemistry between them is so beautiful. Some frames and shots are stunning. A must see!"
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw6908601",
      "warningSpoilers": false,
      "date": "13 May 2021",
      "rate": "10",
      "helpful": "17 out of 23 found this helpful.",
      "title": "we must remember what happened",
      "content": "Everyone should see \"It's a Sin\". This story of a group of friends in England affected by the AIDS crisis gives a real glimpse into the lives of those impacted. I wasn't around when all this happened, but I've heard about what it was like. Definitely see it.Just like with the coronavirus pandemic, the US president was a celebrity who used fear of the \"other\" to get elected and then acted as if the pandemic wasn't happening."
    },
    {
      "username": "Gav-7",
      "userUrl": "https://www.imdb.com/user/ur0179384",
      "reviewLink": "https://www.imdb.com/review/rw6518987",
      "warningSpoilers": false,
      "date": "23 January 2021",
      "rate": "9",
      "helpful": "47 out of 65 found this helpful.",
      "title": "Amazing",
      "content": "It's A Sin had me bawling my eyes out. Such a moving , funny and compelling piece of work. So beautifully done and who wouldn't love a friend like Jill."
    },
    {
      "username": "leemcconn",
      "userUrl": "https://www.imdb.com/user/ur128725549",
      "reviewLink": "https://www.imdb.com/review/rw6523816",
      "warningSpoilers": false,
      "date": "25 January 2021",
      "rate": "10",
      "helpful": "167 out of 191 found this helpful.",
      "title": "10/10",
      "content": "So... I am known for my stone cold heart and lack of emotion. I cried like I had been dumped by the love of my life. Loved this show. Its a must watch."
    },
    {
      "username": "donnababe",
      "userUrl": "https://www.imdb.com/user/ur36799453",
      "reviewLink": "https://www.imdb.com/review/rw6523564",
      "warningSpoilers": false,
      "date": "24 January 2021",
      "rate": "10",
      "helpful": "39 out of 48 found this helpful.",
      "title": "Wow",
      "content": "I just sobbed uncontrollably into my boyfriends chest after finishing the last episode of this. It was an emotional rollercoaster, I laughed, I cried, I got angry. Beautifully written, beautifully performed. Beautiful!"
    },
    {
      "username": "kirstylibertine",
      "userUrl": "https://www.imdb.com/user/ur73874195",
      "reviewLink": "https://www.imdb.com/review/rw6519259",
      "warningSpoilers": false,
      "date": "23 January 2021",
      "rate": "10",
      "helpful": "67 out of 88 found this helpful.",
      "title": "Unmissable",
      "content": "THE best show I've seen in years ! Loved everything about it despite crying into my gin for the past 5 hours ."
    },
    {
      "username": "tm-sheehan",
      "userUrl": "https://www.imdb.com/user/ur25552762",
      "reviewLink": "https://www.imdb.com/review/rw6521341",
      "warningSpoilers": false,
      "date": "24 January 2021",
      "rate": "10",
      "helpful": "20 out of 30 found this helpful.",
      "title": "Brilliant Script Vibrant yet hard-hitting Drama",
      "content": "My Review - It's A Sin A Stan Production. My Rating 10/10Another brilliant series in 5 parts Created by Russell T. Davies one of the leading Television writers in the U.K. today. He specialises in intelligent emotional Dramas that often tell the story of the factual and fictional GLBTQI history as in his recent \"A Very English Scandal \"as well as the superb Dystopian series \"Years and Years \" plus Cucumber about modern gay life in Manchester and the original British series Queer as Folk. I had to write my review while the heartbreaking conclusion was still fresh in my mind . Don't be put off or think this is just another Gay movie because it's much more. It's the story of of a lost generation of talented, beautiful men who loved and lost their lives in the Pandemic of AIDS that was ignored by Politicians the World over until they realised it wasn't just a \"Gay Disease\". It's a very important as well as entertaining series for anyone who's grieved the loss of a friend or loved one and has an open mind to see and hear the true story of the ignorance and neglect that occurred in the decade of the 1980's by Margaret Thatcher and Ronald Reagan. We were more fortunate in Australia but that was mainly due to the actions of our GLBTQI Community and organisations like ACON and Bobby Goldsmith and the effective Public health Programs in place but we still lost 6507 men and 315 women. Margaret Thatcher attempted to block explicit, public health warnings about Aids because she feared the proposed descriptions of \"risky sex\" would do immense harm to young teenagers. Ronald Reagan, who died in 2004, was president for nearly five years before he said the word \"Aids\" in public, nearly seven years before he gave a speech on a health crisis that would go on to kill more than 650,000 Americans and stigmatize even more. There is a subtle silent tribute that I noticed in this series to Actor Ian Charleston who played Eric Liddell in the blockbuster film Chariots of Fire and died in 1990 of AIDS at age 40. Its a poster on the wall of the musical \"Guys and Dolls \" that he played Skye Masterson on stage in The West End in 1982. I'll put that on the Trivia page on IMBD where I post all my Reviews. After I've said what the subject matter of \"It's a Sin Is \"don't think it's all gloom and doom it's not there's nostalgia,a great Soundtrack and plenty of uplifting times in the lives of the characters to contrast with the sadness . The cast are all exceptional special standout mentions must be made for Olly Alexander as Ritchie Tozer who leaves his home on The Isle of White to be free and Gay in London ,Keeley Hawes as his doting overprotective mother in total denial of the true nature of her son . Her scenes in the conclusion of this series are now included among my best dramatic performances so far this year . It's further proof if proof be needed of Russell T. Davies script writing genius just remember Anne Reid's concluding scenes and speech in \"Years and Years.\" Then there's the solidarity and community of Ritchie's colourful mates Callum Scott Howell's as Colin Morris-Jones who also leaves home gets a job in Saville Row and is befriended and mentored by the Manager Henry Coltrane played beautifully by Neil Patrick Harris who sadly is in only the first episode. Lydia West as Jill Baxter is the best girlfriend a young gay man could have and Omari Douglas as the delightfully flamboyant Roscoe Babatunde who has a dalliance with wealthy closeted Politician Arthur Garrison played by Stephen Fry . \"It's a Sin \"is best described as a vibrant yet hard-hitting drama skilfully Directed by Peter Hoar . I urge everyone especially the current generation of Gay men ,who live in a time when HIV to some is viewed as the old generations problem and viewed as a condition that can be treated with a prognosis of longevity but on a cocktail of medications. Apathy and ignorance is causing some young men to practice unprotected sex with complete disregard to the consequences. This series was an especially emotional one for my life partner of 45 years and now my husband as it bought back the sadness of many visits to dying friends in St Vincent's Hospice , Prince Alfred AIDS ward and The Quarantine Coast Hospital . Also the many funerals of dear friends who's names Brian , David, Guy, James, Robert ,Wayne and many many more are etched forever in our hearts and minds. I gave Russell T Davies last series Years and Years a 9/10 I'm giving \"Its a Sin.\" a 10/10 as it resonated with us and moved us both to tears so that's reason for a perfect score in my mind.."
    },
    {
      "username": "mjanssens26",
      "userUrl": "https://www.imdb.com/user/ur13891183",
      "reviewLink": "https://www.imdb.com/review/rw6651072",
      "warningSpoilers": false,
      "date": "1 March 2021",
      "rate": "10",
      "helpful": "12 out of 16 found this helpful.",
      "title": "Touching, tragic and brilliant",
      "content": "This mini series gives younger viewers the chance to really re-live the horror and tragedy that was the early AIDS epidemic. One moment, you would be a handsome, healthy and fit individual and once AIDS hit, you could be gone within months. The performances and music and production in this series is brilliant. This show left me in tears but they were happy tears as I've realized how far the world has come and it's much for the better. A must see for all and destined to be a classic."
    },
    {
      "username": "ChRiS-803",
      "userUrl": "https://www.imdb.com/user/ur0555968",
      "reviewLink": "https://www.imdb.com/review/rw6529581",
      "warningSpoilers": false,
      "date": "26 January 2021",
      "rate": "7",
      "helpful": "51 out of 81 found this helpful.",
      "title": "Great Series, loved it but felt slightly short changed",
      "content": "Important mini series Told with beautiful heart and soul. Acted with immense force (Lydia west a clear standout)Three things prevent it from a perfect 10it felt rushed. It needed to have a Few more episodesthe lead isn't as sympathetic or likeable as the writers think he is. At times he's a spoilt brat and even his emotional scenes feel a bit forcedso not a single of them had a hairstyle change or aged in many many many years? How hard was it for them to look different, they continued to look the same every few years..."
    },
    {
      "username": "manschelde-1",
      "userUrl": "https://www.imdb.com/user/ur2611297",
      "reviewLink": "https://www.imdb.com/review/rw6518605",
      "warningSpoilers": false,
      "date": "23 January 2021",
      "rate": "9",
      "helpful": "31 out of 45 found this helpful.",
      "title": "satisfying emotional drama",
      "content": "Satisfying emotional drama that covers around 10 years in an imagined London between 1981 and 1991 , via five rushed episodes.It was filmed in Manchester, so it just does not look like London. It was slightly odd that it showed \"Gay News\" and \"London Gay\" (? never heard of that one) newspapers instead of the \"Capital Gay\" which was the London weekly rag of those years in the bars and clubs of London. The music was a tad naff, being many great chart hits and rather fewer of the non-charting hyper Hi-NRG that was all the rage at the time for London clubs. But those are minor quibbles.For men who lived through that period, and held dying partners and friends as the virus ravaged them, it is a a brief and nostalgic view back , with hard hitting lines from the female roles especially at the end. It could easily have been a 12 part or 24 parts in 2 series.As a survivor of those times, I was worried that I would be disappointed, but I'm delighted to say kudos to Mr Davies, because this piece just works on several levels. Recommended."
    },
    {
      "username": "pxjvnc",
      "userUrl": "https://www.imdb.com/user/ur128666616",
      "reviewLink": "https://www.imdb.com/review/rw6517452",
      "warningSpoilers": false,
      "date": "23 January 2021",
      "rate": "10",
      "helpful": "63 out of 79 found this helpful.",
      "title": "Awesome viewing!!",
      "content": "Another masterpiece by Russell T Davies...in my opinion, probably his best yet!! Binge watched the whole lot in one session as i couldn't drag myself away. It's beautifully written, well acted and factually correct. It will make you laugh out loud and also make you cry...lots in my case. Sit back, relax and enjoy this true treasure of a drama...oh and keep the tissues handy."
    },
    {
      "username": "jordanjanssen",
      "userUrl": "https://www.imdb.com/user/ur65368207",
      "reviewLink": "https://www.imdb.com/review/rw6520079",
      "warningSpoilers": true,
      "date": "24 January 2021",
      "rate": "9",
      "helpful": "24 out of 32 found this helpful.",
      "title": "Wonderful story",
      "content": "Russell T Davies does it again!Just for reference, GRID referenced in either episode 1 or 2 was the previous name for AIDS and it stood for Gay Related Immunodeficiency Disease.Russell delivers a show with fantastic highs and depressing lows. He takes us from the highs of discovering the Scene in London, to the lows of the multiple deaths of AIDS related illnesses and the treatment meted out to the gay community by other people and the authorities.I wish Russell had been able to make this back in the day instead of QAF, but I've read the interviews and I understand his reasoning.The acting is top notch, there is the occasional \"too good to be true\" moment, but that's forgivable.Olly Alexander was a revelation - I've only seen him on Gogglebox and his Years and Years music videos previously. I'm now going to have to watch him in Skins.Keeley Hawes (the new actor who's in EVERYTHING, taking the crown from Olivia Coleman!) was brilliant as Richie's mum. A fussy, uptight woman who occasionally meant well, but often a bit of a cow.You'll want to binge watch this in one go. You'll then be crying out for a second series (possibly linking it to QAF?). Would be great to see a young Vince and Stuart having a trip to London and bumping into the cast of It's A Sin!"
    },
    {
      "username": "draco_joel",
      "userUrl": "https://www.imdb.com/user/ur24694579",
      "reviewLink": "https://www.imdb.com/review/rw6521392",
      "warningSpoilers": false,
      "date": "24 January 2021",
      "rate": "10",
      "helpful": "28 out of 36 found this helpful.",
      "title": "It's honesty is terrifying in it's beauty",
      "content": "The characters, the story, the words: could not be more perfect or beautiful. This show will make you grin and cry at the same time."
    },
    {
      "username": "philadams-98723",
      "userUrl": "https://www.imdb.com/user/ur71519790",
      "reviewLink": "https://www.imdb.com/review/rw6522365",
      "warningSpoilers": false,
      "date": "24 January 2021",
      "rate": "10",
      "helpful": "20 out of 28 found this helpful.",
      "title": "The most EPIC & OUTSTANDING production!",
      "content": "We binged this in 2 days & have to say it is one of the most awesome & brilliant tv shows on at the moment. You are taken on a roller coaster ride of emotions thru 1980s London. The experience of 5 friends who battle the AIDS crisis is just so well done, it is a masterpiece. The acting, characters, music & story is recreated to perfection. Do not miss this important & incredibly fantastic tv series."
    }
  ],
  "errorMessage": ""
}