{
  "imDbId": "tt0052520",
  "title": "The Twilight Zone",
  "fullTitle": "The Twilight Zone (TV Series 1959–1964)",
  "type": "TVSeries",
  "year": "1959",
  "items": [
    {
      "username": "Snow Leopard",
      "userUrl": "https://www.imdb.com/user/ur1174211",
      "reviewLink": "https://www.imdb.com/review/rw0957139",
      "warningSpoilers": false,
      "date": "4 November 2004",
      "rate": "",
      "helpful": "151 out of 159 found this helpful.",
      "title": "When It Worked, No TV Show Was (Or Is) More Imaginative",
      "content": "Rod Serling's distinctive approach gave \"The Twilight Zone\" a unique character that will always keep it among the best-remembered of all classic television shows. Not only that, but it set high goals for itself, and it took a lot of chances - and not chances in the phony, trivial sense in which a lot of more recent series \"take chances\" by resorting to unnecessarily provocative or indecent material that actually guarantees them attention and acclaim.\"The Twilight Zone\" took chances by experimenting with many different kinds of stories and material, and by aiming to provide high-quality entertainment while simultaneously giving you something to think about. As a result, there were a few episodes that didn't quite click, and that seem odd or even dull. But when it worked - as it did a great deal of the time - no television show then or now was more imaginative.In a short review, it would be impossible to list all of the memorable episodes, or even to cover the full range of the kinds of material that it used. There were chilling episodes like \"To Serve Man\", which is often remembered by those who saw it decades ago, and there were thought-provoking episodes like \"In the Eye of the Beholder\", which was also imaginatively filmed.Many episodes relied primarily on a well-written and well-conceived story, while others, like \"The Invaders\", relied heavily on excellent acting performances (in that case, by Agnes Moorehead). There were occasional light-hearted episodes like \"Once Upon a Time\", which was also a nice showcase for the great Buster Keaton.It's too bad that these anthology-style series went out of fashion, because a number of them were of high quality. This one, in particular, stands well above its subsequent imitators. The best science fiction, like the best of any genre or art form, appeals to the imagination, not to the senses, and imagination is what \"The Twilight Zone\" was all about."
    },
    {
      "username": "zkonedog",
      "userUrl": "https://www.imdb.com/user/ur7826013",
      "reviewLink": "https://www.imdb.com/review/rw5889177",
      "warningSpoilers": false,
      "date": "7 July 2020",
      "rate": "10",
      "helpful": "34 out of 36 found this helpful.",
      "title": "Far Ahead Of Its Time And Still Relevant Today",
      "content": "Just recently, I finished a kick of re-watching all 156 episodes of the original Twilight Zone series. If I were to average out all my individual episode rankings, that number would probably fall between 7-8 stars. Yet, when looked at as a whole rather than the sum of its parts, The Twilight Zone is 10/10 all the way.When TZ is hitting on all cylinders, it is easily one of the greatest anthology pieces ever produced. The lion's share of the credit here goes to show creator and writer Rod Serling, who is truly one of the most inspired individuals to ever put pen to paper in screenplay format. The deeper themes about society or humanity are just as relevant now (if not sometimes more so!) than they were upon original airing.It absolutely astounds me that this show premiered in 1959. That was ten years before the moon landing! I can't imagine what my grandparents would have thought about a show like this, dealing with space travels, aliens, and all manner of oddities hardly a decade removed from the Second World War and firmly in the Cold War.Like I said, the best TZ episodes are treasures that will be enjoyed and studied for decades to come. Does the show have its share of clunkers? Of course. But only a true handful of episodes are truly bad. The others largely depend on personal sci-fi tastes or the time-period in which they are viewed.About the only reason I would even consider dropping this from a perfect ranking is the fourth season of the show, which produced hour-long episodes. Those efforts aren't bad, per se, but are simply padded with dialogue to fill time rather than written for a longer runtime, for the most part.When taking the long view, however, The Twilight Zone firmly resides in my top-five television programs of all-time. Despite premiering well before it could fully be appreciated, having to deal with the inane TV standards and practices of the era, and being constantly underfunded, Serling managed to keep everything afloat and write some of the best multi-genre material ever seen on the small screen. Whether comedy, mystery, horror, sci-fi, human drama, or any other genre is your game, you'll likely find something to enjoy in the breadth of The Twilight Zone."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw1123555",
      "warningSpoilers": false,
      "date": "10 July 2005",
      "rate": "",
      "helpful": "55 out of 64 found this helpful.",
      "title": "You've just crossed over into...",
      "content": "I would assume that everyone knows \"The Twilight Zone\"'s theme song, and recognizes Rod Serling's monotone explanations of how the given character has just crossed over into the Twilight Zone. I'm not sure which episode is my favorite. There's \"Nightmare at 30,000 Feet\", in which William Shatner sees a monster tearing at an airplane wing, and there's also \"Time Enough at Last\", where Burgess Meredith plays a bookworm who gets enough time to read as much as he wants...or does he? Or, it might be another episode. But no matter. \"The Twilight Zone\" never ceases to impress me. Even the 1983 movie was pretty interesting, not something that many movies based on TV shows accomplish. You should try to see the show."
    },
    {
      "username": "yarborough",
      "userUrl": "https://www.imdb.com/user/ur1380543",
      "reviewLink": "https://www.imdb.com/review/rw0066803",
      "warningSpoilers": false,
      "date": "7 December 2002",
      "rate": "",
      "helpful": "114 out of 123 found this helpful.",
      "title": "A Show of Depth Well Ahead of it's Time",
      "content": "\"The Twilight Zone\" brought a complexity and maturity to television that had never existed before and probably hasn't been seen since. The stories were always ironic, briliant, and fascinating, and they often came with a moral lesson. Episodes like \"A Kind of a Stopwatch\", with Richard Erdmann, \"Time Enough At Last\", with Burgess Meredith, \"Nightmare at 20,00 Feet\", with William Shatner, and \"Where is Everybody,\" with Earl Holliman, dove into concepts and situations no other show would have even touched. The entertainment brought on by \"The Twilight Zone\" was as vast as the Zone itself. Its principal writers, Sterling, Beaumont, and Matheson, were the best of their era. For sheer television entertainment, nothing compares to the brilliant, heavyweight stories of \"The Twilight Zone.\" TO be frank, \"The Twilight Zone\" was the first show that didn't insult the viewer's intelligence."
    },
    {
      "username": "Agent10",
      "userUrl": "https://www.imdb.com/user/ur1696608",
      "reviewLink": "https://www.imdb.com/review/rw0066798",
      "warningSpoilers": false,
      "date": "23 July 2002",
      "rate": "",
      "helpful": "65 out of 77 found this helpful.",
      "title": "Tucson, AZ",
      "content": "Whatever incantation, whatever form, whatever decade, this show has managed to intrigue and defy logic with its use of imaginary story lines and ideas, mixing a palate of intrigue and genius to allow the common viewer to become engrossed in the weirdest television has to offer. While the original series was cheesy at some points, this show was always different, always something to look forward to in regards to the eeriness it created. Rod Serling helped usher in a generation of paranoia and science fiction thanks to this groundbreaking show, and I'm thankful for this. I could only imagine what the world would be like if all we had were terrible dramas and average sitcoms filling the airwaves. This show will rank as one of the best in my book, no matter what people say."
    },
    {
      "username": "dougdoepke",
      "userUrl": "https://www.imdb.com/user/ur10348034",
      "reviewLink": "https://www.imdb.com/review/rw1401234",
      "warningSpoilers": false,
      "date": "24 June 2006",
      "rate": "",
      "helpful": "12 out of 13 found this helpful.",
      "title": "A Quiet Revolution",
      "content": "In 1959, network TV was dominated by pretty-boy detective shows (77 Sunset Strip; Hawaiian Eye), law & order westerns (Gunsmoke; Have Gun, Will Travel), and innocuous sitcoms, (Ozzie & Harriet; Leave It to Beaver; The Donna Reed Show). If little else, most of these were entertaining in a blandly narcotizing way. TV producers may have wanted to experiment, but were hamstrung by a production code that was even more restrictive than the notorious motion picture code (crime must not be rewarded; moral transgressors must be punished; the sexes must not be shown in the same bed, etc.). Perhaps more important, producers were strait-jacketed by sponsors who insisted that programming should be as inclusive as possible so as not to risk offending or \"confusing\" any segment of the audience-- all the better, of course, to sell the sponsor's product, a not unreasonable requirement, given TV's commercial basis. I mention this background, because it's hard to appreciate the cultural significance of Serling's Twilight Zone without it. For the above restrictions inevitably produced a product that was almost uniformly bland, superficial, and, by most accounts, boringly predictable-- (One near exception was the series from that sly old subversive, Alfred Hitchcock.) But pity the poor writers who week after week had to search for fresh water in the middle of this much traversed desert. Because of the conformist approach, two of the biggest casualties were, not unnaturally, Reality and Imagination. For rarely did any of these shows demonstrate even a nodding acquaintance with reality as most of us live it, while what imagination was shown was, of course, channeled into safe variations on the usual. I think many of us old enough and imaginative enough at the time, knew that network programming could be a lot better than what FCC Commissioner Newton Minnow characterized as TV's \"vast cultural wasteland\". Obviously, it would be a great overstatement to view The Twilight Zone as a magic cure for this blighted situation. But, Serling did boldly and persistently set out to challenge the blandness, and in the process prepare the way for greater offbeat programming. Of course, TZ never claimed to introduce 'reality' into a weekly series-- that would come later with 1971's All in the Family. However, Serling did insist upon that other missing ingredient, 'imagination'-- and by the bucket loads. How well I remember that 1959 evening when I tuned in \"Where Is Everybody?\", the series' pilot and first installment-- Earl Holliman wandering through a mysteriously deserted town, running smack-dab into a mirror, and winding up in a plausibly topical outcome. I expect many others besides myself were bowled over by the novelty of what we had seen. A whole new world of what TV could be opened up, thanks to Serling, and his success in getting sponsors to take a chance on an innovative concept. Even more happily, was the promise of more to come.Sure, few of the following episodes reached the riveting level of that first installment, at least in my book. But rarely did an entry completely disappoint. Then too, after the first couple of years, the quality dropped off as scripts began buckling under the weekly pressure by falling back on old material for new variations. However, such classics from the first year as \"Walking Distance\", \"And When the Sky Opened\", and \"The Hitch-Hiker\" are among the finest dramatizations of the supernatural ever to appear on TV, and hold up as well today as in that long ago black-and-white. Of course, Serling shouldn't get all the credit. As other reviewers point out, authors such as Charles Beaumont and the greatly under-rated Richard Matheson contributed much to the series' classic standing, as did the often overlooked producer Buck Houghton and director Douglas Heyes. Still and all, it was D-Day paratrooper Serling who exhausted himself in the struggle to deliver three key qualities always in short supply on public airways-- intelligence, innovation, and insight. And for that, those of us graybeards who still enjoy a re-run or two, will always be ready with a tip of the hat to the squinty-eyed gentleman with the cigarette and the powerful belief in the liberating role of imagination."
    },
    {
      "username": "phantom_tollbooth",
      "userUrl": "https://www.imdb.com/user/ur0824342",
      "reviewLink": "https://www.imdb.com/review/rw1604292",
      "warningSpoilers": false,
      "date": "21 February 2007",
      "rate": "8",
      "helpful": "28 out of 31 found this helpful.",
      "title": "A Dimension of Mind",
      "content": "The concept of 'The Twilight Zone' grabbed me immediately. Rather than a simple collection of supernatural tales designed to give us the willies, Rod Serling set out to utilise the often underrated medium of Science Fiction and Fantasy to put forward his social commentary on mankind. Serling's early straight drama scripts had been cut to shreds by the networks whose main concerns were keeping the sponsors happy and not offending potential viewers. This came at the price of quality entertainment and, despite the worthy targets of the scripts, it was more important for the bosses to ensure their funding was secure than it was to produce socially conscious programmes. However, by using a genre that was generally considered to hold little creative value, Serling managed to slip plenty of subversive social and political satire past the censors without them picking up on it. This was the sort of materiel that, in the 1950s, would never have made it to the screen unveiled. It exposed corruption in authority figures, it exposed the sort of weaknesses inherent in mankind that American networks are still so unwilling to portray in their country's citizens. By adding in a supernatural element Serling could suddenly comment on whatever he wanted. To the networks it was a sci-fi show, a bunch of far fetched stories about unusual people. In actuality, it was about all of us. Often the supernatural element figured far less heavily in the story than the social element. Serling's wonderfully melodramatic, wordy scripts focused squarely on his characters rather than just utilising them as two dimensional pawns overwhelmed by the story. People, their thoughts, choices, behavioural patterns and emotions were the story.Just as compelling was the nature of the twilight zone itself. Although Serling offers us a long spiel at the beginning of each show describing the zone, it is purposefully vague so as to not erase the mystery. All we know is that entering the twilight zone causes things to take a turn for the unusual but in exactly what way is impossible to tell until you're in the thick of it. This is because the nature of the zone is so elusive. Sometimes it is a God like force which metes out justice or teaches characters a lesson. However, the zone's sense of justice is often distinctly skewed. Although corrupt, violent, generally unpleasant people get their comeuppance in the zone more often than not, being a good, honest, benevolent person is no guarantee that you won't end up with the rough end of the stick. This is what makes The Twilight Zone such a fascinating watch. You don't know what sort of mood the zone will be in from episode to episode. Sometimes it takes active control, rewarding the good and punishing the bad; sometimes it takes a step back after having set things in motion and simply observes the outcome; sometimes, in what often prove to be some of the best episodes, the zone unleashes its sick sense of humour on an unsuspecting innocent (the most notable example of this being 'Time Enough At Last'). It's even possible for the zone to contradict itself, such as the back to back episodes 'The Sixteen-Millimeter Shrine' and 'Walking Distance', which offer two very different outcomes for characters who long to return to their pasts.More than ably assisting Serling are several other regular writers, most notably Charles Beaumont and Richard Matheson. These two writers turned in many of the very finest episodes of the series and proved to be more consistently reliable than Serling (although, to be fair to Serling, they did not contribute nearly as many scripts to the show as he did). Less inclined to lapse into broad, cartoonish comedy or over-sentimentality, Matheson and Beaumont turned in some of the most famous episodes (\"Nightmare at 20,000 Feet\") and some of the most undervalued (\"Perchance to Dream\"). Matheson was to be admired for his taut plotting, strong characterisation and convincing dialogue while Beaumont frequently came up with the most intriguing (\"Miniature\", \"Passage on the Lady Anne\") and plain horrific (\"Long Live Walter Jameson\", \"Perchance to Dream\", \"The New Exhibits\") concepts.Of course, as is the case with virtually every anthology show, some episodes of The Twilight Zone were better than others while some were just downright awful (check out the likes of \"The Mighty Casey\", \"The Whole Truth\" or \"Mr Dingle, The Strong\" for just a few examples) but when it got it right, the result was frequently magical. These beautifully made stories in gorgeous, crisp black and white, continue to thrill, delight and disturb me with each viewing. Rod Serling's mysterious but lovable humanitarian host is a hard man to refuse and when he asks me to step into the twilight zone with him, I rarely refuse."
    },
    {
      "username": "NuRhyme",
      "userUrl": "https://www.imdb.com/user/ur0359153",
      "reviewLink": "https://www.imdb.com/review/rw0066771",
      "warningSpoilers": false,
      "date": "23 July 1999",
      "rate": "",
      "helpful": "173 out of 183 found this helpful.",
      "title": "The true beginning of modern Science Fiction",
      "content": "Wow! Where should I start? \"The Twilight Zone\" is arguably the greatest science fiction television show ever! Almost every single episode is a masterpiece of modern Sci-Fi. I feel \"The Twilight Zone\" is responsible for the way we view science fiction today...provocative, strangely eerie, and wildly entertaining. The shows creator and writer, Rod Sterling, was a master of creating a show that caused you to stop and think, re-examine reality, consider the impossible, check the closet before going to bed, and sleep with the lights on! I watched this program religiously as a child. Every Saturday night I had to bribe my little brother to stay up and watch \"The Twilight Zone\" with me because I was afraid to watch it alone. It came on at 11:00 p.m. By 10:45 my little brother was sound asleep with chocolate smeared around his mouth, and I would be alone, curled in a blanket, awaiting the next spine tingling episode. I was never disappointed. By the time it went off, I would usually be sitting there alone...in a comatose-like daze, staring at the static on the television screen, too afraid to turn it off because to do so would ensure that you met with some hideous fate similar to the one you just saw earlier. \"The Twilight Zone\" was also a spring board for many young and talented actors/actresses during its run from the late 50's well into the 60's.Thanks to mail order companies, I have ordered and received every single episode of \"The Twilight Zone\"! It would be impossible for me to say which episode is my absolute favorite because I loved so many. But a couple do stick out in my mind. They are \"Time Enough At Last\" and \"Eye Of The Beholder\". If you've never watched this wonderful example of television at it's best, I plead with you to check it out. It can be found on the Sci-Fi channel as well as various other stations via cable T.V. There's no sex, no foul language, and no graphic violence. But you will find a solid plot, famous actors/actresses years before before they became famous, and a story with a very surprising twist at the end that will leave a smile on your face, or, a cringe as you wake up your someone else in the house to turn off the T.V."
    },
    {
      "username": "CatfishOpinions",
      "userUrl": "https://www.imdb.com/user/ur117635500",
      "reviewLink": "https://www.imdb.com/review/rw5696500",
      "warningSpoilers": false,
      "date": "1 May 2020",
      "rate": "9",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Spookiness + 60s + Anthology series = the best damn thing ever",
      "content": "This show never gets old. It ages extremely well. The psychological horror of this is SO much better than any CGI horror you'll see these days. Every episode (or at least all the good ones) have a spooky element or something out of the ordinary, a twist ending, and a moral or something to think about. There are so many of these that are just, SO GOOD. Rod serling is a greek god. tres bien."
    },
    {
      "username": "Victor Field",
      "userUrl": "https://www.imdb.com/user/ur0290901",
      "reviewLink": "https://www.imdb.com/review/rw0066812",
      "warningSpoilers": false,
      "date": "18 April 2003",
      "rate": "",
      "helpful": "12 out of 14 found this helpful.",
      "title": "If ever a series deserved to be called \"classic,\" this is it.",
      "content": "In Joel Engel's biography of Gene Roddenberry (an indispensable tome for anyone interested in the main names of American television, and remarkably less worshipful than the Great Bird's official life story), he relates how Roddenberry boasted that he had brought more of himself to \"Star Trek\" than Rod Serling had to \"The Twilight Zone.\" The fact is, though Roddenberry and Serling are among the few TV writers to be genuine household names, Roddenberry can't really have all the credit for \"Star Trek\" - but in spite of the involvement of the likes of Richard Matheson, Rod Serling WAS \"The Twilight Zone,\" writing close to two-thirds of the series and narrating every show.Say what you will about the UK offshoot of the Sci-Fi Channel, but they've done us a great service in their airing and reairing of most of the episodes (following its ragged treatment on terrestrial television). Of course there are some poor episodes - \"Once Upon A Time\" is painful, as are most of the videotaped episodes (shot to save money, but even Serling objected) - but when you've got more than 150 shows you're going to get a few; and Stephen King's fairly offhanded review of it in \"Danse Macabre\" (which seems to have influenced at least one comment here - though not a direct lift, too many aspects of it directly parallel King's words) is thrown into stark relief by his own attempts at writing for television - \"Storm of the Century\" was a three-parter that failed to compel me to return after the first part.Like \"The Simpsons,\" this is one of the very few series that richly deserves its endless repeats since it went off the air - accept no 1980s revival (or even a 2002 one), and the movie can be ignored as well; the monochrome episodes are the real deal. With the scope that only an anthology can give a series, the Twilight Zone encompassed comedy, horror, romance, mystery, the works - with the central character receiving his or her well-deserved comeuppance, or getting another chance, or getting a life-changing lesson. Even when you know what's coming in the renowned twist endings, the shows can be watched over and over; the heartbreaking romance between Jack Warden and a robot in \"The Lonely\" (\"I must remember that. I must remember to keep that in mind.\"), the vile family who find that \"The Masks\" have changed their lives forever, Roddy McDowall's discovery that even on Mars \"People Are Alike All Over,\" the \"Nervous Man In A Four Dollar Room\" who emerges victorious against himself...In every aspect from storytelling to acting to music, you can see how this made Serling's name; even some overly theatrical dialogue can't ruin it. One of the few shows still airing in this country that's almost as old as \"The Phil Silvers Show,\" long after Sci-Fi's dropped \"Farscape,\" \"The Dead Zone,\" \"Sir Arthur Conan Doyle's The Lost World\" and the rest, people will still be visiting... the Twilight Zone."
    },
    {
      "username": "marcus_stokes2000",
      "userUrl": "https://www.imdb.com/user/ur3361091",
      "reviewLink": "https://www.imdb.com/review/rw1456826",
      "warningSpoilers": true,
      "date": "24 August 2006",
      "rate": "10",
      "helpful": "18 out of 22 found this helpful.",
      "title": "You Are Now Entering The Best Anthological TV Show There Is... The Twilight Zone.",
      "content": "*SPOILERS for some episodes* This TV Show is the Big Daddy of shows like 'The Outer Limits (both versions)', 'The Hunger', 'Night Visions', 'Nightmare Cafè' and has also spawned two re-adaptations, one in 1985 and another in 2002, two movies... yet a lot of people can only think of 'The Twilight Zone' as 'weird', especially a lot of people my age (I'm 21).It's not just that; it's also a good way to do social commentary without having to change your script for some idiotic reasons (in one of his precedent scripts, he was forbidden to let a character commit suicide because one of the sponsors, an insurance company, said there were a lot of troubles with insurances in case of suicide - one of the most asinine reasons from a network for a rewrite EVER); this is evident in episodes like 'Maple Street'.Others just speak about the hopes, dreams and let's not forget the FEARS and DESIRES of being human, as we watch a man with amnesia wander, scared and lost, through a town devoid of people, or a depressed drunkard gunslinger not wanting to do anymore what's a master of - but that has also thrown him into full-blown alcoholism and depression, or a hypochondriac, selfish to a fault man achieve immortality and then ending up getting 'Life Without Parole', or an aging, deluded actress achieving her dream of being back into her movies (literally), or a man taking a journey through the past and meeting himself as a kid, or Talky Tina, Chucky's grandmother ('I am Talky Tina, and I am going to kill you').With a guest star cast which counts, among the many, Robert Redford, Charles Bronson, Earl Holliman, Dan Duryea, Dick York, Ed Wynn, Robert Duvall, Telly Savalas, Ida Lupino and many others, 'The Twilight Zone' will keep on being my 'next stop'.Twilight Zone: 10/10."
    },
    {
      "username": "evildead1978",
      "userUrl": "https://www.imdb.com/user/ur2920044",
      "reviewLink": "https://www.imdb.com/review/rw0975181",
      "warningSpoilers": false,
      "date": "9 December 2004",
      "rate": "",
      "helpful": "55 out of 66 found this helpful.",
      "title": "The signpost up ahead...",
      "content": "It is completely impossible to narrow down the best episodes of this classic TV series...everything about it (writing, acting, production values) is leaps and bounds above anything around today! That being said, since the Christmas season is approaching, Serling made two holiday episodes that are worth taking the time to watch all over again: \"The Night of the Meek\" with Art Carney and (my personal favorite) \"The Changing of the Guard\" with Donald Pleasance. Both are timeless classics, and show a very sentimental side to the Twilight Zone...Every year at the holiday season I like to sit back and take these episodes in; they get better and better with each repeated viewing! Merry Christmas & Enjoy!"
    },
    {
      "username": "Tornado_Sam",
      "userUrl": "https://www.imdb.com/user/ur75224754",
      "reviewLink": "https://www.imdb.com/review/rw5968635",
      "warningSpoilers": false,
      "date": "5 August 2020",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "One of the Best in All Television",
      "content": "\"The Twilight Zone\" is one of the classic old shows that will never die and that still has a big audience today, thanks to having stood the test of time. It is often recognized as the beginning of science-fiction in television, which is certainly indisputable looking at the ideas some of the episodes explored. However, this series is not only science-fiction - it also falls into the category of horror, the episodes of this genre working better than the sci-fi ones for me due to not being a huge sci-fi fan (although whatever genre the episodes explored, I was game). We are not talking about the modern, overly graphic and violent horror either, but the more suggestive horror that was primarily used in the day. The implied is often better than the overt, and while both have their place, the former tends generally to be more conceptually interesting due to leaving more food for thought for the viewer to digest. It is this very concept that makes the show work in its strange stories and odd plot twists, and that has continued to make it a classic throughout the years.It is really incredible to think that \"The Twilight Zone\" ran only five years while other shows just as great ran even longer. The series could have probably continued for a couple decades if they had let it - due to a lack of consistent characters in the show as a whole. \"The Twilight Zone\" is without a single premise featuring true 'stars': each episode is its own distinct story, and all of them are absolute masterpieces. Sometimes, the episodes are more like ghost stories; other times, they deal with well-known scientific concepts like space travel to other planets; while others still are just plain odd. Only one character in each half-hour episode remains consistent: the narrator, Rod Serling, who introduces in a masterful voice-over the premise at the beginning, and provides a spine-tingling final narration that leaves the viewer wondering as to what really happened. The icing on the cake is this, and it brings each episode to a perfect close every time.The stories are always brilliant and masterfully written, the acting superb, and the building suspense always terrific. Well-known episodes include \"Nightmare at 20,00 Feet\", \"Living Doll\", and \"The After Hours\", to name a few. They are just about perfect, each one being a solid entry to the series, and I have yet to see an episode that I didn't think was brilliant (though I am aware there were a few people consider to be poorer ones). Each one keeps the audience engaged to the end, all the way up to the final twist that leaves them to guess what really happened. As stated above, I tend to favor the horror ones over the sci-fi, but all of them are outstanding overall, each one a masterpiece in television history.All in all, \"The Twilight Zone\" is one of the greatest shows in television history ever made - it keeps the viewer thinking with brilliant stories, and does so without explicit or graphic material that today tends to be Hollywood's trademark. It is by implication that the episodes work, not by shocking the audience with imagery that solves the puzzle for them. It is because of this aspect alone that has caused it to be remembered even now, and also the reason why it is actually better than most shows today - too bad film companies are too much into violence, language and sex to take a lesson from Rod Serling. This is the kind of television we should be mainly be seeing today, so catch it on MeTV while it's still being aired."
    },
    {
      "username": "ratboy7a",
      "userUrl": "https://www.imdb.com/user/ur1175812",
      "reviewLink": "https://www.imdb.com/review/rw0066783",
      "warningSpoilers": false,
      "date": "11 May 2001",
      "rate": "",
      "helpful": "82 out of 97 found this helpful.",
      "title": "IT'S A COOKBOOK!!!",
      "content": "There is probably no one who doesn't remember the Twilight Zone and have a favorite episode. I was 11 or 12 and so many of the episodes stick in my mind. Many friends and co-workers are similarly afflicted. When a group of us are discussing the woes of commuting, someone is sure to suggest that they get off at Willoughby. Stuck in a long line for whatever, with the beginning of the line no where in sight - someone might rant \"It's a cookbook!\". We laugh now but some episodes gave us cause for concern.Did you ever notice how many 50's, 60's and even 70's tv shows are represented by the guest cast of TZ? Gilligan's Island, Bewitched, Star Trek, Lost In Space, Beverly Hillbillies, The Farmer's Daughter, Dobie Gillis, My Three Sons, Batman, Big Valley, The Bob Cummings Show, My Favorite Doll (or is that My Living Doll - Julie Newmar plays a robot), Honey West, Police Woman, The Odd Couple and who knows how many more!What a series - serious actresses like Ida Lupino and Agnes Moorehead and clowns like Don Rickles. Big screen names like Mickey Rooney and Charles Bronson. Lost In Space is represented by Johnathan Harris, Billy Mumy (numerous appearances -and its a good thing you did,Anthony) and Angela Cartwright. Batman has Adam West, Julie Newmar and the great Burgess! You have a James Bond villain (Joseph Wiseman) and the first James Bond himself (for the really entrenched trivia fans - I'm not telling you who he is but it ain't Connery).An earlier commenter put it best - this show bred most of today's horror, suspense and occult films."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw2525088",
      "warningSpoilers": false,
      "date": "28 November 2011",
      "rate": "10",
      "helpful": "9 out of 12 found this helpful.",
      "title": "The Series That Will Never Die",
      "content": "I don't think that any television series so personally bore the stamp of its creator than the original The Twilight Zone. There isn't anyone I know, especially from my age bracket who used to see this show on Friday at 10:00 pm that doesn't remember it and have some particularly favorite episodes.Rod Serling who did the scripts for such diverse films as Patterns and Requiem For A Heavyweight was the creator and host of The Twilight Zone. Even Alfred Hitchcock in his television anthology series only personally directed a small percentage of the shows. But every Twilight Zone story bore the personal imprint of Serling.The quality was uniformly excellent in each episode, you might like one better than another because some favorite player of your's was in it, but they were all good. I can't think of another show I can say that about.In The Twiight Zone world that he created Rod Serling also saw that justice of a sort was meted out. Not anything man could quantify, but something that a ruling intelligence with a sense of humor showing sometimes meted out.With cable now, even these old black and white episodes run all the time on some channel. And I think they will for centuries."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2273969",
      "warningSpoilers": true,
      "date": "4 July 2010",
      "rate": "10",
      "helpful": "10 out of 14 found this helpful.",
      "title": "One of the greats...",
      "content": "When you think of the truly great shows in television history, it's hard not to think of \"The Twilight Zone\". Not only did it have exceptional writing and acting, but it also has taken on a cult-like devotion--and deservedly so.My score of 10 is for the overall quality of the show. Some of the shows were simply brilliant--perfect in just about every way (\"To Serve man\" and \"The Monsters Are Due on Maple Street\"). Now this does NOT mean that there aren't a few dud episodes--this is true of just about every series. However, the truly crazed fans of this or any other cult show often won't admit that there were a few sad ones thrown in (such as \"The Bewitchin' Pool\" and \"Black Leather Jackets\"). But, taken as a whole, this show was brilliant and amazingly watchable today--and probably the best analogy show of all-time--and this would include the terrifically underrated \"Outer Limits\". A must for anyone who considers themselves a TV addict!"
    },
    {
      "username": "dataconflossmoor",
      "userUrl": "https://www.imdb.com/user/ur1855181",
      "reviewLink": "https://www.imdb.com/review/rw1161915",
      "warningSpoilers": true,
      "date": "30 August 2005",
      "rate": "",
      "helpful": "72 out of 107 found this helpful.",
      "title": "Stop At Wiloughby!!",
      "content": "This episode begins in the foyer of Mr Williams' personal and professional fatigue...This dilemma transcends the cumbersome nuisance of an encroaching mid-life crisis..It is far more fatal!!..Mr Williams is cannonaded by being under constant scrutiny at his high profile job, and this undue stress takes a toll on his physical health as well as his mental resolve...Pressure from all sides has made Williams acutely aware of his actual breaking point...This Twilight Zone episode brilliantly depicts how a man who has sophisticated Connecticut suburbia by the throat can be the well deserved recipient of self deprecating pity!!As Williams is returning home from work one evening, he falls asleep and has a dream about a town called Wiloughby...In this dream the train stops at a town named Wiloughby, which is a quaint little town in the late 1800's...Wiloughby \"Where a man can live his life full measure\".. Wiloughby is a simplistic and serene utopia.. Small town America in the late 1800's?.. No flu shots, no air conditioning, no television, abhorrent racial intolerance and non-refrigerated food!!..yet for Williams, Wiloughby represents an innocence and happiness that is right out of a Currier and Ives painting!!When Mr Williams arrives home, he tells his wife about his dream!!! Let's first meet the wife...She is a preoccupied virago who is consumed by material accoutrement as a way of flaunting accomplishment and success...Her brow beaten husband's accomplishment and success!! It is Chateaubriand every Friday at the Country Club and clothes from Peck and Peck just to brandish a badge of prestige, her avaricious nature is solely for the purpose of nurturing the shallow virtue of vanity!!As the husband explores the conundrum of climbing the corporate ladder, the wife merely purports her husband's social isolation and emotional neglect and relegates it to indignant and precocious whining...She perceives the town he manufactured in a dream called Wiloughby, as an escapist panacea which serves as a subterfuge for averting the reality of executive level competition!!Returning home once again, Mr Williams has a dream about Wiloughby and now he is determined to get off the train and visit Wiloughby should he have this dream ever again!!...Increased pressure from his job and a total lack of empathy from everyone around him intensify his desire to change his life!!...He gives his wife one final plea to support his mixed feelings about everything...This completely backfires and she makes it perfectly clear as she previously stated, that she wants no part of a man \"who's big dream in life is to be Huckleberry Finn\"...It is important to note that William's wife is not impervious to what he is saying, she understands fully of what he is saying and resolutely resists it!!Now being pressured from all sides to the point whereby a head vice seems like a Tonka Toy...Mr Williams once again falls asleep on the train and decides to get off at Wiloughby (The manufactured town in his persistent dreams)...To Williams, he has now entered the citadel of respite and solace...To the real world Mr Williams has committed suicide...For now, Mr Williams is in the world he wants to be!!This Twilight Zone episode illustrates how being raptured up in white collar slavery can often times lead to being trounced by recrimination!! As a result, it is easy to lose sight of what is truly important to you!! Now all of a sudden, the joy of heartfelt laughter, and human compassion seem like old relics!!...A mandated life of affluence can be the insidious assassin to happiness, as well as a ruthless vitiation to a tolerable perseverance!!The Twilight Zone episode \"Stop at Wiloughby\" is loosely based on Rod Serling's life in terms of the pressure he faced while doing Twilight Zone!! It is very ironic that this episode premiered on CBS the day I was born!!...Rod Serling's articulation of the social climbing America is done up to perfection in this episode!! Carrying across an idea that is prolific and socially astute in nature is difficult enough on it's own right, but when you are continually interrupted every twelve minutes by commercials about bleach detergent, chocolates that taste homemade, and Mercury Convertibles, it is seemingly far more difficult or next to impossible...Rod Serling somehow finds a way to convey his message and flawlessly...This is my second favorite Twilight Zone Episode of all time...I love it, but then again I love a lot of them!!"
    },
    {
      "username": "StuOz",
      "userUrl": "https://www.imdb.com/user/ur2198340",
      "reviewLink": "https://www.imdb.com/review/rw5924299",
      "warningSpoilers": false,
      "date": "21 July 2020",
      "rate": "",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Despite The Last Two Seasons - This Show Is A Gem",
      "content": "Very highly regarded series containing plots about science fiction, fantasy, horror and sometimes even crazy comedy.A hard series to review as people react to it in different ways. One episode will get 100 different reactions. Me being a science fiction fan, I personally connected to the plots about space travel, time travel, generally the episodes that were played totally straight faced.I sometimes don't laugh at things other people laugh at, so I was often not at home when TZ ventured into comedy shows about the devil or an angel dropping in on earth. However, a couple of these tales were well done. I don't wish to come over as some humourless old man and can proudly report that I found fantasy tales - The After Hours and Five Characters In Search Of An Exit - to be two of the most amusing (and re-watched) TV episodes you could find anywhere!As is the case with several TV shows in history, many of the gems were found in season one. However, the pilot - Where Is Everybody? - was not the best introduction to the series, so don't judge the show from the opening episode.Some might say the show should have called it a day after three seasons as the last two seasons ran into problems:Season four episodes were expanded to 51 minutes and only five of those 18 hours were gems.Season five episodes were running out of ideas fast and only 12 of the 36 tales were worth bothering with.However, once again, this is just my take on the series, there are others who think all five seasons are a knockout! Frankly, I would consider watching the whole series as even the lesser shows had the odd good music cue or a knockout introduction from Rod Serling to make the viewing worthwhile. Enjoy!"
    },
    {
      "username": "strong-122-478885",
      "userUrl": "https://www.imdb.com/user/ur27361979",
      "reviewLink": "https://www.imdb.com/review/rw2686786",
      "warningSpoilers": false,
      "date": "11 October 2012",
      "rate": "8",
      "helpful": "10 out of 13 found this helpful.",
      "title": "The Next Stop?..... The Twilight Zone",
      "content": "Featuring some of the most bizarre, eerie, and thought-provoking tales of the weird and supernatural that you're ever going to see, Rod Serling's \"The Twilight Zone\", from the early 1960s, has had a phenomenal impact on redefining the genres of Horror and Science Fiction.This brilliant, landmark TV series, that almost single-handedly changed the way we viewed things strange and extraordinary, has so rightly earned its high-ranking position in TV History thanks to its excellent production values, and its deft blend of credible human emotions mixed generously with incredible, awe-inspiring situations, which ranged from comic to tragic.These intriguing half hour episodes were all filmed in b&w."
    },
    {
      "username": "doomedmac",
      "userUrl": "https://www.imdb.com/user/ur111092901",
      "reviewLink": "https://www.imdb.com/review/rw5574055",
      "warningSpoilers": false,
      "date": "24 March 2020",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Consistently great",
      "content": "Best anthology series ever. Episodes are extremely intelligent, interesting, and entertaining."
    },
    {
      "username": "Lejink",
      "userUrl": "https://www.imdb.com/user/ur15298231",
      "reviewLink": "https://www.imdb.com/review/rw2713491",
      "warningSpoilers": false,
      "date": "1 December 2012",
      "rate": "8",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Serling silver",
      "content": "I have just started watching \"Twilight Zone\" from episode 1 and can confidently say I'll be watching many more. What a great way to fill 25 minutes, mystery, suspense, occasionally a bit of science fiction. The direction is tightly focused and even as you check how much time is left in an episode, still they are invariably wound up neatly with an often unexpected twist. It's also fun to see in early roles actors and actresses who would go onto wider prominence, for instance I've just watched one which featured Martin \"Mission Impossible\" Landis and Doug \"The Virginian\" McClure in minor roles as well as more established actors of the day. I was too young to see this programme on original release but can readily appreciate the nostalgia for it here. The fact is it still stands up today, the TV equivalent of the great short story."
    },
    {
      "username": "BaronBl00d",
      "userUrl": "https://www.imdb.com/user/ur0166205",
      "reviewLink": "https://www.imdb.com/review/rw0066782",
      "warningSpoilers": false,
      "date": "2 May 2001",
      "rate": "",
      "helpful": "7 out of 9 found this helpful.",
      "title": "A Wonderful Dimension It IS!",
      "content": "I love this show. I love the talent that is so obvious in every episode from the talented folks who wrote the script like people like Charles Beaumont and the ever creative Richard Matheson, to the folks behind the camera like Will Asher and Robert Florey, to the talent in front of the camera like Burgess Meredith, Kevin McCarthy, Roddy McDowell, Claude Atkins, Jack Klugman, and so many others, and finally to the awesome talent...the awesome ability of one of the most over-looked geniuses of television...Rod Serling, a simple yet oh so complex mind from the outskirts of Binghamton, New York. Serling created a cultural phenomenon that has lasted alomst half a century and likely will be around long after all of us have entered another dimension. I really cannot add too much more than the other thankful reviewers who, like myself, want to share their love, their admiration, their desire to reach future audiences with this wonderful television program that makes you think more than anything. The Twilight Zone is a fantasy, sci-fi, horror show but in many ways is nothing more than thinly disguised philosophy and social commentary. The episodes often make us think about our imperfections, our weaknesses, our desires, hates, and loves, and our frailty. My favourite episode, like that of another viewer, is \"Time Enough at Last.\" It is almost perfect in its execution, and easily it has one of the best endings of any television show ever made."
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw1862309",
      "warningSpoilers": true,
      "date": "23 April 2008",
      "rate": "8",
      "helpful": "8 out of 12 found this helpful.",
      "title": "What's Not to Like?",
      "content": "Rod Serling was quite a guy, a nice Jewish kid from Binghamton, NY, who volunteered for the paratroopers in WWII, was wounded, and attended Antioch College in Yellowsprings, Ohio, on the GI Bill. He worked his way up through TV, and sometimes feature films, as a writer and finally got his own series, \"The Twilight Zone.\" He was exceedingly generous, a Franciscan fool, who publicly threw open the doors to all writers of all stripes while organizing the series. No filters. Anybody could submit a script. But he had to knock that off and resort to the usual means of getting decent stories because the ones flowing in tended to be written in long hand, sometimes on legal pads, and frequently by maniacs.The original team of writers, producers, and directors -- beginning with the first season and lasting two or three years -- was the best. Each member of the cast and crew knew pretty much exactly what they were doing. Buck Houghton, as producer, held the enterprise together and Serling wrote many of the scripts himself. The quality began falling off after a few years. The stories became less original and a bit repetitious. One of the reasons was that Buck Houghton was lured away by a better job. Another was that Serling was simply getting burned out, as he himself admitted.The stories seemed to fall into several categories: the comic stories of special properties in ordinary things or ordinary people (eg., \"Mr. Dingle The Strong\"), futuristic science fiction (eg., \"To Serve Man\"), moral lessons consisting mainly of dialog (eg., \"The Obsolete Man\"), and some sort of time travel (eg., \"Back There\"). There was often a good deal of overlap. \"Next Stop Willoughby\" combines a moral lesson with time travel.I've always found the moral tales least successful because the series, ambitious though it might occasionally be, was so determinedly middlebrow. We don't really learn much if an episode tells us that the concentration camps were evil or that an excess of conformity can be dangerous. The comic episodes could be beguiling. And the time travel episodes were often wistful and nostalgic. Serling never forgot his youth on the streets of an ordinary town that, in retrospect, before he became a hot property himself, must have seemed like paradise. His organization and scripts are sprinkled with self-referential names -- Cayuga Productions (one of the Finger Lakes in New York state), a bus to Cortland (a small town near Ithaca), the old train stopping at the non-existent town of Willoughby (in Ohio, near Yellowsprings).Serling himself introduced the episodes and gave the final speech. He refused to appear on screen the first year because he felt his appearance was unprepossessing -- short, not particularly handsome. He couldn't have been more wrong, of course, because he had a distinctive presence on screen, at least the equal of Alfred Hitchcock's.Serling died in his early 50s during heart surgery, a shame. He may have been past his prime, but how nice it would be if all of us could claim such a prime."
    },
    {
      "username": "yenlo",
      "userUrl": "https://www.imdb.com/user/ur0313186",
      "reviewLink": "https://www.imdb.com/review/rw0066773",
      "warningSpoilers": false,
      "date": "4 January 2000",
      "rate": "",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Way ahead of its time!",
      "content": "Most certainly a show that was way ahead of its time. Watching these episodes now it's amazing how such great stories could be told in a half hour time span. Of course the writing and acting had much to do with it. It seems that there are no longer programs like this that can deliver such greatness in thirty minutes. Observe the fine performances of so many fine actors and actresses in these episodes and you'll see why this show stands the test of time above all others and like good liquor gets better with age."
    },
    {
      "username": "mattkratz",
      "userUrl": "https://www.imdb.com/user/ur0812029",
      "reviewLink": "https://www.imdb.com/review/rw0066780",
      "warningSpoilers": false,
      "date": "14 March 2001",
      "rate": "",
      "helpful": "5 out of 6 found this helpful.",
      "title": "totally, 100% awesome",
      "content": "Now this is great television. I have always loved The Twilight Zone, and it certainly has earned its place in tv history.My favorite episodes include \"Time Enough At Last\", \"I am the night, color me black,\" \"The Masks,\" and an episode-I forget the name-where Keenan Wynn can make people and items appear by writing them and make them disappear by throwing them in the fire.Everything about this show-the writing, directing,etc.-is truly first rate. I wish I could have met Mr. Rod Serling."
    }
  ],
  "errorMessage": ""
}