{
  "imDbId": "tt13868972",
  "title": "Rocket Boys",
  "fullTitle": "Rocket Boys (TV Series 2022– )",
  "type": "TVSeries",
  "year": "2022",
  "items": [
    {
      "username": "anikb-87099",
      "userUrl": "https://www.imdb.com/user/ur127152283",
      "reviewLink": "https://www.imdb.com/review/rw7837445",
      "warningSpoilers": false,
      "date": "5 February 2022",
      "rate": "9",
      "helpful": "41 out of 46 found this helpful.",
      "title": "Makes you proud without hyper-nationalism",
      "content": "This series is going to be a treat for those who love science or have been following india's developement in the field of science. You know very well what this series or rather, whom this series is based upon so let me jump to the positive points:-1. Good detailing. The makers have done a pretty good amount of research for this series. There would be many terms or even organizations that todays gen may not be aware of like ATIRA or ISCOPAR etc and will force you to keenly google them up.2. The performance by Jim Sarbh and Ishwak singh is top class. Many might question why Ishwak singh's Vikram doesnt age at all with time . The fact is Sarabhai really looked young even at later stages of his life. Jim Sarbh as Homi Bhaba is one step further. His charm and subtle humor that his character possesses is a treat to watch.3. Brings out the feelings of Patriotism without patriotic dialogues or hyper-nationalism. Just their efforts into making a rocket or even the atomic research center is shown so well that when they finally achieve success, it automatically brings the sense of pride for your country in your heart.4. Addition of 35 mm reels from the 1950s is another masterstroke. Good detailing has also gone into the sets making sure we are aware in which time we are.5. A bit of dramatization has been done and i accept it. We see evil men going behind Homi trying to bring him down all these things may not be real and are commercialized (or who knows if it was real) but i honestly had no complains as it made the series more interesting to watch.However, there are some negatives:-1. It is ok to show the personal lives of the two scientists but for literally 5 episodes? Their love lives are given meaty screen space and that dissapointed me as the series could have focussed more on science rather than love. The love angle could have been chopped off a bit.2. An illogical scene where Homi literally dives into a swimming pool reactor only to emerge absolutely dry.3. The fact that towards the end , they didnt really focus on how Sarabhai made the rocket rather they focus more on Homi.Overall , a must watch series. Definitely not for \"Pushpa\" audience so choose wisely and you wont be dissapointed. One thing you will realize that Homi was more like a \"Netaji Shubash\" while Sarabhai had more of a \"Mahatma Gandhi\" kind of mindet."
    },
    {
      "username": "koushikdas508",
      "userUrl": "https://www.imdb.com/user/ur45103731",
      "reviewLink": "https://www.imdb.com/review/rw7838441",
      "warningSpoilers": false,
      "date": "5 February 2022",
      "rate": "10",
      "helpful": "46 out of 51 found this helpful.",
      "title": "The Rocket Boys has left the station to soar higher!",
      "content": "\"Often the best minds tend to lose objectivity in their pursuit of excellence.\" We often glorify our freedom fighters, our armed personnel, historical monarchs. We are literally obsessed with our sports stars, our movie stars. We talk about our politicians, leaders. And there are lots of movies and web series on them. But, when it comes to \"the best minds\" who have pioneered our country's development in the field of science, our film industries really lack on-screen portrayals. However, thanks to the rising dominance of the OTT platforms that we've now found at least one.\"Rocket Boys\" on Sony Liv is not only a mere historical period-drama with a high proportion of knowledge and enriched with content but also is a fitting tribute to some of the ignited minds of our beautiful country like CV Raman, Homi Jehangir Bhabha, Vikram Sarabhai, Shanti Swaroop Bhatnagar, and last but not the least APJ Abdul Kalam who gave their whole lives to our nation-building through their sole favourite field of science. The day I've watched the trailer, I've decided to have a go at this series. And after finishing all 8 episodes, I can say that it didn't disappoint me. The story focuses on the lives of mainly Dr. Homi J. Bhabha and Dr. Vikram Sarabhai and their efforts to strengthen India's first Nuclear Programme and India's first space programme. Expectedly, there are many moments of goosebumps and some \"tears of joy\" moments as well. Especially, the hosting of the flag at the climax of the 1st episode, the first entry of the teenage APJ Abdul Kalam at the end of the 4th episode, and the speech of Dr. Sarabhai at his cotton mill in Ahmedabad were enough to get that extra emotional spark in my mind and body as a proud Indian. And that moment where Dr. Bhabha had finally launched India's first nuclear reactor 'Apsara' was no less than a moment of high adrenaline rush. The moment of launching India's first rocket and the satisfying faces of Dr. Sarabhai, Dr. Kalam, and Dr. Bhabha made my eyes moist in pride and joy as a countryman. Yes...There was a bit of melodrama. But it was necessary and certainly not stretched at all. Because it is not only about science but also about the friendship, romance, commitment, and overall lives of both of them.Coming to the technicalities, I can say that \"Kal Ho Naa Ho\" and \"D-Day\" famed director Nikkhil Advani gave his best so far. He has found a team that really worked hard in research to make the script with so much information and almost negligible error. Dibyendu Bhattacharya as Raza Mehdi, Arjun Radhakrishnan as Dr. APJ Abdul Kalam did great. Ishwak Singh sparked and literally looked perfect as Dr. Vikram Sarabhai. Rajit Kapoor was not only looking, rather sounding like Pandit Jawaharlal Nehru with unique voice modulation. Other actors and actresses were just fitting to their roles.There should be a special paragraph for Jim Sarbh whenever anyone would discuss this series. I think he has immortalized the \"Father of India's Nuclear Programme\" on-screen forever. Jim sparked in every cameo and supporting role before but now he has delivered his best shot so far in a leading role as Dr. Bhabha. He was just outstanding and surely the heart of the show.Editing could've been slightly better but that's alright. The background score and the cinematography were very appealing to the audience.Overall, it is a fantastic experience not just as an Indian or a cinema/series fanatic, or a science admirer or a history lover but as a combined of all. Kudos to the entire cast and crew members of the series. Along with the Indian series like \"Scam 1992\", \"The Family Man\", \"Panchayat\" etc., it will be right up there at the top branch for sure with a \"MUST WATCH\" tag!❤🙏😊"
    },
    {
      "username": "user-90-160736",
      "userUrl": "https://www.imdb.com/user/ur54856907",
      "reviewLink": "https://www.imdb.com/review/rw7847390",
      "warningSpoilers": false,
      "date": "8 February 2022",
      "rate": "10",
      "helpful": "21 out of 21 found this helpful.",
      "title": "One of the Indian web series ever...",
      "content": "Very well directed and inspiring for young generation to do something for your nation that really matters....if Dawood have 20 movies on his name...atleast our scientists deserve 1...Must watch for all generations...."
    },
    {
      "username": "praj-45231",
      "userUrl": "https://www.imdb.com/user/ur133499068",
      "reviewLink": "https://www.imdb.com/review/rw7834089",
      "warningSpoilers": false,
      "date": "4 February 2022",
      "rate": "10",
      "helpful": "19 out of 19 found this helpful.",
      "title": "Such a great series in India",
      "content": "Such a great story and biography of two extraordinary Indian scientists. This series the the future of India and very inspirational. And a Greatest scientist APJ ABDUL KALAM sir entry was suberb."
    },
    {
      "username": "rghvvikas",
      "userUrl": "https://www.imdb.com/user/ur30777787",
      "reviewLink": "https://www.imdb.com/review/rw7841172",
      "warningSpoilers": false,
      "date": "6 February 2022",
      "rate": "10",
      "helpful": "23 out of 26 found this helpful.",
      "title": "Make some noise for the Rocket Boys",
      "content": "Boy o boy...What a brilliant piece of art this series is!!!! A true homage to the Indian legends who selflessly shaped our country's bright future for what it is today. Due credit to the writers for making this 'know your heroes' series most entertaining to watch. Fantastic performance from all the actors involved including the phenomenal acting by Jim Sarbh in leading role, it would be unfair for other actors to say that he stole every scene that he was in but Damn he NAILED IT!!The dialogues had wits where needed with engaging story and direction was top notch by Abhay Pannu. Cinematography was also good.More like this one Please?"
    },
    {
      "username": "maulikmodi18",
      "userUrl": "https://www.imdb.com/user/ur29645970",
      "reviewLink": "https://www.imdb.com/review/rw7833610",
      "warningSpoilers": false,
      "date": "4 February 2022",
      "rate": "10",
      "helpful": "30 out of 34 found this helpful.",
      "title": "Dr. Homi jahangir bhabha was a LEGEND!",
      "content": "Excellent series with amazing display of extraordinary lives of Dr. Vikram Sarabhai and Dr Homi bhabha.Jim sarabh for outstanding performance by jim sarabh.. It's a must watch!"
    },
    {
      "username": "navreview",
      "userUrl": "https://www.imdb.com/user/ur120266867",
      "reviewLink": "https://www.imdb.com/review/rw7833593",
      "warningSpoilers": true,
      "date": "4 February 2022",
      "rate": "9",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Something different than usual Bollywood OTT",
      "content": "Great Story, good acting. First season more on development and debates around Nuclear Energy and Reactors. I hope the makers will show more of space development programs in future season, if they are making another season.Overall very nice experience of watching this series. Loved Jim Sarbh and Ishwak Singh as Homi J Bhabha and Vikram A Sarabhai. Music is also great.Sonyliv needs to be commended for supporting these types of series."
    },
    {
      "username": "ec-38246",
      "userUrl": "https://www.imdb.com/user/ur84419803",
      "reviewLink": "https://www.imdb.com/review/rw7834499",
      "warningSpoilers": false,
      "date": "4 February 2022",
      "rate": "10",
      "helpful": "23 out of 24 found this helpful.",
      "title": "Remember the Titans",
      "content": "An enriching tale of 2 great men on whose shoulders our country's technology sector is standing. If you ever wanted to look back into history and understand how a country which was stripped down, starved and exploited in every possible way for 200 years was able to stand again, have its own space program and a nuclear weapon - watch this show to understand how it all started. The sacrifices made by them is bearing fruits now. The actors are as good as they come. Direction is top class. The only lag are episode 2 and 3 where the romantic track take the seat. Do yourself a favour and watch it. We rarely make such piece of art."
    },
    {
      "username": "ketgup83",
      "userUrl": "https://www.imdb.com/user/ur22864666",
      "reviewLink": "https://www.imdb.com/review/rw7837039",
      "warningSpoilers": false,
      "date": "5 February 2022",
      "rate": "8",
      "helpful": "24 out of 30 found this helpful.",
      "title": "Will Make You Proud With Winning Moments",
      "content": "Sony LIV's Rocket Boys will take you into space technology for national development, which will inspire and motivate you with head-strong story of three genius who have played a pivotal role in creating history for India.Rocket Boys takes you through the journey of events right from India's independence in 1947, launch of first nuclear program and space program which involved geniuses like Homi J Bhabha, Vikram Sarabhai and APJ Abdul Kalam who despite the struggle, different thinking, approach, political pressure and disagreement, creates history for India which made us proud with their achievements.There are two things which can ignite the curiosity in you to watch the 8 episode web series drama - Abhay Pannu takes the director's seat along with the creator Nikkhil Advani to show interesting tale of how the Indian Space Program was orchestrated. After watching Rocket Boys, your thirst for a perfect captivating web series will be quenched thanks to the solid entertainment, powerful dialogues and electrifying performances that will keep you hooked till the last episode. A big clap to the team, including the writers (Abhay Koranne and Kausar Munir) for researching and taking us into the world of science during the 1940-1960 period by keeping it raw and real.Rocket Boys is flavored with a brilliant background by Achint Thakkar (Scam 992) with magnificent cinematography by Harshvir Oberao, outstanding production design by Meghna Gandhi and splended art direction by Pradeep Nigam. On the flip side, the story of Indian space seemed bit long and stretched at some times as the web series also talks about the personal lives of the geniuses along which I felt misplaced and could have shortened by few episodes.Rocket Boys boast of some of the finest performances in recent times. To start with first and the foremost are Jim Sarbh and Ishwak Singh who gave knockout performance as they deep-dives into the body language of Homi Bhabha and Vikram Sarabhai. Arjun Radhakrishnan is simply superb as APJ Abdul Kalam who strikes a perfect balance in the beautiful story. Apart from these, Regina Cassandra, Saba Azad, Rajit Kapoor and Rajiv Kachroo were a solid support.On the whole, Rocket Boys is nice, brave attempt with wonderful direction and hard-hitting performances. Good 3/5. Go for it."
    },
    {
      "username": "kapoor-shresth",
      "userUrl": "https://www.imdb.com/user/ur29883947",
      "reviewLink": "https://www.imdb.com/review/rw7832461",
      "warningSpoilers": false,
      "date": "4 February 2022",
      "rate": "10",
      "helpful": "34 out of 36 found this helpful.",
      "title": "Excellent initiative to showcase how Scientific foundation of india was found",
      "content": "Acting: acting done by each actor in this series is exceptional.Storyline: Best part about the storyline is they tried to connect the puzzle the best way possible it starts with a rivalry between Homi Bhabha and Vikram Sarabhai including the characters like CV Raman, JRD Tata and APJ Abdul Kalam. Even though it looks like a rivalry but in this series you will see how both of them tried to build a strong foundation for India in either building space rockets or be it building Atom bombs.I am very sure during the end of this series you will be left with patriotic feeling in your heart. #BharatMataKiJai."
    },
    {
      "username": "admin-IMDb",
      "userUrl": "https://www.imdb.com/user/ur70639839",
      "reviewLink": "https://www.imdb.com/review/rw7842044",
      "warningSpoilers": false,
      "date": "6 February 2022",
      "rate": "10",
      "helpful": "23 out of 27 found this helpful.",
      "title": "Best web series of all time! Epic!",
      "content": "This is probably one of those rare times that after finishing the seris, I am craving for few more episodes. This was such an engaging and enjoyable watch, keeping me on the edge of my seat throughout, although the genre is not thriller. This is the best that could have been dedicated to 3 of the greatest scientists of India, Dr. Homi J. Bhabha, Dr. Vikram Sarabhai and (initial days of) Dr. APJ Abdul Kalam. The series showcases both their personal and professional lives very well. Jim Sarbh was mind blowingly superb, Ishwak Singh, Rajit Kapur, Dibyendu Bhattacharya and Regina Cassandra all did perfectly well too. Perhaps the title wasn't the most appropriate one as this was not just about rocket launch, it was about atomic energy, nuclear reactor, and so much more."
    },
    {
      "username": "cs_rahul_kumar",
      "userUrl": "https://www.imdb.com/user/ur104563194",
      "reviewLink": "https://www.imdb.com/review/rw7837181",
      "warningSpoilers": false,
      "date": "5 February 2022",
      "rate": "10",
      "helpful": "17 out of 21 found this helpful.",
      "title": "Jim Sarbh and Ishwak Singh Starrer - Rocket Boys is a Perfect Tribute to India's Scientific Luminaries !!!",
      "content": "'Rocket Boys' tells the story of two legendary physicists, Dr. Homi Jehangir Bhabha-colloquially known as \"Father of the Indian Nuclear Program\"- who was a researcher in Cambridge before he decided to stay in India and join CV Raman's Indian Institute of Science. He worked as a physics professor at the Tata Institute of Fundamental Research (TIFR) before founding and leading the Bhabha Atomic Research Centre (BARC) in Mumbai. And Dr. Vikram Ambalal Sarabhai- internationally regarded as the \"Father of the Indian Space Program\"-was an Indian physicist and astronomer who pioneered space research and contributed to developing nuclear power in India. He also has a key role in the establishment of the Physical Research Laboratory and Indian Institute of Management in Ahmedabad, and a number of scientific institutions in India.This biographical fictionalised drama, created by Nikhil Advani, Roy Kapur Films, and Emmay Entertainment, is captivating from the start, successfully recreating iconic moments from the past, particularly those that occurred in the pre and post Independence era. The concept by Abhay Koranne is both intense and inspiring for the viewers while narrating the real-life incidents of these scientists and their efforts to propel the newly independent and struggling country forward in the technology path.Writer-Director Abhay Pannu's eight-part series is an awe-inspiring tale that mirrors the real-life events of the duo who first became friends and envisioned working on India's nuclear program. It chronicles the early lives and struggles faced by Vikram Sarabhai, who began experimenting in his college campus, and Homi Bhabha, a science professor who is impressed by Sarabhai's ideas and ongoing experiments, and how they bond and begin their journey to make India a nuclear power.The later episodes also shed light on a budding scientist, none other than Dr. APJ Abdul Kalam -- internationally known as the \"Missile Man of India\" (essayed by Arjun Radhakrishnan) himself, who worked closely with Sarabhai on the first rocket launch into space. It also captures the role that former Prime Minister Pandit Jawaharlal Nehru (essayed by Rajit Kapoor) played in furthering India's nuclear program. Additionally, the screenplay includes historical clippings that run alongside the narrative to substantiate the events that occurred between the early 1940s and the 1960s.Two people deserve special mention here: the director of photography Harshvir Oberai, who recreated the pre and post Independence eras, and editor Maahir Zaveri, whose precise cuts aid in swiftly shifting the narrative between the timelines. Additionally, the vintage clothing outfits by Uma Biju and Biju Antony helped in recreating the era and adding a realistic-looking element to the story.Jim Sarbh perfectly fits the skin of an eccentric scientist Homi Bhabha, who is highly focused on building a nuclear reactor. Right from his ascent to his well-suited attire, he is convincing in every frame. Vikram Sarabhai, a scientist from an affluent Gujarati family, is convincingly portrayed by Ishwak Singh. Unlike Bhabha, Sarabhai always wears plain kurta-pajamas, which reflects his outlook on life. Both are pioneers in their respective fields in India, and they share a unique friendship.This drama delves deeper into their personal lives, with Sarabhai, son of an Ahmedabad-based industrialist, marrying Mrinalini Swaminathan, an Indian classical dancer. Regina Cassandra, who has acted in a number of Tamil films in the past, makes her debut as Mrinalini in this show. Whether it's her dance performances or navigating the ups and downs of her rocky marriage, she looks put-together and stunning in every shot. Saba Azad, on the other hand, plays Parvana Irani aka Pipsi, a lawyer who falls for Homi. She looks lovely as a Parsi girl who is always supportive of Homi. Both have a very limited role in this male-dominated series about Indian science heroes, yet they do leave a significant impression.The rest of the ensemble cast, including Rajit Kapoor as former PM Pt. Jawaharlal Nehru, Arjun Radhakrishnan as Dr. APJ Abdul Kalam, Dibyendu Bhattacharya as scientist Dr. Raza Mehdi, Namit Das as reporter Prosenjit Dey, K. C. Shankar as Vishwesh Mathur have prominent roles too.The series' pace, with each episode lasting nearly an hour, may be too much for some viewers, but those who are inclined towards science-based shows will undoubtedly binge-watch it. All said, 'Rocket Boys' is a glowing tribute to India's scientific luminaries, as well as their struggle and hard work. On top of that, Jim Sarbh and Ishwak Singh give credible performances in this biographical drama, making it a well-intended series."
    },
    {
      "username": "barnwal-usa",
      "userUrl": "https://www.imdb.com/user/ur47249081",
      "reviewLink": "https://www.imdb.com/review/rw7836896",
      "warningSpoilers": false,
      "date": "5 February 2022",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Highlight of Jim Sarbh career",
      "content": "I think this maybe breakthrough performance of Jim Sarbh. I was hooked from the start when I almost randomly clicked on this show and it started playing."
    },
    {
      "username": "rahuldasbabon",
      "userUrl": "https://www.imdb.com/user/ur64688722",
      "reviewLink": "https://www.imdb.com/review/rw7839840",
      "warningSpoilers": false,
      "date": "6 February 2022",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Proud to be an indian",
      "content": "Trust me you will feel proud about everything these series has shown. Each moment each character has played their part with pure brilliance. Need more series like this for our generation to enlighten us about those brave men..👌"
    },
    {
      "username": "ashutoshaswaleho",
      "userUrl": "https://www.imdb.com/user/ur56420220",
      "reviewLink": "https://www.imdb.com/review/rw7837376",
      "warningSpoilers": false,
      "date": "5 February 2022",
      "rate": "7",
      "helpful": "22 out of 29 found this helpful.",
      "title": "They've pulled the bollywood",
      "content": "Both lead are perfect, acting is top notch throughout the series, from background score to DOP everything is great.But forced addition of love stories wasn't necessary, with minimal time for that they could've moved on and added more material but they've pulled the bollywood there, otherwise it was pure 9/10.And Loved the last 3 episodes that only because there is no bollywood-yappa in them."
    },
    {
      "username": "ksparsh-44829",
      "userUrl": "https://www.imdb.com/user/ur115636754",
      "reviewLink": "https://www.imdb.com/review/rw7840359",
      "warningSpoilers": false,
      "date": "6 February 2022",
      "rate": "8",
      "helpful": "7 out of 7 found this helpful.",
      "title": "A Slow Burn 🔥",
      "content": "Legendary series quite slow in its pace but the concluding episodes were makes a lasting impact. Both leads were great and not to mention the appearance of DR APJ Abdul Kalam. A decent and captivating experience."
    },
    {
      "username": "Shethdarshik",
      "userUrl": "https://www.imdb.com/user/ur132370757",
      "reviewLink": "https://www.imdb.com/review/rw7833898",
      "warningSpoilers": false,
      "date": "4 February 2022",
      "rate": "10",
      "helpful": "22 out of 23 found this helpful.",
      "title": "An amazing (Must) watch!",
      "content": "How do you tell a story about a subject which is so easily ignored?To me, this series was a really interesting way to know about the people who built the critical strategic assets in terms of Scientific Institutes.While all the actors were splendid in their characters, Jim Sarbh steals the show with this iconic portrayal of Homi Jahangir Bhabha.Loved the way the story of approx 3 decades has been arranged. The BGM adds much color to the scene.I guess this will easily be the next hit for Sony LIV after Scam 1992.Kudos to the team!"
    },
    {
      "username": "nidhunmoviebuff",
      "userUrl": "https://www.imdb.com/user/ur111831007",
      "reviewLink": "https://www.imdb.com/review/rw7844797",
      "warningSpoilers": false,
      "date": "7 February 2022",
      "rate": "9",
      "helpful": "12 out of 15 found this helpful.",
      "title": "An inspiring and moving tribute to India's scientific stalwarts!",
      "content": "The much-awaited biographical series of two of India's most legendary scientific stalwarts is thankfully worthy of the great men whose story it sets out to tell. Homi J Bhabha and Vikram Sarabhai left behind international fame and fortune to nurture and develop the Indian Nuclear and Space programs right from its infancy into forces to be reckoned with, and it is astonishing that it took Bollywood this long to show us their inspiring life journeys.Jim Sarbh lives and breathes as the enigmatic Homi, essaying his characteristic wit and sophisticated 'man of the world' persona with spectacular ease and finesse. Ishwak Singh is steady as Vikram Sarabhai, understated and bookish by demeanour as the great man himself. He not only fathered ISRO, but went on to establish the Indian Institutes of Management, an institute that I have also been lucky enough to study in reap the rewards of the pathway laid down by his unparalleled vision for the future of science and management in the country.We are taken through the lives of Sarabhai and Bhabha right from the 40s as they grapple with being under the thumb of the British as aspiring young scientists to the 60s where they match wits, being on either side of the 'India as a Nuclear power' debate. The series never shies to show the fallibility and insecurities of the two scientific giants, portraying their ego, ambition and personal issues with the same verve and authenticity as they do with their scientific achievements.How the narrative weaves in the emotional and psychological turmoil on the leading men of India's scientific progress right through the independence struggle, the high of gaining independence in 1947 right until the Indo-China War in 1962 was a joy to behold. Despite having its storytelling rooted in realism, the creators are able to generate several goosebumps-laden moments thanks to the performances of Sarbh and Ishwak clubbed with the monumental nature of the accomplishments of these trailblazers.Regina Cassandra, Rajit Kapoor, Namit Das and KC Shankar are terrific in their supporting roles but it is Dibyendu Bhattacharya as \"Raza Mehdi\" and Anil Radhakrishnan as the almost mythical \"APJ Abdul Kalam\" who truly mesmerize with their performances, delivering some of the most impactful sequences in the series.\"Rocket Boys\" is a fitting testament to two of India's most beloved sons, who raised the calibre and prestige of the country's science and technology to international standards and inspired generations of men and women to follow in their footsteps. A big shout out to the producers Nikkhil Advani and Sidharth Roy Kapoor for having the courage and conviction to portray their stories in such intricate, inspiring detail, with minimal chest-thumping and jingoism and rather, going for a nuanced and sophisticated narrative, truly worthy of the men they represent.Highly, highly recommended!"
    },
    {
      "username": "sameerlodaya",
      "userUrl": "https://www.imdb.com/user/ur117097528",
      "reviewLink": "https://www.imdb.com/review/rw7835656",
      "warningSpoilers": false,
      "date": "5 February 2022",
      "rate": "7",
      "helpful": "21 out of 29 found this helpful.",
      "title": "Legendary",
      "content": "Sameer LodayaThe series is full of Indian legends like dr homi bhabha Vikram sarabhai dr apj kalam Nehruji indiraji and others of independence timeThe direction of Abhay was outstanding with great camera work ,sharp edits , perfect prosthetics aesthetics, artwork,background scores ,dialogues, styling and costumes..the stars jim and ishwak took the series to top level by their performances..the story is about the 2 legends and their contributions towards the new independent INDIA..the series is with 9 episodes which goes in a good pace..it feels proud to see such fine products are made by Indian series industryfew negative hitch's were too much of personal life of this legends were shown like affair's ,love triangles ,break ups ,which was not required when you had such great data of these legends and mr kalam was not on the poster of the series with very less exposure..more of research and technicality was expectedDefinitely a watch for these legends journey."
    },
    {
      "username": "ravish9",
      "userUrl": "https://www.imdb.com/user/ur12301443",
      "reviewLink": "https://www.imdb.com/review/rw7839849",
      "warningSpoilers": false,
      "date": "6 February 2022",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "A Show on Which Every Indian will be Proud",
      "content": "In its entire career Bollywood could not do what this OTT webseries has done.... A True Tribute to Real Father and Makers of Modern Independent India. Since off late India has become so unscientific nation, loathing with corrupt politician and society, that if you ask any one about Homi Bhabha or Sarabhai...they would not even know these real heroes and father of modern India.Leave it aside, we live in a time where abusing and blaming Nehru has become a culture..those abuse him who themselves r not educated, know nothing, but abuse and blame it for every sorry state. Watch this show and learn how Nehru stood strongly behind science and scientists of India unlike the present time when our country does not spend even one percent of is budget on science and research, but gives hollow slogans like Make in India or AtmNirbhar Bharat..and same time deducts budget of Science & Technology and allocated 2600 crore budget fund the same year for Central Vista and new Parliament, that too in Covid times when our scientists slogged without funding for past 3 years.From Cinematography, to story, to directions, BGOM to performances...everything is at top notch. A nation whih has been obsessed either with Romance or Guns holders as their heros, here comes a masterpiece show which also educates you to know truth of new India and its birth, its real heroes and sacrifices they made without caring for it. ANd what to tell on Bollywood man...its dead force..they should hide themselves in shame for wasting themselves...especially after watching the level content repeatedly coming from OTTs of India....our OTT webseries are becoming international quality, top notch stuffs...something on which also India should take pride. Do yourself a favor and watch this webseries on SonyLiv."
    },
    {
      "username": "sambeetabc2",
      "userUrl": "https://www.imdb.com/user/ur22559528",
      "reviewLink": "https://www.imdb.com/review/rw7836320",
      "warningSpoilers": false,
      "date": "5 February 2022",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Binge worthy and highly recommended",
      "content": "RocketBoys on SonyLIV is a masterpiece! Beautifully written, brilliantly cast, spectacularly shot, skillfully executed in every department. Special mention to the music of Achint Thakkar and Jim Sarbh is my new favourite! All will be swept by him! What acting!Amazing performance by everyone. Can't wait for season 2 .."
    },
    {
      "username": "irfannoohi",
      "userUrl": "https://www.imdb.com/user/ur132709828",
      "reviewLink": "https://www.imdb.com/review/rw7835064",
      "warningSpoilers": false,
      "date": "4 February 2022",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "Season 2 ASAP",
      "content": "In my opinion, this is what i want on OTT because we didn't well aware about our science heros so that's the best way to introduce with india new Generation. Good work keep going."
    },
    {
      "username": "dewpic",
      "userUrl": "https://www.imdb.com/user/ur124109921",
      "reviewLink": "https://www.imdb.com/review/rw7840529",
      "warningSpoilers": false,
      "date": "6 February 2022",
      "rate": "5",
      "helpful": "33 out of 52 found this helpful.",
      "title": "Raja Mehedi is actually Meghnad Saha!!!",
      "content": "When you do a biopic, make sure you give credit to all the characters. Meghnad Saha did his education from India coming from a small village and contributed immensely to astrophysics.But the makers decided to change his name to show a communal angle in the web series. That is manipulation and should be called out."
    },
    {
      "username": "vijayivaturi",
      "userUrl": "https://www.imdb.com/user/ur59404044",
      "reviewLink": "https://www.imdb.com/review/rw7864546",
      "warningSpoilers": false,
      "date": "14 February 2022",
      "rate": "5",
      "helpful": "15 out of 21 found this helpful.",
      "title": "Conspiracies, fictional characters, romance, politics - with science as backdrop - disappointing",
      "content": "Season 1 of Rocket Boys has 9 episodes. And the series starts with a bang as Episode 1 is really well made and set the tone. But then, we are wrong. It all goes downhill from Episode 2 onwards.Rocket Boys is the story of 2 of the best scientific minds in India. They were not only scientists, but the institutions they created have rapidly progressed even beyond their lifetime and those institutions are taking India into the future. ISRO, IIM-A, BARC, PRL among others. And the two scientists? Dr Vikram Sarabhai and Dr Homi Bhabha.This web series on SonyLIV has an outstanding cast. Brilliant actors. The whole series is really well shot, much better than most India movies. And the background score is awesome.Unfortunately, the writers let this series down big time. Rather than focusing on the scientific accomplishments of these 2 geniuses and their impact on India, the series revolves around their personal lives, romance, conspiracies, fictional characters, over dramatisation and politics. A typical masala fare.It is hugely disappointing to see the writers dilute such a great story, despite having so strong support from rest of the creative team.This series reminds me of the SLB movie Bajirao Mastani. It takes the greatest general of Maratha army and then create an insipid inter-religion love story. Other movie in this ignominious category is Kedarnath. This movie is based on one of the holiest religious sites, facing its worst ever natural disaster.. and then use this all as a backdrop for a silly inter-religion love story.Hoping that the Season 2 of Rocket Boys does fix its obsession with masala and stay loyal to the 2 legends on whose accomplishments this series is based on."
    },
    {
      "username": "prabirhbhatt-290-85537",
      "userUrl": "https://www.imdb.com/user/ur31459832",
      "reviewLink": "https://www.imdb.com/review/rw7841193",
      "warningSpoilers": true,
      "date": "6 February 2022",
      "rate": "9",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Script !",
      "content": "I am not even halfway through it while writing this, I am loving the detailing done on the script. A 7 second dialogue between Parvana and Homi P: So they are right about your madness over this Atomic bomb H: you mean the greatest invention of the mankind ?P: The invention that killed lakhs H: \"And saved crores\" (by stopping the war) <.... Pause.....> \"not that they deserved saving.\"We are rating the good work by Bhabha and Sarabhai here, but the writers, Director and a actors to make their story worth read heard and seen."
    }
  ],
  "errorMessage": ""
}