{
  "imDbId": "tt13868972",
  "title": "Rocket Boys",
  "fullTitle": "Rocket Boys (TV Series 2022– )",
  "type": "TVSeries",
  "year": "2022",
  "language": "en",
  "titleInLanguage": "Rocket Boys (web series)",
  "url": "https://en.wikipedia.org/wiki/Rocket_Boys_(web_series)",
  "plotShort": {
    "plainText": "Rocket Boys is an Indian Hindi-language biographical streaming television series on SonyLIV. The Series is based on the lives of Homi J. Bhabha and Vikram Sarabhai. It is directed by Abhay Pannu and produced by Siddharth Roy Kapur with Monisha Advani, and Madhu Bhojwani under the banners Roy Kapur Films and Emmay Entertainment, respectively. The series stars Jim Sarbh and Ishwak Singh along with Regina Cassandra.\r\nThe web series was released on 4 February 2022 exclusively on SonyLIV.\r\nRocket Boys Season 2 was released on 16th March 2023, exclusively on Sony LIV. The first look for the second season was unveiled on 15 August 2022, on the 75th Indian Independence Day, while the second teaser was released on 12 February 2023. The second teaser focuses on how imperative it was for India to become a nuclear nation amidst imminent global threats of war resulting in India's first nuclear test also known as Pokhran I in 1974. The series will cover the incredible journey of India's greatest scientists as they shape a new era where no one dared to challenge their country's sovereignty.",
    "html": "<p>Rocket Boys is an Indian Hindi-language biographical streaming television series on SonyLIV. The Series is based on the lives of Homi J. Bhabha and Vikram Sarabhai. It is directed by Abhay Pannu and produced by Siddharth Roy Kapur with Monisha Advani, and Madhu Bhojwani under the banners Roy Kapur Films and Emmay Entertainment, respectively. The series stars Jim Sarbh and Ishwak Singh along with Regina Cassandra.</p><p>The web series was released on 4 February 2022 exclusively on SonyLIV.</p><p>Rocket Boys Season 2 was released on 16th March 2023, exclusively on Sony LIV. The first look for the second season was unveiled on 15 August 2022, on the 75th Indian Independence Day, while the second teaser was released on 12 February 2023. The second teaser focuses on how imperative it was for India to become a nuclear nation amidst imminent global threats of war resulting in India's first nuclear test also known as Pokhran I in 1974. The series will cover the incredible journey of India's greatest scientists as they shape a new era where no one dared to challenge their country's sovereignty.</p>"
  },
  "plotFull": {
    "plainText": "Rocket Boys is an Indian Hindi-language biographical streaming television series on SonyLIV. The Series is based on the lives of Homi J. Bhabha and Vikram Sarabhai. It is directed by Abhay Pannu and produced by Siddharth Roy Kapur with Monisha Advani, and Madhu Bhojwani under the banners Roy Kapur Films and Emmay Entertainment, respectively. The series stars Jim Sarbh and Ishwak Singh along with Regina Cassandra.\r\nThe web series was released on 4 February 2022 exclusively on SonyLIV.\r\nRocket Boys Season 2 was released on 16th March 2023, exclusively on Sony LIV. The first look for the second season was unveiled on 15 August 2022, on the 75th Indian Independence Day, while the second teaser was released on 12 February 2023. The second teaser focuses on how imperative it was for India to become a nuclear nation amidst imminent global threats of war resulting in India's first nuclear test also known as Pokhran I in 1974. The series will cover the incredible journey of India's greatest scientists as they shape a new era where no one dared to challenge their country's sovereignty.\r\nSynopsis\r\nSeason 1\r\nRocket Boys is a story of two extraordinary men Dr. Homi J. Bhabha and Dr. Vikram Sarabhai. The story is set around the three crucial decades (1940-60s) in the history of India and how the nation is moving towards being a strong, brave, and independent nation. It is the story of Independent India's formative years in the field of science.\r\nWith dreams in their eyes and a vision in their minds, Dr. Homi J. Bhabha engineered India's Nuclear Programme and Dr. Vikram Sarabhai established the Indian Space Programme and many other institutes. Their journey also involves Mrinalini Sarabhai, a strong pillar in Dr. Sarabhai's life, Dr. A. P. J. Abdul Kalam, who pioneered modern Indian aerospace and nuclear technology, Parvana Irani a close companion of Dr. Bhabha, Raza Mehdi (Not a real person but a fictional character scripted as antagonist for dramatization), a distinguished scientist, and Pandit Jawaharlal Nehru who supported them at every step.\r\nThe season builds upon their friendship, sacrifice, and great determination and how everything led to India's first rocket launch; its emblematic of the journey of India as the country emerges into a new, post-war world.\r\nSeason 2\r\nThe second season of Rocket Boys takes place during the early years of independent India when the nation was experiencing political unrest, internal power shifts, and international organizations keeping a close watch on its aspirations. The series continues the account of the extraordinary lives and times of Dr. Homi J. Bhabha, Dr. Vikram Sarabhai, and Dr. A.P.J. Abdul Kalam as they navigate obstacles in their quest to make India a nuclear power.\r\nCast\r\nJim Sarbh as Dr. Homi J. Bhabha\r\nIshwak Singh as Dr. Vikram Sarabhai\r\nRegina Cassandra as Mrinalini Sarabhai\r\nSaba Azad as Parvana Irani a.k.a. Pipsy\r\nRajit Kapur as Jawaharlal Nehru\r\nT.M. Karthik as C. V. Raman\r\nDibyendu Bhattacharya as Raza Mehdi\r\nNamit Das as Prosenjit Dey\r\nArjun Radhakrishnan as Dr. A.P.J. Abdul Kalam\r\nK.C. Shankar as Vishwesh Mathur\r\nNeha Chauhan as Kamla Chowdhry\r\nRajeev Kachroo as JRD Tata\r\nDarious Shroff as Jehangir Bhabha\r\nAnahita Uberoi as Mehreen Bhabha\r\nMark Bennington as Robert Crowley\r\nArjun Dwivedi as Lt Col Sabharwal\r\nEd Robinson as Agent Miller\r\nBenedict Garrett as William Colby\r\nCharu Shanker as Indira Gandhi\r\nSwattee Thakur as Mallika Sarabhai Grace Girdhar as young Mallika Sarabhai\r\nGrace Girdhar as young Mallika Sarabhai\r\nRahul Dev Shetty as Raja Ramanna\r\nNilanjan Datta as Pranab Rebatiranjan Dastidar\r\nVijay Kasyap as Lal Bahadur Shastri\r\nProduction\r\nThe Hari Mahal Palace in Jaipur was used as a location of the \"Retreat\", the Sarabhai family house. The art team met Mallika Sarabhai, daughter of Sarabhai, for detailed information about their home, culture, environment and lifestyle.\r\nEpisodes\r\nSeason 1\r\nSeason 2\r\nReception\r\nThe show received positive reviews from critics and audience, with praise for the performances, direction, writing and other technical aspects.\r\nThe Times of India gave a rating of 3.5 and stated that Jim Sarbh and Ishwak Singh's show is a glowing tribute to India's scientific luminaries. Further, they also said that the show is captivating from the start. Anuj Kumar of The Hindu mentioned that the lead actors Jim Sarbh and Ishwak Singh head a fantastic ensemble cast that gloriously brings to life the achievements of the scientific community in launching India's atomic and space programs. Shefali Deshpande of The Quint gave 4.5/5 stars and said that Rocket Boys is the kind of story that the Oscars and the people at BAFTA look for. In addition to this they also stated that the top-notch acting, storytelling, direction, and music, with actual footage from back in the day and audio to go along with it, this show is here to win slow, steady, and big. Moneycontrol said in their article that Roy Kapur Films, Emmay Entertainment, and SonyLIV together put up a brilliant show that is unmissable. Shubhra Gupta of The Indian Express mentioned Rocket Boys is an absorbing state-of-the-nation saga and both Jim Sarbh and Ishwak Singh are excellent. Hindustan Times expressed Rocket Boys as one of the web series with the most well-crafted, earnestly performed, and tightly-written scenes. Moreover, it also said that the show is a shining star on the streamer's roster. The Scroll.in wrote that Rocket Boys is fuelled by vaulting ambition on the screen and beyond, and it's a heady mix of research and creative liberty, pop quiz-level trivia, and a flair for drama. NDTV Gadgets 360 said that Abhay Pannu's Rocket Boys delivers in spades with the story of Homi Bhabha and Vikram Sarabhai and mentioned India comes of age in SonyLIV's terrific new series. NDTV gave a 3.5 rating to Rocket Boys and further said that The series gets the science of blending fact and fiction absolutely right and delivers a viewing experience that is a marked remove from generic shows. ThePrint featured Rocket Boys as a unique blend of science and the everyday, personal and political, fact and fiction, that makes science less elite, more accessible, more awe-inspiring while being grounded. Priya Hazra of ScoopWhoop said praised the show by saying that it is an on-point casting & brilliant storytelling that makes 'Rocket Boys' a biopic Bollywood could learn from. It further added that witnessing the historic event unfold, even on the screen, was an overwhelming and proud moment, and given the earnestness with which it was played out made it even better. Pinkvilla gave 4/5 stars and stated that Jim Sarbh and Ishwak Singh fabulously bolster India's empirical history. It also mentioned that Rocket Boys treads a measured pace and gradually develops a story and its characters to make the bigger picture more interesting and entertaining. While the writing, casting, and acting are on point, the show also scores big on its background music and production music. Outlook gave a rating of 4 and said that Jim Sarbh, Ishwak Singh shines in this humanized tale of India's greatest scientists and makes it a wonderful biopic drama that never stops inspiring. Arré's thoughts on Rocket Boys were that the series did a good job of visualizing and explaining technical details to a layperson in a cinematic way. In addition to this, it also said that \"Rocket Boys\" is an important watch to reflect on the dreams of India's OG scientific pioneers and hopefully inspire young minds. Rediff gave a rating of 4 and stated that Rocket Boys is a soaring tribute to the two pillars of India's science world. Shekhar Gupta of The Print criticized in his article titled 'Rocket Boys’ crime on history: Inventing Muslim villain, stealing Meghnad Saha's identity' saying \"That he was from a lower caste, and has mostly been forgotten in our popular memory since (on his centenary in 1993, the Narasimha Rao government issued a postage stamp), probably made it more convenient to bury his character in what pretends to be a “true” history and give him a mostly evil, dark, Muslim avatar. In our book, this is a crime on not just history but on all the ideals so dear to people like Saha, Bhabha and Sarabhai. Remember, those incredible scientists were freedom fighters too.\"\r\nAmrita Shah, author of Vikram Sarabhai – A Life criticised the series for distorting history with fictionalized events, puerile depiction of India's technological programmes in space and nuclear energy and egregious misrepresentation of Sarabhai's character that diminishes his significance and lacks depth without any nuance. Journalist Gita Aravamudan (wife of Ramabhadran Aravamudan and co-author of ISRO: A Personal History) found the series reducing iconic Indian scientists into Bollywood stereotypes, falsifying major events and dates and concocting a fake version of A. P. J. Abdul Kalam that suits the script. She adds that real story of Indian nuclear and space programs is far more richer than fictionalized screen version which ignores scientific and technical aspects of their journey.\r\nThe second season of Rocket Boys received positive reviews from critics as well as the audience.\r\nArchika Khurana of The Times of India called the series a ‘Factual and thrilling drama about Indian scientists.’ Sanyukta Thakare from Mashable said that the series ‘Remains true to its heroes.’ India Today’s Roktim Rajpal called the second season an ‘engaging narrative.’ Dainik Jagran stated the second season is a ‘beautiful portrayal of ambitions.’ The Quint praised the lead actors, saying, ‘Jim and Ishwak confidently carry Homi and Vikram on their shoulders, making us root for their friendship even as they don't see eye to eye on many things.’\r\nFirstpost mentioned that the new season is denser and more conflicted this time.’ The Print called it a ‘heady mix of fact and fiction.’ The New Indian Express noted that the series is ‘A love letter to India and its men of science.’\r\nIndia Forums said, ‘With impeccable performances, fine writing, and crackling music, this season also cannot be missed out on.’ Peeping Moon said, ‘Rocket Boys is hailed as one of the best shows to come out of India and it retains the title with sheer honesty.’ Movie Talkies stated, ‘Every episode ends on an exciting note, which leaves you curious to know what happens next.’\r\nKoimoi’s Shubham Kulkarni stated that the series is ‘more about politics & personal battles than just accolades where the horizon broadens to serve yet another spectacle.’ Pooja Darade from Leisure Byte said that the second season is ‘emotional and thrilling at the same time.’\r\nPublic Reception\r\nRocket Boys gauged a soft spot in the audiences' hearts with its compelling storytelling, impeccable performances by the entire cast and flawless writing. While the internet was flooded with audiences appreciating Rocket Boys, the series was also among the Top 5 most-liked Hindi shows on the Ormax Power Rating (OPR) 2022. In the same year, Rocket Boys made it to the Top 5 on IMDb’s Most Popular Web Series list. Praises from renowned Indian actors like Hrithik Roshan, and Arjun Kapoor added to the hype around the show. Notably, Amul India used its mascot to praise the show in its own quirky way. In 2022, the show garnered over 30 award wins in prominent categories like Best Actor, Best Actress, Best Director and Best Series, among various others.\r\nFollowing the release of Rocket Boys 2 on 16th March 2023, the show received an 8.9 rating on IMDb. The show has gained immense love and appreciation for its inspirational narrative and exceptional performances that have struck a chord with audiences and critics alike. The premiere event of season 2, episode 1, caught praises from Bollywood celebrities like Hrithik Roshan, Srishti Shrivastava, and director Sudhir Mishra.\r\nPromotion\r\nFor season 1, Sony LIV ran an innovative jacket advertisement on India's leading daily, The Times Of India, by taking its readers back to the original headlines covering the day of India's first rocket launch. The advertisement featured a landmark page, taken from the archives.\r\nFor season 2, the Sony LIV team used another innovative jacket advertisement on India's leading daily, The Times Of India. The advertisement recreated headlines covering the success of the nuclear test in 1974 and highlighted the milestones leading up to the success of the test. Additionally to promote Season 2, Sony LIV partnered with popular delivery platforms such as Swiggy India and Zepto to reach a wider audience and increase awareness about the inspiring contributions made by India's greatest minds.\r\nAwards and nominations",
    "html": "<p>Rocket Boys is an Indian Hindi-language biographical streaming television series on SonyLIV. The Series is based on the lives of Homi J. Bhabha and Vikram Sarabhai. It is directed by Abhay Pannu and produced by Siddharth Roy Kapur with Monisha Advani, and Madhu Bhojwani under the banners Roy Kapur Films and Emmay Entertainment, respectively. The series stars Jim Sarbh and Ishwak Singh along with Regina Cassandra.</p><p>The web series was released on 4 February 2022 exclusively on SonyLIV.</p><p>Rocket Boys Season 2 was released on 16th March 2023, exclusively on Sony LIV. The first look for the second season was unveiled on 15 August 2022, on the 75th Indian Independence Day, while the second teaser was released on 12 February 2023. The second teaser focuses on how imperative it was for India to become a nuclear nation amidst imminent global threats of war resulting in India's first nuclear test also known as Pokhran I in 1974. The series will cover the incredible journey of India's greatest scientists as they shape a new era where no one dared to challenge their country's sovereignty.</p><br/><h3>Synopsis</h3><h4>Season 1</h4><p>Rocket Boys is a story of two extraordinary men Dr. Homi J. Bhabha and Dr. Vikram Sarabhai. The story is set around the three crucial decades (1940-60s) in the history of India and how the nation is moving towards being a strong, brave, and independent nation. It is the story of Independent India's formative years in the field of science.</p><p>With dreams in their eyes and a vision in their minds, Dr. Homi J. Bhabha engineered India's Nuclear Programme and Dr. Vikram Sarabhai established the Indian Space Programme and many other institutes. Their journey also involves Mrinalini Sarabhai, a strong pillar in Dr. Sarabhai's life, Dr. A. P. J. Abdul Kalam, who pioneered modern Indian aerospace and nuclear technology, Parvana Irani a close companion of Dr. Bhabha, Raza Mehdi (Not a real person but a fictional character scripted as antagonist for dramatization), a distinguished scientist, and Pandit Jawaharlal Nehru who supported them at every step.</p><p>The season builds upon their friendship, sacrifice, and great determination and how everything led to India's first rocket launch; its emblematic of the journey of India as the country emerges into a new, post-war world.</p><h4>Season 2</h4><p>The second season of Rocket Boys takes place during the early years of independent India when the nation was experiencing political unrest, internal power shifts, and international organizations keeping a close watch on its aspirations. The series continues the account of the extraordinary lives and times of Dr. Homi J. Bhabha, Dr. Vikram Sarabhai, and Dr. A.P.J. Abdul Kalam as they navigate obstacles in their quest to make India a nuclear power.</p><br/><h3>Cast</h3><ul><li>Jim Sarbh as Dr. Homi J. Bhabha</li><li>Ishwak Singh as Dr. Vikram Sarabhai</li><li>Regina Cassandra as Mrinalini Sarabhai</li><li>Saba Azad as Parvana Irani a.k.a. Pipsy</li><li>Rajit Kapur as Jawaharlal Nehru</li><li>T.M. Karthik as C. V. Raman</li><li>Dibyendu Bhattacharya as Raza Mehdi</li><li>Namit Das as Prosenjit Dey</li><li>Arjun Radhakrishnan as Dr. A.P.J. Abdul Kalam</li><li>K.C. Shankar as Vishwesh Mathur</li><li>Neha Chauhan as Kamla Chowdhry</li><li>Rajeev Kachroo as JRD Tata</li><li>Darious Shroff as Jehangir Bhabha</li><li>Anahita Uberoi as Mehreen Bhabha</li><li>Mark Bennington as Robert Crowley</li><li>Arjun Dwivedi as Lt Col Sabharwal</li><li>Ed Robinson as Agent Miller</li><li>Benedict Garrett as William Colby</li><li>Charu Shanker as Indira Gandhi</li><li>Swattee Thakur as Mallika Sarabhai Grace Girdhar as young Mallika Sarabhai</li><li>Grace Girdhar as young Mallika Sarabhai</li><li>Rahul Dev Shetty as Raja Ramanna</li><li>Nilanjan Datta as Pranab Rebatiranjan Dastidar</li><li>Vijay Kasyap as Lal Bahadur Shastri</li></ul><br/><h3>Production</h3><p>The Hari Mahal Palace in Jaipur was used as a location of the \"Retreat\", the Sarabhai family house. The art team met Mallika Sarabhai, daughter of Sarabhai, for detailed information about their home, culture, environment and lifestyle.</p><br/><h3>Episodes</h3><h4>Season 1</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#A4CBB1;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#A4CBB1\">Title</th><th scope=\"col\" style=\"background:#A4CBB1\">Directed by</th><th scope=\"col\" style=\"background:#A4CBB1\">Written by</th><th scope=\"col\" style=\"background:#A4CBB1\">Original release date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"War and Peace\"</td><td style=\"text-align:center\">Abhay Pannu</td><td style=\"text-align:center\">Abhay Pannu, <span>Kausar Munir</span></td><td style=\"text-align:center\">4 February 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A4CBB1\">With a difference of opinion related to the ongoing war, Dr. Homi Bhabha and Dr. Vikram Sarabhai look back at the time when they first met each other.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"It's Like Gravity\"</td><td style=\"text-align:center\">Abhay Pannu</td><td style=\"text-align:center\">Abhay Pannu, <span>Kausar Munir</span></td><td style=\"text-align:center\">4 February 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A4CBB1\">As Homi and Vikram's friendship grows, an unexpected roadblock leads them to meet a few people who will alter the course of their lives.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Greater Good\"</td><td style=\"text-align:center\">Abhay Pannu</td><td style=\"text-align:center\">Abhay Pannu, <span>Kausar Munir</span></td><td style=\"text-align:center\">4 February 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A4CBB1\">Homi and Vikram set out on their individual paths in hopes to achieve their dreams.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"A Tryst with Destiny\"</td><td style=\"text-align:center\">Abhay Pannu</td><td style=\"text-align:center\">Abhay Pannu, <span>Kausar Munir</span></td><td style=\"text-align:center\">4 February 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A4CBB1\">Emerging as an Independent country, Homi and Vikram share their vision for the country. A new face comes to light while a threat lurks in the shadow.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Outsider\"</td><td style=\"text-align:center\">Abhay Pannu</td><td style=\"text-align:center\">Abhay Pannu, <span>Kausar Munir</span></td><td style=\"text-align:center\">4 February 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A4CBB1\">Homi and Vikram face a backlash both at personal and professional life.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"A Democratic Process\"</td><td style=\"text-align:center\">Abhay Pannu</td><td style=\"text-align:center\">Abhay Pannu, <span>Kausar Munir</span></td><td style=\"text-align:center\">4 February 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A4CBB1\">Their ideas and ambitions are challenged by a fierce rebellion. They must choose a path that they deem fit.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"We are at War\"</td><td style=\"text-align:center\">Abhay Pannu</td><td style=\"text-align:center\">Abhay Pannu, <span>Kausar Munir</span></td><td style=\"text-align:center\">4 February 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A4CBB1\">While India gets ready to take its first step in Nuclear science, another dream gets into acceleration, but an impending war threatens to tear it all down.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"A New Dawn\"</td><td style=\"text-align:center\">Abhay Pannu</td><td style=\"text-align:center\">Abhay Pannu, <span>Kausar Munir</span></td><td style=\"text-align:center\">4 February 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A4CBB1\">As the country starts to heal the wound from the war, the great men come together for one final showdown to do the impossible.</td></tr></tbody></table><h4>Season 2</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#A4CBB1;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#A4CBB1\">Title</th><th scope=\"col\" style=\"background:#A4CBB1\">Directed by</th><th scope=\"col\" style=\"background:#A4CBB1\">Written by</th><th scope=\"col\" style=\"background:#A4CBB1\">Original release date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Lift Off\"</td><td style=\"text-align:center\">Abhay Pannu</td><td style=\"text-align:center\">Abhay Pannu, <span>Kausar Munir</span></td><td style=\"text-align:center\">16 March 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A4CBB1\">Dr. Vikram Sarabhai is getting ready to launch a rocket when he finds out that the entire space programme might be in danger. On the other hand, Dr. Homi J. Bhabha is juggling between his aspirations and threats to his life.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Burden Of Proof\"</td><td style=\"text-align:center\">Abhay Pannu</td><td style=\"text-align:center\">Abhay Pannu, <span>Kausar Munir</span></td><td style=\"text-align:center\">16 March 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A4CBB1\">Vikram's ambition falters prior to taking off. Mrinalini makes a daring move to assert her right as he tries to make progress. Homi's deeds in the meantime drive the enemy to act. Is he prepared to take part in battle despite being invited?</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"A Lasting Legacy\"</td><td style=\"text-align:center\">Abhay Pannu</td><td style=\"text-align:center\">Abhay Pannu, <span>Kausar Munir</span></td><td style=\"text-align:center\">16 March 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A4CBB1\">As political vultures close ranks, the nation experiences a severe loss and a change in power is organised. Vikram and Homi are compelled to choose a side. Would they continue to put their country before themselves in the face of an uncertain future?</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Price Of War\"</td><td style=\"text-align:center\">Abhay Pannu</td><td style=\"text-align:center\">Abhay Pannu, <span>Kausar Munir</span></td><td style=\"text-align:center\">16 March 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A4CBB1\">While Homi fights for his life in a race against the clock, Indira tries to emerge from her father's enormous shadow. While the nation is under threat of a new war, Vikram and Mrinalini fight on the home front.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Behind Enemy Lines\"</td><td style=\"text-align:center\">Abhay Pannu</td><td style=\"text-align:center\">Abhay Pannu, <span>Kausar Munir</span></td><td style=\"text-align:center\">16 March 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A4CBB1\">Homi disregards caution and engages the adversary head-on as India's nuclear future is on the line. The distance between Vikram and Homi is widening as he mulls over forgiving him.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Power Over Peace\"</td><td style=\"text-align:center\">Abhay Pannu</td><td style=\"text-align:center\">Abhay Pannu, <span>Kausar Munir</span></td><td style=\"text-align:center\">16 March 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A4CBB1\">Vikram assumes a new role that is directly opposed to all he holds dear. He is compelled to face the past and the truths hidden in it even as he has hope for the future.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Last Guard\"</td><td style=\"text-align:center\">Abhay Pannu</td><td style=\"text-align:center\">Abhay Pannu, <span>Kausar Munir</span></td><td style=\"text-align:center\">16 March 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A4CBB1\">While Homi's plans for the future of the nation's nuclear programme begin to take shape, a wonderful new chapter in India's satellite programme begins. But an unexpected tragedy upsets the balance.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Smiling Buddha\"</td><td style=\"text-align:center\">Abhay Pannu</td><td style=\"text-align:center\">Abhay Pannu, <span>Kausar Munir</span></td><td style=\"text-align:center\">16 March 2023</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #A4CBB1\">India and its experts have just eight hours to accomplish an impossibly difficult task in the world's greatest race against time.</td></tr></tbody></table><br/><h3>Reception</h3><p>The show received positive reviews from critics and audience, with praise for the performances, direction, writing and other technical aspects.</p><p>The Times of India gave a rating of 3.5 and stated that Jim Sarbh and Ishwak Singh's show is a glowing tribute to India's scientific luminaries. Further, they also said that the show is captivating from the start. Anuj Kumar of The Hindu mentioned that the lead actors Jim Sarbh and Ishwak Singh head a fantastic ensemble cast that gloriously brings to life the achievements of the scientific community in launching India's atomic and space programs. Shefali Deshpande of The Quint gave 4.5/5 stars and said that Rocket Boys is the kind of story that the Oscars and the people at BAFTA look for. In addition to this they also stated that the top-notch acting, storytelling, direction, and music, with actual footage from back in the day and audio to go along with it, this show is here to win slow, steady, and big. Moneycontrol said in their article that Roy Kapur Films, Emmay Entertainment, and SonyLIV together put up a brilliant show that is unmissable. Shubhra Gupta of The Indian Express mentioned Rocket Boys is an absorbing state-of-the-nation saga and both Jim Sarbh and Ishwak Singh are excellent. Hindustan Times expressed Rocket Boys as one of the web series with the most well-crafted, earnestly performed, and tightly-written scenes. Moreover, it also said that the show is a shining star on the streamer's roster. The Scroll.in wrote that Rocket Boys is fuelled by vaulting ambition on the screen and beyond, and it's a heady mix of research and creative liberty, pop quiz-level trivia, and a flair for drama. NDTV Gadgets 360 said that Abhay Pannu's Rocket Boys delivers in spades with the story of Homi Bhabha and Vikram Sarabhai and mentioned India comes of age in SonyLIV's terrific new series. NDTV gave a 3.5 rating to Rocket Boys and further said that The series gets the science of blending fact and fiction absolutely right and delivers a viewing experience that is a marked remove from generic shows. ThePrint featured Rocket Boys as a unique blend of science and the everyday, personal and political, fact and fiction, that makes science less elite, more accessible, more awe-inspiring while being grounded. Priya Hazra of ScoopWhoop said praised the show by saying that it is an on-point casting & brilliant storytelling that makes 'Rocket Boys' a biopic Bollywood could learn from. It further added that witnessing the historic event unfold, even on the screen, was an overwhelming and proud moment, and given the earnestness with which it was played out made it even better. Pinkvilla gave 4/5 stars and stated that Jim Sarbh and Ishwak Singh fabulously bolster India's empirical history. It also mentioned that Rocket Boys treads a measured pace and gradually develops a story and its characters to make the bigger picture more interesting and entertaining. While the writing, casting, and acting are on point, the show also scores big on its background music and production music. Outlook gave a rating of 4 and said that Jim Sarbh, Ishwak Singh shines in this humanized tale of India's greatest scientists and makes it a wonderful biopic drama that never stops inspiring. Arré's thoughts on Rocket Boys were that the series did a good job of visualizing and explaining technical details to a layperson in a cinematic way. In addition to this, it also said that \"Rocket Boys\" is an important watch to reflect on the dreams of India's OG scientific pioneers and hopefully inspire young minds. Rediff gave a rating of 4 and stated that Rocket Boys is a soaring tribute to the two pillars of India's science world. Shekhar Gupta of The Print criticized in his article titled 'Rocket Boys’ crime on history: Inventing Muslim villain, stealing Meghnad Saha's identity' saying \"That he was from a lower caste, and has mostly been forgotten in our popular memory since (on his centenary in 1993, the Narasimha Rao government issued a postage stamp), probably made it more convenient to bury his character in what pretends to be a “true” history and give him a mostly evil, dark, Muslim avatar. In our book, this is a crime on not just history but on all the ideals so dear to people like Saha, Bhabha and Sarabhai. Remember, those incredible scientists were freedom fighters too.\"</p><p>Amrita Shah, author of Vikram Sarabhai – A Life criticised the series for distorting history with fictionalized events, puerile depiction of India's technological programmes in space and nuclear energy and egregious misrepresentation of Sarabhai's character that diminishes his significance and lacks depth without any nuance. Journalist Gita Aravamudan (wife of Ramabhadran Aravamudan and co-author of ISRO: A Personal History) found the series reducing iconic Indian scientists into Bollywood stereotypes, falsifying major events and dates and concocting a fake version of A. P. J. Abdul Kalam that suits the script. She adds that real story of Indian nuclear and space programs is far more richer than fictionalized screen version which ignores scientific and technical aspects of their journey.</p><p>The second season of Rocket Boys received positive reviews from critics as well as the audience.</p><p>Archika Khurana of The Times of India called the series a ‘Factual and thrilling drama about Indian scientists.’ Sanyukta Thakare from Mashable said that the series ‘Remains true to its heroes.’ India Today’s Roktim Rajpal called the second season an ‘engaging narrative.’ Dainik Jagran stated the second season is a ‘beautiful portrayal of ambitions.’ The Quint praised the lead actors, saying, ‘Jim and Ishwak confidently carry Homi and Vikram on their shoulders, making us root for their friendship even as they don't see eye to eye on many things.’</p><p>Firstpost mentioned that the new season is denser and more conflicted this time.’ The Print called it a ‘heady mix of fact and fiction.’ The New Indian Express noted that the series is ‘A love letter to India and its men of science.’</p><p>India Forums said, ‘With impeccable performances, fine writing, and crackling music, this season also cannot be missed out on.’ Peeping Moon said, ‘Rocket Boys is hailed as one of the best shows to come out of India and it retains the title with sheer honesty.’ Movie Talkies stated, ‘Every episode ends on an exciting note, which leaves you curious to know what happens next.’</p><p>Koimoi’s Shubham Kulkarni stated that the series is ‘more about politics & personal battles than just accolades where the horizon broadens to serve yet another spectacle.’ Pooja Darade from Leisure Byte said that the second season is ‘emotional and thrilling at the same time.’</p><h4>Public Reception</h4><p>Rocket Boys gauged a soft spot in the audiences' hearts with its compelling storytelling, impeccable performances by the entire cast and flawless writing. While the internet was flooded with audiences appreciating Rocket Boys, the series was also among the Top 5 most-liked Hindi shows on the Ormax Power Rating (OPR) 2022. In the same year, Rocket Boys made it to the Top 5 on IMDb’s Most Popular Web Series list. Praises from renowned Indian actors like Hrithik Roshan, and Arjun Kapoor added to the hype around the show. Notably, Amul India used its mascot to praise the show in its own quirky way. In 2022, the show garnered over 30 award wins in prominent categories like Best Actor, Best Actress, Best Director and Best Series, among various others.</p><p>Following the release of Rocket Boys 2 on 16th March 2023, the show received an 8.9 rating on IMDb. The show has gained immense love and appreciation for its inspirational narrative and exceptional performances that have struck a chord with audiences and critics alike. The premiere event of season 2, episode 1, caught praises from Bollywood celebrities like Hrithik Roshan, Srishti Shrivastava, and director Sudhir Mishra.</p><br/><h3>Promotion</h3><p>For season 1, Sony LIV ran an innovative jacket advertisement on India's leading daily, The Times Of India, by taking its readers back to the original headlines covering the day of India's first rocket launch. The advertisement featured a landmark page, taken from the archives.</p><p>For season 2, the Sony LIV team used another innovative jacket advertisement on India's leading daily, The Times Of India. The advertisement recreated headlines covering the success of the nuclear test in 1974 and highlighted the milestones leading up to the success of the test. Additionally to promote Season 2, Sony LIV partnered with popular delivery platforms such as Swiggy India and Zepto to reach a wider audience and increase awareness about the inspiring contributions made by India's greatest minds.</p><br/><h3>Awards and nominations</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><caption></caption><tbody><tr><th><b>Year</b></th><th><b>Awards</b></th><th><b>Winner</b></th><th><b>Category</b></th><th>Ref</th></tr><tr><td rowspan=\"8\">2022</td><td rowspan=\"8\"><span>Filmfare OTT Awards 2022</span></td><td>Abhay Pannu</td><td>Best Director, Series</td><td></td></tr><tr><td></td><td>Best Series</td></tr><tr><td><span>Jim Sarbh</span></td><td>Best Actor, Critics Drama</td><td></td></tr><tr><td>Harshveer Oberai</td><td>Best Cinematographer, Series</td><td></td></tr><tr><td>Abhay Pannu</td><td>Best Original Screenplay, Series</td><td></td></tr><tr><td>Meghna Gandhi</td><td>Best Production Design, Series</td><td></td></tr><tr><td>Biju &amp; Uma</td><td>Best Costume Design, Series</td><td></td></tr><tr><td>Variate Studio</td><td>Best VFX, Series</td><td></td></tr><tr><td rowspan=\"4\">2022</td><td rowspan=\"4\">Indian Telly Streaming Awards 2022</td><td></td><td>Best Story</td><td></td></tr><tr><td></td><td>Best Series - Hindi</td><td></td></tr><tr><td><span>Jim Sarbh</span></td><td>Best Actor - Hindi Series</td><td></td></tr><tr><td>Harshvir Oberai</td><td>Best D.O.P - Hindi Series</td><td></td></tr><tr><td rowspan=\"6\">2022</td><td rowspan=\"6\">Indian Television Academy Awards 2022 (ITA)</td><td>Abhay Pannu</td><td>Best Director</td><td></td></tr><tr><td></td><td>Best Web Series</td></tr><tr><td>Abhay Pannu, Abhay Korane</td><td>Best Story</td><td></td></tr><tr><td>Jim Sarbh</td><td>Best Actor Web Series</td><td></td></tr><tr><td>Maahir Zaveri</td><td>Best Editor</td><td></td></tr><tr><td>Variate Studio</td><td>Best VFX</td><td></td></tr><tr><td rowspan=\"8\">2022</td><td rowspan=\"8\">SPOTT Awards 2022</td><td></td><td>Drama Show on Web</td><td></td></tr><tr><td></td><td>Web Series - Hindi Fiction Show</td></tr><tr><td>Abhay Pannu</td><td>Director of the year</td><td></td></tr><tr><td>Maahir Zaveri</td><td>Editor of the year</td><td></td></tr><tr><td>Jim Sarbh</td><td>Performance in a leading role ( Male)</td><td></td></tr><tr><td><span>Regina Cassandra</span></td><td>Performance in a leading role ( Female)</td><td></td></tr><tr><td><span>Saba Azad</span></td><td>Performance in a supporting role ( Female)</td><td></td></tr><tr><td>Harshvir Oberai</td><td>Cinematographer of the year</td><td></td></tr><tr><td rowspan=\"2\">2022</td><td rowspan=\"2\">Yellowstone International Film Festival Awards 2022 (YIFF)</td><td>Jim Sarbh</td><td>Outstanding Performances in a show (Male)</td><td></td></tr><tr><td>Ishwak Singh</td><td>Outstanding Performances in a show (Male)</td><td></td></tr><tr><td rowspan=\"2\">2022</td><td colspan=\"2\" rowspan=\"2\">Promax Asia 2022</td><td>Best Drama Promo (Gold)</td><td></td></tr><tr><td>Best Launch Campaign (Silver)</td><td></td></tr><tr><td>2022</td><td>Digital ReInvent 2022</td><td></td><td>Best Trailer Programme - (Gold)</td><td></td></tr><tr><td>2023</td><td>Hitlist OTT Awards Season 4</td><td><span>Ishwak Singh</span></td><td>Best Actor - Male</td><td></td></tr><tr><td rowspan=\"3\">2023</td><td rowspan=\"3\">Critics Choice Awards</td><td></td><td>Best Web Series</td><td></td></tr><tr><td>Jim Sarbh</td><td>Best Actor</td></tr><tr><td>Abhay Pannu, Kausar Munir</td><td>Best Writing</td><td></td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}