{
  "imDbId": "tt0988818",
  "title": "Gintama",
  "fullTitle": "Gintama (TV Series 2005–2021)",
  "type": "TVSeries",
  "year": "2005",
  "items": [
    {
      "username": "wakemeup36",
      "userUrl": "https://www.imdb.com/user/ur18902470",
      "reviewLink": "https://www.imdb.com/review/rw2176650",
      "warningSpoilers": false,
      "date": "19 December 2009",
      "rate": "10",
      "helpful": "180 out of 188 found this helpful.",
      "title": "One of the greatest pieces of entertainment ever",
      "content": "Every anime has it's funny, even hilarious moments. But not many are built around these moments. Gintama, for the most part definitely is.This anime is completely insane. It's full of random hilarity and antics, while still maintaining a storyline (per episode and arcs). You don't even have to worry about fillers, because you won't know when they hit you, as there is no general plot. Plus, the fillers are just as funny and awesome as the other episodes, if not more. There are tons of references to anime and Japanese culture, which is kind of a down side for a person who isn't familiar with either or both. This reason also makes this anime almost impossible to dub and very hard to even sub! However, if you do get the jokes (and not all of them are reference related), you'll be in tears. It's not all just laughter though. There are definitely some heart touching, throat lump forming, beautiful moments in the anime too (though not as much).All I can say is, if you're an anime fan and haven't watched it, you're doing yourself a big crime by missing this one. As the title says, I not only class this as one of the greatest anime, or even one of the greatest TV shows, but one of the most brilliant pieces of entertainment mankind has ever created."
    },
    {
      "username": "black-32147",
      "userUrl": "https://www.imdb.com/user/ur74248811",
      "reviewLink": "https://www.imdb.com/review/rw3779562",
      "warningSpoilers": false,
      "date": "13 August 2017",
      "rate": "10",
      "helpful": "46 out of 47 found this helpful.",
      "title": "Funniest show I've ever seen, super enjoyable!",
      "content": "I absolutely 100% recommend everyone to watch it from the very start and please ignore the image quality, before you know it you will love the show so much it won't matter and then the quality gets much better in 2015 and 2017 releases. An anime that suits almost everyone..great comedy, tons of parodies, very likable characters, great action and fights, very heart warming at times...just about everything you could think of!"
    },
    {
      "username": "blackmamba99971",
      "userUrl": "https://www.imdb.com/user/ur18437585",
      "reviewLink": "https://www.imdb.com/review/rw3046093",
      "warningSpoilers": true,
      "date": "7 July 2014",
      "rate": "10",
      "helpful": "25 out of 29 found this helpful.",
      "title": "Lmfao",
      "content": "When it comes to comedy this show delivers just about the nastiest, funniest, and down right gritty series to date. Gintama, quite possibly the dumbest individual on the planet. But in all fairness his sight for the obvious can often leave you in stitches with endless laughter. The series takes place in old Edo where in iron town the populace is protected by just about anyone that has grown up there.However, with Gintama, and his oddball group doing odd jobs around the neighbourhood it's no wonder that nobody asks them for help. He is a samurai, one that delves in the old school way of wielding a sword although the alien groups that landed on earth forbids it at any cost. Now and then his posse must fight off the outcast aliens with every resource in their arsenal. That is with slapstick jibes, jokes, insults, and rather skanky girls dressed kimonos.Pair this up with an objective within his group they create scenarios for themselves, which often gets mixed up with other scenarios that leads to other scenarios, and so on... etc etc. Yet through all of their mishaps, and tongue tripping ideas they always manage to come out smelling like a rose.I found this series to be a kind meant for the low brow, low education, and nearly poor crowd. But it fits for the times of yesteryear struggles in Japan. Everyday conflicts with endless hierarchy misfits in the background watching their every move ready to strike back at the common folk who built the cities for the Shogun families. One needs to have a sense of humour to live or to die on their knees facing defeat.Gintama has it all... humour, laughs galore, great music... crude, and often gross conduct in certain montages of story telling. It also shapes the human condition with stories of sadness, and some tragedies, which befit some of the more colourful characters. Especially with Gintama, and his partners Shinpachi, and Kagura. Without them his way of life would be boring.I have to give this series ten stars for all of the ingredients put into it. If you have a day off, try and watch this funny, and fast paced show. You will not regret it. Highly recommended to those aged 14, and above. Not for minors."
    },
    {
      "username": "jmb-30435",
      "userUrl": "https://www.imdb.com/user/ur61558383",
      "reviewLink": "https://www.imdb.com/review/rw4855988",
      "warningSpoilers": false,
      "date": "15 May 2019",
      "rate": "10",
      "helpful": "20 out of 22 found this helpful.",
      "title": "Best of all time",
      "content": "Epic What can I say more than that the only thing that make laugh And cry and extremely excited best of all time."
    },
    {
      "username": "quynhgiaocao",
      "userUrl": "https://www.imdb.com/user/ur67107088",
      "reviewLink": "https://www.imdb.com/review/rw3469954",
      "warningSpoilers": true,
      "date": "14 May 2016",
      "rate": "10",
      "helpful": "22 out of 24 found this helpful.",
      "title": "An anime could brought you all kinds of emotions",
      "content": "Gintama is probably my favorite anime ever. It contains almost all kinds of tags (well, maybe not all but it's a lot). One of the best comedies ever. The firstly episodes, the anime was somewhat boring but if you keep patient and continue to watch, it will eventually become much better. The jokes are super hilarious and could makes you have a stomachache from laughing too much. Though the jokes are somehow ... dirty (some of it talk about balls, penis, etc. but still awesome jokes). The anime was also unique and famous for the ability to 'break the fourth wall' - in some episodes, even the characters just sitting there and complaining about the staff was too lazy, or the anime was too boring. The anime is just too funny and too good for entertaining. But that's not all. Gintama is the kind of anime could brought you all kinds of emotions: Happy, sad, angry, ... This anime is funny but it do have serious and tearjerker scenes (this happened surprisingly often in a comedy anime). When it comes to serious, the action was great and the power was so wonderful than you ever expected in a comedy anime. And especially Gintama have lots of tearjerker moments and sad pasts. Gintoki, the main character is a 'lazy poop samurai' - everyone think like that. Nobody knows that he has a sad past (he has no family, his teacher dead because of him, became homeless, ...) So as Kagura, the main female character - her mom dead, her dad always go away without looked after her, her brother joined Harusame, her whole family was corrupted...). The lately arcs in the anime (and chapters in manga) show that the anime is not always funny as everyone thinking. Highly recommended. It surely suitable for comedy - fans and sometimes tragedy - fans too."
    },
    {
      "username": "GangsterLuffy",
      "userUrl": "https://www.imdb.com/user/ur63295265",
      "reviewLink": "https://www.imdb.com/review/rw6637160",
      "warningSpoilers": false,
      "date": "26 February 2021",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "One of the greatest if not greatest Anime of all time!",
      "content": "This anime is great in every aspect . funniest anime by far , has some of the greatest fights ever ,so many awesome characters which all have their own style, great story , so many great OST's . there are only 3 shows in anime that i can call godtier this one is one of them for sure and I have seen allot of them."
    },
    {
      "username": "dharnikudal",
      "userUrl": "https://www.imdb.com/user/ur82792108",
      "reviewLink": "https://www.imdb.com/review/rw7275755",
      "warningSpoilers": false,
      "date": "27 August 2021",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "A show that will turn your soul silver",
      "content": "Let's be honest, it's long (560+ episodes) and starts of slow, but these imperfections are what made Gintama perfect.The lore is amazing!The character arcs of the main characters as well as the side characters are just as perfect and satisfying.It has the wonderful elements of comedy, sci-fi, action...and you know what, watch it for yourself!"
    },
    {
      "username": "rashunit-singh",
      "userUrl": "https://www.imdb.com/user/ur27400009",
      "reviewLink": "https://www.imdb.com/review/rw6379418",
      "warningSpoilers": false,
      "date": "19 December 2020",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Review score says it all.",
      "content": "The voice acting in this anime is so good that the characters feel almost real. Plus the comedy in it is better than any sitcom that you can think of. I my opinion, Gintama is much better than the Big three animes( Naruto, One Piece and Bleach.)"
    },
    {
      "username": "tmssenglish",
      "userUrl": "https://www.imdb.com/user/ur119695734",
      "reviewLink": "https://www.imdb.com/review/rw5820113",
      "warningSpoilers": false,
      "date": "13 June 2020",
      "rate": "10",
      "helpful": "19 out of 21 found this helpful.",
      "title": "Just Fantastic",
      "content": "This show engrosses you into its settings, themes, and characters so much that it becomes more than just a comedy. This anime got me near tears more than anything I have every experienced from both comedy and emotional moments. On top of that, this show has the two best shonen arcs to ever exist. This anime might take a while to get in to, but it is more than worth the commitment."
    },
    {
      "username": "arctikice",
      "userUrl": "https://www.imdb.com/user/ur64965004",
      "reviewLink": "https://www.imdb.com/review/rw3410588",
      "warningSpoilers": false,
      "date": "8 February 2016",
      "rate": "10",
      "helpful": "60 out of 66 found this helpful.",
      "title": "Wayyy Better than Most Comedies and Action Flicks",
      "content": "I've been watching TV shows, anime and movies for a very long time and i have watched shows like Seinfeld, How i Met your Mother, Friends, Curb your Enthusiasm, Arrested Development, Two and a half men, and many more. However, after watching Gintama, i have to say that this show is better than any other comedy show i have ever seen. The jokes are done so brilliantly that it legitimately makes you laugh out loud. Furthermore, every single character has been given a persona which suits their personality so incredibly well. The best part of the show is that each character is treated as they are the main character. If one of them doesn't show up for some time, you'll start to miss them.This is just the comedy part though, when the show gets serious - boy it gets serious. It's like you're transported into a completely different anime. The action scenes are so fluent and so perfectly crafted that you will be at the edge of your seat the entire time. These action arcs last for about 2 to 5 episodes - they have a beginning, a mid-point, and an end. They aren't dragged like most anime. Each serious or action arc of the show highlights the characters and provide hindsight in their lives, allowing viewers to know them better.This emotional connection with the characters is what's missing in most action movies, TV shows and anime but in Gintama, it's remarkably well done. Also, there's a balance between comedy and action, so you won't be stuck in one genre the entire time. I had my reservations about watching Gintama, especially after watching the first few episodes. However, when I got through them, the show started to get a whole lot funnier and better. It seems that writer wasn't too confident in his work in the beginning but when he started to see how well his work can be, he started to take risks and came up with some of the best comedy and action arcs that I've ever seen.Having watched a ton of TV shows, movies, and anime - I have to say that Gintama is (and probably will be) the best piece of entertainment I've watched in my whole life."
    },
    {
      "username": "spookybuk",
      "userUrl": "https://www.imdb.com/user/ur16562189",
      "reviewLink": "https://www.imdb.com/review/rw5281323",
      "warningSpoilers": false,
      "date": "26 November 2019",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Just another 10 star review for Gintama",
      "content": "I'm just another person here to tell you this show is amazing, though difficult to start. I abandoned it twice, before I got to the point of \"Ok, now I see why so many people say this anime is amazing.\"It is amazing.I don't think the first episodes are actually bad - I think I was the one who wasn't ready to understand and enjoy the show yet. It certainly gets a lot better and it doesn't take long - but as the story unfolds and amazing plots and jokes come along, there is also an understanding that comes slowly, from which a whole world of subtlety and nuances become accessible. This is what made the show amazing to me.At the same period of time I was watching the first 100-and-something episodes of this show, I was also reading \"The Complete Works of Zhuangzi\" (a famous book from Taoism, that later would mingle with Buddhism in China and, eventually, become Zen Buddhism is Japan). It was a great combination.The books describes the heart of the philosophy that later would give birth to Zen Buddhism - an important part of the Japanese culture, that helps to better understand the anime - and the anime demonstrates, in modern terms, some of the most sophisticated applications of that philosophy at practice. Even if it is fictional, it depicts behaviors and situations we can understand and relate to."
    },
    {
      "username": "umlaziking",
      "userUrl": "https://www.imdb.com/user/ur110613987",
      "reviewLink": "https://www.imdb.com/review/rw6635544",
      "warningSpoilers": false,
      "date": "25 February 2021",
      "rate": "10",
      "helpful": "33 out of 54 found this helpful.",
      "title": "This show is at 8.6????......i dont get it",
      "content": "This show has so many episodes that are rated above 9....but imdb decided that the overall rating this tv show deserves is 8.6, that makes no sense at all. Just look at season 4s ratings, imdb.....dont be stupid...this tv show obviously deserves a way better rating than 8.6, honestly. This is not the only anime you guys have rated really low....attack on titan is another victim of this....imdb, just do the right thing, you guys know the truth and i believe i am not the only one who believes and thinks this way."
    },
    {
      "username": "caitlynharris334",
      "userUrl": "https://www.imdb.com/user/ur50753242",
      "reviewLink": "https://www.imdb.com/review/rw4188063",
      "warningSpoilers": false,
      "date": "2 June 2018",
      "rate": "10",
      "helpful": "28 out of 30 found this helpful.",
      "title": "Unique & Hilarious",
      "content": "I rarely laugh aloud when watching comedic shows, especially anime. Gintama can get me laughing for an entire episode! The humor only gets better as you go along, as you need to get to know the characters to appreciate the jokes/jibes fully. And then all of a sudden a serious arc slaps you in the face with nonstop action and cliffhanger episodes. Gintama is 70% humor and 30% Hunter x Hunter level action (for you shounen anime fans, I think you can recognize that high level compliment.) It just makes the action scenes that much more worth it and exciting when you get there. Not to mention the \"serious arcs\" somehow get even more intense and well animated the further you get, too. I'm SO happy I gave this one a try!"
    },
    {
      "username": "Erdallianz",
      "userUrl": "https://www.imdb.com/user/ur35883093",
      "reviewLink": "https://www.imdb.com/review/rw2678542",
      "warningSpoilers": false,
      "date": "22 September 2012",
      "rate": "10",
      "helpful": "82 out of 120 found this helpful.",
      "title": "THis anime is a QUADRILLION times better than Cowboy bebop",
      "content": "This anime is the funniest show ever created - not even the simpsons, south park and Family guy combined would have 1/3 of the funniness of this series.It doesn't have an overall plot - but as a comedy series it doesn't need one - and there are a lot of longer stories which serve to give you spledid action and emotion.But what makes this series really epic is the fact that it manages to stay funny for every minute of every of the over 250 episodes! At some episodes you simply cant stop to laugh - not for one single second - And this despite the fact that many of the references are aimed for a Japanese audience.But even without getting all the Japan- related jokes one still has to watch out not to die from laughter! I would give this show a 11 or 12 or 15 out of 10 if I could!"
    },
    {
      "username": "Abdus94",
      "userUrl": "https://www.imdb.com/user/ur124149507",
      "reviewLink": "https://www.imdb.com/review/rw7069605",
      "warningSpoilers": false,
      "date": "27 June 2021",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "The one",
      "content": "I have only one thing to say, gintama is the greatest anime of all time hands down no other anime can ever reach or if not come close to it's heightGintama is not anime it is life itself it teaches you how important are the people around you and it gives its unique meaning of life if not the perfect one and how it should be livedForever yorozuya."
    },
    {
      "username": "kegebler",
      "userUrl": "https://www.imdb.com/user/ur87242396",
      "reviewLink": "https://www.imdb.com/review/rw8392512",
      "warningSpoilers": false,
      "date": "2 August 2022",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Never laughed and cried so much.",
      "content": "I do not know who wrote this but they are literal geniuses. The Cadence and direction of this anime is anyone to guess, but when they want to be serious it's amazing, when it's funny I laughed my ass off, and when they want to get deep I have cried. I have definitely watched all the big Shonen and have been an anime fan for over 25 years. I am just getting in the middle of gintama. But I will finish it I have heard such great things and I can only agree. Anyone can watch it you your girlfriend doesn't matter it touches on all aspects of life."
    },
    {
      "username": "ronin1412",
      "userUrl": "https://www.imdb.com/user/ur19732143",
      "reviewLink": "https://www.imdb.com/review/rw3613955",
      "warningSpoilers": false,
      "date": "5 January 2017",
      "rate": "10",
      "helpful": "37 out of 43 found this helpful.",
      "title": "Most underrated anime",
      "content": "I'm not anime veteran (I've seen only few dozens titles), I'm not Japanese, I haven't read manga, but I'm still able to enjoy Gintama anime. And enjoy it a lot. Perfect drama / comedy ratio for satirical show keeps me watching one episode after another. Arcs are mostly short, condensed and even recaps for them are really refreshing. I know it is almost impossible to sub/dub this thing (without or even with comments) but people make a great things great and even I could understand most of the puns / jokes. And there is a lot, even in one sentence. That's Gintama for you :D. And now for really technical review: - Story: None - or almost none. There's some background, but it's irrelevant in most cases. It's slowly revealed in some arcs. What could you expect from satire / comedy? - Characters: Awesome - as one of the episodes claims - there isn't one main character - and it's actually true. Fact: Gin-san is most recognizable but most of the episodes doesn't revolve around him. There are a lot of multi-dimensional characters, which makes this anime working. - Visualization: You cannot predict what would be presented to you in the next episode. It could be standard slow paced animation (even some stills), CGI/3D saturated picture or even live action. - Music - It is well paced, suitable. Some pieces are borrowed / covered, but still epic (i.e. Madao send from DMC4). Overall: I could recommend this for all anime fans. It could be hard to watch for inexperienced watchers, which could not understand some of the references / digs (like me), but I am sure they'll have a lot of fun watching this. PS. This is my first review after ~2k watched movies/series and about the same or even more review - so be gentle, please. PS2. English is not my first language, so I apologize for any mishaps. PS3: I''m really disappointed by so few reviews on Gintama. PS4. Watch Gintama: it's awesome"
    },
    {
      "username": "ika_chelo",
      "userUrl": "https://www.imdb.com/user/ur24751557",
      "reviewLink": "https://www.imdb.com/review/rw7338030",
      "warningSpoilers": false,
      "date": "13 September 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Just watch it ! It's an order.... seriously do it.",
      "content": "So what is that we love about anime? E V E R Y T H I N G.... and Gintama is and has everything ! Do you want to laugh until tears. Gintama gonna make you. Want some action? Gintama brings the fiaaahhhh ! It really does amazing fighting scenes. Want interesting, funy, badass characters. You know the answer. Every opening and ending songs are amazing! Trust me on that one. I can go on and on and on and on.....JUST watch it!P. S. Gin saaan fo evah!"
    },
    {
      "username": "aensen-16025",
      "userUrl": "https://www.imdb.com/user/ur65891756",
      "reviewLink": "https://www.imdb.com/review/rw3432920",
      "warningSpoilers": true,
      "date": "17 March 2016",
      "rate": "10",
      "helpful": "22 out of 24 found this helpful.",
      "title": "\"I don't need to understand... Chocolate Parfaits?!\"",
      "content": "So here goes, this is my first movie/anime review ever, but I shall try and be as unbiased as possible (which will be hard).\"Gintama\" revolves around a man named Gintoki, a samurai. In always dire need of money, together with his associates Shinpachi and Kagura, they do all kinds of tasks: menial or noble. The story is set in a futuristic Japan, called Edo. Controlled by powerful alien Amanto; leaving only a small vestige of power to the human shogun, trying his best to scramble the pieces of a war-torn country. There are several factions involved, inspired and drawing many references from feudal Japan. We meet Gintoki as an owner of a not so prosperous establishment, which deals in so-called \"odd Jobs\".Driven by a rather ambiguous moral compass, Gintoki tends to find himself in rather wacky situations. The show is hilarious to say the least, though on the other end of the specter, tear-invoking and/or bloody serious. There is a loose red thread, mainly focusing on Gintoki's past as a samurai, but the general theme of the show is episodic comedy. Gintama has a lot of pop- and cultural references, which might leave many non-Japanese clueless about what they are actually laughing about. Which brings me to the magic of this show: you don't have to get it, you simply don't. First things first though, pop-references aside, Gintama might deliver the very finest comedy on this planet. Slap-stick, smart jokes, dark jokes, one- liners, facial expressions, awkward silence, body language, embarrassing sexual tension, this show plays all the right strings. Though slightly inconsistent, enhanced by an good display of animation, Gintama brings comedy, action and drama on screen like no other anime. The animation is usually done in a manner befitting the current state of the show. When there is no overlaying story-arc involved, the animation may even be down right non- existent. This is intended though, as a running gag through the series play on the \"fact\" that the producer of the show is actually a gorilla. Needless to say, the show do tend to break the fourth wall, leaving some rather hilarious interactions with it's audience. On the other hand, when the story moves from episodic silliness to the more story-driven arcs, you will notice a clear shift in the animation style. The combat scenes are especially delightful, full of gritty swordsmanship and martial arts. The movements are sharp and visual, though it might get a bit gory, as one might expect when dealing with samurai and aliens.On a personal note, I've watched Gintama since the beginning, and I must say it has given me tremendous joy. I take a general assumption that many who watch anime usually read the manga first. As an avid manga reader I'm always rather skeptical about watching an anime before I read the manga. Thrilled to say, I'm glad I did the opposite in this case. The impact Gintama's wacky universe landed on me was immense, and I'm more than happy to say this one last thing: if you should ever watch and anime, watch Gintama, it's one of those very rare."
    },
    {
      "username": "aashishrajtudu",
      "userUrl": "https://www.imdb.com/user/ur111394668",
      "reviewLink": "https://www.imdb.com/review/rw5842090",
      "warningSpoilers": false,
      "date": "21 June 2020",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "One of the best shounen anime of all time",
      "content": "Gintama is one of the best anime I've ever seen it also give us one of the best arcs in all of the anime. And I've always put Gintama in the first place if I ever wanted to recommend someone an anime"
    },
    {
      "username": "ujjawalkumarchouhan",
      "userUrl": "https://www.imdb.com/user/ur124611601",
      "reviewLink": "https://www.imdb.com/review/rw6125002",
      "warningSpoilers": false,
      "date": "26 September 2020",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "A masterpiece!!",
      "content": "Don't know why it has 8.6 rating being better than most of the animes out there. It's has a mix of comedy as well as epic fight sequences and arcs with some very emotional touch. Highly recommended. Do watch it, have some patience and give it some time it will not be unworthy of your time!"
    },
    {
      "username": "umarahmedzahid",
      "userUrl": "https://www.imdb.com/user/ur49534951",
      "reviewLink": "https://www.imdb.com/review/rw5100471",
      "warningSpoilers": false,
      "date": "4 September 2019",
      "rate": "10",
      "helpful": "18 out of 20 found this helpful.",
      "title": "Neil Armstrong jet Armstrong cannon",
      "content": "Man, this is true art! You want emotions? This anime got em. God, I love gintama. (Kintama too)"
    },
    {
      "username": "zarasomthing",
      "userUrl": "https://www.imdb.com/user/ur87725547",
      "reviewLink": "https://www.imdb.com/review/rw5510067",
      "warningSpoilers": false,
      "date": "26 February 2020",
      "rate": "10",
      "helpful": "12 out of 12 found this helpful.",
      "title": "One of the best anime shows of all time",
      "content": "I can't stop watching this show! It's just too good. It's got action, romance, and most of all comedy!! At first it starts off pretty slow but, it gets funnier the deeper you get into the show. Just watch it you won't regret it!!!!! Just do it!!!"
    },
    {
      "username": "anedqm",
      "userUrl": "https://www.imdb.com/user/ur62971448",
      "reviewLink": "https://www.imdb.com/review/rw5142210",
      "warningSpoilers": false,
      "date": "25 September 2019",
      "rate": "10",
      "helpful": "26 out of 30 found this helpful.",
      "title": "Greatest anime ever",
      "content": "I watched this anime Iast year, expecting to get a light story. I didn't know that I was about to meet a piece of jewelry. It's hard to explain what Gintama is about. It can be describe as a comedy, shonen and slice of life. If you watch the first 50 episodes only, you will probable think this is a comedy. But you'll be wrong. It's much more than that. It's not the classic shonen, our protagonist Gintoki, doesn't have (and need) power ups. He's lazy and dumb. Character development is incredible. Don't expect to get one-dimensional characters, especially on Gintoki's side. Gintama is very \"similar\" to life: It has funny moments, tragic moments. Funny and dumb people being serious, serious people being funny and dumb."
    }
  ],
  "errorMessage": ""
}