{
  "imDbId": "tt0081912",
  "title": "Only Fools and Horses",
  "fullTitle": "Only Fools and Horses (TV Series 1981–2003)",
  "type": "TVSeries",
  "year": "1981",
  "episodes": [
    {
      "id": "tt0666555",
      "seasonNumber": "3",
      "episodeNumber": "1",
      "title": "Homesick",
      "image": "https://m.media-amazon.com/images/M/MV5BZjQ5NjFjZTMtNzg0ZC00Y2Q0LWFhZmQtZTgyNDI2ZGU2YzgzL2ltYWdlXkEyXkFqcGdeQXVyMzk1MjY5Njc@._V1_Ratio1.7778_AL_.jpg",
      "year": "1983",
      "released": "10 Nov. 1983",
      "plot": "The wear and tear of climbing twelve floors in Mandela House takes its toll as Grandad's legs finally give way. And after a visit to the Doctors' it is recommended that they seek some different housing for the Trotter family - on the ground floor! Rodney has just been elected Chairman of the Housing Committee, and with a little pressure from Del, he persuades housing and welfare co-ordinator Miss Mackenzie to move the Trotters into a three-bedroom bungalow in Herrington Road. All seems hunky dory, until Miss Mackenzie catches Del and Grandad sharing a celebratory ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "538"
    },
    {
      "id": "tt0666552",
      "seasonNumber": "3",
      "episodeNumber": "2",
      "title": "Healthy Competition",
      "image": "https://m.media-amazon.com/images/M/MV5BZTJiZDRiN2MtMzJhZi00MTU1LTg4ZGItNjAzODYxODgzMWRhXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "1983",
      "released": "17 Nov. 1983",
      "plot": "Rodney takes the bold decision to leave Trotters' Independent Traders to go it alone... with Mickey Pearce. But, without Del's financial assistance, he soon begins to struggle and needs a miracle to survive. However, when the chance comes to use all his available money to buy something potentially valuable at an auction - which might change his fortunes and prove Del wrong - he has a big decision to make.",
      "imDbRating": "8.3",
      "imDbRatingCount": "523"
    },
    {
      "id": "tt0666547",
      "seasonNumber": "3",
      "episodeNumber": "3",
      "title": "Friday the 14th",
      "image": "https://m.media-amazon.com/images/M/MV5BOTFjYmJlYzgtZWRiNi00ZGVmLTg3Y2QtY2EyOWY0MTJkZjUzXkEyXkFqcGdeQXVyMzk1MjY5Njc@._V1_Ratio1.7778_AL_.jpg",
      "year": "1983",
      "released": "24 Nov. 1983",
      "plot": "A fishing trip to Cornwall is on the cards for the Trotters, with a stay in Boycie's empty weekend cottage. However, on arriving on a dark, stormy night with powerlines in the area down, they are stopped in a police roadblock and informed that an escapee from the local hospital for the criminally insane is on the loose. Could this be the start of a horror story for the unwitting Trotters?",
      "imDbRating": "8.8",
      "imDbRatingCount": "665"
    },
    {
      "id": "tt0666594",
      "seasonNumber": "3",
      "episodeNumber": "4",
      "title": "Yesterday Never Comes",
      "image": "https://m.media-amazon.com/images/M/MV5BOGJmYWZlZmYtNjI2Ni00MGZiLWJkYjMtOWFlOWQyMDMxZmY0XkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "1983",
      "released": "1 Dec. 1983",
      "plot": "Del Boy enters the world of fine art when he attempts to pull the wool over 'posh tart' antique dealer Miranda Davenport. He unsuccessfully tries to tell her a rickety old cabinet is in fact a 'Queen Anne' original, but wise to the ruse, she coolly declines. Her attitude towards Del does warm when she responds to an advertisement placed by the Trotters in the local paper. When a painting Del has in stock catches her eye, Miranda soon worms her way into Del's affections and in no time at all, he has given her the painting as a gift. Keen to see her again, Del pays a ...",
      "imDbRating": "7.9",
      "imDbRatingCount": "509"
    },
    {
      "id": "tt0666560",
      "seasonNumber": "3",
      "episodeNumber": "5",
      "title": "May the Force Be with You",
      "image": "https://m.media-amazon.com/images/M/MV5BMjZhNjY2ZjctN2EyYi00NmI5LThlMmMtNjFiNWQzOWIwNjJlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "1983",
      "released": "8 Dec. 1983",
      "plot": "Del Boy's arch-enemy from school turns up in Peckham, but this time he's known as Detective Inspector Slater from the Met Police. Having known Del and his wily ways since they were at school together, Slater knows exactly who to watch when he's on the trail of some stolen microwaves. Hapless Rodney has no idea who Slater is when he gets chatting to him in The Nags Head. It's only when he sees the horror on Del's face, after bringing Slater back to the flat for a reunion meal, that Rodney realises something is wrong Despite Rodney's best efforts, the game appears to be...",
      "imDbRating": "8.6",
      "imDbRatingCount": "565"
    },
    {
      "id": "tt0666590",
      "seasonNumber": "3",
      "episodeNumber": "6",
      "title": "Wanted",
      "image": "https://m.media-amazon.com/images/M/MV5BOWYwZjQ2MDctNGEwMy00OWYwLWEyMDUtZjBjM2RkYTc3NjdiXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.9048_AL_.jpg",
      "year": "1983",
      "released": "15 Dec. 1983",
      "plot": "When Rodney helps a drunken woman on the street, he is stunned when she looks petrified, accuses him of man-handling her, and promptly cries \"rape!\" Without thinking straight, and fearing the consequences, Rodders decides to leg it. Del hears about the escapade and realises his naïve Little Bruv must have encountered Blossom, a psychologically unhinged woman who is allowed out in public on weekend breaks. Not wanting to prey on Rodney's nervous disposition, Del naturally does the humane thing and concocts a story about the police conducting a search for 'The Peckham ...",
      "imDbRating": "7.9",
      "imDbRatingCount": "504"
    },
    {
      "id": "tt0666593",
      "seasonNumber": "3",
      "episodeNumber": "7",
      "title": "Who's a Pretty Boy?",
      "image": "https://m.media-amazon.com/images/M/MV5BODllYWY2MTAtMzJmMC00YTk2LWIyZjctZWJjM2I4Yzc2MDc5XkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio2.2540_AL_.jpg",
      "year": "1983",
      "released": "22 Dec. 1983",
      "plot": "Del is determined to get his revenge on big-headed Irish painter and decorator Brendan O'Shaughnessy for flogging him some dodgy paint. So, when he learns of Brendan's plans to redecorate Denzil and Corrine's living room, he convinces them of the Trotters' credentials to do the job better. Corrine isn't impressed, but the Trotters get the job anyway. Left alone in the flat to decorate, with only Corrine's beloved pet canary for company, what could possibly go wrong...",
      "imDbRating": "8.4",
      "imDbRatingCount": "545"
    },
    {
      "id": "tt0666585",
      "seasonNumber": "3",
      "episodeNumber": "8",
      "title": "Thicker Than Water",
      "image": "https://m.media-amazon.com/images/M/MV5BNDQxNjRjNjgtNjg1NC00MzcwLWI4YTAtYTMxNzFiYjg3OWQyXkEyXkFqcGdeQXVyMjc0ODQ0NzM@._V1_Ratio1.7778_AL_.jpg",
      "year": "1983",
      "released": "25 Dec. 1983",
      "plot": "When Del and Rodney's estranged father shows up on Christmas Day after an eighteen-year absence, the Trotter family is suddenly thrown into turmoil. Worse still, he claims he has an hereditary disease that could also affect Del and Rodney. However, following blood tests, it comes to light that this might not be the brothers' only problem...",
      "imDbRating": "8.1",
      "imDbRatingCount": "507"
    }
  ],
  "errorMessage": ""
}