{
  "imDbId": "tt0081912",
  "title": "Only Fools and Horses",
  "fullTitle": "Only Fools and Horses (TV Series 1981–2003)",
  "type": "TVSeries",
  "year": "1981",
  "episodes": [
    {
      "id": "tt0666556",
      "seasonNumber": "9",
      "episodeNumber": "1",
      "title": "If They Could See Us Now.....!",
      "image": "https://m.media-amazon.com/images/M/MV5BM2E1MjE3NjAtYjEwMC00ODU5LWE4NGUtZGIwNTZiNmEwNzRlXkEyXkFqcGdeQXVyNjAyNzIzMDE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "25 Dec. 2001",
      "plot": "Due to bad investment and the Central American stock market crash the Trotters lose all their money. Whilst Rodney and Cassandra spice up their love life by dressing up, Del decides to restore the family wealth by going on the quiz show 'Gold Rush', hosted by Jonathan Ross. He does very well but has to phone Rodney for the answer to the jackpot question, and Rodney gives the wrong answer. Back home Del gets a call from the show to say that Rodney's answer was actually correct so that Del has won the prize money after all. Unfortunately Del thinks it's pub regular ...",
      "imDbRating": "7.3",
      "imDbRatingCount": "505"
    },
    {
      "id": "tt0666571",
      "seasonNumber": "9",
      "episodeNumber": "2",
      "title": "Strangers on the Shore...!",
      "image": "https://m.media-amazon.com/images/M/MV5BNmU3MWVlNTktYzY1Yi00ODA2LTg4ZjEtODJjOTQyYzAxMzg3XkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "25 Dec. 2002",
      "plot": "Going to France to scatter the late Uncle Albert's ashes near the village where he spent part of the war, Del decides to kill two birds with one stone and organize a booze cruise. At the village they learn that Albert was a real ladies' man, which could be why most of the menfolk resemble him. Back in Peckham they discover a young man who seems to have stowed away in their van and can only answer \"Gary\" to everything asked of him. In fact he is called Rashid and he was loading the van when he got trapped behind the booze. He was carried to England against his wishes ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "534"
    },
    {
      "id": "tt0756576",
      "seasonNumber": "9",
      "episodeNumber": "3",
      "title": "Sleepless in Peckham...!",
      "image": "https://m.media-amazon.com/images/M/MV5BMmE2ZDI3OTUtN2Y5ZS00MWNhLWJiYWItNWY4OGNlOTQxZDE3XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "25 Dec. 2003",
      "plot": "When Marlene vanishes and Boycie is secretive about her disappearance, people assume he has killed her, but she only went to have a boob job. The Trotters need money to stave off being evicted but are saved when it transpires that Uncle Albert invested his savings wisely and leaves them almost a quarter of a million pounds. Del tells Rodney that his real father was not Reg Trotter but a flash local crook called Freddie 'the Frog' Robdal. Cassandra goes into labour, this time successfully and her baby girl is named Joan after Del and Rodney's mother and with whose ...",
      "imDbRating": "7.9",
      "imDbRatingCount": "565"
    }
  ],
  "errorMessage": ""
}