{
  "imDbId": "tt0081912",
  "title": "Only Fools and Horses",
  "fullTitle": "Only Fools and Horses (TV Series 1981–2003)",
  "type": "TVSeries",
  "year": "1981",
  "episodes": [
    {
      "id": "tt0666553",
      "seasonNumber": "8",
      "episodeNumber": "1",
      "title": "Heroes and Villains",
      "image": "https://m.media-amazon.com/images/M/MV5BNzIwMDM2NWMtZTY1ZS00MTc5LWFhNjUtOTBmYzIzZDI2ODEyXkEyXkFqcGdeQXVyNjAyNzIzMDE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1996",
      "released": "25 Dec. 1996",
      "plot": "Del has applied for a council grant but been turned down. After giving Rodney a bracelet for his birthday inscribed 'Rooney', Del drives Rodney to a fancy dress party where they are dressed as Batman and Robin. However the Reliant Robin breaks down and, as the brothers are running through the fog in costume, they scare off a gang of muggers about to rob a female councillor. At the party they are the only guests in costume because the birthday boy has actually died and the party is now a wake. But there is good news next day when Del catches one of the muggers as he is...",
      "imDbRating": "9.4",
      "imDbRatingCount": "786"
    },
    {
      "id": "tt0666563",
      "seasonNumber": "8",
      "episodeNumber": "2",
      "title": "Modern Men",
      "image": "https://m.media-amazon.com/images/M/MV5BNDViMmFhMzUtZTgyZS00MGI3LWEzMjQtMzQyNDQ2MGY5Y2QzXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "1996",
      "released": "27 Dec. 1996",
      "plot": "After reading a book entitled 'Modern Men', Del elects to have a vasectomy but backs out when he finds that the doctor concerned is still angry about the faulty paint he sold him. With Cassandra pregnant Rodney is seeking a better-paid job and answers a newspaper advertisement, only to discover that it is as Del's assistant. Cassandra is rushed to hospital but she miscarries and, whilst comforting Rodney, Del bursts into tears.",
      "imDbRating": "8.7",
      "imDbRatingCount": "562"
    },
    {
      "id": "tt0666587",
      "seasonNumber": "8",
      "episodeNumber": "3",
      "title": "Time on Our Hands",
      "image": "https://m.media-amazon.com/images/M/MV5BNTZlYTk1MjMtOGQwNS00MWI2LThiZGItNTNjZTRiNmYzNjRmXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "1996",
      "released": "29 Dec. 1996",
      "plot": "Things aren't too good at Nelson Mandela house. Raquel's parents are due to visit for dinner and will be meeting Del for the first time, causing her to panic. Dinner is ultimately ruined after Albert unfortunately mixes up the gravy and coffee jars. Meanwhile, Rodney appears to be struggling to come to terms with Cassandra's miscarriage, causing Del to take extreme steps to get him talking about it. Things begin to look up however, in the shape of an antique watch. Is Del's vision of becoming millionaire finally going to come to pass?",
      "imDbRating": "9.6",
      "imDbRatingCount": "1016"
    }
  ],
  "errorMessage": ""
}