{
  "imDbId": "tt0081912",
  "title": "Only Fools and Horses",
  "fullTitle": "Only Fools and Horses (TV Series 1981–2003)",
  "type": "TVSeries",
  "year": "1981",
  "episodes": [
    {
      "id": "tt0666548",
      "seasonNumber": "5",
      "episodeNumber": "1",
      "title": "From Prussia with Love",
      "image": "https://m.media-amazon.com/images/M/MV5BY2E3NWUxOTUtZDQ0Zi00YzYyLWI5MDktYzkzMzIyY2NlMjgwXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "1986",
      "released": "31 Aug. 1986",
      "plot": "It's closing time at The Nag's Head, and Mike the landlord is having problems clearing everyone out, particularly a young pregnant foreign girl who doesn't seem to speak Peckham English. Del and Rodney offer to help, and despite Del Boy's dodgy French, they work out that Anna is from Germany, and she's been chucked out on the street and was considering getting her child adopted. They leave Rodney to take Anna to a hotel, but he ends up bringing her back to the flat, where she explains that, Spencer, the son of the family she was working for as an au pair got her ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "510"
    },
    {
      "id": "tt0666579",
      "seasonNumber": "5",
      "episodeNumber": "2",
      "title": "The Miracle of Peckham",
      "image": "https://m.media-amazon.com/images/M/MV5BNDExOTU1YzgtOWE1ZS00MGJhLWI3YWUtNjcwOWViYWVhZTZiXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.9048_AL_.jpg",
      "year": "1986",
      "released": "7 Sep. 1986",
      "plot": "Rodney and Uncle Albert are astonished when Del gets dressed up in his best suit, and announces he's going to church. While he's there, the parish priest is sad to tell him that the hospice connected with his church may be forced to close, unless a substantial amount of money can be raised. It seems only a miracle will be able to save it - but can divine intervention really strike in Peckham?",
      "imDbRating": "8.0",
      "imDbRatingCount": "479"
    },
    {
      "id": "tt0666578",
      "seasonNumber": "5",
      "episodeNumber": "3",
      "title": "The Longest Night",
      "image": "https://m.media-amazon.com/images/M/MV5BM2UxZGVlNGMtMDg5Yi00MGU0LWIzNWMtYmExZGIxODc1MzhhXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "1986",
      "released": "14 Sep. 1986",
      "plot": "Del, Rodney, and Albert are mistakenly apprehended as shoplifters by an overzealous security guard at the Top Buy Supermarket. And things get worse when they're taken to the manager's office and realise that they've lost their receipt for the goods. Shortly after, Tom the security guard brings a cocky shoplifter, Lennox Gilbey, into the manager's office, where he promptly pulls out a gun and demands money from the safe. Unluckily for Lennox the safe is on a time-lock and due to the dodgy watch he's wearing, he's 15 minutes later than he planned - and the safe doesn't ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "561"
    },
    {
      "id": "tt0666572",
      "seasonNumber": "5",
      "episodeNumber": "4",
      "title": "Tea for Three",
      "image": "https://m.media-amazon.com/images/M/MV5BYjRkOWQzMzYtYWRjMS00MTEyLTk5N2YtYmE0NzU1NWVjMTQ5XkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "1986",
      "released": "21 Sep. 1986",
      "plot": "Trigger's young niece, Lisa, is staying with him for a while, and the scruffy young girl that Del and Rodney remember has now become a stunning 25 year-old woman. Both Trotter brothers think they are in with a chance, and immediately begin competing for Lisa's affections. Despite almost coming to blows, Del and Rodney manage to invite Lisa round to the flat for tea, and she seems more than happy to accept. In preparation for their date with Lisa, Del goes out to get some more 'Smash' and Rodney spends half-an-hour on the sunbed. Just before Del leaves for the shops, ...",
      "imDbRating": "8.8",
      "imDbRatingCount": "581"
    },
    {
      "id": "tt0666589",
      "seasonNumber": "5",
      "episodeNumber": "5",
      "title": "Video Nasty",
      "image": "https://m.media-amazon.com/images/M/MV5BMGZmMjVmNzAtMTcyYi00YWE0LWIyNGEtZTY3YTY0ZWI2ZTMwXkEyXkFqcGdeQXVyMjc0ODQ0NzM@._V1_Ratio1.7778_AL_.jpg",
      "year": "1986",
      "released": "28 Sep. 1986",
      "plot": "Rodney's Art Class is given a £10,000 grant to make a film spotlighting the local community, but first he has to avoid the scheming intentions of Mickey Pearce and Del Boy. Whilst Rodders suffers from writer's block, Del provides him with inspiration and a tale of a killer Rhino escaping from London Zoo and laying waste to innocent victims on the streets of the city. Rodney immediately points out the flaws in the logic behind the plot, and Del leaves him to it. But without telling Rodney, Del has already arranged for Mickey to head down to the town hall to film ...",
      "imDbRating": "7.7",
      "imDbRatingCount": "481"
    },
    {
      "id": "tt0666592",
      "seasonNumber": "5",
      "episodeNumber": "6",
      "title": "Who Wants to Be a Millionaire?",
      "image": "https://m.media-amazon.com/images/M/MV5BYzY3OTI4YWUtODk1MS00YzYyLTk2OWQtNzU1ZTg1NDUzY2QwXkEyXkFqcGdeQXVyMjc0ODQ0NzM@._V1_Ratio1.7778_AL_.jpg",
      "year": "1986",
      "released": "5 Oct. 1986",
      "plot": "Del Boy's old pal Jumbo Mills is back with tales of his booming business in Australia. What's more he wants Del to go back down under with him as his partner in the enterprise. Could Del really leave Peckham for good?",
      "imDbRating": "8.0",
      "imDbRatingCount": "499"
    },
    {
      "id": "tt0666534",
      "seasonNumber": "5",
      "episodeNumber": "7",
      "title": "A Royal Flush",
      "image": "https://m.media-amazon.com/images/M/MV5BN2Y3ZDIyMGEtNjc4Yi00NGNhLTkxNGUtZTY5Mzg0MTdmNjAzXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "1986",
      "released": "25 Dec. 1986",
      "plot": "Rodney meets Vicky, a seemingly impoverished artist who it transpires is the daughter of the Duke of Maylebury. Having obtained a pair of tickets to the sold-out production of Carmen, Rodders seems to have deeply impressed Vicky. She is less taken by the presence of Del and his peroxide blonde dolly bird. Especially when they open the crisps. Vicky then invites Rodney to a party at the Duke's country home, and it seems romance may be on the cards. Then Del Boy turns up, hits the vino-plonko and ruins everything for his little brother.",
      "imDbRating": "7.2",
      "imDbRatingCount": "615"
    },
    {
      "id": "tt0666575",
      "seasonNumber": "5",
      "episodeNumber": "8",
      "title": "The Frog's Legacy",
      "image": "https://m.media-amazon.com/images/M/MV5BNGRkN2Y5YzktODBhOC00YzA4LWI2NTAtNDVmYTQ0NjI3ZGIzXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "1987",
      "released": "25 Dec. 1987",
      "plot": "Trotters Independent Trading is causing mayhem with their faulty RAJAH computers. Rodders gets a new job at a funeral directors, while Albert and Del hit the health market with their miracle cure body massagers. At the wedding of Trigger's niece, the Trotters hear the tale of Freddy the Frog, a bank robber and close friend of the boys' mother. He left everything in his will to their mum, including missing gold bullion. While Del hunts for treasure, Rodney puzzles over Freddy and his mother's 'friendship' - and a son who would by now be his own age.",
      "imDbRating": "8.4",
      "imDbRatingCount": "544"
    },
    {
      "id": "tt0666544",
      "seasonNumber": "5",
      "episodeNumber": "9",
      "title": "Dates",
      "image": "https://m.media-amazon.com/images/M/MV5BNDJiYzBjMWUtZjM0MC00NmVkLThhZDktZmQzNDZmOTIwYzI4XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "1988",
      "released": "25 Dec. 1988",
      "plot": "After witnessing Trigger's unexpected success with his date from a local computer dating agency, Del fancies his chances of having some too. He duly enrolls, and sets out to meet his blind date at Waterloo Station. All seems to go well on their first date at a posh hotel - but have they both been entirely honest with each other?",
      "imDbRating": "8.9",
      "imDbRatingCount": "623"
    }
  ],
  "errorMessage": ""
}