{
  "imDbId": "tt0081912",
  "title": "Only Fools and Horses",
  "fullTitle": "Only Fools and Horses (TV Series 1981–2003)",
  "type": "TVSeries",
  "year": "1981",
  "episodes": [
    {
      "id": "tt0666566",
      "seasonNumber": "7",
      "episodeNumber": "0",
      "title": "Rodney Come Home",
      "image": "https://m.media-amazon.com/images/M/MV5BODc0YjE1MjgtYWExMC00YzgyLWEwNjgtYTIxMzVjNDhkMTgwXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "1990",
      "released": "25 Dec. 1990",
      "plot": "Rodney and Cassandra's marriage is in trouble - Cassy is ambitious and wants to better herself with her banking colleagues, while Rodney is set in his ways and expects her to be an old-fashioned housewife. After a bust-up, Rodney decides to leave and return to the Trotter household. He still yearns for her though, and is unwisely advised that making her jealous might be the key to winning back her affections. He asks another girl to join him on a date to the cinema - could this be a perfect Hollywood ending for Rodney, or could the curtain finally come down on his ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "516"
    },
    {
      "id": "tt0666582",
      "seasonNumber": "7",
      "episodeNumber": "1",
      "title": "The Sky's the Limit",
      "image": "https://m.media-amazon.com/images/M/MV5BYmFhZWQ5MDktOWVjZi00NjIwLTlkMjEtNWQ4NjdmOTM2NjY4XkEyXkFqcGdeQXVyNjAyNzIzMDE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1990",
      "released": "30 Dec. 1990",
      "plot": "Boycie's lost a satellite dish and Delboy's come into possession of one. Rodney goes to meet Cassandra at Gatwick Airport but her plane's been diverted to Manchester. Could there be a link connecting these events?",
      "imDbRating": "8.3",
      "imDbRatingCount": "487"
    },
    {
      "id": "tt0666573",
      "seasonNumber": "7",
      "episodeNumber": "2",
      "title": "The Chance of a Lunchtime",
      "image": "https://m.media-amazon.com/images/M/MV5BMDIzZjQyNzItZWJkMS00YTIzLTkyZWUtZWNmM2ZmY2Q3MmM0XkEyXkFqcGdeQXVyNjAyNzIzMDE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1991",
      "released": "6 Jan. 1991",
      "plot": "Del has a consignment of doorbells that play various National Anthems. He tries to help Rodney and Cassandra save their marriage after going round to fix rodneys front door but things don't quite go to plan. Raquel has an audition for a part in a play. She passes the audition but is unable to accept it as she has some news that leaves Del speechless...but not for long.",
      "imDbRating": "8.0",
      "imDbRatingCount": "451"
    },
    {
      "id": "tt0666569",
      "seasonNumber": "7",
      "episodeNumber": "3",
      "title": "Stage Fright",
      "image": "https://m.media-amazon.com/images/M/MV5BNzE2YmEzYzItNGFkMS00NjZlLTg1YzYtNjdiODEyZjYzZTMzXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "1991",
      "released": "13 Jan. 1991",
      "plot": "Del tries his hand at being a showbiz manager, and one of his clients is his 3-months pregnant girlfriend Raquel. But will things go to plan?",
      "imDbRating": "8.9",
      "imDbRatingCount": "586"
    },
    {
      "id": "tt0666574",
      "seasonNumber": "7",
      "episodeNumber": "4",
      "title": "The Class of '62",
      "image": "https://m.media-amazon.com/images/M/MV5BMTRkZTBhOGYtZDZlYy00YTg1LWJhNWUtZjQ5Y2Y1MDY1MTZhXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "1991",
      "released": "20 Jan. 1991",
      "plot": "Del is invited to a school reunion with Boycie, Denzil and Trigger. The organiser remains a mystery until disgraced ex-policeman Roy Slater appears. After drinks in the Nag's Head they all repair to the flat where Del discovers that Slater is married to Raquel, who wants a divorce from him. Happily for Del he finds out that Slater is getting a rake-off from the diamond heist for which he served time and uses this to blackmail him into divorcing Raquel.",
      "imDbRating": "8.8",
      "imDbRatingCount": "518"
    },
    {
      "id": "tt0666551",
      "seasonNumber": "7",
      "episodeNumber": "5",
      "title": "He Ain't Heavy, He's My Uncle",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA1MzI4ODAtZWNjYy00NjlkLWE4NjQtNDI5MzJmNWUyOWYzXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "1991",
      "released": "27 Jan. 1991",
      "plot": "Whilst Del employs Rodney in the family firm, Uncle Albert starts going to the Over-60s Club but comes home one day, bruised and claiming that he was mugged. After refusing to go out for a week, he suddenly takes off, leaving a note to imply he has left home. Del and Rodney eventually find him at the new estate built on the street where he was born, and bring him home. When Albert's old mate Knock-Knock arrives at the flat it turns out that there was no mugging but the two old men got into a fight over an old lady, Dora, from their club.",
      "imDbRating": "8.2",
      "imDbRatingCount": "460"
    },
    {
      "id": "tt0666586",
      "seasonNumber": "7",
      "episodeNumber": "6",
      "title": "Three Men, a Woman, and a Baby",
      "image": "https://m.media-amazon.com/images/M/MV5BZjczOWE3YzEtMmIyOS00N2QzLTgzYzYtMjUyYWI4YzQyZThjXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio2.0635_AL_.jpg",
      "year": "1991",
      "released": "3 Feb. 1991",
      "plot": "Del is hoping to sell a load of wigs bought from Mustapha to the old ladies in the Nag's Head and is annoyed to find out that he has actually bought a box of mens' wigs. Cassandra leaves Rodney, claiming that he lacks drive. He turns vegetarian and sports a clip-on pony-tail to appear trendy but when Cassandra gets back in touch with him she tells him she prefers him just as he is. Raquel gives birth to a baby boy, which Rodney has jokingly suggested be called Damien, a name Del and Raquel are happy to give him. As dusk falls Del communes with his dead mother to tell ...",
      "imDbRating": "8.7",
      "imDbRatingCount": "513"
    },
    {
      "id": "tt0666561",
      "seasonNumber": "7",
      "episodeNumber": "7",
      "title": "Miami Twice: The American Dream",
      "image": "https://m.media-amazon.com/images/M/MV5BMzAyNGE5NmEtY2QyNi00NzFhLTgxMzgtMTY4MWQ0NmVkYmMxXkEyXkFqcGdeQXVyNjAyNzIzMDE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1991",
      "released": "24 Dec. 1991",
      "plot": "At Damien's christening, Del does a deal with the vicar to supply 'pre-blessed' Romanian altar wine, only it turns out to be white. In an effort to get Rodney back with Cassandra Del suggests a trip to Miami, Del already having bought the tickets with Rodney's pension money. However, Cassandra has a heavy work load and is unable to get time off so the Trotter brothers do Miami together.",
      "imDbRating": "8.3",
      "imDbRatingCount": "575"
    },
    {
      "id": "tt0666562",
      "seasonNumber": "7",
      "episodeNumber": "8",
      "title": "Miami Twice",
      "image": "https://m.media-amazon.com/images/M/MV5BZGM2YTk2ODktMzhlYS00NTVkLTg1N2EtZWMwMmQ1NmRjMTgwXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "1991",
      "released": "25 Dec. 1991",
      "plot": "The Trotters arrive in Miami, where they are spotted by Mafia Don Vincenzo Occhetti and his sons, the don just happening to be Del's exact double. The Occhettis welcome the brothers but they have a plan. Occhetti is to stand trial for several crimes. If Del is found dead and it is assumed that he is the Mafioso, the don will be in a position to start a new life. Several unsuccessful attempts to kill Del follow, as does an argument between Rodney and Occhetti, whom Rodney believes to be his brother. When Del and Rodney tumble to what is happening they go on the run but...",
      "imDbRating": "8.3",
      "imDbRatingCount": "709"
    },
    {
      "id": "tt0666564",
      "seasonNumber": "7",
      "episodeNumber": "9",
      "title": "Mother Nature's Son",
      "image": "https://m.media-amazon.com/images/M/MV5BY2JiZTZiZDUtMzE5YS00ZjM5LTg3ZWEtYjIyNzIxYzQ4MGFjXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "1992",
      "released": "25 Dec. 1992",
      "plot": "Strapped for cash as ever, Del is clearing Grandad's allotment, which has become a health hazard and where he finds some bottles of yellow liquid, which he dumps. He also finds a tap, hidden by rocks, but claims that there is an actual spring, yielding 'Peckham Spring Water'. Using a bottle of mineral water for the lab test he gets the water accepted and sold to a supermarket chain. Unfortunately he is unaware that it has been contaminated by the same yellow liquid he chucked in the reservoir and, as he turns out the light, the water starts to glow green.",
      "imDbRating": "8.5",
      "imDbRatingCount": "539"
    },
    {
      "id": "tt0666546",
      "seasonNumber": "7",
      "episodeNumber": "10",
      "title": "Fatal Extraction",
      "image": "https://m.media-amazon.com/images/M/MV5BNDE1YTdhNzctM2RmNS00ZWY4LWI5MjYtMGEyNGRhMjUwNTViXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "1993",
      "released": "25 Dec. 1993",
      "plot": "After a visit to the dentist Del unwisely makes a date with the comely receptionist Beverley, but, on Rodney's advice, cancels it. After Del has got drunk and been responsible for causing a riot, he finds Beverley at his flat and fears that she has come for revenge, though she has only come to buy Damien's old high chair. In exchange she gives Del an answer-phone, and, come Christmas Day, he will live to regret this.",
      "imDbRating": "8.2",
      "imDbRatingCount": "502"
    }
  ],
  "errorMessage": ""
}