{
  "imDbId": "tt0081912",
  "title": "Only Fools and Horses",
  "fullTitle": "Only Fools and Horses (TV Series 1981–2003)",
  "type": "TVSeries",
  "year": "1981",
  "episodes": [
    {
      "id": "tt0666577",
      "seasonNumber": "2",
      "episodeNumber": "1",
      "title": "The Long Legs of the Law",
      "image": "https://m.media-amazon.com/images/M/MV5BNmUwMThiMDUtZTNkMy00YjRmLWI5YWYtYTZhZWIwY2E2OWZmXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "1982",
      "released": "21 Oct. 1982",
      "plot": "Del and Grandad are horrified to hear that Rodney is dating a police officer called Sandra. But while Grandad is worried about Sandra knowing about the Trotters' sullied reputation, Del is sweating over the amount of dodgy gear stored in the flat. At the end of their date at the cinema, Rodders brings Sandra back to the flat for a nightcap. As soon as she arrives, Del spots her wearing a stolen watch that Rodney has given her as a gift. Thinking fast, he 'accidentally' pours gin over it and promises to buy her a replacement. Ever the gent, Rodney offers to walk her ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "579"
    },
    {
      "id": "tt0666537",
      "seasonNumber": "2",
      "episodeNumber": "2",
      "title": "Ashes to Ashes",
      "image": "https://m.media-amazon.com/images/M/MV5BYTA3NDliMTEtZThlYi00NGUzLTlmZTktNzhmNWYwYmQwZDJlXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "1982",
      "released": "28 Oct. 1982",
      "plot": "Trigger is feeling sad after the death of his grandmother, and the Trotters console him. Del, being ever-helpful and out to spot a potential 'earner', sees two old urns at the grandmother's house and persuades Trigger to part with them. When it later transpires that one of the urns actually contains the ashes of Trigger's late grandfather, they feel it's best to do the right thing and dispose of his mortal remains in the most appropriate manner possible - though this isn't as easy as they first thought.",
      "imDbRating": "8.1",
      "imDbRatingCount": "540"
    },
    {
      "id": "tt0666533",
      "seasonNumber": "2",
      "episodeNumber": "3",
      "title": "A Losing Streak",
      "image": "https://m.media-amazon.com/images/M/MV5BNmY1YTU4MDQtM2Y5Ny00YjRlLWE2NDMtZTZhYWU5NTQ2OTdlL2ltYWdlXkEyXkFqcGdeQXVyMzk1MjY5Njc@._V1_Ratio1.7778_AL_.jpg",
      "year": "1982",
      "released": "4 Nov. 1982",
      "plot": "Del is getting into financial trouble - even his double-headed coin can't help him win. He's gambling away his money with no sign of stopping, and he's already £150 down. Nevertheless, when Boycie challenges him to a winner-takes-all poker game, Del is eager to host it in his flat in Mandela House. As the night progresses, Del's luck goes from bad to worse as he ends up owing Boycie all his money, the TITCO van, Grandad's cash, jewellery and even a collection of loose change. But all is not lost, as Del finally turns the tables on Boycie in revenge for fixing all the ...",
      "imDbRating": "8.8",
      "imDbRatingCount": "659"
    },
    {
      "id": "tt0666565",
      "seasonNumber": "2",
      "episodeNumber": "4",
      "title": "No Greater Love...",
      "image": "https://m.media-amazon.com/images/M/MV5BMGQ0ODU3YzYtNDU4MS00ZmNkLWJhNjUtN2E2ZDMzNjRhNjgwXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "1982",
      "released": "11 Nov. 1982",
      "plot": "Del becomes worried once more about Rodney's love life - and his latest dodgy 'bird'. This time though, Rodney has uncharacteristically fallen for Irene, a woman much older than him - and who just happens to be married. Worse still, her husband is a hardened-criminal who is soon to be released from prison. Del needs to think fast to 'rescue' Rodney - but will he get him out of harm's way in time?",
      "imDbRating": "7.9",
      "imDbRatingCount": "536"
    },
    {
      "id": "tt0666584",
      "seasonNumber": "2",
      "episodeNumber": "5",
      "title": "The Yellow Peril",
      "image": "https://m.media-amazon.com/images/M/MV5BMjc0MDEyOWMtNWE3YS00MTUyLWI4MTAtYWY1NmRiNjJhYTQzXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "1982",
      "released": "18 Nov. 1982",
      "plot": "When Del arranges a job redecorating a Chinese Restaurant, he unwisely decides to employ the services of Rodney 'Leonardo' Trotter and buys some paint from Trigger. It's also nearing the anniversary of their mother's death, and in an attempt to save a bit of cash, Del swipes a bit of spare paint to spruce up her tombstone. While Del leaves Grandad and Rodney to paint the grease-filled Chinese kitchen with 'gold' paint, he heads off to decorate the tombstone. It's only when they've finished painting and get a call from the owner of the Chinese restaurant that they ...",
      "imDbRating": "8.4",
      "imDbRatingCount": "554"
    },
    {
      "id": "tt0666557",
      "seasonNumber": "2",
      "episodeNumber": "6",
      "title": "It Never Rains....",
      "image": "https://m.media-amazon.com/images/M/MV5BN2Q3MzY3MjEtYTdiNy00OTA2LThlMGYtYzc1ZTE1ODRjNGNlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "1982",
      "released": "25 Nov. 1982",
      "plot": "Trotters' Independent Trading Company has been forced off the market, with the continuing downpour keeping most of Peckham indoors. While drowning their sorrows in The Nag's Head, Alex the travel agent mentions that business is slow and he can't give holidays away at the moment. As a promotional gimmick, Del suggests offering an 80% discount on a holiday to the next customer in the shop - and who happens to walk by, but Derek Trotter. Having sold sun-hats in the rain, Rodders has managed to earn some travel cash, but he is dismayed to learn that the 80% discount only ...",
      "imDbRating": "7.9",
      "imDbRatingCount": "544"
    },
    {
      "id": "tt0666536",
      "seasonNumber": "2",
      "episodeNumber": "7",
      "title": "A Touch of Glass",
      "image": "https://m.media-amazon.com/images/M/MV5BNTEwNzc3MDAtYTU2Mi00NmVlLWIzNjEtZmQ2ZTU2YzdiMGI4XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "1982",
      "released": "2 Dec. 1982",
      "plot": "Returning from an auction, the Trotters stop to help a woman whose car appears to have broken down. It turns out she is a posh sort. No less than Lady Ridgemere, wife of Lord Ridgemere who own the Ridgemere Hall Estate. Having towed the Lady to her stately home, Del overhears that the Lord of the Manor is having trouble with the firm he's hired to clean their chandeliers. He wastes no time in offering the Trotter's services as chandelier cleaners for a mere £350. With Rodney and Del up ladders, and an old sheet the only thing between the cut-glass chandelier and the ...",
      "imDbRating": "8.9",
      "imDbRatingCount": "680"
    },
    {
      "id": "tt0666545",
      "seasonNumber": "2",
      "episodeNumber": "8",
      "title": "Diamonds Are for Heather",
      "image": "https://m.media-amazon.com/images/M/MV5BOWE3MWNjMjktN2FmOC00YzcxLTlhM2YtZmRmODIxYjk0MzNjXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "1982",
      "released": "30 Dec. 1982",
      "plot": "Derek Trotter has the Yuletide Blues, and drinks away his loneliness in Spanish night at The Nag's Head. There he meets Heather, who seems to be one friend short of company. Del Boy, ever the gentleman, entertains her and sees her home safely. At her flat he discovers that she has a young son, to a husband who seems to have joined a very long queue at the Job Centre 18 months ago and not come back. In no time at all their romance blossoms, and all is running so smoothly Del decides to propose. However, when he takes her for a candle-lit curry, she refuses his offer of...",
      "imDbRating": "7.6",
      "imDbRatingCount": "504"
    }
  ],
  "errorMessage": ""
}