{
  "imDbId": "tt0081912",
  "title": "Only Fools and Horses",
  "fullTitle": "Only Fools and Horses (TV Series 1981–2003)",
  "type": "TVSeries",
  "year": "1981",
  "episodes": [
    {
      "id": "tt0666538",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "Big Brother",
      "image": "https://m.media-amazon.com/images/M/MV5BNTJmMjZhZGEtMTVhNC00MTAxLTg4NzUtMTVlY2FmOWVlYTRlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "1981",
      "released": "8 Sep. 1981",
      "plot": "Del employs younger brother Rodney as a member of Trotters' Independent Traders, despite warnings from his business colleagues. When Rodney decides to become the Trotters' financial adviser - monitoring the accounts and keeping Del's dodgy dealings in check - Del has second thoughts about their partnership. Cracks show in the partnership when Rodney inadvertently bungles a deal with Trigger. But despite Del's anger, it turns out that Rodder's advice would have prevented the purchase of 25 briefcases that are locked with the serial number inside. Del and Rodney have ...",
      "imDbRating": "7.7",
      "imDbRatingCount": "782"
    },
    {
      "id": "tt0666549",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "Go West Young Man",
      "image": "https://m.media-amazon.com/images/M/MV5BOGI4ODllOTEtMTlkZS00YTk4LThkOGItMThmMmQ0ODI2YmY1XkEyXkFqcGdeQXVyNjU1Mzc5Mjc@._V1_Ratio1.7778_AL_.jpg",
      "year": "1981",
      "released": "15 Sep. 1981",
      "plot": "Del and Rodney are once again hunting for bargains. And after stopping off at Boycie's car lot they spy a Mark II Cortina that's being used as a part-exchange for a Vanden Plas. Del knocks the asking price down to £25, so long as he houses Boycie's E type jag for a week - Del hopes to use the Jag to impress his bit on the side. Del ups the price tag of the Cortina to £199 and gets interest from an Australian buyer. And with cash in their pockets, a Jag to drive, and both of them single, Rodney talks Del into heading off for a night on the tiles. The Trotters' night ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "677"
    },
    {
      "id": "tt0666539",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "Cash and Curry",
      "image": "https://m.media-amazon.com/images/M/MV5BMzRhZmI0NDMtNTNiNC00ZTY4LTg3YmItZjdiNjNkNmZjMjNjXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "1981",
      "released": "22 Sep. 1981",
      "plot": "Eager to forge new business contacts, Del befriends Vimmal Malik, a wealthy businessman who seems eager to work with Trotters Independent Traders. After a dance at the Camberwell Chamber of Trade, Del and Vimmal are cornered by Mr Ram and his heavy boys. It seems that Vimmal is holding onto a pricey porcelain family heirloom that belongs to the Ram family - and they want it back. In order to make an impression, Del offers to mediate between the two men, especially because Mr Ram is willing to pay four grand for the return of the statue to his family. Unluckily for Del...",
      "imDbRating": "8.0",
      "imDbRatingCount": "643"
    },
    {
      "id": "tt0666581",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "The Second Time Around",
      "image": "https://m.media-amazon.com/images/M/MV5BNTVhZWZlMzgtOTJhYS00Zjg4LWE0MWItMjBiZjkwM2E4MmQ1XkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "1981",
      "released": "29 Sep. 1981",
      "plot": "Del meets Trigger in The Nag's Head, and he's stunned to hear that Pauline Harris, his ex-fiancée, is back in Peckham - twelve years after she left for America. Despite their engagement, Pauline left Del for another Mod with a faster scooter. But with her return, Del is willing to forgive and forget, and it's not long before they are engaged again - much to the disapproval of Rodney and Grandad. Things get worse when Pauline moves into the flat and refuses to do her share of the housework. As her behaviour becomes unbearable, Rodders and Gramps leave for Auntie Rose's...",
      "imDbRating": "7.6",
      "imDbRatingCount": "598"
    },
    {
      "id": "tt0666535",
      "seasonNumber": "1",
      "episodeNumber": "5",
      "title": "A Slow Bus to Chingford",
      "image": "https://m.media-amazon.com/images/M/MV5BMGNlYjZjNjAtMGIyMy00MTc3LWE1NTctYTlhMzUyZWQ3ZjM2L2ltYWdlXkEyXkFqcGdeQXVyMzk1MjY5Njc@._V1_Ratio1.7778_AL_.jpg",
      "year": "1981",
      "released": "6 Oct. 1981",
      "plot": "The trouble starts when Del persuades the local bus company to hand over one of their open-top buses in exchange for Rodney working as a Trainee Nocturnal Security Officer - part of their latest company, Trotter Watch. As part of the deal, Rodney has to suffer the nerve-jangling experience of patrolling the bus station on Tyler Street throughout the night. The next part of Del's scheme is the launch of Trotters' Ethnic Tours: a scenic tour around Chingford and Croydon, taking in such ethnic sights as the Lee Valley Viaduct. And despite a great deal of whinging from ...",
      "imDbRating": "7.5",
      "imDbRatingCount": "586"
    },
    {
      "id": "tt0666580",
      "seasonNumber": "1",
      "episodeNumber": "6",
      "title": "The Russians Are Coming",
      "image": "https://m.media-amazon.com/images/M/MV5BYTJlMmI2YzctYmY1Mi00NDVlLWFmMmYtYmY1YTBjNDYxMDZjXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "1981",
      "released": "13 Oct. 1981",
      "plot": "Another successful dodgy deal means Del has over a grand's worth of lead from a disused factory to get rid of. When Rodney points out the three tons of lead are in fact a D.I.Y nuclear fall-out shelter, Del refuses to believe him until he reads the accompanying brochure. With the threat of nuclear holocaust preying on Rodney's nerves he asks Del what he'd do if he heard the four minute warning. Without an answer, Del considers putting a survival plan into action that means reaching Grandad's allotment in time to take shelter. It's during a practice run for the Trotter...",
      "imDbRating": "7.8",
      "imDbRatingCount": "617"
    },
    {
      "id": "tt0666541",
      "seasonNumber": "1",
      "episodeNumber": "7",
      "title": "Christmas Crackers",
      "image": "https://m.media-amazon.com/images/M/MV5BN2U5NDMzNDAtYTg5My00OWEzLThlMWItZTdjNTMxYzRkYjA3XkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "1981",
      "released": "28 Dec. 1981",
      "plot": "Rodney has ran out of yuletide cheer, as the annual routing of the Trotter festivities are wearing thin. Burnt turkey, charred Christmas pudding, the same old things on television, and nothing but a book lent to him by Mickey Pierce: 'Body Language: The Lost Art.' When Grandad puts on his glad rags and heads to the OAPs' party at the community centre, the Trotter boys head to The Monte Carlo Club. Rodney puts his new-found knowledge of the unspoken language of love to use, but Del Boy has other ideas. As the brothers argue over who's technique is best, the objects of ...",
      "imDbRating": "7.6",
      "imDbRatingCount": "551"
    }
  ],
  "errorMessage": ""
}