{
  "imDbId": "tt2297757",
  "title": "Nathan for You",
  "fullTitle": "Nathan for You (TV Series 2013–2017)",
  "type": "TVSeries",
  "year": "2013",
  "items": [
    {
      "username": "cartsghammond",
      "userUrl": "https://www.imdb.com/user/ur80097352",
      "reviewLink": "https://www.imdb.com/review/rw4264317",
      "warningSpoilers": false,
      "date": "2 August 2018",
      "rate": "",
      "helpful": "36 out of 36 found this helpful.",
      "title": "Television Perfection",
      "content": "I was hesitant to start this show but i am SOO glad i did, honestly i would put in the top ten best shows ever. Nathan Fielder is a comedy genius who went to business school and got really good grades, his personality carries this show. Nathan for You is one of the few shows i could constantly watch and not need a break. it is not only Hilarious, but extremely interesting how \"normal\" people react to these crazy circumstances that Nathan puts in front of them. I also believe the season 4 finale \"Finding Frances\" has to be one of the greatest episodes of any show ever, and i would pay an endless amount of money for season 5"
    },
    {
      "username": "kofila",
      "userUrl": "https://www.imdb.com/user/ur10615924",
      "reviewLink": "https://www.imdb.com/review/rw3248586",
      "warningSpoilers": false,
      "date": "31 May 2015",
      "rate": "10",
      "helpful": "78 out of 82 found this helpful.",
      "title": "Behold, true genius is among us.",
      "content": "I can hardly describe what makes this show so incredible. I shall try though...There are hundreds of serialized projects coming to TV every year... Most of them are more or less the same as the next one. Most of them just recycle the same premise, characters and dialogs used for the past 30 years. I enjoy a good whodunit as much as the next guy but I can bear that for limited amount of time, once a week. TV needs to shift, bloom, amaze and shock. Nathan tries very much to do so. And if trying isn't enough for you, I can honestly say he has succeeded...Nathan will make you laugh, think and astonished all at once. The amount of original thought put into this is incredible. I am almost moved to tears by the effort and the pursuit of perfection. Thank you, Nathan!"
    },
    {
      "username": "MrMcMurphy",
      "userUrl": "https://www.imdb.com/user/ur33279808",
      "reviewLink": "https://www.imdb.com/review/rw3077181",
      "warningSpoilers": false,
      "date": "28 August 2014",
      "rate": "10",
      "helpful": "51 out of 54 found this helpful.",
      "title": "Couldn't breathe!",
      "content": "The hardest I've laughed in 10 years!... Three times!Seriously, 10 years ago I had to leave the theater so I could stop laughing, and BREATHE. This show got me to that point at least twice during the season.Nathan's magic comes from one thing, and he does it masterfully: HE COMMITS!!!You can't believe the things he says and does with a straight face and impeccable wit. My favorite is when he messes with the very people that we all know are just begging to be messed with (the uptight, Napoleon-complex, overly-sensitive, D-Bags!). You're like, \"I can't believe he just said that.\"... \"I can't believe that guy doesn't hit him.\"But he gets away with these things because of his unflappable commitment (people don't know what to do!).If I was Comedy Central, I'd have a \"Season\" for every season. (And, I'd be in heaven)P.S. Episode 7 of Season 1 strays from the magic formula with something completely different, but they're back too the magic in Ep. 8."
    },
    {
      "username": "pieeatingpirate",
      "userUrl": "https://www.imdb.com/user/ur19982419",
      "reviewLink": "https://www.imdb.com/review/rw3048120",
      "warningSpoilers": false,
      "date": "10 July 2014",
      "rate": "10",
      "helpful": "122 out of 127 found this helpful.",
      "title": "Manipulative and Hilarious",
      "content": "Nathan has a very clever way of manipulating people, whether it's the people he's supposedly trying to help or the customers he is trying to lure. It's not malicious, just hilarious. His ideas are ridiculous and completely irrational but the funny thing is that they work. From creating viral videos that end up on the news to creating TV shows that girls want to be in to promote themselves... it all illuminates how easily people can be suckered into things especially in the world of business and TV. If you're not amazed by the cleverness of the concepts and you don't like deadpan humor then it may not be for you. But there's nothing really like it and I hope more people find out about it because it deserves a good long run."
    },
    {
      "username": "qormi",
      "userUrl": "https://www.imdb.com/user/ur10384462",
      "reviewLink": "https://www.imdb.com/review/rw3358475",
      "warningSpoilers": true,
      "date": "20 November 2015",
      "rate": "10",
      "helpful": "15 out of 17 found this helpful.",
      "title": "Funniest Show ...I'm Hooked",
      "content": "Nathan for You is hilarious. Pure genius...reminds me of early Woody Allen or Sasha Baron Cohen in Borat. Nathan is portrayed as an arrogant loser...you know the type. The guy is completely clueless and the show is so creative in coming up with so many bizarre ideas. The reaction of people to Nathan's personality is half the fun. The formula is simple: Nathan makes a suggestion to a small business owner or manager on how to improve profits. They reluctantly agree and Nathan gets to work...consulting experts, etc. He then follows through on it and it's a disaster and ultimately rejected. Nathan then awkwardly tries befriend the client and he, too is rejected. Too funny!"
    },
    {
      "username": "Moviedude90",
      "userUrl": "https://www.imdb.com/user/ur22966552",
      "reviewLink": "https://www.imdb.com/review/rw6818637",
      "warningSpoilers": false,
      "date": "16 April 2021",
      "rate": "10",
      "helpful": "16 out of 18 found this helpful.",
      "title": "I literally couldn't turn it off",
      "content": "I hope he went on to be a major writer or produce more shows. Epic in his ability to keep a straight face."
    },
    {
      "username": "amheeley",
      "userUrl": "https://www.imdb.com/user/ur32666275",
      "reviewLink": "https://www.imdb.com/review/rw5009867",
      "warningSpoilers": false,
      "date": "21 July 2019",
      "rate": "10",
      "helpful": "20 out of 21 found this helpful.",
      "title": "Come back, Nathan!!! Come back!!!",
      "content": "The freshest show in decades. Comedy central really dropped the ball promoting this genius, clever and masterfully written show. The last episode left me speechless. I am now going through what could be considered heroin withdraw since I can't get my Nathan fix anymore. I hate him for not doing more with the show. But Love him for what he has accomplished. Can't wait to see what he does next. Hopefully next time it will be better promoted. Support this guy."
    },
    {
      "username": "franciscocole",
      "userUrl": "https://www.imdb.com/user/ur132337692",
      "reviewLink": "https://www.imdb.com/review/rw6898651",
      "warningSpoilers": false,
      "date": "10 May 2021",
      "rate": "10",
      "helpful": "16 out of 18 found this helpful.",
      "title": "best show of all time",
      "content": "Season 1: 10/10 Season 2: 10/10 Season 3: 10/10 Season 4: 10/10."
    },
    {
      "username": "beastiemca",
      "userUrl": "https://www.imdb.com/user/ur38395548",
      "reviewLink": "https://www.imdb.com/review/rw2769901",
      "warningSpoilers": false,
      "date": "19 March 2013",
      "rate": "10",
      "helpful": "74 out of 82 found this helpful.",
      "title": "One of the Funniest Shows... Period.",
      "content": "Comedy Central seemed to be on a losing streak with original material. The last shows to really do it for me have been Tosh.0 and occasionally Workaholics. I had pretty high expectations for the Ben Show, but the show turned out to be a bit of a dud. Nathan For You on the other hand is hilarious, and was a complete surprise.Nathan Fielder has a business degree... (probably an associates) and offers businesses his ideas on how to become successful. I was hooked from the very first episode I saw, where he gets a frozen yogurt place to sell poo flavored frozen yogurt. In the most recent episode I've seen, he helps a haunted attraction become world known, by trying to get someone to sue the owner for the attraction being too scary... GENIUS. Then, Nathan attempts to conquer his fear of women by creating a dating (bachelor-esque) reality show, with him as the bachelor. He spreads rumors about the good-looking host of the show amongst the women and creates awkward Michael Cera moments when he's alone with them.The show isn't for everybody, but it's total laugh-out-loud comedy for me. If you get the chance, definitely check it out!"
    },
    {
      "username": "aadgiles",
      "userUrl": "https://www.imdb.com/user/ur31523333",
      "reviewLink": "https://www.imdb.com/review/rw2764999",
      "warningSpoilers": false,
      "date": "10 March 2013",
      "rate": "10",
      "helpful": "112 out of 120 found this helpful.",
      "title": "My new favorite show",
      "content": "This is my sense of humor exactly. I love everything about this show. I was leery at first from the commercials, but after watching the first episode I could not stop laughing the whole time. Very low energy humor but just incredibly funny in the situations. The conversations are too awkward and ridiculous not to be funny. I showed it to many friends who also loved it. So far this might be the funniest new show on TV. Despite the ridiculousness, some of the ideas are actually pretty good in their own right. I think this show is pretty original, and a great parody of the business marketing TV shows. This is something I personally have been waiting for, its simple, clever, and a satirical comment about American business culture, but with genuine brilliance behind the hilarity. I think Nathan is a genius, and I really hope this show doesn't get canceled like another comment said. I would love to see it continue, but comedy central does love their one season hilarious shows. Hopefully they learn early on that this is a great one and keep it going. The world needs more Nathan."
    },
    {
      "username": "nihar142",
      "userUrl": "https://www.imdb.com/user/ur24126298",
      "reviewLink": "https://www.imdb.com/review/rw4140682",
      "warningSpoilers": false,
      "date": "24 April 2018",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "A Profound Troll",
      "content": "Not just Hilarious Cringe Comedy but also a satirical take on the 21st Century Management Strategies and Corporate America's influence on small businesses."
    },
    {
      "username": "rzajac",
      "userUrl": "https://www.imdb.com/user/ur1517556",
      "reviewLink": "https://www.imdb.com/review/rw3346035",
      "warningSpoilers": false,
      "date": "30 October 2015",
      "rate": "10",
      "helpful": "14 out of 18 found this helpful.",
      "title": "Superb",
      "content": "Nathan Fielder is a wunderkind. I'm actually kind of jaded on TV shows, and Nathan for You has me utterly rapt.The show has depth, from concept to edit. Everyone seems to be pulling their weight. And, of course, Nathan himself continues to come off as the faux-jaunty, need-to-succeed, driven-yet-fey figure in the eye of a moral typhoon of his own furtive fashioning. He's surely the man of the decade.Just noticed what may be a shift in style; most of the shows thus far have involved his plying two concepts per-show. A recent episode (S03E03/\"The Movement\") is devoted to ONE concept. Perhaps not quite the embarrassment of riches of previous shows, but it worked just fine; if he can keep that up, good on 'im!I note the show is rated highly on IMDb, from a relative paucity of commenters. It would be sad to think of the show as a rare delicacy, enjoyed by connoisseurs. NATHAN FOR EVERYBODY, y'all!Godspeed, Nathan."
    },
    {
      "username": "mcvallin-389-686890",
      "userUrl": "https://www.imdb.com/user/ur34196046",
      "reviewLink": "https://www.imdb.com/review/rw4146342",
      "warningSpoilers": false,
      "date": "28 April 2018",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Just watch it",
      "content": "I cried and my face hurt from laughing. The extent that he takes things and the commitment he has to his ridiculous ideas is amazing. I really hope that he'll be able to continue with the show, but people will probably catch on... I hope not, but all good things must come to an end.This is a hidden gem that gets overlooked. It has an 8.8 rating right now, thanks to people with a dim sense of humor that gave it a 1. Would be much higher without the curmudgeons. JUST WATCH IT"
    },
    {
      "username": "sclafunk",
      "userUrl": "https://www.imdb.com/user/ur86921512",
      "reviewLink": "https://www.imdb.com/review/rw4532361",
      "warningSpoilers": false,
      "date": "24 December 2018",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Unbelievably creative and hilarious",
      "content": "There is nothing else like this on tv, never has been never will be. There were episodes were I was literally rolling the floor uncontrollably laughing so hard. I yearn for more Of this show, tho a season 5 seems unlikely at this point. Multiple campaigns from this show went viral, you're gonna watch it and be like: \"OMG THAT WAS HIM!?!!?l\". Multiple corporations have stolen his ideas. I can not say close to enough good things about this show. You're honestly better off knowing little as you can just hopping in, you won't stop, make sure u have time to binge Bc you're gonna wanna..."
    },
    {
      "username": "renovations1984",
      "userUrl": "https://www.imdb.com/user/ur39732141",
      "reviewLink": "https://www.imdb.com/review/rw4050616",
      "warningSpoilers": false,
      "date": "2 February 2018",
      "rate": "10",
      "helpful": "26 out of 27 found this helpful.",
      "title": "10 More Seasons Please",
      "content": "It is terribly clever and too hard to describe but I wanted to say it is real at least most of it is very real. I knew the man who claimed to have the best burger in all of los Angeles. That helped me to know it was real. There are times you will be confused. I feel like this Nathan cat jumped out of Heaven (Canada seems to be where many heavenly creatures are from). If not for comedian, Doug Stanhope recommending this while on the Joe Rogan show I never would have KNOWN about this show. I guess when you move from LA and NYC you don't see all the banners for these shows. So I just started in 2018. I'm in the middle of season 3. PLEASE never stop. Nathan, I LOVE YOU. I LOVE YOU (he likes hearing that a lot). Perfection. The most unique comedy show in years."
    },
    {
      "username": "hgtama",
      "userUrl": "https://www.imdb.com/user/ur42730110",
      "reviewLink": "https://www.imdb.com/review/rw2783660",
      "warningSpoilers": false,
      "date": "17 April 2013",
      "rate": "10",
      "helpful": "64 out of 70 found this helpful.",
      "title": "This show is simply genius",
      "content": "Nathan for You became my favorite show on television after watching just 2 episodes and I've now seen each episode 3+ times. His deadpan and awkward approach in combination with his hilarious ideas are what really makes it funny. It's a brand of humor that I've never really seen before. I'm 27 years old and it's tough to find a show that both me and my parents can enjoy. My wife, brother, and all of my friends laugh hysterically while watching it. Even the raunchy parts of the show, he somehow manages to take it and make it seem innocent. Best of all, Nathan pulls off clean humor better than any comedian I've seen in a long time. All I can say is it better get renewed!!!"
    },
    {
      "username": "Bryan-",
      "userUrl": "https://www.imdb.com/user/ur40211592",
      "reviewLink": "https://www.imdb.com/review/rw3817429",
      "warningSpoilers": false,
      "date": "28 September 2017",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "It's back!",
      "content": "After some years season 4 is finally airing and I'm thrilled. I'm surprised to see so few reviews on here, but not really. A lot of brilliant shows go unseen. Anyway, not sure how to explain why you should watch this. It's funny and real, real funny you might say."
    },
    {
      "username": "sydnee_man",
      "userUrl": "https://www.imdb.com/user/ur23814261",
      "reviewLink": "https://www.imdb.com/review/rw7009316",
      "warningSpoilers": false,
      "date": "8 June 2021",
      "rate": "8",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Awful and hilarious",
      "content": "This show is uncomfortable to watch and it feels like he's making fun of some of the people. Just when you think you can't watch it anymore, something hilarious happens and you end up laughing so hard you cry. I gave it an 8 instead of a 9 because some of the episodes are just weird or silly. But some episodes are really good."
    },
    {
      "username": "tinytots2",
      "userUrl": "https://www.imdb.com/user/ur144605672",
      "reviewLink": "https://www.imdb.com/review/rw7671691",
      "warningSpoilers": false,
      "date": "22 December 2021",
      "rate": "8",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Nathan for Me, Nathan for You, Nathan for Everyone!",
      "content": "In Nathan for You, the comedian Nathan Fielder poses as a business consultant to aid various struggling commercial enterprises and organizations. The approaches he proposes to solve their problems in a competitive market are creative and inventive but strange, sometimes to an extreme degree. Despite initial opposition or scepticism, he is given a chance to demonstrate the viability and utility of his schemes, a task that often leads him down long protracted rabbit holes as they are rarely straightforward to implement. By hook or by crook, he is typically able to achieve some success in his results with the whole process being captured on film.Nathan for You, to me, was very much an acquired taste. Not being a lover of cringe or awkward comedy, the initial episodes had me perceiving the show to be rather mean-spirited with its humour based on lampooning the gullibility of small business owners. But as I watched more and pondered further, it became clearer that the series instead satirized consulting practices, showing how claiming expertise could permit one to propound and execute absurd ideas by presenting them as solutions to specified challenges. The butt of the jokes weren't the business owners, nor the seemingly-aggrieved customers, but Nathan the consultant himself!This realization was instrumental in enabling me to appreciate and enjoy the show more. A few of the episodes still rode the line of what I felt acceptable but at many moments, I found myself unconsciously laughing out loud. I came to love the deadpan awkward personality Nathan portrayed, the attention to detail in the elaborate plans required to realize the proposed solutions, the recurring side characters with their inputs and insights, and the blurring of the line between reality television and scripted comedy. I also loved that there were real emotional moments as well as profound thought-provoking reflections to be found within some episodes. All together, these elements combined together to make Nathan for You a unique enthralling experience and one of my favourite comedy shows in the awkward humour genre."
    },
    {
      "username": "p-ripley-627-402477",
      "userUrl": "https://www.imdb.com/user/ur41584912",
      "reviewLink": "https://www.imdb.com/review/rw2764188",
      "warningSpoilers": false,
      "date": "7 March 2013",
      "rate": "10",
      "helpful": "94 out of 118 found this helpful.",
      "title": "Possibly the funniest show on TV",
      "content": "If you have the misfortune of reading this post, please don't find a way to let me know the ten reason why Louie or Parks and Rec are better (Louie is by far funnier than P&R however). This show is just better, i wont tell you why, that's for you to decide. But it is my honest opinion that (admittedly only after two episodes), this show has IT. IT's crude, it's satirical, It has heart, and the presenter is a bastard, these are hard attributes to blend evenly without creating something that's either unbalanced or rubbish. I hope it maintains its quality until it gets canceled, it's not going to last long, i don't know why, it just wont."
    },
    {
      "username": "mcguire-d",
      "userUrl": "https://www.imdb.com/user/ur28523830",
      "reviewLink": "https://www.imdb.com/review/rw4613768",
      "warningSpoilers": false,
      "date": "29 January 2019",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "In tears",
      "content": "I'll start by saying this is my first ever review (after using IMDB for many years) but I just had to spread the word and support this series and all who worked on it. The show is not only funny, it is hilariously clever and so well put together - every episode is unique and I've never thought I could upset my wife so much by bursting out laughing (usually watching after she's asleep, haha).It breaks my heart there will be no 5th season, but I cannot wait to see what is next from the genius mind of Nathan Fielder. A must watch for anyone who loves to laugh!"
    },
    {
      "username": "savethehabitrail",
      "userUrl": "https://www.imdb.com/user/ur59417701",
      "reviewLink": "https://www.imdb.com/review/rw3207382",
      "warningSpoilers": false,
      "date": "23 March 2015",
      "rate": "10",
      "helpful": "33 out of 39 found this helpful.",
      "title": "Doesn't get much funnier than this!",
      "content": "I have a very particular taste in TV and even more specific and increasingly picky taste in comedy, and this show just happens to hit on all the right notes that tickle my funny bone, the execution is perfect, Nathan is deliciously awkward in the best way possible, I'd love to have a beer with that guy, in or out of character. Beware though, the people that won't get this show or understand the humor will absolutely hate it with every fiber of their being. Textbook Love it or Hate it situation. But if you have a slightly childish sense of humor and the cynicism and disdain for humanity as an old geyser, this may be a perfect match for you. Hope you enjoy!"
    },
    {
      "username": "curemyoptimism",
      "userUrl": "https://www.imdb.com/user/ur65077763",
      "reviewLink": "https://www.imdb.com/review/rw3401378",
      "warningSpoilers": false,
      "date": "23 January 2016",
      "rate": "10",
      "helpful": "51 out of 61 found this helpful.",
      "title": "The light of laughter in my darkest of times.",
      "content": "I was going through a very tough time in my life where it felt like I had forgotten how to laugh or smile and like some kind of miracle, I stumbled upon a Nathan for You clip on Youtube. It was the poop frozen yogurt episode. When I watched the clip I knew I had to watch the entire episode and just binge on Nathan for You. It felt so foreign to laugh, yet amazing after not doing so for weeks. I remember crying after watching a few episodes, not because I was sad, but because this show had made me laugh and actually feel good after thinking I would never feel that way again as I was heavily considering suicide. There is so much silly absurdity in life that make for a good laugh and this show helped me see it. After watching this show, I remembered what funny was and it was a refreshing feeling. I totally identified with Nathan Fielder's character and love the way he isn't afraid to say things that would make others uncomfortable. He's a rebel. I remembered that there are people in this world that enjoy making others feel happy. There isn't one episode I didn't like, I absolutely love them all. This show really picked me up form the hole I was in, and after that I began to see the lighter side of life. This may sound nuts, crazy or unbelievable to you, but it really helped me and it was like something clicked in my brain. I really hope this show doesn't get cancelled and that Nathan may continue to bring us joy and laughter. If the show does unfortunately come to an end, I hope he continues to do what he loves and make people laugh. I could go on for at least another hour on how this show made me feel good and gave me hope in life, but I will cut it here.It's safe for me to say that Nathan Fielder saved my life. If I ever meet him, I will shake his hand and thank him for a job well done. I love you Nathan Fielder! 11/10 stars!"
    },
    {
      "username": "djanimartinov",
      "userUrl": "https://www.imdb.com/user/ur111789490",
      "reviewLink": "https://www.imdb.com/review/rw5397206",
      "warningSpoilers": false,
      "date": "11 January 2020",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "One of the funniest shows ever made . A must watch.",
      "content": "Brilliant humour from a really smart man , every episode is perfect and keeps you watching with your jaw dropped as to how ridicoulous and funny and unique nathans ideas are. Each and every episode is perfect with its awkward and dry humour , and nathan staying in character really sells the whole show . Its a pitty it ended as this is one that could have gone on for decades . Dont hand out many of these but it deserves a 10."
    },
    {
      "username": "marksusslist",
      "userUrl": "https://www.imdb.com/user/ur79041897",
      "reviewLink": "https://www.imdb.com/review/rw3770872",
      "warningSpoilers": false,
      "date": "3 August 2017",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Hard to describe, impossible to beat",
      "content": "I really just want to add a 10/10 rating. I can't begin to describe the show, which is by turns funny enough to have you sobbing with laughter, or so cringe-worthy you have to watch with your eyes closed, or - all of a sudden - is a show creating the most intricate work of performance art that i have ever seen ('Smokers Allowed').Don't miss it."
    }
  ],
  "errorMessage": ""
}