{
  "imDbId": "tt2297757",
  "title": "Nathan for You",
  "fullTitle": "Nathan for You (TV Series 2013–2017)",
  "type": "TVSeries",
  "year": "2013",
  "language": "en",
  "titleInLanguage": "Nathan for You",
  "url": "https://en.wikipedia.org/wiki/Nathan_for_You",
  "plotShort": {
    "plainText": "Nathan for You is an American docu-reality comedy television series starring Canadian comedian Nathan Fielder. The series was created by Fielder and Michael Koman and premiered on February 28, 2013, on the American cable television network Comedy Central. In the general premise of the series, Fielder plays a fictionalized off-kilter version of himself, trying to use his business background and life experiences to help struggling companies and people, frequently offering them outlandish strategies, parodying the methods of marketing and management consultants. Twenty-seven of the show's 32 episodes follow this structure as applied to one or more businesses in the Southern California area, with five others (\"The Claw of Shame\", \"The Hero\", \"A Celebration\", \"The Anecdote\", and \"Finding Frances\") departing from the business advice format to showcase other comedic premises.\r\nThe series ran for four seasons. In October 2018, Comedy Central confirmed that Nathan for You had ended, with Fielder deciding to focus on other projects. It received acclaim from critics, several of whom considered it one of the best TV shows of the 2010s.",
    "html": "<p>Nathan for You is an American docu-reality comedy television series starring Canadian comedian Nathan Fielder. The series was created by Fielder and Michael Koman and premiered on February 28, 2013, on the American cable television network Comedy Central. In the general premise of the series, Fielder plays a fictionalized off-kilter version of himself, trying to use his business background and life experiences to help struggling companies and people, frequently offering them outlandish strategies, parodying the methods of marketing and management consultants. Twenty-seven of the show's 32 episodes follow this structure as applied to one or more businesses in the Southern California area, with five others (\"The Claw of Shame\", \"The Hero\", \"A Celebration\", \"The Anecdote\", and \"Finding Frances\") departing from the business advice format to showcase other comedic premises.</p><p>The series ran for four seasons. In October 2018, Comedy Central confirmed that Nathan for You had ended, with Fielder deciding to focus on other projects. It received acclaim from critics, several of whom considered it one of the best TV shows of the 2010s.</p>"
  },
  "plotFull": {
    "plainText": "Nathan for You is an American docu-reality comedy television series starring Canadian comedian Nathan Fielder. The series was created by Fielder and Michael Koman and premiered on February 28, 2013, on the American cable television network Comedy Central. In the general premise of the series, Fielder plays a fictionalized off-kilter version of himself, trying to use his business background and life experiences to help struggling companies and people, frequently offering them outlandish strategies, parodying the methods of marketing and management consultants. Twenty-seven of the show's 32 episodes follow this structure as applied to one or more businesses in the Southern California area, with five others (\"The Claw of Shame\", \"The Hero\", \"A Celebration\", \"The Anecdote\", and \"Finding Frances\") departing from the business advice format to showcase other comedic premises.\r\nThe series ran for four seasons. In October 2018, Comedy Central confirmed that Nathan for You had ended, with Fielder deciding to focus on other projects. It received acclaim from critics, several of whom considered it one of the best TV shows of the 2010s.\r\nBackground\r\nThe series centers on Nathan Fielder, a business school graduate and consultant whose aim is to help struggling businesses. His marketing proposals are often outlandish and elaborate. One of the show's long-running story arcs concerns Fielder and his social awkwardness. Throughout episodes, his confidence is eroded as his ideas fail. In the show's first season, Fielder is unaware people do not enjoy his company. The character is based on Fielder's real life and his own struggles with social anxiety; he has noted that he did not want the character to \"feel like a comedy character\" but one that delivers the \"most authentic moments from myself.\"\r\nProduction\r\nNathan for You was created by comedian Nathan Fielder and writer Michael Koman. The show evolved out of segments on the Canadian news satire series This Hour Has 22 Minutes titled \"Nathan On Your Side,\" wherein Fielder played a consumer advocate. The show was greenlit following the cancellation of Jon Benjamin Has a Van, which Fielder also wrote and appeared in. Part of the series' inspiration came from Fielder's fascination with the subprime mortgage crisis, and how he found that it was rooted in \"these personal moments between people where someone senses something's wrong, but they don't want to speak up.\"\r\nMarketing ideas were developed in myriad ways. Often, Fielder and the writing team came up with an idea specifically for the business, while other times, concepts were formed in a completely unrelated way. Some ideas were thrown out because they were deemed not visually interesting or engaging for viewers.\r\nAlthough each episode had a loose script for Fielder, much of the dialogue was improvised. Although the featured businesses were real and consented to be filmed, the employees were not told it was for a comedy show, so their reactions to Fielder's antics are genuine. As a result, the show's writing process involved \"a lot of guessing and testing,\" according to Fielder. Roughly 90 hours of footage were required to make each 22-minute episode. Episodes were constantly re-written based on the interactions Fielder received. Fielder called the show's process \"a very inefficient way of making TV.\"\r\nHistory\r\nThe series premiere garnered 354,000 viewers, improving in its second episode to 570,000. A special sneak peek episode that aired on March 13, 2013, after an episode of Workaholics further increased viewership, ending up at 615,000. The following episode, airing on March 14, had 428,000 viewers. The next week on March 21, ratings dropped further, landing at 394,000 viewers. On April 26, 2013, Comedy Central renewed the series for a second season of 8 episodes. Season 3 premiered on October 15, 2015. On December 10, 2015, Comedy Central picked up the show for a fourth season. The fourth season premiered on September 28, 2017, preceded by a one-hour special, \"Nathan for You: A Celebration\", which aired the week before. In June 2018, it was announced that Nathan for You would stream on Hulu.\r\nPublicity\r\nSeveral stunts performed for the series garnered attention from the mainstream media. One in particular occurred even before the series premiered.\r\nPetting Zoo Hero\r\nIn the second episode of season one, Fielder and the show's crew attempted to boost the popularity of a California petting zoo by turning one of their pigs into a celebrity through the filming of a hoax video of the pig (actually a trained stand-in pig following a plastic-walled course underneath the water) rescuing a goat who was stuck in a pond. Fielder had the crew sign non-disclosure agreements in order to maintain secrecy around the production.\r\nFielder uploaded the video to YouTube in September 2012 under the username \"jebdogrpm\". He titled the clip \"Pig rescues baby goat\", and gave it the simple description: \"Pig saves goat who’s foot was stuck underwater at petting zoo. Simply amazing.\" Fielder made no efforts to promote the piece but found that websites like Gawker and Reddit quickly began reposting the video. The video was then picked up on various national news broadcasts, including the NBC Nightly News, The Today Show, and Good Morning America.\r\nThe hoax was finally revealed in February 2013, before the series premiered, by which time the video had received seven million views. In an interview with The New York Times, Fielder marveled at how major press outlets had shared the video: \"If we were trying to pull an elaborate hoax on the news, I think we could have pushed further. But we weren’t. We found it interesting that people were sharing it without us saying anything.\" As of July 2021, the video has more than ten million views.\r\nDumb Starbucks\r\nOver the weekend of February 7, 2014, a coffee shop known as \"Dumb Starbucks\" opened in Los Feliz. The shop greatly resembled those of the chain Starbucks and used a modified version of its logo. The names of all of its products were prefixed with \"Dumb,\" and the shop offered CDs mimicking the real Starbucks products for sale, including \"Dumb Jazz Standards\" and \"Dumb Nora Jones Duets.\" The shop argued that it was actually an art gallery for \"legal reasons,\" because \"by adding the word 'dumb' we are technically 'making fun' of Starbucks, which allows us to use their trademarks under a legal doctrine known as 'fair use.'\" After attracting a large lineup of curious attendees over the weekend, it was speculated that the store was a hoax connected to a television program; on the following Monday, a press conference held at Dumb Starbucks revealed that the store was a Nathan for You stunt. Before the stunt was revealed, some attendees thought that the shop had been created by Banksy.\r\nCry Wolfe\r\nAn appearance in the eighth episode of the show's first season by private investigator Brian Wolfe led to Wolfe getting his own reality series on Investigation Discovery, Cry Wolfe. This was referenced on Nathan for You on the eighth episode of the second season, when Nathan tried to get a similar reality TV deal for a security guard who had also appeared in season one.\r\nThe Movement\r\nEpisode three of the show's third season focused on Nathan's attempt to help a struggling moving company by providing the business with free labor. The plan involved the creation and marketing of an original fitness routine called \"The Movement,\" which would emphasize the lifting of household objects (namely boxes and furniture) for exercise, and preclude the need for practitioners to go to a gym or health club. Nathan would then lure interested parties into working for the moving company by leading them to believe they were simply exercising. Marketing for \"The Movement\" involved a ghost-written book, which subsequently made it on to the Amazon best-seller list, and several television appearances by the \"inventor\" and public face of the routine, bodybuilder Jack Garbarino.\r\nIn December 2018, Amazon reported that \"a woman managed to lose 100 pounds in 18 months just by delivering packages for the Amazon Flex service,\" which resulted in several comparisons to The Movement, including by Fielder himself.\r\nEpisodes\r\nReception\r\nNathan for You received critical acclaim. On the review aggregation website Rotten Tomatoes, the first season holds an approval rating of 89% with an average rating of 8/10, based on 9 reviews. The second season has an approval rating of 100% with an average rating of 8.3/10, based on 10 reviews, with a critics consensus of, \"Nathan for You arrived a brilliant comedy, but viewers will feel more acclimated to the series' cringeworthy wit in a second season that makes great use of Nathan Fielder's unflappable awkwardness.\" The third season has an approval rating of 100% with an average rating of 9.6/10, based on 12 reviews, with a critics consensus of, \"Nathan for You continues to gain dimensionality in its third season, still plumbing horrified laughs while also unearthing a great deal of heart in its shameless star.\" The fourth season has an approval rating of 100% with an average rating of 9/10, based on 14 reviews, with a critics consensus of, \"Nathan for You is an extraordinary program that effectively blurs the lines between television and reality.\"\r\nNeil Genzlinger of The New York Times dubbed it \"the television series with the most incisive take on the 21st-century economy,\" praising Fielder for \"illuminating the relationship between the economy and absurdity.\" John Thorp of The Guardian called its central concept \"genius,\" finding it \"functions as a razor-sharp satire of commercialism, with a surprising undercurrent of genuine pathos.\" Willa Paskin of Slate found it \"brilliant, fascinating, and uncomfortable.\" Academy Award winning film director Errol Morris called the Season 4 finale, \"Finding Frances\", \"unfathomably great.\" Steve Greene from IndieWire called Nathan for You the greatest reality television series ever made.\r\nThe series won Best Comedy/Variety Sketch Series at the 71st Writers Guild of America Awards in 2019, and was nominated in same category at the ceremonies in 2017 and 2018. At the 2018 WGA Awards ceremony, it received an additional nomination for Best Television Writing in a Comedy/Variety Special for the episode \"A Celebration\". Nathan for You was included on lists of the best shows of the 2010s published by Paste, The A.V. Club, IndieWire, GQ, Stuff, /Film, Consequence, Film School Rejects, and GamesRadar+. In 2021, The New York Times named it one of the best comedy series of the 21st century.",
    "html": "<p>Nathan for You is an American docu-reality comedy television series starring Canadian comedian Nathan Fielder. The series was created by Fielder and Michael Koman and premiered on February 28, 2013, on the American cable television network Comedy Central. In the general premise of the series, Fielder plays a fictionalized off-kilter version of himself, trying to use his business background and life experiences to help struggling companies and people, frequently offering them outlandish strategies, parodying the methods of marketing and management consultants. Twenty-seven of the show's 32 episodes follow this structure as applied to one or more businesses in the Southern California area, with five others (\"The Claw of Shame\", \"The Hero\", \"A Celebration\", \"The Anecdote\", and \"Finding Frances\") departing from the business advice format to showcase other comedic premises.</p><p>The series ran for four seasons. In October 2018, Comedy Central confirmed that Nathan for You had ended, with Fielder deciding to focus on other projects. It received acclaim from critics, several of whom considered it one of the best TV shows of the 2010s.</p><br/><h3>Background</h3><p>The series centers on Nathan Fielder, a business school graduate and consultant whose aim is to help struggling businesses. His marketing proposals are often outlandish and elaborate. One of the show's long-running story arcs concerns Fielder and his social awkwardness. Throughout episodes, his confidence is eroded as his ideas fail. In the show's first season, Fielder is unaware people do not enjoy his company. The character is based on Fielder's real life and his own struggles with social anxiety; he has noted that he did not want the character to \"feel like a comedy character\" but one that delivers the \"most authentic moments from myself.\"</p><br/><h3>Production</h3><p>Nathan for You was created by comedian Nathan Fielder and writer Michael Koman. The show evolved out of segments on the Canadian news satire series This Hour Has 22 Minutes titled \"Nathan On Your Side,\" wherein Fielder played a consumer advocate. The show was greenlit following the cancellation of Jon Benjamin Has a Van, which Fielder also wrote and appeared in. Part of the series' inspiration came from Fielder's fascination with the subprime mortgage crisis, and how he found that it was rooted in \"these personal moments between people where someone senses something's wrong, but they don't want to speak up.\"</p><p>Marketing ideas were developed in myriad ways. Often, Fielder and the writing team came up with an idea specifically for the business, while other times, concepts were formed in a completely unrelated way. Some ideas were thrown out because they were deemed not visually interesting or engaging for viewers.</p><p>Although each episode had a loose script for Fielder, much of the dialogue was improvised. Although the featured businesses were real and consented to be filmed, the employees were not told it was for a comedy show, so their reactions to Fielder's antics are genuine. As a result, the show's writing process involved \"a lot of guessing and testing,\" according to Fielder. Roughly 90 hours of footage were required to make each 22-minute episode. Episodes were constantly re-written based on the interactions Fielder received. Fielder called the show's process \"a very inefficient way of making TV.\"</p><br/><h3>History</h3><p>The series premiere garnered 354,000 viewers, improving in its second episode to 570,000. A special sneak peek episode that aired on March 13, 2013, after an episode of Workaholics further increased viewership, ending up at 615,000. The following episode, airing on March 14, had 428,000 viewers. The next week on March 21, ratings dropped further, landing at 394,000 viewers. On April 26, 2013, Comedy Central renewed the series for a second season of 8 episodes. Season 3 premiered on October 15, 2015. On December 10, 2015, Comedy Central picked up the show for a fourth season. The fourth season premiered on September 28, 2017, preceded by a one-hour special, \"Nathan for You: A Celebration\", which aired the week before. In June 2018, it was announced that Nathan for You would stream on Hulu.</p><br/><h3>Publicity</h3><p>Several stunts performed for the series garnered attention from the mainstream media. One in particular occurred even before the series premiered.</p><h4>Petting Zoo Hero</h4><p>In the second episode of season one, Fielder and the show's crew attempted to boost the popularity of a California petting zoo by turning one of their pigs into a celebrity through the filming of a hoax video of the pig (actually a trained stand-in pig following a plastic-walled course underneath the water) rescuing a goat who was stuck in a pond. Fielder had the crew sign non-disclosure agreements in order to maintain secrecy around the production.</p><p>Fielder uploaded the video to YouTube in September 2012 under the username \"jebdogrpm\". He titled the clip \"Pig rescues baby goat\", and gave it the simple description: \"Pig saves goat who’s foot was stuck underwater at petting zoo. Simply amazing.\" Fielder made no efforts to promote the piece but found that websites like Gawker and Reddit quickly began reposting the video. The video was then picked up on various national news broadcasts, including the NBC Nightly News, The Today Show, and Good Morning America.</p><p>The hoax was finally revealed in February 2013, before the series premiered, by which time the video had received seven million views. In an interview with The New York Times, Fielder marveled at how major press outlets had shared the video: \"If we were trying to pull an elaborate hoax on the news, I think we could have pushed further. But we weren’t. We found it interesting that people were sharing it without us saying anything.\" As of July 2021, the video has more than ten million views.</p><h4>Dumb Starbucks</h4><p>Over the weekend of February 7, 2014, a coffee shop known as \"Dumb Starbucks\" opened in Los Feliz. The shop greatly resembled those of the chain Starbucks and used a modified version of its logo. The names of all of its products were prefixed with \"Dumb,\" and the shop offered CDs mimicking the real Starbucks products for sale, including \"Dumb Jazz Standards\" and \"Dumb Nora Jones Duets.\" The shop argued that it was actually an art gallery for \"legal reasons,\" because \"by adding the word 'dumb' we are technically 'making fun' of Starbucks, which allows us to use their trademarks under a legal doctrine known as 'fair use.'\" After attracting a large lineup of curious attendees over the weekend, it was speculated that the store was a hoax connected to a television program; on the following Monday, a press conference held at Dumb Starbucks revealed that the store was a Nathan for You stunt. Before the stunt was revealed, some attendees thought that the shop had been created by Banksy.</p><h4>Cry Wolfe</h4><p>An appearance in the eighth episode of the show's first season by private investigator Brian Wolfe led to Wolfe getting his own reality series on Investigation Discovery, Cry Wolfe. This was referenced on Nathan for You on the eighth episode of the second season, when Nathan tried to get a similar reality TV deal for a security guard who had also appeared in season one.</p><h4>The Movement</h4><p>Episode three of the show's third season focused on Nathan's attempt to help a struggling moving company by providing the business with free labor. The plan involved the creation and marketing of an original fitness routine called \"The Movement,\" which would emphasize the lifting of household objects (namely boxes and furniture) for exercise, and preclude the need for practitioners to go to a gym or health club. Nathan would then lure interested parties into working for the moving company by leading them to believe they were simply exercising. Marketing for \"The Movement\" involved a ghost-written book, which subsequently made it on to the Amazon best-seller list, and several television appearances by the \"inventor\" and public face of the routine, bodybuilder Jack Garbarino.</p><p>In December 2018, Amazon reported that \"a woman managed to lose 100 pounds in 18 months just by delivering packages for the Amazon Flex service,\" which resulted in several comparisons to The Movement, including by Fielder himself.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 28, 2013</td><td style=\"padding:0 8px\">April 18, 2013</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">July 1, 2014</td><td style=\"padding:0 8px\">August 19, 2014</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 15, 2015</td><td style=\"padding:0 8px\">December 10, 2015</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"3\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Special</span></span></span></span></th><td colspan=\"2\" style=\"padding:0.2em 0.4em\">September 21, 2017</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 28, 2017</td><td style=\"padding:0 8px\">November 9, 2017</td></tr></tbody></table><br/><h3>Reception</h3><p>Nathan for You received critical acclaim. On the review aggregation website Rotten Tomatoes, the first season holds an approval rating of 89% with an average rating of 8/10, based on 9 reviews. The second season has an approval rating of 100% with an average rating of 8.3/10, based on 10 reviews, with a critics consensus of, \"Nathan for You arrived a brilliant comedy, but viewers will feel more acclimated to the series' cringeworthy wit in a second season that makes great use of Nathan Fielder's unflappable awkwardness.\" The third season has an approval rating of 100% with an average rating of 9.6/10, based on 12 reviews, with a critics consensus of, \"Nathan for You continues to gain dimensionality in its third season, still plumbing horrified laughs while also unearthing a great deal of heart in its shameless star.\" The fourth season has an approval rating of 100% with an average rating of 9/10, based on 14 reviews, with a critics consensus of, \"Nathan for You is an extraordinary program that effectively blurs the lines between television and reality.\"</p><p>Neil Genzlinger of The New York Times dubbed it \"the television series with the most incisive take on the 21st-century economy,\" praising Fielder for \"illuminating the relationship between the economy and absurdity.\" John Thorp of The Guardian called its central concept \"genius,\" finding it \"functions as a razor-sharp satire of commercialism, with a surprising undercurrent of genuine pathos.\" Willa Paskin of Slate found it \"brilliant, fascinating, and uncomfortable.\" Academy Award winning film director Errol Morris called the Season 4 finale, \"Finding Frances\", \"unfathomably great.\" Steve Greene from IndieWire called Nathan for You the greatest reality television series ever made.</p><p>The series won Best Comedy/Variety Sketch Series at the 71st Writers Guild of America Awards in 2019, and was nominated in same category at the ceremonies in 2017 and 2018. At the 2018 WGA Awards ceremony, it received an additional nomination for Best Television Writing in a Comedy/Variety Special for the episode \"A Celebration\". Nathan for You was included on lists of the best shows of the 2010s published by Paste, The A.V. Club, IndieWire, GQ, Stuff, /Film, Consequence, Film School Rejects, and GamesRadar+. In 2021, The New York Times named it one of the best comedy series of the 21st century.</p><br/>"
  },
  "errorMessage": ""
}