{
  "imDbId": "tt2707408",
  "title": "Narcos",
  "fullTitle": "Narcos (TV Series 2015–2017)",
  "type": "TVSeries",
  "year": "2015",
  "items": [
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw5589670",
      "warningSpoilers": false,
      "date": "29 March 2020",
      "rate": "9",
      "helpful": "88 out of 92 found this helpful.",
      "title": "Outstanding!",
      "content": "Narcos is such a great show it's hard to explain just how good it really is. Wagner Moura and Pedro Pescal lead an amazing cast who suck you right into the show. There have been a lot of shows about drug cartels but this is without a doubt the best and it's bit close! It really is addicting once you start watching and you get used the subtitles pretty quick."
    },
    {
      "username": "gillmurphydogg",
      "userUrl": "https://www.imdb.com/user/ur160563229",
      "reviewLink": "https://www.imdb.com/review/rw8779521",
      "warningSpoilers": false,
      "date": "5 January 2023",
      "rate": "9",
      "helpful": "28 out of 28 found this helpful.",
      "title": "Great drug cartel series",
      "content": "Such a great show! Though the topic of drugs and the war on drugs is so \"easy\", it can still be appropriated to screen so poorly. I found Narcos akin to The Wire in terms of doing honor to the subject matter in a multi-layered way.It's a gritty show and unlike The Wire, it's more true crime/fact-based. The show gives fascinating insights into the inner workings of drug/crime syndicates and the level of risk people will take to transport them across borders and into other countries. It tells of the brutality of drug lords and the lengths they'll go to make profit. The acting, cinematography and script are first class."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8823687",
      "warningSpoilers": false,
      "date": "24 January 2023",
      "rate": "9",
      "helpful": "46 out of 48 found this helpful.",
      "title": "Amazing!",
      "content": "Narcos is just a flat out great show. Its just so gritty and realistic. It's about the rise and fall of one of the most notorious drug lords, Pablo Escobar. It also follows other drug cartels throughout the years and how they do business. It's about real life events which they execute almost perfectly. Wagner Moura as Pablo Escobar especially is just incredible. He resembles Pablo Escobar as good as any actor has ever tried. Almost half the show is in Spanish but you get used the subtitles and forget about them pretty quickly. Once you start watching this you'll want to binge it as quickly as possible. It's that good!"
    },
    {
      "username": "michaelradny",
      "userUrl": "https://www.imdb.com/user/ur25997566",
      "reviewLink": "https://www.imdb.com/review/rw3306846",
      "warningSpoilers": false,
      "date": "29 August 2015",
      "rate": "10",
      "helpful": "425 out of 473 found this helpful.",
      "title": "Netflix To The Rescue",
      "content": "Incidentally, I saw an ad for Narco on YouTube, and instead of skipping the ads like I normally do, I played this one out because I was genuinely excited for what I was watching. Instantly I jumped onto Netflix and I was not disappointed. This is a truly gripping show, one of the best I've seen this year. The characters and acting are done well and the storyline moves at a fast enough pace to get your adrenalin pumping for the whole episode. My only fear was that it would be too generic of a Crime drama, but those feelings were quickly swept away. This is truly an original and thoroughly planned out TV show with a whole lot of heart. Maybe the best on Netflix at the moment. Narco doesn't disappoint with any aspect of the show. It's exciting and fast paced, but above all, it makes you want to keep coming back for more."
    },
    {
      "username": "charlieedmond",
      "userUrl": "https://www.imdb.com/user/ur61076618",
      "reviewLink": "https://www.imdb.com/review/rw8761386",
      "warningSpoilers": false,
      "date": "27 December 2022",
      "rate": "9",
      "helpful": "29 out of 29 found this helpful.",
      "title": "Season 1 & 2 is crazy GOOD!",
      "content": "Now, with the knowledge that most of the events shown are fictional and some real events altered for dramatic effect, I appreciate what the show set out to do.The antagonist is written in such a way that you feel sympathy for the worst of the worst, an evil cruel monster. Only good writing can do that. I admit though, this wouldn't have been as impactful if not for the phenomenal supporting cast!In terms of Audio, Visuals, Acting, this Series is one of the best.Just remember, that this Series is not a documentary, so if you want facts you should research it yourself, the antagonist's real life counterpart was far, far more evil than depicted.All in all, it's a good watch that shows how sickening mankind can be when Hope is lost. But at the same time, that there will always be those who will stand against Evil."
    },
    {
      "username": "Lukasmj",
      "userUrl": "https://www.imdb.com/user/ur158768880",
      "reviewLink": "https://www.imdb.com/review/rw8671292",
      "warningSpoilers": false,
      "date": "13 November 2022",
      "rate": "10",
      "helpful": "29 out of 30 found this helpful.",
      "title": "An exhausting, but definitely worth watching series.",
      "content": "Narcos is definitely one of my favorite series.The series may not be for many because you have to read subtitles almost non-stop, but Wagner Moura in the role of Pablo Escobar is VERY convincing in my opinion.The series does a very good job of telling Escobar's story from his point of view.Steve Murphy is also very well portrayed and as such serves as the viewer's companion through the series.I stopped watching after the second season, because I didn't saw a sense in watching further at this point, but many people told me that the series went downhill after this point, so I guess I made the right decision here."
    },
    {
      "username": "ahmetkozan",
      "userUrl": "https://www.imdb.com/user/ur48829349",
      "reviewLink": "https://www.imdb.com/review/rw3443679",
      "warningSpoilers": false,
      "date": "1 April 2016",
      "rate": "10",
      "helpful": "176 out of 196 found this helpful.",
      "title": "The Incredible Story of Pablo Escobar",
      "content": "Narcos is an intriguing and entertaining series. Netflix again done a very good job. Season 1 tells the true story of notorious drug kingpin Pablo Escobar, who became a billionaire through the production and distribution of cocaine, while also focusing on Escobar's interactions with drug lords. This is a massive story.Escobar's life has attracted my attention too. I watched many videos and read books about Escobar's life. The show educates you on the Medellin Cartel and it is a very interesting topic to learn about. Pablo Escobar had much more influence on the political system than i would expected. This series has added a lot to me about it. Wagner Moura is an excellent actor and he learned Spanish just for the Pablo Escobar's role. He was born for this role. The bilingual dialogue adds a new layer of authenticity to the project and shows it's commitment with the original story. The long and often complicated story of Pablo Escobar is portrayed simple and effective for viewers not to get lost in what is going on.Congrats to Netflix for such a powerful, incredible production. I would recommend this show to all my friends and anyone looking for a great show to watch. This is one of the best shows I've seen in a while. Can't wait for the next season to come out! 10/10"
    },
    {
      "username": "muhammadshah-57953",
      "userUrl": "https://www.imdb.com/user/ur142883720",
      "reviewLink": "https://www.imdb.com/review/rw8857418",
      "warningSpoilers": false,
      "date": "6 February 2023",
      "rate": "10",
      "helpful": "37 out of 37 found this helpful.",
      "title": "Banger!",
      "content": "Reviewing late but if somehow you see this, I wanna tell you that this is one of best series out there so, watch it if you haven't already. A friend of mine actually recommend me this and I guess it was an amazing recommendation and I didn't regret watching it. The first two seasons of the show are amazing and ghe to third season is not as good as the first too but still it's pretty good and entertaining to watch. 30 episodes of non-stop entertainment. I'll definitely recommend jf you are a fan of crime genre, specially based on true events (coz it makes it better). The whole series is based on narco terrorism in Colombia. The first two seasons are Based on \"Medellin Cartel\" whose boss was Pablo Escobar. The third season is based on \"The Cali Cartel\" run by the Rodriguez brothers. That's why I said that the first two season were dope but the third one was amazing too. So, if you haven't already, go watch it."
    },
    {
      "username": "zalfunk",
      "userUrl": "https://www.imdb.com/user/ur107205020",
      "reviewLink": "https://www.imdb.com/review/rw8378317",
      "warningSpoilers": false,
      "date": "28 July 2022",
      "rate": "10",
      "helpful": "20 out of 21 found this helpful.",
      "title": "an easy 10",
      "content": "Addictive and spellbinding. Easy to binge watch.Needs close attention to extract everything from it.The 'Dukes of Hazzard* DEA boys seem to be a bit goofy but as the story and narration progresses you catch the depth and depravity of the Columbian situation.There is some absuridity in huge doses throughout but politics, foreign intervention and a severly toxic corrupt society lends itself to an incredible story. The few highs and immense lows are staggering."
    },
    {
      "username": "johmil-18374",
      "userUrl": "https://www.imdb.com/user/ur60096640",
      "reviewLink": "https://www.imdb.com/review/rw3307129",
      "warningSpoilers": false,
      "date": "29 August 2015",
      "rate": "8",
      "helpful": "254 out of 298 found this helpful.",
      "title": "Fantastic production, we are living in the golden age of series",
      "content": "This is such a quality production. Its cinema quality in every aspect. I've seen two episodes so far but if this show keep this up I give it an even higher grade. Netflix is now really starting to compete with HBO and this is much better than Netflix anchor House of Cards for example. Now I don't like shows that glorify and make the criminals heroes, but I don't think this series does that. Escobar is a ruthless person but still his a family man in some ways. Whats good with Narcos is that it portrays both side of the law. If it would only show it from Pablos perspective it wouldn't be as interesting. This is a very classy production. Everything from the DEA-detective who is the narrative voice to the quality of the camera work. The actors are spot on and the scenes are amazing. I nearly feel that I'm in the Colombian jungle and the hot humid air touches me through the screen. I just love series nowadays. You can transport you self to nearly every situation of life and follow character for a long time. And they really use the advantages of series if you compare it to film."
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw5557059",
      "warningSpoilers": false,
      "date": "17 March 2020",
      "rate": "9",
      "helpful": "26 out of 30 found this helpful.",
      "title": "A dramatized account of the rise and fall of the Colombian drug cartels",
      "content": "This Netflix series charts the rise and fall of the Colombian drug lords as their power increases as they earn billions of US dollars supplying the United States with cocaine and the actions of the DEA as they try to bring them to justice. The first two seasons are centred on Pablo Escobar and his Medellin cartel and DEA Agents Steve Murphy and Javier Peña while the third sees Peña leading the hunt for the 'Gentlemen of Cali', the cartel which eventually took over from Escobar.The story shown is based on reality but the makers never pretend that it is entirely true... a pre-title card informs us that some characters are entirely fictional. That doesn't stop it feeling real thanks to the way events are depicted. The characters are shown in a matter of fact way leaving it to the viewer to judge them... of course given what we see some of them do it isn't hard to condemn many of them. Even so surprisingly few characters are totally unsympathetic at all times. The cast does a really impressive job bringing their characters to life; most obviously Pedro Pascal as Javier Peña and Wagner Moura as Pablo Escobar. Many people have commented about incorrect accents but I doubt this will be a problem for non-Spanish speakers; it was certainly better than having all characters speaking English. Overall I found the series really gripping; I'll certainly be watching 'Narcos: Mexico' soon."
    },
    {
      "username": "oscarjneklund",
      "userUrl": "https://www.imdb.com/user/ur154260428",
      "reviewLink": "https://www.imdb.com/review/rw8312108",
      "warningSpoilers": false,
      "date": "8 July 2022",
      "rate": "8",
      "helpful": "17 out of 18 found this helpful.",
      "title": "All good cameron! 🌿",
      "content": "A nice biography series about the one and only Escobar. Wagner Moura nailed it, so fricking good. Brutal, bloody and violent Mafia-show, really worth watching! 🇺🇲"
    },
    {
      "username": "rossanova",
      "userUrl": "https://www.imdb.com/user/ur98393487",
      "reviewLink": "https://www.imdb.com/review/rw8651387",
      "warningSpoilers": false,
      "date": "2 November 2022",
      "rate": "10",
      "helpful": "24 out of 25 found this helpful.",
      "title": "So well made.",
      "content": "This series and its follow up, \"Narcos: Mexico\", are so well made and captivating. They've been a binge frenzy for me for the last several weeks.Of course, the stories themselves are fascinating but the writing, acting and photography are all top notch. Everything resonates with authenticity and depth. Storytelling at its pinnacle.Usually, these types of shows drag out the series just to make more episodes. Not here. Every single frame is compelling and there for a reason. There's zero fat in the content. You're constantly being pulled forward into the next scene and its really satisfying.Highly recommended."
    },
    {
      "username": "mm-39",
      "userUrl": "https://www.imdb.com/user/ur0453228",
      "reviewLink": "https://www.imdb.com/review/rw8211532",
      "warningSpoilers": true,
      "date": "6 June 2022",
      "rate": "10",
      "helpful": "15 out of 17 found this helpful.",
      "title": "Best of the 3 installments",
      "content": "The Original Narcos is the best of the three installment. The script/story is compelling, because real life is stranger than fiction. We all know stories are altered for time frames, and entertainment value. Incredibly, the more unbelievable events, like the terror raid on the justice court, and the huge bomb, building Pablos' own prison actually happened. I would think this got to be made up. Sounds like a t v script, but no it was real. The character arch, acting, sets, directing and the ebb and flow of the series was balanced perfectly. The mixing of the D E A (English parts) and Columbia (Spanish parts) are done well. Regrettably one may get tired or their eyes from reading sub titles. One of those binge watching series. 10 stars. One of the better shows, like Mindhunter, to watch on Netflix."
    },
    {
      "username": "nikhilshinde-18451",
      "userUrl": "https://www.imdb.com/user/ur130281281",
      "reviewLink": "https://www.imdb.com/review/rw8853917",
      "warningSpoilers": false,
      "date": "5 February 2023",
      "rate": "10",
      "helpful": "26 out of 26 found this helpful.",
      "title": "We Are Bandits, hijo de puta!",
      "content": "I Know It's Late, But What Should I Say About The Narcos (S1-S2) First Of All The Appreciation For The Wagner Moura He Nailed His Acting And It's Like You're Just Continuously Watching Live Pablo Escobar On Screen, Also His Presence Faded The Presence Of Pedro And Boyd Nailed It As A Pablo Totally. Secondly, I Like The Music And Real Cutscenes Used So It Feels Like Your Definitely At In The Timeline Of Ninety All Credit Goes To Producers Because And Netflix Because All The Location And Action Sequences Are At Great Visualize.And Finally The Soft Corner For Pablo, His Love For His Family and that's emotionalize You I Bet!"
    },
    {
      "username": "edchaz",
      "userUrl": "https://www.imdb.com/user/ur136079659",
      "reviewLink": "https://www.imdb.com/review/rw8880638",
      "warningSpoilers": false,
      "date": "19 February 2023",
      "rate": "9",
      "helpful": "27 out of 28 found this helpful.",
      "title": "Very watchable",
      "content": "It is hard not to get hooked on the series as it comes across very credible - the actors speak Spanish and it does appear to me the filming is in Colombia too?It is also quite unique that a US made film does not have the US star being all wonderful and the hero - well, to a point. This area is still a problem for US films in my view and the 'tough, whiskey drinking and not afraid of anyone' character is rather tiring.Anyhow, at least in this film the non US cast get to become the focus, the story.Like all Netflix productions, it uses 3 seasons of episodes when 1 would be enough but there you go.My only warning about watching is when you see the actress playing Escobar's wife, it becomes impossible not to lose yourself in her absolute and stunning beauty.I could not concentrate once she became a regular."
    },
    {
      "username": "WaliedNasser",
      "userUrl": "https://www.imdb.com/user/ur66052936",
      "reviewLink": "https://www.imdb.com/review/rw8298452",
      "warningSpoilers": false,
      "date": "3 July 2022",
      "rate": "10",
      "helpful": "19 out of 20 found this helpful.",
      "title": "Oh My God!",
      "content": "One of the best series I've ever watched, I just took a deep breath after finishing it. All I can say it's really really incredible. The man who acts Pablo is way more than talented."
    },
    {
      "username": "Tomadour",
      "userUrl": "https://www.imdb.com/user/ur0095073",
      "reviewLink": "https://www.imdb.com/review/rw3307119",
      "warningSpoilers": false,
      "date": "28 August 2015",
      "rate": "10",
      "helpful": "122 out of 152 found this helpful.",
      "title": "Addicted",
      "content": "Having seen all Padilha movies, I was anxious to see this new Netflix series and had great expectations. He did it again. I cannot stop watching. One episode after another. OK if the cast is not Colombian. But they are all good actors and play the parts very well. I will try to finish this weekend all the episodes but i think there will be more seasons. Best series of the year so far. The action is great. The scenarios are perfect. The 1980's atmosphere is awesome. 10 out 0f 10. I hope they will make more series like that in the future. Good real stories and perfect action and direction. I could not expect less from Padilha."
    },
    {
      "username": "winickj-797-80915",
      "userUrl": "https://www.imdb.com/user/ur46775240",
      "reviewLink": "https://www.imdb.com/review/rw3306673",
      "warningSpoilers": false,
      "date": "28 August 2015",
      "rate": "9",
      "helpful": "290 out of 353 found this helpful.",
      "title": "How to do Television right.",
      "content": "Since movies have become nothing but shoot-em-ups and comic books television has emerged as the way to get great drama to adults.Narcos is a tale that everyone knows today, but the storytelling of this series is done with great visuals, interesting casting and a storytelling format which I love.Using the protagonist as the voice over narrator gives this series the feel of Goodfellas or Casino (two of my favourite movies by the way).Its extremely watchable and kept my attention the whole time. The scene with Pablo Escobar on the bridge was stunning.A worthwhile watch, if you have interests in things other than comic books."
    },
    {
      "username": "leftbanker-1",
      "userUrl": "https://www.imdb.com/user/ur20309759",
      "reviewLink": "https://www.imdb.com/review/rw3307091",
      "warningSpoilers": true,
      "date": "29 August 2015",
      "rate": "10",
      "helpful": "76 out of 107 found this helpful.",
      "title": "Netflix Has Yet Another Triumph",
      "content": "At one point in Episode 7 the new president of Colombia says to a group of US officials trying to have him accept more aid to hunt Escobar, \"660 tons of cocaine were consumed in the United States last year. Perhaps if your resources were focused at home we'd all be better off.\"Can I get an Amen? He hits the bullseye. Netflix gives us yet another reason to stay out of the cine multiplex with this slightly fictionalized but excellent new series. It takes most of the pertinent action right out of the history from this sad era of Colombian (and American) history. Filmed entirely on location in Colombia and with a good 50% of the dialogue in Spanish this series aims to be as real as possible. The story also colors way outside the lines of the Manichean version of the Drug War most Americans have swallowed hook, line, and sinker since Uncle Ronnie started feeding it to us back in his presidency.In the role of Pablo Escobar is Wagner Moura who actually had to learn Spanish to play the part. I wish that he would send his Spanish teacher over here to teach me because he speaks it very well. I'm sure native Colombians can tell that he's not one of them but I can't. Besides that he is a dead ringer (pardon the expression) for Pablo.Unflinchingly brutal and set at a desperate pace this is one of the best crime dramas I've seen in a long time. This series reminds me of the two great novels of Don Winslow which chronicle the Mexican cartels, The Power of the Dog and The Cartel. The structure is almost like a documentary in concept with a voice-over by one of the principal DEA agents on the scene. I am only a few episodes into this and already hoping for another season—a very high compliment.This series is vastly superior to the Benicio del Toro Escobar film which was pretty awful. Movies can't hold a candle to the best series. There is no way to tell this story in a 90 minute movie. Great job, Netflix!Season 2Is it just me or was Season 2 almost completely in Spanish? Granted, the Spanish they speak was difficult for me to understand at times but I just wonder how most of the American public feels about seeing a series in which they are almost entirely dependent on reading subtitles. I think Americans are getting more and more sophisticated in their tastes and any series in which Pablo Escobar speaks English would just be phony and stupid. I thought the directors relied too much on music montage scenes that just took up a lot of time without adding much to the story. It just seems like an unoriginal cliché. The show worked best when they followed the real historic events of the story and when they delved into pure fiction it was much less compelling.There was way too much of his wife and kids in the second season. I get it; Pablo was a family guy. That doesn't mean you need to have scene after scene of him playing with his kids or talking to his half-wit wife. Why should we care about the family of a monster who blew up airliners and placed horrifically powerful bombs on crowded city streets? We don't. Los Pepes should have killed them all, including his mother. There were much bigger things in the picture that could have been discussed. I loved the CIA guy and his role in the story. He was creepy as well as totally believable for his part. In the end you have to realize that the United States' effort in Colombia amounted to doodly squat. All we really did was to fan a drug war that took the lives of perhaps thousands of people, either guilty of some infraction or completely innocent. The two DEA agents seemed barely competent to do their jobs, whatever their jobs were. At least they alluded to this in the final scene. \"The king is dead; long live the kings!\"S3 Almost binged it and I have to say this Season 3 is the best of the three by far. It's more layered and has better characters. Seasons 1 & 2 had Pablo and I really like the actor but this I never liked the gringo DEA guy much. This story is more complicated as well. I also think they make good use of their time. I love the fact that it's only 10 episodes and we can expect some sort of resolution (I hope so) at the end.Each episode is skillfully crafted to contain a single story and then leave you practically begging for the next installment. Overall this storyline is a lot more interesting than the two previous season involving Pablo Escobar. Who needs Pablo?The violence is chilling to the core because it is handed out sparingly, at least at first. How many people have died so that Americans can use cocaine? Half a million people? More? A lot more?"
    },
    {
      "username": "xisage",
      "userUrl": "https://www.imdb.com/user/ur160932163",
      "reviewLink": "https://www.imdb.com/review/rw8789473",
      "warningSpoilers": false,
      "date": "9 January 2023",
      "rate": "8",
      "helpful": "24 out of 25 found this helpful.",
      "title": "Sprawling and Satisfying",
      "content": "Fascinating, thrilling and powerful in all aspects. Top notch acting performance by Wagner Moura playing Pablo Escobar. Boyd Holbrook as Steve Murphy is very solid and grows in stature as it unfolds. The highly cinematic Colombia and the busy urban life makes it visually formidable as well.Netflix used to cater to a more highbrow type of audience, it seems long ago now. But this show felt like a close pproximation of the real world in a very entertaining fashion. Another good thing about \"NARCOS\" is the the fast pace it has to keep the audience engaged. Film lovers who like gangster movies will find this new series gripping. Folks looking out for some action paced crime drama should definitely hang on to this one. First episode will grab your attention to the level that you would want to see all ten episodes at once. Finally we got some gangster stuff to look at in classic settings."
    },
    {
      "username": "E161TZ",
      "userUrl": "https://www.imdb.com/user/ur90685861",
      "reviewLink": "https://www.imdb.com/review/rw4989804",
      "warningSpoilers": false,
      "date": "11 July 2019",
      "rate": "10",
      "helpful": "25 out of 30 found this helpful.",
      "title": "Best series I've seen in a very long time!",
      "content": "Loved it from start to finish. I did not care that I spent most of the time reading English subtitles, this entire series left me wanting and wishing I could speak Spanish. It's simply superb! Not once was I bored, I did not want this to finish, I knew nothing about Pablo's life, but man, what a life he lived. You have to see this to believe it!"
    },
    {
      "username": "dblyth-46821",
      "userUrl": "https://www.imdb.com/user/ur101492473",
      "reviewLink": "https://www.imdb.com/review/rw4771762",
      "warningSpoilers": false,
      "date": "9 April 2019",
      "rate": "10",
      "helpful": "52 out of 61 found this helpful.",
      "title": "Best show on TV!!",
      "content": "Binged all 3 seasons and Mexico in 2 weeks. It's so good you just can't stop watching!"
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw4171360",
      "warningSpoilers": false,
      "date": "20 May 2018",
      "rate": "10",
      "helpful": "10 out of 12 found this helpful.",
      "title": "Magnifico!",
      "content": "(Reviewed after Season 3).The history of the Colombian drug cartels, and the US DEA's efforts to bring them to justice. Seasons 1 and 2 focus on the Medellin Cartel and its infamous leader, Pablo Escobar. Season 3 centres on the successor to the Medellin Cartel, the Cali Cartel.Superb. Edifying, enthralling and incredibly engaging - compelling viewing. A good mix of history, drama, action and intrigue. Well-drawn and developed characters - even the bad guys have character depth.Shows well the mountain of a task that faced the DEA in bringing Colombia's cocaine manufacturers to justice, as even the local police and politicians couldn't be trusted.Adding to the authenticity is that about 80% of the dialogue is in Spanish. No Colombians speaking English to each other in a Spanish accent. (There are English sub-titles, of course, should you want them).Brilliant performance by Wagner Moura as Pablo Escobar. He absolutely inhabits the role, making Escobar seem like an average guy, complete with personal mannerisms and traits. Makes for a very engaging and empathetic experience. If it wasn't for the fact that Escobar was a mass-murderer, he might even be likeable... (Interesting fact: Moura is Brazilian and had to learn Spanish for the role. Makes me even more impressed with his performance and work-ethic).The negative aspect to Seasons 1 and 2 was the character of DEA agent Steve Murphy, played by Boyd Holbrook. He did not seem that an important enough character to be the narrator and essentially central figure of Seasons 1 and 2. Moreover, he is a tad irritating and Holbrook's performance involves talking low and slurred, which is how actors talk nowadays when they want to try to win awards, probably because they think people might mistake them for Marlon Brando.Pedro Pascal (who might be familiar to Game of Thrones viewers, as he played Oberyn Martell in Season 4) puts in a solid performance as Agent Javier Pena. His character grows in importance as the series progresses and he really steps up as the progression occurs. In Season 3 he takes over narration and does a much better job than Boyd Holbrook.On that note, I was a bit apprehensive about Season 3. When the Pablo Escobar story ended, I felt that this was a natural end to the series. Everything had been building up to Escobar's demise and by the time it came, I was drained, the build-up of tension was so great. Plus Wagner Moura had made him into such a larger-than-life and engaging character, replacing that character would be difficult.However, the writers do a great job in Season 3 of maintaining the engagement, through showing several characters, good, bad and neutral, and how the events affect them, plus making the plot development incredibly nail-biting.Fantastic series."
    },
    {
      "username": "katysuarez",
      "userUrl": "https://www.imdb.com/user/ur62385704",
      "reviewLink": "https://www.imdb.com/review/rw3307951",
      "warningSpoilers": false,
      "date": "30 August 2015",
      "rate": "10",
      "helpful": "447 out of 485 found this helpful.",
      "title": "Impressive",
      "content": "As a native Colombian, born and raised in Medellin (in 1975) and victim myself of the Pablo Escobar era, I must say that I am pleasantly surprised with the show!!! I thought it was going to be another bad gringo movie about Colombia with lots of mistakes and not even Colombian landscapes in the background but, I WAS WRONG!!!! Very good actors too, I didn't like Escobar accent since it's not real Paisa accent but it's OK; it will go unnoticed to non- native Colombians ;)Good Job Netflix!! Sksjdjdjdufirjfjfifrior difjrirjfjfkririfrjrjrkf. That's all I had to sayCatalina Suárez"
    }
  ],
  "errorMessage": ""
}