{
  "imDbId": "tt2707408",
  "title": "Narcos",
  "fullTitle": "Narcos (TV Series 2015–2017)",
  "type": "TVSeries",
  "year": "2015",
  "language": "en",
  "titleInLanguage": "Narcos",
  "url": "https://en.wikipedia.org/wiki/Narcos",
  "plotShort": {
    "plainText": "Narcos is an American crime drama television series created and produced by Chris Brancato, Carlo Bernard, and Doug Miro. Set and filmed in Colombia, seasons 1 and 2 are based on the story of Colombian narcoterrorist and drug kingpin Pablo Escobar, who is the leader of the Medellin Cartel and became a billionaire through the production and distribution of cocaine. The series also focuses on Escobar's interactions with drug lords, Drug Enforcement Administration (DEA) agents, and various opposition entities. Season 3 picks up after the fall of Escobar and continues to follow the DEA as they try to shut down the rise of the infamous Cali Cartel.\r\nSeason 1, comprising 10 episodes, originally aired on August 28, 2015, as a Netflix exclusive. The series was renewed for a second season, which premiered on September 2, 2016, with 10 episodes. On September 6, 2016, Netflix renewed the series for its third and fourth seasons. Season 3 premiered on September 1, 2017, but on July 18, 2018, the directors announced that season 4 would instead reset as season 1 of a new Netflix original series, titled Narcos: Mexico. The new series, released on November 16, 2018, is set in Mexico in the 1980s.",
    "html": "<p>Narcos is an American crime drama television series created and produced by Chris Brancato, Carlo Bernard, and Doug Miro. Set and filmed in Colombia, seasons 1 and 2 are based on the story of Colombian narcoterrorist and drug kingpin Pablo Escobar, who is the leader of the Medellin Cartel and became a billionaire through the production and distribution of cocaine. The series also focuses on Escobar's interactions with drug lords, Drug Enforcement Administration (DEA) agents, and various opposition entities. Season 3 picks up after the fall of Escobar and continues to follow the DEA as they try to shut down the rise of the infamous Cali Cartel.</p><p>Season 1, comprising 10 episodes, originally aired on August 28, 2015, as a Netflix exclusive. The series was renewed for a second season, which premiered on September 2, 2016, with 10 episodes. On September 6, 2016, Netflix renewed the series for its third and fourth seasons. Season 3 premiered on September 1, 2017, but on July 18, 2018, the directors announced that season 4 would instead reset as season 1 of a new Netflix original series, titled Narcos: Mexico. The new series, released on November 16, 2018, is set in Mexico in the 1980s.</p>"
  },
  "plotFull": {
    "plainText": "Narcos is an American crime drama television series created and produced by Chris Brancato, Carlo Bernard, and Doug Miro. Set and filmed in Colombia, seasons 1 and 2 are based on the story of Colombian narcoterrorist and drug kingpin Pablo Escobar, who is the leader of the Medellin Cartel and became a billionaire through the production and distribution of cocaine. The series also focuses on Escobar's interactions with drug lords, Drug Enforcement Administration (DEA) agents, and various opposition entities. Season 3 picks up after the fall of Escobar and continues to follow the DEA as they try to shut down the rise of the infamous Cali Cartel.\r\nSeason 1, comprising 10 episodes, originally aired on August 28, 2015, as a Netflix exclusive. The series was renewed for a second season, which premiered on September 2, 2016, with 10 episodes. On September 6, 2016, Netflix renewed the series for its third and fourth seasons. Season 3 premiered on September 1, 2017, but on July 18, 2018, the directors announced that season 4 would instead reset as season 1 of a new Netflix original series, titled Narcos: Mexico. The new series, released on November 16, 2018, is set in Mexico in the 1980s.\r\nPlot\r\nSeason 1\r\nSeason 1 chronicles the life of Pablo Escobar from the late 1970s, when he first began manufacturing cocaine, to July 1992. The show is told from the perspective of Steve Murphy, an American DEA agent working in Colombia. The series depicts how Escobar first became involved in the cocaine trade in Colombia. He was an established black marketeer in Medellín, moving trucks of illegal goods (alcohol, cigarettes, and household appliances) into Colombia during a time when this was strictly forbidden, when he was introduced to Mateo \"Cockroach\" Moreno, a Chilean exile and underground chemist, who pitched the idea that they go into business together, with Moreno producing and Escobar distributing a new, profitable drug—cocaine.\r\nThey expand beyond Moreno's small cocaine processing lab by building additional, larger labs in the rainforest and, using the expertise of Carlos Lehder, transport their product in bulk to Miami, where it gains notoriety amongst the rich and famous. Soon enough, Pablo develops larger labs and more extensive distribution routes into the United States to supply growing demand. With cocaine's growth into a drug of importance in the American market, one that accounts for a large flow of U.S. dollars to Colombia and escalating drug-related violence in the United States, the Americans send a task force from the DEA to Colombia to address the issue. Murphy is partnered with Javier Peña. The purpose of Murphy's task force is to work with the Colombian authorities, led by Colonel Carrillo, to put an end to the flow of cocaine into the United States. The season ends with Escobar's escape from the prison.\r\nSeason 2\r\nSeason 2 continues where season 1 ended. Soldiers see Escobar and his entourage right outside the perimeter of 'La Catedral' prison but are too petrified of Escobar to make an arrest. At the embassy, the United States sends a new ambassador who brings the CIA into play. In the beginning, little change occurs for Escobar, as he still has the loyalty of his cartel. This loyalty, however, starts to slip as Escobar needs more time and resources to hide from the government. Among the tricks he uses to avoid being seen are riding around town in the trunk of a taxi cab and using young lookouts to report police movements to him.\r\nInitially, Escobar easily adapts to his new life, giving money to the community while ruthlessly killing those who try to break away from his empire. The Colombian police and Escobar engage in massive battles, resulting in high tension and unrest in Colombia. Escobar's rivals in the Cali cartel form an unlikely alliance with ousted members of his own cartel, as well as with a CIA-backed anticommunist paramilitary group. Agent Peña secretly works with this group, who kill members of Pablo's organization and claim responsibility as \"Los Pepes\".\r\nAfter two of Escobar's top cartel members are caught and betray him, Escobar goes on the run. He and his bodyguard hide in a safehouse, where he celebrates his 44th birthday. When Pablo tries to make contact with his family, the DEA and military track him down via radio triangulation and corner him on the rooftops. Pablo is hit twice in the ensuing shootout, and although he might have survived his injuries, a Colombian policeman named Trujillo executes him, amidst shouts of \"Viva Colombia!\"\r\nEscobar's wife Tata goes to the Cali cartel for their help in leaving the country. Peña returns to the United States, in expectation of being reprimanded by the disciplinary committee for his associations with Los Pepes, but is surprised when asked to provide intelligence against the Cali cartel, implying his future involvement with the DEA.\r\nSeason 3\r\nSeason 3 was released on September 1, 2017. The story continues after Pablo Escobar's death and shows the DEA's fight against the Cali cartel. With Escobar out of the way, business for the cartel is booming, with new markets in the United States and elsewhere. To everyone's surprise, Gilberto Rodríguez Orejuela, the leader of the Cali cartel, announces that within 6 months, the cartel will leave the cocaine business entirely to focus on legal business interests. The decision is met with mixed reactions within the cartel.\r\nEpisodes\r\nSeason 1 (2015)\r\nSeason 2 (2016)\r\nSeason 3 (2017)\r\nCast and characters\r\nMain\r\nWagner Moura as Pablo Escobar – a Colombian drug lord and the leader of the Medellín Cartel (seasons 1–2)\r\nBoyd Holbrook as Steve Murphy – a DEA agent tasked with bringing down Escobar (seasons 1–2)\r\nPedro Pascal as Javier Peña – a DEA agent given the task of bringing down Escobar and, in season 3, the Cali Cartel (seasons 1–3)\r\nJoanna Christie as Connie Murphy – Steve's wife, a nurse who works in the local hospital (seasons 1–2)\r\nMaurice Compte as Colonel Horacio Carrillo – a Colombian police chief and commander of Search Bloc (season 1; recurring season 2)\r\nAndré Mattos as Jorge Ochoa – founding member and former leader of the Medellín cartel (season 1)\r\nRoberto Urbina as Fabio Ochoa – a high-ranking member of the Medellín cartel (season 1)\r\nDiego Cataño as Juan Diego \"La Quica\" Díaz – an assassin routinely hired by the Medellín, based on Dandeny Muñoz Mosquera (season 1; recurring season 2)\r\nJorge A. Jimenez as Roberto \"Poison\" Ramos – a hitman hired by the Medellín cartel, based on John Jairo Arias Tascón (season 1; guest season 2)\r\nPaulina Gaitán as Tata Escobar – Escobar's wife, full name Maria Victoria Henao (seasons 1–2)\r\nPaulina García as Hermilda Gaviria – Escobar's mother, a former Colombian schoolteacher (seasons 1–2)\r\nStephanie Sigman as Valeria Vélez – a Colombian journalist who also serves as Pablo Escobar's mistress, based on Virginia Vallejo (season 1; recurring season 2)\r\nBruno Bichir as Fernando Duque – a Colombian lawyer who represents Pablo Escobar, acting as his liaison with the Colombian government (seasons 1–2)\r\nRaúl Méndez as César Gaviria – a Colombian economist and politician and the 28th President of Colombia (seasons 1–2)\r\nManolo Cardona as Eduardo Sandoval – the Vice Minister of Justice in President Gaviria's administration, based on Eduardo Mendoza (seasons 1–2)\r\nCristina Umaña as Judy Moncada – a former leader in the Medellín cartel, who, after Escobar murdered her husband, led a concurrenting cartel; she is based on the real-life Dolly Moncada (season 2; guest season 1)\r\nEric Lange as Bill Stechner – the CIA station chief in Colombia, based on William Wagner (seasons 2–3)\r\nFlorencia Lozano as Claudia Messina - DEA agent and Murphy and Peña's supervisor (season 2)\r\nDamián Alcázar as Gilberto Rodríguez Orejuela – the leader of the Cali cartel and one of Pablo Escobar's primary rivals (seasons 2–3)\r\nAlberto Ammann as Hélmer \"Pacho\" Herrera – a Colombian drug lord and high-ranking member of the Cali cartel (seasons 2–3, recurring season 1)\r\nFrancisco Denis as Miguel Rodríguez Orejuela – a high-ranking member of the Cali cartel and Gilberto's younger brother (seasons 2–3)\r\nPêpê Rapazote as José \"Chepe\" Santacruz Londoño – a high-ranking member of the Cali cartel who oversees the group's operations in New York City (season 3)\r\nMatias Varela as Jorge Salcedo Cabrera – the Cali cartel's head of security (season 3)\r\nJavier Cámara as Guillermo Pallomari – the chief accountant of the Cali cartel (season 3)\r\nArturo Castro as David Rodríguez – Miguel's son (season 3)\r\nAndrea Londo as María Salazar – wife of a Colombian drug lord affiliated with the North Valley cartel (season 3)\r\nKerry Bishé as Christina Jurado – the American wife of a banker affiliated with the Cali cartel (season 3)\r\nMichael Stahl-David as Chris Feistl – DEA agent working under Peña (season 3)\r\nMatt Whelan as Daniel Van Ness – DEA agent partnered with Feistl (season 3)\r\nJosé María Yazpik as Amado Carrillo Fuentes - a Mexican drug trafficker allied with Pacho and the Cali cartel, known as \"The Lord of the Skies\" (season 3)\r\nRecurring\r\nLuis Guzmán as Gonzalo Rodríguez Gacha – founding member and former leader of the Medellín cartel (season 1)\r\nJuan Pablo Raba as Gustavo Gaviria – Escobar's cousin and one of the founding members of the Medellin Cartel (seasons 1–2)\r\nJuan Riedinger as Carlos Lehder – Lion's contact in the United States, give the task of distributing the cocaine (season 1)\r\nRichard T. Jones – a CIA officer, also on Murphy's task force (recurring season 1; guest season 2)\r\nJon-Michael Ecker as El León or \"The Lion\" – a childhood friend of Escobar's who becomes his first drug smuggler into Miami and subsequently runs Escobar's Miami operations, based on George Jung (guest seasons 1–2)\r\nAna de la Reguera as Elisa Álvarez – the co-leader of the M-19 guerrilla faction (season 1)\r\nDanielle Kennedy as Ambassador Noonan – a United States ambassador deployed to Colombia under Ronald Reagan (season 1)\r\nPatrick St. Esprit as Colonel Lou Wysession – a Marine officer fighting against communism (recurring season 1; guest season 2)\r\nGabriela de la Garza as Diana Turbay – a Colombian journalist who was kidnapped by the Medellín cartel (season 1).\r\nAriel Sierra as Sureshot – one of Escobar's sicarios (recurring season 1; guest season 2)\r\nJulián Díaz as Nelson (\"El Negrito\" or \"Blackie\") Hernández – a member of the Medellín cartel, who is frequently seen by Escobar's side (in real life, Escobar had a close friend named Jorge \"El Negro\" Pabón) (seasons 1–2)\r\nCarolina Gaitán as Marta Ochoa – the Ochoas' sister, who is kidnapped by M-19 (season 1)\r\nJulián Beltrán as Alberto Suárez – an officer with the Colombian National Police (season 1).\r\nThaddeus Phillips as Agent Owen – a CIA agent on the Colombia task force (recurring season 1; guest season 2)\r\nLaura Perico as Marina Ochoa – the Ochoas' sister, who has an affair with Escobar's cousin Gustavo (season 1)\r\nVera Mercado as Ana Gaviria – the wife of César Gaviria and the First Lady of Colombia (recurring season 1; guest season 2)\r\nJuan Sebastián Calero as Navegante – a violent associate of the Cali cartel who works as their top henchman (seasons 1–3)\r\nLeynar Gómez as Jhon \"Limón\" Burgos – a pimp and taxi driver from Medellín who becomes one of Escobar's sicarios, based on Alvaro de Jesús \"El Limón\" Agudelo (season 2)\r\nMartina García as Maritza – an old friend of Limón's roped into unwittingly helping Escobar (season 2)\r\nBrett Cullen as Ambassador Arthur Crosby – a former Navy officer sent as US Ambassador to Colombia by George H. W. Bush in 1992, replacing Noonan (seasons 2–3)\r\nKonstantin Melikhov as Edward Jacoby - A U.S. intelligence officer involved with Centra Spike (season 2)\r\nGermán Jaramillo as Gustavo de Greiff, Colombia's attorney general and vehement critic of President Gaviria's drug policy (season 2)\r\nMauricio Cujar as Diego \"Don Berna\" Murillo Bejarano (recurring season 2; guest season 3)\r\nMauricio Mejía as Carlos Castaño Gil (recurring season 2; guest season 3)\r\nGustavo Angarita Jr. as Fidel Castaño (recurring season 2; guest season 3)\r\nJuan Pablo Shuk as Colonel Hugo Martínez – Carrillo's successor as the commander of Search Bloc (seasons 2–3)\r\nRaymond Ablack as Agent Neil Stoddard (season 3)\r\nMiguel Ángel Silvestre as Franklin Jurado (season 3)\r\nCarlos Camacho as Claudio Salazar (season 3)\r\nTaliana Vargas as Paola Salcedo (season 3)\r\nAndrés Crespo as Carlos Córdova (season 3)\r\nJulian Arango as Orlando Henao Montoya - a high-ranking member of the North Valley cartel (season 3)\r\nGaston Velandia as Rosso José Serrano – General of the Colombian National Police (season 3)\r\nNotable guests\r\nLuis Gnecco as Cucaracha or \"Cockroach\" (né Mateo Moreno) – the Chilean chemist who first introduced Escobar to cocaine trafficking (season 1).\r\nA.J. Buckley as Kevin Brady – a DEA agent and the partner of Steve Murphy (season 1).\r\nAdria Arjona as Helena Sotomayor – a top-class prostitute from Bogotá, a spy for the Drug Enforcement Administration and the Search Bloc (season 1).\r\nRafael Cebrián as Alejandro Ayala – one of the leaders of M-19 in Colombia and the boyfriend of Elisa Álvarez, the co-leader of the group (season 1).\r\nAdan Canto as Rodrigo Lara Bonilla – a Colombian lawyer and politician (season 1).\r\nDylan Bruno as Barry Seal – an American drug smuggler working for the Medellín cartel who uses the alias \"McPickle\" (season 1).\r\nJuan Pablo Espinosa as Luis Carlos Galán – a Colombian journalist and politician (season 1).\r\nAlfredo Castro as Abel Escobar, Pablo's father (season 2)\r\nTristán Ulloa as Ernesto Samper – Colombian president (season 3).\r\nGabriel Iglesias as Dominican gangster (season 3).\r\nProduction\r\nThe series was announced in April 2014, through a partnership deal struck between Netflix and Gaumont International Television. The first season, consisting of 10 episodes, was estimated to cost about $25 million. The series was primarily written by Chris Brancato and directed by Brazilian filmmaker José Padilha, who also directed the critically and commercially successful Elite Squad (2007) and its sequel in 2010, which became the highest-grossing film ever in Brazil. On September 15, 2017, one of the show's location scouts, Carlos Muñoz Portal, was reported as having been found murdered with multiple gunshot wounds, in his car on a dirt road in central Mexico, near the town of Temascalapa. A spokesman for the attorney general in Mexico state said there were no witnesses due to the remote location, and the authorities will continue to investigate. The possibility of narco gangs' being involved is being considered.\r\nOpening theme and title sequence\r\nNarcos opens with a title card, from which the narrator reads: \"Magical realism is defined as what happens when a highly detailed, realistic setting is invaded by something too strange to believe. There is a reason magical realism was born in Colombia\".\r\nNarcos' opening theme, \"Tuyo\", is a bolero written and composed for the show by Brazilian singer-songwriter Rodrigo Amarante.\r\nThe theme scores the visual montage comprising the title sequence, created by DK Studios under artistic director Tom O’Neill. The 1980s-themed images address Colombian drug trafficking in general, the United States’ attempt to control it, the era's glamour, footage from the mountainous regions of Bogota and surrounding underprivileged neighborhoods, shots of local residents, archival news coverage, and violence. The montage excludes some people who were unwilling to appear in the credits, but it does include some news clips and images \"of Pablo Escobar and his entourage, like those at the zoo, came directly from the drug baron’s personal photographer, who goes by the name El Chino.\" According to O'Neill, \"the production team took inspiration from James Mollison’s photo book The Memory of Pablo Escobar.\"\r\nEtymology\r\nNarcotics is a late Middle English word derived from Old French narcotique, in turn derived via medieval Latin from the Greek narkōtikos, from narkoun (\"make numb\" or \"produce stupor\").\r\nIn Spanish, the term narco (or its plural, narcos) is an abbreviation of the word narcotraficante (drug trafficker). In the United States, the epithet \"narc\" (or \"narco\") refers to a specialist officer of a narcotics police force, such as a DEA agent.\r\nReception\r\nCritical response\r\nSeason 1\r\nThe first season received generally favorable reviews from critics. Rotten Tomatoes, a review aggregator, surveyed 45 reviews and judged 79% to be positive. The site reads, \"Narcos lacks sympathetic characters, but pulls in the viewer with solid acting and a story that's fast-paced enough to distract from its familiar outline.\" On Metacritic, season one holds a weighted average score of 77 out of 100, based on 19 critics, indicating \"generally favorable reviews\".\r\nIGN gave the first season a 7.8 out of 10 score, saying: \"It's a true-to-life account, sometimes to a fault, of the rise of Pablo Escobar and the hunt that brought him down laced with stellar performances and tension-filled stand-offs. Its blend of archival footage reminds us that the horrors depicted really happened, but also manage to present an Escobar that is indefensible but frighteningly sympathetic.\" Writing for The Philadelphia Inquirer, Tirdad Derakhshani reviewed the season positively, calling it, \"Intense, enlightening, brilliant, unnerving, and addictive, Narcos is high-concept drama at its finest.\" Television critic Tim Goodman of The Hollywood Reporter also reviewed the series positively, saying, \"The series begins to find its pacing not long after, and we see the strength of Moura’s acting, which to his credit never races, in the early going, toward over-the-top menace or the drug-lord cliches we're all used to at this point. Credit also the fact that Padilha brings a documentary feel to Narcos.\" Nancy deWolf Smith of The Wall Street Journal wrote, \"The omniscient-narrator device works very well for a complex story spanning many years and varied sets of players.\" Critic Neil Genzlinger of The New York Times said, \"It’s built on sharp writing and equally sharp acting, as any good series needs to be.\" However, chief television critic Mary McNamara of Los Angeles Times wrote, \"It's a grand if inconsistent experiment that, from the moment it opens with a definition of magic realism, wears its considerable ambitions on its sleeve.\" Writing for IndieWire, Liz Shannon Miller said, \"An unlikeable character, no matter the circumstances, remains unlikeable, but an unlikeable character trumps a bland blonde man whose position of authority appears to be his only really interesting character trait, no matter how much voice-over he utters.\"\r\nThe show received criticism for the quality of the spoken Spanish. Dr. Alister Ramírez-Márquez, a member of the North American Academy of the Spanish Language, faulted the accents, pronunciation, intonation, and incorrect use of Paisa colloquialisms. Speaking of the show's reception in Colombia, Sibylla Brodzinsky of The Guardian stated, \"audiences have been bemused by the stars’ ropey accents, irritated by its portrayal of the country's recent history, and – in some cases – simply bored by yet another narco-drama.\" The Brazilian accent of Wagner Moura was particularly criticized for being incongruent with Escobar's Paisa background. Gisela Orozco of the Chicago Tribune said the show would not engross Latinos due to the mishmash of accents and contrasted Narcos with Pablo Escobar: El Patrón del Mal. In his review of the show, Colombian TV critic Omar Rincón wrote in El Tiempo, \"Narcos is the Miami and US vision of NarColombia – something like Trump’s idea of us: the good guys are the gringos ... and the narcos are comically dysfunctional or primitives with bad taste ... Narcos may do well outside Colombia, but here it produces anger and laughter.\"\r\nSeason 2\r\nThe second season generated better reviews compared with those for the previous season. Rotten Tomatoes gives the second season an approval rating of 92% based on 22 reviews, with an average rating of 7.6/10. The site's critical consensus reads, \"Narcos' sophomore season manages to elevate the stakes to a gut-wrenching degree in what continues to be a magnificent account of Pablo Escobar's life.\" On Metacritic, season two holds a score of 76 out of 100, based on 13 critics, indicating \"generally favorable reviews\".\r\nIGN gave the second season a score of 7.4 out of 10, calling it \"Good\" and wrote \"It may go overboard with its love of Pablo Escobar, but I can't truly fault the show for taking advantage of its best performer and character – or for scrambling to find an emotional core on a show that can feel rather clinical.\" Joshua Alston of The A.V. Club lauded Moura's performance and said, \"While the show never soft-pedals the havoc Escobar created, it makes him surprisingly sympathetic, thanks in part to Moura's shrewd, affecting performance.\" Critic Neil Genzlinger of The New York Times said, \"Mr. Moura is inscrutably brilliant at the center of it all.\" Entertainment Weekly's Jeff Jensen also reviewed the series positively, saying, \"Where season 1 spanned 10 years, season 2 captures Escobar's last days on the loose. Each tightly packed episode moves quickly without sacrificing richness, chronicling the uneasy alliances and gross tactics employed to snare Escobar.\" Tim Goodman of The Hollywood Reporter said, \"What works in the early going of season two is that the fall is almost always more thrilling, if not engaging, than the buildup. Escobar senses the loss of power and Moura does some of his best work as viewers read the worry and interior thinking on his face.\"\r\nSeason 3\r\nOn Rotten Tomatoes, the third season holds an approval rating of 96% based on 22 reviews, with an average rating of 7.46/10. The site's critical consensus reads, \"Narcos continues to evolve in its third season, drawing on historical details to take viewers on a thoroughly gripping – and unsettlingly timely – journey into darkness.\" On Metacritic, season 3 holds a weighted average score of 78 out of 100, based on 9 critics, indicating \"generally favorable reviews\".\r\nIGN gave the third season a score of 8.0 out of 10, calling it \"a flawed-but-thrilling improvement over its first two seasons\". Critics praised the show for its ability to still be engaging after moving on from the Pablo Escobar storyline. Liz Shannon Miller of IndieWire said, \"Outside of the overhanging threat of Escobar, 'Narcos' proves its ability to excel as an ongoing drama by not just introducing new members of these syndicates, but giving them real, fleshed-out lives beyond basic confrontations.\" Writing for The Telegraph, Ed Power called the show \"A sweltering thrill ride you’ll want to stay with all the way until the end.\" Critics praised Pedro Pascal's performance of DEA agent Javier Peña, who became the main protagonist after the departure of Boyd Holbrook, who played Steve Murphy. Kevin Yeoman of ScreenRant wrote, \"The charismatic actor is finally offered a chance to lead the semi-anthological series.\" Writing for Collider, Chris Cabin said, \"Pascal carries the series admirably, expanding the scope of his character through Peña’s relationship with his father.\" Despite the positive reviews, some critics said the show got off to a slow start in the first few episodes. Critic Scott Tobias of The New York Times wrote, \"Setting aside the 'Goodfellas' narration, the earliest episodes of 'Narcos' were distinguished by a meat-and-potatoes approach to the crime genre that rebuffed the slickness that usually comes with the territory.\" Some critics acknowledged the expository flaws while praising the last sequence of episodes. Daniel Fienberg of The Hollywood Reporter wrote, \"After a slow start to its third season, Netflix's cartel drama proves that it's able to be gripping TV even without Wagner Moura's Pablo Escobar.\" Writing for Entertainment Weekly, James Hibberd said, \"The narrative picks up its pace as the season progresses into a final run of episodes that feature the most suspenseful sequences Narcos has ever had.\"\r\nAccolades\r\nSpin-off series\r\nNarcos: Mexico was released on November 16, 2018. The story goes back to the 1980s, in Mexico, where it sets a shared world with the previous seasons of Narcos (which focus on Colombia), bringing back characters like Amado Carrillo (José María Yazpik) and Pablo Escobar (Wagner Moura), for small roles, and introducing new ones like the famous DEA Agent Kiki Camarena (Michael Peña), the drug kingpin Joaquín \"El Chapo\" Guzmán (Alejandro Edda), and Miguel Felix-Gallardo (Diego Luna), creator of the first Mexican drug cartel, depicting the clash between them and the eve of the catastrophic Mexican war on drugs.",
    "html": "<p>Narcos is an American crime drama television series created and produced by Chris Brancato, Carlo Bernard, and Doug Miro. Set and filmed in Colombia, seasons 1 and 2 are based on the story of Colombian narcoterrorist and drug kingpin Pablo Escobar, who is the leader of the Medellin Cartel and became a billionaire through the production and distribution of cocaine. The series also focuses on Escobar's interactions with drug lords, Drug Enforcement Administration (DEA) agents, and various opposition entities. Season 3 picks up after the fall of Escobar and continues to follow the DEA as they try to shut down the rise of the infamous Cali Cartel.</p><p>Season 1, comprising 10 episodes, originally aired on August 28, 2015, as a Netflix exclusive. The series was renewed for a second season, which premiered on September 2, 2016, with 10 episodes. On September 6, 2016, Netflix renewed the series for its third and fourth seasons. Season 3 premiered on September 1, 2017, but on July 18, 2018, the directors announced that season 4 would instead reset as season 1 of a new Netflix original series, titled Narcos: Mexico. The new series, released on November 16, 2018, is set in Mexico in the 1980s.</p><br/><h3>Plot</h3><h4>Season 1</h4><p>Season 1 chronicles the life of Pablo Escobar from the late 1970s, when he first began manufacturing cocaine, to July 1992. The show is told from the perspective of Steve Murphy, an American DEA agent working in Colombia. The series depicts how Escobar first became involved in the cocaine trade in Colombia. He was an established black marketeer in Medellín, moving trucks of illegal goods (alcohol, cigarettes, and household appliances) into Colombia during a time when this was strictly forbidden, when he was introduced to Mateo \"Cockroach\" Moreno, a Chilean exile and underground chemist, who pitched the idea that they go into business together, with Moreno producing and Escobar distributing a new, profitable drug—cocaine.</p><p>They expand beyond Moreno's small cocaine processing lab by building additional, larger labs in the rainforest and, using the expertise of Carlos Lehder, transport their product in bulk to Miami, where it gains notoriety amongst the rich and famous. Soon enough, Pablo develops larger labs and more extensive distribution routes into the United States to supply growing demand. With cocaine's growth into a drug of importance in the American market, one that accounts for a large flow of U.S. dollars to Colombia and escalating drug-related violence in the United States, the Americans send a task force from the DEA to Colombia to address the issue. Murphy is partnered with Javier Peña. The purpose of Murphy's task force is to work with the Colombian authorities, led by Colonel Carrillo, to put an end to the flow of cocaine into the United States. The season ends with Escobar's escape from the prison.</p><h4>Season 2</h4><p>Season 2 continues where season 1 ended. Soldiers see Escobar and his entourage right outside the perimeter of 'La Catedral' prison but are too petrified of Escobar to make an arrest. At the embassy, the United States sends a new ambassador who brings the CIA into play. In the beginning, little change occurs for Escobar, as he still has the loyalty of his cartel. This loyalty, however, starts to slip as Escobar needs more time and resources to hide from the government. Among the tricks he uses to avoid being seen are riding around town in the trunk of a taxi cab and using young lookouts to report police movements to him.</p><p>Initially, Escobar easily adapts to his new life, giving money to the community while ruthlessly killing those who try to break away from his empire. The Colombian police and Escobar engage in massive battles, resulting in high tension and unrest in Colombia. Escobar's rivals in the Cali cartel form an unlikely alliance with ousted members of his own cartel, as well as with a CIA-backed anticommunist paramilitary group. Agent Peña secretly works with this group, who kill members of Pablo's organization and claim responsibility as \"Los Pepes\".</p><p>After two of Escobar's top cartel members are caught and betray him, Escobar goes on the run. He and his bodyguard hide in a safehouse, where he celebrates his 44th birthday. When Pablo tries to make contact with his family, the DEA and military track him down via radio triangulation and corner him on the rooftops. Pablo is hit twice in the ensuing shootout, and although he might have survived his injuries, a Colombian policeman named Trujillo executes him, amidst shouts of \"Viva Colombia!\"</p><p>Escobar's wife Tata goes to the Cali cartel for their help in leaving the country. Peña returns to the United States, in expectation of being reprimanded by the disciplinary committee for his associations with Los Pepes, but is surprised when asked to provide intelligence against the Cali cartel, implying his future involvement with the DEA.</p><h4>Season 3</h4><p>Season 3 was released on September 1, 2017. The story continues after Pablo Escobar's death and shows the DEA's fight against the Cali cartel. With Escobar out of the way, business for the cartel is booming, with new markets in the United States and elsewhere. To everyone's surprise, Gilberto Rodríguez Orejuela, the leader of the Cali cartel, announces that within 6 months, the cartel will leave the cocaine business entirely to focus on legal business interests. The decision is met with mixed reactions within the cartel.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"1\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"1\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally released</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">August 28, 2015</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">September 2, 2016</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">September 1, 2017</td></tr></tbody></table><h4>Season 1 (2015)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#861622;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#861622;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#861622;width:24%\">Title</th><th scope=\"col\" style=\"background:#861622;width:13%\">Directed by</th><th scope=\"col\" style=\"background:#861622;width:37%\">Written by</th><th scope=\"col\" style=\"background:#861622;width:16%\">Original release date</th></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Descenso\"</td><td style=\"text-align:center\"><span>José Padilha</span></td><td style=\"text-align:center\"><span>Chris Brancato</span> and Carlo Bernard &amp; <span>Doug Miro</span></td><td style=\"text-align:center\">August 28, 2015</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Sword of Simón Bolívar\"</td><td style=\"text-align:center\">José Padilha</td><td style=\"text-align:center\">Chris Brancato</td><td style=\"text-align:center\">August 28, 2015</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Men of Always\"</td><td style=\"text-align:center\"><span>Guillermo Navarro</span></td><td style=\"text-align:center\">Dana Calvo</td><td style=\"text-align:center\">August 28, 2015</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Palace in Flames\"</td><td style=\"text-align:center\">Guillermo Navarro</td><td style=\"text-align:center\">Chris Brancato</td><td style=\"text-align:center\">August 28, 2015</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"There Will Be a Future\"</td><td style=\"text-align:center\"><span class=\"mw-redirect\">Andi Baiz</span></td><td style=\"text-align:center\">Dana Ledoux Miller</td><td style=\"text-align:center\">August 28, 2015</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Explosivos\"</td><td style=\"text-align:center\">Andi Baiz</td><td style=\"text-align:center\">Andy Black</td><td style=\"text-align:center\">August 28, 2015</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"You Will Cry Tears of Blood\"</td><td style=\"text-align:center\"><span>Fernando Coimbra</span></td><td style=\"text-align:center\">Dana Calvo &amp; Zach Calig</td><td style=\"text-align:center\">August 28, 2015</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"La Gran Mentira\"</td><td style=\"text-align:center\">Fernando Coimbra</td><td style=\"text-align:center\">Allison Abner</td><td style=\"text-align:center\">August 28, 2015</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"La Catedral\"</td><td style=\"text-align:center\">Andi Baiz</td><td style=\"text-align:center\"><span>Nick Schenk</span> &amp; Chris Brancato</td><td style=\"text-align:center\">August 28, 2015</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Despegue\"</td><td style=\"text-align:center\">Andi Baiz</td><td style=\"text-align:center\">Nick Schenk &amp; Chris Brancato</td><td style=\"text-align:center\">August 28, 2015</td></tr></tbody></table><h4>Season 2 (2016)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#181513;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#181513;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#181513;width:24%\">Title</th><th scope=\"col\" style=\"background:#181513;width:13%\">Directed by</th><th scope=\"col\" style=\"background:#181513;width:37%\">Written by</th><th scope=\"col\" style=\"background:#181513;width:16%\">Original release date</th></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep11\" style=\"text-align:center\">11</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Free at Last\"</td><td style=\"text-align:center\">Gerardo Naranjo</td><td style=\"text-align:center\"><span>Adam Fierro</span></td><td style=\"text-align:center\">September 2, 2016</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep12\" style=\"text-align:center\">12</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Cambalache\"</td><td style=\"text-align:center\">Gerardo Naranjo</td><td style=\"text-align:center\">Zachary Reiter</td><td style=\"text-align:center\">September 2, 2016</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep13\" style=\"text-align:center\">13</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Our Man in Madrid\"</td><td style=\"text-align:center\"><span>Andrés Baiz</span></td><td style=\"text-align:center\">Zachary Reiter and <span>Steve Lightfoot</span></td><td style=\"text-align:center\">September 2, 2016</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep14\" style=\"text-align:center\">14</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Good, the Bad, and the Dead\"</td><td style=\"text-align:center\">Andrés Baiz</td><td style=\"text-align:center\"><i>Teleplay by</i> : Zachary Reiter and Carlo Bernard &amp; <span>Doug Miro</span><br><i>Story by</i> : T.J. Brady &amp; Rasheed Newson and Steve Lightfoot</td><td style=\"text-align:center\">September 2, 2016</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep15\" style=\"text-align:center\">15</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Enemies of My Enemy\"</td><td style=\"text-align:center\">Josef Wladyka</td><td style=\"text-align:center\"><i>Teleplay by</i> : T.J. Brady &amp; Rasheed Newson and Carlo Bernard &amp; Doug Miro<br><i>Story by</i> : T.J. Brady &amp; Rasheed Newson</td><td style=\"text-align:center\">September 2, 2016</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep16\" style=\"text-align:center\">16</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Los Pepes\"</td><td style=\"text-align:center\">Josef Wladyka</td><td style=\"text-align:center\">Julie Siege</td><td style=\"text-align:center\">September 2, 2016</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep17\" style=\"text-align:center\">17</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Deutschland 93\"</td><td style=\"text-align:center\">Josef Wladyka</td><td style=\"text-align:center\">Carlo Bernand and Doug Miro</td><td style=\"text-align:center\">September 2, 2016</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep18\" style=\"text-align:center\">18</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Exit El Patrón\"</td><td style=\"text-align:center\">Gerardo Naranjo</td><td style=\"text-align:center\"><i>Teleplay by</i> : <span>Gideon Yago</span> &amp; Curtis Gwinn<br><i>Story by</i> : Gideon Yago</td><td style=\"text-align:center\">September 2, 2016</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep19\" style=\"text-align:center\">19</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Nuestra Finca\"</td><td style=\"text-align:center\">Andrés Baiz</td><td style=\"text-align:center\">Julie Siege &amp; Clayton Trussell</td><td style=\"text-align:center\">September 2, 2016</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep20\" style=\"text-align:center\">20</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Al Fin Cayó!\"</td><td style=\"text-align:center\">Andrés Baiz</td><td style=\"text-align:center\">Carlo Bernard &amp; Doug Miro</td><td style=\"text-align:center\">September 2, 2016</td></tr></tbody></table><h4>Season 3 (2017)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#465B61;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#465B61;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#465B61;width:24%\">Title</th><th scope=\"col\" style=\"background:#465B61;width:13%\">Directed by</th><th scope=\"col\" style=\"background:#465B61;width:37%\">Written by</th><th scope=\"col\" style=\"background:#465B61;width:16%\">Original release date</th></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep21\" style=\"text-align:center\">21</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Kingpin Strategy\"</td><td style=\"text-align:center\"><span>Andi Baiz</span></td><td style=\"text-align:center\">Carlo Bernard &amp; <span>Doug Miro</span> &amp; <span>Eric Newman</span></td><td style=\"text-align:center\">September 1, 2017</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep22\" style=\"text-align:center\">22</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Cali KGB\"</td><td style=\"text-align:center\">Andi Baiz</td><td style=\"text-align:center\">Carlo Bernard &amp; Doug Miro &amp; Eric Newman</td><td style=\"text-align:center\">September 1, 2017</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep23\" style=\"text-align:center\">23</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Follow the Money\"</td><td style=\"text-align:center\"><span>Gabriel Ripstein</span></td><td style=\"text-align:center\">David Matthews</td><td style=\"text-align:center\">September 1, 2017</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep24\" style=\"text-align:center\">24</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Checkmate\"</td><td style=\"text-align:center\">Gabriel Ripstein</td><td style=\"text-align:center\">Andy Black</td><td style=\"text-align:center\">September 1, 2017</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep25\" style=\"text-align:center\">25</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"MRO\"</td><td style=\"text-align:center\">Josef Wladyka</td><td style=\"text-align:center\"><span class=\"mw-redirect\">Ashley Lyle</span> &amp; Bart Nickerson</td><td style=\"text-align:center\">September 1, 2017</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep26\" style=\"text-align:center\">26</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Best Laid Plans\"</td><td style=\"text-align:center\">Josef Wladyka</td><td style=\"text-align:center\">Jason George</td><td style=\"text-align:center\">September 1, 2017</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep27\" style=\"text-align:center\">27</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Sin Salida\"</td><td style=\"text-align:center\"><span>Fernando Coimbra</span></td><td style=\"text-align:center\">Santa Sierra &amp; Clayton Trussell</td><td style=\"text-align:center\">September 1, 2017</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep28\" style=\"text-align:center\">28</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Convivir\"</td><td style=\"text-align:center\">Fernando Coimbra</td><td style=\"text-align:center\">Andy Black</td><td style=\"text-align:center\">September 1, 2017</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep29\" style=\"text-align:center\">29</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Todos Los Hombres del Presidente\"</td><td style=\"text-align:center\">Andi Baiz</td><td style=\"text-align:center\">Jason George &amp; Carlo Bernard &amp; Doug Miro</td><td style=\"text-align:center\">September 1, 2017</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep30\" style=\"text-align:center\">30</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Going Back to Cali\"</td><td style=\"text-align:center\">Andi Baiz</td><td style=\"text-align:center\">Carlo Bernard &amp; Doug Miro</td><td style=\"text-align:center\">September 1, 2017</td></tr></tbody></table><br/><h3>Cast and characters</h3><h4>Main</h4><ul><li>Wagner Moura as Pablo Escobar – a Colombian drug lord and the leader of the Medellín Cartel (seasons 1–2)</li><li>Boyd Holbrook as Steve Murphy – a DEA agent tasked with bringing down Escobar (seasons 1–2)</li><li>Pedro Pascal as Javier Peña – a DEA agent given the task of bringing down Escobar and, in season 3, the Cali Cartel (seasons 1–3)</li><li>Joanna Christie as Connie Murphy – Steve's wife, a nurse who works in the local hospital (seasons 1–2)</li><li>Maurice Compte as Colonel Horacio Carrillo – a Colombian police chief and commander of Search Bloc (season 1; recurring season 2)</li><li>André Mattos as Jorge Ochoa – founding member and former leader of the Medellín cartel (season 1)</li><li>Roberto Urbina as Fabio Ochoa – a high-ranking member of the Medellín cartel (season 1)</li><li>Diego Cataño as Juan Diego \"La Quica\" Díaz – an assassin routinely hired by the Medellín, based on Dandeny Muñoz Mosquera (season 1; recurring season 2)</li><li>Jorge A. Jimenez as Roberto \"Poison\" Ramos – a hitman hired by the Medellín cartel, based on John Jairo Arias Tascón (season 1; guest season 2)</li><li>Paulina Gaitán as Tata Escobar – Escobar's wife, full name Maria Victoria Henao (seasons 1–2)</li><li>Paulina García as Hermilda Gaviria – Escobar's mother, a former Colombian schoolteacher (seasons 1–2)</li><li>Stephanie Sigman as Valeria Vélez – a Colombian journalist who also serves as Pablo Escobar's mistress, based on Virginia Vallejo (season 1; recurring season 2)</li><li>Bruno Bichir as Fernando Duque – a Colombian lawyer who represents Pablo Escobar, acting as his liaison with the Colombian government (seasons 1–2)</li><li>Raúl Méndez as César Gaviria – a Colombian economist and politician and the 28th President of Colombia (seasons 1–2)</li><li>Manolo Cardona as Eduardo Sandoval – the Vice Minister of Justice in President Gaviria's administration, based on Eduardo Mendoza (seasons 1–2)</li><li>Cristina Umaña as Judy Moncada – a former leader in the Medellín cartel, who, after Escobar murdered her husband, led a concurrenting cartel; she is based on the real-life Dolly Moncada (season 2; guest season 1)</li><li>Eric Lange as Bill Stechner – the CIA station chief in Colombia, based on William Wagner (seasons 2–3)</li><li>Florencia Lozano as Claudia Messina - DEA agent and Murphy and Peña's supervisor (season 2)</li><li>Damián Alcázar as Gilberto Rodríguez Orejuela – the leader of the Cali cartel and one of Pablo Escobar's primary rivals (seasons 2–3)</li><li>Alberto Ammann as Hélmer \"Pacho\" Herrera – a Colombian drug lord and high-ranking member of the Cali cartel (seasons 2–3, recurring season 1)</li><li>Francisco Denis as Miguel Rodríguez Orejuela – a high-ranking member of the Cali cartel and Gilberto's younger brother (seasons 2–3)</li><li>Pêpê Rapazote as José \"Chepe\" Santacruz Londoño – a high-ranking member of the Cali cartel who oversees the group's operations in New York City (season 3)</li><li>Matias Varela as Jorge Salcedo Cabrera – the Cali cartel's head of security (season 3)</li><li>Javier Cámara as Guillermo Pallomari – the chief accountant of the Cali cartel (season 3)</li><li>Arturo Castro as David Rodríguez – Miguel's son (season 3)</li><li>Andrea Londo as María Salazar – wife of a Colombian drug lord affiliated with the North Valley cartel (season 3)</li><li>Kerry Bishé as Christina Jurado – the American wife of a banker affiliated with the Cali cartel (season 3)</li><li>Michael Stahl-David as Chris Feistl – DEA agent working under Peña (season 3)</li><li>Matt Whelan as Daniel Van Ness – DEA agent partnered with Feistl (season 3)</li><li>José María Yazpik as Amado Carrillo Fuentes - a Mexican drug trafficker allied with Pacho and the Cali cartel, known as \"The Lord of the Skies\" (season 3)</li></ul><h4>Recurring</h4><ul><li>Luis Guzmán as Gonzalo Rodríguez Gacha – founding member and former leader of the Medellín cartel (season 1)</li><li>Juan Pablo Raba as Gustavo Gaviria – Escobar's cousin and one of the founding members of the Medellin Cartel (seasons 1–2)</li><li>Juan Riedinger as Carlos Lehder – Lion's contact in the United States, give the task of distributing the cocaine (season 1)</li><li>Richard T. Jones – a CIA officer, also on Murphy's task force (recurring season 1; guest season 2)</li><li>Jon-Michael Ecker as El León or \"The Lion\" – a childhood friend of Escobar's who becomes his first drug smuggler into Miami and subsequently runs Escobar's Miami operations, based on George Jung (guest seasons 1–2)</li><li>Ana de la Reguera as Elisa Álvarez – the co-leader of the M-19 guerrilla faction (season 1)</li><li>Danielle Kennedy as Ambassador Noonan – a United States ambassador deployed to Colombia under Ronald Reagan (season 1)</li><li>Patrick St. Esprit as Colonel Lou Wysession – a Marine officer fighting against communism (recurring season 1; guest season 2)</li><li>Gabriela de la Garza as Diana Turbay – a Colombian journalist who was kidnapped by the Medellín cartel (season 1).</li><li>Ariel Sierra as Sureshot – one of Escobar's sicarios (recurring season 1; guest season 2)</li><li>Julián Díaz as Nelson (\"El Negrito\" or \"Blackie\") Hernández – a member of the Medellín cartel, who is frequently seen by Escobar's side (in real life, Escobar had a close friend named Jorge \"El Negro\" Pabón) (seasons 1–2)</li><li>Carolina Gaitán as Marta Ochoa – the Ochoas' sister, who is kidnapped by M-19 (season 1)</li><li>Julián Beltrán as Alberto Suárez – an officer with the Colombian National Police (season 1).</li><li>Thaddeus Phillips as Agent Owen – a CIA agent on the Colombia task force (recurring season 1; guest season 2)</li><li>Laura Perico as Marina Ochoa – the Ochoas' sister, who has an affair with Escobar's cousin Gustavo (season 1)</li><li>Vera Mercado as Ana Gaviria – the wife of César Gaviria and the First Lady of Colombia (recurring season 1; guest season 2)</li><li>Juan Sebastián Calero as Navegante – a violent associate of the Cali cartel who works as their top henchman (seasons 1–3)</li><li>Leynar Gómez as Jhon \"Limón\" Burgos – a pimp and taxi driver from Medellín who becomes one of Escobar's sicarios, based on Alvaro de Jesús \"El Limón\" Agudelo (season 2)</li><li>Martina García as Maritza – an old friend of Limón's roped into unwittingly helping Escobar (season 2)</li><li>Brett Cullen as Ambassador Arthur Crosby – a former Navy officer sent as US Ambassador to Colombia by George H. W. Bush in 1992, replacing Noonan (seasons 2–3)</li><li>Konstantin Melikhov as Edward Jacoby - A U.S. intelligence officer involved with Centra Spike (season 2)</li><li>Germán Jaramillo as Gustavo de Greiff, Colombia's attorney general and vehement critic of President Gaviria's drug policy (season 2)</li><li>Mauricio Cujar as Diego \"Don Berna\" Murillo Bejarano (recurring season 2; guest season 3)</li><li>Mauricio Mejía as Carlos Castaño Gil (recurring season 2; guest season 3)</li><li>Gustavo Angarita Jr. as Fidel Castaño (recurring season 2; guest season 3)</li><li>Juan Pablo Shuk as Colonel Hugo Martínez – Carrillo's successor as the commander of Search Bloc (seasons 2–3)</li><li>Raymond Ablack as Agent Neil Stoddard (season 3)</li><li>Miguel Ángel Silvestre as Franklin Jurado (season 3)</li><li>Carlos Camacho as Claudio Salazar (season 3)</li><li>Taliana Vargas as Paola Salcedo (season 3)</li><li>Andrés Crespo as Carlos Córdova (season 3)</li><li>Julian Arango as Orlando Henao Montoya - a high-ranking member of the North Valley cartel (season 3)</li><li>Gaston Velandia as Rosso José Serrano – General of the Colombian National Police (season 3)</li></ul><h4>Notable guests</h4><ul><li>Luis Gnecco as Cucaracha or \"Cockroach\" (né Mateo Moreno) – the Chilean chemist who first introduced Escobar to cocaine trafficking (season 1).</li><li>A.J. Buckley as Kevin Brady – a DEA agent and the partner of Steve Murphy (season 1).</li><li>Adria Arjona as Helena Sotomayor – a top-class prostitute from Bogotá, a spy for the Drug Enforcement Administration and the Search Bloc (season 1).</li><li>Rafael Cebrián as Alejandro Ayala – one of the leaders of M-19 in Colombia and the boyfriend of Elisa Álvarez, the co-leader of the group (season 1).</li><li>Adan Canto as Rodrigo Lara Bonilla – a Colombian lawyer and politician (season 1).</li><li>Dylan Bruno as Barry Seal – an American drug smuggler working for the Medellín cartel who uses the alias \"McPickle\" (season 1).</li><li>Juan Pablo Espinosa as Luis Carlos Galán – a Colombian journalist and politician (season 1).</li><li>Alfredo Castro as Abel Escobar, Pablo's father (season 2)</li><li>Tristán Ulloa as Ernesto Samper – Colombian president (season 3).</li><li>Gabriel Iglesias as Dominican gangster (season 3).</li></ul><br/><h3>Production</h3><p>The series was announced in April 2014, through a partnership deal struck between Netflix and Gaumont International Television. The first season, consisting of 10 episodes, was estimated to cost about $25 million. The series was primarily written by Chris Brancato and directed by Brazilian filmmaker José Padilha, who also directed the critically and commercially successful Elite Squad (2007) and its sequel in 2010, which became the highest-grossing film ever in Brazil. On September 15, 2017, one of the show's location scouts, Carlos Muñoz Portal, was reported as having been found murdered with multiple gunshot wounds, in his car on a dirt road in central Mexico, near the town of Temascalapa. A spokesman for the attorney general in Mexico state said there were no witnesses due to the remote location, and the authorities will continue to investigate. The possibility of narco gangs' being involved is being considered.</p><h4>Opening theme and title sequence</h4><p>Narcos opens with a title card, from which the narrator reads: \"Magical realism is defined as what happens when a highly detailed, realistic setting is invaded by something too strange to believe. There is a reason magical realism was born in Colombia\".</p><p>Narcos' opening theme, \"Tuyo\", is a bolero written and composed for the show by Brazilian singer-songwriter Rodrigo Amarante.</p><p>The theme scores the visual montage comprising the title sequence, created by DK Studios under artistic director Tom O’Neill. The 1980s-themed images address Colombian drug trafficking in general, the United States’ attempt to control it, the era's glamour, footage from the mountainous regions of Bogota and surrounding underprivileged neighborhoods, shots of local residents, archival news coverage, and violence. The montage excludes some people who were unwilling to appear in the credits, but it does include some news clips and images \"of Pablo Escobar and his entourage, like those at the zoo, came directly from the drug baron’s personal photographer, who goes by the name El Chino.\" According to O'Neill, \"the production team took inspiration from James Mollison’s photo book The Memory of Pablo Escobar.\"</p><h4>Etymology</h4><p>Narcotics is a late Middle English word derived from Old French narcotique, in turn derived via medieval Latin from the Greek narkōtikos, from narkoun (\"make numb\" or \"produce stupor\").</p><p>In Spanish, the term narco (or its plural, narcos) is an abbreviation of the word narcotraficante (drug trafficker). In the United States, the epithet \"narc\" (or \"narco\") refers to a specialist officer of a narcotics police force, such as a DEA agent.</p><br/><h3>Reception</h3><h4>Critical response</h4><h4>Season 1</h4><p>The first season received generally favorable reviews from critics. Rotten Tomatoes, a review aggregator, surveyed 45 reviews and judged 79% to be positive. The site reads, \"Narcos lacks sympathetic characters, but pulls in the viewer with solid acting and a story that's fast-paced enough to distract from its familiar outline.\" On Metacritic, season one holds a weighted average score of 77 out of 100, based on 19 critics, indicating \"generally favorable reviews\".</p><p>IGN gave the first season a 7.8 out of 10 score, saying: \"It's a true-to-life account, sometimes to a fault, of the rise of Pablo Escobar and the hunt that brought him down laced with stellar performances and tension-filled stand-offs. Its blend of archival footage reminds us that the horrors depicted really happened, but also manage to present an Escobar that is indefensible but frighteningly sympathetic.\" Writing for The Philadelphia Inquirer, Tirdad Derakhshani reviewed the season positively, calling it, \"Intense, enlightening, brilliant, unnerving, and addictive, Narcos is high-concept drama at its finest.\" Television critic Tim Goodman of The Hollywood Reporter also reviewed the series positively, saying, \"The series begins to find its pacing not long after, and we see the strength of Moura’s acting, which to his credit never races, in the early going, toward over-the-top menace or the drug-lord cliches we're all used to at this point. Credit also the fact that Padilha brings a documentary feel to Narcos.\" Nancy deWolf Smith of The Wall Street Journal wrote, \"The omniscient-narrator device works very well for a complex story spanning many years and varied sets of players.\" Critic Neil Genzlinger of The New York Times said, \"It’s built on sharp writing and equally sharp acting, as any good series needs to be.\" However, chief television critic Mary McNamara of Los Angeles Times wrote, \"It's a grand if inconsistent experiment that, from the moment it opens with a definition of magic realism, wears its considerable ambitions on its sleeve.\" Writing for IndieWire, Liz Shannon Miller said, \"An unlikeable character, no matter the circumstances, remains unlikeable, but an unlikeable character trumps a bland blonde man whose position of authority appears to be his only really interesting character trait, no matter how much voice-over he utters.\"</p><p>The show received criticism for the quality of the spoken Spanish. Dr. Alister Ramírez-Márquez, a member of the North American Academy of the Spanish Language, faulted the accents, pronunciation, intonation, and incorrect use of Paisa colloquialisms. Speaking of the show's reception in Colombia, Sibylla Brodzinsky of The Guardian stated, \"audiences have been bemused by the stars’ ropey accents, irritated by its portrayal of the country's recent history, and – in some cases – simply bored by yet another narco-drama.\" The Brazilian accent of Wagner Moura was particularly criticized for being incongruent with Escobar's Paisa background. Gisela Orozco of the Chicago Tribune said the show would not engross Latinos due to the mishmash of accents and contrasted Narcos with Pablo Escobar: El Patrón del Mal. In his review of the show, Colombian TV critic Omar Rincón wrote in El Tiempo, \"Narcos is the Miami and US vision of NarColombia – something like Trump’s idea of us: the good guys are the gringos ... and the narcos are comically dysfunctional or primitives with bad taste ... Narcos may do well outside Colombia, but here it produces anger and laughter.\"</p><h4>Season 2</h4><p>The second season generated better reviews compared with those for the previous season. Rotten Tomatoes gives the second season an approval rating of 92% based on 22 reviews, with an average rating of 7.6/10. The site's critical consensus reads, \"Narcos' sophomore season manages to elevate the stakes to a gut-wrenching degree in what continues to be a magnificent account of Pablo Escobar's life.\" On Metacritic, season two holds a score of 76 out of 100, based on 13 critics, indicating \"generally favorable reviews\".</p><p>IGN gave the second season a score of 7.4 out of 10, calling it \"Good\" and wrote \"It may go overboard with its love of Pablo Escobar, but I can't truly fault the show for taking advantage of its best performer and character – or for scrambling to find an emotional core on a show that can feel rather clinical.\" Joshua Alston of The A.V. Club lauded Moura's performance and said, \"While the show never soft-pedals the havoc Escobar created, it makes him surprisingly sympathetic, thanks in part to Moura's shrewd, affecting performance.\" Critic Neil Genzlinger of The New York Times said, \"Mr. Moura is inscrutably brilliant at the center of it all.\" Entertainment Weekly's Jeff Jensen also reviewed the series positively, saying, \"Where season 1 spanned 10 years, season 2 captures Escobar's last days on the loose. Each tightly packed episode moves quickly without sacrificing richness, chronicling the uneasy alliances and gross tactics employed to snare Escobar.\" Tim Goodman of The Hollywood Reporter said, \"What works in the early going of season two is that the fall is almost always more thrilling, if not engaging, than the buildup. Escobar senses the loss of power and Moura does some of his best work as viewers read the worry and interior thinking on his face.\"</p><h4>Season 3</h4><p>On Rotten Tomatoes, the third season holds an approval rating of 96% based on 22 reviews, with an average rating of 7.46/10. The site's critical consensus reads, \"Narcos continues to evolve in its third season, drawing on historical details to take viewers on a thoroughly gripping – and unsettlingly timely – journey into darkness.\" On Metacritic, season 3 holds a weighted average score of 78 out of 100, based on 9 critics, indicating \"generally favorable reviews\".</p><p>IGN gave the third season a score of 8.0 out of 10, calling it \"a flawed-but-thrilling improvement over its first two seasons\". Critics praised the show for its ability to still be engaging after moving on from the Pablo Escobar storyline. Liz Shannon Miller of IndieWire said, \"Outside of the overhanging threat of Escobar, 'Narcos' proves its ability to excel as an ongoing drama by not just introducing new members of these syndicates, but giving them real, fleshed-out lives beyond basic confrontations.\" Writing for The Telegraph, Ed Power called the show \"A sweltering thrill ride you’ll want to stay with all the way until the end.\" Critics praised Pedro Pascal's performance of DEA agent Javier Peña, who became the main protagonist after the departure of Boyd Holbrook, who played Steve Murphy. Kevin Yeoman of ScreenRant wrote, \"The charismatic actor is finally offered a chance to lead the semi-anthological series.\" Writing for Collider, Chris Cabin said, \"Pascal carries the series admirably, expanding the scope of his character through Peña’s relationship with his father.\" Despite the positive reviews, some critics said the show got off to a slow start in the first few episodes. Critic Scott Tobias of The New York Times wrote, \"Setting aside the 'Goodfellas' narration, the earliest episodes of 'Narcos' were distinguished by a meat-and-potatoes approach to the crime genre that rebuffed the slickness that usually comes with the territory.\" Some critics acknowledged the expository flaws while praising the last sequence of episodes. Daniel Fienberg of The Hollywood Reporter wrote, \"After a slow start to its third season, Netflix's cartel drama proves that it's able to be gripping TV even without Wagner Moura's Pablo Escobar.\" Writing for Entertainment Weekly, James Hibberd said, \"The narrative picks up its pace as the season progresses into a final run of episodes that feature the most suspenseful sequences Narcos has ever had.\"</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\" style=\"width:2%;\">Year</th><th scope=\"col\" style=\"width:20%;\">Award</th><th scope=\"col\" style=\"width:35%;\">Category</th><th scope=\"col\" style=\"width:20%;\">Nominee(s)</th><th scope=\"col\" style=\"width:8%;\">Result</th><th scope=\"col\" class=\"unsortable\" style=\"width:4%;\"><abbr title=\"References\">Ref.</abbr></th></tr><tr><td>2015</td><td><span>Hollywood Music in Media Awards</span></td><td>Original Score – TV Show/Digital Series</td><td>Pedro Bromfman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td rowspan=\"14\">2016</td><td rowspan=\"2\"><span>Golden Globe Awards</span></td><td><span>Best Television Series – Drama</span></td><td><i>Narcos</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td><span>Best Actor – Television Series Drama</span></td><td><span>Wagner Moura</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Writers Guild of America Awards</span></td><td><span>Best Episodic Drama</span></td><td>Andy Black <small>(Episode: \"Explosivos\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td><span>Satellite Awards</span></td><td><span>Best Drama Series</span></td><td><i>Narcos</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td><span>Guild of Music Supervisors Awards</span></td><td>Best Music Supervision in a Television Drama</td><td>Liza Richardson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td><span>Golden Trailer Awards</span></td><td>Best Trailer/Teaser for a TV Series/Mini-Series</td><td>Netflix, Transit <small>(Trailer: \"Lines\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td><span>British Academy Television Awards</span></td><td><span>British Academy Television Award for Best International Programme</span></td><td><style data-mw-deduplicate=\"TemplateStyles:r1129693374\">.mw-parser-output .hlist dl,.mw-parser-output .hlist ol,.mw-parser-output .hlist ul{margin:0;padding:0}.mw-parser-output .hlist dd,.mw-parser-output .hlist dt,.mw-parser-output .hlist li{margin:0;display:inline}.mw-parser-output .hlist.inline,.mw-parser-output .hlist.inline dl,.mw-parser-output .hlist.inline ol,.mw-parser-output .hlist.inline ul,.mw-parser-output .hlist dl dl,.mw-parser-output .hlist dl ol,.mw-parser-output .hlist dl ul,.mw-parser-output .hlist ol dl,.mw-parser-output .hlist ol ol,.mw-parser-output .hlist ol ul,.mw-parser-output .hlist ul dl,.mw-parser-output .hlist ul ol,.mw-parser-output .hlist ul ul{display:inline}.mw-parser-output .hlist .mw-empty-li{display:none}.mw-parser-output .hlist dt::after{content:\": \"}.mw-parser-output .hlist dd::after,.mw-parser-output .hlist li::after{content:\" · \";font-weight:bold}.mw-parser-output .hlist dd:last-child::after,.mw-parser-output .hlist dt:last-child::after,.mw-parser-output .hlist li:last-child::after{content:none}.mw-parser-output .hlist dd dd:first-child::before,.mw-parser-output .hlist dd dt:first-child::before,.mw-parser-output .hlist dd li:first-child::before,.mw-parser-output .hlist dt dd:first-child::before,.mw-parser-output .hlist dt dt:first-child::before,.mw-parser-output .hlist dt li:first-child::before,.mw-parser-output .hlist li dd:first-child::before,.mw-parser-output .hlist li dt:first-child::before,.mw-parser-output .hlist li li:first-child::before{content:\" (\";font-weight:normal}.mw-parser-output .hlist dd dd:last-child::after,.mw-parser-output .hlist dd dt:last-child::after,.mw-parser-output .hlist dd li:last-child::after,.mw-parser-output .hlist dt dd:last-child::after,.mw-parser-output .hlist dt dt:last-child::after,.mw-parser-output .hlist dt li:last-child::after,.mw-parser-output .hlist li dd:last-child::after,.mw-parser-output .hlist li dt:last-child::after,.mw-parser-output .hlist li li:last-child::after{content:\")\";font-weight:normal}.mw-parser-output .hlist ol{counter-reset:listitem}.mw-parser-output .hlist ol>li{counter-increment:listitem}.mw-parser-output .hlist ol>li::before{content:\" \"counter(listitem)\"\\a0 \"}.mw-parser-output .hlist dd ol>li:first-child::before,.mw-parser-output .hlist dt ol>li:first-child::before,.mw-parser-output .hlist li ol>li:first-child::before{content:\" (\"counter(listitem)\"\\a0 \"}</style><div class=\"collapsible-list mw-collapsible mw-collapsed\" style=\"text-align: left;\"><div style=\"line-height: 1.6em; font-weight: bold;\"><div>Producers</div></div><ul class=\"mw-collapsible-content hlist\" style=\"margin-top: 0; margin-bottom: 0; line-height: inherit; list-style: none; margin-left: 0;\"><li style=\"line-height: inherit; margin: 0\"><span>José Padilha</span><br><span>Eric Newman</span><br> <span>Chris Brancato</span></li></ul></div></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Imagen Foundation Awards</span></td><td>Best Actor – Television</td><td>Wagner Moura</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td>Best Actor – Television</td><td><span>Pedro Pascal</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Main Title Design</span></td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"collapsible-list mw-collapsible mw-collapsed\" style=\"text-align: left;\"><div style=\"line-height: 1.6em; font-weight: bold;\"><div>Designers</div></div><ul class=\"mw-collapsible-content hlist\" style=\"margin-top: 0; margin-bottom: 0; line-height: inherit; list-style: none; margin-left: 0;\"><li style=\"line-height: inherit; margin: 0\">Tom O'Neill <br>Nik Kleverov<br> David Badounts <br>Josh Smith</li></ul></div></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\"><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td><span class=\"mw-redirect\">Outstanding Original Main Title Theme Music</span></td><td><span>Rodrigo Amarante</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Single Camera Picture Editing for a Drama Series</span></td><td>Leo Trombetta <small>(Episode: \"Descenso\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Hollywood Music in Media Awards</span></td><td>Best Main Title – TV Show/Digital Streaming Series</td><td>Rodrigo Amarante</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td><span class=\"mw-redirect\">Artios Awards</span></td><td>Outstanding Achievement in Casting Television Pilot – Drama</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"collapsible-list mw-collapsible mw-collapsed\" style=\"text-align: left;\"><div style=\"line-height: 1.6em; font-weight: bold;\"><div>Casting directors</div></div><ul class=\"mw-collapsible-content hlist\" style=\"margin-top: 0; margin-bottom: 0; line-height: inherit; list-style: none; margin-left: 0;\"><li style=\"line-height: inherit; margin: 0\">Carmen Cuba <br>Carla Hool <br>Wittney Horton</li></ul></div></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td rowspan=\"3\">2017</td><td><span>43rd People's Choice Awards</span></td><td>Favorite Premium Drama Series</td><td><i>Narcos</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td><span>Golden Trailer Awards</span></td><td>Best Action (TV Spot / Trailer /Teaser for a Series)</td><td>Netflix, Transit <small>(Trailer: \"Lines\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr><tr><td><span>Golden Reel Awards</span></td><td>TV Short Form – FX/Foley</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"collapsible-list mw-collapsible mw-collapsed\" style=\"text-align: left;\"><div style=\"line-height: 1.6em; font-weight: bold;\"><div>Sound editors</div></div><ul class=\"mw-collapsible-content hlist\" style=\"margin-top: 0; margin-bottom: 0; line-height: inherit; list-style: none; margin-left: 0;\"><li style=\"line-height: inherit; margin: 0\">Randle Akerson<br> Steve Hammond<br> Dino R.DiMuro</li></ul></div></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\"></div></td></tr></tbody></table><br/><h3>Spin-off series</h3><p>Narcos: Mexico was released on November 16, 2018. The story goes back to the 1980s, in Mexico, where it sets a shared world with the previous seasons of Narcos (which focus on Colombia), bringing back characters like Amado Carrillo (José María Yazpik) and Pablo Escobar (Wagner Moura), for small roles, and introducing new ones like the famous DEA Agent Kiki Camarena (Michael Peña), the drug kingpin Joaquín \"El Chapo\" Guzmán (Alejandro Edda), and Miguel Felix-Gallardo (Diego Luna), creator of the first Mexican drug cartel, depicting the clash between them and the eve of the catastrophic Mexican war on drugs.</p><br/>"
  },
  "errorMessage": ""
}