{
  "imDbId": "tt7221388",
  "title": "Cobra Kai",
  "fullTitle": "Cobra Kai (TV Series 2018–2023)",
  "type": "TVSeries",
  "year": "2018",
  "items": [
    {
      "username": "AGood",
      "userUrl": "https://www.imdb.com/user/ur1723318",
      "reviewLink": "https://www.imdb.com/review/rw4152898",
      "warningSpoilers": false,
      "date": "3 May 2018",
      "rate": "10",
      "helpful": "771 out of 856 found this helpful.",
      "title": "William Zabka steals the show!",
      "content": "I have just this moment finished episode 10. I am literally on a massive high right now. This is probably the best TV series I have seen since I first watched Game of Thrones. This is TV at its most epic best.The thing that makes this TV show is William Zabka. Why he has only been in Karate Kid and nothing much more is a mystery as this guy can act and has amazing screen presence and comedy timing.This TV show was so good it literally makes me want to go out tomorrow and sign up for karate classes and learn Cobra Kai style.I strongly recommend everyone watches this as this is way better than that stupid remake with Will Smiths son, better than all the sequels and to be honest better than the first Karate Kid movie too.William Zabka needs to be cast in other TV roles too. He is up there with the best for TV/movie Anti-hero's; Snake Plissken, Tyler Durdan and now after this Johnny Lawrence."
    },
    {
      "username": "user-322-326156",
      "userUrl": "https://www.imdb.com/user/ur32533894",
      "reviewLink": "https://www.imdb.com/review/rw4151991",
      "warningSpoilers": false,
      "date": "3 May 2018",
      "rate": "10",
      "helpful": "860 out of 934 found this helpful.",
      "title": "Very smartly written & acted - highly recommended",
      "content": "I was a teen in the 80's and enjoyed watching this film - as most guys my age did. I was a little skeptical when I saw that they were making a new series that takes place 30 years after the movie ended. But once I saw the trailers - I felt like they might be on to something. After watching several episodes - I can tell you that they nailed it. This is the best show out there - anywhere. It's not over acted (or under acted). It's not corny or stupid either. It's the perfect match up of seriousness with a few goofs or references from the 80's thrown in here & there. This revival could have been a disaster but it looks like they got the perfect combo of writers, directors & actors. It's funny, because as a kid - I wanted to punch Johnny in the throat as hard as I could. But as a 40-something year old - I'm kinda rooting for him. Great job to the people responsible for making this happen - and of course it couldn't have happened without Ralph & William. Thank you!"
    },
    {
      "username": "Calicodreamin",
      "userUrl": "https://www.imdb.com/user/ur29385135",
      "reviewLink": "https://www.imdb.com/review/rw6506243",
      "warningSpoilers": false,
      "date": "20 January 2021",
      "rate": "8",
      "helpful": "106 out of 120 found this helpful.",
      "title": "Cobra Kai never dies",
      "content": "This show is the perfect mix of nostalgia, great 80s music, and badass karate. William Zabka makes this show as Johnny Lawrence, he is everything. Storylines are interesting, action scenes are well coordinated, and everyone and their brother comes back from the movies. It's lovely."
    },
    {
      "username": "AlbertV79",
      "userUrl": "https://www.imdb.com/user/ur0118472",
      "reviewLink": "https://www.imdb.com/review/rw4152726",
      "warningSpoilers": true,
      "date": "3 May 2018",
      "rate": "10",
      "helpful": "275 out of 308 found this helpful.",
      "title": "A Fantastic Sequel in the Form of Series",
      "content": "The skepticism of the announcement of this sequel to the Karate Kid saga is truly gone. It is clear there is a bit of a role reversal as we now see mainly through the eyes of Karate Kid bad boy Johnny Lawrence, who seeks redemption by taking in a student in the form of Miguel Diaz, which in turns inspires him to re-open the Cobra Kai dojo. As for Daniel LaRusso, it i clear that while he is a successful businessman, he is practically consumed with arrogance and does whatever he can to ensure Johnny doesn't succeed.It is interesting to see the major changes in students Miguel from bullied to the arrogant fighter with Robby going from juvenile delinquent to a fighter with honor. Their backstories truly come into play in the series as well as finally learning more Johnny and his upbringing.Like the original film, it is more than martial arts...it's about relationships and redemption. If you liked the Karate Kid saga, then no doubt, you must see this series ASAP!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8574402",
      "warningSpoilers": false,
      "date": "28 September 2022",
      "rate": "8",
      "helpful": "39 out of 42 found this helpful.",
      "title": "Much better than it has any business being!",
      "content": "I can't believe how much I enjoy Cobra Kai. I originally thought this was going to be some corny kid show. It's not, any fan of the original trilogy will love this. It takes place 34 years after the events of the first movie and the 1984 All Valley Karate Tournament. It follows a down on his luck Johnny Lawrence (William Zavala) as he tries to get his life straightened out and opens up the famous Cobra Kai dojo. This reignites his rivalry with the successful Daniel LaRusso (Ralph Macchio). I can't say enough about how good Zabka is here. He's absolutely the breakout star here! It's a shame he hasn't become a bigger star over the years because he shows he can carry a show here. Again, if you're a fan of the original trilogy then watch this. I promise you'll love it! Looking forward to more seasons in the future."
    },
    {
      "username": "bobnet84",
      "userUrl": "https://www.imdb.com/user/ur37551686",
      "reviewLink": "https://www.imdb.com/review/rw4152710",
      "warningSpoilers": false,
      "date": "3 May 2018",
      "rate": "9",
      "helpful": "270 out of 300 found this helpful.",
      "title": "Zabka shows it was no mistake he got so many roles in the 80's",
      "content": "Problem is he was typecast and never given a chance to shine. In, Cobra Kai it's his show and he shows a side of Johnny that is a true human experience."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw5923353",
      "warningSpoilers": false,
      "date": "21 July 2020",
      "rate": "8",
      "helpful": "35 out of 39 found this helpful.",
      "title": "So much better than I thought it would be!",
      "content": "Cobra Kai is so much better than I thought it would be. I grew up a Karate Kid fan but wasn't sure what to expect from this and thought it would be some cheap kiddy money grab. I'm glad I was wrong. It's so much better than it has any business being, especially William Zabka! He absolutely is the star of this show as Johnny Lawrence. You root for him on this more than Daniel (Ralph Macchio)."
    },
    {
      "username": "stevenrotherforth",
      "userUrl": "https://www.imdb.com/user/ur34973289",
      "reviewLink": "https://www.imdb.com/review/rw4152372",
      "warningSpoilers": true,
      "date": "3 May 2018",
      "rate": "10",
      "helpful": "72 out of 86 found this helpful.",
      "title": "You do Karate Kid sequel guess so. You get squished just like grape!",
      "content": "Cobra KaiThey say nostalgia isn't what it used to be. Well try telling that to the writers of this show who have managed to capture the magic of the original Karate Kid movie. At the same time they've given the audience something fresh too. Cobra Kai kicks off some thirty four years after the All valley Karate tournament in which Daniel Larusso took Johnny Lawrence's championship.A TV show that on paper shouldn't really work but it does due to some nicely crafted character development, good comedic writing and perfectly placed nostalgia. Most importantly this show stays supremely faithful to its source material and it is obvious all involved in its production have a deep fondness for the Karate Kid movies.Both William Zabka and Ralph Macchio are fantastic at reprising their most famous roles. Zabka in particular is excellent as an aged Johnny Lawrence. He delivers both a heart felt performance of a broken man coupled with some hilarious comedic moments. He brilliantly portrays the dinosaur who is still stuck in the 80's with some rather primitive views on life. The guy doesn't even know what a Facebook is. Things haven't gone so well for him since he took that crane kick to the face. His relationship with his teenage son is in tatters and he struggles to make ends meet. His decision to resurrect the Cobra Kai Karate dojo reignites his rivalry with former foe Daniel Larusso. Cool name for a Karate dojo dude!Cobra Kai offers much for the hardcore fan who grew up watching the original movies. The creators of this show have stayed very faithful to the original movie. Revisits to original locations and flashbacks will bring a tear to the eye. This show reminded me of 2006's Rocky Balboa. Another revival which also worked because of the love and affection that went into making it. In Cobra Kai classic songs and musical score are brought back that will put a lump in the throat and will rouse the spirit. There's plenty for a new audience to relish too. Whilst admittedly there's a nice helping of cheese there's also a lot of heart in this show. All characters get a journey and story arc that gives them a tremendous amount of depth. Like Stranger Things the young cast is very good too. The fight choreography involving them is very well staged. A particular character named Hawk gets a most likeable journey in terms of his transformation of character. All this down to his Cobra Kai teachings.Cobra Kai works much better as a series rather than it being another two hour movie. Each ten episodes are around half an hour and this allows development of both story and characters. If I have any criticism which really I don't, then I wish the ten part season would have been a little longer. Certain characters and story arcs do seem to not be fully explored. Hey bring on season two this will rectify my only gripe. I for one would love to see more."
    },
    {
      "username": "rorygunn",
      "userUrl": "https://www.imdb.com/user/ur2355075",
      "reviewLink": "https://www.imdb.com/review/rw4151729",
      "warningSpoilers": true,
      "date": "2 May 2018",
      "rate": "9",
      "helpful": "161 out of 198 found this helpful.",
      "title": "Definitely with Johnny on this one",
      "content": "Without giving anything away i will say based on the episodes I've seen so far I'm rooting for Johnny in this story..While he is espousing the same philosophy that he was taught as a Cobra Kai he's not teaching the way Kreese did as his students are the ones getting bullied and in fact probably would've been picked on by Johnny in his high school days but now he seems to be teaching them how to stand up for themselves...in a weird way Johnny has almost become the Miyagi of the story although he's not spouting the same kind of mantra as Mr. Miyagi...I'm just hoping his students don't end up becoming like Johnny was in high school because I'm really rooting for them..."
    },
    {
      "username": "paul_haakonsen",
      "userUrl": "https://www.imdb.com/user/ur22654354",
      "reviewLink": "https://www.imdb.com/review/rw4278158",
      "warningSpoilers": false,
      "date": "10 August 2018",
      "rate": "8",
      "helpful": "54 out of 66 found this helpful.",
      "title": "Are you kidding me? This was absolutely phenomenal...",
      "content": "I must admit that I skipped on this when I first heard of it. I mean, come on the good guy and bad guy from the first (and ancient) \"Karate Kid\" movie making a return to a series about the very same characters. And it being a YouTube production didn't really help win me over either.But after having heard so many speak fondly of it, I decided to give it a chance. And I must admit that I ended up binge-watching all ten episodes. Sure, I liked the \"Karate Kid\" movies when I was a kid, but they weren't all that outstanding. However, this 2018 series really had something to offer.It was actually amazingly fun and entertaining to see both Ralph Macchio return to reprise the Daniel LaRusso character, but even more entertaining to see William Zabka return to visit the Johnny Lawrence character. Zabka really stepped up and performed the you-know-what out of reprising this character, it was just phenomenal.The storyline in \"Cobra Kai\" was good, although it started to turn into a farce towards the last couple of episodes with situations from the original movie being re-used albeit presented with a new skin on it. That was a little bit too unoriginal for my liking. But aside from that, then \"Cobra Kai\" was wholeheartedly entertaining from start to end.And having seen the 2018 \"Cobra Kai\", then it actually puts the 1984 \"Karate Kid\" in a whole new perspective. What if Daniel LaRusso wasn't the innocent kid that he was made out to be? He did a lot of bully things in that movie actually. Have we been mislead by the 1984 classic movie and the LaRusso character all together?Regardless, \"Cobra Kai\" was a glorious trip back memory lane, and it was wonderful to see the growth and situations that both Daniel and Johhny had ended up in.As for the ending of the series... Well, that was a great way of ending it. Was it predictable? For sure. But it was still good, nonetheless.This is definitely something that you should take the time and effort to sit down and watch if you have the time and the chance, and especially if you grew up watching the \"Karate Kid\" movies, at least the first two... the latter and the remake, let's just pretend they never happened.Good entertaining in every aspect, and a good combination of good storyline, action, drama, character development, and dialogue. This definitely took me by surprise."
    },
    {
      "username": "kjproulx",
      "userUrl": "https://www.imdb.com/user/ur23240045",
      "reviewLink": "https://www.imdb.com/review/rw4160987",
      "warningSpoilers": false,
      "date": "11 May 2018",
      "rate": "9",
      "helpful": "23 out of 26 found this helpful.",
      "title": "A Great Reunion Show, With Much More to Offer",
      "content": "For so many reasons, I never felt that I was going to ever watch this series, let alone feel the need to review it, but did I ever eat my words when watching the first season of Cobra Kai. After the success of the original Karate Kid film, three lukewarm sequels were formed as a result of its success, and while they weren't ever known as abominations, I never needed anything more from this franchise. When the original film was reimagined and cast Jaden Smith and Jackie Chan in the lead roles, I really had no thoughts about ever seeing the original cast members again, but once again I've been proven wrong. Here's why this first season of Cobra Kai is better than anything that has come out since the original film that had any relevance to The Karate Kid.Decades later, Daniel LaRusso now owns a car company and lives a very wealthy and happy life with his wife and two children. Since his life has become that of a fairytale ending, the show is focussing far more on that of Johnny Lawrence. Fired from countless jobs and barely getting by, Lawrence finds himself reopening his old dojo in order to face his past demons. Gaining a new trainee in Miguel, this character fits the persona of Larusso from the original film pretty well, but there are definitely differences. Everyone has their share of arcs to go through from the time this show starts, until the very last shot of this season, but the most interesting character for myself was Robby Keene, played by Tanner Buchanan.This is a character that you start off hating, but then realize you may have to rethink your thoughts on the entire show after just a couple episodes. Yes, Ralph Macchio gives his all here and William Zabka impressed the hell out of me every time a comedic or dramatic moment would arise for his character, but I found myself emotionally invested in Robby the most. There are many subplots and callbacks that relate to past events, but they never feel forced. They are either done in a playful way or used as a tool to further this new story. I never once found myself annoyed when portions of the classic story were referenced.This brings me to my experience of this show in general. From the music choices to the call back with the very recognizable score, this is a show with a lot of energy when it needs to be exciting, while also being a show that displays no fear in slowing down for emotional or tender moments between characters. There were multiple occasions when it felt clear that the writers had kept a close eye on character details when weaving classic storylines into this television series. What also surprised me was the fact that footage is used from the original film every now and then in order to fill in the gaps for those who may not have seen the original movie from the 80s.In the end, Cobra Kai is a worthy successor to The Karate Kid legacy and I can't wait to see where they go next. I hope this show is renewed because many possibilities are left wide open at the end of this season. To put it bluntly, I never expected to love a show that I thought looked absolutely atrocious from its trailers, but I honestly can't recommend checking this out enough. Great nostalgia for people who grew up watching the original movies and also features great life lessons for young viewers who wish to start fresh with this show instead of catching up with previous installments. For everything this show sets out to accomplish, it does so in spades and always keeps you guessing. Yes, there are some very cheesy moments, but that's also what make the original movies such a joy to watch. Aside from cringing at a few lines of dialogue, I absolutely loved watching Cobra Kai. I can't wait for more.Now streaming on YouTube Red, this show is worth a subscription to their service alone. Definitely check this one out."
    },
    {
      "username": "Kingslaay",
      "userUrl": "https://www.imdb.com/user/ur51094543",
      "reviewLink": "https://www.imdb.com/review/rw6297719",
      "warningSpoilers": false,
      "date": "22 November 2020",
      "rate": "8",
      "helpful": "14 out of 15 found this helpful.",
      "title": "What an awesome show",
      "content": "Impressed, captivated and engaged are the words that come to mind for Cobra Kai. This is what we need from shows, to take unique and interesting angles. Cobra Kai flips the script and gives us the view from Johnny Lawrence, this is really his story. He's the one who lost and turns out to be a real person with very real flaws. Cobra Kai intrigues us with its great narrative. No more one dimensional 'Good vs Evil' story we've all been told a million times over. This reflects the feelings of the 'loser' of the memorable 1984 film Karate Kid and picks up 34 years later. Because of this narrative and spin I find Johnny to be an inspirational figure by trying his best to rebuild his life. Johnny is a very down to earth and simple character and is making the most of the hand dealt to him, isn't that how we live our lives? In a funny way we see the arrogance and attitude sometimes from Daniel Larusso who was originally the hero. Top marks for a great show."
    },
    {
      "username": "RussHog",
      "userUrl": "https://www.imdb.com/user/ur41031967",
      "reviewLink": "https://www.imdb.com/review/rw4154380",
      "warningSpoilers": false,
      "date": "5 May 2018",
      "rate": "10",
      "helpful": "29 out of 34 found this helpful.",
      "title": "OMG - brilliant",
      "content": "Wow - this story is brilliant. Everything a good nostalgia show should be. It maybe the best first season of any revival of a franchise I have ever seen. So many classics are destroyed by trans media marketing or low quality writing or incoherent premise...but this is an exceptional use of the classic Karate Kid characters. Karate Kid was directed by the director of Rocky, and while never the same classic it always held a really close place in my life as a story of an underdog who earns the respect of his peers. This show takes the finale of that film and follows how the rivalry continues over thirty years later. Congrats to the team who made this - !"
    },
    {
      "username": "r3volution11",
      "userUrl": "https://www.imdb.com/user/ur26615244",
      "reviewLink": "https://www.imdb.com/review/rw4152107",
      "warningSpoilers": false,
      "date": "3 May 2018",
      "rate": "9",
      "helpful": "315 out of 353 found this helpful.",
      "title": "Great For Karate Kid Fans From 80s and Latest Generation",
      "content": "This series brought me back to my childhood and how much I loved the movies and characters growing up. It surprised how well the characters are brought up to date and now involve the younger generation. There's still a lot to be taught, and learned."
    },
    {
      "username": "bevo-13678",
      "userUrl": "https://www.imdb.com/user/ur76062573",
      "reviewLink": "https://www.imdb.com/review/rw6150013",
      "warningSpoilers": false,
      "date": "5 October 2020",
      "rate": "10",
      "helpful": "57 out of 72 found this helpful.",
      "title": "Wax on",
      "content": "Awesome show. Johnny Lawrence is and has always been the REAL karate kid"
    },
    {
      "username": "staunton-gary",
      "userUrl": "https://www.imdb.com/user/ur24923120",
      "reviewLink": "https://www.imdb.com/review/rw6481714",
      "warningSpoilers": false,
      "date": "15 January 2021",
      "rate": "9",
      "helpful": "25 out of 29 found this helpful.",
      "title": "Whoa",
      "content": "Very surprised by Cobra Kai. Was it perfect, no it was not. Some of the actors didn't suit their characters, but it didn't spoil the series. Daniel LaRusso (Ralph Macchio) isn't as annoying as he was in the original movie and he still does that stupid walk. Mostly, his acting suits the part. Johnny Lawrence (William Zabka) basically holds the series together, he's the hero without being the hero, he's anti-hero without being an anti-hero. His acting and character just work. Bit's of it are a bit cheesy, fortunately the filler scenes are not too often, but it doesn't spoil the series. Both Ralph Macchio and William Zabka were co-executive producer/executive producers. I would recommend this series."
    },
    {
      "username": "frankblack-79961",
      "userUrl": "https://www.imdb.com/user/ur68133936",
      "reviewLink": "https://www.imdb.com/review/rw4802027",
      "warningSpoilers": false,
      "date": "25 April 2019",
      "rate": "9",
      "helpful": "24 out of 28 found this helpful.",
      "title": "Simply amazing!",
      "content": "Rarely do I feel that a show or movie deserves a perfect score. After just finishing season 2, I must give this show it's due. As a child I was able to see the first 2 movie in the theater, and like most boys my age I was captivated by the martial arts and probably had my first on- screen crush with Elizabeth Shue. That being said, if you were a fan of these movies, then you will be completely rewarded in this tv show. It captures almost every aspect from the movies from the music to the characters in a way I have almost never seen before in my years. Bravo to the writers, actors and to YouTube for putting together a triumph of cinema that pays all dues to what came before. Bravo."
    },
    {
      "username": "ahmedgorshy",
      "userUrl": "https://www.imdb.com/user/ur106582401",
      "reviewLink": "https://www.imdb.com/review/rw6119787",
      "warningSpoilers": false,
      "date": "24 September 2020",
      "rate": "10",
      "helpful": "41 out of 50 found this helpful.",
      "title": "Cobray Kai is incredible !!!",
      "content": "Cobray Kai is incredible !!! I cannot believe it. I watched this series very eagerly and wanted more after I ended, and although the series has not ended yet, I still think that I miss it and I am losing my mind, waiting for another year to watch the third season! This show is one of the best things I've seen in many years, there is no single series in which all episodes are exactly the same, but Cobra Kai made it. I will not say anything more, but if you haven't watched this series yet, you are more than lucky to start this great journey. My rate : 9.8"
    },
    {
      "username": "Tweetienator",
      "userUrl": "https://www.imdb.com/user/ur64264987",
      "reviewLink": "https://www.imdb.com/review/rw4164654",
      "warningSpoilers": false,
      "date": "14 May 2018",
      "rate": "8",
      "helpful": "30 out of 37 found this helpful.",
      "title": "Cobra Kai Strikes First!",
      "content": "Wonderful and delicious - if you like the first The Karate Kid (1984) movie. Top acting, good and interesting storytelling, some oldschool karate, some nice twists and adds to the original story. Luckily the writers know their stuff and don't try to make something total different of the original material but stay to the core of The Karate Kid movie and add here and there some new stuff which, o wonder, actually makes sense.Anyway, especially watching William Zabka and Ralph Macchio as adults holding up their grudge against each other is a great pleasure, and they act very good indeed. Cobra Kai - really good show that hit me out of nowhere and beats easy 90% of all currently aired shows.Add: in mid of season 3 I quit watching, sometimes you should just know when to stop."
    },
    {
      "username": "GomezAddams666",
      "userUrl": "https://www.imdb.com/user/ur59148101",
      "reviewLink": "https://www.imdb.com/review/rw4154423",
      "warningSpoilers": true,
      "date": "5 May 2018",
      "rate": "10",
      "helpful": "108 out of 147 found this helpful.",
      "title": "Kicking the crap out of political correctness.",
      "content": "This show is amazing, I can't believe the Karate Kid franchise had one more ¨kick¨ in it, but it did.Willam Zabka is perfect as a grown up version of Johnny Lawrence, he sees these politically correct times the way most of us see it: as weakness, and he is the man that's going to rectify that.Forget the stupid, lame and simply inferior Jaden Smith remake, forget that awful, uninspired garbage even existed, this show is the true successor to The Karate Kid.A villain turned hero, and a hero turned into a has-been, I cannot wait for this series to be renewed."
    },
    {
      "username": "donancricchiasaverio",
      "userUrl": "https://www.imdb.com/user/ur27433540",
      "reviewLink": "https://www.imdb.com/review/rw4151914",
      "warningSpoilers": false,
      "date": "3 May 2018",
      "rate": "10",
      "helpful": "109 out of 134 found this helpful.",
      "title": "What a great show",
      "content": "Feels like a realistic portrayel of who these characters would be in today's society. Writing is great and clever."
    },
    {
      "username": "OliverGbyrne",
      "userUrl": "https://www.imdb.com/user/ur3132095",
      "reviewLink": "https://www.imdb.com/review/rw4153506",
      "warningSpoilers": false,
      "date": "4 May 2018",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "This show is so much fun! A reboot done right!",
      "content": "Every one who was born during the VHS era has a memory of the Karate Kid. It was the type of film they use to show in film nights at summer camp between E.T and back to the future. With all that love for that film I started watching Cobra Kai with slight fear like \" I hope they are not gonna spoil the memories I have from this film\" and thankfully they did not. The Karate Kid remake was a failure in my eyes because it just followed the exact same beat of the original, only in a different setting. Cobra Kai take the essence of the film and flip it on the other side so it feels different from the film yet very familiar at the same time. Now we follow Johnny Lawrence (Played masterfully by William Zabka), a down on his luck, failed husband, failed father drunk still haunted by that crane kick he received from Daniel Larusso at the end of the first Karate kid. He barely lives day to day until he becomes an unlikely hero to a neighborhood kid who is very reminiscent of Danielle Larusso, this meeting along with faith making him cross path with his arch nemesis reawaken in Johnny a sense of purpose and he reopens the Cobra Kai Dojo much to the dismay of Danielle Larusso. We spent 3 film with Daniel now it's Johnny story and man does it flesh out his character. He his no longer the two dimensional bully of the first film, we get to know his background through childhood flashback and yeah it's crazy but by the end I liked Johnny better than Daniel! I love a good redemption story and this is the best one I have seen in a while. The younger cast that populate the Cobra Kai dojo are also quiet good, they feel like real kids that were put through the ringer. One thing I appreciate is that the show does not adopt that PC attitude of \"Fight your bullies with love\" , Johnny tell these kids stop being the victims and be proud of who you are and it's awesome! Without spoiler another thing I liked about this show is that it avoid a perfect ending, it's not a bad one nor a good one it just address the negative side of Johnny teaching as well and the no mercy rule. It is a fantastic reboot done right and the easiest show to binge watch in a while. Well done to all involved."
    },
    {
      "username": "nowego",
      "userUrl": "https://www.imdb.com/user/ur16749093",
      "reviewLink": "https://www.imdb.com/review/rw4163500",
      "warningSpoilers": false,
      "date": "13 May 2018",
      "rate": "9",
      "helpful": "14 out of 16 found this helpful.",
      "title": "Very Very Well Done",
      "content": "As a huge and I mean huge fan of the original (I wore out two VHS tapes of this I watched it so much and lost count after 100 viewings), I was a bit skeptical about a series set 30 years after the original movie.I am happy to say the makers of this series did not let me down, I just finished binge watching all 10 epsiodes and expect there will be many repeated viewings. Very very well done and the flashbacks brought back so many memories, just brilliant.Good to see the original actors back in one place which must have been a bit of a task, but wow it was worth it.This is a must see for any fans of the original movie. Anyone who has not seen the original movie must see it before viewing this series, you will not be disappointed.I came very close to giving this a 10."
    },
    {
      "username": "mtyducs",
      "userUrl": "https://www.imdb.com/user/ur19508379",
      "reviewLink": "https://www.imdb.com/review/rw4151955",
      "warningSpoilers": false,
      "date": "3 May 2018",
      "rate": "10",
      "helpful": "52 out of 64 found this helpful.",
      "title": "Cobra Kai is back baby!!",
      "content": "Great job incorporating the old movies along with a new story. Watching all episodes today for sure and eagerly await season 2. Zabka is more bad ass than he was in the 80s.The new cast, Diaz and my boy Hawk, are going to provide for a long and exciting future for Cobra Kai. It was fun watching them evolve into Cobra Kai badasses. But make no mistake about it, Zabka is the show. I'm sure it really has been a long 30 years for Zabka and could not be happier for the guy.Zabka owns the smirk!!"
    },
    {
      "username": "Horror_Flick_Fanatic",
      "userUrl": "https://www.imdb.com/user/ur27582881",
      "reviewLink": "https://www.imdb.com/review/rw6054062",
      "warningSpoilers": false,
      "date": "1 September 2020",
      "rate": "9",
      "helpful": "18 out of 22 found this helpful.",
      "title": "Surprised, it's that good.",
      "content": "I am genuinely surprised at how much I enjoyed this TV series. Originally I dismissed it as a YoutubeTV original pulling on the nostalgia strings of my generation. I didn't think it was worth getting YoutubeTV just for this one show. But now that the show has made its appearance on Netflix, I gave it a chance.I really really like it. Genuinely funny. The billboard/D jokes were hysterical, especially when Armanda LaRusso (Courtney Henggeler) joins in the ribbing of Daniel LaRusso (Ralph Macchio), I broke out in laughter.I've only watched Season 1 as of this review but I can't wait to get started on Season 2."
    }
  ],
  "errorMessage": ""
}