{
  "imDbId": "tt7221388",
  "title": "Cobra Kai",
  "fullTitle": "Cobra Kai (TV Series 2018–2023)",
  "type": "TVSeries",
  "year": "2018",
  "language": "en",
  "titleInLanguage": "Cobra Kai",
  "url": "https://en.wikipedia.org/wiki/Cobra_Kai",
  "plotShort": {
    "plainText": "Cobra Kai is an American martial arts comedy-drama television series and a sequel to the original The Karate Kid films by Robert Mark Kamen. The series was created by Josh Heald, Jon Hurwitz, and Hayden Schlossberg, and is distributed by Sony Pictures Television. The series was released on YouTube Red / YouTube Premium for the first two seasons, before moving to Netflix starting with the third. The series stars Ralph Macchio and William Zabka, who reprise their roles as Daniel LaRusso and Johnny Lawrence from the 1984 film The Karate Kid and its sequels, The Karate Kid Part II (1986) and The Karate Kid Part III (1989).\r\nThe first and second seasons launched on YouTube Red/Premium in May 2018 and April 2019. Netflix acquired the series in June 2020 after YouTube decided to stop producing scripted original programming. The third, fourth and fifth seasons were released in January 2021, December 2021, and September 2022, respectively. In January 2023, the series was renewed for a sixth and final season.\r\nCobra Kai re-examines the \"Miyagi-verse\" narrative from Johnny's point of view, beginning with his decision to reopen the Cobra Kai karate dojo, and the rekindling of his old rivalry with Daniel. The series also stars Courtney Henggeler, Xolo Maridueña, Tanner Buchanan, Mary Mouser, Jacob Bertrand, Gianni DeCenzo, Peyton List, Vanessa Rubio and Dallas Dupree Young, with Martin Kove and Thomas Ian Griffith also reprising their roles from the films. The series takes place between 2017 and 2019.\r\nCobra Kai has attained high viewership on both YouTube and Netflix, and has received critical acclaim for its writing, performances, action sequences, humor, character development, and faithfulness to the previous films. It has received numerous awards and nominations, with the third season being nominated for Outstanding Comedy Series at the 73rd Primetime Emmy Awards.",
    "html": "<p>Cobra Kai is an American martial arts comedy-drama television series and a sequel to the original The Karate Kid films by Robert Mark Kamen. The series was created by Josh Heald, Jon Hurwitz, and Hayden Schlossberg, and is distributed by Sony Pictures Television. The series was released on YouTube Red / YouTube Premium for the first two seasons, before moving to Netflix starting with the third. The series stars Ralph Macchio and William Zabka, who reprise their roles as Daniel LaRusso and Johnny Lawrence from the 1984 film The Karate Kid and its sequels, The Karate Kid Part II (1986) and The Karate Kid Part III (1989).</p><p>The first and second seasons launched on YouTube Red/Premium in May 2018 and April 2019. Netflix acquired the series in June 2020 after YouTube decided to stop producing scripted original programming. The third, fourth and fifth seasons were released in January 2021, December 2021, and September 2022, respectively. In January 2023, the series was renewed for a sixth and final season.</p><p>Cobra Kai re-examines the \"Miyagi-verse\" narrative from Johnny's point of view, beginning with his decision to reopen the Cobra Kai karate dojo, and the rekindling of his old rivalry with Daniel. The series also stars Courtney Henggeler, Xolo Maridueña, Tanner Buchanan, Mary Mouser, Jacob Bertrand, Gianni DeCenzo, Peyton List, Vanessa Rubio and Dallas Dupree Young, with Martin Kove and Thomas Ian Griffith also reprising their roles from the films. The series takes place between 2017 and 2019.</p><p>Cobra Kai has attained high viewership on both YouTube and Netflix, and has received critical acclaim for its writing, performances, action sequences, humor, character development, and faithfulness to the previous films. It has received numerous awards and nominations, with the third season being nominated for Outstanding Comedy Series at the 73rd Primetime Emmy Awards.</p>"
  },
  "plotFull": {
    "plainText": "Cobra Kai is an American martial arts comedy-drama television series and a sequel to the original The Karate Kid films by Robert Mark Kamen. The series was created by Josh Heald, Jon Hurwitz, and Hayden Schlossberg, and is distributed by Sony Pictures Television. The series was released on YouTube Red / YouTube Premium for the first two seasons, before moving to Netflix starting with the third. The series stars Ralph Macchio and William Zabka, who reprise their roles as Daniel LaRusso and Johnny Lawrence from the 1984 film The Karate Kid and its sequels, The Karate Kid Part II (1986) and The Karate Kid Part III (1989).\r\nThe first and second seasons launched on YouTube Red/Premium in May 2018 and April 2019. Netflix acquired the series in June 2020 after YouTube decided to stop producing scripted original programming. The third, fourth and fifth seasons were released in January 2021, December 2021, and September 2022, respectively. In January 2023, the series was renewed for a sixth and final season.\r\nCobra Kai re-examines the \"Miyagi-verse\" narrative from Johnny's point of view, beginning with his decision to reopen the Cobra Kai karate dojo, and the rekindling of his old rivalry with Daniel. The series also stars Courtney Henggeler, Xolo Maridueña, Tanner Buchanan, Mary Mouser, Jacob Bertrand, Gianni DeCenzo, Peyton List, Vanessa Rubio and Dallas Dupree Young, with Martin Kove and Thomas Ian Griffith also reprising their roles from the films. The series takes place between 2017 and 2019.\r\nCobra Kai has attained high viewership on both YouTube and Netflix, and has received critical acclaim for its writing, performances, action sequences, humor, character development, and faithfulness to the previous films. It has received numerous awards and nominations, with the third season being nominated for Outstanding Comedy Series at the 73rd Primetime Emmy Awards.\r\nSummary\r\nThirty-four years after being defeated by Daniel LaRusso in the 1984 All-Valley Karate Tournament, Johnny Lawrence, now in his 50s, suffers from alcoholism and depression. He works as a part-time handyman, and lives in an apartment in Reseda, Los Angeles, having fallen far from the wealthy lifestyle in Encino that he had been accustomed to growing up. He has an estranged son named Robby from a previous relationship, whom he has abandoned. In contrast, Daniel is now the owner of a highly successful car dealership chain, and is married to co-owner Amanda with whom he has two children: Samantha and Anthony. Daniel is finally living the wealthy lifestyle he envied as a kid when he and his mother Lucille lived in Reseda. However, after his friend and mentor Mr. Miyagi died, Daniel's struggle to meaningfully connect with his children has disrupted the balance in his life.\r\nIn Season 1, a down-and-out Johnny uses karate to defend new teenage neighbor Miguel Diaz from a group of thugs, he agrees to teach Miguel karate and re-opens the Cobra Kai karate dojo as a chance to recapture his past. The revived Cobra Kai attracts a group of bullied social outcasts who find camaraderie and self-confidence under his tutelage. Johnny develops a bond with Miguel in a manner that resembles the relationship between Daniel and Mr. Miyagi. Cobra Kai's philosophy, however, remains mostly unchanged, though Johnny tries to infuse it with more honor than Kreese did. On the other hand, the reopening of Cobra Kai revives Johnny's rivalry with Daniel, who vows to bring down the dojo. Later, Robby develops a rivalry with Miguel reminiscent of the rivalry between Daniel and Johnny.\r\nIn Season 2, following Cobra Kai's victory at the 2018 All-Valley Karate Tournament, John Kreese unexpectedly reappears, and Johnny reluctantly allows him to rejoin Cobra Kai. Meanwhile, Daniel reopens the Miyagi-Do dojo with Robby and Sam as his first students in response to Cobra Kai's success. A massive rivalry forms between the two dojos, especially between Sam and new Cobra Kai student Tory Nichols. After a brutal school brawl is instigated by Tory on the first day of school, Kreese seizes control of the Cobra Kai dojo and kicks Johnny out.\r\nThe third and fourth seasons follows as Johnny forms the new dojo Eagle Fang with Miguel and other former Cobra Kai students that Kreese expelled. He also agrees to partner with Daniel as a means of combating the new Cobra Kai under Kreese by preparing for the next All-Valley Karate Tournament. Kreese, however, brings back former Cobra Kai co-founder Terry Silver (from The Karate Kid Part III), who proves to be a more dangerous and underhanded enemy than Kreese himself.\r\nThe fifth season continue Daniel and Johnny's efforts, with help from Chozen Toguchi (from The Karate Kid Part II), to bring down Cobra Kai, which is now run by Silver (following a cheated victory at the All-Valley Karate Tournament and Kreese being framed by him for attempted murder) and later joined by fellow sensei Kim Da-Eun, a descendant of the original Cobra Kai philosophy. Daniel's former rival Mike Barnes and Amanda's cousin Jessica Andrews (both from The Karate Kid Part III) return in this season.\r\nThe upcoming sixth and final season is set in the fall of 2019.\r\nCast and characters\r\nMain cast\r\nSupporting cast\r\nJoe Seo as Kyler Park (recurring, seasons 1, 3–5)\r\nAnnalisa Cochrane as Yasmine (recurring, seasons 1, 3; guest seasons 4–5)\r\nBo Mitchell as Brucks (recurring, season 1; guest season 3)\r\nBret Ernst as Louie LaRusso Jr. (recurring, seasons 1, 3; guest seasons 4–5)\r\nHannah Kepple as Moon (recurring, seasons 1–4; guest, season 5)\r\nDan Ahdoot as Anoush Norouzi (recurring, seasons 1–3; guest, seasons 4–5)\r\nVas Sanchez as Nestor (recurring, season 2; guest, seasons 1, 4)\r\nSusan Gallagher as Homeless Lynn (recurring, season 1; guest, seasons 2–4)\r\nGriffin Santopietro as Anthony LaRusso (recurring, seasons 1, 4–5; guest, seasons 2–3)\r\nNichole Brown as Aisha Robinson (recurring, seasons 1–2; guest, season 4)\r\nRose Bianco as Rosa Diaz (recurring, seasons 1–2, 4; guest, seasons 3, 5)\r\nTerayle Hill as Trey (recurring, season 1; guest, seasons 2–3)\r\nJeff Kaplan as Cruz (recurring, season 1; guest, seasons 2–3)\r\nOwen Morgan as Bert (recurring, seasons 1–5)\r\nEd Asner as Sid Weinberg (guest, seasons 1, 3)\r\nErin Bradley Dangar as Counselor Blatt (guest, seasons 1, 3–4)\r\nDavid Shatraw as Tom Cole (guest, seasons 1, 3)\r\nDiora Baird as Shannon Keene (guest, seasons 1–5)\r\nKen Davitian as Armand Zarkarian (guest, seasons 1–3)\r\nCandace Moon as Laura Lawrence (guest, seasons 1, 4)\r\nRandee Heller as Lucille LaRusso (guest, seasons 1–2, 4)\r\nPaul Walter Hauser as Raymond \"Stingray\" Porter (recurring, seasons 2, 5; guest, season 4)\r\nAedin Mincks as Mitch (recurring, seasons 2–5)\r\nKhalil Everage as Chris (recurring, seasons 2–5)\r\nNathaniel Oh as Nathaniel (recurring, seasons 2–5)\r\nSelah Austria as Piper Elswith (recurring, season 4; guest, season 2)\r\nKim Fields as Sandra Robinson (guest, season 2)\r\nRon Thomas as Bobby Brown (guest, seasons 2–3)\r\nRob Garrison as Tommy (guest, season 2)\r\nTony O'Dell as Jimmy (guest, season 2)\r\nOkea Eme-Akwari as Shawn Payne (recurring, season 3; guest, season 4)\r\nYuji Okumoto as Chozen Toguchi (recurring, season 5; guest, seasons 3–4)\r\nDee Snider as Himself (guest, season 3)\r\nTamlyn Tomita as Kumiko (guest, season 3)\r\nTraci Toguchi as Yuna (guest, season 3)\r\nTerry Serpico as Captain George Turner (guest, seasons 3, 5)\r\nSeth Kemp as Ponytail (guest, season 3)\r\nElisabeth Shue as Ali Mills (guest, season 3)\r\nBrock Duncan as Zack Thompson (recurring, season 4)\r\nMilena Rivero as Lia Cabrera (recurring, season 4)\r\nOona O'Brien as Devon Lee (recurring, seasons 4–5)\r\nSalome Azizi as Cheyenne Hamidi (guest, season 4)\r\nJulia Macchio as Vanessa LaRusso (guest, seasons 4–5)\r\nCarrie Underwood as Herself (guest, season 4)\r\nAlicia Hannah-Kim as Kim Da-Eun (recurring, season 5)\r\nOwen Harn as Gabriel (recurring, season 5)\r\nLuis Roberto Guzmán as Hector Salazar (guest, season 5)\r\nSean Kanan as Mike Barnes (guest, season 5)\r\nRobyn Lively as Jessica Andrews (guest, season 5)\r\nSunny Mabrey as Lizzie-Anne (guest, season 5)\r\nTracey Bonner as Dr. Emily Folsom (guest, season 5)\r\nCarsten Norgaard as Gunther Braun (guest, season 5)\r\nTyron Woodley as Sensei Odell/K.O. (guest, season 5)\r\nStephen Thompson as Sensei Morozov (uncredited, season 5)\r\nArchival footage\r\nThe following characters only appear via archival footage from the film series:\r\nPat Morita as Mr. Miyagi\r\nDanny Kamekona as Sato Toguchi\r\nNobu McCarthy as Yukie\r\nChad McQueen as Dutch\r\nIsrael Juarbe as Freddy Fernandez\r\nJonathan Avildsen as Snake\r\nChristopher Paul Ford as Dennis\r\nEpisodes\r\nProduction\r\nThe thematic genesis for Cobra Kai began with a few works of pop culture. First, the 2007 music video for the song \"Sweep the Leg\" by No More Kings stars William Zabka (who also directed the video) as a caricature of himself as Johnny, and features references to The Karate Kid, including cameo appearances by Zabka's former Karate Kid co-stars. In a 2010 interview, Zabka jokingly discussed this video in the context of his vision that Johnny was the true hero of the film. Next in June 2010, Macchio appeared in Funny or Die's online short, \"Wax On, F*ck Off\", in which his loved ones stage an intervention to turn the former child star from a well-adjusted family man into an addict besieged with tabloid scandal in order to help his career (with frequent references to The Karate Kid). A recurring joke in the sketch is that Macchio is confused for an adolescent. The short was lauded by TV Guide's Bruce Fretts, who referred to the video as \"sidesplitting\" and \"comic gold\". Finally, in 2013, Macchio and Zabka made guest appearances as themselves in the television sitcom How I Met Your Mother (\"The Bro Mitzvah\"). In the episode, Macchio is invited to Barney Stinson's bachelor party, leading to Barney shouting that he hates Macchio and that Johnny was the real hero of The Karate Kid. Towards the end of the episode, a clown in the party wipes off his makeup and reveals himself as Zabka. This influenced the launch of Cobra Kai, which gives a balanced perspective for Johnny, Daniel, and other characters. Zabka continued to be a recurring character throughout the ninth season of the show.\r\nDevelopment\r\nCobra Kai was greenlit in August 2017, with ten half-hour episodes, written and executive produced by Josh Heald, Jon Hurwitz, and Hayden Schlossberg. Although the series received offers from Netflix, Amazon, Hulu, and AMC, it ultimately ended up on the subscription service YouTube Red. The trio was joined by executive producers James Lassiter and Caleeb Pinkett of Overbrook Entertainment in association with Sony Pictures Television. YouTube Premium released the first season on May 2, 2018, and the second season on April 24, 2019. The creators of the series explored moving to another platform ahead of the season two premiere, but the deal did not go through.\r\nThe third season was produced for YouTube and was initially set for a 2020 release, but in May 2020, the series left YouTube and moved to another streaming platform, ahead of its third-season premiere. As YouTube was not interested in renewing the series for a fourth season, the producers wanted to find a streaming venue that would leave that option open. The show moved to Netflix in June, taking the third season with them. Netflix released the first two seasons from YouTube on August 28, 2020, and the new third season on January 1, 2021. A fourth season was renewed, prior to season 3 being released, and was released on December 31, 2021. The fifth season premiered on September 9, 2022. In January 2023, the series was renewed for a sixth and final season.\r\nMiyagi-verse\r\nCharacters from the original four films The Karate Kid (1984), The Karate Kid Part II (1986), The Karate Kid Part III (1989), The Next Karate Kid (1994) comprise the Miyagi-verse that shapes Cobra Kai. Thus, after the launch of season 1, Elisabeth Shue (Ali Mills) from The Karate Kid, Tamlyn Tomita (Kumiko) and Yuji Okumoto (Chozen Toguchi) from The Karate Kid II, and Robyn Lively (Jessica Andrews), Thomas Ian Griffith (Terry Silver), and Sean Kanan (Mike Barnes) from The Karate Kid III, all discussed their interest in the series.\r\nSince 2019, there has been a discussion about the potential involvement of Hilary Swank (Julie Pierce, The Next Karate Kid) in Cobra Kai. When asked about her involvement, she said that it would be a chance to have a \"showdown\" with Ralph Macchio. In 2020, the writers added that they spoke about every character appearing in the Miyagi-verse, including Julie Pierce, but they were not sure whether she will return or not in the franchise. Later in 2022, when again asked about her potential involvement, Swank stated that she is \"not in Cobra Kai, no one's asked me to be in Cobra Kai...no one's called me!...but it's so funny, isn't it, that's the one thing I get asked the most and no one's called me?\" A few weeks later, Ralph Macchio responded to questions about her comments by stating that \"most of this rests on Jon (Hurwitz), Josh (Heald), and Hayden (Schlossberg) who create the show, and the writing staff. And we're always very collaborative and we always talk through things. They are great listeners and that's why, like I said, they care, and I care. So, I think that's why everything's working. I think there's certainly room in the Miyagi-verse...You would imagine that Julie Pierce and Daniel LaRusso knew each other even though we don't have those scenes and I'm not a part of that specific film. These guys just amaze me all the time with what they're able to create, and the fact that they just don't create it for fan service. They really create stories that work and enhance characters. And then the fact that it's fan service as well is why I think it's working on all cylinders. So, there's my long answer to the short question that I really don't know, but I expect if there's an opportunity it will be taken up on.\"\r\nJon Hurwitz has also clarified that The Karate Kid animated series is not part of the Miyagi-verse canon, but an Easter egg from it appears in the season 3, in response to the question about its status within the Karate Kid franchise. The Easter egg was the Miyagi-Do shrine, briefly seen at Chozen Toguchi's dojo in Okinawa halfway through the season. The artifacts were recovered by Daniel LaRusso and Mister Miyagi in the short-lived Karate Kid animated series, which ran for thirteen episodes in 1989. Furthermore, the writers have also said that they will not be using characters from the 2010 film The Karate Kid, as they are not a part of the \"Miyagi-verse\": \"We've ruled that out completely. Jackie Chan is mentioned in season 1 of the show as an actor, so I think in our world, Jackie Chan is an actor and a performer. If the characters on our show have seen a movie called The Karate Kid, they've seen that one.\"\r\nCasting\r\nIn season 1, Ralph Macchio and William Zabka reprised their respective Karate Kid roles of Daniel LaRusso and Johnny Lawrence. Additional Karate Kid actors included Randee Heller, who reprised her role as Lucille LaRusso (Daniel's mother), and Martin Kove, who revived his role as John Kreese. The cast list for season 1 included Xolo Maridueña, Mary Mouser, Tanner Buchanan, and Courtney Henggeler. Ed Asner was cast in a guest role as Johnny's verbally abusive step-father, Sid Weinberg. Vanessa Rubio joined the cast as Miguel's mother.\r\nIn season 2, Ralph Macchio, William Zabka, Xolo Mariduena, Tanner Buchanan, Mary Mouser, and Courtney Henggeler all returned, with Jacob Bertrand, Gianni DeCenzo, and Martin Kove being promoted to series regulars and newcomers Paul Walter Hauser and Peyton List joining the cast. Actors from The Karate Kid, Rob Garrison (Tommy), Ron Thomas (Bobby), Tony O'Dell (Jimmy), and Randee Heller (Lucille LaRusso) made guest appearances during this season.\r\nIn season 3, Ralph Macchio, William Zabka, Xolo Mariduena, Tanner Buchanan, Mary Mouser, and Courtney Henggeler all returned. Actors from The Karate Kid and The Karate Kid II, Elisabeth Shue (Ali Mills), Ron Thomas (Bobby), Tamlyn Tomita (Kumiko), Traci Toguchi (Yuna), and Yuji Okumoto (Chozen Toguchi) all made guest appearances during this season.\r\nIn season 4, Vanessa Rubio and Peyton List were promoted to series regulars, while Dallas Dupree Young and Oona O'Brien were cast in recurring roles. In addition, Thomas Ian Griffith reprised his role as Terry Silver from The Karate Kid III, and actors from The Karate Kid and The Karate Kid II, Yuji Okumoto (Chozen Toguchi) and Randee Heller (Lucille LaRusso), made guest appearances.\r\nIn season 5, Yuji Okumoto had a recurring role as Chozen Toguchi. In addition, Sean Kanan reprised his role as Mike Barnes and Robyn Lively reprised her role as Jessica Andrews from The Karate Kid III. Alicia Hannah-Kim also joined the cast as Kim Da-Eun. Dallas Dupree Young, who joined the show in season four as Kenny Payne, was upgraded to a series regular.\r\nFilming\r\nPrincipal photography for the first season began in October 2017 in Atlanta, Georgia. Filming took place at various locations throughout that month at places including Union City, Marietta, and the Briarcliff Campus of Emory University. In November, shooting moved to locales such as the North Atlanta Soccer Association Tophat fields in East Cobb. In December, the production was working out of Marietta and Conyers. Various exterior shots were also filmed in parts of Los Angeles such as Tarzana and Encino. Exterior locations included Golf N' Stuff in Norwalk and the South Seas Apartments in Reseda, both of which were originally featured in The Karate Kid.\r\nPrincipal photography for the second season began in September 2018 in Atlanta, Georgia. In October, production continued around Atlanta with shooting also occurring in Marietta. In November, the series was filming in Union City. In December, shooting transpired at the closed Rio Bravo Cantina restaurant in Atlanta.\r\nPrincipal photography for the fourth season began in February 2021 and ended in April in Atlanta, Georgia.\r\nFilming for the fifth season began in September 2021 and finished in December. Like previous seasons, parts were filmed in Atlanta, Georgia, Marietta, Georgia and Los Angeles, California. The Mexico scenes were filmed in Puerto Rico on a two-day filming block, just like the two-day filming block of Okinawa, Japan and the Tokyo Metropolitan Government Building in Tokyo, Japan for the third season.\r\nRelease\r\nMarketing\r\nThe series was promoted at the annual Television Critics Association's winter press tour held in January 2018, when YouTube's global head of original content Susanne Daniels described the show: \"It is a half an hour format but I would call it a dramedy. I think it leans into the tone of the movies in that there are dramatic moments throughout. I think it's very faithful really in some ways to what the movie set about doing, the lessons imparted in the movie if you will. It's next generation Karate Kid.\"\r\nSeveral trailers for the show were released from February to March, before the premiere date was revealed to be May 2.\r\nYouTube Premium released a six-minute commercial parodying ESPN's 30 for 30 in April 2019, featuring the main cast members and select ESPN personalities analyzing the 1984 match between Daniel and Johnny. It was nominated for a Clio Award.\r\nPremiere\r\nThe series held its world premiere on April 24, 2018, at the SVA Theatre in New York City, New York, during the annual Tribeca Film Festival. Following the screening, a discussion was held with writers, directors, and executive producers Hayden Schlossberg, Jon Hurwitz, and Josh Heald, in addition to series stars and co-executive producers William Zabka and Ralph Macchio.\r\nYouTube partnered with Fathom Events for special screenings of the first two episodes of the series at around 700 movie theaters across the United States. The event also included a screening of the original film.\r\nReception\r\nCritical response\r\nAll five seasons of Cobra Kai have received positive critical reviews. At the review aggregator website Rotten Tomatoes, the entire series received a 95% approval rating. On Metacritic, which uses a weighted average, the series holds an average rating of 71 out of 100.\r\nThe first season had a positive response from critics. At Rotten Tomatoes, it holds a 100% approval rating, with an average score of 7.5 out of 10 based on 49 reviews. The website's critical consensus reads: \"Cobra Kai continues the Karate Kid franchise with a blend of pleasantly corny nostalgia and teen angst, elevated by a cast of well-written characters.\" Cobra Kai was 2018's best-reviewed TV drama on Rotten Tomatoes. Metacritic assigned the season a score of 72 out of 100 based on 11 critics, indicating \"generally favorable reviews\".\r\nThe second season had a positive response from critics. At the review aggregator website Rotten Tomatoes, it holds an 90% approval rating with an average score of 7.4 out of 10, based on 31 reviews. Its critical consensus reads: \"While Cobra Kai's subversive kick no longer carries the same gleeful impact of its inaugural season, its second round is still among the best around – no amount of mid-life crisis and teenage ennui's ever gonna keep it down.\" Metacritic's weighted average assigned the second season a score of 66 out of 100, based on seven critics, indicating \"generally favorable reviews\".\r\nThe third season of the series had a positive response from critics. At the review aggregator website Rotten Tomatoes, it holds an 90% approval rating, with an average score of 8 out of 10 based on 51 reviews. The website's critical consensus reads: \"By pairing its emotional punches with stronger humor, Cobra Kai's third season finds itself in fine fighting form.\" On Metacritic with its weighted average, assigned a score of 72 out of 100, based on 15 critics, indicating \"generally favorable reviews\".\r\nThe fourth season had a positive response from critics. It received a 95% Rotten Tomatoes approval rating, with an average score of 7.9 out of 10 based on 37 reviews. The website's critical consensus reads: \"Cobra Kai still delights in a fourth season that mines great fun from shifting alliances, chiefly the uneasy truce between Johnny Lawrence and Daniel LaRusso.\" Metacritic's weighted average assigned the fourth season a score of 70 out of 100, based on eight critics, indicating \"generally favorable reviews\".\r\nThe fifth season had a positive response from critics. It received a Rotten Tomatoes approval rating of 98%, with an average rating of 8 out of 10 based on 44 reviews. The site's critical consensus reads: \"Deftly managing an expanded roster of punchy personalities, Cobra Kai graduates to a black belt proficiency in heartfelt melodrama and sly humor.\" On Metacritic, it received a weighted score of 78 out of 100, based on seven critics, indicating \"generally favorable reviews\".\r\nViewership\r\nYouTube\r\nThe first episode, which was posted on YouTube for free along with episode two, had been viewed 5.4 million times within the first 24 hours. While it was noted that the response had been, in part, a result of YouTube releasing the episode for free, it was noted by Cinema Blend's Britt Lawrence that YouTube Red's new series debuted to numbers that made rival streaming services take notice. By October 30, 2018, ahead of the second-season premiere, YouTube was promoting the report that the first episode had then been viewed over 50 million times. The first episode was No. 8 on YouTube's list of ten top-trending videos of 2018.\r\nAccording to market research company Parrot Analytics, the first season of Cobra Kai was the world's most in-demand streaming television show during May 2018. Parrot Analytics later reported that the second season of Cobra Kai was the world's most in-demand digital television show during April and through May 2019. As of September 2020, the season 1 premiere has over 90 million views, and the season 2 premiere has over 86 million views.\r\nNetflix\r\nAfter the series moved to Netflix in August 2020, season 1 and season 2 of Cobra Kai became the most-watched series on the platform. It was the most-watched show on streaming media in the United States between August 29 and September 6, according to Nielsen ratings. During the week, the show's 20 episodes drew nearly 2.2 billion streaming minutes in the United States. The first season was watched on Netflix by 50 million member households in its first four weeks, making Cobra Kai the most-streamed show on Netflix during the month of September 2020.\r\nIn February 2021, after the release of season 3, Forbes announced that it \"kicked off 2021 as one of most viewed original series on a streaming platform\". During the period of December 28, 2020 – January 3, 2021, it came in \"second only to Netflix's Bridgerton\", with over 2.6 billion viewing minutes. Cobra Kai then moved to first place during the period of January 4–10, 2021. Critics also offered cultural commentary in response to season three. Jen Yamato of Los Angeles Times stated that by the end of season three, there are three white men at the center of Cobra Kai, a franchise rooted in and deeply indebted to Eastern tradition. Gustavo Arellano of Los Angeles Times suggested that Cobra Kai offers a \"way forward for all of us during these tumultuous times\", as he saw this uplifting season 3 finale the weekend before the Jan. 6 U.S. Capitol invasion. The Hollywood Reporter, former NBA champion and student of martial arts Kareem Abdul-Jabbar suggested that his friend and teacher, the late Bruce Lee, was linked to the influence of the original Karate Kid films. Finally, Albert Wu and Michelle Kuo of the Los Angeles Review of Books argued that while the original Karate Kid \"film functioned as a post-Vietnam critique of American empire, staking its position explicitly: pacifism over violence, peace over war, an admittedly romanticized version of Eastern wisdom over the macho bravado of jock culture\", Cobra Kai \"models\" the \"unending appeal\" of the \"American Empire\".\r\nAwards and nominations\r\nHome media\r\nDuring the show's time on YouTube Red, Cobra Kai was not released on DVD, but once the show made its move to Netflix, Sony Pictures released the first and second seasons in a \"Collector's Edition\" DVD set on November 24, 2020 in the United States. In 2022, Sony Pictures released the third season in January and the fourth in September, both in the United States.\r\nSoundtracks\r\nCobra Kai: Wax Off – EP\r\nMadison Gate Records released an extended play entitled Cobra Kai: Wax Off – EP on July 23, 2021, featuring extended versions of four previously released tracks from the first two seasons soundtracks.\r\nTrack listing\r\nAll music is composed by Leo Birenberg and Zach Robinson.\r\nVideo games\r\nCobra Kai: The Karate Kid Saga Continues, a video game based on the series, was released for PlayStation 4, Xbox One, and Nintendo Switch on October 27, 2020, and for Microsoft Windows on January 5, 2021.\r\nA mobile game entitled Cobra Kai: Card Fighter was released on March 19, 2021, on iOS and Android devices.\r\nBook\r\nIn 2022, Ralph Macchio published the memoir Waxing On: The Karate Kid and Me (Dutton), in which he reflects upon the making of and legacy of the Karate Kid films and Cobra Kai.",
    "html": "<p>Cobra Kai is an American martial arts comedy-drama television series and a sequel to the original The Karate Kid films by Robert Mark Kamen. The series was created by Josh Heald, Jon Hurwitz, and Hayden Schlossberg, and is distributed by Sony Pictures Television. The series was released on YouTube Red / YouTube Premium for the first two seasons, before moving to Netflix starting with the third. The series stars Ralph Macchio and William Zabka, who reprise their roles as Daniel LaRusso and Johnny Lawrence from the 1984 film The Karate Kid and its sequels, The Karate Kid Part II (1986) and The Karate Kid Part III (1989).</p><p>The first and second seasons launched on YouTube Red/Premium in May 2018 and April 2019. Netflix acquired the series in June 2020 after YouTube decided to stop producing scripted original programming. The third, fourth and fifth seasons were released in January 2021, December 2021, and September 2022, respectively. In January 2023, the series was renewed for a sixth and final season.</p><p>Cobra Kai re-examines the \"Miyagi-verse\" narrative from Johnny's point of view, beginning with his decision to reopen the Cobra Kai karate dojo, and the rekindling of his old rivalry with Daniel. The series also stars Courtney Henggeler, Xolo Maridueña, Tanner Buchanan, Mary Mouser, Jacob Bertrand, Gianni DeCenzo, Peyton List, Vanessa Rubio and Dallas Dupree Young, with Martin Kove and Thomas Ian Griffith also reprising their roles from the films. The series takes place between 2017 and 2019.</p><p>Cobra Kai has attained high viewership on both YouTube and Netflix, and has received critical acclaim for its writing, performances, action sequences, humor, character development, and faithfulness to the previous films. It has received numerous awards and nominations, with the third season being nominated for Outstanding Comedy Series at the 73rd Primetime Emmy Awards.</p><br/><h3>Summary</h3><p>Thirty-four years after being defeated by Daniel LaRusso in the 1984 All-Valley Karate Tournament, Johnny Lawrence, now in his 50s, suffers from alcoholism and depression. He works as a part-time handyman, and lives in an apartment in Reseda, Los Angeles, having fallen far from the wealthy lifestyle in Encino that he had been accustomed to growing up. He has an estranged son named Robby from a previous relationship, whom he has abandoned. In contrast, Daniel is now the owner of a highly successful car dealership chain, and is married to co-owner Amanda with whom he has two children: Samantha and Anthony. Daniel is finally living the wealthy lifestyle he envied as a kid when he and his mother Lucille lived in Reseda. However, after his friend and mentor Mr. Miyagi died, Daniel's struggle to meaningfully connect with his children has disrupted the balance in his life.</p><p>In Season 1, a down-and-out Johnny uses karate to defend new teenage neighbor Miguel Diaz from a group of thugs, he agrees to teach Miguel karate and re-opens the Cobra Kai karate dojo as a chance to recapture his past. The revived Cobra Kai attracts a group of bullied social outcasts who find camaraderie and self-confidence under his tutelage. Johnny develops a bond with Miguel in a manner that resembles the relationship between Daniel and Mr. Miyagi. Cobra Kai's philosophy, however, remains mostly unchanged, though Johnny tries to infuse it with more honor than Kreese did. On the other hand, the reopening of Cobra Kai revives Johnny's rivalry with Daniel, who vows to bring down the dojo. Later, Robby develops a rivalry with Miguel reminiscent of the rivalry between Daniel and Johnny.</p><p>In Season 2, following Cobra Kai's victory at the 2018 All-Valley Karate Tournament, John Kreese unexpectedly reappears, and Johnny reluctantly allows him to rejoin Cobra Kai. Meanwhile, Daniel reopens the Miyagi-Do dojo with Robby and Sam as his first students in response to Cobra Kai's success. A massive rivalry forms between the two dojos, especially between Sam and new Cobra Kai student Tory Nichols. After a brutal school brawl is instigated by Tory on the first day of school, Kreese seizes control of the Cobra Kai dojo and kicks Johnny out.</p><p>The third and fourth seasons follows as Johnny forms the new dojo Eagle Fang with Miguel and other former Cobra Kai students that Kreese expelled. He also agrees to partner with Daniel as a means of combating the new Cobra Kai under Kreese by preparing for the next All-Valley Karate Tournament. Kreese, however, brings back former Cobra Kai co-founder Terry Silver (from The Karate Kid Part III), who proves to be a more dangerous and underhanded enemy than Kreese himself.</p><p>The fifth season continue Daniel and Johnny's efforts, with help from Chozen Toguchi (from The Karate Kid Part II), to bring down Cobra Kai, which is now run by Silver (following a cheated victory at the All-Valley Karate Tournament and Kreese being framed by him for attempted murder) and later joined by fellow sensei Kim Da-Eun, a descendant of the original Cobra Kai philosophy. Daniel's former rival Mike Barnes and Amanda's cousin Jessica Andrews (both from The Karate Kid Part III) return in this season.</p><p>The upcoming sixth and final season is set in the fall of 2019.</p><br/><h3>Cast and characters</h3><h4>Main cast</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\" rowspan=\"2\">Character</th><th scope=\"col\" rowspan=\"2\">Actor</th><th scope=\"col\" colspan=\"5\">Seasons</th></tr><tr><th width=\"10%\"><span>1</span></th><th width=\"10%\"><span>2</span></th><th width=\"10%\"><span>3</span></th><th width=\"10%\"><span>4</span></th><th width=\"10%\"><span>5</span></th></tr><tr><th scope=\"row\"><span>Daniel LaRusso</span></th><td><span>Ralph Macchio</span></td><td colspan=\"5\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><th scope=\"row\"><span>Johnny Lawrence</span></th><td><span>William Zabka</span></td><td colspan=\"5\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\"><span class=\"mw-redirect\">Amanda LaRusso</span></th><td><span>Courtney Henggeler</span></td><td colspan=\"5\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\"><span class=\"mw-redirect\">Miguel Diaz</span></th><td><span>Xolo Maridueña</span></td><td colspan=\"5\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\"><span class=\"mw-redirect\">Robby Keene</span></th><td><span>Tanner Buchanan</span></td><td colspan=\"5\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\"><span class=\"mw-redirect\">Samantha LaRusso</span></th><td><span>Mary Mouser</span></td><td colspan=\"5\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\"><span class=\"mw-redirect\">Eli \"Hawk\" Moskowitz</span></th><td><span>Jacob Bertrand</span></td><td style=\"background: #FFE3E3; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Recurring</span></td><td colspan=\"4\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\"><span class=\"mw-redirect\">Demetri Alexopoulos</span></th><td>Gianni DeCenzo</td><td style=\"background: #FFE3E3; vertical-align: middle; text-align: center;\" class=\"table-cast\">Recurring</td><td colspan=\"3\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td><td style=\"background: #FFE3E3; vertical-align: middle; text-align: center;\" class=\"table-cast\">Recurring</td></tr><tr><th scope=\"row\"><span>John Kreese</span></th><td><span>Martin Kove</span></td><td style=\"background: #DEF; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Guest</span></td><td colspan=\"4\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\"><span class=\"mw-redirect\">Tory Nichols</span></th><td><span>Peyton List</span></td><td style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td><td colspan=\"2\" style=\"background: #FFE3E3; vertical-align: middle; text-align: center;\" class=\"table-cast\">Recurring</td><td colspan=\"2\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\"><span class=\"mw-redirect\">Carmen Diaz</span></th><td><span>Vanessa Rubio</span></td><td colspan=\"3\" style=\"background: #FFE3E3; vertical-align: middle; text-align: center;\" class=\"table-cast\">Recurring</td><td colspan=\"2\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\"><span>Terry Silver</span></th><td><span>Thomas Ian Griffith</span></td><td colspan=\"3\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td><td colspan=\"2\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr><tr><th scope=\"row\"><span class=\"mw-redirect\">Kenny Payne</span></th><td><span>Dallas Dupree Young</span></td><td colspan=\"3\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td><td style=\"background: #FFE3E3; vertical-align: middle; text-align: center;\" class=\"table-cast\">Recurring</td><td style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Main</td></tr></tbody></table><h4>Supporting cast</h4><ul><li>Joe Seo as Kyler Park (recurring, seasons 1, 3–5)</li><li>Annalisa Cochrane as Yasmine (recurring, seasons 1, 3; guest seasons 4–5)</li><li>Bo Mitchell as Brucks (recurring, season 1; guest season 3)</li><li>Bret Ernst as Louie LaRusso Jr. (recurring, seasons 1, 3; guest seasons 4–5)</li><li>Hannah Kepple as Moon (recurring, seasons 1–4; guest, season 5)</li><li>Dan Ahdoot as Anoush Norouzi (recurring, seasons 1–3; guest, seasons 4–5)</li><li>Vas Sanchez as Nestor (recurring, season 2; guest, seasons 1, 4)</li><li>Susan Gallagher as Homeless Lynn (recurring, season 1; guest, seasons 2–4)</li><li>Griffin Santopietro as Anthony LaRusso (recurring, seasons 1, 4–5; guest, seasons 2–3)</li><li>Nichole Brown as Aisha Robinson (recurring, seasons 1–2; guest, season 4)</li><li>Rose Bianco as Rosa Diaz (recurring, seasons 1–2, 4; guest, seasons 3, 5)</li><li>Terayle Hill as Trey (recurring, season 1; guest, seasons 2–3)</li><li>Jeff Kaplan as Cruz (recurring, season 1; guest, seasons 2–3)</li><li>Owen Morgan as Bert (recurring, seasons 1–5)</li><li>Ed Asner as Sid Weinberg (guest, seasons 1, 3)</li><li>Erin Bradley Dangar as Counselor Blatt (guest, seasons 1, 3–4)</li><li>David Shatraw as Tom Cole (guest, seasons 1, 3)</li><li>Diora Baird as Shannon Keene (guest, seasons 1–5)</li><li>Ken Davitian as Armand Zarkarian (guest, seasons 1–3)</li><li>Candace Moon as Laura Lawrence (guest, seasons 1, 4)</li><li>Randee Heller as Lucille LaRusso (guest, seasons 1–2, 4)</li><li>Paul Walter Hauser as Raymond \"Stingray\" Porter (recurring, seasons 2, 5; guest, season 4)</li><li>Aedin Mincks as Mitch (recurring, seasons 2–5)</li><li>Khalil Everage as Chris (recurring, seasons 2–5)</li><li>Nathaniel Oh as Nathaniel (recurring, seasons 2–5)</li><li>Selah Austria as Piper Elswith (recurring, season 4; guest, season 2)</li><li>Kim Fields as Sandra Robinson (guest, season 2)</li><li>Ron Thomas as Bobby Brown (guest, seasons 2–3)</li><li>Rob Garrison as Tommy (guest, season 2)</li><li>Tony O'Dell as Jimmy (guest, season 2)</li><li>Okea Eme-Akwari as Shawn Payne (recurring, season 3; guest, season 4)</li><li>Yuji Okumoto as Chozen Toguchi (recurring, season 5; guest, seasons 3–4)</li><li>Dee Snider as Himself (guest, season 3)</li><li>Tamlyn Tomita as Kumiko (guest, season 3)</li><li>Traci Toguchi as Yuna (guest, season 3)</li><li>Terry Serpico as Captain George Turner (guest, seasons 3, 5)</li><li>Seth Kemp as Ponytail (guest, season 3)</li><li>Elisabeth Shue as Ali Mills (guest, season 3)</li><li>Brock Duncan as Zack Thompson (recurring, season 4)</li><li>Milena Rivero as Lia Cabrera (recurring, season 4)</li><li>Oona O'Brien as Devon Lee (recurring, seasons 4–5)</li><li>Salome Azizi as Cheyenne Hamidi (guest, season 4)</li><li>Julia Macchio as Vanessa LaRusso (guest, seasons 4–5)</li><li>Carrie Underwood as Herself (guest, season 4)</li><li>Alicia Hannah-Kim as Kim Da-Eun (recurring, season 5)</li><li>Owen Harn as Gabriel (recurring, season 5)</li><li>Luis Roberto Guzmán as Hector Salazar (guest, season 5)</li><li>Sean Kanan as Mike Barnes (guest, season 5)</li><li>Robyn Lively as Jessica Andrews (guest, season 5)</li><li>Sunny Mabrey as Lizzie-Anne (guest, season 5)</li><li>Tracey Bonner as Dr. Emily Folsom (guest, season 5)</li><li>Carsten Norgaard as Gunther Braun (guest, season 5)</li><li>Tyron Woodley as Sensei Odell/K.O. (guest, season 5)</li><li>Stephen Thompson as Sensei Morozov (uncredited, season 5)</li></ul><h4>Archival footage</h4><p>The following characters only appear via archival footage from the film series:</p><ul><li>Pat Morita as Mr. Miyagi</li><li>Danny Kamekona as Sato Toguchi</li><li>Nobu McCarthy as Yukie</li><li>Chad McQueen as Dutch</li><li>Israel Juarbe as Freddy Fernandez</li><li>Jonathan Avildsen as Snake</li><li>Christopher Paul Ford as Dennis</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"1\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"1\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally released</th><th scope=\"col\" rowspan=\"1\" style=\"padding:0 8px\">Network</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">May 2, 2018</td><td rowspan=\"1\"><span class=\"mw-redirect\">YouTube Red</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">April 24, 2019</td><td rowspan=\"1\"><span>YouTube Premium</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">January 1, 2021</td><td rowspan=\"3\"><span>Netflix</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">December 31, 2021</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">September 9, 2022</td></tr></tbody></table><br/><h3>Production</h3><p>The thematic genesis for Cobra Kai began with a few works of pop culture. First, the 2007 music video for the song \"Sweep the Leg\" by No More Kings stars William Zabka (who also directed the video) as a caricature of himself as Johnny, and features references to The Karate Kid, including cameo appearances by Zabka's former Karate Kid co-stars. In a 2010 interview, Zabka jokingly discussed this video in the context of his vision that Johnny was the true hero of the film. Next in June 2010, Macchio appeared in Funny or Die's online short, \"Wax On, F*ck Off\", in which his loved ones stage an intervention to turn the former child star from a well-adjusted family man into an addict besieged with tabloid scandal in order to help his career (with frequent references to The Karate Kid). A recurring joke in the sketch is that Macchio is confused for an adolescent. The short was lauded by TV Guide's Bruce Fretts, who referred to the video as \"sidesplitting\" and \"comic gold\". Finally, in 2013, Macchio and Zabka made guest appearances as themselves in the television sitcom How I Met Your Mother (\"The Bro Mitzvah\"). In the episode, Macchio is invited to Barney Stinson's bachelor party, leading to Barney shouting that he hates Macchio and that Johnny was the real hero of The Karate Kid. Towards the end of the episode, a clown in the party wipes off his makeup and reveals himself as Zabka. This influenced the launch of Cobra Kai, which gives a balanced perspective for Johnny, Daniel, and other characters. Zabka continued to be a recurring character throughout the ninth season of the show.</p><h4>Development</h4><p>Cobra Kai was greenlit in August 2017, with ten half-hour episodes, written and executive produced by Josh Heald, Jon Hurwitz, and Hayden Schlossberg. Although the series received offers from Netflix, Amazon, Hulu, and AMC, it ultimately ended up on the subscription service YouTube Red. The trio was joined by executive producers James Lassiter and Caleeb Pinkett of Overbrook Entertainment in association with Sony Pictures Television. YouTube Premium released the first season on May 2, 2018, and the second season on April 24, 2019. The creators of the series explored moving to another platform ahead of the season two premiere, but the deal did not go through.</p><p>The third season was produced for YouTube and was initially set for a 2020 release, but in May 2020, the series left YouTube and moved to another streaming platform, ahead of its third-season premiere. As YouTube was not interested in renewing the series for a fourth season, the producers wanted to find a streaming venue that would leave that option open. The show moved to Netflix in June, taking the third season with them. Netflix released the first two seasons from YouTube on August 28, 2020, and the new third season on January 1, 2021. A fourth season was renewed, prior to season 3 being released, and was released on December 31, 2021. The fifth season premiered on September 9, 2022. In January 2023, the series was renewed for a sixth and final season.</p><h4>Miyagi-verse</h4><p>Characters from the original four films The Karate Kid (1984), The Karate Kid Part II (1986), The Karate Kid Part III (1989), The Next Karate Kid (1994) comprise the Miyagi-verse that shapes Cobra Kai. Thus, after the launch of season 1, Elisabeth Shue (Ali Mills) from The Karate Kid, Tamlyn Tomita (Kumiko) and Yuji Okumoto (Chozen Toguchi) from The Karate Kid II, and Robyn Lively (Jessica Andrews), Thomas Ian Griffith (Terry Silver), and Sean Kanan (Mike Barnes) from The Karate Kid III, all discussed their interest in the series.</p><p>Since 2019, there has been a discussion about the potential involvement of Hilary Swank (Julie Pierce, The Next Karate Kid) in Cobra Kai. When asked about her involvement, she said that it would be a chance to have a \"showdown\" with Ralph Macchio. In 2020, the writers added that they spoke about every character appearing in the Miyagi-verse, including Julie Pierce, but they were not sure whether she will return or not in the franchise. Later in 2022, when again asked about her potential involvement, Swank stated that she is \"not in Cobra Kai, no one's asked me to be in Cobra Kai...no one's called me!...but it's so funny, isn't it, that's the one thing I get asked the most and no one's called me?\" A few weeks later, Ralph Macchio responded to questions about her comments by stating that \"most of this rests on Jon (Hurwitz), Josh (Heald), and Hayden (Schlossberg) who create the show, and the writing staff. And we're always very collaborative and we always talk through things. They are great listeners and that's why, like I said, they care, and I care. So, I think that's why everything's working. I think there's certainly room in the Miyagi-verse...You would imagine that Julie Pierce and Daniel LaRusso knew each other even though we don't have those scenes and I'm not a part of that specific film. These guys just amaze me all the time with what they're able to create, and the fact that they just don't create it for fan service. They really create stories that work and enhance characters. And then the fact that it's fan service as well is why I think it's working on all cylinders. So, there's my long answer to the short question that I really don't know, but I expect if there's an opportunity it will be taken up on.\"</p><p>Jon Hurwitz has also clarified that The Karate Kid animated series is not part of the Miyagi-verse canon, but an Easter egg from it appears in the season 3, in response to the question about its status within the Karate Kid franchise. The Easter egg was the Miyagi-Do shrine, briefly seen at Chozen Toguchi's dojo in Okinawa halfway through the season. The artifacts were recovered by Daniel LaRusso and Mister Miyagi in the short-lived Karate Kid animated series, which ran for thirteen episodes in 1989. Furthermore, the writers have also said that they will not be using characters from the 2010 film The Karate Kid, as they are not a part of the \"Miyagi-verse\": \"We've ruled that out completely. Jackie Chan is mentioned in season 1 of the show as an actor, so I think in our world, Jackie Chan is an actor and a performer. If the characters on our show have seen a movie called The Karate Kid, they've seen that one.\"</p><h4>Casting</h4><p>In season 1, Ralph Macchio and William Zabka reprised their respective Karate Kid roles of Daniel LaRusso and Johnny Lawrence. Additional Karate Kid actors included Randee Heller, who reprised her role as Lucille LaRusso (Daniel's mother), and Martin Kove, who revived his role as John Kreese. The cast list for season 1 included Xolo Maridueña, Mary Mouser, Tanner Buchanan, and Courtney Henggeler. Ed Asner was cast in a guest role as Johnny's verbally abusive step-father, Sid Weinberg. Vanessa Rubio joined the cast as Miguel's mother.</p><p>In season 2, Ralph Macchio, William Zabka, Xolo Mariduena, Tanner Buchanan, Mary Mouser, and Courtney Henggeler all returned, with Jacob Bertrand, Gianni DeCenzo, and Martin Kove being promoted to series regulars and newcomers Paul Walter Hauser and Peyton List joining the cast. Actors from The Karate Kid, Rob Garrison (Tommy), Ron Thomas (Bobby), Tony O'Dell (Jimmy), and Randee Heller (Lucille LaRusso) made guest appearances during this season.</p><p>In season 3, Ralph Macchio, William Zabka, Xolo Mariduena, Tanner Buchanan, Mary Mouser, and Courtney Henggeler all returned. Actors from The Karate Kid and The Karate Kid II, Elisabeth Shue (Ali Mills), Ron Thomas (Bobby), Tamlyn Tomita (Kumiko), Traci Toguchi (Yuna), and Yuji Okumoto (Chozen Toguchi) all made guest appearances during this season.</p><p>In season 4, Vanessa Rubio and Peyton List were promoted to series regulars, while Dallas Dupree Young and Oona O'Brien were cast in recurring roles. In addition, Thomas Ian Griffith reprised his role as Terry Silver from The Karate Kid III, and actors from The Karate Kid and The Karate Kid II, Yuji Okumoto (Chozen Toguchi) and Randee Heller (Lucille LaRusso), made guest appearances.</p><p>In season 5, Yuji Okumoto had a recurring role as Chozen Toguchi. In addition, Sean Kanan reprised his role as Mike Barnes and Robyn Lively reprised her role as Jessica Andrews from The Karate Kid III. Alicia Hannah-Kim also joined the cast as Kim Da-Eun. Dallas Dupree Young, who joined the show in season four as Kenny Payne, was upgraded to a series regular.</p><h4>Filming</h4><p>Principal photography for the first season began in October 2017 in Atlanta, Georgia. Filming took place at various locations throughout that month at places including Union City, Marietta, and the Briarcliff Campus of Emory University. In November, shooting moved to locales such as the North Atlanta Soccer Association Tophat fields in East Cobb. In December, the production was working out of Marietta and Conyers. Various exterior shots were also filmed in parts of Los Angeles such as Tarzana and Encino. Exterior locations included Golf N' Stuff in Norwalk and the South Seas Apartments in Reseda, both of which were originally featured in The Karate Kid.</p><p>Principal photography for the second season began in September 2018 in Atlanta, Georgia. In October, production continued around Atlanta with shooting also occurring in Marietta. In November, the series was filming in Union City. In December, shooting transpired at the closed Rio Bravo Cantina restaurant in Atlanta.</p><p>Principal photography for the fourth season began in February 2021 and ended in April in Atlanta, Georgia.</p><p>Filming for the fifth season began in September 2021 and finished in December. Like previous seasons, parts were filmed in Atlanta, Georgia, Marietta, Georgia and Los Angeles, California. The Mexico scenes were filmed in Puerto Rico on a two-day filming block, just like the two-day filming block of Okinawa, Japan and the Tokyo Metropolitan Government Building in Tokyo, Japan for the third season.</p><br/><h3>Release</h3><h4>Marketing</h4><p>The series was promoted at the annual Television Critics Association's winter press tour held in January 2018, when YouTube's global head of original content Susanne Daniels described the show: \"It is a half an hour format but I would call it a dramedy. I think it leans into the tone of the movies in that there are dramatic moments throughout. I think it's very faithful really in some ways to what the movie set about doing, the lessons imparted in the movie if you will. It's next generation Karate Kid.\"</p><p>Several trailers for the show were released from February to March, before the premiere date was revealed to be May 2.</p><p>YouTube Premium released a six-minute commercial parodying ESPN's 30 for 30 in April 2019, featuring the main cast members and select ESPN personalities analyzing the 1984 match between Daniel and Johnny. It was nominated for a Clio Award.</p><h4>Premiere</h4><p>The series held its world premiere on April 24, 2018, at the SVA Theatre in New York City, New York, during the annual Tribeca Film Festival. Following the screening, a discussion was held with writers, directors, and executive producers Hayden Schlossberg, Jon Hurwitz, and Josh Heald, in addition to series stars and co-executive producers William Zabka and Ralph Macchio.</p><p>YouTube partnered with Fathom Events for special screenings of the first two episodes of the series at around 700 movie theaters across the United States. The event also included a screening of the original film.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>All five seasons of Cobra Kai have received positive critical reviews. At the review aggregator website Rotten Tomatoes, the entire series received a 95% approval rating. On Metacritic, which uses a weighted average, the series holds an average rating of 71 out of 100.</p><p>The first season had a positive response from critics. At Rotten Tomatoes, it holds a 100% approval rating, with an average score of 7.5 out of 10 based on 49 reviews. The website's critical consensus reads: \"Cobra Kai continues the Karate Kid franchise with a blend of pleasantly corny nostalgia and teen angst, elevated by a cast of well-written characters.\" Cobra Kai was 2018's best-reviewed TV drama on Rotten Tomatoes. Metacritic assigned the season a score of 72 out of 100 based on 11 critics, indicating \"generally favorable reviews\".</p><p>The second season had a positive response from critics. At the review aggregator website Rotten Tomatoes, it holds an 90% approval rating with an average score of 7.4 out of 10, based on 31 reviews. Its critical consensus reads: \"While Cobra Kai's subversive kick no longer carries the same gleeful impact of its inaugural season, its second round is still among the best around – no amount of mid-life crisis and teenage ennui's ever gonna keep it down.\" Metacritic's weighted average assigned the second season a score of 66 out of 100, based on seven critics, indicating \"generally favorable reviews\".</p><p>The third season of the series had a positive response from critics. At the review aggregator website Rotten Tomatoes, it holds an 90% approval rating, with an average score of 8 out of 10 based on 51 reviews. The website's critical consensus reads: \"By pairing its emotional punches with stronger humor, Cobra Kai's third season finds itself in fine fighting form.\" On Metacritic with its weighted average, assigned a score of 72 out of 100, based on 15 critics, indicating \"generally favorable reviews\".</p><p>The fourth season had a positive response from critics. It received a 95% Rotten Tomatoes approval rating, with an average score of 7.9 out of 10 based on 37 reviews. The website's critical consensus reads: \"Cobra Kai still delights in a fourth season that mines great fun from shifting alliances, chiefly the uneasy truce between Johnny Lawrence and Daniel LaRusso.\" Metacritic's weighted average assigned the fourth season a score of 70 out of 100, based on eight critics, indicating \"generally favorable reviews\".</p><p>The fifth season had a positive response from critics. It received a Rotten Tomatoes approval rating of 98%, with an average rating of 8 out of 10 based on 44 reviews. The site's critical consensus reads: \"Deftly managing an expanded roster of punchy personalities, Cobra Kai graduates to a black belt proficiency in heartfelt melodrama and sly humor.\" On Metacritic, it received a weighted score of 78 out of 100, based on seven critics, indicating \"generally favorable reviews\".</p><h4>Viewership</h4><h4>YouTube</h4><p>The first episode, which was posted on YouTube for free along with episode two, had been viewed 5.4 million times within the first 24 hours. While it was noted that the response had been, in part, a result of YouTube releasing the episode for free, it was noted by Cinema Blend's Britt Lawrence that YouTube Red's new series debuted to numbers that made rival streaming services take notice. By October 30, 2018, ahead of the second-season premiere, YouTube was promoting the report that the first episode had then been viewed over 50 million times. The first episode was No. 8 on YouTube's list of ten top-trending videos of 2018.</p><p>According to market research company Parrot Analytics, the first season of Cobra Kai was the world's most in-demand streaming television show during May 2018. Parrot Analytics later reported that the second season of Cobra Kai was the world's most in-demand digital television show during April and through May 2019. As of September 2020, the season 1 premiere has over 90 million views, and the season 2 premiere has over 86 million views.</p><h4>Netflix</h4><p>After the series moved to Netflix in August 2020, season 1 and season 2 of Cobra Kai became the most-watched series on the platform. It was the most-watched show on streaming media in the United States between August 29 and September 6, according to Nielsen ratings. During the week, the show's 20 episodes drew nearly 2.2 billion streaming minutes in the United States. The first season was watched on Netflix by 50 million member households in its first four weeks, making Cobra Kai the most-streamed show on Netflix during the month of September 2020.</p><p>In February 2021, after the release of season 3, Forbes announced that it \"kicked off 2021 as one of most viewed original series on a streaming platform\". During the period of December 28, 2020 – January 3, 2021, it came in \"second only to Netflix's Bridgerton\", with over 2.6 billion viewing minutes. Cobra Kai then moved to first place during the period of January 4–10, 2021. Critics also offered cultural commentary in response to season three. Jen Yamato of Los Angeles Times stated that by the end of season three, there are three white men at the center of Cobra Kai, a franchise rooted in and deeply indebted to Eastern tradition. Gustavo Arellano of Los Angeles Times suggested that Cobra Kai offers a \"way forward for all of us during these tumultuous times\", as he saw this uplifting season 3 finale the weekend before the Jan. 6 U.S. Capitol invasion. The Hollywood Reporter, former NBA champion and student of martial arts Kareem Abdul-Jabbar suggested that his friend and teacher, the late Bruce Lee, was linked to the influence of the original Karate Kid films. Finally, Albert Wu and Michelle Kuo of the Los Angeles Review of Books argued that while the original Karate Kid \"film functioned as a post-Vietnam critique of American empire, staking its position explicitly: pacifism over violence, peace over war, an admittedly romanticized version of Eastern wisdom over the macho bravado of jock culture\", Cobra Kai \"models\" the \"unending appeal\" of the \"American Empire\".</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption></caption><tbody><tr><th scope=\"col\">Year</th><th scope=\"col\">Award</th><th scope=\"col\">Category</th><th scope=\"col\">Nominee(s)</th><th scope=\"col\">Result</th><th scope=\"col\" class=\"unsortable\"><abbr title=\"Reference\">Ref.</abbr></th></tr><tr><td rowspan=\"4\" align=\"center\">2018</td><td rowspan=\"2\" align=\"center\"><span>Teen Choice Awards</span></td><td>Choice Summer TV Show</td><td><i>Cobra Kai</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\" align=\"center\"></td></tr><tr><td>Choice Summer TV Star</td><td>Xolo Maridueña</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\"><span>Imagen Awards</span></td><td>Best Young Actor – Television</td><td>Xolo Maridueña</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Stunt Coordination for a Comedy Series or Variety Program</span></td><td>Hiro Koda</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"4\" align=\"center\">2019</td><td align=\"center\"><span>Shorty Awards</span></td><td>Best Web Series</td><td><i>Cobra Kai</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Stunt Coordination for a Comedy Series or Variety Program</span></td><td>Hiro Koda</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Teen Choice Awards</span></td><td>Choice Summer TV Show</td><td><i>Cobra Kai</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Clio Awards</span></td><td>Television/Streaming: Social Media-<span>30 for 30</span></td><td><i>Cobra Kai</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"13\" align=\"center\">2021</td><td align=\"center\"><span>Nickelodeon Kids' Choice Awards</span></td><td>Favorite Family TV Show</td><td><i>Cobra Kai</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"3\" align=\"center\"><span>MTV Movie &amp; TV Awards</span></td><td><span>Best Show</span></td><td><i>Cobra Kai</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\" align=\"center\"></td></tr><tr><td><span>Best Fight</span></td><td>\"Finale House Fight\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Musical Moment</span></td><td>\"I Wanna Rock\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\"><span>Screen Actors Guild Awards</span></td><td><span>Outstanding Performance by a Stunt Ensemble in a Comedy or Drama Series</span></td><td><i>Cobra Kai</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Hollywood Critics Association TV Awards</span></td><td>Best Streaming Series, Comedy</td><td><i>Cobra Kai</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Primetime Emmy Awards</span></td><td><span>Outstanding Comedy Series</span></td><td><span>Hayden Schlossberg</span>, <span>Jon Hurwitz</span>, Josh Heald, Caleeb Pinkett, Susan Ekins, <span>James Lassiter</span>, <span>Will Smith</span>, <span>Ralph Macchio</span>, <span>William Zabka</span>, Luan Thomas, Joe Piarulli, Michael Jonathan Smith, Stacey Harman, Bob Dearden and Bob Wilson</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\" align=\"center\"> <br> </td></tr><tr><td rowspan=\"3\" align=\"center\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Sound Editing for a Comedy or Drama Series (Half-Hour) and Animation</span></td><td>Patrick Hogan, Jesse Pomeroy, Daniel Salas, Ryne Gierke, AJ Shapiro, Andres Locsey, Shane Bruce and Mitchell Kohen <span style=\"font-size:85%;\">(for \"December 19\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Sound Mixing for a Comedy or Drama Series (Half-Hour) and Animation</span></td><td>Joe DeAngelis, Chris Carpenter, Mike Filosa and Phil McGowan <span style=\"font-size:85%;\">(for \"December 19\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Stunt Performance</span></td><td>Jahnel Curfman, Julia Maggio, John Cihangir and Marc Canonizado <span style=\"font-size:85%;\">(for \"December 19\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\" align=\"center\"><span>People's Choice Awards</span></td><td>The Show of 2021</td><td rowspan=\"3\"><i>Cobra Kai</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\" align=\"center\"></td></tr><tr><td>The Drama Show of 2021</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>The Bingeworthy Show of 2021</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"6\" align=\"center\">2022</td><td align=\"center\"><span>Screen Actors Guild Awards</span></td><td><span>Outstanding Performance by a Stunt Ensemble in a Comedy or Drama Series</span></td><td><i>Cobra Kai</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>Nickelodeon Kids' Choice Awards</span></td><td>Favorite Family TV Show</td><td><i>Cobra Kai</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td align=\"center\"><span>People's Choice Awards</span></td><td>The Drama Show of 2022</td><td><i>Cobra Kai</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"2\" align=\"center\"><span>Primetime Creative Arts Emmy Awards</span></td><td>Outstanding Sound Editing for a Comedy or Drama Series (Half-Hour) and Animation</td><td>Patrick Hogan, Daniel Salas, Jesse Pomeroy, Gary DeLeone, Nick Papalia, Andres Locsey, and Mitchell Cohen <small>(for \"The Rise)</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\" align=\"center\"></td></tr><tr><td><span>Outstanding Stunt Coordination for a Comedy Series or Variety Program</span></td><td>Ken Barefield</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td align=\"center\"><span>Saturn Awards</span></td><td><span>Best Action/Adventure Television Series (Streaming)</span></td><td><i>Cobra Kai</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"3\" align=\"center\">2023</td><td rowspan=\"3\" align=\"center\"><span>Critics' Choice Super Awards</span></td><td><span>Best Action Series</span></td><td><i>Cobra Kai</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"3\"></td></tr><tr><td>Best Actor in an Action Series, Limited Series or Made-for-TV Movie</td><td><span>Ralph Macchio</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Actor in a Horror Series, Limited Series or Made-for-TV Movie</td><td><span>William Zabka</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><br/><h3>Home media</h3><p>During the show's time on YouTube Red, Cobra Kai was not released on DVD, but once the show made its move to Netflix, Sony Pictures released the first and second seasons in a \"Collector's Edition\" DVD set on November 24, 2020 in the United States. In 2022, Sony Pictures released the third season in January and the fourth in September, both in the United States.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th rowspan=\"2\">Season</th><th colspan=\"4\">Release date</th></tr><tr><th><span>Region 1</span></th><th><span>Region 2</span>/<span class=\"mw-redirect\">B</span></th><th><span>Region 2</span>/<span class=\"mw-redirect\">B</span><br><span style=\"font-size:85%;\">(Germany)</span></th><th><span>Region 4</span>/<span class=\"mw-redirect\">B</span></th></tr><tr><td><b>1 &amp; 2</b></td><td bgcolor=\"#DED\">November 24, 2020</td><td bgcolor=\"#FAFAD2\">May 4, 2020 <span style=\"font-size:85%;\">(DVD)</span><hr> December 21, 2020 <span style=\"font-size:85%;\">(Blu-ray)</span></td><td bgcolor=\"#DEF\">January 14, 2022 <abbr title=\"Limited Edition\">(LE)</abbr></td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">No release</td></tr><tr><td><b>1</b></td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">No release</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">No release</td><td bgcolor=\"#FAFAD2\">December 17, 2020</td><td bgcolor=\"#FAFAD2\">August 14, 2019</td></tr><tr><td><b>2</b></td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">No release</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">No release</td><td bgcolor=\"#FAFAD2\">December 17, 2020</td><td bgcolor=\"#DED\">May 7, 2020</td></tr><tr><td><b>3</b></td><td bgcolor=\"#DED\">January 11, 2022</td><td bgcolor=\"#FAFAD2\">January 17, 2022</td><td bgcolor=\"#DEF\">July 10, 2022 <abbr title=\"Limited Edition\">(LE)</abbr></td><td bgcolor=\"#DED\">January 12, 2022</td></tr><tr><td><b>4</b></td><td bgcolor=\"#DED\">September 13, 2022</td><td bgcolor=\"#FAFAD2\">October 17, 2022</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBA</td><td bgcolor=\"#DED\">November 9, 2022</td></tr></tbody></table><br/><h3>Soundtracks</h3><h4>Cobra Kai: Wax Off – EP</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color:  #F4BF92; font-size: 125%;\">Cobra Kai: Wax Off – EP</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color:  #F4BF92\"><span>EP</span> by <div class=\"contributor\" style=\"display:inline\"><span>Leo Birenberg</span><br>&amp; Zach Robinson</div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">July 23, 2021</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span>Soundtrack</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"min\">13</span>:<span class=\"s\">45</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\"><span>Madison Gate Records</span></td></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color:  #F4BF92\"><span>Leo Birenberg</span><br>&amp; Zach Robinson chronology</th></tr><tr><td colspan=\"2\" class=\"infobox-full-data\"><table style=\"background: transparent; width: 100%; min-width: 100%; border-collapse: collapse; display: inline-table;\"><tbody><tr style=\"line-height: 1.4em;\"><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em .1em .2em 0\"><i><span>Cobra Kai: Season 3 (Soundtrack from the Netflix Original Series)</span></i><br>(2021)</td><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em .1em\"><i><b>Cobra Kai: Wax Off – EP</b></i><br>(2021)</td><td style=\"width: 33%; text-align: center; vertical-align: top; padding: .2em 0 .2em .1em\"><i><span>Cobra Kai: Season 4, Vol. 1 \"All Valley Tournament 51\" (Soundtrack from the Netflix Original Series)</span></i><br>(2022)</td></tr></tbody></table></td></tr></tbody></table><p>Madison Gate Records released an extended play entitled Cobra Kai: Wax Off – EP on July 23, 2021, featuring extended versions of four previously released tracks from the first two seasons soundtracks.</p><h4>Track listing</h4><p>All music is composed by Leo Birenberg and Zach Robinson.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Quiver – Extended\"</td><td class=\"tracklist-length\">3:51</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Cobra Guy – Extended\"</td><td class=\"tracklist-length\">2:31</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"A Badass Name for a Dojo – Extended\"</td><td class=\"tracklist-length\">3:02</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Sam and Robby – Extended\"</td><td class=\"tracklist-length\">4:20</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"2\" scope=\"row\"><span>Total length:</span></th><td>13:45</td></tr></tbody></table><br/><h3>Video games</h3><p>Cobra Kai: The Karate Kid Saga Continues, a video game based on the series, was released for PlayStation 4, Xbox One, and Nintendo Switch on October 27, 2020, and for Microsoft Windows on January 5, 2021.</p><p>A mobile game entitled Cobra Kai: Card Fighter was released on March 19, 2021, on iOS and Android devices.</p><br/><h3>Book</h3><p>In 2022, Ralph Macchio published the memoir Waxing On: The Karate Kid and Me (Dutton), in which he reflects upon the making of and legacy of the Karate Kid films and Cobra Kai.</p><br/>"
  },
  "errorMessage": ""
}