{
  "imDbId": "tt1586680",
  "title": "Shameless",
  "fullTitle": "Shameless (TV Series 2011–2021)",
  "type": "TVSeries",
  "year": "2011",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8755998",
      "warningSpoilers": false,
      "date": "25 December 2022",
      "rate": "9",
      "helpful": "43 out of 45 found this helpful.",
      "title": "Loved This Show!",
      "content": "I absolutely loved Shameless. It's only been off the air for like a year and a half and I already miss it. I know it was time for it to end as the quality of the show was going down in the last season but I still miss it. It's about a the lives of a dysfunctional family and how they stick together no matter what, except for their father who only cares about himself. This entire cast is just about perfect. They are led by William H Macy (Frank), Emmy Rossum (Fiona) & Jeremy Allen White (Lip) who all give award worthy performances as does the rest of the cast. This is a show the you can definitely watch more than once so I plan on watching reruns in the future."
    },
    {
      "username": "Lukasmj",
      "userUrl": "https://www.imdb.com/user/ur158768880",
      "reviewLink": "https://www.imdb.com/review/rw8678396",
      "warningSpoilers": false,
      "date": "16 November 2022",
      "rate": "9",
      "helpful": "30 out of 32 found this helpful.",
      "title": "Loved the series. Hated the ending.",
      "content": "\"Shameless\" is a unique series that doesn't mince words.The characters in the series are brilliantly written and really grow on you over time, no matter what big jerks they are.The series is also incredibly funny, but also incredibly sad at times.In addition, two excellent actors were produced here with Cameron Monaghan and Jeremy Allen White, who both hopefully still have a huge career ahead of them.But the ending was unfortunately one of the worst I've ever seen and doesn't fit into the usual scheme of the series at all.Therefore unfortunately no 10 points.Nevertheless, it's definitely worth seeing if you feel like watching a longer series that you can get used to."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8101906",
      "warningSpoilers": false,
      "date": "29 April 2022",
      "rate": "9",
      "helpful": "44 out of 49 found this helpful.",
      "title": "I miss it!",
      "content": "I've loved Shameless ever since the beginning of Season 1 and now that it's over I really miss even though it was probably time for it to end! While it was still worth watching, it just wasn't the same once Emmy Rossum left. Shameless was such a great show for such a long time that it was hard to say goodbye...I miss it!"
    },
    {
      "username": "lakings97",
      "userUrl": "https://www.imdb.com/user/ur9679268",
      "reviewLink": "https://www.imdb.com/review/rw8760318",
      "warningSpoilers": true,
      "date": "27 December 2022",
      "rate": "9",
      "helpful": "27 out of 30 found this helpful.",
      "title": "My 2nd Favorite Family",
      "content": "Shameless is Showtime series that surrounds my 2nd favorite tv family the Gallaghers. It all starts with the absentee father Frank Gallagher played by William H Macy who has been nominated for various awards for his drug addict, alcoholic, no nonsense attitude. The eldest daughter, Fiona is played by Emma Rossum, who is left to care for her brothers and sisters at a young age. Fiona loves her family and she ends up much like her father and eventually heads out on her own after she was careless when Liam overdoses from cocaine. Lip Gallagher played by Jeremy Allen White, the smart one, is the first of his family to finish high school and get a full ride thru college. Of course things are never simple for them, they use any means necessary to make ends meet. Cameron Monaghan played Ian Gallagher, we find out he is a Gallagher with the same mother but from a different Gallagher father. Ian inherits his mom's bipolar disease along with his relationships with men especially the on and off feelings for Mickey Milkovich played by Noel Fisher. Emma Kenney played Debbie who is unsure of her sexuality and doesn't know what she wants. Ethan Cutkosky played Carl Gallagher and he wants to join the army but ends up being a cop. Steve Howey and Shanola Hampton play Kevin Ball and Veronica Fisher who are the Gallagher's neighbors and own a bar called The Alibi. The first few seasons the storyline is intriguing, they build up the characters. The latter seasons we see less story structure and more famous individuals to be part of the show like Courtney Cox, Joan Cusack, Dermot Mulroney, Sasha Alexander, Jake McDorman, Harry Hamlin, and Kathy Segal. The storyline captures every since of social imbalance from discrimination to drug abuse to sexuality. Every single subject was covered, even when society had not heard of or accepted those individuals who were either gay, bi, or they, them. Although the series ended with a few holes left unanswered mainly due to Covid, I sure hope some sort of sequel or continuation will be explored to bring the family full circle. The series is filled with filthy language, drugs and plenty of soft porn. This is one of the few shows I can watch over and over again, that's how much I love it."
    },
    {
      "username": "Nightmarelogic",
      "userUrl": "https://www.imdb.com/user/ur49080270",
      "reviewLink": "https://www.imdb.com/review/rw6805961",
      "warningSpoilers": true,
      "date": "12 April 2021",
      "rate": "7",
      "helpful": "30 out of 35 found this helpful.",
      "title": "Good show should have ended years ago",
      "content": "This is one of those shows that really did start out as a very good show but sort of lost its steam around the fifth season and definitely once Fiona left the show. Maybe when the kids were young the antics they pulled were still cute but as they aged the felonies they committed felt more like felonies. Or maybe it was that none of them ever was allowed to get ahead for long. Whatever small steps ahead they took always came back to bite them and not just set them back to zero but even lower then that. That kind of stories gets tiresome eventually.That all being said this is a decent drama/comedy/dramedy and worth watching. The acting is fantastic by everyone and it has o e of the longest and realistic gay storylines I have seen between Ian and Mickey. It also dabbled a lot with Debbie and her sexuality later in the series which is interesting to watch.If you haven't watched it yet watch at least the first four of five seasons. They are worth the time. The rest depends on your point of view and sensibilities."
    },
    {
      "username": "dv727",
      "userUrl": "https://www.imdb.com/user/ur8014551",
      "reviewLink": "https://www.imdb.com/review/rw5300742",
      "warningSpoilers": true,
      "date": "5 December 2019",
      "rate": "5",
      "helpful": "124 out of 153 found this helpful.",
      "title": "Time to say goodbye",
      "content": "There was a time when I would have given this show a 10 (or more if allowed.) That was then. Some reviews have been critical of the politics. I can't say I disagree, but I can tolerate those. The show has always been held out as a comedy. I did appreciate the humor, and a little bit of family love that went with it. It's just not funny any longer, and since the humor's gone, we're left with people who are just terrible individuals. It seems every time they strive to break out of the \"Gallagher trap,\" something will pull them back in. One has some smarts and a good heart, then gets pregnant, then overcomes it, then turns into a scheming snake. Another finds success in the military, only to be cast out and end up a criminal once again. One has an in to a private school, excels, and is done in by the usual \"father\" stupidity. Another is intelligent enough to get to college, but blows that. Any time you start to cheer for them, the reason is taken away. Macy is brilliant, but the exploits are predictable and no longer funny. Thanks for some good seasons, but I'm done."
    },
    {
      "username": "Deadlyknights",
      "userUrl": "https://www.imdb.com/user/ur158203343",
      "reviewLink": "https://www.imdb.com/review/rw8640962",
      "warningSpoilers": true,
      "date": "28 October 2022",
      "rate": "8",
      "helpful": "23 out of 25 found this helpful.",
      "title": "A Beautiful Mess",
      "content": "A beautiful mess of a show. Shameless is a comedic drama about a ghetto family on the south side of Chicago, trying to get by on the trials and tribulations of this modern world and being poor in a big city. With great main cast actors and a plethora of interesting supporting characters, you will never be boards watching this show.Calling this show a comedy doesn't give it justice as the directors and actors both create a depressing but weirdly wholesome atmosphere with a roller coaster of an emotional experience. Emmy Rossum (Fiona Gallagher) is such a perfect protagonist to spear head this show that she can drive the plot of an entire episode, pretty much solo. Jeremy Allen White (Philip Gallagher) is the perfect representation of a smart kid with a good heart and a bright future going down a very dark path that matches much with his father Frank Gallagher's (William H. Macy) current life. Frank Gallagher is a sporting alcoholic and drug abuser that spends much of his life trying to con people to help his own situation. He has a good heart but finds himself making the wrong decisions time after time again. These 3 character's are the main characters that drive most of the plot in it's direction. There's also younger brothers Ian Gallagher (Cameron Monaghan) and Carl Gallagher (Ethan Cutkosky) that get their own stories throughout the show and even show arcs dedicated to them. Neighbors across the street from the Gallagher's, Veronica Fisher (Shanola Hampton) and Kevin Ball (Steve Howey) mostly serve as the comic relief in the show but even they get interesting stories that affect the narrative.Now I know what you're all pointing to, the downfall of the show in seasons 9 through 11. And I couldn't agree more (for the most part). As time goes on and the show gets deeper and deeper into the plot. Most of all the character arcs are complete. Lip begins AA and struggles with his lifelong addiction and the ramifications of his past actions. Fiona finishes raising the kids and decides to leave the city (or the show) entirely as her arc was complete. Frank Gallagher gets into wilder and more crazy situations that have been told time and time again. And most of the supporting cast either becomes non factors or completely unlikeable A. K. A Debbie Gallagher (Emma Kenney), who becomes a plot device for the writers political ideologies. And Ian, who also in much the same vein becomes the same plot device. Carl, who does pretty much nothing past season 6, except showing us how weird and wacky he is. And Kev and V who become nothing but a wacky couple that do things completely out of character from their pre season 6 character designs. And for those reasons I cannot give this show anything more than an 8, and even that might be a bit of a stretch considering the show starts showing some decline even back in season 5.Does this show have flaws? 100%. The writing is not perfect by any means, even in it's strongest moments. But that doesn't mean it's not everything you would want from this kind of T. V show. For the most part the show sticks to it's core principles for a long while and it's a long but rewarding ride for 7 damn good seasons. Even if you want to say that the last few seasons have no redeeming qualities, that's just not true at all. Season 9 is still easily a decent season. And even 11 was pretty enjoyable. I have re-watched this show 6 times and I still love it just as much as the first few times I watched it. What can I say, it's a DAMN good T. V show."
    },
    {
      "username": "eliaselnaz",
      "userUrl": "https://www.imdb.com/user/ur159730421",
      "reviewLink": "https://www.imdb.com/review/rw8724915",
      "warningSpoilers": true,
      "date": "9 December 2022",
      "rate": "8",
      "helpful": "26 out of 26 found this helpful.",
      "title": "It sucks big time without Fiona",
      "content": "The series was impetuously ,breaking taboos for still many people in and out side USA. For me Ghallegers Comedy ,even with tragic, touching, moving moments was a way to escape from reality of my suffocating, oppressive regime and culture, but it was never as good as the first 9 or 10 seasons with Fiona Character. The beginning of 11th season was a turning point I'll never forget , filming like a documentary about history of Southside Chicago and how Ghallegers were a part of it, imaginary but very believable. However when Fiona character left the series the chemistry between the actors as a family having each other's back, no matter what ,disappeared and I think Fiona worth more credit than the credit given all to Frank. And the finale episode Frank's death while Ghallegers destiny was somehow still vague ,frustrated me, I think there could be a better ending to the series."
    },
    {
      "username": "UnmAsked_",
      "userUrl": "https://www.imdb.com/user/ur140465034",
      "reviewLink": "https://www.imdb.com/review/rw8415610",
      "warningSpoilers": false,
      "date": "8 August 2022",
      "rate": "9",
      "helpful": "28 out of 29 found this helpful.",
      "title": "Depressing masterpiece",
      "content": "The ONLY reason this isn't getting a 10/10 is because of how depressing the show is. Season 4 is a top 10 season of any show EVER.. a truly depressing masterpiece. But after that it was just.. depressing.. I can't watch the show without feeling exhausted and sad. Emmy Rossum has became one of my favorite actresses. She is Phenomenal. I want to be an actor.. and her character & her acting on this show is exactly why. So powerful."
    },
    {
      "username": "lp-27434",
      "userUrl": "https://www.imdb.com/user/ur106345116",
      "reviewLink": "https://www.imdb.com/review/rw5435564",
      "warningSpoilers": false,
      "date": "25 January 2020",
      "rate": "6",
      "helpful": "74 out of 93 found this helpful.",
      "title": "Time to pull the plug on this show",
      "content": "The first few seasons of Shameless was very entertaining and enjoyable, but it slowly lost its fire. By the end of season 9 I wasn't sure I wanted to watch season 10. Well after 2 episodes I couldn't handle it anymore. The writing is terrible and the characters suck. I know that several scenes were meant to be funny but there was no humor in the writing or the delivery.I agree that they write with a political agenda and it's not whether I agree or disagree but more importantly I tune into shows to escape from that BS. I wish Hollywood will learn that when a series becomes successful, follow the path that got them there and keep the political dialogue for the cable news stations.Good-bye Shameless."
    },
    {
      "username": "aideenbrady-37861",
      "userUrl": "https://www.imdb.com/user/ur97400626",
      "reviewLink": "https://www.imdb.com/review/rw8539437",
      "warningSpoilers": true,
      "date": "12 September 2022",
      "rate": "10",
      "helpful": "25 out of 26 found this helpful.",
      "title": "Just watched the last episode- spoiler alert ish",
      "content": "I have absolutely loved this show from season after season. Beautifully shot with endearing characters that you root for. Hating frank so many ways and and in so many episodes he is a stellar actor... it touches you on so many subjects in an epic way that I hope people learn from and adjust their views.William H Masey is an outstanding actor in the role and has proven what a powerful actor he is.The gay rights... relationship.. marriage with Micky and Ian were continuously motive and shows the ignorance of people in a brilliant wayI loved the last episode and am starting to watch it again!"
    },
    {
      "username": "cloudwithane",
      "userUrl": "https://www.imdb.com/user/ur158590526",
      "reviewLink": "https://www.imdb.com/review/rw8807324",
      "warningSpoilers": false,
      "date": "17 January 2023",
      "rate": "10",
      "helpful": "27 out of 27 found this helpful.",
      "title": "Comfort show",
      "content": "Picking up this show may as well have been the best decision i've made in my entire life. A show i wasn't expecting anything from turned out to be everything i was looking for. Interesting plot, brilliantly written characters that are neither good nor really \"bad\" people, tons of hilarious moments but also a good share of ones that would have you tearing up. Characters that no matter how much you despise are indispensable to the show. The relationships between them - the dynamics, all the hardships that they go through. This show is so much about finding the silver linings. All these characters are constantly facing with poverty - and the show does an amazing job at showing how hard it is to break out from it and from your roots.I took my sweet time watching this show. A year and a few months to finish it, which probably isn't a long time for 11 seasons... Not because i found some episodes boring, but because i wanted to savour these moments for as long as possible. I came back to it every once in a while, for me it is an extremely comforting show (maybe it's how the gallaghers function, their dynamic, everything), even though it does not lack moments that can make you cry.I would say i wish i can forget the show so i can watch it all over again, but i'd do it anyway, remember it or not."
    },
    {
      "username": "tomcheckke15",
      "userUrl": "https://www.imdb.com/user/ur154263749",
      "reviewLink": "https://www.imdb.com/review/rw8295768",
      "warningSpoilers": false,
      "date": "3 July 2022",
      "rate": "10",
      "helpful": "27 out of 28 found this helpful.",
      "title": "Real life issues with intelligent and funny humor and amazing acting.",
      "content": "My favorite thing about Shamless is the writing. You can tell the writers did their homework on what Southside Chicago life can look like. Phenomenal storytelling along with extremely talented actors creates 11 seasons worth binging. The character development, diverse and intersectional characters with personal and realistic plotlines is what makes this show legendary. The growth the cast goes through together over the years brings connection to the characters is on another level. Substance abuse, mental health struggles, addiction, poverty, generational trauma and the heart of family beautifully and authentically represented."
    },
    {
      "username": "rumiwomack",
      "userUrl": "https://www.imdb.com/user/ur154657392",
      "reviewLink": "https://www.imdb.com/review/rw8337792",
      "warningSpoilers": false,
      "date": "15 July 2022",
      "rate": "9",
      "helpful": "22 out of 24 found this helpful.",
      "title": "Great show, with memorable characters who stay with you",
      "content": "Shameless is an overall pretty great show. But I think it really only works if you watched it when it was still ongoing.One of the reasons why I loved it so much (beside the absolutely fantastic acting), is the characters.You got to watch all these characters grow and develop as people. Every character has a real depth to them, which is hard to come by. You got to see them through all the highs and lows with no sugarcoating to it. You got to see just raw and genuine emotion, which I think is quite hard to find.I have yet to find another tv show that has invested me as much as Shameless has. And I think that, that is why it's so special."
    },
    {
      "username": "rippajackson",
      "userUrl": "https://www.imdb.com/user/ur58216004",
      "reviewLink": "https://www.imdb.com/review/rw4660426",
      "warningSpoilers": false,
      "date": "16 February 2019",
      "rate": "10",
      "helpful": "40 out of 48 found this helpful.",
      "title": "Lost its sauce",
      "content": "I like many am an avid fan of shameless since it kicked off many years ago. I was never into comedy/drama's but this show changed that perspective within the first season. It took nearly 4 months to bring myself to watch season 9 due to the poor ratings and season 8 being abit plants aswell. The Irishman? What a bore, along with the whole gay thing, you just say to yourself, MOVE ON ALREADY! season 9 is how most are saying. Average at best. I only watched it as I was stuck for things to watch. There's maybe 2 good episodes. Needs alot of spice to get it back the how brilliant it used to be"
    },
    {
      "username": "agerson24",
      "userUrl": "https://www.imdb.com/user/ur30387395",
      "reviewLink": "https://www.imdb.com/review/rw4657278",
      "warningSpoilers": true,
      "date": "14 February 2019",
      "rate": "4",
      "helpful": "91 out of 119 found this helpful.",
      "title": "The writing has just gotten terrible",
      "content": "I used to love this show but the last few seasons just keep getting progressively worse.. I am literally forcing myself to sit through episodes now.. This whole Fiona storyline happened in season 4. It's been played out already and now they are just recycling bad storylines. And now since Ian left they are randomly making other family members gay? Lip used to be this genius who could outsmart everyone and scam the system and it's like the writers have forgotten that the last couple seasons. Like you can be a recovering addict and still be smart and cunning.. It's just not good anymore and I have no idea how it got renewed for another season. The acting is still incredible but the writing is horrible."
    },
    {
      "username": "ssih",
      "userUrl": "https://www.imdb.com/user/ur1826047",
      "reviewLink": "https://www.imdb.com/review/rw2421807",
      "warningSpoilers": false,
      "date": "29 April 2011",
      "rate": "10",
      "helpful": "268 out of 359 found this helpful.",
      "title": "I've seen both. The American is better. (But not by a lot)",
      "content": "I was halfway through the American series before I even KNEW there was a British series. I think a was a little disappointed that we didn't create it, but I was also happy that it was one of the few shows that we copied without ruining it. When I checked some of the user reviews, I was surprised to see how many thought the show to be appalling. OK, not everyone will share my love for the show, but to rate it SO badly? But when I looked, the author of nearly every bad review was a fan of the original show. This simply sounds like a case of liking what you know. \"I don't care how good their cooking is. It ain't as good as my Mom's!\"Once I finished the American series, I gave it about a month to settle in and then started watching the British series. But I'd like to think that I was objective enough to judge it on its on merits, and not simply that it's different than what I'm used to.Since, as many have pointed out, the script is nearly word-for-word identical, the difference lies mainly in how the actors portray the characters.So I'm going to give my character-by-character head-to-head appraisal of UK vs. US. I'm going to use the character names rather than the actors' names for simplicity. Starting from the youngest...Little Debbie: UK wins this one hands down. No contest. She steals every scene she's in. Who can not fall in love with this girl???Carl: This one's close, but the UK one is (at least in the first season) a little more deranged and fun to watch.Ian: Another close one, but this goes to UK, too. US Ian is somber and good looking, but UK Ian always seems a bit panicky, and the wide-angle closeups of his face make him look pretty bizarre. Lip: This is solidly with the US. I like US Lip's darkness. He seems more responsible and intelligent. UK Lip is just kind of impish and unsure. You can depend on US Lip and he offers some of the only real family support to Fiona.Kevin: Dead heat.Veronica: Very different performances by each, but in the end, I like them the same.Fiona: This was a difficult one to call, but I'm giving it to the US. And this is probably because I saw them first. I just like her better. Hard to put my finger on the reason.Frank: Sorry, UK, but I just don't like your Frank. I understand the character is usually drunk, but he seems that way even before he starts drinking. He seems clinically stupid. US Frank (Macy) is equally as obnoxious, entitled, selfish and deluded, but he only seems drunk when he's drunk. At other times, his pontificating is fun to listen to. You feel good about hating the guy, because he's like this by choice. With UK Frank, you have to pity him. I feel like I'm laughing at someone who's mentally challenged."
    },
    {
      "username": "tomdavie",
      "userUrl": "https://www.imdb.com/user/ur21963359",
      "reviewLink": "https://www.imdb.com/review/rw2402405",
      "warningSpoilers": false,
      "date": "21 March 2011",
      "rate": "10",
      "helpful": "306 out of 377 found this helpful.",
      "title": "Keep Watching",
      "content": "I have never watched the British version of this show so I cannot comment on the original. I was under the impression it was a new Showtime story. I have to admit that started watching because I have always been a fan of William H Macy. However, viewing Macy in this kind of role was startling . I had always seen him in more conventional-almost typecast - parts. I knew that Joan Cusak was a quality actress which lent the project some further credibility. At first the show seemed to be almost forced. The plot seemed bizarre, and unbelievable. It seemed awkward. Its quite common for shows to take time to develop chemistry when the actors haven't defined their characters yet. The same can be said for the writers. However, I had never seen anything like it. In that regard it was dynamic and worth the time. The young actors soon found their roles and by the 5th episode I found myself thinking about the show every day. Now I cant stop watching. Im addicted. The actors are fantastic. The plots are far more developed. The supporting players play a big part in the series, and new characters keep rotating in flawlessly. The show has evolved . And just for the record, Im getting really sick and tired of people trashing the show because in their minds it doesn't measure up to the original. Its not supposed to be the original. If you don't like it, stick with the British show."
    },
    {
      "username": "babyyygorilla",
      "userUrl": "https://www.imdb.com/user/ur149761675",
      "reviewLink": "https://www.imdb.com/review/rw8286822",
      "warningSpoilers": false,
      "date": "29 June 2022",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "WOW",
      "content": "I binged the series over the last week, I heard about the series before but I was never really interested in it ,I happened to come across a tik tok video of the series that made me laugh and decided I must watch it.The best decision I made.Amazing actors, each one of them touching.The script is original, funny and interesting, I felt it was hard for me to watch because sometimes the content was sensitive but at the same time it was also hard for me to stop watching.100 \\ 10. Seriously."
    },
    {
      "username": "skysaxon",
      "userUrl": "https://www.imdb.com/user/ur1024598",
      "reviewLink": "https://www.imdb.com/review/rw2375247",
      "warningSpoilers": false,
      "date": "25 January 2011",
      "rate": "8",
      "helpful": "93 out of 124 found this helpful.",
      "title": "Fluid direction, crisp script, helmed by trio of fine performances",
      "content": "Note: I have not seen the UK version.I wasn't sure what to make of the first episode of Shameless. I wasn't sold on the characters and the direction seemed directionless. In fact, it wasn't until the third ep that my eyes were opened. It's as if the actors have found their mark and the characters have come to life. While the ensemble cast is solid, and Macy is at his irascible best, it is the performance of three of the actors which makes Shameless something special. Emmy Rossum, as the 'adult' glue that holds the family together, has rightly received the most press. Her role requires a combination of strength, resolve, humour and vulnerability - qualities that would thwart a lesser actress. Rossum is able to convincingly bring it all together with fire and sexuality in addition to her other qualities. Equally effective in his role as the younger brother Lip, Jeremy Allen White brings a world-weary innocence to his character. Blessed with a malleable physiognomy, White is at once rascal and protector of the brood. White makes us want to know Lip better. That's rare.In a smaller role but probably my favourite is Emma Kenney as little sister Debbie. Her deadpan wisecracks supply the laugh-out-loud moments while her heartbreaking scenes of longing for parental love bring a tear to the eye of the most hardened soul. She can act toe-to-toe with Macy and still steal the scene.The rest of the cast is almost as good. Their performances would be wasted, however, without a tight script and fluid - but not frenetic - direction. The third episode brought all these pieces together in a fascinating show. Whether the writing and direction can sustain this level of quality over a season we don't know. What we do have for now is some of the best ensemble acting you will see on TV or on film."
    },
    {
      "username": "kgft",
      "userUrl": "https://www.imdb.com/user/ur70430609",
      "reviewLink": "https://www.imdb.com/review/rw6620878",
      "warningSpoilers": false,
      "date": "21 February 2021",
      "rate": "9",
      "helpful": "26 out of 32 found this helpful.",
      "title": "Why??",
      "content": "I have loved this show for 10 years, but season 11 sucks! I don't even know what to say about it. Apparently the writers think the show is over because all they can do is compile scenes from previous episodes. There have been a couple of eps that were really interesting and moved the story along, but that's all. Shame on the writers for letting down their loyal fans."
    },
    {
      "username": "Imme-van-Gorp",
      "userUrl": "https://www.imdb.com/user/ur76725747",
      "reviewLink": "https://www.imdb.com/review/rw7989959",
      "warningSpoilers": false,
      "date": "20 March 2022",
      "rate": "8",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Love the family dynamic and social commentary, but they should sometimes go a little more in depth with the emotions.",
      "content": "Season One: 8/10Season Two: 7.5/10Season Three: 8/10Season Four: 8.5/10Themes: Drama, Family, Alcoholism, Poverty, Comedy, Crime, Relationships, Sex, Lgbtq+, Drugs, Mental Health, Bipolar, Social Awareness, Siblings, School, Dysfunctional & Absent Parents.Top five characters: 1) Mickey Milkovich, 2) Phillip 'Lip' Gallagher, 3) Veronica Fisher, 4) Ian Gallagher and 5) Kevin Ball.Least favourite characters: Frank Gallagher, Karen Jackson and Fiona Gallagher."
    },
    {
      "username": "kellybethga",
      "userUrl": "https://www.imdb.com/user/ur26856849",
      "reviewLink": "https://www.imdb.com/review/rw5246094",
      "warningSpoilers": true,
      "date": "9 November 2019",
      "rate": "4",
      "helpful": "56 out of 78 found this helpful.",
      "title": "I'm originally give this series a 9. Now it's a 4, and that's giving credit to the earlier, fun seasons.",
      "content": "Now it's awful. I finally gave up on season 9. Barf. It's like watching an after-school special and political campaign all in one. It's no longer fun, it's just sad. I'm sick to death of It."
    },
    {
      "username": "estangroom",
      "userUrl": "https://www.imdb.com/user/ur161306768",
      "reviewLink": "https://www.imdb.com/review/rw8811193",
      "warningSpoilers": false,
      "date": "19 January 2023",
      "rate": "10",
      "helpful": "23 out of 23 found this helpful.",
      "title": "Gutted its finished want more!",
      "content": "I love shameless it was an amazing series, great quality! Really interesting storyline, wish they would bring out more seasons as I would like to see where the story line carries on. The characters were so good, they all really showed who they were. My favourite character is Ian Gallagher, as I can relate to him in some ways and to me, he was just the best character and played his part well.The series was very graphic and very depressing at the same time, but it just shows what its like to live in a houseful of kids and teens. It also revolves around mental health which I think is so important and just lots of love for life as well. What I also like about this series is that it teaches you life lessons as well, what not to do in your life and what to do.I rate this a 10/10 and highly recommend it! I really enjoyed watching shameless got to be my favourite series of all time and would definitely watch it all again."
    },
    {
      "username": "efreed09",
      "userUrl": "https://www.imdb.com/user/ur25584306",
      "reviewLink": "https://www.imdb.com/review/rw4994758",
      "warningSpoilers": false,
      "date": "14 July 2019",
      "rate": "7",
      "helpful": "52 out of 66 found this helpful.",
      "title": "Another Victim of Politicizing Comedy After Great Beginnings",
      "content": "The series begin great, one of the funniest series I had seen in a long while at that time, and good comedy is difficult to come by. It truly lived up to its name, providing cringe-worthy humor, and yet also seamlessly combining it with a meaningful drama that few other series have ever been able to pull off.This continues for the first few seasons, with the typical ups and downs, some story arcs of the characters being more interesting than others, which is expected in any series with as many memorable characters.Since the shift begin in the political climate, the series decided to shift in the same direction, and is suffering greatly because of it. What used to be apolitical, or rather distributing it evenly with good spirited humor, has turned the way of so many and simply become a new political cudgel. It takes quite obvious stances on political issues, and rams it down your throat, trying to make a message that was neither needed or asked for, and is not even in the spirit of comedy. It is simply there. Entire episodes and story arcs, that have no comedy in them whatsoever and are there simply trying to make a statement. The comedy that they do attempt with it is the nasty mean-spirited kind of \"humor\" that is not funny, but is simply insults without intelligence attempting to hide behind the mask of comedy.So unfortunately the series is going down hill at a break-neck pace, and likely nothing is going to save it now, especially with the loss of the central character. Alienating half of your viewer-base with in-your-face-political-statements is not exactly a good tactic for ratings, so it will reap what it sowed."
    }
  ],
  "errorMessage": ""
}