{
  "imDbId": "tt0229889",
  "title": "El Chavo del Ocho",
  "fullTitle": "El Chavo del Ocho (TV Series 1972–1983)",
  "type": "TVSeries",
  "year": "1972",
  "items": [
    {
      "username": "Johnny0581",
      "userUrl": "https://www.imdb.com/user/ur4584544",
      "reviewLink": "https://www.imdb.com/review/rw1514809",
      "warningSpoilers": false,
      "date": "5 November 2006",
      "rate": "",
      "helpful": "43 out of 44 found this helpful.",
      "title": "One of the greatest shows of all time",
      "content": "This show is not the most recognized show in all of Latin America for nothing. Its simple slapstick family-oriented humor and colorful characters made it an instant classic from day one since it first aired back in the early seventies and is until now and for many years to come, one of the most aired shows in history. It's easy to see why, just watch one episode and you'll be hooked. El Chavo has slapstick humor but it's also a show with a lot of heart that children and grownups have loved for 33 years since the show first aired. First of there's the title character, Chavo which is Mexican slang for \"kid\", an orphaned eight-year old boy who \"hides\" inside his trademark barrel. He is not the brightest bulb but is very simple-minded and is always on an empty stomach. Then there's his best friend, whom he sometimes beats up for being a smart-ass, Quico, a spoiled nine year old boy who sometimes teases Chavo with toys. For ex: Chavo is playing with an improvised toy that he himself made and as soon as Quico sees him, he runs back to his house and comes out with a better more souped-up version of the toy Chavo's playing with, or he could tease him with food, being that Chavo is always starving and is the first thing on his mind, despite of it all Quico is his best friend. Quico is the second most hilarious character on the show, (Don Ramón being the most hilarious) his unique expressions and mannerisms and his large bulging cheeks that look like grapefruits in his mouth are out of this world. There's also Chilindrina, a somewhat tomboyish, nine-year old girl, who wears spectacles without glasses, who is a little smarter than Chavo and Quico, and sometimes messes with their heads a little bit, but has a secret crush on Chavo. Her father Don Ramón, is a man in his late 40's who is unemployed and never pays his bills. He's grumpy and short-fused, especially with Chavo and Quico, who get on his nerves the most. Don Ramón is my favorite character. Ramón Valdez, the actor who portrays him, was a natural on this role and had a very natural sense of humor and charisma which made him perfect for the role of \"Don Ramón\". Doña Florinda, Quico's mother, is an upper-class wannabe who thinks she's better than all of her neighbors in the \"vecindad\" but lives off her dead husband's life insurance with her young boy, Quico, but is in a somewhat better economical position nonetheless than the rest of her neighbors. She has a special dislike for Don Ramón, considering him vulgar and common, and whenever Quico screams, she runs out and slaps Don Ramón across the face assuming he's the one that made him cry, which sometimes he is, but because Quico got on his last nerve. Then there's the schoolteacher, Prof. Jirafales, a school teacher who must be about 6'8 tall and thus, is the target of many jokes from the students. His last name is a play on his massive height meaning something like Giraffish. Señor Barriga, or Mr. Stomach if you literally want to translate his last name, is an obese man who is the owner of the \"vecindad\" and who is always knocking on Don Ramón's door asking for the rent he never pays, and coincidentally, always gets hit with an object that Chavo happens to be throwing or swinging around at the time he arrives. Finally, Doña Clotilde or La Bruja (The Witch) del 71. A fifty-something year old woman who is unmarried and is head over heels for Don Ramón. All of these characters, who were probably born to play their roles, make this show one of the best things to ever come out of Spanish TV. Don't miss it! 10 out of 10."
    },
    {
      "username": "miguelangel-23",
      "userUrl": "https://www.imdb.com/user/ur1586859",
      "reviewLink": "https://www.imdb.com/review/rw0697916",
      "warningSpoilers": false,
      "date": "8 December 2002",
      "rate": "",
      "helpful": "50 out of 56 found this helpful.",
      "title": "Simply the best comic show ever made in Spanish language",
      "content": "Hard to believe that 40 years old actors can play 8 years old characters and with flawless performance capture ingenuity and mischievousness... But they did.The casting during the years 1973 throughout 1978 was just perfection... Praises for Ramon Valdez, who was by far the best of them. This is a comedy that has become an instant classic of all times (specially all the seasons until 1979). At the same level of white humor comedies like \"I love Lucy\",\"Three is company\" or \"Alf\" Most of the jokes are so clean, and smart. Too bad that many of them are untranslatable. This show is recommended for all audiences and all ages, and trust me everyone will enjoy it. Great Talent displayed for all the casting including the show creator Roberto Gomez Bolanos (chespirito) \"the little Shakespeare\".I give the show 10 stars hands down."
    },
    {
      "username": "pacheco_25553",
      "userUrl": "https://www.imdb.com/user/ur1920695",
      "reviewLink": "https://www.imdb.com/review/rw0697915",
      "warningSpoilers": false,
      "date": "17 November 2002",
      "rate": "10",
      "helpful": "46 out of 50 found this helpful.",
      "title": "My favorite show",
      "content": "\"El Chavo del Ocho\" has been my favorite Spanish-speaking show. It was like a ritual to me seeing this hilarious show every single day. It's about a Vecindad (\"neighborhood\") in which an orphan, called Chavo (Mexican equivalent word for lad or kid), lives. He is eight years old (played by a then fortyish actor) and has no parent. He is always starved and lacks of proper hygiene. He shares his live with the other dwellers of the vecindad. Part of the success of the show is that it's full of colorful characters played by gifted and talented actors. My favorite is \"Don Ramón\" played by late Mexican actor Ramón Valdez. \"Kiko\" was also hilarious. The rest of the characters are good, though. If you understand Spanish, you will love this show."
    },
    {
      "username": "ivan-22",
      "userUrl": "https://www.imdb.com/user/ur0105696",
      "reviewLink": "https://www.imdb.com/review/rw0697913",
      "warningSpoilers": false,
      "date": "2 May 2002",
      "rate": "",
      "helpful": "23 out of 27 found this helpful.",
      "title": "Comedy Landmark",
      "content": "The first time I came across this show back in 1976 I was immediately captivated. It's very repetitive, each character has his or her behavioral repertoire, but that's so much like real life, isn't it? The effect is almost hypnotic, and there is a great humanity and love of humanity (and critique) about Bolanos' creations, a very bright and interesting man. The actors are also quite good. Too bad this quaint world is only accessible to Spanish speakers. It's a kind of \"Mr. Roger's Neighborhood\" with much more humor and vivid, colorful characters. There is an element of cruelty one wishes wasn't there. But maybe that's a reflection of reality. Enjoyable also for grown-ups. One of the funnier lines: \"Don Ramon, why don't you look for a job?\" Don Ramon (with a horrified expression): \"And suppose I find it!\""
    },
    {
      "username": "becoolserenalover",
      "userUrl": "https://www.imdb.com/user/ur2515560",
      "reviewLink": "https://www.imdb.com/review/rw0998890",
      "warningSpoilers": false,
      "date": "14 January 2005",
      "rate": "",
      "helpful": "33 out of 35 found this helpful.",
      "title": "The best show ever!",
      "content": "Really, if you didn't watch, you have to! If you like comedy, it's a rule to watch any episode of this fantastic TV series. It was done for kids, but whoever watches it will get hypnotized, and enchanted by the charisma of every character on it! \"El Chavo\" or \"Chavo del Ocho\" tells the story about a poor boy, Chavo, that supposedly lives at the house number 8, but spends most time, or better, whole series, into a barrel. And a lot of things happens, with him, Chilindrina, Don Ramón (my favorite character) and everyone! Each episode means, a lot of fun! It's really amazing how it never gets old. It was done in 73, and even in 2004, kids watch it and laugh of the same things over again. Even adults, and teenagers, watch it and again laugh of the same situation. It's really magical, and even Bolaños can't explain how he did that! And it seems, we will have much more 'Chavo' in the years to come, and people will keep watching it, and it'll have the same high ratings, every time it's being aired on TV. Really, it's something fantastic. I think it's like the only Mexican TV-show that had that kind of acceptance in every continent it was transmitted. So if you haven't watch it, I suggest you to give a try for this humble and very good intentioned series, that has a very nice message too. :)"
    },
    {
      "username": "acetylcholinenjoyer",
      "userUrl": "https://www.imdb.com/user/ur23853088",
      "reviewLink": "https://www.imdb.com/review/rw2315435",
      "warningSpoilers": false,
      "date": "25 September 2010",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "One of the funniest shows ever made.",
      "content": "I love this show, I found it to be one of the funniest, most clever and original shows ever made. I loved every single aspect abut it: The stories, the characters, the music...Everything was perfect. I could see thousand of episodes of this, and I never get bored.\"El Chavo del Ocho\" absolutely rocks. It is absolutely awesome, like all the other shows made by \"Chespirito\".If only there were more comedies like this: This days, all is about gross jokes about corporal fluids, vulgar sex jokes and pointless cultural references (Think in shows like \"Family Guy\" or \"Mystery Science Teather 3000\"...I hate those shows) Whatever, \"El Chavo del Ocho\" is one of the best shows ever made. I love it, and I always will love it. It is that good."
    },
    {
      "username": "sagitario",
      "userUrl": "https://www.imdb.com/user/ur1599892",
      "reviewLink": "https://www.imdb.com/review/rw0697912",
      "warningSpoilers": false,
      "date": "27 February 2002",
      "rate": "",
      "helpful": "19 out of 21 found this helpful.",
      "title": "Great show,",
      "content": "El Chavo del 8 is a an almost perfect tv comic show. It could make you laugh and cry, which is for me a real good combination. My grandparents know and enjoy the show, my parents also do, I love it, and my neighbor of 3 years old won't stop laughing when he watches it. This might just give you a perspective of how long-lasting it's charming is. El chavo, kiko, don ramón, mr. barriga, and everybody else conform a superb cast, and they have made laugh millions for nearly thirty years. No other tv show has had such a great impact in Latin America than El Chavo, and that's easy to understand if you know it. My favorite character is Don Ramón, played wonderfully by Ramon Valdez, but this doesn't make the others mediocre, 'cause they're all more than excellent. Watch it pal, if you have the chance, you won't regret it."
    },
    {
      "username": "ciberredes1",
      "userUrl": "https://www.imdb.com/user/ur32149646",
      "reviewLink": "https://www.imdb.com/review/rw2576364",
      "warningSpoilers": false,
      "date": "5 March 2012",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "A Classic!",
      "content": "I know this show can be repetitive for some people, but it makes me smile every time, is really good for any age viewer. This TV show will be remembered as one of the best of all times, why? well, For it's simplicity and easy to watch, this is not a complicated drama, this is funny to see.Every character on the show has his own personality and plays an important role for the structure of the show, I know this show contains a lot of punch, kicks and smash comedian type(The Three Stooges), but as I said this is classic to see, for the one that are looking for something light. Also one important point is that the show matches for any country, no matter if you are not Mexican you will understand the characters and the story of each episode is simple and funny."
    },
    {
      "username": "Dr. Sigmund Freud",
      "userUrl": "https://www.imdb.com/user/ur0696277",
      "reviewLink": "https://www.imdb.com/review/rw0697911",
      "warningSpoilers": false,
      "date": "8 September 2001",
      "rate": "",
      "helpful": "17 out of 18 found this helpful.",
      "title": "The most simple-made comedy show ever.",
      "content": "\"El Chavo\" and \"El Chapulín Colorado\" are the best comedy series ever made for TV that don't appeal to jokes based on sex appealing. All the funny lines are based on the most simple possible types of making fun of somebody, such as the stupidity and innocence of children or from the non-working state of a guy who is always in trouble.Chavo and Chapulín are a must for any person who want to see how its possible to make comedy shows using life simplicity based ideas and low money for running the program.Being from different styles of comedy, even because each one was made on a difference of about 2 decades, Chavo & Chapulin might lead the comedy ranking on the side of Seinfeld, the most intelligent comedy show of the 90's."
    },
    {
      "username": "coldmail",
      "userUrl": "https://www.imdb.com/user/ur2619395",
      "reviewLink": "https://www.imdb.com/review/rw0697917",
      "warningSpoilers": false,
      "date": "11 September 2003",
      "rate": "",
      "helpful": "15 out of 17 found this helpful.",
      "title": "Damn, this show is being sucessfully reprised in Brazil since 1984",
      "content": "Brazilian TV stations are competent in doing their own productions, but El Chavo is probably the most sucessful TV show in Brasil since the eighties. I born in 1981 and I can't remember my life without this show being reprised every single day here, and everytime I watch the same shows, with the same jokes, I laugh out loud because they're so funny, but sometimes they almost make us cry, because Chavo reality isn't so different from many poor people in Brasil. It's an amazing show, it is."
    },
    {
      "username": "deluxecaput186",
      "userUrl": "https://www.imdb.com/user/ur10094253",
      "reviewLink": "https://www.imdb.com/review/rw1442122",
      "warningSpoilers": false,
      "date": "7 August 2006",
      "rate": "10",
      "helpful": "24 out of 28 found this helpful.",
      "title": "Thanks for the fun and laughter, Chespirito!",
      "content": "When I was little, I remember seeing El Chavo, El Chapulin Colorado, and of course, Chespirito with my grandpa. Now that I'm older, I can't imagine how Spanish TV will be without these shows. I'm inspired by Roberto Gomez Bolanos and how he created such memorable characters. I give credit to the actors in the shows who brought the characters to life. Don Ramon, played by the late Ramon Valdez, lit up the shows. I also like Quico, played by Carlos Villagran, who completed the show by his humor. El Chavo always made me laugh and made me happy. In my opinion, it's the funniest Spanish show ever. I hope they show El Chavo for many years to come."
    },
    {
      "username": "Jimi_Dini",
      "userUrl": "https://www.imdb.com/user/ur1038327",
      "reviewLink": "https://www.imdb.com/review/rw0697910",
      "warningSpoilers": false,
      "date": "28 February 2001",
      "rate": "",
      "helpful": "11 out of 14 found this helpful.",
      "title": "The number 1 show in mexican tv!",
      "content": "First off this is a show from the 70´s that never gets tired,let me tell you the magical story.The Chavo del Ocho is an orphan who lives in an apartment that is never seen from the inside,just the door was seen when repairs were being done to the neighborhood.Well,the neighborhood seems to be just populated by Doña Florinda,a widower mother of Quico,a boy with cheeks that seem to be balloons,in love with the teacher,El Profesor Jirafales.Aparment 61 is inhabited by Doña Clotilde,which the kids call a witch,in love with Don Ramon,a man with no job,but is good at evading Señor Barriga,the owner of the neighborhood,who always threathens to throw Don Ramon and Chilindina,a preety witty girl,daughter of Don Ramon,out of the neighborhood,but as he has a good friendship and a good heart always comes with a good excuse to make him stay(He claimed he betted against Don Ramon in a boxing match to get the money he owed,but the truth is he hates it)he is the father of ñoño,played by the same actor,who cries like a pig.To bad the actor who played Don Ramon died,Quico also left the show,they were replaced by wonderful actors,but without the characteristic accusing of Don Ramon by Doña Florinda,and Don Jaimito,who Don Ramon was replaced with was quite a good character,but tiring."
    },
    {
      "username": "fpmarz",
      "userUrl": "https://www.imdb.com/user/ur3948364",
      "reviewLink": "https://www.imdb.com/review/rw1581025",
      "warningSpoilers": false,
      "date": "23 January 2007",
      "rate": "10",
      "helpful": "21 out of 25 found this helpful.",
      "title": "The best program....",
      "content": "This is the true family program. It's great... I watch Chavo since i had 4 years old and i've been watched all of the episodes, but, when i watch it again, i enjoy it more and more!!!! this is a fabulous program!!!! The E! Entertainment channel made a program talking about the 10 best TV series, but they had committed a mistake because they didn't put Chavo between the 10 best TV series of the history and Chavo is the best TV series of the history, it's better then friends..... My parent has watched when they was children, i watch it now and with certainly my kids will watch it and they will love it too....with certainly."
    },
    {
      "username": "utdaxiao",
      "userUrl": "https://www.imdb.com/user/ur99037010",
      "reviewLink": "https://www.imdb.com/review/rw4770503",
      "warningSpoilers": false,
      "date": "9 April 2019",
      "rate": "10",
      "helpful": "5 out of 7 found this helpful.",
      "title": "A 1970s Latin American sitcom show that you can watch many times",
      "content": "This is an 1970s Latin American sitcom show that you can watch many times and it is still funny to watch even nowadays.Has a soft, clean and direct humor, the actors don't need to do a lots to completely get into the hearts of the audience. It is recommended for children and for adults. Chespirito was a genious in how he represented mostly Mexico, but generally Latin America: Chavo, a homeless boy, like many in the third world.Don Ramon: a jobless person, one could call him a vagabond. The best actor in the show, by far.Dona Florinda: a woman who once had a fortune, but now live on subsides of the government. She still thinks she is best than everybody. Kiko is her spoiled child.Professor Jirafales: he a cult person, in love with Florinda, but never assumes the relationship because he also doesn't have money.The villa: is a basic representation of a poor suburb in latin america. Everyone can relate to it.This is why it is a spectacular show, it tells our everyday life in a comic way. Everyone can relate themselves to the show, see themselves in the characters. This is why a show from 1970s can still make a lot of audience even today."
    },
    {
      "username": "aqeoigor",
      "userUrl": "https://www.imdb.com/user/ur102827129",
      "reviewLink": "https://www.imdb.com/review/rw5835849",
      "warningSpoilers": false,
      "date": "19 June 2020",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Hillarious",
      "content": "Even thought the episodes repeat the same jokes, it will never lost its charm and grace. And I can say that no other show could ever impress or surpass that... El Chavo del Ocho has great actors and great interpretations of misadventures that not any other show could ever transmit. If you're having a bad day or just want to simply smile, this is the show for you. For all ages."
    },
    {
      "username": "tobisama",
      "userUrl": "https://www.imdb.com/user/ur5302872",
      "reviewLink": "https://www.imdb.com/review/rw1079506",
      "warningSpoilers": false,
      "date": "13 May 2005",
      "rate": "",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Thank You ROBERTO and all staff !!!!!!!",
      "content": "Thank you for make me laugh all this years, since i was born back in 1979 I m watching all the Chespirito characters,I grow watching this show, and every time I watch any of that chapters or episodes, i m laughing , is impossible keep me serious for a minute with this show.More than 30 years and more funny every time.So thanks for create such a hilarious characters like Chavo,Chespirito,Dr. Chapatin, Chifladitos,Caquitos, etc.Here in Colombia we love you.....11/10......By the way finally Jirafales buy the square ball for Quico?? (kiko)"
    },
    {
      "username": "moiseshuizar",
      "userUrl": "https://www.imdb.com/user/ur32835181",
      "reviewLink": "https://www.imdb.com/review/rw8529711",
      "warningSpoilers": true,
      "date": "10 September 2022",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Timeless Classic",
      "content": "Hands down the greatest Spanish show of all time. One of the greatest shows ever made. This show originally aired in the early 70s. The great writing and character development. Still resonate with many generations. From my father as a child seeing it live , to myself watching it in the 90s. To my daughter still laughing at all the shannanigangs in 2022. From the iconic song , to kikos puffed up cheeks. Don Ramon hiding from Don Barrigas. To Chavo in his barrel. El Chavo , Kiko , Chilindrina, and Ron Damon are immortal. They can still make us laugh after all these years. Chespirito ( little Shakespeare) was truly magnificent artist."
    },
    {
      "username": "baggassus",
      "userUrl": "https://www.imdb.com/user/ur2773224",
      "reviewLink": "https://www.imdb.com/review/rw0697909",
      "warningSpoilers": false,
      "date": "25 February 2004",
      "rate": "9",
      "helpful": "10 out of 15 found this helpful.",
      "title": "Just great!",
      "content": "\"El Chavo\" is an excellent sitcom made in Mexico in the 70's, and is very popular here in Brazil until 2004 (although started to be broadcasted here in 1984). The cast is great! All of them are funny! If you watch without understanding spanish or portuguese, you will laugh. If you understand portuguese or spanish, you'll laugh even more! I like all the characters, but Chavo and Don Ramón are my favorites! Everything is funny, even the sound effects, that for me are true classics just like \"Star Wars\" sounds. The laughs that can be heard when someone does something funny are unique! The special effects are decent too, if you consider that they were made in the 70's. The people who have borned on the 80's, here in Brazil (like me), love this show! I think this sitcom can be compared to \"Friends\" and \"Seinfeld\", as one of the most funny TV shows ever created! For me, \"The Simpsons\", \"Friends\", \"Seinfeld\",\"El Chavo\", and \"El Chapulín Colorado\" are simply THE BEST! I will give 4 of 5 points, because nothing is perfect."
    },
    {
      "username": "bobbyhankson",
      "userUrl": "https://www.imdb.com/user/ur154597377",
      "reviewLink": "https://www.imdb.com/review/rw8342196",
      "warningSpoilers": false,
      "date": "17 July 2022",
      "rate": "10",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Made with heart",
      "content": "It's curious how this series have a lot of repetitive jokes, but almost all works even after the 8th time, the characters are all relatable, and the script is genius.I wish we have more comedy shows like this one.Overall:Here come the keys keys/10."
    },
    {
      "username": "leonhardtana",
      "userUrl": "https://www.imdb.com/user/ur154732596",
      "reviewLink": "https://www.imdb.com/review/rw8350542",
      "warningSpoilers": false,
      "date": "19 July 2022",
      "rate": "10",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Simply one of the best comedy",
      "content": "El Chavo del Ocho is so well executed, and have a lot of love and heart in the series, the jokes works very well even after the 8th time, the characters are also very good and even relatable.Overall:It's peak comedy."
    },
    {
      "username": "orffsite",
      "userUrl": "https://www.imdb.com/user/ur68507592",
      "reviewLink": "https://www.imdb.com/review/rw3755133",
      "warningSpoilers": false,
      "date": "15 July 2017",
      "rate": "9",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Hilarious. Great for Beginning Spanish Learners, too.",
      "content": "So far, my biggest reward in learning some more Spanish, at age 65, has been some of the great music I've discovered, and this fabulous comedy. Adults playing the roles of children is nothing new, but the actors in this show are so great in their portrayal that I easily accept that they are just kids and not their real ages. This is classic comedy, with slapstick, wordplay, and old vaudeville style routines. Spanish is not my native language, but the Netflix versions I'm watching let you add captions. The Spanish is usually basic and they often repeat gag lines. It's fun as a beginner Spanish student to watch El Chavo get words confused with similar words. I hit my language translator and I get an even bigger laugh. My advice is learn just a little bit of Spanish and watch this show. I'm glad I found it!"
    },
    {
      "username": "spidermankc",
      "userUrl": "https://www.imdb.com/user/ur124988320",
      "reviewLink": "https://www.imdb.com/review/rw8742263",
      "warningSpoilers": false,
      "date": "18 December 2022",
      "rate": "10",
      "helpful": "1 out of 2 found this helpful.",
      "title": "Best TV show of all time",
      "content": "To start with this review i sant to say that I'm from Mexico and i knew this show when i was 6 or 7 and it became my favorita TV show of all time. This show about Chavo a Kid Who lives in a barrel inside a neighborhood Who lives crazy days with his friends Quico a spoiled but heart spirited child and La Chilindrina a sweet girl. And always buthering Doña Florinda Quico's Mom or Señor Barriga the owner of the neighborhood. But the best thing is the comedy because have a lot of slapstick, double meanings and other humors. In conclusion El Chavo del Ocho is the Best TV show not only from Mexico but also the greatest show of all time."
    },
    {
      "username": "jesus_darkness",
      "userUrl": "https://www.imdb.com/user/ur68504950",
      "reviewLink": "https://www.imdb.com/review/rw5057901",
      "warningSpoilers": false,
      "date": "13 August 2019",
      "rate": "6",
      "helpful": "11 out of 40 found this helpful.",
      "title": "Don't let nostalgia blind you",
      "content": "This series is not objectively funny and it's an insult to anyone's intelligence (and I'm being polite): it's repetitive, the jokes are told over and over again and it's not funny after 8 times heard time after time... I understand, this was on everybody's TV back in the day, and all the family used to watch it, and for those memories I have a lot of respect and love for this show, but don't let the subjectivity on your heart blind your judgement, this is not a masterpiece, I mean, you guys ranked it a 10!!??? Really??! So you're saying this is as good as Game of Thrones, Breaking Bad or even The Sopranos??? I'm sorry but you are terribly blind my fellow reviewers. Heck, I think even \"Derbez en Cuando\" was objectively more creative and funnier and I don't even like it as much as I like El Chavo."
    }
  ],
  "errorMessage": ""
}