{
  "imDbId": "tt0229889",
  "title": "El Chavo del Ocho",
  "fullTitle": "El Chavo del Ocho (TV Series 1972–1983)",
  "type": "TVSeries",
  "year": "1972",
  "language": "en",
  "titleInLanguage": "El Chavo del Ocho",
  "url": "https://en.wikipedia.org/wiki/El_Chavo_del_Ocho",
  "plotShort": {
    "plainText": "El Chavo (English: The Kid or The Boy, but chavo also meaning cent); — also known as El Chavo del Ocho (English: The Kid from number Eight or The Boy from apartment #8) during its earliest episodes – is a Mexican television sitcom created by Roberto Gómez Bolaños, produced by Televisa. It premiered on April 27, 1972 and ended on June 12, 1992 after 7 seasons and 311 episodes. The series gained enormous popularity in Hispanic America, Brazil, Spain and other countries. The series theme song is a rendition of Ludwig van Beethoven's Turkish March, rearranged by Jean-Jacques Perrey & retitled “The Elephant Never Forgets”.\r\nThe show follows the adventures and tribulations of the title character—a poor orphan nicknamed \"El Chavo\" (which means \"The Kid\" or \"The Boy\"), played by the show's creator, Roberto Gómez Bolaños \"Chespirito\"—and his friends, which often cause conflict, of a comedic nature, between the other inhabitants of a fictional low-income housing complex, or, as called in Mexico, vecindad. The idea for the show emerged from a sketch created by Gómez Bolaños where an 8-year-old boy competed with a balloon vendor in a park, said sketch aired for the first time on April 27, 1972. The show centered great importance into the development of the characters, which were each assigned a distinctive personality. Since the beginning, Gómez Bolaños decided that El Chavo would be directed toward an adult audience, even though the show itself was about adults interpreting kids. The main cast consisted of Gómez Bolaños, Ramón Valdés, Carlos Villagrán, María Antonieta de las Nieves, Florinda Meza, Rubén Aguirre, Angelines Fernández and Édgar Vivar, who interpreted El Chavo, Don Ramón, Quico, Chilindrina, Doña Florinda, Profesor Jirafales, Doña Clotilde and Señor Barriga respectively. Direction and production of the series fell on Gómez Bolaños, Enrique Segoviano and Carmen Ochoa.\r\nEl Chavo first appeared in 1972 as a sketch in the Chespirito show which was produced by Televisión Independiente de México (TIM). In 1973, following the merger of TIM and Telesistema Mexicano, it was produced by Televisa and became a weekly half-hour series, which ran until 1980. After that year, shorts continued to be shown in Chespirito until 1992. At its peak of popularity during the mid-1970s, it had a Latin American audience of over 350 million viewers per episode. Given the popularity of the show, the cast went on a global tour to countries in which the show already aired and, in a series of presentations, the cast would dance and act in front of the public.\r\nThe series spawned an animated version titled El Chavo Animado, which aired from October 2006 to June 2014, just a few months before Bolaños' death.\r\nThe Brazilian Portuguese dub, Chaves, has been transmitted by Brazilian TV Network SBT since 1984. It was also seen on the Brazilian versions of Cartoon Network and Boomerang, and currently is also seen on Multishow. Since 2 May 2011, it has aired in the United States on the UniMás network. It previously aired on sister network Univision and its predecessor, the Spanish International Network.\r\nEl Chavo continues to be popular with syndicated episodes averaging 91 million daily viewers in all of the markets where it is distributed in the Americas. Since it ceased production in 1992, it has earned an estimated US$1.7 billion in syndication fees alone for Televisa.\r\nEl Chavo was also available on Netflix in the United States, but was removed on December 31, 2019.",
    "html": "<p>El Chavo (English: The Kid or The Boy, but chavo also meaning cent); — also known as El Chavo del Ocho (English: The Kid from number Eight or The Boy from apartment #8) during its earliest episodes – is a Mexican television sitcom created by Roberto Gómez Bolaños, produced by Televisa. It premiered on April 27, 1972 and ended on June 12, 1992 after 7 seasons and 311 episodes. The series gained enormous popularity in Hispanic America, Brazil, Spain and other countries. The series theme song is a rendition of Ludwig van Beethoven's Turkish March, rearranged by Jean-Jacques Perrey & retitled “The Elephant Never Forgets”.</p><p>The show follows the adventures and tribulations of the title character—a poor orphan nicknamed \"El Chavo\" (which means \"The Kid\" or \"The Boy\"), played by the show's creator, Roberto Gómez Bolaños \"Chespirito\"—and his friends, which often cause conflict, of a comedic nature, between the other inhabitants of a fictional low-income housing complex, or, as called in Mexico, vecindad. The idea for the show emerged from a sketch created by Gómez Bolaños where an 8-year-old boy competed with a balloon vendor in a park, said sketch aired for the first time on April 27, 1972. The show centered great importance into the development of the characters, which were each assigned a distinctive personality. Since the beginning, Gómez Bolaños decided that El Chavo would be directed toward an adult audience, even though the show itself was about adults interpreting kids. The main cast consisted of Gómez Bolaños, Ramón Valdés, Carlos Villagrán, María Antonieta de las Nieves, Florinda Meza, Rubén Aguirre, Angelines Fernández and Édgar Vivar, who interpreted El Chavo, Don Ramón, Quico, Chilindrina, Doña Florinda, Profesor Jirafales, Doña Clotilde and Señor Barriga respectively. Direction and production of the series fell on Gómez Bolaños, Enrique Segoviano and Carmen Ochoa.</p><p>El Chavo first appeared in 1972 as a sketch in the Chespirito show which was produced by Televisión Independiente de México (TIM). In 1973, following the merger of TIM and Telesistema Mexicano, it was produced by Televisa and became a weekly half-hour series, which ran until 1980. After that year, shorts continued to be shown in Chespirito until 1992. At its peak of popularity during the mid-1970s, it had a Latin American audience of over 350 million viewers per episode. Given the popularity of the show, the cast went on a global tour to countries in which the show already aired and, in a series of presentations, the cast would dance and act in front of the public.</p><p>The series spawned an animated version titled El Chavo Animado, which aired from October 2006 to June 2014, just a few months before Bolaños' death.</p><p>The Brazilian Portuguese dub, Chaves, has been transmitted by Brazilian TV Network SBT since 1984. It was also seen on the Brazilian versions of Cartoon Network and Boomerang, and currently is also seen on Multishow. Since 2 May 2011, it has aired in the United States on the UniMás network. It previously aired on sister network Univision and its predecessor, the Spanish International Network.</p><p>El Chavo continues to be popular with syndicated episodes averaging 91 million daily viewers in all of the markets where it is distributed in the Americas. Since it ceased production in 1992, it has earned an estimated US$1.7 billion in syndication fees alone for Televisa.</p><p>El Chavo was also available on Netflix in the United States, but was removed on December 31, 2019.</p>"
  },
  "plotFull": {
    "plainText": "El Chavo (English: The Kid or The Boy, but chavo also meaning cent); — also known as El Chavo del Ocho (English: The Kid from number Eight or The Boy from apartment #8) during its earliest episodes – is a Mexican television sitcom created by Roberto Gómez Bolaños, produced by Televisa. It premiered on April 27, 1972 and ended on June 12, 1992 after 7 seasons and 311 episodes. The series gained enormous popularity in Hispanic America, Brazil, Spain and other countries. The series theme song is a rendition of Ludwig van Beethoven's Turkish March, rearranged by Jean-Jacques Perrey & retitled “The Elephant Never Forgets”.\r\nThe show follows the adventures and tribulations of the title character—a poor orphan nicknamed \"El Chavo\" (which means \"The Kid\" or \"The Boy\"), played by the show's creator, Roberto Gómez Bolaños \"Chespirito\"—and his friends, which often cause conflict, of a comedic nature, between the other inhabitants of a fictional low-income housing complex, or, as called in Mexico, vecindad. The idea for the show emerged from a sketch created by Gómez Bolaños where an 8-year-old boy competed with a balloon vendor in a park, said sketch aired for the first time on April 27, 1972. The show centered great importance into the development of the characters, which were each assigned a distinctive personality. Since the beginning, Gómez Bolaños decided that El Chavo would be directed toward an adult audience, even though the show itself was about adults interpreting kids. The main cast consisted of Gómez Bolaños, Ramón Valdés, Carlos Villagrán, María Antonieta de las Nieves, Florinda Meza, Rubén Aguirre, Angelines Fernández and Édgar Vivar, who interpreted El Chavo, Don Ramón, Quico, Chilindrina, Doña Florinda, Profesor Jirafales, Doña Clotilde and Señor Barriga respectively. Direction and production of the series fell on Gómez Bolaños, Enrique Segoviano and Carmen Ochoa.\r\nEl Chavo first appeared in 1972 as a sketch in the Chespirito show which was produced by Televisión Independiente de México (TIM). In 1973, following the merger of TIM and Telesistema Mexicano, it was produced by Televisa and became a weekly half-hour series, which ran until 1980. After that year, shorts continued to be shown in Chespirito until 1992. At its peak of popularity during the mid-1970s, it had a Latin American audience of over 350 million viewers per episode. Given the popularity of the show, the cast went on a global tour to countries in which the show already aired and, in a series of presentations, the cast would dance and act in front of the public.\r\nThe series spawned an animated version titled El Chavo Animado, which aired from October 2006 to June 2014, just a few months before Bolaños' death.\r\nThe Brazilian Portuguese dub, Chaves, has been transmitted by Brazilian TV Network SBT since 1984. It was also seen on the Brazilian versions of Cartoon Network and Boomerang, and currently is also seen on Multishow. Since 2 May 2011, it has aired in the United States on the UniMás network. It previously aired on sister network Univision and its predecessor, the Spanish International Network.\r\nEl Chavo continues to be popular with syndicated episodes averaging 91 million daily viewers in all of the markets where it is distributed in the Americas. Since it ceased production in 1992, it has earned an estimated US$1.7 billion in syndication fees alone for Televisa.\r\nEl Chavo was also available on Netflix in the United States, but was removed on December 31, 2019.\r\nGenre and setting\r\nThe titular character, El Chavo (meaning \"the boy\"), whose real name is never revealed, is an eight-year-old orphan boy who lives in a neighborhood where he and several other characters, both residents and non-residents, interact with each other on a daily basis.\r\nThe vecindad is owned by the fat and wealthy Señor Barriga (Spanish for \"Mr. Belly\"), who is often seen in the neighborhood to collect the monthly rent from his residents. His best tenants are the widow Doña Florinda (Ms. Florinda) and Doña Clotilde (Ms. Clotilde), who pay every month on time, and his worst tenant is Don Ramón, who never pays his rent and either hides from Señor Barriga until he leaves or uses trickery to waive the payment for later. El Chavo likes to \"hide\" in a wooden barrel located in the vecindad's main courtyard, especially after getting into a disagreement where he ends up getting scolded, and otherwise is usually accompanied by his friends: Quico, Doña Florinda's spoiled, dim-witted and arrogant son, and Chilindrina, Don Ramón's shrewd and mischievous bespectacled daughter. Non-residents who visit the vecindad regularly include Señor Barriga and his equally fat son Ñoño, Profesor Jirafales, the tall, cultured and elegant teacher of a nearby school that the children attend, and Popis, a stuck up girl who speaks nasally.\r\nEach episode uses comedic strategies, such as slapstick, irony, recurring jokes, and funny situations in which the characters are usually getting into. It includes the use of pre-recorded laughter tracks to emphasize comic scenes.\r\nThe sitcom explores, in a comical manner, the problems that many homeless children face on a daily basis, such as hunger, sadness, loneliness, and a lack of adult supervision and attention. On one episode, for example, Chavo was sitting on the stairsteps of the vecindad at night, dreaming of all the toys he wished that he could have and how he'd play with them. It ended with him returning to the present, sighing wistfully, then pulling out a balero (the only toy he had ever had on a regular basis) made of a stick, a tin can, and a piece of string. He begins to play with it as the camera slowly fades out. Some episodes also have educational endings, teaching, for example, that it is good to take a shower and to not judge a book by its cover.\r\nThe central courtyard is the setting for most of the episodes. Surrounding it are the homes of Doña Florinda and Quico in #14, Doña Clotilde in #71, and Don Ramón and Chilindrina in #72, and from 1982 onwards Jaimito \"El Cartero\", who lives up the stairs in #23. The hallway on the right between #71 and #72 leads \"the other courtyard\", which at times has a fountain in the middle. On the street facade at the left, a corner store and a barber shop are shown adjacent to the neighborhood's entry.\r\nEl Chavo was filmed in a fictitious neighborhood set at studios 2, 5 and 8 of Televisa San Angel in Mexico City.\r\nIn the later seasons, sometimes an unnamed park was shown. Several episodes are set in Professor Jirafales's classroom, where he teaches; all the child characters in the sitcom attend the same classroom, sometimes with their parents. Others are set inside Doña Florinda's restaurant, a barber shop (where Don Ramón worked at one point), and the sidewalk located at the entrance of the vecindad. Three episodes were filmed in Acapulco, which also served as a vacation for the entire cast. In 1992, the last El Chavo sketches were filmed in Professor Jirafales' classroom. The last sketch for El Chavo was a 1992 remake of \"Clases de Inglés\" (English Classes).\r\nCharacters and cast\r\nRoberto Gómez Bolaños as El Chavo Main character, an 8-year-old boy, who arrives at the vecindad after running away from an orphanage where his mom abandoned him. He accustoms hiding in a barrel located at the entrance of the vecindad, but he lives in #8 where a nice lady let him sleep. His real name does not come up in any of the episodes. One of his main traits is the Garrotera, in which his body tenses and 'shrinks' to become paralyzed after being frightened. The cure is being splashed with cold water.\r\nMain character, an 8-year-old boy, who arrives at the vecindad after running away from an orphanage where his mom abandoned him. He accustoms hiding in a barrel located at the entrance of the vecindad, but he lives in #8 where a nice lady let him sleep. His real name does not come up in any of the episodes. One of his main traits is the Garrotera, in which his body tenses and 'shrinks' to become paralyzed after being frightened. The cure is being splashed with cold water.\r\nCarlos Villagrán as Quico A 9-year-old boy whose real name is Federico. In one of the episodes, it is mentioned that his father was a naval officer, which is why he is usually dressed in a sailor suit. He lives in #14 with his mother Doña Florinda. He is arrogant and envious at the same time, which is why he usually gets into disagreements with other children in the vecindad.\r\nA 9-year-old boy whose real name is Federico. In one of the episodes, it is mentioned that his father was a naval officer, which is why he is usually dressed in a sailor suit. He lives in #14 with his mother Doña Florinda. He is arrogant and envious at the same time, which is why he usually gets into disagreements with other children in the vecindad.\r\nMaría Antonieta de las Nieves as La Chilindrina and Doña Nieves An 8-year-old freckled girl, daughter of Don Ramón. She is mischievous and intelligent. She is friends with El Chavo and Quico. She is in love with El Chavo, which is why she dislikes Paty, his love interest in one of the episodes.\r\nAn 8-year-old freckled girl, daughter of Don Ramón. She is mischievous and intelligent. She is friends with El Chavo and Quico. She is in love with El Chavo, which is why she dislikes Paty, his love interest in one of the episodes.\r\nRamón Valdés as Don Ramón Lives in #72 with his daughter Chilindrina. He is unemployed and over 14 months behind on rent, indebted to Señor Barriga, which is why he always tries to avoid him as soon as Señor Barriga enters the vecindad.\r\nLives in #72 with his daughter Chilindrina. He is unemployed and over 14 months behind on rent, indebted to Señor Barriga, which is why he always tries to avoid him as soon as Señor Barriga enters the vecindad.\r\nFlorinda Meza as Doña Florinda and Popis Lives in #14 with her son Quico. She is prideful, cocky, and haughty. She belittles her neighbors due to financial situations, referring to them as chusma. She is in love with Profesor Jirafales. Popis is the niece of Doña Florinda and generally stays with her in the apartment when she visits. She also attends the same class Profesor Jirafales teaches. She is always carrying a doll, Serafina. Popis is as her nickname is: stuck-up.\r\nLives in #14 with her son Quico. She is prideful, cocky, and haughty. She belittles her neighbors due to financial situations, referring to them as chusma. She is in love with Profesor Jirafales.\r\nPopis is the niece of Doña Florinda and generally stays with her in the apartment when she visits. She also attends the same class Profesor Jirafales teaches. She is always carrying a doll, Serafina. Popis is as her nickname is: stuck-up.\r\nRubén Aguirre as Profesor Jirafales Elementary teacher where the vecindad children attend. Has a romantic relationship with Doña Florinda. One of his most expressive characteristics is \"Ta, ta, ta, taaaa, ta!\" when he gets angry. His large stature is the target for many jokes amongst El Chavo and his friends (an example being his nickname \"Profesor Longaniza\").\r\nElementary teacher where the vecindad children attend. Has a romantic relationship with Doña Florinda. One of his most expressive characteristics is \"Ta, ta, ta, taaaa, ta!\" when he gets angry. His large stature is the target for many jokes amongst El Chavo and his friends (an example being his nickname \"Profesor Longaniza\").\r\nÉdgar Vivar as Señor Barriga and Ñoño Owner of La Vecindad. In most episodes, he is greeted by being hit by El Chavo when he is out playing on the patio. Due to his obesity, he is a constant target as a joke for everyone else. Ñoño is son of Señor Barriga. He is obese, and like his father, is target to ridicule by the other children. He also attends the same class Profesor Jirafales teaches.\r\nOwner of La Vecindad. In most episodes, he is greeted by being hit by El Chavo when he is out playing on the patio. Due to his obesity, he is a constant target as a joke for everyone else.\r\nÑoño is son of Señor Barriga. He is obese, and like his father, is target to ridicule by the other children. He also attends the same class Profesor Jirafales teaches.\r\nAngelines Fernández as Doña Clotilde \"La bruja del 71\" (The Witch of 71) Single woman lives in #71. Her appearance and strange mannerisms dubbed her \"The Witch of 71\" by the vecindad children. Having a dog named \"Satanás\" and conducting a spiritual session only confirmed the children's beliefs. She is in love with Don Ramón.\r\nSingle woman lives in #71. Her appearance and strange mannerisms dubbed her \"The Witch of 71\" by the vecindad children. Having a dog named \"Satanás\" and conducting a spiritual session only confirmed the children's beliefs. She is in love with Don Ramón.\r\nHoracio Gómez Bolaños as Godínez Attends the class Profesor Jirafales teaches. Normally ignores any questions directed at him.\r\nAttends the class Profesor Jirafales teaches. Normally ignores any questions directed at him.\r\nRaúl Padilla as Jaimito \"El Cartero\" (The Mailman) Old, gentle man in charge of the mail in the vecindad. He lives alone. He is always walking by his bike because to get the mail delivery job, he was required to know how to bike; he lied.\r\nOld, gentle man in charge of the mail in the vecindad. He lives alone. He is always walking by his bike because to get the mail delivery job, he was required to know how to bike; he lied.\r\nHistory\r\nOrigins\r\nBy 1972, Roberto Gómez Bolaños was already well known in Mexico for his self-titled sketch comedy show, Chespirito, which was produced by Televisión Independiente de México and aired on XHTIM-TV, channel 8 (now XEQ-TV channel 9, Gala TV). He had already introduced El Chapulín Colorado and other characters.\r\nRoberto Gómez Bolaños was the show's main creator and star. He called Florinda Meza to act in the show first; Chespirito and Meza later married. Édgar Vivar was the second actor chosen for the show. A mutual friend recommended Vivar to Gómez Bolaños when he started casting. Gómez Bolaños cited Vivar at Forum 8 at Telesistema Mexicano – where shooting was taking place. Vivar showed up as a scene was shooting; he laughed and the scene had to 'cut'. Gómez Bolaños approached him, asked him if he was Vivar, and told him that they would not be using an earpiece, to which Vivar responded that he didn't know what he was talking about. He hired him on the spot. Roberto Gómez Bolaños recruited Ramón Valdés because he had known Valdés for years and had seen multiple movies Valdés had made. Then, Rubén Aguirre was cast in the show as the character of \"Profesor Jirafales\". Aguirre and Roberto Gómez Bolaños had been working on scripts together for years, and Aguirre had already been playing the character of Professor Jirafales on another Chespirito show, Supergenios de la Mesa Cuadrada, which spoofed current events panel discussion. Carlos Villagrán just happened to be a friend of Aguirre who was a newspaper reporter, and he went to a party hosted by Aguirre. Villagrán did a comedy step where he blew his cheeks out of proportion, and Aguirre told Roberto Gómez Bolaños about his friend's hidden talent. Villagrán was promptly hired for the show. María Antonieta de las Nieves was a voice-over only actress who used to go to Televisa to make announcements. Upon hearing her voice, Roberto Gómez Bolaños thought she was perfect for the show. At first, she refused by telling him she was not a comedy actress, but Roberto Gómez Bolaños's retort challenged her: \"Then you're not a good actress: there are no dramatic or comic actors—there are only actors.\" The last additions to the show were Angelines Fernández, a former film actress and Horacio Gómez Bolaños, Roberto's younger brother who had never considered acting before; he was originally to oversee the show's marketing.\r\nThe first El Chavo sketch was broadcast on 1972 and there is little information about that time, but possibly premiered on April 27, since El Chavo was created to replace the sketch Los Chifladitos, in which Chespirito and Ruben Aguirre played two madmen, Chaparrón Bonaparte and Lucas Tañeda. As Ruben Aguirre had left the program, the sketch needed to be replaced and that was when Chespirito created El Chavo Del Ocho. Several \"Chavo\" sketches produced before the start of the half-hour series were grouped into half-hour segments and are shown before the \"official\" half-hour episodes in syndication. Many of these were also re-written and re-shot as half-hour long shows later in the show's life.\r\nBroadcast history\r\nOn January 8, 1973, Telesistema Mexicano and Televisión Independiente de México merged to become Televisa. After the merger, on February 26, 1973, El Chavo del Ocho premiered as a half-hour weekly television series.\r\nThe early shows were composed of a sketch at the beginning, featuring Dr. Chapatín, El Chómpiras, or one of Roberto Gómez Bolaños' other characters, and two short episodes of the main character. Those episodes were actually sketches filmed in 1972–73 which probably were supposed to be shown on \"Chespirito,\" which was cancelled. After some of those episodes which introduced the first years of the show, the show began to consist of an almost half-hour episode preceded by one sketch starring Roberto Gómez Bolaños himself and his characters, as in the first show structure.\r\nAt the end of the first season, María Antonieta de las Nieves left the show because of her pregnancy. During the episodes of the first season, including those filmed in 1972–73, it was noted De Las Nieves generally played the female leads and was the first actor credited after Chespirito. In her absence, Florinda Meza took over the female roles for the non-Chavo del 8 sketches, and El Chavo and Quico became a great comic couple. During the period when de las Nieves was out of the series, the argument was made that Chilindrina was living with her aunts in Celaya, Guanajuato. In March 1975, the character made a comeback in an episode dedicated to her: El Regreso de la Chilindrina. During this absence, Bolaños introduced new characters: Ñoño, la Pópis, Malicha, and Godínez.\r\nThe second season began with El Chavo and Quico as the comic child characters and Don Ramón as the charismatic adult character. During that season, the classroom scenes began to appear, alongside other child characters like Ñoño (the son of Señor Barriga, both characters played by Edgar Vivar), Popis (one of Florinda Meza's other characters), and the relaxed Godínez (played by Horacio Gómez Bolaños, brother of Roberto Gómez Bolaños).\r\nDe las Nieves was given \"distinctive\" last billing when she returned in 1975. After Villagrán and Valdés left in 1978 and 1979 respectively, she was moved to top billing after Chespirito again. On the hour-long \"Chespirito\", De las Nieves was often given third billing behind Chespirito and Florinda Meza if playing another character besides Chilindrina, otherwise she always got the special final credit.\r\nWhen Carlos Villagrán left the show, it was explained that Quico had gone to live with his rich grandmother. \"He couldn't stand the riffraff anymore\", Doña Florinda explained. Not long after, Ramón Valdés also left the series. Chilindrina explained that Don Ramón left the city to look for a job and that he wouldn't return until he was a millionaire. With the loss of two of its major supporting characters, the ratings for the show slid and Televisa cancelled El Chavo on January 7, 1980.\r\nOn August 1, 2020, all broadcasters showing El Chavo and other shows by Chespirito in several countries had to suspend the broadcast of the series in their services due to deadlocks between Televisa and the Grupo Chespirito, which owns the characters and the scripts for the episodes. Grupo Televisa is currently in talks with several studios to distribuite past and future projects, including El Chavo.\r\nChespirito\r\nLater in 1980, Gomez Bolaños returned with a revived version of Chespirito featuring El Chavo, El Chapulín Colorado and other characters. The debut of El Chavo in this program was auspicious, with a wealth of new episodes being produced. Moreover, in 1981, Valdés joined Chespirito after starring in some unsuccessful shows alongside Villagrán. However, he left again at the end of the year. The number of new episodes started to decline in the late 1980s and early 1990s, so once again, many early episodes were remade.\r\nEventually, Chespirito's age began to catch up with him and it became harder for him to adequately portray some of his characters, especially El Chavo and El Chapulin Colorado. In 1992, at the age of 63, Chespirito retired the El Chavo character from his show (he did the same thing to El Chapulin Colorado one year later).\r\nConflict with Villagrán and death of Valdés\r\nIn 1978, Villagrán left the show to start his own with Quico, with the permission of Gómez Bolaños. Within some time, he felt that the character's rights were his and sued Gómez Bolaños. The results of the lawsuit were favorable to the show's creator. Later on, Villagrán admitted that his exit was due to jealousy and envy between his character's and El Chavo. According to Vivar, Chespirito was accustomed to write all the best jokes in the show for Quico, whom he knew was very popular with the audience. Regardless of his conflict with Chespirito, Villagrán recorded his last episodes with his cast mates in 1978 with what seemed typical normalcy. Once he abandoned El Chavo del Ocho, Villagrán wanted to use the character on another Televisa show. Gómez Bolaños denied his consent due to Villagrán denying his authorship in creating Quico. Due to this, Azcárraga Milmo opted to cancel the independent project for Quico. Regardless, Villagrán continued to use Quico's character in Venezuela in 1981.\r\nIn that time, producers Valentín Pimstein and Fabián Arnaud asked Gómez Bolaños to write a script for an adapted film of El Chapulin Colorado or El Chavo del Ocho. Gómez Bolaños denied this request due to his belief that El Chavo was uniquely developed in the vecindad and therefore would find it difficult to provide a new storyline that would be relevant with what has already been shown in the series. In its place, they produced El Chanfle, which used the same cast as El Chavo del Ocho. In this movie, Villagrán also appeared, even though he was distanced from his fellow cast mates.\r\nLater, in 1979, Valdés abandoned El Chavo due to personal reasons. Because of this, Chespirito hired Raúl Chato Padilla to integrate into the vecindad in 1980, but Chespirito did not want to replace Don Ramón. In his place, Padilla would portray a new character, Jaimito el Cartero, which in one way or another, became the replacement for Don Ramón. In 1981, Valdés rejoined the cast, but in 1982 he debuted alongside Villagrán in the series Federrico. Six years later, in 1988, he worked with him once more in ¡Ah qué Kiko! . Valdés's health was delicate during this time due to being diagnosed with stomach cancer. On August 9 of that same year, he died.\r\nConflict with De las Nieves\r\nIn 2002, Gómez Bolaños sued De las Nieves due to disagreements over rights to La Chilindrina. In 1995, De las Nieves recorded herself as the owner of the author's rights, to which Gómez Bolaños responded that he was the owner of the character being the creator. De las Nieves was not involved in the recording of the animated series El Chavo del Ocho, and was replaced by Ñoño and Popis.\r\nIn 2013, De las Nieves won the lawsuit and kept author rights over La Chilindrina.\r\nDue to this dispute, Gómez Bolaños and De las Nieves's friendship took a toll and they stopped communicating.\r\nSeasons\r\nProduction\r\nDirection and production fell into the hands of Carmen Ochoa and Enrique Segoviano, whom had previously worked with Gómez Bolaños on the series Chespirito. In some episodes, Gómez Bolaños appears listed in the credits as the scene director, alongside Segoviano. Mary Cabañas, Tere de la Cueva, Ersilia Anderlini and Norma Gutiérrez were Ochoa's and the production team's assistants. Luis Felipe Macías was in charge of production, Saltiel Peláez was responsible for the forum where episodes were filmed, and Gabriel Vázquez was the camera director. At once, there were up to three cameramen to record a single episode; among them, were Andrés H. Salinas, José M. Carrillo, Jaime Sánchez and Armando Soto. The scenography was the responsibility of Julio Lattuf (in episodes from 1976 and 1977), of Gabriel Bernal (in 1977 and 1978) and of Alicia Cázares (in 1979), while Leopoldo Sánchez and Alberto García were in charge. Episodes were recorded in Forum 8 and 5 of Televisa San Ángel, although there were some exceptions where they were filmed outside, such as when the vecindad visits Acapulco. Some sources state that this episode was the only one where the whole cast was filmed together. Costumes were provided by Casa Tostado, located in Mexico City, which specializes in customized designs.\r\nOpening and closing sequence\r\nThe song used in the opening sequence of El Chavo del Ocho is \"The elephant never forgets\" composed by Jean-Jacques Perrey in 1970. This melody is based on Ludwig van Beethoven's Turkish March Op. 113.\r\nIn the opening sequence, De las Nieves was the first in charge of the presentation during the first two seasons (1972 and 1973), then Meza was left in charge when De las Nieves left, since the end of 1973 into beginning of 1974. Previously, in 1974, Jorge Gutiérrez Zamora becomes the one in charge of the presentation. His first presentation was in the episode \"El billete de lotería\". Gutiérrez was in charge until 1979, who was preceded in that same year by Aguirre until the last episode as an independent series in 1980, including in the first years of the series Chespirito (between 1980 and 1981). In 1983, Gabriel Fernández, De las Nieves's husband, acted as the narrator who presents the stellar cast. His first presentation was the episode in which Valdés returns to the show. Regarding the closing sequence, the credits only feature the production team responsible for the respective episode, with the last scene being of them or a related image, along with the musical theme used in the opening.\r\nMusic\r\nIn its first moment, music in El Chavo del Ocho was conducted by Ángel Álvarez, Luis A. Diazayas, René Tirado, and later, by Alejandro García. In some episodes, melodies were used to emphasize certain scenes. Among these are «The Second Star to the Right», originally composed for the animated movie Peter Pan, «Funeral March», written by Frédéric Chopin, «Miss Lilly Higgins Sings Shimmy In Mississippi's Spring» by Argentinian band Les Luthiers, «Minnie's Yoo Hoo» from Disney, «Gonna Fly Now» from Rocky, among others.\r\nIn 1977, Polydor Records, subsidiary of Universal Music, distributed the LP record \"Así cantamos y vacilamos en la vecindad del Chavo\", with songs that were incorporated in some episodes of the series. The record has 10 tracks in total, with a duration of little over a half hour. Among them is the song «La vecindad del Chavo» (also known as «Qué bonita vecindad»), which went on to be one of the musical themes which the series would be associated with, after the melody was used as the opening sequence. Three years later, in 1980, another 3 records named \"Síganme los buenos a la vecindad del Chavo\", were distributed, also in LP format, with songs from El Chapulín Colorado and El Chavo. In 1981, the LP record \"El Chavo canta Eso, eso, eso...!\" came out, with 10 tracks in total, distributed by PolyGram. Over a decade later, in 1992, the first CD with the series music was commercialized in following sequence, such as \"Así cantamos y vacilamos en la vecindad del Chavo\" (2000) and \"Así cantamos y vacilamos en la vecindad del Chavo volumen 2\" (2007), in the same format.\r\nReception\r\nThe show is the most translated Latin American show in history – translated to more than 50 languages, after being shown in several countries. It is the most popular sitcom in the history of Mexican television and lasted for 324 episodes and 316 sketches in the Chespirito show in the 1980s (the 1,300 episode count frequently cited is wrong as it includes all the episodes of El Chavo, El Chapulín, Los Caquitos, Los Chifladitos and other series of Chespirito). It has been rerun on several TV stations since the 1970s. El Chavo is also highly popular in Brazil, where it has been dubbed into Portuguese with the name of Chaves, broadcast by SBT; historically, since its premiere, the show has repeatedly recorded the first audience place at all time-slots in which it was broadcast. The main reasons for the immediate success of the program is the similarity between the social realities and the culture of Brazil and Mexico, which added to the ease of adaptation of the dialogue and jokes between Spanish and Portuguese. In the United States, the show is still shown on UniMás and Galavisión as of 2012. The show in the United States is consistently the No. 1-rated Spanish-language cable program.\r\nThe show was so popular in Latin America and among the Spanish speaking community of the United States that many of the phrases El Chavo and his friends used have become part of the vernacular of countries like Peru, Uruguay, and Argentina. \"Chespirito\" has established legal battles with former El Chavo del Ocho actors out of a desire to prevent them from using the show's characters in Mexico without his permission. Villagrán moved to Argentina in order to use his character's name on his shows (Chespirito is not copyrighted in Argentina). María Antonieta de las Nieves, however, won a court battle against Gómez Bolaños for the right to appear in Mexico as la Chilindrina. Nonetheless, in 2012, after a long judicial battle, de las Nieves retired her character. She declared that a long judicial battle against Bolaños ruined her career and that her public image was tarnished, which \"burned\" her name in the market. Currently, the only cast members who did not sue Bolaños were Édgar Vivar, who retired his character after bariatric surgery, and Bolaños' wife, Florinda Meza.\r\nCritics\r\nEl Chavo rapidly became the most successful show on Channel 8, being one of the few to best the viewing quota from Channel 2 in its time. In the beginning, the series was considered \"vulgar\", even though it counted with a \"good dramatic structure\". Aguirre mentioned that it was qualified as \"trash, stupid content\". In Colombia, the government sought to forbid the distribution of the series due to their belief of it being \"dehumanizing\", while in Brazil some executives from the SBT chain qualified it as \"not recommendable\" for distribution.\r\nEven though Gómez Bolaños declared that the show was not intended for children as an audience, there are studies that children prefer to view shows that allow \"them to relax through laughter\", and El Chavo del Ocho was one of those shows that allowed them to do so. For Valerio Fuenzalida Fernández, from Pontificia Universidad Católica de Chile, many adults \"have in general enormous difficulty to value humor television programs for children, under the prejudice that humor would be a useless and irrelevant distraction, therefore a waste of time\" and would therefore prefer kids to be invested in watching educative shows, which he believed was an incorrect prejudice on their part.\r\nOne of the themes that the show has been criticized for is violence. In a survey conducted in Ecuador, in 2008, to more than 1400 parents and kids, it was concluded that the blows that Don Ramón gives the kids of the vecindad, and the slaps that Doña Florinda gives him, represent a bad influence for the young audience. Patricia Ávila Muñoz, in the Spaniard magazine Sphera Pública, determined that it uses blank humor, and it is apart from the familiar aspect by showing \"isolated characters, and adults who are frequently made fun of by the kids\". She added that the dialogue was \"lazy and tasteless\". She compared the series to The Simpsons, by \"presenting one of the possible reflections of society... but minimizes social issues\". In addition, other authors have included discrimination and the aggressions against physical stereotypes of some of the characters, such as an object of criticism. In this sense, Señor Barriga is always hit by El Chavo. Also, his obesity is cause of him being a constant target of mockery by the other characters. Popis, whose predominant characteristic is her nasally voice, in one moment produced the nonconformity by one parent whom, in one of the tours by the cast, expressed that her form of speaking was a jab at kids who had the same problem.\r\nIn spite of the previous critics, there were those who praised the content of the show. For Chilean editor of the diary El Mercurio, Paulo Ramírez: \"El Chavo is one of the characters and one of those series that is eternal\"; in his analysis, he made emphasis that, in spite of being a Mexican series, it contained \"universal situations\", and recognized the popularity due to whichever spectator could identify \"with a really impressive harmony\" the characters and their situations, especially those relating to friendship and betrayal. In 2010, Ecuador's president, Rafael Correa expressed that El Chavo is \"the best TV show\" and praised the script, the characters, and the actor's abilities, especially Villagrán's as Quico. Due to the type of humor, it is considered the preceding show of double meaning in Latin America.\r\nThe Brazilian writer, Ruth Rocha highlighted, like Ramírez, the universal theme form a perspective that is \"incredibly childlike\". Also, she pointed out that one of the reasons for the radical success was in \"what we see in the kids, animated, but real children in the manner of their relationships, reactions and expressions we can not only see a Mexican kid, but a kid who could be Brazilian, Argentinian, or Chinese, what we see is a child who reminds us we once were too\". In a similar manner, Joaquín Bode noted in his review published on the website Veintemundos.com, that the show became popular with the audience of various countries because it \"reflects the way of being and living of the Latinos very well; but also the unforgettable and loved characters, where they live, and their moral and religious aspects were part of a common identity it's a loyal reflection of the social reality of Latin America: people of low social class, unemployed, single parents, that in spite of all the problems, manage to move on with hope, good humor, loyalty, and friendship\".\r\nBrendan Koerner, from the American online magazine Slate, compared the series style, practically staged on one set (the vecindad), with the musical You're a Good Man, Charlie Brown (1967). He also commented that the Hispanic population in the United States watches El Chavo del Ocho mainly due to \"nostalgia\" which entails watching Mexican productions in a country different from their own. He noted in his reporting that the show keeps being successful due to being transmitted generation after generation. Similar to his opinion, Carolina Sanín, who wrote for Semana opinión (former Revista Arcadia), mentioned that thanks to the \"structure and aesthetics of comedy, and its juxtapositions\", the show became one of the most memorable to her. She reflected the possibility that its content constituted a metaphor regarding education and the nonexistent \"inner child\".\r\nAwards and distinctions\r\nIn 1974, El Chavo was awarded, along with El Chapulín Colorado, with the Heraldo de México by the newspaper of the same name, as \"the best comedy show of Mexican television\". In 2004, the Mexican association, A Favor de lo Mejor, gave the award \"Qualitas\" to El Chavo as \"best entertainment show on Mexican television\" and in 2011, Televisa recognized the franchise as one of the most \"productive brands in the company\" in that year. In the award ceremony, of the respective award, Roberto Gómez Fernández emphasized: \"It passed the test of time, which without doubt is a timeless work which will continue for a long time\". Regarding distinctions, the Chilean magazine Qué Pasa classified El Chavo del Ocho as one of the \"shows most featured on Chilean television\", and Google distinguished it in 2016 as a \"golden button\" for being \"the first show on Mexican television to obtain a million subscribers\" on YouTube.\r\nLegacy\r\nThe popularity the series generated allowed some of actors to present in their own circuses, on the national level as well as international. Such is the case with the circuses for Profesor Jirafales between the years of 1970 and 2000, Quico in the 1990s, La Chilindrina in the 2000s and 2010s, and Señor Barriga. At the same time, the show's creator, Chespirito, has gone on to be an icon in entertainment due to the success of El Chapulin Colorado and El Chavo del 8.\r\nAfter the ending of the series, Gómez Bolaños continued as a writer and screenwriter, and, in 2004, married his co-star, Florinda Meza, while De las Nieves and Villagrán continued their interpretations of Chilindrina and Quico, with whom they presented in other countries and recorded discs. Both had legal issues with Gómez Bolaños due to the author rights for their respective characters, for which they have been distanced from him and other members of the cast. Vivar participated in the movie, El Orfanato (2007) and in the telenovela Para Volver a Amar (2010). Regarding his participation in El Chavo del 8, Vivar mentioned it caused \"nostalgia and good feelings knowing so many people, traveled to many places\" referencing the show's transmission, he mentioned that \"it is a luxury that not everybody has the opportunity to experience\".\r\nEl Chavo del Ocho has been transmitted in televised chains in various countries of Latin America and the United States; until 2011, it continued to distribute to at least 20 countries, among them Mexico. According to writer Julia Burg, the series' success was such that \"episodes can still be seen in various channels across the world and children will keep growing up with El Chavo\", even though \"society changes, different from the preceding one where actions such as hitting kids was a disciplinary action\" for their mischief, which in the contemporary era is not seen as appropriate. The rebroadcasts have made it one of the most successful shows in the history of television, according to Forbes. In Brazil, for example, in 2003 various people protested on the street to request SBT to continue the broadcast of El Chavo on its channel. Their petitions acquired the continued broadcast by executives.\r\nEl Chavo was recognized as \"the Mickey Mouse of Mexican television\", due to its success on the international level and its adaptation of the hit animated series in 2006, the first animated production created by Televisa.\r\nOver the course of the years, homages have been realized by other shows in commemoration to El Chavo, such as in Mexican productions Código F.A.M.A and Big Brother, or the Chilean Teletón 2007, where a sketch was featured in which De las Nieves participated. It has served as inspiration for other programs, such as Vila Maluca, transmitted in Brazil. Regarding the popularity of the characters, an Argentinian survey in 2010 showed that La Chilindrina was the only feminine character that was an audience favorite, while Don Ramón was celebrated with a considerable following by the Brazilian audience (where he is known as Seu Madruga). Brazil has also debuted video games and clothing that have been created in the character's image, apart from being inspiration for some rock bands. In El Salvador, the same character (Don Ramon) served as an image for a civil campaign in 2010, which promoted Salvadorians to not pay extortions to gangsters for a guarantee regarding their safety. In mid-2012, the character Jaimito el Cartero was recognized with a bronze statue located in the Mexican municipality of Tangamandapio, Michoacán, which was where the character was from in El Chavo del 8. Costumes have also been used by personalities such as soccer players Sebastián González, who, in 2004, used El Chavo's distinctive hat to celebrate a goal, and Lionel Messi, who wore Quico's suit during a costume party in 2012.\r\nIn 2012, with the 40th anniversary of his debut as motive, an homage América Celebra a Chespirito was realized in Auditorio Nacional in which almost 10,000 people attended, among them artists such as Juan Gabriel, Xavier Chabelo López and Thalía, and was organized by 17 countries, including Mexico. As part of the festivities, a choreography of the song «Qué bonita vecindad» was played in the Monumento a la Revolución. The program was transmitted in a simultaneous manner in more than 9 Latin American countries, including other choreographies that were done in other countries apart from the one in Mexico. In similar fashion, Correos de México launched a series of five stamps printed with the images of El Chavo and El Chapulín Colorado.\r\nIn 2022, Dish Network brought back El Chavo to life in a commercial, using deepfake technology.\r\nRelated projects\r\nAnimated series\r\nFirst series (2006–2014)\r\nAfter several years of successful reruns, Televisa launched an animated spin-off of the program in October 2006. El Chavo Animado was produced by Ánima Estudios using 2D and 3D computer graphics. They animated the characters with Adobe Flash. Televisa distributed the cartoon throughout Latin America.\r\nThe cartoon also allowed depicting the children to the right scale. Previously, since the children were played by adults in the show, the feel was given to the character through their way of dressing, speaking, and mainly through giving them oversized toys. However, this was not the first attempt to animate it. Previous credits sequences featured a claymation animation.\r\nIn this animated series, Chilindrina doesn't appear due to on-going disputes between María Antonieta de las Nieves and Roberto Gómez Bolaños on the rights of \"La Chilindrina\". De las Nieves feels that she should be entitled to monetary compensation if \"La Chilindrina\", the character she brought to life in the television series, appears in the animated series. Roberto Gómez Bolaños claims that since he created the character, only he owns the rights to such character. This dispute has ended inconclusively.\r\nThe show was dubbed into English by the Dubbing House, a Mexican post-production company, making it the first Chespirito program to be dubbed in English. The English soundtrack was recorded at Henckahontas Studio in Burbank, California.\r\nThe animated series achieved enough fame to have its own videogames, such as a self-titled board/party game for the Nintendo Wii, the racing game El Chavo Kart for Xbox 360 and PlayStation 3, and a social game that could be played through Facebook called La Vecindad del Chavo.\r\nSecond series (TBA)\r\nA second El Chavo animated series, which will take place in the \"Chespirito Media Universe\", is in development.\r\nPotential spin-off\r\nIn December 2020, Roberto Gomez Fernandez revealed that Grupo Chespirito is currently considering an El Chavo spin-off centered on one of its secondary characters.\r\nDenied series finale\r\nDuring a visit to Peru in 2008, Roberto Gómez Bolaños told the media that he originally planned to make a proper finale to El Chavo del Ocho: in this finale, El Chavo would die by being run over by a car, trying to save another kid. However, one of Bolaños' daughters, who is a psychologist, convinced her father to drop the idea, since according to her, it could depress many children and even lead them to commit suicide.",
    "html": "<p>El Chavo (English: The Kid or The Boy, but chavo also meaning cent); — also known as El Chavo del Ocho (English: The Kid from number Eight or The Boy from apartment #8) during its earliest episodes – is a Mexican television sitcom created by Roberto Gómez Bolaños, produced by Televisa. It premiered on April 27, 1972 and ended on June 12, 1992 after 7 seasons and 311 episodes. The series gained enormous popularity in Hispanic America, Brazil, Spain and other countries. The series theme song is a rendition of Ludwig van Beethoven's Turkish March, rearranged by Jean-Jacques Perrey & retitled “The Elephant Never Forgets”.</p><p>The show follows the adventures and tribulations of the title character—a poor orphan nicknamed \"El Chavo\" (which means \"The Kid\" or \"The Boy\"), played by the show's creator, Roberto Gómez Bolaños \"Chespirito\"—and his friends, which often cause conflict, of a comedic nature, between the other inhabitants of a fictional low-income housing complex, or, as called in Mexico, vecindad. The idea for the show emerged from a sketch created by Gómez Bolaños where an 8-year-old boy competed with a balloon vendor in a park, said sketch aired for the first time on April 27, 1972. The show centered great importance into the development of the characters, which were each assigned a distinctive personality. Since the beginning, Gómez Bolaños decided that El Chavo would be directed toward an adult audience, even though the show itself was about adults interpreting kids. The main cast consisted of Gómez Bolaños, Ramón Valdés, Carlos Villagrán, María Antonieta de las Nieves, Florinda Meza, Rubén Aguirre, Angelines Fernández and Édgar Vivar, who interpreted El Chavo, Don Ramón, Quico, Chilindrina, Doña Florinda, Profesor Jirafales, Doña Clotilde and Señor Barriga respectively. Direction and production of the series fell on Gómez Bolaños, Enrique Segoviano and Carmen Ochoa.</p><p>El Chavo first appeared in 1972 as a sketch in the Chespirito show which was produced by Televisión Independiente de México (TIM). In 1973, following the merger of TIM and Telesistema Mexicano, it was produced by Televisa and became a weekly half-hour series, which ran until 1980. After that year, shorts continued to be shown in Chespirito until 1992. At its peak of popularity during the mid-1970s, it had a Latin American audience of over 350 million viewers per episode. Given the popularity of the show, the cast went on a global tour to countries in which the show already aired and, in a series of presentations, the cast would dance and act in front of the public.</p><p>The series spawned an animated version titled El Chavo Animado, which aired from October 2006 to June 2014, just a few months before Bolaños' death.</p><p>The Brazilian Portuguese dub, Chaves, has been transmitted by Brazilian TV Network SBT since 1984. It was also seen on the Brazilian versions of Cartoon Network and Boomerang, and currently is also seen on Multishow. Since 2 May 2011, it has aired in the United States on the UniMás network. It previously aired on sister network Univision and its predecessor, the Spanish International Network.</p><p>El Chavo continues to be popular with syndicated episodes averaging 91 million daily viewers in all of the markets where it is distributed in the Americas. Since it ceased production in 1992, it has earned an estimated US$1.7 billion in syndication fees alone for Televisa.</p><p>El Chavo was also available on Netflix in the United States, but was removed on December 31, 2019.</p><br/><h3>Genre and setting</h3><p>The titular character, El Chavo (meaning \"the boy\"), whose real name is never revealed, is an eight-year-old orphan boy who lives in a neighborhood where he and several other characters, both residents and non-residents, interact with each other on a daily basis.</p><p>The vecindad is owned by the fat and wealthy Señor Barriga (Spanish for \"Mr. Belly\"), who is often seen in the neighborhood to collect the monthly rent from his residents. His best tenants are the widow Doña Florinda (Ms. Florinda) and Doña Clotilde (Ms. Clotilde), who pay every month on time, and his worst tenant is Don Ramón, who never pays his rent and either hides from Señor Barriga until he leaves or uses trickery to waive the payment for later. El Chavo likes to \"hide\" in a wooden barrel located in the vecindad's main courtyard, especially after getting into a disagreement where he ends up getting scolded, and otherwise is usually accompanied by his friends: Quico, Doña Florinda's spoiled, dim-witted and arrogant son, and Chilindrina, Don Ramón's shrewd and mischievous bespectacled daughter. Non-residents who visit the vecindad regularly include Señor Barriga and his equally fat son Ñoño, Profesor Jirafales, the tall, cultured and elegant teacher of a nearby school that the children attend, and Popis, a stuck up girl who speaks nasally.</p><p>Each episode uses comedic strategies, such as slapstick, irony, recurring jokes, and funny situations in which the characters are usually getting into. It includes the use of pre-recorded laughter tracks to emphasize comic scenes.</p><p>The sitcom explores, in a comical manner, the problems that many homeless children face on a daily basis, such as hunger, sadness, loneliness, and a lack of adult supervision and attention. On one episode, for example, Chavo was sitting on the stairsteps of the vecindad at night, dreaming of all the toys he wished that he could have and how he'd play with them. It ended with him returning to the present, sighing wistfully, then pulling out a balero (the only toy he had ever had on a regular basis) made of a stick, a tin can, and a piece of string. He begins to play with it as the camera slowly fades out. Some episodes also have educational endings, teaching, for example, that it is good to take a shower and to not judge a book by its cover.</p><p>The central courtyard is the setting for most of the episodes. Surrounding it are the homes of Doña Florinda and Quico in #14, Doña Clotilde in #71, and Don Ramón and Chilindrina in #72, and from 1982 onwards Jaimito \"El Cartero\", who lives up the stairs in #23. The hallway on the right between #71 and #72 leads \"the other courtyard\", which at times has a fountain in the middle. On the street facade at the left, a corner store and a barber shop are shown adjacent to the neighborhood's entry.</p><p>El Chavo was filmed in a fictitious neighborhood set at studios 2, 5 and 8 of Televisa San Angel in Mexico City.</p><p>In the later seasons, sometimes an unnamed park was shown. Several episodes are set in Professor Jirafales's classroom, where he teaches; all the child characters in the sitcom attend the same classroom, sometimes with their parents. Others are set inside Doña Florinda's restaurant, a barber shop (where Don Ramón worked at one point), and the sidewalk located at the entrance of the vecindad. Three episodes were filmed in Acapulco, which also served as a vacation for the entire cast. In 1992, the last El Chavo sketches were filmed in Professor Jirafales' classroom. The last sketch for El Chavo was a 1992 remake of \"Clases de Inglés\" (English Classes).</p><br/><h3>Characters and cast</h3><ul><li>Roberto Gómez Bolaños as El Chavo Main character, an 8-year-old boy, who arrives at the vecindad after running away from an orphanage where his mom abandoned him. He accustoms hiding in a barrel located at the entrance of the vecindad, but he lives in #8 where a nice lady let him sleep. His real name does not come up in any of the episodes. One of his main traits is the Garrotera, in which his body tenses and 'shrinks' to become paralyzed after being frightened. The cure is being splashed with cold water.</li><li>Main character, an 8-year-old boy, who arrives at the vecindad after running away from an orphanage where his mom abandoned him. He accustoms hiding in a barrel located at the entrance of the vecindad, but he lives in #8 where a nice lady let him sleep. His real name does not come up in any of the episodes. One of his main traits is the Garrotera, in which his body tenses and 'shrinks' to become paralyzed after being frightened. The cure is being splashed with cold water.</li><li>Carlos Villagrán as Quico A 9-year-old boy whose real name is Federico. In one of the episodes, it is mentioned that his father was a naval officer, which is why he is usually dressed in a sailor suit. He lives in #14 with his mother Doña Florinda. He is arrogant and envious at the same time, which is why he usually gets into disagreements with other children in the vecindad.</li><li>A 9-year-old boy whose real name is Federico. In one of the episodes, it is mentioned that his father was a naval officer, which is why he is usually dressed in a sailor suit. He lives in #14 with his mother Doña Florinda. He is arrogant and envious at the same time, which is why he usually gets into disagreements with other children in the vecindad.</li><li>María Antonieta de las Nieves as La Chilindrina and Doña Nieves An 8-year-old freckled girl, daughter of Don Ramón. She is mischievous and intelligent. She is friends with El Chavo and Quico. She is in love with El Chavo, which is why she dislikes Paty, his love interest in one of the episodes.</li><li>An 8-year-old freckled girl, daughter of Don Ramón. She is mischievous and intelligent. She is friends with El Chavo and Quico. She is in love with El Chavo, which is why she dislikes Paty, his love interest in one of the episodes.</li><li>Ramón Valdés as Don Ramón Lives in #72 with his daughter Chilindrina. He is unemployed and over 14 months behind on rent, indebted to Señor Barriga, which is why he always tries to avoid him as soon as Señor Barriga enters the vecindad.</li><li>Lives in #72 with his daughter Chilindrina. He is unemployed and over 14 months behind on rent, indebted to Señor Barriga, which is why he always tries to avoid him as soon as Señor Barriga enters the vecindad.</li><li>Florinda Meza as Doña Florinda and Popis Lives in #14 with her son Quico. She is prideful, cocky, and haughty. She belittles her neighbors due to financial situations, referring to them as chusma. She is in love with Profesor Jirafales. Popis is the niece of Doña Florinda and generally stays with her in the apartment when she visits. She also attends the same class Profesor Jirafales teaches. She is always carrying a doll, Serafina. Popis is as her nickname is: stuck-up.</li><li>Lives in #14 with her son Quico. She is prideful, cocky, and haughty. She belittles her neighbors due to financial situations, referring to them as chusma. She is in love with Profesor Jirafales.</li><li>Popis is the niece of Doña Florinda and generally stays with her in the apartment when she visits. She also attends the same class Profesor Jirafales teaches. She is always carrying a doll, Serafina. Popis is as her nickname is: stuck-up.</li><li>Rubén Aguirre as Profesor Jirafales Elementary teacher where the vecindad children attend. Has a romantic relationship with Doña Florinda. One of his most expressive characteristics is \"Ta, ta, ta, taaaa, ta!\" when he gets angry. His large stature is the target for many jokes amongst El Chavo and his friends (an example being his nickname \"Profesor Longaniza\").</li><li>Elementary teacher where the vecindad children attend. Has a romantic relationship with Doña Florinda. One of his most expressive characteristics is \"Ta, ta, ta, taaaa, ta!\" when he gets angry. His large stature is the target for many jokes amongst El Chavo and his friends (an example being his nickname \"Profesor Longaniza\").</li><li>Édgar Vivar as Señor Barriga and Ñoño Owner of La Vecindad. In most episodes, he is greeted by being hit by El Chavo when he is out playing on the patio. Due to his obesity, he is a constant target as a joke for everyone else. Ñoño is son of Señor Barriga. He is obese, and like his father, is target to ridicule by the other children. He also attends the same class Profesor Jirafales teaches.</li><li>Owner of La Vecindad. In most episodes, he is greeted by being hit by El Chavo when he is out playing on the patio. Due to his obesity, he is a constant target as a joke for everyone else.</li><li>Ñoño is son of Señor Barriga. He is obese, and like his father, is target to ridicule by the other children. He also attends the same class Profesor Jirafales teaches.</li><li>Angelines Fernández as Doña Clotilde \"La bruja del 71\" (The Witch of 71) Single woman lives in #71. Her appearance and strange mannerisms dubbed her \"The Witch of 71\" by the vecindad children. Having a dog named \"Satanás\" and conducting a spiritual session only confirmed the children's beliefs. She is in love with Don Ramón.</li><li>Single woman lives in #71. Her appearance and strange mannerisms dubbed her \"The Witch of 71\" by the vecindad children. Having a dog named \"Satanás\" and conducting a spiritual session only confirmed the children's beliefs. She is in love with Don Ramón.</li><li>Horacio Gómez Bolaños as Godínez Attends the class Profesor Jirafales teaches. Normally ignores any questions directed at him.</li><li>Attends the class Profesor Jirafales teaches. Normally ignores any questions directed at him.</li><li>Raúl Padilla as Jaimito \"El Cartero\" (The Mailman) Old, gentle man in charge of the mail in the vecindad. He lives alone. He is always walking by his bike because to get the mail delivery job, he was required to know how to bike; he lied.</li><li>Old, gentle man in charge of the mail in the vecindad. He lives alone. He is always walking by his bike because to get the mail delivery job, he was required to know how to bike; he lied.</li></ul><br/><h3>History</h3><h4>Origins</h4><p>By 1972, Roberto Gómez Bolaños was already well known in Mexico for his self-titled sketch comedy show, Chespirito, which was produced by Televisión Independiente de México and aired on XHTIM-TV, channel 8 (now XEQ-TV channel 9, Gala TV). He had already introduced El Chapulín Colorado and other characters.</p><p>Roberto Gómez Bolaños was the show's main creator and star. He called Florinda Meza to act in the show first; Chespirito and Meza later married. Édgar Vivar was the second actor chosen for the show. A mutual friend recommended Vivar to Gómez Bolaños when he started casting. Gómez Bolaños cited Vivar at Forum 8 at Telesistema Mexicano – where shooting was taking place. Vivar showed up as a scene was shooting; he laughed and the scene had to 'cut'. Gómez Bolaños approached him, asked him if he was Vivar, and told him that they would not be using an earpiece, to which Vivar responded that he didn't know what he was talking about. He hired him on the spot. Roberto Gómez Bolaños recruited Ramón Valdés because he had known Valdés for years and had seen multiple movies Valdés had made. Then, Rubén Aguirre was cast in the show as the character of \"Profesor Jirafales\". Aguirre and Roberto Gómez Bolaños had been working on scripts together for years, and Aguirre had already been playing the character of Professor Jirafales on another Chespirito show, Supergenios de la Mesa Cuadrada, which spoofed current events panel discussion. Carlos Villagrán just happened to be a friend of Aguirre who was a newspaper reporter, and he went to a party hosted by Aguirre. Villagrán did a comedy step where he blew his cheeks out of proportion, and Aguirre told Roberto Gómez Bolaños about his friend's hidden talent. Villagrán was promptly hired for the show. María Antonieta de las Nieves was a voice-over only actress who used to go to Televisa to make announcements. Upon hearing her voice, Roberto Gómez Bolaños thought she was perfect for the show. At first, she refused by telling him she was not a comedy actress, but Roberto Gómez Bolaños's retort challenged her: \"Then you're not a good actress: there are no dramatic or comic actors—there are only actors.\" The last additions to the show were Angelines Fernández, a former film actress and Horacio Gómez Bolaños, Roberto's younger brother who had never considered acting before; he was originally to oversee the show's marketing.</p><p>The first El Chavo sketch was broadcast on 1972 and there is little information about that time, but possibly premiered on April 27, since El Chavo was created to replace the sketch Los Chifladitos, in which Chespirito and Ruben Aguirre played two madmen, Chaparrón Bonaparte and Lucas Tañeda. As Ruben Aguirre had left the program, the sketch needed to be replaced and that was when Chespirito created El Chavo Del Ocho. Several \"Chavo\" sketches produced before the start of the half-hour series were grouped into half-hour segments and are shown before the \"official\" half-hour episodes in syndication. Many of these were also re-written and re-shot as half-hour long shows later in the show's life.</p><h4>Broadcast history</h4><p>On January 8, 1973, Telesistema Mexicano and Televisión Independiente de México merged to become Televisa. After the merger, on February 26, 1973, El Chavo del Ocho premiered as a half-hour weekly television series.</p><p>The early shows were composed of a sketch at the beginning, featuring Dr. Chapatín, El Chómpiras, or one of Roberto Gómez Bolaños' other characters, and two short episodes of the main character. Those episodes were actually sketches filmed in 1972–73 which probably were supposed to be shown on \"Chespirito,\" which was cancelled. After some of those episodes which introduced the first years of the show, the show began to consist of an almost half-hour episode preceded by one sketch starring Roberto Gómez Bolaños himself and his characters, as in the first show structure.</p><p>At the end of the first season, María Antonieta de las Nieves left the show because of her pregnancy. During the episodes of the first season, including those filmed in 1972–73, it was noted De Las Nieves generally played the female leads and was the first actor credited after Chespirito. In her absence, Florinda Meza took over the female roles for the non-Chavo del 8 sketches, and El Chavo and Quico became a great comic couple. During the period when de las Nieves was out of the series, the argument was made that Chilindrina was living with her aunts in Celaya, Guanajuato. In March 1975, the character made a comeback in an episode dedicated to her: El Regreso de la Chilindrina. During this absence, Bolaños introduced new characters: Ñoño, la Pópis, Malicha, and Godínez.</p><p>The second season began with El Chavo and Quico as the comic child characters and Don Ramón as the charismatic adult character. During that season, the classroom scenes began to appear, alongside other child characters like Ñoño (the son of Señor Barriga, both characters played by Edgar Vivar), Popis (one of Florinda Meza's other characters), and the relaxed Godínez (played by Horacio Gómez Bolaños, brother of Roberto Gómez Bolaños).</p><p>De las Nieves was given \"distinctive\" last billing when she returned in 1975. After Villagrán and Valdés left in 1978 and 1979 respectively, she was moved to top billing after Chespirito again. On the hour-long \"Chespirito\", De las Nieves was often given third billing behind Chespirito and Florinda Meza if playing another character besides Chilindrina, otherwise she always got the special final credit.</p><p>When Carlos Villagrán left the show, it was explained that Quico had gone to live with his rich grandmother. \"He couldn't stand the riffraff anymore\", Doña Florinda explained. Not long after, Ramón Valdés also left the series. Chilindrina explained that Don Ramón left the city to look for a job and that he wouldn't return until he was a millionaire. With the loss of two of its major supporting characters, the ratings for the show slid and Televisa cancelled El Chavo on January 7, 1980.</p><p>On August 1, 2020, all broadcasters showing El Chavo and other shows by Chespirito in several countries had to suspend the broadcast of the series in their services due to deadlocks between Televisa and the Grupo Chespirito, which owns the characters and the scripts for the episodes. Grupo Televisa is currently in talks with several studios to distribuite past and future projects, including El Chavo.</p><h4>Chespirito</h4><p>Later in 1980, Gomez Bolaños returned with a revived version of Chespirito featuring El Chavo, El Chapulín Colorado and other characters. The debut of El Chavo in this program was auspicious, with a wealth of new episodes being produced. Moreover, in 1981, Valdés joined Chespirito after starring in some unsuccessful shows alongside Villagrán. However, he left again at the end of the year. The number of new episodes started to decline in the late 1980s and early 1990s, so once again, many early episodes were remade.</p><p>Eventually, Chespirito's age began to catch up with him and it became harder for him to adequately portray some of his characters, especially El Chavo and El Chapulin Colorado. In 1992, at the age of 63, Chespirito retired the El Chavo character from his show (he did the same thing to El Chapulin Colorado one year later).</p><h4>Conflict with Villagrán and death of Valdés</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>does not <span>cite</span> any <span>sources</span></b>.<span class=\"hide-when-compact\"> Please help <span class=\"external text\">improve this section</span> by <span>adding citations to reliable sources</span>. Unsourced material may be challenged and <span>removed</span>.</span>  <span class=\"date-container\"><i>(<span class=\"date\">April 2023</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><p>In 1978, Villagrán left the show to start his own with Quico, with the permission of Gómez Bolaños. Within some time, he felt that the character's rights were his and sued Gómez Bolaños. The results of the lawsuit were favorable to the show's creator. Later on, Villagrán admitted that his exit was due to jealousy and envy between his character's and El Chavo. According to Vivar, Chespirito was accustomed to write all the best jokes in the show for Quico, whom he knew was very popular with the audience. Regardless of his conflict with Chespirito, Villagrán recorded his last episodes with his cast mates in 1978 with what seemed typical normalcy. Once he abandoned El Chavo del Ocho, Villagrán wanted to use the character on another Televisa show. Gómez Bolaños denied his consent due to Villagrán denying his authorship in creating Quico. Due to this, Azcárraga Milmo opted to cancel the independent project for Quico. Regardless, Villagrán continued to use Quico's character in Venezuela in 1981.</p><p>In that time, producers Valentín Pimstein and Fabián Arnaud asked Gómez Bolaños to write a script for an adapted film of El Chapulin Colorado or El Chavo del Ocho. Gómez Bolaños denied this request due to his belief that El Chavo was uniquely developed in the vecindad and therefore would find it difficult to provide a new storyline that would be relevant with what has already been shown in the series. In its place, they produced El Chanfle, which used the same cast as El Chavo del Ocho. In this movie, Villagrán also appeared, even though he was distanced from his fellow cast mates.</p><p>Later, in 1979, Valdés abandoned El Chavo due to personal reasons. Because of this, Chespirito hired Raúl Chato Padilla to integrate into the vecindad in 1980, but Chespirito did not want to replace Don Ramón. In his place, Padilla would portray a new character, Jaimito el Cartero, which in one way or another, became the replacement for Don Ramón. In 1981, Valdés rejoined the cast, but in 1982 he debuted alongside Villagrán in the series Federrico. Six years later, in 1988, he worked with him once more in ¡Ah qué Kiko! . Valdés's health was delicate during this time due to being diagnosed with stomach cancer. On August 9 of that same year, he died.</p><h4>Conflict with De las Nieves</h4><p>In 2002, Gómez Bolaños sued De las Nieves due to disagreements over rights to La Chilindrina. In 1995, De las Nieves recorded herself as the owner of the author's rights, to which Gómez Bolaños responded that he was the owner of the character being the creator. De las Nieves was not involved in the recording of the animated series El Chavo del Ocho, and was replaced by Ñoño and Popis.</p><p>In 2013, De las Nieves won the lawsuit and kept author rights over La Chilindrina.</p><p>Due to this dispute, Gómez Bolaños and De las Nieves's friendship took a toll and they stopped communicating.</p><br/><h3>Seasons</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Season</th><th>Episodes</th><th>Season premiere</th><th>Season finale</th></tr><tr><td style=\"background:#cccc00; color:#100; text-align:center;\">Sketches</td><td style=\"text-align:center;\">44</td><td style=\"text-align:center;\">April 27, 1972</td><td style=\"text-align:center;\">February 20, 1973</td></tr><tr><td style=\"background:#f5ef78; color:#100; text-align:center;\">1</td><td style=\"text-align:center;\">52 (83 segments)</td><td style=\"text-align:center;\">February 26, 1973</td><td style=\"text-align:center;\">February 18, 1974</td></tr><tr><td style=\"background:#d293fd; color:#100; text-align:center;\">2</td><td style=\"text-align:center;\">43 (52 segments)</td><td style=\"text-align:center;\">February 25, 1974</td><td style=\"text-align:center;\">February 17, 1975</td></tr><tr><td style=\"background:#87d3f8; color:#100; text-align:center;\">3</td><td style=\"text-align:center;\">40 (42 segments)</td><td style=\"text-align:center;\">February 24, 1975</td><td style=\"text-align:center;\">February 16, 1976</td></tr><tr><td style=\"background:#FFB591; color:#100; text-align:center;\">4</td><td style=\"text-align:center;\">43</td><td style=\"text-align:center;\">February 23, 1976</td><td style=\"text-align:center;\">February 14, 1977</td></tr><tr><td style=\"background:#669999; color:#100; text-align:center;\">5</td><td style=\"text-align:center;\">42</td><td style=\"text-align:center;\">February 21, 1977</td><td style=\"text-align:center;\">December 5, 1977</td></tr><tr><td style=\"background:#CC99CC; color:#100; text-align:center;\">6</td><td style=\"text-align:center;\">44</td><td style=\"text-align:center;\">March 6, 1978</td><td style=\"text-align:center;\">February 12, 1979</td></tr><tr><td style=\"background:#d15588; color:#100; text-align:center;\">7</td><td style=\"text-align:center;\">47</td><td style=\"text-align:center;\">February 19, 1979</td><td style=\"text-align:center;\">January 7, 1980</td></tr></tbody></table><br/><h3>Production</h3><p>Direction and production fell into the hands of Carmen Ochoa and Enrique Segoviano, whom had previously worked with Gómez Bolaños on the series Chespirito. In some episodes, Gómez Bolaños appears listed in the credits as the scene director, alongside Segoviano. Mary Cabañas, Tere de la Cueva, Ersilia Anderlini and Norma Gutiérrez were Ochoa's and the production team's assistants. Luis Felipe Macías was in charge of production, Saltiel Peláez was responsible for the forum where episodes were filmed, and Gabriel Vázquez was the camera director. At once, there were up to three cameramen to record a single episode; among them, were Andrés H. Salinas, José M. Carrillo, Jaime Sánchez and Armando Soto. The scenography was the responsibility of Julio Lattuf (in episodes from 1976 and 1977), of Gabriel Bernal (in 1977 and 1978) and of Alicia Cázares (in 1979), while Leopoldo Sánchez and Alberto García were in charge. Episodes were recorded in Forum 8 and 5 of Televisa San Ángel, although there were some exceptions where they were filmed outside, such as when the vecindad visits Acapulco. Some sources state that this episode was the only one where the whole cast was filmed together. Costumes were provided by Casa Tostado, located in Mexico City, which specializes in customized designs.</p><h4>Opening and closing sequence</h4><p>The song used in the opening sequence of El Chavo del Ocho is \"The elephant never forgets\" composed by Jean-Jacques Perrey in 1970. This melody is based on Ludwig van Beethoven's Turkish March Op. 113.</p><p>In the opening sequence, De las Nieves was the first in charge of the presentation during the first two seasons (1972 and 1973), then Meza was left in charge when De las Nieves left, since the end of 1973 into beginning of 1974. Previously, in 1974, Jorge Gutiérrez Zamora becomes the one in charge of the presentation. His first presentation was in the episode \"El billete de lotería\". Gutiérrez was in charge until 1979, who was preceded in that same year by Aguirre until the last episode as an independent series in 1980, including in the first years of the series Chespirito (between 1980 and 1981). In 1983, Gabriel Fernández, De las Nieves's husband, acted as the narrator who presents the stellar cast. His first presentation was the episode in which Valdés returns to the show. Regarding the closing sequence, the credits only feature the production team responsible for the respective episode, with the last scene being of them or a related image, along with the musical theme used in the opening.</p><h4>Music</h4><p>In its first moment, music in El Chavo del Ocho was conducted by Ángel Álvarez, Luis A. Diazayas, René Tirado, and later, by Alejandro García. In some episodes, melodies were used to emphasize certain scenes. Among these are «The Second Star to the Right», originally composed for the animated movie Peter Pan, «Funeral March», written by Frédéric Chopin, «Miss Lilly Higgins Sings Shimmy In Mississippi's Spring» by Argentinian band Les Luthiers, «Minnie's Yoo Hoo» from Disney, «Gonna Fly Now» from Rocky, among others.</p><p>In 1977, Polydor Records, subsidiary of Universal Music, distributed the LP record \"Así cantamos y vacilamos en la vecindad del Chavo\", with songs that were incorporated in some episodes of the series. The record has 10 tracks in total, with a duration of little over a half hour. Among them is the song «La vecindad del Chavo» (also known as «Qué bonita vecindad»), which went on to be one of the musical themes which the series would be associated with, after the melody was used as the opening sequence. Three years later, in 1980, another 3 records named \"Síganme los buenos a la vecindad del Chavo\", were distributed, also in LP format, with songs from El Chapulín Colorado and El Chavo. In 1981, the LP record \"El Chavo canta Eso, eso, eso...!\" came out, with 10 tracks in total, distributed by PolyGram. Over a decade later, in 1992, the first CD with the series music was commercialized in following sequence, such as \"Así cantamos y vacilamos en la vecindad del Chavo\" (2000) and \"Así cantamos y vacilamos en la vecindad del Chavo volumen 2\" (2007), in the same format.</p><br/><h3>Reception</h3><p>The show is the most translated Latin American show in history – translated to more than 50 languages, after being shown in several countries. It is the most popular sitcom in the history of Mexican television and lasted for 324 episodes and 316 sketches in the Chespirito show in the 1980s (the 1,300 episode count frequently cited is wrong as it includes all the episodes of El Chavo, El Chapulín, Los Caquitos, Los Chifladitos and other series of Chespirito). It has been rerun on several TV stations since the 1970s. El Chavo is also highly popular in Brazil, where it has been dubbed into Portuguese with the name of Chaves, broadcast by SBT; historically, since its premiere, the show has repeatedly recorded the first audience place at all time-slots in which it was broadcast. The main reasons for the immediate success of the program is the similarity between the social realities and the culture of Brazil and Mexico, which added to the ease of adaptation of the dialogue and jokes between Spanish and Portuguese. In the United States, the show is still shown on UniMás and Galavisión as of 2012. The show in the United States is consistently the No. 1-rated Spanish-language cable program.</p><p>The show was so popular in Latin America and among the Spanish speaking community of the United States that many of the phrases El Chavo and his friends used have become part of the vernacular of countries like Peru, Uruguay, and Argentina. \"Chespirito\" has established legal battles with former El Chavo del Ocho actors out of a desire to prevent them from using the show's characters in Mexico without his permission. Villagrán moved to Argentina in order to use his character's name on his shows (Chespirito is not copyrighted in Argentina). María Antonieta de las Nieves, however, won a court battle against Gómez Bolaños for the right to appear in Mexico as la Chilindrina. Nonetheless, in 2012, after a long judicial battle, de las Nieves retired her character. She declared that a long judicial battle against Bolaños ruined her career and that her public image was tarnished, which \"burned\" her name in the market. Currently, the only cast members who did not sue Bolaños were Édgar Vivar, who retired his character after bariatric surgery, and Bolaños' wife, Florinda Meza.</p><h4>Critics</h4><p>El Chavo rapidly became the most successful show on Channel 8, being one of the few to best the viewing quota from Channel 2 in its time. In the beginning, the series was considered \"vulgar\", even though it counted with a \"good dramatic structure\". Aguirre mentioned that it was qualified as \"trash, stupid content\". In Colombia, the government sought to forbid the distribution of the series due to their belief of it being \"dehumanizing\", while in Brazil some executives from the SBT chain qualified it as \"not recommendable\" for distribution.</p><p>Even though Gómez Bolaños declared that the show was not intended for children as an audience, there are studies that children prefer to view shows that allow \"them to relax through laughter\", and El Chavo del Ocho was one of those shows that allowed them to do so. For Valerio Fuenzalida Fernández, from Pontificia Universidad Católica de Chile, many adults \"have in general enormous difficulty to value humor television programs for children, under the prejudice that humor would be a useless and irrelevant distraction, therefore a waste of time\" and would therefore prefer kids to be invested in watching educative shows, which he believed was an incorrect prejudice on their part.</p><p>One of the themes that the show has been criticized for is violence. In a survey conducted in Ecuador, in 2008, to more than 1400 parents and kids, it was concluded that the blows that Don Ramón gives the kids of the vecindad, and the slaps that Doña Florinda gives him, represent a bad influence for the young audience. Patricia Ávila Muñoz, in the Spaniard magazine Sphera Pública, determined that it uses blank humor, and it is apart from the familiar aspect by showing \"isolated characters, and adults who are frequently made fun of by the kids\". She added that the dialogue was \"lazy and tasteless\". She compared the series to The Simpsons, by \"presenting one of the possible reflections of society... but minimizes social issues\". In addition, other authors have included discrimination and the aggressions against physical stereotypes of some of the characters, such as an object of criticism. In this sense, Señor Barriga is always hit by El Chavo. Also, his obesity is cause of him being a constant target of mockery by the other characters. Popis, whose predominant characteristic is her nasally voice, in one moment produced the nonconformity by one parent whom, in one of the tours by the cast, expressed that her form of speaking was a jab at kids who had the same problem.</p><p>In spite of the previous critics, there were those who praised the content of the show. For Chilean editor of the diary El Mercurio, Paulo Ramírez: \"El Chavo is one of the characters and one of those series that is eternal\"; in his analysis, he made emphasis that, in spite of being a Mexican series, it contained \"universal situations\", and recognized the popularity due to whichever spectator could identify \"with a really impressive harmony\" the characters and their situations, especially those relating to friendship and betrayal. In 2010, Ecuador's president, Rafael Correa expressed that El Chavo is \"the best TV show\" and praised the script, the characters, and the actor's abilities, especially Villagrán's as Quico. Due to the type of humor, it is considered the preceding show of double meaning in Latin America.</p><p>The Brazilian writer, Ruth Rocha highlighted, like Ramírez, the universal theme form a perspective that is \"incredibly childlike\". Also, she pointed out that one of the reasons for the radical success was in \"what we see in the kids, animated, but real children in the manner of their relationships, reactions and expressions we can not only see a Mexican kid, but a kid who could be Brazilian, Argentinian, or Chinese, what we see is a child who reminds us we once were too\". In a similar manner, Joaquín Bode noted in his review published on the website Veintemundos.com, that the show became popular with the audience of various countries because it \"reflects the way of being and living of the Latinos very well; but also the unforgettable and loved characters, where they live, and their moral and religious aspects were part of a common identity it's a loyal reflection of the social reality of Latin America: people of low social class, unemployed, single parents, that in spite of all the problems, manage to move on with hope, good humor, loyalty, and friendship\".</p><p>Brendan Koerner, from the American online magazine Slate, compared the series style, practically staged on one set (the vecindad), with the musical You're a Good Man, Charlie Brown (1967). He also commented that the Hispanic population in the United States watches El Chavo del Ocho mainly due to \"nostalgia\" which entails watching Mexican productions in a country different from their own. He noted in his reporting that the show keeps being successful due to being transmitted generation after generation. Similar to his opinion, Carolina Sanín, who wrote for Semana opinión (former Revista Arcadia), mentioned that thanks to the \"structure and aesthetics of comedy, and its juxtapositions\", the show became one of the most memorable to her. She reflected the possibility that its content constituted a metaphor regarding education and the nonexistent \"inner child\".</p><h4>Awards and distinctions</h4><p>In 1974, El Chavo was awarded, along with El Chapulín Colorado, with the Heraldo de México by the newspaper of the same name, as \"the best comedy show of Mexican television\". In 2004, the Mexican association, A Favor de lo Mejor, gave the award \"Qualitas\" to El Chavo as \"best entertainment show on Mexican television\" and in 2011, Televisa recognized the franchise as one of the most \"productive brands in the company\" in that year. In the award ceremony, of the respective award, Roberto Gómez Fernández emphasized: \"It passed the test of time, which without doubt is a timeless work which will continue for a long time\". Regarding distinctions, the Chilean magazine Qué Pasa classified El Chavo del Ocho as one of the \"shows most featured on Chilean television\", and Google distinguished it in 2016 as a \"golden button\" for being \"the first show on Mexican television to obtain a million subscribers\" on YouTube.</p><h4>Legacy</h4><p>The popularity the series generated allowed some of actors to present in their own circuses, on the national level as well as international. Such is the case with the circuses for Profesor Jirafales between the years of 1970 and 2000, Quico in the 1990s, La Chilindrina in the 2000s and 2010s, and Señor Barriga. At the same time, the show's creator, Chespirito, has gone on to be an icon in entertainment due to the success of El Chapulin Colorado and El Chavo del 8.</p><p>After the ending of the series, Gómez Bolaños continued as a writer and screenwriter, and, in 2004, married his co-star, Florinda Meza, while De las Nieves and Villagrán continued their interpretations of Chilindrina and Quico, with whom they presented in other countries and recorded discs. Both had legal issues with Gómez Bolaños due to the author rights for their respective characters, for which they have been distanced from him and other members of the cast. Vivar participated in the movie, El Orfanato (2007) and in the telenovela Para Volver a Amar (2010). Regarding his participation in El Chavo del 8, Vivar mentioned it caused \"nostalgia and good feelings knowing so many people, traveled to many places\" referencing the show's transmission, he mentioned that \"it is a luxury that not everybody has the opportunity to experience\".</p><p>El Chavo del Ocho has been transmitted in televised chains in various countries of Latin America and the United States; until 2011, it continued to distribute to at least 20 countries, among them Mexico. According to writer Julia Burg, the series' success was such that \"episodes can still be seen in various channels across the world and children will keep growing up with El Chavo\", even though \"society changes, different from the preceding one where actions such as hitting kids was a disciplinary action\" for their mischief, which in the contemporary era is not seen as appropriate. The rebroadcasts have made it one of the most successful shows in the history of television, according to Forbes. In Brazil, for example, in 2003 various people protested on the street to request SBT to continue the broadcast of El Chavo on its channel. Their petitions acquired the continued broadcast by executives.</p><p>El Chavo was recognized as \"the Mickey Mouse of Mexican television\", due to its success on the international level and its adaptation of the hit animated series in 2006, the first animated production created by Televisa.</p><p>Over the course of the years, homages have been realized by other shows in commemoration to El Chavo, such as in Mexican productions Código F.A.M.A and Big Brother, or the Chilean Teletón 2007, where a sketch was featured in which De las Nieves participated. It has served as inspiration for other programs, such as Vila Maluca, transmitted in Brazil. Regarding the popularity of the characters, an Argentinian survey in 2010 showed that La Chilindrina was the only feminine character that was an audience favorite, while Don Ramón was celebrated with a considerable following by the Brazilian audience (where he is known as Seu Madruga). Brazil has also debuted video games and clothing that have been created in the character's image, apart from being inspiration for some rock bands. In El Salvador, the same character (Don Ramon) served as an image for a civil campaign in 2010, which promoted Salvadorians to not pay extortions to gangsters for a guarantee regarding their safety. In mid-2012, the character Jaimito el Cartero was recognized with a bronze statue located in the Mexican municipality of Tangamandapio, Michoacán, which was where the character was from in El Chavo del 8. Costumes have also been used by personalities such as soccer players Sebastián González, who, in 2004, used El Chavo's distinctive hat to celebrate a goal, and Lionel Messi, who wore Quico's suit during a costume party in 2012.</p><p>In 2012, with the 40th anniversary of his debut as motive, an homage América Celebra a Chespirito was realized in Auditorio Nacional in which almost 10,000 people attended, among them artists such as Juan Gabriel, Xavier Chabelo López and Thalía, and was organized by 17 countries, including Mexico. As part of the festivities, a choreography of the song «Qué bonita vecindad» was played in the Monumento a la Revolución. The program was transmitted in a simultaneous manner in more than 9 Latin American countries, including other choreographies that were done in other countries apart from the one in Mexico. In similar fashion, Correos de México launched a series of five stamps printed with the images of El Chavo and El Chapulín Colorado.</p><p>In 2022, Dish Network brought back El Chavo to life in a commercial, using deepfake technology.</p><br/><h3>Related projects</h3><h4>Animated series</h4><h4>First series (2006–2014)</h4><p>After several years of successful reruns, Televisa launched an animated spin-off of the program in October 2006. El Chavo Animado was produced by Ánima Estudios using 2D and 3D computer graphics. They animated the characters with Adobe Flash. Televisa distributed the cartoon throughout Latin America.</p><p>The cartoon also allowed depicting the children to the right scale. Previously, since the children were played by adults in the show, the feel was given to the character through their way of dressing, speaking, and mainly through giving them oversized toys. However, this was not the first attempt to animate it. Previous credits sequences featured a claymation animation.</p><p>In this animated series, Chilindrina doesn't appear due to on-going disputes between María Antonieta de las Nieves and Roberto Gómez Bolaños on the rights of \"La Chilindrina\". De las Nieves feels that she should be entitled to monetary compensation if \"La Chilindrina\", the character she brought to life in the television series, appears in the animated series. Roberto Gómez Bolaños claims that since he created the character, only he owns the rights to such character. This dispute has ended inconclusively.</p><p>The show was dubbed into English by the Dubbing House, a Mexican post-production company, making it the first Chespirito program to be dubbed in English. The English soundtrack was recorded at Henckahontas Studio in Burbank, California.</p><p>The animated series achieved enough fame to have its own videogames, such as a self-titled board/party game for the Nintendo Wii, the racing game El Chavo Kart for Xbox 360 and PlayStation 3, and a social game that could be played through Facebook called La Vecindad del Chavo.</p><h4>Second series (TBA)</h4><p>A second El Chavo animated series, which will take place in the \"Chespirito Media Universe\", is in development.</p><h4>Potential spin-off</h4><p>In December 2020, Roberto Gomez Fernandez revealed that Grupo Chespirito is currently considering an El Chavo spin-off centered on one of its secondary characters.</p><br/><h3>Denied series finale</h3><p>During a visit to Peru in 2008, Roberto Gómez Bolaños told the media that he originally planned to make a proper finale to El Chavo del Ocho: in this finale, El Chavo would die by being run over by a car, trying to save another kid. However, one of Bolaños' daughters, who is a psychologist, convinced her father to drop the idea, since according to her, it could depress many children and even lead them to commit suicide.</p><br/>"
  },
  "errorMessage": ""
}