{
  "imDbId": "tt10638036",
  "title": "Heartstopper",
  "fullTitle": "Heartstopper (TV Series 2022– )",
  "type": "TVSeries",
  "year": "2022",
  "items": [
    {
      "username": "Benslie",
      "userUrl": "https://www.imdb.com/user/ur69664646",
      "reviewLink": "https://www.imdb.com/review/rw8083318",
      "warningSpoilers": false,
      "date": "23 April 2022",
      "rate": "10",
      "helpful": "380 out of 420 found this helpful.",
      "title": "A relatable series for everybody",
      "content": "As a fan of the, \"Heartstopper\" comic I can easily say this show is for those who have and haven't heard of this series and just want a feel-good show to watch.For me, the best part of this series easily was the acting done by everybody. The whole cast, minus two actors, had the tough job of having to bring these characters to life and try to bring something new to them while staying true as well and they all nailed it. For most of the people in this cast, this was their first outing with acting and you could never tell that fact. They all just acted like normal teenagers going through this tough period in their lives and like I said still staying true to their character. The whole cast's performances were standouts for me personally but I especially enjoyed Joe Locke and Kit Connor's performances in this series. They both did such excellent jobs bringing their iconic characters to life and acting like these nervous high schoolers who don't fully understand things. It also wasn't just the main cast who did amazing jobs but, the side characters as well. Sebastian Croft, who plays Ben, did a scarily good job with bringing Ben to life that there's no way anybody could like him at all. The other two actors who play side characters who stood out to me were Fisayo Akinade, who plays Mr. Ajayi, and Jenny Walser, who plays Tori.One aspect of this series I always liked was the story and this series continues that aspect perfectly. This show has an amazing balance of things from the Comic and original material that I was worried about but ended up loving. This series isn't just for young adults but for everybody and you can see that in the story for this show with the issues it handles. No matter how old you are there's something here you'll be able to relate to which makes this show stand out among others. I mentioned earlier that this series has some original content to it and I honestly, love that it was included. The new content gives more depth to some of the side characters that doesn't exist in the Comics and help make those characters more relatable and depth to them. Like I said earlier this series deals with serious issues and it handles them super well and it has the perfect balance between those more dramatic moments and more comedic ones. I feel like this has to do with the series actually having the writer for the Comic, Alice Oseman, writing the scripts for this series.An odd thing I found myself enjoying for this series was the cinematography for it. The cinematography for this series was really well done throughout the series and there were certain moments where the lighting especially stood out with its creativity. The directing for this series, done by Euros Lyn, was especially really well done. Finally, the soundtrack for this series was honestly really good and used effectively. The music was used for scenes where it was appropriate and wasn't distracting at all as it helped tell the story. The only reason the songs were distracting was that for me the songs were bops.In the end, Heartstopper is a must check out series for all ages, especially those who might not fully understand themselves."
    },
    {
      "username": "tm-sheehan",
      "userUrl": "https://www.imdb.com/user/ur25552762",
      "reviewLink": "https://www.imdb.com/review/rw8094912",
      "warningSpoilers": false,
      "date": "27 April 2022",
      "rate": "10",
      "helpful": "288 out of 328 found this helpful.",
      "title": "An Affectionate Celebration of Diversity",
      "content": "My Review- Heartstopper - NetflixMy Rating 10/10Where were stories and television shows like Heartstopper when I needed them growing up and being bullied at school?Of course there weren't any as I grew up in the Dark Ages of LGBTQI history when being Gay or different meant hostility and shame.We've come so far and still further to go but this new 8 part series Heartstopper is a heaven sent delightful and funny series that everyone can enjoy . Even those that sadly are still living in the Dark Ages if they love great entertainment and are open minded enough to give Heartstopper a chance . This series may open your eyes to the 21st Century where sexual and gender diversity can be celebrated because at its heart that's what Heartstopper is really about celebrating being young and free to choose your path in life.It's also a celebration of diversity transferring what was once shame for the victims of bullying back to the bullies themselves.It's such a simple plot line with a heartfelt and sincere message live, love and be happy.Heartstopper is based on the vertical scroll comic by Alice Oseman and it stars Kit Connor who plays Nick Nelson and Joe Locke who plays Charlie Spring two young men in their late teens who attend Truham Grammar High School.Nick and Charlie discover their unlikely friendship might be something more as they navigate school and young love in this coming-of-age story.This is the television debut of Joe Locke who plays the delightful out but not yet proud Charlie and it certainly won't be his last Joe is a star in the making.His co star is Kit Connor cast as Nick a popular charming and sensitive rugby player ( they do exist) discovering and exploring his bisexuality . Kit Connor is a seasoned performer with movie roles in Rocketman as older Reggie , His Dark Materials ,and the Little Joe starring Ben Whishaw. Kit Connor will also go a long way in movies and television as he has developed into a very impressive actor.The most impressive part of this show for me in this teenage crush and sexual awakening story between two young men is it's broad appeal and normalcy .It's other message of just be yourself and ignore the bully's in life if possible is so effectively powerful and meaningful especially to any young person of any gender or sexual persuasion who is experiencing what I went through in adolescence at an all boys High School.There's no drug use no overt sexual content but so much affection in all the characters with standouts from Yasmin Finney as Elle Argent and William Gao as Tao Xu Charlie Spring's straight best friend plus the rest of the ensemble that includes a touching cameo from Olivia Coleman as Sarah Nelson , Nick's Mum.I read that the background of the character of Elle Argent (Yasmin Finney ) the girlfriend of Tao Xu is a transgender girl who transferred to Harvey Greene Grammar School for girls following her transition and bullying from her peers.I must admit I didn't pick up on that first viewing but it fits so well into the story.Euros Lyn is a fine Director and together with Alice Oseman has done a superb job transferring her creation to the screen and in doing so they have made a huge contribution to GLBTQ awareness and acceptance hopefully in the broader community.If Heartstopper helps just one teenager who is experiencing bullying or shaming this series along with its ensemble cast that includes Stephen Fry as the voice of Headmaster Barnes and the delightful Oscar Winner Olivia Colman it had achieved its goal."
    },
    {
      "username": "agentsofsword",
      "userUrl": "https://www.imdb.com/user/ur121458913",
      "reviewLink": "https://www.imdb.com/review/rw8083541",
      "warningSpoilers": false,
      "date": "23 April 2022",
      "rate": "10",
      "helpful": "228 out of 266 found this helpful.",
      "title": "Great and Fun Coming of Age show",
      "content": "I definitely didn't watch the trailers I just watched it when it came out and it was PERFECT.The way it talks about deep stuff and the struggles of coming out and not being sure of what you are. That was greatly written.The Main leads have so much chemistry because I was cheering and giggling everytime they're on screen.The side characters are great except maybe for Isaac because he's just there.It's a light wholesome show for most of the time and a very good love story."
    },
    {
      "username": "thiagosblancos",
      "userUrl": "https://www.imdb.com/user/ur52511662",
      "reviewLink": "https://www.imdb.com/review/rw8091928",
      "warningSpoilers": false,
      "date": "26 April 2022",
      "rate": "9",
      "helpful": "131 out of 152 found this helpful.",
      "title": "I couldn't stop smiling...!",
      "content": "Hi, gay here! To all of us, children from the 90s who went through hell in school this still seems like twilight zone or something but it is coming, finally teachers are paying attention, and that behaviour is not accepted, not ignored (aka accepted) anymore.It was really lovely, not woke, not preachy, a really, very down to earth story about acceptance, coming to terms about what, and who you are, and the person you love.I'm already waiting for season 2.PS: Niiiiiiiiiiice that finally directors and such stopped portratying us basically doing drugs, sleeping with almost everyone, being half drags, overly feminine, etc. And all that other awful places gay people were portrayed for decades. More of this, please. A story of love, we truly need more of those. :)"
    },
    {
      "username": "jammerknight",
      "userUrl": "https://www.imdb.com/user/ur41191320",
      "reviewLink": "https://www.imdb.com/review/rw8082264",
      "warningSpoilers": false,
      "date": "22 April 2022",
      "rate": "10",
      "helpful": "183 out of 220 found this helpful.",
      "title": "A show for the Next Generation... which I wish my generation had",
      "content": "'Hi' So I love heartstopper. When I heard we were getting this Netflix series I was so excited and the show didn't let me down.The casting is superb and just feel so genuine. Kit Connor and Joe Locke ace every scene. Admittedly some of the dialogue is cheesy but you're watching a teen romance series so just let it slide! Kit is great at portraying the conflicting emotions and brings Nick to lift while I just love Joe's acting of the gay anxious panic in almost every scene.Don't get me started on the supporting cast, I wish I could be friends with Elle! Yasmin steals every scene! And we could all use a friend like Tao.I'm really hoping for a season 2 as I love these character and just want more :)Oh and the cameos - no spoilers but just fantastic. Thank you Netflix & thank you Alice Oseman for giving us heartstopper.Not quite a 10 as I'm hoping for a second season!Edit: Ok I've changed my score to a 10 now, as a young queer adult this show has really stuck with me and I really wish I had seen something like this 5/10 years ago when I was really struggling with my identity and the anxiety/confusion/self doubt that came with it and still sits with me. I also came away with this feeling sense of loneliness that I missed out on this show at a time of my life when I needed it most. Nick's story line is just *chefs kiss* and so relatable, I think this show is going to be one I enjoy and revisit for a very very long time. I'm now going to rewatch the last 15 minutes of episode 3 (the music during these scenes is just perfect - Alaska by Maggie Rogers & Clearest Blue by CHVRCHES) followed by the last 20 minutes of episode 8 :) thank you again Alice for giving us this story and characters :)"
    },
    {
      "username": "star_hazard",
      "userUrl": "https://www.imdb.com/user/ur47699013",
      "reviewLink": "https://www.imdb.com/review/rw8081096",
      "warningSpoilers": false,
      "date": "22 April 2022",
      "rate": "9",
      "helpful": "184 out of 226 found this helpful.",
      "title": "LGBTQ teen version of feelgood hallmark shows but with more sweetness",
      "content": "I never read the graphic novel so I watched this blind. I only knew that this was LGBTQ themed.If you know the word \"Kilig\" (a feeling of exhilaration or elation caused by an exciting or romantic experience.) aka butterflies in your stomach.. then that was my feelings all throughout the show. I love how sweet and cheesy this is and no explicitly detailed or not scenes. It's a teen version of hallmark movies but doused with a lot of sweetness and wholesomeness. This show is like a hug.Sure it's predictable but there's nothing wrong with that. Sure we have the bully stereotypes scattered about but the emotions and awkwardness of love is accurate it overshadows it especially for teens experiencing first loves. I love the main characters they are too adorable. Great acting. I can feel the crush, the love, the awkwardness. The soundtrack is perfect.Not rating it a 10 because Tao's haircut is a nightmare and some of the acting and line delivery from the side characters feel stiff and forced. The plot direction was fine there were some scenes that felt like it was just an insert like how it jumps if your read comics. They also have this weird tendency to focus all over the actor's faces which wasn't bad per say but sometimes it was done too long that it just felt cut off. I want to embrace the whole scene and not just their heads.Overall it's easy to watch especially if you're looking for a light, sweet, and cheesy romance that will bring a smile to your face because it's adorable and wholesome. The portrayal of the LGBTQ community is also done well imo they added in the negatives that go along with it so it doesn't feel like they just inserted it just because but not to the point that it became the driving force of the story. Also even if you're not part of the LGBTQ community the scenes are easy to relate to especially for first love experiences. BIG PLUS as well for no unnecessary drama that is dragged out for long!!Looking forward to the development of the other characters relationships for next season. Highly recommended."
    },
    {
      "username": "chatwithmichaelmac",
      "userUrl": "https://www.imdb.com/user/ur63724374",
      "reviewLink": "https://www.imdb.com/review/rw8090582",
      "warningSpoilers": false,
      "date": "25 April 2022",
      "rate": "10",
      "helpful": "132 out of 160 found this helpful.",
      "title": "Finally-an intelligent portrayal of teen LGBTQ sexuality",
      "content": "A welcome series witch pretty much scores top marks in every field. Outstanding acting, wonderful script and clever cinematography bring this tale of coming out to the screen with great style and intelligence. Possibly the first clever portrayal of bi-sexuality dealt with respectfully and realistically.This love story is exactly the sort of thing teens have for far too long deserved. Netflix is certainly stepping up in terms of providing different voices.Highly recommended !"
    },
    {
      "username": "REVVINCENT",
      "userUrl": "https://www.imdb.com/user/ur60066753",
      "reviewLink": "https://www.imdb.com/review/rw8101436",
      "warningSpoilers": false,
      "date": "29 April 2022",
      "rate": "10",
      "helpful": "90 out of 108 found this helpful.",
      "title": "Over the top!",
      "content": "It is very seldom I give a *10 to any movie. \"Heartstopper\" is definitely a 10.As an aging Boomer who came out in 1968 with my first partner, the emotions this movie triggered were off the charts. Those godawful fears. Those axxieties! Accepting one's queerness takes a lot of energy in sociaties and cultures who simply do not want to accept those who are different from the majority society. I have yet to understand why my sexual orientation is such an issue for a segment of straight society. Why does it matter? We are what we are.\"Heartstopper\" is superbly acted, on target and uplifting. In so many respects, Charlie and Nick are what nearly every young gay experiences and goes through until self-acceptance is finally and fully embraced. \"We\" do not fit just one mold, every bit the rainbow we celebrate."
    },
    {
      "username": "keshavptl",
      "userUrl": "https://www.imdb.com/user/ur69564870",
      "reviewLink": "https://www.imdb.com/review/rw8084139",
      "warningSpoilers": false,
      "date": "23 April 2022",
      "rate": "9",
      "helpful": "134 out of 164 found this helpful.",
      "title": "Perfection! So feel-good!",
      "content": "This series is so good! I loved how the actors are actually teens and the plot is so realistic! No over drama at all, no negativity, just how it should be. The cast and characters are amazing. Just so well implementation - it's a charming feel-good series. Also I liked how Charlie and Nick are so understanding, they are just adorable! Must watch and keep your homophobia at bay."
    },
    {
      "username": "atomeckova",
      "userUrl": "https://www.imdb.com/user/ur118205486",
      "reviewLink": "https://www.imdb.com/review/rw8081977",
      "warningSpoilers": true,
      "date": "22 April 2022",
      "rate": "10",
      "helpful": "163 out of 199 found this helpful.",
      "title": "screaming crying",
      "content": "It's so fricking good to see positive representation of lgbtq relationships that i cried like ten times. Also nick'a journey with bisexuality was so well explained and just overall chefs kiss we love when bisexuality is presented correctly."
    },
    {
      "username": "alrightlove3",
      "userUrl": "https://www.imdb.com/user/ur80343015",
      "reviewLink": "https://www.imdb.com/review/rw8096206",
      "warningSpoilers": false,
      "date": "27 April 2022",
      "rate": "10",
      "helpful": "43 out of 48 found this helpful.",
      "title": "Too adorable...too wholesome... it's not for you.",
      "content": "I'm a 32 year old gay guy who remembers only too well how awful my teenage years were in the closet at school. When I started watching this series I found it a bit offensive. Charlie seems to have it so easy. He's got supportive friends, he's having a fling with a 'straight' boy. Then nick enters the story and is also interested in him. I felt like this was some sort of fairytale in comparison to what I went through and thought it was offensive to suggest that it could be so easy to be a gay teenager.Upon reflection, the series started to sink in. I started to see it from another angle. This wasn't a series to show me how things were but rather a series of how things could have been. Charlie's life isn't perfect - what teenagers is? Navigating school and young love is challenging. As the story unfolded the series made me realise how damaged I still am from the experiences I had knowing I would never be accepted if I told people who I really was. Those pains have lasted with me. They've made me less secure than I could have been, less trusting and wrapped up in my own mind. The story showed me how things could have been in a different world and made me feel more strongly than ever that progress is being made for series like this to exist.If you think this series is cringey, too wholesome and unrealistic, from my perspective I agree with you - but that's the point. I've never watched a gay series which has resonated with me so much and really made me think about myself and my inner demons. I really hope being LGBT continues to become more straight forward so that series like this can seem at least somewhat more believable."
    },
    {
      "username": "leondeklerk",
      "userUrl": "https://www.imdb.com/user/ur84633673",
      "reviewLink": "https://www.imdb.com/review/rw8082724",
      "warningSpoilers": false,
      "date": "22 April 2022",
      "rate": "10",
      "helpful": "140 out of 170 found this helpful.",
      "title": "Loved it",
      "content": "Loved it. Loved it. Loved it.It's great to watch a show about real love and not being subjected to gratuitious sex and violence all the time. This show takes me back to the innocence of love. I was so happy not having to see young people getting drunk or having a drug overdose. This show is what the world should be like. A place where you can love freely without judgment.If you still believe in love...then you will love this show.Loved all the cast except for the bullies.Ps Charlie's sister is the best. Loved this character."
    },
    {
      "username": "jack-39973",
      "userUrl": "https://www.imdb.com/user/ur62301273",
      "reviewLink": "https://www.imdb.com/review/rw8093971",
      "warningSpoilers": false,
      "date": "26 April 2022",
      "rate": "9",
      "helpful": "37 out of 44 found this helpful.",
      "title": "Best thing since No Way Home!",
      "content": "I loved everything about this series and binged it in a few hours.The only bad thing is that it's too short!!! 😭😭😭😭😭Don't even know if I want a second season because the ending was perfect and I don't want anything to ruin it. 😭"
    },
    {
      "username": "sollyharv",
      "userUrl": "https://www.imdb.com/user/ur93579198",
      "reviewLink": "https://www.imdb.com/review/rw8081666",
      "warningSpoilers": true,
      "date": "22 April 2022",
      "rate": "8",
      "helpful": "89 out of 115 found this helpful.",
      "title": "Sweet!",
      "content": "This is so cute I'm gonna throw up. Would highly recommend the webcomic too, it makes me want to die. Also reading it helped me to come out. ALSO SURPRISE OLIVIA COLMAN. OLIVIA COLMAN LIKES PIRATES OF THE CARIBBEAN. PIRATES OF THE CARIBBEAN MAKES THE RUGBY BOY REALISE HE'S BISEXUAL W H A T."
    },
    {
      "username": "johannes2000-1",
      "userUrl": "https://www.imdb.com/user/ur5177700",
      "reviewLink": "https://www.imdb.com/review/rw8116629",
      "warningSpoilers": false,
      "date": "5 May 2022",
      "rate": "10",
      "helpful": "51 out of 65 found this helpful.",
      "title": "Endearing and close to perfection!",
      "content": "What a wonderful experience this is: positive, endearing and uplifting! It's really a relief to see that in the nowadays landscape of high school series chockfull of murders, sexual harassments, gay bashings and what more, a series like this not only can exist, but (in view of the high rating here on IMDb) actually touches the heart of so many people.There are no complicated twists or turns, the story lets the relationship of Charlie and Nick slowly and naturally unfold and grow, and the few hick-ups are dealt with in a realistic but mild way, not pushing messages or morals down your throat, but just showing almost as a matter of course how trust, loyalty and friendship (and love!) can overcome anything. The script is wonderful, the acting of virtually every character is top-notch, and Joe Locke (Charlie) and Kit Connor (Nick) are both cute as puppies, have palpable chemistry and are totally convincing in the sensitive way they ever so cautiously reach out to one another. I admit: I shedded a tear or two in the end, just out of shared joy!"
    },
    {
      "username": "kigaiyuuto",
      "userUrl": "https://www.imdb.com/user/ur9741835",
      "reviewLink": "https://www.imdb.com/review/rw8087180",
      "warningSpoilers": false,
      "date": "24 April 2022",
      "rate": "10",
      "helpful": "82 out of 106 found this helpful.",
      "title": "WOWW This Milkshake is definitely better than yours",
      "content": "Damn right it's better than yours. EASILY the best new Netflix show releasing this week beating out Russian Doll, Heirs to the Land, Hold Tight, The Marked Heart, and Yakamoz S245. It didn't have the usual TV cliche of slow pacing and then cliffhanger ending and this makes me give it a 10/10.It's vibrant and refreshing. I wish I had this when I was in year 10-11 20 years ago. No R rated stuff like unnecessary drug use.All hail the new king of LGBTQ shows."
    },
    {
      "username": "susanneburns66",
      "userUrl": "https://www.imdb.com/user/ur50758732",
      "reviewLink": "https://www.imdb.com/review/rw8087996",
      "warningSpoilers": false,
      "date": "24 April 2022",
      "rate": "10",
      "helpful": "67 out of 85 found this helpful.",
      "title": "Beautiful",
      "content": "Oh what a fantastic series. I loved every second of it. Heartwarming, wholesome and made me shed lots of happy tears.Bring on season 2 please Netflix and I'll keep my subscription ;-)"
    },
    {
      "username": "cammic",
      "userUrl": "https://www.imdb.com/user/ur33069217",
      "reviewLink": "https://www.imdb.com/review/rw8087045",
      "warningSpoilers": false,
      "date": "24 April 2022",
      "rate": "9",
      "helpful": "48 out of 60 found this helpful.",
      "title": "A beauty told story",
      "content": "It's not often that a gay story is told so well but this is one of those times. Growing up confused about your sexuality and dealing with coming out ... even today....is not always easy for everyone. The main characters are wonderful in this series. I think the English always handle these stories genuinely!"
    },
    {
      "username": "nastasia_g8",
      "userUrl": "https://www.imdb.com/user/ur24326854",
      "reviewLink": "https://www.imdb.com/review/rw8081740",
      "warningSpoilers": false,
      "date": "22 April 2022",
      "rate": "9",
      "helpful": "110 out of 142 found this helpful.",
      "title": "SIMPLY, LOVED IT!!",
      "content": "I am not a mother and I don't know if I'll ever be one but if any parents out there are reading this please support and love your children no matter what!! When a person is happy and loved does it really matter who they love?? And PLEASE teach your children that too. This era of hatred of anyone and anything different must end and who better to do it if not us? Hatred is not hereditary but unfortunately it can be passed on from generation to generation! And by the way, even if I don't like labeling myself I am going to make an exception this time and say that I am straight,only doing so not because I belong to LBGTQ community, I don't, but because I am a teacher. And love can be taught too."
    },
    {
      "username": "tilokaudaman",
      "userUrl": "https://www.imdb.com/user/ur93895656",
      "reviewLink": "https://www.imdb.com/review/rw8135371",
      "warningSpoilers": false,
      "date": "12 May 2022",
      "rate": "10",
      "helpful": "22 out of 26 found this helpful.",
      "title": "A Joyful, Charming and Beautiful Story",
      "content": "Once in while you see a program that moves you to the core - HEARTSTOPPER did that for me. I am a 68 year old gay guy. I could only fantasize about about something like that happening to me when I was in high school. I feel such joy now because the world is a kinder and better place. The show is beautifully acted. The casting is perfect. The story is beautifully written and directed. I truly loved every minute of it."
    },
    {
      "username": "c1ara",
      "userUrl": "https://www.imdb.com/user/ur120591483",
      "reviewLink": "https://www.imdb.com/review/rw8098540",
      "warningSpoilers": false,
      "date": "28 April 2022",
      "rate": "8",
      "helpful": "40 out of 49 found this helpful.",
      "title": "This is the most precious thing I've ever seen!",
      "content": "I've seen reviews saying it's childish, awkward or unrealistic, but let me tell you why I don't agree with it!I honestly think that this is one of the most realistic portrayals of teenagers. I'm kinda sick of seeing things like Euphoria, where teens are acting like adults. It might be fun to watch, but it just isn't relatable for most people my age. The awkwardness of fresh love is real and I'm glad this series doesn't try to hide that. It is very normal to be insecure and unsure in a relationship. And not to forget, Charlie turned 15, that's practically a child. The average 15 year old is not involved with drugs and alcohol and that is perfectly fine!I also think that Charlie is one of the most relatable characters, personally. His insecurities and constant self blame are so realistic. He literally feels sorry for other people, because they have to be around him. I feel the same way in so many situations, but this series showed me that I don't have to be. You just need to find the right people to make you feel loved and accepted. They way Charlie keeps saying sorry for literally just existing is so painful and sad. I've never seen anything portray overthinking this well!I hope we can normalise that not everything has to be so romantic, because it simply isn't!"
    },
    {
      "username": "timmoss-26387",
      "userUrl": "https://www.imdb.com/user/ur140507252",
      "reviewLink": "https://www.imdb.com/review/rw8083710",
      "warningSpoilers": false,
      "date": "23 April 2022",
      "rate": "10",
      "helpful": "62 out of 80 found this helpful.",
      "title": "Beautifully done.",
      "content": "Comparisons with 'Beautiful Thing',(another fine film),are irresistable.'Heartstopper' also deals with those pesky awkward times as a teen when you're working out who you are.The cast was outstanding,(though Olivia Coleman didn't have anything to do except be there in a few scenes).I think it can appeal to two main audiences: obviously it's target one is the teens,discovering their sexualities and suffering the exquisite pain of first love.The other would be older ones,looking back nostalgically to their own experiences,with either warmth or regret.If I was 16 again I'm sure I would fall in love with Nick too,if I was on the recieving end of that devastating smile of his.The whole was presented as a fairy tale and I particularly enjoyed the cartoon flowers et al highlighting every frisson of attraction between the two boys...(and no sex!) (One word of caution:Tao's hairdo may be injurious to those of a nervous disposition)."
    },
    {
      "username": "Raja79",
      "userUrl": "https://www.imdb.com/user/ur107275892",
      "reviewLink": "https://www.imdb.com/review/rw8171440",
      "warningSpoilers": false,
      "date": "24 May 2022",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Wholesome Show!",
      "content": "This is one of Netflix's better recent shows, and it feels so wholesome and relaxing. I love how it uses those animated effects to enhance the scenes, since that really adds a wholesome vibe to it.A nice show about gay love and gay discovery!"
    },
    {
      "username": "daveyc-54705",
      "userUrl": "https://www.imdb.com/user/ur117262127",
      "reviewLink": "https://www.imdb.com/review/rw8393741",
      "warningSpoilers": false,
      "date": "2 August 2022",
      "rate": "9",
      "helpful": "17 out of 19 found this helpful.",
      "title": "A thoroughly positive, uplifting viewing experience.",
      "content": "I don't really understand the low ratings. So I'll address some of the things those harp on first.The acting. These are young actors. In the actor who plays Charlie's case, it's literally his first acting gig. This isn't Succession. It's teenagers. And while it's not top notch, it's not nearly as horrible as people are making it sound. It's good enough to get a pass and doesn't take away from the enjoyment of the show.Boring plot/cringey dialogue. Again, this is a show about teenagers. And it's also not built or supposed to come across like some major, large scale drama. This is a smaller, humbly made show about young people. And I believe the whole point is to sorta exist as the opposite to darker teen shows like Riverdale and Euphoria. It's going out of its way to be low key and innocent. Plot and dialogue are going to reflect that. Some people need that. Another passing grade there.So I watched and really enjoyed this show. I consider myself a pretty tough critic, yet I didn't pick up on any of the things the negative reviews are nitpicking here. I almost feel like those people went into it with unreasonably high expectations based off what they're used to.All that being said, why did I enjoy the show? There's plenty of valid reason this show is getting praise. The representation, etc. But the thing that a lot of viewers gloss over that I really appreciated was that these characters are being honest about their feelings and communicating them to each other.For example, so many scared, confused closeted kids in Nick's situation would jump at the chance to use Imogen as a beard and would have danced around or denied his feelings for Charlie for entire seasons of the show. And the exact opposite happens here. Nick goes out of his way to specifically tell both those characters how he really feels. In a world full of doom and gloom dark teen shows, that is such a positive thing to depict. And it's the sorta thing that's gonna give other young viewers who are going through the same thing a lot of hope.Aside from a specific reason like that, I feel like this show in general is just so light and positive that anyone that watches it can come away from it just feeling...good. You'll literally notice yourself smiling while you're watching it.If you need something uplifting that isn't a lot of work to keep up with, this is more than worth your time. Enjoy!"
    },
    {
      "username": "brettgriggs-46299",
      "userUrl": "https://www.imdb.com/user/ur132614184",
      "reviewLink": "https://www.imdb.com/review/rw8094699",
      "warningSpoilers": false,
      "date": "27 April 2022",
      "rate": "10",
      "helpful": "54 out of 69 found this helpful.",
      "title": "Wonderful",
      "content": "Just lovely and yes a little corny but we need more series like this. All the hater reviews can get stuffed. Todays youth are tomorrow's leaders. 🌈 😀 Well done Netflix."
    }
  ],
  "errorMessage": ""
}