{
  "imDbId": "tt10638036",
  "title": "Heartstopper",
  "fullTitle": "Heartstopper (TV Series 2022– )",
  "type": "TVSeries",
  "year": "2022",
  "language": "en",
  "titleInLanguage": "Heartstopper (TV series)",
  "url": "https://en.wikipedia.org/wiki/Heartstopper_(TV_series)",
  "plotShort": {
    "plainText": "Heartstopper is a British coming-of-age romantic comedy-drama television series on Netflix, adapted from the webcomic and graphic novel of the same name by Alice Oseman. Written by Oseman herself, the series primarily tells the story of Charlie Spring (Joe Locke), a gay schoolboy who falls in love with classmate Nick Nelson (Kit Connor), whom he sits next to in his new form. It also explores the lives of their friends Tao (William Gao), Elle (Yasmin Finney), Tara (Corinna Brown) and Darcy (Kizzy Edgell).\r\nThe television rights for the series were purchased by See-Saw Films in 2019, and Netflix acquired distribution rights in 2021. Euros Lyn was enlisted as the director. Filming took place from April to June that year, with teasers released throughout the timeframe. Various pre-existing songs were used as the series' soundtrack, in addition to an original score by Adiescar Chase. The cinematographic styles and colour grading were planned ahead to give the series atmospheric elegance, amplified by the use of traditional animation adapted from the source material.\r\nThe first season of Heartstopper was released on 22 April 2022. The second season is scheduled for release on 3 August 2023, and a third season is in development. The series received critical acclaim, particularly for its tone and pacing, as well as its portrayal of LGBT people, and the first season received nine nominations and five wins for the inaugural ceremony of the Children's and Family Emmy Awards. It gained instant popularity, being among the top 10 English series on Netflix in just two days. It also increased the popularity of the graphic novels as well as the series' songs.",
    "html": "<p>Heartstopper is a British coming-of-age romantic comedy-drama television series on Netflix, adapted from the webcomic and graphic novel of the same name by Alice Oseman. Written by Oseman herself, the series primarily tells the story of Charlie Spring (Joe Locke), a gay schoolboy who falls in love with classmate Nick Nelson (Kit Connor), whom he sits next to in his new form. It also explores the lives of their friends Tao (William Gao), Elle (Yasmin Finney), Tara (Corinna Brown) and Darcy (Kizzy Edgell).</p><p>The television rights for the series were purchased by See-Saw Films in 2019, and Netflix acquired distribution rights in 2021. Euros Lyn was enlisted as the director. Filming took place from April to June that year, with teasers released throughout the timeframe. Various pre-existing songs were used as the series' soundtrack, in addition to an original score by Adiescar Chase. The cinematographic styles and colour grading were planned ahead to give the series atmospheric elegance, amplified by the use of traditional animation adapted from the source material.</p><p>The first season of Heartstopper was released on 22 April 2022. The second season is scheduled for release on 3 August 2023, and a third season is in development. The series received critical acclaim, particularly for its tone and pacing, as well as its portrayal of LGBT people, and the first season received nine nominations and five wins for the inaugural ceremony of the Children's and Family Emmy Awards. It gained instant popularity, being among the top 10 English series on Netflix in just two days. It also increased the popularity of the graphic novels as well as the series' songs.</p>"
  },
  "plotFull": {
    "plainText": "Heartstopper is a British coming-of-age romantic comedy-drama television series on Netflix, adapted from the webcomic and graphic novel of the same name by Alice Oseman. Written by Oseman herself, the series primarily tells the story of Charlie Spring (Joe Locke), a gay schoolboy who falls in love with classmate Nick Nelson (Kit Connor), whom he sits next to in his new form. It also explores the lives of their friends Tao (William Gao), Elle (Yasmin Finney), Tara (Corinna Brown) and Darcy (Kizzy Edgell).\r\nThe television rights for the series were purchased by See-Saw Films in 2019, and Netflix acquired distribution rights in 2021. Euros Lyn was enlisted as the director. Filming took place from April to June that year, with teasers released throughout the timeframe. Various pre-existing songs were used as the series' soundtrack, in addition to an original score by Adiescar Chase. The cinematographic styles and colour grading were planned ahead to give the series atmospheric elegance, amplified by the use of traditional animation adapted from the source material.\r\nThe first season of Heartstopper was released on 22 April 2022. The second season is scheduled for release on 3 August 2023, and a third season is in development. The series received critical acclaim, particularly for its tone and pacing, as well as its portrayal of LGBT people, and the first season received nine nominations and five wins for the inaugural ceremony of the Children's and Family Emmy Awards. It gained instant popularity, being among the top 10 English series on Netflix in just two days. It also increased the popularity of the graphic novels as well as the series' songs.\r\nCast and characters\r\nMain\r\nKit Connor as Nick Nelson, a popular year 11 rugby player at Truham Grammar School seated next to Charlie in form class\r\nJoe Locke as Charlie Spring, a year 10 student at Truham Grammar School who was recently outed\r\nWilliam Gao as Tao Xu, Charlie's protective best friend\r\nYasmin Finney as Elle Argent, Charlie, Tao and Isaac's friend who transferred to Higgs Girls School after she came out as transgender\r\nCorinna Brown as Tara Jones, a Higgs student who befriends Elle\r\nKizzy Edgell as Darcy Olsson, Tara's girlfriend and a friend of Elle's\r\nTobie Donovan as Isaac Henderson, a quiet member of Charlie, Tao, and Elle's friend group\r\nJenny Walser as Tori Spring, Charlie's older sister\r\nSebastian Croft as Benjamin \"Ben\" Hope, Charlie's first, clandestine relationship\r\nCormac Hyde-Corrin as Harry Greene, a boy on the rugby team who is a homophobic bully\r\nRhea Norwood as Imogen Heaney, one of Nick's friends who has a crush on him\r\nFisayo Akinade as Mr Ajayi, an art teacher who looks out for Charlie\r\nChetna Pandya as Coach Singh, the rugby coach who looks out for Charlie\r\nOlivia Colman as Sarah Nelson, Nick's mother\r\nRecurring\r\nAraloyin Oshunremi as Otis Smith\r\nEvan Ovenell as Christian McBride\r\nAshwin Viswanath as Sai Verma\r\nGeorgina Rich as Jane Spring, Charlie and Tori's mother\r\nJoseph Balderrama as Julio Spring, Charlie and Tori's father\r\nMomo Yeung as Yan Xu, Tao's mother\r\nAlan Turkington as Mr Lange\r\nStephen Fry as the voice of Headmaster Barnes, the head teacher of Truham Grammar School\r\nEpisodes\r\nSeason 1 (2022)\r\nProduction\r\nWriting and pre-production\r\nIn 2016, Alice Oseman started a webcomic titled Heartstopper which later expanded to a graphic novel after gaining a cult following. Sometime in 2019, See-Saw Films asked Oseman if she could try writing a screenplay. The production company had been suggested by its own executive producer Patrick Walters, who helped with Oseman's Kickstarter campaign in 2018. She expressed interest in doing it, noting the lack of wholesome, teenage LGBT representation on television, hoping that this could potentially assure LGBT youth \"that they can find happiness and find romance and find friendship\". She wrote a screenplay based on the first two volumes of the graphic novel. See-Saw Films liked it and optioned the television rights later that July.\r\nOn 20 January 2021, it was revealed that Netflix had ordered Heartstopper as an eight-episode half-hour series. It was deemed the best platform by Oseman and Walters due to its global availability. Euros Lyn was enlisted as director and executive producer. He had not read the original source material and called the screenplay riveting. Netflix \"Kids & Family content\" director Patrick Wheeleer said that the story \"deserves to be told\" due to its relatability among the young demographic. Walters served as executive producer for the series, alongside Jamie Laurenson, Hakan Kousetta, Iain Canning, and Emile Sherman, with Zorana Piggott as producer. Production design was done by Tim Dickel, series set decoration by Maxwell Fine and props by Zoe Seiffert. During production, the programme had a working title of Evergreen.\r\nCasting\r\nTo provide an authentic depiction, Oseman wanted actual young people to portray the characters. Daniel Edwards-Guy served as casting director. An open casting call went out in January and February 2021 for five of the main characters as well as three of the recurring cast. Oseman explained that the character Aled Last would not appear in the adaptation to respect his story in another novel within the Heartstopper universe, Radio Silence. After over 10,000 people auditioned via Zoom, she announced the first round of casting decisions in April 2021, with Kit Connor and Joe Locke starring as Nick and Charlie respectively. Heartstopper marked Locke's acting debut. After agreeing that Locke suited Charlie's role, Connor was auditioned and the production team found a chemistry between the two; the actors themselves recalled only taking a few hours to bond.\r\nThe rest of the cast members were announced days later and included Yasmin Finney, Sebastian Croft, William Gao, Corinna Brown, Kizzy Edgell, Cormac Hyde-Corrin, Rhea Norwood, and Tobie Donovan. Jenny Walser joined in the cast in May 2021. The final audition was conducted face-to-face. Having worked with her previously, Lyn reached out to Olivia Colman after Oseman expressed an interest in a notable actress to portray Sarah; Colman accepted the offer. It was also noted that fans of the webcomic and graphic novel agreed that Colman was suited for the series. Lyn said that Colman's \"instinctive\" and \"warm\" character fit Sarah as Nick's mother.\r\nOn 8 July 2022, an open casting call was announced for a 16-year-old character named Sahar Zahid, a British female or non-binary person of South Asian descent. That September, it was announced that Leila Khan would play the role and much of the lead cast would return for the second season. Other roles announced included Jack Barton as David Nelson, Nick's older brother; Bradley Riches as Truham student James McEwan; and Nima Taleghani as schoolteacher Mr Farouk. On 4 November 2022, it was announced that Colman, Chetna Pandya, Fisayo Akinade, and Alan Turkington would reprise their roles in the second season, along with new casting including Bel Priestley and Ash Self as Elle's new friends Naomi and Felix, respectively, and Thibault de Montalembert as Nick's father Stephane.\r\nFilming\r\nFilming began on location throughout the United Kingdom in April 2021 and finished that June. It mostly took place in Berkshire and Buckinghamshire. Harry's party was filmed at the Hampton Court House in the London Borough of Richmond upon Thames. A Hollywood Bowl bowling alley in High Wycombe was used for filming. The rugby match shown in the episode \"Secret\" was filmed at the Thames Valley Athletics Centre. The railway station from where Nick and Charlie depart to the seaside is North Weald railway station in Essex, and the scene on the seaside was filmed in Herne Bay, Kent. After milkshakes, Charlie and his friends are seen walking along the River Thames in Windsor, Berkshire, before their concert. Colman filmed all her scenes in two days. In the episode \"Boyfriend\", during a scene where Nick and Charlie take a train, Oseman decided to give herself a cameo as a passenger; she is drawing the couple nearby. The scene near the end of the episode featuring a merry-go-round was filled with crew members.\r\nDiana Olifirova was enlisted as cinematographer. She was immediately presented with challenges in visually depicting \"love and emotion and tenderness\". Using an Arri Alexa Mini LF with Canon K35 spherical lenses, she used hand-held cinematography to give the cast space and to achieve an effect that resembled the documentary genre. With production designer Tim Dickel, they conceived a light-hearted colour palette of orange, yellow, turquoise, as well as a mix of pink and blue. Olifirova employed colour gel for the lighting, which she had previously done for We Are Lady Parts. The colours of the school building were controlled to not be overdone but, at the same time, to be vivid. The scenes during Harry's birthday party were filmed in daytime, and thus the production team had to shut the windows and use artificial lighting to resemble outdoor lights. Transitions between seasons were achieved through lens flares. The opening scene was achieved in two takes; in the first, the depth of field for Nick achieved through the Contrazoom was deemed overdone; they later managed to reshoot the scene to make it more minimalistic. As Tara and Darcy kiss in the third episode, Nick is bathed in bisexual lighting (pinks, purples, and blues) symbolising him realising his sexuality; this was suggested to Olifirova by the series' creative team.\r\nAs production designer, Dickel worked with set decorator Maxwell Fine, who used his experience in past art lessons to create a realistic representation of British classrooms. Dickel, meanwhile, asked his friends to photograph their kids' rooms, creating a mood board, which was reviewed by the cast. Some of the set objects also changed as the characters progressed and grew. At the geography classroom, Nick's seat was located to have him in front of images of rocks; Fine correlated this with metamorphic rocks forming under pressure, symbolising Nick and Charlie's romantic development. Nick has his room littered with items representing his complicated life. Elle's room is \"more refined\" and artistic, Tao's room was designed to reflect his cinephilia, and Tara's is awash with teddy bears per the screenplay. With respect to the source material, several set objects were given a hand-drawn style. Reflective of the characters, Charlie's room is wide and chaotic, while Nick's is tidier. Oseman drew murals to be depicted in the series; they were inspired by the works of Hokusai and Julian Opie.\r\nThe second season began filming in September 2022 at Twickenham Studios, London, and finished in early December the same year.\r\nPost-production\r\nIn the series, traditionally animated leaves float around during moments of love, a direct copy of the visual motifs in the webcomic. In Nick and Charlie's first kissing scene, sparks of electricity come out as Charlie tries touching Nick's hand. Animated seagulls and lovebirds are also seen. Oseman said that the animations represent a \"feeling of magic\" they intended to evoke. She had already thought of using such effects while writing the screenplay, conceiving that they would appear primarily during the intimate scenes between Nick and Charlie, which she dubbed \"Heartstopper moments\". Eventually, Anna Peronetto was chosen to create the animations, using a storyboard by Oseman. Peronetto had been a fan of the original source material and was chosen when Oseman made an Instagram post looking for traditional animators. She discussed with Lyn and editor Sofie Alonzi to see what kinds of animations fit in a certain scene. For the lovebirds, she analysed London feral parakeets.\r\nUsing DaVinci Resolve, Olifirova worked remotely with colourist Toby Tomkins, working for the company Cheat, to create a 3D lookup table (LUT) that resembled the shots' colour palette, as well as \"add a hint of turquoise in the shadows and warmth to skin tones\". Lyn had told them he wanted the colour intensity to increase as the story progressed and as seasons changed. They talked about how to create a proper Dolby Vision high dynamic range for the series, establishing colour and tonal limits. Then, the LUT's brightness was stopped down by one so that Olifirova could create additional light in the shadows and experiment with the colour grading. To enhance the HDR, an RGB colour space of DCI-P3 was chosen. Tomkins worked on the first two episodes for two days before working on individual remaining episodes for a day-and-a-half.\r\nAdiescar Chase composed the score and employed electronic riffs to give it a contemporary feel. Heartstopper marks her first project after graduating from the National Film and Television School. She read the webcomic prior to composing and was given direction to have her music complement the pre-existing songs used. Some of the tracks, including the titular one, aided the \"Heartstopper moments\" by further emphasizing the feeling of electricity and excitement.\r\nRenewal\r\nWhen asked whether there would be a second season, Walters said that they were looking forward to it, seeing that the executives of Netflix seemed to \"understand\" the series. Locke and Connor had also expressed anticipation for a renewal, noting the narrative progression in the series' source material. On 20 May 2022, following Netflix's review of the 28-day viewing figures, it was announced that the series had been renewed for two more seasons. Season 2 began production in late 2022 and is scheduled to be released on 3 August 2023.\r\nRelease\r\nHeartstopper's one-minute teaser was released on 16 March 2022. Collider then announced that its tagline was: \"Boy meets boy. Boys become friends. Boys fall in love.\" Hilary Remley, who wrote the news, saw the teaser as teasing the series' \"emotionally vulnerable\" air, \"showing the experience of teenage love in a direct and sincere way\", assured that audiences will enjoy the final product due to its faithfulness to the source material's dreamlike aesthetic. The series' episode titles were released on 19 April, before the series' episodes were released on 22 April 2022. The second season is set to be released on 3 August 2023.\r\nSoundtrack\r\nA selection of songs used in the soundtrack for the series were released digitally on Spotify under the title Heartstopper: Official Mixtape to coincide with the series' release on 22 April 2022. Chase's score was also released on the same day. A single by British artist Baby Queen, \"Colours of You\", was released by Polydor Records in conjunction with the launch. Other popular songs featured in the series include \"Girls\" by Girl in Red and \"Tired\" by Beabadoobee.\r\nReception\r\nAudience viewership\r\nDuring its debut week, Heartstopper ranked at number seven on Netflix's Top 10 TV English titles just two days after its release. Based on Netflix's methodology of measuring a programme by the number of hours, the series generated 14.55 million hours viewed. The following week, the show climbed to number 5 with 23.94 million hours viewed. In its third week, the show dropped to sixth position with new viewership numbers of 14.97 million viewing hours. Variety reported the series had reached Netflix's Top Ten list in 54 countries as of 20 May 2022. The series also topped the publication's Trending TV chart for over five weeks, judging by the 1.3 million Twitter engagements. The show appeared in the Top 10 list in three countries where same-sex relations are illegal (Lebanon, Saudi Arabia, and Sri Lanka).\r\nCritical response\r\nThe series received critical acclaim. The review aggregator website Rotten Tomatoes reported a 100% approval rating with an average rating of 8.7/10, based on 55 critic reviews. The website's critical consensus reads: \"An inclusive romance told with striking sensitivity, Heartstopper is so effortlessly charming that viewers won't dare skip a beat.\" Metacritic, which uses a weighted average, assigned a score of 85 out of 100 based on nine critics, indicating \"universal acclaim\".\r\nReviewing the series for The Guardian, Rebecca Nicholson gave a rating of 4/5 and said, \"Heartstopper may not quite live up to the dramatic promise of its title, but this adorable teen romance is a heartwarmer, at the very least.\" Saloni Gajjar of The A.V. Club gave the series an A− and said \"Thankfully, Heartstopper subverts notions by keeping its protagonist proudly gay: It's the love interest who has to sort through his unexpected feelings, not the other way around. Nick's attraction to Charlie catches him by surprise (but not disdain).\" Digital Spy's David Opie gave a rating of 5/5 and said, \"Heartstopper centres queer love, affirming the feelings of young people watching who might be unsure or afraid to speak their truth.\" Jonathan Wilson of Ready Steady Cut gave a rating of 4/5 and stated, \"Heartstopper might lack some edge and feel as if it's speaking to a younger demographic than the usual teen drama, but its deeply uplifting portrait of young love is very difficult not to get swept up in.\" For Paste Magazine, Emily Maskell gave a rating of 8.8/10 and said, \"An open-armed embrace for queer youth, Heartstopper lays the strong foundations of what you can only hope will be the uplifting and inclusive depictions of queer characters for the next generation of viewers.\" Ezelle Alblas for The Upcoming gave a 5/5 rating and said, \"Heartstopper feels like a show everyone needs to see. It's sweet without the cheese and quietly radical without the shock factor of shows like Sex Education, Euphoria or It's a Sin.\"\r\nHeartstopper was ranked the best show of 2022 by NME and The Mary Sue. Meanwhile, Entertainment.ie placed it at number four, TVLine at number eight, Decider at number nine, and PopBuzz at number 10, while The Austin Chronicle and Lifehacker included it in their respective unranked list. In addition, Collider named it one of the best new TV shows of 2022.\r\nImpact\r\nFollowing the release of the series, the first volume of Oseman's Heartstopper graphic novel became the top-selling children's bestseller in the UK. Songs featured in the series received large increases in chart sales and streams. Songs on the soundtrack that received a surge in chart sales when compared to the previous week included \"Want Me\" and \"Dover Beach\" by Baby Queen, \"Why Am I Like This?\" by Orla Gartland, and \"I Belong In Your Arms\" by Chairlift.\r\nAccolades",
    "html": "<p>Heartstopper is a British coming-of-age romantic comedy-drama television series on Netflix, adapted from the webcomic and graphic novel of the same name by Alice Oseman. Written by Oseman herself, the series primarily tells the story of Charlie Spring (Joe Locke), a gay schoolboy who falls in love with classmate Nick Nelson (Kit Connor), whom he sits next to in his new form. It also explores the lives of their friends Tao (William Gao), Elle (Yasmin Finney), Tara (Corinna Brown) and Darcy (Kizzy Edgell).</p><p>The television rights for the series were purchased by See-Saw Films in 2019, and Netflix acquired distribution rights in 2021. Euros Lyn was enlisted as the director. Filming took place from April to June that year, with teasers released throughout the timeframe. Various pre-existing songs were used as the series' soundtrack, in addition to an original score by Adiescar Chase. The cinematographic styles and colour grading were planned ahead to give the series atmospheric elegance, amplified by the use of traditional animation adapted from the source material.</p><p>The first season of Heartstopper was released on 22 April 2022. The second season is scheduled for release on 3 August 2023, and a third season is in development. The series received critical acclaim, particularly for its tone and pacing, as well as its portrayal of LGBT people, and the first season received nine nominations and five wins for the inaugural ceremony of the Children's and Family Emmy Awards. It gained instant popularity, being among the top 10 English series on Netflix in just two days. It also increased the popularity of the graphic novels as well as the series' songs.</p><br/><h3>Cast and characters</h3><h4>Main</h4><ul><li>Kit Connor as Nick Nelson, a popular year 11 rugby player at Truham Grammar School seated next to Charlie in form class</li><li>Joe Locke as Charlie Spring, a year 10 student at Truham Grammar School who was recently outed</li><li>William Gao as Tao Xu, Charlie's protective best friend</li><li>Yasmin Finney as Elle Argent, Charlie, Tao and Isaac's friend who transferred to Higgs Girls School after she came out as transgender</li><li>Corinna Brown as Tara Jones, a Higgs student who befriends Elle</li><li>Kizzy Edgell as Darcy Olsson, Tara's girlfriend and a friend of Elle's</li><li>Tobie Donovan as Isaac Henderson, a quiet member of Charlie, Tao, and Elle's friend group</li><li>Jenny Walser as Tori Spring, Charlie's older sister</li><li>Sebastian Croft as Benjamin \"Ben\" Hope, Charlie's first, clandestine relationship</li><li>Cormac Hyde-Corrin as Harry Greene, a boy on the rugby team who is a homophobic bully</li><li>Rhea Norwood as Imogen Heaney, one of Nick's friends who has a crush on him</li><li>Fisayo Akinade as Mr Ajayi, an art teacher who looks out for Charlie</li><li>Chetna Pandya as Coach Singh, the rugby coach who looks out for Charlie</li><li>Olivia Colman as Sarah Nelson, Nick's mother</li></ul><h4>Recurring</h4><ul><li>Araloyin Oshunremi as Otis Smith</li><li>Evan Ovenell as Christian McBride</li><li>Ashwin Viswanath as Sai Verma</li><li>Georgina Rich as Jane Spring, Charlie and Tori's mother</li><li>Joseph Balderrama as Julio Spring, Charlie and Tori's father</li><li>Momo Yeung as Yan Xu, Tao's mother</li><li>Alan Turkington as Mr Lange</li><li>Stephen Fry as the voice of Headmaster Barnes, the head teacher of Truham Grammar School</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"1\" style=\"min-width:50px;padding:0 8px\">Series</th><th scope=\"col\" rowspan=\"1\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally released</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">22 April 2022</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">3 August 2023</td></tr></tbody></table><h4>Season 1 (2022)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#F6BAC4;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#F6BAC4\">Title</th><th scope=\"col\" style=\"background:#F6BAC4\">Directed by</th><th scope=\"col\" style=\"background:#F6BAC4\">Written by</th><th scope=\"col\" style=\"background:#F6BAC4\">Original release date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Meet\"</td><td style=\"text-align:center\"><span>Euros Lyn</span></td><td style=\"text-align:center\"><span>Alice Oseman</span></td><td style=\"text-align:center\">22 April 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #F6BAC4\">Truham Grammar High School student Charlie Spring is in a secret relationship with Ben Hope. In his new <span>form</span>, Charlie is assigned to sit next to Nick Nelson, a rugby player for whom he develops feelings. They become friends, though Charlie is unsure of Nick's sexuality. Nick invites him to join the rugby team, and he accepts. After seeing Ben kissing a girl and realising his own unhappiness in the relationship, Charlie tells Ben he does not want to meet up anymore. Later, Charlie reluctantly meets with Ben again, who forcibly kisses him but is fended off by Nick. Meanwhile, one of Charlie's friends, Elle Argent, has moved to Higgs Girls School after coming out as a <span class=\"mw-redirect\">transgender girl</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Crush\"</td><td style=\"text-align:center\">Euros Lyn</td><td style=\"text-align:center\">Alice Oseman</td><td style=\"text-align:center\">22 April 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #F6BAC4\">Charlie vents to Nick about his relationship with Ben, whom Nick condemns. Charlie's friend Tao Xu assumes that Nick is heterosexual and tells Charlie to abandon his feelings, but he refuses. Tao tells him that Nick has a crush on a girl named Tara Jones, whom Elle soon learns is in a same-sex relationship with Darcy Olsson. While hanging out at Charlie's house, Nick tries to hold Charlie's hand while he is sleeping and begins to question his sexuality.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Kiss\"</td><td style=\"text-align:center\">Euros Lyn</td><td style=\"text-align:center\">Alice Oseman</td><td style=\"text-align:center\">22 April 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #F6BAC4\">Nick is invited to his friend Harry Greene's 16th birthday party. He invites Charlie, who accepts. Tao is unhappy that Nick has been causing his and Charlie's friendship to become more distant. At the party, Harry and his group try to set Nick up with Tara. Tara comes out to Nick, who tells off Harry after he makes fun of Charlie. Imogen Heaney, one of Nick's friends, tells Nick she likes him. Charlie tells Ben to leave him alone. Nick and Charlie go to a secluded room, where they kiss; Nick is dumbfounded and leaves after he hears Harry looking for him. Though heartbroken, Charlie is surprised to see Nick at his doorstep the next day in the pouring rain.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Secret\"</td><td style=\"text-align:center\">Euros Lyn</td><td style=\"text-align:center\">Alice Oseman</td><td style=\"text-align:center\">22 April 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #F6BAC4\">Charlie apologises to Nick for what happened the previous day. Nick kisses him, explaining that he is still <span>closeted</span> and confused; Charlie says he does not need to publicly declare anything. At school, they spend more time together while eating lunch. After a rugby game, Nick visits Charlie in the sick bay and is briefly interrupted by Isaac. Tao and Elle overhear Nick reluctantly agreeing to a peer-pressured date with Imogen.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Friend\"</td><td style=\"text-align:center\">Euros Lyn</td><td style=\"text-align:center\">Alice Oseman</td><td style=\"text-align:center\">22 April 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #F6BAC4\">Nick is about to cancel the date with Imogen when she reveals that her dog died, and Nick reverts his plan because he feels sorry for her. Charlie invites Nick to his 15th birthday celebration, which happens to be on the same day as Nick's date, but he decides to be with Charlie. Tao tells Charlie about Nick and Imogen. Nick overhears the two of them, later clarifying to Charlie before explicitly admitting his feelings for him, which Charlie reciprocates. The next day, Nick explains to Imogen that he does not like her romantically. Imogen thanks him for his honesty.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Girls\"</td><td style=\"text-align:center\">Euros Lyn</td><td style=\"text-align:center\">Alice Oseman</td><td style=\"text-align:center\">22 April 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #F6BAC4\">Nick thinks he might be <span class=\"mw-redirect\">bisexual</span>; Charlie tells him to take his time. Nick comes out to Tara and Darcy, who suggest a double date. After Elle reveals she has feelings for Tao, the group then secretly make it a triple date, hoping to set the two up. On the date, Elle notices their intentions and confronts them, saying she does not want any more change in her life and wants to protect her friendship with Tao, though she is happy for Nick and Charlie. That day, there is an orchestral concert with Truham and Higgs. Tara angrily leaves after hearing homophobic comments; Darcy calms her down and they go back to perform.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Bully\"</td><td style=\"text-align:center\">Euros Lyn</td><td style=\"text-align:center\">Alice Oseman</td><td style=\"text-align:center\">22 April 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #F6BAC4\">Nick invites Charlie to the cinema with his friends, reassuring him that Harry and Ben are not coming. However, they both turn out to be there, and Harry bullies Charlie about his sexuality. After Charlie leaves, Nick tells Harry to stop the bullying. Harry calls Charlie a <span class=\"mw-redirect\">fag</span>, and a fight ensues. At the car park, Ben tells Charlie that Nick does not care for him and that no one could. Tao feels guilty for unintentionally worsening Charlie's situation by verbally attacking Harry, but as Charlie continues to ignore him, he gets into a fight with Harry and confronts Charlie for not telling him about his relationship with Nick.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Boyfriend\"</td><td style=\"text-align:center\">Euros Lyn</td><td style=\"text-align:center\">Alice Oseman</td><td style=\"text-align:center\">22 April 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #F6BAC4\">Harry is suspended for the fight, and Charlie's friendship with Tao is still strained. Depressed, Charlie quits rugby and ignores Nick. Tao and Nick bond and find common ground on wanting Charlie to be happy. Tao reconciles with Charlie, who also confronts Ben for being abusive. Nick tells Charlie that he does not want to break up and they kiss. On a date at the seaside, Nick reveals his plan to come out and to tell their friends, which makes Charlie happy. Later that day, he comes out to his mother, who accepts him.</td></tr></tbody></table><br/><h3>Production</h3><h4>Writing and pre-production</h4><p>In 2016, Alice Oseman started a webcomic titled Heartstopper which later expanded to a graphic novel after gaining a cult following. Sometime in 2019, See-Saw Films asked Oseman if she could try writing a screenplay. The production company had been suggested by its own executive producer Patrick Walters, who helped with Oseman's Kickstarter campaign in 2018. She expressed interest in doing it, noting the lack of wholesome, teenage LGBT representation on television, hoping that this could potentially assure LGBT youth \"that they can find happiness and find romance and find friendship\". She wrote a screenplay based on the first two volumes of the graphic novel. See-Saw Films liked it and optioned the television rights later that July.</p><p>On 20 January 2021, it was revealed that Netflix had ordered Heartstopper as an eight-episode half-hour series. It was deemed the best platform by Oseman and Walters due to its global availability. Euros Lyn was enlisted as director and executive producer. He had not read the original source material and called the screenplay riveting. Netflix \"Kids & Family content\" director Patrick Wheeleer said that the story \"deserves to be told\" due to its relatability among the young demographic. Walters served as executive producer for the series, alongside Jamie Laurenson, Hakan Kousetta, Iain Canning, and Emile Sherman, with Zorana Piggott as producer. Production design was done by Tim Dickel, series set decoration by Maxwell Fine and props by Zoe Seiffert. During production, the programme had a working title of Evergreen.</p><h4>Casting</h4><p>To provide an authentic depiction, Oseman wanted actual young people to portray the characters. Daniel Edwards-Guy served as casting director. An open casting call went out in January and February 2021 for five of the main characters as well as three of the recurring cast. Oseman explained that the character Aled Last would not appear in the adaptation to respect his story in another novel within the Heartstopper universe, Radio Silence. After over 10,000 people auditioned via Zoom, she announced the first round of casting decisions in April 2021, with Kit Connor and Joe Locke starring as Nick and Charlie respectively. Heartstopper marked Locke's acting debut. After agreeing that Locke suited Charlie's role, Connor was auditioned and the production team found a chemistry between the two; the actors themselves recalled only taking a few hours to bond.</p><p>The rest of the cast members were announced days later and included Yasmin Finney, Sebastian Croft, William Gao, Corinna Brown, Kizzy Edgell, Cormac Hyde-Corrin, Rhea Norwood, and Tobie Donovan. Jenny Walser joined in the cast in May 2021. The final audition was conducted face-to-face. Having worked with her previously, Lyn reached out to Olivia Colman after Oseman expressed an interest in a notable actress to portray Sarah; Colman accepted the offer. It was also noted that fans of the webcomic and graphic novel agreed that Colman was suited for the series. Lyn said that Colman's \"instinctive\" and \"warm\" character fit Sarah as Nick's mother.</p><p>On 8 July 2022, an open casting call was announced for a 16-year-old character named Sahar Zahid, a British female or non-binary person of South Asian descent. That September, it was announced that Leila Khan would play the role and much of the lead cast would return for the second season. Other roles announced included Jack Barton as David Nelson, Nick's older brother; Bradley Riches as Truham student James McEwan; and Nima Taleghani as schoolteacher Mr Farouk. On 4 November 2022, it was announced that Colman, Chetna Pandya, Fisayo Akinade, and Alan Turkington would reprise their roles in the second season, along with new casting including Bel Priestley and Ash Self as Elle's new friends Naomi and Felix, respectively, and Thibault de Montalembert as Nick's father Stephane.</p><h4>Filming</h4><p>Filming began on location throughout the United Kingdom in April 2021 and finished that June. It mostly took place in Berkshire and Buckinghamshire. Harry's party was filmed at the Hampton Court House in the London Borough of Richmond upon Thames. A Hollywood Bowl bowling alley in High Wycombe was used for filming. The rugby match shown in the episode \"Secret\" was filmed at the Thames Valley Athletics Centre. The railway station from where Nick and Charlie depart to the seaside is North Weald railway station in Essex, and the scene on the seaside was filmed in Herne Bay, Kent. After milkshakes, Charlie and his friends are seen walking along the River Thames in Windsor, Berkshire, before their concert. Colman filmed all her scenes in two days. In the episode \"Boyfriend\", during a scene where Nick and Charlie take a train, Oseman decided to give herself a cameo as a passenger; she is drawing the couple nearby. The scene near the end of the episode featuring a merry-go-round was filled with crew members.</p><p>Diana Olifirova was enlisted as cinematographer. She was immediately presented with challenges in visually depicting \"love and emotion and tenderness\". Using an Arri Alexa Mini LF with Canon K35 spherical lenses, she used hand-held cinematography to give the cast space and to achieve an effect that resembled the documentary genre. With production designer Tim Dickel, they conceived a light-hearted colour palette of orange, yellow, turquoise, as well as a mix of pink and blue. Olifirova employed colour gel for the lighting, which she had previously done for We Are Lady Parts. The colours of the school building were controlled to not be overdone but, at the same time, to be vivid. The scenes during Harry's birthday party were filmed in daytime, and thus the production team had to shut the windows and use artificial lighting to resemble outdoor lights. Transitions between seasons were achieved through lens flares. The opening scene was achieved in two takes; in the first, the depth of field for Nick achieved through the Contrazoom was deemed overdone; they later managed to reshoot the scene to make it more minimalistic. As Tara and Darcy kiss in the third episode, Nick is bathed in bisexual lighting (pinks, purples, and blues) symbolising him realising his sexuality; this was suggested to Olifirova by the series' creative team.</p><p>As production designer, Dickel worked with set decorator Maxwell Fine, who used his experience in past art lessons to create a realistic representation of British classrooms. Dickel, meanwhile, asked his friends to photograph their kids' rooms, creating a mood board, which was reviewed by the cast. Some of the set objects also changed as the characters progressed and grew. At the geography classroom, Nick's seat was located to have him in front of images of rocks; Fine correlated this with metamorphic rocks forming under pressure, symbolising Nick and Charlie's romantic development. Nick has his room littered with items representing his complicated life. Elle's room is \"more refined\" and artistic, Tao's room was designed to reflect his cinephilia, and Tara's is awash with teddy bears per the screenplay. With respect to the source material, several set objects were given a hand-drawn style. Reflective of the characters, Charlie's room is wide and chaotic, while Nick's is tidier. Oseman drew murals to be depicted in the series; they were inspired by the works of Hokusai and Julian Opie.</p><p>The second season began filming in September 2022 at Twickenham Studios, London, and finished in early December the same year.</p><h4>Post-production</h4><p>In the series, traditionally animated leaves float around during moments of love, a direct copy of the visual motifs in the webcomic. In Nick and Charlie's first kissing scene, sparks of electricity come out as Charlie tries touching Nick's hand. Animated seagulls and lovebirds are also seen. Oseman said that the animations represent a \"feeling of magic\" they intended to evoke. She had already thought of using such effects while writing the screenplay, conceiving that they would appear primarily during the intimate scenes between Nick and Charlie, which she dubbed \"Heartstopper moments\". Eventually, Anna Peronetto was chosen to create the animations, using a storyboard by Oseman. Peronetto had been a fan of the original source material and was chosen when Oseman made an Instagram post looking for traditional animators. She discussed with Lyn and editor Sofie Alonzi to see what kinds of animations fit in a certain scene. For the lovebirds, she analysed London feral parakeets.</p><p>Using DaVinci Resolve, Olifirova worked remotely with colourist Toby Tomkins, working for the company Cheat, to create a 3D lookup table (LUT) that resembled the shots' colour palette, as well as \"add a hint of turquoise in the shadows and warmth to skin tones\". Lyn had told them he wanted the colour intensity to increase as the story progressed and as seasons changed. They talked about how to create a proper Dolby Vision high dynamic range for the series, establishing colour and tonal limits. Then, the LUT's brightness was stopped down by one so that Olifirova could create additional light in the shadows and experiment with the colour grading. To enhance the HDR, an RGB colour space of DCI-P3 was chosen. Tomkins worked on the first two episodes for two days before working on individual remaining episodes for a day-and-a-half.</p><p>Adiescar Chase composed the score and employed electronic riffs to give it a contemporary feel. Heartstopper marks her first project after graduating from the National Film and Television School. She read the webcomic prior to composing and was given direction to have her music complement the pre-existing songs used. Some of the tracks, including the titular one, aided the \"Heartstopper moments\" by further emphasizing the feeling of electricity and excitement.</p><h4>Renewal</h4><p>When asked whether there would be a second season, Walters said that they were looking forward to it, seeing that the executives of Netflix seemed to \"understand\" the series. Locke and Connor had also expressed anticipation for a renewal, noting the narrative progression in the series' source material. On 20 May 2022, following Netflix's review of the 28-day viewing figures, it was announced that the series had been renewed for two more seasons. Season 2 began production in late 2022 and is scheduled to be released on 3 August 2023.</p><br/><h3>Release</h3><p>Heartstopper's one-minute teaser was released on 16 March 2022. Collider then announced that its tagline was: \"Boy meets boy. Boys become friends. Boys fall in love.\" Hilary Remley, who wrote the news, saw the teaser as teasing the series' \"emotionally vulnerable\" air, \"showing the experience of teenage love in a direct and sincere way\", assured that audiences will enjoy the final product due to its faithfulness to the source material's dreamlike aesthetic. The series' episode titles were released on 19 April, before the series' episodes were released on 22 April 2022. The second season is set to be released on 3 August 2023.</p><h4>Soundtrack</h4><p>A selection of songs used in the soundtrack for the series were released digitally on Spotify under the title Heartstopper: Official Mixtape to coincide with the series' release on 22 April 2022. Chase's score was also released on the same day. A single by British artist Baby Queen, \"Colours of You\", was released by Polydor Records in conjunction with the launch. Other popular songs featured in the series include \"Girls\" by Girl in Red and \"Tired\" by Beabadoobee.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Heartstopper (Soundtrack from the Netflix Series)</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\">Adiescar Chase</div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">22 April 2022</td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"min\">32</span>:<span class=\"s\">39</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\">Maisie</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Producer</span></th><td class=\"infobox-data hlist\">Adiescar Chase</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>Heartstopper (Soundtrack from the Netflix Series)</i> track listing</caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"First Sight\"</td><td class=\"tracklist-length\">1:09</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Déjà Vu\"</td><td class=\"tracklist-length\">0:57</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"X\"</td><td class=\"tracklist-length\">0:44</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Head In the Clouds\"</td><td class=\"tracklist-length\">1:00</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"On the Move\"</td><td class=\"tracklist-length\">1:02</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Angst\"</td><td class=\"tracklist-length\">1:25</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Off to Nick's\"</td><td class=\"tracklist-length\">0:41</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"Just Friends\"</td><td class=\"tracklist-length\">1:26</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"Milkshakes\"</td><td class=\"tracklist-length\">1:24</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Falling Leaves\"</td><td class=\"tracklist-length\">1:03</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Electricity\"</td><td class=\"tracklist-length\">1:03</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"The Lads\"</td><td class=\"tracklist-length\">1:10</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Misconceptions\"</td><td class=\"tracklist-length\">1:11</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Kiss\"</td><td class=\"tracklist-length\">2:05</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"Possibilities\"</td><td class=\"tracklist-length\">2:04</td></tr><tr><th id=\"track16\" scope=\"row\">16.</th><td>\"Clash\"</td><td class=\"tracklist-length\">1:07</td></tr><tr><th id=\"track17\" scope=\"row\">17.</th><td>\"Rugby Match\"</td><td class=\"tracklist-length\">3:24</td></tr><tr><th id=\"track18\" scope=\"row\">18.</th><td>\"Wanna Go Out Sometime\"</td><td class=\"tracklist-length\">0:55</td></tr><tr><th id=\"track19\" scope=\"row\">19.</th><td>\"Happy Complications\"</td><td class=\"tracklist-length\">0:50</td></tr><tr><th id=\"track20\" scope=\"row\">20.</th><td>\"New Best Friend\"</td><td class=\"tracklist-length\">0:44</td></tr><tr><th id=\"track21\" scope=\"row\">21.</th><td>\"Embrace\"</td><td class=\"tracklist-length\">1:02</td></tr><tr><th id=\"track22\" scope=\"row\">22.</th><td>\"Exploration\"</td><td class=\"tracklist-length\">1:56</td></tr><tr><th id=\"track23\" scope=\"row\">23.</th><td>\"Sports Day\"</td><td class=\"tracklist-length\">0:48</td></tr><tr><th id=\"track24\" scope=\"row\">24.</th><td>\"Heartstopper\"</td><td class=\"tracklist-length\">2:32</td></tr><tr><th id=\"track25\" scope=\"row\">25.</th><td>\"Encore\"</td><td class=\"tracklist-length\">0:57</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"2\" scope=\"row\"><span>Total length:</span></th><td>32:39</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Heartstopper: Official Mixtape</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> / <span style=\"background:  #BFE0BF\"><span>Mixtape</span></span> by <div class=\"contributor\" style=\"display:inline\">various artists</div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">22 April 2022</td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"h\">2</span>:<span class=\"min\">05</span>:<span class=\"s\">00</span></span></td></tr><tr><td colspan=\"2\" class=\"infobox-below\"><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1066479718\"></td></tr><tr><th colspan=\"2\" class=\"infobox-header\" style=\"background: gainsboro\"><span>Singles</span> from <i> Heartstopper: Official Mixtape </i></th></tr><tr><td colspan=\"2\" class=\"infobox-full-data\"><div style=\"text-align:left\"><ol><li><span class=\"item\"><span class=\"fn\">\"Colours of You\"</span><br>Released: 22 April 2022</span></li></ol></div></td></tr><tr style=\"display:none\"><td colspan=\"2\"></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>Heartstopper: Official Mixtape</i> track listing</caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:60%\">Title</th><th scope=\"col\" style=\"width:40%\">Artist(s)</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Colours of You\"</td><td><span>Baby Queen</span></td><td class=\"tracklist-length\">4:15</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Want Me\"</td><td>Baby Queen</td><td class=\"tracklist-length\">4:18</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Lovesick\"</td><td><span>Peace</span></td><td class=\"tracklist-length\">2:13</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Dover Beach\"</td><td>Baby Queen</td><td class=\"tracklist-length\">3:38</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"<span>Don't Delete the Kisses</span>\"</td><td><span>Wolf Alice</span></td><td class=\"tracklist-length\">4:35</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Sappho\"</td><td><span>Frankie Cosmos</span></td><td class=\"tracklist-length\">1:52</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Girls\"</td><td><span>Girl in Red</span></td><td class=\"tracklist-length\">3:18</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"Dance With Me\"</td><td><span>Beabadoobee</span></td><td class=\"tracklist-length\">3:54</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"Angel\"</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Lava La Rue</li><li>Deb Never</li></ul></div></td><td class=\"tracklist-length\">3:56</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Why Am I Like This?\"</td><td><span>Orla Gartland</span></td><td class=\"tracklist-length\">3:32</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"My Own Person\"</td><td>Smoothboi Ezra</td><td class=\"tracklist-length\">4:42</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"Telephone\"</td><td><span>Waterparks</span></td><td class=\"tracklist-length\">2:33</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Lucid\"</td><td><span>Rina Sawayama</span></td><td class=\"tracklist-length\">3:38</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Don't Leave Me (Chapter 1: Despair)\"</td><td><span>HMLTD</span></td><td class=\"tracklist-length\">3:32</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"<span>Clearest Blue</span>\"</td><td><span>Chvrches</span></td><td class=\"tracklist-length\">3:53</td></tr><tr><th id=\"track16\" scope=\"row\">16.</th><td>\"<span class=\"mw-redirect\">Alaska</span>\" (Toby Green remix)</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li><span>Maggie Rogers</span></li><li>Toby Green</li></ul></div></td><td class=\"tracklist-length\">3:05</td></tr><tr><th id=\"track17\" scope=\"row\">17.</th><td>\"What's It Gonna Be?\"</td><td><span>Shura</span></td><td class=\"tracklist-length\">3:34</td></tr><tr><th id=\"track18\" scope=\"row\">18.</th><td>\"Heart\"</td><td><span>Flor</span></td><td class=\"tracklist-length\">3:42</td></tr><tr><th id=\"track19\" scope=\"row\">19.</th><td>\"Nothing Else I Could Do\"</td><td>Ella Jane</td><td class=\"tracklist-length\">2:50</td></tr><tr><th id=\"track20\" scope=\"row\">20.</th><td>\"UrbanAngel1999\"</td><td>Thomas Headon</td><td class=\"tracklist-length\">3:12</td></tr><tr><th id=\"track21\" scope=\"row\">21.</th><td>\"If You Want To\"</td><td>Beabadoobee</td><td class=\"tracklist-length\">3:43</td></tr><tr><th id=\"track22\" scope=\"row\">22.</th><td>\"Buzzkill\"</td><td>Baby Queen</td><td class=\"tracklist-length\">3:24</td></tr><tr><th id=\"track23\" scope=\"row\">23.</th><td>\"Fever Dream\"</td><td><span>Mxmtoon</span></td><td class=\"tracklist-length\">3:16</td></tr><tr><th id=\"track24\" scope=\"row\">24.</th><td>\"Paper Mache World\"</td><td><span>Matilda Mann</span></td><td class=\"tracklist-length\">2:59</td></tr><tr><th id=\"track25\" scope=\"row\">25.</th><td>\"I Want to Be With You\"</td><td><span>Chloe Moriondo</span></td><td class=\"tracklist-length\">2:59</td></tr><tr><th id=\"track26\" scope=\"row\">26.</th><td>\"Knock Me Off My Feet\"</td><td>SOAK</td><td class=\"tracklist-length\">3:08</td></tr><tr><th id=\"track27\" scope=\"row\">27.</th><td>\"Flirting With Her\"</td><td><span>Sir Babygirl</span></td><td class=\"tracklist-length\">3:50</td></tr><tr><th id=\"track28\" scope=\"row\">28.</th><td>\"Bang Bang Bang\"</td><td><span>Lauran Hibberd</span></td><td class=\"tracklist-length\">2:22</td></tr><tr><th id=\"track29\" scope=\"row\">29.</th><td>\"Tired\"</td><td>Beabadoobee</td><td class=\"tracklist-length\">3:19</td></tr><tr><th id=\"track30\" scope=\"row\">30.</th><td>\"Any Other Way\"</td><td>Tomberlin</td><td class=\"tracklist-length\">3:22</td></tr><tr><th id=\"track31\" scope=\"row\">31.</th><td>\"Smokey Eyes\"</td><td>Lincoln</td><td class=\"tracklist-length\">3:15</td></tr><tr><th id=\"track32\" scope=\"row\">32.</th><td>\"Our Window\"</td><td><span>Noah and the Whale</span></td><td class=\"tracklist-length\">5:48</td></tr><tr><th id=\"track33\" scope=\"row\">33.</th><td>\"<span>Because I Love You</span>\"</td><td><span>Montaigne</span></td><td class=\"tracklist-length\">3:37</td></tr><tr><th id=\"track34\" scope=\"row\">34.</th><td>\"Close to You\"</td><td><span>Dayglow</span></td><td class=\"tracklist-length\">3:14</td></tr><tr><th id=\"track35\" scope=\"row\">35.</th><td>\"Moment In the Sun\"</td><td><span>Sunflower Bean</span></td><td class=\"tracklist-length\">3:09</td></tr><tr><th id=\"track36\" scope=\"row\">36.</th><td>\"I Belong In Your Arms\"</td><td><span>Chairlift</span></td><td class=\"tracklist-length\">3:27</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"3\" scope=\"row\"><span>Total length:</span></th><td>2:05:00</td></tr></tbody></table><br/><h3>Reception</h3><h4>Audience viewership</h4><p>During its debut week, Heartstopper ranked at number seven on Netflix's Top 10 TV English titles just two days after its release. Based on Netflix's methodology of measuring a programme by the number of hours, the series generated 14.55 million hours viewed. The following week, the show climbed to number 5 with 23.94 million hours viewed. In its third week, the show dropped to sixth position with new viewership numbers of 14.97 million viewing hours. Variety reported the series had reached Netflix's Top Ten list in 54 countries as of 20 May 2022. The series also topped the publication's Trending TV chart for over five weeks, judging by the 1.3 million Twitter engagements. The show appeared in the Top 10 list in three countries where same-sex relations are illegal (Lebanon, Saudi Arabia, and Sri Lanka).</p><h4>Critical response</h4><p>The series received critical acclaim. The review aggregator website Rotten Tomatoes reported a 100% approval rating with an average rating of 8.7/10, based on 55 critic reviews. The website's critical consensus reads: \"An inclusive romance told with striking sensitivity, Heartstopper is so effortlessly charming that viewers won't dare skip a beat.\" Metacritic, which uses a weighted average, assigned a score of 85 out of 100 based on nine critics, indicating \"universal acclaim\".</p><p>Reviewing the series for The Guardian, Rebecca Nicholson gave a rating of 4/5 and said, \"Heartstopper may not quite live up to the dramatic promise of its title, but this adorable teen romance is a heartwarmer, at the very least.\" Saloni Gajjar of The A.V. Club gave the series an A− and said \"Thankfully, Heartstopper subverts notions by keeping its protagonist proudly gay: It's the love interest who has to sort through his unexpected feelings, not the other way around. Nick's attraction to Charlie catches him by surprise (but not disdain).\" Digital Spy's David Opie gave a rating of 5/5 and said, \"Heartstopper centres queer love, affirming the feelings of young people watching who might be unsure or afraid to speak their truth.\" Jonathan Wilson of Ready Steady Cut gave a rating of 4/5 and stated, \"Heartstopper might lack some edge and feel as if it's speaking to a younger demographic than the usual teen drama, but its deeply uplifting portrait of young love is very difficult not to get swept up in.\" For Paste Magazine, Emily Maskell gave a rating of 8.8/10 and said, \"An open-armed embrace for queer youth, Heartstopper lays the strong foundations of what you can only hope will be the uplifting and inclusive depictions of queer characters for the next generation of viewers.\" Ezelle Alblas for The Upcoming gave a 5/5 rating and said, \"Heartstopper feels like a show everyone needs to see. It's sweet without the cheese and quietly radical without the shock factor of shows like Sex Education, Euphoria or It's a Sin.\"</p><p>Heartstopper was ranked the best show of 2022 by NME and The Mary Sue. Meanwhile, Entertainment.ie placed it at number four, TVLine at number eight, Decider at number nine, and PopBuzz at number 10, while The Austin Chronicle and Lifehacker included it in their respective unranked list. In addition, Collider named it one of the best new TV shows of 2022.</p><h4>Impact</h4><p>Following the release of the series, the first volume of Oseman's Heartstopper graphic novel became the top-selling children's bestseller in the UK. Songs featured in the series received large increases in chart sales and streams. Songs on the soundtrack that received a surge in chart sales when compared to the previous week included \"Want Me\" and \"Dover Beach\" by Baby Queen, \"Why Am I Like This?\" by Orla Gartland, and \"I Belong In Your Arms\" by Chairlift.</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Year</th><th scope=\"col\">Award</th><th scope=\"col\">Category</th><th scope=\"col\">Nominee(s)</th><th scope=\"col\">Results</th><th scope=\"col\" class=\"unsortable\"><abbr title=\"Reference(s)\">Ref.</abbr></th></tr><tr><td rowspan=\"26\">2022</td><td><span>Attitude Awards</span></td><td>TV Award</td><td><i>Heartstopper</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align: center;\"></td></tr><tr><td>C21 International Drama Awards</td><td>Best Comedy-Drama Series</td><td><i>Heartstopper</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align: center;\"></td></tr><tr><td rowspan=\"9\"><span>Children's and Family Emmy Awards</span></td><td>Outstanding Casting for a Live Action Program</td><td data-sort-value=\"Edwards, Daniel\">Daniel Edwards</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"9\" style=\"text-align: center;\"></td></tr><tr><td><span class=\"mw-redirect\">Outstanding Guest Performance in a Preschool, Children's or Young Teen Program</span></td><td data-sort-value=\"Colman, Olivia\">Olivia Colman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Outstanding Lead Performance in a Preschool, Children's or Young Teen Program</span></td><td data-sort-value=\"Connor, Kit\">Kit Connor</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td data-sort-value=\"Locke, Joe\">Joe Locke</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Makeup and Hairstyling</td><td data-sort-value=\"Ferreira, Diandra, Sorcha Fisher and Melanie Lindsay\">Diandra Ferreira, Sorcha Fisher and Melanie Lindsay</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Outstanding Supporting Performance in a Preschool, Children's or Young Teen Program</span></td><td data-sort-value=\"Finney, Yasmin\">Yasmin Finney</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td data-sort-value=\"Gao, William\">William Gao</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Writing for a Young Teen Program</td><td data-sort-value=\"Oseman, Alice\">Alice Oseman</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Young Teen Series</span></td><td><i>Heartstopper</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>Dorian Awards</span></td><td>Best LGBTQ Show</td><td><i>Heartstopper</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"3\" style=\"text-align: center;\"></td></tr><tr><td>Best TV Drama</td><td><i>Heartstopper</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best TV Performance</td><td data-sort-value=\"Connor, Kit\">Kit Connor</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Edinburgh TV Awards</span></td><td>TV Moment of the Year</td><td data-sort-value=\"Nick &amp; Charlie's First Kiss\">\"Nick &amp; Charlie's First Kiss\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align: center;\"></td></tr><tr><td><span>Gay Times Honours</span></td><td>On Screen Trailblazer</td><td>Cast of <i>Heartstopper</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align: center;\"></td></tr><tr><td><span>Hollywood Music in Media Awards</span></td><td>Original Song/Score — Trailer</td><td data-sort-value=\"Colours of You\">\"Colours of You\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align: center;\"></td></tr><tr><td><span>MTV Movie &amp; TV Awards</span></td><td><span>Best Musical Moment</span></td><td data-sort-value=\"Dance with Me\">\"Dance with Me\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align: center;\"></td></tr><tr><td rowspan=\"3\"><span>National Television Awards</span></td><td>New Drama</td><td><i>Heartstopper</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\" style=\"text-align:center;\"></td></tr><tr><td rowspan=\"2\">Rising Star</td><td data-sort-value=\"Connor, Kit\">Kit Connor</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td data-sort-value=\"Locke, Joe\">Joe Locke</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Rose d'Or Awards</span></td><td>Comedy Drama and Sitcom</td><td><i>Heartstopper</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align: center;\"></td></tr><tr><td>Emerging Talent</td><td data-sort-value=\"Finney, Yasmin\">Yasmin Finney</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align: center;\"></td></tr><tr><td><span>RTS Craft &amp; Design Awards</span></td><td>Casting Award</td><td data-sort-value=\"Edwards, Daniel\">Daniel Edwards</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td>Soho House Awards</td><td>Breakthrough Actress</td><td data-sort-value=\"Finney, Yasmin\">Yasmin Finney</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>TV Choice Awards</span></td><td>Best New Drama</td><td><i>Heartstopper</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"14\">2023</td><td><span>British Academy Television Awards</span></td><td><span class=\"mw-redirect\">Memorable Moment</span></td><td>\"Nick and Charlie's First Kiss\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>British Academy Television Craft Awards</span></td><td>Writer: Drama</td><td>Alice Oseman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td>Casting Directors' Guild Awards</td><td>Best Casting in a TV Drama Series</td><td data-sort-value=\"Edwards, Daniel, Lucy Allen, Tom Payne and Catherine Garlick\">Daniel Edwards, Lucy Allen, Tom Payne and Catherine Garlick</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>GLAAD Media Awards</span></td><td><span>Outstanding Kids and Family Programming – Live Action</span></td><td><i>Heartstopper</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"5\"><span class=\"mw-redirect\">Kidscreen Awards</span></td><td>Best Acting</td><td><i>Heartstopper</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"5\" style=\"text-align: center;\"><br></td></tr><tr><td>Best in Class</td><td><i>Heartstopper</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Inclusivity – Tweens/Teens</td><td><i>Heartstopper</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Live-Action Series – Tweens/Teens</td><td><i>Heartstopper</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best New Series – Tweens/Teens</td><td><i>Heartstopper</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Queerty Awards</span></td><td>Performance – TV</td><td>Joe Locke</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align: center;\"></td></tr><tr><td>TV Comedy</td><td><i>Heartstopper</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align: center;\"></td></tr><tr><td><span>Royal Television Society Programme Awards</span></td><td>Leading Actor: Male</td><td>Kit Connor</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align: center;\"></td></tr><tr><td><span>Satellite Awards</span></td><td><span>Best Drama Series</span></td><td><i>Heartstopper</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align: center;\"></td></tr><tr><td>Visionary Arts Awards</td><td>Television Show of the Year</td><td><i>Heartstopper</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align: center;\"></td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}