{
  "imDbId": "tt1442449",
  "title": "Spartacus",
  "fullTitle": "Spartacus (TV Series 2010–2013)",
  "type": "TVSeries",
  "year": "2010",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8803229",
      "warningSpoilers": false,
      "date": "16 January 2023",
      "rate": "10",
      "helpful": "43 out of 44 found this helpful.",
      "title": "Incredible!",
      "content": "I don't even know how to describe how much I love Spartacus, both the original and the prequel. I've watched the entire series all the way through at least four or five times because it's just that good. All you have to is read through the reviews to see how beloved this series is. The entire cast is just incredible. I think most people thought when Andy Whitfield tragically died and they had to recast the role of Spartacus that it would drop in quality. It didn't! As good as Whitfield was, Liam McIntyre stepped in and was just as good. It will grab your attention from the first episode and hold it throughout the series. If you haven't seen this amazing show yet stop what you're doing right now and go watch it!"
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw6137513",
      "warningSpoilers": false,
      "date": "30 September 2020",
      "rate": "10",
      "helpful": "78 out of 83 found this helpful.",
      "title": "Perfect!",
      "content": "Spartacus is ridiculously underrated and absolutely one of my favorite tv shows ever! It is one of the rare shows where each season is just as incredible as the others, all 4 seasons are fantastic & some of the best tv I've ever seen! I've watched the entire series 3 times already. After the original actor (Andrew Whitfield) who played Spartacus sadly died of non-Hodgkin's lymphoma after Season 1, they had to recast it and the actor who replaced him (Liam McIntyre) as Spartacus was just as terrific! Do yourself a favor and watch this incredible series immediately...you will not be disappointed! It really is the perfect show!"
    },
    {
      "username": "TerribleKatherine",
      "userUrl": "https://www.imdb.com/user/ur82557774",
      "reviewLink": "https://www.imdb.com/review/rw7887621",
      "warningSpoilers": false,
      "date": "21 February 2022",
      "rate": "9",
      "helpful": "30 out of 31 found this helpful.",
      "title": "After all these years, this show just rocks on!",
      "content": "I watched the whole Spartacus series back when it first came up and now I'm revisiting it. Still, it does stand it's ground. I had no recollection of Jai Courteney being in the series and I don't like him as an actor but as Varro he is just great. All the acting is great, even when it's over the top, it all just fits together so nicely. Yeah, the GCI is a bit funny now and then but after just a few episodes, I really started to enjoy it. This show is sad, exciting and just pure fun to watch. To Andy: you made such an impression on younger me and you still do. You are a legend."
    },
    {
      "username": "rexcapritarius",
      "userUrl": "https://www.imdb.com/user/ur102936575",
      "reviewLink": "https://www.imdb.com/review/rw5038395",
      "warningSpoilers": false,
      "date": "4 August 2019",
      "rate": "9",
      "helpful": "21 out of 21 found this helpful.",
      "title": "Captivating!",
      "content": "This series rocks! It is full of action packed historical fiction plots. As well as plenty of gratuitous nudity! Hehe"
    },
    {
      "username": "eyeguy72",
      "userUrl": "https://www.imdb.com/user/ur23994626",
      "reviewLink": "https://www.imdb.com/review/rw5928498",
      "warningSpoilers": false,
      "date": "23 July 2020",
      "rate": "9",
      "helpful": "85 out of 88 found this helpful.",
      "title": "Watching it a second time!",
      "content": "It's so good I'm watching it all over again. 10 years later it's still holds up. Amid all the glorious violence I had forgotten just how surprisingly emotional this series was. If you have not seen it, watch it!For fans of Gladiator, Xena, Hercules, and works by Sam Raimi. You need not have seen the original 1960 film Spartacus to enjoy the series as they are not related.Warning - every episode contains nudity and explicit sex scenes. You have been warned.And don't forget to watch the 6 episodes of Spartacus: Gods of the Arena, which aired between seasons one and two, but could be watched after this series. This was basically a holdover for the fans while it was hoped for and assumed by everyone involved that Andy Whitfield's return would be eminent.Sadly, Andy Whitfield was taken from us a year and a half after the final episode aired. If you like Andy and enjoyed his performance make sure to check out the documentary Be Here Now. RIP Andy Whitfield."
    },
    {
      "username": "Jamesmadz",
      "userUrl": "https://www.imdb.com/user/ur75798823",
      "reviewLink": "https://www.imdb.com/review/rw8830451",
      "warningSpoilers": false,
      "date": "27 January 2023",
      "rate": "10",
      "helpful": "32 out of 33 found this helpful.",
      "title": "All four seasons are worth your time",
      "content": "Spartacus Blood and sand.Spartacus Gods of the arena.Spartacus Vengeance.Spartacus War of the damned.Spartacus, either played by Andy (may he rest in peace) or Liam, the rest of the truly outstanding cast, the writing, the music,...The cgi in episode 1 takes some getting used to so whatever you do DON'T write the show off.The fact that we got Gods of the arena due to Andy battling his non Hodgkin lymphoma, a battle he sadly lost, is truly bittersweet...It is like nothing you have ever seen.There is a lot of nudity.There is a lot of sex.There is a lot of violence.There is a lot of blood.It is gnarly. It is gore.It's ... heartbreaking."
    },
    {
      "username": "cinema_forever19",
      "userUrl": "https://www.imdb.com/user/ur17781887",
      "reviewLink": "https://www.imdb.com/review/rw5684848",
      "warningSpoilers": true,
      "date": "28 April 2020",
      "rate": "9",
      "helpful": "73 out of 77 found this helpful.",
      "title": "You may watch the first episode and want to turn it off, but don't!! Keep watching, it's worth it!!",
      "content": "The first episode, I have to admit starts off quite underwhelming. Even I had low expectations already... But after a couple more episodes, it gets good... But wait, it gets better, and better, and even better! 300, Gladiator and the original Spartacus ain't got nothing on this epic show!! Even Game of Thrones with it's disappointing final season may have competition with this badassery of show."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw2556310",
      "warningSpoilers": true,
      "date": "28 January 2012",
      "rate": "10",
      "helpful": "30 out of 34 found this helpful.",
      "title": "Legendary TV show",
      "content": "Review of Blood and Sand: After ROME, I've always been on the look out for adult-oriented historical TV series that bring ancient eras to life in all their vivid, bloody glory. SPARTACUS: BLOOD AND SAND came out a couple of years ago, and only now have I caved in to see what all the fuss is about; I'm glad I did, because this gladiator drama is every bit the equal of ROME.I'll admit that the first couple of episodes (the first series runs for 13) left me distinctly ambivalent. The 300-style slow-mo fight scenes and lashings of CGI gore take some getting used to. However, then I started getting to know - and like - the individuals and each episode just seemed to get better and better. On the surface, the show is all about gladiator combat - and there are tons of grisly fight scenes - but at its heart it's another variation on UPSTAIRS, DOWNSTAIRS, depicting the lives of the masters and their slaves and showing how the two worlds interact.This is a show brimming with talent. The late, lamented Andy Whitfield is all heart in the titular role, but it's the supporting characters who really stand out. John Hannah is an actor I could never stand, but his hammy, larger-than-life turn as Batiatus is almost legendary. Lucy Lawless brushes aside memories of XENA with the cunning and manipulative Lucretia, and watching her snappy dialogue with Hannah is the stuff of pure joy. On the gladiator front, Peter Mensah and Manu Bennett are all heart as Doctore and Crixus respectively, and Nick Tarabay is a sly delight as the sneaking Ashur.The series builds on itself as it goes along, increasing the stakes, throwing in some genuine twists and shocks you won't see coming, and eventually culminating in the best finale of any series I've ever seen; to say it's dramatically satisfying is a real understatement. As the credits on the final episode rolled, I realised I'd watched a show that had become the stuff of genius, that had engaged my emotions to the max, and that I'll be gobbling up any future sequels or prequels that come along.Review of Gods of the Arena: GODS OF THE ARENA is the six-part prequel miniseries following on from BLOOD & SAND, necessitated by star Andy Whitfield's illness. At first I wondered whether the format would work with a different character in the leading role, but I needn't have worried: it turns out to be fantastic entertainment, just as good as the original show.I particularly like the shift in focus so that Batiatus is now a 'good' character when shown in comparison to his even-more-dastardly colleagues. His character arc is engaging, as are the various cloak-and-dagger shenanigans that take place at his ludos. In particular, the characters of Crixus and Ashur bag decent, unexpected story lines, although I was less enamoured with Gannicus himself. Still top drawer entertainment throughout, excellent fight scenes combined with truly intriguing plotting.Review of Vengeance: Fans who wondered whether SPARTACUS could continue in the wake of star Andy Whitfield's death needn't have worried: VENGEANCE proves to be a decent follow up to BLOOD & SAND, offering the same kind of plotting and intrigue that fans of the show love, albeit with a few changes to the format.It's not quite as good as the first couple of seasons, and that's due to some minor flaws in the writing. The stuff involving the Roman characters is a bit repetitive, and it was a mistake to bring back a major female character whose storyline was already spent at the end of BLOOD & SAND. Similarly, I was disappointed in the way Ashur (my favourite gladiator) becomes a stock villain rather than the multi-layered personality of the previous shows. And, let's face it, none of the episodes could ever hope to equal the brilliance of BLOOD & SAND's season finale, KILL THEM ALL.It's still great entertainment though. The fights - and there are plenty - look better than ever, more detailed and almost 3D in places. It's as if the cameras are offering twice as much detail and quality as previously. The sex and violence have been upped, and the blood looks much less CGI-like than in the original show. Episodes five and 10 of this show are particularly exciting, both offering rewarding climaxes to carefully-build sub-plotting.Review of War of the Damned: Wow. Wow. Wow. WAR OF THE DAMNED ends the SPARTACUS series on a real high, proving from the outset to be an immediate improvement over the predecessor, VENGEANCE. The plots feel deeper and more complex, the characters are more nuanced and intriguing, the story arc has a wider and more dramatic feel to it. It's clear that things are moving towards the climax, so there's little of that feeling of 'treading water' that marred the previous series, particularly with the Roman characters.One of the best things about this season is the way the characters have changed and matured, given all that they've gone through. The Romans are far more interesting, too, and much better than the stock villain Glabor. Crassus is particularly good, because there's a great actor playing him, and you also feel that he's not such a bad guy really. The guy playing Caesar is a delight, too, and I hope the mooted spin-off series emerges with him in the starring role.Elsewhere, production values seem better and more impressive; there are larger scale fights, packed with effects that don't disappoint. The action is more plentiful and brutal than ever, with some truly eye-popping visuals to be enjoyed. The first seven episodes are tremendously good in their own right, but then the last three episodes go somewhere else, reaching a level of profundity you wouldn't expect to see in a pulpy TV show like this. The climax is nothing less than riveting."
    },
    {
      "username": "QueenoftheGoons",
      "userUrl": "https://www.imdb.com/user/ur61493184",
      "reviewLink": "https://www.imdb.com/review/rw8331303",
      "warningSpoilers": true,
      "date": "13 July 2022",
      "rate": "10",
      "helpful": "28 out of 31 found this helpful.",
      "title": "The best of the best",
      "content": "Aside from the annoying way of how they talk i love this show. I'm a 32 year old woman and have fond memories of watching it with Dad. He'd watch it upstairs and i'd watch it downstairs and then we'd talk about it in the kitchen. He loved the gore and naked women, i loved the gore, and naked goons. Love Crixus, Gannicus, Julius, and the guy who kills Spartacus his name just slipped me. When Crixus first got slashed open and he went down i was in trauma. It was dad who assured me my goon would be okay and.......he was. Fond memories with Dad, i think of him every time i watch it since he's passed away. He's not around anymore to tell me my goons will be okay."
    },
    {
      "username": "DarioTheSweeper",
      "userUrl": "https://www.imdb.com/user/ur69869570",
      "reviewLink": "https://www.imdb.com/review/rw8392011",
      "warningSpoilers": false,
      "date": "1 August 2022",
      "rate": "10",
      "helpful": "26 out of 27 found this helpful.",
      "title": "Gladiators.",
      "content": "This series was promising and I saw it on TV. Even the actress of Xena had an important role.This is a series about gladiators and how they lived. They were slaves, which isn't great. Spartacus, as some know, was the most famous of those. Romans often made prisoners of war into such to watch them fight, a form of entertainment for the Roman people and Roman nobility. The fights were very brutal and almost always many had to die. Some have achieved fame and perhaps been some kind of hero. Crixus the Gaul is my favorite gladiator. I find the Roman Ilythia very desirable. The following seasons even show free gladiators fighting for their freedom.This was good fun and professionally done. Very well presented."
    },
    {
      "username": "BoulosSoueileh",
      "userUrl": "https://www.imdb.com/user/ur63069428",
      "reviewLink": "https://www.imdb.com/review/rw6464492",
      "warningSpoilers": false,
      "date": "11 January 2021",
      "rate": "10",
      "helpful": "18 out of 19 found this helpful.",
      "title": "I miss Andy Whitefield",
      "content": "After the first season you'll notice changing in the main actor \"Spartacus\". That's because Andy Whitefield passed away because of cancer. The series deserves a try but this is an appreciation post for Andy."
    },
    {
      "username": "strangegeeza",
      "userUrl": "https://www.imdb.com/user/ur156764968",
      "reviewLink": "https://www.imdb.com/review/rw8567204",
      "warningSpoilers": false,
      "date": "25 September 2022",
      "rate": "9",
      "helpful": "26 out of 26 found this helpful.",
      "title": "If only we had more TV shows like this, Great TV show.",
      "content": "Hands down this TV show has been my favourite TV show so far. The 1st season sets the back story for Spartacus before proceeding to the next two seasons where upon Spartacus takes out his revenge on the Romans, before then finally facing off the Romans in a epic battle. The story of Spartacus to me should be a story of the ages a story that is truly inspiring both in its historical sense and in this theatrical adaption. This show is very adult so not a show for children, but everything shown is to contextual and in line with the time, period and story so I don't have any problem with any of it, but others might. I highly recommend this TV show to anyone wanting to watch a story of portrayal, revenge, struggle and sacrifice plus more, its great!"
    },
    {
      "username": "MadamWarden",
      "userUrl": "https://www.imdb.com/user/ur34187486",
      "reviewLink": "https://www.imdb.com/review/rw7216429",
      "warningSpoilers": false,
      "date": "11 August 2021",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "START BINGING!",
      "content": "Not sure if it's just the times, but haven't cried this much since Bambi. What a series. So much crazed gore and violence wrapped in heroism and lore.This is not a series for those of delicate dispositions as the warning at the start of each episode foretells. It is hard not to get drawn into the characters and the plot. Obviously an amazing story and legend.The acting is fine and I love the dialogue. Filmed in the style of 300 you need to dispel notions of realism and enjoy the over the top cinematography.Highly highly recommended binge.Oh, and a little research into the backstory after completing series 2 will also bring a gush of tears."
    },
    {
      "username": "Andy-296",
      "userUrl": "https://www.imdb.com/user/ur0305809",
      "reviewLink": "https://www.imdb.com/review/rw2566617",
      "warningSpoilers": false,
      "date": "15 February 2012",
      "rate": "10",
      "helpful": "31 out of 37 found this helpful.",
      "title": "Bloody, sexy and very entertaining - but not for the easily offended",
      "content": "If you want a series about Roman history, one can watch HBO's Rome (a very fine TV show). If you want to see a trashy and outrageously entertaining TV show with nonstop gore and nudity (both male and female) as well as graphic sex, Spartacus (very loosely based on the history of Ancient Rome's slave gladiator turned rebel leader) should be the choice.Supposedly, TV shows are by necessity tamer than movies, yet I haven't seen any movie as consistently graphic about sex and violence as Spartacus. Suffice to say that almost everybody in the large cast of mostly muscular men and gorgeous women, gets naked in the series at some point. Episode 9 in particular – subtly called \"Whore\" – is a highlight in that regard.A bit slow to start (I struggled with episode 1, but get hooked after episode 2), this admittedly not for all tastes series, was filmed in New Zealand with a mostly Australian and Kiwi cast. Its striking visual style can be compared with 300 (the gladiator's trainer, the great Peter Mensah, had a small role in that movie). The show is finely led in the titular role by Andy Whitfield (unfortunately he died of cancer after the first season, and was replaced by another actor in the following season). Yet, even if most of the cast is great, the best performance to me is by John Hannah as the devious Batiatus, the owner of the Gladiator's school. Hannah, whose background has been mostly on British comedies, excels here. While he initially seems to lack the toughness one supposes a master of a gladiator's school should have, he is eventually seen as a charming yet also very cruel and cunning man. Also remarkable are the performances of Manu Bennett as the knucklehead (but eventually noble) gladiator Crixus, Viva Bianca as the gorgeous but scheming Ilythia, and Nick Tarabay as Batiatus slimy aide, Ashur."
    },
    {
      "username": "18Buddha",
      "userUrl": "https://www.imdb.com/user/ur87524412",
      "reviewLink": "https://www.imdb.com/review/rw7323205",
      "warningSpoilers": false,
      "date": "9 September 2021",
      "rate": "10",
      "helpful": "18 out of 20 found this helpful.",
      "title": "Amazing Series!",
      "content": "Everything about this series was amazing.You want action?you want Adventure?You want good plots?Convincing Costumes and settings?Blood and Gore? CheckSex and Beautiful Women? Check!inspired by a true story ? Check again!Come check this drama out! Its like a game of Thrones without the magic and the dragons, but it does have lots of sword battles and blood spilling and sex scenes of hot busty women!"
    },
    {
      "username": "angel-soha",
      "userUrl": "https://www.imdb.com/user/ur56243646",
      "reviewLink": "https://www.imdb.com/review/rw7750277",
      "warningSpoilers": false,
      "date": "12 January 2022",
      "rate": "10",
      "helpful": "16 out of 17 found this helpful.",
      "title": "RUTHLESS AND BEAUTIFUL",
      "content": "Sex nudity and violence is what everyone will tell you about this show...But the story,acting and the message it carries is what makes Spartacus one of the greatest shows ever..A tale of a Legend couldn't have been told in a more spectacular way..After death of Whitefield i thought of to quit watching the show but believe me Liam McIntyre has done equally good job so much so that at times you feel he is really the Spartacus resurrected..Other characters are equally good and they creat such a magic that you fall in love with the show... Lastly to get an idea about the show without any spoilers...Folks if you loved Gladiator and 300 ..you will find them toothless against the might of SPARTACUS."
    },
    {
      "username": "Rainbringerof3000",
      "userUrl": "https://www.imdb.com/user/ur160465773",
      "reviewLink": "https://www.imdb.com/review/rw8760930",
      "warningSpoilers": false,
      "date": "27 December 2022",
      "rate": "9",
      "helpful": "28 out of 28 found this helpful.",
      "title": "Probably one of the best series I have watched, ever",
      "content": "I almost wrote this series off in the first episode because the cgi background was so poor in that episode. But I stuck with it,and boy was I glad I did! The story was well written & entertaining, the action thrilling, the acting on point (& you get the distinct impression that everyone is having fun filming) & you end up caring for the characters. I love a period piece & this one's a doozey. Andy was a talent not to be outshone but there were many other actors of note on set too and they give it everything. Violent, so not for kids. But for adults who love fast paced, drama, violence, s*x and history, you cant look away."
    },
    {
      "username": "Crankgorilla",
      "userUrl": "https://www.imdb.com/user/ur17270158",
      "reviewLink": "https://www.imdb.com/review/rw7622871",
      "warningSpoilers": false,
      "date": "6 December 2021",
      "rate": "9",
      "helpful": "13 out of 14 found this helpful.",
      "title": "You will be entertained",
      "content": "This is so good. Every player in it was awesome. Crixos is an absolute superstar but they all are. Even all the extra's painted this picture of pure olden time carnage. It's better than you can get in any movie and if you like sword and sandal or ever interesting drama you should check this out. Really well done by all involved. I appreciated it. Lucy Lawless was a queen in this, I'd like to think her Xena confidence helped out. She would have helped a lot of the noobies. She was outstanding. I could write all day about this - soooo good, John Hanna. He's da man."
    },
    {
      "username": "gdonaldson-86399",
      "userUrl": "https://www.imdb.com/user/ur103652249",
      "reviewLink": "https://www.imdb.com/review/rw5386922",
      "warningSpoilers": false,
      "date": "6 January 2020",
      "rate": "10",
      "helpful": "46 out of 51 found this helpful.",
      "title": "No need for a long review",
      "content": "The complete series is an absolute masterpiece. As a former Australia producer I am so proud of the most sincere work not only from the cast but also the crew. Based in New Zealand it brings a complete smorgasbord of the great talents from director, producers, cinematography to a unique editing style and I must impress upon the casting just perfect. To all involved you do yourselves proud and you bring credit to our industry. Job well done!"
    },
    {
      "username": "sayanihussain",
      "userUrl": "https://www.imdb.com/user/ur56320397",
      "reviewLink": "https://www.imdb.com/review/rw7259701",
      "warningSpoilers": false,
      "date": "22 August 2021",
      "rate": "9",
      "helpful": "20 out of 21 found this helpful.",
      "title": "Is it a show? NO! Its pure art",
      "content": "So my regional netflix added this show a while ago and I was getting recommendation to see it. Initially I was very skeptical as I was not sure about the historical background. I thought its just another show with gladiator type fighting and lot of nudity (I read it in IMDBs section and reviews). After a while I gave it a try, I found first episode boring but continued to watch. And after third expisode when all major characters were introduced and story was making shape I found myself glued towards the screen to anticipate what is going to come next. I liked this show so much that I am watching it second time, we talk about GOT and Breaking Bad, IMO this show deserves equal standing."
    },
    {
      "username": "zarehkasraa",
      "userUrl": "https://www.imdb.com/user/ur119539904",
      "reviewLink": "https://www.imdb.com/review/rw7383017",
      "warningSpoilers": false,
      "date": "26 September 2021",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "Best Thing Ever",
      "content": "Very glorious and beautiful. A total masterpiece. Not recommended for family but you should see this show. With the best ending ever. Tears and joy all along. Thanks to make my life happy again. I love spartacus."
    },
    {
      "username": "lan-1688",
      "userUrl": "https://www.imdb.com/user/ur136246355",
      "reviewLink": "https://www.imdb.com/review/rw8310323",
      "warningSpoilers": false,
      "date": "7 July 2022",
      "rate": "9",
      "helpful": "23 out of 24 found this helpful.",
      "title": "The slaves trembled the Rome",
      "content": "When Spartacus wisely captured Tiberius and ordered the Romans to gladiatorially fight to tribute to Chris, the roles of the slaves and Romans were switched. The slaves became spectators in the simple improvised gladiatorial arena, invigorated by the blood of their enemies, while the Romans became gladiators and were slain by the slaves. This is however an exhilarating silhouette, but not the end of the story.It was a tragic story of slaves who fought in the face of their fated end, knowing that they could not do it. The Spartacus Revolt, which took place at the end of the Roman Republic, was the largest of the three slave wars in ancient Rome. More importantly, unlike the first two slave wars, which took place in Sicily, this time the revolt hit Rome itself hard. The entire war lasted three years, and the insurgent army may have exceeded 300,000 men at its peak. However, the insurgents had limited fighting power and cohesion, and many of them were old, weak, women and children.Amidst the violence and sexual spectacle, what sustained the entire story was the strong spiritual power of the slaves. These slaves dared to rebel against their masters and against Rome. The skills they developed to survive became their most powerful weapon. They fought in blood, and they were the first to defeat the Roman legions, making Rome tremble. Even at the last moment, they never retreated in the face of the fully-equipped Roman elite like dark clouds. For them, it was better to fall by the sword than to die by the whip of the master.The gladiatorial arena of ancient Rome was lofty, but it was built on the blood of slaves. The life of the nobles was rotten, and their playfulness and competition for fame and fortune were all at the expense of the slaves. The gladiators were flesh and blood, and their lives unfolded in blood and sand, licking blood from the tips of swords, but their lives were like grass. When the dignity of gladiators and slaves was trampled, love was deprived, and survival was not guaranteed, Spartacus, the former prayer for rain, started a wave of rebellion, for love, freedom, revenge, and liquidation to the Romans.Sadly, it was ultimately a haphazard and rabble-rousing group. As the leaders of the revolt, Spartacus and the others did not share the same motive. Gannicus was the only free gladiator, after the death of Oenomaus, he replaced his best friend on the path of the Avengers. However, although he was courageous, he was more of a wanderer in the queue, unable to bring more cohesion. Chris was the second in command in the team. After Nivea was sold away and he was poisoned, Chris chose to rush out of the training school with Spartacus. After finding Nivea, he trained her as a warrior and spent the rest of his life taking revenge on the Romans, the difference in philosophy led to Chris's departure. Revenge was Chris's mission, but in the face of the absolute strength gap, death was the inevitable end.Spartacus experienced stages of mental state. After being forced to kill Vali, Spartacus was aware of the lie of glory. He found that every fight he had in the gladiatorial arena was only a futile increase in the wealth and interests of the slave owner. When he found out that his wife Sura died at the hands of Batiatus, he chose to pay in blood. In the process of leading the uprising, Spartacus treated the people as Sura with compassion. He did not want to take revenge on the Romans. Instead, he wished to spread the idea of equality and freedom, and fight for the ultimate freedom of the former slaves. Living far from the war to graze horses and sing was he and Sura's unfulfilled wish, and he hoped that others would realize it.The slave-owning class was almost entirely villainous, and their profiles were rich and three-dimensional, their desires and struggles portrayed in detail. If it were not for the never-ending greed of the slave owners, the slaves would not have met their end and would not have embarked on the path of revenge. The day of reckoning finally came, the world ushered in the baptism of blood, Spartacus, at the cost of their lives, ushered in freedom for some of the slaves, so that the slave owners were forced to improve the living conditions of the slaves. More importantly, Spartacus brought the belief in the pursuit of freedom to the people. They no longer fought for the slave owners, nor for the gods, but for themselves. They chose to live their own way.Finally, I want to discuss about the love in the play. Whether in the gladiatorial arena or the real battlefield, love was the most tender comfort in the battle where life was repeatedly threatened. Tough guy Chris's consistent love for Nivea was enviable. He kept his promise to Nivea, rescuing her from the mines and accompanying her to repair herself by taking revenge on her enemies. Though important than life, Spartacus' Sura was more of a symbol to him in the viewer's eyes. In the second season, Mira's support for Spartacus was more heartwarming. Mira's role in the insurgent army was indispensable, she was a female warrior, always cloak and dagger. Saxa was also a beautiful and tough character like Mira, but Saxa's emotional attitude was more dashing than Mira. Even if Gannicus found someone else, she was still a beautiful and strong female general, and also found her own happiness."
    },
    {
      "username": "IPyaarCinema",
      "userUrl": "https://www.imdb.com/user/ur69153149",
      "reviewLink": "https://www.imdb.com/review/rw6878230",
      "warningSpoilers": true,
      "date": "4 May 2021",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Vengeance S2 Review",
      "content": "Review By Kamal KThe death of Batiatus (John Hannah) at the end of Spartacus: Blood and Sand left some big shoes to fill as Spartacus: Vengeance began. Glaber (Craig Parker), who was the reason Spartacus (Liam McIntyre) was in this mess in the first place, stepped to the forefront as the primary antagonist this season - tasked with stopping the slave rebellion before it can gain any real moment. With all that going for him, it was a bit surprising to see Glaber start out as a bit off a \"softie\" at the beginning of the season. That isn't to say he couldn't handle himself in a sword fight or command an army, but when it came to the subterfuge and scheming that Capua is rife with, Glaber was always one step behind.Even Glaber's search for Spartacus was challenged by a young rival with a thirst for power. Seppius (Tom Hobbs), while not that interesting himself, spurred Glaber's frustrations in his hunt for Spartacus. That coupled with Illithyia (Viva Bianca) plotting to abort Glaber's unborn child and marry another Praetor actually had me feeling sorry for the very man who enslaved Spartacus.However, as Glaber started to put the pieces of the puzzle together, he grew wise to his wife's plot and everything became clear. A lot of work went into making Glaber look like the fool in order to deliver his unsettling transformation in \"Libertus\" and it was well worth it. Glaber, who finally had enough of everyone working against him, took matters quite literally into his own hands by murdering Illithyia's father, crushing his wife's scheme to marry Varinius (Brett Tucker).The fallout from \"Libertus\" delivered a changed man. The very next episode had Glaber eliminating his chief competition, Seppius, in a brutal blood bath. While Glaber had tasted blood in battle, I get the impression that cold blooded murder was new to him, and he kind of liked the power it gave him. It was obvious he was hungry for more. As frustrating as it was to watch Glaber the softie in the first half of the season, it was quite fulfilling to see him take charge of his life in the second half. He walked with a bit of swagger and an \"I don't give a s**t\" attitude that made him a lot more exciting to watch. Glaber quickly evolved into a villain I loved to hate and a worthy successor to Batiatus as the show's chief antagonist.With Glaber going through a metamorphosis throughout the season, it was left to some other characters to continue the tradition of scheming and subterfuge. Lucretia (Lucy Lawless), Ilithyia and Ashur (Nick Tarabay) were three familiar faces from Season 1 who continued to have a very important impact now that Spartacus had rebelled.The fact that Lucretia was still alive wasn't just shocking to many viewers who thought she was dead at the end of Blood and Sand - Onscreen, most of the citizens of Capua attributed her continued existence as a miracle from the gods. It's an interesting concept as religion hasn't played much of a part in the Spartacus series thus far. What's amusing is that it was obvious that none of the lead characters actually think it was the gods who brought her back. Glaber was just humoring her apparent beliefs while she was useful to him. Ashur knew the gods played no part in saving her life since it was his doing. As for Lucretia, I think the animal sacrifice was just a show to make it appear she was a changed womanThe relationship that developed between these two was, for the lack of a better word, strange. At times I genuinely got the impression that Lucretia and Ilithyia cared for each other. They share an intimacy and understanding that is unique and they both know that. Yet their thirst for power, their jealousy, and a certain amount of madness had them constantly working against each other. It's almost as if neither one was content with just being happy. Or they were so concerned that the other is scheming against them that they feel the need to preemptively retaliate. It was a continually entertaining game they played but I'm glad their story met some sort of resolution by season's end.What a great character Ashur is. He continued to be every bit as good in Vengeance as he was in Blood and Sand. Ashur learned his brand of scheming from Batiatus. He sits back and watches everyone else work against each other, then picks and chooses his moment to whisper in someone's ear and watches the pieces fall where they may.There were a few new characters on the Roman side of things who left a lot to be desired. Both Seppia and Seppius were introduced early on but provided little in the way of entertainment. Seppius was an obstacle for Glaber to overcome but hardly developed as a character in his own right. He was a nuisance and Glaber's real competitor, Varinius, could have played double duty in that role.Needless to say, Liam McIntyre had a daunting task to carry out this season. While he didn't make quite the impact in the role of Spartacus as Andy Whitfield did in Blood and Sand, he still did an admirable job in the role. He never felt out of place and quickly made the character his own. He succeeded in conveying every rousing speech and every heartbreaking setback. It was good to see McIntyre maintain good chemistry with characters already established as close to Spartacus like Crixus (Manu Bennett), Mira (Katrina Law) and Oenomaus (Peter Menash). McIntyre was a great bit of casting in a very tough situation. He did the role of Spartacus justice.Both Spartacus and Glaber's respective groups work through their inner conflicts, they butt heads at the end of the season in what was a truly spectacular finish, filled with all the blood, violence and spectacle that you would expect from a Spartacus finale, forever changing the face of the series. While the season has its ups and downs, the finale packs a punch that won't easily be forgotten."
    },
    {
      "username": "rahulalia",
      "userUrl": "https://www.imdb.com/user/ur68879681",
      "reviewLink": "https://www.imdb.com/review/rw8492873",
      "warningSpoilers": false,
      "date": "27 August 2022",
      "rate": "10",
      "helpful": "26 out of 27 found this helpful.",
      "title": "I feel bad for those who turned down this series after watching the first episode",
      "content": "OMG!!! The Greatest tv series ever made! Absolutely perfect! Spartacus and Dexter had to be the best tv series IMO! Have already watched the complete series 4 times including gods of the arena! My God, I really wish to meet the makers and give them a hug!! PLEASE WATCH IT!!!!!!!RIP Andy! He has nailed the role of Spartacus. Special mention JH. I could listen to Batiatus speaking all day! This series has made me fall in love with Ancient Rome! I'm soo sooo obsessed with this series!! Too much of nudity, ofcourse it requires. Such accurate depiction of roman era. I just cant stop thinking about this series. Like I said in the header, I really feel bad for those who skipped the series just by judging the first episode. This series gets better and better by each episode!!!! Brilliant! Thank you makers!!!!"
    },
    {
      "username": "meairton-39463",
      "userUrl": "https://www.imdb.com/user/ur64711735",
      "reviewLink": "https://www.imdb.com/review/rw5060075",
      "warningSpoilers": false,
      "date": "14 August 2019",
      "rate": "9",
      "helpful": "28 out of 31 found this helpful.",
      "title": "Wasn't expecting much, but.... WOW.",
      "content": "I started watching this very belatedly in early 2019 while waiting for the final season of Game of Thrones. I figured some swords-and-sandals would fit the bill in the meantime.For the first two episodes, that's exactly what I got. Nothing special; a lot of gory violence, graphic sex and nudity, and colourful baroque mock-Shakespearean dialogue so over-the-top that I couldn't tell whether the acting was good or not. However, I had seen John Hannah (Batiatus) and Lucy Lawless (Lucretia) in other things before, so I stuck with it.And damn, did the show hook me quickly after that. Yes, the dialogue is absurd and nobody ever spoke like that, but the actors deliver it with such unrestrained gusto and are clearly having such a blast making the show that you can't help but get swept up in it. Also, the dialogue has the added virtue of being clever and well-written: for example, there's a scene in the final season (don't worry, no spoilers) in which Marcus Crassus is having a discussion with his son Tiberius and a young Julius Caesar. Crassus is speaking to both of them, and they are answering him -- but Crassus is completely oblivious to the fact that Tiberius and Caesar are simultaneously having their own verbal sparring match against each other, while still advancing their three-way discussion. I rewound that scene a few times just to watch it play out.Gory violence and graphic sex can only sustain a show for so long; fortunately, the characters are beautifully written and developed, and their relationships with each other (romantic or otherwise) are allowed to evolve and progress. By the end of the show I had come to care greatly about the central characters -- and what else could possibly be the mark of well-written characters effectively portrayed?It's the stuff of TV legend by this point that Andy Whitfield, who gave a virtuoso performance as Spartacus in season one, was diagnosed with cancer shortly after filming wrapped, and that it took his life. The switch to his successor Liam McIntyre took a little bit to get used to, but McIntyre stepped into the unenviable position of taking over from a well-liked and tragically departed predecessor in a central role, and made it his own. No small feat, that.In closing, if you're not a fan of gory violence, graphic sex and nudity, and casual profanity, this show won't be for you. If you're a \"fan\" of those things, watch the show, and you'll be surprised by how quickly they take a back seat to the story and the characters. Enjoy!"
    }
  ],
  "errorMessage": ""
}