{
  "imDbId": "tt1442449",
  "title": "Spartacus",
  "fullTitle": "Spartacus (TV Series 2010–2013)",
  "type": "TVSeries",
  "year": "2010",
  "language": "en",
  "titleInLanguage": "Spartacus (TV series)",
  "url": "https://en.wikipedia.org/wiki/Spartacus_(TV_series)",
  "plotShort": {
    "plainText": "Spartacus is an American television series produced in New Zealand that premiered on Starz on January 22, 2010, and concluded on April 12, 2013. The fiction series was inspired by the historical figure of Spartacus, a Thracian gladiator who from 73 to 71 BC led a major slave uprising against the Roman Republic departing from Capua. Executive producers Steven S. DeKnight and Robert Tapert focused on structuring the events of Spartacus' obscure early life leading up to the beginning of historical records.\r\nAfter the completion of the first season titled Spartacus: Blood and Sand, production for another season was delayed because lead actor Andy Whitfield was diagnosed with early-stage non-Hodgkin lymphoma so Starz produced a six-episode prequel miniseries entitled Spartacus: Gods of the Arena. When the actor's cancer recurred and he later died on September 11, 2011, Starz had actor Liam McIntyre take on the role of Spartacus in the second season titled Spartacus: Vengeance. On June 4, 2012, Starz announced the third and final season, titled Spartacus: War of the Damned. A sequel series is in development at Starz, with DeKnight returning to write for the show.",
    "html": "<p>Spartacus is an American television series produced in New Zealand that premiered on Starz on January 22, 2010, and concluded on April 12, 2013. The fiction series was inspired by the historical figure of Spartacus, a Thracian gladiator who from 73 to 71 BC led a major slave uprising against the Roman Republic departing from Capua. Executive producers Steven S. DeKnight and Robert Tapert focused on structuring the events of Spartacus' obscure early life leading up to the beginning of historical records.</p><p>After the completion of the first season titled Spartacus: Blood and Sand, production for another season was delayed because lead actor Andy Whitfield was diagnosed with early-stage non-Hodgkin lymphoma so Starz produced a six-episode prequel miniseries entitled Spartacus: Gods of the Arena. When the actor's cancer recurred and he later died on September 11, 2011, Starz had actor Liam McIntyre take on the role of Spartacus in the second season titled Spartacus: Vengeance. On June 4, 2012, Starz announced the third and final season, titled Spartacus: War of the Damned. A sequel series is in development at Starz, with DeKnight returning to write for the show.</p>"
  },
  "plotFull": {
    "plainText": "Spartacus is an American television series produced in New Zealand that premiered on Starz on January 22, 2010, and concluded on April 12, 2013. The fiction series was inspired by the historical figure of Spartacus, a Thracian gladiator who from 73 to 71 BC led a major slave uprising against the Roman Republic departing from Capua. Executive producers Steven S. DeKnight and Robert Tapert focused on structuring the events of Spartacus' obscure early life leading up to the beginning of historical records.\r\nAfter the completion of the first season titled Spartacus: Blood and Sand, production for another season was delayed because lead actor Andy Whitfield was diagnosed with early-stage non-Hodgkin lymphoma so Starz produced a six-episode prequel miniseries entitled Spartacus: Gods of the Arena. When the actor's cancer recurred and he later died on September 11, 2011, Starz had actor Liam McIntyre take on the role of Spartacus in the second season titled Spartacus: Vengeance. On June 4, 2012, Starz announced the third and final season, titled Spartacus: War of the Damned. A sequel series is in development at Starz, with DeKnight returning to write for the show.\r\nPlot\r\nBlood and Sand (2010)\r\nThe story begins with an unnamed Thracian's involvement in a unit of Roman auxiliary in a campaign against the Getae in the Lower Danube under the command of the legatus, Claudius Glaber. In 72–71 BC, Roman general Marcus Terentius Varro Lucullus, proconsul of the Roman province of Macedonia, marched against the Getae, who were allies of Rome's enemy, Mithridates VI of Pontus. The Getae frequently raid the Thracians' lands, so the Thracians are persuaded by Glaber to enlist in the Romans' service as auxiliaries. Glaber is persuaded by his wife Ilithyia to seek greater glory, decides to break off attacking the Getae and directly confront the forces of Mithridates in Asia Minor. The Thracian, feeling betrayed, leads a mutiny against Glaber, and returns to find his village destroyed. The Thracian and his wife Sura are captured by Glaber the next day; the Thracian is condemned to die in the gladiator arena for his crime, while Sura is taken away, condemned to slavery. The Thracian is shipped to Capua in Italy, a center of gladiator training. Against all odds in the arena, he slays the four gladiators appointed to execute him and becomes an instant sensation with the crowd. Senator Albinius commutes the punishment from death to slavery. The prisoner's true name unknown, Quintus Lentulus Batiatus, the owner of a ludus in Capua, suggests to name him \"Spartacus\", because he fought like the ferocious Thracian king of that name. Noting well the Thracian's fierce raw talent and popularity with the masses, Batiatus purchases him for training within the walls of his ludus under the tutelage of Oenomaus, a former gladiator and fellow slave who is known to the gladiators as 'Doctore', meaning instructor. He is befriended by Varro, a Roman who sold himself into slavery in order to pay his debts and support his family. He is harassed by more senior gladiators, notably Crixus, an undefeated Gaul, and Barca, a Carthaginian. Spartacus soon learns that Sura was sold to a Syrian slave trader. Batiatus, who has been unable to control Spartacus during his first days of training, promises to find Sura and reunite them in exchange for the promising neophyte's cooperation in the arena.\r\nAfter many near-fatal ordeals and much further training Spartacus kills Theokoles, The Shadow of Death, and attains the status of a living legend and is named the \"Champion of Capua\" and \"The Bringer of Rain\". Batiatus arranges the purchase of Sura, but she is delivered mortally wounded, supposedly having been waylaid by bandits en route. Her murder was secretly ordered by Batiatus to keep Spartacus loyal and focused. Spartacus casts off his heritage as a Thracian and forgets his dream of freedom, becoming content with life as champion. Meanwhile, Barca, wishing to buy his freedom, was slain by Batiatus with the help of slave and former gladiator, Ashur. Batiatus' wife, Lucretia, is conducting an affair with Crixus. She and Batiatus have been unable to conceive a child, though she later falls pregnant with Crixus' child.\r\nThe turning point comes when Spartacus is set to fight his only friend in the ludus, Varro, in an exhibition match celebrating the coming to manhood of the Capuan magistrate's son, Numerius. Ilithyia, who has hated Spartacus since he embarrassed her husband Glaber by his mutiny, seduces the young man and convinces him to demand death for the loser of the match. Spartacus wins (as expected), and when the young man gives the \"thumbs down\", Batiatus, wishing to ingratiate himself with the boy's powerful father, forces Spartacus to comply and kill Varro. While suffering from both his wound in this match and his remorse and sorrow over having to kill his friend, Spartacus has fever dreams that lead him to suspect that Batiatus arranged Sura's death. He is able to confirm this by forcing Batiatus' man, Aulus, to confess the act before killing him. Knowing that it is all or nothing when it comes to resisting his enslavement, he resolves to \"kill them all\" and lead a revolt against the ruling house he once fought for.\r\nIn order to get his revenge, Spartacus enlists the help of Crixus and the rest of the gladiators to defeat the house of Batiatus once and for all. A battle to the death between Crixus and Spartacus is arranged for the Capuan elite at the ludus. Doctore (whom Batiatus refers to by his real name, Oenomaus) confronts Batiatus about Barca's death and Ashur's hand in it. Spartacus gains support from Mira, Batiatus' wife's new slave, who is tasked with opening the gate to the villa from the training area. Crixus resists aiding Spartacus in hopes of reuniting with his lover Naevia; (banished from the ludus by Lucretia after she discovers her affair with Crixus because of Ashur's trick to avenge Crixus), however, after learning he was weakened to ensure Spartacus' victory, at the last moment he joins with Spartacus. Doctore initially stops Spartacus from killing Batiatus. In the ensuing chaos of the gladiators' killing of the guards and some guests, Crixus persuades Doctore to join him with Spartacus, while Illithyia escapes and has her guards seal the door to the ludus from the outside. Doctore, making good on his word, tries to kill Ashur but his intended victim eludes him. Crixus grievously wounds Lucretia with a sword stab to her abdomen, piercing her womb and killing their unborn child. Varro's wife, Aurelia, kills Numerius after revealing to him that Varro was her husband, and Spartacus finally kills Batiatus in front of the seriously wounded Lucretia. After the massacre, Spartacus vows to make \"Rome tremble\".\r\nGods of the Arena (2011)\r\nThe miniseries features the history of the House of Batiatus and the city of Capua before the arrival of Spartacus. The main story opens not long after Quintus Lentulus Batiatus becomes lanista, manager of the House's slaves and gladiators, when he takes over his father's ludus.\r\nBatiatus is quickly discovered to have grand ambitions, beginning with the stepping out from his father's shadow. As the story progresses, Batiatus continues to seek greatness for the House under his leadership, as well as recognition for his own name. By his side stands his devoted wife, Lucretia, who is willing to help her husband achieve his goals regardless of the cost. Batiatus soon places all of his fortunes on one man whom he believes will bring fame and glory to the House of Batiatus, his best gladiator, the Celt Gannicus. Gannicus is a skilled warrior almost without equal, who wields his dual swords in the arena with great prowess. However, Batiatus' opponents would not sit idly and allow his ascent to greatness without challenge.\r\nPurchased as an undisciplined and disheveled recruit in the first episode, Crixus the Gaul initially endures mockery and threats of death, before eventually rising to become a gladiator of skill and fame second only to Gannicus. As Batiatus fends off repeated attempts by his professional rival Tullius and his other archenemy Vettius to obtain Gannicus, his relationships with his father Titus and friend Solonius begin to suffer the strain of Quintus' relentless ambition. Former champion gladiator Oenomaus reluctantly retires from combat to become Doctore, while Syrian recruits Ashur and Dagan become fierce enemies as Ashur tries to prove himself worthy of being a gladiator. Veteran gladiators Barca and Gannicus accept the rising star of Crixus but fear that their own careers will suffer, as the machinations of Batiatus and Lucretia to court Capua's elite end in tragedy for several members of the household. Against all of this, the city's splendid new arena nears completion and with it the opening games that will make men into gods. When the arena opens Solonius' and Batiatus' gladiators compete with each other, Batiatus' gladiators prevailing in the contest. Gannicus again proves himself to be the champion of Capua and the god of the arena and by virtue of his win against Solonius' gladiators, becomes the champion of Capua and gains his freedom.\r\nVengeance (2012)\r\nAfter the bloody escape from the House of Batiatus that concluded Spartacus: Blood and Sand, the gladiator rebellion begins to strike fear into the heart of the Roman Republic in Spartacus: Vengeance. Praetor Claudius Glaber and his Roman troops are sent to Capua to crush Spartacus' growing band of freed slaves before they can inflict further damage. Spartacus is given a choice between satisfying his personal need for vengeance against the man who condemned his wife to slavery and eventual death, or making the larger sacrifices necessary to keep his budding army from breaking.\r\nWar of the Damned (2013)\r\nThis final season of Spartacus began airing January 25, 2013 and concluded April 12, 2013. This season follows the final struggle between Spartacus and Marcus Licinius Crassus. Crassus pursues Spartacus as he struggles to feed his ever-growing army of former slaves. Spartacus wins several victories against Crassus' forces and continues to frustrate the Romans. The series culminates in a direct all-out battle between Spartacus and Crassus.\r\nCast and characters\r\nGladiators and slaves\r\nAndy Whitfield (season 1 and prequel) and Liam McIntyre (seasons 2–3) as Spartacus – a Thracian slave who becomes a gladiator in the ludus of Lentulus Batiatus before leading a slave uprising.\r\nManu Bennett (seasons 1–3 and prequel) as Crixus – a Gaul, he was Batiatus' top gladiator prior to Spartacus. Love interest of Naevia, and secondary leader of the rebellion.\r\nLesley-Ann Brandt (season 1 and prequel) and Cynthia Addai-Robinson (seasons 2–3) as Naevia – Lucretia's personal and loyal slave. Love interest of Crixus.\r\nPeter Mensah (seasons 1–2 and prequel) as Oenomaus – Batiatus' Numidian doctore (trainer) of gladiators, and reluctant advisor to the rebels. The historical Oenomaus was a Gaul.\r\nNick E. Tarabay (seasons 1–2 and prequel) as Ashur – a Syrian former gladiator whose leg was crippled in the arena by Crixus; later served Batiatus as a bookkeeper and henchman.\r\nJai Courtney (season 1) as Varro – a Roman citizen who sold himself to the ludus to support his family.\r\nAntonio Te Maioha (season 1 and prequel) as Barca – nicknamed the \"Beast of Carthage\", is one of Batiatus' most successful gladiators, serves as a bodyguard for his master.\r\nErin Cummings (season 1) as Sura – the wife of Spartacus.\r\nDan Feuerriegel (seasons 1–3) as Agron – a German gladiator who was sold to Batiatus' ludus, he was the first to join Spartacus in his revolt.\r\nKatrina Law (seasons 1–2) as Mira – a slave girl sent under threat of death to seduce Spartacus and become his lover. She takes charge of logistical matters as a leader of the rebellion.\r\nBrooke Williams (season 1 and season 2 premiere) as Aurelia – the wife of Varro.\r\nDustin Clare (prequel, seasons 2–3) as Gannicus – champion gladiator of the Batiatus' ludus before the arrival of Spartacus. Later, as a free man, he joins old friends in the revolt.\r\nMarisa Ramirez (prequel) as Melitta – Lucretia's personal slave and the wife of Oenomaus.\r\nPana Hema Taylor (seasons 2–3) as Nasir – a young slave liberated from a villa by Spartacus and his army of rebels.\r\nEllen Hollman (seasons 2–3) as Saxa – a German slave rescued by the rebels. She later joins the rebels.\r\nHeath Jones (seasons 2–3) as Donar – a prominent German rebel and former gladiator from the House of Batiatus.\r\nJenna Lind (season 3) as Kore – a loyal slave to Marcus Crassus the Roman tasked to bring an end to Spartacus and his rebellion. Her deep feelings for her master will be sorely tested by spiraling events.\r\nGwendoline Taylor (season 3) as Sibyl – a young slave rescued from Roman cruelty. Now free, she will embark on a journey.\r\nAnna Hutchison (season 3) as Laeta – a privileged wife of a Roman dignitary who becomes entangled in the struggle against Spartacus. Her life and those of the ones she loves are forever changed by the conflict.\r\nRomans\r\nJohn Hannah (season 1 and prequel) as Quintus Lentulus Batiatus – a lanista and Spartacus' master.\r\nLucy Lawless (seasons 1–2 and prequel) as Lucretia – Batiatus' wife.\r\nViva Bianca (seasons 1–2) as Ilithyia – the daughter of senator Albinius and wife of Glaber.\r\nCraig Parker (seasons 1–2) as Gaius Claudius Glaber – a Roman army legatus who is responsible for Spartacus' enslavement as a gladiator.\r\nCraig Walsh Wrightson (season 1 and prequel) as Solonius – a rival lanista and former friend to the House of Batiatus.\r\nStephen Lovatt (prequel) as Tullius – Batiatus' business rival.\r\nJaime Murray (prequel) as Gaia – a social climber and Lucretia's friend.\r\nJeffrey Thomas (prequel and season 2) as Titus Lentulus Batiatus – Quintus Batiatus' father and owner of the family's ludus.\r\nGareth Williams (prequel) as Vettius – Tullius' young henchman and owner of a rival ludus.\r\nTom Hobbs (season 2) as Seppius – a young Capua citizen of note. He wishes to strip the honor of capturing Spartacus from Glaber.\r\nHanna Mangan-Lawrence (season 2) as Seppia – younger sister to Seppius.\r\nBrett Tucker (season 2) as Publius Varinius – Glaber's chief political rival and fellow praetor.\r\nSimon Merrells (season 3) as Marcus Licinius Crassus – the richest man in the Roman Republic. Envied and despised by the highborn among the senate, he craves the power and respect that defeating Spartacus and his rebel army would bring.\r\nChristian Antidormi (season 3) as Tiberius Licinius Crassus – the eldest son of Marcus Licinius Crassus, and his father's \"word, and will\" in Crassus' army.\r\nTodd Lasance (season 3) as Gaius Julius Caesar – a handsome young rogue from an esteemed lineage and his deadly intelligence and skill with a sword will be brought to bear against the rebellion as he begins his ascent towards the all-powerful ruler he will one day become.\r\nProduction\r\nAfter filming in early 2009 and promoting for some time, it was announced that Starz would premiere Spartacus: Blood and Sand on January 22, 2010. On December 22, 2009, a month before it premiered, it was announced that the show was renewed by Starz for a second season.\r\nOn March 9, 2010, IGN.com reported that production of Season 2 had been delayed due to star Whitfield being diagnosed with early-stage non-Hodgkin lymphoma. Due to the delay, Starz announced in May 2010 that it would be developing a six-episode prequel series, entitled Spartacus: Gods of the Arena, to allow star actor Whitfield to seek medical treatment. The prequel featured both new and returning stars, headlined by John Hannah as Batiatus and Lucy Lawless as Lucretia. Star Andy Whitfield also briefly appeared in a voice-over role. Production began in New Zealand in the summer of 2010 and the prequel aired beginning January 2011.\r\nIn September 2010, Starz announced that Whitfield's cancer had returned and that he had decided not to return for the production of Season 2, then tentatively scheduled for September 2011. Starz announced that the show would nevertheless continue, and planned on recasting the role of Spartacus in the wake of Whitfield's exit. Whitfield gave his blessing for Starz to recast the role when he announced he would not return.\r\nSpartacus series creator Steven S. DeKnight said in an interview, \"There are a 'couple of very strong candidates' for the role of Spartacus, and season two should begin production in New Zealand in April 2011.\" DeKnight added that the Spartacus producers and Starz executives weren't always sure they would go forward without Andy Whitfield, who they said had brought \"gravity and heart\" to the role of the famous warrior. \"It's unheard of to recast your titular character in a television show, and we did a lot of soul searching about whether we even wanted to try,\" DeKnight said. \"And then Andy said, 'I really think the show should go forward without me. I give you the blessing. I want this story told.'\" On January 17, 2011, it was announced that Australian film and TV actor Liam McIntyre had been selected to replace Whitfield.\r\nOn February 26, 2011 interview with Entertainment Weekly, DeKnight revealed that the second season was set to air \"the end of January\" 2012. Additionally, he revealed that Lesley-Ann Brandt, the actress who portrayed the slave Naevia, would also not be able to return for season 2 due to the delay in production. On August 1, 2011, Starz released a trailer indicating that the long-delayed second season would premiere in January 2012, under the new subtitle, Spartacus: Vengeance.\r\nAndy Whitfield died on September 11, 2011, from complications of non-Hodgkin lymphoma. He was 39 years old.\r\nOver two months before the premiere, on November 7, 2011, Starz announced that it was renewing Spartacus for a third season–a second year with Liam McIntyre in the titular role; and fourth year on the air overall.\r\nThe second season eventually premiered on January 27, 2012.\r\nOn June 1, 2012, Starz released a teaser video of the next season on YouTube.\r\nOn June 4, 2012, Starz announced that the 4th season of Spartacus (War of the Damned) will be the final one for the series.\r\nStarz released the first full trailer for Spartacus: War of the Damned on July 13, 2012.\r\nOther media\r\nBoard game\r\nIn 2012 Gale Force Nine announced the creation of licensed board game based on the Spartacus series. The English language release of the game Spartacus: A Game of Blood and Treachery had a limited release at Gen Con 2012 and a general release to game and hobby stores on September 28, 2012.\r\nComics\r\nIn 2009, Devil's Due published a four-part prequel comic series, titled Spartacus – Blood And Sand. Each issue spotlighted a character from the upcoming television series, mostly the minor gladiator rivals of the main cast.\r\nThe series was adapted as a 4-part motion comic adaptation called Spartacus – Blood and Sand – Motion Comic. Ray Park and Heath Freeman were cast. Kyle Newman was the director, and the producers were Andy Collen and Jeff Krelitz.\r\nNovels\r\nIn 2012 Titan Books announced the publication of a series of novels based on Spartacus: Blood and Sand. The first one, titled Spartacus: Swords & Ashes, was written by J.M. Clements and released on January 3, 2012.\r\nThe second book in the series, Spartacus: Morituri by Mark Morris, was released in August 2012.\r\nVideo game\r\nIn 2012, Ubisoft announced that they would be publishing a video game based on the series. The game, titled Spartacus Legends, has been developed by Kung Fu Factory and was released on June 26, 2013, on Xbox Live and the PlayStation Network.\r\nHome media\r\nThe DVD and Blu-ray Disc sets of each season were released in various regions after their television broadcast. These DVDs were released by Starz subsidiary Anchor Bay Entertainment.\r\nReception\r\nThe premiere episode of the series set a record for Starz, with 553,000 viewers on their network, and another 460,000 on Encore, where the show was available only that weekend. For the rest of the season the show had an average of 1.285 million viewers. Critical reception of the first episode was mixed; the review aggregate website Metacritic which assigns a normalized average score out of 100 gave the show a score of 54% based on 22 reviews. Ken Tucker of Entertainment Weekly gave it the grade B+, saying it \"might prove to be the not-at-all-guilty pleasure of the season.\" Barry Garron of The Hollywood Reporter suggested that with \"such thin stories... it's small wonder that sex and violence are used to take up the slack.\" Robert Lloyd of the Los Angeles Times wrote that John Hannah as Batiatus \"keeps the show grounded with a persuasive portrait of a man engaged in a stressful daily business.\" Mark Perigard of the Boston Herald gave the season finale a positive review, rating it a B+. He commented on the improvement of the series throughout its first season.\r\nAccolades\r\nBroadcast\r\nThe series aired in Canada on TMN beginning on January 25, 2010. RTL 5 announced in their January newsletter that Spartacus: Blood and Sand will debut in the Netherlands in March. In the United Kingdom, Bravo began airing the series on May 25, 2010. Following the closure of Bravo on UK television, Sky1 picked up the rights to the series and continued to air all subsequent seasons. In conjunction with the UK airings of Spartacus: War of the Damned on Monday nights at 10pm, a Tweet-a-long was held from the official Spartacus Twitter page, in which fans posted tweets during the episode, using the hashtag #SpartacusWarOfTheDamned. The series premiered in Poland on HBO Poland starting from June 19, 2010 and in Hungary on HBO Magyarország starting from June 1, 2010. The series aired in Ireland on TV3. In Brazil, the show aired on Globosat HD. In Turkey, the show was released on CNBC-E TV, while in Italy, Sky Television was the broadcaster who gained the rights of the series. In India and Pakistan, the show aired on HBO. In Slovenia, the series started airing on Kanal A on 2 January 2012, from Monday to Friday at 9.45 pm. In 2014, Syfy began to air an edited version of the series. Between 2016 and 2020 the series was available on Netflix.\r\nSequel series\r\nOn February 9, 2023, Starz announced that they were developing a revival and sequel series to Spartacus, with DeKnight returning to write for the series. The show will take place following the death of Spartacus and the slave army's defeat, and will feature characters returning from the original series.",
    "html": "<p>Spartacus is an American television series produced in New Zealand that premiered on Starz on January 22, 2010, and concluded on April 12, 2013. The fiction series was inspired by the historical figure of Spartacus, a Thracian gladiator who from 73 to 71 BC led a major slave uprising against the Roman Republic departing from Capua. Executive producers Steven S. DeKnight and Robert Tapert focused on structuring the events of Spartacus' obscure early life leading up to the beginning of historical records.</p><p>After the completion of the first season titled Spartacus: Blood and Sand, production for another season was delayed because lead actor Andy Whitfield was diagnosed with early-stage non-Hodgkin lymphoma so Starz produced a six-episode prequel miniseries entitled Spartacus: Gods of the Arena. When the actor's cancer recurred and he later died on September 11, 2011, Starz had actor Liam McIntyre take on the role of Spartacus in the second season titled Spartacus: Vengeance. On June 4, 2012, Starz announced the third and final season, titled Spartacus: War of the Damned. A sequel series is in development at Starz, with DeKnight returning to write for the show.</p><br/><h3>Plot</h3><h4>Blood and Sand (2010)</h4><p>The story begins with an unnamed Thracian's involvement in a unit of Roman auxiliary in a campaign against the Getae in the Lower Danube under the command of the legatus, Claudius Glaber. In 72–71 BC, Roman general Marcus Terentius Varro Lucullus, proconsul of the Roman province of Macedonia, marched against the Getae, who were allies of Rome's enemy, Mithridates VI of Pontus. The Getae frequently raid the Thracians' lands, so the Thracians are persuaded by Glaber to enlist in the Romans' service as auxiliaries. Glaber is persuaded by his wife Ilithyia to seek greater glory, decides to break off attacking the Getae and directly confront the forces of Mithridates in Asia Minor. The Thracian, feeling betrayed, leads a mutiny against Glaber, and returns to find his village destroyed. The Thracian and his wife Sura are captured by Glaber the next day; the Thracian is condemned to die in the gladiator arena for his crime, while Sura is taken away, condemned to slavery. The Thracian is shipped to Capua in Italy, a center of gladiator training. Against all odds in the arena, he slays the four gladiators appointed to execute him and becomes an instant sensation with the crowd. Senator Albinius commutes the punishment from death to slavery. The prisoner's true name unknown, Quintus Lentulus Batiatus, the owner of a ludus in Capua, suggests to name him \"Spartacus\", because he fought like the ferocious Thracian king of that name. Noting well the Thracian's fierce raw talent and popularity with the masses, Batiatus purchases him for training within the walls of his ludus under the tutelage of Oenomaus, a former gladiator and fellow slave who is known to the gladiators as 'Doctore', meaning instructor. He is befriended by Varro, a Roman who sold himself into slavery in order to pay his debts and support his family. He is harassed by more senior gladiators, notably Crixus, an undefeated Gaul, and Barca, a Carthaginian. Spartacus soon learns that Sura was sold to a Syrian slave trader. Batiatus, who has been unable to control Spartacus during his first days of training, promises to find Sura and reunite them in exchange for the promising neophyte's cooperation in the arena.</p><p>After many near-fatal ordeals and much further training Spartacus kills Theokoles, The Shadow of Death, and attains the status of a living legend and is named the \"Champion of Capua\" and \"The Bringer of Rain\". Batiatus arranges the purchase of Sura, but she is delivered mortally wounded, supposedly having been waylaid by bandits en route. Her murder was secretly ordered by Batiatus to keep Spartacus loyal and focused. Spartacus casts off his heritage as a Thracian and forgets his dream of freedom, becoming content with life as champion. Meanwhile, Barca, wishing to buy his freedom, was slain by Batiatus with the help of slave and former gladiator, Ashur. Batiatus' wife, Lucretia, is conducting an affair with Crixus. She and Batiatus have been unable to conceive a child, though she later falls pregnant with Crixus' child.</p><p>The turning point comes when Spartacus is set to fight his only friend in the ludus, Varro, in an exhibition match celebrating the coming to manhood of the Capuan magistrate's son, Numerius. Ilithyia, who has hated Spartacus since he embarrassed her husband Glaber by his mutiny, seduces the young man and convinces him to demand death for the loser of the match. Spartacus wins (as expected), and when the young man gives the \"thumbs down\", Batiatus, wishing to ingratiate himself with the boy's powerful father, forces Spartacus to comply and kill Varro. While suffering from both his wound in this match and his remorse and sorrow over having to kill his friend, Spartacus has fever dreams that lead him to suspect that Batiatus arranged Sura's death. He is able to confirm this by forcing Batiatus' man, Aulus, to confess the act before killing him. Knowing that it is all or nothing when it comes to resisting his enslavement, he resolves to \"kill them all\" and lead a revolt against the ruling house he once fought for.</p><p>In order to get his revenge, Spartacus enlists the help of Crixus and the rest of the gladiators to defeat the house of Batiatus once and for all. A battle to the death between Crixus and Spartacus is arranged for the Capuan elite at the ludus. Doctore (whom Batiatus refers to by his real name, Oenomaus) confronts Batiatus about Barca's death and Ashur's hand in it. Spartacus gains support from Mira, Batiatus' wife's new slave, who is tasked with opening the gate to the villa from the training area. Crixus resists aiding Spartacus in hopes of reuniting with his lover Naevia; (banished from the ludus by Lucretia after she discovers her affair with Crixus because of Ashur's trick to avenge Crixus), however, after learning he was weakened to ensure Spartacus' victory, at the last moment he joins with Spartacus. Doctore initially stops Spartacus from killing Batiatus. In the ensuing chaos of the gladiators' killing of the guards and some guests, Crixus persuades Doctore to join him with Spartacus, while Illithyia escapes and has her guards seal the door to the ludus from the outside. Doctore, making good on his word, tries to kill Ashur but his intended victim eludes him. Crixus grievously wounds Lucretia with a sword stab to her abdomen, piercing her womb and killing their unborn child. Varro's wife, Aurelia, kills Numerius after revealing to him that Varro was her husband, and Spartacus finally kills Batiatus in front of the seriously wounded Lucretia. After the massacre, Spartacus vows to make \"Rome tremble\".</p><h4>Gods of the Arena (2011)</h4><p>The miniseries features the history of the House of Batiatus and the city of Capua before the arrival of Spartacus. The main story opens not long after Quintus Lentulus Batiatus becomes lanista, manager of the House's slaves and gladiators, when he takes over his father's ludus.</p><p>Batiatus is quickly discovered to have grand ambitions, beginning with the stepping out from his father's shadow. As the story progresses, Batiatus continues to seek greatness for the House under his leadership, as well as recognition for his own name. By his side stands his devoted wife, Lucretia, who is willing to help her husband achieve his goals regardless of the cost. Batiatus soon places all of his fortunes on one man whom he believes will bring fame and glory to the House of Batiatus, his best gladiator, the Celt Gannicus. Gannicus is a skilled warrior almost without equal, who wields his dual swords in the arena with great prowess. However, Batiatus' opponents would not sit idly and allow his ascent to greatness without challenge.</p><p>Purchased as an undisciplined and disheveled recruit in the first episode, Crixus the Gaul initially endures mockery and threats of death, before eventually rising to become a gladiator of skill and fame second only to Gannicus. As Batiatus fends off repeated attempts by his professional rival Tullius and his other archenemy Vettius to obtain Gannicus, his relationships with his father Titus and friend Solonius begin to suffer the strain of Quintus' relentless ambition. Former champion gladiator Oenomaus reluctantly retires from combat to become Doctore, while Syrian recruits Ashur and Dagan become fierce enemies as Ashur tries to prove himself worthy of being a gladiator. Veteran gladiators Barca and Gannicus accept the rising star of Crixus but fear that their own careers will suffer, as the machinations of Batiatus and Lucretia to court Capua's elite end in tragedy for several members of the household. Against all of this, the city's splendid new arena nears completion and with it the opening games that will make men into gods. When the arena opens Solonius' and Batiatus' gladiators compete with each other, Batiatus' gladiators prevailing in the contest. Gannicus again proves himself to be the champion of Capua and the god of the arena and by virtue of his win against Solonius' gladiators, becomes the champion of Capua and gains his freedom.</p><h4>Vengeance (2012)</h4><p>After the bloody escape from the House of Batiatus that concluded Spartacus: Blood and Sand, the gladiator rebellion begins to strike fear into the heart of the Roman Republic in Spartacus: Vengeance. Praetor Claudius Glaber and his Roman troops are sent to Capua to crush Spartacus' growing band of freed slaves before they can inflict further damage. Spartacus is given a choice between satisfying his personal need for vengeance against the man who condemned his wife to slavery and eventual death, or making the larger sacrifices necessary to keep his budding army from breaking.</p><h4>War of the Damned (2013)</h4><p>This final season of Spartacus began airing January 25, 2013 and concluded April 12, 2013. This season follows the final struggle between Spartacus and Marcus Licinius Crassus. Crassus pursues Spartacus as he struggles to feed his ever-growing army of former slaves. Spartacus wins several victories against Crassus' forces and continues to frustrate the Romans. The series culminates in a direct all-out battle between Spartacus and Crassus.</p><br/><h3>Cast and characters</h3><h4>Gladiators and slaves</h4><ul><li>Andy Whitfield (season 1 and prequel) and Liam McIntyre (seasons 2–3) as Spartacus – a Thracian slave who becomes a gladiator in the ludus of Lentulus Batiatus before leading a slave uprising.</li><li>Manu Bennett (seasons 1–3 and prequel) as Crixus – a Gaul, he was Batiatus' top gladiator prior to Spartacus. Love interest of Naevia, and secondary leader of the rebellion.</li><li>Lesley-Ann Brandt (season 1 and prequel) and Cynthia Addai-Robinson (seasons 2–3) as Naevia – Lucretia's personal and loyal slave. Love interest of Crixus.</li><li>Peter Mensah (seasons 1–2 and prequel) as Oenomaus – Batiatus' Numidian doctore (trainer) of gladiators, and reluctant advisor to the rebels. The historical Oenomaus was a Gaul.</li><li>Nick E. Tarabay (seasons 1–2 and prequel) as Ashur – a Syrian former gladiator whose leg was crippled in the arena by Crixus; later served Batiatus as a bookkeeper and henchman.</li><li>Jai Courtney (season 1) as Varro – a Roman citizen who sold himself to the ludus to support his family.</li><li>Antonio Te Maioha (season 1 and prequel) as Barca – nicknamed the \"Beast of Carthage\", is one of Batiatus' most successful gladiators, serves as a bodyguard for his master.</li><li>Erin Cummings (season 1) as Sura – the wife of Spartacus.</li><li>Dan Feuerriegel (seasons 1–3) as Agron – a German gladiator who was sold to Batiatus' ludus, he was the first to join Spartacus in his revolt.</li><li>Katrina Law (seasons 1–2) as Mira – a slave girl sent under threat of death to seduce Spartacus and become his lover. She takes charge of logistical matters as a leader of the rebellion.</li><li>Brooke Williams (season 1 and season 2 premiere) as Aurelia – the wife of Varro.</li><li>Dustin Clare (prequel, seasons 2–3) as Gannicus – champion gladiator of the Batiatus' ludus before the arrival of Spartacus. Later, as a free man, he joins old friends in the revolt.</li><li>Marisa Ramirez (prequel) as Melitta – Lucretia's personal slave and the wife of Oenomaus.</li><li>Pana Hema Taylor (seasons 2–3) as Nasir – a young slave liberated from a villa by Spartacus and his army of rebels.</li><li>Ellen Hollman (seasons 2–3) as Saxa – a German slave rescued by the rebels. She later joins the rebels.</li><li>Heath Jones (seasons 2–3) as Donar – a prominent German rebel and former gladiator from the House of Batiatus.</li><li>Jenna Lind (season 3) as Kore – a loyal slave to Marcus Crassus the Roman tasked to bring an end to Spartacus and his rebellion. Her deep feelings for her master will be sorely tested by spiraling events.</li><li>Gwendoline Taylor (season 3) as Sibyl – a young slave rescued from Roman cruelty. Now free, she will embark on a journey.</li><li>Anna Hutchison (season 3) as Laeta – a privileged wife of a Roman dignitary who becomes entangled in the struggle against Spartacus. Her life and those of the ones she loves are forever changed by the conflict.</li></ul><h4>Romans</h4><ul><li>John Hannah (season 1 and prequel) as Quintus Lentulus Batiatus – a lanista and Spartacus' master.</li><li>Lucy Lawless (seasons 1–2 and prequel) as Lucretia – Batiatus' wife.</li><li>Viva Bianca (seasons 1–2) as Ilithyia – the daughter of senator Albinius and wife of Glaber.</li><li>Craig Parker (seasons 1–2) as Gaius Claudius Glaber – a Roman army legatus who is responsible for Spartacus' enslavement as a gladiator.</li><li>Craig Walsh Wrightson (season 1 and prequel) as Solonius – a rival lanista and former friend to the House of Batiatus.</li><li>Stephen Lovatt (prequel) as Tullius – Batiatus' business rival.</li><li>Jaime Murray (prequel) as Gaia – a social climber and Lucretia's friend.</li><li>Jeffrey Thomas (prequel and season 2) as Titus Lentulus Batiatus – Quintus Batiatus' father and owner of the family's ludus.</li><li>Gareth Williams (prequel) as Vettius – Tullius' young henchman and owner of a rival ludus.</li><li>Tom Hobbs (season 2) as Seppius – a young Capua citizen of note. He wishes to strip the honor of capturing Spartacus from Glaber.</li><li>Hanna Mangan-Lawrence (season 2) as Seppia – younger sister to Seppius.</li><li>Brett Tucker (season 2) as Publius Varinius – Glaber's chief political rival and fellow praetor.</li><li>Simon Merrells (season 3) as Marcus Licinius Crassus – the richest man in the Roman Republic. Envied and despised by the highborn among the senate, he craves the power and respect that defeating Spartacus and his rebel army would bring.</li><li>Christian Antidormi (season 3) as Tiberius Licinius Crassus – the eldest son of Marcus Licinius Crassus, and his father's \"word, and will\" in Crassus' army.</li><li>Todd Lasance (season 3) as Gaius Julius Caesar – a handsome young rogue from an esteemed lineage and his deadly intelligence and skill with a sword will be brought to bear against the rebellion as he begins his ascent towards the all-powerful ruler he will one day become.</li></ul><br/><h3>Production</h3><p>After filming in early 2009 and promoting for some time, it was announced that Starz would premiere Spartacus: Blood and Sand on January 22, 2010. On December 22, 2009, a month before it premiered, it was announced that the show was renewed by Starz for a second season.</p><p>On March 9, 2010, IGN.com reported that production of Season 2 had been delayed due to star Whitfield being diagnosed with early-stage non-Hodgkin lymphoma. Due to the delay, Starz announced in May 2010 that it would be developing a six-episode prequel series, entitled Spartacus: Gods of the Arena, to allow star actor Whitfield to seek medical treatment. The prequel featured both new and returning stars, headlined by John Hannah as Batiatus and Lucy Lawless as Lucretia. Star Andy Whitfield also briefly appeared in a voice-over role. Production began in New Zealand in the summer of 2010 and the prequel aired beginning January 2011.</p><p>In September 2010, Starz announced that Whitfield's cancer had returned and that he had decided not to return for the production of Season 2, then tentatively scheduled for September 2011. Starz announced that the show would nevertheless continue, and planned on recasting the role of Spartacus in the wake of Whitfield's exit. Whitfield gave his blessing for Starz to recast the role when he announced he would not return.</p><p>Spartacus series creator Steven S. DeKnight said in an interview, \"There are a 'couple of very strong candidates' for the role of Spartacus, and season two should begin production in New Zealand in April 2011.\" DeKnight added that the Spartacus producers and Starz executives weren't always sure they would go forward without Andy Whitfield, who they said had brought \"gravity and heart\" to the role of the famous warrior. \"It's unheard of to recast your titular character in a television show, and we did a lot of soul searching about whether we even wanted to try,\" DeKnight said. \"And then Andy said, 'I really think the show should go forward without me. I give you the blessing. I want this story told.'\" On January 17, 2011, it was announced that Australian film and TV actor Liam McIntyre had been selected to replace Whitfield.</p><p>On February 26, 2011 interview with Entertainment Weekly, DeKnight revealed that the second season was set to air \"the end of January\" 2012. Additionally, he revealed that Lesley-Ann Brandt, the actress who portrayed the slave Naevia, would also not be able to return for season 2 due to the delay in production. On August 1, 2011, Starz released a trailer indicating that the long-delayed second season would premiere in January 2012, under the new subtitle, Spartacus: Vengeance.</p><p>Andy Whitfield died on September 11, 2011, from complications of non-Hodgkin lymphoma. He was 39 years old.</p><p>Over two months before the premiere, on November 7, 2011, Starz announced that it was renewing Spartacus for a third season–a second year with Liam McIntyre in the titular role; and fourth year on the air overall.</p><p>The second season eventually premiered on January 27, 2012.</p><p>On June 1, 2012, Starz released a teaser video of the next season on YouTube.</p><p>On June 4, 2012, Starz announced that the 4th season of Spartacus (War of the Damned) will be the final one for the series.</p><p>Starz released the first full trailer for Spartacus: War of the Damned on July 13, 2012.</p><br/><h3>Other media</h3><h4>Board game</h4><p>In 2012 Gale Force Nine announced the creation of licensed board game based on the Spartacus series. The English language release of the game Spartacus: A Game of Blood and Treachery had a limited release at Gen Con 2012 and a general release to game and hobby stores on September 28, 2012.</p><h4>Comics</h4><p>In 2009, Devil's Due published a four-part prequel comic series, titled Spartacus – Blood And Sand. Each issue spotlighted a character from the upcoming television series, mostly the minor gladiator rivals of the main cast.</p><p>The series was adapted as a 4-part motion comic adaptation called Spartacus – Blood and Sand – Motion Comic. Ray Park and Heath Freeman were cast. Kyle Newman was the director, and the producers were Andy Collen and Jeff Krelitz.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>#</th><th>Title</th><th>Spotlights</th><th>Writer</th><th>Artist</th><th>Run Time (Motion Comic)</th></tr><tr><td>1</td><td>Upon the Sands of Vengeance</td><td>Arkadios, the Red Serpent</td><td>Steven S. DeKnight</td><td>Adam Archer</td><td>16 minutes</td></tr><tr><td>2</td><td>Shadows of the Jackal</td><td>The Gargan Twins</td><td>Jimmy Palmiotti</td><td>Dexter Soy</td><td>16 minutes</td></tr><tr><td>3</td><td>The Beast of Carthage</td><td>Barca, the Beast of Carthage</td><td>Todd &amp; Aaron Helbing</td><td>Jon Bosco &amp; Guilherme Balbi</td><td>9 minutes</td></tr><tr><td>4</td><td>The Shadow of Death</td><td>Theokoles, the Shadow of Death</td><td>Miranda Kwok</td><td>Allan Jefferson</td><td>12 minutes</td></tr></tbody></table><h4>Novels</h4><p>In 2012 Titan Books announced the publication of a series of novels based on Spartacus: Blood and Sand. The first one, titled Spartacus: Swords & Ashes, was written by J.M. Clements and released on January 3, 2012.</p><p>The second book in the series, Spartacus: Morituri by Mark Morris, was released in August 2012.</p><h4>Video game</h4><p>In 2012, Ubisoft announced that they would be publishing a video game based on the series. The game, titled Spartacus Legends, has been developed by Kung Fu Factory and was released on June 26, 2013, on Xbox Live and the PlayStation Network.</p><h4>Home media</h4><p>The DVD and Blu-ray Disc sets of each season were released in various regions after their television broadcast. These DVDs were released by Starz subsidiary Anchor Bay Entertainment.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th style=\"padding: 0px 8px\" colspan=\"2\" rowspan=\"2\">Season</th><th style=\"padding: 0px 8px\" colspan=\"3\"><span>DVD</span> and <span class=\"mw-redirect\">Blu-ray</span> releases</th></tr><tr><th style=\"padding: 0px 8px\"><span>North America</span></th><th style=\"padding: 0px 8px\"><span>United Kingdom</span></th><th style=\"padding: 0px 8px\"><span>Australia</span></th></tr><tr><td style=\"background-color: #8a96a9; color: #100; text-align: center; top\"></td><td><b><span>The Complete First Season: <i>Blood and Sand</i></span></b></td><td align=\"center\" style=\"padding: 0px 8px\">September 21, 2010</td><td align=\"center\" style=\"padding: 0px 8px\">May 16, 2011</td><td align=\"center\" style=\"padding: 0px 8px\">December 1, 2010</td></tr><tr><td style=\"background-color: #f7b53a; color: #100; text-align: center; top\"></td><td><i><b><span>Gods of the Arena</span></b></i></td><td align=\"center\" style=\"padding: 0px 8px\">September 13, 2011</td><td align=\"center\" style=\"padding: 0px 8px\">October 3, 2011</td><td align=\"center\" style=\"padding: 0px 8px\">August 31, 2011</td></tr><tr><td style=\"background-color: #9a2c2c; color: #100; text-align: center; top\"></td><td><b><span>The Complete Second Season: <i>Vengeance</i></span></b></td><td align=\"center\" style=\"padding: 0px 8px\">September 11, 2012</td><td align=\"center\" style=\"padding: 0px 8px\">October 1, 2012</td><td align=\"center\" style=\"padding: 0px 8px\">August 29, 2012</td></tr><tr><td style=\"background-color: #000011; color: #100; text-align: center; top\"></td><td><b><span>The Complete Third &amp; Final Season: <i>War of the Damned</i></span></b></td><td align=\"center\" style=\"padding: 0px 8px\">September 3, 2013</td><td>April 29, 2013</td><td>August 28, 2013</td></tr></tbody></table><br/><h3>Reception</h3><p>The premiere episode of the series set a record for Starz, with 553,000 viewers on their network, and another 460,000 on Encore, where the show was available only that weekend. For the rest of the season the show had an average of 1.285 million viewers. Critical reception of the first episode was mixed; the review aggregate website Metacritic which assigns a normalized average score out of 100 gave the show a score of 54% based on 22 reviews. Ken Tucker of Entertainment Weekly gave it the grade B+, saying it \"might prove to be the not-at-all-guilty pleasure of the season.\" Barry Garron of The Hollywood Reporter suggested that with \"such thin stories... it's small wonder that sex and violence are used to take up the slack.\" Robert Lloyd of the Los Angeles Times wrote that John Hannah as Batiatus \"keeps the show grounded with a persuasive portrait of a man engaged in a stressful daily business.\" Mark Perigard of the Boston Herald gave the season finale a positive review, rating it a B+. He commented on the improvement of the series throughout its first season.</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>does not <span>cite</span> any <span>sources</span></b>.<span class=\"hide-when-compact\"> Please help <span class=\"external text\">improve this section</span> by <span>adding citations to reliable sources</span>. Unsourced material may be challenged and <span>removed</span>.</span>  <span class=\"date-container\"><i>(<span class=\"date\">January 2019</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Result</th><th>Award</th><th>Category</th><th>Recipients</th></tr><tr><td rowspan=\"4\">2010</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>EWwy Award</span></td><td>Best Drama Series</td><td><i>Spartacus: Blood and Sand</i></td></tr><tr><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\"><span>Monte-Carlo Television Festival</span></td><td rowspan=\"2\">Outstanding Actor – Drama Series</td><td>Andy Whitfield</td></tr><tr><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td>John Hannah</td></tr><tr><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td>Outstanding Actress – Drama Series</td><td>Lucy Lawless</td></tr><tr><td rowspan=\"4\">2011</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>Primetime Creative Arts Emmy Awards</span></td><td>Outstanding Stunt Coordination</td><td>Allan Poppleton <small>(for Episode: \"The Bitter End\")</small></td></tr><tr><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"4\"><span class=\"mw-redirect\">Saturn Award</span></td><td><span>Best Supporting Actress on Television</span></td><td>Lucy Lawless</td></tr><tr><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>Best Syndicated/Cable Television Series</span></td><td><i>Spartacus: Blood and Sand</i></td></tr><tr><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>Best Presentation on Television</span></td><td><i>Spartacus: Gods of the Arena</i></td></tr><tr><td rowspan=\"3\">2012</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td><span>Best DVD/Blu-ray TV Series</span></td><td><i>Spartacus: Gods of the Arena</i></td></tr><tr><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"><span>Screen Actors Guild Awards</span></td><td>Outstanding Performance by a Stunt Ensemble in a Television Series</td><td>Erika Takacs, Allan Poppleton</td></tr><tr><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td>Outstanding Performance by a Stunt Ensemble in a Television Series</td><td>Jacob Tomuri, Tim Wong</td></tr><tr><td rowspan=\"4\">2013</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\">Saturn Award</td><td><span>Best Supporting Actor on Television</span></td><td>Todd Lasance</td></tr><tr><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td>Best DVD/Blu-ray TV Series</td><td><i>Spartacus: Vengeance – The Complete Second Season</i></td></tr><tr><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td>Best Presentation on Television</td><td><i>Spartacus: War of the Damned</i></td></tr><tr><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td><span>People's Choice Awards</span></td><td>Favorite Premium Cable TV Show</td><td><i>Spartacus: War of the Damned</i></td></tr></tbody></table><br/><h3>Broadcast</h3><p>The series aired in Canada on TMN beginning on January 25, 2010. RTL 5 announced in their January newsletter that Spartacus: Blood and Sand will debut in the Netherlands in March. In the United Kingdom, Bravo began airing the series on May 25, 2010. Following the closure of Bravo on UK television, Sky1 picked up the rights to the series and continued to air all subsequent seasons. In conjunction with the UK airings of Spartacus: War of the Damned on Monday nights at 10pm, a Tweet-a-long was held from the official Spartacus Twitter page, in which fans posted tweets during the episode, using the hashtag #SpartacusWarOfTheDamned. The series premiered in Poland on HBO Poland starting from June 19, 2010 and in Hungary on HBO Magyarország starting from June 1, 2010. The series aired in Ireland on TV3. In Brazil, the show aired on Globosat HD. In Turkey, the show was released on CNBC-E TV, while in Italy, Sky Television was the broadcaster who gained the rights of the series. In India and Pakistan, the show aired on HBO. In Slovenia, the series started airing on Kanal A on 2 January 2012, from Monday to Friday at 9.45 pm. In 2014, Syfy began to air an edited version of the series. Between 2016 and 2020 the series was available on Netflix.</p><br/><h3>Sequel series</h3><p>On February 9, 2023, Starz announced that they were developing a revival and sequel series to Spartacus, with DeKnight returning to write for the series. The show will take place following the death of Spartacus and the slave army's defeat, and will feature characters returning from the original series.</p><br/>"
  },
  "errorMessage": ""
}