{
  "imDbId": "tt0096697",
  "title": "The Simpsons",
  "fullTitle": "The Simpsons (TV Series 1989– )",
  "type": "TVSeries",
  "year": "1989",
  "items": [
    {
      "username": "tfrizzell",
      "userUrl": "https://www.imdb.com/user/ur0688559",
      "reviewLink": "https://www.imdb.com/review/rw0265254",
      "warningSpoilers": false,
      "date": "21 July 2001",
      "rate": "",
      "helpful": "373 out of 449 found this helpful.",
      "title": "This Show Will Be Used to Study How Life Was 100 Years From Now",
      "content": "Brilliant television series that could probably be best described as \"The Flintstones\" gone stark-raving mad. \"The Simpsons\", everyone knows them. Some love the series and some could care less about it. Love it or hate it, it is near impossible to criticize the intelligence and creativity of this series. The titled animated family makes their home in Springfield, USA and gets into situations that are seemingly more outlandish and crazier than the previous adventure. Homer, Marge, Bart, Lisa, and Maggie are still going strong after nearly a dozen years of television life and with each passing moment it seems that the series sets some new precedent. For several years the show seemed to be the only attraction to the then obscure Fox Network. It was the first primetime animated show that was treated like a sitcom since \"The Flintstones\" quietly left the air in 1966. Many people feared the series when it first premiered in 1989 because they felt that it was hardcore adult material in a candied form that would appeal to younger audiences. Well for the most part this was true. However, \"The Simpsons\" would prove to be much more for all audiences. The great thing about the series is that it caters to all audiences. True there are usually situations that may not be suitable for all viewers, but then again that is true with everything on television this side of Disney Land and Sesame Street. \"The Simpsons\" works because of great comedy of course, but also great lessons that can be taken from most of the episodes. The people within the program may be animated, but they are just as complicated and vulnerable as the people watching them. All the regulars have their quirks, but in some episodes you can understand what certain characters are going through because the show is so life-like at times. Former President George Bush (the one from 1988-1992) once made a statement that families should be more like \"The Waltons\" and less like \"The Simpsons\". His opinion is somewhat old-fashioned and unrealistic. In other words, many topics dealt with in \"The Simpsons\" fit life for people in the 1990s and 2000s better than \"The Waltons\" did in the 1970s. A crowning achievement in television art. 5 stars out of 5."
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0265559",
      "warningSpoilers": false,
      "date": "12 November 2003",
      "rate": "",
      "helpful": "267 out of 337 found this helpful.",
      "title": "Probably the best television show on Earth",
      "content": "The Simpsons is the longest running animated TV series since The Flinstones, and you could understand why after watching just one of the Simpsons episodes. Simply because The Simpsons is just so hilarious and incredibly clever and has been ripped off so many times, but nothing has come close to the brilliance that the Simpsons writers have brought us.We have Homer Simpson, one of the most beloved TV characters of all time, with his famous quote \"Doh!\". He's an overweight, lazy, and not the brightest bulb, but so incredibly lovable for the fact of how bipolar he is! One minute he can be so incredibly depressed, but the next minute really happy and giggling. My favorite Homer quote is when he kills the zombie Ned Flanders in a Halloween episode, Bart tells him \"Dad! You killed the zombie Flanders!\"... \"He was a zombie?\" Marge is Homer's wife and a homemaker. She is at times naggy, but always manages to get in some terrific humor and some deep sympathy with all she puts up with. My favorite Marge quote is \"Bart, don't make fun of grad students. They've just made a terrible life choice.\" Bart is the oldest son and a rebel. His usual quotes are \"Don't have a cow\" \"Cool, man!\" \"Ei Carumba!\". He's this generation's Dennis the Menace. My favorite Bart quote is \"I need a soul, Ralph, any, your's!\", you'll see what I mean.Lisa is the second oldest and the smartie pants of the Simpson clan, she's kind of the know it all who solves all the adventures of the Simpsons. My favorite Lisa quote is \"They're only using you for your pool you know... shut up brain! I have friends now, I don't need you any more!\". Last, but not least, Maggie, the eternal baby of Homer and Marge, always a great love of the screen, but no famous quotes, just memorable moments like when she turns into an alien.The supporting cast is a terrific addition, my favorites include Mr. Burns, Homer's boss, Groundskeeper Willy, the school janitor, and Mr. Skinner, the school principal. The Simpson is just a terrific show that in one way or another you will see at least one episode in your lifetime. I know that generations to come, they will still be watching The Simpsons."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0265329",
      "warningSpoilers": true,
      "date": "20 April 2002",
      "rate": "",
      "helpful": "142 out of 183 found this helpful.",
      "title": "May be suffering a bit with time  but overall this is one of the finest show to come out of America",
      "content": "The series that follows the dysfunctional family of the Simpsons. The oafish Homer who can barely go a day without slacking or getting mixed up in crazy adventures. His wife, Marge, who tries to hold it all together. His duaghter Lisa who is smarter that her gene pool should allow, Bart  every inch the classroom rebel. The family is rounded out by the youngest  baby Maggie. The family interact with those around them and learn lessons or sometimes fail to change completely.When this series started in 1987 as a string of rough shorts in Tracey Ulman's show it would be a brave man who would have predicted that over a decade later that this series would be as huge as it is. However the series got launched with the Christmas special in the early 90's. The first series saw the animation greatly improved and the characters developed fully to be more involving. However the story lines were not as sharp or as full as they were to be. The second series and onwards saw the Simpsons have better stories  often multi-layered stories filled with pop-culture references and background jokes that reward the careful viewer to try and list them would take ages.For an American sitcom (for that is what it is) this is amazing  the intelligence of the script is fantastic. The depth of the stories are involving, witty and packed. For a movie buff like me, this is a gold mine  from sly references in the background to full blow scenes almost spoofing movies this has them all. In some programmes that have background jokes the main stuff at the front often suffers or is ignored totally. However here the main plot and dialogue is fresh and well thought out  it is amazing that for almost all of it's run The Simpsons rarely had a bad episode.True  recent shows have begun to show a slide in quality but this is to be expected after more than 10 years at the top. However it is generally brilliant and clever. After the first series everything improved. Not only was the series used for political comment, satire and ironic humour (in a country that generally can't do any well) but it is also heart warming and funny.The characters live in a balance between reality and surreality. They are sort of recognisable as real people in terms of habits and experiences  but in another way they are out there ..Homer has been in Space, stopped a nuclear explosion etc. The mix of this makes for an unique programme. What makes it better is that the makers never draw a line between the madness and the normality  one episode is made up of a bad-neighbour type war between Homer and George Bush Snr! The mix is seamless and adds layers to each show.The wealth of characters is another strength. The main family is strong  even Maggie has regular input and adventures! However where most sitcoms really rely on their main subjects for the stories, The Simpsons has a supporting cast of dozens and dozens of really good characters  all of whom are able to carry an episode. They range from the normal characters (an inept Police Chief, an Asian shop keeper who is used to being robbed at gunpoint) to the referential or well imagined, (the well-educated Sideshow Mel, a bitter Krusty the Clown, an useless lawyer). All the characters have become more fully used as time has gone on.The voice actors are all excellent and all do a huge range of voices of course they get very well paid for it! Unfortunately the late Phil Hartman provided the voices of two of my favourite characters and I really miss his dry humour and strong all-American voice. Lionel Hutz was a great character and my favourite, Troy McClure is a wonderful spoof of 60's B-movie actor Doug McClure. This depth really helps the show and has allowed it to feel so very fresh years on.I could go on for ever, but the series is a wonderful bit of proof that sitcoms don't have to be simple, full of canned laughter and focus on sassy teenagers! The joys of the dialogue are backed up by movie references and crazy adventures. The wonderful Simpson family are supported by a huge cast of imaginative characters who are always well used and a queue of celebrities just lining up to have a few minutes in the show. Quite simply this is consistently the best show to come out of American in my life time."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2188116",
      "warningSpoilers": false,
      "date": "8 January 2010",
      "rate": "9",
      "helpful": "30 out of 35 found this helpful.",
      "title": "A great show, despite declining in quality over the years",
      "content": "When I was 10, I adored the Simpsons, America's favourite dysfunctional family. Me and my brother and sisters watched it every day after school, and got a bagful of laughs. Two years ago though, I stopped watching it. Maybe I didn't find it as funny, creative or as original anymore. Well after seeing the Simpsons Movie, I decided to give the show another chance. And I am glad I did, because it is smart, creative, funny AND original. It is true that the show has been declining in written quality the past three years or so, but the more recent seasons are still watchable, thanks to the animation and the endearing characters.The show's animation is fantastic. In animated shows, I like animation that is colourful and fluid, and the animation in this show is exactly that. The theme tune is irresistibly catchy and the story lines are outstandingly good. Other than the voice acting what made the show so good was its writing. Not obnoxious or childish, but smart and most importantly funny. And the visual jokes are also impressive.And the voice acting is exceptional bringing the dysfunctional family to life. Homer is a type of father figure who repeatedly lets down his family, has a love for doughnuts and beer and pretty much hates his job. Dan Castallenetta, a talented voice actor whom I fondly remember as Megavolt from Darkwing Duck, does a great job not only as Homer but as Grandpa and Krusty, not loud and abrasive at all but just right. Julie Kavner is also great as Marge, a caring matriarch who genuinely cares for her family. Nancy Cartwright is perfect as Bart, who is quite naughty and hates school, same with Yeardley Smith as studious Lisa. Plus Maggie is absolutely adorable.Then there are the supporting characters. My favourite is Grandpa, he is absolutely hilarious. Hank Azaria is amusing as Moe and Chief Wiggum, and Harry Shearer is suitably chirpy as Ned and impresses equally with his monotonic drawls for Principal Skinner and Reverend Lovejoy. There are many memorable guest performances from various celebrities, and frequent appearances from Phil Hartmann and Tress MacNeille. My favourite is Kelsey Grammar as Sideshow Bob, a reprising villain I enjoy watching, sinister yet funny. All in all, despite the fact it isn't as enjoyable as it was, The Simpsons is still a great show. 9.5/10 Bethany Cox"
    },
    {
      "username": "Rammstein-2",
      "userUrl": "https://www.imdb.com/user/ur0438881",
      "reviewLink": "https://www.imdb.com/review/rw0265224",
      "warningSpoilers": true,
      "date": "5 February 2001",
      "rate": "",
      "helpful": "140 out of 183 found this helpful.",
      "title": "A landmark in TV-show history",
      "content": "i have yet to see something as funny, clever and entertaining as \"The Simpsons\" on TV. I'm hardly a TV-series buff, I rarely have the patience and interest to follow a show for more than five or six episodes. \"The Simpsons\" is the one show that I am very sorry to have missed out on until just a couple of years ago. Luckily, Swedish television are rerun experts. It is also the only show that I make sure to follow apart from perhaps \"Friends\", but in entertainment value, \"The Simpsons\" is way ahead.What makes this show so great is its attention to detail, its outrageous dialogue and its completely fearless way of dealing with any issue that crosses the writers' minds. The many characters and their extravaganza makes it an endless well of new angles, new ideas and even more outrageous dialogues. Another very important element is the mocking irony and sarcasm which permeates the entire series. The smarmy and cheesy moments that a great many episodes end up in are extremely clever and becomes an important part of the fun.What impresses me the most about the series is, however, the enormous amount of detail: the attentive spectator is not just in for the obvious gags - there's always something going on or something to read in the background, which makes a VCR mandatory so you can go back and check that special detail out again. Its a fantastic show, and its a great moment when one can sit down and watch another insane, stupid, disastrous and hilarious episode."
    },
    {
      "username": "bat-5",
      "userUrl": "https://www.imdb.com/user/ur0100620",
      "reviewLink": "https://www.imdb.com/review/rw0265281",
      "warningSpoilers": false,
      "date": "17 January 1999",
      "rate": "",
      "helpful": "125 out of 164 found this helpful.",
      "title": "Pure genius",
      "content": "The Simpsons is a show that has sustained ten years of constant humor. The stories have gradually become better and the second fiddle characters were getting more screen time which translates into a much more realized show. The pop culture references abound and delight those who can pick them out. My personal favorite is the Citizen Kane references in the episode called \"Rosebud.\" Plus, anything with C. Montgomery Burns is hysterical. The guest stars aren't there as a \"special appearance\" touted by the networks. They actually work into the storyline, and that makes it all the more enjoyable. Where else can you see The Moody Blues acting like thugs in a Vegas casino?"
    },
    {
      "username": "liquidcelluloid-1",
      "userUrl": "https://www.imdb.com/user/ur3027087",
      "reviewLink": "https://www.imdb.com/review/rw0265569",
      "warningSpoilers": false,
      "date": "25 January 2004",
      "rate": "",
      "helpful": "87 out of 123 found this helpful.",
      "title": "Blind loyalty and network greed has ruined what used to be an animated masterpiece",
      "content": "Network: Fox; Genre: Animated Comedy, Parody, Satire; Content Rating: TV-PG (language, adult contend and animated nudity); Available: DVD and syndication everywhere; Perspective: Classic (star range: 1 - 5);Seasons Reviewed: Season 12+ If someone had told me 10 years ago that I would one day be bored by 'The Simpsons', I would have called them crazy. But here we are and while 'The Simpsons' has become the longest running show on TV at the cost of its core integrity. \"Simpsons\" in its prime was the best things to grace the small screen. A funny, ground-breaking animated comedy with lightening-quick wit, insightful social and brilliantly integrated parody. It created its own universe with an entire town of original characters. Most importantly, it actually helped shape the sense of humor of an entire generation. That generation which has now grown up and is now creating animated shows in direct competition. \"Simpsons\" is a pale shadow of its former greatness. It gradually slipping this way for several years, but it wasn't until the 2002 and 2003 seasons that the show really smashed up against the rocks for good. I used to delight in each new episode of \"Simpsons\". But now the show clunks along each week in what appears to be filling time. The free-wheeling gags it used to deliver with such ease are now weighted down by an unnecessary over importance on story. The show at its best may get off a funny, sharp one-liner every now and then. It's biggest asset currently is it's willingness and given latitude to slam its own network. I do delight in their \"Joe Millionaire\" on-air promo parodies or a recent episode where Homer calls to give the network an idea and the recording says something like \"If you know of another network's reality show we can rip off, press 2...\" So what happened? There really is no one thing that can easily be pointed out to all the late-commers and say \"this is what happened\" - you have to have traced the history. The 'jump the shark' moment could have come as early as the infamous Frank Grimes episode where our vision of The Simpson family was suddenly turned into something to aspire to instead of parody. It could be the legion of big name celebrities forced into every episode. To bring down a show as great as this, it was a slow convergence of several things. Watching it, 3 differences are evident on-screen at any given time: First, the stripping down most of the characters to 1-note cartoons. Notably, British favorite Homer Simpson going from child-like, hard-luck father to a rag-doll for wild animals to rip apart as each episode closes. I'm particularly appalled at its attempts to use Homer as a political mouthpiece. Did you know that a guy who once lit a Q-tip so he could see inside his brain has an active concern for global politics? Yeah, I didn't either. Secondly, the classic Baby Boomer voice of the series has evaporated and was replaced with contemporary generation X and Y jokes. Now, it's the internet and Tony Hawke. The voice of the series used to be one of creator Matt Groening's, seen through the eyes of Homer and Marge. That voice has been lost as the show has turned into an assembly line institution, repackaged and been homogenized for the masses and a new generation of writers lead by Ian Maxton-Graham has come in to \"keep it fresh\". Thirdly, it has run out of creative juice. Anyone who has stuck with the show long enough can see it literally re-telling jokes and recycle previous story lines. When the recycling becomes too obvious or the episode makes no sense, they merely double back and declare it all a big self-parody. Not even Al Jean (architect of the show in its prime and the Larry David of \"The Simpsons\") can save it now. Since the talented voice cast has remained the same low these many years, I put all the blame on this squarely with the Fox network who refused to let this show go out gracefully when Groening siphoned off his role to work on his dream project, the now far superior 'Futurama'. In Fox's race to claim this endurance record they have turned a once edgy and visionary show into an institution with an assembly line production and revolving door of writers to match any of the other lame shows on TV. Behind the scenes, maybe the condescending we-can-do-no-wrong attitude of Maxton-Graham has dealt the show its biggest death blow, while producer Mike Scully sat back and ineptly let Maxton-Graham run it into the ground. In the end, the biggest blame may actually land with the \"die-hard fans\" that embolden the show by letting it get away with this junk. Yes, \"The Simpsons\" was ground-breaking and every adult animation in the future owns it a bit of gratitude, but blind loyalty to a show only for how it performed in the past isn't healthy. Since it has hit long-running status the critical bandwagon jumping has begun and \"Simpsons\" is more popular than ever amongst critics that want to be on the inside of history. We've now reached a point where the bad episodes and bad entire seasons outweigh the good and that, I'm afraid, is going to be the sad legacy of \"Simpsons\" . A train-wreck of crass, childish humor, grainy animation, oddly misplaced satire and forced parodies of only the most obvious pop culture targets. 10 years ago I didn't know what I would do without \"The Simpsons\" but now, particularly with the emergence of satisfying new adult animated shows ('Futurama', 'Family Guy' and 'South Park'), living without it might be pretty good. * * / 5"
    },
    {
      "username": "redryan64",
      "userUrl": "https://www.imdb.com/user/ur0850869",
      "reviewLink": "https://www.imdb.com/review/rw1792405",
      "warningSpoilers": false,
      "date": "2 January 2008",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "From those little \"In Betweeners\" on the TRACY ULLMAN Show to perhaps the longest running Series in TV History!",
      "content": "Animated Film or \"Cartoons' have long been part of the motion world. Their magical movement and \"life\" has been the instrument of so much laughter, tears and all round amazement, tons of it. From HUMOROUS PHASES OF FUNNY FACES (Vitagraph Co., 1906) right down through the heyday of ROGER RABBIT(1988) and beyond, the animated film has been there providing us with an alternate film Universe; another dream world for other dreams.For the longest time, the animated \"Cartoon\" has been branded by some as being strictly (non-greasy) \"Kids' Stuff.\" That rap's being hung on them doubtless dates from the early days of commercial Telecasts in the late 1940's and early 1950's, when so many local Stations broadcast Noontime, late Afternoon and Saturday Morning programming aimed at Children. Beyond their assortment of various \"Aunts\", \"Uncles\", Cowboys, Clowns and Puppets of varying ilk; they had to fill out their on air time. But with what would they do, what could be used to fill up the shows? As a diversion from the live action, the Stations made use of what ever short films that could be purchased, rented or leased for a price within their budgets. The films available fell into 2 basic types. The first group featured the likes of Snub Pollard, Harry Langdon, Our Gang, Mickey (Himself) McGuire, The 3 Tons of Fun Harry Langdon, the Keystone Kops and Charlie Chase. These were live action silent comedies.The second group was made up of old silent and early sound animated short subjects. Their sources were many and varied. There were silent with sound track added; containing music, sound effects and occasional words. Paul Terry's Farmer Al Falfa was much in evidence; as were productions of the then defunct Van Beueren Studios. Those cartoons were those featuring \"Cubby Bear\" and \"a human Mutt and Jeff team of \"Tom And Jerry\", not the MGM Cat & Mouse team. And of course, there were many others; a lot of them released to Television by 'Official Films' (as opposed to any Un-Official Films that may be lying about.) Eventually of course, in God's good time, original TV Cartoons were produced. Those such as Alexander Anderson & Jay Ward's CRUSADER RABBIT. Hanna-Barbera's RUFF & REDDY, HUCKLEBERRY HOUND, YOGI BEAR, etc. and Terrytoons' TOM TERRIFIC, DEPUTY DAWG and others did make it out to our living rooms via the Networks. These were mainly done for the kids. (Although, once again, any Jay Ward Production has an appeal to all ages.) And that brings us down the Video Evolutionary Track to THE SIMPSONS. Now, even though animated, even the most vehemently anti-cartoon old grouch would have to concede the point to us that this is not just child's fare.In short, THE SIMPSONS is the story of a totally dysfunctional American Family; being representative of the typical family. The 5 Simpsons are the Homer (father), Marge (Mother), Bart (Son & Star), Lisa (Sister) and Maggie (Infant Sister). Together with their various and sundry pets, neighbors, friends and co-workers have an incredibly high number of adventures, which can be and are limitless in scope and locale. From week to week it isn't uncommon to see either Homer or Marge taking to a new profession or running for public office. Their home town of Springfield has an everyman's geological set up; being bordered by mountains, forests, desserts, rivers, canyons and whatever else the particular story requires. In short, it is boundless and all encompassing. It is a town that is as vast or as deep as imagination, itself.There are some who criticize the characterization of Homer as an uncouth, swill slugging vulgarian. Their line of reasoning being that a poor example of American Family and an even poorer example of a fictional Father figure than was Carroll O'Connor's 'Archie Bunker.' To those critics, we can only say that they should take time and carefully watch and even more meticulously listen to the damn thing! Even though it may appear on the surface that the admittedly dysfunctional (to say the least) family would be a poor example to put on exhibit, albeit a comic version of one.If one stops to take inventory of the individual episodes, their themes and presentations, they'd certainly see things far differently. For believe it or not, the Simpsons present us with a fine example of an American Family, as viewed through the multi lensed spectrum Of a comedy series that, even though it's a \"Cartoon\", has a lot to say. For underneath it all, with all the gags, funny business and wacky plots; we find some very decent, \"old fashioned\" and important virtues that we would do well in remembering.As just one example, an important one is the down to earth relationship between Mr. and Mrs. Simpson, Marge and Homer. No matter how wacky the plot or how far aground the story takes the Family Simpson, in the end we see how much they really do love each other and are always there when their mate needs the other.Honest folks, just try it for yourselves, soon!"
    },
    {
      "username": "davidaempatton",
      "userUrl": "https://www.imdb.com/user/ur64517393",
      "reviewLink": "https://www.imdb.com/review/rw6660083",
      "warningSpoilers": true,
      "date": "4 March 2021",
      "rate": "7",
      "helpful": "20 out of 23 found this helpful.",
      "title": "Gone from good to bad",
      "content": "I've watched it since season 1 and it was fantastic the best episodes are from 1989-2002.The earlier seasons had great Humor, Dialogue, Memorable Lines, Funny charactersTHESE NEW EPISODES SUCK ASS. Take the show off the air."
    },
    {
      "username": "mercer74",
      "userUrl": "https://www.imdb.com/user/ur0301011",
      "reviewLink": "https://www.imdb.com/review/rw0265364",
      "warningSpoilers": false,
      "date": "5 June 1999",
      "rate": "",
      "helpful": "441 out of 551 found this helpful.",
      "title": "The greatest television show of all time",
      "content": "What more can I possibly say about a TV show that has already been praised to death? I was 15 when the Simpsons first aired and I'm 25 now. I've seen every single episode, and I'd have to say it's a rare combination of factors that come together to make The Simpsons the best show ever.It's a very clever and intelligent show - they never dumb anything down - and as creator Matt Groening has remarked, \"The Simpsons is a show that rewards paying attention.\" There are always enough obscure pop-culture references or subtle background gags to ensure that the second, third, or tenth viewing of an episode will find you noticing something you hadn't before.In the early days of The Simpsons, they derived a large part of their popularity from the everyday, down-to-earth, unglamorous, average-blue-collar-slob aspect of the Simpson family. Homer is lazy and doesn't like his job, Bart doesn't excel at school, the plastic ketchup bottle they use at the dinner table makes that farting sound, and so on. This aspect of the program contrasts it with popular 80's family sitcoms such as The Cosby Show which always featured impossibly well-functioning families who got along a little too perfectly and usually learned a neat little lesson at the end of each episode. An early tag-line for The Simpsons said that they \"put the Fun back in Dysfunctional.\"Perhaps this blue-collar-slobness by itself is nothing shockingly original - think of previous TV shows such as Roseanne, Married with Children, All in the Family, The Honeymooners - but the Simpsons doesn't stop there. This show is extremely densely packed with jokes - everything from cerebral witticisms and sly satire to Homer falling down and going \"D'oh!\" Because it's a cartoon, the writers can get away with surreal gags such as the time Homer tells a joke which falls flat, after which a long silence happens which is punctuated by a single tumbleweed rolling through the Simpson's living room.There are just too many things to mention about The Simpsons. It can be touching occasionally; more often the viewers are treated to an unequalled cavalcade of obscure references, surreal sight gags, wacky adventures, self-mocking irony... The list goes on and on. Just watch it, else you're missing out on one of the most important elements of 1990's popular culture."
    },
    {
      "username": "fjk1138-731-161881",
      "userUrl": "https://www.imdb.com/user/ur44841569",
      "reviewLink": "https://www.imdb.com/review/rw6350966",
      "warningSpoilers": false,
      "date": "9 December 2020",
      "rate": "5",
      "helpful": "27 out of 35 found this helpful.",
      "title": "How the mighty have fallen",
      "content": "The Simpsons was my de facto go-to comedy from 1992 until the movie came out. Based on other reviews here, it appears that I hung in a lot longer than most. But I gave up eventually.From 1992 until 2007 I used to record, save, and constantly re-watch the Simpsons on VHS. Once the DVDs started coming out, I would buy every single box set and watch those to death as well. I used to drive my friends nuts with quoting lines or referring to episodes. I looked forward to every episode, what new disaster Homer could get into, and what goofy plot they would come up next. I loved every diverse and wacky character and how they all interacted with each other, good or bad. The writing was top notch, the parody of real-life things was great, and voice acting was flat-out superb. From the time I started watching until the early 2000's, it was heavenly. From 2002 - 2006, it started showing some signs of weakening, but still managed to make me laugh.Then the movie came out in 2007.It had a few moments (Marge's choice words about the bomb got my one \"out loud\" laugh), but it felt lackluster and pandered to a generic audience instead of staying really true to the diehards that were with the show since the beginning. The movie also marked the start of the show eventually going to CG versus traditional animation.And here is where things start changing. Eventually, the writing went from meh (and later super-meh) to flat out lazy and about as funny as a terminal disease. Since CG animation no-doubt faster to produce than hand-drawn, the Simpsons went from feeling hand-made to mass-produced. This effect eventually seemed to spill over into all aspects of the show. Despite this, I was willing stick it out so long as it made me laugh, but it stopped doing that and I just couldn't bear to watch any longer. For me, it was really like a dear friend or relative was dying before my very eyes, albeit slowly and painfully.But what really buried it for me was when that loser and complete no-talent \"comedian\" Hari Kondabolu cried and whined that Apu was somehow an insult to the entire Indian race (a farcical cartoon character, really?) which eventually stopped Hank Azaria from voicing it. Congrats Hari, you ruined one of my favorite characters on the show. What is it that you are known for again? Oh right, we're still waiting for all the brilliant comedy that you have yet to produce. It appears that Hank will no longer be voicing Carl either, who is now replaced by a \"correctly-raced\" actor. Because, you know, the earth was going to explode or something if that wasn't done. I supposed it's just a matter of time until Dr. Nick Riviera will be saying \"Bye Everybody!\" as well.But it's OK, I've reached the level of acceptance and abandoned the show several years ago. I honestly don't know anyone who still watches this show either, but for those that still do I would ask that you please stop. Let the viewership die so that the show can die right along with it. It really needs to be put out its misery at this point. Every once in a while, I catch a glimpse of recent episodes when switching channels and most of the voice actors sound tired. I'm sure this is easy money for them by now, but really, I would think they are all talented enough to do other voice work in many other places. Or not - maybe they all need to retire. Poor Julie Kavner's voice sounds like it's practically gone now.There was a time when I used to hope the state that Springfield is in would be revealed in the final episode, but now? I couldn't care less. What once was a show that screwed with the established order eventually got swallowed up by it and drowned in a sea of political correctness. I sold off my Simpsons box sets years ago and moved on to other things. The classic version of the show still exists for me now, but only in my memories. It's a world where Apu does not want anyone offering Ganesha a peanut, but he does ask us to \"Come again!\"."
    },
    {
      "username": "Atreyu_II",
      "userUrl": "https://www.imdb.com/user/ur15836141",
      "reviewLink": "https://www.imdb.com/review/rw1712027",
      "warningSpoilers": false,
      "date": "14 August 2007",
      "rate": "",
      "helpful": "39 out of 59 found this helpful.",
      "title": "No longer that great",
      "content": "When the animated TV series \"The Simpsons\" first came out, nobody could image how successful it would become. But they made this a clever TV series: that original family with their silly humor conquered many people. From 1989 until (maybe) almost the end of the 1990's, this was a great TV show. It was very humorous, highly creative and had all the needed ingredients to be a classic.All of the characters are very peculiar and eccentric: Bart, Lisa, Marge and Homer. On the other hand, Maggie is innocent because she's a baby. Marge has that weird hair and Homer is more than just the silliest of all Simpsons: he's the silliest \"family chief\" ever!However, in these last years \"The Simpsons\" has been notoriously going downhill. It isn't that great anymore. It doesn't have that classic status any longer and its humor has become more irritating. It isn't so funny anymore.Now is definitely time to put an end to this TV show. They should have done that years ago. The more time they'll take to finally do it, the more they'll ruin it."
    },
    {
      "username": "bigverybadtom",
      "userUrl": "https://www.imdb.com/user/ur23062922",
      "reviewLink": "https://www.imdb.com/review/rw2874251",
      "warningSpoilers": false,
      "date": "23 September 2013",
      "rate": "4",
      "helpful": "14 out of 19 found this helpful.",
      "title": "The Rolling Stones Of TV Sitcoms",
      "content": "Originally \"The Simpsons\" were animated segments on \"The Tracy Ullman Show\" before they got their own series, which became a mega-hit. And what has made them so popular? Perhaps good timing; animated sitcoms meant for adults were a novelty at the time. Yes, the show does have some wit, and the stories are fast-paced. But even it its salad days, it wasn't as funny as all that. Basically, it's a standard sitcom idea that's been done many times before-stupid father, smart mother who puts up with everything, smart kids who really know what's going on (or so they believe), with liberal propaganda thrown in.The series still goes on, even though many viewers complain that the show went downhill by the end of the 1990's. What makes it continue? It has a cult following and still gets viewers, and FOX seems to want to milk it for all it's worth, and more. And that's why I compare \"The Simpsons\" to the Rolling Stones, a band that continues by living off its past image."
    },
    {
      "username": "skinnygaillard",
      "userUrl": "https://www.imdb.com/user/ur145200069",
      "reviewLink": "https://www.imdb.com/review/rw7583600",
      "warningSpoilers": false,
      "date": "25 November 2021",
      "rate": "5",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Time to pull the trigger...",
      "content": "The show had an excellent start, and was great for many seasons. Simply put, it was iconic, quotable, and universally loved, as the show combined humour and meaning well.Some watchers argue that the show went downhill, rapidly after about the 10th, though I'd say that there were plenty of funny episodes right up to the late teens. While there were a few good moments in the 20s, this is when The Simpsons lost its charm. It went from a timeless, quirky show to something that we need a lot less of: a jumble of pandering and meaningless drivel. It tries too hard to be hip and it's a real shame to see voice actors go after so-called 'controversy' and a few, ignorant demands.The show just isn't what it used to be. It is no longer satisfying or funny, and it's time it was cancelled."
    },
    {
      "username": "Arlando909",
      "userUrl": "https://www.imdb.com/user/ur5220836",
      "reviewLink": "https://www.imdb.com/review/rw1382636",
      "warningSpoilers": false,
      "date": "1 June 2006",
      "rate": "9",
      "helpful": "370 out of 438 found this helpful.",
      "title": "It started off fantastic...",
      "content": "No one, not even Matt Groening himself, could've imagined that The Simpsons would become as big as it did. Nor could anyone anticipate it could become so cultural. \"D'oh\" is in the dictionary, and it has spawned off several catch-phrases and one liners. Truly, The Simpsons is the biggest thing since Seinfeld! The first three seasons showed them as if they were an actual family. Like the kind of family you'd meet on the street (only a lot more dysfunctional). Homer trying to do the fatherly thing in each episode. Marge being the voice of reason all the time. Lisa and Bart with their sibling rivalry. These first three seasons are not usually sighted as being the best, but they are often brought up when one speaks of \"The Best Episode Ever!\" By Season four, the show took a turn for what may have been the best. It left it's more realistic roots and became more of a satire. With more zany antics and more clever, witty, and often times sophisticated humor, The Simpsons became the most popular family on television. Each episode still contained it's own merits, themes and messages. Seasons 4 to about 10 are often said to be the \"Golden Age\" of The Simpsons.However, as the year 2000 came, fans began to see themselves divided. Those who stuck with the show since it came about in 1989 were quick to jump on how the show changed. The humor became more lurid and toilet like, with antics becoming heavily more unrealistic and zany (to the point where some even say it isn't funny... but stupid). Some characters becoming unrealistically stupid, and the show shifting gears from focusing on Bart to Homer... to everyone outside of the Simpson family. The show also began to see more cumbersome and meaningless plots. Plots that didn't focus on current issues, or that didn't seem to be as strong as older episodes. Despite this, new fans seem to have come about to replace then, and the show continues to remain at the top of its game, even today.I'm sure you all know where I stand on that debate. Nine stars to nine fantastic seasons."
    },
    {
      "username": "jeffsels",
      "userUrl": "https://www.imdb.com/user/ur122665079",
      "reviewLink": "https://www.imdb.com/review/rw7667018",
      "warningSpoilers": false,
      "date": "21 December 2021",
      "rate": "6",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Used to be brilliant",
      "content": "Yet again, Disney ruin something which was once brilliant. I used to watch The Simpsons and always had laughs at the gags and character exploits: not anymore. Why do they have so many musical numbers and Woke storylines? Dull and uninspiring writing now. Not for me. I don't watch it anymore."
    },
    {
      "username": "DongDiggity",
      "userUrl": "https://www.imdb.com/user/ur77752279",
      "reviewLink": "https://www.imdb.com/review/rw7396521",
      "warningSpoilers": false,
      "date": "1 October 2021",
      "rate": "6",
      "helpful": "15 out of 20 found this helpful.",
      "title": "Serious Decline After Season 12",
      "content": "The Simpsons was an amazing show until after season 6 and then was still good until around season 12. It became decent after that and really went into \"meh\" territory after season 20-ish.The biggest problem with the Simpsons is that it has lost it's magic and has become all about woke and appeasing the vocal minority. Examples of this are removing Apu from the show, removing an actor from voicing a character(s) because they aren't the proper skin color, and have removed episodes/content (this isn't new but removing Stark Raving Dad is new)."
    },
    {
      "username": "bagelbiterboio",
      "userUrl": "https://www.imdb.com/user/ur140459626",
      "reviewLink": "https://www.imdb.com/review/rw7458035",
      "warningSpoilers": false,
      "date": "19 October 2021",
      "rate": "6",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Sorry",
      "content": "I'm sorry but I'm pretty sure it's common knowledge by now the show has been on a decline for years now, but at this point I believe there is more bad episodes than good with a lot of meh sprinkled in. I have watched every episode of this show and will continue to watch so that title stands and I would be lying if I say I didn't enjoy myself for a portion of it. Though I'd also be lying if I wasn't very critical of this show and I didn't hate a good amount of it's episodes. All and all I feel generous giving this a positive score still (6) but this 6 is carried by how good the good is."
    },
    {
      "username": "amarkovic-65487",
      "userUrl": "https://www.imdb.com/user/ur94845473",
      "reviewLink": "https://www.imdb.com/review/rw5637107",
      "warningSpoilers": false,
      "date": "13 April 2020",
      "rate": "8",
      "helpful": "102 out of 116 found this helpful.",
      "title": "I'm glad I'm not the only one...",
      "content": "I was hesitant to give this the rating I did, but from reading other audience reviews, my review actually will come across as far more... lenient. What can I say that hasn't been said already, the golden age of The Simpsons (seasons 3-8) is flawless television. Going through it again, it was awe inspiring to me how they manage to structure joke upon joke upon joke upon joke, something that must've been a complete breath of fresh air considering the boring, lifeless, milk-toast excuses for comedy shows that were coming around at that time. Yeah, those ones using canned laughter which relied completely on actors and people being loud as an excuse to be funny with a roaring laughter every 5 seconds spoon feeding the audience of when to laugh, with an exception of Seinfeld these were just boring shows for boring people, The Simpsons was intelligent, heart felt, structured and most of all... FUNNY.However, all good things must come to an end. In an ideal scenario, The Simpsons ended on season 10 and season 9 didn't include the infamous 'The Principal and The Pauper', it lives its legacy as one of the greatest TV shows of all time and is passed down from generation to generation. Sure, the season 9 and 10 weren't golden age material, they were still solid entries in The Simpsons canon but then from season 11, things started to drastically change, we were getting episodes which would've been some of the weaker episodes in a golden age era season that were the best episodes of the season they were actually in. Sure, season 13 was pretty good but the show was tanking in quality almost directly after, pretty much season 14 onwards was terrible (not to mention the really bland movie). Now we're on the 31st season, the show is just completely unwatchable, the best episodes are mediocre and boring and the worst episodes are... 'Lisa Goes Gaga' (if you know what I mean). The show, at this point, is almost completely unrecognisable, a mere slight resemblance of what it once was (even the animation sucks nowadays), that's why it's so damn difficult to rate this show, at the same time it's one of my favourite and least favourite shows, the show should've ended 20 years ago, you can't keep lightning in a bottle for that long, it's not a show that is relevant to today's cultural landscape, it would be so much more respected if it had ended on its 10th season. That's why I can't in good conscience rate this show the 9 or 10/10 that I want to... but the only reason I'm giving it a 7 over a 5 is because even though there is more bad than good of The Simpsons (more signals for it to just end), the golden age is some of the best television to have ever been constructed and cannot be ignored.Here's how I'd rate the seasons: Season 1 - 8/10 Season 2 - 8/10 Season 3 - 9/10 Season 4 - 9/10 Season 5 - 10/10 Season 6 - 10/10 (best season) Season 7 - 9/10 Season 8 - 8/10 Season 9 - 8/10 Season 10 - 7/10 Season 11 - 6/10 Season 12 - 6/10 Season 13 - 7/10 Season 14 - 5/10 Season 15 - 4/10 Season 16 - 5/10 Season 17 - 4/10 Season 18 - 4/10 Season 19 - 4/10 Season 20 - 6/10 Season 21 onward - 2/10"
    },
    {
      "username": "hereispierre",
      "userUrl": "https://www.imdb.com/user/ur47675054",
      "reviewLink": "https://www.imdb.com/review/rw4272635",
      "warningSpoilers": false,
      "date": "7 August 2018",
      "rate": "5",
      "helpful": "44 out of 59 found this helpful.",
      "title": "Once Great, Now Bad",
      "content": "It's very hard for me to try to put a rating on this show. At one time it was the best comedy series on TV and possibly even the best one ever. Unfortunately it went into a decline after the first ten years or so, and then a steep decline, to the point where it is less than a shadow of what it once was. They really should have quit several years ago, but at this point they might as well just keep going and see how many episodes they can rack up before the plug is finally pulled."
    },
    {
      "username": "alyssaabernaughty",
      "userUrl": "https://www.imdb.com/user/ur47707505",
      "reviewLink": "https://www.imdb.com/review/rw3752839",
      "warningSpoilers": false,
      "date": "13 July 2017",
      "rate": "5",
      "helpful": "54 out of 72 found this helpful.",
      "title": "Difficult to Rate",
      "content": "I surprisingly had a very difficult time rating this show, but I did and a 5 out of 10 is in my opinion a fair rating when you consider the series as a whole.The reason it is so hard for me to rate this show is the simple fact that it has been on so very, very long. 621 episodes and growing, according to the numbers here on IMDb. And when a season lasts that long, it obviously will have stretches of good quality and stretches of bad quality. The Simpsons is no different.Although the series does still make me chuckle here and there, the quality has completely fallen off in the show's later years. It suffered a sudden and terrible decline and I still feel very disappointed watching it, remember and \"missing\" the fantastic episodes of old.Because that's the other extreme. When The Simpsons first went on the air, and for at least 8 seasons (to me, at least), it was one of the very best comedy shows ever produced. The characters were great, the writing was slick, it seemed like every single joke hit its mark and I laughed out loud all the time. It was one of the few \"can't miss\" shows I remember in my life, where Sundays at 8pm I just had to be home to watch it. Everyone talked about it, and regardless of how many seasons you think it lasted everyone considers those early years the \"golden age\" of the Simpsons.I'm not sure if the problem is people leaving, or naturally running out of ideas after being on the air so long, or simple laziness, or the writers and staff getting old, but clearly at a point this show just went from the creative tops to something almost awful.I'm basically averaging it out (6 years of awesomeness, 6 years of being OK, and since then being just bloody awful) to give this show a 5 out of 10. I know I'll be bashed by haters who find my rating too high, and Simpson-heads who can't believe anyone would go lower than 10, but this is the grade I think is fair for this show."
    },
    {
      "username": "DarthBill",
      "userUrl": "https://www.imdb.com/user/ur2293681",
      "reviewLink": "https://www.imdb.com/review/rw0265611",
      "warningSpoilers": false,
      "date": "11 August 2004",
      "rate": "7",
      "helpful": "36 out of 61 found this helpful.",
      "title": "Am I the only one who thinks that this show sucks lately?",
      "content": "This was once one of the funniest shows on TV. Now it's just crap. It ceased to be side-splittingly funny during the 1996-1997 season, which opened with a James Bond parody episode that never quite got going, featured the divorce of Milhouse's parents, a painfully unfunny guest voice for Kelsey Grammer's TV brother David Hyde Pierce, and perhaps the only mildly funny bit: the romantic fling between Principal Skinner and Bart's teacher (can't spell her name). Now a days, the show is just one outlandishly ridiculous sight gag stacked on top of another, with no real substance or plot behind it and whatever social satire there may be getting lost in the process. Homer is really blown way out of a proportion as the latter day idiot man trying to exploit the system whenever he can or just act like a lazy bastard. Marge, Bart, and Lisa are just annoying. Some of the supporting characters have their moments but not many.The earlier seasons when the characters were more like real humans were the highpoint of the show."
    },
    {
      "username": "Jetset971",
      "userUrl": "https://www.imdb.com/user/ur16958476",
      "reviewLink": "https://www.imdb.com/review/rw2256023",
      "warningSpoilers": false,
      "date": "27 May 2010",
      "rate": "4",
      "helpful": "57 out of 93 found this helpful.",
      "title": "Way, Way, Way past its prime",
      "content": "I love the Simpsons. Correction, I Loved the first 9 seasons of the Simpsons. Back then it had to be the most wittiest, cleverest, enjoyable TV show on the planet. It is for that reason that I find myself in such despair now. Let's face it folks the hey-day of the Simpsons was well over a decade ago. Talk about a show that just doesn't know when to stop. It aggravates me to no end to witness the desperate lengths this show goes to year after year. Every show has a shelf life people and the Simpson is way past its expiration date. I truly think that the only reason it is still on the year is force of habit. Both the public and the Fox network are so used to having on that they shutter at ending it. Trust me, It should end."
    },
    {
      "username": "pnwryan",
      "userUrl": "https://www.imdb.com/user/ur137041269",
      "reviewLink": "https://www.imdb.com/review/rw8308254",
      "warningSpoilers": false,
      "date": "7 July 2022",
      "rate": "4",
      "helpful": "13 out of 14 found this helpful.",
      "title": "Why?",
      "content": "Why can't you just end the show? You ruin it year after year and it's worse since Disney took over. Please just end it already, you already made your landmakr. What more do you want?"
    },
    {
      "username": "generationofswine",
      "userUrl": "https://www.imdb.com/user/ur14520497",
      "reviewLink": "https://www.imdb.com/review/rw4686349",
      "warningSpoilers": false,
      "date": "25 February 2019",
      "rate": "5",
      "helpful": "16 out of 25 found this helpful.",
      "title": "An Honest Review",
      "content": "To address the failing quality:The Simpsons once mocked and then it became mainstream pop culture. So that is a cause of why it has declined.And another cause is that there is a new PC comedy trend to laugh at things. As in the audience is expected to laugh at the object itself without having an actual joke behind it. As in, \"This is a computer, Laugh at it!\"Because of that we see a transformation of the jokes. The celebrity guests were once the butt of the joke. Mulder and Scully came on and the Simpsons mocked them. Now the joke is the celebrity guest. As in, \"This is Lady Gaga,\" or \"this is Michelle Obama.\"They aren't spoofed or satirized in any way, the audience is just asked to laugh at the fact that they have a celebrity guest.And the final reason is the laugh track comedy, in which the Simpsons has none. That is no laugh track. But now the writing sets up the jokes with almost a pause for laughter as if the tracks were there.In the past the jokes were piled onto one another. There would be several jokes stacked right next to one another in a single event. Now it has become joke, pause to acknowledge the joke, continue.But no ones really laughing because it's no longer mocking culture, it's no longer spoofing the celebrity guests, and it's lost virtually all of its edge."
    }
  ],
  "errorMessage": ""
}