{
  "imDbId": "tt0758745",
  "title": "Friday Night Lights",
  "fullTitle": "Friday Night Lights (TV Series 2006–2011)",
  "type": "TVSeries",
  "year": "2006",
  "items": [
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8858782",
      "warningSpoilers": false,
      "date": "7 February 2023",
      "rate": "10",
      "helpful": "42 out of 42 found this helpful.",
      "title": "Clear Eyes...Full Hearts...Can't Lose!",
      "content": "I know people say this all the time about shows but Friday Night Lights really is one of the most underrated shows in the history of television. It's such a great show and should be talked about even more than it is. It's on just about every \"bests shows of all-time\" list that you'll find and for good reason. It shows the everyday lives about popular high school athletes and others members of the community in a small Texas town where football is everything. It takes a realistic, gritty look inside their lives. The writing and acting is what makes this show so special. The cast (Kyle Chandler, Taylor Kitsch, Connie Britton, Aimee Teegarden, Minka Kelly, Michael B JordanZach Gilford, Jesse Plemons, Adrianne Palicki, etc) is just about perfect for this show too. This really is a must watch show!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8753457",
      "warningSpoilers": false,
      "date": "24 December 2022",
      "rate": "10",
      "helpful": "44 out of 45 found this helpful.",
      "title": "One of the most underrated shows of all-time!",
      "content": "Friday Night Lights is one of all-time favorite shows. It's is so criminally underrated it's ridiculous! It is just an absolute amazing show! The show is based off the book and the film but is so much better than even those two. It takes place in the small Texas town of Dillon, Texas and takes place at one of the best football high schools...the Dillon Panthers. Coach Taylor (Kyle Chandler) leads the team through pressure filled seasons full of expectations and helps his players both on and off the field. He also has to deal with the everyday struggles of his own family. Even though the football story line is great, it is so much more than that. If you read the reviews you'll see 90% of them are 9's & 10's and most have one thing in common and that's that they didn't give it a chance until years after it went off the air. Once you start watching you can't stop!"
    },
    {
      "username": "brett-76260",
      "userUrl": "https://www.imdb.com/user/ur71629917",
      "reviewLink": "https://www.imdb.com/review/rw7846587",
      "warningSpoilers": false,
      "date": "8 February 2022",
      "rate": "10",
      "helpful": "23 out of 23 found this helpful.",
      "title": "Simply the best",
      "content": "Probably one of the best all around shows Ive ever watched. I grew up in Dallas so this really brings back some great memories of high school football. This show captures everything Texas and is such a good show. Don't worry It's not just about high school football and it touches on so many subjects I won't try and list them out. One thing is for sure though, I guarantee you will experience every emotion a human being can go through during the course of this series. If high school football is not your thing it won't matter. The writing, the directing, the music and above all the acting, will take you places no other show will take you. Yeah it's that good. Just Give it 3 episodes before you make any decisions. It takes that long to get to know the characters and get familiar with the show. When it's all over and you finish the last episode, you will sit back and say to yourself, \"crap that just might be the best series I've ever watched\"... You will have Clear Eyes and Full Hearts... watch the show and you will never forget that phrase... Peter Berg well done on this one and last but not least.... Texas Forever..."
    },
    {
      "username": "royalewithcheese2020",
      "userUrl": "https://www.imdb.com/user/ur24243090",
      "reviewLink": "https://www.imdb.com/review/rw2968562",
      "warningSpoilers": false,
      "date": "25 February 2014",
      "rate": "10",
      "helpful": "77 out of 81 found this helpful.",
      "title": "Clear eyes, Full Hearts, Cant Lose!",
      "content": "I can't find a strong enough word in my vocabulary to describe how spectacular and engrossing this show is. I remember when I first heard about it eight or so years ago when the show premiered. To be honest, after seeing the movie, I thought it would be cheesy and not all that good. After Breaking Bad ended, I needed a new show to watch and while searching for the best shows available on Netflix streaming, this was near the top of the list. And I can truly say even after watching something as incredible as Breaking Bad, I think this show is almost more special in its own way. It doesn't need violence and drugs to be entertaining. I remember right after watching the pilot, I couldn't stop and stayed up till 7 am watching. It will pull you in that quickly, especially if you are a football fan. Not that you cant watch it if you don't like football or don't know much about it. I absolutely love football. Love watching it and played it in high school. But football is absolutely the least interesting aspect of this show. The first episode of the series goes through each day leading up to the first game of the season. After watching it I thought every episode would be that way. But after seeing the end of the pilot I realized the show is about much much more than just football. Football is just a backdrop.The most important part of the show are the lives of the characters off the field, focusing on the head coach and his wife and their daughter, as well as the players. He is more of a father figure to these players before he is a coach. The main theme of the show is that people have dreams. It shows everyday problems that people face, which we can all relate to in one way or another. Then it shows these dreams can come true if you have someone who believes in you and is willing to help you until you reach these dreams. The show creates these characters in a pretty cliché fashion. But what makes the show so great is these characters are brought to life, making the viewer able to literally feel the emotions of these characters, even without words being spoken. For the most part, the acting is incredible by most of the cast. The way the show is shot makes you feel like you are in the room with these people. This show will move your emotions and make you laugh,cry, smile and cheer. There's not many other shows out there that can hit you with so many ranges of emotions. You really feel like you are a part of these peoples lives, and you really become connected to them. You are able to watch them change with your own eyes. You will think differently about life and football after watching it, I can guarantee that."
    },
    {
      "username": "allmoviesfan",
      "userUrl": "https://www.imdb.com/user/ur62318327",
      "reviewLink": "https://www.imdb.com/review/rw8646867",
      "warningSpoilers": false,
      "date": "31 October 2022",
      "rate": "10",
      "helpful": "30 out of 31 found this helpful.",
      "title": "Texas Forever",
      "content": "A football show that isn't about football as much as it is about relationships that surround the game in a small Texas town where there is high school football and, honestly, not much else.Kyle Chandler is absolutely brilliant as Coach Eric Taylor, who does a lot more in Dillon, Texas than merely coach the football team. His relationship with his wife (brilliantly portrayed by Connie Britton) surely has to have them right near the top of the list as far as best husband-wife combos in TV history goes.Everything about this show clicks. Even the characters you think at the start are going to be cliched turn out rather pleasantly to be anything but. Some of the issues the show touches on - racism, small town politics, the American high school education system, the concept of your life's peak being in high school on a football field, and the spectre of a loved one affected by dementia amongst others - really elevate it. And the series finale? As perfect as perfect gets. Eleven stars out of ten."
    },
    {
      "username": "missyjax",
      "userUrl": "https://www.imdb.com/user/ur19404094",
      "reviewLink": "https://www.imdb.com/review/rw8847889",
      "warningSpoilers": true,
      "date": "2 February 2023",
      "rate": "9",
      "helpful": "26 out of 26 found this helpful.",
      "title": "Watch it twice.",
      "content": "The 1st go around, I loved the show, but I missed some of the more nuanced characters. Yes, Coach Taylor is a rock star, but secondary ones like Tyra and Riggins are so multilayered. I even include Smash in this. Yes, he's a cocky, at times annoying, running back, but he's a good person determined to provide for his family. My gripes are all personal pref type stuff, and one appears to be very unpopular. But even though I like Connie Britton, I can't stand Tami Taylor. There, I said it! She's just so high maintenance and talkative. It really bugged me when she decided to stay in Dillon because of her job and then whined to Eric about how hard it was with him not there. I also hated the camera stuff. In so many scenes, I was staring up someone's nostrils, and there's some big nostrils on this show. Not my fave angle. My final whine is the complete lack of supervision some of these kids had. But none of this is enough for me to mark it down. It's a great show."
    },
    {
      "username": "aaaaaron-frannnnnnnn",
      "userUrl": "https://www.imdb.com/user/ur117043494",
      "reviewLink": "https://www.imdb.com/review/rw8018312",
      "warningSpoilers": true,
      "date": "30 March 2022",
      "rate": "9",
      "helpful": "17 out of 17 found this helpful.",
      "title": "Great Show!",
      "content": "It's sad how many times this show's budget was cut, because this is a great show. And besides season 2, each season gets better and better.Con first, and reason why this is a 9, rather than a 10.not sure if it's the director's daughter or something but Julie Taylor is the absolute worst. She literally makes every bad decision a teen can make, and simply gets a talk here and there. Not sure what the point of her character is.Pros - too many pros to list. All the main characters are great actors. Kyle Chandler perfectly portrays a guy who just wants to coach football becomes a father figure to so many people. They really know how to end people's arcs: Tyra, Jason Street, Smash, all have amazing farewells. Billy and Mindy Riggins who start out as random and less accountable siblings turn into great characters in the end. Buddy Garrity probably has one of the best character growth who starts out as a sleaze and after losing his family turns into a guy who genuinely wants to help his town.Michael friggin B Jordan. If you are lucky enough to watch this show, you saw his potential immediately. Glad he has a great career now. Vince and his family's whole story is so good. His mom doing her best to recover from drugs, and his dad coming out of jail - Vince just does his best. And while he loses himself to his fame for a moment he comes back and is great.The show is a perfect length. Has a simple premise. Each season, is a new year and goal to win football games. Seasons 1,2,3 are good, but for sure could have been stale if it stayed the same for a 4th season. Friday Night Lights is regarded as one of the best at \"renewing\" itself at Season 4, with the town split. New Characters, new arcs, but same show and same core main characters."
    },
    {
      "username": "brooklynstyle-54752",
      "userUrl": "https://www.imdb.com/user/ur160176322",
      "reviewLink": "https://www.imdb.com/review/rw8857905",
      "warningSpoilers": false,
      "date": "7 February 2023",
      "rate": "10",
      "helpful": "26 out of 26 found this helpful.",
      "title": "Great show",
      "content": "I watched this show back when it first aired and it was criminal it struggled nearly every season to survive. It aired when only comedies and procedurals seemed to survive and character driven dramas like this quickly canceled. I was so glad it got picked up by Dish after NBC cancelled it. The only flaw was the writers strike shortening S2. When S3 started there was a time jump where things happened off camera. In some ways it was good because there were some weird plots going on that disappeared when S3 started. However, S2 was the last with the entire original cast was on so we got less episodes of them. Lyla and Riggins were also already together, so we didn't get to see how that happened. I held out hope until the end that they would reunite, but that's the thing about the show, it was so realistic. Unfortunately, a girl like Lyla isn't going to end up with with a guy like Riggins. Rewatching, I realized that Julie and Saracen were really the major love story of the younger cast. I had a greater appreciation of their story arc in reruns, but was not a big fan of Julie. Loved Saracen and a lot of times she really wasn't worthy of him.The first 3 seasons were the best, but it remained soIid throughout. The cast was fantastic and of course Tami and coach were the heart of the show."
    },
    {
      "username": "Caln19",
      "userUrl": "https://www.imdb.com/user/ur136745133",
      "reviewLink": "https://www.imdb.com/review/rw8164017",
      "warningSpoilers": false,
      "date": "21 May 2022",
      "rate": "10",
      "helpful": "21 out of 22 found this helpful.",
      "title": "One of the best dramas",
      "content": "Really excellent show that gets in your heart. 1st episode didn't get me immediately but I am so glad I stuck around. Many years after it aired, feels as good as ever. Texas forever!"
    },
    {
      "username": "CoopertheBeagle",
      "userUrl": "https://www.imdb.com/user/ur152388340",
      "reviewLink": "https://www.imdb.com/review/rw8491220",
      "warningSpoilers": false,
      "date": "27 August 2022",
      "rate": "9",
      "helpful": "24 out of 25 found this helpful.",
      "title": "One of the great American TV shows",
      "content": "Must watch if you like a feel good drama with good character development. Like these creators' other shows , including Parenthood and This is Us, it's very heartfelt. If you're like me and you don't especially care about sports, that won't hamper your enjoyment of this show. If you're at all skeptical, give the first episode a try and you'll surely be sucked into the human drama by the end of episode 1. The character development is so subtle and nuanced, many characters go from what seem like tropes to fully fleshed out beloved characters. Many of the young people on the show give performances that don't seem to have been matched by anything they've appeared in since. Britton and Chandler of course shine as the central couple of the show, whose love shines through all the ups and downs. They have a witty repartee that forms a major part of the show's appeal. Jesse Plemons moves from a side character to a central part of the show. You can see why he's emerged as such a big star since."
    },
    {
      "username": "buckwinthrop-16041",
      "userUrl": "https://www.imdb.com/user/ur150559763",
      "reviewLink": "https://www.imdb.com/review/rw8718746",
      "warningSpoilers": false,
      "date": "5 December 2022",
      "rate": "10",
      "helpful": "30 out of 32 found this helpful.",
      "title": "Absolutely Phenomenal",
      "content": "I'm currently binging Friday Night Lights a second time. I fondly recall how outstanding it was during its initial run. Now, over a decade later I find that its actually better. Quite simply, Friday Night Lights is one of the greatest TV shows of all time. Its like watching real people in their real lives. You care about them. They're like friends. The writing, direction and acting pull at every emotion. Peter Berg the creator is a genius. Coming back to revisit this incredible show is like coming home. To relive you're best childhood experiences. A big shout to Kyle Chandler and Connie Britton."
    },
    {
      "username": "coop-16",
      "userUrl": "https://www.imdb.com/user/ur0270026",
      "reviewLink": "https://www.imdb.com/review/rw2273998",
      "warningSpoilers": false,
      "date": "4 July 2010",
      "rate": "",
      "helpful": "54 out of 64 found this helpful.",
      "title": "one of the finest shows, ever",
      "content": "I only recently became hooked on this show, having obsessed for perhaps too long about a certain metaphysical fantasy set on a desert island and about a certain stylish melodrama about one man's Mafia family. This show has no gangland hits, no sixties nostalgia about Madison Avenue, no housewives( or chemistry teachers) dealing drugs, no musical numbers,no recondite references to Egyptian hieroglyphics or quantum physics. Yet despite all these terrible flaws,( clever sarcasm) it is a masterpiece. I am not anti-Lost. I enjoyed the show immensely, for all its flaws. However, this show is , in some ways, superior. It is, in fact a photo-realistic picture of life in a small town in Texas, beautifully written and wonderfully acted. I rank it with certain other shows that were overlooked and are now sadly forgotten by all but a few people with good taste: The Call To Glory, Homefront, and I'll Fly Away,among others. In some ways, this is a show worthy of the golden age of TV \"sooial drama\", Naked City, The Defenders, Mr. Novak, Ben Casey, The Fugitive( a social commentary disguised as a thriller), Route 66, Slattery's People and East Side West Side. Like the best episodes of those shows, Friday Night Lights offers more questions than answers. This show is one of the best ever. I pray to a sometimes enigmatic providence that it does not perish from the airwaves."
    },
    {
      "username": "sheepshearer",
      "userUrl": "https://www.imdb.com/user/ur90845220",
      "reviewLink": "https://www.imdb.com/review/rw4367239",
      "warningSpoilers": false,
      "date": "29 September 2018",
      "rate": "8",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Loved it.",
      "content": "I am from Australia and I could not get enough of this show."
    },
    {
      "username": "beauryker-623-466161",
      "userUrl": "https://www.imdb.com/user/ur22626685",
      "reviewLink": "https://www.imdb.com/review/rw2492991",
      "warningSpoilers": false,
      "date": "24 September 2011",
      "rate": "10",
      "helpful": "37 out of 40 found this helpful.",
      "title": "TV dramas don't come any better!",
      "content": "Simply put, this is reality. If someone had affixed a camera to my head, 24 hours a day, when I was in high school, you couldn't have gotten a better picture of life. I know someone like every single character in this show. The story lines, the acting, the cast, couldn't be any better in this show. For those who haven't made it to high school yet, in Texas, this is your future. Wonderful, wonderful drama. I didn't even hear about this show (don't have time for much TV) until season 4. Watched one episode and I was hooked. Went out and bought every episode and sat down and watched every one in about two days. Didn't want to turn it off. I had always thought that The Shield was the best show ever on TV....until I was introduced to this tremendous story about life."
    },
    {
      "username": "denise_actress",
      "userUrl": "https://www.imdb.com/user/ur2884797",
      "reviewLink": "https://www.imdb.com/review/rw8342329",
      "warningSpoilers": false,
      "date": "17 July 2022",
      "rate": "10",
      "helpful": "24 out of 27 found this helpful.",
      "title": "I can't believe I never watch it until now",
      "content": "It's 2022 and I overheard someone mention this show and how good it is. They are not wrong. All the characters are so rich in complexity. But out of all the characters the scenes between Matt Saracen and his grandmother leave me choking back tears. Highly recommend this series. It's beautiful."
    },
    {
      "username": "stevelivesey67",
      "userUrl": "https://www.imdb.com/user/ur17235488",
      "reviewLink": "https://www.imdb.com/review/rw7750226",
      "warningSpoilers": false,
      "date": "12 January 2022",
      "rate": "9",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Compelling bitter/sweet teen drama",
      "content": "Go Panthers! Sorry, I mean, Go Lions!A great watch despite some of its faults. Love the documentary style of filming and the establishment of the various characters through the years.Some sketchy bits but still worth bingeing."
    },
    {
      "username": "cscott2331",
      "userUrl": "https://www.imdb.com/user/ur48308797",
      "reviewLink": "https://www.imdb.com/review/rw6437143",
      "warningSpoilers": false,
      "date": "2 January 2021",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Great show. So real!",
      "content": "I'm finishing up. Was down with a knee surgery and needed something that wasn't too dark and depressing. This is a damn good show. I hate Lila though. She's is awful. Unlikeable in every single way. Tyra has shown she can act through it all. Mean, sad, scared, funny and tough. She nailed them all. Lila is just a whiny baby, and every situation is acted out the same. That disgusting fake sweet voice and talking through her teeth. Jason Street should've stayed while Lila went. He was for sure one of my favorites. Tim is one of the main reasons to keep watching. He's nice to look at and can actually act! Buddy is fat and greasy and sweaty but plays his role well! Coach and Mrs T are likable and real. Cant imagine anyone playing those roles better. Matt, well we all know a Matt. Reliable, sweet, artsy and without much confidence. Landry (pre psycho Todd from breaking bad, had no clue he was in it)was amazing! Smash redeemed himself and I was happy he was around and I LOVE his momma. Man, she was so believable in her role. Maybe a bit too much drinking and screwing for 15 year olds they could've at least held off until they were a bit older. but a damn good show! Just like in high school EVERYTHING is a cross to die on. And just like in a small town football takes precedent over EVERYTHING! Grades, kids, money you name it. Football is their only reason to wake up each day and only means of survival for many. In my town our football coach gets triple what any teacher does. It's really sad actually. So this show is very real, beautifully shot, produced like none other and just about perfect. Except for that winey ass minka Kelly. I know now why she never made it past this and others did. She was cast for her look and looks alone and they just didn't take her far enough. Not against these heavy hitters! All in all a really good drama, really good show. One that will get you in the feels on almost every episode. Glad I finally decided to watch it. And glad they didn't drag it out 10 years! So many shows drag out and end up sucking as a result...not this one."
    },
    {
      "username": "towe-51620",
      "userUrl": "https://www.imdb.com/user/ur63355756",
      "reviewLink": "https://www.imdb.com/review/rw7923522",
      "warningSpoilers": false,
      "date": "6 March 2022",
      "rate": "9",
      "helpful": "15 out of 18 found this helpful.",
      "title": "If you've ever lived in Texas!",
      "content": "I'm a CA boy that has lived in Abilene, Texas & Houston Texas & I loved it. The people are the friendliest in the world. It's affordable. The weather takes getting used to but at least the people there still honor God & America! Football is a 2nd religion to them and they take it seriously. If you don't like the show, even though it is the most closest to reality I've ever seen, don't watch it. If you don't like Texas don't visit or live there! They respect your rights now please respect theirs! FNL is one of my top 5 shows ever! The theme song hits me somewhere in my soul that longs for a simple, normal life with normal people! God bless America & God bless Texas!"
    },
    {
      "username": "shelbythuylinh",
      "userUrl": "https://www.imdb.com/user/ur142375144",
      "reviewLink": "https://www.imdb.com/review/rw7603609",
      "warningSpoilers": true,
      "date": "1 December 2021",
      "rate": "8",
      "helpful": "10 out of 12 found this helpful.",
      "title": "Football and Life",
      "content": "It is about football and life. And it is about how one day matters in Friday night. Hence the title.As that the show in the dealing like in the HS and in home there. With the stars like Kyle Chandler, Connie Britton and having rising stars like Matt Laura, Taylor Kitsch, Michael B Jordan. Just to name a few.Not a lot of shows can have fans and that over in great reviews there. This show adds to that and thanks Tom Arnold that Tom Arnold Miss ex-Roseanne Barr that helped saved the show there."
    },
    {
      "username": "eaglefangs",
      "userUrl": "https://www.imdb.com/user/ur131672365",
      "reviewLink": "https://www.imdb.com/review/rw7740111",
      "warningSpoilers": false,
      "date": "9 January 2022",
      "rate": "9",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Love This Show",
      "content": "Really do enjoy watching this show after my mom got me into it. I have to say Tami, Smash, Vince, Tyra, and Landry are my favorites. There is some annoying teenage drama, but for the most part great storylines and characters.Don't let the race batters keep you from watching this show. They do address some racial issues, but it's not made political the way it is now. I recommend it."
    },
    {
      "username": "flicker-16",
      "userUrl": "https://www.imdb.com/user/ur0317286",
      "reviewLink": "https://www.imdb.com/review/rw7611888",
      "warningSpoilers": false,
      "date": "3 December 2021",
      "rate": "9",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Small town life in Texas IS high school football",
      "content": "I attended high school in a small town in Texas. It really hits home.Of course, it's television but the show captures the ambiance of what life is like in a small town, in the middle of West Texas and high school football is THE only entertainment. The show draws its inspiration from H. G. Bissinger's book by the same title and the Odessa Permian High School's Panthers (and rival Odessa High School). The closest major city is Fort Worth, Texas - a good 5 hour drive so high school football is literally the only game in town.Kyle Chandler delivers a perfect performance of high school football coach. He's totally in control at the football field but at home with a wife and daughter Julie, not so much. Connie Britton is brilliant as Tami Taylor.Yes, the actors look and act a tad older than teenagers but so does every other television show and movie about high school.One of the touches is that the characters leave the show without explanation or closure - just like real life high school. Students move away in the summer or graduate and no one hears from them again. Also, realistic is the socio-economic diversity of the student body in a small town.Some of the story gets a little out of hand when Jason, Lila and Tim go to Mexico on their own for a week and none of the story includes what the parents and school are doing about it. Lila becomes a born again Christian without any hint or setup. Julie drives all the way to Chicago instead of returning to school and her parents never bothered to check on her and never told them.It really came close to \"jumping the shark\" early in Season Two but the writers and producers made an admirable recovery. For all its flaws, it is still television at its finest and the show has held up even after ending 10 years ago."
    },
    {
      "username": "ElessarAndurilS",
      "userUrl": "https://www.imdb.com/user/ur44717123",
      "reviewLink": "https://www.imdb.com/review/rw3647753",
      "warningSpoilers": true,
      "date": "25 February 2017",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Best show I never heard of. Solid End!",
      "content": "Friday Night Lights sat on my Netflix watch list for over a year before I gave it a chance. What a shock! I'm expecting a show about a football coach and a lot of game clips, instead I am quickly introduced to one of the best family drama's of excellent quality I've ever watched! Rare to see a positive drama in any context in recent years, yet this show portrays a loving couple and their family standing up for what is right in the face of a HIGHLY DYSFUNCTIONAL town with many dysfunctional people. But the story grows, and transitions in such an excellent way (excluding the abrupt end to season 2 I wasn't expecting - cut short by writers strike in 2008) the writing and story are excellent. Was casting 25 year old people as high school students a bit much, yes, but not uncommon... and when doing so to portray exceptional high school athletes; I totally get it, some of these high school football players DO LOOK 25 and they needed actors to look and play the part. Makes me give that a bye, along with the exceptionally pretty girls as that is also common practice.The important part was to me was how much of the story was character based, portrayed real life situations that as a parent I've had to deal with regardless of what I do because life happens to us all. As a father of 3 daughters some of it made me LMBO as Eric Taylor has to (try) and hold his temper in check and deal with his daughter growing up. I've said some of the things he said, and been in the same situations with some of my children so it really resonated with me as real. The transition from the Panthers to the Lions was a bit of a stretch as well with the first two seasons not really indicating there was a \"wrong side of the tracks\" in Dillon, but the shows introduction sequence does show a town with a lot of shuttered businesses, so it is not a stretch that there would be a lot of struggling families. True in so many small towns in this country.The best part was the shows ability to evolve and stay positive and life affirming in the effect this couple had on it and the way they ended it was very satisfying. One of the best quality family drama's I've seen."
    },
    {
      "username": "heyheyitslorimae",
      "userUrl": "https://www.imdb.com/user/ur132893234",
      "reviewLink": "https://www.imdb.com/review/rw7867252",
      "warningSpoilers": false,
      "date": "15 February 2022",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Best in Class",
      "content": "My husband and I watch this show constantly. The cast is perfectly selected, acting is top notch, storylines are down-to-earth reality. They don't overdo the characters or situations in these scenarios, making this a tangible reality for several viewers."
    },
    {
      "username": "rogersreagane",
      "userUrl": "https://www.imdb.com/user/ur149288699",
      "reviewLink": "https://www.imdb.com/review/rw7819518",
      "warningSpoilers": true,
      "date": "31 January 2022",
      "rate": "10",
      "helpful": "15 out of 15 found this helpful.",
      "title": "Reagan Rogers- Review",
      "content": "My whole life I have been around football. My dad being a coach has led me to experience many different things firsthand that many people do not get to have in their lives. Going to many football games, getting VIP access into certain parts of the stadium, and traveling to watch games for free even are just a few of the many experiences that I have had over the past almost eighteen years. Football has always been a major part of my life for a long time now and it has led me to watch many different films, including the show Friday Night Lights. It's about this football team out of Dillon, Texas, and the lives of each kid, coach, and student that either plays or goes to Dillon Highschool. It shows how this team because Dillon is such a small town, is what this town is centered around. The Panther football team is what Dillon lives, breathes, and sleeps each and every day. It's very clear that football is a major lifestyle in this town, kind of like how football is a big deal in my life.Friday Night Lights focuses on each kid's home life individually. The kid who was the starting quarterback who got hurt in the first game of the season, the backup quarterback who is now the town's star player, the guy who comes from nothing and lives by himself, the boy who wants to be the best, the head coach's daughter(who I relate too), the head cheerleader who wants to show she's put together but isn't, the girl who just lives with her mom, and the head coach who just wants to prove to the town, his team, and himself that he can do the unthinkable. This show and its warm-hearted, impactful meaning show that a small-town team can do big things helps, will leave viewers wanting more and eager to rewatch."
    },
    {
      "username": "lumbo8",
      "userUrl": "https://www.imdb.com/user/ur26262241",
      "reviewLink": "https://www.imdb.com/review/rw8292644",
      "warningSpoilers": false,
      "date": "2 July 2022",
      "rate": "8",
      "helpful": "14 out of 17 found this helpful.",
      "title": "A Series About Football...",
      "content": "That barely showed any Football!I did enjoy it, but couldn't understand why such little Football was shown!Most of the character development played well, but the ones that didn't left gaping holes.Definitely worth watching!"
    }
  ],
  "errorMessage": ""
}