{
  "imDbId": "tt0758745",
  "title": "Friday Night Lights",
  "fullTitle": "Friday Night Lights (TV Series 2006–2011)",
  "type": "TVSeries",
  "year": "2006",
  "episodes": [
    {
      "id": "tt1216618",
      "seasonNumber": "3",
      "episodeNumber": "1",
      "title": "I Knew You When",
      "image": "https://m.media-amazon.com/images/M/MV5BMTYwNTE2NTQzMV5BMl5BanBnXkFtZTgwMjA0Nzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "29 Dec. 2010",
      "plot": "The press grills Coach Taylor about the upcoming season while the teachers grill his wife, the new principal, about the budget and the necessary cutbacks, while Buddy and the football team have the best of everything. A new quarterback enters the picture and Matt feels threatened and Riggins is still up to his old game plan about not feeling anything. Tyra's new guidance counselor lays some rather bleak news on her, causing her to walk out of school, only to find some personal resolve within herself to attempt to rectify her situation.",
      "imDbRating": "8.1",
      "imDbRatingCount": "452"
    },
    {
      "id": "tt1216623",
      "seasonNumber": "3",
      "episodeNumber": "2",
      "title": "Tami Knows Best",
      "image": "https://m.media-amazon.com/images/M/MV5BMTUwNzEwMzIyMl5BMl5BanBnXkFtZTcwNTQ1NDUyMg@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "8 Oct. 2008",
      "plot": "When Coach Taylor realizes that it's not Smash's knee that's holding him back, he comes up with a rather unique way of laying it all on the line. The doctor lays it all on the line for Matt, who, legally, can't take care of grandmother, anymore, while Buddy goes out of his way, laying it on the line for Tami over the jumbo tron issue, and laying it on the line with Tim, who's now dating his daughter. Meanwhile, Tyra realizes that it's easier to lay it all on the line by taking shortcuts in winning the student body presidency.",
      "imDbRating": "7.9",
      "imDbRatingCount": "433"
    },
    {
      "id": "tt1216624",
      "seasonNumber": "3",
      "episodeNumber": "3",
      "title": "How the Other Half Lives",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc3MTAzMjk0OV5BMl5BanBnXkFtZTgwODgzNzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "15 Oct. 2008",
      "plot": "Coach Taylor feels pressured when the boosters corner him at the annual barbecue. Tim gets pressured from his brother about helping him score some extra cash to pay for his impending wedding, while getting pressured at the same time, from Lyla, to try and turn his life around...and her father isn't any help, either. Julie and Matt continue to bond, while Smash's future gets offered an option.",
      "imDbRating": "8.2",
      "imDbRatingCount": "422"
    },
    {
      "id": "tt1216625",
      "seasonNumber": "3",
      "episodeNumber": "4",
      "title": "Hello, Goodbye",
      "image": "https://m.media-amazon.com/images/M/MV5BMTY0OTE1NDYxMl5BMl5BanBnXkFtZTgwNzI0Nzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "22 Oct. 2008",
      "plot": "Coach Taylor asks himself whether he should shake things up when it comes to his quarterback controversy, while his wife asks whether she is able to shake things up because Buddy is schmoozing up to the school district's superintendent, Matt gets shaken when his mother shows up in town and Tyra shakes things up with Landry when an old friend of Billy's shows up in town and begins paying her attention and, finally, Smash feels a bit shaken up as his tryout date comes closer.",
      "imDbRating": "8.8",
      "imDbRatingCount": "512"
    },
    {
      "id": "tt1216626",
      "seasonNumber": "3",
      "episodeNumber": "5",
      "title": "Every Rose Has Its Thorn",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA3ODA1MDIxMF5BMl5BanBnXkFtZTgwNTE0Nzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "29 Oct. 2008",
      "plot": "Jason and Tim come up with an idea that will, hopefully, get them out of their financial woes, but Buddy stands in the way. Tyra's budding romance continues to bloom, while Julie shows 'signs' of rebellion. Coach Taylor's new idea to his quarterback situation only ends up in disarray and pressure from his coaching staff.",
      "imDbRating": "7.8",
      "imDbRatingCount": "413"
    },
    {
      "id": "tt1216627",
      "seasonNumber": "3",
      "episodeNumber": "6",
      "title": "It Ain't Easy Being J.D. McCoy",
      "image": "https://m.media-amazon.com/images/M/MV5BMTI0MDY1ODIxMl5BMl5BanBnXkFtZTcwNDMwNDMzMg@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "5 Nov. 2008",
      "plot": "After witnessing a hazing incident involving his new starting quarterback, Coach Taylor sets a task before his team captain, Tim Riggins, the job of making J. D. McCoy feel more comfortable with the team. Matt's comfort level with his new position on the bench is felt by everyone close to him, including Julie as they continue to grow closer together. Tyra sings a different tune after her new boyfriend's family shows up on her doorstep.",
      "imDbRating": "8.1",
      "imDbRatingCount": "429"
    },
    {
      "id": "tt1216628",
      "seasonNumber": "3",
      "episodeNumber": "7",
      "title": "Keeping Up Appearances",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc2NDMxOTk3M15BMl5BanBnXkFtZTgwNzA0Nzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "12 Nov. 2008",
      "plot": "Coach Taylor has difficulties in the relationship between his new starting quarterback and the kid's father, while his starting fullback presents difficulties for Tami. Buddy's two younger children are nothing but difficult on a planned visit and Jason stands pat on his price for Buddy's house that he and his pals are trying to flip.",
      "imDbRating": "8.1",
      "imDbRatingCount": "424"
    },
    {
      "id": "tt1216629",
      "seasonNumber": "3",
      "episodeNumber": "8",
      "title": "New York, New York",
      "image": "https://m.media-amazon.com/images/M/MV5BMTEzODY0NDkzNzBeQTJeQWpwZ15BbWU4MDUyNDc4NDIx._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "19 Nov. 2008",
      "plot": "Tami considers new living surroundings, while Eric considers a temporary replacement for Mac, who collapses on the field during practice. Tyra considers her options between following her dream and following her boyfriend, while Jason considers investing his share of the profits from flipping Buddy Garrity's house in his future by taking a trip to the East Coast.",
      "imDbRating": "8.6",
      "imDbRatingCount": "460"
    },
    {
      "id": "tt1216630",
      "seasonNumber": "3",
      "episodeNumber": "9",
      "title": "Game of the Week",
      "image": "https://m.media-amazon.com/images/M/MV5BMjE3Nzk1Njg2MF5BMl5BanBnXkFtZTgwMDYzNzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "3 Dec. 2008",
      "plot": "Lila is put off when Tim puts off a college recruiter; Tim is put off when his brother's impending marriage is over and takes it out on Tim's truck; Tyra is put off by Cash's actions when they go out on the road together, and Coach Taylor is all but put off by being selected as the game of the week for television during an important playoff game.",
      "imDbRating": "8.2",
      "imDbRatingCount": "416"
    },
    {
      "id": "tt1216619",
      "seasonNumber": "3",
      "episodeNumber": "10",
      "title": "The Giving Tree",
      "image": "https://m.media-amazon.com/images/M/MV5BMTEwMTY0OTc0MzleQTJeQWpwZ15BbWU4MDk4Mzc4NDIx._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "10 Dec. 2008",
      "plot": "Buddy loses his cool over a deal gone sour and wrecks the local strip joint, which causes Lyla to lose her cool and walk out on him after he gets out of jail, while Julie's parents try to not lose their cool over catching her in bed with Matt, Landry loses his cool over Tyra's using him, and Coach Taylor loses his cool when the refs turn a blind eye to his playoff game.",
      "imDbRating": "8.3",
      "imDbRatingCount": "416"
    },
    {
      "id": "tt1216620",
      "seasonNumber": "3",
      "episodeNumber": "11",
      "title": "A Hard Rain's Gonna Fall",
      "image": "https://m.media-amazon.com/images/M/MV5BMzEwNjEzOTc3Nl5BMl5BanBnXkFtZTgwNjQzNzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "17 Dec. 2008",
      "plot": "Buddy tries to use Tim to get to Lyla, who's still mad about losing her college fund to a business deal and it gets worse when she finds she's been accepted by the college she's always dreamed of. Buddy also enlists the power of the Dillon Panthers boosters in order to re-draft the line proposed by the school district when a new East Dillon High School is proposed. Landry and Tyra bond over Tyra's sister's wedding, while J.D. and his father don't exactly see eye to eye over the girl in J.D.'s life",
      "imDbRating": "8.3",
      "imDbRatingCount": "425"
    },
    {
      "id": "tt1216621",
      "seasonNumber": "3",
      "episodeNumber": "12",
      "title": "Underdogs",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQxNzUwNTg1Ml5BMl5BanBnXkFtZTgwMDMzNzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "7 Jan. 2009",
      "plot": "The Taylors are faced with a decision that could end what is already a fragile friendship with the McCoys. Lyla informs her father of her alternate decision after her chances of attending her dream college have fallen through, Landry tries to help Tyra with her college essay, and Matt has dreams of attaining some kind of post-high school education.",
      "imDbRating": "9.2",
      "imDbRatingCount": "532"
    },
    {
      "id": "tt1216622",
      "seasonNumber": "3",
      "episodeNumber": "13",
      "title": "Tomorrow Blues",
      "image": "https://m.media-amazon.com/images/M/MV5BNTM5OTQzOTkwM15BMl5BanBnXkFtZTgwNDA0Nzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "14 Jan. 2009",
      "plot": "Skipping ahead five months in time, Dillon High School finds its graduating class with: Lyla, who's father has come up with a plan for her to still possibly attend Vanderbilt; Matt, who plans to attend a school in Chicago away from Julie; Tim, whose brother tries to get a mechanic's garage going while planning to attend college himself; and Tyra, who's application is still up in the air in wanting to attend TU. Meanwhile, the issue over splitting Dillon High School seems small, compared to the fact that outside influences such as money and a control for power continue...",
      "imDbRating": "8.9",
      "imDbRatingCount": "491"
    }
  ],
  "errorMessage": ""
}