{
  "imDbId": "tt0758745",
  "title": "Friday Night Lights",
  "fullTitle": "Friday Night Lights (TV Series 2006–2011)",
  "type": "TVSeries",
  "year": "2006",
  "episodes": [
    {
      "id": "tt1491856",
      "seasonNumber": "4",
      "episodeNumber": "1",
      "title": "East of Dillon",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU2NjIxMDI1OF5BMl5BanBnXkFtZTgwMjI3Nzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "28 Oct. 2009",
      "plot": "Coach Taylor is faced with building a football program from the ground up after the redistricting splits Dillon into two high-school districts. East Dillon is without funds, without a qualified coaching staff and without talent after the gerrymandering that was done by the Dillon Panther Boosters. Meanwhile Tim Riggins gives up on college and returns to Dillon only to find that you can't always go home again. Matt Saracen & Julie struggle with their roles in football crazed Dillon, now that Matt is no longer on the team.",
      "imDbRating": "8.5",
      "imDbRatingCount": "500"
    },
    {
      "id": "tt1501909",
      "seasonNumber": "4",
      "episodeNumber": "2",
      "title": "After the Fall",
      "image": "https://m.media-amazon.com/images/M/MV5BMTEzNTg0NjExMzFeQTJeQWpwZ15BbWU4MDQ1MzI4NDIx._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "4 Nov. 2009",
      "plot": "Following an opening night forfeit, Coach Taylor struggles to regain the support of his new team. Coach & Mrs Taylor weather a maelstrom when the star running back of the Dillon Panthers is outed as an East Dillon resident. Tim Riggins struggles to find a new living arrangement. Matt struggles with an internship with an abrasive local artist. Landry runs into an interesting girl at his new school.",
      "imDbRating": "8.2",
      "imDbRatingCount": "433"
    },
    {
      "id": "tt1502516",
      "seasonNumber": "4",
      "episodeNumber": "3",
      "title": "In the Skin of a Lion",
      "image": "https://m.media-amazon.com/images/M/MV5BMTUzNTEwMTUxNV5BMl5BanBnXkFtZTgwMjM1Mzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "11 Nov. 2009",
      "plot": "Coach Taylor & the team struggle to come up with funds for new uniforms & Coach makes a commitment that may get him in trouble with Mrs. Taylor. Riggins bonds with Becky, his new landlady's daughter. Matt's artist mentor influences both Matt and Julie. Landry's interest in Jess increases and he discovers that she knows football when she tutors him on kicking.",
      "imDbRating": "8.1",
      "imDbRatingCount": "415"
    },
    {
      "id": "tt1502517",
      "seasonNumber": "4",
      "episodeNumber": "4",
      "title": "A Sort of Homecoming",
      "image": "https://m.media-amazon.com/images/M/MV5BODEzNjY4OTI3M15BMl5BanBnXkFtZTgwMDI0Mzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "20 Nov. 2009",
      "plot": "Coach Taylor tries to foster community interest in the East Dillon Lions by staging a pep-rally while dealing with the increasing friction between Vince and Luke, his two star players. Tammy is still suffering the repercussions of making Luke Cafferty attend East Dillon. Riggins finds himself pageant dress shopping with his landlady's daughter and hunting with a trigger happy Matt Saracen. Meanwhile Julie accompanies Devin to a gay bar and runs into someone unexpected.",
      "imDbRating": "8.5",
      "imDbRatingCount": "432"
    },
    {
      "id": "tt1526671",
      "seasonNumber": "4",
      "episodeNumber": "5",
      "title": "The Son",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA3NTAyMTEwN15BMl5BanBnXkFtZTgwMDY4Nzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "2 Dec. 2009",
      "plot": "Just as the East Dillon Lions start to perform as a team, the town of Dillon is rocked with the news of the death of Matt's dad. Coach & Mrs Taylor and Julie all do their part to help Matt weather the storm. Landry & Riggins & the rest all rally to help as well but ultimately Matt must make peace with his dad on his own. Meanwhile Becky connects with Luke after he's been paint-balled by some of his former friends and the two finally...",
      "imDbRating": "9.5",
      "imDbRatingCount": "990"
    },
    {
      "id": "tt1539374",
      "seasonNumber": "4",
      "episodeNumber": "6",
      "title": "Stay",
      "image": "https://m.media-amazon.com/images/M/MV5BMTUzMDkyNzQyMV5BMl5BanBnXkFtZTgwODMwMjk0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "9 Dec. 2009",
      "plot": "Craziness comes to East Dillon when their scheduled football game against the undefeated McNulty team means that the game will be televised. Meanwhile Lyla remains in Dillon after the funeral and she and Tim reconnect. Julie goes AWOL to a music festival in Austin in hopes of cheering Matt up. Following their first kiss, Landry confesses to Jess that he may still not be completely over Tyra.",
      "imDbRating": "8.4",
      "imDbRatingCount": "440"
    },
    {
      "id": "tt1564137",
      "seasonNumber": "4",
      "episodeNumber": "7",
      "title": "In the Bag",
      "image": "https://m.media-amazon.com/images/M/MV5BMjAwODUwMDYxMF5BMl5BanBnXkFtZTgwMDQzMzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "16 Dec. 2009",
      "plot": "Julie mourns the end of her relationship with Matt. Luke's family commitments interfere with his football. Becky's dad returns from a road-trip with a secret. The police stop by the school in response to an anonymous tip to search Vince's locker for a gun. Mindy's maternity gets more expensive than Billy was prepared for and the Landing Strip girls throw a fund-raiser. Tammy's staff celebrates an academic award with a karaoke night and Glenn goes a bit too far.",
      "imDbRating": "8.0",
      "imDbRatingCount": "404"
    },
    {
      "id": "tt1564138",
      "seasonNumber": "4",
      "episodeNumber": "8",
      "title": "Toilet Bowl",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ2OTI5NTc2OF5BMl5BanBnXkFtZTgwMjYzMzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "6 Jan. 2010",
      "plot": "When East Dillon and the only other winless team in the district face off, locals term it the \"Toilet Bowl.\" This conflicts with Coach's and Buddy's attempts to get play-by-play coverage from a local radio station. Meanwhile, Julie & Mrs. Taylor visit her old alma mater. Landry tries to convince Jess that he's completely over Tryra and that they should date. Vince's mom invites Jess to dinner with her and her son. Tim Riggins helps Luke get pain meds following an injury on the ranch without letting Coach Taylor know. Riggins also discovers that his brother Billy has ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "400"
    },
    {
      "id": "tt1564136",
      "seasonNumber": "4",
      "episodeNumber": "9",
      "title": "The Lights in Carroll Park",
      "image": "https://m.media-amazon.com/images/M/MV5BMTY1MjM4MTQyOV5BMl5BanBnXkFtZTgwNDgzMzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "13 Jan. 2010",
      "plot": "When a 12 year-old is shot in an East Dillon park, Coach Taylor takes action. Julie takes a step in recovering from her break-up with Matt thanks to a cute supervisor at a Habitat for Humanity build. Vince gets a job at Ray's BBQ and he & Landry face off over their mutual attraction to Jess Merriweather. Meanwhile Becky Sproles finds out that she's pregnant and informs both Luke and Riggins.",
      "imDbRating": "8.0",
      "imDbRatingCount": "400"
    },
    {
      "id": "tt1564132",
      "seasonNumber": "4",
      "episodeNumber": "10",
      "title": "I Can't",
      "image": "https://m.media-amazon.com/images/M/MV5BNDc1ODg1Nzk5M15BMl5BanBnXkFtZTgwNDY0Mzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "20 Jan. 2010",
      "plot": "Riggins takes Becky to Mrs. Taylor for advice about her unwanted pregnancy. Vince must get his mom into rehab after she OD's. Julie invites Habitat Ryan over for dinner with her folks. Tim pressures Billy to get out of the chop shop business. Luke tells his parents that he's gotten Becky pregnant. Jess confronts her dad about his supporting her and her brothers in football related activities.",
      "imDbRating": "8.1",
      "imDbRatingCount": "403"
    },
    {
      "id": "tt1564133",
      "seasonNumber": "4",
      "episodeNumber": "11",
      "title": "Injury List",
      "image": "https://m.media-amazon.com/images/M/MV5BMjI4NjMyNzk4MF5BMl5BanBnXkFtZTgwMjA0Mzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "27 Jan. 2010",
      "plot": "Luke Cafferty's mom raises a ruckus and wants Mrs. Taylor fired for her role in the aborting of her grandson. Landry and his folks invite Jess over for a rather awkward dinner. Julie reacts badly when Matt finally calls her to say he misses her. Luke becomes more and more dependent on pain pills and continues to hide his injury from everyone until it results in a crisis. Vince gets in deeper with the neighborhood thugs after borrowing money from them to get his mom into rehab. Mrs. Sproles comes onto Tim after a celebratory dinner then reacts badly when she finds him ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "398"
    },
    {
      "id": "tt1564134",
      "seasonNumber": "4",
      "episodeNumber": "12",
      "title": "Laboring",
      "image": "https://m.media-amazon.com/images/M/MV5BNDAzMDA0MTAwMl5BMl5BanBnXkFtZTgwMjkyMzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "3 Feb. 2010",
      "plot": "The final game of the regular season has the East Dillon Lions slated to host the Dillon Panthers in what is sure to be the mother of all cross town rivalries. When the Panther boosters question the fitness of the East Dillon field it quickly escalates from toothpick pranks to torn up turf. Meanwhile the pro-life witch-hunt to get Tammy terminated for counseling the pregnant Becky escalates. Adding to the chaos, Mindy goes into labor, Billy goes on a caffeine bender, and soon after the boy is born, Uncle Tim gets arrested when the cops bust the chop shop. Meanwhile ...",
      "imDbRating": "8.8",
      "imDbRatingCount": "426"
    },
    {
      "id": "tt1564135",
      "seasonNumber": "4",
      "episodeNumber": "13",
      "title": "Thanksgiving",
      "image": "https://m.media-amazon.com/images/M/MV5BMTk1ODQyMjMyMF5BMl5BanBnXkFtZTgwMDgxNDg3MDI@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "10 Feb. 2010",
      "plot": "Jess confides to Landry that she has feelings for Vince. Thanksgiving arrives, the day before the big game finds the Taylors playing host to an extended family dinner. The Riggins are there including the newest Riggins. Matt's back from Chicago. Buddy is bringing his own turkey to deep fry. Then on Friday, The lions meet the Panthers on the Panther's home field but they're a tougher team than anticipated. It all comes down to Landry can he make a 45 yard field goal and win the game?",
      "imDbRating": "9.1",
      "imDbRatingCount": "533"
    }
  ],
  "errorMessage": ""
}