{
  "imDbId": "tt0758745",
  "title": "Friday Night Lights",
  "fullTitle": "Friday Night Lights (TV Series 2006–2011)",
  "type": "TVSeries",
  "year": "2006",
  "episodes": [
    {
      "id": "tt1031339",
      "seasonNumber": "2",
      "episodeNumber": "1",
      "title": "Last Days of Summer",
      "image": "https://m.media-amazon.com/images/M/MV5BNDhhMTlhYjQtNTMyOC00NTA2LTgyZDgtY2YwZGIwOTcxMTZjXkEyXkFqcGdeQXVyMjczNjE2MDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "20 Sep. 2007",
      "plot": "As a new school season gears up the Dillon Panthers find themselves without Coach Taylor, who is also missed by expectant mom Tami and adrift daughter Julie.",
      "imDbRating": "7.6",
      "imDbRatingCount": "604"
    },
    {
      "id": "tt1031344",
      "seasonNumber": "2",
      "episodeNumber": "2",
      "title": "Bad Ideas",
      "image": "https://m.media-amazon.com/images/M/MV5BZjVlMmZjY2MtMzMzMi00ODZlLWE1YWYtMzQyOWQyYmFiMDcwXkEyXkFqcGdeQXVyMjczNjE2MDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "12 Oct. 2007",
      "plot": "Eric and Tammi's separation takes its toll; Landry and Tyra become closer while Matt and Julie drift apart meanwhile the Panthers gear up for a new season.",
      "imDbRating": "7.5",
      "imDbRatingCount": "550"
    },
    {
      "id": "tt1031345",
      "seasonNumber": "2",
      "episodeNumber": "3",
      "title": "Are You Ready for Friday Night?",
      "image": "https://m.media-amazon.com/images/M/MV5BMTExNmU1YTktY2Q3Ny00NzJjLTg1MzktNTc1MWM0YWFlMzcxXkEyXkFqcGdeQXVyMjczNjE2MDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "19 Oct. 2007",
      "plot": "Matt takes it upon himself to try to curb Smash's enthusiasm for the upcoming season. Tim turns to Lila when he spots his brother leaving his neighbor's house. Jason turns his attention on Mexico in an effort to walk again. Buddy turns to Coach Taylor to convince him to return as coach of the Panthers.",
      "imDbRating": "7.8",
      "imDbRatingCount": "535"
    },
    {
      "id": "tt1031346",
      "seasonNumber": "2",
      "episodeNumber": "4",
      "title": "Backfire",
      "image": "https://m.media-amazon.com/images/M/MV5BMTAzMTcyOTYxNTJeQTJeQWpwZ15BbWU4MDUxNzY4NDIx._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "26 Oct. 2007",
      "plot": "Eric quits his college coaching job to return home to his family and the Panthers, but the latter doesn't look very promising when the old coach fights his termination after only two games. Tim accompanies Jason to Mexico where a questionable medical procedure gives Jason hopes of walking again. After making an appearance in the Lord's name in a boys' home, Lila takes it upon herself to show a recently-release inmate the light. Landry's father is called into work after the body that he and Tyra disposed of is discovered.",
      "imDbRating": "7.5",
      "imDbRatingCount": "526"
    },
    {
      "id": "tt1031347",
      "seasonNumber": "2",
      "episodeNumber": "5",
      "title": "Let's Get It On",
      "image": "https://m.media-amazon.com/images/M/MV5BNDEwM2JjNWItZWE5Ni00ZDg0LTlhZGYtZjM1MzJkMTQ2ZTYxXkEyXkFqcGdeQXVyMjczNjE2MDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "2 Nov. 2007",
      "plot": "Upon returning to the Panthers, Coach Taylor finds himself trying to mend broken fences between his quarterback and his halfback and attempts to find a little intimate time with his wife. Tim recruits Lila in trying to talk Jason out of the risky surgery he has scheduled in Mexico, while Landry's father tries to put up a fence between his son and Tyra.",
      "imDbRating": "8.1",
      "imDbRatingCount": "527"
    },
    {
      "id": "tt1031348",
      "seasonNumber": "2",
      "episodeNumber": "6",
      "title": "How Did I Get Here",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA4NzA0MzYyM15BMl5BanBnXkFtZTgwMDI4Njg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "9 Nov. 2007",
      "plot": "Upon returning to Dillon, Tim finds his team locker empty, while Coach Taylor deals with Jason and offering him a coaching job, while, at the same time, dealing with his own job not paying as nearly much as what he was getting the previous year. Lila's friend from the boys' school shows up with her father in hopes of a tryout with the Panthers and Landry's father nears the truth about his role in a death.",
      "imDbRating": "7.9",
      "imDbRatingCount": "519"
    },
    {
      "id": "tt1031349",
      "seasonNumber": "2",
      "episodeNumber": "7",
      "title": "Pantherama!",
      "image": "https://m.media-amazon.com/images/M/MV5BMTkxOTkzNDE3M15BMl5BanBnXkFtZTgwODk2Njg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "16 Nov. 2007",
      "plot": "The coach's wife enlists the aid of Tyra and Lila to secure entertainment for the annual Pantherama event, while the coach enlists the aid of Buddy, who found a hot new football player for him, but the new prospective star has a family that's run out on him, and Tami won't let him play football until that scenario is amended. Julie enlists the aid of journalism in an effort to help her get over the loss of Matt. Smash doesn't want help from anybody, while he turns his back on the possibility of a great education, opting out, instead for a chance at more recognition ...",
      "imDbRating": "7.6",
      "imDbRatingCount": "522"
    },
    {
      "id": "tt1031350",
      "seasonNumber": "2",
      "episodeNumber": "8",
      "title": "Seeing Other People",
      "image": "https://m.media-amazon.com/images/M/MV5BZDEyN2UwMDUtYmJhMC00MzEyLTgxOWUtNmVjNTg4MjYwYzIzXkEyXkFqcGdeQXVyMjczNjE2MDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "30 Nov. 2007",
      "plot": "Tami manages to alienate her husband and her daughter. Smash manages to alienate a prospective teammate while on a college visit. Matt manages to alienate the young lady who cares for his grandmother and the girl from school who was sweet on him. After alienating the team, Tim still finds himself trying to get back on the team, which, embarrassingly, lost their last game. Landry agrees to meet the brother of the man he killed for Tyra, who originally agreed to meet the man who wanted to make amends for his brother",
      "imDbRating": "7.7",
      "imDbRatingCount": "556"
    },
    {
      "id": "tt1031351",
      "seasonNumber": "2",
      "episodeNumber": "9",
      "title": "The Confession",
      "image": "https://m.media-amazon.com/images/M/MV5BZDU1YjY0OTYtYjRmYS00NjE2LTg1MGQtNTVmNGFkMGFmYzU2XkEyXkFqcGdeQXVyMjczNjE2MDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "7 Dec. 2007",
      "plot": "Landry gives into his better judgment and confesses about what he did while trying to save Tyra. Santiago feels the pressure about the upcoming football game, while pressure mounts between Julie and her mother surrounding the christening of the new baby in the family. Tim feels the pressure of his new roommate, while Jason does his best in getting back into the dating world.",
      "imDbRating": "8.0",
      "imDbRatingCount": "512"
    },
    {
      "id": "tt1031340",
      "seasonNumber": "2",
      "episodeNumber": "10",
      "title": "There Goes the Neighborhood",
      "image": "https://m.media-amazon.com/images/M/MV5BMTg5NjMwMTEwMV5BMl5BanBnXkFtZTgwNzc2Njg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "4 Jan. 2008",
      "plot": "After a tornado rips through the surrounding country side, bombs begin to fly: Coach Taylor drops a bomb on his team by being host to a rival team when their school and field is damaged, Lila drops a bomb on her father about her mother's impending nuptials, and Tyra drops a bomb on Landry about attending Dillon High School's formal dance. Meanwhile, tensions grow around the Taylor household surrounding Tim living in the house.",
      "imDbRating": "8.3",
      "imDbRatingCount": "519"
    },
    {
      "id": "tt1031341",
      "seasonNumber": "2",
      "episodeNumber": "11",
      "title": "Jumping the Gun",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc3ODYzNzMyMl5BMl5BanBnXkFtZTgwNzU3Njg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "11 Jan. 2008",
      "plot": "The coach's need for his own space in his own house doesn't just stop at throwing out Tim, even though his wife has her own needs when it comes to caring for her family and Smash's need for choosing a college is taking its toll on his family, especially his mother.",
      "imDbRating": "7.9",
      "imDbRatingCount": "490"
    },
    {
      "id": "tt1031342",
      "seasonNumber": "2",
      "episodeNumber": "12",
      "title": "Who Do You Think You Are?",
      "image": "https://m.media-amazon.com/images/M/MV5BNTg2NDkyMTY3N15BMl5BanBnXkFtZTgwOTM3Njg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "18 Jan. 2008",
      "plot": "Matt doesn't want to break his bond with his grandmother's nurse, who's moving back to her native country. Smash and Noelle are pressured by their parents to break the bond they have between them. Tami doesn't want to break the bond with her infant daughter by leaving her at daycare. And as Santiago's former friends show up at his house to retrieve their bond, Buddy feels the bond with his material possessions, while his daughter, Lyla, takes a job at a Christian radio station.",
      "imDbRating": "7.6",
      "imDbRatingCount": "479"
    },
    {
      "id": "tt1031343",
      "seasonNumber": "2",
      "episodeNumber": "13",
      "title": "Humble Pie",
      "image": "https://m.media-amazon.com/images/M/MV5BMTEzMTg0NDY4MDJeQTJeQWpwZ15BbWU4MDM5NzY4NDIx._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "25 Jan. 2008",
      "plot": "As the athletic director, it falls to Coach Taylor to find a new girls' volleyball coach, and he stops at his own wife, who searches for her newest player. Jason takes a new job working for Buddy Garrity and Smash has some fallout of his own after getting arrested. Tim's given a few days to give back the money he stole while he still makes a play for Lyla.",
      "imDbRating": "7.8",
      "imDbRatingCount": "464"
    },
    {
      "id": "tt1151593",
      "seasonNumber": "2",
      "episodeNumber": "14",
      "title": "Leave No One Behind",
      "image": "https://m.media-amazon.com/images/M/MV5BMjEzODE3MDI5NF5BMl5BanBnXkFtZTgwODA5Mzg0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "1 Feb. 2008",
      "plot": "The hardships in Saracen's life begin to get to him, and he and Riggins, who is still pining away for Lyla, commiserate; Julie feels left out when it seems like her mom is more focused on the volleyball team than on her; Smash's suspension hurts the rest of the team's morale, and it has an unexpected consequence for him; Tyra becomes jealous of Landry's new girlfriend.",
      "imDbRating": "8.5",
      "imDbRatingCount": "506"
    },
    {
      "id": "tt1151073",
      "seasonNumber": "2",
      "episodeNumber": "15",
      "title": "May the Best Man Win",
      "image": "https://m.media-amazon.com/images/M/MV5BMThlMjM4MTgtOGIwZS00MzU5LThlYzYtOGRiMjQ2MGYzZDYyXkEyXkFqcGdeQXVyMjczNjE2MDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "8 Feb. 2008",
      "plot": "Brian \"Smash\" Williams is determined to get a football scholarship to college despite the recent events that have transpired. However, Brian is very shocked when the most unlikely place offers him what may be the opportunity of his life. Tami Taylor runs into her ex-boyfriend from high school, a big real estate mogul, and he decides to stay in Dillon for a few days. A few days proves to be too long as Coach Taylor begins to feel a bit jealous. Elsewhere, Jason Street hears the biggest news of his life since his accident and must decide if he is willing to change his ...",
      "imDbRating": "7.8",
      "imDbRatingCount": "501"
    }
  ],
  "errorMessage": ""
}