{
  "imDbId": "tt0758745",
  "title": "Friday Night Lights",
  "fullTitle": "Friday Night Lights (TV Series 2006–2011)",
  "type": "TVSeries",
  "year": "2006",
  "episodes": [
    {
      "id": "tt1631962",
      "seasonNumber": "5",
      "episodeNumber": "1",
      "title": "Expectations",
      "image": "https://m.media-amazon.com/images/M/MV5BODQ4MzE3MDg5M15BMl5BanBnXkFtZTgwNTE2Mzk0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "27 Oct. 2010",
      "plot": "Julie Taylor prepares to go away to college. Mrs. Taylor digs into her new job as the guidance counselor at East Dillon and Coach Taylor poaches a basketball player for his team as the East Dillon Lions prepare for a pre-season game against the Croft Cowboys, last year's Texas State champs.",
      "imDbRating": "8.0",
      "imDbRatingCount": "412"
    },
    {
      "id": "tt1631967",
      "seasonNumber": "5",
      "episodeNumber": "2",
      "title": "On the Outside Looking In",
      "image": "https://m.media-amazon.com/images/M/MV5BODA0Mjg0NzY0MV5BMl5BanBnXkFtZTgwNDg1Mzk0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "3 Nov. 2010",
      "plot": "Julie starts her college classes and meets an interesting teaching assistant. Tammy Taylor has trouble fitting in with the East Dillon teaching staff. Luke Cafferty's tackle from the last game is questioned. Coach Taylor finds that he's now on the outside and set a new goal. Jess and Vince hit a bump in their relationship.",
      "imDbRating": "7.9",
      "imDbRatingCount": "392"
    },
    {
      "id": "tt1631968",
      "seasonNumber": "5",
      "episodeNumber": "3",
      "title": "The Right Hand of the Father",
      "image": "https://m.media-amazon.com/images/M/MV5BNTUyMDcwNDk5OF5BMl5BanBnXkFtZTgwNjY1Mzk0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "10 Nov. 2010",
      "plot": "Vince's dad gets out on parole. A video of Maura drunk at the party with several Lions team members gets posted on the Internet. Mrs Taylor tries to take corrective action during school hours and Coach Taylor tries to get the team members back on track. Meanwhile Julie's flirtation with her history TA gets more serious.",
      "imDbRating": "8.4",
      "imDbRatingCount": "410"
    },
    {
      "id": "tt1631969",
      "seasonNumber": "5",
      "episodeNumber": "4",
      "title": "Keep Looking",
      "image": "https://m.media-amazon.com/images/M/MV5BNjk5OTkwMDk0Ml5BMl5BanBnXkFtZTgwMzc1Mzk0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "17 Nov. 2010",
      "plot": "Becky's dad returns to town, Buddy Jr. comes to stay with his dad, and Vince confronts his father about the drugs in his past. Meanwhile, Jess and Vince squabble about her being the team's equipment manager. Luke gets an invite to visit TMU and bring a few friends.",
      "imDbRating": "8.2",
      "imDbRatingCount": "385"
    },
    {
      "id": "tt1631970",
      "seasonNumber": "5",
      "episodeNumber": "5",
      "title": "Kingdom",
      "image": "https://m.media-amazon.com/images/M/MV5BMTkyMzk4MTU3MV5BMl5BanBnXkFtZTgwMjY1Mzk0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "1 Dec. 2010",
      "plot": "The East Dillon Lions face the South Kingdom Rangers, the team to whom they forfeited at the beginning of last season. Coach tries to steer the team away from talk of revenge but when the game gets rough and the officiating lopsided, coach reconsiders. Meanwhile Tami bonds with one of the East Dillon teachers in a girl's night in and Julie's relationship with her TA hits a snag. Following the game, Hasting finds an outlaw white-lightning party in the otherwise dry town and bolstered by hooch, talk of college recruitment, and brotherhood the Lions go a bit overboard ...",
      "imDbRating": "8.6",
      "imDbRatingCount": "420"
    },
    {
      "id": "tt1631971",
      "seasonNumber": "5",
      "episodeNumber": "6",
      "title": "Swerve",
      "image": "https://m.media-amazon.com/images/M/MV5BNDM3MDE4OTQ1Ml5BMl5BanBnXkFtZTgwNTg1Mzk0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "8 Dec. 2010",
      "plot": "Rather than return to college where she's been humiliated, Julie wrecks her car. As the truth comes out, Coach Taylor is thrown, so much so that he leaves a practice early. Meanwhile Vince's past friend is pressuring him to repay the money that he borrowed. Luke reacts badly to the information that TMU recruiters were using him to get to Vince. Billy Riggins gets to step up for a locker-room speech when Coach is late. Vinces dad steps in to help out his son and Mindy tells Becky that she needs to get laid to get her mind off Tim Riggins and even suggests the farm-boy ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "381"
    },
    {
      "id": "tt1631972",
      "seasonNumber": "5",
      "episodeNumber": "7",
      "title": "Perfect Record",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ5NzgyODE2Nl5BMl5BanBnXkFtZTgwMzk1Mzk0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "15 Dec. 2010",
      "plot": "It's cross-town rivalry week again in Dillon and things get heated when an anti-Lion website appears highlighting the boys' juvenile records. Coach Taylor is concerned when Vince's dad gets more involved in his college recruitment prospects. Billy Riggins works privately with Luke and gets him pumped up for the game but gives him one or two pieces of bad advice. Meanwhile Julie is still hiding out at home and Tami goes up to her school to collect her schoolwork.",
      "imDbRating": "8.4",
      "imDbRatingCount": "382"
    },
    {
      "id": "tt1631973",
      "seasonNumber": "5",
      "episodeNumber": "8",
      "title": "Fracture",
      "image": "https://m.media-amazon.com/images/M/MV5BNTA4NDY5NzY4Nl5BMl5BanBnXkFtZTgwMTY1Mzk0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "5 Jan. 2011",
      "plot": "Between a potential head coaching position at a Florida College, Julie's continuing stay at home, the team's growing disharmony over Vince's show-boat behavior and the interference of Vince's Dad, Coach Taylor has a rough week. Becky enters a pageant with the support of the Landing Strip girls and begins to question her decisions. Julie's T.A. Derek shows up in Dillon. Tami Taylor learns that not everything Epyck tells her is reliable.",
      "imDbRating": "7.9",
      "imDbRatingCount": "392"
    },
    {
      "id": "tt1631974",
      "seasonNumber": "5",
      "episodeNumber": "9",
      "title": "Gut Check",
      "image": "https://m.media-amazon.com/images/M/MV5BMTA4NTEwMTk0MDdeQTJeQWpwZ15BbWU4MDgyNTM5NDIx._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "12 Jan. 2011",
      "plot": "Following a contentious loss, Coach Taylor decides to bench Vince for a game and start Luke at QB. Becky and Luke try to start their relationship over but the Seniors recognition night scheduled for Friday's game makes that difficult. Julie continues her hiatus from school and visits Matt in Chicago. Epyck crosses a line during a tutoring session with Mrs. Taylor.",
      "imDbRating": "8.4",
      "imDbRatingCount": "380"
    },
    {
      "id": "tt1631963",
      "seasonNumber": "5",
      "episodeNumber": "10",
      "title": "Don't Go",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc4MTA3MjU2MV5BMl5BanBnXkFtZTgwNjg1Mzk0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "19 Jan. 2011",
      "plot": "Coach's offer from a Florida college becomes public knowledge. Tim Riggins parole hearing date approaches and Billy asks Coach Taylor to be a character witness. Luke considers what comes after high school if he gets no scholarship offers. Vince tries to get back in coach's good graces after last week's benching but his dad makes it difficult.",
      "imDbRating": "8.6",
      "imDbRatingCount": "400"
    },
    {
      "id": "tt1631964",
      "seasonNumber": "5",
      "episodeNumber": "11",
      "title": "The March",
      "image": "https://m.media-amazon.com/images/M/MV5BMjQ0MTk3NTA2Nl5BMl5BanBnXkFtZTgwOTA2Mzk0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "26 Jan. 2011",
      "plot": "The East Dillon Lion's march toward State continues amid Coach Taylor & Principal Burnwell's concerns about impending budget cuts. Tami gets an opportunity to interview with the admissions department of a prestigious Pennsylvania university. Tim Riggins finds acclimating to the busy Riggins' household difficult following his release on parole. Vince and his mom are worried as Vince's dad seems to be returning to his old ways.",
      "imDbRating": "8.6",
      "imDbRatingCount": "401"
    },
    {
      "id": "tt1631965",
      "seasonNumber": "5",
      "episodeNumber": "12",
      "title": "Texas Whatever",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ3MTMwNzQ2MV5BMl5BanBnXkFtZTgwMTk1Mzk0MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "2 Feb. 2011",
      "plot": "The school board considers eliminating a football program to meet budget cuts, making Dillon a one team town again. Meanwhile Tami considers a job offer that Coach Taylor is eager to dismiss. Tyra returns to town and questions Tim about his plan to leave Texas. The Panthers boosters approach Buddy. Luke confronts Tim about his relationship with Becky. Following an abortive open school-board hearing, Vince and Jess try to plead the Lions' case directly with the chairman of the school-board.",
      "imDbRating": "9.0",
      "imDbRatingCount": "468"
    },
    {
      "id": "tt1631966",
      "seasonNumber": "5",
      "episodeNumber": "13",
      "title": "Always",
      "image": "https://m.media-amazon.com/images/M/MV5BMTM4MjA3ODk1MV5BMl5BanBnXkFtZTcwNzExNzY5NQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "9 Feb. 2011",
      "plot": "With the decision to close the East Dillon Football program speculation runs wild on two fronts. Will the Lions be able to win State and go out in a blaze of glory; and will Coach Taylor agree to return to coach the Dillion Panthers and a super team with the best of both schools? Tami's PA job offer adds conflict in the Taylor home as does a new development with Matt & Julie. Meanwhile Tim Riggins and Tyra talk seriously about their futures and Luke & Becky clear the air.",
      "imDbRating": "9.6",
      "imDbRatingCount": "1185"
    }
  ],
  "errorMessage": ""
}