{
  "imDbId": "tt0758745",
  "title": "Friday Night Lights",
  "fullTitle": "Friday Night Lights (TV Series 2006–2011)",
  "type": "TVSeries",
  "year": "2006",
  "language": "en",
  "titleInLanguage": "Friday Night Lights (TV series)",
  "url": "https://en.wikipedia.org/wiki/Friday_Night_Lights_(TV_series)",
  "plotShort": {
    "plainText": "Friday Night Lights is an American sports drama television series developed by Peter Berg and inspired by the 1990 nonfiction book by H. G. Bissinger, which was adapted as the 2004 film of the same name by Berg. Executive producers were Brian Grazer, David Nevins, Sarah Aubrey and Jason Katims who also served as showrunner. The series follows a high school football team in the fictional town of Dillon, a small, close-knit community in rural West Texas. It features an ensemble cast led by Kyle Chandler and Connie Britton, portraying high school football coach Eric Taylor and his wife Tami Taylor, a school faculty member. The primary cast includes characters associated with football and high school. The show uses its small-town backdrop to address many issues in contemporary American culture like family values, school funding, racism, substance use, abortion and lack of economic opportunities.\r\nFriday Night Lights premiered on October 3, 2006. It aired for two seasons on NBC. In May 2007, the series was renewed for a second season to consist of 19 episodes, but due to the writers' strike, it was shortened to 15 episodes. Although the show had garnered critical acclaim and passionate fans, the series suffered low ratings and was in danger of cancellation after the second season. To save the series, NBC struck a deal with DirecTV to co-produce three more seasons; each subsequent season premiered on DirecTV's 101 Network, with NBC rebroadcasts a few months later. The series ended its run on The 101 Network on February 9, 2011, after five seasons.\r\nThough Friday Night Lights never garnered a sizable audience, it was a critical success, lauded for its realistic portrayal of Middle America and deep exploration of its central characters. The show appeared on a number of best lists and was awarded a Peabody Award, a Humanitas Prize, a Television Critics Association Award and several technical Primetime Emmy Awards. At the 2011 Primetime Emmy Awards, the show was nominated for Outstanding Drama Series. Kyle Chandler and Connie Britton also scored multiple nominations for the Outstanding Lead Actor and Actress awards for a drama series. Executive producer Jason Katims was nominated for Outstanding Writing for a Drama Series. Chandler and Katims each won the Emmy in 2011.",
    "html": "<p>Friday Night Lights is an American sports drama television series developed by Peter Berg and inspired by the 1990 nonfiction book by H. G. Bissinger, which was adapted as the 2004 film of the same name by Berg. Executive producers were Brian Grazer, David Nevins, Sarah Aubrey and Jason Katims who also served as showrunner. The series follows a high school football team in the fictional town of Dillon, a small, close-knit community in rural West Texas. It features an ensemble cast led by Kyle Chandler and Connie Britton, portraying high school football coach Eric Taylor and his wife Tami Taylor, a school faculty member. The primary cast includes characters associated with football and high school. The show uses its small-town backdrop to address many issues in contemporary American culture like family values, school funding, racism, substance use, abortion and lack of economic opportunities.</p><p>Friday Night Lights premiered on October 3, 2006. It aired for two seasons on NBC. In May 2007, the series was renewed for a second season to consist of 19 episodes, but due to the writers' strike, it was shortened to 15 episodes. Although the show had garnered critical acclaim and passionate fans, the series suffered low ratings and was in danger of cancellation after the second season. To save the series, NBC struck a deal with DirecTV to co-produce three more seasons; each subsequent season premiered on DirecTV's 101 Network, with NBC rebroadcasts a few months later. The series ended its run on The 101 Network on February 9, 2011, after five seasons.</p><p>Though Friday Night Lights never garnered a sizable audience, it was a critical success, lauded for its realistic portrayal of Middle America and deep exploration of its central characters. The show appeared on a number of best lists and was awarded a Peabody Award, a Humanitas Prize, a Television Critics Association Award and several technical Primetime Emmy Awards. At the 2011 Primetime Emmy Awards, the show was nominated for Outstanding Drama Series. Kyle Chandler and Connie Britton also scored multiple nominations for the Outstanding Lead Actor and Actress awards for a drama series. Executive producer Jason Katims was nominated for Outstanding Writing for a Drama Series. Chandler and Katims each won the Emmy in 2011.</p>"
  },
  "plotFull": {
    "plainText": "Friday Night Lights is an American sports drama television series developed by Peter Berg and inspired by the 1990 nonfiction book by H. G. Bissinger, which was adapted as the 2004 film of the same name by Berg. Executive producers were Brian Grazer, David Nevins, Sarah Aubrey and Jason Katims who also served as showrunner. The series follows a high school football team in the fictional town of Dillon, a small, close-knit community in rural West Texas. It features an ensemble cast led by Kyle Chandler and Connie Britton, portraying high school football coach Eric Taylor and his wife Tami Taylor, a school faculty member. The primary cast includes characters associated with football and high school. The show uses its small-town backdrop to address many issues in contemporary American culture like family values, school funding, racism, substance use, abortion and lack of economic opportunities.\r\nFriday Night Lights premiered on October 3, 2006. It aired for two seasons on NBC. In May 2007, the series was renewed for a second season to consist of 19 episodes, but due to the writers' strike, it was shortened to 15 episodes. Although the show had garnered critical acclaim and passionate fans, the series suffered low ratings and was in danger of cancellation after the second season. To save the series, NBC struck a deal with DirecTV to co-produce three more seasons; each subsequent season premiered on DirecTV's 101 Network, with NBC rebroadcasts a few months later. The series ended its run on The 101 Network on February 9, 2011, after five seasons.\r\nThough Friday Night Lights never garnered a sizable audience, it was a critical success, lauded for its realistic portrayal of Middle America and deep exploration of its central characters. The show appeared on a number of best lists and was awarded a Peabody Award, a Humanitas Prize, a Television Critics Association Award and several technical Primetime Emmy Awards. At the 2011 Primetime Emmy Awards, the show was nominated for Outstanding Drama Series. Kyle Chandler and Connie Britton also scored multiple nominations for the Outstanding Lead Actor and Actress awards for a drama series. Executive producer Jason Katims was nominated for Outstanding Writing for a Drama Series. Chandler and Katims each won the Emmy in 2011.\r\nBackground\r\nInspiration\r\nFriday Night Lights was inspired by H.G. \"Buzz\" Bissinger's non-fiction book Friday Night Lights: A Town, a Team, and a Dream (1990) and the 2004 film based on it. The book, which explores the 1988 season of the Permian Panthers, a high school football team in Odessa, Texas, was a factual work of documentary journalism. The people featured were not renamed in the book. The Universal Pictures film, which stars Billy Bob Thornton and was directed by Peter Berg, Bissinger's second cousin, based its characters on the residents of Odessa, c. 1988.\r\nConception\r\nOnce filming on the movie was completed, Berg began to explore adapting the story for television. Berg later said he had regretted having to jettison many of the interpersonal topics from the book because of the time constraints of a feature film. Creating a TV series, particularly one based on fictional characters, allowed him to address many of those elements in-depth.\r\nHe decided to set the series in a fictional town of Dillon, Texas, with some characteristics of Odessa. The football team was given the Panthers name. Berg deliberately carried elements from the film to the series, particularly for the pilot, which was closely related to the film. He cast Connie Britton as the wife of head coach Eric Taylor, and Brad Leland as Buddy Garrity, a major businessman and football booster, in roles similar to those they played in the film.\r\nProduction\r\nFilming for the show's pilot began in February 2006 in Austin, Texas. Berg said he required filming the pilot and eventually the show in Texas as \"a deal breaker\" in order to agree to participate weekly in the project. The show features homages to its Texas heritage. In the pilot, Berg featured former Texas Longhorns football coach Mack Brown as a Dillon booster and had a caller to the fictional Panther Radio compare Panthers' coach Eric Taylor to Brown. The pilot referred to much of the surrounding area in its scenes. Football scenes were filmed at Pflugerville High School's Kuempel Stadium and at the RRISD Complex. The Dillon Panther football team and coaches' uniforms were based on the uniforms of the Pflugerville Panthers. Some of the scenes were filmed at Texas School for the Deaf.\r\nBerg's observation of local high school students while preparing to film the movie inspired his development of some of the characters. For example, Jason Street, the character whose promising football career is ended by a spinal injury in the pilot, was inspired by a local event. David Edwards, a football player from San Antonio’s Madison High, was paralyzed during a November 2003 game. Berg was at the game when this accident occurred; he was profoundly affected by Edwards' injury and how it overturned his life. Berg set up a similar incident in the pilot.\r\nPerformances\r\nWhile relying on a script each week, the producers decided at the outset to allow the cast leeway in what they said and did on the show. Their decisions could affect the delivery of their lines and the blocking of each scene. If the actors felt that something was untrue to their character or a mode of delivery didn't work, they were free to change it, provided they still hit the vital plot points.\r\nThis freedom was complemented by filming without rehearsal and without extensive blocking. Camera operators were trained to follow the actors, rather than having the actors stand in one place with cameras fixed around them. The actors knew that the filming would work around them. Executive producer Jeffrey Reiner described this method as \"no rehearsal, no blocking, just three cameras and we shoot.\"\r\nWorking in this fashion profoundly influenced everyone involved with the show. Series star Kyle Chandler said: \"When I look back at my life, I'm going to say, 'Wow, Peter Berg really changed my life.'\" Executive producer and head writer Jason Katims echoed this sentiment, saying: \"When I first came on set, I thought, it’s interesting – this is what I imagined filmmaking would be, before I saw what filmmaking was.\"\r\nFilming\r\nAll five seasons of Friday Night Lights were filmed in Austin and Pflugerville. With the show yielding roughly $33 million a year in revenue, other states courted the production company after the state of Texas failed to pay all the rebates it had promised to the show's producers. The Texas legislature authorized funding to match the offers of other states, and the production company preferred to stay near Austin, so the show remained in Texas.\r\nFriday Night Lights is unusual for using actual locations rather than stage sets and sound stage. These factors together with reliance on filming hundreds of locals as extras, gives the series an authentic feel and look.\r\nThe producers used a cinéma vérité (documentary-style) filming technique. Three cameras were used for each shoot and entire scenes were shot in one take. In contrast, most productions film a scene from each angle and typically repeat the scene several times while readjusting lighting to accommodate each shot. The first takes usually made the final cut. By filming a scene all at once, the producers tried to create an environment for the actors that was more organic and allowed for the best performances.\r\nThe series borrowed the uniforms, cheerleaders, fans and stadium of the Pflugerville Panthers. Producers shot Pflugerville games and used them as game footage in the series. University of Southern California football announcers Pete Arbogast and Paul McDonald provided off-screen commentary during the football game sequences. The facilities, colors and bobcat logos of Texas State University in San Marcos were used as the setting and creative inspiration for the fictional Texas Methodist University. The show features the fictional Herrmann Field, named for George Herrmann, the head coach of the Pflugerville Panthers.\r\nSome scenes were filmed outside Texas. On June 20, 2010, scenes were filmed at Temple University, which was to portray the fictional Braemore College. An episode from Julie's senior year in high school was filmed in the Boston area, at Boston College, Boston University, and Tufts University.\r\nSome scenes at fictional Oklahoma Tech University were filmed at Gregory Gym at The University of Texas at Austin.\r\nMarketing\r\nInitially targeted at the youth market, the show emphasized the football element. NBC teamed with social networking site Bebo to create a site that allowed students to upload video and photos, as well as create blogs about their local football teams. Students who participated were eligible for one of 10 $5,000 scholarships. NBC had negotiated with Bebo for network and series promotion on Bebo's network of youth-oriented sites including Piczo, Hi5, Tickle, Ringo, and FastWeb.\r\nTo complement this promotion, NBC sent out \"School Spirit\" kits to 1,000 high schools around the country. These kits included posters, pom-poms, mini-footballs and disposable cameras, all bearing the show's logo. The kits also contained copies of the show's pilot episode on DVD. The network repeated this promotion for its second season promotion, when it teamed with HouseParty.com to send out 1,000 \"Party Kits\", which contained advance copies of the Season 2 opener along with other promotional material.\r\nNBC also paired with Toyota to create the \"Hometown Sweepstakes\", in which students could earn cash grants of up to $50,000 for their school's athletics program. It was open to high school students ages 14 to 18 and was designed to draw people to the show's official website, where they could download AOL Instant Messenger icons, screensavers and desktop wallpaper. Students who registered could also download free movie theater passes to special early screenings of the pilot episode. These movie theater screenings took place in 50 cities nationwide and ran until a week before the show premiered on NBC.\r\nIn the later part of the season, NBC chose to switch course and pursue the female demographic. The network designed a strategy based on the personal elements of the show, giving the show the tagline, \"It’s about life\". NBC Marketing President Vince Manze stressed that the goal was to assure viewers that the show was family and relationships as well as athletics. The network ran 30-second spots in movie theaters that featured cast members and fans being interviewed about the show.\r\nCast and characters\r\nAs a show about the community of Dillon, Texas, Friday Night Lights has an ensemble cast. The show features Panthers' football coach Eric Taylor (Kyle Chandler), who strives to balance his work, family, status in a sometimes confrontational community and his personal ambitions. His family – wife Tami Taylor (Connie Britton), a guidance counselor turned principal at Dillon High, and teenage daughter Julie Taylor (Aimee Teegarden) – are also central to the show. Coach Taylor and Tami are the only two characters to appear in every episode.\r\nOutside of the Taylor family, the show explores the lives of the Dillon high school football players. In the pilot, Coach Taylor's protege and star quarterback Jason Street (Scott Porter) suffers an in-game spinal injury that ends his football career. He faces life as a paraplegic. At first, Street struggles with these disabilities and the upturn of his life. Gradually, he copes with his new reality. Lyla Garrity (Minka Kelly), his girlfriend, undergoes her own changes, making a transition from a Panthers cheerleader to a Christian youth leader.\r\nBecause of Street's injury, sophomore Matt Saracen (Zach Gilford), who is quiet and reserved, becomes the Panthers' starting quarterback. He eventually dates the coach's daughter, Julie. Saracen's father is deployed in Iraq, so he is the sole caretaker for his grandmother Lorraine Saracen (Louanne Stephens). Saracen receives little help, except from his best friend Landry Clarke (Jesse Plemons). Star running back Brian \"Smash\" Williams (Gaius Charles) works to get a college football scholarship. Fullback Tim Riggins (Taylor Kitsch) struggles with alcoholism and complicated family problems. His older brother Billy Riggins (Derek Phillips), while not his legal guardian, serves as Tim's caretaker. Tyra Collette (Adrianne Palicki) stars as a town vixen who wants to leave Dillon for a better life. Involved with Riggins, Tyra eventually develops a complicated relationship with Landry Clarke.\r\nThe fourth and fifth seasons shift focus to the East Dillon Lions, now coached by Eric Taylor. The fourth season introduces several new characters, including Vince Howard (Michael B. Jordan), a talented athlete who has never played football before, but he rises to stardom as the team's quarterback. Luke Cafferty (Matt Lauria) is a running back and is romantically with Becky Sproles (Madison Burge), a beauty-queen hopeful who has complicated family issues; Becky also develops a deep relationship with Riggins. Jess Merriweather (Jurnee Smollett), an East Dillon student who works at her father's restaurant and cares for her three younger brothers; she briefly dates Landry and has a relationship with Vince; and shows aspirations of being a football coach. Hastings Ruckle (Grey Damon) is introduced in the fifth season, a basketball player turned football player, who serves as a receiver for the Lions.\r\nPlot\r\nSeason one\r\nSeason one revolves around two main events: Coach Eric Taylor beginning as head coach and the injury and paralysis of star quarterback Jason Street in the first game of the season. Coach Taylor's career depends on his ability to get the Dillon Panthers to the state championship, despite the loss of Street. If the team suffers a losing streak, he knows his family will no longer be welcome in Dillon.\r\nHis wife Tami Taylor begins work as a guidance counselor at the local high school. Over the course of the season, she becomes a support and a mentor to many of the students, and her position plays a pivotal role in the season finale.\r\nJason Street and Matt Saracen each struggle within extremely difficult conditions. Street must learn to live with his disability in a town that worships athletics. Saracen has to face new challenges as a lead athlete. As Street's friendship with Herc, his rehab roommate and wheelchair rugby teammate, grows stronger, so do his will and independence. For the quiet Matt, who seldom plays football, his new role of QB1 calls for a different part of him. Motherless, he also cares for his grandmother while his father is fighting in Iraq. Matt falls in love with Coach Taylor's daughter, Julie, who loathes Texas small-town life and dislikes football. She falls for Matt and their relationship slowly blossoms over the season.\r\nAlso explored is the pressure on the cocky, driven Brian \"Smash\" Williams. Easily the most promising player on the Panthers' roster, he works hard to achieve excellence and sees his future career as instrumental in gaining a better life for him and his family. Since his father was killed in a car accident, his mother Corrina has taken multiple jobs to keep the family afloat. Smash decides to take performance-enhancing drugs to ensure he can gain a college football scholarship.\r\nTim Riggins is struggling with alcoholism and absentee parents, with few prospects beyond high school. He is portrayed as a loyal friend with a good heart.\r\nTyra Collette also comes from a broken home; her mother suffers abusive relationships with men. Tyra begins the season as Riggins’ girlfriend. Thanks to counselor Tami Taylor and Landry Clarke – the school math geek and Saracen's best friend – Tyra starts to see hope that she might get out of Dillon and break the cycle of women in her family.\r\nMeanwhile, Lyla Garrity undergoes significant changes. Faced with Jason's injury, she begins seeing Riggins for some comfort. Jason begins growing closer to another woman. Lyla learns about her father's many adulterous affairs and begins to establish her independence.\r\nSeason two\r\nSeason two begins with Coach Taylor living and working in Austin as an assistant coach at fictional TMU, while wife Tami remains in Dillon with daughter Julie and newborn baby Gracie. The Panthers' new coach, Bill McGregor, creates friction between Smash and Matt by showing blatant favoritism to Smash and alienates many members of the football community. Buddy engineers the firing of the new coach and persuades Taylor to return.\r\nJulie ends her romantic relationship with Matt and pursues an older man, \"the Swede,\" who works with her as a lifeguard at the local pool. When she finds the Swede has no interest in a serious relationship, she begins a friendship with a young teacher that her mother feels is inappropriate.\r\nTim is kicked off the team after missing a week of practice to go with Jason Street to Mexico. On returning to Dillon, Tim finds that a neighbor woman, with whom he had a brief affair, is now seeing his brother Billy and has all but moved into their house. Coach Taylor allows Tim to rejoin the team after he apologizes to everyone on the team for his lack of commitment.\r\nLyla Garrity becomes increasingly involved in an organization for young Christians. As part of a religious outreach program, she and her father Buddy take in a young convict, Santiago Herrera, who is released from juvenile detention.\r\nSmash accepts a scholarship to the prestigious TMU. However, Smash punches a white teenager who sexually harasses his sister when they're at the movies. This turns into a blown-out-of-proportion racial incident, and Smash is deemed someone who has \"character issues\". His scholarship to TMU is revoked. He later commits to Whitmore University, a smaller historically black college that is more highly regarded for its academics than its athletic programs.\r\nLandry kills and hides the body of a man who attempted to rape Tyra, leading to a romance between the two. Eventually, guilt builds within Landry and he confesses. Charges are not pressed, although tension between him and Tyra remains. Landry also joins the football team.\r\nJason Street impregnates a woman in what was supposed to be a one-night stand at the end of season two. Jason pleads with the woman to keep the child and promises to take care of the two.\r\nSeason three\r\nThe season began with Coach Taylor failing to lead the Panthers to another State championship the year before, creating new pressure for him. Quarterback Matt Saracen's position is threatened by the arrival of freshman J.D. McCoy, an amazing natural talent who comes from a rich family with an overbearing father, Joe. Matt moves to wide receiver after Taylor names J.D. starting quarterback. Tyra starts dating a cowboy named Cash, leading to complications in her relationship with Landry. Tim and Lyla start dating. Tami Taylor becomes the principal of Dillon High School and fights with Buddy Garrity about the allocation of funds toward a Jumbotron.\r\nSmash Williams, who injured his knee during the previous year's playoffs, rediscovers his love for the game. Billy, Tim, Herc, and Jason decide to flip Buddy Garrity's house for a profit. Matt and Julie reconcile and rekindle their romance. Smash gets a tryout with Texas A&M, and succeeds in winning a spot on their team. Lyla helps Tim pursue a college football scholarship. Tim initially puts off the recruiter and is concerned Lyla is trying to turn him into someone he's not by encouraging him to pursue college, but he sees she's looking out for his best interests. Buddy loses money, which is Lyla's college fund, in a bad business deal and he retaliates by trashing the strip club, The Landing Strip. Lyla wants to attend Vanderbilt University and after Buddy loses the money, she considers going to San Antonio State University, the school that gives Tim a scholarship. Lyla moves in with Tim after she and her father have a fight. Billy Riggins gets engaged to Tyra's older sister Mindy. Mindy is pregnant at the time of their engagement. Jason Street eventually finds a job at a sports agency in New York City, after visiting a former Panthers player who is now playing professionally, and moves to the northeast to be close to his girlfriend and newborn baby.\r\nMatt is pushed back into his former football role in the playoffs. While Eric Taylor and Buddy Garrity were making a visit to a possible recruit who just moved into town, the coach learns of a plot to have him replaced as head coach of the Dillon Panthers. They learn that Joe McCoy wants Taylor replaced with Wade Aikmen, J.D.'s personal coach. After the school's administration meets to decide who gets the coaching job, Aikmen is offered the job at Dillon High School, while Taylor is offered the job of coaching at recently reopened East Dillon High School. Billy and Mindy's wedding ends the season.\r\nSeason four\r\nSeason 4 kicks off with Eric Taylor struggling as coach at the underprivileged and underfunded East Dillon High. His new recruits include Vince Howard (Michael B. Jordan), a student who has gotten in trouble with the law too many times, and prodigy running back, Luke Cafferty. Cafferty was forced to transfer from West Dillon High after his address was found to be fraudulent. As principal of West Dillon, Tami receives a good deal of criticism for forcing the transfer.\r\nA new character, Becky, is introduced when Tim Riggins rents a trailer on her mother's property. Becky becomes pregnant by Luke and decides to get an abortion. Parents find out about this and seek Mrs. Taylor's dismissal as principal. When Tami refuses to apologize, she is put on leave and goes to work as a guidance counselor at East Dillon.\r\nMatt Saracen is studying art at the local technical college and interning with a local artist. After returning from a hunting trip with Tim Riggins, he finds out that his father was killed in Iraq. Matt abruptly moves to Chicago without saying goodbye to his girlfriend or his best friend. He returns briefly in the finale and makes amends with both Julie and Landry.\r\nThe character of Tim Riggins has developed over time from an unfocused and moody alcoholic into a young man of character and dependability. In this season, his brother again entices Tim into another wrong choice by convincing Tim that the only way they can make any money is by transforming their newly opened garage into a chop shop. Just as they finally end this side business and Tim has enough for the down payment on a large amount of land he's been dreaming about, the police show up to arrest him at the garage. The police officers recognize Tim as \"number 33\", giving Tim no chance to deny that it's his chop shop. he makes the decision to take the rap and allows his brother to be with his new wife and child. The season ends as Tim walks toward the jail.\r\nSeason five\r\nThe final season opens with summer wrapping up in Dillon. Billy Riggins joins Coach Taylor as a special teams coach for the East Dillon Lions. Tami is faced with the challenge of a difficult student named Epyck. Landry is departing for Rice University, and Tim Riggins has three more months in jail. Becky experiences turmoil in her living situation and moves in with Billy and Mindy and develops a family of her own with them, while also developing a closer relationship with Luke. Eric Taylor has strong hopes for the team to go to state. Vince's troubles cause his relationship with Jess to take a hit. Buddy Garrity becomes a father again when Buddy Jr. is sent back to Dillon to get help from his father.\r\nJulie's college experience is nothing like she imagined, and she is forced to take a good look at what she wants. Julie looks for support first from her parents, and then from her old boyfriend Matt Saracen, who is living in Chicago and attending art school. In the end, she moves in with him and they get engaged.\r\nTim is approved for early release. Buddy gives him a job as a bartender at his bar. Tim is angry with his brother Billy and threatens to move to Alaska to work on a pipeline but Tyra Collette comes back for a visit to Dillon and tells him he needs to repair his relationship with Billy.\r\nIn the last episode, East Dillon wins the state championship. Coach Taylor moves with his wife to Philadelphia as she accepts the job as Dean of Admissions at a prestigious school. Tim and Tyra talk about their dreams and a potential future at his new home site. Vince is the quarterback of the Dillon Panthers \"Superteam\", consisting of both East and West Dillon High School athletes, joined by Buddy Jr., Tinker, and possibly Hastings. Jess is living in Dallas, and helping to student coach a team and is following her dreams. Billy is expecting twins with Mindy. Luke Cafferty is seen with Becky at the bus depot departing for the Army. The series ends with Eric coaching a new high school team in Philadelphia.\r\nReception\r\nCritical response\r\nAlthough the series never had a high viewership, it was met with critical acclaim and has a strong fan-base. On the review aggregator website Metacritic, the first season received a score of 78 out of 100, based on 32 reviews. Virginia Heffernan wrote for The New York Times that \"if the season is anything like the pilot, this new drama about high school football could be great – and not just television great, but great in the way of a poem or painting.\" The Washington Post similarly praised the series as \"extraordinary in just about every conceivable way.\" Bill Simmons, a former columnist for ESPN Magazine implored readers of his column in the September 24, 2007 issue to watch the show, calling it \"the greatest sports-related show ever made.\" Positive reviews also came from USA Today, the San Francisco Chronicle, and international sources, with The Guardian's Jonathan Bernstien calling the pilot \"beautifully shot\" and the Metro awarding it 4 out of 5 stars.\r\nThroughout its inaugural season, many online journalists responded positively to the show. Matt Roush of TV Guide dedicated several of his \"Roush Dispatch\" columns to the show calling the last episodes of season one \"terrifically entertaining\" while Zap2it's Amy Amatangelo asked her readers to \"promise to watch Friday Night Lights.\" The show's pilot did, however, receive negative reviews as well. The Philadelphia Inquirer's review was particularly harsh, calling the show a \"standard high school sports soap opera.\"\r\nSeason two reviews were considerably less positive than for the first, with the Landry and Tyra murder plot being particularly panned by critics. The Los Angeles Times said that the show had lost its innocence, while The Boston Globe said the event was \"out of sync with the real-life tone of the show.\" Others were more positive, though, with Variety saying \"faith should be shown in showrunner/writer Jason Katims\" while The New York Times said \"to hold Friday Night Lights to a measure of realism would be to miss what are its essentially expressionistic pleasures.\"\r\nTime Out magazine's Andrew Johnston included the series in his list of the ten best TV shows for both 2006 and 2007, stating \"Who'd have thought a tribute to heartland values would turn out to be the most avant-garde show on TV? The music and random close-ups said more than the dialogue in Peter Berg's phenomenal football drama.\" Time magazine's James Poniewozik named it one of the Top 10 Returning Series of 2007, ranking it at No. 4. In 2007, AOL ranked Friday Night Lights the fifth Best School Show of All Time. The same year, the show placed No. 71 on Entertainment Weekly's \"New TV Classics\" list. In 2009, Alan Sepinwall placed it in his \"Best of the '00s in TV: Best Dramas\" and wrote: \"Few shows are as willing to so directly confront the emotions of its characters, aided by central performances — as one of TV’s most realistic and loving couples — from Chandler and Connie Britton.\" The A.V. Club named it the 16th best TV series of the 2000s. In 2010, Kristin Dos Santos of E! Online ranked it number 4 on her list, \"Top 20 TV Series of the Past 20 Years\".\r\nFriday Night Lights's final season was lauded by critics. Based on 10 reviews, the season obtained a score of 82 out of 100 on Metacritic, indicating \"universal acclaim\" and it was included on numerous best lists. Poniewozik ranked it No. 7 on his list of 2011's Top 10 TV Series, saying, \"The final season of this drama came down, as you would expect, to a final dramatic game. But the real action was always just as much in the stands\". He also ranked the final episode \"Always\" No. 1 on 2011's Top 10 TV Episodes list. Paste also named it one of the 20 best TV shows of 2011 and Slant Magazine ranked Friday Night Lights No. 10 on its list of 2011's 25 Best TV Shows, concluding \"The show's true concerns—obsession, class, family—were articulated beautifully as ever in the quiet, familiar relationships between a town and its team, and a coach and his wife\". The Salt Lake Tribune in its list of the Top 10 series of 2011 ranked Friday Night Lights No. 1 explaining \"For five seasons, Friday Night Lights was both the simplest and most complex show on TV. It felt like real life, and real life is complicated.\" TV Guide named the show among its Best TV Shows of 2011 praising the fact that \"Friday Night Lights left its fans with the best portrait of a marriage ever on TV\". It was also included on The Huffington Post's and E! Online's 2011's Best TV Shows.\r\nIn 2013, the Writers Guild of America ranked Friday Night Lights No. 22 in its of the \"101 Best Written TV Series of All Time\".\r\nAwards and accolades\r\nFriday Night Lights won a Peabody Award, three AFI awards, an Emmy Award for Outstanding Casting for a Drama Series, an ACE Eddie Award for editing, an NAACP Image Award for Outstanding Directing, a Television Critics Association Award, and has earned multiple Writers Guild of America nominations. The show's two leading actors, Kyle Chandler and Connie Britton, received Emmy nominations for their performances in 2010, while executive producer Jason Katims won two Humanitas Prize awards for writing.\r\nIn 2011, after concluding its run, the show was honored by four Emmy nominations and Kyle Chandler won the award for Outstanding Lead Actor in a Drama Series and Jason Katims won for Outstanding Writing for a Drama Series for \"Always\".\r\nFan base\r\nFriday Night Lights enjoys what former NBC President Kevin Reilly called a \"passionate and vocal\". This fan dedication has shown itself in everything from advertisers expressing their support for the show to news outlets getting massive amounts of support mail after running positive pieces about the show.\r\nAfter some statements made by NBC's Entertainment head Ben Silverman about the future of the show and the fact that everything seemed to point that Friday Night Lights wouldn't return after the writers' strike, fans put together several campaigns. Save FNL Campaign raised money to send footballs and contributions to charity foundations that were related to the show. The Save FNL Campaign raised a total of $15,840 for 18,750 footballs, $2061 for charity, and $924 worth of DVDs for troops stationed overseas.\r\nTelevision ratings\r\nU.S. ratings\r\nThough it was critically acclaimed, Friday Night Lights never enjoyed high ratings. The first two seasons averaged roughly 6 million viewers each. Ratings dropped in subsequent seasons with the third season averaging 4.6 million viewers, the fourth season with 3.8 million, and fifth season with 3.6 million.\r\nInternational ratings\r\nThe show's pilot, which aired on February 21, 2007, on ITV4, was watched by 26,000 viewers in the UK. This was attributed to the program being aired opposite of the Barcelona–Liverpool football game in the first knockout round of the 2006–07 UEFA Champions League.\r\nDVR ratings\r\nOn December 29, 2006 Nielsen Media Research reported the results of having, for the first time, monitored viewers who use a Digital Video Recorder to record shows for later viewing. These ratings, called \"live plus seven\", include all viewers who use a DVR to record the show and then watch it within a week of its initial airing.\r\nAccording to the Nielsen numbers, DVR viewers increased Friday Night Lights ratings by 7.5% overall in December. When Nielsen monitored viewers again in April 2007 the increase went up to 17% for the week ending on April 8.\r\nAffluent viewers\r\nOn March 5, 2007, Media Life Magazine reported that Friday Night Lights was one of the most popular shows among \"affluent viewers\" who had little experience playing football. This was determined using a report from Magna Global who in turn used analysis done by Nielsen Media Research. Affluence in the study was determined by yearly income.\r\nIn the study, Friday Night Lights tied for the 11th most watched show by affluent viewers. According to the study viewers of the show have a median household income of $65,000 per year.\r\nDistribution\r\nOnline episodes\r\nStreaming videos, such as cast interviews and the full episode from the previous week, have been available on NBC.com since the series’ inception. In December 2006, NBC expanded this selection to include every episode of the season. The move to offer every episode was made for only a few select shows and represents a marketing push on NBC's part.\r\nIn addition to the free ad-support offerings, every episode of Friday Night Lights became available for download on the iTunes Store on February 10, 2007, for $1.99 per episode. As a special promotion, the pilot was initially offered as a free download. The series was available on Netflix through October 1, 2017. The series returned to Netflix in the United States on August 1, 2021.\r\nSyndication\r\nABC Family acquired syndication rights for the first four seasons and began airing reruns September 6, 2010, but it was pulled on October 18, 2010, due to low ratings. In July 2011, it was announced that ESPN Classic had acquired the rights of all five seasons and started airing the series beginning on July 12, 2011.\r\nIn an attempt to bolster series ratings, NBC repositioned reruns of the show to air on its sister network Bravo, during the weeks leading up to the season one finale on NBC. These episodes aired on a schedule of one hour every Friday and three hours every Saturday. Bravo is known to have an audience that is upscale and largely female, which is in line with the new strategy of NBC's then-President Kevin Reilly (now at FOX) for selling the show. When questioned about this strategy, he admitted to having regrets about initially marketing the show incorrectly, saying: \"It’s been so clear to me that the show ended up confusing people in terms of what it was supposed to be\". He said he felt the show is, at its core, a \"women's show\", and his wish is that the marketing had reflected that to a greater extent.\r\nOnce the 2006–2007 television season ended, NBC planned to air reruns throughout the summer in the hopes of gaining new viewers during the summer hiatus. Despite rising ratings for the reruns, NBC abruptly pulled them from the network's schedule on June 24, 2007. NBC resumed airing reruns in late August/early September, timed to the Season 1 DVD release.\r\nTeenNick acquired the rights in 2015 and began airing the series, in chronological order, on April 10, 2015, with a week-long event in which three episodes aired nightly.\r\nDirecTV\r\nDuring the 2007–08 Writers Guild of America strike, NBC Universal's decision to release the Season 2 DVD with only the 15 produced episodes and comments by NBC chief Ben Silverman led to speculation that the show would be canceled.\r\nIn March 2008, it was confirmed that NBC had picked up the series for a third season, after a cost-sharing partnership between NBC and DirecTV was struck. The agreement had first run episodes airing exclusively on DirecTV, and the episodes aired on NBC at a later date. Season 3 premiered exclusively on DirecTV channel 101, with the episodes replaying on NBC beginning on January 16, 2009. In March 2009, NBC announced it had renewed the series for two more seasons.\r\nHome media releases\r\nDVD and Blu-ray\r\nThe first season was released on DVD in region 1 on August 28, 2007, and in region 2 on October 29, 2007. Special features include deleted scenes from several episodes and a featurette titled \"Behind The Lights: Creating The First Season of Friday Night Lights\".\r\nThe second season was released on DVD in region 1 on April 22, 2008, and in region 2 on February 11, 2013. Special features include deleted scenes from several episodes, audio commentaries for \"Last Days of Summer\", \"Are You Ready for Friday Night\" and \"There Goes the Neighborhood\" and a featurette titled \"Friday Night Lights Cast & Producers at the Paley Festival in L.A.\".\r\nThe third season was released on DVD in region 1 on May 19, 2009, and in region 2 on March 25, 2013. Special features include deleted scenes from various episode and an audio commentary for \"Tomorrow Blues\".\r\nThe fourth season was released on DVD in region 1 on August 17, 2010, and in region 2 on May 20, 2013. Special features include deleted scenes from various episodes, audio commentary for \"East of Dillon\", and several behind-the-scenes featurettes.\r\nThe fifth season was released on DVD in region 1 on April 5, 2011, and in region 2 on August 12, 2013. Special features include deleted scenes from several episodes, audio commentaries for \"Don't Go\" and \"Always\", a featurette titled \"The Lights Go Out\", and a photo gallery.\r\nA complete series box set containing all the episodes and material from the individual season sets was released in region 1 on October 4, 2011.\r\nIn March 2016, it was announced that Mill Creek Entertainment had acquired the rights to the series in region 1; they subsequently re-released the first two seasons on DVD on September 6, 2016. On September 26, 2017, Mill Creek Entertainment re-released the complete series on DVD and also released the complete series on Blu-ray for the first time; however, these releases lacked the previously included special features.\r\nSoundtracks\r\nTwo soundtracks with music featured on the show were released. The first, Friday Night Lights, was released in 2007, and included music from The Killers, OutKast, and Explosions in the Sky, who had produced the score for the film. The second soundtrack, Friday Night Lights Vol. 2, was released in 2010, and included the main \"Friday Night Lights Theme\" by W. G. Walden. The score for both the film and television show, along with all background music and all instrumental music is performed by Explosions in the Sky.\r\nCancelled film sequel\r\nIn July 2011, it was revealed that creator and executive producer Peter Berg was interested in continuing the series, as a feature film. In August 2011, Berg said at a Television Critics Association panel that the Friday Night Lights film is in development. Berg said, \"We're very serious about trying to do it\", adding that the script was being written. Universal Pictures and Imagine Television would produce the film, with Kyle Chandler and Connie Britton set to return. In May 2013, executive producer Brian Grazer confirmed the film was continuing to be developed. In December 2013, Berg confirmed that a film would not be moving forward.",
    "html": "<p>Friday Night Lights is an American sports drama television series developed by Peter Berg and inspired by the 1990 nonfiction book by H. G. Bissinger, which was adapted as the 2004 film of the same name by Berg. Executive producers were Brian Grazer, David Nevins, Sarah Aubrey and Jason Katims who also served as showrunner. The series follows a high school football team in the fictional town of Dillon, a small, close-knit community in rural West Texas. It features an ensemble cast led by Kyle Chandler and Connie Britton, portraying high school football coach Eric Taylor and his wife Tami Taylor, a school faculty member. The primary cast includes characters associated with football and high school. The show uses its small-town backdrop to address many issues in contemporary American culture like family values, school funding, racism, substance use, abortion and lack of economic opportunities.</p><p>Friday Night Lights premiered on October 3, 2006. It aired for two seasons on NBC. In May 2007, the series was renewed for a second season to consist of 19 episodes, but due to the writers' strike, it was shortened to 15 episodes. Although the show had garnered critical acclaim and passionate fans, the series suffered low ratings and was in danger of cancellation after the second season. To save the series, NBC struck a deal with DirecTV to co-produce three more seasons; each subsequent season premiered on DirecTV's 101 Network, with NBC rebroadcasts a few months later. The series ended its run on The 101 Network on February 9, 2011, after five seasons.</p><p>Though Friday Night Lights never garnered a sizable audience, it was a critical success, lauded for its realistic portrayal of Middle America and deep exploration of its central characters. The show appeared on a number of best lists and was awarded a Peabody Award, a Humanitas Prize, a Television Critics Association Award and several technical Primetime Emmy Awards. At the 2011 Primetime Emmy Awards, the show was nominated for Outstanding Drama Series. Kyle Chandler and Connie Britton also scored multiple nominations for the Outstanding Lead Actor and Actress awards for a drama series. Executive producer Jason Katims was nominated for Outstanding Writing for a Drama Series. Chandler and Katims each won the Emmy in 2011.</p><br/><h3>Background</h3><h4>Inspiration</h4><p>Friday Night Lights was inspired by H.G. \"Buzz\" Bissinger's non-fiction book Friday Night Lights: A Town, a Team, and a Dream (1990) and the 2004 film based on it. The book, which explores the 1988 season of the Permian Panthers, a high school football team in Odessa, Texas, was a factual work of documentary journalism. The people featured were not renamed in the book. The Universal Pictures film, which stars Billy Bob Thornton and was directed by Peter Berg, Bissinger's second cousin, based its characters on the residents of Odessa, c. 1988.</p><h4>Conception</h4><p>Once filming on the movie was completed, Berg began to explore adapting the story for television. Berg later said he had regretted having to jettison many of the interpersonal topics from the book because of the time constraints of a feature film. Creating a TV series, particularly one based on fictional characters, allowed him to address many of those elements in-depth.</p><p>He decided to set the series in a fictional town of Dillon, Texas, with some characteristics of Odessa. The football team was given the Panthers name. Berg deliberately carried elements from the film to the series, particularly for the pilot, which was closely related to the film. He cast Connie Britton as the wife of head coach Eric Taylor, and Brad Leland as Buddy Garrity, a major businessman and football booster, in roles similar to those they played in the film.</p><br/><h3>Production</h3><p>Filming for the show's pilot began in February 2006 in Austin, Texas. Berg said he required filming the pilot and eventually the show in Texas as \"a deal breaker\" in order to agree to participate weekly in the project. The show features homages to its Texas heritage. In the pilot, Berg featured former Texas Longhorns football coach Mack Brown as a Dillon booster and had a caller to the fictional Panther Radio compare Panthers' coach Eric Taylor to Brown. The pilot referred to much of the surrounding area in its scenes. Football scenes were filmed at Pflugerville High School's Kuempel Stadium and at the RRISD Complex. The Dillon Panther football team and coaches' uniforms were based on the uniforms of the Pflugerville Panthers. Some of the scenes were filmed at Texas School for the Deaf.</p><p>Berg's observation of local high school students while preparing to film the movie inspired his development of some of the characters. For example, Jason Street, the character whose promising football career is ended by a spinal injury in the pilot, was inspired by a local event. David Edwards, a football player from San Antonio’s Madison High, was paralyzed during a November 2003 game. Berg was at the game when this accident occurred; he was profoundly affected by Edwards' injury and how it overturned his life. Berg set up a similar incident in the pilot.</p><h4>Performances</h4><p>While relying on a script each week, the producers decided at the outset to allow the cast leeway in what they said and did on the show. Their decisions could affect the delivery of their lines and the blocking of each scene. If the actors felt that something was untrue to their character or a mode of delivery didn't work, they were free to change it, provided they still hit the vital plot points.</p><p>This freedom was complemented by filming without rehearsal and without extensive blocking. Camera operators were trained to follow the actors, rather than having the actors stand in one place with cameras fixed around them. The actors knew that the filming would work around them. Executive producer Jeffrey Reiner described this method as \"no rehearsal, no blocking, just three cameras and we shoot.\"</p><p>Working in this fashion profoundly influenced everyone involved with the show. Series star Kyle Chandler said: \"When I look back at my life, I'm going to say, 'Wow, Peter Berg really changed my life.'\" Executive producer and head writer Jason Katims echoed this sentiment, saying: \"When I first came on set, I thought, it’s interesting – this is what I imagined filmmaking would be, before I saw what filmmaking was.\"</p><h4>Filming</h4><p>All five seasons of Friday Night Lights were filmed in Austin and Pflugerville. With the show yielding roughly $33 million a year in revenue, other states courted the production company after the state of Texas failed to pay all the rebates it had promised to the show's producers. The Texas legislature authorized funding to match the offers of other states, and the production company preferred to stay near Austin, so the show remained in Texas.</p><p>Friday Night Lights is unusual for using actual locations rather than stage sets and sound stage. These factors together with reliance on filming hundreds of locals as extras, gives the series an authentic feel and look.</p><p>The producers used a cinéma vérité (documentary-style) filming technique. Three cameras were used for each shoot and entire scenes were shot in one take. In contrast, most productions film a scene from each angle and typically repeat the scene several times while readjusting lighting to accommodate each shot. The first takes usually made the final cut. By filming a scene all at once, the producers tried to create an environment for the actors that was more organic and allowed for the best performances.</p><p>The series borrowed the uniforms, cheerleaders, fans and stadium of the Pflugerville Panthers. Producers shot Pflugerville games and used them as game footage in the series. University of Southern California football announcers Pete Arbogast and Paul McDonald provided off-screen commentary during the football game sequences. The facilities, colors and bobcat logos of Texas State University in San Marcos were used as the setting and creative inspiration for the fictional Texas Methodist University. The show features the fictional Herrmann Field, named for George Herrmann, the head coach of the Pflugerville Panthers.</p><p>Some scenes were filmed outside Texas. On June 20, 2010, scenes were filmed at Temple University, which was to portray the fictional Braemore College. An episode from Julie's senior year in high school was filmed in the Boston area, at Boston College, Boston University, and Tufts University.</p><p>Some scenes at fictional Oklahoma Tech University were filmed at Gregory Gym at The University of Texas at Austin.</p><h4>Marketing</h4><p>Initially targeted at the youth market, the show emphasized the football element. NBC teamed with social networking site Bebo to create a site that allowed students to upload video and photos, as well as create blogs about their local football teams. Students who participated were eligible for one of 10 $5,000 scholarships. NBC had negotiated with Bebo for network and series promotion on Bebo's network of youth-oriented sites including Piczo, Hi5, Tickle, Ringo, and FastWeb.</p><p>To complement this promotion, NBC sent out \"School Spirit\" kits to 1,000 high schools around the country. These kits included posters, pom-poms, mini-footballs and disposable cameras, all bearing the show's logo. The kits also contained copies of the show's pilot episode on DVD. The network repeated this promotion for its second season promotion, when it teamed with HouseParty.com to send out 1,000 \"Party Kits\", which contained advance copies of the Season 2 opener along with other promotional material.</p><p>NBC also paired with Toyota to create the \"Hometown Sweepstakes\", in which students could earn cash grants of up to $50,000 for their school's athletics program. It was open to high school students ages 14 to 18 and was designed to draw people to the show's official website, where they could download AOL Instant Messenger icons, screensavers and desktop wallpaper. Students who registered could also download free movie theater passes to special early screenings of the pilot episode. These movie theater screenings took place in 50 cities nationwide and ran until a week before the show premiered on NBC.</p><p>In the later part of the season, NBC chose to switch course and pursue the female demographic. The network designed a strategy based on the personal elements of the show, giving the show the tagline, \"It’s about life\". NBC Marketing President Vince Manze stressed that the goal was to assure viewers that the show was family and relationships as well as athletics. The network ran 30-second spots in movie theaters that featured cast members and fans being interviewed about the show.</p><br/><h3>Cast and characters</h3><p>As a show about the community of Dillon, Texas, Friday Night Lights has an ensemble cast. The show features Panthers' football coach Eric Taylor (Kyle Chandler), who strives to balance his work, family, status in a sometimes confrontational community and his personal ambitions. His family – wife Tami Taylor (Connie Britton), a guidance counselor turned principal at Dillon High, and teenage daughter Julie Taylor (Aimee Teegarden) – are also central to the show. Coach Taylor and Tami are the only two characters to appear in every episode.</p><p>Outside of the Taylor family, the show explores the lives of the Dillon high school football players. In the pilot, Coach Taylor's protege and star quarterback Jason Street (Scott Porter) suffers an in-game spinal injury that ends his football career. He faces life as a paraplegic. At first, Street struggles with these disabilities and the upturn of his life. Gradually, he copes with his new reality. Lyla Garrity (Minka Kelly), his girlfriend, undergoes her own changes, making a transition from a Panthers cheerleader to a Christian youth leader.</p><p>Because of Street's injury, sophomore Matt Saracen (Zach Gilford), who is quiet and reserved, becomes the Panthers' starting quarterback. He eventually dates the coach's daughter, Julie. Saracen's father is deployed in Iraq, so he is the sole caretaker for his grandmother Lorraine Saracen (Louanne Stephens). Saracen receives little help, except from his best friend Landry Clarke (Jesse Plemons). Star running back Brian \"Smash\" Williams (Gaius Charles) works to get a college football scholarship. Fullback Tim Riggins (Taylor Kitsch) struggles with alcoholism and complicated family problems. His older brother Billy Riggins (Derek Phillips), while not his legal guardian, serves as Tim's caretaker. Tyra Collette (Adrianne Palicki) stars as a town vixen who wants to leave Dillon for a better life. Involved with Riggins, Tyra eventually develops a complicated relationship with Landry Clarke.</p><p>The fourth and fifth seasons shift focus to the East Dillon Lions, now coached by Eric Taylor. The fourth season introduces several new characters, including Vince Howard (Michael B. Jordan), a talented athlete who has never played football before, but he rises to stardom as the team's quarterback. Luke Cafferty (Matt Lauria) is a running back and is romantically with Becky Sproles (Madison Burge), a beauty-queen hopeful who has complicated family issues; Becky also develops a deep relationship with Riggins. Jess Merriweather (Jurnee Smollett), an East Dillon student who works at her father's restaurant and cares for her three younger brothers; she briefly dates Landry and has a relationship with Vince; and shows aspirations of being a football coach. Hastings Ruckle (Grey Damon) is introduced in the fifth season, a basketball player turned football player, who serves as a receiver for the Lions.</p><br/><h3>Plot</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"3\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th><th scope=\"col\" style=\"padding:0 8px\">Network</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">22</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 3, 2006</td><td style=\"padding:0 8px\">April 11, 2007</td><td rowspan=\"2\"><span>NBC</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">15</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 5, 2007</td><td style=\"padding:0 8px\">February 8, 2008</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 1, 2008</td><td style=\"padding:0 8px\">January 14, 2009</td><td rowspan=\"3\"><span class=\"mw-redirect\">DirecTV</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 28, 2009</td><td style=\"padding:0 8px\">February 10, 2010</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 27, 2010</td><td style=\"padding:0 8px\">February 9, 2011</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section's plot summaries <b>may be <span>too long or excessively detailed</span>.</b><span class=\"hide-when-compact\"> Please <span class=\"external text\">help improve them</span> by removing unnecessary details and making them more concise.</span>  <span class=\"date-container\"><i>(<span class=\"date\">November 2017</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><h4>Season one</h4><p>Season one revolves around two main events: Coach Eric Taylor beginning as head coach and the injury and paralysis of star quarterback Jason Street in the first game of the season. Coach Taylor's career depends on his ability to get the Dillon Panthers to the state championship, despite the loss of Street. If the team suffers a losing streak, he knows his family will no longer be welcome in Dillon.</p><p>His wife Tami Taylor begins work as a guidance counselor at the local high school. Over the course of the season, she becomes a support and a mentor to many of the students, and her position plays a pivotal role in the season finale.</p><p>Jason Street and Matt Saracen each struggle within extremely difficult conditions. Street must learn to live with his disability in a town that worships athletics. Saracen has to face new challenges as a lead athlete. As Street's friendship with Herc, his rehab roommate and wheelchair rugby teammate, grows stronger, so do his will and independence. For the quiet Matt, who seldom plays football, his new role of QB1 calls for a different part of him. Motherless, he also cares for his grandmother while his father is fighting in Iraq. Matt falls in love with Coach Taylor's daughter, Julie, who loathes Texas small-town life and dislikes football. She falls for Matt and their relationship slowly blossoms over the season.</p><p>Also explored is the pressure on the cocky, driven Brian \"Smash\" Williams. Easily the most promising player on the Panthers' roster, he works hard to achieve excellence and sees his future career as instrumental in gaining a better life for him and his family. Since his father was killed in a car accident, his mother Corrina has taken multiple jobs to keep the family afloat. Smash decides to take performance-enhancing drugs to ensure he can gain a college football scholarship.</p><p>Tim Riggins is struggling with alcoholism and absentee parents, with few prospects beyond high school. He is portrayed as a loyal friend with a good heart.</p><p>Tyra Collette also comes from a broken home; her mother suffers abusive relationships with men. Tyra begins the season as Riggins’ girlfriend. Thanks to counselor Tami Taylor and Landry Clarke – the school math geek and Saracen's best friend – Tyra starts to see hope that she might get out of Dillon and break the cycle of women in her family.</p><p>Meanwhile, Lyla Garrity undergoes significant changes. Faced with Jason's injury, she begins seeing Riggins for some comfort. Jason begins growing closer to another woman. Lyla learns about her father's many adulterous affairs and begins to establish her independence.</p><h4>Season two</h4><p>Season two begins with Coach Taylor living and working in Austin as an assistant coach at fictional TMU, while wife Tami remains in Dillon with daughter Julie and newborn baby Gracie. The Panthers' new coach, Bill McGregor, creates friction between Smash and Matt by showing blatant favoritism to Smash and alienates many members of the football community. Buddy engineers the firing of the new coach and persuades Taylor to return.</p><p>Julie ends her romantic relationship with Matt and pursues an older man, \"the Swede,\" who works with her as a lifeguard at the local pool. When she finds the Swede has no interest in a serious relationship, she begins a friendship with a young teacher that her mother feels is inappropriate.</p><p>Tim is kicked off the team after missing a week of practice to go with Jason Street to Mexico. On returning to Dillon, Tim finds that a neighbor woman, with whom he had a brief affair, is now seeing his brother Billy and has all but moved into their house. Coach Taylor allows Tim to rejoin the team after he apologizes to everyone on the team for his lack of commitment.</p><p>Lyla Garrity becomes increasingly involved in an organization for young Christians. As part of a religious outreach program, she and her father Buddy take in a young convict, Santiago Herrera, who is released from juvenile detention.</p><p>Smash accepts a scholarship to the prestigious TMU. However, Smash punches a white teenager who sexually harasses his sister when they're at the movies. This turns into a blown-out-of-proportion racial incident, and Smash is deemed someone who has \"character issues\". His scholarship to TMU is revoked. He later commits to Whitmore University, a smaller historically black college that is more highly regarded for its academics than its athletic programs.</p><p>Landry kills and hides the body of a man who attempted to rape Tyra, leading to a romance between the two. Eventually, guilt builds within Landry and he confesses. Charges are not pressed, although tension between him and Tyra remains. Landry also joins the football team.</p><p>Jason Street impregnates a woman in what was supposed to be a one-night stand at the end of season two. Jason pleads with the woman to keep the child and promises to take care of the two.</p><h4>Season three</h4><p>The season began with Coach Taylor failing to lead the Panthers to another State championship the year before, creating new pressure for him. Quarterback Matt Saracen's position is threatened by the arrival of freshman J.D. McCoy, an amazing natural talent who comes from a rich family with an overbearing father, Joe. Matt moves to wide receiver after Taylor names J.D. starting quarterback. Tyra starts dating a cowboy named Cash, leading to complications in her relationship with Landry. Tim and Lyla start dating. Tami Taylor becomes the principal of Dillon High School and fights with Buddy Garrity about the allocation of funds toward a Jumbotron.</p><p>Smash Williams, who injured his knee during the previous year's playoffs, rediscovers his love for the game. Billy, Tim, Herc, and Jason decide to flip Buddy Garrity's house for a profit. Matt and Julie reconcile and rekindle their romance. Smash gets a tryout with Texas A&M, and succeeds in winning a spot on their team. Lyla helps Tim pursue a college football scholarship. Tim initially puts off the recruiter and is concerned Lyla is trying to turn him into someone he's not by encouraging him to pursue college, but he sees she's looking out for his best interests. Buddy loses money, which is Lyla's college fund, in a bad business deal and he retaliates by trashing the strip club, The Landing Strip. Lyla wants to attend Vanderbilt University and after Buddy loses the money, she considers going to San Antonio State University, the school that gives Tim a scholarship. Lyla moves in with Tim after she and her father have a fight. Billy Riggins gets engaged to Tyra's older sister Mindy. Mindy is pregnant at the time of their engagement. Jason Street eventually finds a job at a sports agency in New York City, after visiting a former Panthers player who is now playing professionally, and moves to the northeast to be close to his girlfriend and newborn baby.</p><p>Matt is pushed back into his former football role in the playoffs. While Eric Taylor and Buddy Garrity were making a visit to a possible recruit who just moved into town, the coach learns of a plot to have him replaced as head coach of the Dillon Panthers. They learn that Joe McCoy wants Taylor replaced with Wade Aikmen, J.D.'s personal coach. After the school's administration meets to decide who gets the coaching job, Aikmen is offered the job at Dillon High School, while Taylor is offered the job of coaching at recently reopened East Dillon High School. Billy and Mindy's wedding ends the season.</p><h4>Season four</h4><p>Season 4 kicks off with Eric Taylor struggling as coach at the underprivileged and underfunded East Dillon High. His new recruits include Vince Howard (Michael B. Jordan), a student who has gotten in trouble with the law too many times, and prodigy running back, Luke Cafferty. Cafferty was forced to transfer from West Dillon High after his address was found to be fraudulent. As principal of West Dillon, Tami receives a good deal of criticism for forcing the transfer.</p><p>A new character, Becky, is introduced when Tim Riggins rents a trailer on her mother's property. Becky becomes pregnant by Luke and decides to get an abortion. Parents find out about this and seek Mrs. Taylor's dismissal as principal. When Tami refuses to apologize, she is put on leave and goes to work as a guidance counselor at East Dillon.</p><p>Matt Saracen is studying art at the local technical college and interning with a local artist. After returning from a hunting trip with Tim Riggins, he finds out that his father was killed in Iraq. Matt abruptly moves to Chicago without saying goodbye to his girlfriend or his best friend. He returns briefly in the finale and makes amends with both Julie and Landry.</p><p>The character of Tim Riggins has developed over time from an unfocused and moody alcoholic into a young man of character and dependability. In this season, his brother again entices Tim into another wrong choice by convincing Tim that the only way they can make any money is by transforming their newly opened garage into a chop shop. Just as they finally end this side business and Tim has enough for the down payment on a large amount of land he's been dreaming about, the police show up to arrest him at the garage. The police officers recognize Tim as \"number 33\", giving Tim no chance to deny that it's his chop shop. he makes the decision to take the rap and allows his brother to be with his new wife and child. The season ends as Tim walks toward the jail.</p><h4>Season five</h4><p>The final season opens with summer wrapping up in Dillon. Billy Riggins joins Coach Taylor as a special teams coach for the East Dillon Lions. Tami is faced with the challenge of a difficult student named Epyck. Landry is departing for Rice University, and Tim Riggins has three more months in jail. Becky experiences turmoil in her living situation and moves in with Billy and Mindy and develops a family of her own with them, while also developing a closer relationship with Luke. Eric Taylor has strong hopes for the team to go to state. Vince's troubles cause his relationship with Jess to take a hit. Buddy Garrity becomes a father again when Buddy Jr. is sent back to Dillon to get help from his father.</p><p>Julie's college experience is nothing like she imagined, and she is forced to take a good look at what she wants. Julie looks for support first from her parents, and then from her old boyfriend Matt Saracen, who is living in Chicago and attending art school. In the end, she moves in with him and they get engaged.</p><p>Tim is approved for early release. Buddy gives him a job as a bartender at his bar. Tim is angry with his brother Billy and threatens to move to Alaska to work on a pipeline but Tyra Collette comes back for a visit to Dillon and tells him he needs to repair his relationship with Billy.</p><p>In the last episode, East Dillon wins the state championship. Coach Taylor moves with his wife to Philadelphia as she accepts the job as Dean of Admissions at a prestigious school. Tim and Tyra talk about their dreams and a potential future at his new home site. Vince is the quarterback of the Dillon Panthers \"Superteam\", consisting of both East and West Dillon High School athletes, joined by Buddy Jr., Tinker, and possibly Hastings. Jess is living in Dallas, and helping to student coach a team and is following her dreams. Billy is expecting twins with Mindy. Luke Cafferty is seen with Becky at the bus depot departing for the Army. The series ends with Eric coaching a new high school team in Philadelphia.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>Although the series never had a high viewership, it was met with critical acclaim and has a strong fan-base. On the review aggregator website Metacritic, the first season received a score of 78 out of 100, based on 32 reviews. Virginia Heffernan wrote for The New York Times that \"if the season is anything like the pilot, this new drama about high school football could be great – and not just television great, but great in the way of a poem or painting.\" The Washington Post similarly praised the series as \"extraordinary in just about every conceivable way.\" Bill Simmons, a former columnist for ESPN Magazine implored readers of his column in the September 24, 2007 issue to watch the show, calling it \"the greatest sports-related show ever made.\" Positive reviews also came from USA Today, the San Francisco Chronicle, and international sources, with The Guardian's Jonathan Bernstien calling the pilot \"beautifully shot\" and the Metro awarding it 4 out of 5 stars.</p><p>Throughout its inaugural season, many online journalists responded positively to the show. Matt Roush of TV Guide dedicated several of his \"Roush Dispatch\" columns to the show calling the last episodes of season one \"terrifically entertaining\" while Zap2it's Amy Amatangelo asked her readers to \"promise to watch Friday Night Lights.\" The show's pilot did, however, receive negative reviews as well. The Philadelphia Inquirer's review was particularly harsh, calling the show a \"standard high school sports soap opera.\"</p><p>Season two reviews were considerably less positive than for the first, with the Landry and Tyra murder plot being particularly panned by critics. The Los Angeles Times said that the show had lost its innocence, while The Boston Globe said the event was \"out of sync with the real-life tone of the show.\" Others were more positive, though, with Variety saying \"faith should be shown in showrunner/writer Jason Katims\" while The New York Times said \"to hold Friday Night Lights to a measure of realism would be to miss what are its essentially expressionistic pleasures.\"</p><p>Time Out magazine's Andrew Johnston included the series in his list of the ten best TV shows for both 2006 and 2007, stating \"Who'd have thought a tribute to heartland values would turn out to be the most avant-garde show on TV? The music and random close-ups said more than the dialogue in Peter Berg's phenomenal football drama.\" Time magazine's James Poniewozik named it one of the Top 10 Returning Series of 2007, ranking it at No. 4. In 2007, AOL ranked Friday Night Lights the fifth Best School Show of All Time. The same year, the show placed No. 71 on Entertainment Weekly's \"New TV Classics\" list. In 2009, Alan Sepinwall placed it in his \"Best of the '00s in TV: Best Dramas\" and wrote: \"Few shows are as willing to so directly confront the emotions of its characters, aided by central performances — as one of TV’s most realistic and loving couples — from Chandler and Connie Britton.\" The A.V. Club named it the 16th best TV series of the 2000s. In 2010, Kristin Dos Santos of E! Online ranked it number 4 on her list, \"Top 20 TV Series of the Past 20 Years\".</p><p>Friday Night Lights's final season was lauded by critics. Based on 10 reviews, the season obtained a score of 82 out of 100 on Metacritic, indicating \"universal acclaim\" and it was included on numerous best lists. Poniewozik ranked it No. 7 on his list of 2011's Top 10 TV Series, saying, \"The final season of this drama came down, as you would expect, to a final dramatic game. But the real action was always just as much in the stands\". He also ranked the final episode \"Always\" No. 1 on 2011's Top 10 TV Episodes list. Paste also named it one of the 20 best TV shows of 2011 and Slant Magazine ranked Friday Night Lights No. 10 on its list of 2011's 25 Best TV Shows, concluding \"The show's true concerns—obsession, class, family—were articulated beautifully as ever in the quiet, familiar relationships between a town and its team, and a coach and his wife\". The Salt Lake Tribune in its list of the Top 10 series of 2011 ranked Friday Night Lights No. 1 explaining \"For five seasons, Friday Night Lights was both the simplest and most complex show on TV. It felt like real life, and real life is complicated.\" TV Guide named the show among its Best TV Shows of 2011 praising the fact that \"Friday Night Lights left its fans with the best portrait of a marriage ever on TV\". It was also included on The Huffington Post's and E! Online's 2011's Best TV Shows.</p><p>In 2013, the Writers Guild of America ranked Friday Night Lights No. 22 in its of the \"101 Best Written TV Series of All Time\".</p><h4>Awards and accolades</h4><p>Friday Night Lights won a Peabody Award, three AFI awards, an Emmy Award for Outstanding Casting for a Drama Series, an ACE Eddie Award for editing, an NAACP Image Award for Outstanding Directing, a Television Critics Association Award, and has earned multiple Writers Guild of America nominations. The show's two leading actors, Kyle Chandler and Connie Britton, received Emmy nominations for their performances in 2010, while executive producer Jason Katims won two Humanitas Prize awards for writing.</p><p>In 2011, after concluding its run, the show was honored by four Emmy nominations and Kyle Chandler won the award for Outstanding Lead Actor in a Drama Series and Jason Katims won for Outstanding Writing for a Drama Series for \"Always\".</p><h4>Fan base</h4><p>Friday Night Lights enjoys what former NBC President Kevin Reilly called a \"passionate and vocal\". This fan dedication has shown itself in everything from advertisers expressing their support for the show to news outlets getting massive amounts of support mail after running positive pieces about the show.</p><p>After some statements made by NBC's Entertainment head Ben Silverman about the future of the show and the fact that everything seemed to point that Friday Night Lights wouldn't return after the writers' strike, fans put together several campaigns. Save FNL Campaign raised money to send footballs and contributions to charity foundations that were related to the show. The Save FNL Campaign raised a total of $15,840 for 18,750 footballs, $2061 for charity, and $924 worth of DVDs for troops stationed overseas.</p><br/><h3>Television ratings</h3><h4>U.S. ratings</h4><p>Though it was critically acclaimed, Friday Night Lights never enjoyed high ratings. The first two seasons averaged roughly 6 million viewers each. Ratings dropped in subsequent seasons with the third season averaging 4.6 million viewers, the fourth season with 3.8 million, and fifth season with 3.6 million.</p><h4>International ratings</h4><p>The show's pilot, which aired on February 21, 2007, on ITV4, was watched by 26,000 viewers in the UK. This was attributed to the program being aired opposite of the Barcelona–Liverpool football game in the first knockout round of the 2006–07 UEFA Champions League.</p><h4>DVR ratings</h4><p>On December 29, 2006 Nielsen Media Research reported the results of having, for the first time, monitored viewers who use a Digital Video Recorder to record shows for later viewing. These ratings, called \"live plus seven\", include all viewers who use a DVR to record the show and then watch it within a week of its initial airing.</p><p>According to the Nielsen numbers, DVR viewers increased Friday Night Lights ratings by 7.5% overall in December. When Nielsen monitored viewers again in April 2007 the increase went up to 17% for the week ending on April 8.</p><h4>Affluent viewers</h4><p>On March 5, 2007, Media Life Magazine reported that Friday Night Lights was one of the most popular shows among \"affluent viewers\" who had little experience playing football. This was determined using a report from Magna Global who in turn used analysis done by Nielsen Media Research. Affluence in the study was determined by yearly income.</p><p>In the study, Friday Night Lights tied for the 11th most watched show by affluent viewers. According to the study viewers of the show have a median household income of $65,000 per year.</p><br/><h3>Distribution</h3><h4>Online episodes</h4><p>Streaming videos, such as cast interviews and the full episode from the previous week, have been available on NBC.com since the series’ inception. In December 2006, NBC expanded this selection to include every episode of the season. The move to offer every episode was made for only a few select shows and represents a marketing push on NBC's part.</p><p>In addition to the free ad-support offerings, every episode of Friday Night Lights became available for download on the iTunes Store on February 10, 2007, for $1.99 per episode. As a special promotion, the pilot was initially offered as a free download. The series was available on Netflix through October 1, 2017. The series returned to Netflix in the United States on August 1, 2021.</p><h4>Syndication</h4><p>ABC Family acquired syndication rights for the first four seasons and began airing reruns September 6, 2010, but it was pulled on October 18, 2010, due to low ratings. In July 2011, it was announced that ESPN Classic had acquired the rights of all five seasons and started airing the series beginning on July 12, 2011.</p><p>In an attempt to bolster series ratings, NBC repositioned reruns of the show to air on its sister network Bravo, during the weeks leading up to the season one finale on NBC. These episodes aired on a schedule of one hour every Friday and three hours every Saturday. Bravo is known to have an audience that is upscale and largely female, which is in line with the new strategy of NBC's then-President Kevin Reilly (now at FOX) for selling the show. When questioned about this strategy, he admitted to having regrets about initially marketing the show incorrectly, saying: \"It’s been so clear to me that the show ended up confusing people in terms of what it was supposed to be\". He said he felt the show is, at its core, a \"women's show\", and his wish is that the marketing had reflected that to a greater extent.</p><p>Once the 2006–2007 television season ended, NBC planned to air reruns throughout the summer in the hopes of gaining new viewers during the summer hiatus. Despite rising ratings for the reruns, NBC abruptly pulled them from the network's schedule on June 24, 2007. NBC resumed airing reruns in late August/early September, timed to the Season 1 DVD release.</p><p>TeenNick acquired the rights in 2015 and began airing the series, in chronological order, on April 10, 2015, with a week-long event in which three episodes aired nightly.</p><h4>DirecTV</h4><p>During the 2007–08 Writers Guild of America strike, NBC Universal's decision to release the Season 2 DVD with only the 15 produced episodes and comments by NBC chief Ben Silverman led to speculation that the show would be canceled.</p><p>In March 2008, it was confirmed that NBC had picked up the series for a third season, after a cost-sharing partnership between NBC and DirecTV was struck. The agreement had first run episodes airing exclusively on DirecTV, and the episodes aired on NBC at a later date. Season 3 premiered exclusively on DirecTV channel 101, with the episodes replaying on NBC beginning on January 16, 2009. In March 2009, NBC announced it had renewed the series for two more seasons.</p><br/><h3>Home media releases</h3><h4>DVD and Blu-ray</h4><p>The first season was released on DVD in region 1 on August 28, 2007, and in region 2 on October 29, 2007. Special features include deleted scenes from several episodes and a featurette titled \"Behind The Lights: Creating The First Season of Friday Night Lights\".</p><p>The second season was released on DVD in region 1 on April 22, 2008, and in region 2 on February 11, 2013. Special features include deleted scenes from several episodes, audio commentaries for \"Last Days of Summer\", \"Are You Ready for Friday Night\" and \"There Goes the Neighborhood\" and a featurette titled \"Friday Night Lights Cast & Producers at the Paley Festival in L.A.\".</p><p>The third season was released on DVD in region 1 on May 19, 2009, and in region 2 on March 25, 2013. Special features include deleted scenes from various episode and an audio commentary for \"Tomorrow Blues\".</p><p>The fourth season was released on DVD in region 1 on August 17, 2010, and in region 2 on May 20, 2013. Special features include deleted scenes from various episodes, audio commentary for \"East of Dillon\", and several behind-the-scenes featurettes.</p><p>The fifth season was released on DVD in region 1 on April 5, 2011, and in region 2 on August 12, 2013. Special features include deleted scenes from several episodes, audio commentaries for \"Don't Go\" and \"Always\", a featurette titled \"The Lights Go Out\", and a photo gallery.</p><p>A complete series box set containing all the episodes and material from the individual season sets was released in region 1 on October 4, 2011.</p><p>In March 2016, it was announced that Mill Creek Entertainment had acquired the rights to the series in region 1; they subsequently re-released the first two seasons on DVD on September 6, 2016. On September 26, 2017, Mill Creek Entertainment re-released the complete series on DVD and also released the complete series on Blu-ray for the first time; however, these releases lacked the previously included special features.</p><h4>Soundtracks</h4><p>Two soundtracks with music featured on the show were released. The first, Friday Night Lights, was released in 2007, and included music from The Killers, OutKast, and Explosions in the Sky, who had produced the score for the film. The second soundtrack, Friday Night Lights Vol. 2, was released in 2010, and included the main \"Friday Night Lights Theme\" by W. G. Walden. The score for both the film and television show, along with all background music and all instrumental music is performed by Explosions in the Sky.</p><br/><h3>Cancelled film sequel</h3><p>In July 2011, it was revealed that creator and executive producer Peter Berg was interested in continuing the series, as a feature film. In August 2011, Berg said at a Television Critics Association panel that the Friday Night Lights film is in development. Berg said, \"We're very serious about trying to do it\", adding that the script was being written. Universal Pictures and Imagine Television would produce the film, with Kyle Chandler and Connie Britton set to return. In May 2013, executive producer Brian Grazer confirmed the film was continuing to be developed. In December 2013, Berg confirmed that a film would not be moving forward.</p><br/>"
  },
  "errorMessage": ""
}