{
  "imDbId": "tt0290978",
  "title": "The Office",
  "fullTitle": "The Office (TV Series 2001–2003)",
  "type": "TVSeries",
  "year": "2001",
  "items": [
    {
      "username": "Superunknovvn",
      "userUrl": "https://www.imdb.com/user/ur1390493",
      "reviewLink": "https://www.imdb.com/review/rw1168281",
      "warningSpoilers": false,
      "date": "8 September 2005",
      "rate": "10",
      "helpful": "90 out of 109 found this helpful.",
      "title": "The funniest, most intelligent thing since Monty Python",
      "content": "Brits. You gotta love them. They got the best bands AND the best comedians. \"The Office\" is probably the best thing in comedy since Monty Python. This show is almost perfect. It's got an original concept, the writing is brilliant, and so is the acting. A group of people completely unknown outside of the U.K. has definitely made a mark in the history of television with this so-called \"mockumentary\".A program like this was really what we needed, but hadn't dared to hope for anymore. In a time when it seemed like T.V. would forever be ruled by sitcoms with canned laughter played over the same old jokes (let's face it, even \"Coupling\" was little more than an edgier version of \"Friends\"), Ricky Gervais and Stephen Merchant came along with their accurate observation of everyday life in an office as we all know it. What they did was take \"This Is Spinal Tap!\" and put it in the context of an everyday working place. In lesser hands, this idea could easily have turned boring all too quickly, because what we are being shown is basically just reality. It could also have gone the other way with stupid and forced jokes thrown in to keep the viewer interested. Gervais and Merchant, however, managed to pull it off just the way it needed to be done. \"The Office\" is tragic, funny, sad and moving all at the same time. This show is so popular, because people all around the world can identify with it. You feel for these characters. Tim, Dawn, Gareth and Brent (especially Gareth and Brent!) are far from being perfect people, but it's because of their little flaws and personality problems that we care for them. We know colleagues like them, we know those grey days at work. And like this crew a lot of us have big dreams that are moving further and further away as we're stuck in dead end jobs getting older. \"The Office\" doesn't comfort us, it doesn't tell us that there'll be a happy ending, but it tells us that we're not alone with our situations. The fact, that we know most of those truly horrible scenes from our own lives makes us laugh. Sometimes the laughs are bitter, but they're always cathartic.SEASON 1 is flawless. Hands down the best first series in a comedy show ever. We get to know Gareth, the annoying colleague who has no life whatsoever and makes up for that by taking himself way too seriously. We meet Dawn and Tim who are fighting their desperation and dissatisfaction by playing pranks on Gareth. The two are secretly attracted to each other with Dawn's boyfriend Lee standing the way. Most importantly, we are introduced to David Brent, the boss who somehow manages to always say the wrong things and embarrass himself and everyone around him all the time. The humour comes mainly from facial expressions, nonsense philosophies (Brent & Gareth), sarcastic comments (Tim) and incredibly awkward situations. Lots of times you'll cringe and the situation gets so uncomfortable you'll cover your eyes with your hands so you don't have to see anymore of it. It's a delightful torture.SEASON 2 is still very good, but Gervais and Merchant fall into the joke-trap too often. In season 1 they successfully avoided any jokes with punchlines or gags that seemed scripted. It was more or less a chain of uncomfortable events and funny interviews. In season 2 we already know the characters and the concept a bit too well. People expect a certain behaviour from the respective characters and Gervais and Merchant are feeding those expectations a little too often. Side character Keith gets a bigger part in these 6 episodes and sadly his wackiness is a bit overdone, too, so that sometimes you get the feeling that whole thing is getting a bit worn out by now. What I really thought was unrealistic was that everybody hated David so much. After all, he is a funny guy and if you don't laugh with him you'd be laughing about him trying so hard to be funny. People just giving him bewildered looks became a bit annoying at some point. However, the writing was still fine, especially considering how little time the makers had and under what kind of pressure they had to come up with new stuff. The final Christmas SPECIALS are a tearjerker. After the genuinely tragic ending of season 2, you hope so much that all will turn out well in the end. Let me just tell you this much: when the credits roll you'll be moved to tears. This just shows how well Gervais and Merchant have built their characters.The way this show found a balance between comedy and drama, the ideas and observations that were put into it and the glorious performances are simply adorable and unmatched to this day. Thankfully, Gervais and Merchant knew when to stop and said that the Christmas SPECIALS were going to be the definite end of \"The Office\". As with any good show that's sad for the viewer, but it was the right thing to do as there was really nowhere else to go with the story and the concept. Remakes have already been made (\"The Office\" 2005 - USA, \"Stromberg\" Germany), but those will always just be a poor man's rehash of the original.\"The Office\" made me believe that even in days when Will Ferrell saying \"San Diego means a whale's vagina\" is considered the ultimate revelation in comedy, there are still people who will come up with clever and original ideas."
    },
    {
      "username": "imdb-3362",
      "userUrl": "https://www.imdb.com/user/ur3279529",
      "reviewLink": "https://www.imdb.com/review/rw0947829",
      "warningSpoilers": false,
      "date": "17 October 2004",
      "rate": "",
      "helpful": "216 out of 243 found this helpful.",
      "title": "Absolutely brilliant",
      "content": "Had this been a 'Britcom-proper' it probably wouldn't have been as funny as it is now. The tragic elements woven into it make it so much greater. Admittedly, there are a lot (and I mean A LOT) of cringeworthy moments in The Office. Moments that make you put your hand over your eyes and look through your fingers, moments that make you gasp and look away, and moments that will make you go \"Aaaargh! Noooo!\". Everybody (who is not David or Gareth) who has ever worked in an office setting (especially those who worked in several ..) will feel that The Office is a condensed and compressed series of events, but very true to life. Everybody knows David and Gareth, everybody wants to slap them and shut them up forever. Everybody feels for (and feels like) Tim and Dawn. And everybody knows that an office would be a downright suicidal place were it not for common foes like 'the boss' and 'the wannabe boss' to loathe.Don't watch The Office if all you want is a quick laugh .. you would feel way too uncomfortable for that. The Office is a true slice of (office) life, a bit larger, a bit darker, a bit more painful, but ultimately more humorous than anything I've ever seen. Make sure you catch the Christmas special(s) as well, as that puts the icing on the cake and makes life slightly more bearable."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw3375017",
      "warningSpoilers": false,
      "date": "19 December 2015",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "English cringe-comedy at its finest",
      "content": "English cringe-comedy at its finest.Set in an office in the UK. The head of the department, David Brent (played by Ricky Gervais) is every employee's worst nightmare: vain, reactionary, over-confident in his abilities...and not very bright. Unfortunately he's also not very self-aware, so he thinks he's doing just fine, and that the troops adore and respect him. Cue many cringeworthy scenes and much hilarity.Very funny, very clever and with a touch of human drama and pathos. While Gervais provides the bulk of the humour, there are plenty of other characters in the office, all with different personalities. Some are there for comedic effect, some for dramatic effect.All in all this makes a great TV series, a series which launched the career of Ricky Gervais."
    },
    {
      "username": "deloudelouvain",
      "userUrl": "https://www.imdb.com/user/ur58525162",
      "reviewLink": "https://www.imdb.com/review/rw3461754",
      "warningSpoilers": false,
      "date": "1 May 2016",
      "rate": "10",
      "helpful": "15 out of 17 found this helpful.",
      "title": "For once the British and American humor are on the same level.",
      "content": "When they took the decision to finish The Office I honestly was sad. Because you don't get much excellent series like this one. The character of Ricky Gervais is a delight to watch, even though everybody would probably hate the guy in real life. Well at least I would for sure. But in this series he's the funniest character to watch, as well as Mackenzie Crook's character. Actually the whole cast with the totally different characters are all good. When I saw that they sold the rights for an American version of The Office I really thought that it could not ever be the same. British and American humor are completely different so it took me years to finally decide to watch the American version. And that one I absolutely loved as well. So if you are sad like me when you watch the last episode of the British version I can only recommend you start watching the much longer American version."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw2979183",
      "warningSpoilers": false,
      "date": "14 March 2014",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "Comedy classic of British TV",
      "content": "THE OFFICE is one of my all-time great comedy TV shows and up there with the classic likes of FAWLTY TOWERS and MONTY PYTHON. I recently rewatched the lot - series 1 & 2 and the Christmas specials - and am pleased to report it holds up now better than ever. Even more so perhaps, given that Ricky Gervais's subsequent TV offerings - EXTRAS and LIFE'S TOO SHORT - have come across as diluted variants of this show.What makes THE OFFICE so successful? It has to be the documentary format, which makes the characters on screen feel real like never before. Anybody who's ever worked in an office will know how true-to-life the whole thing is, and the camaraderie between the main characters is what keeps this humming along. Watching the misadventures of Tim, Dawn, Gareth and Keith is just a delight. Yes, there's too much of an emphasis on lowbrow humour, but it's the character tics that make this work.Of course, Ricky Gervais's David Brent is the man who lords over it all, and he plays a surprisingly complex character. Given that his off-colour humour, desperation to be liked, and frequently humiliating situations all point towards somebody you should hate, Brent turns out to be Gervais's most likable creation ever. It says something that THE OFFICE is the only thing I truly like the comedian in. In any case, THE OFFICE is brilliant stuff and every episode is a zinger; it truly is untouchable."
    },
    {
      "username": "Pedro_H",
      "userUrl": "https://www.imdb.com/user/ur1955998",
      "reviewLink": "https://www.imdb.com/review/rw0827108",
      "warningSpoilers": false,
      "date": "27 May 2004",
      "rate": "",
      "helpful": "72 out of 95 found this helpful.",
      "title": "The most funny, truthful and profound TV series for many a long year.",
      "content": "A TV crew move in to the Slough offices of paper wholesalers Vernom-Hogg to focus on how the ordinary British work place responds to change and business upheaval.What a surprise this series was when it first came on the TV. Given that it was on BBC2 and not given much promotion you didn't expect much, but boy is this series good. Not only is there moments of absolute comic genius, but it is also very profound. Stand assured I have met all the characters on this show in real life - I have even worked alongside a few of them!It is impossible to know what foreigners make of lead and star turn Ricky Gervais playing boss David Brent. Americans might not get the full satire of his off-centre and cliché bound management speak. Like another great British character Alf Garnett (of Till Death Us Do Part) he is not so much an invention as an acute observation of a particular type of crass over-promoted idiot that lurks among us. Incompetent and ludicrous, but full of the misplaced confidence that comes from never having to face a reality check. The office runs despite of him - not because of him.If this was not comedy it would be considered the best portrayal of a man living under self-delusion ever put on film. His belief that he is incredibly popular and has the support of the full staff is clearly false and yet nothing can shake his beliefs. He is not blind but yet he cannot see. He is living in a land of fantasy and time-wasting - for example, inventing game shows instead of writing office reports!Brent is a self-styled \"chilled out comedian\" that cracks rude or racist jokes to just the type of people that don't want to hear them. Wearing a fake wan smile he has the unerring ability to make difficult situations even worse. He is always aware of the camera and even plays to it - even lurking in the background to join in other people's on-camera moments as if he has nothing better to do. Brent has a mini-me in the form of Gareth Keenan played by Mackenzie Crook. A wan and skinny man-youth who is chief support to Brent in the mismanagement of the office. A weekend soldier he makes constant references to this and how it applies to office procedure, as well as trying it on with spare office female talent - with no success whatsoever. He also runs the office course on safety - which is one of the funniest pieces of business I have seen in a long time. Instructing female employees on how NOT to put cups of hot coffee on the top of monitors and how to correctly lift boxes.Only slightly more sane is Tim Canterbury (Martin Freeman) the college drop-out that is always threatening to quit and return to his books. A bored mediocrity that fills his days by winding up Gareth and flirting with receptionist Dawn (Lucy Davis) - who has less of a role, but looks on in disgust at some of the antics that the others get up to.Special support comes from Chris Finch (played by Ralph Ineson) who is chief rep and office big mouth: Perhaps the most revolting person ever to appear on TV. His recollections of drunken evenings and stupidity being listen to with wide eyed wonder by the males - with only Dawn daring to show what he really is and even then not in words. When he leads the gang down Chasers (the local small town disco) things really hot up.This show only ran two series (plus Christmas special - that was only so-so), but in the second series the nature of the Brent management style comes under pressure. Reality starts sweeping in to his little world and his bubble is finally popped, but not without some really funny moments - including the \"Comic Relief\" day episode that is perhaps the best of the whole lot. I have seen all the shows and most of them more than once. This series warrants repeat viewings because it is just so funny and perfectly realized. This series will put off thousands of people from working in an office and maybe some of them will go off and do something more creative and interesting with their lives. Writing something as good as this, for example."
    },
    {
      "username": "bevo-13678",
      "userUrl": "https://www.imdb.com/user/ur76062573",
      "reviewLink": "https://www.imdb.com/review/rw6368000",
      "warningSpoilers": false,
      "date": "15 December 2020",
      "rate": "10",
      "helpful": "19 out of 23 found this helpful.",
      "title": "Ricky",
      "content": "I reckon the English version is better and Ricky would beat Steve in a fight"
    },
    {
      "username": "CuriosityKilledShawn",
      "userUrl": "https://www.imdb.com/user/ur0102816",
      "reviewLink": "https://www.imdb.com/review/rw0827106",
      "warningSpoilers": false,
      "date": "15 May 2004",
      "rate": "10",
      "helpful": "91 out of 136 found this helpful.",
      "title": "Cringeworthy genius",
      "content": "Set in the bleak, awfully-named industrial town of Slough and the fictional office of the Wernam-Hogg paper merchants, a BBC film crew documents the expressionless workers, ringing phones, copiers churning out clone after clone after clone, pointless meetings and pointless bureaucracy that exist within typical, uninspiring companies.Sadly, the majority of people in Britain work in dull, dead-end office jobs with lives that go nowhere and even the most meager of ambitions going unrealized. Maybe if they had a boss like David Brent their day would be livened up. Not because he's the 'boss/entertainer' he thinks he is, but for the morbid curiosity of watching a desperate, delusional and detestable man slowly crash and burn.The majority of laughs in The Office come from awkward and embarrassing situations. Brent constantly forces his bullheaded and bawdy humor on unwitting staff. At first they appear scared of his ruthlessly imposing presence but towards the end they all ignore him completely. But he never realizes this and resorts to even more tasteless ways of getting attention. He loves the camera and rather than acting 'normal' for the purposes of the mockumentary he exaggerates his beastly character to the point of being sickening. He gets what he deserves in the end and by this point the audience has lost all sympathy for him.His brutalized and beleaguered staff struggle to get on with their work as Brent's tyranny escalates. Among them we have Tim, an increasingly unhappy man who wishes to escape the monotony and drudgery 'ordinary life' brings him. He's long had the confidence crushed out of him but still has more humanity than anyone else.Gareth is Tim's worst enemy. A dorky, 95 pound weakling who boasts of being in the (territorial) Army and is keen to assume more and more power from Brent's failing management. Like Brent, he has no clue about social interaction and behaves strangely among potential friends. Dawn is the receptionist. She is engaged to a controlling, unloving boyfriend who insists she spend her life doing dull work despite the fact that she has higher and happier dreams. She has feelings for Tim, and they are more than mutual. But fear of change and happiness stops her from falling for him.As soon as once branch of Wernam-Hogg incorporates the other it becomes clear how useless Brent is. The new staff are amazed at how such a horrid man has been employed at all, never mind become a boss. Complaints and unfinished work rise and the upper management are forced to take action. Sadly, Brent just won't learn.In the end, his staff have the slightest chance at happiness and escape. Brent however doesn't learn from his mistakes and will probably go on to have an endlessly miserable life.If you work in an office, get out! Among the blackest of humor there is a message; office life is fit for no human being. And Ricky Gervais' dark comedy is filled with thousands of examples of why this is so. It's absolutely classic stuff that is far ahead of dozens of canned laughter sitcoms."
    },
    {
      "username": "supertom-3",
      "userUrl": "https://www.imdb.com/user/ur0975530",
      "reviewLink": "https://www.imdb.com/review/rw0827113",
      "warningSpoilers": false,
      "date": "23 July 2004",
      "rate": "",
      "helpful": "68 out of 96 found this helpful.",
      "title": "Brilliant show! It's going to be timeless!",
      "content": "Absolute magic! This is one of the best comedy series of recent years. It is brilliant stuff. This is a documentary about an office who make paper. What is so funny is that it is played so seriously that casual observers will believe that this is a real documentary and these characters are real. It's all larger than life in many ways and with some of the situations but it is pure genius. The cast play their characters brilliantly. Ricky Gervais is outstanding. He, as an actor, writer, and director of this show has created one of comedies great characters. He is the imbecile and arrogant boss who we all have had experience of and who we can see some of our own traits in. It's frightening how many faux pas this guy comes out with, its cringe worthy and we all know we have said things like he has. You feel sorry for him because he acts so deluded but at the same time he can make you wince and burst out in laughter at some of his actions (remember the dance?). Also superb is Mackenzie Crook as Gareth the dorky and also deluded young worker who follows the book down to every crossed T and dotted I. He plays it to perfection, like Gervais. Also good is Lucy Davis, as receptionist Dawn. The one who I think plays it really well because his character has a more emotional element in his performances is Martin Freeman, as Tim, who has a big crush on Dawn. There is a great dynamic and he plays the lovesick worker, bored with his life with a real depth which is really evident in the Christmas special and end to the Office. The Christmas episode was the best from the Office; it was hilarious, tragic and brilliantly cringe-worthy. It is no more and the American version will not hold a candle on this. All I can say is make sure that if you haven't seen the last episode of it, the Christmas special, then watch it. It's the best; it's beautifully done and will almost bring a tear to your eye."
    },
    {
      "username": "Ruskington",
      "userUrl": "https://www.imdb.com/user/ur99782462",
      "reviewLink": "https://www.imdb.com/review/rw5638739",
      "warningSpoilers": false,
      "date": "14 April 2020",
      "rate": "10",
      "helpful": "14 out of 17 found this helpful.",
      "title": "The finest TV comedy ever made",
      "content": "Has there ever been a more perfect TV comedy than The Office? Personally, I don't think there has. The ability of the show to straddle the line between dour realism and laugh-out-loud hilarity is absolutely unmatched. Anyone who has ever worked in this kind of environment will appreciate how perfectly observed it is; the people, the atmosphere, the dialogue, the overbearing tedium. All the characters, including the background workers and warehouse staff, are perfectly constructed and every conversation is painfully realistic.David Brent is Ricky Gervais' finest conception and probably one of the funniest comedy characters ever created. Gervais' ability to produce such a high level of cringe while also keeping the character relatively likeable is a tremendous feat and testimony to his acting skills.Martin Freeman is brilliant as Tim, essentially acting as the eyes and ears for the viewers. His interplay with Gareth, Brent and, of course, Dawn is perfectly executed. This is a real hero- a normal, unremarkable and entirely believable guy whose superpower is simply his ability to cope with the stupidity of everyone around him without losing his civility or sense of humour.But by far the biggest achievement of this show is the incredible love story between Tim and Dawn. This is so much more than the cliched Hollywood romances we are used to seeing in films and TV shows. These two are not beautiful, successful and young. They do not live in swanky studio apartments and frequent glamorous nightclubs and social hotspots. Their love story is not portrayed through exciting dates and engaging conversations. Tim and Dawn are just very normal. They have boring jobs, boring social lives, are mildly attractive at best and are going nowhere in life. Their romance is told through brief glances and awkward conversations. It is barely told at all in fact, and yet we feel it so intensely from start to finish. The writing strips away the non-essentials from the love story, leaving you to connect with the raw yearning that propels it. It takes you back to having a school crush, when that person consumed every second of your life and every part of you just ached to reach out and hold them. The culmination of this love story is one of my favourite ever TV moments. No matter how many times I watch it, I choke up. It's just incredible. A monumental piece of writing and the undisputed highlight of Gervais and Merchant's careersThis would be my desert island box-set, a show I could easily watch every day for the rest of my life. Sheer perfection."
    },
    {
      "username": "fostrhod",
      "userUrl": "https://www.imdb.com/user/ur92838119",
      "reviewLink": "https://www.imdb.com/review/rw6770120",
      "warningSpoilers": false,
      "date": "2 April 2021",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "It's a painful watch, but is a must watch",
      "content": "The Office 2001-2003 BBC 14 episodes. ( first watched 2001, then about 2010) The boredom and tedium is highlighted in this \"mockumentary\" about the staff of a paper merchants in Slough. The setting is inessential but the interactions aren't. Tim one of the characters states \"you spend more time walking the same carpet with your colleagues, then you do with your own family\". There are two principal story lines, one featuring the office manager and the other being the tentative relationship between receptionist Dawn and sales rep Tim. The show is a painful watch, see the awkward and stilted conversations be the characters. It is painful but out of this comes, funny lines and very real situations. The cliches and bullying is very real. A lot of the humour is dated but because of this it highlights how fashions change and not always for the better.It's expertly written and acted. It is a classic and only fails when the series moves away from Slough and intervenes in the storyline. Despite my reservations it still gets 10/10."
    },
    {
      "username": "ComedyFan2010",
      "userUrl": "https://www.imdb.com/user/ur23138767",
      "reviewLink": "https://www.imdb.com/review/rw4074772",
      "warningSpoilers": false,
      "date": "26 February 2018",
      "rate": "8",
      "helpful": "4 out of 4 found this helpful.",
      "title": "A great office mockumentary",
      "content": "Having heard that the British version is not as good as the American it took me long time to finally watch this short TV show. I was pleasantly surprised. This show is actually really good. I can't say if American or British version are better until at least I watch the US version again. But I can surely say that this is definitely high class comedy and one should also not forget was the original idea.The show has some great characters. Especially outstanding are David and Gareth who make us laugh in every episode. The humor is clever, with greatly written dialogues and also some nice physical comedy.Besides humor we also have a nice office romance of Tim and Dawn. It is really well portrayed by very realistic looks and moments that show us exactly what the characters are feeling.The Christmas special added a great ending to this wonderful show and gave us the closure that we were lacking after the second season was over.It was planned to be that short but it is a good idea. They put everything important into the episodes and gave us a good picture of this office comedy and people in it."
    },
    {
      "username": "chasgoose",
      "userUrl": "https://www.imdb.com/user/ur1046607",
      "reviewLink": "https://www.imdb.com/review/rw0975314",
      "warningSpoilers": false,
      "date": "9 December 2004",
      "rate": "",
      "helpful": "108 out of 132 found this helpful.",
      "title": "Laughter through the tears",
      "content": "While admitting to being a general Britcom slut (Fawlty Towers, Ab Fab, Monty Python,) with the exception of Coupling which I wasn't that big a fan of, I think The Office is quite possibly one of the greatest TV shows ever to be put on TV. The show takes a few viewings to really get all of the humor/tragedy that the brilliant Ricky Gervais and Stephen Merchant have built into the script of the show. The first time it seems sort of blah, but if you watch the whole 1st season, by episode 4 or 5 you pick up on the style of humor and realize that it lies mainly in the simple throwaway lines that the abhorrent David Brent and other employees of Wernham Hogg's Slough branch utter throughout the show. Also, like Gosford Park, the dialogue is very quiet and to an American not used to British accents it is tremendously helpful to put on the subtitles to understand what the characters are saying (it also makes the cringeworthy things that much more cringeworthy when you see them written out). Once you get the humor further viewing will allow you to appreciate the horror of \"The Office.\" Watching all of Season 2 in a marathon viewing session left me so emotionally drained (even though I have never laughed harder in my life) that I was crying by the end and I couldn't tell if they were tears of sadness or laughter. At the same time I was relishing David Brent's demise, the new levels of obsequiousness and insensitivity he descends to by the end of the series is almost painful to watch. Tim and Dawn's will it happen/it won't happen relationship is one of the sweetest and most soul-crushing romances I have seen in television history ranking right up there with Sam and Diane from Cheers and Ross and Rachel from Friends. The beauty of \"The Office\" is it mixes some of the most hilarious sitcom humor with a level of epic tragedy that is hard to capture in any performing art form and does it so effortlessly that it is hard to tell where one begins and one ends. I cannot wait to see the special and finally finish the emotional roller coaster that was \"The Office.\""
    },
    {
      "username": "zzapper-2",
      "userUrl": "https://www.imdb.com/user/ur0289178",
      "reviewLink": "https://www.imdb.com/review/rw0827082",
      "warningSpoilers": false,
      "date": "3 February 2004",
      "rate": "",
      "helpful": "28 out of 38 found this helpful.",
      "title": "I come from Slough!",
      "content": "Even people from Slough have signs on their car windows \"Happiness is seeing Slough in your Rear View Mirror\". During the war the enemy was invited to bomb Slough; \"Come friendly bombs rain on Slough\")(no joke).The Office is one of those programs which when you happen across it, for the first half-hour or so you're completely baffled, its format is so unusual, then before you know it you're hooked. It's really about the horror of passing so much time with the SAME people (more than with our families). Where any minor incident like the photocopier jamming becomes a slight relief from monotony.If you like The Office then try \"Alan Partridge\" like David Brent another nightmarish figure"
    },
    {
      "username": "GRWeston",
      "userUrl": "https://www.imdb.com/user/ur0241579",
      "reviewLink": "https://www.imdb.com/review/rw2924555",
      "warningSpoilers": false,
      "date": "19 December 2013",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "A cold, hilarious dose of reality",
      "content": "I watched the entire series of The Office and the Christmas special exactly nine years ago, the same year I joined the corporate world. My timing could not have been better because already one year in, I had already become familiar - and annoyed - with the politics of the corporation and its more offensive personalities. Sooner or later, everyone in the corporate world ends up having a coworker like one at Wernham-Hogg, whether it be the team lead who is masculine in a way that proves he's insecure about his own masculinity and who wields what little power he has like a despotic king's scepter (Gareth), the sexist, condescending braggart who is unfairly successful with the ladies (Chris Finch) or of course the incompetent manager who would rather be popular than good and who hides his incompetence with pretension (David Brent). All of the series' situations are also genuine, especially the awkward, strained Christmas and year-end celebrations, the pointless staff appraisal sessions and the useless training class, which is the centerpiece of \"Training,\" my favorite episode. While reliving my least favorite corporate experiences made me wince, I laughed until my sides hurt at the same time, which explains The Office's reputation for popularizing cringe comedy. Still, despite the series' damning depiction of the workplace, at its core lies a big heart. You can see it in the way the show cares for Tim and Dawn, Wernham-Hogg's lone beacons of sanity and would-be romantic couple, but you really see it in how David Brent, the source of the series' most cringe-worthy moments, becomes the man you root for in the end. By providing the perfect outlet for my frustrations with the corporate world while making me not regret my decision to join it in the truest, most funny way possible, I easily rank The Office as my favorite TV show of all time."
    },
    {
      "username": "nickenchuggets",
      "userUrl": "https://www.imdb.com/user/ur107418055",
      "reviewLink": "https://www.imdb.com/review/rw8456382",
      "warningSpoilers": true,
      "date": "17 August 2022",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "\"You'll never have another boss like me\"",
      "content": "If you ask people what they think is the best comedy show to come out of the UK, most would probably say Monty Python due to its extensive history and groundbreaking performances that are still funny decades later. This might be true, but I think that the British version of The Office is a close second, and may as well be considered a modern day Monty Python. This show is hilarious for many reasons, but it's not really something I can write about easily because it consists of quite a few episodes and each one has a different premise. It doesn't have anywhere near as many episodes as its American counterpart, but you can argue that this is actually a bonus. Many fans of both shows will freely tell you how the british version is superior, not only because it came first, but also since it ended before it had a chance to decline. The Office is an incredibly funny (and vulgar) program that takes place somewhere you'd expect barely any laughter: an office. More specifically, it follows the various employees at a paper manufacturing company called Wernham Hogg. The office's manager is David Brent (Ricky Gervais), who is probably the type of boss nobody ever wants to have. He's a pretty terrible employee not because he oppresses his workers with tons of assignments, but because he does the total opposite and simply doesn't seem to care. Throughout the show, he's always trying to fraternize and make small talk with the other workers, which typically goes really badly. This brings me to the primary reason why the show is so funny. No other program seems to do uncomfortable silence better than this show. Almost every time David tries to have fun or make a joke, it results in a catastrophe of pure cringe and embarrassment. This series is filled to the brim with moments such as these, but I can't say what they are because they're so crude it's probably crossing the line (and boy is it hilarious). Although most of the comedy in the show comes from the other people reacting to whatever stupid things Brent is doing, that's not to say the other employees are boring characters. Also working at the office is Gareth Keenan (Mackenzie Crook), a former lieutenant in the Territorial Army who frequently gets in the way of Tim (Martin Freeman) and enjoys using his authority to push him around. The two always play pranks on each other, even though Gareth doesn't seem to realize he has little actual power in his job's hierarchy. Some of the funniest moments in the show stem from Tim questioning Gareth about his service in the reserve force using double entendres to make it sound like he is gay. Some other characters include Dawn (Lucy Davis), who works as the office's receptionist and is usually seen rejecting the advances of Tim. Her current boyfriend, Lee, makes it clear to Tim that he'd better look elsewhere for a girlfriend, even though Dawn and Lee's relationship is already hanging by a thread. In later episodes, we get introduced to Neil, who is the manager of a different branch of the paper company and David's eventual boss. Like almost everyone else, he's very put off by David's offensive and sexual humor, except he actually has the power to get him fired if he wants to. I love watching him and Neil interact with each other, because David still makes all these dirty and distasteful gags in front of him, regardless of his position. It's like he can feel himself being annoying but can't stop. I also can't talk about this show without mentioning the two Christmas specials which take place 3 years after the events of the show. I won't say what happens, but Wernham Hogg has no doubt changed a lot, and Brent's life will never be the same. Everyone working at the company undergoes some kind of change and moves on to something more important in their lives. Like many excellent shows/movies I talk about, there's no way I can fit all the things that make The Office great into one review. I know the american one is decent too, but nothing beats the awkward and uncouth humor of the original that makes you cringe and feel self-conscious every time you watch it. I think that's why this show is so important. It successfully manages to create comedic moments in a mundane setting such as an office, and because many people today are office workers, it makes the show highly relatable. If you work in a similar place, you're probably aware of how boring it can be, and while going through sensory depravation like that, you're practically begging for something amusing to happen to make the job more tolerable. It's not an easy show to watch because many of the awkward and humiliating moments are too relatable, but that is the main reason why this show is so great. If you've never watched this show and are interested in british humor, I can't recommend it highly enough. It's a prime example of how good that country is at comedy, and Ricky deserves praise for being one of the few men who can say and do such offensive things and still make people laugh."
    },
    {
      "username": "lesleyharris30",
      "userUrl": "https://www.imdb.com/user/ur23055365",
      "reviewLink": "https://www.imdb.com/review/rw2823223",
      "warningSpoilers": false,
      "date": "1 July 2013",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "One of the Funniest and Most Original Sitcom of All Time,",
      "content": "The Office is an outstanding piece of comedy genius.Ricky Gervias and Stephen Merchant clearly know what makes a great comedy,everything about this series is hilarious,the characters are brilliant and the cast playing them are outstanding.I watched every episode on Netflix for the first time,and I'm definitely going to watch this show again and again,there is only fourteen episodes so it dosen't take a long time to get through,I'm going to start watching the US series,but I know it won't be as good as this.All in all,what really makes this series is Ricky Gervias,he is clearly a fantastic writer and his performance as David Brent is one of the funniest in television history,and certainly the biggest cringe moments.If you know what a good comedy is,and your a fan of British classics such as Fawlty Towers and Only Fools and Horses,then the Office is a series that you will absolutely love.The story of a bunch of people working at a paper merchant being filmed by a documentary as they their day to day life at their workplace."
    },
    {
      "username": "censorme",
      "userUrl": "https://www.imdb.com/user/ur99475636",
      "reviewLink": "https://www.imdb.com/review/rw4674954",
      "warningSpoilers": false,
      "date": "19 February 2019",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "Great!",
      "content": "Wish it lasted as long as the US version. Definitely the superior series. Gervais is a comedic genius and will make you laugh and cringe"
    },
    {
      "username": "tim_bidet",
      "userUrl": "https://www.imdb.com/user/ur4032684",
      "reviewLink": "https://www.imdb.com/review/rw0970527",
      "warningSpoilers": false,
      "date": "30 November 2004",
      "rate": "",
      "helpful": "108 out of 133 found this helpful.",
      "title": "Genius",
      "content": "\"The Office\" is quite simply worth watching. I am tired of hearing people criticising it. It's not that it's not worthy of criticism, but the fact that those who label it as \"overrated\" and \"falling short of expectations\" have only ever seen one episode, or the Christmas Special, or 'The Dance'. It defies logic to make a judgment on a 14 episode programme on 2 feature-length episodes that merely act as a means of updating and rounding-off the series. I have yet to hear anyone make a solid argument as to why The Office fails in any way.If you have not yet seen it, get Series 1 and 2 and settle down on a rainy afternoon ready to emerse and commit yourself. Forget the hype, put the dance scene that you've seen a million times out of your mind, and just watch each episode in order. Then make your own judgment. If you liked it, you will want to see the Christmas Specials; if you didn't, you won't.Using a cast of unknown, yet perfectly chosen actors, The Office is a sharp, funny, painful, emotional and fabulous take on office life."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2253816",
      "warningSpoilers": false,
      "date": "23 May 2010",
      "rate": "10",
      "helpful": "12 out of 18 found this helpful.",
      "title": "Brilliant and intelligent",
      "content": "I love comedy, when it is funny, clever, intelligent and sophisticated. Imagine my surprise when I saw the first episode of The Office, huge surprise and in a very good way too. Since seeing the first episode I have been hooked on this show. Why? Because it is funny. The writing is a vast majority of the time hilarious while allowing some time to be intelligent as well. True there are one or two moments in Season 2 that are somewhat cringe worthy, but I always find myself laughing so hard and wiping away tears from my eyes, I don't mind so much. The production values are terrific, the direction is very well done consistently and the acting is wonderful. Whether I can stand Ricky Gervais or not is very dependent on the material and what he is in. Personally I don't mind him, but I am not his biggest fan either, but I have to admit he is right in his comfort zone here because he is just brilliant. The other actors also do really well, and all of the characters are likable and developed well. While The Office is often hilarious, the Christmas specials have had a poignant tone to them, that I appreciated. Overall, a wonderful comedy series. 10/10 Bethany Cox"
    },
    {
      "username": "privatechrisnylan",
      "userUrl": "https://www.imdb.com/user/ur51150420",
      "reviewLink": "https://www.imdb.com/review/rw5791568",
      "warningSpoilers": false,
      "date": "1 June 2020",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "The genuine UK original...and the best",
      "content": "Excruciatingly good watch that is sometimes so hard to watch with what was brave writing & acting. We had never seen anything like this before and it avoided adding sweetener like the US version."
    },
    {
      "username": "Artimidor",
      "userUrl": "https://www.imdb.com/user/ur16162453",
      "reviewLink": "https://www.imdb.com/review/rw2767483",
      "warningSpoilers": false,
      "date": "15 March 2013",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Mockumental comedy revolution",
      "content": "Ricky Gervais and Steve Merchant's rather unexpected 2001 baby in form of a mockumentary portraying an English workplace was one of the key moments of post-2000 British television. This is not another uniform situation comedy pulp with a new setting and/or accentuation, but brand new territory. And you better be ready for it as the punchlines aren't served on a plate, complete with canned laughter to give you an indicator on when something is intended to be funny. The humor lies in the format, the situation as such, generated by the mere presence of a camera team. Meant to capture the goings-on of everyday office life for a documentary this voyeuristic outside force - and thus indirectly the viewer - serves as the perfect catalyst to bring the true hierarchies, relationships and confrontations in the business life context to the forefront. Gervais himself plays David Brent, the boss of a small paper company, who sees himself not only as an unrecognized, highly talented entertainer, but is also so full of himself that he redefines comedy in the process of presenting himself in front of the camera. Actually he gives the word cringeworthy new meaning. In his office the usual stuff happens you might have witnessed in a similar environment: sucking up, skirmishes among colleagues, practical and dirty jokes, an office romance, the fear of the closing of the branch, redundancy looming. \"The Office\" has the look and feel of real life, and the actors, especially Martin Freeman (as Tim) and Mackenzie Crook (Garreth), complement Gervais' tour de force brilliantly. Just as in real life this small series has it all: humor in all variations, even if it's over the top, a bit of drama and even a dose of melancholy. Must-see.\"The Office\" was remade for the US market by NBC starring Steve Carell in the lead, with Rainn Wilson in the role of the weirdo/bootlicker combination and John Krasinski and Jenna Fischer standing in for Martin Freeman and Lucy Davis' office romance. Sticking close to the original at the beginning, and highly entertaining for most parts of the early seasons, the American version however more and more forgets its origins and turns into a regular, increasingly infantile sitcom and eventually jumps the shark halfway through its nine year run. Ricky Gervais knew when to call it quits."
    },
    {
      "username": "Daviteo",
      "userUrl": "https://www.imdb.com/user/ur0760186",
      "reviewLink": "https://www.imdb.com/review/rw6885993",
      "warningSpoilers": false,
      "date": "6 May 2021",
      "rate": "9",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Had to re-start 3 times, but when I finally got into it: WOW!",
      "content": "I had been a fan of the US The Office for a while, having seen most of that before I started the UK one. First and foremost, I could not STAND David Brent and it took me three tries to get through the first episode. But I'm so thankful I kept going. This show is absolutely brilliant. If the US Office is Malcolm Gladwell, an affable and frizzy haired intellectual, the UK Office is Stephen Hawking, absolute genius.The UK Office is borderline dystopian-from its grungy neighborhoods during the opening titles to the nearly SS Officer in Gareth-and showcases the absolute worst that work culture has to offer, much more so than the US counterpart. And in doing so, achieves a seeming truth that few shows could ever aspire to reach. Yes, the US version is a bit sillier, goofier, happier because it aims for laughs, even if subdued, the UK Office just lets the characters be themselves without a safety net: they're allowed to fail much more miserably than the US characters ever did, and in that, we find sharper humor and more vicious bite.The closest the two shows ever came was arguably seasons 2 and 3 of the American version, where those characters were operating at their peak and the humor was witty and clever, but even still, the UK version, while missing some of the heart, pushes the envelope of allowing characters to be the worst versions of themselves much more than the US show. And it's in that where the best humor lies."
    },
    {
      "username": "tomchick-1",
      "userUrl": "https://www.imdb.com/user/ur3203904",
      "reviewLink": "https://www.imdb.com/review/rw0827099",
      "warningSpoilers": true,
      "date": "29 March 2004",
      "rate": "",
      "helpful": "42 out of 52 found this helpful.",
      "title": "The rise and excruciating plummet of David Brent",
      "content": "After having watched both seasons, plus the two extended Christmas episodes, I have to say that The Office is one of the most excruciatingly brilliant bits of television I've ever seen.It's like what Irreversible would be if it were a sitcom, because it's all about setting up the audience for a savage emotional beating, of sorts. The first season introduces the characters and playfully chucks them on the shoulder with some embarrassing mishaps. And it reveals them as very human fallible convincing people. They would be caricatures if they weren't so honest -- we know people like them, so we know them.But the second season is really sadistic, partly because you've come to know the characters so well in the first season. I've talked to a few friends who say they didn't like The Office because it was so hard to watch. After having seen only the first season, I thought they were just silly lightweights. But after having seen the second season, I completely understand the sentiment.Season two takes the gloves off and leaves marks. Ricky Gervais' character in particular, David Brent, is subjected to a series of painful humiliations. From his botched introduction to the Swindon crew (\"...and I don't approve of that in the workplace!\"), to his first and last motivational speech, to his ridiculous dance when he tries to top Neil's Saturday Night Fever riff, to his final scene pleading for his job. It's a sadistic plunge, a human trainwreck, fascinating and repulsive. And there's not a shred of hope. Gareth takes David's job, with no sign of gratitude. He gloats that Tim is going to have to dress better. Tim has lost Dawn, who has obvious misgivings about leaving and getting married. Everyone is in a state of limbo, if not hell. It's amazing to me -- and I have enormous respect for the uncompromosing brash creativity of Gervais and Stephen Merchant -- that it would end like this. Ouch. Bravo. The two Christmas episodes are a bit of a relief, if not something of a cop out. In fact, they let me breathe a bit easier. I wonder if they'll be on the season two DVD when it comes out next month. Because I think season two, straight with no Christmas chaser, is one hell of a slug to the gut. \"And they say she's just a giant pair of tits...\"-Tom"
    },
    {
      "username": "michaelnash1999",
      "userUrl": "https://www.imdb.com/user/ur4393450",
      "reviewLink": "https://www.imdb.com/review/rw0977516",
      "warningSpoilers": false,
      "date": "13 December 2004",
      "rate": "",
      "helpful": "136 out of 168 found this helpful.",
      "title": "The greatest programme ever",
      "content": "I wasn't go to write a comment on the programme The Office but after reading trpdean's comment, I had to. I'm not sure what office life is like in the states, but this is what office life is like in Britain.The show is perfect, it is indeed a true and honest reflection on every day working life.The Boss is played by an actor by the name of Ricky Gervais, you will cringe and laugh at the same time, you will love him and hate him at the same time. The way the programme takes him thru the 14 episodes is brilliant, George from Seinfeld gets nowhere near this guy.Then there is Gareth, a wimpy nerd, who thinks he is a big army man, but he really is just a weed of a man, we have all known someone like him.The heart and soul belongs to Tim and Dawn though, you will cry your eyes out through out the series because of their relationship that isn't one.This programme deserves all the awards that it has won, I don't want give too much away, its best if you go into the show not knowning too much about it, and to trpdean, once again this is what office life is like in England."
    }
  ],
  "errorMessage": ""
}