{
  "imDbId": "tt0290978",
  "title": "The Office",
  "fullTitle": "The Office (TV Series 2001–2003)",
  "type": "TVSeries",
  "year": "2001",
  "episodes": [
    {
      "id": "tt0664502",
      "seasonNumber": "3",
      "episodeNumber": "1",
      "title": "Christmas Special: Part 1",
      "image": "https://m.media-amazon.com/images/M/MV5BM2E2NjQ1ODYtNWYxZC00OTFjLWI4MGYtOTMwNmFmZDI2NGUzXkEyXkFqcGdeQXVyMjc0ODQ0NzM@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "26 Dec. 2003",
      "plot": "It's been three years since the BBC documentary crew first arrived at the office. Back for one last visit, they find Gareth Keenan now in charge and is running the office with a military precision. Since we last saw David Brent he has become a sales rep for a cleaning products company, released his own pop single and has acquired an agent to look after his celebrity appearances. He visits his old workplace regularly, despite him successfully suing Wernham Hogg for unfair dismissal. The big news for Tim is the imminent arrival of Dawn. The documentary crew has kindly ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "2003"
    },
    {
      "id": "tt0664503",
      "seasonNumber": "3",
      "episodeNumber": "2",
      "title": "Christmas Special: Part 2",
      "image": "https://m.media-amazon.com/images/M/MV5BNzVmMDM4MzAtZGNiMC00YWNkLTlkMmYtYjM4ODI1OTYzMjBkXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "27 Dec. 2003",
      "plot": "Tim's world is rocked when Dawn turns up at the office to say hello. Despite a stern warning from Gareth and wise words from Keith in Accounts, Tim can't help but get his hopes up again. Meanwhile, David Brent has been using the services of a dating agency and, in between making celebrity appearances in nightclubs, he meets up for drinks with a rather disappointing selection of single women. The office Christmas party kicks off like any other but there are a few surprises in store...",
      "imDbRating": "9.3",
      "imDbRatingCount": "2814"
    }
  ],
  "errorMessage": ""
}