{
  "imDbId": "tt0290978",
  "title": "The Office",
  "fullTitle": "The Office (TV Series 2001–2003)",
  "type": "TVSeries",
  "year": "2001",
  "episodes": [
    {
      "id": "tt0664504",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "Downsize",
      "image": "https://m.media-amazon.com/images/M/MV5BN2QwOGEzOTYtMmJkYS00YzZlLWE3NzEtYmYwNGJjYTEzN2ExXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2006",
      "released": "10 Jun. 2006",
      "plot": "David Brent is the manager of the Slough branch of the Wernham Hogg paper company and he and some of his staff are having a bit of a rough morning after over-imbibing the night before. When his boss Jennifer Taylor-Clark drops in she tells him that the company can no longer afford both a Swindon and a Slough branch and that one is to be merged into the other. She also tells him there are going to be redundancies. Word spreads through the office quickly but David assures everyone that their jobs are safe.",
      "imDbRating": "7.6",
      "imDbRatingCount": "2411"
    },
    {
      "id": "tt0664509",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "Work Experience",
      "image": "https://m.media-amazon.com/images/M/MV5BZDkxNzE4MjgtOGJkMy00OGI3LWIwNDUtYzRkZDhlN2NkZGVkXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio2.0635_AL_.jpg",
      "year": "2001",
      "released": "16 Jul. 2001",
      "plot": "David hires Donna, his lodger and the daughter of his best friend. While showing her round the office he discovers a doctored pornographic image of himself. Gareth, due to his covert operations skills, is told to catch the culprit.",
      "imDbRating": "8.0",
      "imDbRatingCount": "2050"
    },
    {
      "id": "tt0664507",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "The Quiz",
      "image": "https://m.media-amazon.com/images/M/MV5BMTUzNTE0NzAyMl5BMl5BanBnXkFtZTgwMDE2MzY2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "23 Jul. 2001",
      "plot": "It is Tim's 30th birthday - he receives a card from Dawn and an unusual inflatable gift from Lee. More importantly, however, it's Quiz Night and there are reputations to be made or lost.",
      "imDbRating": "8.0",
      "imDbRatingCount": "1952"
    },
    {
      "id": "tt0664508",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "Training",
      "image": "https://m.media-amazon.com/images/M/MV5BNmU5ZjNmNjktNzhmNC00ZWIwLWEwNDgtZDQ4MjA5Mzk5OGQzXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.8095_AL_.jpg",
      "year": "2001",
      "released": "30 Jul. 2001",
      "plot": "To fend off the increasing staff disillusionment a Training Day has been scheduled. Dawn's engagement to Lee is on the rocks and Tim begins to think that he may at last have a chance with her.",
      "imDbRating": "8.8",
      "imDbRatingCount": "2242"
    },
    {
      "id": "tt0664506",
      "seasonNumber": "1",
      "episodeNumber": "5",
      "title": "New Girl",
      "image": "https://m.media-amazon.com/images/M/MV5BMzM2MjU1OTE2N15BMl5BanBnXkFtZTgwMjMyNjk0NTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "13 Aug. 2001",
      "plot": "Tim decides there's no future for him in selling paper and decides that he going to go to university and study psychology. After staying out all night, Donna shows up for work late and after David admonishes her announces she had spent the night with someone from the office. David is also interviewing for a new secretary and given the choice of Stuart Foote and Karen Roper selects the blond Karen. Gareth gives a Health and Safety seminar, but Donna is the only employee he's invited. Chris Finch shows up at the office and they all go on their regular Wednesday outing ...",
      "imDbRating": "7.8",
      "imDbRatingCount": "1806"
    },
    {
      "id": "tt0664505",
      "seasonNumber": "1",
      "episodeNumber": "6",
      "title": "Judgement",
      "image": "https://m.media-amazon.com/images/M/MV5BODIxMzU2ODMyNl5BMl5BanBnXkFtZTgwNjcwNTMwMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "20 Aug. 2001",
      "plot": "It's the day to announce the redundancies. Tim tells David he's leaving and is happy to do so. Dawn is actually hoping that she'll be one of the redundancies. When Jennifer Taylor-Clark arrives, she announces to David that she's been promoted and he is in line to replace her. It would mean however that the Slough branch would be reduced in size and bear the brunt of the redundancies. He accepts without hesitation. Gareth takes the news particularly hard. David becomes the hero when he subsequently announces that he's decided to turn down the job to save the branch.",
      "imDbRating": "8.1",
      "imDbRatingCount": "1758"
    }
  ],
  "errorMessage": ""
}