{
  "imDbId": "tt0290978",
  "title": "The Office",
  "fullTitle": "The Office (TV Series 2001–2003)",
  "type": "TVSeries",
  "year": "2001",
  "episodes": [
    {
      "id": "tt0664496",
      "seasonNumber": "2",
      "episodeNumber": "1",
      "title": "Merger",
      "image": "https://m.media-amazon.com/images/M/MV5BOTQ0ZGVkYmMtZWNkNy00YjVjLWIzNTEtZTgwOTlmZWU5NjJjXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "30 Sep. 2002",
      "plot": "It's the day of the big merger. The Swindon branch has closed and several of the staff, including the new manager of the combined Slough Branch, Neil Godwin, arrive. Tim is comfortable in his new role as the senior sales rep while Dave and Gareth continue with their own wacky humor. Dave in particular puts his foot in it with his welcome speech of jokes and anecdotes that go over like a lead balloon. In the party afterward his racist joke leads to a complaint from one of the new intake as does his feeble attempt at humor about drugs, leading Jennifer Taylor-Clark to ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "1698"
    },
    {
      "id": "tt0664497",
      "seasonNumber": "2",
      "episodeNumber": "2",
      "title": "Appraisals",
      "image": "https://m.media-amazon.com/images/M/MV5BYjU5YzVlYzYtMDEzNy00ZWUzLTlhYjMtZDY4Njg2ZDAzMTE2XkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "7 Oct. 2002",
      "plot": "David is doing staff appraisals which most of the staff approach with their usual level of enthusiasm. Part of the process is for them to to give feedback on David's performance and this seems to get most of his attention. Dawn is surprised - and seemingly a bit jealous - when one of the newcomers asks if Tim has a girlfriend. David's offhand remarks sets Neil off and he lets David know exactly who is boss.",
      "imDbRating": "8.1",
      "imDbRatingCount": "1650"
    },
    {
      "id": "tt0664498",
      "seasonNumber": "2",
      "episodeNumber": "3",
      "title": "Party",
      "image": "https://m.media-amazon.com/images/M/MV5BNmFlMzUzYzYtYzRlOS00MDM5LWI2NGQtZGJiMDkzMzMzMDNlXkEyXkFqcGdeQXVyMDgyNjA5MA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "14 Oct. 2002",
      "plot": "David takes on a new look that, not surprisingly perhaps, reflect his new boss Neil's tastes. His already over-inflated ego gets a boost when a training firm offers him a handy sum for a 15 minute training presentation. Neil on the other hand declines the same offer saying he's too busy. The office has a bit of a celebration when one of the new arrivals from Swindon has a birthday. The gifts she receives are a bit on the risqué side but David stuns everyone into silence with his feeble attempt at humor.",
      "imDbRating": "8.3",
      "imDbRatingCount": "1664"
    },
    {
      "id": "tt0664499",
      "seasonNumber": "2",
      "episodeNumber": "4",
      "title": "Motivation",
      "image": "https://m.media-amazon.com/images/M/MV5BNWRhZTk4NWEtNGM2My00MDMxLTg5MGYtY2U0N2ZkMjQyZmQ4XkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "21 Oct. 2002",
      "plot": "David's attempt at being cool includes sporting an earring. His session as a trainer arrives but his unique approach doesn't work very well. Tim and Rachel are carrying on at the office, much to Gareth's dismay. Dawn doesn't seem too pleased either. Neil takes David to task for not thinking things through before making decisions. He also tells him he's more worried about being popular than steering the ship in the right direction.",
      "imDbRating": "8.3",
      "imDbRatingCount": "1656"
    },
    {
      "id": "tt0664500",
      "seasonNumber": "2",
      "episodeNumber": "5",
      "title": "Charity",
      "image": "https://m.media-amazon.com/images/M/MV5BM2Q3ZDdiYzAtZjI3ZS00NDNiLWJlNGQtOTA4OTNjYzQzYmYxXkEyXkFqcGdeQXVyNTA4NzExMDg@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "28 Oct. 2002",
      "plot": "It's the annual comic relief day fund raiser at the office and the employees are up to their usual silliness. Tim raises money from his mates by playing a prank on Gareth. Dawn is selling kisses at reception and the bashful Tim buys one. It leads him to reconsider his relationship with Rachel but he's devastated when he hears of her near-term plans with Lee. Others in the office have their own take on humor but David is again pushed to extremes when the ever popular Neil does a spot on John Travolta imitation from Saturday Night Fever. Humor aside, David has also ...",
      "imDbRating": "8.7",
      "imDbRatingCount": "1745"
    },
    {
      "id": "tt0664501",
      "seasonNumber": "2",
      "episodeNumber": "6",
      "title": "Interview",
      "image": "https://m.media-amazon.com/images/M/MV5BNTQ5MzVlMDYtNWZhZi00YjIzLWI3N2QtZjg0NDVlMDQ2OWFmXkEyXkFqcGdeQXVyMjc0ODQ0NzM@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "4 Nov. 2002",
      "plot": "It's David's last day and he is outwardly very calm about it all. The company has sent a writer to interview him for an article on leadership and his idea is to dictate the contents rather than answer any of her questions. He thinks he has a bright future as a trainer but gets bad news on that front as well. He tries to reverse Neil's decision but to no avail. Tim decides it's time to have a chat with Dawn. Gareth is convinced that he's in line to replace David.",
      "imDbRating": "8.7",
      "imDbRatingCount": "1711"
    }
  ],
  "errorMessage": ""
}