{
  "imDbId": "tt1733785",
  "title": "The Bridge",
  "fullTitle": "The Bridge (TV Series 2011–2018)",
  "type": "TVSeries",
  "year": "2011",
  "language": "en",
  "titleInLanguage": "The Bridge (2011 TV series)",
  "url": "https://en.wikipedia.org/wiki/The_Bridge_(2011_TV_series)",
  "plotShort": {
    "plainText": "The Bridge (Danish: Broen Danish pronunciation:; Swedish: Bron Swedish pronunciation:) is a Nordic noir crime television series created and written by Hans Rosenfeldt. A joint creative and financed production between Sweden's Sveriges Television and Denmark's Danmarks Radio, it has been shown in more than 100 countries.\r\nThe first season begins with the discovery of a dead body exactly on the Denmark–Sweden border, the centre of the Øresund Bridge, which links Malmö with Copenhagen, necessitating a joint investigation. Sofia Helin, as the Swedish police detective Saga Norén, stars in all four seasons. In the first and second, her Danish counterpart, Martin Rohde, is played by Kim Bodnia, and in the third and fourth Henrik Sabroe by Thure Lindhardt. The first season was broadcast on Swedish SVT1 and Danish DR1 during the autumn of 2011, and on the United Kingdom's BBC Four the following spring.\r\nThe second season aired in Sweden, Denmark, Norway, Finland and Iceland during the autumn of 2013, and in the UK in early 2014. The third season was broadcast in Denmark, Sweden and Finland during the autumn of 2015 and in the UK in November 2015. The fourth season premiered on 1 January 2018 in the Nordic countries and was broadcast weekly on BBC Two in the UK from 11 May 2018.",
    "html": "<p>The Bridge (Danish: Broen Danish pronunciation:; Swedish: Bron Swedish pronunciation:) is a Nordic noir crime television series created and written by Hans Rosenfeldt. A joint creative and financed production between Sweden's Sveriges Television and Denmark's Danmarks Radio, it has been shown in more than 100 countries.</p><p>The first season begins with the discovery of a dead body exactly on the Denmark–Sweden border, the centre of the Øresund Bridge, which links Malmö with Copenhagen, necessitating a joint investigation. Sofia Helin, as the Swedish police detective Saga Norén, stars in all four seasons. In the first and second, her Danish counterpart, Martin Rohde, is played by Kim Bodnia, and in the third and fourth Henrik Sabroe by Thure Lindhardt. The first season was broadcast on Swedish SVT1 and Danish DR1 during the autumn of 2011, and on the United Kingdom's BBC Four the following spring.</p><p>The second season aired in Sweden, Denmark, Norway, Finland and Iceland during the autumn of 2013, and in the UK in early 2014. The third season was broadcast in Denmark, Sweden and Finland during the autumn of 2015 and in the UK in November 2015. The fourth season premiered on 1 January 2018 in the Nordic countries and was broadcast weekly on BBC Two in the UK from 11 May 2018.</p>"
  },
  "plotFull": {
    "plainText": "The Bridge (Danish: Broen Danish pronunciation:; Swedish: Bron Swedish pronunciation:) is a Nordic noir crime television series created and written by Hans Rosenfeldt. A joint creative and financed production between Sweden's Sveriges Television and Denmark's Danmarks Radio, it has been shown in more than 100 countries.\r\nThe first season begins with the discovery of a dead body exactly on the Denmark–Sweden border, the centre of the Øresund Bridge, which links Malmö with Copenhagen, necessitating a joint investigation. Sofia Helin, as the Swedish police detective Saga Norén, stars in all four seasons. In the first and second, her Danish counterpart, Martin Rohde, is played by Kim Bodnia, and in the third and fourth Henrik Sabroe by Thure Lindhardt. The first season was broadcast on Swedish SVT1 and Danish DR1 during the autumn of 2011, and on the United Kingdom's BBC Four the following spring.\r\nThe second season aired in Sweden, Denmark, Norway, Finland and Iceland during the autumn of 2013, and in the UK in early 2014. The third season was broadcast in Denmark, Sweden and Finland during the autumn of 2015 and in the UK in November 2015. The fourth season premiered on 1 January 2018 in the Nordic countries and was broadcast weekly on BBC Two in the UK from 11 May 2018.\r\nCast\r\nSofia Helin as Saga Norén, lead homicide detective in Malmö\r\nKim Bodnia as Martin Rohde, lead homicide detective in Copenhagen (series 1–2)\r\nThure Lindhardt as Henrik Sabroe, lead homicide detective in Copenhagen (series 3–4)\r\nDag Malmberg as Hans Petterson, the Police Commissioner in Malmö, later married to Lillian\r\nSarah Boberg as Lillian Larsen, the Police Commissioner in Copenhagen, later married to Hans\r\nRafael Pettersson as John Lundqvist, IT expert for Malmö police\r\nLars Simonsen as Jens Hansen/Sebastian Sandstrod (series 1–2)\r\nPuk Scharbau as Mette Rohde, Martin Rohde's wife (series 1–2)\r\nAnn Petrén as Marie-Louise Norén, Saga's mother (series 3)\r\nGabriel Flores Jair as the Malmö police pathologist\r\nHenrik Lundström as Rasmus Larsson, Swedish junior police detective (series 2–3)\r\nMikael Birkkjær as Jonas Mandrup, lead homicide detective in Copenhagen (series 4)\r\nEmil Birk Hartmann as August Rohde, Martin Rohde's eldest son\r\nChristian Hillborg as Daniel Ferbé, journalist at Aftonposten in Malmö\r\nDietrich Hollinderbäumer as Göran Söringer, property developer\r\nEllen Hillingsø as Charlotte Söringer, Söringer's wife\r\nMagnus Krepper as Stefan Lindberg, social worker in Malmö\r\nMaria Sundbom as Sonja Lindberg, Stefan's sister\r\nKristian Lima de Faria as Åke, Daniel's colleague\r\nSaid Legue as Navid, Saga's colleague\r\nAnette Lindbäck as Gry, Saga's colleague\r\nFanny Ketter as Anja Björk\r\nOle Boisen as Henning Tholstrup, Martin's colleague\r\nYaba Holst as Daniel's chef\r\nJohan Hedenberg as Axel Mössberg\r\nVickie Bak Laursen as Pernille Lindegaard, Danish junior police detective\r\nTova Magnusson as Viktoria Nordgren, owner of the Medisonus pharmaceutical company\r\nSven Ahlström as Oliver Nordgren, Viktoria's brother\r\nCamilla Bendix as Gertrud Kofoed, chief scientist at Medisonus, Oliver's wife\r\nFredrik Hiller as Marcus Stenberg, shipping owner\r\nJulia Ragnarsson as Laura\r\nLotte Munk as Caroline Brandstrup-Julin, the Copenhagen EU environment summit meeting's head organiser,\r\nLotte Merete Andersen as Bodil Brandstrup, Caroline Brandstrup-Julin's sister\r\nPeter Christoffersen as Julian Madsen, owner of Copenhagen IT Consulting\r\nJulie Wright as Anna-Dea\r\nMoritz Lützhøft as Alexander, Caroline's husband\r\nMichael Moritzen as Niels\r\nDar Salim as Peter Thaulow\r\nAlexander Öhrstrand as Niklas\r\nClaes Bang as Claudio (Claus Damgaard)\r\nStephanie Leon as Mathilde\r\nJakob Oftebro as Mads\r\nRonja Svedmark as Kattis\r\nKirsten Olesen as Hanne Thomsen, lead homicide detective in Copenhagen\r\nMaria Kulle as Linn Björkman, the Police Commissioner in Malmö\r\nKatrine Greis-Rosenthal as Alice Sabroe, Henrik Sabroe's wife\r\nOlaf Johannessen as Lars Andersen, Lise Andersen's husband, Copenhagen businessman\r\nSonja Richter as Lise Friis Andersen, politically active vlogger\r\nNicolas Bro as Freddie Holst, Copenhagen businessman and art collector\r\nReuben Sallmander as Claes Sandberg, self-help guru, Freddie Holst's former business partner\r\nLouise Peterhoff as Annika Melander, undertaker\r\nAdam Pålsson as Emil Larsson, art gallery guide\r\nSarah-Sofie Boussnina as Jeanette, a young pregnant woman\r\nAnna Björk as Åsa, Freddie's wife\r\nAnn Petrén as Marie-Louise Norén, Saga's mother\r\nMikael Birkkjær as Jonas\r\nJulie Carlsen as Barbara\r\nAnders Mossling as Frank\r\nFanny Leander Bornedal as Julia\r\nIris Mealor Olsen as Ida\r\nPontus T. Pagler as Richard & Patrik\r\nErik Lönngren as Christoffer\r\nAlexander Behrang Keshtkar as Taariq Shirazi\r\nLisa Linnertorp as Sofie\r\nLars Ranthe as Dan Brolund\r\nLeonard Terfelt as William\r\nSelma Modéer Wiking as Astrid\r\nMichalis Koutsogiannakis as Theo\r\nThomas W. Gabrielsson as Niels\r\nJesper Hyldegaard as Silas Tuxen\r\nSandra Sencindiver as Susanne Winter\r\nElliott Crosset Hove as Kevin\r\nLena Strömdahl as Harriet\r\nMichael Asmussen as Klaus\r\nPatricia Schumann as Nicole\r\nJohannes Bah Kuhnke as Morgan Sonning\r\nIna-Maria Rosenbaum as Solveig\r\nPlot\r\nSeason 1\r\nWhen a body, apparently cut in half at the waist, is discovered in the middle of the Øresund Bridge, which connects Copenhagen with Malmö, placed precisely on the border between the two countries, the investigation falls under the jurisdiction of both the Danish and Swedish police agencies. It is not one corpse but two halves of two separate women: the upper half being that of a female Swedish politician, the lower half being that of a Danish prostitute. Saga Norén from Sweden and Martin Rohde from Denmark lead the murder investigations.\r\nMartin has had a vasectomy. August, the nineteen-year-old son from his first marriage is now living with Martin and Mette, his current wife, with whom Martin has three children. Mette discovers that she is expecting another set of twins. Saga lives alone and rather than have serious relationships, she prefers to pick up men in bars for casual sex. Her poor social skills, her difficulty in empathizing and her inability to channel her emotions make her appear cold, insensitive and blunt but she is completely honest and forthright in all aspects. In the course of the investigation, Martin and Saga develop a close working relationship.\r\nThe investigation quickly escalates as a journalist, Daniel Ferbé, whose SUV was used in the crime, found rigged with a bomb timer getting attention, begins receiving phone calls. The caller, who becomes known as the \"Truth Terrorist\", claims to be committing crimes in order to draw attention to various social problems. A social worker, Stefan Lindberg is an early suspect; his estranged sister Sonja is a poisoning victim. Working together, the Danish and Swedish police conclude that the killer must have a connection with them. After the killer has murdered several people, his true motivation begins to seem personal. They discover that he has been planning his campaign for a period of several years. In the midst of the investigation, Martin has an affair with one of the victims of the Truth Terrorist during a home visit. This affair reaches Mette, who ousts Martin from the Rohde residence.\r\nThe ties between all the Truth Terrorist's targets are pinpointed to Jens Nielsen, an ex-Danish police officer who had supposedly killed himself. Jens is still alive, masquerading as Mette's colleague under false pretences and plastic surgery. Several years earlier, his wife cheated on him having an affair with Martin. Jens has meticulously crafted a plan of revenge for Martin, using his disguise and subsequent crimes to get closer to his family. The death of Jens's wife and children on the bridge in an accident leads Jens to believe that Martin is to blame, after a supposed affair between Jens's wife and Martin. Jens kidnaps Mette and Martin's children (sans August), forcing Martin to try to save them. In Denmark, Saga uncovers that the real target is August, who Jens catfishes to gain access to information about the case and his location. Jens kidnaps August and traps him in a coffin. A standoff occurs between Martin and Jens on the bridge. Saga arrives. Martin asks her to tell him that August is alive, but August has been killed. Upon hearing this, Martin is prevented from killing Jens when Saga shoots both of them. Jens is finally arrested, with Martin left grieving in hospital. With the case closed, Saga drives to Sweden.\r\nSeason 2\r\nSeason two starts 13 months later.\r\nA coaster veers off course and hits the Øresund Bridge. When Saga arrives, there is no crew- just three Swedes and two Danes below deck, chained and in poor condition. Although Martin has gone through a nervous breakdown following his son's death, she arranges for him to be assigned to the case. Two new officers join the investigation, Rasmus and Pernille from Sweden and Denmark, respectively. After the victims on the coaster die from pneumonic plague, a viral video appears in which four disguised eco-terrorists claim responsibility for the incident. They embark on further attacks, including blowing up a petrol tanker and distributing poisoned food. As the police close in on the group, they are all found dead in a shipping container, thus raising the question of whether there are other terrorist cells or a larger group. When Rasmus is found to have obstructed the investigation under false pretences after a visit to the eco-terrorist hideout, Hans ousts him from the investigation.\r\nThe keynote speaker of an upcoming EU climate conference in Copenhagen is one of those killed by poisoning. Caroline Brandstrup-Julin, the head of the conference, appoints Viktoria Nordgren, head of the Medisonus pharmaceutical company, as his replacement. While arranging the congress, Caroline's sister Bodil is asked by Oliver Nordgren, Viktoria's brother and a shareholder of Medisonus, whether she would be willing to write Viktoria's biography; Viktoria has been diagnosed with cancer and has about six months to live.\r\nDuring the retrieval of a sunken boat, seven corpses are found inside. The owner of the boat is Marcus Stenberg. The investigation discovers the identities of the dead and finds that some of them had previously been volunteers in medical studies undertaken by Medisonus, but who had gone missing. The company's security chief tells them that a possible industrial spy gained access to their headquarters.\r\nBodil and Viktoria meet to discuss the content of the biography. Oliver, who lives in the house opposite to his sister's and has secretly installed cameras in her house, watches them make love. When Viktoria asks Oliver to keep out of her life, he confesses that he is responsible for the eco-terrorist acts. When he tries to kill her, Oliver's wife Gertrud arrives to save Viktoria and kills Oliver. The police assume that Oliver acted alone as the ringleader of the plot, but Saga then turns up further evidence that there must be at least one more accomplice.\r\nThe police pathologist shows that two of the dead bodies found earlier contain a deadly virus, which causes internal bleeding and becomes airborne once the victim's blood escapes the body; Saga and Martin guess that Gertrud has developed the virus and infected Viktoria with the intent of spreading it at the EU conference. They manage to alert Caroline and command her to evacuate the building and turn off the ventilation. Eventually, the police arrive at the conference and begin searching for the dying Viktoria. She is eventually discovered in a bathroom by Pernille, who handcuffs her to a pipe to help contain her. Before she can leave, however, Viktoria starts coughing blood, infecting Pernille with the virus. As the area is contained, Martin and Saga communicate with Pernille over the radio, and as Viktoria dies painfully, Pernille decides not to go the same way and commits suicide with her gun. Meanwhile, Gertrud drives to a secluded warehouse where she shoots a video and is chastised by an unidentified man who then executes her for the failure of her plot.\r\nMartin, in an attempt to get over the death of August, begins visiting Jens in prison, to try to get through to him. He is satisfied when he sees that his visits have made an impression, and Jens begins to feel remorse for his crime. When Martin moves back in with his estranged wife Mette, ready to start again, she admits that she no longer loves him. A distraught Martin blames Jens and begins to suffer renewed symptoms of paranoia. Saga hears that Jens has died in prison, apparently a suicide, and suspects Martin of having poisoned him, using the poison he stole from Oliver. The season ends as Martin is arrested, apparently as a result of her intervention, whilst Saga looks on longingly as the friendship between them disappears before her eyes.\r\nSeason 3\r\nSeason three starts 13 months later.\r\nWhen a female body is found on a construction site in Malmö, Sweden – posed in a tableau representing a traditional family – Saga is assigned to the case together with a Copenhagen police officer Hanne Thomsen, who is hostile towards Saga due to her role in the incarceration of Martin Rohde. The victim is identified as Helle Anker, a resident of Copenhagen. Anker, a lesbian married to a Swedish woman, was the pioneer of Denmark's first gender-neutral preschool. Her work had been the target of numerous threats, including vlog posts by right-wing lawyer Lise Frise Andersen, whose husband owns the facility where Anker's body was discovered. While attempting to question Anker's son Morten, a mentally unstable veteran of the war in Afghanistan, Thomsen is wounded by a booby trap. Saga is then assigned a new Danish partner, Henrik Sabroe. The relationship between Saga and Henrik builds quickly, starting a 'friends with benefits' relationship between them. Things complicate even more so for Saga when her mother returns into her life after 20 years, greatly unnerving her.\r\nAnother murder is linked to Andersen's blog. Hans Petterson is abducted and found in critical condition, Linn Björkman takes over as his replacement. The murders are described on the news, leading Emil Larsson, an art gallery employee, to come forward and show that they may have been staged to look like artworks from a collection owned by multi-millionaire Freddie Holst. The police suspect Holst's former business partner, Claes Sandberg. Holst had legally gained control of his company and art collection after Claes was admitted to rehab.\r\nMarie-Louise challenges the assumption that Jennifer was the victim of Munchausen syndrome by proxy, suggesting that it was Saga's inability to connect with her sister emotionally that drove her to suicide. Marie-Louise claims that Saga has been to her home and threatened her. At first, when Marie-Louise is found dead, the assumption is suicide but later it is considered it could be murder. Saga is interviewed by Internal Affairs. The pressure of her mother's investigation and her grief when Hans dies causes Saga to make a serious error during a hostage situation at the Malmö headquarters - injuring a child. This forces Linn to temporarily suspend Saga and replace her with Rasmus, previously shunned by Hans for obstruction of justice in the eco-terrorist case. A woman named Jeanette carrying Freddie's baby is kidnapped and a woman named Annika is discovered. Freddie outfoxes his security detail, goes to the secluded location that the killer has instructed and finds himself with Emil Larsson who explains that he has been enacting justice on those who wronged him during his childhood as a foster child. Freddie was the sperm donor used to conceive him. He takes Freddie and the baby to Saltholm where he has prepared the final artwork. Saga and Henrik are following up on a lead and arrive in time to save the lives of all three. However, Emil commits suicide in custody shortly afterwards by slitting his wrist with a paperclip.\r\nThroughout the season, Henrik is haunted by the mysterious disappearance of his family, consuming narcotics to cope and seeing hallucinations of them in his abode. Six years after she disappeared, the body of Henrik's wife, Alice, is discovered, but no trace of their two daughters; causing him to spiral into depression and overdose on drugs. Saga goes to his house in time to rescue him. Shortly after, Saga is informed that a preliminary hearing is being scheduled on her case and, despite Linn's belief that it will not proceed further than this, she worries that she will lose everything as a result. Henrik, wanting to find his two missing daughters himself, resigns from his job and goes to find Saga, intending to ask her to join him. He eventually finds her at the train tracks where her sister killed herself, looking visibly distressed. Realising she is considering taking her own life on the tracks as the lights of an approaching train appear, Henrik desperately tries to talk her out of it, insisting he needs her expertise to help find his girls. When he attempts to cross the track to her, Saga draws a gun on him and orders him to stay back, before seemingly stepping into the path of an oncoming train. When it passes, however, Henrik sees that she has not gone through with it but has fallen to her knees a short distance away, and goes to comfort her as she begins sobbing. The season ends with Henrik and Saga studying the case information about the disappearance of Henrik's daughters.\r\nSeason 4\r\nTwo years later, having spent more than a year in prison, Saga Norén is released following a retrial which found that there was reasonable doubt about her murdering her mother. Henrik Sabroe investigates the murder of the director general of the Immigration Service, Margarethe Thormond, who has been stoned to death. At first, Henrik is joined by Danish PC Jonas Mandrup, who is seemingly intolerant towards the victims and is cold towards Saga, noting her track record of Danish partners. With her apartment lost upon her arrest and assignment to help Henrik solve the murder case, Saga moves in with him. However, her untreated trauma regarding Hans's death, Emil's sudden suicide and Marie-Louise's investigation against her culminates in a panic attack while driving across the bridge, leading her to start therapy. In the meantime, Henrik attends meetings for addicts. There, he is befriended by a man named Kevin, who became paralysed after jumping off a balcony in a drugged stupor and is a wheelchair user. Two more victims are discovered and Saga realizes that each victim is killed using one method of executing prisoners sentenced to death - suggesting a total of seven victims, leaving four to come. She also notes that the victims are selected not because of their actions but because of something their loved ones have done.\r\nAs more people are murdered, Henrik realizes that the common link between the victims is people associated with Tommy - a gangster and a police informer that Henrik used to know 4 years prior. Tommy had told Henrik when and where his gang would be raiding another gang but the prosecutor refused to follow up on the tip. The raid led to bloodshed and a number of deaths, resulting in the execution of Tommy as a police informer, a fact inadvertently revealed by a journalist whose brother was one of the victims. Henrik and Lilian's involvement in that case makes their loved ones potential victims of future murders because they are considered to have betrayed Tommy. Lillian is distraught when she receives Hans's decapitated head in a bouquet of flowers, causing her to relinquish her power to Jonas. Kevin is revealed as Tommy's son, whose real name is Brian.\r\nMeanwhile, Saga has become pregnant and she considers having an abortion, which upsets Henrik. She agrees to proceed with the pregnancy provided he keeps the baby and raises it on his own. Later, Saga realizes that she is in love with Henrik, so she aborts her pregnancy to remove a possible obstacle to her relationship with him. When she tells Henrik, he is furious and throws her out of the house. Acting on discussions with her therapist, Saga decides to make amends and redoubles her efforts to find Henrik's daughters. A chance encounter with Christoffer, whose father was a minor figure in the investigation, enables her to track down one of Henrik's daughters, Astrid, who is living as the daughter of another man, Frank Wahlberg, in a closed community. Reunited with Henrik, Astrid tells him his other daughter, Anna, died of untreated appendicitis. Alice had initially left Henrik when their relationship broke down, taking the girls in with Frank. She had later died of a \"fall\", when she wanted to leave Frank, with Frank telling the daughters that both their parents had died.\r\nSaga discovers that the murderer is Tommy's former lover, Susanne Winter, personal assistant to the Thormonds. Winter is arrested and provides details about the murders. With the help of her therapist, Saga lets go of her guilt for her sister's suicide. Her therapist suggests that Saga is a police officer to make amends for her sister's suicide. The pathologist, who admires Saga, helps confirm that her mother suffered from a psychological problem and probably caused her sister's death. With her guilt resolved, Saga discovers she can explore life outside of the police.\r\nHowever, when summoned to talk to a former fellow prisoner, Saga learns that Susanne Winter was not acting alone. Jonas is ousted from the investigation when it is discovered that he has leaked information to the press. In the meantime, Henrik is trying to rebuild his relationship with Astrid, who faces difficulty in reentering her previous life as his daughter. Brian unexpectedly comes to visit them one evening to celebrate. When Henrik turns around, Brian stands up from his wheelchair and attacks him. He ties up Henrik and Astrid and asks Henrik to watch as he aims to execute Astrid, in revenge for Tommy's death. Henrik refuses, so Brian shoots her in the leg and says he will continue to maim her until Henrik opens his eyes. A gunshot is heard and Henrik sees that Brian has been shot dead by Saga.\r\nSaga visits Henrik and tells him she is leaving to explore doing the things she wants to do but promises to stay in touch, sharing a kiss before Saga leaves. Returning to Malmö, she stops at the halfway point to throw her police badge into the sea. Her phone rings, and she answers just with her name, omitting her former job title. The show ends with her driving back to Sweden in the distance.\r\nProduction\r\nSeason two started shooting in October 2012, and began to air in Denmark and Sweden on Sunday 22 September 2013 (20.00 in Denmark and 21.00 in Sweden).\r\nIn January 2014, Hans Rosenfeldt was writing the third season and retaining most of the main characters. In June 2014 it was announced that Kim Bodnia, who plays Martin Rohde, would not appear in the third season. Helin and Bodnia suggested that season three would include Saga coping without her only friend, and suggested that Bodnia's character might return sometime in the future. Hans Rosenfeldt confirmed that Bodnia had left the show because Bodnia was not happy about the way that his on-screen character was evolving. He also voiced concerns in an interview about working in Malmö, due to the city's problems with antisemitism, which had made his decision to leave the series easier. Filming started during September 2014.\r\nThe Scandinavian launch of the third season was on 27 September 2015. Sofia Helin is credited alone in the first episode's opening titles, with Thure Lindhardt listed alongside her thereafter. The names, along with the Swedish and Danish titles, were separated by three lines, indicating the third season; they had been separated by one line in the first, and two in the second season.\r\nWhen the fourth season started broadcasting on 1 January 2018 in the Nordic countries, Rosenfeld confirmed that this was to be the final; it was written so as to bring the previous story-lines to a satisfactory conclusion.\r\nMusic\r\nThe opening and closing theme is a cut of the song \"Hollow Talk\" by Copenhagen-based Danish chamber pop band Choir of Young Believers.\r\nBroadcast\r\nSeason 1\r\nSeason one consists of 10 episodes. Each episode is 60 minutes in length. They were first broadcast on Wednesday nights at 8pm in Denmark and 9pm in Sweden.\r\nThe first airing of the series was screened on Sweden's SVT1 weekly from Wednesday 21 September 2011 at 21.00. Denmark's DR1 followed a week later in their 20.00 slot every Wednesday. By screening the final episode immediately after episode 9, DR1 managed to screen episode 10 simultaneously with SVT1.\r\nOn several occasions, The Bridge failed to have sufficient viewers to be placed in SVT1's weekly Top 10 programmes. This was mainly due to competition from commercial broadcaster TV4 with its offering gaining over a million viewers. In Sweden, The Bridge won its time slot for the first five episodes against weak competition from Hawaii Five-0 on TV4. From episode 6, it aired against the popular reality show Berg flyttar in, which would beat The Bridge until the final episode, when they virtually tied.\r\nSveriges Television reported that up to November 2013, the first season had been purchased for broadcasting in 134 countries worldwide and the Daily Telegraph reported in February 2014 that The Bridge was on screen in 174 countries.\r\nIn the UK, the series was shown in weekly two-episode blocks on BBC Four and BBC HD from 21 April 2012. In Germany, it was shown by broadcaster ZDF from 18 March 2012. In Spain is broadcast on AXN it is broadcast on Wednesdays from 8 January 2014 until present waiting for the third season. In Poland, the series was broadcast in double episodes from 2 May to 30 May 2012 on Ale Kino+. In Brazil, the series premiered on +Globosat channel on 13 August 2012 at 22h. The series premiered in Australia on Wednesday, 5 September 2012 on SBS Two, where the first episode had overnight ratings of 101,000 viewers. It was also screened in Israel on September 30 on HOT VoD. On January 9, 2014, it also started screening on yes VoD with both series 1 and 2 available. Co-producers NRK screened the series in Norway with audiences in excess of 600,000 viewers. NRK were also keen to participate in the production of the second series. In Ireland, the show aired on TG4 in autumn 2014.\r\nSeason 2\r\nSeason two consists of 10 episodes. Each episode is 60 minutes in length.\r\nEpisodes were aired close to the Danish/Swedish premiere in the other Nordic countries. Finland's YLE TV1 aired new episodes on the same day with SVT1. Norway's NRK1 and Iceland's RÚV air episodes the following day, with the first episode airing there on 23 September.\r\nIt was shown in the United Kingdom on BBC Four and BBC Four HD on 4 January 2014, as with the first season, in two episode blocks at 21:00 and 22:00.\r\nSeason 3\r\nSeason three consists of 10 episodes. Each episode is 60 minutes in length.\r\nSeason 4\r\nSeason four consists of eight episodes. Each episode is 60 minutes in length. Broadcast started on 1 January 2018 in the Nordic countries, and on 1 March 2018 in Australia on SBS, with the third and fourth season made available on the SBS On Demand service in February 2018. The season was screened weekly on BBC Two in the UK from 11 May 2018.\r\nAwards\r\nIn 2014, The Bridge won two Golden Nymph Awards: for Best European Drama Series, and Best Actor in a Drama Series for Kim Bodnia.\r\nSubsequent foreign versions\r\nUnited Kingdom – France\r\nIn January 2013, Kudos and Shine France announced a joint United Kingdom – France production called The Tunnel starring Stephen Dillane and Clémence Poésy, beginning with the discovery of the body of a French politician at the half-way point of the Channel Tunnel. Broadcast began in October 2013 on Sky Atlantic in the UK and Canal+ in France. An eight-episode second season was broadcast in 2016 and a six-episode third season was broadcast in 2017.\r\nUSA – Mexico\r\nIn July 2012, US network FX ordered a pilot episode to be made for the American audience: El Paso, US – Juárez, Mexico; the bridge being the Bridge of the Americas. The series starred Diane Kruger as U.S. Detective Sonya Cross and Demián Bichir as Mexican Detective Marco Ruiz. Deadline Hollywood announced in February 2013 that FX had picked up the drama series for a 13-episode order and filming began in April. The 13-episode series aired between 10 July 2013 and 2 October. FX ordered a second series in September 2013, which aired in 2014. FX cancelled further seasons of The Bridge.\r\nEstonia – Russia\r\nThe Russian series is set between Narva and Ivangorod; the bridge being the road crossing at Narva. Ingeborga Dapkūnaitė plays the Estonian detective Inga Vermaa, and Mikhail Porechenkov plays the Russian detective Maksim Kazantsev. The NTV network had picked up the drama series for a two-season order and filming began in January 2016.\r\nMalaysia – Singapore\r\nThe series features Bront Palarae (Malaysia) and Rebecca Lim (Singapore). It was first broadcast on 26 November 2018 on HBO Asia—outside Malaysia territory—, alongside a simulcast on the same day on Malaysia's NTV7. The series is also streamed exclusively on Viu. In August 2019, HBO renewed the series for a second season.\r\nGermany – Austria\r\nThe German/Austrian series Der Pass (English: The Pass) (2019) features Julia Jentsch and Nicholas Ofczarek. The plot, with a body discovered on a mountain pass between the two countries, was discussed by Lars Blomgren, The Bridge executive producer, at a panel discussion at the 2018 Gothenburg Film Festival. The 8-episode season premiered on 17 January 2019 on Sky Deutschland.\r\nGreece – Turkey\r\nThe Greek/Turkish series I Gefyra (English: The Bridge) (2022) features Mando Giannikou and Burak Hakkı. The plot begins with the discovery of a body on a bridge between Greece and Turkey, placed exactly on the border between the two countries. The first episode was premiered on the streaming platform Antenna+ on 27 May 2022.",
    "html": "<p>The Bridge (Danish: Broen Danish pronunciation:; Swedish: Bron Swedish pronunciation:) is a Nordic noir crime television series created and written by Hans Rosenfeldt. A joint creative and financed production between Sweden's Sveriges Television and Denmark's Danmarks Radio, it has been shown in more than 100 countries.</p><p>The first season begins with the discovery of a dead body exactly on the Denmark–Sweden border, the centre of the Øresund Bridge, which links Malmö with Copenhagen, necessitating a joint investigation. Sofia Helin, as the Swedish police detective Saga Norén, stars in all four seasons. In the first and second, her Danish counterpart, Martin Rohde, is played by Kim Bodnia, and in the third and fourth Henrik Sabroe by Thure Lindhardt. The first season was broadcast on Swedish SVT1 and Danish DR1 during the autumn of 2011, and on the United Kingdom's BBC Four the following spring.</p><p>The second season aired in Sweden, Denmark, Norway, Finland and Iceland during the autumn of 2013, and in the UK in early 2014. The third season was broadcast in Denmark, Sweden and Finland during the autumn of 2015 and in the UK in November 2015. The fourth season premiered on 1 January 2018 in the Nordic countries and was broadcast weekly on BBC Two in the UK from 11 May 2018.</p><br/><h3>Cast</h3><ul><li>Sofia Helin as Saga Norén, lead homicide detective in Malmö</li><li>Kim Bodnia as Martin Rohde, lead homicide detective in Copenhagen (series 1–2)</li><li>Thure Lindhardt as Henrik Sabroe, lead homicide detective in Copenhagen (series 3–4)</li><li>Dag Malmberg as Hans Petterson, the Police Commissioner in Malmö, later married to Lillian</li><li>Sarah Boberg as Lillian Larsen, the Police Commissioner in Copenhagen, later married to Hans</li><li>Rafael Pettersson as John Lundqvist, IT expert for Malmö police</li><li>Lars Simonsen as Jens Hansen/Sebastian Sandstrod (series 1–2)</li><li>Puk Scharbau as Mette Rohde, Martin Rohde's wife (series 1–2)</li><li>Ann Petrén as Marie-Louise Norén, Saga's mother (series 3)</li><li>Gabriel Flores Jair as the Malmö police pathologist</li><li>Henrik Lundström as Rasmus Larsson, Swedish junior police detective (series 2–3)</li><li>Mikael Birkkjær as Jonas Mandrup, lead homicide detective in Copenhagen (series 4)</li></ul><ul><li>Emil Birk Hartmann as August Rohde, Martin Rohde's eldest son</li><li>Christian Hillborg as Daniel Ferbé, journalist at Aftonposten in Malmö</li><li>Dietrich Hollinderbäumer as Göran Söringer, property developer</li><li>Ellen Hillingsø as Charlotte Söringer, Söringer's wife</li><li>Magnus Krepper as Stefan Lindberg, social worker in Malmö</li><li>Maria Sundbom as Sonja Lindberg, Stefan's sister</li><li>Kristian Lima de Faria as Åke, Daniel's colleague</li><li>Said Legue as Navid, Saga's colleague</li><li>Anette Lindbäck as Gry, Saga's colleague</li><li>Fanny Ketter as Anja Björk</li><li>Ole Boisen as Henning Tholstrup, Martin's colleague</li><li>Yaba Holst as Daniel's chef</li></ul><ul><li>Johan Hedenberg as Axel Mössberg</li><li>Vickie Bak Laursen as Pernille Lindegaard, Danish junior police detective</li><li>Tova Magnusson as Viktoria Nordgren, owner of the Medisonus pharmaceutical company</li><li>Sven Ahlström as Oliver Nordgren, Viktoria's brother</li><li>Camilla Bendix as Gertrud Kofoed, chief scientist at Medisonus, Oliver's wife</li><li>Fredrik Hiller as Marcus Stenberg, shipping owner</li><li>Julia Ragnarsson as Laura</li><li>Lotte Munk as Caroline Brandstrup-Julin, the Copenhagen EU environment summit meeting's head organiser,</li><li>Lotte Merete Andersen as Bodil Brandstrup, Caroline Brandstrup-Julin's sister</li><li>Peter Christoffersen as Julian Madsen, owner of Copenhagen IT Consulting</li><li>Julie Wright as Anna-Dea</li><li>Moritz Lützhøft as Alexander, Caroline's husband</li><li>Michael Moritzen as Niels</li><li>Dar Salim as Peter Thaulow</li><li>Alexander Öhrstrand as Niklas</li><li>Claes Bang as Claudio (Claus Damgaard)</li><li>Stephanie Leon as Mathilde</li><li>Jakob Oftebro as Mads</li><li>Ronja Svedmark as Kattis</li></ul><ul><li>Kirsten Olesen as Hanne Thomsen, lead homicide detective in Copenhagen</li><li>Maria Kulle as Linn Björkman, the Police Commissioner in Malmö</li><li>Katrine Greis-Rosenthal as Alice Sabroe, Henrik Sabroe's wife</li><li>Olaf Johannessen as Lars Andersen, Lise Andersen's husband, Copenhagen businessman</li><li>Sonja Richter as Lise Friis Andersen, politically active vlogger</li><li>Nicolas Bro as Freddie Holst, Copenhagen businessman and art collector</li><li>Reuben Sallmander as Claes Sandberg, self-help guru, Freddie Holst's former business partner</li><li>Louise Peterhoff as Annika Melander, undertaker</li><li>Adam Pålsson as Emil Larsson, art gallery guide</li><li>Sarah-Sofie Boussnina as Jeanette, a young pregnant woman</li><li>Anna Björk as Åsa, Freddie's wife</li><li>Ann Petrén as Marie-Louise Norén, Saga's mother</li></ul><ul><li>Mikael Birkkjær as Jonas</li><li>Julie Carlsen as Barbara</li><li>Anders Mossling as Frank</li><li>Fanny Leander Bornedal as Julia</li><li>Iris Mealor Olsen as Ida</li><li>Pontus T. Pagler as Richard & Patrik</li><li>Erik Lönngren as Christoffer</li><li>Alexander Behrang Keshtkar as Taariq Shirazi</li><li>Lisa Linnertorp as Sofie</li><li>Lars Ranthe as Dan Brolund</li><li>Leonard Terfelt as William</li><li>Selma Modéer Wiking as Astrid</li><li>Michalis Koutsogiannakis as Theo</li><li>Thomas W. Gabrielsson as Niels</li><li>Jesper Hyldegaard as Silas Tuxen</li><li>Sandra Sencindiver as Susanne Winter</li><li>Elliott Crosset Hove as Kevin</li><li>Lena Strömdahl as Harriet</li><li>Michael Asmussen as Klaus</li><li>Patricia Schumann as Nicole</li><li>Johannes Bah Kuhnke as Morgan Sonning</li><li>Ina-Maria Rosenbaum as Solveig</li></ul><br/><h3>Plot</h3><h4>Season 1</h4><p>When a body, apparently cut in half at the waist, is discovered in the middle of the Øresund Bridge, which connects Copenhagen with Malmö, placed precisely on the border between the two countries, the investigation falls under the jurisdiction of both the Danish and Swedish police agencies. It is not one corpse but two halves of two separate women: the upper half being that of a female Swedish politician, the lower half being that of a Danish prostitute. Saga Norén from Sweden and Martin Rohde from Denmark lead the murder investigations.</p><p>Martin has had a vasectomy. August, the nineteen-year-old son from his first marriage is now living with Martin and Mette, his current wife, with whom Martin has three children. Mette discovers that she is expecting another set of twins. Saga lives alone and rather than have serious relationships, she prefers to pick up men in bars for casual sex. Her poor social skills, her difficulty in empathizing and her inability to channel her emotions make her appear cold, insensitive and blunt but she is completely honest and forthright in all aspects. In the course of the investigation, Martin and Saga develop a close working relationship.</p><p>The investigation quickly escalates as a journalist, Daniel Ferbé, whose SUV was used in the crime, found rigged with a bomb timer getting attention, begins receiving phone calls. The caller, who becomes known as the \"Truth Terrorist\", claims to be committing crimes in order to draw attention to various social problems. A social worker, Stefan Lindberg is an early suspect; his estranged sister Sonja is a poisoning victim. Working together, the Danish and Swedish police conclude that the killer must have a connection with them. After the killer has murdered several people, his true motivation begins to seem personal. They discover that he has been planning his campaign for a period of several years. In the midst of the investigation, Martin has an affair with one of the victims of the Truth Terrorist during a home visit. This affair reaches Mette, who ousts Martin from the Rohde residence.</p><p>The ties between all the Truth Terrorist's targets are pinpointed to Jens Nielsen, an ex-Danish police officer who had supposedly killed himself. Jens is still alive, masquerading as Mette's colleague under false pretences and plastic surgery. Several years earlier, his wife cheated on him having an affair with Martin. Jens has meticulously crafted a plan of revenge for Martin, using his disguise and subsequent crimes to get closer to his family. The death of Jens's wife and children on the bridge in an accident leads Jens to believe that Martin is to blame, after a supposed affair between Jens's wife and Martin. Jens kidnaps Mette and Martin's children (sans August), forcing Martin to try to save them. In Denmark, Saga uncovers that the real target is August, who Jens catfishes to gain access to information about the case and his location. Jens kidnaps August and traps him in a coffin. A standoff occurs between Martin and Jens on the bridge. Saga arrives. Martin asks her to tell him that August is alive, but August has been killed. Upon hearing this, Martin is prevented from killing Jens when Saga shoots both of them. Jens is finally arrested, with Martin left grieving in hospital. With the case closed, Saga drives to Sweden.</p><h4>Season 2</h4><p>Season two starts 13 months later.</p><p>A coaster veers off course and hits the Øresund Bridge. When Saga arrives, there is no crew- just three Swedes and two Danes below deck, chained and in poor condition. Although Martin has gone through a nervous breakdown following his son's death, she arranges for him to be assigned to the case. Two new officers join the investigation, Rasmus and Pernille from Sweden and Denmark, respectively. After the victims on the coaster die from pneumonic plague, a viral video appears in which four disguised eco-terrorists claim responsibility for the incident. They embark on further attacks, including blowing up a petrol tanker and distributing poisoned food. As the police close in on the group, they are all found dead in a shipping container, thus raising the question of whether there are other terrorist cells or a larger group. When Rasmus is found to have obstructed the investigation under false pretences after a visit to the eco-terrorist hideout, Hans ousts him from the investigation.</p><p>The keynote speaker of an upcoming EU climate conference in Copenhagen is one of those killed by poisoning. Caroline Brandstrup-Julin, the head of the conference, appoints Viktoria Nordgren, head of the Medisonus pharmaceutical company, as his replacement. While arranging the congress, Caroline's sister Bodil is asked by Oliver Nordgren, Viktoria's brother and a shareholder of Medisonus, whether she would be willing to write Viktoria's biography; Viktoria has been diagnosed with cancer and has about six months to live.</p><p>During the retrieval of a sunken boat, seven corpses are found inside. The owner of the boat is Marcus Stenberg. The investigation discovers the identities of the dead and finds that some of them had previously been volunteers in medical studies undertaken by Medisonus, but who had gone missing. The company's security chief tells them that a possible industrial spy gained access to their headquarters.</p><p>Bodil and Viktoria meet to discuss the content of the biography. Oliver, who lives in the house opposite to his sister's and has secretly installed cameras in her house, watches them make love. When Viktoria asks Oliver to keep out of her life, he confesses that he is responsible for the eco-terrorist acts. When he tries to kill her, Oliver's wife Gertrud arrives to save Viktoria and kills Oliver. The police assume that Oliver acted alone as the ringleader of the plot, but Saga then turns up further evidence that there must be at least one more accomplice.</p><p>The police pathologist shows that two of the dead bodies found earlier contain a deadly virus, which causes internal bleeding and becomes airborne once the victim's blood escapes the body; Saga and Martin guess that Gertrud has developed the virus and infected Viktoria with the intent of spreading it at the EU conference. They manage to alert Caroline and command her to evacuate the building and turn off the ventilation. Eventually, the police arrive at the conference and begin searching for the dying Viktoria. She is eventually discovered in a bathroom by Pernille, who handcuffs her to a pipe to help contain her. Before she can leave, however, Viktoria starts coughing blood, infecting Pernille with the virus. As the area is contained, Martin and Saga communicate with Pernille over the radio, and as Viktoria dies painfully, Pernille decides not to go the same way and commits suicide with her gun. Meanwhile, Gertrud drives to a secluded warehouse where she shoots a video and is chastised by an unidentified man who then executes her for the failure of her plot.</p><p>Martin, in an attempt to get over the death of August, begins visiting Jens in prison, to try to get through to him. He is satisfied when he sees that his visits have made an impression, and Jens begins to feel remorse for his crime. When Martin moves back in with his estranged wife Mette, ready to start again, she admits that she no longer loves him. A distraught Martin blames Jens and begins to suffer renewed symptoms of paranoia. Saga hears that Jens has died in prison, apparently a suicide, and suspects Martin of having poisoned him, using the poison he stole from Oliver. The season ends as Martin is arrested, apparently as a result of her intervention, whilst Saga looks on longingly as the friendship between them disappears before her eyes.</p><h4>Season 3</h4><p>Season three starts 13 months later.</p><p>When a female body is found on a construction site in Malmö, Sweden – posed in a tableau representing a traditional family – Saga is assigned to the case together with a Copenhagen police officer Hanne Thomsen, who is hostile towards Saga due to her role in the incarceration of Martin Rohde. The victim is identified as Helle Anker, a resident of Copenhagen. Anker, a lesbian married to a Swedish woman, was the pioneer of Denmark's first gender-neutral preschool. Her work had been the target of numerous threats, including vlog posts by right-wing lawyer Lise Frise Andersen, whose husband owns the facility where Anker's body was discovered. While attempting to question Anker's son Morten, a mentally unstable veteran of the war in Afghanistan, Thomsen is wounded by a booby trap. Saga is then assigned a new Danish partner, Henrik Sabroe. The relationship between Saga and Henrik builds quickly, starting a 'friends with benefits' relationship between them. Things complicate even more so for Saga when her mother returns into her life after 20 years, greatly unnerving her.</p><p>Another murder is linked to Andersen's blog. Hans Petterson is abducted and found in critical condition, Linn Björkman takes over as his replacement. The murders are described on the news, leading Emil Larsson, an art gallery employee, to come forward and show that they may have been staged to look like artworks from a collection owned by multi-millionaire Freddie Holst. The police suspect Holst's former business partner, Claes Sandberg. Holst had legally gained control of his company and art collection after Claes was admitted to rehab.</p><p>Marie-Louise challenges the assumption that Jennifer was the victim of Munchausen syndrome by proxy, suggesting that it was Saga's inability to connect with her sister emotionally that drove her to suicide. Marie-Louise claims that Saga has been to her home and threatened her. At first, when Marie-Louise is found dead, the assumption is suicide but later it is considered it could be murder. Saga is interviewed by Internal Affairs. The pressure of her mother's investigation and her grief when Hans dies causes Saga to make a serious error during a hostage situation at the Malmö headquarters - injuring a child. This forces Linn to temporarily suspend Saga and replace her with Rasmus, previously shunned by Hans for obstruction of justice in the eco-terrorist case. A woman named Jeanette carrying Freddie's baby is kidnapped and a woman named Annika is discovered. Freddie outfoxes his security detail, goes to the secluded location that the killer has instructed and finds himself with Emil Larsson who explains that he has been enacting justice on those who wronged him during his childhood as a foster child. Freddie was the sperm donor used to conceive him. He takes Freddie and the baby to Saltholm where he has prepared the final artwork. Saga and Henrik are following up on a lead and arrive in time to save the lives of all three. However, Emil commits suicide in custody shortly afterwards by slitting his wrist with a paperclip.</p><p>Throughout the season, Henrik is haunted by the mysterious disappearance of his family, consuming narcotics to cope and seeing hallucinations of them in his abode. Six years after she disappeared, the body of Henrik's wife, Alice, is discovered, but no trace of their two daughters; causing him to spiral into depression and overdose on drugs. Saga goes to his house in time to rescue him. Shortly after, Saga is informed that a preliminary hearing is being scheduled on her case and, despite Linn's belief that it will not proceed further than this, she worries that she will lose everything as a result. Henrik, wanting to find his two missing daughters himself, resigns from his job and goes to find Saga, intending to ask her to join him. He eventually finds her at the train tracks where her sister killed herself, looking visibly distressed. Realising she is considering taking her own life on the tracks as the lights of an approaching train appear, Henrik desperately tries to talk her out of it, insisting he needs her expertise to help find his girls. When he attempts to cross the track to her, Saga draws a gun on him and orders him to stay back, before seemingly stepping into the path of an oncoming train. When it passes, however, Henrik sees that she has not gone through with it but has fallen to her knees a short distance away, and goes to comfort her as she begins sobbing. The season ends with Henrik and Saga studying the case information about the disappearance of Henrik's daughters.</p><h4>Season 4</h4><p>Two years later, having spent more than a year in prison, Saga Norén is released following a retrial which found that there was reasonable doubt about her murdering her mother. Henrik Sabroe investigates the murder of the director general of the Immigration Service, Margarethe Thormond, who has been stoned to death. At first, Henrik is joined by Danish PC Jonas Mandrup, who is seemingly intolerant towards the victims and is cold towards Saga, noting her track record of Danish partners. With her apartment lost upon her arrest and assignment to help Henrik solve the murder case, Saga moves in with him. However, her untreated trauma regarding Hans's death, Emil's sudden suicide and Marie-Louise's investigation against her culminates in a panic attack while driving across the bridge, leading her to start therapy. In the meantime, Henrik attends meetings for addicts. There, he is befriended by a man named Kevin, who became paralysed after jumping off a balcony in a drugged stupor and is a wheelchair user. Two more victims are discovered and Saga realizes that each victim is killed using one method of executing prisoners sentenced to death - suggesting a total of seven victims, leaving four to come. She also notes that the victims are selected not because of their actions but because of something their loved ones have done.</p><p>As more people are murdered, Henrik realizes that the common link between the victims is people associated with Tommy - a gangster and a police informer that Henrik used to know 4 years prior. Tommy had told Henrik when and where his gang would be raiding another gang but the prosecutor refused to follow up on the tip. The raid led to bloodshed and a number of deaths, resulting in the execution of Tommy as a police informer, a fact inadvertently revealed by a journalist whose brother was one of the victims. Henrik and Lilian's involvement in that case makes their loved ones potential victims of future murders because they are considered to have betrayed Tommy. Lillian is distraught when she receives Hans's decapitated head in a bouquet of flowers, causing her to relinquish her power to Jonas. Kevin is revealed as Tommy's son, whose real name is Brian.</p><p>Meanwhile, Saga has become pregnant and she considers having an abortion, which upsets Henrik. She agrees to proceed with the pregnancy provided he keeps the baby and raises it on his own. Later, Saga realizes that she is in love with Henrik, so she aborts her pregnancy to remove a possible obstacle to her relationship with him. When she tells Henrik, he is furious and throws her out of the house. Acting on discussions with her therapist, Saga decides to make amends and redoubles her efforts to find Henrik's daughters. A chance encounter with Christoffer, whose father was a minor figure in the investigation, enables her to track down one of Henrik's daughters, Astrid, who is living as the daughter of another man, Frank Wahlberg, in a closed community. Reunited with Henrik, Astrid tells him his other daughter, Anna, died of untreated appendicitis. Alice had initially left Henrik when their relationship broke down, taking the girls in with Frank. She had later died of a \"fall\", when she wanted to leave Frank, with Frank telling the daughters that both their parents had died.</p><p>Saga discovers that the murderer is Tommy's former lover, Susanne Winter, personal assistant to the Thormonds. Winter is arrested and provides details about the murders. With the help of her therapist, Saga lets go of her guilt for her sister's suicide. Her therapist suggests that Saga is a police officer to make amends for her sister's suicide. The pathologist, who admires Saga, helps confirm that her mother suffered from a psychological problem and probably caused her sister's death. With her guilt resolved, Saga discovers she can explore life outside of the police.</p><p>However, when summoned to talk to a former fellow prisoner, Saga learns that Susanne Winter was not acting alone. Jonas is ousted from the investigation when it is discovered that he has leaked information to the press. In the meantime, Henrik is trying to rebuild his relationship with Astrid, who faces difficulty in reentering her previous life as his daughter. Brian unexpectedly comes to visit them one evening to celebrate. When Henrik turns around, Brian stands up from his wheelchair and attacks him. He ties up Henrik and Astrid and asks Henrik to watch as he aims to execute Astrid, in revenge for Tommy's death. Henrik refuses, so Brian shoots her in the leg and says he will continue to maim her until Henrik opens his eyes. A gunshot is heard and Henrik sees that Brian has been shot dead by Saga.</p><p>Saga visits Henrik and tells him she is leaving to explore doing the things she wants to do but promises to stay in touch, sharing a kiss before Saga leaves. Returning to Malmö, she stops at the halfway point to throw her police badge into the sea. Her phone rings, and she answers just with her name, omitting her former job title. The show ends with her driving back to Sweden in the distance.</p><br/><h3>Production</h3><p>Season two started shooting in October 2012, and began to air in Denmark and Sweden on Sunday 22 September 2013 (20.00 in Denmark and 21.00 in Sweden).</p><p>In January 2014, Hans Rosenfeldt was writing the third season and retaining most of the main characters. In June 2014 it was announced that Kim Bodnia, who plays Martin Rohde, would not appear in the third season. Helin and Bodnia suggested that season three would include Saga coping without her only friend, and suggested that Bodnia's character might return sometime in the future. Hans Rosenfeldt confirmed that Bodnia had left the show because Bodnia was not happy about the way that his on-screen character was evolving. He also voiced concerns in an interview about working in Malmö, due to the city's problems with antisemitism, which had made his decision to leave the series easier. Filming started during September 2014.</p><p>The Scandinavian launch of the third season was on 27 September 2015. Sofia Helin is credited alone in the first episode's opening titles, with Thure Lindhardt listed alongside her thereafter. The names, along with the Swedish and Danish titles, were separated by three lines, indicating the third season; they had been separated by one line in the first, and two in the second season.</p><p>When the fourth season started broadcasting on 1 January 2018 in the Nordic countries, Rosenfeld confirmed that this was to be the final; it was written so as to bring the previous story-lines to a satisfactory conclusion.</p><br/><h3>Music</h3><p>The opening and closing theme is a cut of the song \"Hollow Talk\" by Copenhagen-based Danish chamber pop band Choir of Young Believers.</p><br/><h3>Broadcast</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th rowspan=\"3\">Series</th><th rowspan=\"3\">Episodes</th><th colspan=\"4\">Original broadcast</th><th colspan=\"3\">Average series ratings<br>(millions)</th></tr><tr><th colspan=\"2\">Denmark/Sweden</th><th colspan=\"2\">United Kingdom</th><th rowspan=\"2\">Denmark</th><th rowspan=\"2\">Sweden</th><th rowspan=\"2\">UK</th></tr><tr><th>Start date</th><th>End date</th><th>Start date</th><th>End date</th></tr><tr><td><b>1</b></td><td>10</td><td>21 September 2011 <span style=\"font-size:85%;\">(SWE)</span><br>28 September 2011 <span style=\"font-size:85%;\">(DEN)</span></td><td>23 November 2011</td><td>21 April 2012</td><td>19 May 2012</td><td>0.70</td><td>0.91</td><td>1.05</td></tr><tr><td><b>2</b></td><td>10</td><td>22 September 2013</td><td>24 November 2013</td><td>4 January 2014</td><td>1 February 2014</td><td>0.94</td><td>1.25</td><td>1.48</td></tr><tr><td><b>3</b></td><td>10</td><td>27 September 2015</td><td>29 November 2015</td><td>21 November 2015</td><td>19 December 2015</td><td>0.86</td><td>1.44</td><td>1.49</td></tr><tr><td><b>4</b></td><td>8</td><td>1 January 2018</td><td>18 February 2018</td><td>11 May 2018</td><td>29 June 2018</td><td>0.81</td><td>1.60</td><td>1.67</td></tr></tbody></table><h4>Season 1</h4><p>Season one consists of 10 episodes. Each episode is 60 minutes in length. They were first broadcast on Wednesday nights at 8pm in Denmark and 9pm in Sweden.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Ratings</caption><tbody><tr><th rowspan=\"2\">Ep.</th><th colspan=\"2\">Denmark</th><th colspan=\"2\">Sweden</th><th colspan=\"3\">UK</th></tr><tr><th>First<br>broadcast<br>(<span>DR1</span>)</th><th>Official <span class=\"mw-redirect\">TNS Gallup</span><br>ratings</th><th>First<br>broadcast<br>(<span>SVT1</span>)</th><th>Official <span class=\"new\">MMS</span><br> ratings</th><th>First<br>broadcast<br>(<span>BBC Four</span>)</th><th>Official <span class=\"mw-redirect\">BARB</span><br> UK ratings</th></tr><tr><th>1</th><td>28 September 2011</td><td>876,000 + 108,000 DR HD</td><td>21 September 2011</td><td>1,030,000</td><td>21 April 2012</td><td>1,262,000 (excl. BBC HD)</td></tr><tr><th>2</th><td>5 October 2011</td><td>660,000 + 128,000 DR HD</td><td>28 September 2011</td><td>970,000</td><td>21 April 2012</td><td>1,093,000 (excl. BBC HD)</td></tr><tr><th>3</th><td>12 October 2011</td><td>712,000 + 57,000 DR HD</td><td>5 October 2011</td><td>787,000</td><td>28 April 2012</td><td>1,020,000 (excl. BBC HD)</td></tr><tr><th>4</th><td>19 October 2011</td><td>589,000 + 79,000 DR HD</td><td>12 October 2011</td><td>865,000</td><td>28 April 2012</td><td>890,000 (excl. BBC HD)</td></tr><tr><th>5</th><td>26 October 2011</td><td>652,000 + 86,000 DR HD</td><td>19 October 2011</td><td>925,000</td><td>5 May 2012</td><td>1,084,000 + 102,000 BBC HD</td></tr><tr><th>6</th><td>2 November 2011</td><td>668,000 + 48,000 DR HD</td><td>26 October 2011</td><td>915,000</td><td>5 May 2012</td><td>858,000 + 118,000 BBC HD</td></tr><tr><th>7</th><td>9 November 2011</td><td>668,000 + 71,000 DR HD</td><td>2 November 2011</td><td>834,000</td><td>12 May 2012</td><td>1,040,000 + 100,000 BBC HD</td></tr><tr><th>8</th><td>16 November 2011</td><td>610,000 + 120,000 DR HD</td><td>9 November 2011</td><td>880,000</td><td>12 May 2012</td><td>930,000 + 127,000 BBC HD</td></tr><tr><th>9</th><td>23 November 2011</td><td>803,000 + 89,000 DR HD</td><td>16 November 2011</td><td>945,000</td><td>19 May 2012</td><td>1,190,000 + 112,000 BBC HD</td></tr><tr><th>10</th><td>23 November 2011</td><td>803,000 + 89,000 DR HD</td><td>23 November 2011</td><td>935,000</td><td>19 May 2012</td><td>1,110,000 (excl. BBC HD)</td></tr></tbody></table><p>The first airing of the series was screened on Sweden's SVT1 weekly from Wednesday 21 September 2011 at 21.00. Denmark's DR1 followed a week later in their 20.00 slot every Wednesday. By screening the final episode immediately after episode 9, DR1 managed to screen episode 10 simultaneously with SVT1.</p><p>On several occasions, The Bridge failed to have sufficient viewers to be placed in SVT1's weekly Top 10 programmes. This was mainly due to competition from commercial broadcaster TV4 with its offering gaining over a million viewers. In Sweden, The Bridge won its time slot for the first five episodes against weak competition from Hawaii Five-0 on TV4. From episode 6, it aired against the popular reality show Berg flyttar in, which would beat The Bridge until the final episode, when they virtually tied.</p><p>Sveriges Television reported that up to November 2013, the first season had been purchased for broadcasting in 134 countries worldwide and the Daily Telegraph reported in February 2014 that The Bridge was on screen in 174 countries.</p><p>In the UK, the series was shown in weekly two-episode blocks on BBC Four and BBC HD from 21 April 2012. In Germany, it was shown by broadcaster ZDF from 18 March 2012. In Spain is broadcast on AXN it is broadcast on Wednesdays from 8 January 2014 until present waiting for the third season. In Poland, the series was broadcast in double episodes from 2 May to 30 May 2012 on Ale Kino+. In Brazil, the series premiered on +Globosat channel on 13 August 2012 at 22h. The series premiered in Australia on Wednesday, 5 September 2012 on SBS Two, where the first episode had overnight ratings of 101,000 viewers. It was also screened in Israel on September 30 on HOT VoD. On January 9, 2014, it also started screening on yes VoD with both series 1 and 2 available. Co-producers NRK screened the series in Norway with audiences in excess of 600,000 viewers. NRK were also keen to participate in the production of the second series. In Ireland, the show aired on TG4 in autumn 2014.</p><h4>Season 2</h4><p>Season two consists of 10 episodes. Each episode is 60 minutes in length.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Ratings</caption><tbody><tr><th>Ep.</th><th>First broadcast<br>Denmark and Sweden (<span>DR1</span>/<span>SVT1</span>)</th><th>Danish ratings<br>(<span class=\"mw-redirect\">TNS Gallup</span>)</th><th>Swedish ratings<br>(<span class=\"new\">MMS</span>)</th><th>First broadcast<br>UK (<span>BBC Four</span>)</th><th>UK Overnight ratings</th><th>Official <span class=\"mw-redirect\">BARB</span><br>UK ratings</th></tr><tr style=\"text-align:center;\"><td>1</td><td>22 September 2013</td><td>818,000</td><td>1,287,000</td><td>4 January 2014</td><td>1,100,000</td><td>1,509,000</td></tr><tr style=\"text-align:center;\"><td>2</td><td>29 September 2013</td><td>908,000</td><td>1,232,000</td><td>4 January 2014</td><td>830,000</td><td>1,347,000</td></tr><tr style=\"text-align:center;\"><td>3</td><td>6 October 2013</td><td>871,000</td><td>1,105,000</td><td>11 January 2014</td><td>950,000</td><td>1,491,000</td></tr><tr style=\"text-align:center;\"><td>4</td><td>13 October 2013</td><td>854,000</td><td>1,290,000</td><td>11 January 2014</td><td>830,000</td><td>1,361,000</td></tr><tr style=\"text-align:center;\"><td>5</td><td>20 October 2013</td><td>924,000</td><td>1,237,000</td><td>18 January 2014</td><td style=\"text-align:center;\"></td><td>1,508,000</td></tr><tr style=\"text-align:center;\"><td>6</td><td>27 October 2013</td><td>940,000</td><td>1,205,000</td><td>18 January 2014</td><td style=\"text-align:center;\"></td><td>1,491,000</td></tr><tr style=\"text-align:center;\"><td>7</td><td>3 November 2013</td><td>1,125,000</td><td>1,318,000</td><td>25 January 2014</td><td>973,000</td><td>1,531,000</td></tr><tr style=\"text-align:center;\"><td>8</td><td>10 November 2013</td><td>920,000</td><td>1,163,000</td><td>25 January 2014</td><td>831,000</td><td>1,409,000</td></tr><tr style=\"text-align:center;\"><td>9</td><td>17 November 2013</td><td>989,000</td><td>1,243,000</td><td>1 February 2014</td><td>1,120,000</td><td>1,620,000</td></tr><tr style=\"text-align:center;\"><td>10</td><td>24 November 2013</td><td>1,088,000</td><td>1,367,000</td><td>1 February 2014</td><td>985,000</td><td>1,547,000</td></tr></tbody></table><p>Episodes were aired close to the Danish/Swedish premiere in the other Nordic countries. Finland's YLE TV1 aired new episodes on the same day with SVT1. Norway's NRK1 and Iceland's RÚV air episodes the following day, with the first episode airing there on 23 September.</p><p>It was shown in the United Kingdom on BBC Four and BBC Four HD on 4 January 2014, as with the first season, in two episode blocks at 21:00 and 22:00.</p><h4>Season 3</h4><p>Season three consists of 10 episodes. Each episode is 60 minutes in length.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Ratings</caption><tbody><tr><th rowspan=\"2\">Ep.</th><th colspan=\"2\">Denmark</th><th colspan=\"2\">Sweden</th><th colspan=\"3\">UK</th></tr><tr><th>First<br>broadcast<br>(<span>DR1</span>)</th><th>Official <span class=\"mw-redirect\">TNS Gallup</span><br>ratings</th><th>First<br>broadcast<br>(<span>SVT1</span>)</th><th>Official <span class=\"new\">MMS</span><br> ratings</th><th>First<br>broadcast<br>(<span>BBC Four</span>)</th><th>Official <span class=\"mw-redirect\">BARB</span><br> UK ratings</th></tr><tr><th>1</th><td>27 September 2015</td><td>839,000</td><td>27 September 2015</td><td>1,489,000</td><td>21 November 2015</td><td>1,810,000</td></tr><tr><th>2</th><td>4 October 2015</td><td>813,000</td><td>4 October 2015</td><td>1,471,000</td><td>21 November 2015</td><td>1,530,000</td></tr><tr><th>3</th><td>11 October 2015</td><td>777,000</td><td>11 October 2015</td><td>1,271,000</td><td>28 November 2015</td><td>1,540,000</td></tr><tr><th>4</th><td>18 October 2015</td><td>898,000</td><td>18 October 2015</td><td>1,497,000</td><td>28 November 2015</td><td>1,380,000</td></tr><tr><th>5</th><td>25 October 2015</td><td>878,000</td><td>25 October 2015</td><td>1,415,000</td><td>5 December 2015</td><td>1,407,000</td></tr><tr><th>6</th><td>2 November 2015</td><td>919,000</td><td>2 November 2015</td><td>1,424,000</td><td>5 December 2015</td><td>1,379,000</td></tr><tr><th>7</th><td>9 November 2015</td><td>826,000</td><td>9 November 2015</td><td>1,567,000</td><td>12 December 2015</td><td>1,473,000</td></tr><tr><th>8</th><td>15 November 2015</td><td>909,000</td><td>15 November 2015</td><td>1,398,000</td><td>12 December 2015</td><td>1,411,000</td></tr><tr><th>9</th><td>22 November 2015</td><td>828,000</td><td>22 November 2015</td><td>1,339,000</td><td>19 December 2015</td><td>1,505,000</td></tr><tr><th>10</th><td>29 November 2015</td><td>881,000</td><td>29 November 2015</td><td>1,506,000</td><td>19 December 2015</td><td>1,429,000</td></tr></tbody></table><h4>Season 4</h4><p>Season four consists of eight episodes. Each episode is 60 minutes in length. Broadcast started on 1 January 2018 in the Nordic countries, and on 1 March 2018 in Australia on SBS, with the third and fourth season made available on the SBS On Demand service in February 2018. The season was screened weekly on BBC Two in the UK from 11 May 2018.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Ratings</caption><tbody><tr><th rowspan=\"2\">Ep.</th><th colspan=\"2\">Denmark</th><th colspan=\"2\">Sweden</th><th colspan=\"3\">UK</th></tr><tr><th>First<br>broadcast<br>(<span>DR1</span>)</th><th>Official <span class=\"mw-redirect\">TNS Gallup</span><br>ratings</th><th>First<br>broadcast<br>(<span>SVT1</span>)</th><th>Official <span class=\"new\">MMS</span><br> ratings</th><th>First<br>broadcast<br>(<span>BBC Two</span>)</th><th>Official <span class=\"mw-redirect\">BARB</span><br> UK ratings</th></tr><tr><th>1</th><td>1 January 2018</td><td>832,000</td><td>1 January 2018</td><td>1,647,000</td><td>11 May 2018</td><td>2,066,000</td></tr><tr><th>2</th><td>7 January 2018</td><td>902,000</td><td>7 January 2018</td><td>1,718,000</td><td>18 May 2018</td><td>1,669,000</td></tr><tr><th>3</th><td>14 January 2018</td><td>849,000</td><td>14 January 2018</td><td>1,620,000</td><td>25 May 2018</td><td>1,567,000</td></tr><tr><th>4</th><td>21 January 2018</td><td>788,000</td><td>21 January 2018</td><td>1,566,000</td><td>1 June 2018</td><td>1,563,000</td></tr><tr><th>5</th><td>28 January 2018</td><td>767,000</td><td>28 January 2018</td><td>1,466,000</td><td>8 June 2018</td><td>1,600,000</td></tr><tr><th>6</th><td>4 February 2018</td><td>788,000</td><td>4 February 2018</td><td>1,677,000</td><td>15 June 2018</td><td>1,564,000</td></tr><tr><th>7</th><td>11 February 2018</td><td>740,000</td><td>11 February 2018</td><td>1,546,000</td><td>22 June 2018</td><td>1,651,000</td></tr><tr><th>8</th><td>18 February 2018</td><td>813,000</td><td>18 February 2018</td><td>1,588,000</td><td>29 June 2018</td><td>1,648,000</td></tr></tbody></table><br/><h3>Awards</h3><p>In 2014, The Bridge won two Golden Nymph Awards: for Best European Drama Series, and Best Actor in a Drama Series for Kim Bodnia.</p><br/><h3>Subsequent foreign versions</h3><h4>United Kingdom – France</h4><p>In January 2013, Kudos and Shine France announced a joint United Kingdom – France production called The Tunnel starring Stephen Dillane and Clémence Poésy, beginning with the discovery of the body of a French politician at the half-way point of the Channel Tunnel. Broadcast began in October 2013 on Sky Atlantic in the UK and Canal+ in France. An eight-episode second season was broadcast in 2016 and a six-episode third season was broadcast in 2017.</p><h4>USA – Mexico</h4><p>In July 2012, US network FX ordered a pilot episode to be made for the American audience: El Paso, US – Juárez, Mexico; the bridge being the Bridge of the Americas. The series starred Diane Kruger as U.S. Detective Sonya Cross and Demián Bichir as Mexican Detective Marco Ruiz. Deadline Hollywood announced in February 2013 that FX had picked up the drama series for a 13-episode order and filming began in April. The 13-episode series aired between 10 July 2013 and 2 October. FX ordered a second series in September 2013, which aired in 2014. FX cancelled further seasons of The Bridge.</p><h4>Estonia – Russia</h4><p>The Russian series is set between Narva and Ivangorod; the bridge being the road crossing at Narva. Ingeborga Dapkūnaitė plays the Estonian detective Inga Vermaa, and Mikhail Porechenkov plays the Russian detective Maksim Kazantsev. The NTV network had picked up the drama series for a two-season order and filming began in January 2016.</p><h4>Malaysia – Singapore</h4><p>The series features Bront Palarae (Malaysia) and Rebecca Lim (Singapore). It was first broadcast on 26 November 2018 on HBO Asia—outside Malaysia territory—, alongside a simulcast on the same day on Malaysia's NTV7. The series is also streamed exclusively on Viu. In August 2019, HBO renewed the series for a second season.</p><h4>Germany – Austria</h4><p>The German/Austrian series Der Pass (English: The Pass) (2019) features Julia Jentsch and Nicholas Ofczarek. The plot, with a body discovered on a mountain pass between the two countries, was discussed by Lars Blomgren, The Bridge executive producer, at a panel discussion at the 2018 Gothenburg Film Festival. The 8-episode season premiered on 17 January 2019 on Sky Deutschland.</p><h4>Greece – Turkey</h4><p>The Greek/Turkish series I Gefyra (English: The Bridge) (2022) features Mando Giannikou and Burak Hakkı. The plot begins with the discovery of a body on a bridge between Greece and Turkey, placed exactly on the border between the two countries. The first episode was premiered on the streaming platform Antenna+ on 27 May 2022.</p><br/>"
  },
  "errorMessage": ""
}