{
  "imDbId": "tt2701582",
  "title": "Endeavour",
  "fullTitle": "Endeavour (TV Series 2012–2023)",
  "type": "TVSeries",
  "year": "2012",
  "items": [
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw4254600",
      "warningSpoilers": false,
      "date": "26 July 2018",
      "rate": "10",
      "helpful": "100 out of 106 found this helpful.",
      "title": "A show that proves TV dramas can beat movies any day.",
      "content": "As a Morse addict I was sceptical about a prequel, prequels are very much in vogue, not always successful, the likes of Prime Suspect flopped, but Endeavour has continued to exceed my expectations. The devastation I felt when Morse went, then Poirot, then finally Foyle's War was pretty big, three of the best shows from the last twenty years in my opinion, but Endeavour has taken the mantle.Morse had a unique quality, different to all others, I truly feel that all those behind Endeavour have managed to capture that DNA and bring it to life. Shaun Evans is magical in the role, as the show goes on I feel that he's really managed o capture the essence of John Thaw, he'd have been proud. Roger Allam was the perfect actor to cast as Thursday, he is consistently superb, a joy to watch. I also love the fact that Abigail Thaw was given a recurring role, respectful. That also extends to the appearances of Colin Dexter, until his death in 2017.The Morse series was so rich in detail that Endeavour could well run for several years, the content is so deliciously high in quality that there's plenty to draw from.So many brilliant episodes, favourites of mine include Quartet, Icarus and Neverland, but how do you chose? Please let this run for many years, viewing at its best. 10/10"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3296881",
      "warningSpoilers": false,
      "date": "13 August 2015",
      "rate": "9",
      "helpful": "62 out of 66 found this helpful.",
      "title": "A more than worthy, and almost as good, prequel series to Inspector Morse",
      "content": "Not just a more than worthy prequel series to one of my favourite detective dramas of all time and goes very well with it, but it is a great series on its own as well, one that got off to a good start, though some of the pilot and the first episode had a still-finding-its-feet-feel (understandably), and just keeps getting stronger. It maintains everything that makes Inspector Morse so good, while also containing enough to make it its own.Endeavour looks great, the series throughout is exquisitely photographed and there is something very nostalgic and charming about the atmospherically evoked 1960s period detail. It was also a genius move to keep Barrington Pheloung on board, with his hauntingly beautiful scoring and immortal Inspector Morse theme, while the classical music and operatic excerpts are delightful to hear and fit perfectly (a notable example would be in the Fugue episode, the music having a beautiful and frightfully ominous effect).The series is also every bit as intelligently written as Inspector Morse, it's every bit as entertaining and also every bit as tense. Not all the story lines are very original, but they are always incredibly gripping with the mysteries not being too complicated or the identities being too improbable or obvious, Morse and Thursday's father/son relationship has a lot of warmth, is so well written within the stories and is a large part of the series' appeal and there is some good suspense (chilling in fact in the case of Fugue). Pacing is restrained, but that allows the atmosphere to come through, and pretty much all the same it excels in that aspect. The characters are interesting, and are evolving more and more with every episode, Morse's familiar characteristics are becoming more obvious as the writing develops and Morse and Thursday's relationship more entertaining and heartfelt.Shaun Evans does some powerful, charismatic work as younger Morse, and is getting more and more confident with every episode, showing enough loyalty to John Thaw's iconic Morse while making the character his own too. Roger Allam is also superb, his rapport with Evans always compels and entertains but Thursday is quite a sympathetic character, as well as loyal and firm, and Allam does a lot special with a role that could have been less interesting possibly in lesser hands. All the acting is very good, as is the controlled direction, but it's the performances of Evans and Allam that will always be remembered most vividly.All in all, a more than worthy (if not quite as good, only because I love Inspector Morse with a passion) prequel series and also a great series on its own that keeps getting stronger. 9/10 Bethany Cox"
    },
    {
      "username": "maria-ricci-1983",
      "userUrl": "https://www.imdb.com/user/ur53556132",
      "reviewLink": "https://www.imdb.com/review/rw3626731",
      "warningSpoilers": false,
      "date": "25 January 2017",
      "rate": "9",
      "helpful": "82 out of 86 found this helpful.",
      "title": "Fantastic and surprising in the good sense, despite my initial doubts as a Morse's fan",
      "content": "I deeply love Morse's series, and I deeply love Lewis sequel, each in its own different way. They are two extraordinary detective shows, which I strongly recommend.So I gave Endeavour a try, both with curiosity and with fear that the experience would ruin my memories of the two shows I liked so much.Also, Shaun Evans is physically very different from John Thaw, so this made me cringe even before the start.Having said this, I fell for it from the very first episode.I was surprised to find out that Shaun Evans is a terrific actor, who plays an entirely credible Morse, if not physically, in a seamless psychological continuity which makes you feel the smooth way in which this young Morse would become the older Morse 20 years later, the incipient causticity, the noticeable anger, the budding low-key self-confidence--- This is very skillfully done in the prequel.Both Thaw and Evans play the magic of giving a sexy twist to an unsexy character, without flashing the sexy card or even circumventing all attempts to look hot.Allum plays a marvelous D.C. Thursday and the interaction between them, mentor-pupil, is instrumental to explain how this young Morse ends up being that later Morse.The 60's atmosphere is a plus in the show, very well portrayed and recreated. I'd say that the linking common trait between Morse, Endeavour and Lewis is, yes, their tremendous atmospheric virtue which sets you right on «in that particular place in that particular time».If you like detective stories, you will not be disappointed at all, and even if you are not a Morse or Lewis fan, you will find this show entertaining, alluring and deeply satisfactory by its own right."
    },
    {
      "username": "phantom_fan89",
      "userUrl": "https://www.imdb.com/user/ur4677162",
      "reviewLink": "https://www.imdb.com/review/rw2837003",
      "warningSpoilers": false,
      "date": "22 July 2013",
      "rate": "10",
      "helpful": "182 out of 187 found this helpful.",
      "title": "Great entertainment that deserves to be judged by its own merits",
      "content": "Considering that detective procedurals populate the British television landscape perhaps more than any other genre, one might lament at the prospect of not only another crime drama, but a prequel to one of the most beloved shows, mystery or otherwise, to ever grace the small screen, Inspector Morse. Those who might dismiss Endeavour as just another generic addition to an already overcrowded marketplace, however, would be making a grievous error.The year is 1965 and an eccentric young Detective Constable, Endeavour Morse (Shaun Evans), is making waves at the Oxford City Police with not only his unorthodox but brilliant methods of deduction, but for his refusal to tow the line in order to please the upper echelons of both the Force and society. Under the steadfast guidance of the seasoned and similarly incorruptible, Fred Thursday (Roger Allam), Morse finds himself embroiled in a number of complex cases that expose him to the darker side of life and human nature.Although the series will naturally draw comparisons to its popular predecessor, thanks to the show's gripping narratives, vibrant swinging sixties backdrop and perfect blend of light and dark overtones, Endeavour is easily able to distinguish itself by its own considerable merits. Much of the show's success can be attributed to the ingenious casting of Evans, who puts his own unique stamp on the iconic role. Of course there are parallels to the world weary DI so expertly embodied by John Thaw, but Evans wisely avoids imitation, as the twenty-year age difference between the two interpretations allows the actor to create something fresh. The addition of the character of Fred Thursday is inspired. The street wise, war veteran is the perfect mentor for the idealistic Morse and their relationship is one of the highlights of the series. Fantastic entertainment on every level!http://infilmandtvland.wordpress.com/"
    },
    {
      "username": "kikkapi20",
      "userUrl": "https://www.imdb.com/user/ur54023586",
      "reviewLink": "https://www.imdb.com/review/rw3224091",
      "warningSpoilers": false,
      "date": "21 April 2015",
      "rate": "9",
      "helpful": "52 out of 56 found this helpful.",
      "title": "Stellar TV",
      "content": "High quality television, with its strength being the re-creation of the 1960s, but with 2010s cinematic advances. The main characters are interesting and well-acted, although if you are a steady mystery viewer, you will figure out the ending very soon, which does take away from the suspense.Sean Evans presents the shy, taciturn Morse in his younger days as a detective. He is fetching and keeps his own counsel as to personal matters, and we can see him developing into the ascerbic, driven chief detective we've come to love and respect. Colin Dexter's brill writing launches us here in ENDEAVOR into a seamless transformation into the mature Morse with promise of excellent episodes to come. I'd like to see more of the young Morse and hope this is only one segment of what will surely be a superior backstory for the series. Beautifully written and paced, ENDEAVOR presents a cast of appealing faces and splendidly low key criminal pursuits. Highly recommended. I loved it, am clamoring for more."
    },
    {
      "username": "chasfrost",
      "userUrl": "https://www.imdb.com/user/ur28300413",
      "reviewLink": "https://www.imdb.com/review/rw2787022",
      "warningSpoilers": false,
      "date": "23 April 2013",
      "rate": "10",
      "helpful": "124 out of 132 found this helpful.",
      "title": "Endeavour Magic",
      "content": "Well I have just watched the second episode in the new series and was captivated again. As soon as I had finished watching I watched it again taking in all the things I had missed the first time, I have my dictionary/computer on hand to research some of the phrases and words which adds to the enjoyment. I do not listen to opera or classical music but yearn to know what the wonderful soundtrack comprises of. The characters and relationship of Morse and Thursday is captivating. This is British TV drama at its very best. I just hope it is kept real and Oxford does not become more infamous than 'Denton Woods'! The props and vehicles used during the show are amazing and really create a super feeling for the time."
    },
    {
      "username": "mb-155",
      "userUrl": "https://www.imdb.com/user/ur11920660",
      "reviewLink": "https://www.imdb.com/review/rw2901492",
      "warningSpoilers": false,
      "date": "8 November 2013",
      "rate": "9",
      "helpful": "57 out of 66 found this helpful.",
      "title": "Charming drama",
      "content": "Love this drama. Like the whole idea of a young Morse. Endeavour certainly has his detractors which have the scope to needle him because he is so junior. I suppose this is why he is so grumpy when he is older - getting his own back as it were. So plenty here to allow viewers to hark back to the original drama but also a huge amount of good coming from the new actors. From the use of typewriters to seeing lots of letters. A lack of overt violence, sex and swearing plus excellent story lines. What more can we ask?It's quite possible to marry the indelible Sixties period to that charming music. Roger Allam is excellent at Fred Thursday and Shaun Evans puts a lot of effort into the young Morse. Anton Lesser as chief superintendent Bright is a prig"
    },
    {
      "username": "bobbobwhite",
      "userUrl": "https://www.imdb.com/user/ur2086380",
      "reviewLink": "https://www.imdb.com/review/rw3641386",
      "warningSpoilers": false,
      "date": "17 February 2017",
      "rate": "9",
      "helpful": "19 out of 22 found this helpful.",
      "title": "The very best of PBS",
      "content": "Typically great PBS Mystery, but much better than most. Shaun Evans as Endeavour Morse, with his childlike deer in the headlights look as he detects each weekly crime, portrays the young but already very cerebral Morse whom we remember so well as an elder copper from the great 90s PBS show. Evans' as Morse, with his deceptive appearance of innocence and naivete, works through crimes with gentle but bulldog persistence until all is sorted. Roger Allam as his stoic, staid, habit-bound chief detective is also superb in his unwavering, fatherly support of Morse throughout, is always 100% credible as a mid-level Brit copper. Anton Lesser plays his daft martinet of a superintendent as not totally stupid, but he is perfectly underwhelming on purpose as Supt. Bright(hmmm)and is much more consumed with political kissing up than he is with the drudgery of everyday police work. He leaves that to the minions. All in all, great ensemble work, with very individual and unique characterizations in all roles, and I must say that I am so pleased that PBS has not fallen into the common American TV crime show trap of extending one crime into seeming infinity, week after slogging week. Thanks to this Morse, all is saved, and solved, in each show. The gorgeous and dramatic theme and various opera and classical pieces play a significant qualitative part too, as they both did in the original Morse show. Anticipate, then enjoy."
    },
    {
      "username": "lyninbyron",
      "userUrl": "https://www.imdb.com/user/ur65900546",
      "reviewLink": "https://www.imdb.com/review/rw4246883",
      "warningSpoilers": false,
      "date": "21 July 2018",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "ABSOLUTELY BRILLIANT BRITISH DRAMA",
      "content": "Endeavour is the young Morse. I've just finished the fifth season and I want more more more please! A BIG well done to all involved. The plots, characters, acting and sets, everything, was spot on and most enjoyable and thought provoking. Thank you ...o....and... more please!"
    },
    {
      "username": "grandmabrat",
      "userUrl": "https://www.imdb.com/user/ur8320431",
      "reviewLink": "https://www.imdb.com/review/rw4052424",
      "warningSpoilers": false,
      "date": "4 February 2018",
      "rate": "10",
      "helpful": "27 out of 30 found this helpful.",
      "title": "Liked Morse but I really love Endeavour.",
      "content": "Inspector Morse was just about the best show on tv but I love Endeavour even more. The character is like Morse but younger, a little bit naive and learning his way around. The ability to see through mysteries is just as good but more characters in the show gives you a better look at the character of Endeavour Morse. I could watch this show every week, if only they could produce them that fast."
    },
    {
      "username": "npvarley",
      "userUrl": "https://www.imdb.com/user/ur48846129",
      "reviewLink": "https://www.imdb.com/review/rw8955303",
      "warningSpoilers": false,
      "date": "28 March 2023",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Magnificent TV!",
      "content": "Well, it's now all over. Endeavour has ended it's 11 year, 9 season run. The finale was beautifully crafted into one of the greatest final episodes of any series, ever.This series has given us wonderful stories, great scripts, superb acting and wonderful Oxford backdrops. It has managed to weave an intricate web that keeps everything on track to lead into the original Morse series.All the main cast were fantastic, but special mention to Shaun Evans, Roger Allam and Anton Lesser, who were standouts. It's scandalous that Evans and Allam didn't receive a single BAFTA nomination for their work in Endeavour.The series will be sorely missed, but we have a great body of work to revisit."
    },
    {
      "username": "BeneCumb",
      "userUrl": "https://www.imdb.com/user/ur32764997",
      "reviewLink": "https://www.imdb.com/review/rw3296708",
      "warningSpoilers": false,
      "date": "13 August 2015",
      "rate": "9",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Surprisingly meaty and captivating British crime series",
      "content": "/refers to series 1 and 2/ Well, I have always been fond of British crime films, including Inspector Morse and Lewis, but usually I am not into prequels or something new created by virtue of popularity wave... But Endeavour captivated me from the very beginning: solid and distinct performances (particularly Shaun Evans as Endeavour Morse and Roger Allam as Fred Thursday, but also most in minor roles), wise and learned Oxford atmosphere, realistic overview of life in Britain in the 1960ies - to name a few...True, a few plots are not smooth and the solutions are trivial, but, on the other hand, shooting chases, over-sophisticated events and characters uttering \"witty\" remarks could be entertaining to follow, but they are certainly far from real life. Thus, if you liked Inspector Morse and Lewis, you will like Endeavour as well - although the title let many shrug their shoulders at first as Morse's first name is not generally known... In my country, for instance, the title sounds as \"Young Inspector Morse\".Well done! I am truly looking forward to the next series, especially as Series 2 ended in an intriguing manner...PS Seasons 3-7 are still catchy, even if some plots are less elaborate. Please continue... And you should watch them in sequence.PPS Season 8 is still pleasant... I have read that BBC has ordered 8 seasons but the final scenes are not a total closure.PPPS Season 9 is seemingly the last... Pity, but everybody is welcome to (re)watch Inspector Morse with John Thaw..."
    },
    {
      "username": "simonv-648-292176",
      "userUrl": "https://www.imdb.com/user/ur22781773",
      "reviewLink": "https://www.imdb.com/review/rw2782951",
      "warningSpoilers": false,
      "date": "15 April 2013",
      "rate": "9",
      "helpful": "88 out of 96 found this helpful.",
      "title": "The difficult first of the 'real' series is an amazing success",
      "content": "After the surprisingly well handled one-off prequel, Shaun Evans is back as the young detective Endeavour Morse. Just like the original series with John Thaw, its success hinges on the charisma and personality of the lead character. Here Evans excels and carries the whole thing off handsomely. His performance portrays obvious knowledge and classical moral values but also an eager curiosity, drive and a naive humility which reminds us throughout this episode that he is a new recruit of sorts. The only issue I could find to quibble with is the almost Sherlockian mythology that has been added. In the original he was a knowledgeable and sharp police detective whereas here he is very much the deductive crime-fighter. As a Conan Doyle fan I do approve a little of the mythologizing but it needs to keep its roots with the original and down to earth."
    },
    {
      "username": "edwinvanboekel",
      "userUrl": "https://www.imdb.com/user/ur30350482",
      "reviewLink": "https://www.imdb.com/review/rw3638557",
      "warningSpoilers": false,
      "date": "12 February 2017",
      "rate": "10",
      "helpful": "30 out of 32 found this helpful.",
      "title": "Every episode an evening well spend.",
      "content": "I have always been a great fan of the original series, featuring John Thaw as Morse. I always thought the stories were well written and televised. Which is as important. These series have me in awe. I am completely blown away. I am a great fan of the Montalbano character in the RaiUno-series. Also well written. And well televised. But this is something different. There is suspense. There is character. And there is life. I don't know how to put it otherwise. Of course we know how Morse became in his later life, but there was no history, no growing- up. These series show the growth of the character, by an actor who seems to be raised to do this. Shaun Evans does a masterpiece. I am afraid he'll be Endeavour Morse for the rest of his life."
    },
    {
      "username": "jdhb-768-61234",
      "userUrl": "https://www.imdb.com/user/ur45967980",
      "reviewLink": "https://www.imdb.com/review/rw3861497",
      "warningSpoilers": true,
      "date": "18 November 2017",
      "rate": "10",
      "helpful": "14 out of 17 found this helpful.",
      "title": "Initial fears blown away",
      "content": "As a devotee of the original 'Inspector Morse' series, I have to say that I was less than convinced by the idea of a 'prequel' series. Thankfully, my fears were misplaced.'Endeavour' stands on its own as a great detective series and also gives genuine background and insights to the life of the later DCI Morse. Not only are there these plus points but the casting is brilliant and the acting superb. The way in which issues such as Morse's limp and delight in real ale and fine whisky came about are shown to us so simply, in context and without artifice.Shaun Evans makes an excellent Morse and Roger Allam is outstanding as his boss, Inspector Fred Thursday; Anton Lesser, as a tortured Chief Superintendent, torn between his duty to authority and his belief in justice is every bit as good. Sean Rigby fills the sizable boots of the later to be Chief Superintendent Jim Strange admirably and Dakota Blue Richards makes a surprisingly effective appearance as WPC Shirley Truelove, a WPC who makes her mark quietly and without fuss, even in the relatively chauvinistic days of the 1960s. The supporting cast, most notably Fred Thursday's wife and daughter, fit the 1960s bill absolutely perfectly, indeed Caroline O'Neill, as Win Thursday, could have been born to play her role.Endeavour Morse does what he has to do. He follows the clues and evidence meticulously to wherever they lead which, in the 1960s, was not always popular with the establishment of the day. He is, himself, a tortured man who finds relationships difficult and hides behind his detecting as a result. Viewers see his vulnerabilities; his lack of confidence with girl friends and failure to say what he really feels, how he gained his 'limp', his reluctance when it comes to bothering with examinations and promotion. Endeavour is a flawed man who, nonetheless, has great qualities, all of which is further explored when he eventually becomes DCI Morse. Endeavour is, without doubt, a triumph. One can only hope that it has many more years to run."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw8125824",
      "warningSpoilers": false,
      "date": "8 May 2022",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Excellent detective series",
      "content": "(Review updated after Season 9)Before he was Inspector Morse, Endeavour Morse was a junior police detective in the Oxford area. We follow the various murder cases of the early days of his career and how he solved them in inimitable fashion. We also see Morse's private side and how this shaped him.Intriguing, engaging crime drama series. You don't have to have watched Inspector Morse - I hadn't - to be engaged. It's a series that stands on its own two feet.Some very interesting, complex crimes and Morse has to use every bit of his intelligence, knowledge and nose for crime to solve them. The private life of Morse also makes for interesting viewing and provides a more three-dimensional view of Morse.On downside to this complexity is that there is no way you can figure out who did it, let alone the background and their motives. That removes a bit of the enjoyment as one of the great things about the best detective stories is trying to figure out in advance who did it and why (and, sometimes, how). Conversely, you don't want it to be too easy so it is a fine line to walk. Here though the solution often seems to come out of the blue.It's a minor price to pay for the added level of intricacy to the episodes' plots.As the show goes the writing gets even better with season-wide plots being added to the mix. There was always a continuity to Endeavour episodes but the broader plot was fairly minor, more showing the hindrances and internal politics Morse has to overcome in order to get ahead. By Season 6 the broader plot is a major storyline and shapes the path of the season, linking the individual episodes into one continuous story.For this reason the show generally gets better as it goes on, peaking in Season 6.That said, the writing weakened after Season 6. Season 8's plots (the first two episodes in particular) aren't as watertight as before, feeling a touch contrived. Still great though, just not up to the very high standard of previous seasons.Season 9, the final season, ties things up nicely with a great season-wide mystery that links back to previous seasons plus some excellent single-episode mysteries. There's a large degree of closure at the end combined with links to the Inspector Morse series, wrapping things up rather neatly. The final scene is quite emotional."
    },
    {
      "username": "tomgoblin-44620",
      "userUrl": "https://www.imdb.com/user/ur62182332",
      "reviewLink": "https://www.imdb.com/review/rw3803872",
      "warningSpoilers": false,
      "date": "11 September 2017",
      "rate": "10",
      "helpful": "15 out of 18 found this helpful.",
      "title": "No spoiler here, just an encouragement to embrace \"Endeavour\"",
      "content": "Evans and Allam stand on the shoulders of giants.Just as the X-15 and Mercury programs of NASA set the stage for Apollo and its trip to higher levels, \"Endeavour\" goes to the next heights.Thaw and his loyal sergeant as portrayed by Whately were the foundation...\"Endeavour\" is the next phase of this timeless story line.Let me be so bold as to say I think Thaw would be proud.The entire series has been brilliant, for so many years. Many thanks to all the people behind the scenes, writers, directors and producers.They, like Rolls Royce, have kept the highest quality in a time when this is extraordinarily difficult and unique.I am grateful and more than slightly in awe of this effort."
    },
    {
      "username": "xanadu-75602",
      "userUrl": "https://www.imdb.com/user/ur64688672",
      "reviewLink": "https://www.imdb.com/review/rw3387412",
      "warningSpoilers": false,
      "date": "4 January 2016",
      "rate": "10",
      "helpful": "66 out of 70 found this helpful.",
      "title": "Best Ever!",
      "content": "In my opinion they are the best English series ever! Absolutely great story lines, great actors... The Pilot episode is just wonderful. I have already seen both series 1 & 2 and cannot wait for series 3. You can watch each episode separately without following the order of episodes. I recommend it to those who love English series and not just those... also who ever likes a good thriller! It's very difficult to figure out who is the killer and that's what I like about those series too.Those series give you some explanations to Inspector Morse and his behavior."
    },
    {
      "username": "chris-holdroyd",
      "userUrl": "https://www.imdb.com/user/ur33613678",
      "reviewLink": "https://www.imdb.com/review/rw2996312",
      "warningSpoilers": true,
      "date": "11 April 2014",
      "rate": "9",
      "helpful": "37 out of 42 found this helpful.",
      "title": "Endeavour stands on its own, even if you've never seen Thaw's Morse",
      "content": "This is a far more intellectual treatment of the later Morse, or Lewis characters. The writing is excellent and doesn't try to explain more than necessary, allowing the audience to draw nearer, and in doing so, draw their own conclusions.Shaun begs us to reach out to understand him, as he gives more away with his subtle expressions than words. It's as though he practised his scenes, first pretending to be mute. It's been said the show is too Sherlockian, to which I would agree. Solving too many complex pieces of the crime puzzle in just one moment or scene, or crowded in near the ending, makes Endeavor's character less human, less embraceable. The writers should focus on a more smooth process of revelation to enhance our connection with the young Morse and avoid over time, to produce episodes so formulaic as the Lewis series.Often, these out of period TV series appear fake, say, recreating the 60's with actors displaying a 2014 social maturity. Fortunately, but not perfectly, it sidesteps most of the usual puddles. However, Thursday's daughter is anachronistically wise, balanced and foolish, all at once. Definitely a time traveller. And the antagonistic sergeant is overdue for his comeuppance. One of my most favourite authenticity ingredients is the little old man with the huge grin. He's placed in every episode, like Hitchcock shows in every one of his own films. He reminds me of the six-fingered man at Michael Cain's bar in Get Carter. Nice touch!Thursday and Morse are the standard bearers of quality acting for this series. I have rarely been so excited to see more. Keep up the great work!"
    },
    {
      "username": "peterrichboy",
      "userUrl": "https://www.imdb.com/user/ur73908325",
      "reviewLink": "https://www.imdb.com/review/rw4666399",
      "warningSpoilers": false,
      "date": "17 February 2019",
      "rate": "9",
      "helpful": "11 out of 14 found this helpful.",
      "title": "A prequel that surpasses the original",
      "content": "I have to confess to not being a fan of Morse. I always felt the stories set amongst the leafy spires of Oxford University were all very much the the same old tale of a student from the past seeking revenge for some foul play that happened in a cricket match 30 years earlier.Endeavour on the other hand set in the 1960s, shows Morse in his younger days as a DS under the tutelage of inspector Thursday played superbly by Roger Allum, who really steals the show as an old school copper, who gets results his way much to to Morces frustration who is very much about doing things the right way and by the book.The show still retains it's fair amount of implausible murders but feels grittier and more believable. The 1960s are beautifully observed through the cars, clothes and fashion for the time, as well as throwing in many of the significant events of the era. 9/10"
    },
    {
      "username": "daydreaming_overthinking_woman",
      "userUrl": "https://www.imdb.com/user/ur145760660",
      "reviewLink": "https://www.imdb.com/review/rw8304162",
      "warningSpoilers": false,
      "date": "6 July 2022",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "I'm officially hooked!",
      "content": "Endeavour is a suspenseful British crime drama that takes place in Oxford throughout the 1960s and up until the early 1970s. I had seen previews for this show many times. I never gave it a try because I figured I wouldn't like it, since I'm not typically a fan of 21st century shows that are meant to take place in a time that's long gone. But one Sunday evening I came across the episode Terminus, and I was immediately drawn in! The acting was brilliant from all of the cast members. The story contained so much intrigue. I didn't even know the main character was supposed to be Inspector Morse until I went online and read about the show after watching Terminus. It's fascinating to see him portrayed as a young man. Also, this is one of few period pieces where the characters' outfits and hairstyles are accurate to the decade of the show's setting, so I commend the writers and other people who were responsible for bringing the story to life for doing their research. After getting absorbed into that episode I will definitely be watching this series again."
    },
    {
      "username": "OoX1966",
      "userUrl": "https://www.imdb.com/user/ur83107013",
      "reviewLink": "https://www.imdb.com/review/rw4051145",
      "warningSpoilers": false,
      "date": "2 February 2018",
      "rate": "10",
      "helpful": "29 out of 32 found this helpful.",
      "title": "The last TV show worth watching",
      "content": "With the decline of good TV shows, I will say that Endeavour continues to be the best show I've seen in quite some time. The characters, cast and plots are perfect. As of today, Endeavour is the only TV show that I spare time to watch."
    },
    {
      "username": "shashrvacai",
      "userUrl": "https://www.imdb.com/user/ur27125033",
      "reviewLink": "https://www.imdb.com/review/rw7522718",
      "warningSpoilers": false,
      "date": "7 November 2021",
      "rate": "9",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Amazing show!",
      "content": "Maintains everything that makes Inspector Morse so good, while also containing enough to make it its own. Every bit as entertaining and every bit as tense as the original drama. Pacing is restrained, but that allows the atmosphere to come through. The characters are interesting, and are evolving more and more with every episode. All the acting is very good, but it's the performances of Evans and Allam that will always be remembered most vividly."
    },
    {
      "username": "Kirpianuscus",
      "userUrl": "https://www.imdb.com/user/ur61197531",
      "reviewLink": "https://www.imdb.com/review/rw5068013",
      "warningSpoilers": false,
      "date": "18 August 2019",
      "rate": "",
      "helpful": "5 out of 6 found this helpful.",
      "title": "special",
      "content": "Shaun Evans performance was the basic motif for see this serie who escapes to the circle of cases, to gives not only solutions to terrible murders but who use , in brilliant manner the nuances for realistic portraits. A serie about people looking for accepting themselves and for respect their profound values. A sort of revelation because it does not propose Princes Charmings , heroes or models but a sort of confessions about vulnerabilities becoming the axis of strong men."
    },
    {
      "username": "pswanson00",
      "userUrl": "https://www.imdb.com/user/ur2418932",
      "reviewLink": "https://www.imdb.com/review/rw5119380",
      "warningSpoilers": false,
      "date": "14 September 2019",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Superb",
      "content": "During the last 24 hours I've watched all 4 episodes of the 6th season of Endeavour. It is such a good show that I can hardly express it. The writing, acting, production values, and direction are as fine as those in any film I've ever seen. Now I have to wait in hope for season 7."
    }
  ],
  "errorMessage": ""
}