{
  "imDbId": "tt2701582",
  "title": "Endeavour",
  "fullTitle": "Endeavour (TV Series 2012–2023)",
  "type": "TVSeries",
  "year": "2012",
  "language": "en",
  "titleInLanguage": "Endeavour (TV series)",
  "url": "https://en.wikipedia.org/wiki/Endeavour_(TV_series)",
  "plotShort": {
    "plainText": "Endeavour is a British television detective drama series on ITV. It is a prequel to the long-running Inspector Morse series. Shaun Evans portrays the young Endeavour Morse beginning his career as a detective constable, and later as a detective sergeant, with the Oxford City Police CID. Endeavour is the third of the Inspector Morse series following the original Inspector Morse (1987–2000) and its spin-off, Lewis (2006–2015).\r\nNine series were made, set from 1965 to 1972. After a pilot episode broadcast in 2012, set in 1965, the first series was broadcast in 2013, also set in 1965. The second series was set in 1966, while the third and fourth series were both set in 1967. The fifth series, with six episodes, was set in 1968, and the sixth series picked up eight months later, set in 1969. Series seven, set in 1970, began screening in February 2020, with the first episode shown in the United States on Masterpiece Theatre on 9 August that year.\r\nIn August 2019, ITV announced that the series had been recommissioned for an eighth series. Filming for series eight, set in 1971, began in March 2021 and concluded in June 2021. Filming for the ninth series, set in 1972, began on 22 May 2022. The next day, it was confirmed that it would be the last. Filming ended on 26 August 2022, and the series was broadcast between 26 February and 12 March 2023.",
    "html": "<p>Endeavour is a British television detective drama series on ITV. It is a prequel to the long-running Inspector Morse series. Shaun Evans portrays the young Endeavour Morse beginning his career as a detective constable, and later as a detective sergeant, with the Oxford City Police CID. Endeavour is the third of the Inspector Morse series following the original Inspector Morse (1987–2000) and its spin-off, Lewis (2006–2015).</p><p>Nine series were made, set from 1965 to 1972. After a pilot episode broadcast in 2012, set in 1965, the first series was broadcast in 2013, also set in 1965. The second series was set in 1966, while the third and fourth series were both set in 1967. The fifth series, with six episodes, was set in 1968, and the sixth series picked up eight months later, set in 1969. Series seven, set in 1970, began screening in February 2020, with the first episode shown in the United States on Masterpiece Theatre on 9 August that year.</p><p>In August 2019, ITV announced that the series had been recommissioned for an eighth series. Filming for series eight, set in 1971, began in March 2021 and concluded in June 2021. Filming for the ninth series, set in 1972, began on 22 May 2022. The next day, it was confirmed that it would be the last. Filming ended on 26 August 2022, and the series was broadcast between 26 February and 12 March 2023.</p>"
  },
  "plotFull": {
    "plainText": "Endeavour is a British television detective drama series on ITV. It is a prequel to the long-running Inspector Morse series. Shaun Evans portrays the young Endeavour Morse beginning his career as a detective constable, and later as a detective sergeant, with the Oxford City Police CID. Endeavour is the third of the Inspector Morse series following the original Inspector Morse (1987–2000) and its spin-off, Lewis (2006–2015).\r\nNine series were made, set from 1965 to 1972. After a pilot episode broadcast in 2012, set in 1965, the first series was broadcast in 2013, also set in 1965. The second series was set in 1966, while the third and fourth series were both set in 1967. The fifth series, with six episodes, was set in 1968, and the sixth series picked up eight months later, set in 1969. Series seven, set in 1970, began screening in February 2020, with the first episode shown in the United States on Masterpiece Theatre on 9 August that year.\r\nIn August 2019, ITV announced that the series had been recommissioned for an eighth series. Filming for series eight, set in 1971, began in March 2021 and concluded in June 2021. Filming for the ninth series, set in 1972, began on 22 May 2022. The next day, it was confirmed that it would be the last. Filming ended on 26 August 2022, and the series was broadcast between 26 February and 12 March 2023.\r\nEpisodes\r\nPlot\r\nSet in the 1960s and 1970s in Oxford, the series centres on the early career of Endeavour Morse (Shaun Evans) after he left Lonsdale College in Oxford University late in his third year without completing his degree, spent a short time in the Royal Corps of Signals as a cipher clerk and then joined the Carshall-Newtown Police.\r\nPilot (2012)\r\nIn the pilot episode, having been transferred to CID after only two years as a uniformed police constable, the young Morse soon becomes disillusioned with law enforcement and begins writing a resignation letter. Before he can resign, Morse is sent with other detectives from the Carshall-Newtown Police to the Oxford City Police's Cowley Police Station to assist in investigating the case of a missing fifteen-year-old schoolgirl.\r\nHaving studied at Oxford gives Morse advantages and disadvantages when dealing with Oxford's \"town and gown\" divide. During the pilot episode he tenders his resignation, but his superior, veteran Detective Inspector Fred Thursday (Roger Allam), sees in him an unblemished detective whom he can trust and takes him under his wing to be his new \"bag man\" (aide), replacing a corrupt detective sergeant.\r\nSeries 1 (2013)\r\nThe first full series begins with Morse transferring to the Oxford City Police in 1965 following a double-murder investigation that took place during the pilot episode. Morse is taken under the wing of Inspector Thursday. Thursday names Morse his designated \"bag man\" and shows him the ropes as Morse begins to solve a string of complex multiple-murders, much to the envy and annoyance of some of his superiors, particularly Detective Sergeant Jakes and Chief Superintendent Bright. Morse displays his genius in solving intricate murders, including several with opera connections. Thursday and fellow-Constable Strange try to steer the young Morse into taking his sergeant's exam, so that he may be relieved of \"general duties\" and become Thursday's official \"bag man\". In the last episode of the series, Morse is shot while attempting to apprehend a murderer and is placed on light duties. At the same time, he comes to terms with the death, in December 1965, of his cold, unfeeling father.\r\nSeries 2 (2014)\r\nSeries 2 begins in 1966 with Morse returning to active duty at Cowley police station, after spending several months on light duty at Oxfordshire (County) Police's Witney station, under the direction of DI Bart Church. Morse is received warmly by Ch Supt Bright and DS Jakes, as DI Thursday begins to keep a more watchful eye on him. As a delayed result of being shot, Morse begins to suffer from stress and paranoia and increases his alcohol consumption. Despite making several mistakes in the investigation, Morse solves the case, impressing his superiors. During the investigation he suffers concussion after being struck over the head and is cared for by his nurse neighbour, Monica Hicks, in whom he takes an interest. At the same time, PC Strange enters into Freemasonry with many of Oxford's elite, and DI Thursday's daughter, Joan, begins to take an interest in Morse. During the course of several cases, pieces of circumstantial evidence go missing, and a murder suspect threatens Morse by claiming association with powerful men who will not take kindly to interference.\r\nIn the final episode, the looming merger of city and county police and misgivings about corruption lead Thursday to consider retirement, in response to strong hints from Ch Supt Bright about age and health. Disheartened by this, Morse speculates to Monica about leaving the police and going abroad with her. Assistant Chief Constable Clive Deare asks Thursday and Morse to investigate corruption within the police and council covertly. Morse is sent to a rendezvous, where he is ambushed by corrupt officers, and Thursday is lured to Blenheim Vale, a derelict former wayward boys' home, where there was rampant sexual and physical abuse (of which Jakes was a victim). Morse escapes the ambush and goes to support Thursday, who is shot by Deare, a participant in the abuse at Blenheim Vale. Deare tells Morse he has framed him for the murder of Chief Constable Rupert Standish. Deare is about to kill Morse when he is shot dead by a girl who had also been abused at Blenheim Vale and who then kills herself. Bright and Strange arrive with backup and an ambulance. As Thursday is being loaded into an ambulance, Morse is arrested by officers from another force for the murder of Standish.\r\nSeries 3 (2016)\r\nSeries 3 begins in spring 1967. Morse is cleared of the murder of Chief Constable Standish and the records in the case of Blenheim Vale are sealed for 50 years. DI Thursday is discharged from hospital, but the bullet in or near his lung could not be removed and has resulted in a serious, chronic cough. Monica has come to realise that she and Morse have gone their separate ways. Strange is promoted to sergeant and Morse considers his future after his time on remand but, with Thursday's encouragement, Morse returns to active duty investigating a murder following a disappearance at a funfair on Cowley Green. After solving a faked kidnapping and tainted fruit being sold at a local supermarket, DS Jakes survives a time-bomb, retires from the force and leaves Oxford. WPC Shirley Trewlove joins the station, to the obvious delight of Chief Superintendent Bright. Strange takes Jakes's place as detective sergeant but assures Morse that they are still friends even though he is now his superior. Thursday shows frequent signs of outbursts against suspects unwilling to co-operate during the investigations, and even uses violence as a way of extracting information. Morse questions whether he is 'sergeant material', Thursday assures him he is more fitted to be an inspector (an even higher rank than sergeant).\r\nIn the final episode, Morse finally sits his sergeant's exam and completes his paper well within the time allowed. An armed robbery takes place at a bank where Joan Thursday works. Morse happens to be in the bank at the time, investigating a killing and payroll robbery. As the robbery goes awry, Joan and Morse are kidnapped by the robbers who realize their identities. Joan sees a more brutal side of her father as he tried to rescue her and Morse from the now ruthless and murdering robbers. Although the robbers are arrested, Joan is emotionally affected by the ordeal. In a coughing fit, Thursday finally coughs up the bullet fragment, which has plagued him. A distraught Joan leaves Oxford despite encouragement from Morse to stay. Realising that Joan has gone, Thursday encounters Morse outside his house and realises that he saw Joan leave.\r\nSeries 4 (2017)\r\nSeries 4 covers summer to autumn 1967. Joan Thursday is still away and Morse learns that his sergeant's exam paper went \"missing\", which meant automatic failure. Bright finds out that Morse's exam paper was the only one missing and suggests to him that some of his enemies might be sabotaging his career. After solving another complex murder case, Morse refuses to be affected by failing his sergeant's exam and stays in Oxford. He locates Joan in Leamington Spa, in a relationship with a married man. She declines Morse's plea to return to Oxford. It is later learned that he agreed not to reveal her whereabouts to her father.\r\nIn the final episode, Morse gets a job offer in London and considers leaving Oxford. DI Thursday discovers Morse's note of Joan's address and pays her a visit. Thursday, realizing that his daughter is just being used by this man, tries to warn him off with words and punches. She later arrives unannounced at Morse's home. He notices a bruise on her face - clearly from her paramour. She expresses that she does not know what to do, Morse suddenly proposes marriage. She declines, presuming he has offered merely out of pity. He sends her away with some cash, only to later receive a telephone call saying Joan is in hospital. When he arrives at the hospital, the doctor mistakes him for a husband and shares that she has \"fallen down the stairs\" and regrets the accident has caused a miscarriage. After averting disaster at a nuclear power plant, Thursday is promoted to the rank of chief inspector and Morse is promoted to detective sergeant. They are both secretly awarded the George Medal for their actions.\r\nSeries 5 (2018)\r\nSeries 5 takes place between April and November 1968, various investigations continue during the creation of Thames Valley Constabulary from the city and county police forces. The future of Cowley police station is in question, along with those of some of the key members of the team there. Morse, now a DS, is assigned with a new DC, George Fancy, and becomes annoyed with his lack of initiative and basic investigative skill. Joan has moved back to Oxford and occasionally bumps into Morse around Oxford. DCI Thursday's plans for retirement hang in the balance.\r\nThe final episode, with the gang rivalry looming all over town, includes the death of DC George Fancy (who gets hit by bullets that do not match any of those of the crossfire between gangs that occurred where he was found) and the departure of WPC Shirley Trewlove to Scotland Yard, while the rest come to terms with the death and the closure of the Cowley Station. The series concludes with Morse asking Joan Thursday if her offer to go for coffee was still open (after he had said no to having coffee with her earlier in the series). In the last scene, they look at one another before Joan responds.\r\nSeries 6 (2019)\r\nSeries 6 starts in July 1969, eight months after the end of series five, with Morse sporting a moustache for the first time. Bright, now assigned to Traffic Division, appears in a road safety film and becomes known to locals as the \"Pelican Man\". Thursday has been demoted to Detective Inspector and now works at Castle Gate Police Station, where he is joined by Morse and Strange. Castle Gate is run by former adversaries DCI Ronnie Box and DS Alan Jago who frequently abuse their authority and mistreat suspects and younger officers (particularly Morse) and take credit for Morse's work. Thursday secretly does not like them either but reminds Morse to mind how he goes. It is revealed that Joan declined Morse's offer for coffee and stated any relationship with him could never work. However, they are thrown together during a missing person case. Thursday, Morse and Bright eventually discover that Box and Jago are involved in police corruption. After Box takes Thursday to meet some of Box's powerful and corrupt superiors, Thursday punches Box for his part in the corruption. DeBryn is kidnapped and held hostage at a factory site, where Morse, Thursday, Strange and Bright confront the corrupt officers. Jago admits that he murdered George Fancy with Box's gun. During the confrontation, Box (having switched sides) and Jago shoot each other. In the end, Jago dies, Box is rushed to hospital, and Box's superiors are immediately arrested and charged with corruption, including Councillor Clive Burkitt. Box's fate is not given, other than Strange saying he is \"50-50\". Bright announces his transfer out of Traffic and assumes command of Castle Gate with Thursday as acting DCI and DS Strange and DS Morse. Morse then buys Eddie Nero’s old drug house and begins the process of refurbishing.\r\nSeries 7 (2020)\r\nSeries 7 begins with 'Oracle'. On New Year's Eve, 1969, which sees Morse on leave in Venice with an Italian woman. On New Year's Day, the body of Molly Andrews is found by a canal with a broken neck. Morse returns to Oxford a week into the murder investigation, and he and Thursday clash over progress in the case after Bright suggests Morse look over the evidence. Dr Naomi Benford believes a subject of her psychic studies might have had a vision about the murder. Dr Benford is later found at the bottom of a stairwell, murdered by a colleague who misinterpreted her behaviour as romantic interest. The police suspect that Molly was killed by her boyfriend, Carl Sturgiss, although Morse has doubts. Morse meets Ludo, an old acquaintance with whom he strikes up a friendship. Morse is later introduced to Ludo's wife, Violetta, who is Morse's lover from Venice.\r\nIn Episode 2, 'Raga' shows tensions between the Asian community and far-right political groups in the build-up to a general election. A delivery driver from an Indian restaurant is found dead in the home of a celebrity chef. Morse breaks things off with Violetta but she turns up at his home and they embrace. Thursday is haunted by Molly Andrews' murder and regularly walks along the towpath where it happened.\r\nIn Episode 3, 'Zenana', the body of Brigit Mulcahy is found by the canal. Carl Sturgiss also knew Brigit and is arrested and charged with both her and Molly's murders. Thursday blames Morse for the fact they didn't charge Sturgiss earlier. However, soon the body of undergraduate Petra Connolly is found near the canal, and Sturgiss is released. Morse and Thursday argue again and Morse says he'll put in for a transfer. Morse has been conducting an affair with Violetta, but Ludo finds out about the affair and Violetta chooses to stay with her husband. Thursday has to break it to Bright that his wife, who was in remission from cancer, has died in a freak accident. Thursday is angry when Morse connects her death to his investigations into a spate of 'freak accidents' around Oxford, but Strange agrees to help. Morse believes the 'accidents' are due to someone buying up life insurance policies, then committing murder to cash in. Strange finds Sturgiss in a house where one of the accidents happened, and Morse comes in time to save Strange when he discovers Sturgiss has his sister captive. The towpath murders were committed by Sturgiss after all, and the murder of Petra by a copycat. Morse goes to Venice, as he believes Ludo is the person running the insurance scam and causing the accidents. Ludo meets Morse in a cemetery, attacks Violetta and flees. Ludo is shot by Thursday, who has followed Morse; Violetta then dies in Morse's arms.\r\nSeries 8 (2021)\r\nSeries 8 takes place in 1971 and consists of three episodes.\r\nIn 'Striker', Morse solves a case of a Northern Irish footballer being threatened by paramilitaries.\r\nIn 'Scherzo', the team investigates the murder of a cab driver near a naturist resort and the seemingly unconnected shooting of a Catholic priest in his confessional. Jim Strange begins a timid courtship of Joan Thursday.\r\nFinally, in 'Terminus', Sam Thursday goes AWOL in Northern Ireland, causing conflict in the Thursday family. Morse finds himself stranded at an abandoned hotel during a snowstorm with a group of bus passengers and no communication with the outside world, dealing with the consequences of a murder spree at the hotel eight years earlier.\r\nMorse is drinking too much and struggling to cope with the effects of events in Series 7, including the death of Violetta. He is missing work, and the drinking is beginning to affect his performance. His colleagues are aware of the problem and feel the need to handle it carefully. Fred Thursday repeats his advice to Morse that \"the drink is a good servant but a poor master\" and advises him to take leave and get help.\r\nSeries 9 (2023)\r\nSeries 9 was the show’s last. It is set in 1972 and consists of three episodes.\r\nIn 'Prelude' Endeavour's phased return to Castle Gate kicks off with a homecoming when Sam Thursday returns from a military tour in Northern Ireland. Two bodies are discovered in an Oxford Concert Orchestra and a third body is found murdered in an abandoned warehouse.\r\nIn the penultimate episode, 'Uniform', Endeavour notices a link between the woman's disappearance and her former employer, which demands his attention. Meanwhile reports are flooding in of stolen cars and criminal damage caused by a group of undergraduates wreaking havoc.\r\nIn the last episode of the prequel, 'Exeunt', Endeavour's last investigation takes him to a series of funerals, DS Strange marries Joan Thursday and transfers to Kidlington, Fred Thursday transfers far away for his family safety and CS Bright looks forward to a well earned retirement. Bright informs Morse that it looks likely that Cowley station will be re-opening and suggests that Morse might also consider a transfer to become bagman to DCI McNutt. This brings things full circle to the beginning of the original Inspector Morse series.\r\nCast\r\nProduction\r\nITV broadcast a television pilot in the UK on 2 January 2012; in the United States, PBS aired it on 1 July 2012.\r\nITV commissioned a first series of four new episodes, filmed during summer 2012, and broadcast them from 14 April to 5 May 2013.\r\nIt was announced on 5 June 2013 that, due to the success of series 1, including consistently high ratings, ITV had commissioned a second series of four episodes. Filming commenced in Oxford in September 2013. The second series was televised from 30 March to 20 April 2014.\r\nOn 24 September 2014, ITV confirmed that a third series had been ordered. Before that third series was screened on ITV, Evans told the Oxford Mail, \"It's not like we have a six-year contract, there's none of that. It's day by day, year by year. I think this one is really good. We'll know when it airs if there's an audience for it and if we feel there's another place to take these characters.\" The third series was broadcast from 3 January to 24 January 2016.\r\nIn February 2016, ITV announced that a fourth series had been commissioned, which Roger Allam confirmed to the Oxford Mail, with filming beginning in late spring 2016. To mark the 30th anniversary of Morse on television, the series features several early Morse characters and cameos by actors from the original series. The fourth series debuted on 8 January 2017.\r\nThe fifth series began on 4 February 2018 with six episodes.\r\nThe sixth series was shot during 2018 and premiered on 10 February 2019 in the UK. There were four episodes.\r\nThe seventh series was screened on 9 February 2020 and set in 1970 with three episodes.\r\nThe eighth series was broadcast on 12 September 2021, once again with three episodes and set in 1971.\r\nThe ninth series was broadcast on 26 February 2023 and had the final three episodes, set in 1972 (fifteen years prior to the events that began the original Inspector Morse era).\r\nReferences to earlier series\r\nA number of references to the Inspector Morse series were included in the pilot, serving to introduce younger versions of characters who appeared in the original series or to place iconic series or character elements into the film. For example, in an early episode, Morse states that he abstains from alcohol. After he faints at the mortuary, Thursday encourages him to drink a glass of real ale, after which Morse is shown drinking several pints before the episode's close.\r\nIn the closing moments, as Thursday asks Morse where he sees himself in 20 years, Morse looks in the rear view mirror and the face of Thaw is shown in the reflection. At the same time, the original series music begins and plays through the credits. This effect is repeated in the closing scenes of the last episode of series 9.\r\nIn addition to the face-in-the-mirror scene, Endeavour includes another recognition of Thaw. His daughter, Abigail Thaw, appears as the editor of the Oxford Mail, whom Morse questions. Abigail Thaw, daughter of the original Morse actor John Thaw, played the part of Dorothea Frazil (the name is a pun on Frazil ice vs. thaw) in a scene at the Oxford Mail. At the end of the scene she pauses for a moment, then asks if she has met him before, eventually noting it may have been \"in another life\".\r\nThe fourth episode of Series 3, \"Coda\" has Jerome Hogg in a small role; Hogg was also seen in the Morse episode \"Greeks Bearing Gifts\". Additionally, the episode \"Prey\" (Series 3, Episode 3) is set at Crevecoeur Hall, the setting for \"The Dead of Winter\" (episode 13) of Lewis. One of the last lines Series 8, episode 3 (Terminus), \"It's beginning to thaw\", is also considered to be a nod to Thaw's portrayal of the character.\r\nReception\r\nNoting that the series received upwards of 6.5 million viewers, Mark Sweeny writing in The Guardian stated that any decision to commission a subsequent series should be easy. Upon its US premiere, Los Angeles Times critic Robert Lloyd called it a \"suitably complicated and pictorially engaging work of period suburban mystery.\"\r\nCritics have been generally favourable, though even positive reviews have commented that the show's murder-mystery plots are occasionally unsatisfying convoluted puzzles or come to a \"rushed, melodramatic and fairly preposterous conclusion.\"\r\nHome media\r\nA region 2 DVD of the pilot at 89 minutes long was released on 9 January 2012, but, as reviewers on Amazon.co.uk have noted, does not contain the full show and many scenes aired on ITV have been cut out. A complete edition running at 98 minutes was released on 26 January 2012.\r\nSeries 1 was released on DVD on 6 May 2013, Series 2 on 5 May 2014, Series 3 on 1 February 2016, and Series 4 on 30 January 2017.",
    "html": "<p>Endeavour is a British television detective drama series on ITV. It is a prequel to the long-running Inspector Morse series. Shaun Evans portrays the young Endeavour Morse beginning his career as a detective constable, and later as a detective sergeant, with the Oxford City Police CID. Endeavour is the third of the Inspector Morse series following the original Inspector Morse (1987–2000) and its spin-off, Lewis (2006–2015).</p><p>Nine series were made, set from 1965 to 1972. After a pilot episode broadcast in 2012, set in 1965, the first series was broadcast in 2013, also set in 1965. The second series was set in 1966, while the third and fourth series were both set in 1967. The fifth series, with six episodes, was set in 1968, and the sixth series picked up eight months later, set in 1969. Series seven, set in 1970, began screening in February 2020, with the first episode shown in the United States on Masterpiece Theatre on 9 August that year.</p><p>In August 2019, ITV announced that the series had been recommissioned for an eighth series. Filming for series eight, set in 1971, began in March 2021 and concluded in June 2021. Filming for the ninth series, set in 1972, began on 22 May 2022. The next day, it was confirmed that it would be the last. Filming ended on 26 August 2022, and the series was broadcast between 26 February and 12 March 2023.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Series</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th><th scope=\"col\" rowspan=\"2\" style=\"padding:0 8px\">Average UK viewers (millions)<br>inc. <span class=\"mw-redirect\">ITV HD</span> and ITV+1</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"3\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Pilot</span></span></span></span></th><td colspan=\"2\" style=\"padding:0.2em 0.4em\">2 January 2012</td><td>8.21</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">4</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">14 April 2013</td><td style=\"padding:0 8px\">5 May 2013</td><td>7.04</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">4</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">30 March 2014</td><td style=\"padding:0 8px\">20 April 2014</td><td>6.78</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">4</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">3 January 2016</td><td style=\"padding:0 8px\">24 January 2016</td><td>6.82</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">4</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">8 January 2017</td><td style=\"padding:0 8px\">29 January 2017</td><td>7.07</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">4 February 2018</td><td style=\"padding:0 8px\">11 March 2018</td><td>6.67</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">4</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">10 February 2019</td><td style=\"padding:0 8px\">3 March 2019</td><td>7.16</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>7</span></span></span></span></th><td colspan=\"2\">3</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">9 February 2020</td><td style=\"padding:0 8px\">23 February 2020</td><td>6.80</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>8</span></span></span></span></th><td colspan=\"2\">3</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">12 September 2021</td><td style=\"padding:0 8px\">26 September 2021</td><td>5.22</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>9</span></span></span></span></th><td colspan=\"2\">3</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">26 February 2023</td><td style=\"padding:0 8px\">12 March 2023</td><td>5.13</td></tr></tbody></table><br/><h3>Plot</h3><p>Set in the 1960s and 1970s in Oxford, the series centres on the early career of Endeavour Morse (Shaun Evans) after he left Lonsdale College in Oxford University late in his third year without completing his degree, spent a short time in the Royal Corps of Signals as a cipher clerk and then joined the Carshall-Newtown Police.</p><h4>Pilot (2012)</h4><p>In the pilot episode, having been transferred to CID after only two years as a uniformed police constable, the young Morse soon becomes disillusioned with law enforcement and begins writing a resignation letter. Before he can resign, Morse is sent with other detectives from the Carshall-Newtown Police to the Oxford City Police's Cowley Police Station to assist in investigating the case of a missing fifteen-year-old schoolgirl.</p><p>Having studied at Oxford gives Morse advantages and disadvantages when dealing with Oxford's \"town and gown\" divide. During the pilot episode he tenders his resignation, but his superior, veteran Detective Inspector Fred Thursday (Roger Allam), sees in him an unblemished detective whom he can trust and takes him under his wing to be his new \"bag man\" (aide), replacing a corrupt detective sergeant.</p><h4>Series 1 (2013)</h4><p>The first full series begins with Morse transferring to the Oxford City Police in 1965 following a double-murder investigation that took place during the pilot episode. Morse is taken under the wing of Inspector Thursday. Thursday names Morse his designated \"bag man\" and shows him the ropes as Morse begins to solve a string of complex multiple-murders, much to the envy and annoyance of some of his superiors, particularly Detective Sergeant Jakes and Chief Superintendent Bright. Morse displays his genius in solving intricate murders, including several with opera connections. Thursday and fellow-Constable Strange try to steer the young Morse into taking his sergeant's exam, so that he may be relieved of \"general duties\" and become Thursday's official \"bag man\". In the last episode of the series, Morse is shot while attempting to apprehend a murderer and is placed on light duties. At the same time, he comes to terms with the death, in December 1965, of his cold, unfeeling father.</p><h4>Series 2 (2014)</h4><p>Series 2 begins in 1966 with Morse returning to active duty at Cowley police station, after spending several months on light duty at Oxfordshire (County) Police's Witney station, under the direction of DI Bart Church. Morse is received warmly by Ch Supt Bright and DS Jakes, as DI Thursday begins to keep a more watchful eye on him. As a delayed result of being shot, Morse begins to suffer from stress and paranoia and increases his alcohol consumption. Despite making several mistakes in the investigation, Morse solves the case, impressing his superiors. During the investigation he suffers concussion after being struck over the head and is cared for by his nurse neighbour, Monica Hicks, in whom he takes an interest. At the same time, PC Strange enters into Freemasonry with many of Oxford's elite, and DI Thursday's daughter, Joan, begins to take an interest in Morse. During the course of several cases, pieces of circumstantial evidence go missing, and a murder suspect threatens Morse by claiming association with powerful men who will not take kindly to interference.</p><p>In the final episode, the looming merger of city and county police and misgivings about corruption lead Thursday to consider retirement, in response to strong hints from Ch Supt Bright about age and health. Disheartened by this, Morse speculates to Monica about leaving the police and going abroad with her. Assistant Chief Constable Clive Deare asks Thursday and Morse to investigate corruption within the police and council covertly. Morse is sent to a rendezvous, where he is ambushed by corrupt officers, and Thursday is lured to Blenheim Vale, a derelict former wayward boys' home, where there was rampant sexual and physical abuse (of which Jakes was a victim). Morse escapes the ambush and goes to support Thursday, who is shot by Deare, a participant in the abuse at Blenheim Vale. Deare tells Morse he has framed him for the murder of Chief Constable Rupert Standish. Deare is about to kill Morse when he is shot dead by a girl who had also been abused at Blenheim Vale and who then kills herself. Bright and Strange arrive with backup and an ambulance. As Thursday is being loaded into an ambulance, Morse is arrested by officers from another force for the murder of Standish.</p><h4>Series 3 (2016)</h4><p>Series 3 begins in spring 1967. Morse is cleared of the murder of Chief Constable Standish and the records in the case of Blenheim Vale are sealed for 50 years. DI Thursday is discharged from hospital, but the bullet in or near his lung could not be removed and has resulted in a serious, chronic cough. Monica has come to realise that she and Morse have gone their separate ways. Strange is promoted to sergeant and Morse considers his future after his time on remand but, with Thursday's encouragement, Morse returns to active duty investigating a murder following a disappearance at a funfair on Cowley Green. After solving a faked kidnapping and tainted fruit being sold at a local supermarket, DS Jakes survives a time-bomb, retires from the force and leaves Oxford. WPC Shirley Trewlove joins the station, to the obvious delight of Chief Superintendent Bright. Strange takes Jakes's place as detective sergeant but assures Morse that they are still friends even though he is now his superior. Thursday shows frequent signs of outbursts against suspects unwilling to co-operate during the investigations, and even uses violence as a way of extracting information. Morse questions whether he is 'sergeant material', Thursday assures him he is more fitted to be an inspector (an even higher rank than sergeant).</p><p>In the final episode, Morse finally sits his sergeant's exam and completes his paper well within the time allowed. An armed robbery takes place at a bank where Joan Thursday works. Morse happens to be in the bank at the time, investigating a killing and payroll robbery. As the robbery goes awry, Joan and Morse are kidnapped by the robbers who realize their identities. Joan sees a more brutal side of her father as he tried to rescue her and Morse from the now ruthless and murdering robbers. Although the robbers are arrested, Joan is emotionally affected by the ordeal. In a coughing fit, Thursday finally coughs up the bullet fragment, which has plagued him. A distraught Joan leaves Oxford despite encouragement from Morse to stay. Realising that Joan has gone, Thursday encounters Morse outside his house and realises that he saw Joan leave.</p><h4>Series 4 (2017)</h4><p>Series 4 covers summer to autumn 1967. Joan Thursday is still away and Morse learns that his sergeant's exam paper went \"missing\", which meant automatic failure. Bright finds out that Morse's exam paper was the only one missing and suggests to him that some of his enemies might be sabotaging his career. After solving another complex murder case, Morse refuses to be affected by failing his sergeant's exam and stays in Oxford. He locates Joan in Leamington Spa, in a relationship with a married man. She declines Morse's plea to return to Oxford. It is later learned that he agreed not to reveal her whereabouts to her father.</p><p>In the final episode, Morse gets a job offer in London and considers leaving Oxford. DI Thursday discovers Morse's note of Joan's address and pays her a visit. Thursday, realizing that his daughter is just being used by this man, tries to warn him off with words and punches. She later arrives unannounced at Morse's home. He notices a bruise on her face - clearly from her paramour. She expresses that she does not know what to do, Morse suddenly proposes marriage. She declines, presuming he has offered merely out of pity. He sends her away with some cash, only to later receive a telephone call saying Joan is in hospital. When he arrives at the hospital, the doctor mistakes him for a husband and shares that she has \"fallen down the stairs\" and regrets the accident has caused a miscarriage. After averting disaster at a nuclear power plant, Thursday is promoted to the rank of chief inspector and Morse is promoted to detective sergeant. They are both secretly awarded the George Medal for their actions.</p><h4>Series 5 (2018)</h4><p>Series 5 takes place between April and November 1968, various investigations continue during the creation of Thames Valley Constabulary from the city and county police forces. The future of Cowley police station is in question, along with those of some of the key members of the team there. Morse, now a DS, is assigned with a new DC, George Fancy, and becomes annoyed with his lack of initiative and basic investigative skill. Joan has moved back to Oxford and occasionally bumps into Morse around Oxford. DCI Thursday's plans for retirement hang in the balance.</p><p>The final episode, with the gang rivalry looming all over town, includes the death of DC George Fancy (who gets hit by bullets that do not match any of those of the crossfire between gangs that occurred where he was found) and the departure of WPC Shirley Trewlove to Scotland Yard, while the rest come to terms with the death and the closure of the Cowley Station. The series concludes with Morse asking Joan Thursday if her offer to go for coffee was still open (after he had said no to having coffee with her earlier in the series). In the last scene, they look at one another before Joan responds.</p><h4>Series 6 (2019)</h4><p>Series 6 starts in July 1969, eight months after the end of series five, with Morse sporting a moustache for the first time. Bright, now assigned to Traffic Division, appears in a road safety film and becomes known to locals as the \"Pelican Man\". Thursday has been demoted to Detective Inspector and now works at Castle Gate Police Station, where he is joined by Morse and Strange. Castle Gate is run by former adversaries DCI Ronnie Box and DS Alan Jago who frequently abuse their authority and mistreat suspects and younger officers (particularly Morse) and take credit for Morse's work. Thursday secretly does not like them either but reminds Morse to mind how he goes. It is revealed that Joan declined Morse's offer for coffee and stated any relationship with him could never work. However, they are thrown together during a missing person case. Thursday, Morse and Bright eventually discover that Box and Jago are involved in police corruption. After Box takes Thursday to meet some of Box's powerful and corrupt superiors, Thursday punches Box for his part in the corruption. DeBryn is kidnapped and held hostage at a factory site, where Morse, Thursday, Strange and Bright confront the corrupt officers. Jago admits that he murdered George Fancy with Box's gun. During the confrontation, Box (having switched sides) and Jago shoot each other. In the end, Jago dies, Box is rushed to hospital, and Box's superiors are immediately arrested and charged with corruption, including Councillor Clive Burkitt. Box's fate is not given, other than Strange saying he is \"50-50\". Bright announces his transfer out of Traffic and assumes command of Castle Gate with Thursday as acting DCI and DS Strange and DS Morse. Morse then buys Eddie Nero’s old drug house and begins the process of refurbishing.</p><h4>Series 7 (2020)</h4><p>Series 7 begins with 'Oracle'. On New Year's Eve, 1969, which sees Morse on leave in Venice with an Italian woman. On New Year's Day, the body of Molly Andrews is found by a canal with a broken neck. Morse returns to Oxford a week into the murder investigation, and he and Thursday clash over progress in the case after Bright suggests Morse look over the evidence. Dr Naomi Benford believes a subject of her psychic studies might have had a vision about the murder. Dr Benford is later found at the bottom of a stairwell, murdered by a colleague who misinterpreted her behaviour as romantic interest. The police suspect that Molly was killed by her boyfriend, Carl Sturgiss, although Morse has doubts. Morse meets Ludo, an old acquaintance with whom he strikes up a friendship. Morse is later introduced to Ludo's wife, Violetta, who is Morse's lover from Venice.</p><p>In Episode 2, 'Raga' shows tensions between the Asian community and far-right political groups in the build-up to a general election. A delivery driver from an Indian restaurant is found dead in the home of a celebrity chef. Morse breaks things off with Violetta but she turns up at his home and they embrace. Thursday is haunted by Molly Andrews' murder and regularly walks along the towpath where it happened.</p><p>In Episode 3, 'Zenana', the body of Brigit Mulcahy is found by the canal. Carl Sturgiss also knew Brigit and is arrested and charged with both her and Molly's murders. Thursday blames Morse for the fact they didn't charge Sturgiss earlier. However, soon the body of undergraduate Petra Connolly is found near the canal, and Sturgiss is released. Morse and Thursday argue again and Morse says he'll put in for a transfer. Morse has been conducting an affair with Violetta, but Ludo finds out about the affair and Violetta chooses to stay with her husband. Thursday has to break it to Bright that his wife, who was in remission from cancer, has died in a freak accident. Thursday is angry when Morse connects her death to his investigations into a spate of 'freak accidents' around Oxford, but Strange agrees to help. Morse believes the 'accidents' are due to someone buying up life insurance policies, then committing murder to cash in. Strange finds Sturgiss in a house where one of the accidents happened, and Morse comes in time to save Strange when he discovers Sturgiss has his sister captive. The towpath murders were committed by Sturgiss after all, and the murder of Petra by a copycat. Morse goes to Venice, as he believes Ludo is the person running the insurance scam and causing the accidents. Ludo meets Morse in a cemetery, attacks Violetta and flees. Ludo is shot by Thursday, who has followed Morse; Violetta then dies in Morse's arms.</p><h4>Series 8 (2021)</h4><p>Series 8 takes place in 1971 and consists of three episodes.</p><p>In 'Striker', Morse solves a case of a Northern Irish footballer being threatened by paramilitaries.</p><p>In 'Scherzo', the team investigates the murder of a cab driver near a naturist resort and the seemingly unconnected shooting of a Catholic priest in his confessional. Jim Strange begins a timid courtship of Joan Thursday.</p><p>Finally, in 'Terminus', Sam Thursday goes AWOL in Northern Ireland, causing conflict in the Thursday family. Morse finds himself stranded at an abandoned hotel during a snowstorm with a group of bus passengers and no communication with the outside world, dealing with the consequences of a murder spree at the hotel eight years earlier.</p><p>Morse is drinking too much and struggling to cope with the effects of events in Series 7, including the death of Violetta. He is missing work, and the drinking is beginning to affect his performance. His colleagues are aware of the problem and feel the need to handle it carefully. Fred Thursday repeats his advice to Morse that \"the drink is a good servant but a poor master\" and advises him to take leave and get help.</p><h4>Series 9 (2023)</h4><p>Series 9 was the show’s last. It is set in 1972 and consists of three episodes.</p><p>In 'Prelude' Endeavour's phased return to Castle Gate kicks off with a homecoming when Sam Thursday returns from a military tour in Northern Ireland. Two bodies are discovered in an Oxford Concert Orchestra and a third body is found murdered in an abandoned warehouse.</p><p>In the penultimate episode, 'Uniform', Endeavour notices a link between the woman's disappearance and her former employer, which demands his attention. Meanwhile reports are flooding in of stolen cars and criminal damage caused by a group of undergraduates wreaking havoc.</p><p>In the last episode of the prequel, 'Exeunt', Endeavour's last investigation takes him to a series of funerals, DS Strange marries Joan Thursday and transfers to Kidlington, Fred Thursday transfers far away for his family safety and CS Bright looks forward to a well earned retirement. Bright informs Morse that it looks likely that Cowley station will be re-opening and suggests that Morse might also consider a transfer to become bagman to DCI McNutt. This brings things full circle to the beginning of the original Inspector Morse series.</p><br/><h3>Cast</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr valign=\"bottom\"><th>Actor</th><th>Character</th><th>Duration</th><th>Position</th></tr><tr><td><span>Shaun Evans</span></td><td><span>Endeavour Morse</span></td><td>Pilot, Series 1–9</td><td>Detective Sergeant (DS) (formerly Detective Constable), Oxford City Police CID, Cowley Police Station. Thames Valley Police CID, Castle Gate Police Station (Series 6–Series 9).</td></tr><tr><td><span>Roger Allam</span></td><td>Fred Thursday</td><td>Pilot, Series 1–9</td><td>Detective Inspector (DI) (later Detective Chief Inspector, demoted to DI in Series 6, restored to DCI Series 7), Oxford City Police CID, Cowley Police Station. Thames Valley Police CID, Castle Gate Police Station (Series 6–Series 9).</td></tr><tr><td><span>Anton Lesser</span></td><td>Reginald Bright</td><td>Series 1–9</td><td>Police Chief Superintendent (PCS), Oxford City Police, Cowley Police Station. Thames Valley Police CID, Castle Gate Police Station (Series 6–Series 9).</td></tr><tr><td><span>Jack Laskey</span></td><td>Peter Jakes</td><td>Series 1–3 &amp; 9</td><td>Detective Sergeant (DS), Oxford City Police CID, Cowley Police Station.</td></tr><tr><td><span>Sean Rigby</span></td><td><span>Jim Strange</span></td><td>Series 1–9</td><td>Detective Sergeant (DS), (formerly Police Constable and Police Sergeant) Oxford City Police CID, Cowley Police Station. Thames Valley Police CID, Castle Gate Police Station (Series 6–Series 9).</td></tr><tr><td><span>James Bradshaw</span></td><td>Dr. Max DeBryn</td><td>Pilot, Series 1–9</td><td>Home Office Pathologist.</td></tr><tr><td><span>Abigail Thaw</span></td><td>Dorothea Frazil</td><td>Pilot, Series 1–9</td><td>Editor, <i><span>Oxford Mail</span></i> newspaper.</td></tr><tr><td><span>Caroline O'Neill</span></td><td>Winifred 'Win' Thursday</td><td>Series 1–9</td><td>Inspector Thursday's wife.</td></tr><tr><td><span>Sara Vickers</span></td><td>Joan Thursday</td><td>Series 1–6 &amp; 8–9</td><td>Inspector Thursday's daughter.</td></tr><tr><td><span class=\"mw-redirect\">Jack Bannon</span></td><td>Sam Thursday</td><td>Series 1–3, 5 &amp; 9</td><td>Inspector Thursday's son.</td></tr><tr><td>Shvorne Marks</td><td>Monica Hicks</td><td>Series 2–4</td><td>Morse's neighbour, a nurse with whom he slowly enters into a relationship.</td></tr><tr><td><span>Simon Kunz</span></td><td>Bart Church</td><td>Series 2</td><td>Detective Inspector (DI), Oxfordshire Police CID, Witney Police Station.</td></tr><tr><td><span>Dakota Blue Richards</span></td><td>Shirley Trewlove</td><td>Series 3–5</td><td>Woman Police Constable (WPC), Oxford City Police, Cowley Police Station.</td></tr><tr><td>Lewis Peek</td><td>George Fancy</td><td>Series 5</td><td>Detective Constable (DC), Oxford City Police CID, Cowley Police Station.</td></tr><tr><td><span>Phil Daniels</span></td><td>Charlie Thursday</td><td>Series 5 &amp; 9</td><td>Inspector Thursday's ostentatious brother.</td></tr><tr><td><span>Danny Webb</span></td><td>Arthur Lott</td><td>Pilot &amp; Series 9</td><td>Detective Inspector (DI) (formerly DS and Inspector Thursday's bagman)</td></tr><tr><td>Claire Ganaye</td><td>Claudine</td><td>Series 5</td><td>Morse's girlfriend, a French photographer and photojournalist.</td></tr><tr><td>Simon Harrison</td><td>Ronnie Box</td><td>Series 5–6 &amp; 9</td><td>Detective Chief Inspector (DCI) (formerly Detective Inspector), Thames Valley Police CID, Castle Gate Police Station.</td></tr><tr><td>Richard Riddell</td><td>Alan Jago</td><td>Series 6</td><td>Detective Sergeant (DS), Thames Valley Police CID, Castle Gate Police Station.</td></tr><tr><td><span>Alison Newman</span></td><td>Viv Wall</td><td>Series 6</td><td>Joan Thursday's boss, social services manager.</td></tr></tbody></table><br/><h3>Production</h3><p>ITV broadcast a television pilot in the UK on 2 January 2012; in the United States, PBS aired it on 1 July 2012.</p><p>ITV commissioned a first series of four new episodes, filmed during summer 2012, and broadcast them from 14 April to 5 May 2013.</p><p>It was announced on 5 June 2013 that, due to the success of series 1, including consistently high ratings, ITV had commissioned a second series of four episodes. Filming commenced in Oxford in September 2013. The second series was televised from 30 March to 20 April 2014.</p><p>On 24 September 2014, ITV confirmed that a third series had been ordered. Before that third series was screened on ITV, Evans told the Oxford Mail, \"It's not like we have a six-year contract, there's none of that. It's day by day, year by year. I think this one is really good. We'll know when it airs if there's an audience for it and if we feel there's another place to take these characters.\" The third series was broadcast from 3 January to 24 January 2016.</p><p>In February 2016, ITV announced that a fourth series had been commissioned, which Roger Allam confirmed to the Oxford Mail, with filming beginning in late spring 2016. To mark the 30th anniversary of Morse on television, the series features several early Morse characters and cameos by actors from the original series. The fourth series debuted on 8 January 2017.</p><p>The fifth series began on 4 February 2018 with six episodes.</p><p>The sixth series was shot during 2018 and premiered on 10 February 2019 in the UK. There were four episodes.</p><p>The seventh series was screened on 9 February 2020 and set in 1970 with three episodes.</p><p>The eighth series was broadcast on 12 September 2021, once again with three episodes and set in 1971.</p><p>The ninth series was broadcast on 26 February 2023 and had the final three episodes, set in 1972 (fifteen years prior to the events that began the original Inspector Morse era).</p><br/><h3>References to earlier series</h3><p>A number of references to the Inspector Morse series were included in the pilot, serving to introduce younger versions of characters who appeared in the original series or to place iconic series or character elements into the film. For example, in an early episode, Morse states that he abstains from alcohol. After he faints at the mortuary, Thursday encourages him to drink a glass of real ale, after which Morse is shown drinking several pints before the episode's close.</p><p>In the closing moments, as Thursday asks Morse where he sees himself in 20 years, Morse looks in the rear view mirror and the face of Thaw is shown in the reflection. At the same time, the original series music begins and plays through the credits. This effect is repeated in the closing scenes of the last episode of series 9.</p><p>In addition to the face-in-the-mirror scene, Endeavour includes another recognition of Thaw. His daughter, Abigail Thaw, appears as the editor of the Oxford Mail, whom Morse questions. Abigail Thaw, daughter of the original Morse actor John Thaw, played the part of Dorothea Frazil (the name is a pun on Frazil ice vs. thaw) in a scene at the Oxford Mail. At the end of the scene she pauses for a moment, then asks if she has met him before, eventually noting it may have been \"in another life\".</p><p>The fourth episode of Series 3, \"Coda\" has Jerome Hogg in a small role; Hogg was also seen in the Morse episode \"Greeks Bearing Gifts\". Additionally, the episode \"Prey\" (Series 3, Episode 3) is set at Crevecoeur Hall, the setting for \"The Dead of Winter\" (episode 13) of Lewis. One of the last lines Series 8, episode 3 (Terminus), \"It's beginning to thaw\", is also considered to be a nod to Thaw's portrayal of the character.</p><br/><h3>Reception</h3><p>Noting that the series received upwards of 6.5 million viewers, Mark Sweeny writing in The Guardian stated that any decision to commission a subsequent series should be easy. Upon its US premiere, Los Angeles Times critic Robert Lloyd called it a \"suitably complicated and pictorially engaging work of period suburban mystery.\"</p><p>Critics have been generally favourable, though even positive reviews have commented that the show's murder-mystery plots are occasionally unsatisfying convoluted puzzles or come to a \"rushed, melodramatic and fairly preposterous conclusion.\"</p><br/><h3>Home media</h3><p>A region 2 DVD of the pilot at 89 minutes long was released on 9 January 2012, but, as reviewers on Amazon.co.uk have noted, does not contain the full show and many scenes aired on ITV have been cut out. A complete edition running at 98 minutes was released on 26 January 2012.</p><p>Series 1 was released on DVD on 6 May 2013, Series 2 on 5 May 2014, Series 3 on 1 February 2016, and Series 4 on 30 January 2017.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption></caption><tbody><tr><th colspan=\"4\">DVD Releases</th></tr><tr><th>Series</th><th>Region 1/A</th><th>Region 2</th><th>Region 4</th></tr><tr><td>1</td><td>July 16, 2013</td><td>May 6, 2013</td><td>July 10, 2013</td></tr><tr><td>2</td><td>July 8, 2014</td><td>May 5, 2014</td><td>July 2, 2014</td></tr><tr><td>1-2</td><td>N/A</td><td>TBA</td><td>November 5, 2014</td></tr><tr><td>3</td><td>August 23, 2016</td><td>February 1, 2016</td><td>October 19. 2016</td></tr><tr><td>1-3</td><td>N/A</td><td>February 1, 2016</td><td>December 6, 2017</td></tr><tr><td>4</td><td>September 5, 2017</td><td>January 30, 2017</td><td>July 4, 2018</td></tr><tr><td>1-4</td><td>N/A</td><td>January 30, 2017</td><td>N/A</td></tr><tr><td>5</td><td>July 10, 2018</td><td>March 12, 2018</td><td>August 29, 2018</td></tr><tr><td>1-5</td><td>N/A</td><td>March 12, 2018</td><td>November 7, 2018</td></tr><tr><td>6</td><td>July 9, 2019</td><td>March 18, 2019</td><td>August 7, 2019</td></tr><tr><td>1-6</td><td>N/A</td><td>March 18, 2019</td><td>August 7, 2019</td></tr><tr><td>7</td><td>August 25, 2020</td><td>March 9, 2020</td><td>April 8, 2020</td></tr><tr><td>1-7</td><td>N/A</td><td>March 16, 2020</td><td>N/A</td></tr><tr><td>8</td><td>July 12, 2022</td><td>October 11, 2021</td><td>August 3, 2022</td></tr><tr><td>1-8</td><td>N/A</td><td>October 11, 2021</td><td>August 3, 2022</td></tr><tr><td>9</td><td>N/A</td><td>N/A</td><td>N/A</td></tr><tr><td>1-9</td><td>N/A</td><td>N/A</td><td>N/A</td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}