{
  "imDbId": "tt0063929",
  "title": "Monty Python's Flying Circus",
  "fullTitle": "Monty Python's Flying Circus (TV Series 1969–1974)",
  "type": "TVSeries",
  "year": "1969",
  "items": [
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1529040",
      "warningSpoilers": false,
      "date": "24 November 2006",
      "rate": "10",
      "helpful": "23 out of 25 found this helpful.",
      "title": "even when you think you know all of what the show is about, a surprise comes round the bend",
      "content": "I still need to see more of Monty Python's Flying Circus to make my un-official official declamatory mandated professional amateurish stated opinion on this, but this is quite the nifty little show they put on back in merry old England. A lame joke I tried for at Python humor, but really, once you see the show, and see at least a few episodes, you'll know whether it's the right kind of intelligently un-hinged absurdity for you. I didn't warm up to it at first, I thought it was maybe too smart, in a way, through its silliness to be taken much seriously, as the jokes are not of the common kind. But after getting in through the films, and seeing many a varied skit with the guys, I'm looking forward to seeing (and being able to quote to other people) the best they got.It's partly a stream-of-consciousness style show thanks to Terry Gilliam's spectacularly crude animations (through cut-outs mostly, and spoofing either classical paintings, architecture, movies, and of course dancing teeth), part social satire through various skits of people going into shops (Parrot), jobs, arguments (want to argue about an argument), the police, criminals, movies, sports, old ladies, politics, and other sorts of good diddies on all things in life. There's also the most random bits of comedy ever to come out of the 20th century, and I can only think of the basic things that might have you wanting to check it out. I love short skits, like the classic fish-slapping bit (there comes the BIG fish, heh), and over-the-top voices (Michael Palin, I think, does some of the best ones, like an introduction he does to a skit that reminded me of one of the voices in the Holy Grail trailer), and deranged costumes, and the richness of the silly dialog. Sure a skit might not hit the mark, but then I could them come back to it days later and be laughing about things not laughed at the first time around. There aren't too many, if much at all, conventional punchlines- the brilliant stuff comes in the random barbs that shoot up in the lines and the deliver, in a look that Cleese or Chapman might give at one point or another, or the lack of something that ends up coming around later in the bit, or maybe not. There's absolutely no shame in how tasteless some of this can get, be it with topical issues or just the little things everyday we tend to take for granted, but a tasteless sensibility without any net to fall on that's appealing. And, of course, the Lumberjack song and ministry of silly walks and . Bottom line, if there could ever be one with Flying Circus, if you think it's just stupid little goofy gags and skits going on, watch out for how rich the words fly out (err, in Circus-like fashion) the mouths of the Pythons. It's the mightiest heap of the inspiration-turned-ludicrous comedy to be found on any TV show. Other favorite skits: 'Most Awful Family in Britain', 'Self-Defence Class', 'Word Problem', and 'Kilimanjaro Expedition' among others."
    },
    {
      "username": "watto124",
      "userUrl": "https://www.imdb.com/user/ur0719089",
      "reviewLink": "https://www.imdb.com/review/rw0105629",
      "warningSpoilers": false,
      "date": "9 September 2001",
      "rate": "",
      "helpful": "68 out of 73 found this helpful.",
      "title": "Hilarious, strange, funny, peculiar........",
      "content": "\"Monty Python's Flying Circus\" is a blast. Plain and simple. Seeing an episode will cause the following symptoms: Laughter, tears, jaw aches, voice-loss(all of above caused by laughter). Most will laugh, some will just sit there at its silliness. Well whoever you are, give it a try. You either love it or hate it. Me? I love it.10/10"
    },
    {
      "username": "sngbrd39",
      "userUrl": "https://www.imdb.com/user/ur0694907",
      "reviewLink": "https://www.imdb.com/review/rw1294119",
      "warningSpoilers": false,
      "date": "17 February 2006",
      "rate": "",
      "helpful": "74 out of 81 found this helpful.",
      "title": "A letter of complaint",
      "content": "Dear Sir, I am writing to complain about the silliness known as Monty Python's Flying Circus which plagues my television. The \"jokes\" are silly and pointless, and the sketches never have proper endings. I demand that this programme be removed from telly at once and replaced with programmes that are truly representative of the glories of British humour, such as Keeping Up Appearances and the BBC World News.Sincerely, Col. Arthur von Gambolputty-Dinsdale of Ulm (deceased) (Warning: This letter does not reflect the true feelings of the reviewer, who is a huge fan of Python and thinks that the above-mentioned gripes are the very reason that the show is awesome. The comedy still holds up after over 35 years, though several of the costumes and haircuts do not, and the mixture of zany oddball non sequiters, intellectual references and satires, and ingenious physical comedy makes Python something very special and unique. Viva Python! And remember, !las llamas son mas grande que las ranas!)"
    },
    {
      "username": "bat-5",
      "userUrl": "https://www.imdb.com/user/ur0100620",
      "reviewLink": "https://www.imdb.com/review/rw0105640",
      "warningSpoilers": false,
      "date": "30 May 1999",
      "rate": "",
      "helpful": "45 out of 51 found this helpful.",
      "title": "Silliness to the extreme!",
      "content": "Any episode of Monty Python will reduce one to fits of laughing that will produce bouts of tears that will render the viewer on the ground. Great physical comedy on all parts, but especially John Cleese in the Ministry of Silly Walks sketch, which is his least favorite sketch. Great writing that walks that fine line between genius and silly, and meshes the two. These guys also knew when and how to start end a sketch. Still funny thirty years later, wish the same could be said about Saturday Night Live. Too bad there wasn't some knight who could hit Lorne Michaels with a chicken."
    },
    {
      "username": "ShadeGrenade",
      "userUrl": "https://www.imdb.com/user/ur7743887",
      "reviewLink": "https://www.imdb.com/review/rw1471196",
      "warningSpoilers": true,
      "date": "10 September 2006",
      "rate": "10",
      "helpful": "19 out of 22 found this helpful.",
      "title": "The First 'Alternative Comedy' Show?",
      "content": "I loved 'Monty Python's Flying Circus' as a youngster, even though, strange as it may seem now, I used to be frightened by it. Unlike say 'The Frost Report', the show was not actually about anything. Each episode had the look and feel of a nightmare; we saw terrible sights such as heads lopped off with razors, people puking their guts out, ten-ton weights falling on people, and human brains consumed with spoons. It was a brave person who stayed up late to watch this show. Characters would often cross over into different sketches, such a knight who kept hitting people with a rubber chicken, and 'The Colonel' who demanded items be terminated if they were too silly.The Pythons, as if you did not know, were John Cleese, Graham Chapman, Michael Palin, Terry Jones, Terry Gilliam, and Eric Idle. It was an inspired collection for a comedy team; Cleese and Chapman were good at sketches in which there was lots of verbal abuse, Palin and Jones excelled at items which sent up film genres, Gilliam provided some disturbing animations, while Idle contributed well-written skits involving word play.In the first season, each episode opened with a bedraggled Palin emerging either from the sea or jungle to issue the following warning: \"Its...\". Flowers would then climb the screen, their petals opening to reveal the name of the show, to the strains of 'Liberty Bell' by Souza. The very first show kicked off with a sketch in which a city gent ( Jones ) asks a Yokel farmer ( Chapman ) just what his sheep are doing up in the trees. The farmer says that they have realised that their lives consist of standing around and waiting to be eaten, so they have decided to do something about it. We then cut to two Frenchmen ( Palin and Cleese ) in berets who demonstrate the commercial possibilities of flying sheep. From the reaction of the audience, its clear they are baffled rather than amused. 'Python' took time to catch on, but when it did, the public could not get enough of it.Season 2 is generally thought of as the best. 'The Ministry Of Silly Walks', 'The Spanish Inquisition', 'The Piranha Brothers', and 'The Semaphore Version Of 'Wuthering Heights' originated here. Clips of the show were regularly requested on 'Ask Aspel', a children's show hosted by Michael Aspel.After two excellent seasons and a movie, plus a couple of fun German specials, 'Python' went into decline, and John Cleese's departure was the final nail in the coffin. Season 4 was the last. Fortunately, the team reunited to make movies which, if anything, were funnier than the show, particularly 'Life Of Brian' ( 1979 ). The last one - 'The Meaning Of Life' ( 1983 ) ended with a clip of the title sequence of the very first television show, taking 'Python' full circle. Chapman's death in 1989 closed the door on Python for good. A brief reunion in 1999 - 'Python Night' - was a disaster, with Eddie Izzard unwisely trying to stand-in for the deceased star.I must squeeze in a quick mention of lovely Carol Cleveland, with whom I was madly in love in the early '70's. Her bra coming off at the end of 'Scott Of The Sahara' had a profound impact on me!"
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw3173670",
      "warningSpoilers": false,
      "date": "30 January 2015",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Brilliant, innovative comedy",
      "content": "Brilliant, innovative comedy. Possibly the greatest comedy series of all time. Certainly the most influential, iconic and quoted.Season 1 was great, but not their best. Still experimenting and finding their feet, it had some great sketches, but nothing as iconic as what was to come.Season 2 was where they really hit their straps. Most of their well-known sketches are from Season 2: Piranha Brothers, Ministry of Silly Walks, The Bruces, Spam, The Spanish Inquisition, Scott of the Antarctic.Season 3 was more of the same.Season 4 was where they tapered off. John Cleese had left and the creativity just wasn't anywhere near the levels of Seasons 2 and 3. No wonder it was only 6 episodes.Timeless comedy that has become embedded in culture. It's that big, brilliant and important."
    },
    {
      "username": "agrawalmannu",
      "userUrl": "https://www.imdb.com/user/ur1424131",
      "reviewLink": "https://www.imdb.com/review/rw1167603",
      "warningSpoilers": false,
      "date": "7 September 2005",
      "rate": "",
      "helpful": "40 out of 45 found this helpful.",
      "title": "Monty Python's and their unique brand of humor",
      "content": "A gentleman (John Cleese) enters a pet shop and wants to register a complaint that the parrot that he had bought from that very boutique just half an hour ago was in fact a 'dead parrot'. The owner (Michael Palin) tries to convince him that the Parrot, a Norwegian Blue, was not really dead and was just resting. The argument continues and gets sillier and sillier until an army colonel (Graham Chapman) pops out of nowhere and stops the sketch abruptly because it was getting very silly. If this kind of humor doesn't interest you, read no further and plan on watching something else. But if it does and if you have not seen Monty Pythons Flying Circus you haven't seen nothing yet.Monty pythons pretty much invented and perfected their unique brand of humor which can be categorized as 'surreal'. One can argue that 'the Goon Show' was the archetype for Monty pythons, which is true, but then Monty Pythons took it to territories that had never been explored before. They created a world where you can get a government grant for silly walks or buy an argument in an argument clinic. A world in which a father and son could have the age old \"romantic vs. a simple coal miner\" argument, just that in this world the son is a regular coal miner whereas it's the father whose head is full of useless novels and poems. Just like the Beatles they took something and created something completely new out of it. The comparison is valid because Monty Pythons at their peak enjoyed the status of any of the rock stars in those days (including groupies) and the Beatles, George Harrison in particular, were their biggest promoters.Terri Gillian's stream of consciousness art work is pretty bizarre and holds all the sketches together. John Cleese, Graham Chapman, Michael Palin, Eric Idle and Terry Jones play all the characters (including women's) themselves with dead seriousness. This is insane humor at it's brilliant best."
    },
    {
      "username": "BroadswordCallinDannyBoy",
      "userUrl": "https://www.imdb.com/user/ur2214855",
      "reviewLink": "https://www.imdb.com/review/rw1486549",
      "warningSpoilers": false,
      "date": "30 September 2006",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "A staged and carefully crafted presentation of absurdity and chaos",
      "content": "The original sketch comedy show that has a very deserved cult following.It's... hilarious. It's... absurd. It's... very hard to describe, because it is so freakin' random! Almost every little sketch takes such bizarre twists and turns into something completely else that you'll literally never see it coming. Terry Gilliam's innovative, and equally absurd, animations are no different in their appearances between sketches. Often serving as transitions, but really this is just one side-splittingly funny compilation of sheer absurdity.Poking fun at just about everything that you could possibly imagine - talk shows, courts, daily life, the Spanish Inquisistion, the military, etc... - and it is all put together in a way no less random. Skits end unexpectedly, some shots are used many times, random characters appear only to speak one line, and all that makes for what is quite possibly the best crafted presentation of absurdity and chaos ever made. 10/10Not Rated and suitable for most viewers, but very cautious parents will undoubtedly object to the crude humor."
    },
    {
      "username": "wishkah7",
      "userUrl": "https://www.imdb.com/user/ur0473855",
      "reviewLink": "https://www.imdb.com/review/rw0105624",
      "warningSpoilers": false,
      "date": "20 January 2001",
      "rate": "",
      "helpful": "38 out of 48 found this helpful.",
      "title": "How can anyone not like Monty Python?",
      "content": "Monty Python's Flying Circus is superb British humor at it's best! All the Monty Python movies were excellent, too! My favorite actors in this are John Cleese and Eric Idle. I have my older brother to thank for getting me into this show! I got into Monty Python at the ripe old age of 11. My brother was watching it one day, and I asked him if I can watch too. He gave me his okay, and after I saw the delirious humor of this, I quickly became a fan! And watched it everytime it came on. I also own some Monty Python cassette tapes and my brother has some on vinyl! I have far too many favorite Monty Python bits to name,some of my faves are \"The Lumberjack Song\", \"It's the Mind\", and \"The Bishop\"! And who can forget that caveman who can only say, 'its'? Also, anyone remember that one about the self-defense class involving a 'Poi-ted stick'? Pure timeless classic! Monty Python cracks me up all the time! Even if you're not in a good mood, watching this will put you in one! I highly suggest this to anyone who is a stickler for British humor. Also, watch their movies: The Holy Grail, And Now for Something Completely Different, and The Life of Brian. I give Monty Python's Flying Circus 5 out of 5 stars! Watch it if you can!"
    },
    {
      "username": "policy134",
      "userUrl": "https://www.imdb.com/user/ur4780626",
      "reviewLink": "https://www.imdb.com/review/rw1041932",
      "warningSpoilers": true,
      "date": "18 March 2005",
      "rate": "",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Six intellectuals who revolutionized comedy with mostly weirdo characters",
      "content": "The Python group has been written about to death and their show is either seen as totally ingenious or the stupidest thing to ever be aired. My personal view is the former although some of the skits can be tedious and stretched out too long. Long before the wholesome, politically correct American sitcoms flooded European television you could actually get away with broadcasting this show which had sex, blood and violence (not graphic but more suggestive). John Cleese has often commented that very little censorship was actually enforced during previews of the show.Like most fans I think the parrot sketch is hilarious but it is not really my favorite. I can't really think of a favorite sketch I have because there are so many I find hysterical. One of them is the interview of Arthur \"Two Sheds\" Jackson which is some kind of parody of those boring art shows, where the man in the chair is supposed to be really respected and everybody is supposed to praise him. The Pythons like to poke holes in those people's arrogant facade and they are especially vicious when it comes to chartered accountants and religious organizations. I could go on forever describing the \"meaning of Flying Circus\" but I think the answer is very subjective. The only way is to judge for yourself. I cannot say that all people will find the show funny and it is not really a show for people who only like toilet humor like the Farrelly Bros. films. I will close by saying that the show is such an institution that \"pythonesque\" has been included in Oxford's dictionary much to the dismay or joy to the Pythons. Who knows, with them you can never be sure."
    },
    {
      "username": "JohnnyJohnHildegaard",
      "userUrl": "https://www.imdb.com/user/ur0293787",
      "reviewLink": "https://www.imdb.com/review/rw0105638",
      "warningSpoilers": false,
      "date": "6 April 1999",
      "rate": "",
      "helpful": "35 out of 44 found this helpful.",
      "title": "The Circus is On...",
      "content": "Monty Python's Flying Circus is a show with great comedy. It's so weird anything could be done in it. Like selling an albatross, or having a knight hit you with a chicken... It's so hilarious, you'll drop right off. It's a very classic show for people with British taste. The movies were good... but it never made a benchmark like the TV series did. People... get off trashy Saturday Night Live and try \"Something Completely Different\"!"
    },
    {
      "username": "shelbythuylinh",
      "userUrl": "https://www.imdb.com/user/ur142375144",
      "reviewLink": "https://www.imdb.com/review/rw7532844",
      "warningSpoilers": true,
      "date": "10 November 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Before SNL there was Monty Python",
      "content": "Started to love this show as a 14-year old kid in 1989 with skits like the \"Ministry of Silly Walks, Nudge Nudge, Lumberjack, Salad Days\" just to name a few.As it had the late Graham Chapman playing authority figures, John Cleese doing the \"Now for Something Completely Different\", Terry Gilliam Animations, Eric Idle with Nudge Nude,, the late Terry Jones in drag, and Michael Palin portraying innocent and at times perverted characters.Really this is what got into comedy and the real inspiration IMHO for skits and SNL! A classic team that were the Beatles of comedy!"
    },
    {
      "username": "redryan64",
      "userUrl": "https://www.imdb.com/user/ur0850869",
      "reviewLink": "https://www.imdb.com/review/rw1787781",
      "warningSpoilers": false,
      "date": "27 December 2007",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "\"MONTY PYTHON\" successful in the U.K.; but, \"How well will it do in \"The States\"? They feared the worst, but well, we know now, don't we?",
      "content": "The Brits are a stuffy, haughty and quite socially conservative. Their taste in own a entertainment is strictly high brow. They are quite reserved in their socializing, and always maintain the most highly dignified behaviour. They never miss their afternoon Tea Time.WHAT?!?!?!?! Well, these qualifications seem to be rampant, far-flung and long lasting. It is very hard to dispel and correct any untruth (Lie!) after it has been spoken, printed, published, recorded or transmitted over any medium, be it Smoke Signals, Carrier Pigeon, Drums or even by casting \"SEND HELP\" bottled-notes into the Oceanic System.If there were any true believers out there, they surely haven't seen any of the ½ Hour episodes of MONTY PYTHON'S FLYING CIRCUS. All it would take would be one show to dispel and negate any of these ridiculous stereotypes. Two Shows would get a viewer sort of interested; Three and you're starting to get the general idea; Four qualifies you as a Fledgling Anglophile and Five Show, you're hooked.Seriously though, we would never attempt to tell you or anyone else that X is funny,Y is not and unless you agree with me, there must be something wrong with you. Judging comedy is a most subjective art and too much analyzing of a Comedy, can be harmful in rendering it no longer as being funny. Either it makes us laugh or it doesn't There's certainly not any special brain power to it; and certainly, Rocket Scientists would have no advantages in judging what is funny. Some have a great sense of humor, in others their sense of humor is greatly and there are those in every walk of life who are completely devoid of any funny bone at all.When the folks at the BBC, like Ian MacNaughton, made the overtures to bring 5 of their top writers together under the umbrella of a TV Series to be patterned along the lines of THAT WAS THE WEEK THAT WAS, or just TW3 for short. The roll call read like a true All-Star Dream Team of scribes. The list read as follows: The team of Graham Chapman & John Cleese, Writing Partners Terry Jones & Michael Palin and Solo Act, Eric Idle. The addition of the Popular Animator, the American, Terry Gilliam just acted as the final touch needed. It was like a butter cream frosting being put on a 5 layer German Chocolate Cake.With a all of the resources of the British Broadcasting Corporation at available and what certainly appears to have been a more than adequate budget at their disposal, the series was launched. Like any young undertaking, It took a little while to shake down the loose ends and see what adjustments would be needed.One difficulty that they had was in choosing the Title of their new enterprise. All sorts of ideas were kicked around; for they were dealing with the outputs from six very fertile, creative minds. \"OWL STRETCHING TIME\" was a finalist in the big sweepstakes and the title does indeed appear in the closing of at least one episode.As for describing MONTY PYTHON, it is really no easy task. The sketch humor is full of such off the wall material, the likes of which, have never seen the light of day before. Additionally, the Episodes are so tightly edited and quickly and without warning, they can end one bit abruptly, only to return to the first and eventually mix them both or even start another skit.Various occupations are often targets for their razzing, as well as any and every of the old established British Institutions. The Parliament, The Royal Family, The World Wars, The British Class system, Sports, Politicos,etc. You name it and they've kidded it.They also maintain a close relationship with British Drama of years gone by. That is accomplished with their often used recurring of the nonsensical idiot character of \"Mr. Gumby\".As for picking a \"favourite\" episode, we can only offer those which contain some particular routines and sketches. That being the case, let us consider the following, outrageous skits, such as: \"The Ministery of Silly Walks.\", \"Dennis Moore (the Highwayman)\", \"Inspector Dimm in Court\", \"The Dead Parrot Sketch\" and of course, last but not least \"The Lumberjack Song.\" As for any disappointments, there have been very few and they were of little consequence. But there is one nasty fault that does make a big difference to the Series as a whole. In its last season, the line-up did not include John Cleese. Apparently his schedule at that time did not allow his presence. He was committed to some other project, like \"FAWLTY TOWERS\", for example. While there was probably much of his writing in that last season's product, THE PYTHONS greatly missed Mr. Cleese.The Pythons have been translated into other languages and they made a number of rather successful Theatrical Films. They continue to captivate those of new Generations, as well as the 30+Years viewer, just like yours truly. They even have that successful Broadway Show, SPAMELOT.God Bless Them for their successes in making us laugh and think at the same time; and obviously, he already has. But for all of the Films, The Broadway Show and other Live Appearances; it is on \"the old Tube\" that they are truly on their best."
    },
    {
      "username": "hellraiser7",
      "userUrl": "https://www.imdb.com/user/ur24931284",
      "reviewLink": "https://www.imdb.com/review/rw3868488",
      "warningSpoilers": false,
      "date": "27 November 2017",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Looney Circus",
      "content": "Skit comedies have always been my favorite kind of comedies because in them you just have unlimited creative freedom to not just be about anything but even to do anything you want.This show is one of my favorite TV shows of all time as well as favorite skit and comedy show of all time. It was revolutionary for it's time before skit comedy shows were even common, but what really revolutionized it was in it's execution of comedy where it dared to not play it safe and actually go the extra mile. To this day I'm still surprised they were able to get away with what they did; it's a little more common place now with the shows on the \"Adult Swim\" block on Cartoon Network but this was one of the first and still the best.The ensemble is great each of them are memorable comedic actors though my favorite one is John Clease he always had this infectious uptight manic mannerism to him. Each of them look as though their really into what their doing and having fun.I really like those brief animated segments which are beautiful but really odd art style, much like you would see in a surrealist painting as well as Mad Magazine. From the clouds, tiny men, giant feet, at times I wondered if the artists were on something. Even the pacing and editing is crisp, from how it quickly transitions and cuts to the next skit or the animated segment in between the skits, it really feels like a live action Mad Magazine as if were flipping between the pages.However what powers this show are the skits which are great and memorable. I'll just say a few that I really loved. Each of the skits are really colorful, creative, weird and may'be even a little risqué with the amount of absurdity and behavior they were really pulling all the stops out; for some of them I still wonder where the hell they came up with the ideas or what when through they heads when they made them. Their rich with both verbal and visual humor, there is just a lot of memorable quotes and dialog in the skits which I can't always say for all of them which is cool. The verbal humor is smart and clever but not to the point of being boring, they just go simply for doing one task and one only delivering the humor which most good skit shows should do.I won't say too much my words can't do them justice their the kind of things you have to see for yourself to laugh.The Deadly Joke: This just cracks me up because of how absurd an idea this is; instead of chem warfare it's punchline warfare.Race of the Twits: It's one of the most bizarre races I've seen in history. Each of the competitors are just idiots to the core and each of the obstacles they do are even more absurd and stupidly easy.The Spanish Inquisition: This is my favorite one of all where it is just absurdity at it's best; it's a Inquisition platoon that's not just out of place but out of time, as they are still operating on outdated laws. But most of all each of them are complete morons.Overall if your a fan of skit shows this classic is worth checking out, this circus flies high.Rating: 4 stars"
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw2406210",
      "warningSpoilers": false,
      "date": "29 March 2011",
      "rate": "10",
      "helpful": "7 out of 10 found this helpful.",
      "title": "and now for something completely hilarious",
      "content": "England's most famous comedy team made its name on its eponymous TV show, spoofing anything that could get spoofed, and has maintained a cult following ever since. John Cleese, Terry Gilliam (the only American member of Monty Python), Graham Chapman, Terry Jones, Eric Idle and Michael Palin depicted every possible wacky thing during their five years on TV -- namely the dead parrot and the Ministry of Silly Walks -- and in several movies since then.During the 2008 presidential election, there was an Internet meme saying that the wrong Palin got chosen as John McCain's running mate: it should have been Michael Palin because he's tough on terrorism (\"No one expects the Spanish Inquisition!\") All in all, a great show! Aside from \"A Fish Called Wanda\" and \"Fierce Creatures\", another movie featuring multiple members of the team is \"Splitting Heirs\"."
    },
    {
      "username": "bigverybadtom",
      "userUrl": "https://www.imdb.com/user/ur23062922",
      "reviewLink": "https://www.imdb.com/review/rw2527206",
      "warningSpoilers": false,
      "date": "3 December 2011",
      "rate": "7",
      "helpful": "12 out of 17 found this helpful.",
      "title": "Sometimes Very Funny But Could Also Be Very Bad",
      "content": "The series was a landmark in television history and broke a number of taboos and boundaries. And there are scenes which have been and continue to be laugh-inducing, such as \"Ypres 1914\", \"The Ministry Of Silly Walks\", and \"The Spanish Inquisition\".But what really made Monty Python work was mainly not the jokes but the performances. If the actors hadn't been able to play everything straight, the whole thing would have fallen apart. The series depended not just on wit but on silliness and absurdity, which in itself isn't automatically funny. And many of the scenes are dated or funny only to Britons...and some of them are genuinely not funny. But not everything Charlie Chaplin was good either (and I'm talking about his early silent films as well as his late talkies.)"
    },
    {
      "username": "nickenchuggets",
      "userUrl": "https://www.imdb.com/user/ur107418055",
      "reviewLink": "https://www.imdb.com/review/rw6944309",
      "warningSpoilers": false,
      "date": "20 May 2021",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "The best comedy franchise ever",
      "content": "It should come as no surprise that I've selected this show as the most influential and well known comedy series to ever be released, and how could I choose it as anything but? Even if you're one of the rare people that doesn't care at all about this show, you know about it either way. Monty Python would later spawn some of the most acclaimed comedy movies ever made, such as Holy Grail and Life of Brian, but before all that, there was the original cast of zany entertainers whose comedic style is so unique you really can't criticize it. Fans pick this show apart in great detail and talk about their favorite sketches, and which ones ought to be people's favorites but don't get the recognition they deserve (there's a lot of those). Pretty much everybody is aware of the spam skit, where a group of vikings are sitting in a cafe eating breakfast and a man and his wife want to order something, but the only thing for sale is spam or some variation of it. What makes it so funny is due to many reasons, but for one thing, the waitress is played by a man even though the character is clearly supposed to be a girl. The group of vikings dining in the cafe doesn't make any sense either, and only adds to the hilarity because the viewer can't make sense of anything. It's also interesting to note that the internet term for messages being repeated again and again (spam) came from this skit, because the repetitive use of the word inspired it. That's the influence this show has. This show is overflowing with moments like that, where you can't help but laugh because they're so well written. Even though Monty Python is easily the most recognizable comedy series of all time, it's not an exception to the low points. The show enjoyed a huge following with many dedicated fans, but like all good things it came to an end. The episodes undergo a dramatic drop in quality once John Cleese leaves, and this seems like a no brainer. Despite this, the show still remains funny to this day, and good jokes are as timeless as good writing. So while Monty Python no longer has the hype it once had 50 years ago, the hilarious skits and fine performances mean that it's not ready to be forgotten just yet."
    },
    {
      "username": "minister_of_silly_walks",
      "userUrl": "https://www.imdb.com/user/ur64212521",
      "reviewLink": "https://www.imdb.com/review/rw4864741",
      "warningSpoilers": false,
      "date": "19 May 2019",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "The masters of surreal sketch comedy",
      "content": "The legendary Monty Python group present one of the most iconic and fondly remembered sketch shows ever. Silly and genius at the same time it has a unique sense of humor which at some places has a serious note addressing the modern problems that every society faces, but it is at it's core pure and silly fun! You have countless sketches that are beloved by audiences all around the world, which, it seems, get even more popular as the years go by. Hilarious, entertaining, surreal, cheeky, silly, absurd... It can be called all of the above, but one thing it can't for sure: boring."
    },
    {
      "username": "dragokin",
      "userUrl": "https://www.imdb.com/user/ur15462771",
      "reviewLink": "https://www.imdb.com/review/rw3000235",
      "warningSpoilers": false,
      "date": "18 April 2014",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "groundbreaking",
      "content": "I've talked to a gentleman from the UK who witnessed the original TV broadcast of Monty Python's Flying Circus. It has been a mind blowing experience. Although i've discovered it a couple of decades after the gentleman above, i can only share his feelings.There is no need to underline the importance of Monty Python's Flying Circus for today's comedy. After all, it has spawned several movies and innumerable copycats. It followed in the footsteps of the Marx brothers and absurdist comedy, for example Hellzaappopin' (1941) and unleashed talent in the comedy world and opened new fields of entertainment.The only criticism i might have is that it created a safe haven for semi-talented individuals who make whatever they want a name it comedy, in the similar way that surrealism influenced mainstream art of the twentieth century."
    },
    {
      "username": "classicalsteve",
      "userUrl": "https://www.imdb.com/user/ur7383416",
      "reviewLink": "https://www.imdb.com/review/rw1717222",
      "warningSpoilers": false,
      "date": "23 August 2007",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Stop That Review, It's Getting Silly!",
      "content": "We interrupt the Internet Movie Database because it's gotten too silly! I've noticed a tendency for the IMDb to get rather silly. Now I do my best to keep things moving along, but I'm not having things getting silly. So, we present to you this exposé on the greatest comedy sketch show of all time! In it you will see: mosquito and ant safari hunters, the funniest joke ever written in which people die laughing and later used to attack the Germans during WWII, mountain climbers that see double, \"The Institute of Silly Walks\", hospitals that treat their patients like soldiers in boot camp, a world in which everyone is dressed like Superman except for the greatest hero \"Bicycle Repairman\", and of course the Spanish Inquisition that shows up when least expected! And like the existence of God, Monty Python was, is and ever shall be the Messiah of television comedy. All must genuflect at the altar of John Cleese's desk when he finishes his phone conversation at the beach and says \"And now for something completely different.\" Sketch comedy shows on television existed long before Monty Python. In the US, the early sketch comedy shows, like \"The Milton Berle Show\", \"The Caesar Hour\" and \"Your Show of Shows\" were essentially vaudeville acts that were broadcast nation-wide, and often upon a stage. However, Monty Python may have been the earliest of the sketch comedy shows to utilize the fact that it was being broadcast on television which pushed sketch comedy out of the constraints of the fading sensibility of Sid Caesar and Ed Sullivan.In addition to their sketches which were filmed like little movies rather than on stages (and probably were not improvised), Monty Python's Flying Circus is filled with fake news broadcasts, fake commercial interruptions, spliced sequences of stock footage, and of course, the outrageously irreverent cartoons that spoofed the great art of Europe and created a surrealist python world where portraits of distinguished old men eat up the Venus de Milo -- whole! Monty Python spoofed everything, from their own BBC News, World War II to Queen Victoria who is shown in one sketch walking into a poetry reading with the coffin containing the remains of her husband saying \"My late husband and me...\" Almost every zany aspect of modern society were taken prisoner and held in custody by the Pythons, including courtrooms, shopping malls, and even little old ladies who have decided to form violent street gangs! And of course the French and the Scots seem to get a little more airtime than other groups! And the final aspect I will relate is that most of these zany sketches were presented with absolutely straight faces as if the actors were seriously engaged in their ludicrous exploits. There is very little I can add about Monty Python that hasn't already been said, except, that if you have never seen it, it is almost impossible to describe. So, for God's sake, see it! We now return you to the Internet Movie Database with its regularly scheduled programming."
    },
    {
      "username": "gridoon2023",
      "userUrl": "https://www.imdb.com/user/ur17901972",
      "reviewLink": "https://www.imdb.com/review/rw4144667",
      "warningSpoilers": false,
      "date": "27 April 2018",
      "rate": "7",
      "helpful": "4 out of 7 found this helpful.",
      "title": "Classic, influential, ingenious - and wildly uneven",
      "content": "It's.....\"Monty Python's Flying Circus\". This show has too many memorable, priceless bits to count - and not a few duds. At their best, the Pythons invented a new language for comedy (and TV): anything goes, anything can happen, at any time and any place. It bends the mind. Perhaps as good a summary of their primary purpose as any can be found in a Graham Chapman line: \" we need to cure people of their sanity\". But sometimes they take an idea that's not very funny in the first place, and they stretch it out too long. The first two seasons are generally the strongest; the third is also good but more uneven; the fourth is by far the weakest (though it still has its moments) - their hearts and minds were more in the upcoming \"Holy Grail\" by that time. Objectively speaking, an episode like \"Mr. Neutron\" is as awful as \"The Spanish Inquisition\" is brilliant. But my single favorite episode has to be the early \"Ant - An Introduction\" - don't miss it! *** out of 4 as a whole. P.S. Carol Cleveland - what a WOMAN!"
    },
    {
      "username": "Beta_Gallinger",
      "userUrl": "https://www.imdb.com/user/ur15711750",
      "reviewLink": "https://www.imdb.com/review/rw2347533",
      "warningSpoilers": false,
      "date": "2 December 2010",
      "rate": "10",
      "helpful": "3 out of 4 found this helpful.",
      "title": "So much sidesplitting humour in this classic series from an extremely talented comedy troupe!",
      "content": "This is the groundbreaking BBC TV comedy series that introduced the world famous Monty Python. I first heard of the comedy team at a very early age, but wasn't too familiar with their work for a long time. I knew of a few sketches, but really started to get to know Python in 2005, when I was nineteen years old, which was when I first became familiar with all the members of the troupe, watching many episodes of this show and the movies which the comedians made afterwards, and laughing a lot! I have now seen every episode of \"Monty Python's Flying Circus\", originally aired from 1969 to 1974, and some comedy may wear thin on me through time, but that most certainly hasn't been the case with the humour of this particular group! This is a sketch comedy show featuring Graham Chapman, John Cleese, Eric Idle, Terry Gilliam, Michael Palin, and Terry Jones, the six official members of the Monty Python team. It also features many parodies and bizarre concepts! Five of the group's members regularly appear in sketches, each delivering lots of silliness and insanity, while Gilliam, the British troupe's sole American member, only appears sporadically on screen but is responsible for all the bizarre animated sequences, which are featured in every episode and really fit in with the live action sketches! The show sometimes features guests for smaller roles as well, not always just the Pythons appear, and when the female characters are not played by any of the Pythons in drag, there are real women who play them, most commonly Carol Cleveland, who appears at certain points in the majority of the show's episodes and can be referred to as the seventh Python.In my experience, I've found that no matter how good a sketch comedy show is, not ALL the sketches can be that great, including this show. For instance, I don't think I've ever found the tape recorder up the nose very funny. However, \"Monty Python's Flying Circus\" still features enough hilarious sketches to make it a masterpiece, with the man with three buttocks, the dead parrot, the homicidal barber sketch and very famous \"Lumberjack Song\" that follows it, the job interview, newlyweds trying to purchase a mattress, the Git family, the argument clinic, silly disturbances, and so many others, WAY too numerous to mention! Terry Gilliam's animated sequences can certainly be major highlights as well, and he could sure be creative with those cutouts he used for them, many of which he got from Victorian-era photographs! All official members of the Python troupe showed their amazing talent in this sketch comedy series, and I should also give credit to Carol Cleveland. Even though she wasn't an official member of the team, she kept getting roles in the show due to her comedic talent, which she certainly deserved, and is definitely worthy of the \"7th Python\" label! Sadly, one of the legendary Pythons, Graham Chapman, died of throat and spinal cancer in 1989, when he was only 48 years old. This tragic death occurred the day before the 20th anniversary of the day on which the first episode of \"Monty Python's Flying Circus\" was originally broadcast! I was only three years old at the time of Chapman's death, so I was obviously unaware of it at the time, but finally learned about it sixteen years later, as I had just discovered how funny Monty Python was. That was when I discovered what a great comedian Chapman was, like the other Pythons, and how understandably missed he is. He contributed a lot to Python's humour with his talent, in a comedy franchise which obviously can't please everyone, as some people have been put off by the troupe's extremely silly style, but the work that the Pythons did together was very influential and has clearly made so many people from different generations laugh, and will hopefully continue to do so for generations to come! Cheers to Monty Python and R.I.P. Graham Chapman!"
    },
    {
      "username": "FilmInPerspective",
      "userUrl": "https://www.imdb.com/user/ur144384572",
      "reviewLink": "https://www.imdb.com/review/rw9064796",
      "warningSpoilers": false,
      "date": "19 May 2023",
      "rate": "10",
      "helpful": "1 out of 1 found this helpful.",
      "title": "An Unforgettable Journey into Surreal Comedy",
      "content": "\"Monty Python's Flying Circus\" is a groundbreaking television series that has left an indelible mark on the world of comedy. Created by the irreverent and ingenious minds of the Monty Python troupe, this show takes viewers on a wild and unpredictable ride through a surreal and absurd world.One of the show's greatest strengths is its unique and innovative approach to comedy. The sketches are filled with clever wordplay, absurd situations, and unexpected twists that defy traditional comedic conventions. The humor is smart, witty, and sometimes even satirical, making it a delight for both casual viewers and comedy enthusiasts alike.The cast of Monty Python, including Graham Chapman, John Cleese, Terry Gilliam, Eric Idle, Terry Jones, and Michael Palin, showcases their exceptional comedic talents through a wide range of memorable characters. Each member brings their own distinct style and comedic sensibility to the table, creating a dynamic ensemble that never fails to entertain.The writing in \"Monty Python's Flying Circus\" is truly remarkable. The sketches are meticulously crafted, often blurring the line between reality and absurdity. The show's ability to seamlessly transition from one sketch to another keeps the momentum going, and the quick pace ensures that there is never a dull moment. The clever wordplay, social commentary, and cultural references woven into the sketches make for a rich and layered comedic experience.In addition to the sketches, the show is known for its iconic animations by Terry Gilliam. These quirky and imaginative animations serve as interludes between sketches, adding an extra layer of creativity to the show. Gilliam's distinctive visual style perfectly complements the comedic tone of the series and has become synonymous with Monty Python's unique brand of humor.While \"Monty Python's Flying Circus\" is widely celebrated, it is important to note that the humor can be an acquired taste. Some viewers may find the surreal nature of the sketches perplexing or the comedic style too offbeat for their liking. However, for those who appreciate boundary-pushing comedy that challenges conventions, this show is an absolute gem.\"Monty Python's Flying Circus\" remains a timeless classic that continues to inspire and influence comedy to this day. Its impact on popular culture cannot be overstated, and its sketches and catchphrases have become part of the comedic lexicon. Whether you're a die-hard fan or new to the world of Monty Python, this series is a must-watch for anyone seeking laughter, wit, and a healthy dose of absurdity."
    }
  ],
  "errorMessage": ""
}