{
  "imDbId": "tt1355642",
  "title": "Fullmetal Alchemist: Brotherhood",
  "fullTitle": "Fullmetal Alchemist: Brotherhood (TV Series 2009–2010)",
  "type": "TVSeries",
  "year": "2009",
  "items": [
    {
      "username": "cadillac20",
      "userUrl": "https://www.imdb.com/user/ur2619078",
      "reviewLink": "https://www.imdb.com/review/rw2170475",
      "warningSpoilers": false,
      "date": "7 December 2009",
      "rate": "9",
      "helpful": "172 out of 201 found this helpful.",
      "title": "Just might be the perfect mainstream series",
      "content": "Fullmetal Alchemist is, in a way, unique. It is very much a mainstream series, with the appeal of a huge cast of unique characters, action that commonly involves special powers, a fairly straight forward story with some mostly obvious symbolism, and a mix of comedy, action, drama, and even some romance. These are all common staples of long running anime series that lean towards a more commercial and public appeal. And yet, for a mainstream series, it manages to continually surprise with a very mature and serious tone. There is a great deal of tragedy and some moments are even frightening and memorable. Few series achieve such a perfect balance of mainstream entertainment and gut wrenching drama and tragedy.Such was what I discovered when I first laid my eyes on the original FMA series. And yet, for all it's greatness, it began to flounder in it's second season. As many series do, it took on its own form and story, and it was at that point that it started to lose its charm. So, Bones did the smart thing. They remade it. For most series, this would be pointless, but for FMA, it's very much welcome. Five years after the original series ended and the manga has had time to grow, this new FMA is better looking, paced better, and follows the manga, expanding the plot in a better direction.It's hard not to like anything about this new FMA. The action is fantastic and looks great, as it always did. We aren't subjected to single shots or poorly edited sequences. All the action is displayed and wonderfully animated. Likewise, all the charm is here as well, from the more serious scenes that fans will remember to the humor which is consistent and still funny. Bones took everything good about the original series and threw out all the bad, replacing those particulars with higher quality details. In a sense, it even feels like a new anime, and by episode 13, it has gone in a completely new direction.A better developed story and characters, superior animation, and fantastic details. These are what make the new FMA an instant new-age classic. Like FMA was the first time around, the new FMA will be one of the top anime to watch out for in the states."
    },
    {
      "username": "miguelpassador",
      "userUrl": "https://www.imdb.com/user/ur154311645",
      "reviewLink": "https://www.imdb.com/review/rw8300411",
      "warningSpoilers": false,
      "date": "4 July 2022",
      "rate": "10",
      "helpful": "42 out of 44 found this helpful.",
      "title": "This series teaches a class on how to count a story",
      "content": "Fullmetal Alchemist Brotherhood is a masterpiece, it's one of the best series of all time and definitely the best animation I ever watched.Great action, voice acting and amazing animation. And the philosophy about this show is very powerful.Overall:9,4/10."
    },
    {
      "username": "Carnivorous",
      "userUrl": "https://www.imdb.com/user/ur30101425",
      "reviewLink": "https://www.imdb.com/review/rw2642396",
      "warningSpoilers": false,
      "date": "14 July 2012",
      "rate": "10",
      "helpful": "180 out of 199 found this helpful.",
      "title": "No complaints, seriously. FANTASTIC.",
      "content": "Let's make one thing clear before I start this review, I have no experience with the previous incarnation of Fullmetal Alchemist. This series was my first foray into the world of FMA, & I must say, it is VERY excellent.First off, the series has a huge cast of interesting & unique characters. They are each quite different from each other, and act in different ways. The way the series elegantly manages all the character's developments and story lines is a feat in itself. The series also has a fantastically crafted plot, filled with action, humor, & tragedy. Despite its mainstream appeal, it still maintains a mature tone that really grabs you.The animation & art is top notch. You won't be getting any poorly edited sequences or grotesque looking art. The production values are great. I watched the series with the English voice track, and the dub did quite a good job. No complaints there. The soundtrack is excellent as well, particularly the opening & closing sequences that accompany each episode.It goes on for some 64 episodes, & maintains your attention the entire time. It even manages to close everything up in a satisfying manner. A fantastic series. This show will make you laugh, cry, and even get angry a few times.Loved it."
    },
    {
      "username": "garethwatkin",
      "userUrl": "https://www.imdb.com/user/ur12874267",
      "reviewLink": "https://www.imdb.com/review/rw2052427",
      "warningSpoilers": false,
      "date": "14 April 2009",
      "rate": "9",
      "helpful": "120 out of 143 found this helpful.",
      "title": "A Fantastic Reboot",
      "content": "Having been an avid fan of the first Fullmetal Alchemist series, i was highly apprehensive on hearing about this reboot, but the more i found out about the series, the more excited i became. I've always been a fan of the Manga, and the new series is being based completely of the manga storyline. This had be hooked, so i waited nervously for the first episode.The new series features better artwork that resembles Arakawa's style more closely than the last series. There is more humour, especially Ed transmuting a spear-head into his face. There is a new soundtrack, which admittedly, at times doesn't work greatly, but with some getting used too, i'm sure it will grow on me. Overall, i feel this series is a fantastic reboot, and is verging on turning Fullmetal Alchemist into the series it should always have been."
    },
    {
      "username": "insatiableaskeri",
      "userUrl": "https://www.imdb.com/user/ur134032486",
      "reviewLink": "https://www.imdb.com/review/rw8670787",
      "warningSpoilers": false,
      "date": "12 November 2022",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "An eye-popping picture",
      "content": "This is a story about self-awareness, audacity, compassion and willingness. The plot was awesomely good, the characters were incredibly portrayed as each and everyone of them had their own personality.I'm an ardent anime fan, and, of course, if compared to the version aired in 2003, the latter one was way better. Not only did it have a lot of new heroes, but also the storyline was narrated otherwise. My eyes were full of tears and glued to the screen while watching the battle between Ed and Father.Furthermore, the fate and background of other people such as Scar, Bradley and Ling was laid out excellently.Strongly recommended for everyone! Hats off!"
    },
    {
      "username": "ICtolic18",
      "userUrl": "https://www.imdb.com/user/ur153195613",
      "reviewLink": "https://www.imdb.com/review/rw8462698",
      "warningSpoilers": true,
      "date": "18 August 2022",
      "rate": "10",
      "helpful": "18 out of 19 found this helpful.",
      "title": "Truly one of the best Anime series that I've ever watched",
      "content": "Fullmetal Alchemist: Brotherhood (2009) tells the story of two brothers, named Edward and Alphonse Elric, who want to restore their bodies after a failed transmutation attempt. Both the direction and the way the story is told are very captivating and exciting to see and feel than in the original version.Edward and Alphonse are the extremely likable heart and souls of the show. I immediately fell in love with both of them from the beginning of the series. They share with us great character development, as well as to never give up on achieving their goals and fulfilling their promises, especially Ed.But not only them are the great piece of the cake. There are also many lovable characters who you will root for them immensely, even for the villains, and greatly appreciate when the good guys win a fight. You will support them to the point when you miss them when they will walk away.There are some great action scenes with a nice blend of alchemy and usual hand-to-hand combat. There are also comedy, drama, some slice-of-life, and even romance moments. I agree, there are some dark scenes when you are horrified, scenes when your guts are wrenched and you cry, and scenes that will make you laugh out loud many times.Also, it sticks more faithfully to the manga series and adds more philosophical features. Especially Ed's iconic line in the final episode was immensely satisfying to me, which adds a special moment that I will never forget.Overall, it's a masterpiece and one of the best anime experiences that I have ever felt. This anime will forever be memorable and awesome to me, especially with the great intros and outros that make a very nice feel to the show. If you want an anime with a fast pace, engaging story, great characters, awesome fights, balanced hilarious and emotional moments, and an amazing soundtrack that will keep you off your feet, this show is a MUST-WATCH."
    },
    {
      "username": "bandoolero",
      "userUrl": "https://www.imdb.com/user/ur22875242",
      "reviewLink": "https://www.imdb.com/review/rw2883340",
      "warningSpoilers": false,
      "date": "8 October 2013",
      "rate": "10",
      "helpful": "51 out of 58 found this helpful.",
      "title": "I feel like my spirit is elevated after having just finished the last episode.",
      "content": "I've seen this show recommended by many sources. Finally I decided to watch it.At first I was kinda disappointed. The first few episodes didn't make a huge impression on me. But as the story progressed and I got to know more and more fantastically written characters, the backstory started to unfold and alchemy expanded, it just got better and better.At a point I suddenly found myself addicted to the show. When one episode finished, I immediately started playing the next. The story deals with morally heavy themes. There is some seriously dark stuff in there. But there is also light. Once you experience terrible things in this show, it is truly cathartic to see some hearthwarmingly good things unfold as well.This show will make you feel very deep feelings. I have to admit to be crying at some points. It is a true roller-coaster.You will get so attached to the characters that after the series is over you will seriously miss them. That is a quality of a great show.The scope of the story is bigger than anything I have ever seen before (no joking, the stakes are bigger than in any other fantasy / sci-fi). You will find yourself truly rooting for the good guys, worrying about them, and cheering when they seem to succeed in combat against a foe.If you want to be amazed, addicted, emotionally lifted, press the start button on this show."
    },
    {
      "username": "Platypuschow",
      "userUrl": "https://www.imdb.com/user/ur57590728",
      "reviewLink": "https://www.imdb.com/review/rw4498089",
      "warningSpoilers": false,
      "date": "6 December 2018",
      "rate": "8",
      "helpful": "31 out of 40 found this helpful.",
      "title": "Hagane no renkinjutsushi: Superior to the original series",
      "content": "I'm a bit of a newbie when it comes to anime, I've seen a few but I'm still finding my feet. I was always told FMA is considered one of the top series and though I enjoyed it I wasn't blown away.FMA: Brotherhood however I found to be considerably better though the fact the same show was remade by the same studio and with the same voice cast baffled me. Now pardon my ignorance but the way I understand it the original series was an adaptation whereas Brotherhood was a loyal version of the original Manga?Regardless I consider to it to be considerably better. The character development seems rushed initially but quickly finds its pace, new additions bring a lot to the story and the actual story arc itself is on a far grander scale.Based on this I can only assume there was a lot of frustration with the original series as it can't have been considered a true adaptation of the source material. We're not talking minor differences here we're talking a different show altogether and certainly a heavily modified plot by comparison.The stellar voice cast, great animation, gripping story and excellent characters clung to me whereas the original series didn't and I fully understand why many told me it was the superior choice.Powerful, fascinating and devastating in places FMA: Brotherhood was a really enjoyable ride that I'm glad I was part of.The Good:Perfect voice castGreat charactersPowerful moving plot throughoutMore consistent in quality than the original seriesThe Bad:Couple of weak episodesRushed beginningI still HATE the over the top facial expressions that break from the anime styleThings I Learnt From This Series:Anyone who wants you to call them \"Führer\" is probably up to no goodEnvy is what is known as a \"Trap\" right?Sometimes dead is better (I totally said that in Fred Gwynnes voice)Kids should drink their milk!"
    },
    {
      "username": "bestaloouc",
      "userUrl": "https://www.imdb.com/user/ur155530016",
      "reviewLink": "https://www.imdb.com/review/rw8420921",
      "warningSpoilers": false,
      "date": "9 August 2022",
      "rate": "10",
      "helpful": "19 out of 19 found this helpful.",
      "title": "So well executed",
      "content": "Fullmetal Alchemist Brotherhood is amazing, I love every minute, the characters are great all of them receive a nice development, the voice acting is amazing too both dub and sub are great, animation and the choreography are awesome.This is perfect series for anime and mainstream fans, just watch."
    },
    {
      "username": "Lukasmj",
      "userUrl": "https://www.imdb.com/user/ur158768880",
      "reviewLink": "https://www.imdb.com/review/rw8673020",
      "warningSpoilers": false,
      "date": "13 November 2022",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "None Anime ever represented brotherly love so good.",
      "content": "Fullmetal Alchemist: Brotherhood is without a doubt one of my favorite animes!The two brothers have such a strong bond and work together perfectly as a team.Her intention to find the philosopher's stone in order to retrieve Alphonse's body is brilliantly written, but unfortunately it doesn't seem like an easy task.On their way, the brothers encounter many obstacles, most of which are personified in the form of homoculuses.The anime contains funny but also very serious and shocking moments.The plot twists are also presented exceptionally well.The anime also has an intro that I just couldn't skip.Clear recommendation on my part!"
    },
    {
      "username": "Kentvaroy",
      "userUrl": "https://www.imdb.com/user/ur23158821",
      "reviewLink": "https://www.imdb.com/review/rw2311680",
      "warningSpoilers": false,
      "date": "17 September 2010",
      "rate": "8",
      "helpful": "332 out of 408 found this helpful.",
      "title": "Pretty much the best show made in the history of mankind",
      "content": "Ill explain why this is the best series ever made and why i feel worthy of judging that.*Note that English isn't my native tongue* I've been addicted to series for like... forever. I could probably list at least 50 full series I've seen from all kinds.If i told myself 10 years ago or so that the best series i would ever see was an Anime i wouldn't have believed it.This series made me laugh out loud, cry and bring up pretty much every part of human emotion possible. The characters and story are pretty much flawless and there is little to none loose ends. There isn't a \"stormy\" story curve as many series suffer from - where the intro - mid part or ending is to short , to long or rushed. The pace through the entire anime is good.The series does not suffer either from things like to slow riddles-to-answers rate (Lost *cough*) or to fast story.All characters are developed in a brilliant way through the series.Of all movies and shows I've seen in my lifetime - if i would have to recommend one single series to someone it would be this one without hesitation.If i had an enemy i hated in real life more than anything - even i wouldn't be so cruel as to deny that person to see this show. I could deny them food instead and it would be merciful. Thats how good this show is.One thing that was a major concern early on was that this show would be to childish and silly. Don't be deceived, it is very mature and some elements are even horrifying.This is one of the only shows I've ever seen, where i haven't been able to personally come up with better ideas on how to make it.Perfection.See it.I also recommend original Japanese voices with English text for best experience."
    },
    {
      "username": "CallMeAi",
      "userUrl": "https://www.imdb.com/user/ur99174738",
      "reviewLink": "https://www.imdb.com/review/rw4739765",
      "warningSpoilers": false,
      "date": "23 March 2019",
      "rate": "10",
      "helpful": "36 out of 45 found this helpful.",
      "title": "The Best Anime EVER!",
      "content": "I love everything about this. The plot, the characters, the visuals, the humor, the soundtrack, heck even the villains. This anime explores so many important themes; science and the ethics behind it, war and how to cope with it, brotherhood and family, death, love, hope, philosophy and so much more. This is the first and only anime that made me cry over a villain. This anime hits you with so many feelings. I love the world, love the characters and the diversity in them. Unlike the original FMA 03, this explores most characters very thoroughly. And man can I say the voice acting is insanely AWESOME! And yes I'm talking about the dubbed version (I admit I'll never watch this subbed). The conclusion is, if you're an anime fan, this is a must to watch. This anime is just beyond amazing and I never get tired of this."
    },
    {
      "username": "LollipopST",
      "userUrl": "https://www.imdb.com/user/ur123180962",
      "reviewLink": "https://www.imdb.com/review/rw8562912",
      "warningSpoilers": false,
      "date": "23 September 2022",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "A Well Made Story.",
      "content": "First let me say that the music/OSTs in this anime is just magnificent, there is not even one single bad opening! Every opening them is just so perfect that you can't stop listening to it! The background music is so goated! My favorite op is the 5th op \"Rain\" by SID and it's actually my all time favorite anime op, the greatest opening ever. But other than that the \"Fullmetal Alchemist: Brotherhood\" story about two brothers and their journey to try to get their bodies back is a perfect storytelling, with a great writing to every character and a really good characters design and a nice world building plus a fine animation. Something that I really like about this anime is that how they show you all this things about the military and how you can't trust people no matter who they are and all this thing with the dogs of the military etc... I also like the philosophy in this anime but I don't want to say too much here, so if you really wanna know what I'm talking about search on YouTube \"The Philosophy of Fullmetal Alchemist: Brotherhood\" there is a video there by \"Wisecrack\", I recommend you to watch it if you've already finished the anime."
    },
    {
      "username": "Uncle_father_oscar",
      "userUrl": "https://www.imdb.com/user/ur24147702",
      "reviewLink": "https://www.imdb.com/review/rw2631482",
      "warningSpoilers": false,
      "date": "23 June 2012",
      "rate": "9",
      "helpful": "260 out of 294 found this helpful.",
      "title": "Surpasses the original in almost every way",
      "content": "This review is mainly meant for anyone who watched Fullmetal Alchemist and is either considering Brotherhood, has watched a few episodes and not liked it, or has read one of the negative reviews and was put off.When I first heard about Fullmetal Alchemist: Brotherhood, I was skeptical. Seeing as the original Fullmetal Alchemist is the first anime I have ever completely watched and is the spark that ignited my obsessive love of anime that I have today, a redo seemed unnecessary to say the least. What could possibly be improved upon a show as fantastic as Fullmetal Alchemist? With hesitation and doubt in my heart I started watching the series... and instantly hated it. I won't lie, my first impressions were not only that the show didn't live up to the original, but that it was also an abomination that was dancing on the grave of a greater show. I cried, I screamed, I broke things, I didn't do any of the above because I'm exaggerating and not actually crazy, but I was still quite upset. The criticisms bubbled up inside me until I was frustratingly glaring at the TV appalled at such changes as Alphonse's voice actor, or a lack of the opening starting with the classic \"in those days, we really believed...\" lines from Al. With each passing episode the insults to Fullmetal Alchemist seemed to grow, episodes that were lovingly crafted in the original series were apparently being lightly brushed on. Moments in the original that got me hooked fell flat in Brotherhood, and I was fed up and ready to write the letter of complaint to end all letters of complaint. But then, my eyes began to open. Right around episode 13 where the plot of the two animes separates I started to think that this story might actually be good. As the episodes began to fly I realized that it wasn't good, it was great. After finishing the series I knew without a doubt in my mind that what I had witnessed was my favorite anime of all time. The story of Brotherhood is better than that of the original on so many levels that the two shows truly don't compare. After having my eyes opened I was forced to drop the rating that I gave to the original to an 8 simply because now I knew how much lost potential it had. If you enjoyed the story of Fullmetal Alchemist, stick with Brotherhood and I guarantee you that you will not regret it. Not only is the plot and storyline vastly improved upon and more satisfying, the animation, music (in my opinion at least, some disagree), characters, and overall feel is far better. Therefore, if you are a true fan of the original series don't give up on Brotherhood after only a few episodes like I was so tempted to do, it is a show that grows into something that will go down in history as one of the greats of animation history and you shouldn't miss out."
    },
    {
      "username": "aliceveiak",
      "userUrl": "https://www.imdb.com/user/ur154349232",
      "reviewLink": "https://www.imdb.com/review/rw8303828",
      "warningSpoilers": true,
      "date": "6 July 2022",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "It's perfect",
      "content": "I don't have words to this anime he just hit almost everything on perfection.My only issues is the first episodes that feel rushed. But after the first eleven episodes this show just become the best animation of all time,the characters development the story it's all perfect.Overall:9,5/10."
    },
    {
      "username": "cajucaipira",
      "userUrl": "https://www.imdb.com/user/ur157839996",
      "reviewLink": "https://www.imdb.com/review/rw8620349",
      "warningSpoilers": false,
      "date": "18 October 2022",
      "rate": "10",
      "helpful": "16 out of 16 found this helpful.",
      "title": "A review from an NOT anime fan.",
      "content": "I'm not gonna lie, I don't like animes, seriously since I was a child I never feel any type of interesting from Naruto or Dragon Ball, but this one, oh boy he really put the bar on a really high standard.Fullmetal Alchemist Brotherhood is an anime that you can enjoy even without like animes(he really resembles the Avatar for me) the story is so well written I'm impressed with the alchemy a how close is from the actual alchemy, the animation is great, soundtrack is good and after the episode 19 I'm could force me stop watching, the plot is so entertaining that when i finished the last episode my spirit was elevated to the maximum.While I don't know much of other animes this one is really impressive I definitely recommend."
    },
    {
      "username": "tmilom99",
      "userUrl": "https://www.imdb.com/user/ur23852493",
      "reviewLink": "https://www.imdb.com/review/rw2310975",
      "warningSpoilers": true,
      "date": "15 September 2010",
      "rate": "10",
      "helpful": "57 out of 69 found this helpful.",
      "title": "Such a Great Amime, it is a must watch series",
      "content": "I really loved the original FMA series and was really skeptical about watching this series. I just fell that the original series was so good that a new one was unnecessary. When I read that Brotherhood was all based on the Manga, I decided to give it a try, because the FMA began as a manga after all, I felt that I should watch the \"real\" story. In the beginning I felt like I was watching the same story, but things were happening at a much faster pace. Then the whole story just went to a place that I could not imagine (which was good), and after awhile, I just realized that this series was so much better than the original series. That is a huge statement for me, because I have seen a decent amount of anime, and felt that the original FMA was second only to DeathNote.I loved how there were new characters (along with old ones that I loved)in this series and felt that because the series was not simply based on getting a philosophers stone, but really thwarting the evil plot of the villains it was a better story. Everything meshed so great and the back stories on Van Hoenhiem were excellent. The one bad thing about the story was they never said how the Dwarf in the Flask was created. I really liked this little villain and was interested in his origins a lot.With that being said, if you are looking for superb animation and story line, with drama, action, comedy, and a little bit of everything else, then I urge you to watch this series and the original FMA series. I think that this version is better than the original and DeathNote. It's really because of the way the story ends, which I will not spoil, but I will say that it is a true ending and we don't have to wait for Bones to make a movie to really wrap things up. Watch it and fall in love with FMA all over again."
    },
    {
      "username": "ahsanejaz756",
      "userUrl": "https://www.imdb.com/user/ur37977044",
      "reviewLink": "https://www.imdb.com/review/rw8624400",
      "warningSpoilers": true,
      "date": "20 October 2022",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "It's better than the OG one? yes but some flaws too still 8/10",
      "content": "First I agree the original one didn't have it's storyline on the right path and made up the story without any context. However the brotherhood remake dealt with the story very well and the animation is on point. Tho there were still moments that were kinda turn offs. Like WINRY SAN popping up at a fight every time Elric brothers were involved. It literally made no sense and happened like frequently through out the show. Her character made the Elric brothers handy capped every time they were on verge of achieving some thing. On the other hand I loved the introduction of eastern Alchemy and new countries like Xing. The global map was extended in this remake whereas previously the story was mostly set in central or Resembool. However, this story still had loopholes but overall turned out better than the original hagane no renkin jujitsu!"
    },
    {
      "username": "babydobabylo",
      "userUrl": "https://www.imdb.com/user/ur155278074",
      "reviewLink": "https://www.imdb.com/review/rw8394331",
      "warningSpoilers": false,
      "date": "2 August 2022",
      "rate": "10",
      "helpful": "15 out of 15 found this helpful.",
      "title": "The best reboot",
      "content": "Fullmetal Alchemist was originally made in 2003 and after 6 years he received one remake following the original Manga.While the first couple of episodes are done better in the original after the 12 episode the anime just blow up in one of the best writing adventure and history I ever seen. Every character receive a time to shine and the animation is fantastic even after 10 years.You probably gonna love this."
    },
    {
      "username": "therskybznuiss",
      "userUrl": "https://www.imdb.com/user/ur128832707",
      "reviewLink": "https://www.imdb.com/review/rw6863124",
      "warningSpoilers": false,
      "date": "29 April 2021",
      "rate": "7",
      "helpful": "33 out of 51 found this helpful.",
      "title": "Losing my interest about halfway through, but -did- enjoy it.",
      "content": "It's waring on my patience, the more character's that get introduced, the pointless conversations, -completely- pointless sub-plots. It feels like a lot of this show is either localized in an incredibly contrived way, or there's quite a lot of filler.Still, I really enjoyed the first 2 seasons (or Parts as Netflix is calling them) and due to the love this series has gotten I'll keep trying to watch. Not a -true- anime fan - I like Bebop, NG:E, Akira, took the chance on this and loved the charm and bounciness of the the plot of this show. I'll edit this if my opinon changes in some major way."
    },
    {
      "username": "withlovshankar",
      "userUrl": "https://www.imdb.com/user/ur26753248",
      "reviewLink": "https://www.imdb.com/review/rw2515390",
      "warningSpoilers": false,
      "date": "8 November 2011",
      "rate": "10",
      "helpful": "125 out of 159 found this helpful.",
      "title": "Best of all Anime and better than the earlier version",
      "content": "I have seen both versions of Fullmetal Alchemist (Brotherhood) and both are good. In the first version (Fullmetal Alchemist), the first half of the series is really good. The fight between Edward Elric & Roy Mustang and the State Alchemist test taken by Edward Elric are notable ones. In second half, the story takes lots of twists and turns and I find it's not as impressive as the first half.The second version (Fullmetal Alchemist Brotherhood) is sticking to manga and has the soul of the original story. It is an all-rounded anime with tightly knit fantastic story, humorous, action packed, dark at times and entertaining. In first half, character introduction, funny moments, action sequence, ends with almost no hope situation for our heroes. In second half, the story takes it's fast pace with more action and nail biting moments.The decisions/resolutions taken by the Elric brothers at each step of their journey are clearly justified. All characters had their importance in the series, even the cute little panda and Yogi had their importance in moving the story forward. Usually when a character is introduced in the middle of a series, it stay far too superior/inferior to rest of the characters. But I like the way Olivier Mira Armstrong and Lin Yao gang introduced in the series.Sometimes when I think of watching something, I start with any one particular scene in this series and ended up watching till the very end of the series. I don't remember how many times I watched it.I have seen many anime in all genre (comedy, drama, action, adventure, thriller, slice of life, bloody ones, etc.) and in my opinion, Fullmetal Alchemist Brotherhood is the best in overall. So I give 10 out of 10.When people asks me to suggest something to watch, I recommend this series without blinking. Either they say Animation is for kids or series are lengthy to watch without knowing how Japanese anime differs from Western animation. I would say one thing, watch at least couple of episodes and then you will understand why I recommend this series.Suggestion: The first episode is more of an quick introduction of main casts. The actual story starts in episode 2. So it is OK to skip episode 1. Japanese audio is better than English audio.Other suggested Animes: Cowboy Bebop, Death Note, Code Geass, Steins Gate, Hunter X Hunter, Attack on Titans, Samurai Champloo, Great Teacher Onizuka, Parasyte, One Punch Man (season 1), Boku no Hero Academia, Ghost in the shell (both movies & series, have complex plot), Shigurui (only adults, watch only if you are OK with violence & sex)"
    },
    {
      "username": "trampoleonardo",
      "userUrl": "https://www.imdb.com/user/ur154376907",
      "reviewLink": "https://www.imdb.com/review/rw8307741",
      "warningSpoilers": false,
      "date": "6 July 2022",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "The best animation story off all",
      "content": "Fullmetal Alchemist is amazing, the story is amazingly well executed, don't have fillers or boring episodes, good characters development and one epic action and animation.Overall:9,4/10."
    },
    {
      "username": "bmoore07",
      "userUrl": "https://www.imdb.com/user/ur46109250",
      "reviewLink": "https://www.imdb.com/review/rw3237127",
      "warningSpoilers": false,
      "date": "12 May 2015",
      "rate": "10",
      "helpful": "40 out of 60 found this helpful.",
      "title": "The jack-of-all-trades anime",
      "content": "Cartoon Network isn't what it used to be. As a kid, I watched CN because it had shows that appealed to tons of people, shows that had meaning, and shows that deserved to be labeled classics. Those shows are gone. Teen Titans, Samurai Jack, The Batman, Chowder, Kids Next Door, and more have been dismissed for garbage cartoons like Teen Titans Go! , Adventure Time, Ninjago, and Uncle Grandpa (No comment on those new Pokémon incarnations). With the exception of Clarence and Steven Universe, Cartoon Network is a joke. CN's lone redeeming factor is Toonami, a late-night segment form Saturday evening to Sunday morning where various anime are featured, and one of them used to be Fullmetal Alchemist: Brotherhood.I never liked Brotherhood; I love it. An avid reader of the FMA manga, I stumbled upon Brotherhood on Toonami and, from there, I was hooked. Fullmetal Alchemist: Brotherhood is about two brothers, Edward and Alphonse Elric, who lose possession of their bodies as a result of breaking the most important rule in alchemy, attempting to resurrect the dead, and they journey across the country of Amestria as they attempt to reclaim their former selves. Edward Elric is this anime's protagonist, the famed \"Fullmetal Alchemist\" whose legendary reputation is rivaled by his alchemical skills, the wise cracking prodigy with an unpredictable personality and a strong distaste for milk, and the height-conscious adolescent with a constant inner conflict about morality, a massive amount of confidence, and an unwavering dedication to his loved ones. If I were to make a list of the greatest anime characters, Edward Elric would be in at least the top ten. Alphonse Elric is the younger of the two brothers, a gentle and likable young boy trapped in a suit of armor that serves as Edward's mediator during Ed's explosive episodes (Al is often assumed to be the older of the two due to his height). Brotherhood ventures into a variety of places throughout Amestria, from the bustling business environment in Central City to the fear-inducing tunnels underneath the city, from the wind-driven snowflakes covering the Drachma region to the primal adobes in dust-consumed Ishval, and, in all of them, this anime crafts the setting with a razor-sharp eye for detail and an amazingly artistic flair.The majority of FMA Brotherhood doesn't focus on the Elric brothers but instead on the people surrounding them. Colonel Roy Mustang is my favorite character, an easygoing alchemist with the coolest power ever (He can unleash fire by – get this! – snapping his fingers!), and an ambitious leader that alternates between cracking jokes and being dangerously serious. There's Winry Rockbell, a childhood friend of the Elric brothers and a gifted mechanic. There's Scar, a sunglasses-wearing Ishvalan with a reputation as a malicious murderer and a mission to destroy alchemists of the military via alchemy. Brotherhood also contains a great group of villains in the Homunculi, the seven nearly-unstoppable immortal-like beings each with their own unique personality, and their Father. The two Homunculi that stood out to me were Greed (The Homunculi are named after the seven deadly sins), a rebellious man with steel-like skin, and Pride. Born from Nightmare Fuel, Pride is this anime's most important villain excluding the main antagonist Father who I will remember most for that frightening scene with Lieutenant Riza Hawkeye. Excluding the emotionless Father, Fullmetal Alchemist: Brotherhood has characters with great acting, emotion, complexity, and (above all) likability (Is this even a word?)There are five main themes in Brotherhood; the final opening is by far the most emotional, but my favorite is the first, a fast-paced theme song that slowly intensifies at a pace with the opening's singer. Plotwise, there isn't a big difference in Brotherhood from the Fullmetal manga (although Isaac the Freezer never graced the FMA pages nor did Father Cornello evolve into a hulking beast), but the anime is still just as good, with more twists than a Twizzler stick and more energy than a kid on a sugar rush.Perhaps the greatest thing about Fullmetal Alchemist: Brotherhood is its appeal to all genres. If you want tons of action, if you want a show with martial arts, if you want a military-themed anime, if you want some mystery to your show, if you want some sci-fi in your show, if you want a huge focus on adventure in your show, if you want some slice-of-life aspects to your anime, if you want to see buckets of blood, if you want to watch a show with fantasy elements in it, if you want to watch a dystopia-themed show, if you want to check out an anime with depth, then Fullmetal Alchemist: Brotherhood is the series for you."
    },
    {
      "username": "anthonyhorwood",
      "userUrl": "https://www.imdb.com/user/ur22503177",
      "reviewLink": "https://www.imdb.com/review/rw2630086",
      "warningSpoilers": true,
      "date": "20 June 2012",
      "rate": "10",
      "helpful": "41 out of 50 found this helpful.",
      "title": "probably the greatest animated entertainment ever made",
      "content": "Summary/Spoilers: FMAB is the story of two brothers; Alphonse and Edward Elric. The boys lose their mother to illness, and they try to use alchemy to bring her back. This goes horribly wrong because they neglected the basic rule of alchemy, the principal of equal exchange. To gain something from alchemy you must give something of equal value. The brothers' disastrous experiment costs Edward his left leg and Alphonse his entire body. Ed manages to affix Al's soul to a suit of armour, at the cost of his right arm and the two maimed boys are left alone to study alchemy in the hope of restoring themselves to normality.A little while later a colonel in the military, another alchemist named Roy Mustang, invites the brothers to become State Alchemists, an offer only Edward accepts, giving them access to the enormous resources of the military that brothers hope will help them to recover their lost body parts. The brothers set off in search of the Philosopher's Stone as a means to restore their bodies. Throughout their journey, they meet allies and enemies and discover the true nature of the Philosopher's Stone, and an awful secret plan that they must fight to prevent.Review: FMAB contains that wonderful thing, a totally original, self-consistent universe different from ours, but familiar enough not to be off-putting. The characters are all distinct, fully-formed and convincing; you will love most, hate a few and not care much one way or the other about others. The story is brilliant. It begins in a relatively small way with the brothers travails, and expands into something magnificent I will not go into.It's mood is finely judged. There's some light comedy, some tragedy, a lot of action and something to think about, and all the while the character development is gripping. The relationships between the characters are complex and changing, and the brothers grow up during the series, adding more levels. There are those wonderful moments when you see one of the enemy attacking the wrong person and you think \"That was a mistake\", because the relationships are clearly enough defined that you know retribution is on its way. A lovely example is Roy Mustang, the Flame Alchemist, explaining to a homunculus that has just attacked his 'dearest subordinate' how he uses one hand for macro effects like burning an entire room and the other for pinpoint attacks, like evaporating the fluid in the hapless homunculus' eyeballs. It is the minute attention to detail, all detail, that makes this anime so special.The graphics are excellent. I really like them for both technical quality and art. I have recently seen 'better', but that was because the goalposts moved, and techniques improved. FMAB still has 10/10 graphics.I recommend watching in Japanese with subtitles. It's just better. The American voice actors did a good job, but it's just more characterful with Japanese voices. The voice acting is truly excellent; it's taken very seriously in Japan, and they do it very well.As I said in the title, I think that this is probably the greatest animated entertainment ever made. If you only ever watch one anime make it this one. If you watch anime anyway and haven't seen FMAB, do so. It would be a complete waste of your life if you were hit by a meteorite before you saw it. When was the last time you saw a cartoon 25 hours long and couldn't stop watching, despite the fact that life would be somehow empty after it was over? Do yourself a favour, buy this. It's not a lot of money for the epic adventure you are about to experience. It may well be the best money you ever spent."
    },
    {
      "username": "brancogabriel-71904",
      "userUrl": "https://www.imdb.com/user/ur154173762",
      "reviewLink": "https://www.imdb.com/review/rw8287111",
      "warningSpoilers": false,
      "date": "30 June 2022",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "The best anime off all time",
      "content": "This anime, is what all action series should be.Great cast, good soundtrack, and the voice acting was on point.Fullmetal Alchemist Brotherhood is perfect I can't find any really noticeable bad thing on this show."
    }
  ],
  "errorMessage": ""
}