{
  "imDbId": "tt1355642",
  "title": "Fullmetal Alchemist: Brotherhood",
  "fullTitle": "Fullmetal Alchemist: Brotherhood (TV Series 2009–2010)",
  "type": "TVSeries",
  "year": "2009",
  "language": "en",
  "titleInLanguage": "Fullmetal Alchemist: Brotherhood",
  "url": "https://en.wikipedia.org/wiki/Fullmetal_Alchemist:_Brotherhood",
  "plotShort": {
    "plainText": "Fullmetal Alchemist: Brotherhood (Japanese: 鋼の錬金術師 FULLMETAL ALCHEMIST, Hepburn: Hagane no Renkinjutsushi) is a Japanese anime television series adapted from the original Fullmetal Alchemist manga series by Hiromu Arakawa. Produced by Bones, the series is directed by Yasuhiro Irie, written by Hiroshi Ōnogi and composed by Akira Senju. The series was conceived in order to create a faithful adaptation that directly follows the entire storyline of the original manga, after 2003's Fullmetal Alchemist anime series strayed away from it to tell its own story after running out of published manga material to adapt.\r\nProduction for Fullmetal Alchemist: Brotherhood began in 2008. The series was broadcast for sixty-four episodes on MBS–TBS from April 2009 to July 2010. The series was first licensed in North America by Funimation and was broadcast English-dubbed on Adult Swim from February 2010 to September 2011. In 2016, Funimation lost the rights to the series and it was transferred to Aniplex of America.\r\nFullmetal Alchemist: Brotherhood earned acclaim from critics and audiences, and is considered to be one of the best anime series of all time. Reviewers noted its faithfulness to the manga and its introduction of characters and plot details that were not present in the 2003 anime; the climactic episodes were also lauded for both its action scenes and moral messages.",
    "html": "<p>Fullmetal Alchemist: Brotherhood (Japanese: 鋼の錬金術師 FULLMETAL ALCHEMIST, Hepburn: Hagane no Renkinjutsushi) is a Japanese anime television series adapted from the original Fullmetal Alchemist manga series by Hiromu Arakawa. Produced by Bones, the series is directed by Yasuhiro Irie, written by Hiroshi Ōnogi and composed by Akira Senju. The series was conceived in order to create a faithful adaptation that directly follows the entire storyline of the original manga, after 2003's Fullmetal Alchemist anime series strayed away from it to tell its own story after running out of published manga material to adapt.</p><p>Production for Fullmetal Alchemist: Brotherhood began in 2008. The series was broadcast for sixty-four episodes on MBS–TBS from April 2009 to July 2010. The series was first licensed in North America by Funimation and was broadcast English-dubbed on Adult Swim from February 2010 to September 2011. In 2016, Funimation lost the rights to the series and it was transferred to Aniplex of America.</p><p>Fullmetal Alchemist: Brotherhood earned acclaim from critics and audiences, and is considered to be one of the best anime series of all time. Reviewers noted its faithfulness to the manga and its introduction of characters and plot details that were not present in the 2003 anime; the climactic episodes were also lauded for both its action scenes and moral messages.</p>"
  },
  "plotFull": {
    "plainText": "Fullmetal Alchemist: Brotherhood (Japanese: 鋼の錬金術師 FULLMETAL ALCHEMIST, Hepburn: Hagane no Renkinjutsushi) is a Japanese anime television series adapted from the original Fullmetal Alchemist manga series by Hiromu Arakawa. Produced by Bones, the series is directed by Yasuhiro Irie, written by Hiroshi Ōnogi and composed by Akira Senju. The series was conceived in order to create a faithful adaptation that directly follows the entire storyline of the original manga, after 2003's Fullmetal Alchemist anime series strayed away from it to tell its own story after running out of published manga material to adapt.\r\nProduction for Fullmetal Alchemist: Brotherhood began in 2008. The series was broadcast for sixty-four episodes on MBS–TBS from April 2009 to July 2010. The series was first licensed in North America by Funimation and was broadcast English-dubbed on Adult Swim from February 2010 to September 2011. In 2016, Funimation lost the rights to the series and it was transferred to Aniplex of America.\r\nFullmetal Alchemist: Brotherhood earned acclaim from critics and audiences, and is considered to be one of the best anime series of all time. Reviewers noted its faithfulness to the manga and its introduction of characters and plot details that were not present in the 2003 anime; the climactic episodes were also lauded for both its action scenes and moral messages.\r\nPlot\r\nBrothers Edward and Alphonse Elric are raised by their mother Trisha Elric in the remote village of Resembool in the country of Amestris. Their father Hohenheim, a noted and very gifted alchemist, abandoned his family while the boys were still young, and while in Trisha's care they began to show an affinity for alchemy and became curious about its secrets. However, when Trisha died of a lingering illness, they were cared for by their best friend Winry Rockbell and her grandmother Pinako. The boys traveled the world to advance their alchemic training under Izumi Curtis. Upon returning home, the two decide to try to bring their mother back to life with alchemy. However, human transmutation is a taboo, as it is impossible to do so properly. In the failed transmutation, Al's body is completely obliterated, and Ed loses his left leg. In a last attempt to keep his brother alive, Ed sacrifices his right arm to bring Al's soul back and binds it to a nearby suit of armor. After Edward receives automail prosthetics from Winry and Pinako, the brothers decide to burn their childhood home down, symbolizing their determination and decision of \"no turning back,\" and head to the capital city to become government-sanctioned State Alchemists. After passing the exam, Edward is dubbed the \"Fullmetal Alchemist\" by the State Military, and the brothers begin their quest to regain their full bodies back through the fabled Philosopher's Stone under the direction of Colonel Roy Mustang. Along the way, they discover a deep government conspiracy to hide the true nature of the Philosopher's Stone that involves the homunculi, the alchemists of the neighboring nation of Xing, the scarred man from the war-torn nation of Ishval, and their own father's past.\r\nVoice cast\r\nProduction\r\nIn the 20th volume of the Fullmetal Alchemist manga, released in August 2008, series author Hiromu Arakawa announced that a second anime adaptation was being produced; the previous series, Fullmetal Alchemist, had debuted in 2003 and featured an anime original story direction midway through its run. The Japanese title of the second adaptation is Hagane no Renkinjutsushi: Fullmetal Alchemist (鋼の錬金術師 FULLMETAL ALCHEMIST, abbreviated as 鋼の錬金術師FA), including the English translation as a subtitle to differentiate it from the 2003 series, while the English release uses the subtitle Brotherhood.\r\nBones produced Brotherhood with Yasuhiro Irie as director, Hiroshi Ōnogi as writer, and Akira Senju as composer. Voice actresses Romi Park and Rie Kugimiya reprised their roles as Edward and Alphonse Elric, respectively. Unlike the first anime, the second anime faithfully follows the complete story of the manga. Irie faced the difficulties of making the series as appealing as possible. Due to his large popularity within the fanbase, Irie had to properly focus on the character of Roy Mustang. When the manga was nearing its completion in May 2010, Irie announced that the Bones staff was already working on the final episodes adapting the ending and expressed shock at the series' conclusion.\r\nBrotherhood's music composer is Akira Senju. The first CD soundtrack from this anime was published on October 14, 2009. The second CD soundtrack from the anime was published on March 24, 2010. The third CD soundtrack became available on July 7, 2010. Fullmetal Alchemist Final Best, a compilation of opening and ending songs, was released on July 28, 2010. On June 29, 2011, the original soundtrack of Fullmetal Alchemist: The Sacred Star of Milos(FULLMETAL ALCHEMIST Nageki no Oka no Seinaru Hoshi), composed by Taro Iwashiro, was released.\r\nThe respective opening and ending themes for the first 14 episodes are \"Again\" by Yui and \"Uso\" (嘘, lit. \"Lie\") by Sid. From episode 15–26, the respective opening and ending themes are \"Hologram\" by Nico Touches the Walls and \"Let It Out\" by Miho Fukuhara. From episode 27–38, the respective opening and ending themes are \"Golden Time Lover\" by Sukima Switch and \"Tsunaida Te\" (つないだ手, lit. \"Tied Hands\") by Lil'B. From episode 39–50, the respective opening and ending themes are \"Period\" by Chemistry and \"Shunkan Sentimental\" (瞬間センチメンタル, Shunkan Senchimentaru, lit. \"Sentimental Moment\") by Scandal. From episodes 51–62, the respective opening and ending themes are \"Rain\" (レイン, Rein) by Sid and \"Ray of Light\" by Shoko Nakagawa. While episodes 63 and 64 do not use opening themes, they use \"Rain\" and \"Hologram\", respectively, for the endings.\r\nRelease\r\nIn March 2009, it was announced that the official English title of the series was Fullmetal Alchemist: Brotherhood, and that it would receive its English-language premiere on Animax Asia, with Japanese audio and English subtitles, at 8:30 p.m. on April 10, 2009. On April 3, 2009, Funimation announced it would stream English-subtitled episodes four days after they aired in Japan. Madman Entertainment would also stream it \"within days\" of the episodes airing in Japan. The series premiered in Japan on April 5, 2009, on MBS–TBS's Sunday 5:00 pm JST anime block.\r\nIn May 2009, Funimation suspended the release of new episodes for a few weeks because of an incident in which an episode of One Piece was uploaded before it had aired in Japan. However, the episodes were later made available on the Funimation website and on the official Funimation channel on YouTube.\r\nIn August 2009, Aniplex started releasing the series on Blu-ray and DVD; the first release included two episodes and an OVA. Two more OVAs were included in the fifth and ninth volumes alongside four episodes. Other volumes feature four episodes and no OVAs. Sixteen volumes were released, the last one in November 2010. In September 2009, Funimation announced the cast for an English dub of the series, which featured much of the cast for the 2003 series dub reprising their roles. On February 14, 2010, the English dub of the series premiered on Adult Swim; its run ended on September 25, 2011. Funimation began releasing the episodes on Blu-ray and DVD in May 2010; each release contained thirteen episodes. Five volumes were released, the last one in August 2011. In the United Kingdom, Manga Entertainment released the series in five DVD and Blu-ray volumes during 2010 and 2011, and later in a two-part box set.\r\nFunimation lost the rights to the series in March 2016. In July 2016, it was announced that the series was transferred to Aniplex of America and it would be streamed on Crunchyroll. Netflix released the series on their streaming platform in the United States and Canada in January 2018. Aniplex of America released the series on two Blu-ray Disc box sets in November 2018. In November 2019, Funimation re-licensed the series for its streaming service. Madman Entertainment distributed the series in Australia; it was broadcast in Canada on Super Channel; and in the Philippines on TV5's AniMEGA anime programming block.\r\nReception\r\nOn review aggregator site Rotten Tomatoes, Fullmetal Alchemist: Brotherhood holds an approval rating of 100%, with an average rating of 8/10. The site's critic consensus reads: \"With impeccable world-building, rollicking action, and emotionally intelligent themes, all the elements come together to make this Fullmetal Alchemist reboot a pristine distillation of the shounen genre.\" The series is considered to be one of the best anime of all time, and has earned acclaim from several reviewers and publications.\r\nD. F. Smith, writing for IGN, noted the short time-span between the releases of the 2003 series and Brotherhood, which he deemed peerless among other anime. Smith judged the pace of the first 14 episodes to be quicker than their original-series counterparts, which he interpreted as the series presuming the viewer is already familiar with the characters. Smith also observed that while this approach enables reaching the more \"exciting\" story elements faster, it does exclude enjoyable moments with supporting characters, such as Winry and Major Hughes, found in the first adaptation.\r\nThe first fourteen episodes of Brotherhood initially were criticized by members of the Anime News Network staff, who said that repeating events from the first anime led to a lack of suspense. Mania Entertainment's Chris Beveridge said that the entertainment in these episodes lay in the differences in the characters' actions from the first series, and original content which focused on the emotional theme of the series. Beveridge praised the new fight scenes and the extra drama, which made these episodes \"solid\", while Smith found the action scenes unexpectedly \"compact\".\r\nMegan Gudeman of CBR called relationships in the anime \"dynamic and memorable\". Chris Zimmerman from Comic Book Bin said the series \"turns around and establishes its own identity\" because of the inclusion of new characters and revelations not shown in the first series, increasing its depth. He said the animation was superior to that of the first anime; his comments focused on the characters' expressions and the execution of the fight scenes. Much praise was given to the climactic episodes for the way the action scenes and morals were conveyed; many reviewers found them superior to the conclusion of the first Fullmetal Alchemist anime.\r\nCritics found the conclusion satisfying; Mark Thomas of The Fandom Post called it a \"virtually perfect ending to an outstanding series\". Writing for the Los Angeles Times, Charles Solomon ranked Brotherhood the second-best anime of 2010 on his \"Top 10\".\r\nSpin-off film\r\nFollowing the final episode of Brotherhood, a new film was announced. A teaser trailer began streaming in November 2010 on the Fullmetal Alchemist: Brotherhood official site, confirming that a movie entitled Fullmetal Alchemist: The Sacred Star of Milos would open throughout Japan in July 2011. It was directed by Kazuya Murata and scripted by Yūichi Shinpo. The film follows the Elrics' attempts to capture a criminal in another country. Funimation licensed the film and released it in selected theaters in the United States in January 2012, and on DVD and Blu-ray on April 24, 2012.",
    "html": "<p>Fullmetal Alchemist: Brotherhood (Japanese: 鋼の錬金術師 FULLMETAL ALCHEMIST, Hepburn: Hagane no Renkinjutsushi) is a Japanese anime television series adapted from the original Fullmetal Alchemist manga series by Hiromu Arakawa. Produced by Bones, the series is directed by Yasuhiro Irie, written by Hiroshi Ōnogi and composed by Akira Senju. The series was conceived in order to create a faithful adaptation that directly follows the entire storyline of the original manga, after 2003's Fullmetal Alchemist anime series strayed away from it to tell its own story after running out of published manga material to adapt.</p><p>Production for Fullmetal Alchemist: Brotherhood began in 2008. The series was broadcast for sixty-four episodes on MBS–TBS from April 2009 to July 2010. The series was first licensed in North America by Funimation and was broadcast English-dubbed on Adult Swim from February 2010 to September 2011. In 2016, Funimation lost the rights to the series and it was transferred to Aniplex of America.</p><p>Fullmetal Alchemist: Brotherhood earned acclaim from critics and audiences, and is considered to be one of the best anime series of all time. Reviewers noted its faithfulness to the manga and its introduction of characters and plot details that were not present in the 2003 anime; the climactic episodes were also lauded for both its action scenes and moral messages.</p><br/><h3>Plot</h3><p>Brothers Edward and Alphonse Elric are raised by their mother Trisha Elric in the remote village of Resembool in the country of Amestris. Their father Hohenheim, a noted and very gifted alchemist, abandoned his family while the boys were still young, and while in Trisha's care they began to show an affinity for alchemy and became curious about its secrets. However, when Trisha died of a lingering illness, they were cared for by their best friend Winry Rockbell and her grandmother Pinako. The boys traveled the world to advance their alchemic training under Izumi Curtis. Upon returning home, the two decide to try to bring their mother back to life with alchemy. However, human transmutation is a taboo, as it is impossible to do so properly. In the failed transmutation, Al's body is completely obliterated, and Ed loses his left leg. In a last attempt to keep his brother alive, Ed sacrifices his right arm to bring Al's soul back and binds it to a nearby suit of armor. After Edward receives automail prosthetics from Winry and Pinako, the brothers decide to burn their childhood home down, symbolizing their determination and decision of \"no turning back,\" and head to the capital city to become government-sanctioned State Alchemists. After passing the exam, Edward is dubbed the \"Fullmetal Alchemist\" by the State Military, and the brothers begin their quest to regain their full bodies back through the fabled Philosopher's Stone under the direction of Colonel Roy Mustang. Along the way, they discover a deep government conspiracy to hide the true nature of the Philosopher's Stone that involves the homunculi, the alchemists of the neighboring nation of Xing, the scarred man from the war-torn nation of Ishval, and their own father's past.</p><br/><h3>Voice cast</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Character</th><th>Japanese voice</th><th>English voice</th></tr><tr><td><span>Edward Elric</span></td><td><span>Romi Park</span></td><td><span>Vic Mignogna</span></td></tr><tr><td><span>Alphonse Elric</span></td><td><span>Rie Kugimiya</span></td><td><span>Maxey Whitehead</span></td></tr><tr><td><span>Roy Mustang</span></td><td><span>Shin-ichiro Miki</span></td><td><span>Travis Willingham</span></td></tr><tr><td><span>Winry Rockbell</span></td><td><span>Megumi Takamoto</span></td><td><span>Caitlin Glass</span></td></tr><tr><td><span class=\"mw-redirect\">Maes Hughes</span></td><td><span>Keiji Fujiwara</span></td><td><span>Sonny Strait</span></td></tr><tr><td><span class=\"mw-redirect\">Riza Hawkeye</span></td><td><span>Fumiko Orikasa</span></td><td><span>Colleen Clinkenbeard</span></td></tr><tr><td><span>Scar</span></td><td><span>Kenta Miyake</span></td><td><span>J. Michael Tatum</span></td></tr><tr><td><span class=\"mw-redirect\">Ling Yao</span></td><td><span>Mamoru Miyano</span></td><td><span>Todd Haberkorn</span></td></tr><tr><td><span class=\"mw-redirect\">Lan Fan</span></td><td><span>Nana Mizuki</span></td><td><span>Trina Nishimura</span></td></tr><tr><td><span>May Chang</span></td><td><span>Mai Goto</span></td><td><span>Monica Rial</span></td></tr><tr><td><span>King Bradley/Wrath</span></td><td><span>Hidekatsu Shibata</span></td><td>Ed Blaylock</td></tr><tr><td><span>Lust</span></td><td><span>Kikuko Inoue</span></td><td><span class=\"mw-redirect\">Laura Bailey</span></td></tr><tr><td><span>Envy</span></td><td><span>Minami Takayama</span></td><td><span>Wendy Powell</span></td></tr><tr><td><span>Greed</span></td><td><span>Yuichi Nakamura</span></td><td><span>Chris Patton</span> (first)<br><span>Troy Baker</span> (second)</td></tr></tbody></table><br/><h3>Production</h3><p>In the 20th volume of the Fullmetal Alchemist manga, released in August 2008, series author Hiromu Arakawa announced that a second anime adaptation was being produced; the previous series, Fullmetal Alchemist, had debuted in 2003 and featured an anime original story direction midway through its run. The Japanese title of the second adaptation is Hagane no Renkinjutsushi: Fullmetal Alchemist (鋼の錬金術師 FULLMETAL ALCHEMIST, abbreviated as 鋼の錬金術師FA), including the English translation as a subtitle to differentiate it from the 2003 series, while the English release uses the subtitle Brotherhood.</p><p>Bones produced Brotherhood with Yasuhiro Irie as director, Hiroshi Ōnogi as writer, and Akira Senju as composer. Voice actresses Romi Park and Rie Kugimiya reprised their roles as Edward and Alphonse Elric, respectively. Unlike the first anime, the second anime faithfully follows the complete story of the manga. Irie faced the difficulties of making the series as appealing as possible. Due to his large popularity within the fanbase, Irie had to properly focus on the character of Roy Mustang. When the manga was nearing its completion in May 2010, Irie announced that the Bones staff was already working on the final episodes adapting the ending and expressed shock at the series' conclusion.</p><p>Brotherhood's music composer is Akira Senju. The first CD soundtrack from this anime was published on October 14, 2009. The second CD soundtrack from the anime was published on March 24, 2010. The third CD soundtrack became available on July 7, 2010. Fullmetal Alchemist Final Best, a compilation of opening and ending songs, was released on July 28, 2010. On June 29, 2011, the original soundtrack of Fullmetal Alchemist: The Sacred Star of Milos(FULLMETAL ALCHEMIST Nageki no Oka no Seinaru Hoshi), composed by Taro Iwashiro, was released.</p><p>The respective opening and ending themes for the first 14 episodes are \"Again\" by Yui and \"Uso\" (嘘, lit. \"Lie\") by Sid. From episode 15–26, the respective opening and ending themes are \"Hologram\" by Nico Touches the Walls and \"Let It Out\" by Miho Fukuhara. From episode 27–38, the respective opening and ending themes are \"Golden Time Lover\" by Sukima Switch and \"Tsunaida Te\" (つないだ手, lit. \"Tied Hands\") by Lil'B. From episode 39–50, the respective opening and ending themes are \"Period\" by Chemistry and \"Shunkan Sentimental\" (瞬間センチメンタル, Shunkan Senchimentaru, lit. \"Sentimental Moment\") by Scandal. From episodes 51–62, the respective opening and ending themes are \"Rain\" (レイン, Rein) by Sid and \"Ray of Light\" by Shoko Nakagawa. While episodes 63 and 64 do not use opening themes, they use \"Rain\" and \"Hologram\", respectively, for the endings.</p><br/><h3>Release</h3><p>In March 2009, it was announced that the official English title of the series was Fullmetal Alchemist: Brotherhood, and that it would receive its English-language premiere on Animax Asia, with Japanese audio and English subtitles, at 8:30 p.m. on April 10, 2009. On April 3, 2009, Funimation announced it would stream English-subtitled episodes four days after they aired in Japan. Madman Entertainment would also stream it \"within days\" of the episodes airing in Japan. The series premiered in Japan on April 5, 2009, on MBS–TBS's Sunday 5:00 pm JST anime block.</p><p>In May 2009, Funimation suspended the release of new episodes for a few weeks because of an incident in which an episode of One Piece was uploaded before it had aired in Japan. However, the episodes were later made available on the Funimation website and on the official Funimation channel on YouTube.</p><p>In August 2009, Aniplex started releasing the series on Blu-ray and DVD; the first release included two episodes and an OVA. Two more OVAs were included in the fifth and ninth volumes alongside four episodes. Other volumes feature four episodes and no OVAs. Sixteen volumes were released, the last one in November 2010. In September 2009, Funimation announced the cast for an English dub of the series, which featured much of the cast for the 2003 series dub reprising their roles. On February 14, 2010, the English dub of the series premiered on Adult Swim; its run ended on September 25, 2011. Funimation began releasing the episodes on Blu-ray and DVD in May 2010; each release contained thirteen episodes. Five volumes were released, the last one in August 2011. In the United Kingdom, Manga Entertainment released the series in five DVD and Blu-ray volumes during 2010 and 2011, and later in a two-part box set.</p><p>Funimation lost the rights to the series in March 2016. In July 2016, it was announced that the series was transferred to Aniplex of America and it would be streamed on Crunchyroll. Netflix released the series on their streaming platform in the United States and Canada in January 2018. Aniplex of America released the series on two Blu-ray Disc box sets in November 2018. In November 2019, Funimation re-licensed the series for its streaming service. Madman Entertainment distributed the series in Australia; it was broadcast in Canada on Super Channel; and in the Philippines on TV5's AniMEGA anime programming block.</p><br/><h3>Reception</h3><p>On review aggregator site Rotten Tomatoes, Fullmetal Alchemist: Brotherhood holds an approval rating of 100%, with an average rating of 8/10. The site's critic consensus reads: \"With impeccable world-building, rollicking action, and emotionally intelligent themes, all the elements come together to make this Fullmetal Alchemist reboot a pristine distillation of the shounen genre.\" The series is considered to be one of the best anime of all time, and has earned acclaim from several reviewers and publications.</p><p>D. F. Smith, writing for IGN, noted the short time-span between the releases of the 2003 series and Brotherhood, which he deemed peerless among other anime. Smith judged the pace of the first 14 episodes to be quicker than their original-series counterparts, which he interpreted as the series presuming the viewer is already familiar with the characters. Smith also observed that while this approach enables reaching the more \"exciting\" story elements faster, it does exclude enjoyable moments with supporting characters, such as Winry and Major Hughes, found in the first adaptation.</p><p>The first fourteen episodes of Brotherhood initially were criticized by members of the Anime News Network staff, who said that repeating events from the first anime led to a lack of suspense. Mania Entertainment's Chris Beveridge said that the entertainment in these episodes lay in the differences in the characters' actions from the first series, and original content which focused on the emotional theme of the series. Beveridge praised the new fight scenes and the extra drama, which made these episodes \"solid\", while Smith found the action scenes unexpectedly \"compact\".</p><p>Megan Gudeman of CBR called relationships in the anime \"dynamic and memorable\". Chris Zimmerman from Comic Book Bin said the series \"turns around and establishes its own identity\" because of the inclusion of new characters and revelations not shown in the first series, increasing its depth. He said the animation was superior to that of the first anime; his comments focused on the characters' expressions and the execution of the fight scenes. Much praise was given to the climactic episodes for the way the action scenes and morals were conveyed; many reviewers found them superior to the conclusion of the first Fullmetal Alchemist anime.</p><p>Critics found the conclusion satisfying; Mark Thomas of The Fandom Post called it a \"virtually perfect ending to an outstanding series\". Writing for the Los Angeles Times, Charles Solomon ranked Brotherhood the second-best anime of 2010 on his \"Top 10\".</p><br/><h3>Spin-off film</h3><p>Following the final episode of Brotherhood, a new film was announced. A teaser trailer began streaming in November 2010 on the Fullmetal Alchemist: Brotherhood official site, confirming that a movie entitled Fullmetal Alchemist: The Sacred Star of Milos would open throughout Japan in July 2011. It was directed by Kazuya Murata and scripted by Yūichi Shinpo. The film follows the Elrics' attempts to capture a criminal in another country. Funimation licensed the film and released it in selected theaters in the United States in January 2012, and on DVD and Blu-ray on April 24, 2012.</p><br/>"
  },
  "errorMessage": ""
}