{
  "imDbId": "tt8289930",
  "title": "Formula 1: Drive to Survive",
  "fullTitle": "Formula 1: Drive to Survive (TV Series 2019– )",
  "type": "TVSeries",
  "year": "2019",
  "items": [
    {
      "username": "ThaliaDavies",
      "userUrl": "https://www.imdb.com/user/ur25494795",
      "reviewLink": "https://www.imdb.com/review/rw4717189",
      "warningSpoilers": false,
      "date": "11 March 2019",
      "rate": "9",
      "helpful": "95 out of 107 found this helpful.",
      "title": "Binge Worthy",
      "content": "As a female who has never even held a drivers licence I doubt greatly that I am the F1's target market but for the 2019 that's going to change. This doco series puts a personality into the sport that I often just assumed was bland & full of thugs. Utterly fascinating, it also does (in my opinion) an excellent job of explaining the rivalries between the different company factions. Really hope there will be a season 2."
    },
    {
      "username": "sam-baig73",
      "userUrl": "https://www.imdb.com/user/ur32063246",
      "reviewLink": "https://www.imdb.com/review/rw4742554",
      "warningSpoilers": false,
      "date": "25 March 2019",
      "rate": "10",
      "helpful": "172 out of 184 found this helpful.",
      "title": "Made me a Formula 1 Fan",
      "content": "I had never watched an F1 race before. Had no clue of the rules and points based system. Now I feel like I'm the biggest Formula 1 fan. Amazing cinematography. Best racing documentary ever made out there."
    },
    {
      "username": "Jihad300",
      "userUrl": "https://www.imdb.com/user/ur18957044",
      "reviewLink": "https://www.imdb.com/review/rw4708642",
      "warningSpoilers": false,
      "date": "8 March 2019",
      "rate": "",
      "helpful": "155 out of 164 found this helpful.",
      "title": "This is returning F1 to me",
      "content": "Have watched every single Formula 1 race since mid-1991, I think. Went to several races (when they were louder, V12/V10 era, rather going to Le Mans with the current cars for live action). Every year after Häkkinen quit it got harder for me to justify why I even bother.4 episodes in right now - this series has a chance to change that!!I was sometimes wondering how much good a media company's ownership of F1 could do for a sport when they were helplessly talking \"Twitter\", but now I sense there might be potential.When all you get from F1 is corporate PR, little go kart boys being streamlined for TV spots, DRS and catering, here is a bit of actual behind-the-scenes of F1. Sure, this is sanitized too, but it is so much more honest than the usual, it is such a breather.Please F1, be even braver with season 2019! Hope Ferrari and Mercedes join the party with season 2019 (they opted out of this so far): Merc, if McLaren can get the sticks out of their behinds, you can too!This series has the potential to become an annual tradition to kick off pre-season ... and remember why you became a fan in the first place."
    },
    {
      "username": "Broccolidwarf",
      "userUrl": "https://www.imdb.com/user/ur24232661",
      "reviewLink": "https://www.imdb.com/review/rw4707687",
      "warningSpoilers": false,
      "date": "8 March 2019",
      "rate": "9",
      "helpful": "55 out of 65 found this helpful.",
      "title": "Very good production indeed",
      "content": "Captures all the stuff just outside the headlines of the sport, and goes behind the scenes better than anyone before.Especially interesting to get close to many of the \"smaller\" drivers, as most of us already know all there is to know about Hamilton, Vettel, etc.If you like the NFL Network Gameday productions, you will like this as well - provided you like racing ofcourse :)I'm a fan, after binge watching the first season."
    },
    {
      "username": "gallardocana",
      "userUrl": "https://www.imdb.com/user/ur74883172",
      "reviewLink": "https://www.imdb.com/review/rw7947048",
      "warningSpoilers": false,
      "date": "12 March 2022",
      "rate": "5",
      "helpful": "43 out of 47 found this helpful.",
      "title": "So disappointed on season 4",
      "content": "I can't believe they managed to make something so boring out of the most amazing F1 season. I've been waiting for the premiere for months and I can't believe this. Checo Pérez has 30 seconds on the season and Tsunoda has a whole chapter. WTF seriously... no disrespect but who cares about Tsunoda? I can't believe this."
    },
    {
      "username": "SoumikBanerjee1996",
      "userUrl": "https://www.imdb.com/user/ur46919419",
      "reviewLink": "https://www.imdb.com/review/rw7390957",
      "warningSpoilers": false,
      "date": "29 September 2021",
      "rate": "8",
      "helpful": "16 out of 18 found this helpful.",
      "title": "Nothing Truly Exceptional, But It Made Me a Fan of the Sport for sure.",
      "content": "Netflix's 'Drive to Survive' may not be respected as anything remarkable per se, yet I firmly believe this should be acknowledged as an incredibly helpful entryway for all the novices as well as the devoted supporters of the sport.As a newbie myself, I can vouch for its capability to make sure you get well familiarized with the rules and regulations. Aside from its high octane moments; you also get a slew of fascinating insights in regards to all the major teams and their set of drivers. Although the specific pattern, in which they tend to illustrate those stuff gets a little bit predictable and repetitious; but they do just enough to uphold a certain degree of urgency and suspense.Now, there were serious allegations regarding the usage of fabrication on multiple occasions.I don't know why Netflix has done such a shady business here. I mean, they already got exclusive access to Formula 1, spent millions for the rights to portray all those behind the scene incidents but instead, they resorted to performing some phony stints. Was it necessary? I don't think so."
    },
    {
      "username": "philsanday",
      "userUrl": "https://www.imdb.com/user/ur62572977",
      "reviewLink": "https://www.imdb.com/review/rw7947191",
      "warningSpoilers": false,
      "date": "13 March 2022",
      "rate": "5",
      "helpful": "38 out of 42 found this helpful.",
      "title": "3 brilliant seasons and then this?",
      "content": "The most dramatic season in F1 in years and Netflix screwed it up (somewhat). The false commentary throughout annoyed me then just pissed me off! False razzmatazz of what qualifying day is about was just nonsense. There was signs of the original insight you got from the first three brilliant seasons but this just became more and more of a promotional series for the FIA. Some episodes to the same high standards, others just staged and orchestrated.Lando Norris has even complained on Twitter that the editing has painted incorrect pictures of him and Ricciardo by adding remarks made from one race into another to hype it up. That's just poor."
    },
    {
      "username": "lima07",
      "userUrl": "https://www.imdb.com/user/ur21355716",
      "reviewLink": "https://www.imdb.com/review/rw7968736",
      "warningSpoilers": false,
      "date": "15 March 2022",
      "rate": "4",
      "helpful": "40 out of 43 found this helpful.",
      "title": "Not for F1 fans",
      "content": "This series has made a great job of drawing new fans to Formula 1. However it is a really inaccurate depiction and frustrating experience to watch for anyone who follows the sport seriously. Radio messages that are spliced and often completely taken out of context, narratives that are completely fabricated, focus on things that are completely irrelevant to the season. There are just so many flaws that even giving it four stars feels generous."
    },
    {
      "username": "SeriousMayhem",
      "userUrl": "https://www.imdb.com/user/ur27886138",
      "reviewLink": "https://www.imdb.com/review/rw7960200",
      "warningSpoilers": false,
      "date": "14 March 2022",
      "rate": "1",
      "helpful": "53 out of 68 found this helpful.",
      "title": "Fake and insincere reality show that's not about racing",
      "content": "What is this, a soap opera? This series is riddled with fake rivalry, manipulated video, manipulated audio, fake and manipulated everything, just to drag in some viewers. And if that's not enough, it does all that while missing the real tension, the real action and everything else that makes F1 great.What a disgrace. Perhaps you should hire Michael Bay to direct season 5."
    },
    {
      "username": "boltombo",
      "userUrl": "https://www.imdb.com/user/ur150580799",
      "reviewLink": "https://www.imdb.com/review/rw7947214",
      "warningSpoilers": false,
      "date": "13 March 2022",
      "rate": "4",
      "helpful": "31 out of 34 found this helpful.",
      "title": "Sheeew, boom, swoooosh, braaaam, bang, swish, wooooooooong......",
      "content": "Best to keep this short - as nothing in this series lasts longer than 15 seconds.When the first season of D2S came out, I was excited - not only because a series like this hasn't existed before, considering the production standards, the crisp close ups to the racing that is just fascinating for various reasons, the incomparable representation of the dynamics of this sport and also because of some portraits that have gone beyond what we've seen so far - I had a lose interest in Formula 1.Now, we've arrived in season 4, and for some reason I'm getting utterly bored. Actually, not for some reason, but for many reasons. The style of this series hasn't evolved a single bit - and the more you watch it, the more you realize it. Sometimes, it feels like an episode is a 40min trailer of itself. All cannons constantly fire full blast. The music is a blend of booms, bangs, heavy hitting beats and super epic trailer music - the sound world doesn't know anything else but swish, mechanical clanks, more booms, glitching engine sounds and other elements that quite often overpower the voice lines - the editor clearly only knows little about racing, as every racing situation is dumbed down to clusters of a typical Red Bull Mediahouse production - and I don't mean that in a good way. Because Red Bull doesn't understand true emotion - only thrill. And that's what Drive to Survive is: a constant thrill ride that speeds by your brain cells, leaving not much else but \"woooooooow, sh** man, that's intense\".Someone once described it as the \"Transformers Effect\" - once something reaches a certain magnitude (meta level) and never really dives into the fundament (macro level), at some point, the viewer will stop caring, because of over-saturation.The 2021 season of Formula 1 was a highly controversial, breathtaking, revealing and also promising one. There was so much drama, intrigues, backgrounds, politics and exciting racing - and, if someone understood this material as a whole, it could have been stitched together and presented so wonderfully. But no, what we get is what we already know, induced like a replay of previous seasons, screaming loudly like a male gorilla pounding his chest, yet failing to deliver any deeper and connecting impression along the way.It really hurts when the 5min official F1 YouTube video about Ricciardo's Monza win is more exciting and emotional than the half hour D2S episode of the same weekend."
    },
    {
      "username": "Lucas_Vindfeld",
      "userUrl": "https://www.imdb.com/user/ur74725800",
      "reviewLink": "https://www.imdb.com/review/rw7959700",
      "warningSpoilers": false,
      "date": "14 March 2022",
      "rate": "1",
      "helpful": "32 out of 33 found this helpful.",
      "title": "Fake and manipulating",
      "content": "Netflix makes up a lot of things and are biased. Go watch 2021 season and then DTS, then YOU will feel robbed from reality.Examples: They depicts mazepins sochi result as a great achievement. He finished ahead of his teammate and latifi. They both DNF'ed.... and he finshed 18th...They picture Hamilton as a clean racer and a victim of Max's driving style. But Hamilton is just as ruthless as Max. You cant be a 7x champion and be inocent little puppy....DTS is ridiculous and far from the reality."
    },
    {
      "username": "trickstermd",
      "userUrl": "https://www.imdb.com/user/ur150957838",
      "reviewLink": "https://www.imdb.com/review/rw7960854",
      "warningSpoilers": false,
      "date": "14 March 2022",
      "rate": "3",
      "helpful": "25 out of 26 found this helpful.",
      "title": "Really biased show",
      "content": "Season 4 acts as a podcast for the british establishment. Will Buxton loses all credibility.Awful protagonism for Lando Norris, George Rusell, Lewis Hamilton, Valtteri Bottas and Daniel RicciardoYou only hear Mercedes side of the Story.Season 2021 had so much potential for an excelent season, im really dissapointed.Definitely not watching season 5."
    },
    {
      "username": "Xaobotnik",
      "userUrl": "https://www.imdb.com/user/ur15373398",
      "reviewLink": "https://www.imdb.com/review/rw7938810",
      "warningSpoilers": false,
      "date": "11 March 2022",
      "rate": "3",
      "helpful": "25 out of 26 found this helpful.",
      "title": "Fine PR tool, but understand that it does NOT teach you about F1; over-dramatization is fine I guess, but completely made up stories and facts are not",
      "content": "Basically, if you don't know a lot about F1 and then watch this show, in the end you'll know less, because the gained knowledge is based on stories that were heavily manipulated for dramatic purposes or completely made up.The hardly tell you about the tech or the organizations behind F1 and the part they do tell you about is incorrect or again, completely made up.They also misplace interviews. So you'll see an interview or a specific talk a driver or team principle held, which was about a specific situation or race, and because of how Netflix placed it, it seems like it was about something different.This is also the reason why several people have stopped cooperating with the crew Max Verstappen among them.Drive to Survive generated a lot of new fans, so as a PR-tool it works I guess. But you can always point the people who came in through watching this show since they really don't understand the sport. I always hoped that they would learn while watching the sport, but the way broadcasting is planned nowadays, it's perfectly possible to simply ignore the news around all developments in terms of tech and organization and simply believe DTS als the real story around F1."
    },
    {
      "username": "atoufexis",
      "userUrl": "https://www.imdb.com/user/ur33809650",
      "reviewLink": "https://www.imdb.com/review/rw4714099",
      "warningSpoilers": false,
      "date": "10 March 2019",
      "rate": "10",
      "helpful": "196 out of 206 found this helpful.",
      "title": "Not a f1 fan but loved this show!",
      "content": "I've never watched an f1 race and know nothing about the drivers or sport other than its for the rich and famous. I was so surprised at how much I REALLY liked this series. Getting to know the drivers, cars, dirty details, everything. It is so well done. Dont think ill be watching any f1 races in 2019 but will be expectantly waiting for season 2!"
    },
    {
      "username": "L0rd_Aryan",
      "userUrl": "https://www.imdb.com/user/ur7096043",
      "reviewLink": "https://www.imdb.com/review/rw7961511",
      "warningSpoilers": false,
      "date": "14 March 2022",
      "rate": "1",
      "helpful": "31 out of 36 found this helpful.",
      "title": "Clueless & biased.",
      "content": "Clueless & biased.F1's youtube channel has far better coverage than this sorry excuse of a show.What is supposed to be a clusterf... caused by FIA's decisions all through the 2021 season was portrayed in this doc painting Redbull as the villains. I mean even Toto Wolff embraced being the real villain when he appeared in he final scene wearing black turtleneck & everything."
    },
    {
      "username": "armandox",
      "userUrl": "https://www.imdb.com/user/ur11904160",
      "reviewLink": "https://www.imdb.com/review/rw4714685",
      "warningSpoilers": false,
      "date": "10 March 2019",
      "rate": "10",
      "helpful": "48 out of 58 found this helpful.",
      "title": "Perfect precursor to the 2019 F1 season",
      "content": "In the day and age of social media everybody is a 'backseat driver' and wannabe critic, wether positive or negative. So I'm not going to say much in-depth about this mini-documentary.I loved the editing, use of material and insight not normally given into F1. Anyone who likes F1 to a certain extend and is geared up towards the 2019 season will most likely enjoy this as a primer. Anyone who isn't into F1 yet, but has a slight interest should get a good grasp of all the politics, mindgames et al that go on behind the scenes aswell.Liberty Media and Netflix, please do this every year and never mind the critics!10/10 well deserved from me"
    },
    {
      "username": "Zedyeti",
      "userUrl": "https://www.imdb.com/user/ur78542739",
      "reviewLink": "https://www.imdb.com/review/rw6878396",
      "warningSpoilers": false,
      "date": "4 May 2021",
      "rate": "",
      "helpful": "21 out of 28 found this helpful.",
      "title": "I watch f1 races now because of this show haha",
      "content": "I have never really cared for racing other than video games and being American most friends of mine that do like racing are nascar fans. Left turn driving only is boring but I randomly started this show on Netflix and I ended up binging it. It even made me look up f1 schedule on tv and since the first season I watch most races or at least record them. Well done show to see the back story of what's going on in the f1 world."
    },
    {
      "username": "max-moore7",
      "userUrl": "https://www.imdb.com/user/ur33072337",
      "reviewLink": "https://www.imdb.com/review/rw7944145",
      "warningSpoilers": true,
      "date": "12 March 2022",
      "rate": "2",
      "helpful": "33 out of 36 found this helpful.",
      "title": "Ridiculous comedy show",
      "content": "You can only rate this show high if you don't have watched F1 before or the GP's of the season or have no Idea about F1 at all.No wonder Verstappen don't wanna be part of it. This show just telling so much lies it's unbelievable.When you remember the GP's you can just shake your head when you see what Netflix is making out of it. Best example in Season 4 Episode 4 where they make Mazepin appear like a hero cause he decided to pit early in Russian GP and showing him with dramatic music overtaking some cars in rain.For people who didn't watched this race or have no memories it will look like he made a bold move and was driving good.In Fact: He was unlapped already by everyone and had NOTHING to lose or to win. So he decided to box for rain tires before everyone else and was able to overtake some cars who overlapped him already. He finished last place. Netflix didn't mentioned anything of that. When you just watch the show you think he ended up at place 12 or sth🤣🤣Another ridiculous disappointment is that this show has just 10 Episodes in one of the most intense and exciting seasons ever but wasting 2!! Episodes for pre season testing and first GP of the year!? And another full episode as mentioned for the worst team of the year!No matter who the manager of this show is needs to get fired!"
    },
    {
      "username": "jigota",
      "userUrl": "https://www.imdb.com/user/ur151002951",
      "reviewLink": "https://www.imdb.com/review/rw7964187",
      "warningSpoilers": true,
      "date": "14 March 2022",
      "rate": "1",
      "helpful": "21 out of 21 found this helpful.",
      "title": "S1-3 was great. S4 was biased, and out of context.",
      "content": "To begin with, season 1-3 was absolutely amazing.But Season 4 is bad. Very bad. There is no \"real\" chronological order that's easy to follow.Jumping back and forth between the same races multiple times. Like Bahrain, and Monaco.Seeing Leclerc's gearbox fail in 3 episodes gets boring really fast. Etc, etc.Not to mention the bias against RedBull. I myself is a huge Mercedes fan. But the bias never ends and it gets annoying tbh. Seeing the interviews with Christian Horner, Susie & Toto Wolff every 5 minutes is just frustrating.DTS should have kept the same format as Season 1-3. Following 1 team for 2 races per episode."
    },
    {
      "username": "aphelekes",
      "userUrl": "https://www.imdb.com/user/ur134695638",
      "reviewLink": "https://www.imdb.com/review/rw7961817",
      "warningSpoilers": false,
      "date": "14 March 2022",
      "rate": "2",
      "helpful": "26 out of 30 found this helpful.",
      "title": "Season 4 is poor and biased",
      "content": "Well everyone knows that Max verstappen didn't want to do his interviews in DTS because he thinks that they fake a lot of drama and create false rivalries.As a response it seems that drive to survive are portraying max as the biggest bully/villain on earth in season 4 and everything he does is bad prime examples are episode 3 and 9 and the only exemption in which max seems like a decent human being is episode 10. On the other hand they show lewis and Mercedes as heroes without criticizing any actions of them because they \"win on track\" and never do anything bad. Finally the same bias they have against Max they seem to have against the whole red bull team."
    },
    {
      "username": "jameslear-07673",
      "userUrl": "https://www.imdb.com/user/ur107494606",
      "reviewLink": "https://www.imdb.com/review/rw7953194",
      "warningSpoilers": false,
      "date": "13 March 2022",
      "rate": "3",
      "helpful": "8 out of 8 found this helpful.",
      "title": "How can they miss so much real tension and substitute made up drama",
      "content": "Nothing but fluff, barely any racing shown, radio messages clipped out of context for drama.Missed almost all all real drama, showed hardly any of Perez defensive driving, glossed over Alonso defending against Hamilton. Didn't show any of Lando defending against Hamilton. Didn't show basically any of Vettel despite the P2 finish in Hungary.Onboard Camera is only shown for 2-3 seconds at most, and then it darts between different drivers on different laps.F1 is the pinnacle of motor sport, and you think I care about some manufactured tension between Tsonuda and Ocon at France about who is going to finish P13 (out of the points).I don't care about any of that. There are so many tense moments in racing, but \"Drive to survive\" focuses on fake rivalries in the paddock while ignoring THE ACTUAL RACING.Who is producing this? The fact they don't include any of the real tension and just inject their own soundbites to manufacture drama shows they don't understand what makes F1 exciting."
    },
    {
      "username": "parsonsmiguel",
      "userUrl": "https://www.imdb.com/user/ur57193470",
      "reviewLink": "https://www.imdb.com/review/rw7944128",
      "warningSpoilers": false,
      "date": "12 March 2022",
      "rate": "2",
      "helpful": "29 out of 29 found this helpful.",
      "title": "Get rid of the post production commentary",
      "content": "As a lifelong F1 fan, the post production commentary is killing this show... Creating fake battles, debates, rivalries loses all grip on reality that this show could, AND SHOULD, have! Some of the sounds effects are just simply wrong, not even using the correct era of cars (sometimes even using V8 era sounds on onboard footage), and even worse due to COVID and everyone using masks, creating dialogues between team bosses or drives, that never actually happened!DTS has footage and access to create AMAZING content, but they decided to create their own storyline... No wonder Max Verstappen doesn't want to be part of this show after season 1, and if they keep this up, I wonder how many other drivers will do the same!"
    },
    {
      "username": "athanasia-84345",
      "userUrl": "https://www.imdb.com/user/ur150674645",
      "reviewLink": "https://www.imdb.com/review/rw7943386",
      "warningSpoilers": false,
      "date": "12 March 2022",
      "rate": "1",
      "helpful": "41 out of 44 found this helpful.",
      "title": "Just horrible..",
      "content": "Really Awful... this is F1 to you? The entire documentary it was about gossips and eye for an eye. Last year we watched the best Championship ever and yet the creators of this awful thing chose to make a show who reminds \"Big Brother\" (Remind you that the world champion of 2021 Max Verstappen refused to speak as well -after he watched season 1-) Doesn't deal with the racing part almost at all. Definitely it has choosed side and this is something really frustrating and unacceptable. And... omg 😲... where are the rest of the drivers of the grid???? At least 10 of 20 drivers are missing! World champions like Fernando Alonso!Again... Awful 😖 If I could give 0 points I would!"
    },
    {
      "username": "Isfahaninejad",
      "userUrl": "https://www.imdb.com/user/ur86966771",
      "reviewLink": "https://www.imdb.com/review/rw8030511",
      "warningSpoilers": false,
      "date": "3 April 2022",
      "rate": "3",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Got me into the sport only for me to realize how fake and poorly done it actually is",
      "content": "Title pretty much says it all. I'm glad that this show is bringing more attention to Formula 1 but I am at a complete loss as to why the producers feel the need to fake everything. Fake drama, fake engine noises, fake rivalries, clips from different incidents cut get together, etc. Etc. F1 is dramatic enough on its own. It doesn't need any of that BS."
    },
    {
      "username": "manuel_medeiros",
      "userUrl": "https://www.imdb.com/user/ur50417130",
      "reviewLink": "https://www.imdb.com/review/rw5622878",
      "warningSpoilers": false,
      "date": "9 April 2020",
      "rate": "9",
      "helpful": "17 out of 23 found this helpful.",
      "title": "Brilliant series, especially for non F1 fans",
      "content": "I went into this show with some degree of scepticism because I was told that nor Ferrar nor Mercedes would be featured in season 1. For the less knowledgeable, this sounded too me as doing a series about La Liga without Barcelona and Real Madrid. I couldn't be more wrong.There is a vast amount of interesting narratives, stories, relationships and rivalries outside the two contenders. Enough to make me sit through season 1 in 3 days.I believe this show makes for a very entertaining watch for any (even remote) sports fans, because it has many unexpected turns, emotionally draining episodes and plenty of feel good stories. You do get emotionally attached to a few drivers, and find yourself rooting for or against them on any given episode.In my view, this show aims to get people excited about F1, much more so than entertain those who already die hard fans already. Namely because:1) Die hard fans know the outcomes of the races going in (the show reflects on the previous season, it's not live) and therefore there's less surprise or emotion. For me it was an absolute thrill to see the end of some of those grand prixs2) the show is not focus on the technical side of racing. It spends much more time on the relationships, the rivalries, the thrifts - overall the human side of the sport. Which is what makes it so engagingIt definitely made me hungrier to watch the 2020 season (whenever it can be underway) and has nurtured a bond that makes me cheer for some drivers and boo the others F1: Drive to Survive is an absolute genius move by Liberty Media, F1 and Netflix to market Formula 1 to new audiences. I think they have nailed that objective completely.As far as converting audiences to a particular sport - I have seen nothing better. F1 Drive to Survive is an emotional and thrilling ride in one of the most challenging sports in the world. And it's truly worth it"
    }
  ],
  "errorMessage": ""
}