{
  "imDbId": "tt0436992",
  "title": "Doctor Who",
  "fullTitle": "Doctor Who (TV Series 2005– )",
  "type": "TVSeries",
  "year": "2005",
  "items": [
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw3344262",
      "warningSpoilers": false,
      "date": "27 October 2015",
      "rate": "10",
      "helpful": "137 out of 192 found this helpful.",
      "title": "Time passes by so quickly.",
      "content": "I cannot believe it's been back on our screens for ten years, it seems like only yesterday the show returned with Rose.What I've loved so much about interacting with people on IMDb is that no series seems to split opinion more then Doctor Who, fundamentally we all love it, it's why we tune in each week to see what's on offer.We've experienced highs and lows and will no doubt continue along the same vein for many years to come.Each Doctor has offered something, some perhaps more then others. Same for its producers, there are people that have loved and loathed both Moffat and Davies, both have given us some excellent and not so excellent episodes.The format and premise of the show remains its key strength, he can literally go anywhere and do anything, most shows are faced with multiple constraints, that isn't the case here, the possibilities are endless.We've had episodes that are widely loved, some of my own favourites include Blink, Silence in the Library/Forest of the Dead and Vincent and the Doctor. Others have positively split opinion, Love and Monsters is a good idea, personally it's one I enjoy. I can appreciate an attempt at doing something different, it's a show that could become tiresome if it became to formulaic.I like the format of the two part serial, it allows a greater character development, sometimes with the single episode there's sometimes a feeling that some characters are a little shy of screen time.They have been guilty of using some of the Doctor's foes too often, the Daleks for example, they've popped up a few times too many, once they were the adversary I desperately wanted to see, not it's a feeling of indifference. Long may it continue!! I couldn't contemplate Christmas Day without my hour of Who, Baileys and Ferrero Rocher.Great big 10/10"
    },
    {
      "username": "jagaroth",
      "userUrl": "https://www.imdb.com/user/ur127828271",
      "reviewLink": "https://www.imdb.com/review/rw7262954",
      "warningSpoilers": false,
      "date": "23 August 2021",
      "rate": "9",
      "helpful": "163 out of 204 found this helpful.",
      "title": "The show ended in 2017",
      "content": "Seasons 1 through 10 are brilliant overall. Seasons 11 and 12 are so awful that they might as well be a different show altogether. From 2018 onwards, the vibes and tone are just plain wrong. Don't even bother watching any episodes post-2017."
    },
    {
      "username": "niktemadur",
      "userUrl": "https://www.imdb.com/user/ur1410690",
      "reviewLink": "https://www.imdb.com/review/rw2276152",
      "warningSpoilers": false,
      "date": "9 July 2010",
      "rate": "10",
      "helpful": "160 out of 221 found this helpful.",
      "title": "Blew the mind of an uninitiated, long time sci-fi lover",
      "content": "For as long as I can remember, I've heard about the good Doctor, references, inside jokes and the like. Such as \"Real Daleks don't climb stairs, they flatten the building\".The quandary was this: Where do I begin, with thousands of episodes aired? I was afraid of getting myself into something deep, dense, voluminous and possibly repetitive, impossible to get back out of.The very simple yet belated answer was, of course, by accident.On one of those sleepless nights, flipping channels, I saw astronauts in a Victorian library, and was immediately intrigued by the weird homage to Kubrick. Before the commercial break, I was treated to electronic ghosts and invisible floating piranhas.Then this absolute beauty comes up, I paraphrase - \"You've been living in a computer simulation, your physical body is elsewhere\" - \"But I've been dieting\"Bleak, subtle and sophisticated humor? Check, and count me in.As it turned out, I had stumbled into the middle of a Sy-Fy Channel short marathon of Doctor Who. I resisted going to sleep until the damn thing ended five or six episodes later, at ten in the morning.What wildly imaginative premises, what a high-quality level of writing, what a gem this is! There is serious brain-power at work here, courtesy of the BBC yet again, on a continuing heroic mission to sacrifice short-term profit for long-term legacy. As evidence, I present \"Monty Python's Flying Circus\", \"Tinker, Tailor, Soldier, Spy\", \"The Singing Detective\", \"Brideshead Revisited\".From what little I've seen in half of a short marathon, Doctor Who deserves a ten out of ten."
    },
    {
      "username": "softpineswhisperinthebreeze",
      "userUrl": "https://www.imdb.com/user/ur81539153",
      "reviewLink": "https://www.imdb.com/review/rw4744043",
      "warningSpoilers": true,
      "date": "25 March 2019",
      "rate": "",
      "helpful": "662 out of 797 found this helpful.",
      "title": "I thought nothing could kill Dr. Who...",
      "content": "I thought nothing could kill Dr. Who, but apparently I was wrong. Bad writing can, and did...First, let me say two things that writers/producers/directors seem not to understand:#1 - People do not watch television to have moral lessons shoved down their throats. They watch television to be entertained. Moral lessons are (typically) not entertaining.#2 - Never, ever trade good writing for special effects. You will always end up in the red. Nobody cares if there's a superbly-crafted monster shown on the screen if the plot doesn't make sense.Now, let me cover why (in addition to these two points), why this season went horribly, horribly wrong.First, let me say that it isn't a problem that Dr. Who is female. Or, rather, it didn't HAVE to be a problem. The writers (and wardrobe department) made it one by not dealing with that shift properly.1. WARDROBE Dr. Who is an absent-minded, eccentric genius. The suits that previous incarnations of Dr. Who would wear would give him an air of respectability while he was making a fool of himself on his way to ingeniously solving some complex problem. This incarnation of Dr. Who looks like she stole the clothing of a gender-fluid toddler. It doesn't give her any air of respectability, so she ends up looking ditzy, crazy, or ridiculous. The very obviously bleached hair doesn't help because it goes against Dr. Who's very long history of not caring much about appearances (and when Dr. Who has cared, the fashion choices were more geeky/dorky, not superficial).2. PREACH, PREACH, PREACH I watched years worth of Dr. Who and never - EVER - have there been so many moral lessons shoved in my face. Typically, there is a good balance of: (a) random adventures, (b) the occasional horror episode, (c) races that were interacted with in the past come to continue the story line, (d) an old acquaintance of Dr. Who asking for help (so we get to learn a bit more about Dr. Who, who is a bit of a mystery), and (e) some well-crafted moral lesson. This season is completely imbalanced. Every episode is some social justice lesson and it's not entertaining. Beyond the irritating condescension, it is incredibly presumptuous. Even if I did manage to make it to my age without any knowledge of morals, quite possibly the last place I'd look to educate myself on how to be a moral person would be television. Not only isn't television a trustworthy source, it's also not the point of television: ENTERTAINMENT is. If I were watching Mr. Rogers or Sesame Street, that would be one thing. But, this is Dr. Who. Come on!3. POOR EXECUTION Dr. Who doesn't like guns. This is established. Dr. Who gets ANGRY when people are killed. This anger is driven by empathy, but also by having seen too many people die and being fed up with it. Having this Dr. Who play that anger off as mopey (as in the witch-related episode) is weak and pathetic and shows no conviction. This is very out of character. I realize that anger can be harder for a female character to play without seeming hawkish, but deal with it. This is Dr. Who's established personality. You can't just change who Dr. Who is as a character. This is something that even stayed the same through previous male incarnations, so biological differences didn't make a difference. You need to keep the continuity. Write it better, act it better.4. TOO MANY PEOPLE Another huge mistake was adding so many sidekicks. Imagine the episode duration as a pie. More people? Smaller slices. BAD plan. We're hungry. We want a generous slice of Dr. Who - not fifteen or fewer minutes, with the rest of the time dedicated to humans and their personal problems. Dr. Who is a Time Lord. We're still unfolding all of what that means and trying to learn more about Dr. Who's past. There are so many species out there, so many unexplored worlds. But, here you are filling up our time with the problems of a few human characters. If we wanted that, we could've watched another show! ANY other show. The point of this one is to see all of time and space - which (believe it or not), does not revolve around a few humans.5. IDENTITY CRISIS (!?) The whole \"I don't know myself,\" \"I'm lost,\" bit was taken way, way too far. Yes, we get it, it's disorienting being reconstructed from scratch in a new body and having to reorder hundreds of years worth of memories. But, having a female Dr. Who in the midst of an identity crisis is more the plot for a Lifetime movie than an action/adventure sci-fi series. It makes Dr. Who seem neurotic. This incarnation could've been made a bit more serious to compensate for the difference in sex stereotypes and norms. That would've kept Dr. Who's personality and personal strength more intact. But, as is, it's a mess. You turned Dr. Who female and didn't do enough to compensate for it and now female Dr. Who seems weak, pathetic, mopey, and ditzy. What a total disappointment! (And, I say that as a woman, myself.) It didn't have to be this way.6. BAD WRITING The writing for this season (11th) is absolutely horrendous. Have any of these writers ever actually watched Dr. Who? Do they know what the word \"continuity\" means? How about \"character\" or \"established personality\"? It doesn't seem like it. It seems like you recruited people on to write for this show who didn't give a toss about the personality of Dr. Who, the continuity of that character, and the balance of themes that previously existed in the series. Get people working for this series that actually care about keeping it as good as it WAS (I say \"was\" because this season is the worst I've ever seen). Not only is the character of Dr. Who being slowly dismantled over the course of this season, the overarching themes are imbalanced, and nothing about this series which drew me to it to begin with has been left intact. Find a crazy, obsessed fan that can recite lines from various episodes by heart. Then, hire this person as a consultant (they'd probably work for free just to be part of the production, so you might not even have to pay them). Make sure you actually LISTEN to this person when it comes to wardrobe, character, and plot lines. If you did that, maybe you'd actually have a chance of recovering from this train wreck of a season. To be clear, it's not bad because Dr. Who is female. It's bad because your writers don't know what they're doing and your lead actress is either not being properly instructed on how to play off certain personality traits (see the previous note about anger over people getting killed) or she doesn't have the acting ability. Either way, this isn't a problem with Dr. Who's sex. It's a problem with other people not doing their jobs sufficiently. Please fix it, otherwise you will not only have ruined an incredible series, but you will have ruined it with a woman (which, given your seeming obsession with moral lessons, would probably be a big no-no)."
    },
    {
      "username": "liamtbrown",
      "userUrl": "https://www.imdb.com/user/ur122584915",
      "reviewLink": "https://www.imdb.com/review/rw6693110",
      "warningSpoilers": false,
      "date": "14 March 2021",
      "rate": "8",
      "helpful": "19 out of 22 found this helpful.",
      "title": "Seasons 1-7",
      "content": "Doctor Who was at it's absolute peak with Christopher Eccleston, David Tennant and Matt Smith. The stories from each season connected beautifully, the cast was memorable and the story was much more creative than it is now."
    },
    {
      "username": "Little_C",
      "userUrl": "https://www.imdb.com/user/ur11934577",
      "reviewLink": "https://www.imdb.com/review/rw4555642",
      "warningSpoilers": false,
      "date": "2 January 2019",
      "rate": "9",
      "helpful": "96 out of 138 found this helpful.",
      "title": "The 9 is for Season 1 till 10, season 11 is a disappointment",
      "content": "I'm a 46 year old man, but I'm not ashamed to tell you I wept with all the regenerations of the Doctor, and for other episodes too (for example, the Van Gogh episode broke me).But when Whitaker's time's up, I think I'll be having a sigh of relief. But only if Chibnall also going away. Especially when Chibnall is gone. Maybe even if Whitaker stays, and she's getting good stories, less companions (or \"fam\", for f* sake).The stories are weak, boring and preachy. The Doctor isn't a force of nature that stops planets rotating, she's not the oncoming storm anymore. She's a boring, bland, preachy dimwit, who doesn't belong in the Tardis.Get Moffat back, get Davies back, get people in the seats that love and understand Doctor Who and scifi. Otherwise this will be the death of the undying Doctor."
    },
    {
      "username": "tlfirth",
      "userUrl": "https://www.imdb.com/user/ur26307163",
      "reviewLink": "https://www.imdb.com/review/rw3136060",
      "warningSpoilers": true,
      "date": "5 December 2014",
      "rate": "10",
      "helpful": "58 out of 82 found this helpful.",
      "title": "Doctor Who works better as a 50-year-old franchise, rather than just choosing one episode!",
      "content": "I have been a fan of this series since almost the beginning of Series 2; my first proper episode was School Reunion, however I had seen the last 20 minutes of Dalek back in 2005, but I didn't remember to tune back in the next week! Ever since then, I've pretty much caught every episode on its broadcast, except for the odd one where I've been away or indisposed. In 2007, I decided to take a look at the Classic Series - my first story was Genesis of the Daleks, and I've loved it ever since. Slowly, I've collected and watched almost every Classic episode available, following the \"junking\" back in the 60s, and I've come to love Doctor Who as part of my life, like a dog or a cat, something I can be with from time to time and have a smile on my face. In 2008, I even started scouring for Big Finish Audios, novels and comics, and I'm still collecting them to this day. By now, of course, we've had thirty-four series with the \"New Who\" batch included, twelve Doctors (thirteen with Hurt), 812 episodes, 252 stories and 50 years of history. In many ways, with the extreme amount of miscellany as part of the franchise, you could compare Doctor Who very nearly to the Star Wars franchise, and has its own culture and everything.What really gives this television show ten stars though is the continuity. This may be hard to explain, because not many people usually comment on it. What I mean by continuity is that every single episode of Doctor Who is linked in some way or another by threads of storyline that cross the 50 years it has been in existence! Whether it's a returning nemesis, an item of clothing or a passing reference, there's always something to look out for and shout \"Ooh, another easter egg for the Whovians!\"A simple example for you was back in the 5th series, following Amy and Rory's wedding, the Eleventh Doctor has just received a phone call in the TARDIS from someone claiming there is an Egyptian goddess loose on the Orient Express. Whilst there are a few slight changes to the context, which could also have been a ploy, three series later, the Twelfth Doctor finally replies by visiting the Orient Express and discovers that it was a computerized identity known as Gus who had brought him there in the first place. It's simple, yet in my mind, it allows me a pause of nostalgia as I think back to how I watched the 5th series.The greatest example I've ever seen was again quite recent. In Moffat's polarising episode, Listen, Clara tells the young Doctor what she heard from his twelfth incarnation. One part of the speech springs to mind, however, \"Fear makes companions of us all\". Not many will have perhaps realised, but this was in reference to what the First Doctor once said to Barbara Wright in the Cave of Skulls, in the third ever episode of the television show. In a very sublime way, the series is never far away from reminding us about the past.As a recommendation, I would give this show an open-mind, especially the \"New Series\", starting 2005. Some episodes are superb, but others drop to the very bottom of the mediocre barrel. What I love about it though is its timeless story, consistently great acting and the fact that the next series could bring absolutely anything to the table - there's just no way of predicting what is to come!Top 10 Doctor Who Stories: 1. Silence in the Library/Forest of the Dead (10th Doctor - 2008) 2. Human Nature/The Family of Blood (10th Doctor - 2007) 3. A Good Man Goes to War (11th Doctor - 2011) 4. Genesis of the Daleks (4th Doctor - 1975) 5. The Talons of Weng-Chiang (4th Doctor - 1977) 6. Blink (10th Doctor - 2007) 7. The Impossible Planet/The Satan Pit (10th Doctor - 2006) 8. Dark Water/Death in Heaven (12th Doctor - 2014) 9. The Day of the Doctor (10th/11th Doctor - 2013) 10. Doctor Who and the Silurians (3rd Doctor - 1970)P.S. IMDb should join both this page and the Classic Series; it's the same bloody show!"
    },
    {
      "username": "pjgs200",
      "userUrl": "https://www.imdb.com/user/ur67786250",
      "reviewLink": "https://www.imdb.com/review/rw3495752",
      "warningSpoilers": false,
      "date": "28 June 2016",
      "rate": "10",
      "helpful": "53 out of 78 found this helpful.",
      "title": "Easily one of the best shows ever produced",
      "content": "In all honesty, all I can say about Doctor Who is positive. It might have inconsistencies here and there, but as a franchise it's the best television series ever produced. Doctor Who is thrilling, action packed, emotional, funny, and dramatic- and it does this in a way that makes it fun to watch while not being too heavy like The Walking Dead or Breaking Bad. The main reason why Doctor Who is my favorite show is because it encapsulates everything good and bad about humanity to create a feel good series. It's plain old fun, yet its scary, surprisingly emotional, and thought provoking. The acting, the music, and the script writing as a whole are phenomenal, especially as the show progresses. I strongly recommend that if you do want to watch, start from Series 1 in 2005. Starting from Series 5 is a quicker way to catch up to the upcoming series, as the show gets a minor reboot and a much bigger budget, but in my opinion Series 1 does a much better job at introducing the show: the mystery it builds is fantastic, the arcs are phenomenal, and the characters are incredibly fleshed out. The earlier series look dated, but it's really the characters and the story that hit home. I have loved every series I have seen, especially Series 1, 3, 4, and 9. I think the best aspect of the show is how it has an overlying story that develops across each series and every episode, but most episodes have enough to be self contained stories themselves. I highly recommend that everyone watch Doctor Who, especially with their families. It has themes that adults will love, and enough adventure, action and silliness for the kids as well. While Doctor Who isn't perfect, its as close to perfection as any series I have ever seen."
    },
    {
      "username": "vargaleonard",
      "userUrl": "https://www.imdb.com/user/ur123435636",
      "reviewLink": "https://www.imdb.com/review/rw7248604",
      "warningSpoilers": false,
      "date": "19 August 2021",
      "rate": "9",
      "helpful": "25 out of 32 found this helpful.",
      "title": "Series 1 to 10 only",
      "content": "One of my favourite shows growing up, but has deffinetly gone down hill in series 10, and I nevwr watched it past Capaldi's departure from the show, so I only base my rating on that segment of the show (2005 - 2017)"
    },
    {
      "username": "freemantle_uk",
      "userUrl": "https://www.imdb.com/user/ur17571044",
      "reviewLink": "https://www.imdb.com/review/rw1877222",
      "warningSpoilers": false,
      "date": "20 May 2008",
      "rate": "10",
      "helpful": "29 out of 46 found this helpful.",
      "title": "Great return of the Doctor, one of the best programs to come out of Britain for a long time",
      "content": "I was never a fun of the original show and I didn't think that I would like this version, but after the first few episodes I was hooked. This is the BBC trying to challenge American programs like Lost and Buffy the Vampire Slayer for cinematic like quality and a vast story arc. The other problem is that the BBC spread a lot of money on Doctor Who and thereby forces them to make some cheap rubbish problem, but this is an issue about the funding of the BBC is a different issue.Doctor Who has had two good actors playing the title role, Christopher Eccleston and David Tennant. I think Eccleston is the better actor and is very good at playing the Doctor as a tortured character, but Tennant is the better Doctor overall. Billie Piper and Freema Agyeman were both good and I did fear Catherine Tate would ruin Doctor Who, but she has been alright in the role as Donna Noble. The show is well written and there is a story arc to it and recurring themes. The show has action, lots of science, can be humorous and little hearted and other times dark and very scary. It can also be psychological and sociological in its approach. The show looks at the past and the future and has a wide scoop for plots. I personally enjoy it when the Daleks are in the program and I really hope Davros makes a come back in the show. The show can be cheesy and hammy sometimes, but I can live with that and that was the spirit of the old show. The CGI can be very impressive, such as in the episode 'The Impossible Planet', but can also be weak, but that is a problem that shows like Lost suffer because the budget is spread more thinly.Russell T. Davies has just said that he is leaving the show, which is a shame because he was the reason why Doctor Who was such a success, but I hope that the quality of the show isn't affected and good writers are brought in.Doctor Who is a Great British invention and is worth watching. As I said I love it when there are Daleks involved."
    },
    {
      "username": "LordBarrett-52262",
      "userUrl": "https://www.imdb.com/user/ur97201252",
      "reviewLink": "https://www.imdb.com/review/rw5476008",
      "warningSpoilers": false,
      "date": "11 February 2020",
      "rate": "7",
      "helpful": "303 out of 362 found this helpful.",
      "title": "Great, until Series 11 and 12.",
      "content": "I am one of the millions that have stopped watching it, and I have no joy in saying that, but under Chris Chibnall's course this show has become a laughing stock. The first episode attracted 10+ million viewers, that number has now sunk to less than 4 million. If I lost 60% of my customers I would be out of business, why hasn't there been an announcement that Chris and Jodie are leaving?I would class the Chibnall era as 1/10, the episodes are unwatchable, Resolution was enough for me. Prior to that we had Capaldi, not my favourite, but in comparison he was good. The Tennant and Smith years were the greatest, as a family we'd have pizza and make an evening of it, now we just enjoy the DVDs.Please BBC listen to your viewers, give us back Doctor Who, before Chibnall wrecks nearly sixty years of history."
    },
    {
      "username": "leorzinati",
      "userUrl": "https://www.imdb.com/user/ur55409799",
      "reviewLink": "https://www.imdb.com/review/rw7107600",
      "warningSpoilers": false,
      "date": "9 July 2021",
      "rate": "8",
      "helpful": "22 out of 31 found this helpful.",
      "title": "Watch until season 7, then stop.",
      "content": "First 7 seasons are gold. 8-10 are so so and I didn't even bother watching the rest."
    },
    {
      "username": "miaalike",
      "userUrl": "https://www.imdb.com/user/ur129739541",
      "reviewLink": "https://www.imdb.com/review/rw6637425",
      "warningSpoilers": false,
      "date": "26 February 2021",
      "rate": "7",
      "helpful": "12 out of 15 found this helpful.",
      "title": "Gripping seasons, followed by lame ones",
      "content": "Dr Who is unique, but in terms of score/rating, really needs seasons to be taken separatelly, or at least in groups defined by main actor and series crew. Have not seen the very old series, just this one, starting 2005. So far, each new Doctor after David Tennant's felt obnoxious at the beginning, like having a new teacher at class after the one you loved just left. But slowly each new one earned its place and sympathy - all but the unfortunate Jodie Whittaker Doctor. The lame writing and plots simply tanked her turn at embodying the timeless character, to the point that makes me wonder if the people managing the show in fact hate women, and just made a mess of it all on purpose, while pretending to be pro feminism and stuff. Why are her storylines so bad, and her acting so monotonous? I can think of quite a few women, ex-companions of the Doctor, who brought in 100 times better presence, depth and engagement than her, a reason why characters like Rose, Donna or Clara are still in our hearts up to this day. The Jodie character, on the other hand, and the new producer or writer (the one following Moffat, Chibnall or something I think) simply tanked the show, as far as I managed to watch until completely dropping it."
    },
    {
      "username": "verna-a",
      "userUrl": "https://www.imdb.com/user/ur22229584",
      "reviewLink": "https://www.imdb.com/review/rw4504446",
      "warningSpoilers": false,
      "date": "10 December 2018",
      "rate": "2",
      "helpful": "626 out of 795 found this helpful.",
      "title": "Bitterly, bitterly disappointed",
      "content": "I see I am not alone in deploring the decline in watchability of Doctor Who with the 2018 season. The series rose to absolute brilliance with many of the episodes of the David Tennant and Matt Smith incumbency. Although I loved both of them as Doctor Who, the real excellence was in the scripts, full of wit and whimsy allowing the characters to engage your interest, love even! Some of the stories were good too, but even if they were a bit feeble the ongoing stories of the Doctor and his companions carried you on. The enigma of the Doctor is the main interest together with the paradoxes of the time jumping. I just put up with the snarling monsters and special effects! The current series completely lacks the wit and whimsy. How can anyone criticise Jodie Whittaker as the Doctor when she is not given anything interesting to say? The stories are complex and the action convoluted. I can't and don't follow them to the end of the episodes, and only my long history as a Doctor Who fan keeps me watching at all. I don't say bring back Stephen Moffat as writer because despite his absolute brilliance at his best, I think he was losing interest. But please, please find a new writer who can put something in the mouths of the Doctor and his companions that is entertaining. A good story wouldn't hurt either! Failing these I'm afraid we may be looking at the last series of Doctor Who. I'm 68 so may not last long enough to see another revival."
    },
    {
      "username": "astralone1",
      "userUrl": "https://www.imdb.com/user/ur26839010",
      "reviewLink": "https://www.imdb.com/review/rw6446179",
      "warningSpoilers": false,
      "date": "5 January 2021",
      "rate": "",
      "helpful": "53 out of 67 found this helpful.",
      "title": "I can't keep doing this.",
      "content": "You destroyed the legacy Chris. Way to go buddy. I knew as soon as I saw the new design elements that this period was gonna blow, and it does. Nothing to do with the fact that it's a woman playing the Doctor, everything to do with a bad fanfic writer playing showrunner."
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6367890",
      "warningSpoilers": false,
      "date": "15 December 2020",
      "rate": "8",
      "helpful": "17 out of 25 found this helpful.",
      "title": "Doctor Who",
      "content": "The series was great, I enjoyed watching it, but its recent seasons are bad. I did not like the character of Doctor 13. The best seasons were with Doctor 11. I hope that the character of Doctor 13 will end as soon as possible."
    },
    {
      "username": "ShadeGrenade",
      "userUrl": "https://www.imdb.com/user/ur7743887",
      "reviewLink": "https://www.imdb.com/review/rw1449784",
      "warningSpoilers": true,
      "date": "16 August 2006",
      "rate": "10",
      "helpful": "54 out of 94 found this helpful.",
      "title": "\"Do You Wanna Come With Me?!\"",
      "content": "When it was announced in 1995 that 'Dr.Who' was going to return as an made-for-television movie co-produced by the B.B.C. and Universal T.V., Paul Mount wrote an article for 'Starburst' magazine offering advice to incoming producer Philip Segal. Amongst other things he recommended that the new film not pander to long-term fans by making unnecessary continuity references to past adventures. Alas the film, though it had its good points ( McGann was an incredible Doctor ), did not work as a starting point for a new series. The 'kisses to the past' crippled its chances of finding a new audience. However, Mount's sensible advice seems to have been more closely heeded by Segal's successors, Russell T.Davies, Julie Gardner and Mal Young. 2005 will surely go down in 'Dr.Who' history as its most incredible year. Everything worked; a first-rate new Doctor ( Christopher Eccleston ) and companion ( Billie Piper ), big audiences ( 10 million for the first episode and Christmas special ), major awards, critical acclaim and those idiots who spent years giggling at the Daleks' seeming inability to negotiate stairs were silenced forever. But then Eccleston dropped a bombshell, quitting after just one series. It looked like the honeymoon was over. But the public appears to have embraced his successor, the excellent David Tennant. On top of this the show boasts fine S.F.X., like the spaceship crashing into 'Big Ben' in 'Aliens Of London' and superb story lines such as 'Tooth & Claw', 'Army Of Ghosts/Doomsday'. Davies established a 'tone' for each episode, writing the lighter ones himself while farming out the more serious ones to Paul Cornell and Steven Moffat. Judging from some of the other comments here it seems some people are having problems adjusting to the new look of the show, levelling at Davies the venom once reserved for the late John Nathan-Turner. I would ask them to give it a chance. The original show, after all, also produced more than its fair share of rubbish. The new 'Dr.Who' is basically the same as the old, only updated for the 21st century. Had the wobbly sets, Dudley Simpson music and fake monster costumes been retained, it would have been laughed off the air. Some fans have accused Davies of 'ruining' the show. They need to remember that there was no show for sixteen years until he came along. Objections to the new Cybermen put me in mind of an article from the now-defunct 'Dr.Who Bulletin' titled ''80's Cybermen Just Aren't Scary'. So it goes."
    },
    {
      "username": "the_real_smile",
      "userUrl": "https://www.imdb.com/user/ur3845724",
      "reviewLink": "https://www.imdb.com/review/rw3609733",
      "warningSpoilers": false,
      "date": "31 December 2016",
      "rate": "10",
      "helpful": "15 out of 22 found this helpful.",
      "title": "Time of death: season 8",
      "content": "I love Dr. Who. Always loved it. From the Tom Bakes series to Christopher Eccleston and on. Chrisopher did a great job and the script and effects were great. Then David Tennant took over and also did a good job, also here the good stories and effects helped a lot. Then Matt Smith took over and it took him 2 seasons to get into the role of \"Dr. Who\", but in his last season he did achieve it, sadly the script and effect went downhill every season. Then Peter Capaldi came. Peter Capaldi is a remarkable actor and from his first episode he was Dr. Who, but he had to battle boring script, lack of special effect, etc., you could describe is as the 20th century Sylvester McCoy episodes, because all the scenes were shot in the same place, very cheap. So sadly I have to announce that, if you could bare season 6 and 7, from season 8 it's a boring series, lack of originality, low budget and so on, a real shame cause Capaldi is a good actor."
    },
    {
      "username": "mark-whait",
      "userUrl": "https://www.imdb.com/user/ur22397912",
      "reviewLink": "https://www.imdb.com/review/rw2177385",
      "warningSpoilers": true,
      "date": "20 December 2009",
      "rate": "10",
      "helpful": "35 out of 56 found this helpful.",
      "title": "How Doctor Who became the best show on TV",
      "content": "Back in 1963, a low budget science fiction television series was launched primarily aimed at educating children during Saturday teatimes, called Doctor Who. Slipping under the radar due in no small part to the assassination of President Kennedy, the show suddenly became the hottest property on British television just six weeks into its run with the introduction of The Daleks. The Daleks propelled the show into another stratosphere and became a merchandising phenomenon in the 1960s, which guaranteed the series a shelf life much longer than was originally planned or anticipated. The blank canvas doesn't come much bigger - any episode could be set at any time, in any world, anywhere. And add to that the genius of the central character being able to regenerate without the need to ruin audience expectation, and you had television gold. And so began an amazing run of 26 years with the Doctor portrayed by seven different actors, before the wheels began falling off. The decline can be traced back to the late 1980s. Tom Baker, largely considered by many fans to be the ultimate Doctor (before the emergence of David Tenant who now has a claim to the throne) ended his hugely successful run in 1981, and youthful producer John Nathan-Turner replaced him with popular TV actor Peter Davison. Whilst Davison's era was highly competent and successful, both in terms of ratings and quality, it was Turner's decision to install Colin Baker in 1984 that was the beginning of the end. Baker's crass and incredibly ill-judged portrayal alienated viewers and as ratings fell, it was no surprise that then-BBC chief Michael Grade gave the show a deliberate 18 month rest. Sylvester McCoy was then handed the role, and whilst his tenure is regularly derided by fans, he was harshly treated. His realignment of the part was excellent, but by now the show had degenerated into almost pantomime type farce. Turner was obsessed with attracting big name guest stars to the show - witness the likes of Ken Dodd, Richard Briers and Sheila Hancock, but was accused of taking his eye off the ball as the story lines and dialogue descended into cringing embarrassment. We were no longer hiding behind sofas because of the terror of the aliens - we were hiding from the show itself. The show's darkest hour was when McCoy's Doctor was faced with an enemy in The Happiness Patrol called the Kandy Man who just happened to resemble a giant liquorish allsort. And it seemed that when the show was finally axed a year later in 1989, it would be forever confined to the memories of TV yesteryear. An abortive effort to revive the show in 1996 using a TV movie with Paul McGann only served to remind us that the show was best left on the shelf.But then 2005 happened and Russell T Davies, one of the most prolific and thought provoking writers in television, revived the series with highly acclaimed actor Christopher Eccleston in the main role, and, as a stroke of pure genius, the bewitchingly alluring Billie Piper as his assistant. Piper was the conduit between generations - she still had a teen following from her earlier career as a successfully precocious pop star, and also attracted more than a passing interest from older (male)viewers as she was also something of a pin-up girl favourite, often posing for lads mags of the age. But Davies also used his massive budget to transform Doctor Who. Gone were the cardboard sets and sticky-back plastic alien costumes. In came proper special effects and even a revamped orchestral theme tune. But the strength was in the scripts. In Fathers Day, for example, Piper goes back in time to see her father who died when she was a small child. This was high octane emotional drama, and was difficult to reconcile with the often comedic episodes of the past decades. And then came David Tenant. As Tenant's performances got better, the scripts pushed him harder, and he quickly developed a cult following that took the show right back to the top of the ratings, and even created spin off shows like Torchwood and The Aventures of Sarah Jane Smith. Countless episodes followed which were suddenly the envy of producers everywhere - Doctor Who was streets ahead of everything else on television and remains so today."
    },
    {
      "username": "Theo Robertson",
      "userUrl": "https://www.imdb.com/user/ur1532177",
      "reviewLink": "https://www.imdb.com/review/rw1108771",
      "warningSpoilers": false,
      "date": "21 June 2005",
      "rate": "8",
      "helpful": "99 out of 195 found this helpful.",
      "title": "A Brilliant Return But Not A Flawless One",
      "content": "It was September 2003 that I heard the BBC were going to resurrect DOCTOR WHO and make it \" Bigger and better \" but I'd heard these rumours in the press before and thought that's all they were - Rumours . But it was then mentioned that Russell T Davies was going to executively produce and write the show and then one Saturday afternoon in March 2004 Channel 4 news interviewed the actor cast in the title role - Christopher Eccleston . Yes that Christopher Eccleston an actor I've always been impressed by since watching his film debut in LET HIM HAVE IT and if he was getting interviewed on television it must have been true . As the months passed more and more information was leaked , Billie Piper was being cast , the Daleks would be returning and The Mill , the Hollywood effects company who had done the FX for GLADIATOR were contracted to do the special effects for the show . For several weeks before the first broadcast trailers galore heralded the return of the new series , massive billboards in London informed the public about the return of the show , tabloid newspapers carried massive photo spreads of the aliens appearing and Christopher Eccleston appeared on programmes as diverse as BLUE PETER , MASTERMIND ( Which had a special DOCTOR WHO night edition ) , THIS MORNING and Friday NIGHT WITH JOHNATHAN ROSS . In fact this new series of DOCTOR WHO must have been the most hyped programme in the history of British television , it had better be bloody good So was it bloody good ? Undoubtedly it has been a major success with nearly every episode making the top ten shows in the TV charts . To give you clue of its rating success only one episode ( The Ark In Space episode two - Febuary 1975 ) from the old series had made it into the top five TV chart . The opening series episode made number three with two more episodes either beating or equalling the previous record and this is in an era where there's far more competition in terms of TV stations and choice . Let's laugh and cheer at the fact DOCTOR WHO stuffed HIT ME BABY ONE MORE TIME , CELEBRITY WRESTLING and mauled ANT AND DEC'S Saturday NIGHT TAKEAWAY . Of course much of the success is down to the breath taking visuals and the casting of a well known prestigious actor in the role . For the most part everything you see on screen here equals anything you'll see in a Spielberg / Hollywood movie . There's a Dalek invasion force numbering tens of thousands , exotic aliens , a 19th Century Cardiff that looks like a 19th Century Cardiff and night filming that is actually night filming and not done by sticking a dark filter over the screen . I promise you'll be hearing a lot more from the directors who worked on this series , Joe Ahearne especially will one day be in the Hollywood A list There are some flaws to the new series of DOCTOR WHO and all of them should be laid at the door of Russell T Davies . It may be contentious whether the soap opera and post modernist elements are successful or not ( In my opinion they're not ) but what's not in dispute is that the weakest scripts are all written by RTD . As I mentioned in my review of CASANOVA he cheats the audience and he does the same thing here: when faced by armed soldiers pointing their guns at him The Doctor bellows \" attack plan delta \" which makes no sense to anyone in the audience but allows him to escape from a tight spot , a naked Captain Jack suddenly pulls out a laser he's been hiding and RTD scripts are full of these type of cheats and deus ex machina type endings . In fact the final episode is spoiled greatly by the ridiculous concept of what the \" Bad Wolf \" is which seems to have got RTD out of a tight spot more than The Doctor . And of the endings I'm trying to remember if any of them were actually down to The Doctor ? More often than it's a supporting character or the Doctor's companion who saves the day . The show is called DOCTOR WHO not ROSE TYLER so can we see the title character save the day please just like he did in the classic series ? One final point about the portrayal of the Doctor is the way he's written as a grinning loon . Eccleston is best known for his serious and gloomy roles and he's absolutely breath taking at scenes when he's showing grief , like the tear running down his face in the End Of The World but more often than not he's written as a \" Tom Baker on speed \" character . It's obvious why Eccleston hasn't done much comedy in his career - He's not very good at it Am I starting to sound like I hate this show ? Sorry I didn't mean to but it's just that while some anticipations have been met or surpassed some others haven't and they're nearly all down to Russell T Davies who thankfully is contributing less in the way of scripts in the next series of DOCTOR WHO . Let's see more traditional stories of a human outpost being under threat from monsters like we saw in the 1960s and 70s , imagine a story like The Sea Devils with a massive budget directed by Joe Ahearne ! Oh and one last request - Can we see these \" NEXT TIME \" trailers scrapped ? They reveal all the best bits of next week's episode"
    },
    {
      "username": "sailor_julia",
      "userUrl": "https://www.imdb.com/user/ur34866892",
      "reviewLink": "https://www.imdb.com/review/rw8205243",
      "warningSpoilers": false,
      "date": "4 June 2022",
      "rate": "10",
      "helpful": "11 out of 15 found this helpful.",
      "title": "End of an era.",
      "content": "Since the beginning the show is great but since season 11, it became Awful.The story are bad, the personality of the crew are empty nothing good.Sorry for Jodie, but it don't feel like I'm watching Dr who.Some other show with a tardis. A new writer is really needed one who know Dr who."
    },
    {
      "username": "MeMyselfOnline",
      "userUrl": "https://www.imdb.com/user/ur0466909",
      "reviewLink": "https://www.imdb.com/review/rw4741688",
      "warningSpoilers": true,
      "date": "24 March 2019",
      "rate": "6",
      "helpful": "39 out of 55 found this helpful.",
      "title": "Ruined By Series 11",
      "content": "I came to the Doctor Who universe as a newbie when the series returned with Eccleston and Piper. Originally unsure as to what to make of it, the show grew on me more and more, and with the reveal of the Bad Wolf story arc, I was hooked.When Tennant took over the role, my love for the show was set in stone. He played the Doctor so well, and even though his companion changed three times, he acted as a continuity sewing everything together.Yes, there were a few dud episodes, but all in all seasons one through four were a joy. And I still can't watch the end of seasons two and four without getting emotional. Donna was also a surprise. Originally thinking I could never see beyond Catherine Tate's comedy characters, Donna became perhaps my favourite companion even over Rose.When Tennant left and Smith took over, things went downbank for me, not for Smith but because Amy Pond was, for me, one of the most annoying companions ever. She took over the whole show to the point that the opening scenes used to play out as though the show were about her, and the Doctor was her companion. I was glad when she went.Thereafter, through into Clara, Smith into Capaldi, and Nardole and Bill, whilst never matching the glory days for me, were still entertaining in their own ways.And then Whittaker and Chibnall happened. And it all went wrong.I have no issue at all with a female Doctor. I was looking forward to seeing what the show could do with that, and thought it would bring an overdue injection of new life into the format, but the opposite appears to have happened.I found all of the new series to be dull as ditch water. There's nothing to like about it.The music for one thing is flat. Each previous series had a theme, often linked to the companions. Series 11 has nothing of the sort. The music is almost like one constant drone from start to finish. It's actually painful to ensure.The companions are dreadful. There are too many of them and so none of them have enough development time to care about them, and Ryan in particular has more wood than Noah's Ark. He can't act. He just reads out works in a monotone voice.None of them seem fazed or impressed by anything they see. They're as excited about being on another planet as they are for putting the bins out for collection.And Whittaker makes for a dreadful Doctor. She never commands the attention of anyone. She doesn't know what to do. She's always wide-eyed and astonished. And what's with making futuristic things like a sonic probe or a Dalek out of bits of old tat found lying around?I actually think it's an insult that they gave us a female Doctor and then made her inept. A male Doctor didn't need a gang of \"fam\" to get anything done, why does a female one?I recently rewatched all the Nu-Who and without a doubt the latest series is a total abject failure. Personally I believe Chibnall should quit and see what Whittaker can do with a better script. And a new musical score is much needed, too.Such a shame that they've effectively ruined what was a great show."
    },
    {
      "username": "evelyn009",
      "userUrl": "https://www.imdb.com/user/ur50319551",
      "reviewLink": "https://www.imdb.com/review/rw4502496",
      "warningSpoilers": false,
      "date": "9 December 2018",
      "rate": "10",
      "helpful": "25 out of 33 found this helpful.",
      "title": "I give it a 10 for all the other seasons, except for the 11th season.",
      "content": "I actually like the new doctor, just because the actress is good in it. I just don't like the fact that there's no depth in it. The companions don't ask questions about the doctor, who is she, where she comes from, how old is she, why does she have two hearts and so on. They just accepted the fact that she is an 'alien', someone different. I also don't like that there are 3 companions and they can't form a deep relationship with the doctor, it feels shallow. I also think that they could have used the doctor better, now that a doctor is a she, and they could have elaborated more about how different the doctor feels now that she is a woman. The actors are great, but the writers did a poor job."
    },
    {
      "username": "joncase-48463",
      "userUrl": "https://www.imdb.com/user/ur67709296",
      "reviewLink": "https://www.imdb.com/review/rw5777365",
      "warningSpoilers": false,
      "date": "27 May 2020",
      "rate": "6",
      "helpful": "19 out of 26 found this helpful.",
      "title": "Now Very Disappointing",
      "content": "Seasons 1 to 10 - superb. Seasons 11 and 12 - shockingly bad."
    },
    {
      "username": "jerry6-1",
      "userUrl": "https://www.imdb.com/user/ur13903980",
      "reviewLink": "https://www.imdb.com/review/rw6761501",
      "warningSpoilers": false,
      "date": "30 March 2021",
      "rate": "1",
      "helpful": "194 out of 235 found this helpful.",
      "title": "cybermen Daleks , nothing could take down the doctor",
      "content": "Until Chibnall comes along and destroys a franchise , i've watched for over 40 years , 20 of them with my children .Thanks for ruining a great show , you have done what nothing in the universe was capable of , maybe they should make a show about Chibnall the destroyer ?"
    }
  ],
  "errorMessage": ""
}