{
  "imDbId": "tt10530900",
  "title": "Gullak",
  "fullTitle": "Gullak (TV Series 2019– )",
  "type": "TVSeries",
  "year": "2019",
  "items": [
    {
      "username": "karguppikarpavan",
      "userUrl": "https://www.imdb.com/user/ur116392486",
      "reviewLink": "https://www.imdb.com/review/rw6479898",
      "warningSpoilers": false,
      "date": "15 January 2021",
      "rate": "10",
      "helpful": "82 out of 84 found this helpful.",
      "title": "Please dont stop. Continue journey with Season 3,4,5 and so on...",
      "content": "You may argue that you've seen better shows than \"Gullak\" but just once, just once try remembering the last time you enjoyed any series watching experience so much.Rarely in a lifetime, we come across a play, show or a movie which becomes instant relatable and that absorb it's audience so much so that we just want to be there for little more time. Gullak is that gift to India and it's viewers by TVF & Gullak-Team. High on acting, punchlines and perfect writing, this show in it's second season slightly deviates from the light hearted comedy drama that was seen in season:1, dwell more into the emotions of Misra Parisar in season:2 but without losing the track of humour. The brotherhood of Annu-Aman in season:2 if relates to you, tears & smiles are guaranteed. As usual, Misra Pariwar & Bittu ki mummy runs the entire show but this time, Annu is the Big Bull of season 2 in all departments.I genuinely feel the makers must continue the Gullak series for many more seasons and hoping that, if any actor becomes a big star tomorrow they will still find dates for Gullak shooting and continue doing this show. Because you four people (Papa, Mummy, Annu & Aman) bring so much smile and emotions out of viewers that you have no idea about.I just wish the kids of 2020s generation are watching this series and when they go in 40s/50s, they will find themselves remembering the memories of 20s and \"Gullak\" will be one of that (Like sometimes we float in 90s nostalgia)Best wishes to Team Gullak."
    },
    {
      "username": "akashtaker001",
      "userUrl": "https://www.imdb.com/user/ur23521316",
      "reviewLink": "https://www.imdb.com/review/rw4962724",
      "warningSpoilers": false,
      "date": "27 June 2019",
      "rate": "9",
      "helpful": "67 out of 69 found this helpful.",
      "title": "TVF has done it again, Brilliant series.",
      "content": "TVF is on a roll, after critically acclaimed Kota Factory they have come up with another series that is brilliant. Gullak is such a simple story about everyday life of a middle class family. Their fights, struggles, love etc... These characters are so real, you might even relate with them. Every episode is a \"kissa\" like the series told in the beginning not a \"kahani\". There is not Sacred Games or Mirzapur, but a peek into everyday life of a family with a humorous touch. I will really recommend everyone to watch this series."
    },
    {
      "username": "aryane-34824",
      "userUrl": "https://www.imdb.com/user/ur105153029",
      "reviewLink": "https://www.imdb.com/review/rw6480492",
      "warningSpoilers": false,
      "date": "15 January 2021",
      "rate": "10",
      "helpful": "29 out of 30 found this helpful.",
      "title": "Need Season 3",
      "content": "Please don't stop here. Continue the series. Best Web Series ever seen. Kudos to the team Gullak. Hats off TVF"
    },
    {
      "username": "smitikaur",
      "userUrl": "https://www.imdb.com/user/ur104774111",
      "reviewLink": "https://www.imdb.com/review/rw4964157",
      "warningSpoilers": false,
      "date": "28 June 2019",
      "rate": "10",
      "helpful": "50 out of 53 found this helpful.",
      "title": "Nostalgic",
      "content": "Nostalgic . Absolutely love It. You can watch it with your family and completely enjoy laughing at those lil daily day to day things"
    },
    {
      "username": "ramakhushboo",
      "userUrl": "https://www.imdb.com/user/ur100026788",
      "reviewLink": "https://www.imdb.com/review/rw4966836",
      "warningSpoilers": false,
      "date": "29 June 2019",
      "rate": "9",
      "helpful": "17 out of 18 found this helpful.",
      "title": "Nostalgic",
      "content": "Where were you guys since so long..... Masterpiece from Indian middle class, each and every scene is so relatable."
    },
    {
      "username": "puranjanbasak",
      "userUrl": "https://www.imdb.com/user/ur119836880",
      "reviewLink": "https://www.imdb.com/review/rw8045332",
      "warningSpoilers": false,
      "date": "9 April 2022",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Gullak season 3",
      "content": "Gullak season 3 is a comedy drama family show directed by palash vaswani and amrit raj gupta. These are the positives and negatives.Performances:-oh where do i start? Jameel khan is extremely underrated as an actor. He has poured so much innocence into the character that it seems real. Geetanjali kulkarni is again excellent. The mothers of middle class households are the most difficult to play and she has aced it. Vaibhav raj gupta is my favourite of the lot. He brings the sense of security and maturity in the household many a times. Harsh mayar is naive and equally excellent. The performances are brilliant to say the least.Music and background score:-the intro theme is pure love. I guess no one would even dare to skip it. And the songs composed are no less. They are melodious and so insightful. The lyrics are so well written.Dialogues:-nothing to talk about dialogues. Just the everyday things we all talk about in middle class homes. But it feels so good to see that. Just normal conversation nothing unauthentic or crass. And the humour is brilliant. Brilliant dialogue writing.I think there is no need to say more. Gullak is an emotion which needs to be felt. Just watch it. It is sweet, subtle and a masterpiece. I rate it 10 out of 10."
    },
    {
      "username": "yash-05196",
      "userUrl": "https://www.imdb.com/user/ur97877085",
      "reviewLink": "https://www.imdb.com/review/rw6489177",
      "warningSpoilers": false,
      "date": "16 January 2021",
      "rate": "10",
      "helpful": "12 out of 12 found this helpful.",
      "title": "Takes you back in time. Very well directed",
      "content": "This is really a great thing to watch specially if you are 90's kid. Very realistic direction and wonderful performance by cast"
    },
    {
      "username": "jhaanish-22457",
      "userUrl": "https://www.imdb.com/user/ur104896337",
      "reviewLink": "https://www.imdb.com/review/rw4963598",
      "warningSpoilers": false,
      "date": "28 June 2019",
      "rate": "10",
      "helpful": "27 out of 29 found this helpful.",
      "title": "Best web series of the year",
      "content": "Very rarely u come across something where from the first scene u realise u r watching something really special.kudos to tvf for creating such a masterpiece and enhancing their benchmark after yeh Meri family and Kota factory.By the time the fifth episode is over u already begin to miss the characters.Detailing of the North Indian middle class family is magnificent .It has a subtle layer of emotions which compels u to be nostalgic and emotional but u still keep smiling thruout.U will realise how good it is when u will watch it second time."
    },
    {
      "username": "princej-77659",
      "userUrl": "https://www.imdb.com/user/ur104918112",
      "reviewLink": "https://www.imdb.com/review/rw4964786",
      "warningSpoilers": false,
      "date": "28 June 2019",
      "rate": "10",
      "helpful": "27 out of 28 found this helpful.",
      "title": "Story which will seriously tickle it's audience for sure..",
      "content": "TVF at its best as always, Gullak undoubtedly connect to life of middle class families various chores, Seriously I am loving this . Great acting done by all cast."
    },
    {
      "username": "prashantku-34214",
      "userUrl": "https://www.imdb.com/user/ur95844147",
      "reviewLink": "https://www.imdb.com/review/rw6483307",
      "warningSpoilers": false,
      "date": "16 January 2021",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "One the best web series",
      "content": "Dekhte jao, dekhte jao, achha lagta hai, bas jab khatm hota hai tab khed hua. Every middle class 90s kid can relate this with own story. Realistic"
    },
    {
      "username": "vinayshri",
      "userUrl": "https://www.imdb.com/user/ur118728304",
      "reviewLink": "https://www.imdb.com/review/rw7462628",
      "warningSpoilers": false,
      "date": "20 October 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Fun loving!",
      "content": "You can watch it with your family as well as friends. The cast was Amazing, characters were relatable, storyline was good. Amazing stories. Must watch. Thank you."
    },
    {
      "username": "ketgup83",
      "userUrl": "https://www.imdb.com/user/ur22864666",
      "reviewLink": "https://www.imdb.com/review/rw6492376",
      "warningSpoilers": false,
      "date": "17 January 2021",
      "rate": "9",
      "helpful": "6 out of 7 found this helpful.",
      "title": "A Piggybank Of Brilliant Direction, Clever Writing And Superb Acting Will Sweeten Up Your Mood",
      "content": "Life is a simple journey and yet we make it complicated. Few folks makes life harder trying to seek happiness in more luxurious way of living while few enjoy the moment in small things. From the house of TVF Play, Gullak is probably one of the best web-series to come out which is completely entertaining, beautifully scripted with natural performances by the star cast.While we got introduced to the beautiful world of Mishra family in Gullak Season 1 where we witness what happens in typical Indian middle-class - quarrels, fights, struggle, conciliate, facing budget-constraint, pulling each others leg and yet accepting and being there for each other. Season 2 deep-dives into each character of Mishra family which takes the story forward.Thanks to the OTT platform, small town stories have become the flavor of the season. While movies and web-series have made audience adore the simplicity of these places, the culture followed by locals with no flashy and grandeur sets makes it real enhanced by situational comedy to watch since you might never know what will come next and the surprise element that will make you laugh-a-loud. This is where Gullak scores. The web-series is intrinsic to its core right from the beginning with hilarious moments enough to tickle your funny-bone. Few scenes will definitely bring down the house as the we see Mishra family rib-tickling dialogues.There is something about TVF's content which will touch the right chord of your heart. The team behind impeccable dramas like Permanent Roommates, TVF Pitchers, Flames, Kota Factory, TVF's Tripling , Cubicles etc, Gullak is yet another feather on their cap which is beautifully directed by Palash Vaswani and Amrit Raj Gupta and cleverly written by Nikhil Vijay (2019 Season 1) , Shreyansh Pandey and Durgesh Singh. Technically, the cinematography capturing the beautiful locales of a small town while art direction is simple yet powerful. While I would recommend to watch the Season 1 to get the feel of Mishra family's household environment, Season 2 does have emotional and heart-warming scenes.The chemistry between Papa (Jameel Khan), Mummy (Geetanjali Kulkarni), Annu (Vaibhav Raj Gupta) and Aman (Harsh Mayar) is so real as if they are actually part of Mishra family. Each and every actor has played their part with aplomb. Voice of Shivankit Singh Parihar (Gullak) goes well running at the frequent interval. Sunita Rajwar as the troubling neighbor is brilliant as usual.So overall, Gullak Season 2 will make you believe and adore your family even more after watching. It is a fun ride all the way !!"
    },
    {
      "username": "MandalBros-5",
      "userUrl": "https://www.imdb.com/user/ur100201738",
      "reviewLink": "https://www.imdb.com/review/rw6551964",
      "warningSpoilers": false,
      "date": "1 February 2021",
      "rate": "9",
      "helpful": "6 out of 7 found this helpful.",
      "title": "TVF MEANS HAPPINESS.",
      "content": "TVF is all about sharing happiness. The best weapon of TVF is it's relatable writing. Season 2 has more emotional moments than the previous one. Tear guaranteed in the last sequence of the season.Theme song is so herat soothing that I never skipped it in any episode. All the actors were very good, I liked Geetanjali Kulkarni the most. Bittu's Mummy (Sunita Rajwar)'s smiling face always make us smile. Sivankit Singh Parihar's voice is enough to make us feel his presence.CONCLUSION. TVF NEVER DISAPPOINTS.You Can Watch The Series On Sony LIV.©MandalBros."
    },
    {
      "username": "SoumikBanerjee1996",
      "userUrl": "https://www.imdb.com/user/ur46919419",
      "reviewLink": "https://www.imdb.com/review/rw6678040",
      "warningSpoilers": false,
      "date": "9 March 2021",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "A Hidden Gem!",
      "content": "TVF returned with another heartfelt memoir, encircling a traditional middle-class family. Although there isn't much for prevalent structuring; alternately they used short stories to make an imitation of all the little incidents that occur on a regular basis.Truth be told, I never felt happier while watching a web series before. A joyful smile was persistent on my face throughout the whole duration. Belonging to the akin middle-class background, can't help but notice how each trait had so much resemblance with our everyday lives.A grounded yet cogent appeal that not only leaves a mark but also helps you to establish an acquaintance with the on-screen family. That too with enough subtlety. Comprised of four main characters; they all correspond to every other household in our country.Coupled with some outstanding performances, sufficient technical competence, and an ethereal Soundscore; abounding contributions from all these critical aspects do make it even better. Regardless of petty flaws; I truly appreciate what I finally got out of this commixture! Where simplicity easily prevails in every plausible direction.Highly Recommended!(Streaming exclusively on SonyLiv)"
    },
    {
      "username": "sudeepchatterjee",
      "userUrl": "https://www.imdb.com/user/ur65301891",
      "reviewLink": "https://www.imdb.com/review/rw5056988",
      "warningSpoilers": false,
      "date": "13 August 2019",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "One of the best from TVF",
      "content": "This is the time writers should be celebrated in the mainstream. Its amazingly wtitten. Nuances of daily life, phrases and details are put effortlessly on the screen. Brilliantly acted and directed. Can't wait for session 2."
    },
    {
      "username": "soumyalal2",
      "userUrl": "https://www.imdb.com/user/ur28510583",
      "reviewLink": "https://www.imdb.com/review/rw5982509",
      "warningSpoilers": false,
      "date": "11 August 2020",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Gullak: An Ordinary India Family",
      "content": "This show will make you laugh , cry ,feel their pain. You can definitely relate to the problems of the family. One of the best show ever thank you TVF. Jameel Khan, Geetanjali Kulkari , Vaibhav Raj Gupta , Harsh Mayar these 4 are the soul of this series. And cherry on top is the voice over of Shivankit Singh Parihar as Gullak. \"Ye yadein to hai jo kisse ban jate hai aur jama ho jate hai kisso ki Gullak me\""
    },
    {
      "username": "farhan-74497",
      "userUrl": "https://www.imdb.com/user/ur117324145",
      "reviewLink": "https://www.imdb.com/review/rw6484288",
      "warningSpoilers": false,
      "date": "16 January 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Loved it!",
      "content": "5th episode of season 2 made me cry.Watch it, surely you will love it."
    },
    {
      "username": "raoanjali-67922",
      "userUrl": "https://www.imdb.com/user/ur105055867",
      "reviewLink": "https://www.imdb.com/review/rw4973002",
      "warningSpoilers": false,
      "date": "2 July 2019",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Best Tv series",
      "content": "Shows the life of a middle class family. Many of the instance are similar to things which happens in every middle class family. Wonderfully shown. Simply marvellous. Rollercoaster ride of emotional, funny. Leaves a smile on your face."
    },
    {
      "username": "mdfaizzaslam",
      "userUrl": "https://www.imdb.com/user/ur94917322",
      "reviewLink": "https://www.imdb.com/review/rw4962669",
      "warningSpoilers": false,
      "date": "27 June 2019",
      "rate": "10",
      "helpful": "19 out of 20 found this helpful.",
      "title": "TVF Impress Everytime",
      "content": "Great Series Man. Nikhil Vijay You Are Great . Thank You Tvf"
    },
    {
      "username": "iamnitink",
      "userUrl": "https://www.imdb.com/user/ur92481157",
      "reviewLink": "https://www.imdb.com/review/rw4964654",
      "warningSpoilers": false,
      "date": "28 June 2019",
      "rate": "10",
      "helpful": "23 out of 25 found this helpful.",
      "title": "Must watch web series",
      "content": "Love the whole series Totally realistic Great work from tvf"
    },
    {
      "username": "tomartushar-49846",
      "userUrl": "https://www.imdb.com/user/ur126856142",
      "reviewLink": "https://www.imdb.com/review/rw8043463",
      "warningSpoilers": false,
      "date": "8 April 2022",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Jindagi Batri Hai Yaha, TVF does It Again.",
      "content": "Don't Think Twice, Just Watch It. Watch It For Those Emotions It Express, Watch It For The Life It Is Spreading, Watch It To Realise How Beautiful Life and Everyy Moment Is.Just Like Some Films are Made To Be Experienced in Theatres Only, This Is Just Something To Be Experienced With Your Family.Thank You TVF ✨"
    },
    {
      "username": "hussainmerchant",
      "userUrl": "https://www.imdb.com/user/ur77911304",
      "reviewLink": "https://www.imdb.com/review/rw8044065",
      "warningSpoilers": false,
      "date": "8 April 2022",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Absolutely amazing",
      "content": "The only web series we all wait and one of the reason is it gets better not only season by season but by episodes too. Very rarely we find an entertaining web series with so many different feelings, emotions, laughter and learning. Just an amazing web series to watch. Top notch no doubt."
    },
    {
      "username": "chipsarecrispy",
      "userUrl": "https://www.imdb.com/user/ur96694404",
      "reviewLink": "https://www.imdb.com/review/rw6482364",
      "warningSpoilers": false,
      "date": "16 January 2021",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "It's beautiful",
      "content": "Was happy since the trailer was released and it lived up to it. Where does TVF and team find such brilliant actors among the crowd of star kids. These whole cast if full of talented ppl"
    },
    {
      "username": "MuviFan73",
      "userUrl": "https://www.imdb.com/user/ur57213624",
      "reviewLink": "https://www.imdb.com/review/rw6495471",
      "warningSpoilers": false,
      "date": "17 January 2021",
      "rate": "9",
      "helpful": "4 out of 6 found this helpful.",
      "title": "Simply hilarious!",
      "content": "Gullak is collection of short instances of a middle class family in India. If you belong to one, Its possible you can relate to it.It contain's a type of humor that challenges the same in mature category, despite being simple. The biggest strength perhaps.Must support this guys. Its better than most of content out there!"
    },
    {
      "username": "shovonbhattacharjee",
      "userUrl": "https://www.imdb.com/user/ur115774856",
      "reviewLink": "https://www.imdb.com/review/rw6564137",
      "warningSpoilers": false,
      "date": "5 February 2021",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Superb story Superb acting",
      "content": "The storyline of this series is just amazing and acting is also superb. Very Natural stories. Overall I like this series very much."
    }
  ],
  "errorMessage": ""
}