{
  "imDbId": "tt10541088",
  "title": "Clarkson's Farm",
  "fullTitle": "Clarkson's Farm (TV Series 2021– )",
  "type": "TVSeries",
  "year": "2021",
  "items": [
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw7097631",
      "warningSpoilers": false,
      "date": "6 July 2021",
      "rate": "9",
      "helpful": "213 out of 227 found this helpful.",
      "title": "Well that was a surprise.",
      "content": "I have to swallow humble pie here, I'm not a fan of Clarkson as a rule, I was told I'd enjoy this, in truth I absolutely loved it, it's a wonderful series.From the very off, it's engaging, informative, and generally rewarding. Clarkson comes across as very intelligent, and very willing, the people on the farm are utterly incredible.I cannot believe how big that farm is, and just how hard the people on it work.Don't be put off because you're not a fan of, or unsure about Clarkson, this is a great watch, 9/10."
    },
    {
      "username": "jcmark-66725",
      "userUrl": "https://www.imdb.com/user/ur106562980",
      "reviewLink": "https://www.imdb.com/review/rw7021758",
      "warningSpoilers": true,
      "date": "12 June 2021",
      "rate": "10",
      "helpful": "435 out of 449 found this helpful.",
      "title": "Jeremy Clarkson points a TV crew at the brilliance of real farmers",
      "content": "Many people are criticizing this show already (see the horrendous Lucy Mangan review in the Guardian), but seem to have either not watched the series or completely misunderstood Jeremy Clarkson's goal. Clarkson is a mostly useless tool on his farm and he makes decisions seemingly guided by blind luck and assumption...which is utterly on brand and perfectly reflects the real challenges of farming.While he spouts a few typical Clarkson-esque utterances that might irk a sensitive viewer, he largely serves the purpose of highlighting an amazing supporting cast of real farmhands and farmers. His efforts in cocking about turn into genuine appreciation and respect. It seems that he set out to make this show hoping to highlight the difficulties of farming, but in actually facing some of the harshest realities in a tragic year for agriculture, Clarkson seems to surprise even himself with how much he learns.I would by no means consider him a true farm manager yet, but his show was an excellent experiment in detailing the real lives of farmers with more natural, entertaining, and heartwarming stories. He has made overly manufactured television in the past (though great entertainment), but instead, creates a show in which the real personalities of everyone involved with running a large farm are showcased.People like Kaleb, Charlie, Gerald, Ellen, and Kevin are the highlights of the series, and rightfully so. Jeremy Clarkson will always have enough charisma to draw viewers, but it's the interactions with his friends and colleagues that kept me watching. In unsurprising fashion, Clarkson spends considerable time lambasting government regulation and restriction, but for once it feels much more like he is at least somewhat voicing the pleas of other farmers in regards to the very real consequences of sustainable agriculture. Anyone who has ever worked a farm will enjoy the schadenfreude of Clarkson's naivety; it brought me back to my time as a kid working my uncle's land. But we can all laugh and empathize with his year in a recognizably arduous and important profession. As a TV presenter of motoring shows I have always found Clarkson to be entertaining, but in \"Clarkson's Farm\" he finds a great group of people during one of the most disastrous year's in recent human history who, together, create a series that presents the watchable realism of a lovely, virgin farmer."
    },
    {
      "username": "scottedwards-87359",
      "userUrl": "https://www.imdb.com/user/ur82936063",
      "reviewLink": "https://www.imdb.com/review/rw7030790",
      "warningSpoilers": false,
      "date": "14 June 2021",
      "rate": "10",
      "helpful": "260 out of 274 found this helpful.",
      "title": "Top quality entertainment",
      "content": "... and very educational too. I would like to do this review in the words of Gerald:Well yer fers bern woi yud dono Mr Clarkson might go fgrann wur driafd fernwoull down yare then sheep woll Minh until wersit daerna eh.Thank you Gerald."
    },
    {
      "username": "ilcool90",
      "userUrl": "https://www.imdb.com/user/ur26652140",
      "reviewLink": "https://www.imdb.com/review/rw7022076",
      "warningSpoilers": false,
      "date": "12 June 2021",
      "rate": "10",
      "helpful": "331 out of 360 found this helpful.",
      "title": "Shows what an actual backbreaking work it is to run a farm",
      "content": "Absolutely love the show. Clarkson's humor is of-course epic. But this show actually shows what utter hard labor it is to produce the food we eat and how much annoying bureaucratic nonsense farmers have to jump through because politicians that know diddly-squat about farming introduced it based on advice from some hippies.And you really can see that Clarkson wasn't just doing shots on camera and then going off and doing nothing, he actually worked his behind off.Respect."
    },
    {
      "username": "djurrepower",
      "userUrl": "https://www.imdb.com/user/ur88270629",
      "reviewLink": "https://www.imdb.com/review/rw7111643",
      "warningSpoilers": false,
      "date": "11 July 2021",
      "rate": "9",
      "helpful": "85 out of 92 found this helpful.",
      "title": "One of the best shows I've seen in a long time",
      "content": "The show stays close to its roots in 'top gear' and 'grand tour'. The humor and overall culture, that difines the feel of top gear, is presented in it's best form. Biggest difference here is that there are far less pranks. Although the humor is still mostly the usual what you would expect from Clarkson. But the show does take itself a little more serious. And I would say it turned out great.Only critism is that the forced 'drama' and provoked overreactions are still present, and tend to be a bit eyerolling from time to time. But these moments aren't common, and the show overall is just really enjoyable. And no episode felt like filler. Each one felt interesting with great pacing and structure.Honestly, if you even remorely like 'top gear' or 'grand tour' this is right up your alley. And if you haven't watched those shows, I would reccomend watching this show first, since it tends to be a bit more serious and grounded.9/10: yes, please more."
    },
    {
      "username": "gd-parry",
      "userUrl": "https://www.imdb.com/user/ur19844120",
      "reviewLink": "https://www.imdb.com/review/rw7026035",
      "warningSpoilers": true,
      "date": "13 June 2021",
      "rate": "9",
      "helpful": "124 out of 130 found this helpful.",
      "title": "Sad to see it over so quick",
      "content": "It's one of those shows - like James May In Japan - that you can just zip through without realising. Seeing so much going on and then it's over.Hoping there's a second season and Kaleb learns to obey the satnav if he should ever venture into London again.This is what reality tv should be - not showcasing the pampered lives of people who are so far removed from reality."
    },
    {
      "username": "gina_gemini",
      "userUrl": "https://www.imdb.com/user/ur97413987",
      "reviewLink": "https://www.imdb.com/review/rw7022840",
      "warningSpoilers": false,
      "date": "12 June 2021",
      "rate": "9",
      "helpful": "57 out of 61 found this helpful.",
      "title": "Classic Clarkson",
      "content": "Great show with that classic type of entertainment this man has gifted the world with for all these years.Thanks to Amazon for giving us an additional dose of Jezza."
    },
    {
      "username": "AbhiSh4ke",
      "userUrl": "https://www.imdb.com/user/ur104026646",
      "reviewLink": "https://www.imdb.com/review/rw7189208",
      "warningSpoilers": false,
      "date": "2 August 2021",
      "rate": "10",
      "helpful": "48 out of 51 found this helpful.",
      "title": "From a farmer's perspective",
      "content": "This show is pure gold and I hope that more seasons follow because I have been continuously laughing like a maniac watching this. The small things the knee injury, the lever, the sheep it's all premium television. Anybody giving this a negative review either has a bias against Clarkson or has no sense of humour at all. Just watch it one hour and you'll be hooked especially if you are a farmer because you literally see yourself in Caleb & Kevin and notice everything. Again this is television GOLD."
    },
    {
      "username": "tzarhusky",
      "userUrl": "https://www.imdb.com/user/ur128567294",
      "reviewLink": "https://www.imdb.com/review/rw7023527",
      "warningSpoilers": false,
      "date": "12 June 2021",
      "rate": "9",
      "helpful": "188 out of 207 found this helpful.",
      "title": "Could of been tedious....",
      "content": "But wasn't.I was afraid that it would just be Jeremy being Jeremy and we'd watch him blundering around for the entire series. After an episode I was afraid I was right.But his learning curb was steep and it turned into a witty but REAL experience. Great supporting on camera crew. Especially Kaleb Cooper. A 20 year old who had never left chippy forging a believable friendship with a 60 year old. Well done everyone involved."
    },
    {
      "username": "horton-78367",
      "userUrl": "https://www.imdb.com/user/ur80711414",
      "reviewLink": "https://www.imdb.com/review/rw7023763",
      "warningSpoilers": false,
      "date": "12 June 2021",
      "rate": "10",
      "helpful": "331 out of 347 found this helpful.",
      "title": "Love him or hate him , this is still pure genius",
      "content": "For some reason Clarkson gets a lot of hate from social media , when in all honesty, the man is quite simply brilliant, thoroughly entertaining series , watched all 8 ep in one sitting , please don't go back to London, we all want a series 2 then 3 and so on until you hand the farm to kaleb and I'll no doubt watch him too 👍"
    },
    {
      "username": "rehmankhilji",
      "userUrl": "https://www.imdb.com/user/ur24755804",
      "reviewLink": "https://www.imdb.com/review/rw7598383",
      "warningSpoilers": false,
      "date": "29 November 2021",
      "rate": "10",
      "helpful": "27 out of 29 found this helpful.",
      "title": "It a must see show",
      "content": "Have remained a fan of Top Gear over the years (idiotic BBC for ending it) and Grand Tour will always remain one of the finest shows ever i have seen.So, here it was Clarkson's Farm on Amazon, made up my mind to watch it but later changed.On my annual and gave it a shot, but boy oh boy, what a magnificent show it was.I actually learned a lot from it. Yes, i know there are arguments that there are many shows on farming, but this one and I actually mean it, is not at all boring.Clarkson's with his goofy stuff and timings is simply brilliant.A must must watch show, if you have any interest in farming, cultivating, animal farming, country side shopping or even you want just a smile at the end of a show, then this surely is one. Believe, you will smile at the end.A must watch."
    },
    {
      "username": "idiocracy_l",
      "userUrl": "https://www.imdb.com/user/ur83642450",
      "reviewLink": "https://www.imdb.com/review/rw7027754",
      "warningSpoilers": false,
      "date": "13 June 2021",
      "rate": "9",
      "helpful": "151 out of 157 found this helpful.",
      "title": "Clarkson did a thing.",
      "content": "I binged this over two days, and i loved it. The best part was that Gerald had no subtitles, no one has a clue what he is saying.In my country we have similar shows, but i really enjoyed watching this. I hope there's going to be a season 2."
    },
    {
      "username": "mcshane365",
      "userUrl": "https://www.imdb.com/user/ur58136087",
      "reviewLink": "https://www.imdb.com/review/rw8873191",
      "warningSpoilers": true,
      "date": "15 February 2023",
      "rate": "10",
      "helpful": "20 out of 20 found this helpful.",
      "title": "King of Chaos 1 - Village idiots 0 (Season 2)",
      "content": "Jeremy Clarkson is a force of nature. Larger than life, (possibly due in part to all that glorious farm food) with the energy of a raging toddler, the optimism of a Ned Flanders, the mouth of a sailor on his fourth case of Hawkstone beer, there appears to be no stopping him. Except there is.I'm pretty sure that anyone whose dealt with a rural local council over anything more difficult than getting missed bins picked up took one look at the face on the presiding council chief and knew the answer to Jeremy's most reasonable request for planning permission was going to be a big fat \"No!\"There are some fantastic people living in the area, many of whom are struggling farmers who deserve every helping hand they can get. But no. Because Jeremy is not considered a 'real farmer' the whole lot can go to the wall with him as far as the council is concerned. Bye bye to the co-opertive they were organising together that could have gone a long way to save them all. A local nameless resident even had a bitter spiteful nasty little lawyer read out a bitter nasty spiteful statement calling Jeremy every bitter spiteful nasty little name in the book. This is small minded Britain at it's worst.Jealousy is a terrible blight on the character & it seems the area Jeremy is trying to make a go of farming is heaving with it. Because he is well known & has the audacity to be wealthy, he has no business calling himself a human being, let alone a farmer. Everything has been done, above & beyond the call of spite, enforcing policies that are applied normally without the draconian penalties of hatred levelled at him.I live rural so I get it. You're either in or you're out & if you're out you might as well live on the moon because you'll never ever be accepted as part of the 'us' that is deemed so spectacularly full of wonderfulness. Sadly for Chadlington Oxfordshire, the public really like Jeremy Clarkson evidenced by their willingness to travel miles to visit his shop. There's little chance there will be any purchases made in that village as they journey thru, or anything more than deliberately driving over the no parking cones lined up like Daleks all along the road to make everyone's life a misery & some rubbish thrown out car windows for good measure on the high street. All I can say is, you asked for it."
    },
    {
      "username": "chunkylefunga",
      "userUrl": "https://www.imdb.com/user/ur8554198",
      "reviewLink": "https://www.imdb.com/review/rw7248432",
      "warningSpoilers": false,
      "date": "19 August 2021",
      "rate": "9",
      "helpful": "38 out of 43 found this helpful.",
      "title": "Curveball that is actually great",
      "content": "First off, they definitely need to make season 2.Geniunely some real belly laughs from this show, I actually had to pause it sometimes as I couldn't control my laughter.Just a great show overall, with every cast member adding something special and it being funny, educational and wholesome.For those not familiar with farming it also does a great job of explaining the ins and outs of farming and showing just how tricky it actually is.Also I love the idea Americans that need subtitles for Geordies trying to understand Gerald :D.Season 2, Jeremy please get a bull :D :D :D."
    },
    {
      "username": "bevshackles",
      "userUrl": "https://www.imdb.com/user/ur132437114",
      "reviewLink": "https://www.imdb.com/review/rw8869065",
      "warningSpoilers": false,
      "date": "13 February 2023",
      "rate": "10",
      "helpful": "20 out of 20 found this helpful.",
      "title": "I could watch this every day of the year",
      "content": "Full confession - I've always detested Jeremy Clarkson and have never watched Top Gear (so no clue why I didn't like him).Then I watched season one and fell in love (NOT just with Jeremy but I think he's a great entertainer. I fell in love with all of them. Kaleb, Gerald, Charlie, Lisa and, of course, Pepper the cow.What a fantastic programme. I love the beauty of the farm and the decency of people involved. I love the explanations of why things happen on farms. I love the way that no matter what happens they just keep trying.Probably I most of all love the way this show highlights the crap that farmers have to go through. Ridiculous pettifogging and childish behaviour by the local Council . They should be hanging their heads in utter shame and embarrassment.Can't wait for season 3."
    },
    {
      "username": "40milesanhour",
      "userUrl": "https://www.imdb.com/user/ur78459688",
      "reviewLink": "https://www.imdb.com/review/rw7019734",
      "warningSpoilers": false,
      "date": "11 June 2021",
      "rate": "10",
      "helpful": "92 out of 103 found this helpful.",
      "title": "Entertaining (Obviously) and Educative",
      "content": "One of my relatives had quite a farm in the old village and he used to invite us there. One time when I've got there, first thing I've thought about that farming is a hard and tiresome work and I'll never be interested. This series have the honour to make me feel interested in farming.Jeremy Clarkson once said in the Grand Tour Seamen episode that he is a big blundering idiot that can't wire a plug. Well you will see him being clumsy or incompetent but he is keen on learning this stuff. It is, I think, both educative and funny."
    },
    {
      "username": "g-89622",
      "userUrl": "https://www.imdb.com/user/ur136304528",
      "reviewLink": "https://www.imdb.com/review/rw7367500",
      "warningSpoilers": true,
      "date": "22 September 2021",
      "rate": "10",
      "helpful": "25 out of 28 found this helpful.",
      "title": "Modern mechanized agriculture is really complicated and profound",
      "content": "Modern mechanized agriculture is really complicated and profound. You have to know not only the crops and animals, but also the rules and regulations, and be able to operate and maintain the machinery, and solve the storage and marketing problems. Uncle Jeremy's bewilderment and helplessness in the face of such a complex undertaking and all sorts of unexpected setbacks is a real schadenfreude.Rich people capricious farming experience and lessons.What a beautiful view of the ranch!"
    },
    {
      "username": "lydiasmith-97633",
      "userUrl": "https://www.imdb.com/user/ur74225032",
      "reviewLink": "https://www.imdb.com/review/rw8871390",
      "warningSpoilers": false,
      "date": "14 February 2023",
      "rate": "10",
      "helpful": "15 out of 15 found this helpful.",
      "title": "Exceptional",
      "content": "I'm sorry but this needs to be a weekly occurrence, it needs 52 episodes a year - even if it had 365 episodes I'd keep up. It's up there with some of my favourite shows! How could anyone want to cancel this show, pure entertainment with an educational aspect. I'd never of been interested in farming before watching this show and I'm so glad they produced something like this to highlight the challenges the industry faces! I hope that the popularity of this show entices producers to keep this in production for many many years to come and that the local council finally opens its eyes to the positive impact this can only bring. Long live Clarkson, King of entertainment."
    },
    {
      "username": "duaghnoelie",
      "userUrl": "https://www.imdb.com/user/ur42341352",
      "reviewLink": "https://www.imdb.com/review/rw8873284",
      "warningSpoilers": false,
      "date": "15 February 2023",
      "rate": "10",
      "helpful": "19 out of 19 found this helpful.",
      "title": "Masterpiece",
      "content": "I didnt like Jeremy Clarkson. I never watched top gear or the grand tour. Was this show scripted and contrived ? Probably. Did it really show how hard farming is even when it's a millionaire backed by Amazon. I think it did. Did it show government interference in farming and how red tape makes it .Even if you disagree with everything I ve said you can still enjoy this very well made show. The characters are so colourful and Clarkson s hilarious self deprecating humour make this show one of the greatest ever. I learned more from this show about farming than I ever did living next door to a farm for at years Brilliant."
    },
    {
      "username": "crumpytv",
      "userUrl": "https://www.imdb.com/user/ur66711472",
      "reviewLink": "https://www.imdb.com/review/rw7162253",
      "warningSpoilers": false,
      "date": "25 July 2021",
      "rate": "10",
      "helpful": "26 out of 30 found this helpful.",
      "title": "Excellent Entertainment.",
      "content": "Very interesting and entertaining.Jeremy seems happy to set himself up for a fall (or fool) at times. I am sure he made faux paus on purpose just for entertainment value.I am very glad to see that there will be a second series and that the same crew will be back.Love him or hate him, you can't ignore him. He seems to have the Midas touch."
    },
    {
      "username": "karena-donald",
      "userUrl": "https://www.imdb.com/user/ur42634488",
      "reviewLink": "https://www.imdb.com/review/rw8867595",
      "warningSpoilers": false,
      "date": "12 February 2023",
      "rate": "10",
      "helpful": "19 out of 20 found this helpful.",
      "title": "An eye opener on the trials of farming nit helped by planners",
      "content": "One of the best shows on tv. It's brilliantly produced. It's funny, it's entertaining and it shows the reality of producing food for the country and the stress in doing so. The shadow cast by planners looms large. Quite how farmers are supposed to diversify when planners and certain mean- minded locals put any barrier in the way is a revelation and the council involved should be held to account here Jeremy leads his merry band trying to do the best for the farm and farming and he should be commended for it The programme raises issues central government should take notice of. Fantastic series x."
    },
    {
      "username": "cmtaylor-10993",
      "userUrl": "https://www.imdb.com/user/ur84132677",
      "reviewLink": "https://www.imdb.com/review/rw7029284",
      "warningSpoilers": false,
      "date": "14 June 2021",
      "rate": "9",
      "helpful": "28 out of 32 found this helpful.",
      "title": "Fantastic",
      "content": "It's been so long since Clarkson's last proper solo project. Yes, I know he's become a game show presenter on ITV but prior to then it's been the best part of 2 decades since his last proper solo show. I loved Speed, Extreme Machines, Meet the Neighbours and even Motorworld from the mid 1990s, simply because ofClarkson's personality and views of the world.However, when I heard that Jeremy's Amazon solo project was going to be a farming show I had really low expectations. How had a petrol head from Doncaster suddenly become farmer?I'm pleased to say though, that Clarkson's Farm is possibly one of the best programmes he has done. It is both hilarious and informative in equal measures at the same time.The humour feels completely natural, possibly down to the fact that it features real people. Jeremy is being himself throughout and not having to hide behind the caricature of himself that has appeared in both Grand Tour and Top Gear over the last 15 years. Here he is not trying to be funny, yet the situations he finds himself in are hilarious.The show basically shows us the challenge of the various aspects of farming, from tractoring, sheeping, opening a farm shop to harvesting. Nothing goes as expected. Clarkson is supported by his right hand man Caleb, his advisors cheerful Charlie and also his girlfriend. There are laugh out loud moments in each episode.Aside from the laughter, viewers will actually learn a lot about farming and will also discover that Jeremy is human after all when it comes to his sheep.Not sure if they will be able to do another series, as he's covered just about everything here and I wouldn't want it to become overly scripted just to provide laughs and entertainment.Highly recommenced."
    },
    {
      "username": "ty-sharpe",
      "userUrl": "https://www.imdb.com/user/ur58288097",
      "reviewLink": "https://www.imdb.com/review/rw7070302",
      "warningSpoilers": false,
      "date": "28 June 2021",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Best of the 3",
      "content": "I have to say out of the 3 separate projects the Grand Tour guys did over the last year. This is the best. If only Hammond and May had been given little jobs around the farm.I hope there will be another season.. absolute gem."
    },
    {
      "username": "alfalb_mansil",
      "userUrl": "https://www.imdb.com/user/ur25795271",
      "reviewLink": "https://www.imdb.com/review/rw8877014",
      "warningSpoilers": true,
      "date": "17 February 2023",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "Best doc series in genre",
      "content": "It well deserves the score givenThat shows the awful that the laws/rules are in the uk and the \"vendetta\" from authorities as well and sometimes they deserve what he did to open a restaurantAnd what people in the town did shows what goes around England mainly unfortunatelyJC is much better in this series and Kaleb is the star of the show And JC deserves 5* after he decides to keep Pepper as a pet cow at the end of the seasonOne of the best doc series seen till todayThis 2sd series is the best and JC already confirmed a 3rd one but Amazon could create more episodes as they have enough material to do thatIf you not saw it give it a try."
    },
    {
      "username": "ngyrjzqmrb",
      "userUrl": "https://www.imdb.com/user/ur133648352",
      "reviewLink": "https://www.imdb.com/review/rw7029925",
      "warningSpoilers": false,
      "date": "14 June 2021",
      "rate": "10",
      "helpful": "334 out of 346 found this helpful.",
      "title": "Pure gold!",
      "content": "I don't know what else to say than pure gold. Clarkson at his best, surrounded by great people. 10/10. Haven't written a review before, but this deserved it.have a great day whoever reads this :)"
    }
  ],
  "errorMessage": ""
}