{
  "imDbId": "tt1266020",
  "title": "Parks and Recreation",
  "fullTitle": "Parks and Recreation (TV Series 2009–2015)",
  "type": "TVSeries",
  "year": "2009",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8575798",
      "warningSpoilers": false,
      "date": "29 September 2022",
      "rate": "10",
      "helpful": "51 out of 55 found this helpful.",
      "title": "One of the best comedies of all-time!",
      "content": "Parks and Recreation is one of the best sitcoms ever made, period. The writing and the chemistry of the cast is just brilliant. It's not just the stars who make this show good either, the supporting cast are all just as funny as the main characters. In what starts as an imitation of The Office evolves into one of the funniest sitcoms in the history of television. It's about as perfect as a comedy can get. I dare you to find something wrong it! I still watch all the reruns when they're on, it's one of those classic sitcoms that you can watch as many times as you want and they're still just as funny after numerous viewings as they were after one."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw7028769",
      "warningSpoilers": false,
      "date": "14 June 2021",
      "rate": "10",
      "helpful": "58 out of 64 found this helpful.",
      "title": "One of the best comedies ever created!",
      "content": "Parks and Recreation is absolutely, without a doubt, one of the best comedies ever created! I never really watched it when it was originally on but heard such great things about it through the years that I thought I'd give it a chance and I was absolutely blown away by how funny it was! The 1st season wasn't as good because the show was still trying to find itself so don't judge it by that, you could actually just skip the entire 1st season, but from then on every season is great. I promise you that you will not regret watching this hilarious show!"
    },
    {
      "username": "SPZMaxinema",
      "userUrl": "https://www.imdb.com/user/ur132395489",
      "reviewLink": "https://www.imdb.com/review/rw8431547",
      "warningSpoilers": false,
      "date": "11 August 2022",
      "rate": "9",
      "helpful": "19 out of 20 found this helpful.",
      "title": "I literally laugh every 5-10 seconds.",
      "content": "The one and only Ron Swanson, Andy, April, and Tom Haverford are all too funny for my gut to handle healthily. Amy Poehler gives a great performance as well, and the timing and sequential set up of all of the humor in this show is fantastic. Equally as funny as the Office imo, can't I love both??"
    },
    {
      "username": "JakeBrinkman",
      "userUrl": "https://www.imdb.com/user/ur39634854",
      "reviewLink": "https://www.imdb.com/review/rw4556589",
      "warningSpoilers": false,
      "date": "2 January 2019",
      "rate": "9",
      "helpful": "66 out of 77 found this helpful.",
      "title": "Hilarious",
      "content": "Note: I have seen all 7 seasons.Before watching this show, I thought The Office was my favorite sitcom. Parks & Rec has now taken that title. After a rougher first season, each of the characters brings several laughs in every episode.If you only want to watch the glory moments, stop watching after season 5. Season 6 and 7 are still funny, but not at the level of the previous seasons."
    },
    {
      "username": "vivianla",
      "userUrl": "https://www.imdb.com/user/ur48427941",
      "reviewLink": "https://www.imdb.com/review/rw8577932",
      "warningSpoilers": true,
      "date": "30 September 2022",
      "rate": "",
      "helpful": "17 out of 18 found this helpful.",
      "title": "Great team dynamic and every episode is hilarious",
      "content": "Leslie is a passionate government worker whose enthusiasm is seen as unique. Mark, a handsome man in the office, is a potential love interest until he ends up leaving for the private sector. Ann, a nurse whose boyfriend fell into the pit, asks the City to fill in the hole. Ann ends up breaking up with Andy after finding out he could've gotten his cast off earlier but chose not to. April is an eccentric intern and ends up crushing on Andy.The team ends up getting closer over the years and we are introduced to Ben and Chris, auditors from the state. Slowly Ben ends up falling for Leslie and after a business trip they hook up.We also get to see the futures of each of the characters in the last episode. This is not done in many shows and it is nice to not have to guess what happened.Leslie and Ben end up both being sought out. They have been asked to run for Governor of Indiana. Ben announces for Leslie that she is running to the team. She smiles at him knowing he sacrificed for her. Leslie ends up giving a speech at the university in the year 2035. She ends up working with people like Biden.Donna has become a successful real estate agent and states she loves her teacher husband but also likes her diamonds.April and Andy are on the fence about kids. April tells Leslie that they were so lucky in that they just had sex one time and had three children at once. Leslie gives wise words saying it is not about making your life perfect but having a good team and wanting to add more team members. They end up having a son named Jack.Ann and Chris have two kids - a girl and a boy. They are Leslie and Oliver.Jerry lives to be 100 years old with many grandchildren and great-grandchildren. At the funeral, Ben comments how good Gayle still looks.Ron's three kids have grown up. One of the girls got into Stanford University. Ron is lost in life and seeks Leslie for advice. She gives him a job taking care of the new park where there is a beautiful lake.Tom ends up going broke and writing a successful book about it."
    },
    {
      "username": "pjgross",
      "userUrl": "https://www.imdb.com/user/ur50155117",
      "reviewLink": "https://www.imdb.com/review/rw5534894",
      "warningSpoilers": false,
      "date": "8 March 2020",
      "rate": "9",
      "helpful": "52 out of 55 found this helpful.",
      "title": "Addictively funny",
      "content": "Once you get into this one you can't stop. So be aware of what you are doing. 125 episodes are ahead. I am at number 27 and still laughing every episode. Although this series is set in a local government scenario, many things are painfully recognizable from other office environments. For lovers of mockumentary-style entertainment this is a must see."
    },
    {
      "username": "deepfrieddodo",
      "userUrl": "https://www.imdb.com/user/ur123203865",
      "reviewLink": "https://www.imdb.com/review/rw7276527",
      "warningSpoilers": false,
      "date": "27 August 2021",
      "rate": "9",
      "helpful": "9 out of 9 found this helpful.",
      "title": "Joyous & Jovial",
      "content": "An absolutely brilliant US sitcom, far exceeding most of it's peers, with zaney humour and lovable characters. Shot in a similar vein to The Office, but with more adventures and less sitting around, across the series each character develops and evolves allowing the audience to get invested in each of their individual arcs.At times laugh-out-loud funny, jokes are split throughout the entire cast instead of having everything lay on a singular character. Although not all the characters are great, they do all play their part in the story and even when actors left the series, the incoming characters replacing them were even better and created better relationships within the world. The cycle and development really gives the show longevity, and failing that the absurd and infuriating public create instant levity.The long-term arc is broken up into smaller plots across seasons and episodes, but everything is interlinked and works out satisfyingly. A less cynical humour to The Office, but well balanced between characters such as Lesley and Ron, Andy and Ben, providing a better environment as a whole.Really easy to watch, always enjoyable, and one of the best US sitcoms rising above a sea of mediocrity."
    },
    {
      "username": "Harry_Pamiaqui",
      "userUrl": "https://www.imdb.com/user/ur67763513",
      "reviewLink": "https://www.imdb.com/review/rw8488398",
      "warningSpoilers": false,
      "date": "26 August 2022",
      "rate": "10",
      "helpful": "20 out of 21 found this helpful.",
      "title": "A brilliant masterpiece.",
      "content": "All cast/characters share the laugh-out-loud funny high-end comedic strange adventures and relationships of a local government office scenario. With one of the best series endings ever seen."
    },
    {
      "username": "bgsmall",
      "userUrl": "https://www.imdb.com/user/ur55269065",
      "reviewLink": "https://www.imdb.com/review/rw8269411",
      "warningSpoilers": false,
      "date": "24 June 2022",
      "rate": "9",
      "helpful": "16 out of 17 found this helpful.",
      "title": "Chuckles abound - light hearted lampooning of local government",
      "content": "Quite appropriate that I should have completed P&R in 2022 on Netflix. I first started watching this circa Jan/Feb 2013 on Channel 5 (UK). I was unemployed at the time and feeling a little low, but P&R was one of a few beacons that lifted the 'fog' (albeit briefly).I think you either get sitcoms or you don't. I certainly do (although my wife doesn't), the well intentioned aims of Lesley, Ron, Ann, April, Gerry, Donna, Tom, Andy, Ben and Chris, but often with disastrous (and hilarious) execution makes for light hearted take on the whims and folly of local government. The subject of P&R is the apparent and overt lampooning of local government in the US, however, I do wonder if the writers weren't trying to make a veiled comment on the necessity of government in redistributing wealth and prosperity (sometimes necessity) via taxation. Yes, if you are looking for heavy duty drama or reportage this is not it. But the glorious endeavours of the crew never failed to bring me a smile. I loved this. Go and watch!"
    },
    {
      "username": "swordsnare",
      "userUrl": "https://www.imdb.com/user/ur37874877",
      "reviewLink": "https://www.imdb.com/review/rw4630483",
      "warningSpoilers": false,
      "date": "6 February 2019",
      "rate": "9",
      "helpful": "30 out of 35 found this helpful.",
      "title": "Please and Thank You.",
      "content": "Recently rewatched the whole series yet again. Still found it as engaging as the first time I watched it. I find the all cast/characters share the limelight at one stage or another in this mockumentary style comedy series. The seventh season doesn't share the same tone as the other seasons, but forgivable nonetheless."
    },
    {
      "username": "fingazmc",
      "userUrl": "https://www.imdb.com/user/ur23635950",
      "reviewLink": "https://www.imdb.com/review/rw8260245",
      "warningSpoilers": false,
      "date": "21 June 2022",
      "rate": "10",
      "helpful": "15 out of 16 found this helpful.",
      "title": "Do you like the American Office?",
      "content": "Then give this a watch.Treat it the same as The Office.The first series (like most American shows) doesn't reflect what the show is going to be like and a lot of people say to skip the first series of both, BUT it's kind of true with them, the second series of PAR and The Office; onwards is brilliant, you'll fall in love with pretty much every character.My only gripe is Rob Lowe, not him as an actor or person, but his character is TOO nice and I don't think people like that exist and with a mockumentary it takes me out of it bit, maybe people like that are in America but not here in England.That's only reason I didn't give this a 9/10 ALTHOUGH eventually he becomes tolerable.Some people prefer this, and some prefer the Office (US) but this is almost as good, so SINCE REVIEWS ARE TO HELP PEOPLE SEE IF THEY WANT TO WATCH..... The conclusion isWATCH IT!Ron Swanson is a legend, I also like pretty dark haired women and breakfast food (actually true).You'll fall in love, you'll get annoyed and you'll keep on watching!Btw April... OMDAYS Aubrey Plaza, perfect character perfect woman!"
    },
    {
      "username": "ethanjjacobs",
      "userUrl": "https://www.imdb.com/user/ur128622875",
      "reviewLink": "https://www.imdb.com/review/rw6982648",
      "warningSpoilers": false,
      "date": "30 May 2021",
      "rate": "9",
      "helpful": "21 out of 23 found this helpful.",
      "title": "One of my favourite sitcoms",
      "content": "I watched this right after I watched the office and didn't expect it to be on the same level. But it's better than the office in some ways. I personally like the office better but parks and rec is so much more consistent, every season was great and the writers knew when to end the show unlike a lot of tv shows, they could've done 3 more seasons that were average but they ended it at the right time. Another great thing about this show is that I like basically every character personally I love April, Andy and Ron but Iike all of them. If you haven't watched this yet you need to it's one of the best sitcoms ever.Season 1 8.0.Season 2 8.7.Season 3 9.0.Season 4 9.1.Season 5 9.0.Season 6 8.8.Season 7 9.1."
    },
    {
      "username": "bartkow",
      "userUrl": "https://www.imdb.com/user/ur9170755",
      "reviewLink": "https://www.imdb.com/review/rw8338706",
      "warningSpoilers": false,
      "date": "16 July 2022",
      "rate": "9",
      "helpful": "18 out of 18 found this helpful.",
      "title": "Always perks me up",
      "content": "There are few shows that have been able to always heighten my mood like Parks and Recreation. It's a feel good show that has well created characters that all have unique personalities. I live this show and I wish there were more seasons to enjoy."
    },
    {
      "username": "kobemackenzie",
      "userUrl": "https://www.imdb.com/user/ur104341979",
      "reviewLink": "https://www.imdb.com/review/rw8354783",
      "warningSpoilers": false,
      "date": "21 July 2022",
      "rate": "10",
      "helpful": "18 out of 20 found this helpful.",
      "title": "The best sitcom!",
      "content": "Parks and Recreation is one of the best sitcom's! The shows characters are a bit tough to like right off the bat but once you watch the show you grow to like all the characters they are all hilarious! And very relatable the show feels very real especially when it comes to the emotion stuff like marriage, having kids, fighting with friends and even getting over bad habits. The show feels so real it makes you connect with the characters! This show also has some of the best character development!Overall this show was one of the best sitcoms I have ever watched!"
    },
    {
      "username": "ismaellavallee",
      "userUrl": "https://www.imdb.com/user/ur31915965",
      "reviewLink": "https://www.imdb.com/review/rw8189576",
      "warningSpoilers": false,
      "date": "30 May 2022",
      "rate": "10",
      "helpful": "12 out of 12 found this helpful.",
      "title": "Brilliant, hilarious every lead so loveable.",
      "content": "In my opinion this is how strong female leads should be written or any lead character should be written, strengths and flaws. Strengths that can sometimes be viewed as flaws from the antagonists but in the end brings them through all their challenges while learning new things and growing.None of the characters are helpless idiots in this, (well... maybe except for Jerry but even then) Leslie sometimes comes to Ron for help, Ron comes to leslie for help. Everyone is helping everyone and Leslie is the glue that keeps them all together with her impeccable integrity and desire to always do the right thing. Even when she tries to do corrupt things, she is too wholesome to go through with it. Even though of her incredibly sweet nature she is still not one to just let people walk all over her. She's aggressive to fight for what she believes in while not compromising on her values to get there.We need more female role models like Leslie Knope instead of all this false angry pseudo feminism.She is by far my favorite sitcom character of all time."
    },
    {
      "username": "cc0077",
      "userUrl": "https://www.imdb.com/user/ur123451286",
      "reviewLink": "https://www.imdb.com/review/rw8411655",
      "warningSpoilers": false,
      "date": "7 August 2022",
      "rate": "10",
      "helpful": "20 out of 23 found this helpful.",
      "title": "Good show to watch when eating",
      "content": "It's a fun and comforting comedy show, all the characters are very likable and it's a good show to have on the background or when I'm eating by myself."
    },
    {
      "username": "fpuwasabadpresident",
      "userUrl": "https://www.imdb.com/user/ur89480358",
      "reviewLink": "https://www.imdb.com/review/rw4217243",
      "warningSpoilers": false,
      "date": "27 June 2018",
      "rate": "8",
      "helpful": "224 out of 243 found this helpful.",
      "title": "Two shows in one.",
      "content": "This show is really two shows. Pre season three and post season three.Before season three the show was like the office, the main character is an idiot doing the best they can but failing. The show has very awkward humor and is really funny.Post season three the show becomes very light hearted and goes for more the comedy the show is known for. It's about a smart capable main character who is a bit weird going against a bad system.The show is really good and it can be very funny but the change is jarring and I know people who only like post season three and people who only like preseason three, I think this is also reflected by some reviews. I recommend the characters are awesome."
    },
    {
      "username": "Imme-van-Gorp",
      "userUrl": "https://www.imdb.com/user/ur76725747",
      "reviewLink": "https://www.imdb.com/review/rw8793722",
      "warningSpoilers": false,
      "date": "11 January 2023",
      "rate": "8",
      "helpful": "8 out of 8 found this helpful.",
      "title": "A documentary-style sit-com with silly yet fun characters.",
      "content": "Season One: 7.5/10Themes: Comedy, Government, Building a Park & Documentary-Style.Review: The format of this show is kind of like a comedic documentary, and I think it works well here. Many of the characters are extremities in their silliness or stereotypes, which means you can't really take them seriously, but they are quite fun to watch. You also have a few more 'normal' characters who aren't very fun on their own, but can create a humorous dynamic with regards to their reponses or interactions with the other characters. Overall, I think this is a funny show with entertaining characters.Top three characters: 1) Leslie Knope, 2) Ron Swanson and 3) Ann Perkins."
    },
    {
      "username": "doomedmac",
      "userUrl": "https://www.imdb.com/user/ur111092901",
      "reviewLink": "https://www.imdb.com/review/rw6815147",
      "warningSpoilers": false,
      "date": "14 April 2021",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Yes",
      "content": "Parks And Rec is a wonderful show. It's funny with characters that are impossible not to lobe. Just watch it."
    },
    {
      "username": "Mr-Fusion",
      "userUrl": "https://www.imdb.com/user/ur1994077",
      "reviewLink": "https://www.imdb.com/review/rw3393525",
      "warningSpoilers": false,
      "date": "12 January 2016",
      "rate": "9",
      "helpful": "14 out of 17 found this helpful.",
      "title": "Quality stuff",
      "content": "As sitcoms go, \"Parks and Recreation\" is certainly on the more refreshing side of things. Incidentally, I was drawn to this show when \"The Office\" took a dive, and I haven't looked back. It's a great staging area for mocking the Midwest (I like living here, but it's deserved), and even still, the producers seem to have an affinity for small-town American . . . so it all evens out in the end.But at its (oversized) heart, this is a show where everybody pulls together to fix a problem - and when that's centered on government, sentimentality or no, that's an angle we should all be able to get behind. It's just so damn optimistic, and that can-do attitude is personified by Amy Poehler. A more likable character (or actress) you'll be hard-pressed to come by.Also, Ron Swanson, who's probably the best sitcom character we've seen in decades.9/10"
    },
    {
      "username": "ilovejesus-52",
      "userUrl": "https://www.imdb.com/user/ur76719757",
      "reviewLink": "https://www.imdb.com/review/rw8346001",
      "warningSpoilers": false,
      "date": "18 July 2022",
      "rate": "8",
      "helpful": "16 out of 16 found this helpful.",
      "title": "Good TV show",
      "content": "Good TV show...shot with a doc-style sitcom, \"Parks and Recreation\" is a show about the lives of the Parks and Rec department in Pawnee, Indiana, specifically Leslie Knope (Amy Poehler) as she strides to make the most out of her position in the department. It's similar to Arrested Development shooting wise. At first glance, it feels like a spin-off to \"The Office\" and it isn't until the premiere of the second season that the show starts to take shape with Poehler being the most lovable character on the show, Ron Swanson (Nick Offerman) becomes everyone's mood and Andy Dwyer (Chris Pratt) well, you can't hate Chris Pratt. While other characters of the show never feel left out or just side-characters as everyone gets their chance to shine during the seven season run. In my opinion,this show has some great running gags and with a rocky start but a perfect ending this show was simply awesome."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2649294",
      "warningSpoilers": false,
      "date": "25 July 2012",
      "rate": "10",
      "helpful": "29 out of 40 found this helpful.",
      "title": "It gets better and better once you get to know the characters.",
      "content": "\"Parks and Recreation\" is set in a horrid little fictional town in Indiana named 'Pawnee'. It is a reality-looking series--much like \"The Office\" where cameras follow people all working for the Parks and Recreation Department and consists of their very strange adventures and relationships.My daughter got me hooked on \"Parks and Recreation\". However, before we began watching the shows together, she warned me that the show starts slowly but once you get to know the characters, it gets a lot better--and boy was she right. Like any good sit-com, this one has wonderful characters that you can't help but like thanks to very good writing and wonderful character development. Well worth seeing and fun."
    },
    {
      "username": "thedottedlion",
      "userUrl": "https://www.imdb.com/user/ur3068432",
      "reviewLink": "https://www.imdb.com/review/rw2197949",
      "warningSpoilers": false,
      "date": "26 January 2010",
      "rate": "10",
      "helpful": "329 out of 387 found this helpful.",
      "title": "Forget the haters",
      "content": "Just watch it for yourself. I was drawn in by Amy Pohler, someone I didn't really like before I saw this show, and i stayed because of the beautifully drawn characters. Because they're deep characters, they're not gonna slam you over the head with comedy. This ain't My Name Is Earl, people. The show's funny, but in a real, get to know everyone kind of way.Even though I loved it, I'd say the first season stumbled a bit, but the second season gets funnier with every episode. Try it out, I bet you'll like one character right off the bat, and if you're like me you'll end up loving them all."
    },
    {
      "username": "malty-185-488337",
      "userUrl": "https://www.imdb.com/user/ur57120108",
      "reviewLink": "https://www.imdb.com/review/rw5709614",
      "warningSpoilers": false,
      "date": "5 May 2020",
      "rate": "10",
      "helpful": "27 out of 33 found this helpful.",
      "title": "Great show in its own right",
      "content": "Comparing it to the office is like comparing Friends to the Big Bang Theory or Two and a half Men to Modern Family . So don't make pointless comparisons and just enjoy Leslie Knope."
    },
    {
      "username": "williamxbones",
      "userUrl": "https://www.imdb.com/user/ur140334657",
      "reviewLink": "https://www.imdb.com/review/rw8307673",
      "warningSpoilers": true,
      "date": "6 July 2022",
      "rate": "",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Perfect characters",
      "content": "This is a clever sitcom, it isn't as funny as other comedy show, it doesn't have as much iconic moments but it is so much deeper in the exploration of relationships, you can think of any characters who interacted with each other and know what they think of each other.The story of each character is decent to great, there is no character with unfinished character arc. The actors are also great, everyone fits greatly their character and everyone is funny.Season 1: 7.5/10 Season 2: 8/10 Season 3: 8.5/10 Season 4: 8.5/10 Season 5: 8/10 Season 6: 8.5/10 Season 7: 9/10."
    }
  ],
  "errorMessage": ""
}