{
  "imDbId": "tt20869502",
  "title": "Extraordinary Attorney Woo",
  "fullTitle": "Extraordinary Attorney Woo (TV Series 2022–2022)",
  "type": "TVSeries",
  "year": "2022",
  "items": [
    {
      "username": "wheatley-20230",
      "userUrl": "https://www.imdb.com/user/ur87946145",
      "reviewLink": "https://www.imdb.com/review/rw8309513",
      "warningSpoilers": false,
      "date": "7 July 2022",
      "rate": "10",
      "helpful": "187 out of 193 found this helpful.",
      "title": "3 episodes in - bursting with delight; all 16 episodes watched - pure joy!",
      "content": "It is very rare for me to review a series before finishing it, but this was so darn delightful that I could not stop myself sharing the good news. After 3 episodes I wrote that if you are not watching this you are missing out. Also that Eun-bin Park is simply wonderful as the autistic attorney at the centre of this drama, coping so movingly with the challenges she faces.Having now watched the whole series my opinion has not changed. This is a joy to watch. All the usual elements of good K drama are here: fine acting, well drawn characters, believable relationships, deft plotting. I could go on: K dramas do so many things well.But the absolute clincher is the performance of Eun-bin Park. She makes us believe in her character's difficulties. But she also makes us believe in her ability to find a path through that does not contradict her autism. You are on her side the whole series through. She managed to convey a character that struggled with emotions but also gave us those emotions. Remarkable. Utterly believable.I am no expert on autism. I have read reviews here from those with experience of the condition both decrying and lauding the accuracy of the portrayal. Perhaps another reviewer got it right when he/she said that the condition is a spectrum, so those with experience can find that it varies considerably."
    },
    {
      "username": "backnblack-06123",
      "userUrl": "https://www.imdb.com/user/ur85220553",
      "reviewLink": "https://www.imdb.com/review/rw8303121",
      "warningSpoilers": false,
      "date": "5 July 2022",
      "rate": "10",
      "helpful": "164 out of 175 found this helpful.",
      "title": "KD hit a home run with this concept",
      "content": "Not sure what's better the Autism theme or the acting by the main lead, she is just so cute and funny in her delivering of this character, we will see how this plays out but so far its fantastic.With 8 episodes in have to say this is the best most enjoyable KD ive seen to date. This makes good KD look average at best.Only two hours left and a lot to sew up this should have a great finish, come on writers dont blow it now.Good new 2nd season announced,If there was ever a KD series that warranted 20 episodes it's this one but we only get 16."
    },
    {
      "username": "taz1004",
      "userUrl": "https://www.imdb.com/user/ur20361520",
      "reviewLink": "https://www.imdb.com/review/rw8879704",
      "warningSpoilers": false,
      "date": "19 February 2023",
      "rate": "8",
      "helpful": "32 out of 32 found this helpful.",
      "title": "Hire better translator Netflix!",
      "content": "Drama itself is excellent. I loved it. But if you watched this subtitled, then you missed at least 30% of the story.Most Koreans wouldn't use English subtitle so they wouldn't know. Most English speaking audience don't understand the audio so they wouldn't know. But I'm Korean-American who lived 25 years in each country. I'm equally fluent in both languages but we turn the subtitle on for our daughter who isn't very good with Korean. And the amount of mistakes I notice is ridiculous. I am 100% certain it was translated by a Korean who never lived in English speaking country.One example is the nickname of Kwon. They translated it to \"Tactician Kwon\". Which is actually a compliment. But the original Korean word used was negative. It should've been \"Plotting Kwon\". Because he always plotting something against someone. There are literally dozens of these wrong translations per episode.Bong Joon-Ho's movies such as Parasite on the other hand are much better. I can tell he spends extra effort making sure translations are perfect. But Netflix Korean shows including Squid Game are horrible.Come on Netflix, there are 1.4 million Korean-Americans who can do better job."
    },
    {
      "username": "mrvino15",
      "userUrl": "https://www.imdb.com/user/ur2089743",
      "reviewLink": "https://www.imdb.com/review/rw8319832",
      "warningSpoilers": true,
      "date": "10 July 2022",
      "rate": "9",
      "helpful": "91 out of 99 found this helpful.",
      "title": "gem of a show <3",
      "content": "It's just a gem of a show. It's refreshing to find THIS in today's cinema world. They did such a great job, Attorney Woo did such a fantastic job.It's just a fun, refreshing perspective. Props to the creator, writer, director, and actors! <3.If it looks interesting to you then give it a shot! It's not for EVERYONE, but it's good for A LOT of us out here.Whether you take the autism acting seriously or not (although, it's very good), there's a lot of heart behind this show and, it shines in both.I don't want to spoil it so I'm not going into a lot of details in this review, I know. I could really go into details, but, not at this point, 4 episodes in. But it's a really good show that I had to review, at least a little bit. :)Edit: Just keeps getting better every episode :)"
    },
    {
      "username": "elroy_geronimo",
      "userUrl": "https://www.imdb.com/user/ur1855493",
      "reviewLink": "https://www.imdb.com/review/rw8337881",
      "warningSpoilers": false,
      "date": "15 July 2022",
      "rate": "10",
      "helpful": "89 out of 95 found this helpful.",
      "title": "Whoop whoop for woo young woo!!",
      "content": "What a fantastic show, a heart-warming tale of a girl that sees the world in a unique way. She is brilliant, quirky and sweet. The legal issues in the first two episodes are puzzles of love presented in intricate stories with memorable characters that remind me of the work of Jean-Pierre Jeunet (Amélie). I'm not a fan of drama let alone Korean drama but this show I loved. Can't wait for the next episodes on Netflix.So in a nutshell; One to watch, you won't be disappointed!"
    },
    {
      "username": "srdikano",
      "userUrl": "https://www.imdb.com/user/ur4487140",
      "reviewLink": "https://www.imdb.com/review/rw8379821",
      "warningSpoilers": false,
      "date": "29 July 2022",
      "rate": "9",
      "helpful": "104 out of 113 found this helpful.",
      "title": "South Korea does it again",
      "content": "Tired of superheroes? South Korean stuff. Bored to death by old and overused tropes? South Korean stuff. Cringing at awful acting? South Korean stuff. Vomited in your own mouth again thanks to a sophomoric script? South Korean stuff.Weird Lawyer Woo Young Woo is the umpteenth example that South Korean TV regularly gets right the myriad things that Hollywood can't or won't do. Treat yourself to this all-around awesome series."
    },
    {
      "username": "gpxdlr",
      "userUrl": "https://www.imdb.com/user/ur50619674",
      "reviewLink": "https://www.imdb.com/review/rw8433800",
      "warningSpoilers": false,
      "date": "12 August 2022",
      "rate": "10",
      "helpful": "55 out of 61 found this helpful.",
      "title": "Most Enjoyable Korean Drama",
      "content": "Eun-bin Park...outstanding actor and her portrayal Attorney Woo is OSCAR worthy. I don't know if Korea has an equivalent but she deserves the award. I try to quickly read the subtitles, catch the actor's facial expression and keep up with the story line. THE BEST Korean series I've seen in a long while. Not to be missed."
    },
    {
      "username": "daisukereds",
      "userUrl": "https://www.imdb.com/user/ur26579233",
      "reviewLink": "https://www.imdb.com/review/rw8460248",
      "warningSpoilers": false,
      "date": "18 August 2022",
      "rate": "8",
      "helpful": "31 out of 34 found this helpful.",
      "title": "\"These stories help me understand you\"",
      "content": "Aside from the high quality production/editing/sound mixing/visuals at all times, excellent delivery (by the entire cast) of well-written and memorable lines, interesting cases/developments/topics, and personalities that you probably won't forget after watching.. This show does something very well : Visibility. Not only do you learn a vulgar amount of Whale and Dolphin facts! But it presents a topic that is covered appropriately with the intent to even educate the viewers (autism, amongst other) with a lot of thought and care put into it.. while maintaining the viewer entranced. Still, the way everyone has a role to play and actually matters (as well as some being very likeable, and in the case of the lead, mesmerizing) is what made the show for me.. setting the bar high for any other production of this type. I specially like that even the \"romance\" is well founded/introduced/formed.Although, I have to say that I enjoyed the first 5 episodes the most. After that, there are some slower moments with expected cliches/tropes that (frankly) the series could have done without. Knowing now that there will be a season 2 also helps, because the ending isn't particularly satisfactory and made the story feel a tad incomplete.. or more appropriately, capable of giving more.Can't give it enough praises.. but it would be a shame not to tell others to give this a chance.Easy recommendation! And now, one of my favorite Korean Dramas to date."
    },
    {
      "username": "alaningle7",
      "userUrl": "https://www.imdb.com/user/ur18338773",
      "reviewLink": "https://www.imdb.com/review/rw8468851",
      "warningSpoilers": false,
      "date": "20 August 2022",
      "rate": "9",
      "helpful": "27 out of 30 found this helpful.",
      "title": "It's valuable and beautiful",
      "content": "Woo Young-Woo played by Park Eun-Bin has a very high I. Q. but she is also on the autism spectrum. Even though she is very smart she struggles to find work and when she is offered a job at a prestigious law firm she is unaware that she is being used. In the series we see how she looks at life and deals with her stresses which highlights the fact that she is different but the same. I think the writers did a superb job of getting the message across but luckily they had an actress in Park Eun-Bin who totally owned the role and perfectly trod the line between entertainment and education. The support cast do a sterling job and overall it is a most enjoyable story. The only reason I did not give it a ten is that even though the writers got the character development right the story development particularly at the end seemed hurried and a little contrived."
    },
    {
      "username": "lacrez",
      "userUrl": "https://www.imdb.com/user/ur118285747",
      "reviewLink": "https://www.imdb.com/review/rw8386998",
      "warningSpoilers": true,
      "date": "31 July 2022",
      "rate": "10",
      "helpful": "47 out of 51 found this helpful.",
      "title": "AMAZING PARK EUN BIN!!!",
      "content": "AMAZING ACTRESS AMAZING CHARACTERS. EVERYTHING ABOUT THIS SERIES JUST AMAZED ME. I FELL IN LOVE WITH HER ROMANCE WITH CO WORKER LEE JUN-OH AND TALKING ABOUT WHALES ARE HILARIOUS. THE CHEMISTRY JUST GIVING ME WHALE BUTTERFLIES 😂"
    },
    {
      "username": "Bibiliography",
      "userUrl": "https://www.imdb.com/user/ur65669029",
      "reviewLink": "https://www.imdb.com/review/rw8368936",
      "warningSpoilers": false,
      "date": "25 July 2022",
      "rate": "10",
      "helpful": "42 out of 48 found this helpful.",
      "title": "Outstanding",
      "content": "The lead actress deserves all the awards. My goodness! This is scripted excellence with a great ensemble cast.It's refreshing to watch a Kdrama that's serious, fun and multidimensional."
    },
    {
      "username": "jesseb-43372",
      "userUrl": "https://www.imdb.com/user/ur127905651",
      "reviewLink": "https://www.imdb.com/review/rw8356710",
      "warningSpoilers": false,
      "date": "21 July 2022",
      "rate": "10",
      "helpful": "74 out of 81 found this helpful.",
      "title": "Amazing beautiful entertaining as all heck",
      "content": "I rate a lot of shows but I can't be bothered writing a review. So it airs twice a week . I just finished episode 8. I love it so much that I'm sad every time an episode ends. It's really this good. Thus I'm compelled to write a review . I love K Dramas nowadays and South Korea has been killing it with wonderful shows. This is again a unique show , story's main character is focused around brilliant Autistic young rookie lawyer . I'm know expert with Autism in general but I'm sold on the character . She's adorable to watch. The cases thus far are entertaining and It's pure joy to watch . So I'll resume episode 9 and 10 next week and sit back and enjoy. A 10 rating might be a bit high, but Its just fantastic all around. So for me , it would be remiss to give it a lesser rating. Highly recommend for everyone!"
    },
    {
      "username": "ronni-12",
      "userUrl": "https://www.imdb.com/user/ur10440834",
      "reviewLink": "https://www.imdb.com/review/rw8310056",
      "warningSpoilers": false,
      "date": "7 July 2022",
      "rate": "10",
      "helpful": "80 out of 86 found this helpful.",
      "title": "Great performance of Eun-bin Park",
      "content": "I have watched the 3 first episodes, and think this serie should be in the top 10 Korean dramas. Eun-bin Park does a good job in reflection on Autism.This serie and the work Eun-bin Park does gives a good reflection on Autism and the challenges people with this diagnosis have.Too many people look down on people with Autism, and thats wrong.I recommend this serie."
    },
    {
      "username": "mjkarlin",
      "userUrl": "https://www.imdb.com/user/ur0261334",
      "reviewLink": "https://www.imdb.com/review/rw8462744",
      "warningSpoilers": false,
      "date": "18 August 2022",
      "rate": "10",
      "helpful": "34 out of 37 found this helpful.",
      "title": "A gem anchored by a faultless Park Eun-bin",
      "content": "This is a simply marvelous series with an astonishing performance by Park Eun-bin. The show began with diminutive ratings in Korea on a minor cable channel but reached stratospheric ratings because of word of mouth and was widely popular on Netflix internationally. It's a gem of a 10 and I say this as someone who tries to combat ratings inflation.Autism has been captured by a number of Korean shows, most notably The Good Doctor (remade in Japan and the United States) and It's Okay to Not Be Okay. In both of these, as in Extraordinary Attorney Woo, the focus is on relatively high-functioning individuals and the writers have to be careful not to minimize the effect of the social awkwardness and lack of awareness that is commonly encountered among autistic individuals. All three shows occasionally stray in this regard, but overall they do extraordinary work in evoking understanding and sympathy without descending into maudlin pity.In Extraordinary Attorney Woo, Park portrays a young woman whose tremendous memory and strong character helps her to have great success at university and law school and to become the first autistic lawyer to pass the notoriously tough Korean bar examination. Despite finishing at the top of her class, she is unable to get a job at any law firm, due to the routine prejudice she encounters. Nevertheless, through the intervention of her father, who was a classmate of the (female) senior partner of a leading firm, she is hired out of the ordinary hiring cycle and begins work on a series of cases that form the basis for ever episode (one story takes place over two episodes). The show also depicts Park's interactions with her colleagues and clients, with opposing counsel, and with judges, all of whom have to adjust to dealing with the extra-normal behaviors of an autistic individual. Some do better than others.The cases that Park and her colleagues must deal with are engaging. They repeatedly show how rarely anything in life is black and white. In one episode, a North Korean defector is accused of robbing a woman who owed her money but the woman's injuries turn out to be much more likely to have been caused by her abusive husband; in another, Park must help a community resist the building of a road that will cut a village in half in the service of a housing development, where the alternatives are either impractical or much more expensive. Perhaps the least realistic is the case where Woo defends a somewhat delusional young man, the son of the founder of one of the notorious cram schools to which even quite young Korean children get sent after school to give them an edge in getting into college and where they have to spend innumerable hours after their regular school, deprived of play time and even food and sleep. The defendant hijacks a bus that is supposed to take the children to school. He announces that that he is the leader of the Children's Liberation Army and takes them to a local nature spot where they are told to have fun and be healthy. But while that case is not very realistic, the issues that are raised are very much on point and must have struck a nerve in Korea; it made for one of the most enjoyable episodes of the show.Generally, while the trials are inevitably compressed as demanded by the format of the show, the writer, Mon Ji-won, has done a pretty good job of showing the kinds of ethical dilemmas so often faced by lawyers where the demands of truth and justice can conflict with their duty to robustly defend and advance their clients' interest. I also liked the often nuanced way the judges in the show ruled on gnarly questions with which they were faced.Before speaking about Park Eun-bin, a word of praise for an absolutely outstanding supporting cast. Much attention has been paid to Park's romantic interest, Lee Joon-ho, played by the dishy and sympathetic Kang Tae-oh, but the breakout performance here is from Joo Hyun-young as Dong Geu-ra-m, playing Park's best friend with comic and joyful freshness. Shout-outs too to the actors playing the lawyers at Hanbada, the law firm where Park works, Kang Ki-young as Jung Myung-seok, Park's mentor, Baek Ji-won as Han Seon-young, the CEO of Hanbada who was so memorable in Be Melodramatic (2019, the gorgeous Ha Yoon-kyung playing Park's classmate Choi Soo-yeon, and Joo Jong-hyuk as Kwon Min-woo, a straitlaced and less than loveable colleague who approaches his unusual colleague with an uncomfortable combination of envy and arrogance. Others, too numerous to mention, contribute recurring roles and cameos that will stay with you.Now to Park's performance: It's just wonderful. Her mannerisms, her slightly unfashionable dress and hairstyle, her off-kilter way of thinking about her cases, her (occasionally hilariously) straightforward way of dealing with others, all work perfectly. She conveys her character with enormous charm and she overcomes the challenges of the role with grace and, judging from her public statements, humility. You just can't take your eyes off her. I would guess that the public will not be satisfied with a single season; I certainly will not and there are, thankfully, reports that a second season will come in 2024."
    },
    {
      "username": "navonco",
      "userUrl": "https://www.imdb.com/user/ur5303209",
      "reviewLink": "https://www.imdb.com/review/rw8339738",
      "warningSpoilers": false,
      "date": "16 July 2022",
      "rate": "10",
      "helpful": "59 out of 65 found this helpful.",
      "title": "Park Eun-bin (Lawyer Woo) nails it!",
      "content": "I have read the books, watched the shows and personally have met and worked with autistic people but I can not say she \"nailed\" the depiction of a person with Asperger's. I can say, howerver, that she nailed it for me and in my opinion it is perfect. She did a exceptionally good job of being a male in King's Affection but in this one she could not be more impressive. Perhaps, she is scripted on how to act but she does it perfect. The show is a relatively solid 8/10 with the same scripts, storyline and great actors but Park Eun-bin genius is what makes this amazing. Again, my opinion but Korean actors are just better overall but she is another level."
    },
    {
      "username": "johntwatterson",
      "userUrl": "https://www.imdb.com/user/ur84486057",
      "reviewLink": "https://www.imdb.com/review/rw8375407",
      "warningSpoilers": false,
      "date": "27 July 2022",
      "rate": "10",
      "helpful": "26 out of 28 found this helpful.",
      "title": "Studio Ghibli in real life",
      "content": "Studio Ghibli in real life! Whomever may know what that means... And if you don't, it means it's a must watch. A heartwarming day-to-day journey about a wonderful Attorney. Which says a lot, because I Loathe attorneys. Simply a beautiful person trying to find her way in society, her loves... And her triumphs. That's all I have to say."
    },
    {
      "username": "jmat40",
      "userUrl": "https://www.imdb.com/user/ur2344716",
      "reviewLink": "https://www.imdb.com/review/rw8403429",
      "warningSpoilers": false,
      "date": "5 August 2022",
      "rate": "10",
      "helpful": "37 out of 43 found this helpful.",
      "title": "Outstanding!",
      "content": "I watched the first episode lastnight and it is outstanding. The actress playing Woo Young-Woo is suberb. I'm very much looking forward to the rest of this series."
    },
    {
      "username": "caseymahnote",
      "userUrl": "https://www.imdb.com/user/ur146341945",
      "reviewLink": "https://www.imdb.com/review/rw8421310",
      "warningSpoilers": false,
      "date": "10 August 2022",
      "rate": "10",
      "helpful": "42 out of 45 found this helpful.",
      "title": "Cheers to KD.",
      "content": "Hollywood can take a lesson or two from KD.If only they can put down the hammer, not use green man, take off their capes, spandex, not wear their underwear outside, not have wings, shoot arrows, wear red amour, then maybe just maybe they can match KD shows.Hollywood has lost touch of any human interest story since that movie about meeting at the top of the Empire State building, not since Tom Hanks looks like an adolescent. The British also lost their edge in human interest story, since Jane Austin era.Back to this show. Needless to say, I thoroughly enjoyed another wonderful KD series. Since Soft Landing, KD shows have skyrocketed with fantastic shows, like It's ok not to be ok, that coffee shop guy, Business proposal, my first something something, sorry I can't remember those titles. I also fall behind on Korean actors names, their movies etc. Their names all sound the same to me, lol, also I can't tell if they are male or female from their names. That's my bad. Not like I can rattle off names of Hollywood stars dating back to Spencer Tracy, Audrey Hepburn, to Tom Hanks, Arnold, etc.My only criticism is that when I was getting all worked up, enjoying a feast, having almost my fill, the show just cuts off. What? Uh? Please say there is a season 2. Imagine you're enjoying your meal, getting your palate all worked up, then the waiter comes and yanks your plate away. What????So many loose ends. So many endings to close.Help. Season Two.... pleeeeeeez....pleeez."
    },
    {
      "username": "xetaprime-64257",
      "userUrl": "https://www.imdb.com/user/ur62543066",
      "reviewLink": "https://www.imdb.com/review/rw8491776",
      "warningSpoilers": false,
      "date": "27 August 2022",
      "rate": "10",
      "helpful": "25 out of 28 found this helpful.",
      "title": "You can tell this was made with LOVE!",
      "content": "I don't give 10s very often if ever. I absolutely loved this show! Wonderful characters! Park Eun Bin as WYW was a joy to watch. You really want to spend time with these people. Even the shady ones. Never quite knew what was going to happen. I'm glad there was a different court drama each episode and loved the beginning set-ups. Classic yes, but done well. Long, Loving, Quiet shots that you don't expect in a series and the result is emotion you won't forget. And I loved the ending of season one. Looks like there is a season two and I'm happy. I only hope they can live up to the beauty and wonder of this incredible first round."
    },
    {
      "username": "bhch-92856",
      "userUrl": "https://www.imdb.com/user/ur123261633",
      "reviewLink": "https://www.imdb.com/review/rw8366299",
      "warningSpoilers": false,
      "date": "24 July 2022",
      "rate": "10",
      "helpful": "43 out of 46 found this helpful.",
      "title": "Best web series",
      "content": "I am from India. I don't know. Korean language, I understood it through subtitles. Decided to watch for few minutes but totally got hooked by one of the best story, acting, direction of series & needed up watch all available episodes.One of the best art i viewed after some time. Acting by all are good but lead character acting is class ahead. I become the fan of Korean films, series. I hope in India they do such series."
    },
    {
      "username": "sadler0104",
      "userUrl": "https://www.imdb.com/user/ur27382558",
      "reviewLink": "https://www.imdb.com/review/rw8357112",
      "warningSpoilers": false,
      "date": "22 July 2022",
      "rate": "10",
      "helpful": "38 out of 40 found this helpful.",
      "title": "Adore this show",
      "content": "Totally captivated by this wonderful show! The lead, Park Eun-bin, is pitch-perfect. You will fall in love with the entire cast as every single actor is worthy of their own stories. I've never had the opportunity to visit South Korea, although I did live in Okinawa for several years. I am enjoying this look into South Korean life with it's marvelous scenery. I'm hoping whoever is responsible for this show is writing more episodes right now!!!"
    },
    {
      "username": "ddk_80",
      "userUrl": "https://www.imdb.com/user/ur35236899",
      "reviewLink": "https://www.imdb.com/review/rw8393162",
      "warningSpoilers": false,
      "date": "2 August 2022",
      "rate": "8",
      "helpful": "48 out of 49 found this helpful.",
      "title": "Fresh!",
      "content": "I walked in to this series completely blind: And . . . It's awesome. It's a very well produced show in general and shines far beyond its fellow K-drama genre.Especially the lead actress, Ms. Park Eun-Bin, demonstrates an incredibly masterful level of acting as an absolutely adorable protagonist that suffers from the spectrum. I simply can't take my eyes off of her every move in this show.What amazes me is the attention to detail to certain vehicles for storytelling (e.g. The protagonist's obsession about whales). Out of all possible subjects for obsessions, it's definitely a really weird one.Without any spoilers, the whole whale thing could easily serve as a mere whimsical scene cutter just to bring out laughs.But as any viewer who've seen this show might have thought once or twice: \"BUT ... seriously, WHY whales?\" Later in the show, we get that answer; and upon discovery, I personally gasped: \"oh wow! THAT's why :) NICE.\"It's very difficult to find something \"engaging\" to watch lately.But this show does a spectacular job in doing so. I will even dare say ... should I say it? Ahh why not : I think it's way better than Squid Game. So much better."
    },
    {
      "username": "dybae",
      "userUrl": "https://www.imdb.com/user/ur125779302",
      "reviewLink": "https://www.imdb.com/review/rw8397098",
      "warningSpoilers": true,
      "date": "3 August 2022",
      "rate": "9",
      "helpful": "17 out of 19 found this helpful.",
      "title": "Thought provoking and well handled",
      "content": "I wrote this review for episode 10 but thought I'd put it on the whole series as this episode epitomises what the series is trying to achieve.I had a few reservations about this show and how it handled some of the more delicate matters of autism. The first was that it might romanticise the condition but it showed a more severe case and noted that autism is on a spectrum so it doesn't shy away from explaining it in full.I thought it was inappropriate for her to have a love interest with someone more advanced emotionally who could take advantage, she doesn't want to even hold hands so would a physical relationship not be right and whether this applies to the 'victim' and Attorney Woo and how their different situations mean what level of relationship they can have. And they handled that well and educated me on it too. Watching episode 10 I was actually waiting to see what the arguments would be. I'm usually someone who has an opinion and awaits to see if what I'm watching is inline but with this I was waiting to learn.I really like that it wasn't black and white in this episode and how I was against the mother at first but then saw her point as the victim became more fragile and even though she was harsh to woo she made some good points.You don't usually expect this level of thought provoking and balance on a law drama even if it is based around autism.It's all very fascinating and I think the point is that there isn't one right answer, certainly not one that applies to autism as a whole but not even to a single particularly person.I think ultimately it was right for the man to go to jail and I guess the difference is between the victims relations and Woo's is that Woo wanted to and initiated the kiss. On the other hand he's literally teaching her how to kiss but not in the same way a teenager learns as that's instinctual. Honestly I'm not sure about Woo's relationship but I still think the show is handling the topic well.It's a great show that handles her condition sensitively and compassionately.It's not preachy and just explains it very naturally. In the west it would have been handled very insensitively if it was done several decades ago or too preachy and black and white if done now. Somehow South Korea even with its cultural issues with mental health have actually managed to nail it better than I've seen anyone else do it.South Korea have come along way in terms of technology and living standards but it seems their emotional intelligence and open mindedness is on on accelerated path too so that they catch up with and overtake western countries handling of mental health in the not too distant future."
    },
    {
      "username": "onze-kris",
      "userUrl": "https://www.imdb.com/user/ur27497915",
      "reviewLink": "https://www.imdb.com/review/rw8378085",
      "warningSpoilers": false,
      "date": "28 July 2022",
      "rate": "",
      "helpful": "11 out of 12 found this helpful.",
      "title": "A little background to one of the most entertaining shows this decade and some thoughts so far.",
      "content": "So the lead declined the part of the extraordinary lawyer Woo Young Woo because she felt she wasn't ready. And filmed another drama.As a result they didn't seek out another actor but decided to wait and ask again.. this time she accepted.She did her homework on what autism is. Met with a bunch of people and found out how she would portray her And I don't know if it because of that some scenes were altered or if it was there allready but the whole script comes across as genuine, kind and thoughtful.I have seen one other series with her that I know of and the lead is almost unrecognizable. So all I can say is give her the highest international possible for her performance. It puts the majority of performances of people with autism to shame.In the first few episodes a big effort is made to make the viewer aware of autism in general . And the preconceptions they still have to face.So far this has been done in a respectful manner and I hope they continue to do so.I am not a big fan of some of the special effects. Like the thundering steps of the younger son of a family and some other stuff.That is why I can't give it a 10. But I will gladly put that aside while watching the stellar performance of the lead. I am in awe of her appearance.She describes a friend / colleague like the spring sun or was it autumn, the episode with nicknames, a similar strong description befits her.Some cases don't have a happy end. And some do.So I like that. While it feels random, maybe it is. At least I felt that the writers tried their best and maybe that is what life is ... random at times.. sometimes you need luck, or an understanding judge.At the moment I am a bit fearful of the mother daughter storyline.. It has yet to unfold, if the writers did an extraordinarily great job I will adjust my ranking to 10. The reason I am fearful is because of how the father reacted to her when she asked about a customers behavior.. This action is defendable but one I am very conflicted with , so I hope this gets further explored later on.If they botch it up I will lower the current 9.. But even if they messed it up I will gladly continue watching this character grow.Goes into top recommendations together with sky castle."
    },
    {
      "username": "Carolinehealth",
      "userUrl": "https://www.imdb.com/user/ur38724607",
      "reviewLink": "https://www.imdb.com/review/rw8342488",
      "warningSpoilers": false,
      "date": "17 July 2022",
      "rate": "10",
      "helpful": "37 out of 38 found this helpful.",
      "title": "Fabulous insight",
      "content": "I absolutely love this story. The episodes are insightful, warm and funny. Autism is presented so honestly and real. The main actress is incredible. I love the character development of those around her.The other women are presented as intelligent and educated and accepted for their credentials."
    }
  ],
  "errorMessage": ""
}