{
  "imDbId": "tt12343534",
  "title": "Jujutsu Kaisen",
  "fullTitle": "Jujutsu Kaisen (TV Series 2020– )",
  "type": "TVSeries",
  "year": "2020",
  "items": [
    {
      "username": "darshan-07180",
      "userUrl": "https://www.imdb.com/user/ur102954887",
      "reviewLink": "https://www.imdb.com/review/rw6346551",
      "warningSpoilers": false,
      "date": "7 December 2020",
      "rate": "10",
      "helpful": "106 out of 119 found this helpful.",
      "title": "Surpassed the manga",
      "content": "I love it when an anime goes out of its way to surpass the manga in terms of quality, making it the definitive way to experience the story. Mangas are such a special form of art (being a combination of multiple paintings) that achieving this is difficult, yet Jujutsu nailed it perfectly. I adore the manga already and this anime totally lived up to and surpassed the hype, just amazing"
    },
    {
      "username": "Achyut_Prashast_Singh",
      "userUrl": "https://www.imdb.com/user/ur46915265",
      "reviewLink": "https://www.imdb.com/review/rw7001995",
      "warningSpoilers": true,
      "date": "5 June 2021",
      "rate": "10",
      "helpful": "30 out of 37 found this helpful.",
      "title": "With Jujutsu Kaisen, MAPPA has struck gold once again.",
      "content": "Months ago, when I had first heard of Jujutsu Kaisen and its \"similarities\" with Bleach, which is one of my all-time favorite anime shows, I was very curious and the subsequently growing hype just added to the excitement. And as I finished it in merely two days, I was left very impressed and entertained to the core. Jujutsu Kaisen is MAPPA's striking new achievement which has set the bar for action anime shows, very high and hard to top.At first, the concept revolving around the talisman sounded very original, unique and seemed like something the whole thing would revolve around. That's where I was slightly surprised, since the show didn't follow it entirely and instead also focused on different characters, meaning the protagonist Yuji Itadori was not allowed to completely dominate the show, which is rare. Rather, his teacher and an absolute fan-favorite Satoru Gojo stole the show with his cool heroic moments, many of which can send a shiver down your spine! For a secondary character, he truly gets to shine a lot, and other characters one can actually expect to great primary treatment, mainly Itadori's friends Nobara and Megumi, too shine when the right time comes.The plot initially moves at a very fast pace, leaving little to no room for characters to grow on you easily. However, that is achieved later on as we get introduced to them again and again through the skillfully drawn, beautifully colored and overall masterfully crafted action scenes. Every fight sequence is executed with intensity and the right usage of music and colors just adds to the brilliance. I was very impressed with the usage of red, blue, white and black, in the last few episodes. MAPPA surely knows how to adapt a manga faithfully and breathe life into the story by using colors adequately and artistically.Plus, while it's also a lot gorier than I imagined, given this is still a shounen, even moments of gore seemed more like abstract art instead of mindless violence, which is a rare feat to achieve. Jujutsu Kaisen has strong characters, both male and female, and are used effectively throughout the 24 episodes. There's some humor too, as expected from any shounen, and it doesn't disappoint. But it's mostly the fight sequences that stand out as the show's biggest highlight. This is a pure action anime, so while some of you might have issues getting into the plot initially given the fast pace and nonstop action, it will slowly cast its spell on you and the effects will be visible in no time. Just make sure to grab some popcorn and beverages (something I unfortunately couldn't) before you sit down to binge this supernatural action thriller. You're in for one wild ride!"
    },
    {
      "username": "GangsterLuffy",
      "userUrl": "https://www.imdb.com/user/ur63295265",
      "reviewLink": "https://www.imdb.com/review/rw6142984",
      "warningSpoilers": false,
      "date": "3 October 2020",
      "rate": "",
      "helpful": "68 out of 84 found this helpful.",
      "title": "Better than expected WOW!",
      "content": "One episode in and I feel like this is going to become a high tier anime . I just cant wait to see how episode 2 is . you will know why by the end of the first episode! trust me watch it its worth it ."
    },
    {
      "username": "kardolph",
      "userUrl": "https://www.imdb.com/user/ur128814966",
      "reviewLink": "https://www.imdb.com/review/rw6560165",
      "warningSpoilers": false,
      "date": "3 February 2021",
      "rate": "9",
      "helpful": "45 out of 56 found this helpful.",
      "title": "A SHONEN FULFILLING EVERY DEPARTMENT. ALMOST.",
      "content": "I don't know how to describe the perfection of this anime. Great Characters, One of the greatest OP and Ending theme. Three reasons to watch this anime. 1. Amazing Plot wid great animation 2. Great music wid great action sequences 3. Gojou Satoru That's it. Just lacking few emotional Strings. Overall, worth watching every single episodes."
    },
    {
      "username": "cyverfrk",
      "userUrl": "https://www.imdb.com/user/ur79294009",
      "reviewLink": "https://www.imdb.com/review/rw6293777",
      "warningSpoilers": false,
      "date": "21 November 2020",
      "rate": "9",
      "helpful": "49 out of 59 found this helpful.",
      "title": "Promising",
      "content": "Promising start and a good story , so far so good ."
    },
    {
      "username": "rookescanor",
      "userUrl": "https://www.imdb.com/user/ur91908124",
      "reviewLink": "https://www.imdb.com/review/rw6209720",
      "warningSpoilers": false,
      "date": "27 October 2020",
      "rate": "8",
      "helpful": "24 out of 31 found this helpful.",
      "title": "A Good Shonen Take-off",
      "content": "Returning back to the Shonen genre, I wasn't disappointed. Jujutsu Kaisen shows potential and good promise from its initial episodes.Hunting spirits/demons/evil things have been part of anime since times old, but that doesn't mean Jujutsu Kaisen is any way boring. Good execution of the story has kept me going through the episodes with eagerness to look forward to what's coming up. Along with instances of amazing action-animation sequences and decent characters, it is notable to appreciate the first opening and ending themes, having a nice taste of funk.A pleasing and interesting start. I'm not surprised this anime is an adaptation of Weekly Shonen Jump. The magazine has often led to manga-adaptations that are worth giving a watch.A good watch for Shonen-enthusiasts. Hasn't been disappointed as of yet. Looking forward to Jujutsu Kaisen during its run."
    },
    {
      "username": "danieldknorr",
      "userUrl": "https://www.imdb.com/user/ur134041197",
      "reviewLink": "https://www.imdb.com/review/rw7072978",
      "warningSpoilers": false,
      "date": "29 June 2021",
      "rate": "4",
      "helpful": "69 out of 94 found this helpful.",
      "title": "It's fine",
      "content": "It's a fine shoe with fine characters placed in a fine plot with fine action. The art is good to great but that's about all that it succeeds in. It's wholely overrated but I did enjoy some points throughout the show. It's nothing original or profound."
    },
    {
      "username": "sarkarsaraj",
      "userUrl": "https://www.imdb.com/user/ur135784748",
      "reviewLink": "https://www.imdb.com/review/rw7295719",
      "warningSpoilers": false,
      "date": "1 September 2021",
      "rate": "6",
      "helpful": "39 out of 51 found this helpful.",
      "title": "Overrated",
      "content": "Only thing I can say is overrated and boring ! Plot is mediocre , animation good , fighting scenes okayish , some characters are boring some are good but not memorable."
    },
    {
      "username": "bakiokeee",
      "userUrl": "https://www.imdb.com/user/ur126980352",
      "reviewLink": "https://www.imdb.com/review/rw7026550",
      "warningSpoilers": false,
      "date": "13 June 2021",
      "rate": "6",
      "helpful": "77 out of 102 found this helpful.",
      "title": "I DON'T GET IT",
      "content": "This Anime is probably the most overrated I know. Maybe it got some good animations and fights but this doesn't make the anime great. The characters are not interesting and the Anime itself is kinda boring. I don't get the hype..."
    },
    {
      "username": "crzyjoseph",
      "userUrl": "https://www.imdb.com/user/ur111088381",
      "reviewLink": "https://www.imdb.com/review/rw6183001",
      "warningSpoilers": false,
      "date": "17 October 2020",
      "rate": "10",
      "helpful": "86 out of 101 found this helpful.",
      "title": "blew my freaking mind",
      "content": "Definitely going to become a hit, like demon slayer or something. 3rd episode was kinda meh but oh my god. first and second were phenomenal. literally so good that this anime compelled me to create my first IMDB review."
    },
    {
      "username": "urboyfarhan",
      "userUrl": "https://www.imdb.com/user/ur120071664",
      "reviewLink": "https://www.imdb.com/review/rw6982435",
      "warningSpoilers": false,
      "date": "30 May 2021",
      "rate": "5",
      "helpful": "72 out of 103 found this helpful.",
      "title": "EEhhhh.......................",
      "content": "I had a lot of expectations for this series. But it dissappointed but not fully. I liked some episodes but i didnt like it much......"
    },
    {
      "username": "kanakchrabha",
      "userUrl": "https://www.imdb.com/user/ur131592950",
      "reviewLink": "https://www.imdb.com/review/rw7886754",
      "warningSpoilers": false,
      "date": "21 February 2022",
      "rate": "5",
      "helpful": "44 out of 52 found this helpful.",
      "title": "Overrated",
      "content": "I will be honest about this I tried my best to like this anime. But i was bored to dead i don't know how it's rated 8.7. When you watch a anime it should connect you with feelings excitement emotions but none of that came. The characters were likable that's all other than that nothing much."
    },
    {
      "username": "xxblayar",
      "userUrl": "https://www.imdb.com/user/ur81206295",
      "reviewLink": "https://www.imdb.com/review/rw6884449",
      "warningSpoilers": false,
      "date": "6 May 2021",
      "rate": "5",
      "helpful": "73 out of 91 found this helpful.",
      "title": "Mediocre",
      "content": "The first 6 episodes were top notch, I enjoyed every second of it, but as the story developed and the shift and forgetting of the main plot to fights between schools and other stuff. It slowly getting boring.There was like 4 or 5 episodes dedicated to the fight between the two schools it felt overwhelming and unnecessary long.Most of the characters are far from \"interesting\" especially Mahito and Jonpei. I want to punch Jonpei the face every time he appears, the most tedious character I have ever seen i genuinely sleep every time he appearsThe writer introduce characters out of nowhere with really impressive powers and he talks about his life but it didn't matter at all, I mean what the point of knowing Kento's past? His was boring as heckThere's is no mystery here, everything is explained right away, the shifting humans could be more vague. Explanations during fights either by the person themselves or somehow the opponent figured it out(with Conan's level analysis)Yuji is hilarious and funny every time I await for him to show up on the screen. The art is amazing and comedy is spot on it didn't feel out of place The fight were really amazing with cool maneuvers and ideasLots and lots of talking, fighting, stop to talk, fighting, stop to talk but with explanation for what happened before and then more fighting but with a cool plot twist>> end fight and it almost it ends with one opponent escaping.Maybe I didn't appreciate the Anime because i did not read the manga?It wasn't a waste of time but at the same time I wouldn't watch it again. I'm sorry."
    },
    {
      "username": "gaikwadtejassantosh",
      "userUrl": "https://www.imdb.com/user/ur132037281",
      "reviewLink": "https://www.imdb.com/review/rw7211424",
      "warningSpoilers": false,
      "date": "9 August 2021",
      "rate": "2",
      "helpful": "57 out of 81 found this helpful.",
      "title": "Overrated boring ehhh",
      "content": "This anime is below average in terms of storyline, and feels Boring while watching,same typical shonen story nothing new, animation is good but that's not the only thing which make anime a good watch, overall boring anime, I dont know why this anime is rated 8.5? Overrated af."
    },
    {
      "username": "WeAreLive",
      "userUrl": "https://www.imdb.com/user/ur79460801",
      "reviewLink": "https://www.imdb.com/review/rw7791847",
      "warningSpoilers": true,
      "date": "23 January 2022",
      "rate": "10",
      "helpful": "13 out of 18 found this helpful.",
      "title": "Amazing",
      "content": "The plot is as follows Yuji Itadori, a kind-hearted teenager, joins his school's Occult Club for fun, but discovers that its members are actual sorcerers who can manipulate the energy between beings for their own use. He hears about a cursed talisman - the finger of Sukuna, a demon - and its being targeted by other cursed beings. Yuji eats the finger to protect his friends, and ends up becoming Sukuna's host. However, Yuji discovers that he has inherited magic and is able to control this power without interference from Sukuna. He joins the Tokyo Metropolitan Magic Technical College to consumes all of Sukuna's fingers, which will enable a full exorcism to take place that will free him.The anime is nothing short of a masterpiece.It has amazing fight scenes. Really good OST also good animation."
    },
    {
      "username": "Good-Movies-To-Watch",
      "userUrl": "https://www.imdb.com/user/ur24954555",
      "reviewLink": "https://www.imdb.com/review/rw6876725",
      "warningSpoilers": false,
      "date": "3 May 2021",
      "rate": "6",
      "helpful": "67 out of 96 found this helpful.",
      "title": "Overrated copy of Naruto",
      "content": "The first few episodes got my interest, but soon the hype evaporated. There is nothing original in this show. They obviously copying Naruto & Bleach. The main character has a monster inside him that grants him powers - just like Naruto. Vessel - Jinchuriki from Naruto. Cursed energy - Chakra from Naruto. Teams of 3 - just like Naruto. Teacher Gojo a carbon copy of Kakashi from Naruto. \"Kyoto Sister School Exchange Event\" - just like \"Chunnin Exams\" in Naruto. It's ridiculous how copy/paste and unoriginal this show is. Most of the characters are generic, forgettable and replaceable. Halfway into the season it get's boring real quick as it's just a rehashed content from other animes."
    },
    {
      "username": "kairosensei",
      "userUrl": "https://www.imdb.com/user/ur127479900",
      "reviewLink": "https://www.imdb.com/review/rw6403308",
      "warningSpoilers": false,
      "date": "26 December 2020",
      "rate": "10",
      "helpful": "15 out of 20 found this helpful.",
      "title": "Anime legendary.",
      "content": "Honestly, I enjoyed this anime, because its story is different from the rest of the anime, but it had a few flaws that made me evaluate it 9 out of 10, but it didnt affect the fun of this anime"
    },
    {
      "username": "NicolasTheWolf",
      "userUrl": "https://www.imdb.com/user/ur102956159",
      "reviewLink": "https://www.imdb.com/review/rw7069164",
      "warningSpoilers": false,
      "date": "27 June 2021",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Breathtaking anime!",
      "content": "What an amazing anime Jujutsu Kaisen is.Studio Mappa with another magnificent job.The animation is awesome, especially the fights look breathtaking.So many great, loveable and fun characters with a very interesting story.Can't wait for the film and hopefully season 2!"
    },
    {
      "username": "Morejambo54",
      "userUrl": "https://www.imdb.com/user/ur112234773",
      "reviewLink": "https://www.imdb.com/review/rw6859846",
      "warningSpoilers": false,
      "date": "28 April 2021",
      "rate": "9",
      "helpful": "16 out of 23 found this helpful.",
      "title": "Really strong action with a gripping plot!",
      "content": "(First time watching)The start of the show is really good, it picks it up straight away while explaining the complications very well so you don't fall behind. Some episodes I did feel jumped ahead a bit randomly but nothing bad. The characters are really good. They are quite likeable and each have there own back stories...besides Itadori, the main character, whose life before really wasn't explored. The other two...em...dark dog boy and hammer girl stole the show for me as they had interesting character arcs with great redemptions throughout the show. The villains were pretty standard, nothing all that negative to say...they are powerful, challenging and cool to look at, but again with lack of character arcs. The plot of the show is pretty good aswell, it has a really strong start and mid section but fades out towards the end with some major pacing issues. The ending was kind of bland in my opinion, I don't really want to watch more, it was pretty random. But the action was cool...all the action in the show is, probably the biggest selling point really. It's fast, fluid and filled with unique spins and ideas of how to fight. The wacky cast of curses also allows an even wider range of moves to can be used by both heroes and villains. To conclude the show is excellent and it does deserve the praise it is getting. I have my opinions as I'm sure everybody else does and I give it a 7/10 gud job!Edit: (second time watching) previously (the first paragraph) was my first review of this which I gave 7/10 but after rewatching it in Japanese( which might have made a difference) I can say that I enjoyed it a lot more. Maybe I wasn't focusing the first time, but the story had so much more meaning...it flows extremely well and has a consistently fast pace which is perfect for this type of show. The show also never runs out of ideas, every villain, every character is unique and has different powers which allows for so,e incredible action scenes. I also found the comedy much funnier this time around, I have no clue why but it was just far better this time! And that's why I movie it form 7/10 to 9/10! Far better the second time!"
    },
    {
      "username": "midhater",
      "userUrl": "https://www.imdb.com/user/ur141382530",
      "reviewLink": "https://www.imdb.com/review/rw7478096",
      "warningSpoilers": false,
      "date": "24 October 2021",
      "rate": "5",
      "helpful": "41 out of 45 found this helpful.",
      "title": "Jujutsu Kaismid",
      "content": "This show wasn't great but I wasn't bad the characters are good but the fight scenes are lack luster Yuji Itadori more like Yuji Itadordeez anyways among us."
    },
    {
      "username": "lanycera",
      "userUrl": "https://www.imdb.com/user/ur76518756",
      "reviewLink": "https://www.imdb.com/review/rw6316459",
      "warningSpoilers": false,
      "date": "28 November 2020",
      "rate": "10",
      "helpful": "25 out of 38 found this helpful.",
      "title": "If it continues like this, in my top 3 list.",
      "content": "On episode 9. So far, I have nothing to criticise: The protagonist is great, and all other characters extremely likeable and interesting. The story so far has been amazing and is well-written. The animation is top-notch, typical mappa!I'd go as far and say it's slightly ahead of kimetsu no yaiba / Demon Slayer and Attack on Titan. I just hope it keeps up with the quality and doesn't decline like other animes did with ongoing seasons.Give it a go, you won't be disappointed!"
    },
    {
      "username": "yogeshnandal-44248",
      "userUrl": "https://www.imdb.com/user/ur105976131",
      "reviewLink": "https://www.imdb.com/review/rw6410815",
      "warningSpoilers": false,
      "date": "27 December 2020",
      "rate": "10",
      "helpful": "15 out of 21 found this helpful.",
      "title": "Easily one of the best anime of 2020 if not the best.",
      "content": "As mentioned on title it is easiest one of the best anime so far if not best. there are some anime which are good too like haikyuu and Aot but in shonen it's started very well worth watching it."
    },
    {
      "username": "schanzaysohail",
      "userUrl": "https://www.imdb.com/user/ur127155319",
      "reviewLink": "https://www.imdb.com/review/rw6447025",
      "warningSpoilers": false,
      "date": "5 January 2021",
      "rate": "10",
      "helpful": "16 out of 23 found this helpful.",
      "title": "Highly Recommended!!! For everyone!!",
      "content": "This is the best anime ive ever watched it my favorite. The animation is flawless and the plot is quite interesting. The plot has suspense but on the other hand it also has a lot of friendship which can make it boring but there are a few adult themes/jokes to make it better. And honestly it just keeps getting better the first few episodes were so good but i feel like the new one are going to be better i binged all the episodes in 1 day and now i wait for January 16th for the episode 14th. I would recommend this anime to almost anyone who's interested in anime as it includes a little bit of everything."
    },
    {
      "username": "kennytheripper",
      "userUrl": "https://www.imdb.com/user/ur127300976",
      "reviewLink": "https://www.imdb.com/review/rw6373581",
      "warningSpoilers": false,
      "date": "17 December 2020",
      "rate": "9",
      "helpful": "40 out of 48 found this helpful.",
      "title": "Exciting As HELL",
      "content": "It's just so exciting. You just need to watch episode 1 to get pumped up over this. I highly recommend you to watch this. Everything is nearly perfect; the plot, characters, action scenes, EVERYTHING. It's not an anime that will make you regret it."
    },
    {
      "username": "mr-altex",
      "userUrl": "https://www.imdb.com/user/ur24181359",
      "reviewLink": "https://www.imdb.com/review/rw6750314",
      "warningSpoilers": false,
      "date": "27 March 2021",
      "rate": "9",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Shounen done right",
      "content": "There's a lot of predictable elements and cliché in the overall story design, but the form is awesome.Characters, including the MC, are well written and occasional drop of motivation and backstory gives them decent depth. Power system has a lot of imagination in it and the tension that any character could die is good for the story telling.MAPPA (the studio) have made great job putting the story into motion."
    }
  ],
  "errorMessage": ""
}