{
  "imDbId": "tt2575988",
  "title": "Silicon Valley",
  "fullTitle": "Silicon Valley (TV Series 2014–2019)",
  "type": "TVSeries",
  "year": "2014",
  "items": [
    {
      "username": "howboutthisone_huh",
      "userUrl": "https://www.imdb.com/user/ur65673698",
      "reviewLink": "https://www.imdb.com/review/rw5664017",
      "warningSpoilers": true,
      "date": "22 April 2020",
      "rate": "9",
      "helpful": "61 out of 64 found this helpful.",
      "title": "eerily funny",
      "content": "Once when I was starting out as a software engineer, I worked for an aerospace company. They paid a lot of money to relocate me to another city but the first day I started, the contract I was supposed to work on was canceled and so they told me to sit at a table outside the software development manager's office until they found another project for me. This was before cellphones, and tablets and laptops and mostly desktop computers. I had nothing to do for a month and when my table was overrun by other engineers in the same predicament I was usually down at the corporate library because that was the only place with a chair and desk I could sit at. I didn't want to make it appear as if I was useless. I mean, I just moved 2000 miles, so instead of bringing in books to read, I sat there for about a month reading the same corporate engineering manual, over and over and over. After about a month I was assigned to a project but things didn't get much better. I found out there was a pecking order to the programmers according to what their workspace looked like. On budget scraping projects, engineers were typically forced to work in a room without enough chairs or desks. I say desks loosely because sometimes they just had tables, sometimes card tables. Every day it was first come, first served. Anyway, the point is that we used to refer to a room full of engineers as a bullpen and the work the engineers produced under those conditions, well, bs. When I finally got a cubicle to work in, it was heaven. Fast forward 10 years and thanks to silicon valley, cubicles became bad and bullpens became good. Some genius figured out how to convince developers to work in a bullpen in order to save money on office furniture. And they figured out that they could pay these people less money if they provided them with free processed food and drinks. Pay them less, and take part of the savings to buy cheap junk food to give them so you can take away any reason they should be away from their desk or work a normal 8 hour day like everyone else and go home. That's the software development world for you, particularly silicon valley. Or, at least the image of silicon valley that everyone tries to reproduce.I heard about this show several years ago but I didn't want to watch it because I figured it would be more bill gates and steve jobs nonsense. There's a disturbingly large segment of the population that think these guys invented computers. I even read a review recently where this nimrod was thanking bill gates for inventing software. In case you're misinformed like this twit, no he didn't. Bill didn't invent software and neither of them invented computers either. Whenever I read stuff about bill&steve, my head wants to explode, so I thought why risk a stroke watching a tv show. I couldn't even make it thru one episode of halt and catch fire, so I figured why waste my time. However, when hbo announced they were streaming the series for free I thought okay, I'll watch one episode.Software development is boring but it has such a diverse group of uniquely disturbing personalities you have to deal with that it can be extremely funny and also maddening and frustrating which is why I like this show because it captures pretty much all of that. I once had a guy ask me in a phone interview for a job if I liked working with people. I thought it was a trick question so I said sure, I believe a team of people working together can always achieve more than the individual. Okay well, there was a long pause on the phone and then this guy said, well, I'm not; I'm not a people person. I didn't get the job.If you're reading this review, you've probably already watched the show so I won't recap what the story is about or describe the characters. All I can add is that the technobbable, absurd plots and twists in each show and the characters are hyperboles of the real world but still pretty spot on to the insanity of tech today. There's a few things I would add but every episode is streamed with amazing references and replications to the world I used to work in. I don't know what the background of the writers is but I would find it hard to believe that this isn't inspired and directed by people in the biz. They've nailed it all and hit on a whole bunch of idiosyncratic pimples and nuances. Like, \"he's a coder\". I don't know if the general public gets it but that's funny. Software developers write code for a living but people who write a lot of code are often looked down on especially if it's in lesser revered languages, like scripting languages. A lot of times the more code you can write in the least amount of time, the more you're looked down upon by other developers. It's like a carpenter who uses too much wood to frame a house. Everybody knows you only need so much wood and so many nails. Anything over that means you're useless.And the episode about 'spaces' vs 'tabs'. That's also spot on. I've seen developers throw sissy fits over style issues and other innane topics. In the c++ world, it's even more extreme. There's two types of c++ programmers. Those that are practical and have a life outside work and those that are purists and think all code should compile without errors and warnings and if it doesn't, your code sucks and you don't know your asterisk from a period. According to them, your code is a ticking time bomb ready to turn that $150 million mars lander into space junk.Anyway, imho, the show is brilliant. If you're not in the biz and don't get all the jokes, it doesn't matter. It's not your fault. You're probably better off anyway. If you're in the biz, there should be something there for everyone. If not, maybe the joke is on you. Think about it."
    },
    {
      "username": "cadillac20",
      "userUrl": "https://www.imdb.com/user/ur2619078",
      "reviewLink": "https://www.imdb.com/review/rw2997426",
      "warningSpoilers": false,
      "date": "13 April 2014",
      "rate": "9",
      "helpful": "134 out of 156 found this helpful.",
      "title": "Hilarious and Scathing",
      "content": "Silicon Valley is a TV show that was much talked about even before it's debut on HBO. With the Silicon Valley now finding a Hollywood-like atmosphere in the way it's viewed, the entertainment industry's focus on Silicon Valley and it's unique lifestyle and culture is somewhat new and has yet to find it's equilibrium of representation between the reality of the innovation happening there and the bizarre, comedy ammunition that lies in some of the more eccentric aspects. Mike Judge's Silicon Valley is a damn good start. It's witty and scathing, and takes an sarcastic approach to it with an outsider's eye. Of course, Mike Judge is no outsider, having worked in Palo Alto during the late 80's, and his disdain for it's people and culture shows.What makes the series work is that Judge is able to focus on all the small, ridiculous things that have become such an icon of the culture. From CEO's innovators with Christ-like followings, to the idea that the industry is somehow spearheaded by college dropouts, Judge wastes not time and has no problem putting every Silicon Valley cliché/reality on a pedestal for people to laugh at. As a native, I can say that the show does exaggerate a lot of things, but it also gets a lot right. If you've seen Judge's other work, then you will quickly see how well this fits in. With Beavis and Butthead, we got a critique about the stupidity and waste of a generation, with King of the Hill, we got a look at Judge's insight into Texas culture and the ideologies of an American culture trying to cope with the changes of a modern world, and here we have a completely new sub-culture that Judges dives head first into.The show most certainly has it's falls, but I was hard pressed to find them as I was too busy laughing most of the time throughout. I may have a skewed view of the show, with me observing this through a filter of the real Silicon Valley, in all it's great and weirdness. But in general, this bites down hard in the most hilarious way on a truly unique and fairly bizarre place in the world. And you don't even have to know the technobabble being spit out. I do think HBO has another winner here."
    },
    {
      "username": "djanimartinov",
      "userUrl": "https://www.imdb.com/user/ur111789490",
      "reviewLink": "https://www.imdb.com/review/rw5723138",
      "warningSpoilers": false,
      "date": "10 May 2020",
      "rate": "8",
      "helpful": "23 out of 23 found this helpful.",
      "title": "Easy watch , addictive and actually wholesome and funny",
      "content": "Deserves about a 8.7 . Really flows well , creates a good sense of accomplishment as the story progresses . Likeable characters , unpredictable funny jokes and moments (which is hard to find now a days ) . I also like that the episodes are 30 minutes , they keep it short enough to not make it too focussed on story yet long enough to not make it feel rushed and over filled with 1 liners. Overall a really easy watch as it doesn't require a lot of focus like other hbo shows , and it flows so easy that it becomes addictive as others have mentioned and has a certain likeablity that brings it together without force ."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw7036922",
      "warningSpoilers": false,
      "date": "17 June 2021",
      "rate": "9",
      "helpful": "27 out of 30 found this helpful.",
      "title": "So much funnier than I thought it would be!",
      "content": "Silicon Valley was so much funnier that I originally thought it would be! I never watched it when it was originally on but recently I thought I'd give it a chance after hearing about how good it was for years. I'm glad I did! It had a perfect cast that made this one of the funnier and more underrated tv shows HBO has ever created. Every episode will keep you laughing as much as the previous ones!"
    },
    {
      "username": "kjproulx",
      "userUrl": "https://www.imdb.com/user/ur23240045",
      "reviewLink": "https://www.imdb.com/review/rw5504290",
      "warningSpoilers": true,
      "date": "23 February 2020",
      "rate": "9",
      "helpful": "24 out of 27 found this helpful.",
      "title": "One of the Best Television Comedies",
      "content": "When it comes to Comedy on television, people seem to flock back to classics like Friends or Seinfeld. Before Netflix took over the industry, HBO held the standard for one of the greatest ways to watch new shows. They have proven time and time again that their content is of the highest value. For the most part, every time I start a new show distributed by HBO, I find myself hooked and eager to see more. Recently concluded, I discovered the show Silicon Valley about a year ago and it rapidly became one of my favourite shows. Here's why, if you haven't had the chance to watch it, you absolutely should.Silicon Valley is pretty much an R-Rated, raunchy version of the film The Social Network. The series follows Richard Hendricks and his group of intelligent friends, as they develop a new company in Pied Piper. With the name of the company being the butt of many jokes itself, this series sets itself up to make you laugh right off the bat. The story does dive deep into the technology world and becomes interesting and frustratingly honest as the series progresses, but if it wasn't for how great this entire cast was, it wouldn't have been as entertaining.Thomas Middleditch as Richard feels very reminiscent of Jesse Eisenberg's iteration of Mark Zuckerberg in The Social Network, which also happens to be one of my favourite films of all time, so it was kind of hard for me to dislike. Kumail Nanjiani, Martin Starr, and Zach Woods all steal the show on multiple occasions, but the highlight of the entire series for me came with the character of Nelson Bighetti (Big Head). Without ruining it for anyone, he is a character who is as dumb as a brick and he knows it, but somehow becomes more successful than anyone else in the series. Everything just kind of falls into his lap and there were times where I was laughing with this character to no end. Silicon Valley features one of my favourite supporting characters of all time in 'Big Head'.There are a few jarring moments when some of the seasons begin and end, simply due to the fact that this show had to deal with some behind-the-scenes drama on multiple occasions. From a main supporting actor in the first season passing away in real life to needing to write T. J. Miller off the show when his character was the reason any of these guys had a place to work in the first place, I was rolling my eyes a couple of times, admittedly. Other than the odd choices they made to work around these elements, this is one of the greatest Comedy-based television shows I've seen in a very long time.In the end, Silicon Valley is a very smart, yet hilarious series that never overstays its welcome. Although still great, you could feel it losing steam somewhere between season four and five, so it felt natural when a sixth season, consisting of just seven episodes, wrapped everything up. This show also has a very surprising finale that I had to applaud them for. With the way this show progresses, I never would've expected it to end the way that it did, but I got a kick out of it and it felt fresh. Overall, aside from a few bumps in the road in terms of production, this is easily one of my favourite shows. Through all its dryness and sarcasm, Silicon Valley is not one to miss. Coming to an end just a few months ago, the full series is now available."
    },
    {
      "username": "peter-laganis",
      "userUrl": "https://www.imdb.com/user/ur16961262",
      "reviewLink": "https://www.imdb.com/review/rw5904559",
      "warningSpoilers": false,
      "date": "13 July 2020",
      "rate": "8",
      "helpful": "17 out of 18 found this helpful.",
      "title": "Considering all the 6 seasons it's a solid 8/10",
      "content": "It could have been a 9 or even a 10, but it lacks of character development and tends to repeat itself. Don't get me wrong. The characters (especially the duo Gilfoyle-Dinesh) are extraordinary and well depicted, but they don't grow along the episodes. They are somehow glued to a repetitive story format. Richard is a magnet for problems and akward situations, Gilfoyle is the clever and cynical genius, Dinesh is Gilfoyle's perfect counterweight, Erlich has some rare lucid moments and becomes annoying by smoking from his pot, Jared is the good samaritan \"having sex\" ... Despite those two negative points, this is an intelligent warm tv-show with a gorgeous and humorous venture of an IT company In conclusion: If you have ever worked for an IT company you will definitely enyoj watching it."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8576290",
      "warningSpoilers": false,
      "date": "29 September 2022",
      "rate": "8",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Hilarious!!",
      "content": "Silicon Valley was so much funnier that I originally thought it would be. I never watched it when it was originally on tv but recently I thought I'd finally give it a chance after hearing about how good it was for years. I'm so glad that I did! I just finished season 4 and can't wait for the final 2 seasons. I have to admit I didn't care for it that much after the first few episodes but stuck with it and it just continued to get better and better and before you know it you're invested in these characters and care what happens to them. It had a perfect cast that made this one of the funnier and more underrated tv shows HBO has ever created. Every episode will keep you laughing as much as the previous ones."
    },
    {
      "username": "OmarHartwellWhite",
      "userUrl": "https://www.imdb.com/user/ur52675736",
      "reviewLink": "https://www.imdb.com/review/rw3015616",
      "warningSpoilers": false,
      "date": "14 May 2014",
      "rate": "8",
      "helpful": "84 out of 103 found this helpful.",
      "title": "Best Comedy CURRENTLY Airing on TV",
      "content": "I was a little skeptical about this show at first and went into with the impression that I would try it but it would lose my interest after an episode or two. This show so far has been a wonderful surprise. Unlike some comedies that create forced, awkward situations that are only funny to the recorded laugh track that plays, I have burst out laughing from a number of scenes that have aired in the few episodes so far. It is very original, smart, has a believable story and characters and has many funny moments with quite a few scenes that will catch you off guard and you will die laughing. At first this was just a show I was DVR'ing then watching at some point during the week maybe a few days later. However the last few episodes have been great and I have been watching live while it airs because it isn't a stupid comedy, it keeps you interested with a pretty good story."
    },
    {
      "username": "bootsyjam",
      "userUrl": "https://www.imdb.com/user/ur32929615",
      "reviewLink": "https://www.imdb.com/review/rw5225788",
      "warningSpoilers": false,
      "date": "31 October 2019",
      "rate": "8",
      "helpful": "18 out of 20 found this helpful.",
      "title": "Fantastic but gets repetitive in Seasons 4 and 5",
      "content": "Truly a one of a kind, with snappy dialogue and great characters charting the pitfalls of start ups in the new tech boom. No one else does it like this.Having said that, I found the bumbling idiocy of the main character Richard to be rather irritating and repetitive by the time Season 4 and 5 came around. The show revolves around the scrapes that he gets them into and it just gets a bit annoying after a while that he keeps making similar mistakes. Ricky Gervais has the right idea that's for sure..."
    },
    {
      "username": "rasultnt2008",
      "userUrl": "https://www.imdb.com/user/ur25746323",
      "reviewLink": "https://www.imdb.com/review/rw2993804",
      "warningSpoilers": false,
      "date": "7 April 2014",
      "rate": "10",
      "helpful": "187 out of 234 found this helpful.",
      "title": "This show is smart",
      "content": "I really don't like other HBO Comedies like Girls and Looking. I heard about this show and I'm a programmer myself so i thought i will give it a chance and I'm not disappointed.The pilot was great and SMART, the lines were great and performances were all terrific.All the characters were kind of cool and i'm looking forward to see them again. The characters are believable and may exist in the real world. I can't wait for next episodes. i recommend it to all of you. Watch it and i don't think you'll be disappointed.VALAR JAVARIS (ALL MEN MUST CODE)"
    },
    {
      "username": "hector-61488",
      "userUrl": "https://www.imdb.com/user/ur160938287",
      "reviewLink": "https://www.imdb.com/review/rw8789824",
      "warningSpoilers": false,
      "date": "9 January 2023",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Stunning.",
      "content": "Silicon Valley is so stupidly well done.. I had no choice but to rate it as high.With the 'King of the hill' writers at the helm, I had a hunch it would be worth watching, but I had no idea I was going to be in awe by good this was to watch.All the characters, all the scenes, all the observations made in society and projected into the series, the inside look into the world of tech and all its faces, all the b2b-talk, the way they make you love and despise some characters at the same time, so much of it is just sublime.A Mike Judge-style cynical comedy with just so many applicable real-life events, at its best. One does not want it to end... but sadly all good songs must."
    },
    {
      "username": "fciocca",
      "userUrl": "https://www.imdb.com/user/ur62460576",
      "reviewLink": "https://www.imdb.com/review/rw5245636",
      "warningSpoilers": false,
      "date": "9 November 2019",
      "rate": "6",
      "helpful": "11 out of 13 found this helpful.",
      "title": "First 1/2 seasons are good and funny, but ends up to be a show with too many episodes",
      "content": "The show starts really good: is funny, refreshing, it jokes about the Silicon Valley reality, by mocking really big personalities in the tech world like Steve Jobs (you can clearly see it on the season 1 poster), or big tech corporate companies such as Google and Amazon. I even liked all the nerdy and absurd situations that happen to this group of guys that are trying to rise in a very competitive market, some moments are hilarious.Character work really good together, especially Gilfoyle and the indian Dinesh, that are always in competition against each other to determine which is the best developer. Zach Woods as Jared will be the key for the company to improve and starting to earn money, even if most of the time is underappreciated.The show is very repetitive, this is the main issue, after 2 seasons jokes are more or less the same, and there is a clear pattern that repeats itself episode after episode. Richard (the CEO of the company) starts with the idea to create a platform. Later on this idea is abandoned to realize a completely different company and this happens many, many times during different seasons. You need to wait until the 5th season to see a more or less stable company with a proper office.Without any doubt, this is a show that got too many seasons, they added useless plots and subplots to create more episodes. I am currently watching the sixth season (that should be the last one luckily), and I do not feel that excitement when a new episode is released, that I used to feel when HBO was airing first seasons."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw6457488",
      "warningSpoilers": false,
      "date": "9 January 2021",
      "rate": "8",
      "helpful": "12 out of 15 found this helpful.",
      "title": "Great comedy that works as a drama too",
      "content": "Working out of a shared house in San Francisco, Richard Hendricks and his team are working on creating revolutionary technology. But first he and his company, Pied Piper, need to navigate the maze of hurdles, back-stabbings and setbacks systemic to technology start-ups, some of which come from competitors but many come from trusted sources.Great TV series. The comedy is fresh, uncompromising and original and often satirises the technology industry. Some great in-jokes and self-deprecating humour.More than just a comedy, the series works as a drama too. The Pied Piper story arc could be many technology start-ups, showing their rise, their issues in getting off the ground, the attempts by established competition to make them fail, the technology problems, the innovative solutions, the breakthrough moments, the ever-present risk of failure.Allied with this, the technology is very believable: the writers hired technology professors and other experts to help advise them on certain aspects of the plot.This all said, the series does lose steam after about three seasons. The jokes become a bit repetitive and stale and the plot feels less original. Still reasonably interesting, but not as good as the earlier stuff.Season ratings: S1 10/10, S2-3 9/10, S4-6: 7/10"
    },
    {
      "username": "imdbmoviereviews",
      "userUrl": "https://www.imdb.com/user/ur97739601",
      "reviewLink": "https://www.imdb.com/review/rw5241564",
      "warningSpoilers": false,
      "date": "7 November 2019",
      "rate": "9",
      "helpful": "5 out of 5 found this helpful.",
      "title": "very very funny very very \"simple\" original and good...",
      "content": "Many sometimes feel intimated from watching series like this that focus on technology and the very very new ideas and.... While right now it's mostly the older amongst us still.... You should know that the series is very very simple to understand even for people coming from no technological background....In short.... I don't have much to say it's good it's funny it's unique it's............ You should watch it.... great simple writing... Minimalist in many ways... And yet with lots of plots twists \"kind of humor\"... u know... with evrything allways changing going right going wrong... you sohlud watch.... as simple as that.... very very well done..."
    },
    {
      "username": "reidkenj",
      "userUrl": "https://www.imdb.com/user/ur71255249",
      "reviewLink": "https://www.imdb.com/review/rw3617913",
      "warningSpoilers": false,
      "date": "12 January 2017",
      "rate": "6",
      "helpful": "52 out of 69 found this helpful.",
      "title": "Potential for so much better",
      "content": "I just LOVE most of the characters. There is so much good stuff going on, but every episode ends the same. Here we go. EPISODE #? - EVERYTHING IS GOING GREAT WITH PIED PIPER. - EPISODE#?, 'after 40 minutes, the company is worth ????? million, and nothing could be better. - Until - 43 minutes, by some strange twist, everything has fallen apart, and the company has gone to the dogs. - AGAIN! How long can this story go on? It is just far to predictable. There are only ever two different scenarios for every episode. - Either the company and everyone is multi, multi millionaires, or they have not got a pot to piddle in."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw5314578",
      "warningSpoilers": false,
      "date": "11 December 2019",
      "rate": "9",
      "helpful": "13 out of 17 found this helpful.",
      "title": "fun with heart",
      "content": "Richard Hendricks (Thomas Middleditch), Nelson 'Big Head' Bighetti (Josh Brener), Bertram Gilfoyle (Martin Starr), and Dinesh Chugtai (Kumail Nanjiani) are poor working programmers struggling to build the next big thing, Piped Pipper. Erlich Bachman (T.J. Miller) is the arrogant homeowner who sees himself as incubator for new programmers with 10% interest. Richard and Big Head's day job is working for Hooli under self-important CEO Gavin Belson (Matt Ross). Monica Hall (Amanda Crew) works for VC Peter Gregory and later awkwardly cold Laurie Bream (Suzanne Cryer). Donald 'Jared' Dunn (Zach Woods) realizes the potential of Piped Pipper and shows it to Gavin Belson.This is a fun show about the new Titans and the new Greek tragedies. These are flawed yet loveable characters. Middleditch portrays Richard's self doubt and insistent vision perfectly. Gilfoyle and Dinesh are a perfect comedy duo. It's a new world and we're only living in it. Other than a minor road bump that is T.J. Miller's personal problem, Mike Judge has created the next Office Space."
    },
    {
      "username": "chintu-10596",
      "userUrl": "https://www.imdb.com/user/ur125007366",
      "reviewLink": "https://www.imdb.com/review/rw6324462",
      "warningSpoilers": false,
      "date": "30 November 2020",
      "rate": "9",
      "helpful": "9 out of 9 found this helpful.",
      "title": "Excellent tv show",
      "content": "One of the tv show which showcases exact scenes from the tech world. Greatly written story about the real life tech world. All the storylines are perfect on how the techies face problems in real life and the issues the tech entrepreneurs would face in the real life. Fine performances by the actors mainly Middleditch. Along with the knowledge content in the story it also equally has nice comedy timing and humour."
    },
    {
      "username": "santacruzlocal",
      "userUrl": "https://www.imdb.com/user/ur8954704",
      "reviewLink": "https://www.imdb.com/review/rw3014239",
      "warningSpoilers": false,
      "date": "11 May 2014",
      "rate": "9",
      "helpful": "251 out of 276 found this helpful.",
      "title": "Worthy of A Review",
      "content": "I have been a member of IMDb for many many years now and am a big movie and TV enthusiast. That said, until now, not once have I felt the need to type up a review. Silicon Valley if possibly the funniest show I have seen, ever. The writing is thoughtful, with perfect comedic timing. The only word to describe the characters is awesome. They all work so well together that the comedy flows effortlessly. I am surprised to see that this show is coming from HBO. I would expect a show like this from Netflix but not HBO. But I must commend them because they hit this one out the park. I look forward to what I hope will be a long lasting series with many more seasons to come. You can see from my profile that I have been a member here for many years and have not ever written a single review, so you can be assured that what I say is true. If you haven't seen Silicon Valley you are missing out. Go check it out!"
    },
    {
      "username": "olsenry-04499",
      "userUrl": "https://www.imdb.com/user/ur103476202",
      "reviewLink": "https://www.imdb.com/review/rw6582095",
      "warningSpoilers": false,
      "date": "10 February 2021",
      "rate": "7",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Such a great series. But definitely repetitive after 4.",
      "content": "For the first 3 seasons I watched the show for the jokes and to see what happened to Pied Piper. But after season 3, I watched for the jokes and I couldn't care less about Pied Piper. This is a series that out lived it's novelty and coasted to a finish on good writing. The show felt different after cutting TJ Miller (which was totally justified). I just felt like the show lost its anchor after TJ was booted from the show. Which again, I totally feel was justified. I loved this series but would I ever watch it again..... Probably not."
    },
    {
      "username": "alexeykorovin",
      "userUrl": "https://www.imdb.com/user/ur10645655",
      "reviewLink": "https://www.imdb.com/review/rw3000231",
      "warningSpoilers": false,
      "date": "18 April 2014",
      "rate": "9",
      "helpful": "48 out of 69 found this helpful.",
      "title": "Hilarious",
      "content": "As a programmer and an app entrepreneur myself I absolutely liked the first 2 episodes so far. I hope this will be a great series overall. Btw I also like other Mike Judge's works: the Beavis & Butthead cartoon series and the Idiocracy movie.I've never been to California and never worked for Google or Apple but I know this western IT culture pretty well, and the series makes good laugh of it. The main character should have taken 10 million :) Now the whole series will be about how he gets trampled over and over by the vultures of capitalism. Should be fun to watch.On a side note, it's great to see movies finally catching up with the new realities of life. Facebook, Twitter, Instagram - these words now play a vital role in lives of the vast share of the world's population, but movie directors have been far from these areas until now. Good work Mike, keep it coming! :)"
    },
    {
      "username": "perica-43151",
      "userUrl": "https://www.imdb.com/user/ur89494061",
      "reviewLink": "https://www.imdb.com/review/rw5422491",
      "warningSpoilers": false,
      "date": "20 January 2020",
      "rate": "7",
      "helpful": "17 out of 24 found this helpful.",
      "title": "Initially great, but quickly becoming repetitive and ending uninspired",
      "content": "This series had great promise and fresh taste initially, but after only a few seasons, lost its inspiration and became repetitive and ultimately quite underwhelming. Still, it is often intelligent and respects its audience, but also becomes routine and often nonsensical. Could not survive the abandonment by T.J. Miller for more that one season, but he abandoned the show because already by the 3rd season, the series started to lose its considerable initial charm. In the end, the series served as an increasingly starving cash cow, and imploded by losing its point, but at least it was relatively quick if ugly death."
    },
    {
      "username": "drm2642",
      "userUrl": "https://www.imdb.com/user/ur43549011",
      "reviewLink": "https://www.imdb.com/review/rw4227173",
      "warningSpoilers": true,
      "date": "5 July 2018",
      "rate": "5",
      "helpful": "15 out of 19 found this helpful.",
      "title": "Even When They Win They Lose",
      "content": "I watched the first 2 seasons of this show and made it a couple episodes into season 3 before I had to stop. I want to start by saying that at times this show is absolutely hilarious. I especially like T.J. Miller, Martin Starr, and Zach Woods. Woods in particular shows his range as he plays such a different character than Gabe (The Office). Gabe was creepy. His character on this show is funny and at times even lovable. \"Did you know you speak German in your sleep?\"That being said, I have some issues with how the writers handle the plot. As my title states, even when the team wins they still find a way to lose. Yes this is a comedy so it's expected that some shenanigans will occur. I also get that Pied Piper can't just become a powerhouse company overnight, but the characters are constantly doing silly things to sabotage themselves. It's obvious these things happen purely for the sake of plot (or in this case to not advance it). I started to really notice this in season 2. The episode \"Adult Content\" demonstrates the problem. Everything is going great for the guys and then the dumb billionaire comes in and sets his giant bottle of tequila down on the delete button. This deletes 3/4 of the content of the porn account that the characters were trying to get a contract for. I don't know much about computer tech/programming, but I find it hard to believe that these guys would have the program open in a manner where pushing the delete button would delete the very content that they were using their program to run. Once again I get it's a comedy, but I can only suspend my disbelief so much.I tried to keep watching, but then when I got to season 3 the same sort of plot shenanigans started happening with the CEO they brought in. Really, you need to completely change Pied Piper because it's too hard to sell? Get better sales people... If the show was episodic this might be a bit more acceptable, but it's not. The plot needs to progress not create situations where the characters are just shooting themselves in the foot again and again. It's like they don't have writers good enough to keep the story going, so instead they don't allow anything to progress."
    },
    {
      "username": "dagqb",
      "userUrl": "https://www.imdb.com/user/ur17023927",
      "reviewLink": "https://www.imdb.com/review/rw6942807",
      "warningSpoilers": false,
      "date": "19 May 2021",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Funniest show of the 2010's",
      "content": "I wish I could watch it all over again for the first time. Very funny, and underrated."
    },
    {
      "username": "greenjackle",
      "userUrl": "https://www.imdb.com/user/ur105212995",
      "reviewLink": "https://www.imdb.com/review/rw8133076",
      "warningSpoilers": false,
      "date": "11 May 2022",
      "rate": "9",
      "helpful": "11 out of 14 found this helpful.",
      "title": "Great show worth watching multiple times.",
      "content": "I watched this as it came out. Then watched it twice more over a span of 6 years. I got bone cancer in 2016 and became permanently disabled. So I do nothing but watch TV and Movies. This show is great except one thing. I use to be a IT Manager, Project Manager, System Admin, Server Engineer Admin, AD Forest Architect, Security Engineer and Security Design Architect. No one will hire a disabled person after applying to over 1,000 jobs come to find out. However I know technology and Richard is the worse. Richard constantly screws up simply things and should only be a CTO or CIO but never a CEO. A Guy like that should never be a CEO. He is super childish and has no life skills. I honestly can't believe that the other people even stay with him. However this show is super funny and worth watching."
    },
    {
      "username": "byanoski",
      "userUrl": "https://www.imdb.com/user/ur11466818",
      "reviewLink": "https://www.imdb.com/review/rw2993938",
      "warningSpoilers": false,
      "date": "7 April 2014",
      "rate": "9",
      "helpful": "56 out of 79 found this helpful.",
      "title": "Great!",
      "content": "Great pilot episode. I love entrepreneurship, silicon valley and that whole tech culture so I was really excited about this show. I was very impressed with it. Lots of laughs, really accurate to the geek world of programmers and the characters are normal. They aren't glorified in any way which I really like.They really mimicked places like Google and other huge tech companies with the world of \"Hooli\" a tech company with a CEO that the whole entire company looks at like a savior, much like the obsessions people have about Larry Page, Elon Musk and Steve Jobs. I'm looking forward to future episodes on this one. I've never been a fan of King of the Hill but Beavis and Butthead was awesome and of course Office Space is brilliant. I think Mike Judge has another hit on his hands for sure."
    }
  ],
  "errorMessage": ""
}