{
  "imDbId": "tt12004706",
  "title": "Panchayat",
  "fullTitle": "Panchayat (TV Series 2020– )",
  "type": "TVSeries",
  "year": "2020",
  "items": [
    {
      "username": "dhxmansarbajna",
      "userUrl": "https://www.imdb.com/user/ur60964597",
      "reviewLink": "https://www.imdb.com/review/rw5613060",
      "warningSpoilers": false,
      "date": "6 April 2020",
      "rate": "8",
      "helpful": "76 out of 77 found this helpful.",
      "title": "Heartfelt, kind and honest, Panchayat marks a turning point for comedy series in India",
      "content": "Set against a rural backdrop, Panchayat narrates the journey and events in the life of an engineering graduate, who for the lack of any better jobs takes up the position of the secretary of the village panchayat chief. What follows is Abhishek's first time encounter with the life, dialogue and people of India's other side that that takes him closer to living life.TVF is known to take alternative stories and push them into mainstream. They did it with Kota Factory and once again they have successfully managed to create a village comedy that is devoid of forced situational comedy or harsh stereotypical jokes. The comedy and light hearted relief exists not merely in the dialogues but the characters themselves and once you start relating with them, their interaction is what drives the show forward. Chandan Roy as Vikas, and Faisal Malik as Prahlad deliver breakthrough performances with their comic timings and innocent approach to the life and troubles of Abhishek played wonderfully once again by the talented Jitendra Kumar.The scenes and stories are wonderfully executed as most of them revolve around insignificant events that become important only when you place them in the setting and the people around them. Apart from the comedy, the story also drives Abhishek's journey from hating the village to slowly loving and accepting the people around him. Obviously, the show will return for a second season given it ends with multiple cliffhanger, but what TVF does best is making a show that remains re-watchable because even more than the script or screenplay, you fall in love with the characters that would stay in your heart long after the end credits roll.I had always considered Indian comedy series to be a lost cause given their need for slapstick humour and no emotional storytelling. However, TVF has once again proved that they can manage to create a story and characters that would re-define Indian television even if it is through streaming services. For anyone who has been having a tough time in 2020 with all that has been going around, nothing can be a better watch than Panchayat to lift your spirits up."
    },
    {
      "username": "SoumikBanerjee1996",
      "userUrl": "https://www.imdb.com/user/ur46919419",
      "reviewLink": "https://www.imdb.com/review/rw8158306",
      "warningSpoilers": false,
      "date": "20 May 2022",
      "rate": "8",
      "helpful": "23 out of 23 found this helpful.",
      "title": "Simplistic yet Graceful",
      "content": "The USP of Panchayat is its simplistic yet graceful direction. Unlike Bollywood's crude and unrealistic generalizations, the rural life of our country and its people are accurately depicted and represented here. Nothing is flamboyant, nor does it need to be, when the Writing has such a robust footing and that many intricated layers of worldbuilding, you don't need to 'showboat'.Take any character of your choosing, Prahlad, Vikas, Pradhan Ji, or even our key protagonist Abhishek; everyone is so unpretentious and grounded. And perhaps due to this exact rootedness and of course with their remarkable performances; all these varied individualities, suddenly become all the more relatable, we can establish a personal connection, and before we even realize it, we start caring for them; that is what a properly materialized character development will give you.So far, there's been two seasons; whilst the first season was pretty much a light-hearted laughter ride, this season is comparatively more mature, more political, and is profoundly emotional as well. Trust me, it will break your heart in the end. Never did I imagine that a show like Panchayat would make me bawl out my eyes like this, clearly exceeding my expectations."
    },
    {
      "username": "rishabh_upadhye",
      "userUrl": "https://www.imdb.com/user/ur81563848",
      "reviewLink": "https://www.imdb.com/review/rw5604643",
      "warningSpoilers": false,
      "date": "3 April 2020",
      "rate": "10",
      "helpful": "87 out of 89 found this helpful.",
      "title": "Kab Tak Dil Jeetego TVF",
      "content": "I've been such a huge fan of their writing and again with Panchayat they've nailed it."
    },
    {
      "username": "shresthadivasdas",
      "userUrl": "https://www.imdb.com/user/ur115863838",
      "reviewLink": "https://www.imdb.com/review/rw5604243",
      "warningSpoilers": false,
      "date": "3 April 2020",
      "rate": "10",
      "helpful": "191 out of 196 found this helpful.",
      "title": "Another gem fron TVF",
      "content": "This is the show that puts a smile on your face as you watch it. You get in love with each and every character of the show. At the end, I felt eight episode were not enough. Will wait for season 2."
    },
    {
      "username": "ketgup83",
      "userUrl": "https://www.imdb.com/user/ur22864666",
      "reviewLink": "https://www.imdb.com/review/rw5609339",
      "warningSpoilers": false,
      "date": "5 April 2020",
      "rate": "9",
      "helpful": "40 out of 43 found this helpful.",
      "title": "Brilliant Performance And Captivating Story Line Will Make You Fall In Love With REAL India",
      "content": "There are two parts of India - Urban India which has kind of adapted to the western culture and Rural India which still follows the tradition, culture and authentic. If you love to watch a village story, Panchayat is the right dose of medicine for you.Panchayat tells the story of an engineer graduate who joins a small village, Phulera, in the Bilai district of Uttar Pradesh as a secretary of a panchayat office and in the process re-discovers the grass root issues in the village like frequent power cuts, unorganized office, dowry, family planning etc. What follows next is the measure taken up by him to improve the quality of life in the village.Created by #TVF (#PermanentRoommates, #TVFPitchers, #KotaFactory), produced by #AmazonPrimeStudio and directed by Deepak Kumar Mishra, Panchayat absorbs you right from the very first episode when Abhishek Tripathi (Jitendra Kumar) joins the offices and begins to observe the life, habits and behavior of the village folks. Panchayat has shades of Shah Rukh Khan starrer Swades where a NRI comes back to India in search of his nanny, identifies the problem and finds the solution. The only difference is that Panchayat focuses on the granular level at the various aspect of a village life.The direction is impressive handling many sequences with perfection. The scene where Abhishek Tripathi finds out the real mystery behind the haunted tree is hilarious, the wedding scene where the groom shows attitude at the Panchayat office, the fight between Abhishek Tripathi and his team with the local boys at the Fakauli market will bring down the house, the chemisstry between Neena Gupta and Raghuvir Yadav is outstanding. Technically, the cinematography capturing the beautiful locales of an Indian village while Art Direction is simple yet powerful. Dialogues are punching while background score goes well with all the 8 episodes.While Panchayat will keep you on your toes, there are few insignificant scenes which I felt hampers the momentum of the web-series, especially towards the end. The web-series also shows that Abhishek Tripathi still never liked the village but had to stay back because of the reason which could have been better. Nevertheless, writing by Chandan Kumar is brilliant which should be lauded while the editing is tight.Performances of Panchayat is the highlight of the web-series. Jithendra Kumar is complete natural as frustrated guy who is transferred from an urban city life to a remote village. However, it is Raghuvir Yadav and Neena Gupta who are just splendid to watch. Chandan Roy as Vikas and Faisal Malik as Prahlad Pandey added more weight to the film.Panchayat, overall , has the right intention with a good social message which should be the top choice for this weekend. Splendid 4/5"
    },
    {
      "username": "amitit-190-558734",
      "userUrl": "https://www.imdb.com/user/ur57215260",
      "reviewLink": "https://www.imdb.com/review/rw5605380",
      "warningSpoilers": false,
      "date": "4 April 2020",
      "rate": "10",
      "helpful": "116 out of 120 found this helpful.",
      "title": "Web series can be created without any vulgarity",
      "content": "The Jitendra is the amitabh bachan of web series...really awesome series and must watch."
    },
    {
      "username": "geeteshrana",
      "userUrl": "https://www.imdb.com/user/ur45276487",
      "reviewLink": "https://www.imdb.com/review/rw5602653",
      "warningSpoilers": false,
      "date": "3 April 2020",
      "rate": "10",
      "helpful": "95 out of 100 found this helpful.",
      "title": "a must watch series because tvf is always the winner",
      "content": "Excellent writing make this series real and authentic ..all actors did splendid job. i higly recommend this series to everyone because every episode is written in a splendid way"
    },
    {
      "username": "rishabh-view",
      "userUrl": "https://www.imdb.com/user/ur27568479",
      "reviewLink": "https://www.imdb.com/review/rw5607320",
      "warningSpoilers": false,
      "date": "4 April 2020",
      "rate": "10",
      "helpful": "97 out of 101 found this helpful.",
      "title": "Kon h... Main Rinky..",
      "content": "I was wondering from the very first episode who's Rinky... And damn...... Well done..."
    },
    {
      "username": "shivanisaraswat-03732",
      "userUrl": "https://www.imdb.com/user/ur115818785",
      "reviewLink": "https://www.imdb.com/review/rw5602452",
      "warningSpoilers": false,
      "date": "3 April 2020",
      "rate": "10",
      "helpful": "107 out of 111 found this helpful.",
      "title": "Brilliant, as expected",
      "content": "Just saw all 8 episodes (+bonus episode) in a go. It was just amazing. All characters did justice to their role; I will be a bit biased for Jeetu Sir. He is awesome in this series as well. New guy Faisal (Vikas) did a phenomenal job as well. The episodes are beautifully executed n brilliantly intertwined.Loved loved loved it. Highly recommend. 10 stars"
    },
    {
      "username": "indianature",
      "userUrl": "https://www.imdb.com/user/ur52214123",
      "reviewLink": "https://www.imdb.com/review/rw8165280",
      "warningSpoilers": false,
      "date": "22 May 2022",
      "rate": "10",
      "helpful": "19 out of 20 found this helpful.",
      "title": "Season 2 leaves the field wide open for S3",
      "content": "Panchayat is a pleasing, non violent, non controversial web series set in the fictional village of Fulera in UP where the village Pradhan is a lady Manju Devi(Neena Gupta) but her husband Dubeyji (Raghuvir Yadav) wields the actual power.The Panchayat is run by a newly appointed young civil servant Secretary.(Jitendra Kumar as Abhishek Tripathi) ably assisted by Vikas (Chandan Roy) and his chacha Prahlad Pandey (Faisal Malik) along with Dubey ji of course! A thought crossed my mind as to why all are surprisingly Brahmins .... They are an amiable cooperative bunch who try to do the best they can within their limitations. Abhishek is desperate to complete his tenure, pass his UPSC exams and get out of the village. Gradually he gets used to the system and becomes good friends with his Panchayat colleagues. Season 1 is mostly matter of fact and non eventful.Season 2 shows the Panchayat gang being much closer friends and Abhishek has more or less settled in at Fulera gaon except that he still intends to pass his exams and move upward and out of the village. Life goes on with the district zamindar MLA imparting tough political lessons to the village admin. No further Spoilers except to say that the last episode of Season 2 is so gut wrenchingly sad even in a larger sense beyond the plot of this series, with an absolutely brilliant performance from the underrated Faisal Malik.Im sure the narrative will continue in Season 3, hope it comes soon."
    },
    {
      "username": "waqassaleem-85201",
      "userUrl": "https://www.imdb.com/user/ur107515161",
      "reviewLink": "https://www.imdb.com/review/rw5752201",
      "warningSpoilers": false,
      "date": "19 May 2020",
      "rate": "10",
      "helpful": "23 out of 25 found this helpful.",
      "title": "Masterpiece",
      "content": "Amazing web series with loads of humor wrapped up in a good story and amazing performances."
    },
    {
      "username": "debdeepsit",
      "userUrl": "https://www.imdb.com/user/ur115912648",
      "reviewLink": "https://www.imdb.com/review/rw5606606",
      "warningSpoilers": false,
      "date": "4 April 2020",
      "rate": "",
      "helpful": "15 out of 15 found this helpful.",
      "title": "Very positive",
      "content": "Its makes you positive..such a great story..fell good.thanks tvf and all the cast"
    },
    {
      "username": "prsdptl",
      "userUrl": "https://www.imdb.com/user/ur100474503",
      "reviewLink": "https://www.imdb.com/review/rw5603084",
      "warningSpoilers": false,
      "date": "3 April 2020",
      "rate": "10",
      "helpful": "110 out of 115 found this helpful.",
      "title": "Will make you feel better.",
      "content": "Nobody understands Indian viewers better than TVF. This very beautiful & light-hearted series brings smiles to your face connecting you to rural India. So insightful, simple and viewer-friendly. People who want to take a break from dark, crime, suspense, thriller, patriotism genres...this one is for you. Right now. The casting couldn't have been more perfect.Jeetu bhaiyya,Raghubir Yadav sir and all the supporting cast.Bravo👍"
    },
    {
      "username": "anshumanatwork",
      "userUrl": "https://www.imdb.com/user/ur102355277",
      "reviewLink": "https://www.imdb.com/review/rw5604319",
      "warningSpoilers": false,
      "date": "3 April 2020",
      "rate": "10",
      "helpful": "135 out of 140 found this helpful.",
      "title": "Simply Awesome",
      "content": "Beautifully made, Almost felt like i was living in that moment. The most appreciating thing is the content is presented with such a grace , and acting is simply awesome, this is perfect example when a good acting skills are mixed with an superb story and mind blowing direction."
    },
    {
      "username": "neetabora",
      "userUrl": "https://www.imdb.com/user/ur82903451",
      "reviewLink": "https://www.imdb.com/review/rw5609584",
      "warningSpoilers": false,
      "date": "5 April 2020",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Super duper cute",
      "content": "I've laughed genuinely in a series after a very long time. What an earthly touch! In love with the music, cinematography & all characters, especially Jeetu & Pradhaan. Waiting for next season like anything. 10/10 definitely."
    },
    {
      "username": "jaisonjohnms",
      "userUrl": "https://www.imdb.com/user/ur115720751",
      "reviewLink": "https://www.imdb.com/review/rw5602294",
      "warningSpoilers": false,
      "date": "3 April 2020",
      "rate": "10",
      "helpful": "46 out of 50 found this helpful.",
      "title": "Absolutely focused and unique",
      "content": "This unique swades prototype is brilliant at every scene. Every frame is made hilariously realistic. Totally real"
    },
    {
      "username": "sumanth-05484",
      "userUrl": "https://www.imdb.com/user/ur77170799",
      "reviewLink": "https://www.imdb.com/review/rw8157026",
      "warningSpoilers": false,
      "date": "19 May 2022",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Waiting for Season 3",
      "content": "Very Good Writing , All the scenes were so Natural.No scenes were exaggerated.All Characters were phenomenon.S02 Last episode Left me In Tears .Emotional Ending .Waiting for Next Season."
    },
    {
      "username": "nikree",
      "userUrl": "https://www.imdb.com/user/ur71182120",
      "reviewLink": "https://www.imdb.com/review/rw7261829",
      "warningSpoilers": false,
      "date": "23 August 2021",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "As good as it gets",
      "content": "So good that it was suggested by my teacher to watch it. Especially if you get stressed, depressed or jammed after studies.A sweet warm story and you'll love every part of it.Oh! I just wish it does get a season 2."
    },
    {
      "username": "suyashtiwari-29319",
      "userUrl": "https://www.imdb.com/user/ur65883908",
      "reviewLink": "https://www.imdb.com/review/rw5603139",
      "warningSpoilers": false,
      "date": "3 April 2020",
      "rate": "10",
      "helpful": "58 out of 62 found this helpful.",
      "title": "TVF did it again!!!",
      "content": "As expected, again brilliant work by TVF. Awasom performance by Jitendra and Raghubir yadav. Very realistic story with nice humour. Highly recommended."
    },
    {
      "username": "debchak-52643",
      "userUrl": "https://www.imdb.com/user/ur116052494",
      "reviewLink": "https://www.imdb.com/review/rw5613365",
      "warningSpoilers": true,
      "date": "6 April 2020",
      "rate": "10",
      "helpful": "16 out of 17 found this helpful.",
      "title": "A DREAM Gram Panchayat in INDIA!",
      "content": "I stood up at the last scene while the Indian National Flag was unfurled and the National Anthem was sung - realized sooner that tears trickled down my cheeks!"
    },
    {
      "username": "bibhangshudas",
      "userUrl": "https://www.imdb.com/user/ur62093831",
      "reviewLink": "https://www.imdb.com/review/rw5603005",
      "warningSpoilers": false,
      "date": "3 April 2020",
      "rate": "10",
      "helpful": "32 out of 35 found this helpful.",
      "title": "TVF did it again. A MASTERPIECE!",
      "content": "The story line, the simplicity of characters, the visualization of everything is just pure gold. Loved every character's..After kota factory, this won't disappoint you..Go for it!"
    },
    {
      "username": "msunando",
      "userUrl": "https://www.imdb.com/user/ur40016938",
      "reviewLink": "https://www.imdb.com/review/rw5639335",
      "warningSpoilers": false,
      "date": "14 April 2020",
      "rate": "8",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Sensitive and sensible portrayal of rural India",
      "content": "Panchayat - Having graduated with ordinary scores, Abhishek Tripathi (Jitendra Kumar) is unable to bag a plum job and has to temporarily settle as the secretary of the panchayat for Phulera (development block Fakauli) in the Balia district of Uttar Pradesh, a dusty, underdeveloped and nondescript village. His closest friend encourages him to grab the opportunity of discovering the \"real\" rural India as it will boost his chances of qualifying for MBA after he clears his CAT exams that he needs to prepare for. Abhishek is crestfallen upon arrival at Phulera, discovering the simplicity of people, lack of facilities and the complete absence of any social life. His daily humdrum existence comprises of waking up at 9:20 a.m., getting to work on matters of no interest to him, cooking his food and studying for CAT. So routine bound is his life that a mere deviation from it results in a theft from the office. Panchayat describes how Abhishek grapples with the idiosyncrasies of his professional life and tries to make the most of his life there.Panchayat is a fun watch although there's no story in it. It's basically a collection of events that Abhishek encounters and his experiences with the people he has to deal with. As such, the pace is deeply slackened and at times, quite uneventful and even boring. Comical it is, without mocking or ridiculing the folks, and this is what gives solid credibility to Panchayat for sensitively and sensibly projecting the village life and its people. Jitendra Kumar is exceptional in his essay of the lead role - his character of an introvert, shy and straightforward young man who won't even speak up to seek the basic benefits for himself is praiseworthy. Raghuvir Yadav handles his role as if it's his second skin. Neena Gupta has a limited role but never fails to impress, whilst Chandan Roy and Faisal Malik are pure fun to watch. Panchayat makes for a great idle time watch if you're not expecting to see anything dramatic."
    },
    {
      "username": "shovonbhattacharjee",
      "userUrl": "https://www.imdb.com/user/ur115774856",
      "reviewLink": "https://www.imdb.com/review/rw5605395",
      "warningSpoilers": false,
      "date": "4 April 2020",
      "rate": "10",
      "helpful": "14 out of 17 found this helpful.",
      "title": "This is Really very much good",
      "content": "This series is full of real India village story.Those who live in city they should must watch it.After KOTA FACTORY, this is the best....."
    },
    {
      "username": "ridi-arahan",
      "userUrl": "https://www.imdb.com/user/ur47816750",
      "reviewLink": "https://www.imdb.com/review/rw5732140",
      "warningSpoilers": false,
      "date": "13 May 2020",
      "rate": "8",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Raghuvir Yadav shines!!",
      "content": "This series works better than any other productions of TVF for many reasons, but primarily because of the presence of Raghuvir Yadav and Jitesh Kumar. The narrative is fresh, worked out screenplay ,beautifully executed which adds to the convincing storytelling. Personally, I loved it more than Kota Factory. I would recommend watching it for sure even if it meant you were to being missing out other series."
    },
    {
      "username": "rekhasharma-98252",
      "userUrl": "https://www.imdb.com/user/ur106227677",
      "reviewLink": "https://www.imdb.com/review/rw5603053",
      "warningSpoilers": false,
      "date": "3 April 2020",
      "rate": "10",
      "helpful": "33 out of 35 found this helpful.",
      "title": "Mast hai 👌👍 loved the village life comedy",
      "content": "The series is really telling village life and The perks in a very comedy way"
    }
  ],
  "errorMessage": ""
}