{
  "imDbId": "tt12004706",
  "title": "Panchayat",
  "fullTitle": "Panchayat (TV Series 2020– )",
  "type": "TVSeries",
  "year": "2020",
  "language": "en",
  "titleInLanguage": "Panchayat (TV series)",
  "url": "https://en.wikipedia.org/wiki/Panchayat_(TV_series)",
  "plotShort": {
    "plainText": "Panchayat is an Indian Hindi-language comedy-drama webseries created by The Viral Fever for the Amazon Prime Video. The series scripted by Chandan Kumar, was directed by Deepak Kumar Mishra, which features Jitendra Kumar, Raghubir Yadav, Neena Gupta, Sanvikaa, Chandan Roy, Durgesh Kumar, Ashok Pathak, Faisal Malik and Sunita Rajwar. It chronicles the life of an engineering graduate who joins as a Panchayat secretary in a remote fictional village Phulera of Uttar Pradesh due to lack of better job options.\r\nThe series was shot in a real panchayat office located in village Mahodiya of district Sehore Madhya Pradesh. Sehore is about 40 kilometers from Bhopal, the capital city of Madhya pradesh. Mahodiya is about 10 kilometers from Sehore district headquarter. The soundtrack and score of the series is composed by Anurag Saikia, whilst cinematography and editing were performed by Amitabh Singh and Amit Kulkarni respectively. This series is Mishra's full-fledged attempt in direction after directing the respective second seasons of Permanent Roommates and Humorously Yours!.\r\nPanchayat was premiered on Amazon Prime Video on 3 April 2020. The series received mostly positive response from critics, with the performances of the leading actors, scripting, direction and major technical aspects were praised, critics also appreciated TVF, its producers to come up with a rural village setting as compared to the previous projects, which is mostly based on the urban atmosphere. At the inaugural ceremony of Filmfare OTT Awards, the series won all the nominations under the Comedy Series category, except for Best Actress. The series was also nominated for Best Original Story, Screenplay, and Dialogues for Chandan Kumar, although it did not receive a win.\r\nThe second season of the series was scheduled to release on 20 May 2022. However, all the episodes were released two days before the actual release date. In this season, Abhishek is seen taking more interest in village politics and developments alongside preparing for CAT exam.\r\nThe series is renewed for season 3.",
    "html": "<p>Panchayat is an Indian Hindi-language comedy-drama webseries created by The Viral Fever for the Amazon Prime Video. The series scripted by Chandan Kumar, was directed by Deepak Kumar Mishra, which features Jitendra Kumar, Raghubir Yadav, Neena Gupta, Sanvikaa, Chandan Roy, Durgesh Kumar, Ashok Pathak, Faisal Malik and Sunita Rajwar. It chronicles the life of an engineering graduate who joins as a Panchayat secretary in a remote fictional village Phulera of Uttar Pradesh due to lack of better job options.</p><p>The series was shot in a real panchayat office located in village Mahodiya of district Sehore Madhya Pradesh. Sehore is about 40 kilometers from Bhopal, the capital city of Madhya pradesh. Mahodiya is about 10 kilometers from Sehore district headquarter. The soundtrack and score of the series is composed by Anurag Saikia, whilst cinematography and editing were performed by Amitabh Singh and Amit Kulkarni respectively. This series is Mishra's full-fledged attempt in direction after directing the respective second seasons of Permanent Roommates and Humorously Yours!.</p><p>Panchayat was premiered on Amazon Prime Video on 3 April 2020. The series received mostly positive response from critics, with the performances of the leading actors, scripting, direction and major technical aspects were praised, critics also appreciated TVF, its producers to come up with a rural village setting as compared to the previous projects, which is mostly based on the urban atmosphere. At the inaugural ceremony of Filmfare OTT Awards, the series won all the nominations under the Comedy Series category, except for Best Actress. The series was also nominated for Best Original Story, Screenplay, and Dialogues for Chandan Kumar, although it did not receive a win.</p><p>The second season of the series was scheduled to release on 20 May 2022. However, all the episodes were released two days before the actual release date. In this season, Abhishek is seen taking more interest in village politics and developments alongside preparing for CAT exam.</p><p>The series is renewed for season 3.</p>"
  },
  "plotFull": {
    "plainText": "Panchayat is an Indian Hindi-language comedy-drama webseries created by The Viral Fever for the Amazon Prime Video. The series scripted by Chandan Kumar, was directed by Deepak Kumar Mishra, which features Jitendra Kumar, Raghubir Yadav, Neena Gupta, Sanvikaa, Chandan Roy, Durgesh Kumar, Ashok Pathak, Faisal Malik and Sunita Rajwar. It chronicles the life of an engineering graduate who joins as a Panchayat secretary in a remote fictional village Phulera of Uttar Pradesh due to lack of better job options.\r\nThe series was shot in a real panchayat office located in village Mahodiya of district Sehore Madhya Pradesh. Sehore is about 40 kilometers from Bhopal, the capital city of Madhya pradesh. Mahodiya is about 10 kilometers from Sehore district headquarter. The soundtrack and score of the series is composed by Anurag Saikia, whilst cinematography and editing were performed by Amitabh Singh and Amit Kulkarni respectively. This series is Mishra's full-fledged attempt in direction after directing the respective second seasons of Permanent Roommates and Humorously Yours!.\r\nPanchayat was premiered on Amazon Prime Video on 3 April 2020. The series received mostly positive response from critics, with the performances of the leading actors, scripting, direction and major technical aspects were praised, critics also appreciated TVF, its producers to come up with a rural village setting as compared to the previous projects, which is mostly based on the urban atmosphere. At the inaugural ceremony of Filmfare OTT Awards, the series won all the nominations under the Comedy Series category, except for Best Actress. The series was also nominated for Best Original Story, Screenplay, and Dialogues for Chandan Kumar, although it did not receive a win.\r\nThe second season of the series was scheduled to release on 20 May 2022. However, all the episodes were released two days before the actual release date. In this season, Abhishek is seen taking more interest in village politics and developments alongside preparing for CAT exam.\r\nThe series is renewed for season 3.\r\nPremise\r\nThe series deals with the experiences of an urban engineering graduate, unfamiliar with village cultures, who on completing his degree gets a low salary position as a secretary of a Gram panchayat in a remote village called Phulera in Uttar Pradesh.\r\nCast and characters\r\nMain\r\nJitendra Kumar as Abhishek Tripathi, Panchayat Secretary\r\nNeena Gupta as Manju Devi Dubey, Pradhan Rinky ‘s mother, Brij’s wife\r\nRaghubir Yadav as Brij Bhushan Dubey, Manju Devi's Husband, Pradhan-Pati Rinky’s father\r\nFaisal Malik as Prahladchand \"Prahlad\" Pandey, Upa-Pradhan\r\nChandan Roy as Vikas, Office Assistant\r\nSanvikaa as Rinki, daughter of Pradhan\r\nRecurring\r\nBiswapati Sarkar as Prateek, Abhishek's friend (season 1)\r\nSatish Ray as Siddharth Gupta aka Siddhu, Abhishek 's Friend (season 2)\r\nSunita Rajwar as Kranti Devi , Bhushan’s wife and Manju Devi’s rival (season 2)\r\nSubendhu Chakraborty as Mangal\r\nShrikant Verma as Parmeshwar\r\nAshok Pathak as Vinod (season 2)\r\nPankaj Jha as MLA Chandra Kishore Singh (season 2)\r\nDiwakar Dhyani as Sudhir Jaiswal BDO ( Season 2)\r\nSushil Tondon as Bhindeshwar\r\nMubarak Khan as Ward Member 1\r\nKamal Rai as Ward Member 2\r\nGovind Lobhani as Ward Member 3\r\nBal Mukund Rai as Ward Member 4\r\nSalim Ansari as Ward Member 5\r\nMohd. Shakir as Ward Member 6\r\nDinesh Tiwari as Ward Member 7\r\nKailash Karoshiya as Ward Member 8\r\nDurgesh Kumar as Bhushan aka Banrakas, Kranti’s husband and Brij and Abhishek’s rival\r\nAanchal Tiwari as Raveena, Parmeshwar's daughter, Rinki's bestfriend\r\nDeepesh Sumitra Jagdish as Photographer\r\nSandeep Shikhar as Deenbandhu\r\nJyoti Dubey as Sushma\r\nRajesh Jais as Virendra Gupta (BDO)\r\nAasif Khan as Ganesh, Bride Groom (season 1)\r\nPrateek Pachauri as Babloo\r\nDipesh Binyani as BDO's Assistant\r\nEbaabdullah Khan as Dabloo\r\nAnkit Motghare as Theka Shopkeeper\r\nUsha Nagar as Deenbandhu's Mother\r\nAditya Sharma as Groom's Father/Ganesh Father\r\nShashie Verma as Master Ji\r\nVishwanath Chatterjee as Sub Inspector\r\nKusum Shastri as District Magistrate\r\nShubham as Goon 1\r\nPrayag Sahu as Goon 2\r\nArvind Bhagwat as DM's Assistant\r\nMaya Gannote as a Female ward member\r\nGaurav Gawai as Goon\r\nChinta Loungre as a Female ward member\r\nEpisodes\r\nSeason 1\r\nSeason 2\r\nProduction\r\nDevelopment\r\nIn late 2019, The Viral Fever signed a deal with the streaming platform Amazon Prime Video to produce a new web television series for their platform, after the success of their previous collaboration Hostel Daze. Sameer Saxena, the creative head of TVF picked Chandan Kumar and Deepak Kumar Mishra to script the show and direct the series. Mishra earlier directed theatre shows and drama in the past, and in his meeting with the founder and then-creative head of TVF, Arunabh Kumar, he expressed his interest in scripting, acting, and direction. Later, he went on directing the respective second season of Permanent Roommates and Humorously Yours. This was his first maiden attempt at directing a full-fledged web series for the media.\r\nMishra drew inspiration from the classic Doordarshan shows Malgudi Days, Potli Baba Ki, Swami and Tenali Rama, and decided to make one of them relatable to the current scenario stating that the kinds of shows are not present in this period. He and Chandan did extensive research and traveled across villages for an idea about the script, which was progressed in 2017, had been delayed due to the research work. Chandan finally drafted the script whose one-line is about an engineering graduate who joins in a low-paid salary job in a remote village, and initially titled as SDO Saheb, before they changed the title to Panchayat.\r\nWe wanted to show realism. Usually, villagers are portrayed as ‘bhole-bhale’ log (simple people), who are ignorant and are shown in a very strange way. People raised fingers saying that our story was slow, takes time to sink in, and without any action, or a leading lady. But my writer and I were clear that we wanted to show a village in 2020 and probably the audience liked that realism. Today's rural youth is watching YouTube on mobile, they make TikTok videos, on ‘khaprail’ (clay-tiled) roofs they have dish antennas, flat-screen TVs are fitted on mud walls...so it's a different world now!— Deepak Kumar Mishra, on the conceptualisation of the show Panchayat in an interview with Hindustan Times\r\nCasting\r\nFor the main character Abhishek Tripathi, Sameer Saxena picked Jitendra Kumar, who opined that his similarities to the character of the protagonist and the regular collaborations with TVF made it possible. His character had strong similarities with that of Mohan Bhargav, portrayed by Shah Rukh Khan in the 2004 film Swades. About the contrast differences Kumar stated that \"The comparisons were inevitable. But I am very happy about it, as I am a huge fan of the film. It left a deep impact on me. I even have a framed poster of the film — the one with SRK sitting in a boat surrounded by local villagers — in my home itself\".\r\nNeena Gupta plays the role of Manju Devi, the village Pradhan, and a homemaker. She initially accepted the script on the basis of the response of TVF's previous projects as well as their collaboration with Raghubir Yadav and Jitendra (in her second collaboration after Shubh Mangal Zyada Saavdhan, in which she played the latter's mother character). Yadav played the role of Brij Bhushan Dubey, husband of Manju Devi, and on the connection with his co-star, he stated \"It was a great experience to work with Neena Gupta. She used to get into the character entirely. With her, it didn't feel we are here for acting\".\r\nYadav's student Chandan Roy played the role of Vikas, the office assistant. He initially confessed that he used to go to auditions every day and one of his friends at the casting bay called him for a small role in the series, which was supposed to be shot in a single day. He initially travelled to Bhopal to shoot for the same series and met one of the assistants in TVF, where the creative team sent a script for Vikas and also got the role, whereas Deepak Kumar Mishra shot the one day portion which was initially offered to Roy.\r\nFilming\r\nThe series was shot in a real panchayat office located at Mahodiya Village, Sehore district in Madhya Pradesh, whereas the script was set in a fictional backdrop in Uttar Pradesh. According to the lead actor Jitendra Kumar, the series was shot in the month of March and April 2019, which wrapped within two months. However he opined as, during the time period, the temperature was extremely hot and was difficult to shoot, further adding that it was a tough time for the crew members who were 150 in number, as many used to stand in the fields holding umbrellas or lights. Raghubir Yadav eventually said about shooting in real locations, stating that \"It turned out to be really well as the aesthetics and the vivid hues of the village life can be clearly seen in the show.\"\r\nIn an interview with Hindustan Times, Jitendra stated \"My initial understanding of a panchayat was a big tree with five PANCH or sarpanch and other people sitting in its shade. They are usually fighting over a land dispute and come up with a solution right there. But actually, Panchayat is like an office and every panchayat follows a process. The show talks about the problems of villagers which appear to be very funny for us.\"\r\nSoundtrack\r\nSeason 1\r\nAnurag Saikia composed the soundtrack and background score for Panchayat. The background score and songs include the use of acoustic guitars, pianica, accordion, and the kora, despite the setting in rural India. Saikia initially noted that \"The creative producer Abhijeet Singh Parmar wanted \"anything but the usual music. So we initially tried symphony, then rock, even jazz. The music for episode one took a month or two to be locked in. Once that was in place, we decided to keep the music acoustic and minimalist\".\r\nHe initially added that the biggest challenge for him is to feature an ambient sort of music, with a bit of rock. However, the score featured only acoustic instruments. Saikia, in an interview with Scroll.in opined that \"When an entire score for a scene got chucked, I had to bring the musicians back to the studio, and they often played for the same scene thrice a week. This happened with the theme that is used to introduce the village pradhan's husband.\"\r\nOne of the songs in the series Hiya Tho, received positively by the audience for producing a soulful tune with gibberish lyrics. The word \"Hiya\", stands for heart in Assamese. Due to his early exposure to Assamese and Western classical music, Anurag Saikia stated that \"the song is inspired by the chants we have grown up hearing in monasteries in the North East\". He recruited fellow Assamese singer Shankuraj Konwar for vocal duties since he would understand the song's Assamese roots.\r\nThe original soundtrack album for the series was unveiled on 10 April 2020, followed by the original score on 1 May 2020. The soundtrack features five songs plus a theme music, all has been performed and written by Saikia, whereas Vivek Hariharan, Raghav Chaitanya, Vinnie Hutton, Shankuraj Konwar sang the vocals. The background score which released as a separate album format features sixteen tracks\r\nRelease\r\nSeason 1\r\nAmazon Prime Video announced the release of eight new Indian originals in January 2020, with Panchayat being one of them. The official trailer of Panchayat was released on 29 March 2020. The eight-episode series premiered on 3 April 2020. In May 2020, the makers released the Tamil and Telugu dubbed versions of the series after fans request.\r\nSeason 2\r\nOn 28 April 2022, the second season was announced after the completion of the production. On 2 May 2022, it was announced that the second season will premiere on 20 May 2022. However, Prime Video released all the episodes on 18 May 2022, two days earlier than its actual premiere date.\r\nSeason 3\r\nDeepak Kumar Mishra revealed to social media that there would be a Panchayat Season3.\r\nPanchayat season 3 will involve eight episodes and is set to be released in late 2023 on Amazon Prime Video.\r\nReception\r\nCritical response\r\nSeason 1\r\nSreeparna Sengupta of The Times of India rated four out of five stars and wrote \"What keeps Panchayat ticking are the well-timed dialogues and situations that keep you chuckling all along.\" Nandini Ramanath of Scroll.in wrote \"The series is better placed to explore the foibles of its handful of characters. Panchayat unfolds as a comedy of mofussil manners. A proposal to install solar-powered lights teaches Abhishek the art of negotiating with the locals. A poorly phrased slogan for family planning leads to the discovery of hidden allies. The theft of a computer monitor is a sign that Abhishek is finally settling into his role.\" Ruchi Kaushal of Hindustan Times stated \"Panchayat is a perfect example that what you really need to make a series sing is a solid script. If you are looking for something beyond the good old Ramayan and Mahabharat during the lockdown, Panchayat should definitely be on your must-watch list.\"\r\nEktaa Malik of The Indian Express gave three-and-a-half out of five stating \"Panchayat incisively breaks the dual-tone presentation of the Indian small town in mainstream narratives. Jitendra Kumar is continuing his fine form after Shubh Mangal Zyada Saavdhan and his 'hairan-pareshan' expression has only gotten better. Though we wonder how long will he keep doing this underdog-needs-to-be-rescued roles.\" Nairita Mukherjee of India Today summarised \"Panchayat teaches us why rural India is possibly more equipped to handle isolation compared to its urban counterparts. Jitendra Kumar and Raghuvir Yadav drive the show, but we wanted to see much more of Neena Gupta.\" Saraswati Datar of The News Minute stated \"There are plenty of laughs but just as many genuine moments of emotion which force you to pause and feel for the people in this quirky tale. Go ahead and watch Panchayat, it's exactly the ray of sunshine we need in gloomy times like these.\"\r\nRahul Desai of Film Companion stated \"The TVF show has one of the finest ensembles of recent times with Chandan Kumar's screenplay ensuring characters don't come across as caricatures.\" Udita Jhunjhunwala of Firstpost gave three-and-a-half out of five stating \"On-target casting, immersive production design, crafty dialogue, and situations handled with a light touch to make Panchayat a satisfying watch. And who would have thought lauki (bottle gourd) could be such an effective peace offering!\" Tanisha Bagchi of The Quint gave four out of five stating \"Panchayat scores in its opening credits too, and by the time the sun sets on the worn-down office, we know one thing for sure - it takes a village to drive away from the fatigue that has crept in owing to Bollywood's obsession to set every other film in a small town.\"\r\nPriyanka Sinha Jha of News18 reviewed \"City-slickers, small-town audience or country hicks, whichever category you may fall in, Panchayat is a must-watch for those who enjoy India stories.\" Shilajit Mitra of Cinema Express reviewed \"Though the show progresses quickly, with a new distraction emerging every episode, Abhishek stays focused on his goal. He's least bothered about Phulera and its going-ons. All he wants to do is study, bide his time and clear out. Writer Chandan Kumar and director Deepak Kumar Mishra steer clear of obvious heroisms. When Abhishek gets into a scuffle and his ego swells, the scene quickly turns to slapstick.\" Tanul Thakur of The Wire wrote \"Panchayat has a constant lightness of touch, and that is reflected in the aesthetics, too. Its scenes aren't hurried; a consistent relaxed rhythm informs the entire show.\"\r\nAccolades\r\nSeason 1",
    "html": "<p>Panchayat is an Indian Hindi-language comedy-drama webseries created by The Viral Fever for the Amazon Prime Video. The series scripted by Chandan Kumar, was directed by Deepak Kumar Mishra, which features Jitendra Kumar, Raghubir Yadav, Neena Gupta, Sanvikaa, Chandan Roy, Durgesh Kumar, Ashok Pathak, Faisal Malik and Sunita Rajwar. It chronicles the life of an engineering graduate who joins as a Panchayat secretary in a remote fictional village Phulera of Uttar Pradesh due to lack of better job options.</p><p>The series was shot in a real panchayat office located in village Mahodiya of district Sehore Madhya Pradesh. Sehore is about 40 kilometers from Bhopal, the capital city of Madhya pradesh. Mahodiya is about 10 kilometers from Sehore district headquarter. The soundtrack and score of the series is composed by Anurag Saikia, whilst cinematography and editing were performed by Amitabh Singh and Amit Kulkarni respectively. This series is Mishra's full-fledged attempt in direction after directing the respective second seasons of Permanent Roommates and Humorously Yours!.</p><p>Panchayat was premiered on Amazon Prime Video on 3 April 2020. The series received mostly positive response from critics, with the performances of the leading actors, scripting, direction and major technical aspects were praised, critics also appreciated TVF, its producers to come up with a rural village setting as compared to the previous projects, which is mostly based on the urban atmosphere. At the inaugural ceremony of Filmfare OTT Awards, the series won all the nominations under the Comedy Series category, except for Best Actress. The series was also nominated for Best Original Story, Screenplay, and Dialogues for Chandan Kumar, although it did not receive a win.</p><p>The second season of the series was scheduled to release on 20 May 2022. However, all the episodes were released two days before the actual release date. In this season, Abhishek is seen taking more interest in village politics and developments alongside preparing for CAT exam.</p><p>The series is renewed for season 3.</p><br/><h3>Premise</h3><p>The series deals with the experiences of an urban engineering graduate, unfamiliar with village cultures, who on completing his degree gets a low salary position as a secretary of a Gram panchayat in a remote village called Phulera in Uttar Pradesh.</p><br/><h3>Cast and characters</h3><p>Main</p><ul><li>Jitendra Kumar as Abhishek Tripathi, Panchayat Secretary</li><li>Neena Gupta as Manju Devi Dubey, Pradhan Rinky ‘s mother, Brij’s wife</li><li>Raghubir Yadav as Brij Bhushan Dubey, Manju Devi's Husband, Pradhan-Pati Rinky’s father</li><li>Faisal Malik as Prahladchand \"Prahlad\" Pandey, Upa-Pradhan</li><li>Chandan Roy as Vikas, Office Assistant</li><li>Sanvikaa as Rinki, daughter of Pradhan</li></ul><p>Recurring</p><ul><li>Biswapati Sarkar as Prateek, Abhishek's friend (season 1)</li><li>Satish Ray as Siddharth Gupta aka Siddhu, Abhishek 's Friend (season 2)</li><li>Sunita Rajwar as Kranti Devi , Bhushan’s wife and Manju Devi’s rival (season 2)</li><li>Subendhu Chakraborty as Mangal</li><li>Shrikant Verma as Parmeshwar</li><li>Ashok Pathak as Vinod (season 2)</li><li>Pankaj Jha as MLA Chandra Kishore Singh (season 2)</li><li>Diwakar Dhyani as Sudhir Jaiswal BDO ( Season 2)</li><li>Sushil Tondon as Bhindeshwar</li><li>Mubarak Khan as Ward Member 1</li><li>Kamal Rai as Ward Member 2</li><li>Govind Lobhani as Ward Member 3</li><li>Bal Mukund Rai as Ward Member 4</li><li>Salim Ansari as Ward Member 5</li><li>Mohd. Shakir as Ward Member 6</li><li>Dinesh Tiwari as Ward Member 7</li><li>Kailash Karoshiya as Ward Member 8</li><li>Durgesh Kumar as Bhushan aka Banrakas, Kranti’s husband and Brij and Abhishek’s rival</li><li>Aanchal Tiwari as Raveena, Parmeshwar's daughter, Rinki's bestfriend</li><li>Deepesh Sumitra Jagdish as Photographer</li><li>Sandeep Shikhar as Deenbandhu</li><li>Jyoti Dubey as Sushma</li><li>Rajesh Jais as Virendra Gupta (BDO)</li><li>Aasif Khan as Ganesh, Bride Groom (season 1)</li><li>Prateek Pachauri as Babloo</li><li>Dipesh Binyani as BDO's Assistant</li><li>Ebaabdullah Khan as Dabloo</li><li>Ankit Motghare as Theka Shopkeeper</li><li>Usha Nagar as Deenbandhu's Mother</li><li>Aditya Sharma as Groom's Father/Ganesh Father</li><li>Shashie Verma as Master Ji</li><li>Vishwanath Chatterjee as Sub Inspector</li><li>Kusum Shastri as District Magistrate</li><li>Shubham as Goon 1</li><li>Prayag Sahu as Goon 2</li><li>Arvind Bhagwat as DM's Assistant</li></ul><ul><li>Maya Gannote as a Female ward member</li><li>Gaurav Gawai as Goon</li><li>Chinta Loungre as a Female ward member</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"1\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"1\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally released</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span class=\"mw-selflink-fragment\">1</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">April 3, 2020</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span class=\"mw-selflink-fragment\">2</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">May 18, 2022</td></tr></tbody></table><h4>Season 1</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#000000;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#000000\">Title</th><th scope=\"col\" style=\"background:#000000\">Directed by</th><th scope=\"col\" style=\"background:#000000\">Written by</th><th scope=\"col\" style=\"background:#000000\">Original air date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Gram Panchayat Phulera\"</td><td style=\"text-align:center\">Deepak Kumar Mishra</td><td style=\"text-align:center\">Chandan Kumar</td><td style=\"text-align:center\">3 April 2020</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #053ba1\">Abhishek Tripathi is a fresh engineering graduate who does not get placed in his final year. With only a job offer of a panchayat secretary, he tries to give it a shot as there is no other option left after graduating. He reaches Phulera and meets the former village sarpanch (husband of the current village sarpanch), the deputy sarpanch and his assistant. When Abhishek reaches Phulera, the doors of the panchayat office are locked and the keys missing. By the time the doors are opened (blown from the frame), the situation inside the office room turns him down. Abhishek decides that he needs to switch his job at the earliest and the only way to do so is by cracking CAT (Common Admission Test) and taking admission in one of the IIMs.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Bhootha Ped\"</td><td style=\"text-align:center\">Deepak Kumar Mishra</td><td style=\"text-align:center\">Chandan Kumar</td><td style=\"text-align:center\">3 April 2020</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #053ba1\">Abhishek, working as panchayat secretary, is also preparing for CAT after office hours. He has arranged for emergency lights as there is a power shutdown in the village every night. He plans to install a solar-powered light in the panchayat office from the total lights allotted. His plan is thwarted when one of the panchayat members suggests installing the light at a place called Bhootha Ped (haunted tree) which will help the sarpanch garner votes in the upcoming election. Abhishek now undertakes the mission to uncover the truth.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Chakke Wali Kursi\"</td><td style=\"text-align:center\">Deepak Kumar Mishra</td><td style=\"text-align:center\">Chandan Kumar</td><td style=\"text-align:center\">3 April 2020</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #053ba1\">Abhishek buys a comfy revolving chair since working and studying in the crude plastic chairs proved quite uncomfortable. This chair soon becomes a bone of contention between him and the Pradhan, who feels diminished in the eyes of the people compared to Abhishek since he does not possess a fancy chair. The Pradhan hatches an elaborate plan to spirit the chair away from Abhishek, which culminates in Abhishek having to give away his chair to a disgruntled bridegroom to placate him for swearing at him.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Hamara Neta Kaisa Ho?\"</td><td style=\"text-align:center\">Deepak Kumar Mishra</td><td style=\"text-align:center\">Chandan Kumar</td><td style=\"text-align:center\">3 April 2020</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #053ba1\">Abhishek is instructed by the BDO to put up family planning slogans. Since this is a pet project of the DM, he threatens him with disciplinary action if the work is not done on time. Abhishek gets the slogans painted and then walks around with Pradhan, Prahlad and Vikas to check on the work. The second slogan, \"Do bacche meethi Kheer, do se jyaada bawaseer\" compares children born, after the first two, to a case of piles which provokes a strong reaction among villagers who have more than 2 kids. This puts Pradhan in a tough position since they all threaten to vote against him at the next election and he has the slogan removed. Manju Devi calls out the Pradhan on his weak leadership. Pradhan sees a picture of Sardar Patel and gets inspired. He has Abhishek to call a meeting of the ward and tells the gathering that he stands by the slogan. Prahlad and Vikas also support the Pradhan. Abhishek tells the Panchayat that they should tell anyone offended by the slogan that it is like a warning on a cigarette packet that is meant to offend and scare. Pradhan instructs Vikas to put the slogan back. After the meeting, the BDO calls Abhishek to tell him that the piles slogan is not mandatory after a father of 6 in another village, offended by the slogan, burnt down the Panchayat office. Abhishek asks Pradhan if he wants to reconsider his decision but the Pradhan, inspired by Sardar Patel says that his decision is final.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Computer Nahi Monitor\"</td><td style=\"text-align:center\">Deepak Kumar Mishra</td><td style=\"text-align:center\">Chandan Kumar</td><td style=\"text-align:center\">3 April 2020</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #053ba1\">Frustrated by the lack of nightlife in the village, Abhishek decides to drink beer but forgets to lock the door of his room and finds his monitor stolen from the panchayat office the next morning. A furious Pradhan reprimands Abhishek for being careless and asks him to find new accommodation. Abhishek and Prahlad lodge an FIR at the local police station. A police officer arrives later at the panchayat office and suspects Abhishek of stealing the monitor for money. The officer along with Pradhan and others interrogates an irritated Abhishek who then explains his frustration because of his village routine and lonely life. Abhishek's outburst convinces Pradhan of his innocence. That night, Pradhan arranges a party along with Prahlad and Vikas to cheer Abhishek up. The next morning, Abhishek finds his stolen monitor returned, with a note saying the monitor was mistaken for a television.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Bahot Hua Samman\"</td><td style=\"text-align:center\">Deepak Kumar Mishra</td><td style=\"text-align:center\">Chandan Kumar</td><td style=\"text-align:center\">3 April 2020</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #053ba1\">Abhishek is having his photograph taken for the exam and Vikas gets into a verbal altercation with two men trying to sit on Abhisheks bike. The men threaten to \"fix\" him when he shows up to get his photos the next day. Vikas wants to involve Pradhan in this but Abhishek stops him. The next day when he goes to pick up his photo's, the photographer says that since he got into a tussle with men from his village, he is supporting them and he has deleted his pics. The men call him at night to taunt him. Now Abhishek has to take Pradhan's help to resolve the matter.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Ladka Tez Hai Lekin..\"</td><td style=\"text-align:center\">Deepak Kumar Mishra</td><td style=\"text-align:center\">Chandan Kumar</td><td style=\"text-align:center\">3 April 2020</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #053ba1\">Pradhanji fixed his daughter's marriage to a guy whose family demanded 20 lakh rupees as dowry. When Pradhanji asked Abhishek about the situation he told him he won't take dowry from anyone even if he would get a good salary which impresses Pradhanji. Then he started testing Abhishek's ability whether he'll crack the CAT examination or not, meanwhile a couple is fighting over their son's name which Abhishek suggested. Finally, Pradhanji decided to ask Abhishek about marriage by letting her daughter choose any finger between the two, The same way the arguing couple decides their son's name. But, on the day of the examination Pradhanji and Vikas found that Abhishek's exam has not gone well. So he has no option to change his decision.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Jab Jaago Tabhi Savera\"</td><td style=\"text-align:center\">Deepak Kumar Mishra</td><td style=\"text-align:center\">Chandan Kumar</td><td style=\"text-align:center\">3 April 2020</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #053ba1\">Abhishek is not in a good mood even after 2months of his CAT examination, Vikas tries to cheer him up. Abhishek vents out all his frustrations on him later apologizes. Somedays before the Republic day Manju Devi taunts Abhishek for not clearing the CAT examination, where he taunts back as Manju Devi is the actual Sarpanch but, every year Pradhanji hosted the flag ceremony.  Which prompted Manju Devi to learn the National anthem of India as she decided to host the flag ceremony, but fails to remember the National anthem. On the day of Republic day, the District Magistrate notices the banner as Pradhanji is the Sarpanch and decides to go as an inquiry, where she is about to suspend Abhishek. Manju Devi arrives. Then she hosted the flag ceremony and everyone celebrates. Abhishek realised his mistake and decided to try one more year for the CAT examination. At last, he climbs on the water tank as his colleagues suggested earlier to fall in love with the village, where he meets Rinki, daughter of Pradhanji as the episode comes to an end. It is hinted that Abhishek is attracted towards Rinki, which confirms the saying that he would indeed fall in love.</td></tr></tbody></table><h4>Season 2</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#383554;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#383554\">Title</th><th scope=\"col\" style=\"background:#383554\">Directed by</th><th scope=\"col\" style=\"background:#383554\">Written by</th><th scope=\"col\" style=\"background:#383554\">Original air date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Naach\"</td><td style=\"text-align:center\">Deepak Kumar Mishra</td><td style=\"text-align:center\">Chandan Kumar</td><td style=\"text-align:center\">18 May 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #053ba1\">Prahlad and Vikas suspect that Abhishek and Rinki are involved with each other, based on Abhishek's unusual happiness after drinking tea on the water tanker. Meanwhile, at the pond digging site, soil is being dug out to be sold to Parmeshwar but Pradhan is not able to negotiate well because of his closeness with Parmeshwar. Abhishek comes up with a plan to make Manju Devi bargain instead of Pradhan since she's very blunt and a better negotiator. After the negotiations, Parmeshwar realises the plan and confronts them and leaves abruptly. In an effort to save the deal Abhishek, Prahlad &amp; Vikas go to his factory to look for him and eventually find him at the local dance. During the dance Parmeshwar finds out that one of the two dancers is a man in disguise, and that makes the crowd go berserk and ends up hurting the other dancer in the subsequent violence. Just as the trio reaches the dance, Parmeshwar asks them to help out the girl who had been injured, Abhishek is tasked to take her to the dispensary. When the girl points out that he is actually reluctant to continue with a job he doesn't like, Abhishek dismisses Vikas and Prahlad, who abandon the thought of Abhishek being involved with Rinki.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Bol Chaal Band\"</td><td style=\"text-align:center\">Deepak Kumar Mishra</td><td style=\"text-align:center\">Chandan Kumar</td><td style=\"text-align:center\">18 May 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #053ba1\">Due to lagging village development work, Bhushan stands up against Pradhan due to his past grudge and questions Abhishek about his loyalty, labelling him a bootlicker. Abhishek consults his friend Siddharth, who advices to maintain distance from Pradhan. Later Bhushan catches Abhishek at the temple while he is taking signatures from Manju Devi. Pradhan doubts Abhishek after being ignored and rushes to the office to know the truth. Pradhan invites Abhishek to Rinki's birthday celebration. There, he reveals how Bhushan troubled him. Later, Abhishek confronts Bhushan, who flees after Pradhan, Prahlad and Vikas confront him.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Kranti\"</td><td style=\"text-align:center\">Deepak Kumar Mishra</td><td style=\"text-align:center\">Chandan Kumar</td><td style=\"text-align:center\">18 May 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #053ba1\">Even as installation of toilets takes place in the village at his behest, Abhishek receives word from the BDO that the DM would be visiting Phulera since somebody has tipped off her office that the village was falsely accorded an open-defaecation-free status. With Pradhan, Vikas and Prahlad on alert, the gang soon learns that Bhushan has instigated a rebellion through a man who unfortunately couldn't get a toilet installed at his home. Abhishek tasks Vikas and Prahlad with the prevention of the rebellion, fully aware that Bhushan could misuse Pradhan's lack of public hygiene against the gang.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Tension\"</td><td style=\"text-align:center\">Deepak Kumar Mishra</td><td style=\"text-align:center\">Chandan Kumar</td><td style=\"text-align:center\">18 May 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #053ba1\">An anti-alcoholism public announcement car is to go through the village but Vikas and Abhishek discover that the driver himself is heavily drunk. Despite insisting that he will be fine, he skids off the road and they are forced to take him to the panchayat office. They are unable to call either Prahlad, whose son Rahul, an army officer posted in Kashmir, is in town on a holiday, or Pradhan ji, who is meeting Rinki's prospective groom and his family at lunch, for help. Due to a confusion about the venue, Pradhan Ji's family and the groom's family end up in different restaurants and despite having made a prior reservation, Pradhan is told to come to the other place and the groom's family ends up insulting him. They decide to leave, realizing marrying Rinki into that family will be a mistake as they do not respect them. Meanwhile, Abhishek and Vikas try to sober up the driver, who later says that he doesn't earn enough and warns Abhishek of the same alcoholic fate. At the end of the day, the gang ends up drinking anyway and lightens up, while the driver sobers up and leaves.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Jaise Ko Taisa\"</td><td style=\"text-align:center\">Deepak Kumar Mishra</td><td style=\"text-align:center\">Chandan Kumar</td><td style=\"text-align:center\">18 May 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #053ba1\">Abhishek gets CCTV cameras installed in a few corners of Phulera. A farmer tries to use the camera recordings in order to trace his missing goat. Fate seems to have a trick up sleeve, though, when Manju Devi mistakenly switches her slippers with those of Bhushan's wife Kranti. Bhushan threatens Abhishek and Vikas with an FIR on grounds of \"blatant abuse of power\" upon seeing the goof-up, and the duo visit Pradhan and Manju, requesting them to settle the matter. While there, Abhishek realizes that Bhushan has been scheming to report the gang in complete reliance on the CCTV footage. He then stages a plot to return the slippers to Kranti in a polybag, but it hits her head; while Abhishek angrily deletes the footage on seeing through Bhushan's notorious designs in the presence of the group, everyone is forced to visit Pradhan's house all of a sudden whence it turns out that Manju Devi had a scuffle with Kranti; the latter threatens to run for office next year, even pulling Abhishek, who is clearly on the side of the Pradhan's family.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Aukaat\"</td><td style=\"text-align:center\">Deepak Kumar Mishra</td><td style=\"text-align:center\">Chandan Kumar</td><td style=\"text-align:center\">18 May 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #053ba1\">A desperate Pradhan Ji makes an attempt to full-fill his biggest election promise of building a healthy road on the highway link. The local MLA, Chandra Kishore Singh, sends Pradhan, Prahlad and Vikas to a protest over the rails. The trio gets arrested in the process, and Abhishek bails them out. They make plans to invite the MLA to Phulera for voter support. Chandra Kishore, however, is unimpressed, and swears harshly at Abhishek when he tries to defend the trio's release, claiming that the MLA would have earned some publicity in exchange for the funds Pradhan demanded to construct the road. Abhishek, feeling disturbed, eventually calms down after Rinki texts him, asking him to let go.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Dost Yaar\"</td><td style=\"text-align:center\">Deepak Kumar Mishra</td><td style=\"text-align:center\">Chandan Kumar</td><td style=\"text-align:center\">18 May 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #053ba1\">Siddharth decides to surprise Abhishek by visiting Phulera for a day. Meanwhile Prahlad, Vikas and Pradhan Ji collect funds for the 3-day kirtan planned in the village. Eventually bored, the group decides to have beer in the fields. While there, the topic of inviting the MLA to a religious congregation comes up, which Abhishek takes strong exception to, revealing how he was hurt due to Pradhan Ji not standing up for him when the MLA abused him and reminding him of the times he has stood up for him; he loudly wonders whether Pradhan Ji even truly considers him a friend, and leaves with Siddharth abruptly. Later, the two of them decide to have a beer anyway, only to discover a snake there. They call Prahlad, Vikas and Pradhan Ji for help and they arrive promptly, scouring the office and concluding the snake has left. Later Pradhan Ji hosts them both for the night, and Abhishek reconciles with him, saying he is fine with the MLA visiting.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Parivaar\"</td><td style=\"text-align:center\">Deepak Kumar Mishra</td><td style=\"text-align:center\">Chandan Kumar</td><td style=\"text-align:center\">18 May 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #053ba1\"><p>Pradhan prepares for the religious congregation, donating Rs.20000. Bhushan, after knowing Pradhan is boasting about his donation for politics, decides to provide his tent services for free. Meanwhile, the gang decides to have beer in the office left from the other day. Siddharth also joins the gang via a video call. Prahlad is suddenly cut short through a call informing him that Rahul is martyred. A wave of sorrow engulfs Phulera, with Bhushan and Kranti also abandoning their vendetta against Pradhan and Manju Devi in the process. Upon learning that Chandra Kishore would be visiting Phulera for a sympathy tribute, Pradhan instructs Manju Devi, who, with assistance from Kranti and the women of the village, succeeds in blocking his convoy; Manju Devi then tells him that he has no right to pay any respects to Rahul after disrespecting Prahlad, his father, and that he must go back to where he came from. As he reels from the blow to his ego, Chandra Kishore assumes that Abhishek is the reason behind all this and vengefully vows to have him transferred. Meanwhile, Prahlad is heartbroken as the villagers assemble for a funeral. After remaining aloof and alone for 3 days, Prahlad is visited by Pradhan, Vikas and Abhishek. As Prahlad breaks into tears, Pradhan, Vikas and Abhishek comfort and console him.</p>The episode ends with a post-credits scene wherein Manju Devi and Rinki receive a letter and, on opening and reading it, conclude that it is a transfer order for Abhishek, who is unaware, just akin to the women, that it is under duress from Chandra Kishore.</td></tr></tbody></table><br/><h3>Production</h3><h4>Development</h4><p>In late 2019, The Viral Fever signed a deal with the streaming platform Amazon Prime Video to produce a new web television series for their platform, after the success of their previous collaboration Hostel Daze. Sameer Saxena, the creative head of TVF picked Chandan Kumar and Deepak Kumar Mishra to script the show and direct the series. Mishra earlier directed theatre shows and drama in the past, and in his meeting with the founder and then-creative head of TVF, Arunabh Kumar, he expressed his interest in scripting, acting, and direction. Later, he went on directing the respective second season of Permanent Roommates and Humorously Yours. This was his first maiden attempt at directing a full-fledged web series for the media.</p><p>Mishra drew inspiration from the classic Doordarshan shows Malgudi Days, Potli Baba Ki, Swami and Tenali Rama, and decided to make one of them relatable to the current scenario stating that the kinds of shows are not present in this period. He and Chandan did extensive research and traveled across villages for an idea about the script, which was progressed in 2017, had been delayed due to the research work. Chandan finally drafted the script whose one-line is about an engineering graduate who joins in a low-paid salary job in a remote village, and initially titled as SDO Saheb, before they changed the title to Panchayat.</p><blockquote>We wanted to show realism. Usually, villagers are portrayed as ‘bhole-bhale’ log (simple people), who are ignorant and are shown in a very strange way. People raised fingers saying that our story was slow, takes time to sink in, and without any action, or a leading lady. But my writer and I were clear that we wanted to show a village in 2020 and probably the audience liked that realism. Today's rural youth is watching YouTube on mobile, they make TikTok videos, on ‘khaprail’ (clay-tiled) roofs they have dish antennas, flat-screen TVs are fitted on mud walls...so it's a different world now!— Deepak Kumar Mishra, on the conceptualisation of the show Panchayat in an interview with Hindustan Times</blockquote><h4>Casting</h4><p>For the main character Abhishek Tripathi, Sameer Saxena picked Jitendra Kumar, who opined that his similarities to the character of the protagonist and the regular collaborations with TVF made it possible. His character had strong similarities with that of Mohan Bhargav, portrayed by Shah Rukh Khan in the 2004 film Swades. About the contrast differences Kumar stated that \"The comparisons were inevitable. But I am very happy about it, as I am a huge fan of the film. It left a deep impact on me. I even have a framed poster of the film — the one with SRK sitting in a boat surrounded by local villagers — in my home itself\".</p><p>Neena Gupta plays the role of Manju Devi, the village Pradhan, and a homemaker. She initially accepted the script on the basis of the response of TVF's previous projects as well as their collaboration with Raghubir Yadav and Jitendra (in her second collaboration after Shubh Mangal Zyada Saavdhan, in which she played the latter's mother character). Yadav played the role of Brij Bhushan Dubey, husband of Manju Devi, and on the connection with his co-star, he stated \"It was a great experience to work with Neena Gupta. She used to get into the character entirely. With her, it didn't feel we are here for acting\".</p><p>Yadav's student Chandan Roy played the role of Vikas, the office assistant. He initially confessed that he used to go to auditions every day and one of his friends at the casting bay called him for a small role in the series, which was supposed to be shot in a single day. He initially travelled to Bhopal to shoot for the same series and met one of the assistants in TVF, where the creative team sent a script for Vikas and also got the role, whereas Deepak Kumar Mishra shot the one day portion which was initially offered to Roy.</p><h4>Filming</h4><p>The series was shot in a real panchayat office located at Mahodiya Village, Sehore district in Madhya Pradesh, whereas the script was set in a fictional backdrop in Uttar Pradesh. According to the lead actor Jitendra Kumar, the series was shot in the month of March and April 2019, which wrapped within two months. However he opined as, during the time period, the temperature was extremely hot and was difficult to shoot, further adding that it was a tough time for the crew members who were 150 in number, as many used to stand in the fields holding umbrellas or lights. Raghubir Yadav eventually said about shooting in real locations, stating that \"It turned out to be really well as the aesthetics and the vivid hues of the village life can be clearly seen in the show.\"</p><p>In an interview with Hindustan Times, Jitendra stated \"My initial understanding of a panchayat was a big tree with five PANCH or sarpanch and other people sitting in its shade. They are usually fighting over a land dispute and come up with a solution right there. But actually, Panchayat is like an office and every panchayat follows a process. The show talks about the problems of villagers which appear to be very funny for us.\"</p><br/><h3>Soundtrack</h3><h4>Season 1</h4><p>Anurag Saikia composed the soundtrack and background score for Panchayat. The background score and songs include the use of acoustic guitars, pianica, accordion, and the kora, despite the setting in rural India. Saikia initially noted that \"The creative producer Abhijeet Singh Parmar wanted \"anything but the usual music. So we initially tried symphony, then rock, even jazz. The music for episode one took a month or two to be locked in. Once that was in place, we decided to keep the music acoustic and minimalist\".</p><p>He initially added that the biggest challenge for him is to feature an ambient sort of music, with a bit of rock. However, the score featured only acoustic instruments. Saikia, in an interview with Scroll.in opined that \"When an entire score for a scene got chucked, I had to bring the musicians back to the studio, and they often played for the same scene thrice a week. This happened with the theme that is used to introduce the village pradhan's husband.\"</p><p>One of the songs in the series Hiya Tho, received positively by the audience for producing a soulful tune with gibberish lyrics. The word \"Hiya\", stands for heart in Assamese. Due to his early exposure to Assamese and Western classical music, Anurag Saikia stated that \"the song is inspired by the chants we have grown up hearing in monasteries in the North East\". He recruited fellow Assamese singer Shankuraj Konwar for vocal duties since he would understand the song's Assamese roots.</p><p>The original soundtrack album for the series was unveiled on 10 April 2020, followed by the original score on 1 May 2020. The soundtrack features five songs plus a theme music, all has been performed and written by Saikia, whereas Vivek Hariharan, Raghav Chaitanya, Vinnie Hutton, Shankuraj Konwar sang the vocals. The background score which released as a separate album format features sixteen tracks</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>Panchayat</i> (Music from the Series)</caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:60%\">Title</th><th scope=\"col\" style=\"width:40%\">Singer(s)</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Pasa Phenk\"</td><td><span>Anurag Saikia</span>, Vivek Hariharan</td><td class=\"tracklist-length\">2:38</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Paheli\"</td><td>Anurag Saikia, Raghav Chaitanya</td><td class=\"tracklist-length\">2:53</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Hiya Tho\"</td><td>Anurag Saikia, Shankuraj Konwar</td><td class=\"tracklist-length\">3:59</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"I'm Happy\"</td><td>Anurag Saikia, Vinnie Hutton</td><td class=\"tracklist-length\">1:43</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Panchayat Title\"</td><td>Anurag Saikia</td><td class=\"tracklist-length\">1:03</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"3\" scope=\"row\"><span>Total length:</span></th><td>12:18</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>Panchayat</i> (Original Score from the Series)</caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Aur Kitna Dhoor?\"</td><td class=\"tracklist-length\">2:16</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Anjaan Galiyaan\"</td><td class=\"tracklist-length\">0:54</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Ab Kya?\"</td><td class=\"tracklist-length\">1:11</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Duniya Gol Hai\"</td><td class=\"tracklist-length\">0:56</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Chhoti Chhoti Kushiyaan\"</td><td class=\"tracklist-length\">1:50</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Ek Akela Ped\"</td><td class=\"tracklist-length\">2:40</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Is Raat Ki Subha Nahi\"</td><td class=\"tracklist-length\">1:12</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"Baat Us Raat Khi\"</td><td class=\"tracklist-length\">1:53</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"Naya Safar\"</td><td class=\"tracklist-length\">0:41</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Lauh Purush\"</td><td class=\"tracklist-length\">1:01</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Chauraaha\"</td><td class=\"tracklist-length\">1:34</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"Thokar\"</td><td class=\"tracklist-length\">1:05</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Ghar Se Door Ek Ghar\"</td><td class=\"tracklist-length\">2:53</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Naaga Naach\"</td><td class=\"tracklist-length\">1;13</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"Paagal Sala\"</td><td class=\"tracklist-length\">2:37</td></tr><tr><th id=\"track16\" scope=\"row\">16.</th><td>\"Chal Chala Chal\"</td><td class=\"tracklist-length\">0:58</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"2\" scope=\"row\"><span>Total length:</span></th><td>25:03</td></tr></tbody></table><br/><h3>Release</h3><h4>Season 1</h4><p>Amazon Prime Video announced the release of eight new Indian originals in January 2020, with Panchayat being one of them. The official trailer of Panchayat was released on 29 March 2020. The eight-episode series premiered on 3 April 2020. In May 2020, the makers released the Tamil and Telugu dubbed versions of the series after fans request.</p><h4>Season 2</h4><p>On 28 April 2022, the second season was announced after the completion of the production. On 2 May 2022, it was announced that the second season will premiere on 20 May 2022. However, Prime Video released all the episodes on 18 May 2022, two days earlier than its actual premiere date.</p><h4>Season 3</h4><p>Deepak Kumar Mishra revealed to social media that there would be a Panchayat Season3.</p><p>Panchayat season 3 will involve eight episodes and is set to be released in late 2023 on Amazon Prime Video.</p><br/><h3>Reception</h3><h4>Critical response</h4><h4>Season 1</h4><p>Sreeparna Sengupta of The Times of India rated four out of five stars and wrote \"What keeps Panchayat ticking are the well-timed dialogues and situations that keep you chuckling all along.\" Nandini Ramanath of Scroll.in wrote \"The series is better placed to explore the foibles of its handful of characters. Panchayat unfolds as a comedy of mofussil manners. A proposal to install solar-powered lights teaches Abhishek the art of negotiating with the locals. A poorly phrased slogan for family planning leads to the discovery of hidden allies. The theft of a computer monitor is a sign that Abhishek is finally settling into his role.\" Ruchi Kaushal of Hindustan Times stated \"Panchayat is a perfect example that what you really need to make a series sing is a solid script. If you are looking for something beyond the good old Ramayan and Mahabharat during the lockdown, Panchayat should definitely be on your must-watch list.\"</p><p>Ektaa Malik of The Indian Express gave three-and-a-half out of five stating \"Panchayat incisively breaks the dual-tone presentation of the Indian small town in mainstream narratives. Jitendra Kumar is continuing his fine form after Shubh Mangal Zyada Saavdhan and his 'hairan-pareshan' expression has only gotten better. Though we wonder how long will he keep doing this underdog-needs-to-be-rescued roles.\" Nairita Mukherjee of India Today summarised \"Panchayat teaches us why rural India is possibly more equipped to handle isolation compared to its urban counterparts. Jitendra Kumar and Raghuvir Yadav drive the show, but we wanted to see much more of Neena Gupta.\" Saraswati Datar of The News Minute stated \"There are plenty of laughs but just as many genuine moments of emotion which force you to pause and feel for the people in this quirky tale. Go ahead and watch Panchayat, it's exactly the ray of sunshine we need in gloomy times like these.\"</p><p>Rahul Desai of Film Companion stated \"The TVF show has one of the finest ensembles of recent times with Chandan Kumar's screenplay ensuring characters don't come across as caricatures.\" Udita Jhunjhunwala of Firstpost gave three-and-a-half out of five stating \"On-target casting, immersive production design, crafty dialogue, and situations handled with a light touch to make Panchayat a satisfying watch. And who would have thought lauki (bottle gourd) could be such an effective peace offering!\" Tanisha Bagchi of The Quint gave four out of five stating \"Panchayat scores in its opening credits too, and by the time the sun sets on the worn-down office, we know one thing for sure - it takes a village to drive away from the fatigue that has crept in owing to Bollywood's obsession to set every other film in a small town.\"</p><p>Priyanka Sinha Jha of News18 reviewed \"City-slickers, small-town audience or country hicks, whichever category you may fall in, Panchayat is a must-watch for those who enjoy India stories.\" Shilajit Mitra of Cinema Express reviewed \"Though the show progresses quickly, with a new distraction emerging every episode, Abhishek stays focused on his goal. He's least bothered about Phulera and its going-ons. All he wants to do is study, bide his time and clear out. Writer Chandan Kumar and director Deepak Kumar Mishra steer clear of obvious heroisms. When Abhishek gets into a scuffle and his ego swells, the scene quickly turns to slapstick.\" Tanul Thakur of The Wire wrote \"Panchayat has a constant lightness of touch, and that is reflected in the aesthetics, too. Its scenes aren't hurried; a consistent relaxed rhythm informs the entire show.\"</p><br/><h3>Accolades</h3><h4>Season 1</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Date of ceremony</th><th>Award</th><th>Category</th><th>Recipient</th><th>Result</th><th><abbr title=\"Reference(s)\">Ref</abbr></th></tr><tr><td rowspan=\"7\"><span>19 December 2020</span></td><td rowspan=\"7\"><span>Filmfare OTT Awards</span></td><td>Best Comedy Series</td><td><span>Amazon Prime Video</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"7\"></td></tr><tr><td>Best Actor (Comedy Series)</td><td><span>Jitendra Kumar</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Supporting Actor (Comedy Series)</td><td><span>Raghubir Yadav</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Supporting Actress (Comedy Series)</td><td><span>Neena Gupta</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Original Story (Series)</td><td rowspan=\"3\">Chandan Kumar</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Screenplay</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Dialogues</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}