{
  "imDbId": "tt14392248",
  "title": "Aspirants",
  "fullTitle": "Aspirants (TV Series 2021– )",
  "type": "TVSeries",
  "year": "2021",
  "items": [
    {
      "username": "ravish9",
      "userUrl": "https://www.imdb.com/user/ur12301443",
      "reviewLink": "https://www.imdb.com/review/rw6807490",
      "warningSpoilers": false,
      "date": "12 April 2021",
      "rate": "10",
      "helpful": "341 out of 383 found this helpful.",
      "title": "Bollywood is Dead, TVF is the Future: Masterpiece Stuff",
      "content": "With time it is now getting clear that creativity, merit and quality has inverse relationship with Bollywood, a mafia kingdom of substandard people...But same time it has direction proportionality to TVF like OTT platform. Just see that how with time OTT has matured with world class stuffs. And TVF is the best example of that. TVF which used to look a spoof content platform with amateurish people trying to come with fresh ideas untill we started seeing content like Yeh Meri Family and Pitchers...is now giving us finest quality shows, one after another. Just take a look on this series of top rated shows from them in past couple of years: Kota Factory, Panchayat, Gullak 1, Gullak 2, and now this masterpiece.You need to notice the way these guys have put picture perfect stuff in almost every department, and all of them showing great evolution with time: Cinematography is exceptional, screenplay and writing is exceptional with some phenomenal dialogues, direction and editing is class apart stuff...and what to say about performances...mindblowing. Every actor has caught the understanding of their character to such a perfection. I jsut give an example. Just notice the perfection of performance of a comedy scene by Ghuri while drinking...he wanted IAS vehicle having siren sounding Peon Peon Peon...gulping beer...then again continuing Peon peon Peon....and suddenly GF phone comes and voice changes! Preaching goes away! Or the liberative speeches with excellent pausitivity by Sunny HInduja aka Sandeep Bhaiyya...makes you feel that everyone in this world needs one Sandeep Bhaiyya. The opening scene with SK giving lecture in the IAS coaching is a phenomenal scene with phenomenal dialogue, exceptional edition and cinematography, and equally great BGM...which gives you the sense of the way show arrives when he says \"Doob jao mere Kachuwon is samundar me...\" and the way BGM picks up with panoromic view of skyscrapper of central Delhi. Almost every department at sync, bolstering each other. This is called art of making good show. Book every award for this show, if all the remaining episodes of Aspirants are of same level or better."
    },
    {
      "username": "jitendrakumarshuklabbk",
      "userUrl": "https://www.imdb.com/user/ur111682940",
      "reviewLink": "https://www.imdb.com/review/rw6796076",
      "warningSpoilers": false,
      "date": "9 April 2021",
      "rate": "10",
      "helpful": "426 out of 474 found this helpful.",
      "title": "Masterpiece",
      "content": "Another great series after tvf pitchers and Kota Factory.TVF is giving content far better than bollywood movies."
    },
    {
      "username": "siddharthsewda",
      "userUrl": "https://www.imdb.com/user/ur89765534",
      "reviewLink": "https://www.imdb.com/review/rw6792444",
      "warningSpoilers": false,
      "date": "8 April 2021",
      "rate": "10",
      "helpful": "218 out of 243 found this helpful.",
      "title": "Gem after Gem from TVF",
      "content": "There is no denying the fact the TVF brings the best content on Indian OTT platform.After shows like Pitchers, Yeh Meri Family and Kota Factory, Aspirants is another wondeful show from TVF. The show beautifully depicts the struggles, and life journey of UPSC aspirants.Highly Recommended !!!"
    },
    {
      "username": "harishsaini-01825",
      "userUrl": "https://www.imdb.com/user/ur131854039",
      "reviewLink": "https://www.imdb.com/review/rw6859353",
      "warningSpoilers": false,
      "date": "28 April 2021",
      "rate": "10",
      "helpful": "368 out of 403 found this helpful.",
      "title": "Sandeep bhaiya",
      "content": "Sandeep bhaiya is just not a character, he's an emotion."
    },
    {
      "username": "luckykhanna-36312",
      "userUrl": "https://www.imdb.com/user/ur126653889",
      "reviewLink": "https://www.imdb.com/review/rw6810246",
      "warningSpoilers": false,
      "date": "13 April 2021",
      "rate": "10",
      "helpful": "100 out of 117 found this helpful.",
      "title": "Fabulous actor NAVEEN KASTURIA IS AND HINDUJA JUST KILLED IT AS A MENTOR!!!",
      "content": "Best series must watch for sure.Fabulous actor NAVEEN KASTURIA IS AND HINDUJA JUST KILLED IT AS A MENTOR!!!"
    },
    {
      "username": "ketgup83",
      "userUrl": "https://www.imdb.com/user/ur22864666",
      "reviewLink": "https://www.imdb.com/review/rw6893543",
      "warningSpoilers": false,
      "date": "8 May 2021",
      "rate": "9",
      "helpful": "25 out of 28 found this helpful.",
      "title": "Sets Up The New Benchmark For The Web-Series",
      "content": "TVF is touching the right chord of every heart with its relatable characters and riveting stories that will give you goosebumps. While the first episode of Aspirants was entertaining with clever writing and brilliant performances, episode 2 gives a solid twist in the climax, episode 3 serves the purpose of becoming an IAS officer and episodes 4 proves failure is required to be successful.Aspirants had already won the hearts with its first 4 episodes. With 5th and the final episode premiered few hours back, Aspirants will certainly go down in the history as one of the best Indian web-series made.For our viewers to recollect, Aspirants will take you back to the entrance exam preparation days when all you have to do is just focus and study and somehow clear the exam. Like Kota Factory which talked about the IIT entrance exam stress, the first episode of Aspirants tells the story of UPSC aspirant, Abhilash (Naveen Kasturia), who is confused which subject to chose as part of the exam. He discusses the optional subject to choose with almost everyone, right from his friends (Abhilash Thapliyal and Shivankit Parihar) till the chai-wala, until convinced by an experienced UPSC experienced student (Sunny Hinduja). Much like Chhichhore, the first episode of Aspirants runs in two timeline - the exam preparation day and the present timeline when all three friends, Abhilash, Guri and SK are settled in life.In the second episode of Aspirants, we see Abhilash surprises Guri by calling him and telling him that he will definitely make it to Guri's wedding. The scene later immediately takes you back to the old days when Abhilash gives up the hope to clear the UPSC exam and even finds an excuse to get the refund from his training institute. However, a webinar hosted at his institute changes his perception when he hears out a motivational speech from a guest IAS officer. The speech inspires Abhilash who decides to continue his preparation for UPSC exam.While the episode 2 ends on a solid twist, in the third episode of Aspirants, we see Abhilash finally meets Guri and SK where Guri finally reveals whom he is getting married to. The scene later immediately takes you back to the old days when Abhilash transforms himself from a person who is always cribbing to a person who approaches a problem with a positive attitude. The reason behind his drastic change is Dharya whom he confides in and falls in love.While the episode 4 ended on a disappointing note with both Sunny bhaiya and Abhilash not qualifying for the UPSC exam, the fifth episodes the highlight the importance of relationship, love, family and friends which we always leave behind while chasing our dreams. To many fans who were wondering what happened to Sandeep Bhaiya, you will get your answer in the 5th episode. The only question which remained unanswered is how Guri and Dharya meet ?There is something about TVF's content which will touch every corner of your heart. The beautiful chemistry between Abhilash and Dharya, the scene where Abhilash learns about his landlord's son and lend his helping hands and finally the restaurant scene where Guri finds out that Abhilash is still in love with Dharya as he takes out the specs from the eye cover which was gifted by Dharya during the UPSC preparation days. This will definitely give you goosebumps and a big shout out to Shivankit Parihar for emoting so much through his eyes. The team behind impeccable dramas like Permanent Roommates, TVF Pitchers, Flames, Kota Factory, TVF's Tripling , Cubicles etc, Aspirants is another feather on their cap which is beautifully directed by Apoorv Singh Karki and cleverly written by Deepesh Sumitra Jagdish.If all the episodes of Aspirants is an enduring watch, the credit should go turned out to the creator Apoorv Singh Karki and Deepesh Sumitra Jagdish for writing the screenplay so appropriately. Like the previous episodes, the makers have done a wonderful job in creating the curiosity to watch the finale and I am sure you will not be disappointed. I also liked the background score which gels well with the mood of the web-series.Aspirants is a performance-driven series and every actor has done justice to their role. Performances by all the actors is a major boost to watch Aspirants which is natural and intrinsic to the core. Clap-worthy 4.5/5."
    },
    {
      "username": "shashwatkadre",
      "userUrl": "https://www.imdb.com/user/ur119590859",
      "reviewLink": "https://www.imdb.com/review/rw6791359",
      "warningSpoilers": false,
      "date": "8 April 2021",
      "rate": "10",
      "helpful": "25 out of 28 found this helpful.",
      "title": "TVF is reaching heights of content",
      "content": "My God it will be a disrespect to the God of Content if someone rates any TVF series less than 10/10....TVF is not giving competition to any other OTT platform in India instead it is giving competition to it's own content.....Matlab saale apne hi pichle content se zyaada relatable aur heartwarming content le aate hai...."
    },
    {
      "username": "donutstopeating",
      "userUrl": "https://www.imdb.com/user/ur123673690",
      "reviewLink": "https://www.imdb.com/review/rw6840657",
      "warningSpoilers": false,
      "date": "23 April 2021",
      "rate": "10",
      "helpful": "15 out of 15 found this helpful.",
      "title": "Motivational",
      "content": "Don't have any words to express that how good this show is.If somebody has not watched this show then please go and watch it. Rather than wasting time in watching bollywood movies with same old ghatiya story of action or romance we should watch this with good content, dialogues and awesome background music."
    },
    {
      "username": "keshavladha-03433",
      "userUrl": "https://www.imdb.com/user/ur130678854",
      "reviewLink": "https://www.imdb.com/review/rw6859026",
      "warningSpoilers": false,
      "date": "28 April 2021",
      "rate": "10",
      "helpful": "126 out of 144 found this helpful.",
      "title": "I cried for Sandeep Bhaiya, that's how strong the emotion is",
      "content": "See....this series does not deserve less than 10 rating....you don't just watch it, you feel it I'm not an UPSC Aspirant😅😅, but TVF ne hamesha ki tarah deewana bana diya (TVF has like always made us their fans)."
    },
    {
      "username": "someshgumachi",
      "userUrl": "https://www.imdb.com/user/ur110140154",
      "reviewLink": "https://www.imdb.com/review/rw6879515",
      "warningSpoilers": false,
      "date": "4 May 2021",
      "rate": "10",
      "helpful": "20 out of 22 found this helpful.",
      "title": "TVF is love",
      "content": "Excellent web series. No words to describe tvf.They make masterpiece web series.Some of masterpiece i watched.. Pitcher Permanent rooments Flames Tripling Kota factory Hostel daze Panchayat Yeh meri family Aspirants Cubicles."
    },
    {
      "username": "nikhilpant-45449",
      "userUrl": "https://www.imdb.com/user/ur127238440",
      "reviewLink": "https://www.imdb.com/review/rw6809702",
      "warningSpoilers": false,
      "date": "13 April 2021",
      "rate": "10",
      "helpful": "84 out of 96 found this helpful.",
      "title": "Magnificent",
      "content": "As we expect from them tvf has done a fabulous job in this series as well and they are one and only organization which brings relatable and genuine shows in indian web scene and i will give a 👍 for this show and it has the potential to break record of \"kota factory\" as well."
    },
    {
      "username": "arifhasantheking",
      "userUrl": "https://www.imdb.com/user/ur128633125",
      "reviewLink": "https://www.imdb.com/review/rw6801831",
      "warningSpoilers": false,
      "date": "11 April 2021",
      "rate": "10",
      "helpful": "42 out of 51 found this helpful.",
      "title": "Best Webseries For Students.Must Watch",
      "content": "I just Want to thank TVF for Made Such a extraordinary webseries. It's really Completely Motivational . Once Again Thank You So Much. TVF."
    },
    {
      "username": "kesripurvi",
      "userUrl": "https://www.imdb.com/user/ur132063041",
      "reviewLink": "https://www.imdb.com/review/rw6879104",
      "warningSpoilers": false,
      "date": "4 May 2021",
      "rate": "10",
      "helpful": "16 out of 17 found this helpful.",
      "title": "Worth watching , totally motivating , refreshing , covering true aspect of a UPSC aspirant !",
      "content": "You wont regret watching such a phenomenal series . One of the best series I have ever seen . It has an essence of almost every emotion whether it be romantic , emotional , motivational , etc."
    },
    {
      "username": "himanshudhiman-79253",
      "userUrl": "https://www.imdb.com/user/ur121984229",
      "reviewLink": "https://www.imdb.com/review/rw6872006",
      "warningSpoilers": false,
      "date": "2 May 2021",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "Master piece one should not ignore",
      "content": "Amazing, just amazing show, amazing portrait of each and every emotion, great acting."
    },
    {
      "username": "nikhilgadade-86663",
      "userUrl": "https://www.imdb.com/user/ur131742965",
      "reviewLink": "https://www.imdb.com/review/rw6848390",
      "warningSpoilers": false,
      "date": "25 April 2021",
      "rate": "10",
      "helpful": "52 out of 59 found this helpful.",
      "title": "Relate to lives of millions",
      "content": "Contribution of India to world 1. Zero 2. Yoga 3. The \"TVF\""
    },
    {
      "username": "abhinabsaikia-33770",
      "userUrl": "https://www.imdb.com/user/ur131315478",
      "reviewLink": "https://www.imdb.com/review/rw6804719",
      "warningSpoilers": false,
      "date": "11 April 2021",
      "rate": "10",
      "helpful": "64 out of 77 found this helpful.",
      "title": "A must watch",
      "content": "This awesome show will take you through one of the toughest exams in the world. A must watch."
    },
    {
      "username": "joshi-03413",
      "userUrl": "https://www.imdb.com/user/ur131798863",
      "reviewLink": "https://www.imdb.com/review/rw6854288",
      "warningSpoilers": false,
      "date": "27 April 2021",
      "rate": "10",
      "helpful": "42 out of 49 found this helpful.",
      "title": "Desi Netflix.",
      "content": "TVF is one stop shop for one of the best content.With a range of content that they produce from pitchers, Fathers, Kota Factory and now Aspirants.Their satirical, diverse content overpowers horrific content produced by bollywood.Please launch your app for PS store too. Looking forward to more content.Good luck!"
    },
    {
      "username": "jsd-23642",
      "userUrl": "https://www.imdb.com/user/ur131680321",
      "reviewLink": "https://www.imdb.com/review/rw6840856",
      "warningSpoilers": false,
      "date": "23 April 2021",
      "rate": "10",
      "helpful": "26 out of 30 found this helpful.",
      "title": "Best ever Hindi web series on YouTube",
      "content": "Excellent work by TVF the dialogue and and background music was mind blowing touching. This series is capable to touch every student's heart."
    },
    {
      "username": "huzefasultan",
      "userUrl": "https://www.imdb.com/user/ur117719475",
      "reviewLink": "https://www.imdb.com/review/rw6837548",
      "warningSpoilers": false,
      "date": "22 April 2021",
      "rate": "10",
      "helpful": "15 out of 18 found this helpful.",
      "title": "Aspirants definitely aspire you with entertainment",
      "content": "Most of their shows are mind blowing. This Aspirants is another masterpiece. When you watch you feel like you are living the moment with the story.Th only issue I feel you have to wait for the next episodes. Since we are use to watch all episodes all together on Netflix. But this content is so superb and story is so good its worth to wait for next episodes.This show teach lots of lessons of life and completely justify the title.Do not wait and go watch it and enjoy the show, totally worth the time.KUDSO to all TVF Team behind this project."
    },
    {
      "username": "ahluwalia-99017",
      "userUrl": "https://www.imdb.com/user/ur131253137",
      "reviewLink": "https://www.imdb.com/review/rw6798604",
      "warningSpoilers": false,
      "date": "10 April 2021",
      "rate": "10",
      "helpful": "37 out of 46 found this helpful.",
      "title": "BEST",
      "content": "Probably One of the bEst. It is truly Inspirational and gives an exact idea of what an upsc aspirants life is..one can easily relate."
    },
    {
      "username": "sunilhritik",
      "userUrl": "https://www.imdb.com/user/ur131848870",
      "reviewLink": "https://www.imdb.com/review/rw6858997",
      "warningSpoilers": false,
      "date": "28 April 2021",
      "rate": "10",
      "helpful": "25 out of 29 found this helpful.",
      "title": "ALL ABOUT SURVIVAL",
      "content": "TOM N JERRY STORY TEACHES US WHAT IS SURVIVAL IN REAL WORLD...."
    },
    {
      "username": "basantchetry",
      "userUrl": "https://www.imdb.com/user/ur131389115",
      "reviewLink": "https://www.imdb.com/review/rw6812997",
      "warningSpoilers": false,
      "date": "14 April 2021",
      "rate": "10",
      "helpful": "30 out of 37 found this helpful.",
      "title": "Bollywood must learn something from TVF ...",
      "content": "Content we want is like this . ... Masterpiece ... Must watch Show... Thank you TVF .."
    },
    {
      "username": "capri_can-01644",
      "userUrl": "https://www.imdb.com/user/ur98104659",
      "reviewLink": "https://www.imdb.com/review/rw6848321",
      "warningSpoilers": false,
      "date": "25 April 2021",
      "rate": "10",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Great Bg Score and Direction",
      "content": "Apoorv Singh Karki did a great job directing this masterpiece. We need more karkis than johars and shettys and chopras and khans in Bollywood too in order to elevate the standard and improve the overall content of media."
    },
    {
      "username": "utkarshkumarssm",
      "userUrl": "https://www.imdb.com/user/ur131984510",
      "reviewLink": "https://www.imdb.com/review/rw6871999",
      "warningSpoilers": false,
      "date": "2 May 2021",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Web series nahi emotions hai 'Aspirants'",
      "content": "I didn't not how they make again & again that type of wonderful series. English dictionary didn't have words for that."
    },
    {
      "username": "adityachelseafc",
      "userUrl": "https://www.imdb.com/user/ur131647649",
      "reviewLink": "https://www.imdb.com/review/rw6837537",
      "warningSpoilers": false,
      "date": "22 April 2021",
      "rate": "10",
      "helpful": "24 out of 30 found this helpful.",
      "title": "No 1 web series in India till now..",
      "content": "It's like portraying the skeleton of the Indian Youth.. who are aspiring to be Civil Servants. Classic mixture of emotion.. zeal.. cinematography and overall experience is too good. You will be surely glued to the screen.."
    }
  ],
  "errorMessage": ""
}