{
  "imDbId": "tt0098904",
  "title": "Seinfeld",
  "fullTitle": "Seinfeld (TV Series 1989–1998)",
  "type": "TVSeries",
  "year": "1989",
  "items": [
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8495272",
      "warningSpoilers": false,
      "date": "28 August 2022",
      "rate": "10",
      "helpful": "64 out of 69 found this helpful.",
      "title": "Still just as funny today!",
      "content": "Seinfeld is without a doubt one of the best comedies in the history of television. It's just as hilarious today as when it was on in the 90's. I don't know of any sitcom ever (outside of maybe Friends) where all the co-stars are all equally funny! Jerry Seinfeld (Jerry), Jason Alexander (George), Michael Richards (Kramer) and Julia Louis-Dreyfus's (Elaine) are all some of the best sitcoms in the history of television. I mean everyone has there favorites but bottom line is they're all great as is the show! If you read any \"best sitcom ever\" list ever written you will find Seinfeld as one of the Top 3 on every list for a reason...because it is!"
    },
    {
      "username": "gillmurphydogg",
      "userUrl": "https://www.imdb.com/user/ur160563229",
      "reviewLink": "https://www.imdb.com/review/rw8777721",
      "warningSpoilers": false,
      "date": "4 January 2023",
      "rate": "10",
      "helpful": "35 out of 36 found this helpful.",
      "title": "Universal",
      "content": "This show remains timeless and universal. Seinfeld has got to be one of the best shows of all times. I still have to check myself when I look at when the last show aired in 1998!!The plot lines of each individual episode are so relatable even to today. The show will have you in hysterics through the ingenious writing and superb comedic timing of the actors. The direction of this series is nothing short of perfection. To this day I think I've seen each episode at least 5 times.My all-time favorites are the Soup Nazi (of course), the Contest and the Merv Griffin show. Truly, if you haven't seen this show, get on it!"
    },
    {
      "username": "RahulM007",
      "userUrl": "https://www.imdb.com/user/ur47264037",
      "reviewLink": "https://www.imdb.com/review/rw8593736",
      "warningSpoilers": true,
      "date": "7 October 2022",
      "rate": "10",
      "helpful": "32 out of 34 found this helpful.",
      "title": "A delightful sitcom brimming with charm, levity, and originality",
      "content": "\"I think I can sum up the show for you with one word: Nothing.\"Seinfeld is a sitcom made for every age gap, creed, race, ethnicity, sexual orientation, and generation. It is truly timeless and can be rewatched repeatedly. Seinfeld is colloquially known as 'the show about nothing', yet it encompasses a wide range of different themes. It was way ahead of its time, and even predicted future events to some degree. Creators Jerry Seinfeld and Larry David are absolute geniuses and crafted a rich and multi-layered screenplay with heart and humour. The writing is impeccable, and the acting flawless. Each character is unique and has their own set of quirks and personality traits.Jerry Seinfeld portrays himself and is a stand-up comedian on- and off-screen. His comedy acts at the start and end of each episode are a perfect way to hook the audience. After Larry David departed the show in season 7, Jerry Seinfeld helmed the series on his own. For this reason, he couldn't write the material for his comedy acts.Jason Alexander portrays George 'Can't stand ya' Costanza and is Jerry's best friend from high school. He is the most relatable and funniest Seinfeld character, at least for me. George is an enigma and a troublesome character, which stems from his unconventional upbringing. His parents Frank and Estelle Costanza have quite a dysfunctional relationship, and project their anger, frustration, and issues onto George. Throughout the course of the series, George is known for having public outbursts and calls out societal norms and conventions. Despite his rather nihilistic view on society, George is still bound to exist in a world with bizarre social rules that we all abide to for some reason. Whether he eats out of the trash, cheats on a book club, humorously tries to befriend a black person, sleeps on the job, fakes a disability, or tries to make money off plane ticket loopholes, George is us, at our most base and at our most human.Julia Louis-Dreyfus portrays Elaine Benes and is Jerry's former girlfriend. Despite her title of being \"the girlfriend\", Elaine is never reduced to the role she fills in the other characters' lives. Elaine is an intelligent, committed career woman who knows her worth. Julia Louis-Dreyfus gives a whirlwind of a performance as Elaine Benes. Elaine can be charming and hilarious and sometimes even goes to the extreme at parties (e.g., her dancing). She is a revolutionary and beloved character because she is fully realized as both flawed and admirable. Like George, Jerry, and Kramer, she is relatable and familiar, but as the sole woman, she filled a role that was missing from the most popular shows in the 1990s.\"Aren't you tired of falling the rules? Why be uncomfortable if you don't have to?\"Michael Richards portrays the enigmatic Cosmo Kramer and is Jerry's hipster doofus neighbour. Kramer is perhaps the most idiosyncratic character, stemming mostly due to his quirkiness and eccentricities. Whether he tries to open a restaurant where you make your own pizza pie, prepares a salad in the shower, owns a rooster, slides off the baggage claim at the airport, runs after a plane, or gets arrested for being a serial killer, Kramer is one-of-a-kind, and his human experiences and frustrations are all too relatable.The eighth episode of the ninth season titled \"The Betrayal\" is one of the series' most creative episodes. I loved how the story was told in reverse chronological order. It is such an interesting concept, especially for a sitcom. The episode starts off by pointing out the main conflicts, and throughout the runtime it is revealed how those events unfolded. \"The Betrayal\" is one of my all-time favourite episodes of Seinfeld.For a show about \"nothing\", Seinfeld really reshaped the entire sitcom genre. Only few shows in recent memory managed to surpass the sheer brilliance of Seinfeld. The penultimate episode of Seinfeld was a nice retrospective episode that gave viewers the highlights, bloopers, and some behind the scenes footage of the past nine seasons. Plus, the song \"Turning Point\" by Green Day was a nice touch. I never knew that the song was released in 1997. I thought they released it in the early 2000s. This was rather surprising to me, as I wasn't born when Seinfeld originally aired on television.\"And by the way, they're real and they're spectacular.\" The series finale of Seinfeld was something. In my opinion, it gets a little too much hate from fans. It was neither a perfect nor terrible series finale. Rather, the episode served as a solid conclusion to a wacky and unique sitcom. I loved how they brought back numerous characters from previous seasons. Bania should have been a witness. He could have told the jury the soup story. \"A soup is not a meal!\" I would have preferred if George, Elaine, Jerry, and Kramer weren't arrested, especially for something so ludicrous. The audience fell in love with those characters for a reason. They are relatable and flawed like everyone else on this planet. Seinfeld prides itself in showcasing the lead characters as flawed, egotistical, and selfish because it mirrors reality. Honestly in a perfect world, Seinfeld could have run for one more season. I'd love to see Jerry's comedy acts in prison.Seinfeld is a beloved sitcom for the ages and will be remembered for generations to come. I will never get tired of Seinfeld reruns. The show about \"nothing\" paved the way for other sitcoms and comedies. I am so grateful that it was released on Netflix in 2021. The HD resolution and aspect ratio makes the images much clearer. Seinfeld is what you call a landmark sitcom. It is a show where we can see ourselves and see multifaceted characters missing from far too many corners of television. With a plethora of binge options available, it is becoming clearer that while all the other shows are doing something, the best is still the one that did nothing. Oh, and I almost forgot: Long live Festivus!Perhaps I'll end this review with a quote:\"The reason that Seinfeld is a genius and the reason that it works is that he's talking about these real things that we can relate to, these truths about human nature, but in sort of such an absurd way that it doesn't cause the viewer to see themselves in the actual craziness of what's happening. It works because there's not any kind of self-reflection.\"Final verdict: 10/10."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8837431",
      "warningSpoilers": false,
      "date": "30 January 2023",
      "rate": "10",
      "helpful": "36 out of 39 found this helpful.",
      "title": "All-Time Great!",
      "content": "What can I say about Seinfeld that hasn't already been said? It's just flat out hilarious and still holds up about almost 20 years later. I don't know of any sitcom ever (outside of maybe Friends) where all the co-stars are all equally funny! Jerry Seinfeld (Jerry), Jason Alexander (George), Michael Richards (Kramer) and Julia Louis-Dreyfus's (Elaine) are all some of the best sitcoms in the history of television. I mean everyone has there favorites but bottom line is they're all great as is the show! If you read any \"best sitcom ever\" list ever written you will find Seinfeld near the top on every list for a reason...because it is!"
    },
    {
      "username": "drednm",
      "userUrl": "https://www.imdb.com/user/ur0736738",
      "reviewLink": "https://www.imdb.com/review/rw1148017",
      "warningSpoilers": false,
      "date": "11 August 2005",
      "rate": "",
      "helpful": "265 out of 339 found this helpful.",
      "title": "Jerry Seinfeld Is Superman",
      "content": "Seinfeld is the funniest TV show in history. Built around the day-to-day life of a New York comedian, Seinfeld managed to spear every sacred cow in sight. The irreverence of the show's four main characters never let up over 9 glorious seasons. The \"gang of four\" were petty, childish, surly, selfish, compulsive, obsessive, and totally hilarious ... like 4 children in adults' bodies.Jerry Seinfeld played himself and surrounded himself with an ex-girlfriend (Julia Louis-Dreyfus), a childhood friend (Jason Alexander), and a neighbor (Michael Richards). Four terrific actors with incredible chemistry among them, the four careened through 9 seasons of total mayhem. Sex, religion, politics, old age, political correctness, race, relationships, homosexuality, Los Angeles ... you name it, they harpooned it.Great supporting cast over the years included Jerry Stiller, Estelle Harris, Barney Martin, Liz Sheridan, Wayne Knight, Patrick Warburton, John O'Hurley, Len Lesser, Heidi Swedberg, and others.And so many brilliant actors who only showed up once or a few times: Steve Hytner as Bania, Mark Metcalf as the Maestro, Megan Cole as Peggy the germophobe, Sheree North as Babs Kramer, Charles Levin as the mohel, Elmarie Wendel as Helene the actress, Philip Baker Hall as the library detective, Judge Reinhold as the close talker, Bette Midler as herself, and so many others.Seinfeld probably added more catch phrases to the English language than any other show in TV history. Brilliant writing that found humor in WORDS (such a concept) as well as SITUATION, Seinfeld owed much to the writing of Jerry Seinfeld, Larry David and others. So with great scripts, a perfect cast, and no respect for anything, Seinfeld marched along to his own drum and made us all captives of its brilliant wit.One of the great things about Seinfeld was that you could see a little bit of yourself in each of the 4 zany characters. And you could ALWAYS recognize the dumb situations they found themselves in. Just brilliant!And let's not forget that Jerry Seinfeld became the first Jewish Superman/Everyman on TV. He was everything from comic to sex symbol and everything in between."
    },
    {
      "username": "matthewreinink",
      "userUrl": "https://www.imdb.com/user/ur153546693",
      "reviewLink": "https://www.imdb.com/review/rw8356736",
      "warningSpoilers": false,
      "date": "21 July 2022",
      "rate": "10",
      "helpful": "24 out of 27 found this helpful.",
      "title": "98% episode hit rate",
      "content": "Incredible that this show ran for as many years as it did and still managed to be funny all the way through. There are a few stinky episodes, but also too many gems to count. The cast is funny and Larry David does a masterful job crafting this classic comedic TV series."
    },
    {
      "username": "alexkolokotronis",
      "userUrl": "https://www.imdb.com/user/ur16117882",
      "reviewLink": "https://www.imdb.com/review/rw1861377",
      "warningSpoilers": false,
      "date": "21 April 2008",
      "rate": "10",
      "helpful": "161 out of 212 found this helpful.",
      "title": "Best Written Sitcom Ever",
      "content": "I hate saying something is the best ever. Still how could you go wrong with Seinfeld. Just hilarious characters and setups everywhere.For everyone who has seen this show, what other show or even movie deliver so many open ended endings that still felt like a perfecting closing. That right there is great writing.The characters are another great example of great writing. To think of people like Jerry, George, Elaine and Kramer. These characters were developed so greatly that the ideas for episodes were endless. Also the guest stars did a great job in their appearances just sliding right in.The plots of the episodes were not that great from the outlook. If you actually watch the episodes though the most basic daily problem could be made into a very enjoyable episode.This can only be done with great, superb writing. If you have seen this show watch it."
    },
    {
      "username": "RNMorton",
      "userUrl": "https://www.imdb.com/user/ur0394025",
      "reviewLink": "https://www.imdb.com/review/rw1035155",
      "warningSpoilers": false,
      "date": "7 March 2005",
      "rate": "",
      "helpful": "134 out of 189 found this helpful.",
      "title": "Lennon & McCartney",
      "content": "The best television show ever. Ever. It's been off for how many years and we still try and get our 1 1/2 hour fix every weeknight. Like those famous Beatles, the combination of Larry David (too outrageous) and Seinfeld (too pedestrian) was so much greater than the sum of the parts. Classic ensemble work by Jerry, Alexander, Richards and Louis-Dreyfus. Richards and Louis-Dreyfus are all-time comic all-stars in their own right. It took them about 1/2 to 1 year to get up to speed and then they're off and running. With David gone the concept showed considerable wear in the final season, where some episodes are a grim caricature of earlier successes (e.g., George's \"Twix\" episode). The Puddy story lines were the show's one regular miss, particularly so towards the end. But what a run! And completed by a fitting send-off. The only television series I've watched regularly in the last 25 years. The DVD collections are highly recommended and include loads of fun commentary from the stars. 10 out of 10."
    },
    {
      "username": "sdfrsdfr",
      "userUrl": "https://www.imdb.com/user/ur2160873",
      "reviewLink": "https://www.imdb.com/review/rw0989459",
      "warningSpoilers": false,
      "date": "26 December 2004",
      "rate": "",
      "helpful": "510 out of 591 found this helpful.",
      "title": "Seinfeld, a cultural landmark?",
      "content": "I caught a few episodes of Seinfeld over it's final two seasons run on public channel, and made it a point to catch a lot more of Jerry and friends during it's reruns. I found it very amusing on first viewings, but as time wore on, I began to like it more and more, and to eagerly borrow taped episodes from friends, and to hunt for re-runs on syndicated channels.Of the two comedy TV series in the history of television, I would choose both Seinfeld and Monty Python as the cultural landmarks of the medium. In Seinfeld, there is not a trace of sentimentality and glib moralizing that plagues the American sitcom genre. Characters do not hug each other on Christmas, fall in love, wax on and on about family and friends, there is no faux-cathartic season ender so favoured by the writers of, say, \"Friends\".Instead, we have the narcissistic Jerry, constantly mining the minutiae of everyday detail for every bit of situational comedy; we have the hyper-aggressive Elaine, whose strings of breakups with boyfriends are as impressive as her petty neuroses leading up to the breakups themselves; the ultimate schlub-loser George, who lies to every single woman he dates, sells faulty equipment to the handicapped and muscles off women and children when fleeing an apartment fire; and the impossibly inventive physical comedy of the entrepreneur cum schmooze Kramer.Over and over again, week in and week out, the quartet discuss trivialities with unbridled zeal, as the non-descript narrative pings from one mundane setting to another. Seldom has such wit been generated by such gargantually pointless human endeavours. That is where the brilliance of Seinfeld lies, in the ability to go to the most bizarre ends to fulfill the potential of a less than hopeful comedic premise; and the endless, pointlessly smug and nihilistic banter that almost invariably escalates into some of TV's classic lines, such as when George shouts triumphantly after winning an argument that \"there is no bigger loser than me!\".Surely, we won't find something like this again, for many more years to come."
    },
    {
      "username": "shrek2004",
      "userUrl": "https://www.imdb.com/user/ur2528485",
      "reviewLink": "https://www.imdb.com/review/rw0278208",
      "warningSpoilers": false,
      "date": "25 July 2003",
      "rate": "",
      "helpful": "179 out of 250 found this helpful.",
      "title": "I Absolutely Love It.",
      "content": "This show was totally unique. Nothing has been done like it before, or since (with the possible exception of the Simpsons, which does mimic some of the \"nothing\" plots a little). While it was about nothing, it was really about everything--but the little things that no one thinks about, like giving your bank code to your fiancé. I also liked how this show was the last of the \"non-fashion\" shows.You always saw Kramer wear the same ridiculous jacket, pants, and shirt. George always had those too-small plaid shirts and even Jerry had the black-and-gray striped shirt we saw him wear in the one where he and George make \"The Pact\". Even Elaine had many of the same clothes, even after her \"make-over\". I mean, I LOVE the show Friends but every time the guys have a new turtleneck or sweater, and the girls always have a new dress or a new pair of pants, which is totally unrealistic (for the guys anyway).This show had consistent humour all the way up to the last season, which is unusual for many shows. I LOVED George styling his hair to look like the bald guy from NYPD Blue, Elaine buying the JuJubes on the way to the hospital, Uncle Leo yelling \"STOP THE SHOW\" on the PBS special--these were just some of the great moments! This show is the best on televison, and if you haven't seen it, go and watch now!"
    },
    {
      "username": "WrathChld",
      "userUrl": "https://www.imdb.com/user/ur1115599",
      "reviewLink": "https://www.imdb.com/review/rw0278244",
      "warningSpoilers": false,
      "date": "6 May 2004",
      "rate": "10",
      "helpful": "167 out of 232 found this helpful.",
      "title": "Forever greatness",
      "content": "I was sitting in my apartment tonight watching the end of a sitcom era with the last \"friends\" episode and it brought me back to 1998 when we all said goodbye to \"seinfeld\". I won't sit here and debate, which was the better show because, lets face facts they both did a fine job. They are two very successful sitcoms, but other than that they really had an entirely different feel and format. \"Seinfeld\" gave us all so many catch phrases and we all continue to enjoy these characters and episodes six years after the show ended. I just love it. I constantly find myself reciting lines from the show with a good friend of mine. This show rocks. It will always be a great show. I will continue to watch this show in reruns over and over. It sure doesn't get old.I wanted to add some favorite lines or scenes from the show, but there are truly too many. Kramer, Elaine, George, and Jerry just rule and have such a great chemistry. The additional characters throughout the years were cool too. Some of my favorites were Puddy, Peterman, and Frank Castanza. Oh greatness.So keep Seinfeld alive in your hearts and keeping watching the show about nothing.Giddie Up!"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2362210",
      "warningSpoilers": false,
      "date": "1 January 2011",
      "rate": "10",
      "helpful": "36 out of 51 found this helpful.",
      "title": "Simply superb!",
      "content": "There isn't much I can add to how brilliant Seinfeld is. It is a true gem of a sit-com and has very quickly become one of my favourite shows of all time. It looks lovely, the photography is always skillful and the locations and sets are striking and effective. The music is pretty infectious, granted it is not the best asset of the show but it is good. The best asset of the show is easily the writing. Very rarely has there been a sitcom or a show even where the writing is consistently witty and hilarious, even in the weaker episodes it makes its mark. The story lines and episode ideas are outstanding, maybe it doesn't always cover new ground but the situations are always superbly realised and priceless. In fact there are several episodes of Seinfeld I would deem masterpieces of comedy. The characters do have flaws certainly, but they are also likable. And the acting is brilliant, with the interplay shining in every single episode. Overall, superb comedy show and deserves to be up there with the best. 10/10 Bethany Cox"
    },
    {
      "username": "Kingslaay",
      "userUrl": "https://www.imdb.com/user/ur51094543",
      "reviewLink": "https://www.imdb.com/review/rw3635907",
      "warningSpoilers": false,
      "date": "8 February 2017",
      "rate": "10",
      "helpful": "42 out of 60 found this helpful.",
      "title": "The Greatest Sitcom of all time",
      "content": "The Beatles have been regarded as one of the greatest, if not the greatest, band of all time. You had 4 gifted musicians who were so individually talented and as a whole they changed music forever. The same can be said for the 4 main cast members of Seinfeld in the television space. For almost a decade this show has entertained not just the United States but the entire world. Each individual cast member was so talented and took their eccentric character to new heights. Over a period of time you grew to love the fab four. Seinfeld is a show that got everything right. From incredible writing, catch phrases to award worthy performances. Even their guest stars were hitting home runs. The episodes and plots Seinfeld brought us was something we all could relate and react to. We were also treated to first class Stand Up comedy from Jerry Seinfeld. This show is simply timeless.New shows could only dream to capture the greatness and ratings of this immortal show. The brilliance of the show could be seen in the acclaimed Contest episode where not a word had to be said to convey what it was about. Nowadays its pretty vulgar and leaves little room to think. I wish I could give this an 11 out of 10. Go watch it and don't hesitate to buy the entire series, its more than worth it. This cast and show certainly belt it out to the back row and make you feel it."
    },
    {
      "username": "MAHAYAMA",
      "userUrl": "https://www.imdb.com/user/ur160119895",
      "reviewLink": "https://www.imdb.com/review/rw8745591",
      "warningSpoilers": false,
      "date": "19 December 2022",
      "rate": "10",
      "helpful": "30 out of 31 found this helpful.",
      "title": "Seinfeld. Where to begin with the show about nothing?",
      "content": "The best sitcom ever to be produced and aired on TV. Every episode is memorable and has great joke after joke which many still live on today such as \"These pretzels are making me thirsty!\" or \"Can you spare a square?\" Seinfeld can make any situation funny and relatable, whether it be going on a trip to the Hamptons, trying to open a pizza place where you make your own pie or getting stuck in a limo with Nazis pointing guns at you.Of course, the main appeal of Seinfeld comes from the characters: The sarcastic and germaphobic Jerry Seinfeld, the neurotic, short, stocky, slow-witted, bald man with glasses George Costanza, the clever, sassy Elaine Benes, the wacky, next-door neighbour Cosmo Kramer and the most vile mailman you'll ever meet... Newman."
    },
    {
      "username": "Pacroid",
      "userUrl": "https://www.imdb.com/user/ur155929425",
      "reviewLink": "https://www.imdb.com/review/rw8466946",
      "warningSpoilers": false,
      "date": "19 August 2022",
      "rate": "9",
      "helpful": "28 out of 30 found this helpful.",
      "title": "After 20 years, this show still delivers.",
      "content": "Just recently found this show again on Netflix and threw on a episode here and there until the bug got me and finally had to sit down and watch from the start.So far , I am currently watching the series twice now. This show really did lean hard into it's strength, which was, \"this show is about nothing\" and I love that.I remember at the time, fans were upset about how the series ended, but after all this time. I'm perfectly happy with how this show ended. It ended just like how the show presented itself."
    },
    {
      "username": "jp88",
      "userUrl": "https://www.imdb.com/user/ur4082954",
      "reviewLink": "https://www.imdb.com/review/rw1001382",
      "warningSpoilers": false,
      "date": "17 January 2005",
      "rate": "",
      "helpful": "402 out of 490 found this helpful.",
      "title": "The best show ever",
      "content": "It has ended 6 years ago and we still talk about it, i think that this shows us how fantastic this series was. There are some new programmes that are good, but any of them is half as interesting as Seinfeld was. Many of its episodes are really comedy masterpieces. After watching one of them you become an addict. The characters are fantastic, the actors performed so well that you can't think of them like anything but the character they played, maybe this is the reason because they couldn't success in other shows. The writers who could do 8 seasons of a \"show about nothing\" doing each episode funnier than the last one deserves our respect and admiration. To sum up, Seinfeld rules"
    },
    {
      "username": "gcanfield-29727",
      "userUrl": "https://www.imdb.com/user/ur107967785",
      "reviewLink": "https://www.imdb.com/review/rw6513067",
      "warningSpoilers": true,
      "date": "22 January 2021",
      "rate": "9",
      "helpful": "22 out of 30 found this helpful.",
      "title": "It wasn't about \"nothing.\"",
      "content": "I've always thought the \"show about nothing\" thing was inaccurate. The show was really about \"everything.\" The pilot episode has Jerry and George, pretty much as the characters evolve. However, Kramer is too stupid at first, and there's no Elaine. The show gets funnier as the seasons move along. The best episodes come about half-way into the series. All in all, a great series-and possibly the last truly classic TV show."
    },
    {
      "username": "chad-61313",
      "userUrl": "https://www.imdb.com/user/ur85840654",
      "reviewLink": "https://www.imdb.com/review/rw8338463",
      "warningSpoilers": false,
      "date": "16 July 2022",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "Still Love Em",
      "content": "After all these years, this still remains the show I turn to for a lot of laughs. I loved the Big Bang Theory until the characters started to change, or \"grow\" as some say - but they turned into unlikeable, non-entertaining characters. Everyone on Seinfeld stayed true to their character throughout their 9 year run. Even when George got engaged, he was still George! They didn't change him into someone else. Don't get me wrong, there are and were many sitcoms out there that are awesome! But for some reason, for me, this will always be my go to one."
    },
    {
      "username": "cyrusmken-63231",
      "userUrl": "https://www.imdb.com/user/ur159276587",
      "reviewLink": "https://www.imdb.com/review/rw8698269",
      "warningSpoilers": true,
      "date": "27 November 2022",
      "rate": "10",
      "helpful": "26 out of 27 found this helpful.",
      "title": "Was Seinfeld sitcom based on the cartoon Animaniacs or was Animaniacs based off Seinfeld?",
      "content": "There is a lot of similarities between Animaniacs and Seinfeld with the wacky expressions on everybody on the show and cartoon. I don't know if people ever thought of that . Elaine reminds me of Dot, Kramer has Wakko's personality , Jerry was like Yakko and George was like Dr. Scratcnsniff or the CEO of War ner brother next time you watch one of their other compare, this is also almost like comparing the Flintstones to the Honeymooners , I am a fan of both cartoons and sitcom, I hope this gets out to Jerry or Larry David and Stephen Spielberg geniuses in comedy , I got the Seinfeld sitcom box set. I watch over and over and I watch Animaniacs over again and again."
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw2210869",
      "warningSpoilers": true,
      "date": "21 February 2010",
      "rate": "10",
      "helpful": "25 out of 39 found this helpful.",
      "title": "One of the cleverest TV shows ever",
      "content": "To me, Seinfeld can basically be broken into three parts - seasons one and two where the series is just finding itself, seasons three through seven in which absolutely everything clicks due to the cast's great on-screen rapport and the genius of Larry David, and the last two seasons after Larry David's departure in which the focus shifted somewhat from a satirical look at the uglier side of human nature to zany comedy. Usually every episode was a stand-alone. In fact, some of the early episodes are so stand-alone as to have the audience wonder what happened. In season two's \"The Deal\", Elaine and Jerry decide to try combining their current friendship (\"this\") with their past by sleeping together (\"that\"). As George portends though, it is pretty much impossible to mix \"this and that\" without eventually losing both. The end of the episode shows Jerry and Elaine pretty much settling into \"this that and the other\" - a romantic relationship - and then the series just drops the subject like the whole episode never happened.Occasionally Seinfeld would have a story arc of sorts. For example, in season four the show poked fun at network television executives and their decision-making process when George and Jerry wind up pitching the idea for \"a TV show about nothing\" to NBC. The two offer up what is essentially the script of the widely acclaimed Seinfeld episode \"The Chinese Restaurant\". The network suits are unimpressed. As an alternative George and Jerry present a ridiculous plot in which a judge sentences someone who has hit Jerry's car to be his butler. This time the suits are bowled over. Seinfeld also truly had a gift for entertaining while pushing the audience to the brink of offense. \"The Bubble Boy\" presents the audience with a rude and obnoxious individual as the victim of an immune deficiency disease versus the patient angels that usually play this role. \"The Outing\" introduced the phrase \"not that there's anything wrong with that\" into American pop culture and also smartly satirized political correctness. \"The Junior Mint\" shows George in familiar form when he pleads with Jerry not to intervene to save an artist's life because it would devalue the artist's paintings he has purchased in anticipation of that same artist's death.The show is often absurd, and though it seems impossible that such a group of self-absorbed people could carry on even the pretense of a multi-year friendship, something about it is oddly familiar to most of us. That is at least partly because of the great interaction between the main characters in which they have both comic and straight-man duties depending on the situation, making their relationships seem real although exaggerated."
    },
    {
      "username": "deloudelouvain",
      "userUrl": "https://www.imdb.com/user/ur58525162",
      "reviewLink": "https://www.imdb.com/review/rw6803604",
      "warningSpoilers": false,
      "date": "11 April 2021",
      "rate": "10",
      "helpful": "18 out of 27 found this helpful.",
      "title": "The show about nothing everybody loves.",
      "content": "If there is one series I never get tired rewatching, it must be Seinfeld. Every single episode is funny, and stays funny, even after rewatching this show for the fourth time. The \"show\" about \"nothing\", it's exactly what it could be, just friends talking about their daily problems, like we all do with our friends. The situations they are getting themselves into are all funny, with some hilarious ones as well. After nine seasons we all have a favorite character as you grow into the show and identify yourself or friends, or family to a specific character of the show. My favorites are George Costanza played by Jason Alexander and Elaine Benes played by Julia Louis-Dreyfus. Of course all the other charcacters are good as well but these two are standing out in Seinfeld. After so many years my wife and I are still talking about some scenes in our daily life, like \"no soup for you\" or \"Vandalay Industries\", or just imitating outstanding characters like Newman, Estelle and Frank Costanza, Lippman and Peterman and so many others. Just talking about some episodes is already enough to remember and to start laughing. Seinfeld had an impact on a lot of people. It's a show that should never have ended."
    },
    {
      "username": "zutterjp48",
      "userUrl": "https://www.imdb.com/user/ur18799880",
      "reviewLink": "https://www.imdb.com/review/rw5226774",
      "warningSpoilers": false,
      "date": "1 November 2019",
      "rate": "8",
      "helpful": "6 out of 7 found this helpful.",
      "title": "A very good sitcom.",
      "content": "This sitcom shows the everyday life of Jerrry Seinfeld, a stand-up artist and his three friends, George Costanza, an unlucky man, Elaine Benes ,his former girlfriend and Cosmo Kramer, his crazy but pleasant neighbour. I enjoyed very much this sitcom because it was based on the everyday life (to buy something, to meet a new girlfriend,etc) and always with humoristic comments at the end of the episode. I forgot an adjective: neurotic, Jerry, George, Cosmo and Elaine are neurotic persons,but they are also pleasant persons."
    },
    {
      "username": "jack_o_hasanov_imdb",
      "userUrl": "https://www.imdb.com/user/ur55640799",
      "reviewLink": "https://www.imdb.com/review/rw7310345",
      "warningSpoilers": false,
      "date": "5 September 2021",
      "rate": "9",
      "helpful": "15 out of 22 found this helpful.",
      "title": "Very Good",
      "content": "I've had a bad illness for a few months. That's why I couldn't go to the office.. I was doing my job at home. At the same time, I was very depressed. Yesterday I learned that I will get better. This is very good news. I watched this series in the last 6 months (when I was sick) and it made me very happy. It was funny and entertaining. I liked it very much. Thanks !"
    },
    {
      "username": "calorne",
      "userUrl": "https://www.imdb.com/user/ur65401550",
      "reviewLink": "https://www.imdb.com/review/rw7414125",
      "warningSpoilers": false,
      "date": "5 October 2021",
      "rate": "10",
      "helpful": "14 out of 19 found this helpful.",
      "title": "One of the greatest comedy shows of all time",
      "content": "I was delighted to see that Seinfeld has popped up on a streaming service that I use. It's a gift from the heavens. Well not exactly a gift as I pay a monthly subscription!I've never bought their mantra that it's a show about nothing. That's not true - there's always a storyline about something. Soup, cantaloupes. You name it it's there. But it's a nice bit of spin to draw attention to the show. (Why do they call melons cantaloupes- it makes them sound like they should be prancing around the savanna?)But fancy footwork isn't necessary. It's a really funny show with excellent acting. I particularly like Elaine who is indeed a provider of divine comedy.I think it improved when they stopped splicing in the stand-up comedy routines and just told the stories. The stand-up was funny, but I think the show works best when it stands on its own 2 feet."
    },
    {
      "username": "mdoabr",
      "userUrl": "https://www.imdb.com/user/ur86711894",
      "reviewLink": "https://www.imdb.com/review/rw8766861",
      "warningSpoilers": false,
      "date": "30 December 2022",
      "rate": "10",
      "helpful": "26 out of 27 found this helpful.",
      "title": "Comedy of things that can really happen.",
      "content": "I love the show and I watch almost everyday, it makes me to forget all about daily activities. A great way to relax before going sleep.I believe that somebody out there went through some those situations that we see here.I have the impression that episodes had some inspiration in some similar real situations and they are doing a parodia about it. It would be interested to find more information of any correlation.It is very interested how they can great 3 or 4 stories that interconnect to each other and have a great end.How would it be the show nowadays (2022), with all new technologies, social media, high definition and more scrutiny on comedy."
    }
  ],
  "errorMessage": ""
}