{
  "imDbId": "tt13111040",
  "title": "The Offer",
  "fullTitle": "The Offer (TV Series 2022–2022)",
  "type": "TVSeries",
  "year": "2022",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8977625",
      "warningSpoilers": false,
      "date": "7 April 2023",
      "rate": "9",
      "helpful": "36 out of 36 found this helpful.",
      "title": "This was so good!",
      "content": "It's hard to even describe how much I enjoyed The Offer. All I know is I wasn't expecting that. It's easily one of the most surprising shows I've ever seem. I'm not saying it the best I've ever seem just surprised by how much I liked it. After reading all the great reviews I thought it would be good but this show is beyond just good. I couldn't get enough. I binged the entire series over a weekend and was sad when it was over. The writing is as good as a tv show gets, the acting is great, and every episode is entertaining enough to hold your attention throughout the series. I'm a huge Godfather fan but you don't have to like or even know anything about it to enjoy this. It's just a little more interesting if you do. If you're looking for a new show to watch or binge then look no further. I promise you won't be disappointed!"
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8323711",
      "warningSpoilers": false,
      "date": "11 July 2022",
      "rate": "9",
      "helpful": "81 out of 84 found this helpful.",
      "title": "So much better than I expected!",
      "content": "I didn't really know what to expect from The Offer. Even though I love The Godfather as much as everyone else, I wasn't all the interested on how the film was made. I was wrong! After reading all the great reviews and seeing the great cast I thought I'd give it a chance. I'm absolutely blown away by how much I like this show. You don't have to be a fan of The Godfather or have even seen it to enjoy this show. It's not the best series I've ever seen but it's still a really good and interesting series. Miles Teller, Giovanni Robison, Matthew Goode and the rest of this fantastic cast all do an amazing job. If you have reservations like I did on how good a show about a a movie getting made can be...don't! I absolutely recommend this show!"
    },
    {
      "username": "southdavid",
      "userUrl": "https://www.imdb.com/user/ur0715971",
      "reviewLink": "https://www.imdb.com/review/rw8918583",
      "warningSpoilers": false,
      "date": "10 March 2023",
      "rate": "8",
      "helpful": "27 out of 28 found this helpful.",
      "title": "Ruddy Hell !",
      "content": "I had intended to watch this series nearer the time it was released, but for whatever reason lost track of it, it has now arrived on the Paramount Plus system in the UK and I was really happy to get the opportunity. Despite the mixed response it seemed to have received, I love anything that recounts the story of Hollywood, even one as relatively recent as this and I really enjoyed it.Having left his job as a computer programmer, and successfully pitched the hit TV series \"Hogan's Heroes\", Albert Ruddy (Miles Teller) joins Paramount Pictures as a producer. For his first film, he convinces head of the studio Robert Evans (Matthew Goode) to hand him the reins of \"The Godfather\", an adaptation of the phenomenally successful book. The production though was not without controversy, as strong opposition came from the Italian-American Civil Rights league, which was founded by mobster Joe Colombo (Giovanni Ribisi). Ruddy negotiates this, and several other emergencies as he fights to get the movie finished.There are several really good performances in this, from Teller himself, from Dan Fogler as Francis Ford Coppola, from Burn Gorman as Charles Bluhdorn and Juno Temple as Bettye Mccartt. My undeniable favourite though was Matthew Goode portrayal of Robert Evans, who I was familiar with particularly from \"The Kid Stays in the Picture\" documentary. Goode does exaggerate the voice a tiny bit, but as an indication of what Robert Evans was like, I think it's a great turn and it's unfortunately that the performance wasn't better rewarded come the awards season.For the bulk of the series, there are two stories told, though they intersect at various points. Colombo establishes the league ostensibly in opposition to the production of the film, and under particular pressure from Sinatra to stop it. He establishes a relationship with Ruddy though and, through a number of compromises, he not only reverses his position, but actively supports the production. You also have the pressures of Paramount, that Gulf and Western are looking to offload but whose leader, Charles Bluhdorn, has a soft spot for.I can get that criticism that I saw that there are two many plot strands but for me, who knows a little bit about what is going to happen to the various films, properties and stars mentioned, I thought it was brilliant. I'd love to see Goode come back to play Evans again in a look at the production of \"The Cotton Club\" and the aftermath of that."
    },
    {
      "username": "ricky_dry_county",
      "userUrl": "https://www.imdb.com/user/ur21318765",
      "reviewLink": "https://www.imdb.com/review/rw8961904",
      "warningSpoilers": false,
      "date": "31 March 2023",
      "rate": "9",
      "helpful": "35 out of 36 found this helpful.",
      "title": "Entertaining!",
      "content": "Great: -- Mathhew Goode's acting. He was one of the only ones to actually nail down the old timey accent & mannerisms.-- Godfather Cast: From a frighteningly similar Al Pacino to a wondrous Brando, it was spot on.-- Giovanni Rivision did fantastic.-- Pacing: I'm sure it took a helluva lot of liberties with timelines & events, but it kept the pace rolling well.--Cinematography: A.-- Plot/Topic: Kudos to whoever thought it'd be a great idea to showcase this. The hustle, passion & struggle depicted here was almost inspiring!Miss: -- Juno Temple's character's constant need to bring in modernism/gender narratives etc was a bit off putting & served to drag you out of the time period. Her association with Ted Lasso, her poodle like expression & failure to completely drop her thick English accent didn't help.-- I like Miles Teller but his acting was really wooden here. Maybe the guy he was playing was this way, I doubt it. He almost never showed any extreme emotion even when things seemed to wildly derail, from divorce to mob threats to professional assassination.-- The guy who played Caesar. Is he related to Bobby Canavale? His acting was terrible."
    },
    {
      "username": "julieshotmail",
      "userUrl": "https://www.imdb.com/user/ur110936802",
      "reviewLink": "https://www.imdb.com/review/rw8961187",
      "warningSpoilers": false,
      "date": "30 March 2023",
      "rate": "9",
      "helpful": "33 out of 35 found this helpful.",
      "title": "This made me want to watch \"The Godfather\"",
      "content": "I like movies in general but somehow \"The Godfather\" has eluded me. Maybe it's the lengthy running time, dark lighting, or gangster shenanigans, but it is just something I haven't sought out to sit and watch. Now I hear about a TV series called \"The Offer,\" its critical acclaim and high ratings, so I get intrigued, especially when I learn that the subject matter is about the making of \"The Godfather.\" Is it a documentary? Why is the rating so high? I give the first episode a whirl and quickly realize it's a dramatization of events in the making of this classic movie, of course. As the series progresses, because it is so exquisitely made, I become more and more interested in the actual movie and so I finally give it a watch. All this time, I have been missing out on the burgeoning talents of Al Pacino in the early days, the artistic storytelling, and all the drama from everyone involved. \"The Offer\" does great service to viewers like me, and without it, I would have been deprived of this classic cinematic experience."
    },
    {
      "username": "MickyG333",
      "userUrl": "https://www.imdb.com/user/ur22033950",
      "reviewLink": "https://www.imdb.com/review/rw8151560",
      "warningSpoilers": false,
      "date": "17 May 2022",
      "rate": "10",
      "helpful": "80 out of 92 found this helpful.",
      "title": "There are no words... 10/10",
      "content": "This is a show about the making of a movie, but it's so very much more. It's about the people who birthed \"The Godfather\", and the extreme adversity which hindered the creation of this immortal film. I watched the first 5 episodes in a day.We follow an amateur producer, Albert Ruddy (Miles Teller), with minimal experience on the Hollywood scene, but he is a force, a powerhouse with a vision. His primary role with Paramount is to make this \"mafia\" movie that it seems nobody (who was anybody) wants on the screen. There is a lot of pressure from Frank Sinatra, the government, the Italians, and others to halt the making of this film in its tracks. At any given time any or all of these powerful entities are fighting for any hint of this movie to be eradicated from existence - never to be conceived, and promptly to be forgotten. But Mr. Ruddy's persistence and sheer will are what eventually lead to the realization of the greatest, or at least one of the top five greatest films of all time. Miles Teller as an actor proves in this that he is literally capable of anything, and his inexhaustible skills are apparent. Bravo. 10/10. Award-worthy.The over-indulgent and bloated executives at an ailing Paramount allow Ruddy to assemble what appears to be a bunch of aspiring indigents...novices so to speak; to piece together a fragmented but potentially splendorous film. This is their story.Ruddy's persistence and focus alone is what brought this dream to fruition, but he needed direction, vision, and inspiration as well. A woman named Bettye McCart (Juno Temple), bulldozes her way into his good graces, and basically takes the assistant position. She senses his brilliance and unequaled drive immediately, and with her own seemingly limitless knowledge of \"the biz\", she is able to enhance his effectiveness. Ms. Temple gives a stellar performance. 9.0/10Ruddy meets an alluring woman named Francoise Glazer (Nora Arnezeder), who wishes to share his aspirations, and they quickly fall in love. Kudos to Arnezeder's portrayal of this character, as I found her to be startlingly irresistible. Although her screen time was fairly minimal, her character was quite refined - yet another brilliant performance. 8.7/10The executives at Paramount, Matthew Goode as Robert Evans, and Burn Gorman as Charles Bluhdorn are the most profound embodiment of uptight intensity that I've witnessed in a number of years. I'm reminded of some of the great Jack Nicholson roles. Gorman has a very bizarre tone unrivaled by most, and I found myself strangely drawn to his antics. 9.7/10. And Evans, the way he shows anger, disgust, and approval all in the same expression - is quite convincing, and fascinating. 9.3/10.The writer of the novel \"The Godfather\", Mario Puzo, was also invited to write the screenplay for the movie, because Paramount had a limited budget. Oh how fate smiled upon these circumstances, because Puzo (Patrick Gallo) went on to write one of the greatest screenplays of all time. And Patrick Gallo engineered nothing short of a brilliance. I am amazed at all the great performances in this series, it's totally mind-boggling. 9.2/10Guess what? There's still more...Probably my favorite actor in this series is Dan Fogler who portrays Francis Ford Coppola. If Coppola's true nature is similar to what Fogler has illustrated - then I am in love with this man!! What a fascinating and thoroughly compelling director and person Fogler renders for us. The provocative style and essence of Coppola - sheer BRILLIANCE. I feel like I keep repeating that word. The way he fashions The Godfather, primarily sharing a co-vision with Puzo, it's so tangible and full of emotional depth. 10/10. Award-worthy.Giovanni Ribisi as Joe Colombo (real mafia mob boss), is a very chummy sort of scary guy. You really want to like him, but we are reminded from time to time that he is indeed a real gangster, a true thug. Ribisi captures the essence of being a lovable bad guy. I have the faint impression that he wanted to be Marlon Brando (many similarities to Don Corleone), but was probably informed that it was too small a part. All said - 8.8/10Colin Hanks as Barry Lapidus (another angry and impatient man) 8.5/10. I am surprised he had one of the very lesser roles in this, being such an accomplished actor himself.Do you have to love The Godfather to love this show? I don't know, I love the Godfather, so I might be biased. However, my love for The Godfather notwithstanding, this is (and likely will remain) the #1 show of 2022 (for me). I find it difficult to imagine anything will surpass it. Everything is 10/10: writing, directing, pacing, cinematography, acting, dialogue."
    },
    {
      "username": "leftbanker-1",
      "userUrl": "https://www.imdb.com/user/ur20309759",
      "reviewLink": "https://www.imdb.com/review/rw8098451",
      "warningSpoilers": false,
      "date": "28 April 2022",
      "rate": "10",
      "helpful": "150 out of 181 found this helpful.",
      "title": "Life Imitating Art Imitating Life...or Is it the Other Way Around?",
      "content": "This series is done with so much love and reverence for the film that it's impossible not to like if you loved The Godfather, and who doesn't like that movie?After a single episode, I was all in. It's the perfect mix of great acting, good story, and a fun script. I was dubious about this when I saw the trailer, but my doubts were gone almost from the beginning of episode one. The movie was larger than life, so a series about how the film came to be was definitely worth a shot.I may come back and change this initial euphoria, but for now, this is one of the best things I've seen in a long while. I mean, come on! It's a series about the making of the most epic gangster movie and one of the best films ever made, and it has gangsters in it. What more could anyone want?The scenes with Coppola and Mario Puzo are genius. They both make the process of writing look exciting, positively thrilling like I've never seen before.One complaint, and it's major. There are WAY too many scenes shot in almost complete darkness. I am so fed up with this technique and for the life of me, I don't understand why directors think shooting in the dark is so cool. Just about every scene is shot in candlelight, an unlit room with light shining through a curtained window, a club or office as dark as a cave with visibility at about ten feet. If there is daylight, it's only to show characters walking into ill-lit rooms, or shadows playing a prominent role. Puzo and his wife sit in a dark kitchen. Couldn't he pay the electric bill? Turn on a light!When Puzo sees the line at the bookstore the lighting was so bad that I could barely see anyone. Wasn't the whole point of the scene to show a mob? It was like people hiding in the dark. Why was this scene at night? It was a book signing. You can sign a book during the daylight hours and viewers might be able to see something instead of squinting at the screen.If it were available, I would have watched the entire series in one night. This could be the best thing ever on TV. I almost want to tell viewers to wait until it's all available before beginning the series so as not to have the anguish of waiting for the next installment in what could be the best TV series ever-no kiddingIf you would have told me beforehand that Giovani Ribisi plays Joe Colombo, I would have laughed, or at least been a bit skeptical. He's a stroke of pure brilliance in a series that is loaded with talent and great performances. I had a difficult time recognizing many of the actors because they were so far from anything they'd done before.Another complaint I have is that we have to wait around until the end of June to see this through to the conclusion. I want it now! This reminds me of a true story. Back in about 1989, a group of friends were sitting in my living room ready to go out for the night when The Godfather came on the TV on some network station. We all promised that we'd go out after watching a few scenes. I mean, we'd all seen it a million times already. Well over an hour later, when Michael goes into the bathroom and comes out with the pistol, there was a message on the screen: To Be Continued Tomorrow.We all said to heck with that, and someone went out to the video store to rent a copy so we could finish watching it for the 1,000,001 time. I don't remember what happened after that, but we probably went out to a bar and talked about the movie for the millionth time. The moral to this story is don't jerk people around by making them wait. Just hand over the product like they do at Netflix."
    },
    {
      "username": "indialm",
      "userUrl": "https://www.imdb.com/user/ur0688073",
      "reviewLink": "https://www.imdb.com/review/rw8099657",
      "warningSpoilers": false,
      "date": "29 April 2022",
      "rate": "10",
      "helpful": "174 out of 194 found this helpful.",
      "title": "Matthew Goode is a gem",
      "content": "Matthew Goode as Bob Evans is some wonderful casting and he has the persona and voice down pat. If you are interested in how movies are made and who the people are behind them you'll find this fascinating. If you aren't, you won't."
    },
    {
      "username": "martinpersson97",
      "userUrl": "https://www.imdb.com/user/ur45812214",
      "reviewLink": "https://www.imdb.com/review/rw8760800",
      "warningSpoilers": true,
      "date": "27 December 2022",
      "rate": "9",
      "helpful": "24 out of 26 found this helpful.",
      "title": "This is one you can't refuse",
      "content": "A show about the making of The Godfather sounds like a very interesting idea, and it sure pays off.Showcasing a very talented cast of actors, and an overall great sense of cinematography and writing gives this a special flair that actually makes it feel like The Godfather films, even though it is a fictionalization of the background story.Some events might be a bit romanticized or simplified to make it all more interesting - but that's what any great adaptation should aspire to do. The essence of it all, the risks taken in making this human gangster drama, is conveyed very well througy the writing and performances, and like stated above, it feels very similar to that of an actual Godfather TV show, with its gangster dramas and in how it delves into the human psyche.Overall, a fantastic show!"
    },
    {
      "username": "paiello-44319",
      "userUrl": "https://www.imdb.com/user/ur66486269",
      "reviewLink": "https://www.imdb.com/review/rw8884807",
      "warningSpoilers": false,
      "date": "21 February 2023",
      "rate": "9",
      "helpful": "26 out of 28 found this helpful.",
      "title": "It's a tie between The Offer and Fleishman",
      "content": "Absolutely terrific series that I highly recommend. Well deserving of its lofty high IMDB score of 8+. There's been talk that Hollywood is lacking true male movie stars. Myles Teller is looking to fill that role.The only reason I didn't give this series a ten out of ten was because from what I've read online, it's pretty far removed from the true story.That being said, the historical fiction around this series is true enough to make it a solid winner.As I mentioned Myles Teller is great but he's more of a straight man to fantastic characters such as Mathew Goode's Bob Evans. He basically steals the show and it's well deserved. Everyone in this ensemble is wonderful. Can't say enough about how well this series was executed. I may even watch it a second time, something I never do.Bravo!"
    },
    {
      "username": "dogonlion",
      "userUrl": "https://www.imdb.com/user/ur67314647",
      "reviewLink": "https://www.imdb.com/review/rw8099730",
      "warningSpoilers": false,
      "date": "29 April 2022",
      "rate": "10",
      "helpful": "90 out of 111 found this helpful.",
      "title": "Excellent!",
      "content": "This is now my favorite show. I think it helps to have seen The Godfather, be a fan and have interest in the circumstances in which the movie was made. I think those who think this is boring may have no such interest. With that out of the way, this show is awesome. Ive been having a hard time with cheap biopics made these days with the fake wigs and actors that don't even look like the people they portray. Such bombs are Winning Times and First Lady.The Offer looks genuine and the actors are all awesome and established. Try to find a photo of the real Mario Puzo and compare him to the actor. They look like brothers. Same with the Francis Ford Coppola character. I had no problem being fully immersed in the story. The first episode set things up real nice and I can't wait to watch more."
    },
    {
      "username": "syd9907",
      "userUrl": "https://www.imdb.com/user/ur24917648",
      "reviewLink": "https://www.imdb.com/review/rw8099909",
      "warningSpoilers": false,
      "date": "29 April 2022",
      "rate": "9",
      "helpful": "94 out of 112 found this helpful.",
      "title": "Bloated As Hell and I LOVE It!",
      "content": "I got sucked in with The Offer. Incredible sets and definitely period correct. Yes there's some exaggerated performances, and it's bloated as Hell with subplots, and I don't know why, but that's what makes The Offer fun. I'm hooked, flaws and all. I love period pieces, I'm a movie and a Godfather lover from way back.I know there's some whining, rich painfully out-of-touch with reality Hollywood folks (I've heard it all a million times), name-dropping, and talking about they knew the real people portrayed in this series, saying this not how it happened, blah, blah, blah, and who think they know it all...they're annoying. No one ever said this series was a Ken Burns documentary. Get over yourselves. But for the rest of us who love period pieces, sometimes you just want to time travel for some escapist fun. So take the bad reviews with a grain of salt, because some of these professional movie critics, know the rich people complaining and want to stay in their good graces.Miles Teller is superb as Al Ruddy and Juno Temple nails per part as his trusted sidekick/secretary/friend/shrink. And though. Giovanni Ribisi is getting dragged for his portrayal of an Italian crime boss, I think he's perfect in that role. And Matthew Goode as Robert Evans is hilarious, and from what I've heard, he's also spot-on. There is no bad casting in The Offer and it harkens back to an era of pure hedonistic pleasure, early 70s fashion and a studio system that had no real vision and The Godfather scared them because it stepped outside of the norm."
    },
    {
      "username": "BoomerDT",
      "userUrl": "https://www.imdb.com/user/ur49827432",
      "reviewLink": "https://www.imdb.com/review/rw8653064",
      "warningSpoilers": false,
      "date": "3 November 2022",
      "rate": "9",
      "helpful": "18 out of 20 found this helpful.",
      "title": "Very Entertaining!",
      "content": "Great idea, making a series about the making of \"The Godfather.\" Now I don't know where the truth ends and the fictional part takes over...the film world has been known to embellish the truth. But as is it's a great story about producer Albert Ruddy as he succeeded in adapting author Mario Puzo's best seller into a great film. The adaptation was faithful, there was nothing in the film that wasn't in the book, although quite a bit had to be left out. According to \"The Offer\" the Mafia didn't want the film made, but Ruddy was able to convince Joe Columbo that it wouldn't be a deragatory presentation. Also Paramount studios, who were now owned by Gulf & Western, were more concerned about production costs than quality and much of the story deals with this infighting. The only weakness is that it becomes too much of a story about Paramount Sr VP Robert Evans, legendary Hollywood womanizer, coke head and egotist, who did throw restrained support to the project, and to Ruddy and Director Francis Coppola. Solid performances from a large cast, quite a bit of humor. One other complaint-signing up to Paramount Plus for a free trial is difficult. As is canceling after completion. Also it has commercials. No thanks, there are better streaming services."
    },
    {
      "username": "ecsecs-91225",
      "userUrl": "https://www.imdb.com/user/ur74364093",
      "reviewLink": "https://www.imdb.com/review/rw8154084",
      "warningSpoilers": false,
      "date": "18 May 2022",
      "rate": "10",
      "helpful": "56 out of 67 found this helpful.",
      "title": "And I never rated anything a 10...",
      "content": "Can't believe how goo this is. There's is not one aspect of this series that is off the mark. The production, the acting, the dialog, the pace, drama, humor, tension, on and on there are no faults here. Very entertaining from beginning to end. Every episode is better that the prior one hands down."
    },
    {
      "username": "rich-fouts",
      "userUrl": "https://www.imdb.com/user/ur51907450",
      "reviewLink": "https://www.imdb.com/review/rw8437752",
      "warningSpoilers": false,
      "date": "13 August 2022",
      "rate": "10",
      "helpful": "21 out of 24 found this helpful.",
      "title": "So Many Brilliant Performances",
      "content": "This series is about so many things, mostly about an American Dreamer making a movie, in a sort of perverted way, about the American Dream. Miles Teller as producer Al Ruddy, gets early advice to not let anything get in the way of his movie. It's advice he takes seriously and there are at least a dozen times The Godfather would have been shelved had any other producer in his or her right mind been at the wheel. To say The Godfather encountered obstacles would be the understatement of the century. Many of them are so comical, and the solutions to crushing said obstacles knocked me off my chair more than once.So for starters, this is storytelling at its finest, compelling, dramatic, wonderful contrasts between deadpan emotions of Miles Teller with the brilliance of Dan Fogler, who absolutely transforms into the great Coppola himself. Seriously, I thought they had found a way to go back in time and get the master director himself. Also remarkable is the hilarious (and I mean hilarious) Matthew Goode as Bob Evans. Patrick Gallo, as Mario Puzo, delivers superb chemistry with Fogler, and the two of them together as collaborators are one of the best acting duos you'll ever see.As an early Pacino fan, I was especially impressed with the terrific nuances delivered by Anthony Ippolito, who really did his homework. I had forgotten how shy Pacino was in his early years, and Ippolito is just heartbreakingly wonderful as the insecure actor who gets the role of a lifetime.But the performance to end all performances has to be Giovanni Ribisi who just blew me away in all of his scenes, which he aptly steals every time. He is SO FUNNY and so clever and just so brilliant. I had to rewind most of his scenes because they were just so darned entertaining.Casting The Godfather was an extraordinary challenge, and thankfully for us, Coppola instinctively knew who would be great in these roles. Fortunately he had Ruddy as his partner to fight the good fight. Had these two not been unrelenting we would have had Robert Redford as Michael, who I am sure would have delivered (as a Northern Italian type) but that would have compromised the whole \"Sicilian thing.\" In a remarkable twist, which is truly Hollywood history, Pacino is swapped with Robert De Niro (who takes Pacino's role in The Gang Can't Shoot Straight, which bombed). De Niro of course, would play Pacino's grandfather in The Godfather II.Nice to see Eric Balfour (who is always fun) show up as Dean Tavoularis. And of course, the brilliant Justin Chambers who's Marlon Brando is show-stopping especially \"the voice.\" Chambers, like Ippolito, pays close attention to the tiny nuances that bring their real-life counterparts to life in very, very impressive ways.This is pure drama of course, because it's about the making of a film, but the comedy is equally brilliant. I'm sure I'll watch this again and again."
    },
    {
      "username": "pranabchaudhury",
      "userUrl": "https://www.imdb.com/user/ur59435050",
      "reviewLink": "https://www.imdb.com/review/rw8947154",
      "warningSpoilers": false,
      "date": "24 March 2023",
      "rate": "9",
      "helpful": "28 out of 29 found this helpful.",
      "title": "Why not everyone's talking about this, Cinephiles it's about how they made one of your beloved movies.",
      "content": "Why not everyone's talking about this, Cinephiles it's about how they made one of your beloved movies. An incredible series that is surely to get its due credit with times. Loved it.A series about the making of The Godfather by its producer Al Ruddy's perspective. Undoubtedly took many artistic liberties to tell the amazing true story, so many of the things I have seen, & read over the years, that gave credit to Coppola, this series gives those credits to Ruddy. Balances fact and fiction in such a lovable way. The real-life Mafia struggles juxtaposed against the backdrop of the film & it's making is really intriguing to watch. Acting performances are mind blowing! Matthew Goode, Juno Temple, Burn Gorman are obviously excellent, steals every scene but Miles Teller has really grown on me since Whiplash to this as Ruddy. The next big thing.. A Must Watch, if you love The Godfather Trilogy...What a great way to celebrate the 51st anniversary of The Godfather, released on this day 1972."
    },
    {
      "username": "philjeudy",
      "userUrl": "https://www.imdb.com/user/ur43282851",
      "reviewLink": "https://www.imdb.com/review/rw8799677",
      "warningSpoilers": false,
      "date": "14 January 2023",
      "rate": "10",
      "helpful": "24 out of 28 found this helpful.",
      "title": "AMAZING!",
      "content": "I can't really know what's true in that serie, I guess I should read the book that they used for the series. But what I know is that this is one of the best story I've ever seen. It's fascinating. Each episode is crazy. I honestly don't care if actors look like the originals, or they don't. I thought it would bother me...but you are captivated by every scene, a d they become the real ones, episode after episode.I'm discovering actors I've never seen, and it's making it like we are back to the seventies. They're all fantastic.And Miles. Miles is turning into one of the best actor of his generation for sure."
    },
    {
      "username": "hoernkeem",
      "userUrl": "https://www.imdb.com/user/ur44376731",
      "reviewLink": "https://www.imdb.com/review/rw8496680",
      "warningSpoilers": false,
      "date": "29 August 2022",
      "rate": "10",
      "helpful": "16 out of 19 found this helpful.",
      "title": "The Offer (2022, Paramount+) Superlative, underrated treasure",
      "content": "'The Offer' is a 2022 television series that debuted on Paramount+ in April of 2022 and had a ten episode run. It fictionalizes, in wonderful detail, the laborious process that was the making of 1972's 'The Godfather', thought by many to be one of the best, if not the best, American film ever made. The stars are all wonderful and luminous. Notably shining are Miles Teller and Juno Temple in lead roles, but also Matthew Goode as Bob Evans, Dan Fogler as Francis Ford Coppola and Burn Gorman as Charles Bludhorn.'The Godfather' is one of those things we have come to think of as a foregone conclusion. Of course it was made and of course it was brilliant kind of like the Mona Lisa or the Statue of Liberty. The making of the film shows that numerous people thought 'The Godfather' was far from a sure thing, and pretty much the production was pushed ever forward thanks in large part to the drive of a small handful of people. Just about everything was questioned from Puzo writing the script, to Coppola as director to the running time to Al Pacino as Michael. Al Ruddy, played by Teller, who produced the movie did anything and everything to get the film made including dealing with the mafia directly who, for various reasons, threatened the productions very existence. It is an amazing thing to see it all come together when we know the classic that 'The Godfather' would go on to be.This show is amazing and if you love 'The Godfather' or are a fan of film history at all you need to watch it. There is a documentary about the life and career of iconic film producer Bob Evans who headed Paramount Pictures during this period called 'The Kid Stays in the Picture'. Matthew Goode is so wonderful in the role of Evans it makes me want to dig up that documentary and watch his story again. Shockingly 'The Offer' did not get any Emmy nominations which I consider a travesty, and more of a result of the show being stuck on Paramount+ where it did not generate much buzz rather than it being on one of the streaming heavy hitters such as HBOmax or Apple or the like. In any case do not let that dissuade you. This is one of the best shows I have seen in quite sometime, and it is especially meaningful to a fan of movies as this is truly an homage and a celebration of the creation of one of our most revered films.Eric's Grade: A."
    },
    {
      "username": "stewiec85",
      "userUrl": "https://www.imdb.com/user/ur23923667",
      "reviewLink": "https://www.imdb.com/review/rw8755699",
      "warningSpoilers": false,
      "date": "25 December 2022",
      "rate": "10",
      "helpful": "24 out of 28 found this helpful.",
      "title": "Shocked the awards people didn't watch it, too good",
      "content": "First of all, this miniseries was just amazing from start to finish. The cast was great, Matthew Goode really steals the show as Robert Evans and my god I'm surprised the golden globes never considered him for a nomination. It's very rare a miniseries comes along to take you back to history and see how one of the greatest movies ever made was made and the people behind the scenes. Every actor didn't miss a note on their characters and it was just amazing. Highly recommend you watch this and join in my anger to the awards people for not recognizing this miniseries this year. Also watch again....."
    },
    {
      "username": "bestactor",
      "userUrl": "https://www.imdb.com/user/ur1996528",
      "reviewLink": "https://www.imdb.com/review/rw8142763",
      "warningSpoilers": false,
      "date": "14 May 2022",
      "rate": "10",
      "helpful": "33 out of 40 found this helpful.",
      "title": "A Wonderful Surprise for lovers of Hollywood backstories!",
      "content": "Outstanding casting for this series! Writing scores with unexpectedly strong female characters. The creatives on this series deserve accolades for creating something different from other streaming series. I would put this in the same outstanding quality category as the current Julia on HBOMax."
    },
    {
      "username": "brianable",
      "userUrl": "https://www.imdb.com/user/ur25201835",
      "reviewLink": "https://www.imdb.com/review/rw8922900",
      "warningSpoilers": false,
      "date": "12 March 2023",
      "rate": "10",
      "helpful": "27 out of 31 found this helpful.",
      "title": "Top-notch entertainment!",
      "content": "I remember when the Godfather first hit the screens and it became a sensation. At the time, Marlon Brando blew everyone away, along with Al Pacino. But the road to making this film is laid bare by the actual person who produced it, Albert S. Ruddy. Miles Teller takes on this role and plays it to the utmost. Then you've got Patrick Gallo, who plays, Mario Puzo. Utterly convincing. Incredible acting. But for me, the star of \"the author\" was Juno Temple, an English, actress who plays Bettye McCartt so convincingly and so professionally it made my mouth drop.The whole story about the making of the Godfather is laid out, so incredibly that it's actually hard to believe is really happened... But it did. A must watch for Godfather fans."
    },
    {
      "username": "tm-sheehan",
      "userUrl": "https://www.imdb.com/user/ur25552762",
      "reviewLink": "https://www.imdb.com/review/rw8245612",
      "warningSpoilers": false,
      "date": "17 June 2022",
      "rate": "10",
      "helpful": "16 out of 20 found this helpful.",
      "title": "The best Tribute to the 50th Anniversary",
      "content": "My Review - The OfferMy Rating 10/10 Streaming on ParamountI've read a few negative reviews concerning this series that I have to totally disagree with . Criticisms like \" The splashy inside Hollywood drama on the making of The Godfather is a patchy, overlong series that is best when it sticks to the script\" I'm sorry I don't agree at all and I'm the first person to complain if a series is overlong or padded out but compared to the fanciful and over done 2020 Ryan Murphy 7 part series Hollywood \"The Offer \" created by Michael Tolkin is a masterpiece and I think is the best television drama of the year .I can't think of any other movie or series that documents a famous movie of the quality of The Godfather from book to World Premiere.Being a keen cinephile I found The Offer gives a great insight into the different roles of movie makers from the Producers writers and Directors perspective to the non creative Studio financial accountant's who must be responsible for the nightmares experienced by the creative teams who are responsible for the movies we love.The three primary actors are Matthew Goode as Studio Head Robert Evans he is so impressive in a high energy role like I've never seen him play before.Dan Fogler as Francis Ford Coppola is also sensational as the Director who protects Mario Puzo's best seller like a beloved child never compromising on quality or the actors he wants to play the roles .For me though the standout performance is Miles Teller as Producer of The Godfather Albert S. Ruddy he is sensational and deserves at least an Emmy nomination for his performance. His character is tough and complex trying to negotiate the Studio politics ,budget constraints plus intimidation and pressure from The Italian American community and the gangsters that rule it.I read that the original actor cast to portray Albert S. Ruddy was Armie Hammer who left the series for unknown reasons I have a good idea why that was .All I can say as much as I like Armie Hammer he would have been totally wrong in this series ,his matinee idol looks and acting style would have spoiled the series for me.Juno Temple an actress I'm not to familiar with but will watch out for is also spectacular in her role as Bettye Mc Cartt the Production assistant and great support to jet boss Albert S, Ruddy .The Offer is based on the experiences of Oscar winning Producer Albert S. Ruddy who in 1969 after the success of his first television sitcom Hogans Heroes approaches Robert Evans the head of Production at Paramount Studios in an effort to be taken on as a film Producer.The first movie project he pitches is a new top selling novel titled The Godfather by once struggling author Mario Puzo .Robert Evans is reluctant at first insisting his Studio hits like Love Story are what Paramount needs to balance the books.However The Godfather is taken on by the studio with Albert S Ruddy as Producer and Francis Ford Coppola to Direct.This is where the story really takes off when one of the actual Godfathers heading the notorious Italian American \"Five Families \" Joe Colombo puts the pressure on Robert Evans to stop the filming of The Godfather as if doesn't portray his Italian community favourably .The heat is on especially when friend and ally of the 5 families pop idol Frank Sinatra points out the obvious similarities to the singer character in the book Johnny Fontaine believing probably correctly that it's based in him.The Offer is such a great 50th Anniversary tribute to the movie The Godfather which is listed as the official 2nd most critically acclaimed film all time film and a movie that had a modest production budget by todays standards of USD 6,000,000 (estimated) earning a staggering USD 270,012,224 Worldwide.Apart from the fine acting performances from the entire ensemble cast what impressed me most is the intelligence of the script and the expert Directing team. It's an achievement indeed and rare to have audiences impatiently eagerly awaiting each instalment in a mammoth ten part series ,especially this member of the audience.Ps watch The Godfather movie after the series it's even more enjoyable than before."
    },
    {
      "username": "jdevine-89140",
      "userUrl": "https://www.imdb.com/user/ur152880274",
      "reviewLink": "https://www.imdb.com/review/rw8155537",
      "warningSpoilers": false,
      "date": "19 May 2022",
      "rate": "9",
      "helpful": "49 out of 55 found this helpful.",
      "title": "The best series about a movie Ive ever seen",
      "content": "Thats all...There is a helleva lot of mediocre shows out there...This ones a gem, even if you aren't a Godfather aficionado this is just one great, incredible and best of all TRUE story. Its very well acted (especially the guy who plays Al Pacino) and I cant stand waiting for a week to catch the next episode (5 so far, 6 tomorrow). A total treat. A great show about making a classic movie, the kind that were made when Hollywood actually cared about its audience."
    },
    {
      "username": "louieshowers",
      "userUrl": "https://www.imdb.com/user/ur68188430",
      "reviewLink": "https://www.imdb.com/review/rw8902603",
      "warningSpoilers": false,
      "date": "3 March 2023",
      "rate": "10",
      "helpful": "26 out of 31 found this helpful.",
      "title": "One of the best series in History",
      "content": "This was absolutely pristine. A memorable experience and stacked with solid performances. This was a joy to watch a slow burn style drama series with heightened suspense that maintained a steady climb.I'm not a Hollywood fanatic by any means. This series actually made me lose myself in the actors and it seems like everyone who participated in this chronicle were super committed to giving their all and it showed.Any person who loves \"The Godfather\" will adore this series. I hope that they make a second season for part two, but the need the right cast. Another cool aspect of this is how they included strong female roles. It really added so much sincerity."
    },
    {
      "username": "shaahin_ghaderi",
      "userUrl": "https://www.imdb.com/user/ur44311451",
      "reviewLink": "https://www.imdb.com/review/rw8937415",
      "warningSpoilers": false,
      "date": "18 March 2023",
      "rate": "10",
      "helpful": "27 out of 30 found this helpful.",
      "title": "Most Underappreciated Show Of All Time!",
      "content": "God damn it. Loved this show immediately since early hours of watching, and all of a sudden I realized, this show hasn't received any major credit and got shocked to my core! Why? Just why?This is surly the most underappreciated and underrated show of television history and I felt sorry for myself that I started watching this show a Year after got released and I'm blaming everyone involved from publicists to social media and god knows who... All this discontent aside, that had to be said for all motion pictures enthusiast (such as myself), this is a must watch show, and believe me, it's all worth your time.This show offers you a fresh perspective to what's behind the curtain through eyes of a cast and crew that sacrificed everything in order to achieve their unique visions, hesitations and of course the cold reality of it, Money Making Business."
    }
  ],
  "errorMessage": ""
}