{
  "imDbId": "tt9174558",
  "title": "Dopesick",
  "fullTitle": "Dopesick (TV Series 2021–2021)",
  "type": "TVSeries",
  "year": "2021",
  "items": [
    {
      "username": "teenydutton",
      "userUrl": "https://www.imdb.com/user/ur59097761",
      "reviewLink": "https://www.imdb.com/review/rw7488864",
      "warningSpoilers": false,
      "date": "28 October 2021",
      "rate": "10",
      "helpful": "418 out of 431 found this helpful.",
      "title": "Lord's of addiction",
      "content": "I didn't think this series would effect me so hard. I cried and cried throughout it. This series was my life! I am now 12 years clean after going through years of opioid addiction. Watching the scenes with them going through withdraw were the hardest bc I have been there and that was a way of life in during my addiction. Your day consists of how can I get more pills so I don't get sick and at that point the pills don't even make you high anymore your just taking them to be able to function. This was one of the best shows that really show how devastatingly painful and scary withdraw is. Im thrilled that they shined a light on pardue and other big Parma companies in this. My addiction started with going to the Dr for endometriosis. Nobody told me back then that you could get addicted. First time you go into withdraw you don't even know that is what is happening to you. Sad thing is, is once your heavily addicted doctors turn their back on you and society looks at you like you're a piece of cr@p. So very very sad. Everyone should watch this series!"
    },
    {
      "username": "Marwan-Bob",
      "userUrl": "https://www.imdb.com/user/ur40191153",
      "reviewLink": "https://www.imdb.com/review/rw7588360",
      "warningSpoilers": false,
      "date": "26 November 2021",
      "rate": "9",
      "helpful": "131 out of 141 found this helpful.",
      "title": "well Acted, Nicely Produced and flawlessly Directed. an Absolute Must See.",
      "content": "One of the best Miniseries of the year if not the decade, i didn't want it to end, Extremely well Acted, Nicely Produced and flawlessly Directed. An Absolute Must See."
    },
    {
      "username": "danielcereto",
      "userUrl": "https://www.imdb.com/user/ur29002389",
      "reviewLink": "https://www.imdb.com/review/rw7698676",
      "warningSpoilers": false,
      "date": "28 December 2021",
      "rate": "9",
      "helpful": "91 out of 97 found this helpful.",
      "title": "Legal Drug Lords",
      "content": "Firstly, this mini series shows the cruel reality of our society. It shows how the Legal Drug Lords aka Pharmaceutical, sell poison to people who suffers from pain. The message is real and clear.Second, drugs can relieve the pain, but not your soul. It's only temporal and with the time, you will need more and more. The more you take pills, the better for pharmaceutical industries.Last, this mini series is a must to understand how Pharmaceutical bussines only wants to monetize your pain. They don't care about healing your soul.Great mini series. Great acting. Real story. A must. Time to wake up and stop the over use of pills."
    },
    {
      "username": "deloudelouvain",
      "userUrl": "https://www.imdb.com/user/ur58525162",
      "reviewLink": "https://www.imdb.com/review/rw8285715",
      "warningSpoilers": false,
      "date": "29 June 2022",
      "rate": "9",
      "helpful": "24 out of 24 found this helpful.",
      "title": "Very addictive to watch.",
      "content": "Although Dopesick isn't entirely non-fictional everybody knows by now what devastating ravages Oxycontin did in the daily lives of millions of Americans. It's the cancer under the opioids, easy to get and extremely addictive. This show is based on a non-fictional book, but the characters are most of the time fictional. That said Dopesick is a quality show, very well made, with tons of very good actors, and a story that keeps you wanting for more. Without spoiling anything you secretly hope those big pharmaceutical companies will get stopped but the reality like we all know by now is that they're untouchable and that's only the fault of a corrupt American system, like the FDA, the CDC, and many judges. The whole system there is rotten to the bone, too much money is going from hand to hand, from rich to richer, and it's not the common people that will change anything about that. Thankfully there are people fighting the system but except a few dents they will never break down that wall of corruption. America is sick, the whole world sees it, and nobody cares. Great show, great acting, very addictive to watch."
    },
    {
      "username": "RobTheWatcher",
      "userUrl": "https://www.imdb.com/user/ur128851908",
      "reviewLink": "https://www.imdb.com/review/rw7616708",
      "warningSpoilers": false,
      "date": "5 December 2021",
      "rate": "8",
      "helpful": "57 out of 61 found this helpful.",
      "title": "Dope & Sick",
      "content": "A really well done series that feels like a perfect reenactment that meets docu series. It was interesting and captured the entire story while still having its own style and great acting."
    },
    {
      "username": "payasoingenioso",
      "userUrl": "https://www.imdb.com/user/ur85483078",
      "reviewLink": "https://www.imdb.com/review/rw7537867",
      "warningSpoilers": false,
      "date": "11 November 2021",
      "rate": "9",
      "helpful": "112 out of 124 found this helpful.",
      "title": "Big Pharma Being Messy",
      "content": "I do not like to watch many dramas, but I knew this would be important.Ignore the low reviews if you agree Big Pharma is the business of staying in business, even if it means death or addiction.From Danny Strong to Kaitlyn Dever to Rosario Dawson, this cast is excellent.The episodes and timelines are confusing to me. That did not discourage me from learning more about the Real Drug War.The variety of oxycontin victim backgrounds is solid as well.I hope this show wins awards and informs many of pharmaceutical addiction and death."
    },
    {
      "username": "npvarley",
      "userUrl": "https://www.imdb.com/user/ur48846129",
      "reviewLink": "https://www.imdb.com/review/rw7491265",
      "warningSpoilers": false,
      "date": "29 October 2021",
      "rate": "9",
      "helpful": "118 out of 129 found this helpful.",
      "title": "Excellent!",
      "content": "This series does a great job of showing the complicity of big pharma, FDA and politicians in the opioid crisis.Many reviewers are not quite getting the point: OxyContin was addictive and the FDA failed to properly test the drug before allowing Purdue to write their own label, basically. Once they started bumping up dosage for counter the totally fake \"breakthrough pain\" nonsense, it created a whole army of addicts. That led to an increase in crime to obtain opiates, either more Oxy or even heroin.The series nails Purdue to the floor good and proper. The Sacklers come across as a repugnant family who can't even get on with each other.The acting is top-notch and the cinematography is also excellent. The timeline jumping around can be a bit confusing if you don't pay attention, but it's nothing too onerous.All in all, a great watch that tells a shocking story of greed and corruption."
    },
    {
      "username": "lhollan",
      "userUrl": "https://www.imdb.com/user/ur60099210",
      "reviewLink": "https://www.imdb.com/review/rw7507187",
      "warningSpoilers": false,
      "date": "3 November 2021",
      "rate": "10",
      "helpful": "103 out of 109 found this helpful.",
      "title": "Award-winning, compelling",
      "content": "The sad truth is that this phenomenal story of a network of corporate deceipt is based in reality. This series will take awards in multiple categories, including best series, multiple acting nominations, editing, and screen writing. Michael Keaton has pulled together the story of the century here, and the story line is written in a way where this complex, multi-layered travesty is exposed clearly and cleanly. This is streaming at its best."
    },
    {
      "username": "six2561",
      "userUrl": "https://www.imdb.com/user/ur11783229",
      "reviewLink": "https://www.imdb.com/review/rw7453554",
      "warningSpoilers": false,
      "date": "17 October 2021",
      "rate": "8",
      "helpful": "123 out of 136 found this helpful.",
      "title": "Truth is painful to watch.",
      "content": "One thing that many of the negative reviewers forget when they go on their current-day diatribes about big pharm is that this movie STARTS over 20 years ago. Pharmaceuticals weren't as they are today. It shows how the door was allowed to open, causing this country to be in the situation we're in today with the Big Parm and incessant pill pushing. MONEY TALKS. Nothing else matters. Not the FDA, CDC, you name the letters. $$$ This method of running a planet needs to stop!Michael Keaton is, as always, very good. We are blessed that he came back to doing what he does best. This series is honest, emotional, raw, sad and frightening. Do the one month free subscription to HULU and watch it. (and Only Murders in the Building. But that's another review :)"
    },
    {
      "username": "samabc-31952",
      "userUrl": "https://www.imdb.com/user/ur102635705",
      "reviewLink": "https://www.imdb.com/review/rw7444519",
      "warningSpoilers": false,
      "date": "15 October 2021",
      "rate": "8",
      "helpful": "92 out of 109 found this helpful.",
      "title": "Crisp plot, gripping, a must see",
      "content": "Dopesick means opiate withdrawal symptoms.The movie is based on journalist Beth Macy's book Dopesick: Dealers, Doctors and the Drug Company That Addicted America. It delves into the actual events that took place during a span of almost 20 years and how one company not only triggered the opioid crisis but was responsible for drugging the Americans. Company Purdue Pharma and its pain medication opioid OxyContin! There are on an average 50,000 deaths happen every year due to an overdose of opioid medications!!! In September, the owners of Purdue Pharma- Sacklers who made billions won the immunity from the lawsuit!!! Just 2 days ago in a sweeping settlement, the Sackler family was stripped off of the ownership of the company and was ordered to devote a hefty sum if $10 billion to the fight against opioid crisis tgat has killed around 500,000 Americans over the past 2 decades.Crisp plot, however, it does lack characterization.. Also, the recurring time frame sequences that cause the frequent time jumps in the story may make you jettison but if seen as a documentary series than the narrative does not seem muddled. Brilliant cast esp Michael Keaton whose poise is commendable and perfect for the role. A must watch.. available on Hulu."
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw7523603",
      "warningSpoilers": false,
      "date": "7 November 2021",
      "rate": "10",
      "helpful": "132 out of 163 found this helpful.",
      "title": "Masterful all around",
      "content": "Glorious cinematography overviewing with excellent music and riveting acting throughout its no wonder the rating is at a 8.7! I'm glad my mom recommended Depesick especially since our family is against pharmaceutical drugs. I love all the business stuff it's captivating seeing how it all plays out.. This is very worth watching I bet it'll be in the Emmys next year!"
    },
    {
      "username": "Sasha_Lauren",
      "userUrl": "https://www.imdb.com/user/ur11368832",
      "reviewLink": "https://www.imdb.com/review/rw7603791",
      "warningSpoilers": false,
      "date": "1 December 2021",
      "rate": "10",
      "helpful": "56 out of 66 found this helpful.",
      "title": "Recommend Recommend Recommend",
      "content": "DOPESICK (2021)~ Background story~ This addictive eight-part mini-series introduces the greedy, scheming Sackler family who own Purdue Pharmaceuticals; they made billions of dollars through malicious, manipulative advertising, and criminal misbranding of the opioid OxyContin.Sales skyrocketed as theft, child abandonment, dependency, and death rabidly increased. Meanwhile, the Sacklers kept lying about the safety of the time release system, pushing their sales team to SELL SELL SELL via false claims that less than 1% get addicted. Naturally they blamed victims as being drug addicts; the fault of the user, not the drug.Participants were decieved into participating in the introduction sales video \"I Got My Life Back,\" which was made as a PSA for pain. Text about Oxy was added later. Several participants became addicts or died due to Oxy.Following the lead of Valium that became a best seller because a medical condition was created called \"psychic tension,\" Purdue created the concepts \"pain is the fifth vital sign\" and \"breakthrough pain,\" which supposedly happens if people complain of pain within the twelve hour window that Oxy was sold to last for. This justified the company to sell increasing doses up to 160.They created the smiley-to-sad faced pain chart via Partners Against Pain in order to SELL SELL SELL.The creation of checkbox pathologies reminds me of the DSM created to sell psych drugs that often boxes healthy people into fake, manufactured diagnoses.When doctors objected to Purdue pharma reps by saying, \"I would never perscribe a pill for moderate pain,\" the reps countered with propaganda, \"Delayed absorption as provided by oxycontin tablets is believed to reduce the abuse liability a drug.\" They showed manipulated studies. Their campaign began by selling to the labor force in the West Virginia coal mines who often suffer pain and injury.The FDA under Reagan had only 39 employees responsible for 39,000 promotional items. Curtis Wright, the guy who approved the label saying Oxy is less addictive than other narcotics, ended up as an exective at Purdue Pharma. Imagine that, a revolving door. I mean drug companies are suppossed to be honest, right? So how did people leave the government and go to work (for five times the money) for the people they had been regulating? Hmm, it's a mystery.~The cool part about the mini-series~ Along comes a DEA agent and a team of Department of Health Investigators who worked for years to prove that Purdue IS the cartel. The series is gripping and ultimately satisfying to watch due to their fight. The interwoven storylines dance beautifully around each other; this script is very well written.The cast is stellar:Michael Keaton (never better than in this) plays the kind hearted doctor in Appalachia who gets sucked into perscribing Oxy by Billy, a zealous sales rep (Will Poulter). The head of the DOH investigative team, Rick Mountcast, is played by Peter Sarsgaard. He nailed it, as did his partner, John Hoogenakker.Kaitlyn Dever is compelling as a young miner who gets injured, and then addicted to Oxy as she struggles with coming out as a lesbian to religous parents in a judgenental community. Rosario Dawson hits just the right notes as the steadfast DEA agent. Michael Stulhbarg was perfectly creepy as Richard Sackler.A moving and important series.RECOMMEND RECOMMEND RECOMMEND."
    },
    {
      "username": "jennfinn",
      "userUrl": "https://www.imdb.com/user/ur61194652",
      "reviewLink": "https://www.imdb.com/review/rw7605055",
      "warningSpoilers": false,
      "date": "1 December 2021",
      "rate": "9",
      "helpful": "65 out of 80 found this helpful.",
      "title": "CAPITALISM AT ITS WORST !!",
      "content": "Even though I already knew the story Dopesick was a chilling revelation to watch. There's a special place in hell for the entire Sackler family and most of the sales reps from Purdue Pharma.It was very interesting to see the effects of OxyContin from every side including; Purdue upper management, drug reps, and the Sackler family, to the DEA, State's Attorneys office, prescribing doctors, and the patients who trusted their doctors who said it would change their lives and take away their pain.Unfortunately the utter loss and devastation that would be caused by OxyContin was conveniently left out of the sales pitch.In my opinion this was Michael Keaton's most riveting performance to date, he nailed it. Kaitlyn Dever was also good but she irks me as an actress. Will Poulter is really coming into his own and if he continues acting he'll be a force to be wreckened with in a few years."
    },
    {
      "username": "TheTruthofItIs",
      "userUrl": "https://www.imdb.com/user/ur6251613",
      "reviewLink": "https://www.imdb.com/review/rw7761436",
      "warningSpoilers": false,
      "date": "15 January 2022",
      "rate": "9",
      "helpful": "34 out of 41 found this helpful.",
      "title": "Dopesick is pretty Dope",
      "content": "\"Dopesick\" (8 eps, 1-hr, Hulu) is a docu-drama on the opioid crisis in America and how it was brought about by Purdue Pharma's new-in-the-90s drug, Oxycontin. The series is really well done (except for jumping back and forth in time to tell the story) thanks to seasoned producers and directors. Michael Keaton leads the mostly unknown cast but Kaitlyn Dever (\"Last Man Standing\") turns in an Emmy-level performance as dopesick \"Betsy\". Besides dramatizing the opioid crisis, the creators Danny Strong and Beth Macy wanted to ensure you realize how bad/evil/greedy Purdue Pharma is (not was) and the Sackler family's shameful role in it. And since the elections of 2016/2020 shook our faith in federal govt leadership and Big Tech, this series certainly piles on adding Big Pharma to the pile of disgusting graft, revolving doors, and corruption via insider favors in the service of boundless profits over the health of the populace. Yes, you'll earn your newfound cynicism after completing \"Dopesick\"."
    },
    {
      "username": "tfp-15576",
      "userUrl": "https://www.imdb.com/user/ur136350265",
      "reviewLink": "https://www.imdb.com/review/rw7506614",
      "warningSpoilers": false,
      "date": "3 November 2021",
      "rate": "9",
      "helpful": "50 out of 54 found this helpful.",
      "title": "US big pharma",
      "content": "Very well done and another example of how messed up the medical system in the US really is in almost every area. Overun with lawyers, charlatans, liars, cheats and thieves. ALthough not specific to just big pharma it also shows again the incestuous relationship between the 1% and the governing bodies. Whether its lobbying,marketing or whatever else they call it this decade, the corruption is totally embedded within our system. The movie is a teaser, go look at the real investigations for an even more worrying story."
    },
    {
      "username": "frank-liesenborgs",
      "userUrl": "https://www.imdb.com/user/ur57396250",
      "reviewLink": "https://www.imdb.com/review/rw7556777",
      "warningSpoilers": false,
      "date": "17 November 2021",
      "rate": "10",
      "helpful": "46 out of 58 found this helpful.",
      "title": "This is an absolute must! Blown away!",
      "content": "The moment these mini-series started, I was \"hooked\". This is a story beyond comprehension. Reviewing this is easy. Plot, storylines, acting and the filming is all done exceptionally well and close to perfection. Especially the acting of Michael Keaton (Dr. Finnix), Will Poulter (Billy) and Peter Sarsgaard (US attorney) Rick. Michael Stuhlbarg, who plays Richard Sachler, also delivers and outstanding performance. My complements to the latter as this is a role not easy to play. A tiny Appalachian mining town, targeted by Purdue as part of its mission to overcome doctors' reluctance to prescribe opioids is just a drop in the bucket but very well used to feel like this could (and was or is still) happen to anybody. Over the eight episodes this story is so well construed that it is still very difficult to believe this could happen. Makes you think about all the things happening right now and we are unaware of. And finally, Danny Strong. Unbelievable writing and directing! You MUST watch this! 10/10 rating without any doubt."
    },
    {
      "username": "rbost-70233",
      "userUrl": "https://www.imdb.com/user/ur67743598",
      "reviewLink": "https://www.imdb.com/review/rw7444895",
      "warningSpoilers": false,
      "date": "15 October 2021",
      "rate": "10",
      "helpful": "67 out of 84 found this helpful.",
      "title": "Early in, very good so far",
      "content": "Interesting subject. I'm 65, in pretty good shape. I have a basic mistrust of medicine in general. Have zero prescriptions, have had very few over the years. I talk to folks my age and older and the amount of prescription drugs they take is staggering. I'm not anti-vax just anti-drug. This movie will prove to me something I've suspected, rather known for years. Big Pharma ain't our friend."
    },
    {
      "username": "nlsteven-attheMovies",
      "userUrl": "https://www.imdb.com/user/ur97994668",
      "reviewLink": "https://www.imdb.com/review/rw7585872",
      "warningSpoilers": false,
      "date": "26 November 2021",
      "rate": "9",
      "helpful": "20 out of 23 found this helpful.",
      "title": "Hooked",
      "content": "I didn't expect to get addicted to a series about the American opioid crisis. I binged Dopesick for 8 straight hours.Dopesick exposes the immorality of the pharma industry and how executives prioritize financial gains over public health, leading to over 500,000 fatalities. It is a very well made series, switching between stories of the victims themselves, boardroom scandals and a nationwide investigative effort. Michael Keaton should easily bag an Emmy nomination for his riveting performance. The supporting cast is just as good.I am still reeling from shock to learn how easily available prescriptive painkillers are for the American public. Just like guns."
    },
    {
      "username": "catfanatic888",
      "userUrl": "https://www.imdb.com/user/ur3513409",
      "reviewLink": "https://www.imdb.com/review/rw7615401",
      "warningSpoilers": false,
      "date": "4 December 2021",
      "rate": "10",
      "helpful": "34 out of 44 found this helpful.",
      "title": "Flat out Perfect! Everyone should watch this!",
      "content": "This true life story is a master class in it's entirety. The opioid epidemic has swept our country like a giant tsunami. It's not just addicts who get hooked on these. I know several people with chronic pain who got put on these. One of them was considering using heroin instead because it was much cheaper. 10 years ago I was treated for a large swollen bruise. The doctor put me on Vicodin for 6 weeks. When I was done with my prescription, I had severe insomnia. That same doctor put me on Xanax for nearly 10 years. That did a number on my kidney and liver not to mention that it was SO hard to kick. If it seems like you're being given excessive meds, get a second opinion I never had an addiction problem in my life before that. Avoid Opioidfs if at all possible."
    },
    {
      "username": "alidortaj",
      "userUrl": "https://www.imdb.com/user/ur32444515",
      "reviewLink": "https://www.imdb.com/review/rw7440297",
      "warningSpoilers": false,
      "date": "14 October 2021",
      "rate": "10",
      "helpful": "64 out of 79 found this helpful.",
      "title": "This show is Addictive",
      "content": "Don't watch this show if your are addicted to binge watching tv shows, because this show will get you hooked. The story is a time lapse (going forward and backward in timeline). I'm a Big Fan of Micheal Keaton movies, Will Poulter, and other cast do a great job. Would definitely recommend this show.Update: Just watched the season Finale and someone's review said the \"Truth is hard to Watch\". The director did a great job on the 2019 scene's as I shed a tear thinking of all the families the Sackler family had hurt. I don't want to spread propaganda with a show, but my neighbors have told me some personal family stories. In general I compare this show to Cherenobyl, Breaking Bad for its performances. Would still definitely recommend."
    },
    {
      "username": "Ottodane",
      "userUrl": "https://www.imdb.com/user/ur25441128",
      "reviewLink": "https://www.imdb.com/review/rw7529848",
      "warningSpoilers": false,
      "date": "9 November 2021",
      "rate": "10",
      "helpful": "31 out of 35 found this helpful.",
      "title": "Excellent. Realistic. Moving.",
      "content": "I am a recovering heroin addict, who started with Percocet because of an injury, and very soon found myself on OxyContin. This show is unlike any other in it's portrayal of addiction. Withdrawals in particular are shown here in great deal where most shows barely touch on it if at all. They just nail everything. Every plot line is so well written and acted as well as informative. Just a great show all around it will blow your mind it's a true story at times. 10 stars from me."
    },
    {
      "username": "tjnesheim",
      "userUrl": "https://www.imdb.com/user/ur119933314",
      "reviewLink": "https://www.imdb.com/review/rw7494189",
      "warningSpoilers": false,
      "date": "30 October 2021",
      "rate": "10",
      "helpful": "173 out of 187 found this helpful.",
      "title": "The answers to my husband's demise",
      "content": "This so clearly explains why my husband was given OxyContin after breaking his back. The dose initially helped, then it didn't. The doctor quickly increased his dosage. This continued to happen until he was at 100mg. At that point, the doctors are only drug dealers. I wrote letters to my husband's doctor explaining he was semi conscious on a good day. It all fell on deaf ears and this series explains why. I almost lost my husband, I lost the marriage I knew and he lost all respect from his daughters. Fortunately, he was arrested for a DUI, without harming anyone. I made him plead guilty, so he could experience every thing he had risked. That was his rock bottom. He has been off OxyContin for almost 5 years. Yet doctors are still trying to prescribe OxyContin for his chronic pain. I hope this series helps everyone see OxyContin is a horribly addictive and ineffective pain medication."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw8532127",
      "warningSpoilers": false,
      "date": "10 September 2022",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Pain thresshold",
      "content": "No pain intended - no wait I meant no pun intended of course. What a show! I mean I had heard about Oxy (as it is being called too), but seeing the story behind it - how it got \"approved\" and how it went on to be available for so long, how it affected so many people, because the system did not work. And there I was thinking, well if the US and the FDA approves something or let's people sell that thing ... it can't be that bad, now can it? I reckon I was quite wrong there.While this may have to do with something like candy and may not be as excessive and bad as the Oxy story ... well it still is bad. And you have a section here, where they talk about Germany and the system how medicine is passed there. Quite the difference you could say. And one that the US should try to set as a goal. But ... money and some people not as qualified I reckon as they should be.All that aside, the timeline with the back and forth may not be for everyone (it even got me confused once or twice), but it is more than important ... because it lets you into a world that ... well it is a real one. You have real people here - no pun intended. Not just because they actually existed (though I would imagine some creative licence was taken at times) ... but because the way they are played. Michael Keaton - low key and power key and all the keys. Man that guy is amazing.But also Rosario Dawson - she has quite the powerhouse performance. Never letting down - really going for it and not giving up no matter what. And there are a lot of no matter whats. Not just for her. The nuanced performance by Will Poulter .. I could name check a lot more people (parents, youth, old and young) ... this is an important tv show ... showing us what we should not let happen again! Ever!"
    },
    {
      "username": "Almost_Soldout",
      "userUrl": "https://www.imdb.com/user/ur24673102",
      "reviewLink": "https://www.imdb.com/review/rw7497301",
      "warningSpoilers": false,
      "date": "31 October 2021",
      "rate": "10",
      "helpful": "40 out of 54 found this helpful.",
      "title": "That's 10/10 for sure!",
      "content": "The show is perfectly balanced between entertaining and educational aspects. I am not sure how would I rate this one if I was from the US and familiar with this crises as I was raised outside of this country and I was a kid in 90. I truly find this show brilliant and stunning. The characters, storylines and various angles on that are well made! Highly recommended to everyone!"
    },
    {
      "username": "lso-soares",
      "userUrl": "https://www.imdb.com/user/ur27649482",
      "reviewLink": "https://www.imdb.com/review/rw8063072",
      "warningSpoilers": false,
      "date": "15 April 2022",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Sweeping",
      "content": "I was curious when I read a review about the miniseries Dopesick, available on the Star+ platform, deciding to put aside my list of series to watch, skipping it.The miniseries blew me away. There are eight episodes with an average duration of one hour each. I couldn't stop watching. I saw it all in two nights, five episodes the first night and three the next night.It is engaging, has excellent actors, especially Michael Keaton (Dr. Samuel Finnix) and Peter Sarsgaard (Rick Mountcastle), the drama is based on real events, it is very well directed. The screenplay is based on the book by Beth Macy. In directing, four directors took turns in the episodes: Barry Levinson, Michael Cuesta, Patricia Riggen and Danny Strong.The plot consists of the struggle of prosecutors in a small town in Virginia against Purdue Pharma, a pharmaceutical giant controlled by the Sackler family, whose owners were philanthropists, funding and supporting major museums around the world, such as the Metropolitan Museum of Art, in New York, which had a wing called the Sackler, and the Musée du Louvre in Paris. Purdue Pharma launched a more potent pain reliever than morphine, Oxycontin, with aggressively campaigning on small-town doctors to prescribe the new drug for any type of pain.Lies, corruption, fights between family members, frustrations from prosecutors, threats, greed and ambition are present as we witness the pain of hundreds of families who have lost loved ones due to addiction acquired with the medicine. The situation became so worrying that even the US Department of State Drug Enforcement Administration joined the fight against Purdue Pharma. And here I highlight Rosario Dawson's role as an assistant director of the DEA.An interesting device used by directors is the back and forth in time, not telling the story in a linear way. This holds attention, allows a better understanding of future events, leaving the viewer free to reflect on what really matters: the indiscriminate use of medicines.When I finished the series, I had a mixed feeling of anger, disgust and concern about the pharmaceutical industry, with its advertising always showing happy and active people, but full of swindles behind it all.Michael Keaton is perfect as a town doctor who lives off coal mining, adored by everyone and who sees his life transformed after he meets the pain reliever Oxycontin.To think about."
    }
  ],
  "errorMessage": ""
}