{
  "imDbId": "tt9253866",
  "title": "Our Planet",
  "fullTitle": "Our Planet (TV Series 2019–2019)",
  "type": "TVSeries",
  "year": "2019",
  "items": [
    {
      "username": "tester-84146",
      "userUrl": "https://www.imdb.com/user/ur99660650",
      "reviewLink": "https://www.imdb.com/review/rw4775061",
      "warningSpoilers": false,
      "date": "11 April 2019",
      "rate": "10",
      "helpful": "250 out of 267 found this helpful.",
      "title": "Wow",
      "content": "How was this filmed?? I wish they make a documentary on how this documentary was filmed and edited, and what gear and technology they used."
    },
    {
      "username": "AnthonyBehan",
      "userUrl": "https://www.imdb.com/user/ur25793374",
      "reviewLink": "https://www.imdb.com/review/rw4763616",
      "warningSpoilers": false,
      "date": "5 April 2019",
      "rate": "10",
      "helpful": "242 out of 265 found this helpful.",
      "title": "Done before, But not like this",
      "content": "Attenborough & Netflix a match made in heaven. Shot in stunning 4K this breath taking Nature Documentary is as good as it gets and it's message is crystal clear, Stop killing our Our Planet. Highly recommended"
    },
    {
      "username": "FrenchEddieFelson",
      "userUrl": "https://www.imdb.com/user/ur3257585",
      "reviewLink": "https://www.imdb.com/review/rw4770977",
      "warningSpoilers": false,
      "date": "9 April 2019",
      "rate": "9",
      "helpful": "54 out of 71 found this helpful.",
      "title": "Make our planet great again",
      "content": "As we are reminded by an African proverb quoted in Terre des hommes (Antoine de Saint-Exupéry, 1939), 'we do not inherit the land from our parents, we borrow it from our children'. However, ecology and respect for nature always rhyme with procrastination. Indeed, since Neil Armstrong stepped on the lunar floor, the human population has more than doubled, but 60% of wildlife populations have disappeared.The series Our planet celebrates the naturals wonders that remain and invites us to be both contemplative and respectful. Thus, we cross every continent, we feel each season and we touch each of the 3 main elements (sea, air, earth). It's dazzlingly filmed. The voice of David Attenborough is warm and pleasant. The text is excellently written. What a delight!Although it can be sufficient in itself, this superb documentary may be supplemented by An Inconvenient Truth (2006), Microcosmos: Le peuple de l'herbe (1996), Océans (2009), ..."
    },
    {
      "username": "teamdean-26587",
      "userUrl": "https://www.imdb.com/user/ur71547586",
      "reviewLink": "https://www.imdb.com/review/rw4763333",
      "warningSpoilers": false,
      "date": "5 April 2019",
      "rate": "10",
      "helpful": "81 out of 99 found this helpful.",
      "title": "Breathtaking",
      "content": "Amazingly filmed and narrated. Just watch it and be amazed."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw4822371",
      "warningSpoilers": false,
      "date": "2 May 2019",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "Shock and awe",
      "content": "Do enjoy watching film and television on Netflix, but when it comes to the Netflix originals the odd gem crops up every now and again. But there are a fair share of films and television that don't do much or anything for me and those that start/started off very promisingly, in some cases brillantly, but decline badly, a major example being 'House of Cards'.Am however a massive fan of the national treasure that is David Attenborough, as is my sister, and when hearing that he had done a new series and it was on Netflix we just couldn't say no to watching it. The best of Attenborough's work, old and new, are genre landmarks and are incredible in their own right, his career has spanned decades and has been remarkably consistent. In that there is not a dud in the whole of his extensive filmography, his more flawed work still being decent, which is a rarity and something that has been deliberately reiterated by me many times. The 8 part 'Our Planet' was one of our most highly anticipated programmes, watching it we were utterly transfixed by the images, fascinated by all the animals and felt a wide gaumt of emotions. Whether biting our nails, shedding multiple tears, going awww at anything cute and even laughing. After watching 'Our Planet' we were shocked, inspired, very moved and in awe, not many programmes so far this year have made me feel like this. So far this year, this has been among the very best and very special, and in a completely different league when it comes to Netflix shows. Even if it isn't one of Attenborough's best or most ground-breaking.'Our Planet' is not about animals in beautiful environments being painted in a cute, reassuring and one-sided light, that was something that the brilliant 'Dynasties' was criticised for before it was even aired. Don't think either that it would offer nothing new. Some have criticised it for having an agenda and executing it heavy-handedly. The portrayal of the animals is far from reassuring, some are cute and some are quirky but much of the time the portrayal is complex and uncompromising, all without over-humanising them even in very human conflicts. The environments/habitats do look absolutely glorious (\"Jungles\" being a prime example), make no mistake about that, but there is much more to them than that with them also being unforgiving and even fragile. \"Frozen Worlds\" especially.Regarding whether it offers anything new or not, the environments (jungles, the Arctic, deserts, grasslands etc.) and animals like penguins and killer whales are familiar. But there are also some rare animals not seen before (like in \"Jungles\" with the preening bird), familiar species doing uniquely different things like the caterpillars in \"From Deserts to Grasslands\" or the ants in \"Jungles\". It may seem on the outset that it's familiar, to me there was a different approach to the material, helped by the wide range of camera techniques where you see many animals up close in a way never seen before like with the Arabian Leopard and the cheetah it is very intimate.Did not find its heavy emphasis on conservation too preachy, unlike some. A lot of 'Our Planet' shows both the wonders of the planet, with all the different species and their behaviours (both familiar and unique) and the different habitats and the fragility of them as their environment is threatened and what human destruction does. What was said was important and things long needing to be addressed, with harrowing sequences like the endings of \"Our Planet\" and \"Frozen Worlds\", and with the predatory fungi, making one really sit up and think as well as feeling emotional and shell-shocked. Did find that the heavy emphasis on it was not a bad thing, considering that it applies to all the environments covered and many of the animals and such, such as the megafauna. It's not all doom and gloom, parts are hopeful.'Our Planet' does in all eight episodes look amazing. The scenery takes the breath away, especially in \"Jungles\" and \"Coastal Seas\", but it is more than just beautiful scenery. For example in \"Our Planet\" and \"Frozen Worlds\" one is reminded of how cruel that environment is. The scenery is complemented by photography of quite cinematic quality with a wider range of camera techniques rarely seen before, not just a feast for the eyes but it is also expansive and intimate in equal measure, enhancing the impact of the emotional and tense scenes of which in 'Our Planet' there are many. A big example being with the walruses in \"Frozen Worlds\", which really got me emotionally. The music is grand and atmospheric but also whimsical and jaunty. A memorable example being tango-inspired music in \"Jungles\" accompanying an amusing sequence.As one can expect, the narration is very thought-provoking and never rambling or speculative. There are some interesting individual feeling stories here throughout and so many of the species are easy to relate to. A lot of information is covered but felt properly explored and not rushed or disjointed, and the facts educate and illuminate while not being compromised for the emotionally complex storytelling. Once again, Attenborough's distinctive and unequalled narrative delivery, with his unmistakable voice, is sincere, enthusiastic as well as understated. One can listen to him for a long time and not tire of him, no other nature/wildlife documentary narrator/presenter has made me feel this way.In conclusion, count me in as another person who finds 'Our Planet' brilliant. 10/10"
    },
    {
      "username": "janoffpeter",
      "userUrl": "https://www.imdb.com/user/ur29920136",
      "reviewLink": "https://www.imdb.com/review/rw4769864",
      "warningSpoilers": false,
      "date": "8 April 2019",
      "rate": "10",
      "helpful": "13 out of 15 found this helpful.",
      "title": "Simply jaw dropping wonders!",
      "content": "This is so spectacular you'll be getting flabbergasted at every turn and twist of this masterpiece. Really, who knew a fraction of these phenomena actually take place? I am just wondering how we human beings can possibly destroy it all when the chances of it all happing were so microscopic to begin with Sir Richard Attenborough is synonymous with these fine works of art. Feast upon this! You too can thrive!"
    },
    {
      "username": "arkhamcity-89369",
      "userUrl": "https://www.imdb.com/user/ur96930502",
      "reviewLink": "https://www.imdb.com/review/rw4763161",
      "warningSpoilers": false,
      "date": "5 April 2019",
      "rate": "10",
      "helpful": "63 out of 81 found this helpful.",
      "title": "David Attenborough does it again...",
      "content": "As if I thought Sir David couldn't do anything more to amaze me, he comes up with this. What a phenomenal 8 episode show. The man is just extraordinary."
    },
    {
      "username": "firballblaze-69689",
      "userUrl": "https://www.imdb.com/user/ur88574233",
      "reviewLink": "https://www.imdb.com/review/rw4770292",
      "warningSpoilers": false,
      "date": "9 April 2019",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "Fantastic!",
      "content": "Sir David Attenborough is the best nature narrator! If we don't start taking care of our planet, we will not be able to watch amazing documentaries such as this one. Please support your local wildlife and help clean it up, volunteer in your national parks, beaches, etc. no matter what country you live in and let's all come together to help save this beautiful landscape that God has given us before it is too late."
    },
    {
      "username": "farshidkarimi",
      "userUrl": "https://www.imdb.com/user/ur69859630",
      "reviewLink": "https://www.imdb.com/review/rw4769240",
      "warningSpoilers": false,
      "date": "8 April 2019",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "Breathtakingly Magnificent",
      "content": "The quality of camera work is splendid, cinematography is seamless, spanning over panoramic views of awe-inspiring natural scenes. The advanced camera equipment bring the splendor and majesty of nature before our eyes, making us stare at the marvels of our beautiful Earth with admiration.The great thing that sets this series apart from previous series is that it boldly and rightly blames US, humans, for the havoc wreaked on all this splendor of natural world.The puny gripes directed at this series emanate from political paranoia and faulty political leanings. Can we deny that we are decimating animals and their habitats? Can we deny that we are waging wars, slaughtering each other in almost every corner of the world? We generated global warming, using fossil fuels excessively, we are just like an insatiable factory that ravenously consume earth resources profligately, staining every inch of the Earth with sometimes incurable wounds of destruction, leaving behind unsightly scars on this enchanting nature.I hope this series will deliver a jab at everyone who watches it to have some respect for the wonders of Our Planet.And I hope Sir David Attenborough will live to be 150. He is a diamond."
    },
    {
      "username": "dpoland-76589",
      "userUrl": "https://www.imdb.com/user/ur89661682",
      "reviewLink": "https://www.imdb.com/review/rw4763825",
      "warningSpoilers": false,
      "date": "5 April 2019",
      "rate": "10",
      "helpful": "33 out of 47 found this helpful.",
      "title": "David Attenborough and Netflix created magic",
      "content": "Each new epic nature series brings something new. With each development in the science and art of photography we are treated to new wonderful scenes.David Attenborough has for a long time brought brilliant series such as Planet Earth I and II, Blue Planet etc to life with his unique, passionate and wonderful voice. Along with Cousteau he contributed to my path of becoming a marine biologist.This series, as the others were, is sorely and unfortunately needed. Hopefully Netflix and Attenborough can reach a new, more motivated audience, with this fantastic show to inspire not only wonder but also action."
    },
    {
      "username": "jasongillemail",
      "userUrl": "https://www.imdb.com/user/ur95501818",
      "reviewLink": "https://www.imdb.com/review/rw4763386",
      "warningSpoilers": false,
      "date": "5 April 2019",
      "rate": "10",
      "helpful": "129 out of 145 found this helpful.",
      "title": "Earth's favorite human...",
      "content": "Like all David Attenborough's documentaries, this is absolutely beautiful and breath-taking. No one can show us how beautiful our planet is like David Attenborough... he is, quite literally, one of the most important people on Earth, and undoubtedly, the most important person TO Earth."
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5561746",
      "warningSpoilers": false,
      "date": "19 March 2020",
      "rate": "",
      "helpful": "10 out of 14 found this helpful.",
      "title": "Our Planet",
      "content": "Our Planet was an interesting documentary with extraordinary visuals and some great music, but it gets pretty one tonal after a few episodes. The only thing that changes each episode is the climate in which the animals live, otherwise it's just hunter-prey, eat or be eaten. The part about Chernobyl was very interesting and I would have wanted to have seen more of that but then the season was over and I had watched all episodes. Still, overall it is a very good season and it delves deep into the problems facing our planet, our species and our animals. David Attenborough is phenomenal as always and the score by Steven Price is also amazing."
    },
    {
      "username": "support-26313",
      "userUrl": "https://www.imdb.com/user/ur97565316",
      "reviewLink": "https://www.imdb.com/review/rw4762842",
      "warningSpoilers": false,
      "date": "5 April 2019",
      "rate": "10",
      "helpful": "87 out of 107 found this helpful.",
      "title": "My Safe Place",
      "content": "David Attenborough nature films.. I'm there.. You can never go wrong if you're like me and impressed with Mother Nature."
    },
    {
      "username": "Rognajj",
      "userUrl": "https://www.imdb.com/user/ur45080352",
      "reviewLink": "https://www.imdb.com/review/rw4763652",
      "warningSpoilers": false,
      "date": "5 April 2019",
      "rate": "10",
      "helpful": "93 out of 108 found this helpful.",
      "title": "Best Netflix documentary series I've seen.",
      "content": "From the majestic narration to the incredible shots of nature and landscapes to the huge amount of information about Our Planet that is given to us, this documentary series never failed to impress me and is the best Netflix documentary series I've ever seen."
    },
    {
      "username": "thomasrm-2",
      "userUrl": "https://www.imdb.com/user/ur8700669",
      "reviewLink": "https://www.imdb.com/review/rw4764096",
      "warningSpoilers": false,
      "date": "5 April 2019",
      "rate": "10",
      "helpful": "135 out of 155 found this helpful.",
      "title": "Shocking",
      "content": "This is absolutely brilliant, but also very very sad. Mankind must stop and protect our only home - NOW."
    },
    {
      "username": "momokalas",
      "userUrl": "https://www.imdb.com/user/ur101437286",
      "reviewLink": "https://www.imdb.com/review/rw4769272",
      "warningSpoilers": false,
      "date": "8 April 2019",
      "rate": "10",
      "helpful": "18 out of 23 found this helpful.",
      "title": "Nothing can describe this!!",
      "content": "This is by far the most amazing piece of art ever made! Sir David Attenborough is as always absolutely amazing, narrating with all his passion and love for the nature. But This documentary is different then anything else I ever saw (and I saw almost everything available), because it's explaining and connecting the pictures to the current situation of our planet. Absolutely amazing"
    },
    {
      "username": "dan1406",
      "userUrl": "https://www.imdb.com/user/ur1361093",
      "reviewLink": "https://www.imdb.com/review/rw4769073",
      "warningSpoilers": false,
      "date": "8 April 2019",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "Stunning visuals, important message",
      "content": "This series looks fantastic on my 10-year old Samsung LCD TV. I can only imagine what it looks like on some of the new 4K+ televisions!I'm blown away by the visuals, especially how they got footage of stalking tigers in the tall grass, and from 1000 meters below the sea, or how they got into the hollow tunnels of an ant colony. How the people who get into some of these tight spots simply amazes me! I said \"Wow!\" a number of times throughout the series!But there is one really important message (over-emphasized in this series in my humble opinion) about planet protection I could have done without but I gave the series a 10 rating anyway because of the visuals. We know the planet is in danger, and many animal species will perish if we continue the way we are headed, but it's good to hear that some animals that were near extinction are now thriving and coming back after many decades.David Attenborough and Netflix are a marriage made in Heaven."
    },
    {
      "username": "jasminhegmann",
      "userUrl": "https://www.imdb.com/user/ur79486455",
      "reviewLink": "https://www.imdb.com/review/rw4774306",
      "warningSpoilers": false,
      "date": "11 April 2019",
      "rate": "10",
      "helpful": "17 out of 25 found this helpful.",
      "title": "Beautiful Images",
      "content": "Some images and close ups where SO CLOSE and crystal clear I doubted they were real. Incredible.."
    },
    {
      "username": "me-deepu",
      "userUrl": "https://www.imdb.com/user/ur25297815",
      "reviewLink": "https://www.imdb.com/review/rw4770799",
      "warningSpoilers": false,
      "date": "9 April 2019",
      "rate": "10",
      "helpful": "21 out of 25 found this helpful.",
      "title": "4 years in making!",
      "content": "This series has been an absolute delight in every sense. Shows that we need to be mindful of how we live cos we humans aren't the only ones living on the planet."
    },
    {
      "username": "conorlawrenson",
      "userUrl": "https://www.imdb.com/user/ur89099127",
      "reviewLink": "https://www.imdb.com/review/rw4764051",
      "warningSpoilers": false,
      "date": "5 April 2019",
      "rate": "10",
      "helpful": "25 out of 38 found this helpful.",
      "title": "The beginning of a new era",
      "content": "With 6 of the top 10 IMDb user-rated TV shows being either a science or space documentary, with 4 being produced in the last couple of years, these type of documentaries are the future of television. Netflix have now had a sniff, next comes the Amazon's and the Sky's. And I, for one, cannot wait."
    },
    {
      "username": "samuelandrewsmyth",
      "userUrl": "https://www.imdb.com/user/ur40931587",
      "reviewLink": "https://www.imdb.com/review/rw4763503",
      "warningSpoilers": false,
      "date": "5 April 2019",
      "rate": "10",
      "helpful": "25 out of 37 found this helpful.",
      "title": "Outstanding",
      "content": "Not only a documentary on nature, but a lesson in life. Showing us what we have and what we could lose if we don't change. Just outstanding."
    },
    {
      "username": "Snootz",
      "userUrl": "https://www.imdb.com/user/ur49392222",
      "reviewLink": "https://www.imdb.com/review/rw5255618",
      "warningSpoilers": true,
      "date": "14 November 2019",
      "rate": "5",
      "helpful": "24 out of 45 found this helpful.",
      "title": "Beatuiful cinematography, questionable narrative",
      "content": "Just a short review. There is no denying the amazing cinematography and scenery in this documentary series. It's just astounding.Unfortunately this was somewhat ruined for me by narrative that is regularly questionable, inconsistent and even ridiculous. One primary example: \"There are countless species in the rain forest. Millions more are being discovered weekly.\"Millions of species discovered weekly? (The actual figure is 15,000 to 18,000 a year... or about 290 a week). This is just one example of a myriad of \"artistic license\" statements that are made throughout this series, some minor, some contradictory to scientific reason and fact. Many statements seem \"made up\" for dramatization.For most people this will not be noticed as they are awed by the incredible scenery. For those more objective and more sensitive to media-hype, this series is filled with statements that are at least questionable as to accuracy and authenticity. I found this so regularly pointed that it somewhat ruined enjoyment of the series. Pretty pictures do not replace scientific validity."
    },
    {
      "username": "roondogbb",
      "userUrl": "https://www.imdb.com/user/ur82776185",
      "reviewLink": "https://www.imdb.com/review/rw4773293",
      "warningSpoilers": false,
      "date": "10 April 2019",
      "rate": "10",
      "helpful": "15 out of 24 found this helpful.",
      "title": "Bad and Good",
      "content": "In terms of bringing wildlife and different environments into your household. No other show will come close. The beautiful 4K resolution and myriad of shots is outstanding. The breadth of animals looked at it amazing. That being said however. I do wish david would for at least 5 mins shut up about climate change. Yes its an issue. 99% of people accept that. However mentioning it at every opportunity during the show instead of perhaps talking about the creatures and how they live, rather than just saying they are at constant risk of extinction because their environments are being messed up. I felt like we were being put onto a guilt trip. Creating awareness is one thing but this goes beyond that."
    },
    {
      "username": "shabin-sajan",
      "userUrl": "https://www.imdb.com/user/ur54183390",
      "reviewLink": "https://www.imdb.com/review/rw4774222",
      "warningSpoilers": false,
      "date": "11 April 2019",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Just one word \"MasterClass\" \"Fascinating\" \"Breathtaking\" Amazing Documentary Series",
      "content": "This is the best documentary series about Wild Life i have seen in my life. Well filmed and narrated with breathtaking visuals and stories of various species which we never heard of. Its full of NATURAL AWARENESS AND Knowledge about the species all around the world.I come to conclusion after watching this series \" Plants & Animals are more CREATIVE , very much INNOVATIVE (in a SUSTAINABLE way) than we HUMANS\". We humans needs to grow up and learn from these living beings. Such a lovely fabulous series. Kudos and love you David Attenborough for this wonderful series. It's a privilege and visual treat for the audience. And THANK YOU \"Netflix\""
    },
    {
      "username": "dcm767",
      "userUrl": "https://www.imdb.com/user/ur22763499",
      "reviewLink": "https://www.imdb.com/review/rw4766556",
      "warningSpoilers": false,
      "date": "7 April 2019",
      "rate": "10",
      "helpful": "20 out of 32 found this helpful.",
      "title": "Watch this now.. before our planet is gone....",
      "content": "The message depressing; the photography amazing. No words to describe this series. I'm out of WOW !!"
    }
  ],
  "errorMessage": ""
}