{
  "imDbId": "tt9253866",
  "title": "Our Planet",
  "fullTitle": "Our Planet (TV Series 2019–2019)",
  "type": "TVSeries",
  "year": "2019",
  "language": "en",
  "titleInLanguage": "Our Planet",
  "url": "https://en.wikipedia.org/wiki/Our_Planet",
  "plotShort": {
    "plainText": "Our Planet is a British nature documentary series made for Netflix. The series is narrated by David Attenborough and produced by Silverback Films, led by Alastair Fothergill and Keith Scholey, who also created BBC documentary series Planet Earth, Frozen Planet and The Blue Planet, in collaboration with the conservation charity World Wildlife Fund (WWF). The soundtrack was composed by composer Steven Price.\r\nThe series addresses issues of conservation while featuring these desperate animals in their respective home regions, and has been noted for its greater focus on humans' impact on the environment than traditional nature documentaries, centering around how climate change impacts all living creatures. It is the first nature documentary Netflix has ever made. All episodes were released on 5 April 2019. A behind-the-scenes documentary was released onto Netflix on 2 August 2019. Netflix reported that 25 million households were expected to watch the series during its first month of release. It was later reported that 100 million households had watched the series as of March 2021.\r\nA second season, Our Planet II, is set for release on June 14, 2023.",
    "html": "<p>Our Planet is a British nature documentary series made for Netflix. The series is narrated by David Attenborough and produced by Silverback Films, led by Alastair Fothergill and Keith Scholey, who also created BBC documentary series Planet Earth, Frozen Planet and The Blue Planet, in collaboration with the conservation charity World Wildlife Fund (WWF). The soundtrack was composed by composer Steven Price.</p><p>The series addresses issues of conservation while featuring these desperate animals in their respective home regions, and has been noted for its greater focus on humans' impact on the environment than traditional nature documentaries, centering around how climate change impacts all living creatures. It is the first nature documentary Netflix has ever made. All episodes were released on 5 April 2019. A behind-the-scenes documentary was released onto Netflix on 2 August 2019. Netflix reported that 25 million households were expected to watch the series during its first month of release. It was later reported that 100 million households had watched the series as of March 2021.</p><p>A second season, Our Planet II, is set for release on June 14, 2023.</p>"
  },
  "plotFull": {
    "plainText": "Our Planet is a British nature documentary series made for Netflix. The series is narrated by David Attenborough and produced by Silverback Films, led by Alastair Fothergill and Keith Scholey, who also created BBC documentary series Planet Earth, Frozen Planet and The Blue Planet, in collaboration with the conservation charity World Wildlife Fund (WWF). The soundtrack was composed by composer Steven Price.\r\nThe series addresses issues of conservation while featuring these desperate animals in their respective home regions, and has been noted for its greater focus on humans' impact on the environment than traditional nature documentaries, centering around how climate change impacts all living creatures. It is the first nature documentary Netflix has ever made. All episodes were released on 5 April 2019. A behind-the-scenes documentary was released onto Netflix on 2 August 2019. Netflix reported that 25 million households were expected to watch the series during its first month of release. It was later reported that 100 million households had watched the series as of March 2021.\r\nA second season, Our Planet II, is set for release on June 14, 2023.\r\nProduction\r\nOn 15 April 2015, it was announced that the team behind the BBC nature series Planet Earth would produce an eight-part nature docu-series for Netflix that would be released in 2019. It was four years in the making and was filmed in 50 countries, and over 600 crew members took part in the production. The series focuses on the breadth of the diversity of habitats around the world, including the Arctic wilderness, the deep sea, the vast landscapes of Africa and the diverse jungles of South America.\r\nIn November 2018, David Attenborough was announced as the narrator, with the release date of 5 April 2019 also announced.\r\nPromotion\r\nThe series premiere was held on 4 April 2019, at the Natural History Museum in London. Guests at the premiere included Prince Charles and his two sons Prince William and Prince Harry, Charlie Brooker, David Beckham and his son Brooklyn Beckham, Ellie Goulding and the series narrator David Attenborough, who attended the event to underline their support for action against climate change.\r\nIn his speech, Prince Charles said he hoped “Our Planet” would educate hundreds of millions of people around the world about what action was required, while David Attenborough called on the world to \"be responsible careful citizens of this planet which is our only home, and for the creatures that live in it.\"\r\nThe first teaser trailer for \"Our Planet\" was released on 8 November 2018. Three months later, on 4 February 2019, the second teaser trailer was released. On 19 March 2019, the official trailer for the documentary was released.\r\nEpisodes\r\n series will explore the Earth's most important habitats, and celebrate the life they still support. We will reveal what must be preserved if we are to ensure a future where humans and nature can thrive.— David Attenborough, \"One Planet\"\r\nA 1 hour long bonus episode \"Our Planet - Behind The Scenes\" about the project is accessible under Additional Videos on Netflix.\r\nReception\r\nThe review aggregator website Rotten Tomatoes reported an approval rating of 93% based on 27 reviews, and an average rating of 8.33/10. The website's critical consensus reads, \"A cornucopia of visual wonder and environmental advocacy, Our Planet's breathtaking cinematography explores more of this beautiful, blue marble while presenting an urgent call to action to its inhabitants\" Metacritic, which uses a weighted average, assigned the film a score of 88 out of 100, based on 7 critics, indicating \"universal acclaim\".\r\nLucy Mangan of The Guardian gave out 4 out of 5 stars to Our Planet, saying \"it places clearer emphasis on the fragility and interconnectedness of all the species and eco-systems on display, and on the huge impact, humanity has had on them in so short a time. Bryan Resnick of Vox praised the series as \"can’t really describe the scale of what’s missing\" stating \"It reminds us we’re living in an age of staggering wildlife loss due to human development, over-fishing, deforestation, and climate change. This series doesn’t let us forget that. Humans have caused staggering amounts of wildlife loss. Our Planet doesn’t hide from it.\" Ben Travers of Indie Wire gave out an overall B+ for the series, and claims that the series ruthlessly contrasts the world's natural wonders with the environmental crisis killing them off, he wrote \"Their deaths are a warning for the darkness underlying all of Our Planet, a nature docuseries no longer content with passive commentary. It also offers all the stunning imagery you’ve come to expect from these documentarians, but its attitude may surprise you. Individual entries feel a little less memorable because of it. The light, comic touches that made for lovely little moments in Planet Earth are overshadowed if not spoiled entirely, by the traumatic lessons put front and centre.\"\r\nWill Gompertz of BBC also handed out a 4 out of 5 stars for the series, stating it \"gives us some of the most dazzling images you are ever likely to view on TV. When necessary, they are embellished with Attenborough's commentary, which is never obtrusive and always written with brevity and wit...It has been created by masters of their craft with an exceptional narrator, I do wonder, though, if the experienced executive producers at BBC would have sharpened up the first episode a little.\" Stuart McGurk of British GQ said \"It’s hard not to see this as a direct rebuke of the BBC’s nature documentaries: take one well-worn spectacular of the natural world, shoot it even more spectacularly than the BBC ever did and structure your whole opening episode around the idea that, without taking things like global warming seriously – without putting it front and centre about any show you’re making about the natural world, because how could you not – then pretty soon they’ll be nothing left to film so beautifully.\" Kevin Yeoman of Screen Rant concluded the series as \"stunningly ambitious\", he wrote \"Where Our Planet excels, though, is in its presentation. It’s not trying to convince anyone of anything — the time for doing that is long past. It’s simply stating this information as fact, in as straightforward a manner as possible. Not that it’s particularly difficult considering the evidence the series has on hand.\"\r\nHowever, Ed Power of The Telegraph criticized the documentary series as \"visually dazzling but very familiar.\" and gave it a 3 out of 5 stars, writing \"It is clichéd in its portrayal of life on earth as a slow-motion ballet of tooth and claw....In short, the innovations that made Attenborough’s previous series so sensational are conspicuously absent. It’s a haunting vision. More of this and Our Planet might have been a meaningful addition to the canon of natural history series. Instead, it prioritizes cinematic grandeur to an almost oppressive degree.\" Writing in The Independent, Lucy Jones stated that the most important aspect of the series, which set it apart from other nature documentaries of its type, was the depictions of the harsh realities of global warming, mass species extinction and environmental degradation which were woven into the narration that accompanied the breathtaking scenes and imagery, but she also argues it did not go far enough and should have been more radical given current ecological crises. In particular, she says the program should have called out those responsible for this ecocide. When Attenborough's narration tells the audience \"We have destroyed half the forests on earth\", she retorts \"But, who is we? As well as the fossil fuel industry, where is the fishing industry? Agriculture? The plastics industry? The vested interests that keep the planet burning? Yes, we are all complicit – those of us in affluent societies with high-consumption lifestyles more so than anyone – but there are greater powers at work. Describing the scale of the challenge is necessary but I wanted the series to go further, to peer under the hood.\"\r\nSoundtrack\r\nThe soundtrack was released with a compilation of the incidental music specially commissioned for Our Planet. The theme song \"In This Together\", which is a collaboration with English singer and songwriter Ellie Goulding, is also included.\r\nBroadcast\r\nStarting from 20 June 2020, the series was aired on Indonesian television network TVRI as a part of Belajar dari Rumah (Study from Home) programming block, made possible by a partnership between the Ministry of Education and Culture and Netflix. The broadcast marked the first Netflix original documentary series ever aired on conventional television, alongside a collection of Netflix documentaries included in the partnership.\r\nDuring the COVID-19 pandemic, Netflix has made the series available for free streaming on YouTube as an educational resource.",
    "html": "<p>Our Planet is a British nature documentary series made for Netflix. The series is narrated by David Attenborough and produced by Silverback Films, led by Alastair Fothergill and Keith Scholey, who also created BBC documentary series Planet Earth, Frozen Planet and The Blue Planet, in collaboration with the conservation charity World Wildlife Fund (WWF). The soundtrack was composed by composer Steven Price.</p><p>The series addresses issues of conservation while featuring these desperate animals in their respective home regions, and has been noted for its greater focus on humans' impact on the environment than traditional nature documentaries, centering around how climate change impacts all living creatures. It is the first nature documentary Netflix has ever made. All episodes were released on 5 April 2019. A behind-the-scenes documentary was released onto Netflix on 2 August 2019. Netflix reported that 25 million households were expected to watch the series during its first month of release. It was later reported that 100 million households had watched the series as of March 2021.</p><p>A second season, Our Planet II, is set for release on June 14, 2023.</p><br/><h3>Production</h3><p>On 15 April 2015, it was announced that the team behind the BBC nature series Planet Earth would produce an eight-part nature docu-series for Netflix that would be released in 2019. It was four years in the making and was filmed in 50 countries, and over 600 crew members took part in the production. The series focuses on the breadth of the diversity of habitats around the world, including the Arctic wilderness, the deep sea, the vast landscapes of Africa and the diverse jungles of South America.</p><p>In November 2018, David Attenborough was announced as the narrator, with the release date of 5 April 2019 also announced.</p><br/><h3>Promotion</h3><p>The series premiere was held on 4 April 2019, at the Natural History Museum in London. Guests at the premiere included Prince Charles and his two sons Prince William and Prince Harry, Charlie Brooker, David Beckham and his son Brooklyn Beckham, Ellie Goulding and the series narrator David Attenborough, who attended the event to underline their support for action against climate change.</p><p>In his speech, Prince Charles said he hoped “Our Planet” would educate hundreds of millions of people around the world about what action was required, while David Attenborough called on the world to \"be responsible careful citizens of this planet which is our only home, and for the creatures that live in it.\"</p><p>The first teaser trailer for \"Our Planet\" was released on 8 November 2018. Three months later, on 4 February 2019, the second teaser trailer was released. On 19 March 2019, the official trailer for the documentary was released.</p><br/><h3>Episodes</h3><blockquote> series will explore the Earth's most important habitats, and celebrate the life they still support. We will reveal what must be preserved if we are to ensure a future where humans and nature can thrive.— David Attenborough, \"One Planet\"</blockquote><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#335E6E;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#335E6E\">Title</th><th scope=\"col\" style=\"background:#335E6E\">Produced by</th><th scope=\"col\" style=\"background:#335E6E\">Original release date <span style=\"background-color:white;padding:1px;display:inline-block;line-height:50%\"></span></th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"One Planet\"</td><td style=\"text-align:center\">Adam Chapman</td><td style=\"text-align:center\">5 April 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #335E6E\">Off the coast of <span>Peru</span>, millions of <span>cormorants</span> and <span>boobies</span> carpet bomb a <span>bait ball</span> of <span>anchovies</span>. A vast school of <span>mackerels</span> are hunting <span>krill</span>, who are then themselves hunted by dolphins and <span>shearwaters</span>. Flocks of <span>lesser flamingos</span> arrive at a <span>salt pan</span> after a deluge to nest, but as the water dries, the flamingo chicks have to embark on a journey to find water. At the <span>Serengeti</span>, a pack of <span>hunting dogs</span> pursue a <span>blue wildebeest</span> calf. An <span class=\"mw-redirect\">orchid</span> attracts a male <span>orchid bee</span> in search of a mate and attaches its <span>pollinium</span> onto the bee's back, providing the bee with fragrances to attract a mate. Different species of <span>manakins</span> have different types of courtship display. A herd of <span>caribou</span> retreat into a forest to take shelter from the harsh winter weather, but are hunted by a pack of <span>wolves</span>. Attenborough then warns of the rapid melting of <span>sea ice</span> in the <span>Arctic</span> and <span>Antarctica</span>, showing the impact it has on <span>polar bears</span>. In <span>Greenland</span>, a <span>glacier</span> collapses, creating a large tidal wave.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Frozen Worlds\"</td><td style=\"text-align:center\">Sophie Lanfear</td><td style=\"text-align:center\">5 April 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #335E6E\"><span>Gentoo penguins</span> climb to the top of a rocky outcrop to lay their eggs. Beneath the melting sea ice, trillions of <span>Antarctic krill</span> graze upon <span>algae</span>. The penguins and several <span>humpback whales</span> gather in large groups to feed on the abundant krill. A pod of <span>orcas</span> arrive and hunt the penguins. On the island of <span>South Georgia</span>, <span>wandering albatrosses</span> raise their chicks. <span>Leopard seals</span> stay the winter in the warmer waters of South Georgia to hunt <span>king penguins</span> out to find food for their chicks. Two male <span>southern elephant seals</span> fight over dominance. Far north in <span>Svalbard</span>, the impact climate change has on polar bear's hunting habits is shown, as <span>ringed seals</span> use dens less often, removing the bears' advantage of ambush. During summertime in the Canadian Arctic, <span>narwhals</span> wait for a crack in the ice to hide from predators in a shallow bay. Over a hundred thousand <span>walruses</span> have hauled out on a beach in the <span>Russian Far East</span> due to much of the sea ice having melted. Some of the walruses manage to scale the high cliffs, but many fall to their deaths.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Jungles\"</td><td style=\"text-align:center\">Huw Cordey</td><td style=\"text-align:center\">5 April 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #335E6E\">In the <span>Congolian rainforests</span>, a troop of <span>lowland gorillas</span> and <span>African forest elephants</span> travel to <span>Mbeli Bai</span>, a wet clearing in the middle of the jungle to feed. Different species of <span>birds-of-paradise</span> use different methods to attract mates. On the forest floors of Borneo, a <span>velvet worm</span> squirts a glue-like slime to capture a <span>cockroach</span>. The symbiotic relationship between various species of <span>pitcher plants</span> with <span>mountain treeshrews</span>, ants and <span>Hardwicke's woolly bats</span> is explored. A mated couple of <span>Philippine eagles</span> raise a chick in the declining <span>Philippines</span> rainforest. Some <span class=\"mw-redirect\">black spider monkeys</span> visit a salt lick down on the forest floor. <span>Leafcutter ants</span> ensure that their gardens are disease-free with the help of bacteria, however, one of the ants succumbs to a <span>fungal infection</span> that takes over its whole body. The episode ends in the rainforest of <span>Sumatra</span>, where mother <span>Sumatran orangutans</span> teach their young important life skills of survival.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Coastal Seas\"</td><td style=\"text-align:center\">Hugh Pearson</td><td style=\"text-align:center\">5 April 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #335E6E\">Several <span>giant trevallies</span> and <span>mobula</span> rays work together to feast on a shoal of anchovies. At the <span>Everglades National Park</span>, <span>bottlenose dolphins</span> herd <span>mullet</span> in a ring of mud. <span>Grey reef sharks</span> have a <span>cleaning symbiosis</span> with <span>cleaner wrasses</span> and at nighttime, they and <span>whitetip reef sharks</span> work together to hunt within a <span>coral reef</span>. <span>Corals</span> have a mutualistic relationship with algae, which help provide them with food, but because of rising sea temperatures, <span>coral begin to lose algae</span>, endangering the world's coral reefs. <span>Sea otters</span> and <span>California sheephead</span> help control the population of <span>sea urchins</span> in the Californian <span>kelp forests</span>. <span>Steller sea lions</span> and humpback whales congregate to feast on breeding shoals of <span>Pacific herring</span>. Due to <span>overfishing</span> and <span>unsustainable fishing methods</span>, Pacific herrings have been declining. The increasing temperatures have allowed <span>compass jellyfish</span> to skyrocket in numbers. Millions of seabirds roost off the coast of <span>Chile</span>. Although sharks were once extirpated from the <span>Raja Ampat Islands</span>, the surrounding seas were protected and it was turned into a shark nursery, restoring balance to the ecosystem.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"From Deserts to Grasslands\"</td><td style=\"text-align:center\">Adam Chapman</td><td style=\"text-align:center\">5 April 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #335E6E\">The dry <span>Atacama Desert</span> provides refuge for <span>Socotra cormorants</span>. Over the <span>Dhofar Mountains</span> in <span>Oman</span>, a male and female <span>Arabian leopard</span> mate. At the <span>Rub' al Khali</span> sand dunes, only desert specialists like the <span>Arabian oryx</span> are capable of survival. A herd of <span>desert elephants</span> are led by their matriarch to an <span>oasis</span>. A coalition of five male <span>cheetahs</span> take down a wildebeest. During the summer, male <span>American bison</span> fight over mating rights. Butterflies are abundant in farmlands in <span>Hungary</span> and the caterpillars of the <span>Alcon blue</span> rely on ants to carry them to their nests, where they will be fed by nurse ants. Once abundant throughout the <span>Eurasian Steppe</span>, <span>saiga antelope</span> are now critically endangered, but conservation efforts have been protecting them for years. Conservation efforts and captive breeding have also helped save another grassland animal, the <span>Przewalski's horse</span>. In the grasslands of <span>India</span>, a <span>Bengal tiger</span> stalks deer from the tall grass. Despite poaching and the growing population in India, the tiger population has been on the rise.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"High Seas\"</td><td style=\"text-align:center\">Hugh Pearson</td><td style=\"text-align:center\">5 April 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #335E6E\">A large pod of dolphins manage to escape from a pack of <span>false killer whales</span> with their superior speed. The <span>Gulf of California</span> provides a safe haven for female <span>blue whales</span> and their calves. Off the coast of <span>Costa Rica</span>, <span>yellowfin tuna</span> shadow a pod of <span>spinner dolphins</span> as they hunt <span>lanternfish</span>. Despite their tiny size, <span>phytoplankton</span> play an invaluable role in the ocean's food web and cloud formation. Deep into the <span>twilight zone</span>, several unique creatures like the <span>giant oarfish</span> and <span>deep-sea anglerfish</span> have unique adaptations to survive in a world of darkness. Deep water coral like <i><span>Lophelia</span></i> are home to smaller organisms like <span>bristle worms</span>, however, a lot of deep sea reefs have been destroyed by deep sea fishing nets. In the <span>Southern Ocean</span>, <span>giant petrels</span>, <span>black-browed albatrosses</span> and <span>Wilson's storm petrels</span> find a dead <span>sea lion</span> and are all scared off by the arrival of a wandering albatross. Hundreds of <span>Pacific bluefin tuna</span> pursue a bait ball of anchovies. Because of a combination of overfishing and <span>plastic pollution</span>, several fish species are now in peril. Squid numbers have been increasing, affecting the diets of some species. The episode concludes with a super-group of humpback whales aggregating off the coast of <span>South Africa</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Fresh Water\"</td><td style=\"text-align:center\">Mandi Stark</td><td style=\"text-align:center\">5 April 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #335E6E\">After the <span>Lake Eyre</span> dries up, several young <span>Australian pelicans</span> have to fly back to the coast. In the <span>Andes</span>, <span>torrent ducks</span> feed on scarce insect larvae. <span>Salmon</span> migrate from the ocean into the inland rivers to breed and <span class=\"mw-redirect\">Alaskan brown bears</span> await their arrival. The <span>Caño Cristales</span> in <span>Colombia</span> has flourishing populations of the colourful <i>Macarenia</i> plant. The warm <span>Floridan</span> rivers provide a winter refuge for <span>manatees</span>. Millions of mayflies emerge from the <span>Tisza</span> to mate before their deaths in three hours. In the <span>Pantanal</span> floodplains, a <span>jaguar</span> hunts a <span>caiman</span>. Male <span>callipterus</span> <span>cichlids</span> collect shells to attract females. The <span>Siamese fighting fish</span> is well adapted to living in oxygen-poor water. During a drought in <span>Tanzania</span>, several <span>hippos</span> are crammed in a muddy pool. <span>African buffalos</span> struggle to find water but <span>African elephants</span> are able to dig for water in the sand with their trunks. The <span>Platte River</span>, once a hotspot for <span>sandhill cranes</span> has now been dammed, although conservationists have been working to manage the river's flow to restore the cranes.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Forests\"</td><td style=\"text-align:center\">Jeff Wilson</td><td style=\"text-align:center\">5 April 2019</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #335E6E\">Deep in the forests of <span>Siberia</span>, some <span>wild boar</span> who are searching for pine cones in the forest floor are stalked by a <span>Siberian tiger</span>. Multiple <span>bald eagles</span> gather for a <span>salmon run</span>. Male <span>rough-skinned newts</span> tussle over mating with a female. As the summer ends, a forest fire occurs, but even after the destruction, flowers and tree seedlings sprout out from the soil. In the <span>Western Ghats</span> of <span>India</span>, <span>lion-tailed macaques</span> and <span>great hornbills</span> help with seed dispersal. The <span>Miombo</span> woodland in <span>Central Africa</span> not only serves as a hunting ground for hunting dogs and food for a large number of elephants, but a large swarm of <span>mopane worms</span> hatch in the woodland and quickly strip the trees bare. On the island of <span>Madagascar</span>, a pair of <span>fossas</span> mate and <span>leaf bugs</span> searching for tree sap help a <span>gray mouse lemur</span> find sugar. The planet's forests are known for their resilience, including <span class=\"mw-redirect\">Chornobyl</span>. Despite the amounts of radiation after the <span>Chernobyl disaster</span>, plants began to germinate after a decade and today, it still sustains a thriving population of animals including <span>roe deer</span>, Przewalski's horses and wolves.</td></tr></tbody></table><p>A 1 hour long bonus episode \"Our Planet - Behind The Scenes\" about the project is accessible under Additional Videos on Netflix.</p><br/><h3>Reception</h3><p>The review aggregator website Rotten Tomatoes reported an approval rating of 93% based on 27 reviews, and an average rating of 8.33/10. The website's critical consensus reads, \"A cornucopia of visual wonder and environmental advocacy, Our Planet's breathtaking cinematography explores more of this beautiful, blue marble while presenting an urgent call to action to its inhabitants\" Metacritic, which uses a weighted average, assigned the film a score of 88 out of 100, based on 7 critics, indicating \"universal acclaim\".</p><p>Lucy Mangan of The Guardian gave out 4 out of 5 stars to Our Planet, saying \"it places clearer emphasis on the fragility and interconnectedness of all the species and eco-systems on display, and on the huge impact, humanity has had on them in so short a time. Bryan Resnick of Vox praised the series as \"can’t really describe the scale of what’s missing\" stating \"It reminds us we’re living in an age of staggering wildlife loss due to human development, over-fishing, deforestation, and climate change. This series doesn’t let us forget that. Humans have caused staggering amounts of wildlife loss. Our Planet doesn’t hide from it.\" Ben Travers of Indie Wire gave out an overall B+ for the series, and claims that the series ruthlessly contrasts the world's natural wonders with the environmental crisis killing them off, he wrote \"Their deaths are a warning for the darkness underlying all of Our Planet, a nature docuseries no longer content with passive commentary. It also offers all the stunning imagery you’ve come to expect from these documentarians, but its attitude may surprise you. Individual entries feel a little less memorable because of it. The light, comic touches that made for lovely little moments in Planet Earth are overshadowed if not spoiled entirely, by the traumatic lessons put front and centre.\"</p><p>Will Gompertz of BBC also handed out a 4 out of 5 stars for the series, stating it \"gives us some of the most dazzling images you are ever likely to view on TV. When necessary, they are embellished with Attenborough's commentary, which is never obtrusive and always written with brevity and wit...It has been created by masters of their craft with an exceptional narrator, I do wonder, though, if the experienced executive producers at BBC would have sharpened up the first episode a little.\" Stuart McGurk of British GQ said \"It’s hard not to see this as a direct rebuke of the BBC’s nature documentaries: take one well-worn spectacular of the natural world, shoot it even more spectacularly than the BBC ever did and structure your whole opening episode around the idea that, without taking things like global warming seriously – without putting it front and centre about any show you’re making about the natural world, because how could you not – then pretty soon they’ll be nothing left to film so beautifully.\" Kevin Yeoman of Screen Rant concluded the series as \"stunningly ambitious\", he wrote \"Where Our Planet excels, though, is in its presentation. It’s not trying to convince anyone of anything — the time for doing that is long past. It’s simply stating this information as fact, in as straightforward a manner as possible. Not that it’s particularly difficult considering the evidence the series has on hand.\"</p><p>However, Ed Power of The Telegraph criticized the documentary series as \"visually dazzling but very familiar.\" and gave it a 3 out of 5 stars, writing \"It is clichéd in its portrayal of life on earth as a slow-motion ballet of tooth and claw....In short, the innovations that made Attenborough’s previous series so sensational are conspicuously absent. It’s a haunting vision. More of this and Our Planet might have been a meaningful addition to the canon of natural history series. Instead, it prioritizes cinematic grandeur to an almost oppressive degree.\" Writing in The Independent, Lucy Jones stated that the most important aspect of the series, which set it apart from other nature documentaries of its type, was the depictions of the harsh realities of global warming, mass species extinction and environmental degradation which were woven into the narration that accompanied the breathtaking scenes and imagery, but she also argues it did not go far enough and should have been more radical given current ecological crises. In particular, she says the program should have called out those responsible for this ecocide. When Attenborough's narration tells the audience \"We have destroyed half the forests on earth\", she retorts \"But, who is we? As well as the fossil fuel industry, where is the fishing industry? Agriculture? The plastics industry? The vested interests that keep the planet burning? Yes, we are all complicit – those of us in affluent societies with high-consumption lifestyles more so than anyone – but there are greater powers at work. Describing the scale of the challenge is necessary but I wanted the series to go further, to peer under the hood.\"</p><br/><h3>Soundtrack</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Our Planet</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\"><span>Steven Price</span></div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">5 April 2019 (Digital)</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><span>Soundtrack</span>, <span>Classical music</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"h\">2</span>:<span class=\"min\">26</span>:<span class=\"s\">00</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\">Decca Records, <span class=\"mw-redirect\">Universal Music</span></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Producer</span></th><td class=\"infobox-data hlist\">Netflix</td></tr></tbody></table><p>The soundtrack was released with a compilation of the incidental music specially commissioned for Our Planet. The theme song \"In This Together\", which is a collaboration with English singer and songwriter Ellie Goulding, is also included.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:60%\">Title</th><th scope=\"col\" style=\"width:40%\">Episode Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"This Is Our Planet\"</td><td>\"One Planet\"</td><td class=\"tracklist-length\">3:43</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"The Numbers Build\"</td><td>\"High Seas\"</td><td class=\"tracklist-length\">5:04</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"They Work as a Team\"</td><td>\"Frozen Worlds\"</td><td class=\"tracklist-length\">3:41</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"The Importance of This River\"</td><td>\"Freshwater\"</td><td class=\"tracklist-length\">2:40</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"An Ingenious Technique\"</td><td>\"Coastal Seas\"</td><td class=\"tracklist-length\">2:49</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"The Ocean Returns the Favour\"</td><td>\"Deserts and Grasslands\"</td><td class=\"tracklist-length\">2:20</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Baby Blue\"</td><td>\"High Seas\"</td><td class=\"tracklist-length\">4:51</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"Regeneration\"</td><td>\"Forests\"</td><td class=\"tracklist-length\">1:51</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"An Unknown Signal\"</td><td>\"One Planet\"</td><td class=\"tracklist-length\">5:08</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Too Big to Argue With\"</td><td>\"Jungles\"</td><td class=\"tracklist-length\">5:35</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Frozen Worlds\"</td><td>\"Frozen Worlds\"</td><td class=\"tracklist-length\">3:26</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"Mayflies\"</td><td>\"Freshwater\"</td><td class=\"tracklist-length\">3:08</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Great Rolling Waves\"</td><td>\"Coastal Seas\"</td><td class=\"tracklist-length\">6:36</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Crucial to Their Survival\"</td><td>\"Jungles\"</td><td class=\"tracklist-length\">7:25</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"Every Year There Are Others\"</td><td>\"Forests\"</td><td class=\"tracklist-length\">2:48</td></tr><tr><th id=\"track16\" scope=\"row\">16.</th><td>\"Where Life Gathers\"</td><td>\"One Planet\"</td><td class=\"tracklist-length\">3:20</td></tr><tr><th id=\"track17\" scope=\"row\">17.</th><td>\"The Perfect Gift\"</td><td>\"Frozen Worlds\"</td><td class=\"tracklist-length\">2:53</td></tr><tr><th id=\"track18\" scope=\"row\">18.</th><td>\"The Oceans Belong to Us All\"</td><td>\"High Seas\"</td><td class=\"tracklist-length\">6:19</td></tr><tr><th id=\"track19\" scope=\"row\">19.</th><td>\"Deserts and Grasslands\"</td><td>\"Deserts and Grasslands\"</td><td class=\"tracklist-length\">2:56</td></tr><tr><th id=\"track20\" scope=\"row\">20.</th><td>\"The Mighty Mekong\"</td><td>\"Freshwater\"</td><td class=\"tracklist-length\">2:01</td></tr><tr><th id=\"track21\" scope=\"row\">21.</th><td>\"Corals\"</td><td>\"Coastal Seas\"</td><td class=\"tracklist-length\">2:17</td></tr><tr><th id=\"track22\" scope=\"row\">22.</th><td>\"Leaf Cutters\"</td><td>\"Jungles\"</td><td class=\"tracklist-length\">1:18</td></tr><tr><th id=\"track23\" scope=\"row\">23.</th><td>\"Chernobyl\"</td><td>\"Forests\"</td><td class=\"tracklist-length\">7:03</td></tr><tr><th id=\"track24\" scope=\"row\">24.</th><td>\"Into the Woodlands\"</td><td>\"One Planet\"</td><td class=\"tracklist-length\">4:35</td></tr><tr><th id=\"track25\" scope=\"row\">25.</th><td>\"Signature Moves\"</td><td>\"One Planet\"</td><td class=\"tracklist-length\">2:35</td></tr><tr><th id=\"track26\" scope=\"row\">26.</th><td>\"Every Other Breath You Take\"</td><td>\"High Seas\"</td><td class=\"tracklist-length\">4:21</td></tr><tr><th id=\"track27\" scope=\"row\">27.</th><td>\"Arctic Refugees\"</td><td>\"Frozen Worlds\"</td><td class=\"tracklist-length\">6:38</td></tr><tr><th id=\"track28\" scope=\"row\">28.</th><td>\"A Sudden Turn\"</td><td>\"High Seas\"</td><td class=\"tracklist-length\">2:11</td></tr><tr><th id=\"track29\" scope=\"row\">29.</th><td>\"A Nest of Bubbles\"</td><td>\"Freshwater\"</td><td class=\"tracklist-length\">1:56</td></tr><tr><th id=\"track30\" scope=\"row\">30.</th><td>\"He Wins Her Approval\"</td><td>\"Jungles\"</td><td class=\"tracklist-length\">1:42</td></tr><tr><th id=\"track31\" scope=\"row\">31.</th><td>\"Majestic Submarine Forests\"</td><td>\"Coastal Seas\"</td><td class=\"tracklist-length\">2:28</td></tr><tr><th id=\"track32\" scope=\"row\">32.</th><td>\"They Came Back\"</td><td>\"Deserts and Grasslands\"</td><td class=\"tracklist-length\">2:33</td></tr><tr><th id=\"track33\" scope=\"row\">33.</th><td>\"We Must Preserve What's Left\"</td><td>\"Jungles\"</td><td class=\"tracklist-length\">2:28</td></tr><tr><th id=\"track34\" scope=\"row\">34.</th><td>\"Ice Caves\"</td><td>\"Freshwater\"</td><td class=\"tracklist-length\">2:26</td></tr><tr><th id=\"track35\" scope=\"row\">35.</th><td>\"Mythical Creatures Follow\"</td><td>\"Frozen Worlds\"</td><td class=\"tracklist-length\">3:31</td></tr><tr><th id=\"track36\" scope=\"row\">36.</th><td>\"They Have Come to a Desert\"</td><td>\"Deserts and Grasslands\"</td><td class=\"tracklist-length\">1:41</td></tr><tr><th id=\"track37\" scope=\"row\">37.</th><td>\"This Glacial Ice\"</td><td>\"One Planet\"</td><td class=\"tracklist-length\">7:42</td></tr><tr><th id=\"track38\" scope=\"row\">38.</th><td>\"A Greater Resilience\"</td><td>\"Coastal Seas\"</td><td class=\"tracklist-length\">4:02</td></tr><tr><th id=\"track39\" scope=\"row\">39.</th><td>\"The Next Twenty Years\"</td><td>\"One Planet\"</td><td class=\"tracklist-length\">1:41</td></tr><tr><th id=\"track40\" scope=\"row\">40.</th><td>\"In This Together\"</td><td>With <span>Ellie Goulding</span></td><td class=\"tracklist-length\">4:43</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"3\" scope=\"row\"><span>Total length:</span></th><td>120:26</td></tr></tbody></table><br/><h3>Broadcast</h3><p>Starting from 20 June 2020, the series was aired on Indonesian television network TVRI as a part of Belajar dari Rumah (Study from Home) programming block, made possible by a partnership between the Ministry of Education and Culture and Netflix. The broadcast marked the first Netflix original documentary series ever aired on conventional television, alongside a collection of Netflix documentaries included in the partnership.</p><p>During the COVID-19 pandemic, Netflix has made the series available for free streaming on YouTube as an educational resource.</p><br/>"
  },
  "errorMessage": ""
}