{
  "imDbId": "tt1710308",
  "title": "Regular Show",
  "fullTitle": "Regular Show (TV Series 2009–2017)",
  "type": "TVSeries",
  "year": "2009",
  "items": [
    {
      "username": "gigan-92",
      "userUrl": "https://www.imdb.com/user/ur20916867",
      "reviewLink": "https://www.imdb.com/review/rw2365116",
      "warningSpoilers": true,
      "date": "6 January 2011",
      "rate": "10",
      "helpful": "47 out of 50 found this helpful.",
      "title": "J. G. Quintel !! A Very Satisfying Show That Delivers!!",
      "content": "J. G. Quintel, who many of you may know from The Marvelous Misadventures of Flapjack, delivers a new show that is truly hilarious. Recovering from a few truly putrid shows, such as the despicable \"Hero 108\", Cartoon Network has released this show, with many a good reason to watch. Firstly, spectacular voice cast. J. G. Quintel himself voices Mordecai, and William Salyers voices Rigby, his best friend. Mark Hamill (!!) is Skips, the duo's close friend. The rest of the cast is just so great at being their characters, no joke. These characters are the first in awhile to feel very real to me, with truth be told humor aimed at maybe slightly older kids, but I believe it's for the best. It's nowhere near vulgar, as some try to suggest, just good humor in general.The artwork is pretty good, and the story lines are easy to get and guaranteed to be pretty damn funny!!I can see this how is destined to becomes one of the classics, while bringing in several new traits that make it its own."
    },
    {
      "username": "psypeterson",
      "userUrl": "https://www.imdb.com/user/ur15288449",
      "reviewLink": "https://www.imdb.com/review/rw2474279",
      "warningSpoilers": false,
      "date": "15 August 2011",
      "rate": "10",
      "helpful": "92 out of 95 found this helpful.",
      "title": "Not for kids, but still a total gem.",
      "content": "What do Monster Squad, Loverboy, Sylvester Stallone, Back to the Future, Bruce Campbell, 80s Hair Metal, and The Crying Game all have in common? They all have been a punchline, set-up, or reference in Regular Show.To get to brass tacks, this show is hilarious. A blend of slacker- humour and surreal plot lines, Regular Show is recommended viewing for all mature cartoon audiences. It tackles moral dilemmas without being preachy, it uses \"random\" humour in a way which drives the plot to non- random outcomes, and its light enough on its mature themes that it can nail a safe PG rating (maybe PG 13 if you're one of those conservative types).However; where Regular Show really shines is in its total awareness of what makes adults who grew up in the 80s and 90s tear up and laugh out loud all at once: Nostalgia. One major example of this is an entire episode which is a parody of (and indeed, named) Over the Top. Another example is the constant montages set to old tunes from decades past, such as Hang Tough and Workin' for the Weekend. Even better are the tiny references which most people under 25 wouldn't get, and hold screen time for mere moments before you're left wondering \"Hey, didn't I see that scene in Logan's Run?\".As I said, this cartoon is not for kids, but not because its racy and sometimes inappropriate. It isn't for kids because the funniest jokes are made for guys like me: 25 - 40 year old geeks who can pick out the references, and appreciate the parodies. For this reason alone I love this show, but even then it can still stand up on its own as an entertaining cartoon.EDIT: Since the time of this writing, I have witnessed a They Live reference, the Death Star with sunglasses, and a scene where the characters go on an \"acid trip\" (they eat a concoction of spicy foods and then start tripping out) set to the tune of Mississippi Queen. This show just got even better."
    },
    {
      "username": "ColtPython82",
      "userUrl": "https://www.imdb.com/user/ur62191031",
      "reviewLink": "https://www.imdb.com/review/rw5084689",
      "warningSpoilers": false,
      "date": "27 August 2019",
      "rate": "10",
      "helpful": "43 out of 44 found this helpful.",
      "title": "BRING REGULAR SHOW BACK!",
      "content": "This show NEEDS to come back, ended too soon! The creator has another series in the works, but that's been for awhile now. What we really want is Regular Show back on the air, maybe change the location or something, but bring it back!"
    },
    {
      "username": "Rectangular_businessman",
      "userUrl": "https://www.imdb.com/user/ur13538926",
      "reviewLink": "https://www.imdb.com/review/rw2500131",
      "warningSpoilers": true,
      "date": "8 October 2011",
      "rate": "10",
      "helpful": "31 out of 33 found this helpful.",
      "title": "Surprisingly good",
      "content": "I think that, along with \"Phineas and Ferb\", \"Regular Show\" is one of the most promising cartoons from the recent years.At first, its seems just like any other of the strange animations that Cartoon Network have been showing in the recent years (Such as \"Chowder\", \"Flapjack\" or \"The Amazing World of Gumball\") but, personally, I think that \"Regular Show\" goes beyond than anything delivered by those cartoons that I previously mentioned, being stranger, but at the same time, funnier and more enjoyable.I think that is because of the characters, which are way more likable and developed than the typical \"trouble-makers\" that tend to appear in most of the animated shows from the recent years: Sure, the two main characters, Mordecai and Rigby, aren't exactly role-models, but they have many positive characteristics that made them more complex, instead of being one-dimensional stereotypes. That's the greatest virtue from this series and something that makes this show pleasant, despite all the strangeness of it.I liked the way in which this series includes subtle (Sometimes, not so subtle) hints of more mature humor, making this cartoon interesting for kids and adults as well. I also liked the fact that the comedy of this series is more focused in the situations and the personality of the characters, instead of using gross jokes or dumb cultural references.The first and the second season from \"Regular Show\" were very good. I hope that the rest of the series keep the same level of quality."
    },
    {
      "username": "Pukeonthestreet",
      "userUrl": "https://www.imdb.com/user/ur113529171",
      "reviewLink": "https://www.imdb.com/review/rw5474369",
      "warningSpoilers": false,
      "date": "10 February 2020",
      "rate": "9",
      "helpful": "15 out of 15 found this helpful.",
      "title": "Good show! Jolly good show!",
      "content": "Such a great cartoon. It's genuinely funny and original. Meant as much for adults as it is kids. I don't know why it ever got canceled and I'm genuinely bummed it never came out as a blu ray box set."
    },
    {
      "username": "ethereal_heart",
      "userUrl": "https://www.imdb.com/user/ur16669078",
      "reviewLink": "https://www.imdb.com/review/rw2537643",
      "warningSpoilers": true,
      "date": "25 December 2011",
      "rate": "9",
      "helpful": "18 out of 18 found this helpful.",
      "title": "Fun for Teens and Young Adults",
      "content": "At first it was one of those shows that I judged by it's cover. But in Curiosity I decided to watch it. After watching a few episodes, I loved it.The show is really funny and adventurous! It tells the misadventures of two friends who turn their everyday job from fun to one of those action/supernatural situations.What's surprising it's that even the show's creator J. G. Quintel does the voice one of the main characters. Even Mark Hamill voices one of the supporting characters.If you like the Simpsons, Family Guy, Beavis and Butthead and other shows similar I recommend, you check this out!"
    },
    {
      "username": "koyasu_kudou",
      "userUrl": "https://www.imdb.com/user/ur6722845",
      "reviewLink": "https://www.imdb.com/review/rw2454766",
      "warningSpoilers": false,
      "date": "7 July 2011",
      "rate": "10",
      "helpful": "156 out of 161 found this helpful.",
      "title": "Rated PG!",
      "content": "Regular Show is a fitting title for a program that takes ordinary chores, such as preparing hot dogs, setting up chairs or cleaning a rain gutter and exaggerating the consequences of not performing said chores correctly. The main characters are a couple of slackers in their twenties who live only for the moment, even if that means getting fired. They constantly get into trouble due to their irresponsibility, but always manage to end up on top through some hilarious twist.That said...Regular Show is rated PG, not G, not Y7. Every time I read a negative review for this show, someone is whining about how Cartoon Network should feel ashamed for making such a vulgar children's program. Newsflash, just because it's a cartoon doesn't mean it's for kids. Family Guy has already proved that. There is a warning ahead of time that underage viewers require parental guidance, PG. Personally, I'd say it's about as raunchy as Ren and Stimpy or Rocko's Modern Life and Rocko was very, very raunchy, hence the deletion of certain scenes during re-runs. And who can forget Chokey Chicken, hm? If you're a grown up, give it a chance. If you're a grown up with kids who wanna watch it, consider their age and go from there. And if you do end up loving this show, you'll be telling \"my mom\" jokes in no time.Can I get an \"OOOOHH!\" from everybody else who is addicted to this show? And remember to raise your right arm while you do it."
    },
    {
      "username": "minutolo",
      "userUrl": "https://www.imdb.com/user/ur70661952",
      "reviewLink": "https://www.imdb.com/review/rw6673059",
      "warningSpoilers": false,
      "date": "8 March 2021",
      "rate": "9",
      "helpful": "11 out of 11 found this helpful.",
      "title": "Every episode is a rollercoaster",
      "content": "One of Cartoon Network's more creative endeavors, Regular Show is anything but. Using 80s soundtracking and trippy segments, RS captures some great moments. Definitely not for little ones. Teens will love it and adults will love it more."
    },
    {
      "username": "TheConnoisseurReviews",
      "userUrl": "https://www.imdb.com/user/ur23654883",
      "reviewLink": "https://www.imdb.com/review/rw2650258",
      "warningSpoilers": false,
      "date": "27 July 2012",
      "rate": "10",
      "helpful": "16 out of 17 found this helpful.",
      "title": "My thoughts",
      "content": "Many people, mainly kids from the 90s, say that modern cartoons suck. i am also one of those people. I feel that a lot of modern cartoons lack the charm and quality of animation of the cartoons of the past. They also lack strong writing and imagination. Most cartoons now a days talk down to the audience or bombard us with cheap poorly written jokes. However, every once in a while a fantastic show comes around and brings back hope for the future. Unfortunately these shows a few in between.Cartoon Network used to be the best source for cartoons such as Dexter, Powerpuff Girls, Johnny Bravo, and Ed, Edd, n Eddy just to name a few. All very distinct shows with smart humor, likable cast, and a visually pleasing style. However, they were replaced midway through the 00s with shows that couldn't compete. The new shows weren't smart, they relied heavily on gross out humor or they were very kiddish. But luckily for us, the creator of the \"Powerpuff Girls,\" Craig McKracken, was creating a new show for the CN to get more cartoons on the channel. \"Cartoonstitute\" was a show in the similar vain of \"What A Cartoon,\" where a lot of famous cartoons were conceived. Unfortunately plans were scrapped and only one show came out all of this, \"Regular Show.\"\"Regular Show,\" created by J.G. Quintel, is about two friends, a blue jay and raccoon, who work at a park. They are very lazy and in efforts to skip out on work they get themselves into some surreal misadventures.The cast includes: Mordecai: He's a lazy blue jay, but the more mature of the two leads. Him and Rigby have a friendly rivalry going that usually causes him to do some the stupid things he does.Rigby: He's the lazy childish raccoon. He's really stubborn and always like things going in his way, which 99% of the time don't. So in effort to do so he gets them in trouble.Benson: Their hot headed boss and manager of the park, who is in the shape of a gum-ball machine with arms. He usually loses his temper when the other two don't listen and get their job done.Skips: A yeti, who is apparently immortal. He's really wise and usually get the gang out of danger.Pops: Naive lollipop shaped man. He is an elderly man, but acts very child like. He usually falls for anything.Muscle Man: Another worker at the park, he's green, dwarfish, and incredibly overweight. He usually bullies Rigby and Mordecai because he thinks he is better than everyone. His catch phrase is \"My Mom!\" (poor attempts at \"Your Mom\" jokes) High-Five Ghost: A ghost with a hand extend from his head. He usually follows Muscle Man as his yes man.The cast is likable and fun. They all have a sarcastic sense of humor except Pops, Muscle Man, and High-Five Ghost. Even though they don't show it, they care for their fellow co-workers. When danger strikes they will go to the extreme to rescue one another. There are other great side characters that are just as great if not sometimes steal the show from the leads.The animation is fairly simple, but that adds to its charm. The backgrounds are usually very well detailed. The show also pays homage to the 80s through some of its visuals like the video games the characters play or a coffee shop, very reminiscent of the 80s. While the animation is fairly simple, the artists play around with different visual styles, which add to the visual bliss of the show.So each episode starts of normal enough, but ends in some kind of supernatural confrontation. For instance, one episode stars off with Mordecai and Rigby having to set up some chair. When they go into the storage room to grab the chairs, they come across and old arcade system. While playing the game they release a demon, who is out to destroy the world and the only way to defeat him is to beat the game. Essentially every episode starts of with a mundane task and goes into the supernatural. I really like how they don't spend time asking why. The events happen and they just try to figure it out. We get a lot of extraordinary adventures and the show is very creative. I really like how they pay homage to the 80s whether it be through the outfits characters to the games they play. The world they live in is very modern, but it has a very retro vibe.To end it I wanna make this bold statement and call \"Regular Show\" the best animated series on television right now. It's very visually pleasing, the jokes are smart and funny, the characters are great, and the adventures they go on are fantastic. My personal favorite episode right now is \"This Is My Jam.\" The episode is about Rigby getting an annoyingly catchy song stuck in his head. In an effort to remove the song, it manifests into a giant cassette and annoys everyone and the only way to defeat it is to write an even cheesier song. This is one of the more toned down episode in terms of the supernatural, but I love how they made something so simple into a threat. And I bet many of us have this problem as well. Hopefully the show continues on and entertains us with more laughs. If haven't seen the show yet, I highly recommend it."
    },
    {
      "username": "Theraxorterminate",
      "userUrl": "https://www.imdb.com/user/ur29228549",
      "reviewLink": "https://www.imdb.com/review/rw2955501",
      "warningSpoilers": true,
      "date": "5 February 2014",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Strange, but I love it!",
      "content": "I don't wanna exaggerate but there are so many things I want to say about Regular Show. First of all I wasn't impressed of it when I saw it for the very first time. I was so unsure about it not because of it's rudeness but I didn't think it was going to be so funny in the way of my sense of humor. But I gave it a second chance not only opening my mind but also finding about for what humor it delivers. And the result: Funny as heck!I love it because of it's jinxed and twisted adventures the characters enter. Yes it really is a creative cartoon, sometimes a bit messed up and can become extremely strange but it does not become too overrated but mostly pure fun in different locations and worlds. But what I like about the show is it's characters, every character has something that could make you relate to them. Some of them even remind me of the people I know or knew.I like the character Mordecai he's the kind of character I have in my days. Rigby, I know he admitted by himself that he's a horrible person but I can't stop laughing at his ideas and commentaries. Benson might be hotheaded at times but he can be loyal. Pops is nice even though he might have some unlucky moments which might make you feel sorry for him. Although if I had to pick one interesting character that would be Skips. Not only for being voiced by the legendary Mark Hamill but he becomes more interesting for each episode that centers about him. And he's the guy you can absolutely trust.But what I also love about this show is that it has a continuity process. So there certainly are stories told here that gives the show a go and some episodes can become more interesting and closer to the relationships of the characters. One thing that I see on the show is that it seems to have been using inspirations from one of my favorite shows (which is also the creator J.G. Quintel's favorite) \"The Simpsons\". The humor is funnier than what I really were expecting. However the first and the second season can become crude at times but I don't find them disturbing. I don't think the show is going down right now, I do believe it's going to concentrate more difficult stories for the characters.One last thing: I think this show is not only showing it's craziness, but one thing what makes Regular show so different from many other cartoons is that in some episodes it does deliver really good messages and good things to know after their adventure. Is it recommended? Why not? But I suggest that you look at the first episode and going straight forward to follow it's continuity more focused. I look forward for more episodes and I'm actually excited to see what's going to happen with one of the protagonists especially Mordecai."
    },
    {
      "username": "GravityLoudHouseLover1",
      "userUrl": "https://www.imdb.com/user/ur61206453",
      "reviewLink": "https://www.imdb.com/review/rw3804888",
      "warningSpoilers": true,
      "date": "13 September 2017",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "I Can't believe Regular Show is over 😭Goodbye Regular Show 2010-2017",
      "content": "Hello everybody Today I'm reviewing Regular Show I know I did a review of this Show two years ago but it has finally ended after Eight Seasons. Regular Show is Sadly over and I miss it. Anyway for those of you who never heard of Regular Show. The show was about a blue jay Named Mordecai & a raccoon named Rigby & they are slackers at a park & they work for there hot tempered Gumball Machine named Benson & he yells at them a lot. Their friends were Skips a yeti, Pops a Lollipop man who sadly dead in the finale. Muscle Man a green man who is best friends with his buddy Hi Five Ghost. The show ended it's run on Monday, January 16, 2017 with Eight Seasons & 261 Episodes. The show is a Cult Classic in My opinion and I will Miss it a lot. Anyway Regular Show will be in my heart as one of the best cartoons of 2010s along with Gravity Falls. #GoodByeRegularShow 10/10."
    },
    {
      "username": "G-Joshua-Benjamin",
      "userUrl": "https://www.imdb.com/user/ur22113277",
      "reviewLink": "https://www.imdb.com/review/rw2329575",
      "warningSpoilers": false,
      "date": "25 October 2010",
      "rate": "10",
      "helpful": "53 out of 64 found this helpful.",
      "title": "Such a funny show",
      "content": "I saw the preview of this a few months before it was on. I was excited when I finally fiosed it and got to watch. It is so funny and simple to understand. Once you watch an episode or two you can almost tell what the main characters are going to do in when things happen. They are easy to like and laugh with. I was born in 85 and I have not been as excited about a cartoon in a long time. Go cartoon network go. I also like the new scooby doo cartoon as well as tower prep. Cartoon network is making great shows that people of any age can enjoy. It is good to know that shows are being made that families can watch together. So, go watch!!!!"
    },
    {
      "username": "lostcinematheq",
      "userUrl": "https://www.imdb.com/user/ur113986290",
      "reviewLink": "https://www.imdb.com/review/rw6951882",
      "warningSpoilers": false,
      "date": "22 May 2021",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "Regular Show",
      "content": "Starts out a little rough, but once it gains it's footing around Seasons 2, it has some of the best character writing in any comedy I've ever seen, mixing episodic comedy with serialized subplots. Season 7's finale was actually a perfect overall series finale, and Season 8 wasn't necessary but it was another interesting conclusion. This series shows what it means to be an adult while being a child at heart!"
    },
    {
      "username": "samueldietrich",
      "userUrl": "https://www.imdb.com/user/ur61226034",
      "reviewLink": "https://www.imdb.com/review/rw3287878",
      "warningSpoilers": true,
      "date": "30 July 2015",
      "rate": "9",
      "helpful": "22 out of 23 found this helpful.",
      "title": "As a kid, I loved it. As a teenager, I love it even more!",
      "content": "This is one of the craziest shows ever. Not only with good jokes for kids and adults, but also with crazy scenarios you'd never think could happen. Like hot dogs coming to life, how eating an omelet could save your friend or kill you, and how the game \"jinx\" could turn the people into black, demented zombies (No, not THAT black like racist like demon-like zombies. Not only are the scenarios great and fun, but so are the characters. Mordecai and Rigby are funny, but then there's Muscle Man, high-five ghost, Skips, Benson, pops, Margaret, Eileen. Even \"Giant beardo face\"...oh! It's Garrett Bobby Ferguson😆. I grew up with this show and even going into it's 7th season, this show keeps getting funnier and grander. And, in my opinion, it's the most QUOTABLE show EVER! From \"My MOM!\" to \"Not setting the chairs next time!\", this show has so many memorable lines. And if any show's got all that, including Mark Hamill, this show is one of Cartoon Network's greatest shows. Heck, maybe one of the best shows ever! So, that's it. WOOO! Later, ladies!👍🏻"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2526380",
      "warningSpoilers": false,
      "date": "1 December 2011",
      "rate": "9",
      "helpful": "19 out of 23 found this helpful.",
      "title": "One of the better recent shows on Cartoon Network",
      "content": "As a huge animation fan, I heard much about Regular Show, mostly positive but with some negatives too. I am so glad that I gave it a chance because in my opinion Regular Show is one of the funnier and better recent shows on Cartoon Network alongside Adventure Time and Chowder. In fact the only one airing now that I hate and am at a wonder why it's still airing is Johnny Test.Is Regular Show as good as Dexter's Laboratory, Powerpuff Girls, Samurai Jack and Courage the Cowardly Dog? No, not quite. But that is not an excuse for me to not like it. The animation is clean and smooth with some quite appealing colouring, and the music is great with the main theme one of the catchiest and coolest main themes of any Cartoon Network show in recent years.The writing is wonderfully creative, very witty and very funny. The story lines are interesting and a lot of fun, true some of them are on the weird side(eg. the episode with Tim Curry voicing a hot dog leader) but that worked in the show's favour in alternative to against it. The characters have great personalities, are endearing and exude a great chemistry. The voice acting is consistently good, with some funny and dynamic work from both promising and prolific voice actors.Overall, I like it very much, it was much better than I thought. 9/10 Bethany Cox"
    },
    {
      "username": "daaaaarrin",
      "userUrl": "https://www.imdb.com/user/ur136783122",
      "reviewLink": "https://www.imdb.com/review/rw7337838",
      "warningSpoilers": false,
      "date": "12 September 2021",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Whats not to love?",
      "content": "Right up there with Adventure Time and Gravity Falls."
    },
    {
      "username": "bsblubblub",
      "userUrl": "https://www.imdb.com/user/ur43103322",
      "reviewLink": "https://www.imdb.com/review/rw2810839",
      "warningSpoilers": false,
      "date": "10 June 2013",
      "rate": "10",
      "helpful": "15 out of 15 found this helpful.",
      "title": "Great show!",
      "content": "Regular show is great! I found many parts funny and a great plot for each episode. Regular show is about two guys named Mordecai and Rigby, one a blue jay, one a raccoon. Mordecai is the \"responsible one\" who always gets in trouble by his boss Benson, because of Rigby being lazy and not working. I love how the title is \"Regular Show\" But everything is irregular, because each episode has this crazy impossible event which includes monsters, magic, powers, and funny jokes. . Hey, it's anything but! This show and Adventure time just SAVED cartoon network from it's other bad shows (except the old cartoon network shows). But only if they made more shows on cartoon network like this. I mean seriously, what's with teen titans go? I like the old one better. And what is with the show incredible crew? J.G Quintel (creator of regular show) and Pendleton Ward(creator for Adventure Time) should make more and betters shows like this."
    },
    {
      "username": "roooftbusiness",
      "userUrl": "https://www.imdb.com/user/ur136130063",
      "reviewLink": "https://www.imdb.com/review/rw7342482",
      "warningSpoilers": true,
      "date": "14 September 2021",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "A show that made me laugh and cry",
      "content": "This show may seem like a simple wacky adventure kids show on the surface but it's anything but. After watching through the entirety of the show it amazes me that this was aired on Cartoon Network. It's not afraid to tackle dark themes; from plain old depression to the enevability of death and the knowing you can't do anything about it. It stays solid all the way through the seasons and doesn't have any unwatchable episodes. Mordicai's relationships are absolutely heartbreaking and actually makes you feel for these fictional characters. But when Pops sacrificed himself to save his friends it honestly made me cry for the first time watching a TV show. The final montage of the characters growing up topped with the song \"Heroes\" was just absolutely amazing and in my opinion rivals Breaking Bads ending. A brilliant ending to a brilliant show!"
    },
    {
      "username": "WeAreLive",
      "userUrl": "https://www.imdb.com/user/ur79460801",
      "reviewLink": "https://www.imdb.com/review/rw3853298",
      "warningSpoilers": true,
      "date": "9 November 2017",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Last show i ever watched on Cartoon Network before it ended",
      "content": "I really loved this show as a kid I first watched it when I was 11 years old at first when I saw the promos I wasn't interested but it had looked more appealing then adventure time or the amazing world of gumball. Then I heard my friends at school talk about this show and how good it was so I decided to give it a try and after the first, I was hooked.From there and on I tried to catch it every Monday when new episodes would air. This is was definitely creative, funny, had a few serious moments, a bit of action and generally a good story. It is definitely cleaver that in this world there are humans, different creatures, and hybrids living together in peace.Mordica and Rigby were my favorite characters their friendship with each other inspired my childhood. Okay sometimes they did have arguments and fights like in the Video Game wizard episode and the do me a sold episode but overall they had a good friendship with each other considering one is a Jaybird and the other is a raccoon. In fact, we even see them fit in Pops (RIP) the lollipop man, Skips the yeti, Muscle and High Five Ghost with their manager Benson the gumball machine. They all work at a park and solve different problems with each other. Okay, I have to admit I stopped watching it for a bit because of the whole Mordica and CJ thing but after when they broke up I came back.I think season 7 was the best season of the whole series especially the last battle. My favorite episode of the entire series is Exist 9B because of the amazing fight for the park. I also liked Benson's pig, High Score, a few Halloween specials and Just set up the chairs.In fact, the entire cast was good in the whole series and we even had a few good celebrities and actors for a few episodes.It's a shame this show ended because it was the only good show left on Cartoon Networks since it is now filled with bad shows like TTG, Clarance and The amazing world of gumball. But if you want to have a TV show which is very creative and uses imagination because I would recommend the not so regular Regular Show for both new and old generations of CN fans."
    },
    {
      "username": "mitsubishizero",
      "userUrl": "https://www.imdb.com/user/ur85976313",
      "reviewLink": "https://www.imdb.com/review/rw6082935",
      "warningSpoilers": false,
      "date": "10 September 2020",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Anything but regular.",
      "content": "This's one of the most surreal shows I've ever seen and I mean that in a good way. Inspire of what the title suggest, anything can happen. Almost anything. The show focuses on two slackers who work at a park named Mortdecai and Rigby. They'll do anything to get out of work, much to the chagrin of their boss Benson(Sam Marin).Whenever their schemes backfire, they often require the help of fellow park employee Skips(Mark Hamill). When it's all said and done, do they learn their lesson? Sort of... not really. Instead it's one hairbrained scheme after another.This show is crazy and I love it! The characters are fun to watch, the stories are funny and creative yet minimal, and the dialogue is sure to get a few laughs ranging from a snicker to a chuckle. The duo are hilarious in their chemistry and they deal with their boss and other coworkers. Initially, I thought Benson was a huge stick in the mud but the more I thought about it, I realized he's just doing his job. The show makes it clear he can get fired too if things aren't how they should be?One of my favorite episodes is the one where they're assigned to set up the chairs. At first things go well until they come up short of chairs. Thanks to rugby's ignorance an arcade monster's revived and proceeds to wreck havoc. I won't tell you how they fight it but man, it's hilarious.If you like surreal humor, I highly suggest you check this out. You're bound to get more than a few laughs out of it. Drop in dude. Ohhhhh!"
    },
    {
      "username": "mitsubishizero",
      "userUrl": "https://www.imdb.com/user/ur85976313",
      "reviewLink": "https://www.imdb.com/review/rw4795294",
      "warningSpoilers": true,
      "date": "22 April 2019",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Hilariously surreal!",
      "content": "As the tagline suggest it's anything but regular and I love it. The show follows 2 best friends Mordecai and Rigby, a blue jay and raccoon who work at a park and do their best to slack off much to the frustration of their boss Benson, a walking gumball machine who has a short fuse. Usually when they slack off they get into a surreal misadventure which requires the help of their coworkers Skips, a wise, quiet yeti, Muscleman, Hi-five ghost and Pops. I find it hilarious for many reasons: The characters are likable and have well defined traits (though it can be annoying when they slack off because you want to see them get their job done right), the humor's off the wall but works due to the setup of the reality they live in.A good example is an episode where they try to beat an arcade game high score in order to get respect after complaining about being paid in sandwich bags rather than checks. When they try to beat the high score the champion who looks like Billy Mitchell's disembodied head comes and tries to manipulate them into giving up after coming up with a sob story which works until they realize he lied and return to finish the job. The humor's also risque which may turn some parent's heads. All in all this's a great cartoon. It just goes to show that a cartoon can be weird and still be good. Take it for what it's worth and see for yourself."
    },
    {
      "username": "amooorales",
      "userUrl": "https://www.imdb.com/user/ur26373760",
      "reviewLink": "https://www.imdb.com/review/rw7505160",
      "warningSpoilers": false,
      "date": "2 November 2021",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "On my 2nd rewatch",
      "content": "I remember when regular show aired back in 2010, along with adventure time I thought both shows were not my type of humor, and I thought that my era of cartoon shows were dying out. I was around 12 years old around that time and now I'm 23 on my 2nd rewatch. What I love about regular show is that they don't rely on r-rated humor to tell the punchlines, even though jokes like that are implied throughout the show, it tells them in a clever and funny way that you don't get with other adult cartoons. This show is absolutely genius."
    },
    {
      "username": "umlaziking",
      "userUrl": "https://www.imdb.com/user/ur110613987",
      "reviewLink": "https://www.imdb.com/review/rw7774877",
      "warningSpoilers": false,
      "date": "19 January 2022",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "This show is finally getting the recognition it deserves",
      "content": "Absolutely brilliant show and definitely the best TV show cartoon network has ever produced. This show finally made it to the top 250 TV shows of all time here on IMDb. Simply brilliant, Absolutely brilliant. If you guys haven't checked it out, please do...believe me you won't regret it....it will hold you from the very first episode."
    },
    {
      "username": "BabyDexter4444",
      "userUrl": "https://www.imdb.com/user/ur119831868",
      "reviewLink": "https://www.imdb.com/review/rw5913343",
      "warningSpoilers": false,
      "date": "17 July 2020",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Best CN Show",
      "content": "Easy, It's a funny cartoon with emotion and passion. The best CN Show."
    },
    {
      "username": "believeinflight",
      "userUrl": "https://www.imdb.com/user/ur69233734",
      "reviewLink": "https://www.imdb.com/review/rw4746620",
      "warningSpoilers": false,
      "date": "27 March 2019",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Better than some adult animation",
      "content": "I am in my twenties and this show is very entertaining. It is very funny and most of the episodes have enough adult humor with a kid side to keep me laughing and liking each character except for one. Love this show and gave it 9 only because there are a few animation shows I'll put at 10. Love the show though."
    }
  ],
  "errorMessage": ""
}