{
  "imDbId": "tt0487831",
  "title": "The IT Crowd",
  "fullTitle": "The IT Crowd (TV Series 2006–2013)",
  "type": "TVSeries",
  "year": "2006",
  "items": [
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw3358371",
      "warningSpoilers": false,
      "date": "20 November 2015",
      "rate": "10",
      "helpful": "69 out of 73 found this helpful.",
      "title": "Comedy at its best.",
      "content": "This is truly a comedy of pure genius. All the elements involved are spot on, and combine to make a show of pure brilliance. Brilliant scripts, wonderfully acted, the mix of Chris O'Dowd, Richard Ayoade and Katherine Parkinson combine outrageously well. Huge credit to Graham Linehan too, previously successful with Father Ted and Black Books his pedigree is there for all to see. The out and out funniest episode in my humble opinion had to be The work outing, which I can watch again and again and still be belly laughing, it's immense, other top quality episodes include The Speech, Calamity Jen and finale The internet is coming. Very few dips in quality.What a shame it had to finish, this was gold. 10/10"
    },
    {
      "username": "brando647",
      "userUrl": "https://www.imdb.com/user/ur3947986",
      "reviewLink": "https://www.imdb.com/review/rw3129018",
      "warningSpoilers": false,
      "date": "22 November 2014",
      "rate": "9",
      "helpful": "64 out of 68 found this helpful.",
      "title": "One of the Funniest Sitcoms I've Ever Watched",
      "content": "For those who complain that \"The Big Bang Theory\" is too artificial and panders to mainstream audiences, there's a fantastic option for getting your geek/comedy fix in the U.K.'s \"The IT Crowd\". The sitcom, from writer/director Graham Linehan, is one of the funniest shows I've ever watched. In my opinion, sitcoms have always been a cheap form of laughs that cater to the lowest common denominator with themes reused over and over again for the same gags. But this one felt genuine and original with a fun twist on common life foibles as seen through the eyes of two antisocial computer techs toiling away in the basement of a major corporation. We introduced to their world in the beginning with the arrival of Jen Barber (Katherine Parkinson) when she's hired as the manager of Reynholm Industries' IT department. A computer- illiterate woman intent on faking her way to success, she meets Roy Trenneman (Chris O'Dowd) and Maurice Moss (Richard Ayoade): the company's crack IT team. Over the course of four series (and a total of 25 episodes), the three of them will endure everything from cannibalism to viral menstruation as they attempt to break out of their sheltered world and, you know, do things grown adults are supposed to do. The show has a fun balance of humor that will appeal to the more geek-centric viewers while keeping most of it broad enough that anyone can find something hilarious. This show is everything I'm pretty sure \"The Big Bang Theory\" wanted to be.What makes \"The IT Crowd\" so much fun? The characters. I freakin' love the characters in this show. All of them. The show manages to keep the roster down to a manageable four (five, when Richmond is around) to give each plenty of screen time for us to get to know them. Roy is the IT team's more social member, and that's not saying much. He has a general hatred for the common populace (which I can get behind) and finds most people to be blithering idiots, but he's also a lech who uses his position to try and troll the upper floors of the building for his next hot (unsuccessful) date. Chris O'Dowd (who I'd only previously seen in BRIDESMAIDS) injects the character with the perfect level of charm and exasperation. The fan favorite of the show is Moss and his endless list of eccentricities. He's a more prototypical nerd: hyper-intelligent, naïve, and utterly inept when thrust into social situations. He's the sort who'll faint at the thought of a woman opening discussing her unmentionables or find a website to aid in engaging in casual conversation with sport fans. Richard Ayoade is perfect in the role. Every time Moss is on screen, you can bet the best laughs will come from him. Fun fact: Ayoade was the only cast member to be ported over to the States to star in the American version and even he couldn't save the unused pilot from becoming an inferior copycat of the original that saw a fast, merciful death before reaching air. The final member of the IT crew is Jen. She's the \"normal\" one. She's got no computer experience (outside of checking her email) and she can actually engage in personal relationships. She's a manipulative go-getter who initially hopes her management role in the IT department could lead to bigger and better things. As Jen, Katherine Parkinson is the audience's vessel into this absurd show and the best moments are when it becomes apparent that she's become ingrained in the world of geek culture. The final character (or characters, I guess, since we went through two over the course of the show) is the big boss of Reynholm Industries. The first series featured Chris Morris as Deynholm Reynholm, a hyperactive man with a few screws missing and a passion for motivating his workforce. I honestly can't find the words to describe Morris's bizarre line deliveries and the quirks he brings to the character but they're awesome. Morris was with the show until the beginning of the second series when Matt Berry stepped in to run the company as Douglas Reynholm and we got a whole new level of insane. Rather than ape what made Morris's character of Reynholm so fun, Berry's Douglas is sexist (renowned for his collection of sexual harassment suits), melodramatic, and a total buffoon. While I can understand why people seem to love the character of Moss the most, I'm honestly torn between Moss and Douglas Reynholm as my favorite character in the series.\"The IT Crowd\" is more than just it's fantastic characters. I was also impressed that its plot lines never seem to retread old sitcom ground. Each of the episodes felt more original than you're average TV comedy. Granted, most of the episodes are focused on the same thing: the IT crowd attempts to integrate/interact with normal people and it goes horribly wrong. The IT crew is invited to a dinner party at Jen's flat when her usual guests were unavailable. Roy establishes a bogus dating site profile to win a bet against Jen and prove that women only want bad boys. Moss and Roy become friends with a group of \"real men\" and bond over soccer, beer, and armed robbery. It's a common thread in the series, but it's not their only trick. Graham Linehan has got enough material that it kept the series fresh over the course of its four-series run. If I had to choose a personal favorite, I would agree with a good portion of it's fan- base and go with \"The Speech\", wherein Jen is award the title of Employee of the Month and must give a speech on technology to the company's shareholders. When Jen's ego inflates and the boys decide to have a little harmless fun with her acceptance speech, it's well it's just perfect. I can't recommend this show enough and only wish that it would've continued on longer than it did. Four series just wasn't enough."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw4743207",
      "warningSpoilers": false,
      "date": "25 March 2019",
      "rate": "10",
      "helpful": "26 out of 27 found this helpful.",
      "title": "Brilliant: clever and hilariously funny",
      "content": "Jen Barber is promoted to head the IT department of a large corporation. Problem is: she knows nothing about IT. Her staff, Roy and Moss, have no social skills. They make a perfect team.Incredibly funny. Clever and over-the-top in a Pythonesque sort of way, yet very relatable to anyone who has ever worked in large corporation and had to deal with IT. Contains some highly memorable and iconic skits, e.g. the Internet in a box, Jen the Italian translator.Great work by Katherine Parkinson, Chris O'Dowd and Richard Ayoade in the lead roles. The series is made, however, by Matt Berry as the over-the-top CEO, Douglas Reynholm. He joined in Season 2 and things immediately kicked up a gear. Not that his predecessor, Christopher Morris (playing his father), was weak in the role. On the contrary, he was very good and created the zany blueprint for Berry's character. It's just that Berry turned the amp all the way up to 11 in very impressive style.Brilliant."
    },
    {
      "username": "jdavisjdavis",
      "userUrl": "https://www.imdb.com/user/ur2404110",
      "reviewLink": "https://www.imdb.com/review/rw1300428",
      "warningSpoilers": false,
      "date": "25 February 2006",
      "rate": "10",
      "helpful": "212 out of 231 found this helpful.",
      "title": "Hilarious to me and mine",
      "content": "I think it has just the right amount of tech humor to stay true to its name, but anybody who's ever worked in an office of any kind should appreciate this show hugely. Big laughs for me every single episode... and I don't ususally laugh outloud. \"Others\" in the house made the comment of me really enjoying myself watching these crazy episodes. I've loved every episode through 5, though to be perfectly honest here and there I found myself wishing for more techie jokes, but i guess they can't chase away the non-techies just yet.Personally, Moss is my fav. The voice, the look, his whole line of thinking. Way cool and ridiculous. Happily, all the other characters are top notch too. Very very refreshing and laugh outloud show. Don't miss it!"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw4087253",
      "warningSpoilers": false,
      "date": "11 March 2018",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "A worthy successor to \"Father Ted\"",
      "content": "Graham Linehan wrote one of the very best comedies of the 1990s, \"Father Ted\". If you haven't seen it, you absolutely must. I was very fortunate to have my sister-in-law recommend \"The IT Crowd\" because it shows that Linehan is a very blessed writer...someone who has been brilliant twice or more in his career. I don't know how he did it, but \"The IT Crowd\" manages to be nearly as good as \"Father Ted\".The show is set in the basement of a building housing a mega-corporation*. It follows the adventures of two incredibly geeky computer nerds who provide support to folks who mostly couldn't care less about them. And, in the first episode they are joined by Jen...a rather dim career woman without a clue as to how computers or the internet actually work or how to fix anything! The show works well because of two big reasons. First, the dialog is brilliant...and often I could imagine Father Ted and the thickie Father Dougal having the exact same conversations. Second, the sitations the three characters get in are simply hilarious. I particularly loved the episode about the gay play as well as the episode where Jen decides to show everyone THE Internet! Overall, there's really nothing not to like about the show...watch it."
    },
    {
      "username": "TheOneThatYouWanted",
      "userUrl": "https://www.imdb.com/user/ur52600820",
      "reviewLink": "https://www.imdb.com/review/rw3647968",
      "warningSpoilers": false,
      "date": "25 February 2017",
      "rate": "10",
      "helpful": "19 out of 21 found this helpful.",
      "title": "Where is the button for the internet?",
      "content": "Bloody Brilliant! I didn't even know they added another episode and gave us an official ending to this masterpiece. There are so many things I love about this series. What trips me out is how it keeps getting progressively better with each episode. Seriously, some of the last few episodes are nearly lethal gut-busters. The final episode they tacked on after a few years isn't as funny as the rest of the series but it was nice of them to give it to us. Some of the jokes are dated but work well regardless. In about 100 years from now, this television series will be used as educational material for what mankind was like at the start of IT becoming mainstream."
    },
    {
      "username": "Chihir0",
      "userUrl": "https://www.imdb.com/user/ur16816641",
      "reviewLink": "https://www.imdb.com/review/rw3291879",
      "warningSpoilers": false,
      "date": "6 August 2015",
      "rate": "9",
      "helpful": "22 out of 23 found this helpful.",
      "title": "One of the funniest TV Show. Hilarious.",
      "content": "If you wanna laugh out loud, watch The IT Crowd. It's one of my favorite TV Shows that I've enjoyed most watching. It's about two nerd that work as IT in a large corporation. They're surrounded with dumb people, and that's what makes it funny. A new department chief comes. A girl that has no idea with computers.The cast is great, Richard Ayoade as Moss is in my top 5 characters that made me laugh most. Also other characters are funny as well. There are no jokes at all. The dialogue is funny itself, the characters are funny in the way they talk, act and the way they live.I'm not a guy who re-watch TV shows. But this case, I'm sure that I'm gonna watch again IT Crowd."
    },
    {
      "username": "jeremyemmet",
      "userUrl": "https://www.imdb.com/user/ur4454341",
      "reviewLink": "https://www.imdb.com/review/rw1290212",
      "warningSpoilers": false,
      "date": "12 February 2006",
      "rate": "9",
      "helpful": "147 out of 168 found this helpful.",
      "title": "Great Brit-com",
      "content": "The IT Crowd is an absurdist satire of office dramas, featuring those most indispensable of nerds, tech support geeks.The first thing I noticed watching this series was director Ben Fuller's patience. He has a willingness to let a joke build that evades most television directors. Some jokes are set up in the opening scene and wait until the final segment for the payoff.The show is further bolstered by great chemistry and timing between stars Richard Ayoade, Christopher Morris, Chris O'Dowd, and Katherine Parkinson. Each actor emits a brave willingness to take their characters to extremes for a laugh.It's all helped a great deal, of course, if you have a vague notion computer technology and its various sub-cultures, but for the most part, the audience is along for clever dialogue-related humour, not in-jokes."
    },
    {
      "username": "kikkapi20",
      "userUrl": "https://www.imdb.com/user/ur54023586",
      "reviewLink": "https://www.imdb.com/review/rw3071657",
      "warningSpoilers": false,
      "date": "19 August 2014",
      "rate": "10",
      "helpful": "22 out of 25 found this helpful.",
      "title": "The sweet \"geekness\", The IT Crowd",
      "content": "Each episode well written, performances by Katharine Parkinson (Jen), Chris O'Dowd (Roy), and Richard Ayoade (Moss) are all extremely well executed; makes one want to find more of what they all have to offer. It is unfortunate that British comedies only have 6 episodes per series, I suppose it's quality over quantity. If you are hesitant on watching this show please don't be and please do so now. I am really not much of a TV critique (this being my first review) but this is one show I find to be extremely well thought out and deserving of the credit it needs. f you like comedy and have not seen this, the you are really missing something great."
    },
    {
      "username": "Cinemaniac1984",
      "userUrl": "https://www.imdb.com/user/ur1444027",
      "reviewLink": "https://www.imdb.com/review/rw3175012",
      "warningSpoilers": false,
      "date": "1 February 2015",
      "rate": "10",
      "helpful": "21 out of 25 found this helpful.",
      "title": "Excellent British comedy",
      "content": "I first saw The IT Crowd after a friend recommended the show to me, and I'm glad I watched it. I was hooked onto the show right after the first episode, and each episode kept getting funnier. The IT Crowd is definitely one of the funniest comedies I have seen in a long time. I have even recommended it to friends and family and they have found themselves hooked.The IT Crowd is about three staff members from an IT Department located in the basement of Reynholm Industries which everybody from the office relies upon but frequently ignores and often looks down upon the staff as inept losers. Roy Trennerman (Chris O'Dowd) is a laid-back but very lazy Irish IT worker a love for wearing geek T-shirts that represent the latest trend in computers which reflects his personality however he goes to great lengths to avoid work so he can do nothing but play video games, read comics and play around in the office. Roy puts in very little effort in helping others in the office which is evidenced by his standard IT suggestions such as \"Have you tried turning it off and on?\" and \"Is it plugged in?\" whenever someone calls up the IT Department with a computer problem. He also proves to be luckless in love. Maurice Moss (Richard Ayoade) has a brilliant technological mind when it comes to computers yet he is very socially inept when it comes to dealing with people. Moss struggles with basic communication skills and also lives with his mother who also dresses him and packs his lunch. The attractive Jen Barber (Katherine Parkinson) was a new worker assigned to the IT Department as the boss after she claims on her CV she has experience with computers however it is shown throughout the series that she has zero technical or technology management experience. She even lacks basic computer knowledge such as not knowing what IT stands for, how to plug into a computer or telephone, infecting her laptop to make it look attractive, as well as making outlandish statements about the internet.The original director of Reynholm Industries Denholm Reynholm (Chris Morris) has very little IT knowledge but always thinks up of new and often ridiculous initiatives aiming to improve performance and morale in his company yet he frequently makes impetuous and rash decisions and pays little attention to other workers, unless they were attractive. Later in the series his long lost son Douglas Reynholm (Matt Berry) takes over Reynholm Industries. Douglas speaks very loud and dramatically, and also has uncontrollable sexual urges to other females he finds attractive which has resulted in a history of many sexual harassment accusations levelled against him. He has also seemingly inherited his father's impetuous and arrogant personality.Chris O'Dowd and Richard Ayoade made a great duo as the socially inept IT workers Roy and Moss. In particular, Moss was my favourite character out of the entire series as there was never a dull moment with Moss. Katherine Parkinson was great as Jen, the new manager of the IT Department despite her lack of knowledge of basic computer skills. Chris Morris and Matt Berry were hilarious as the father and son of Reynholm Industries.I've always has a soft spot for British comedy. It doesn't try too hard and there is no overacting required, but it's kept simple yet the humour is brilliant and clever. The IT Crowd is an excellent example of comedy kept simple and does not rely on over the top humour nor does it rely on sexual jokes or strong profanity yet it works perfectly on all levels.10/10"
    },
    {
      "username": "KOOLAIDBRO",
      "userUrl": "https://www.imdb.com/user/ur18941631",
      "reviewLink": "https://www.imdb.com/review/rw4890269",
      "warningSpoilers": false,
      "date": "26 May 2019",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Funniest show ever",
      "content": "I recommended this to a friend and decided to watch it again. Even after all these years it's still hilarious."
    },
    {
      "username": "StevinTasker",
      "userUrl": "https://www.imdb.com/user/ur4114214",
      "reviewLink": "https://www.imdb.com/review/rw1326349",
      "warningSpoilers": false,
      "date": "27 March 2006",
      "rate": "",
      "helpful": "48 out of 56 found this helpful.",
      "title": "Very Funny",
      "content": "Like Father Ted and Black Books before it this show is packed with great comedy. There are real gems in here (as well as some stuff we've seen before). Katherine Parkinson does a fine job as Jen, the voulnerable but strong IT manager (who doesn't do IT!),this is particularly satisfying as many Female characters don't fare well in comedy and can quickly fall into the 'say line to the camera, move off screen' rubbish we see so often. Chris O'Dowd is great as Roy and although he provides many of the 'stock comedy moments' this is mixed with new material and isn't detrimental to the overall piece. Richard Ayoade as Moss is another great character, to see how he peels an Orange is worth the DVD price alone. It is worth noting that this is already being traded on Ebay."
    },
    {
      "username": "scubaseven",
      "userUrl": "https://www.imdb.com/user/ur100147409",
      "reviewLink": "https://www.imdb.com/review/rw4981075",
      "warningSpoilers": false,
      "date": "6 July 2019",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "One of the 3 funniest shows ever.",
      "content": "Terrific. Tnetembaum. Moss is awesome. Loved every episode."
    },
    {
      "username": "mikeyblighe",
      "userUrl": "https://www.imdb.com/user/ur11591527",
      "reviewLink": "https://www.imdb.com/review/rw1527477",
      "warningSpoilers": false,
      "date": "22 November 2006",
      "rate": "9",
      "helpful": "71 out of 78 found this helpful.",
      "title": "Graham Linehan tackles another genre of comedy...",
      "content": "This time, he's dealing with technology. The IT Crowd, with it's old-skool computer game style opening credits, immediately catches the attention.Roy and Moss are two IT staff working for a big company. But despite the size of the company, the two seem banished to the basement of the building. However, they seem to enjoy their locked-away existence, occasionally being tortured by moronic staff asking why their computer won't work, which is usually answered with, \"Have you tried turning it off and on again?\" The characters are likable, and the script is a joy. Further proof that Mr. Linehan has a good eye for great actors and actresses, and that his writing skills have not waned with time. After all of his previous successes (including Father Ted, Black Books and material for Harry Enfield And Chums, The Fast Show, Big Train, Coogan's Run, Brass Eye and Jam) The IT Crowd is another triumph."
    },
    {
      "username": "bfscr1",
      "userUrl": "https://www.imdb.com/user/ur7298651",
      "reviewLink": "https://www.imdb.com/review/rw1283837",
      "warningSpoilers": false,
      "date": "5 February 2006",
      "rate": "",
      "helpful": "197 out of 223 found this helpful.",
      "title": "Brilliant",
      "content": "\"The IT crowd\" is an excellent comedy but requires the viewer to watch the second episode rather than base their judgement on the first episode then snub the entire series.The first episode was a decent attempt to gain the viewers approval however, it was hyped far too much, which made the viewer think that \"The IT Crowd\" was the next best comedy. When the first episode ended, everyone was disappointed due to the lack of good jokes. There were moments in the first episode that somehow reminded me of the great mind of Graham Linehan who was the writer to \"Father Ted\" and \"Black Books\" due to random jokes such as the joke in the credits.The second episode was almost redemption to the first as the cast and Graham Linehan ultimately revealed their true performance. It was almost surreal and had it's connections to \"Father Ted\" equally weirdness. There was uncontrollable laughter in a lot of areas of the second episode such as the stress class which delivered powerful comedy that would even make \"Father Ted\" mediocre.I give this comedy a round of applause and wish for an encore."
    },
    {
      "username": "osj2507",
      "userUrl": "https://www.imdb.com/user/ur58137713",
      "reviewLink": "https://www.imdb.com/review/rw3201476",
      "warningSpoilers": false,
      "date": "14 March 2015",
      "rate": "8",
      "helpful": "15 out of 18 found this helpful.",
      "title": "Hilarious British entertainment",
      "content": "This is more then nerdy, it is great and nerdy, funny and strange, weird and wonderful. It has very nerdy characters their in each their own personal way is strange and wonderful at the same time.There are so many clichés and stories about how an IT department works and operate and this just makes everyone of the seem true and perfectly right :) This specific IT department contains two nerds and a manager, they are all wonderfully strange and really has a way about them that really fits the stereotype.It is a very fun series and it has great black English humor and that is really good, sometimes they take it a bit over the top, but it is mostly the strange characters of management that doesn't really fit in."
    },
    {
      "username": "jmcgil22",
      "userUrl": "https://www.imdb.com/user/ur51224168",
      "reviewLink": "https://www.imdb.com/review/rw3101995",
      "warningSpoilers": false,
      "date": "10 October 2014",
      "rate": "10",
      "helpful": "23 out of 26 found this helpful.",
      "title": "One of the top 10 shows of all time",
      "content": "The IT Crowd is brilliant thanks to not only Graham Linehan's clever writing, (he also wrote the Irish classic Father Ted), but also because the actors have such a great chemistry. Absurd scenarios and quirky, over the top characters are the signatures of this show. Chris O'Dowd has become a Hollywood star, but Richard Ayoade, Katherine Parkinson and Matt Berry are equally talented. Having them all together in one show is really a treat. I'm so glad they came back for a final episode to give the series closure. If you are fond of British humor, or you work in IT support, you should definitely give this show a try. In my opinion, it is in the top ten, (or even the top five), shows of all time."
    },
    {
      "username": "bevo-13678",
      "userUrl": "https://www.imdb.com/user/ur76062573",
      "reviewLink": "https://www.imdb.com/review/rw5843066",
      "warningSpoilers": false,
      "date": "21 June 2020",
      "rate": "10",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Geeks",
      "content": "I like the bit when he asks if you turned it on and off"
    },
    {
      "username": "killamajig",
      "userUrl": "https://www.imdb.com/user/ur15638206",
      "reviewLink": "https://www.imdb.com/review/rw1670810",
      "warningSpoilers": false,
      "date": "9 June 2007",
      "rate": "10",
      "helpful": "107 out of 119 found this helpful.",
      "title": "absolutely hilarious!",
      "content": "My new all time favorite show. Expertly performed and brilliantly written this is the funniest show I have seen for as long as I can remember. The cast is so perfect, from the nutty Denholm (the boss man) to the eclectic pair of nerds that was the IT department. I am so lucky to have seen an episode on the net, because I would have never seen this on the BBC as I live in the US. You do not have to be a computer nerd to laugh until your sides hurt. However, having any exposure to life inside a company of any modest size will certainly make you appreciate what goes on at this company. Even the elevator, or \"lift\" as the Brits call it is a source of much laughter, as are the bathrooms and many other props. But the real genius of such great writing and comedic delivery on the part of the cast is magnificent. Please continue to make more, and pretty please produce a DVD that I can buy on Amazon."
    },
    {
      "username": "stonecoldjaw2000",
      "userUrl": "https://www.imdb.com/user/ur3773182",
      "reviewLink": "https://www.imdb.com/review/rw1373251",
      "warningSpoilers": false,
      "date": "21 May 2006",
      "rate": "10",
      "helpful": "147 out of 166 found this helpful.",
      "title": "A Brilliant Show That Is Funnier Every Time I See It!",
      "content": "I never meant to watch The IT Crowd, I stumbled upon it by accident when I was at a friends house and I decided to watch it as there was nothing else on and boy was I glad to have watched it! It was so funny, you must admire the emergency services scene! it was a total shame to have only 6 episodes in the 1 series! I hope series 2 comes out soon because this is by far the best series i have ever watched and will be my all-time favourite TV show ever! Moss is a great character and definitely suits the program well as his witty funny lines fits everywhere they are mentioned! \"If there were such a thing as a drudgeon, that is what we'd be to them.\" Class ;) The IT Crowd is A perfect 10/10 a must see."
    },
    {
      "username": "amethyst2403",
      "userUrl": "https://www.imdb.com/user/ur7156786",
      "reviewLink": "https://www.imdb.com/review/rw1655019",
      "warningSpoilers": false,
      "date": "13 May 2007",
      "rate": "10",
      "helpful": "107 out of 119 found this helpful.",
      "title": "Bloody Brilliant",
      "content": "Considering the brain dead material on TV these days, including all the \"reality TV\" garbage, The IT Crowd is probably the best show to come along in a very long time. The characters are well developed, the humour is dry and witty and the cast is amazing. There are so many nuances that you have to pay special attention or you'll miss them, which is difficult to do when you are busting your gut laughing with tears pouring down your face. You have to watch the episodes several times to get it all and each time you howl with anticipation of what you know is coming up next. Favourite parts have to be the tarty red shouza (shoes) and when Roy has to explain to Moss about \"High Tide\" - First scene of Carrie Moss. Richmond is OTT. Brilliant. Can't wait to see series 2."
    },
    {
      "username": "paxdriver",
      "userUrl": "https://www.imdb.com/user/ur59850383",
      "reviewLink": "https://www.imdb.com/review/rw3240598",
      "warningSpoilers": false,
      "date": "18 May 2015",
      "rate": "9",
      "helpful": "15 out of 17 found this helpful.",
      "title": "Smashing good fun",
      "content": "The show's got a few episodes that bring side plots together for a 'grande finale'-esque bit, which is a very difficult style to pull off, especially for 22 minute episodes. The majority of the show is that awkward humor we geeks know and love so much. This show reminds me an awful lot of the cartoon series \"Clerks\" but with a more grown up feel. There are, as with any series, a few episodes that go so far over the top you groan from pain, but the chances of a deliciously laid out bit is well worth the endurance. Given the simple premise of the show, the script stays remarkably fresh. Brilliant acting on the part of the 3 primary leads and excellent writing make this an easy show to marathon over a weekend."
    },
    {
      "username": "maddstudent2005",
      "userUrl": "https://www.imdb.com/user/ur22844450",
      "reviewLink": "https://www.imdb.com/review/rw3282227",
      "warningSpoilers": false,
      "date": "22 July 2015",
      "rate": "10",
      "helpful": "28 out of 30 found this helpful.",
      "title": "Richard Ayoade is a comedic genius!",
      "content": "this show is like the British version of seinfeld for the it lovers, extremely intelligent, well written and most importantly well acted. The actor who stands out is def Richard Ayoade, explosive performance. Although 10 stars, i think people ages 17-40 might like the show better, than older or younger crowds, because of the intelligence of comedic tones, and also the it parts. The first episode, might be hard to understand for Americans, because of the British English vs American English, but by video two, it takes you to it's world. Work place, co- workers. overall, this show hits between left and right in comedy, between two intelligent guys, and a co-worker, with barely any It knowledge who's an idiot at IT but brilliant at people, and IT guys, that are brilliant at IT but idiots with people. I love the automated phone message, to shut off and restart the computer, is a classic. Hilarious."
    },
    {
      "username": "bengreck",
      "userUrl": "https://www.imdb.com/user/ur8004901",
      "reviewLink": "https://www.imdb.com/review/rw1716646",
      "warningSpoilers": false,
      "date": "22 August 2007",
      "rate": "10",
      "helpful": "98 out of 111 found this helpful.",
      "title": "So Good",
      "content": "This series is so good. The cast is wonderful and it made me laugh and cackle in a way that I haven't too often. Really good stuff. I love the reality of all of the wires and all of the keyboards around... etc. The mess of the place/office is heartwarming - and the randomness of the \"relationship manager\" is really funny. The show has a 70's look to it - It kind of looks like my old shows growing up, like the Jeffersons - so it has this feel to it like there is some kind of art going on.Brits rock.The show is hilarious at times, and I don't just throw that word around. :-)"
    },
    {
      "username": "d-r-otten",
      "userUrl": "https://www.imdb.com/user/ur26199126",
      "reviewLink": "https://www.imdb.com/review/rw3826252",
      "warningSpoilers": false,
      "date": "8 October 2017",
      "rate": "9",
      "helpful": "11 out of 12 found this helpful.",
      "title": "A show for lovers of British humor!",
      "content": "I never was and still I'm not a big fan of American sitcoms. They mostly exist of lame jokes made by over payed actors for a conservative American audience.So that's why I like British humor. Silly, cynical, satirical, funny and the actors don't mind to make a fool of themselves. O yeah and the jokes are all very well written! The IT crowd is a show like this and it's so good that you will laugh almost all the time. Absolute a recommendation for lovers of British humor!"
    }
  ],
  "errorMessage": ""
}