{
  "imDbId": "tt0487831",
  "title": "The IT Crowd",
  "fullTitle": "The IT Crowd (TV Series 2006–2013)",
  "type": "TVSeries",
  "year": "2006",
  "language": "en",
  "titleInLanguage": "The IT Crowd",
  "url": "https://en.wikipedia.org/wiki/The_IT_Crowd",
  "plotShort": {
    "plainText": "The IT Crowd is a British sitcom originally broadcast by Channel 4, written and directed by Graham Linehan, produced by Ash Atalla and starring Chris O'Dowd, Richard Ayoade, Katherine Parkinson, and Matt Berry. Set in the offices of the fictional Reynholm Industries in London, the series revolves around the three staff members of its IT (Information Technology) department: computer programmer Maurice Moss (Ayoade), work-shy Roy Trenneman (O'Dowd), and Jen Barber (Parkinson), the department head/relationship manager who knows nothing about IT. The show also focuses on the bosses of Reynholm Industries: Denholm Reynholm (Chris Morris) and later, his son Douglas (Matt Berry). Goth IT technician Richmond Avenal (Noel Fielding), who resides in the dark server room, also appears in a number of episodes.\r\nThe comedy premiered on Channel 4 on 3 February 2006, and ran for four series of six episodes each. Although a fifth series was commissioned, it was not produced. The programme was concluded with a special \"farewell\" episode that aired on 27 September 2013. The IT Crowd was critically acclaimed and has a cult following.",
    "html": "<p>The IT Crowd is a British sitcom originally broadcast by Channel 4, written and directed by Graham Linehan, produced by Ash Atalla and starring Chris O'Dowd, Richard Ayoade, Katherine Parkinson, and Matt Berry. Set in the offices of the fictional Reynholm Industries in London, the series revolves around the three staff members of its IT (Information Technology) department: computer programmer Maurice Moss (Ayoade), work-shy Roy Trenneman (O'Dowd), and Jen Barber (Parkinson), the department head/relationship manager who knows nothing about IT. The show also focuses on the bosses of Reynholm Industries: Denholm Reynholm (Chris Morris) and later, his son Douglas (Matt Berry). Goth IT technician Richmond Avenal (Noel Fielding), who resides in the dark server room, also appears in a number of episodes.</p><p>The comedy premiered on Channel 4 on 3 February 2006, and ran for four series of six episodes each. Although a fifth series was commissioned, it was not produced. The programme was concluded with a special \"farewell\" episode that aired on 27 September 2013. The IT Crowd was critically acclaimed and has a cult following.</p>"
  },
  "plotFull": {
    "plainText": "The IT Crowd is a British sitcom originally broadcast by Channel 4, written and directed by Graham Linehan, produced by Ash Atalla and starring Chris O'Dowd, Richard Ayoade, Katherine Parkinson, and Matt Berry. Set in the offices of the fictional Reynholm Industries in London, the series revolves around the three staff members of its IT (Information Technology) department: computer programmer Maurice Moss (Ayoade), work-shy Roy Trenneman (O'Dowd), and Jen Barber (Parkinson), the department head/relationship manager who knows nothing about IT. The show also focuses on the bosses of Reynholm Industries: Denholm Reynholm (Chris Morris) and later, his son Douglas (Matt Berry). Goth IT technician Richmond Avenal (Noel Fielding), who resides in the dark server room, also appears in a number of episodes.\r\nThe comedy premiered on Channel 4 on 3 February 2006, and ran for four series of six episodes each. Although a fifth series was commissioned, it was not produced. The programme was concluded with a special \"farewell\" episode that aired on 27 September 2013. The IT Crowd was critically acclaimed and has a cult following.\r\nSeries overview\r\nThe IT Crowd is set in the offices of Reynholm Industries, a fictional British corporation at 123 Carenden Road in Central London. It focuses on the shenanigans of the three members of the IT support team, who work in a dingy, cluttered basement — a great contrast to the shining modern architecture and stunning London views enjoyed by the rest of the organisation. The obscurity surrounding the company's business is a running gag; all that is known is that it bought and sold ITV, has a chemicals laboratory, and makes an unnamed product. In one episode, Denholm Reynholm claims the company has bought mobile phone carriers and television stations, creating \"the largest communications empire in the UK\", but it is unclear whether this is true. Although 123 Carenden Road is a ficticous address, the trio visit the New Wimbledon Theatre in London, which is said to be a ten-minute walk from the office.\r\nRoy and Moss, the two technicians, are socially inept geeks or, in Denholm Reynholm's words, \"standard nerds\". Despite the company's dependence on them, they are generally ignored and considered losers. Roy's support techniques include ignoring the phone, hoping it will stop ringing, and using reel-to-reel tape recordings of stock IT suggestions such as, \"Have you tried turning it off and on again?\" and \"Is it definitely plugged in?\". He wears a different T-shirt in most episodes. Moss's deep knowledge of technical topics is reflected in his extended, overdetailed suggestions, while he cannot deal with practical problems such as extinguishing fires and removing spiders. His shyness makes it difficult for him to relate to others, often leading him to cite bizarre facts, or dwell on himself and/or technology. When someone shows their ignorance about computers, he can be arrogant. Moss overcomes his lack of confidence while wearing women's slacks (a tip given to him by Douglas Reynholm) but he cannot wear them all the time because he claims he would have a heart attack.\r\nJen, the team's newest member, is hopelessly non-technical, despite claiming on her CV that she has \"a lot of experience with computers\". As Denholm is equally technologically illiterate, Jen's interview bluffing convinces him she should be the head of the IT department. After meeting Roy and Moss, Jen redefines her role as \"Relationship Manager\"; yet her attempts to bridge the gap between the technicians and the company's other employees generally have the opposite effect, landing her and her teammates in ludicrous situations.\r\nCast and characters\r\nChris O'Dowd as Roy Trenneman, an IT technician from Ireland. He despises his job, especially since the IT department is looked down on by the rest of the company, and he often goes to great lengths to distract his workmates so he can do nothing.\r\nRichard Ayoade as Maurice Moss (typically referred simply as \"Moss\"), a painfully shy, highly intelligent IT technician with few social skills.\r\nKatherine Parkinson as Jen Barber, Roy's and Moss's tech-illiterate manager. Roy and Moss initially resent her, but soon find she is useful to them in interacting with \"socially normal\" people.\r\nNoel Fielding as Richmond Avenal (series 1–2, recurring; 4, guest), a former executive banished to the IT department's server room when he became a goth.\r\nChris Morris as Denholm Reynholm (series 1–2, recurring; series 3, guest), the egocentric founder and CEO of Reynholm Industries.\r\nMatt Berry as Douglas Reynholm (series 2, recurring; 3-special, main), Denholm's long-lost, womanising son, who returns to inherit Reynholm Industries in series 2 when his father, under investigation for embezzlement, steps out a window.\r\nProduction\r\nCreator Graham Linehan wrote the series after a PC Tech with poor people skills made a house call. The show was video-recorded before a live studio audience, which at the time was considered \"riskier\" than using a laugh track. Of this choice, Linehan said, \"I trust my instincts, so I'm going to do it my way and hope people come to me.\" The first series was recorded at Teddington Studios, and subsequent series at Pinewood Studios, with intermittent location footage. Cinematic-style footage was also recorded before live tapings. The show's title sequence was produced by Shynola.\r\nBroadcast and release\r\nInternational syndication\r\nThe programme is broadcast internationally. In Australia it has been broadcast on ABC1 and UKTV. In Bulgaria, GTV began airing it in July 2008, while Comedy Central Germany started airing the first series in September 2009. ETV has aired the programme in Estonia. In Poland it has been shown on Comedy Central Poland, TVP2, and Fox Comedy. In the Czech Republic it was broadcast on Česká televize and HBO. TV 2 Zulu has aired it in Denmark, as has Comedy Central in the Netherlands. Canal+ runs it in Spain. In New Zealand, it was aired on TV One. It airs sporadically in the Republic of Ireland on RTÉ2 and on the RTÉ Player.\r\nIn the United States, episodes have been shown on IFC; all four series and the special are also available on Netflix, Tubi TV, Pluto TV, and Hulu, and for purchase in the iTunes Store. Canadian channel G4 ran the programme during their Adult Digital Distraction block in July 2007. Reruns also aired on BiteTV in Canada until it relaunched as \"Makeful\" in August 2015. In Brazil, Argentina and Chile it has been broadcast on I.Sat. In Mexico it has aired on Canal 11 since 2010. It was also broadcast in Spain on Canal 3xl during 2011.\r\nEnding and future\r\nA fifth series was commissioned by Channel 4, for release in 2011. Series creator Graham Linehan began pre-production on it, stating it would be the programme's last series, as a \"goodbye to the characters\". The writing team were unable to meet regularly, so they created a virtual writers room using the online project-management tool Basecamp. Linehan found it a disadvantage, calling it \"a stuffy, businesslike service that I think it actually ended up making everyone self-conscious\", but there was no suitable alternative. Nonetheless, the writers did formulate some story ideas (one was reportedly a Die Hard–based episode), but ultimately Linehan did not consider the arrangement practical. Due to this, Linehan's conflicting schedule, and the show's budget requirements, the fifth series was shelved.\r\nHowever, Linehan did feel a single, special \"farewell\" episode could be produced. He was already busy with his TV adaptation of Count Arthur Strong and his work on The Walshes, and the IT Crowd actors had also taken on other commitments. Thus it was not until June 2013 that the show's final episode was filmed.\r\nLinehan has said that there are certain IT Crowd characters he would like to explore in future spin-off-style specials, particularly Matt Berry's character, Douglas. In a 2014 interview, Linehan said he had a half-formed idea about expanding on the Douglas character but that with Matt Berry busy with his series Toast of London, Linehan would need to \"pounce when he's taking a rest\". Linehan has also discussed reprising Benedict Wong's character Prime from the episode \"Final Countdown\". Wong has said he would be \"thrilled\" if Prime got his own series, joking that it could be called Prime Time.\r\nHome media\r\nThe first series was released in the UK as The IT Crowd – Version 1.0 on 13 November 2006 by 2 Entertain Video Ltd. The DVD start-up sequence and subsequent menus are designed to resemble a ZX Spectrum. The DVD also included a short film written and directed by Linehan called Hello Friend, his directorial debut, and a tongue-in-cheek behind-the-scenes documentary presented by Ken Korda, a filmmaker created and portrayed by comedian Adam Buxton (of Adam and Joe). The IT Crowd – Version 2.0 DVD was released in the UK on 1 October 2007, together with a box set containing both the first and second series. Retail chain HMV sold an exclusive limited edition version featuring a set of four postcards in the style of popular viral photos such as Ceiling Cat — here replicated as Ceiling Goth. While the first series DVD menus parodied 8-bit games, the Series 2 DVD menus parody 16-bit games and make reference to the \"All your base are belong to us\" meme popularised by Zero Wing, Mortal Kombat, Tetris and Lemmings. There are also several 'hidden' extras encoded into the subtitles. These are done in much the same way as the base64 subtitles from Series 1, and include three JPG images and a text adventure game file. Episode 4 has a BBC BASIC listing, and Episode 6 has light bars in the corner of the screen which can be decoded using a barcode reader. Series 3 was released on 16 March 2009, the DVD menus are based on such internet games as GROW CUBE, Doeo and flow. The DVD for series 4 was released in the UK on 26 September 2010, also under the 2|entertain label. A box-set containing all four series was also released on the same day, which includes an IT Crowd-themed board game. The series 4 DVD includes a documentary feature on the computer games which served as inspiration for the menus on each of the series' DVDs, culminating in the game Windosill, the basis for the series 4 DVD. The Internet Is Coming was released in Australia 18 December 2013, but had yet to be released elsewhere until it was announced in November 2015 that a Region 2 DVD version would be released in the United Kingdom and throughout Region 2 on 23 November 2015. All episodes of the programme are available to stream in the United Kingdom and the Republic of Ireland on All 4, with the exception of the series three episode \"The Speech\" which has been removed for transphobic themes.\r\nReception\r\nSeries 1 of The IT Crowd holds an average Metacritic critic score of 67/100 from 8 reviews.\r\nRatings\r\nThe premiere of the programme on Channel 4 was watched by 1.8m viewers, described as \"disappointing\" by BBC News; however, Linehan stated he was \"playing the long game\" and reflected how the first series of Father Ted also \"went pretty unnoticed\" but went on to gain viewers and awards. The series 4 finale on 30 July 2010 saw the programme reach its current ratings peak of 2.17 million and was highly successful in its time slot.\r\nAwards and nominations\r\nThe IT Crowd has won awards from the British Academy of Film and Television Arts (BAFTAs), the International Academy of Television Arts and Sciences (the International Emmys), the Rose d'Or television entertainment awards, and from the fan-voted Comedy.co.uk Awards organized by the British Comedy Guide. It also received a British Comedy Awards and an Irish Film and Television Award.\r\nIn 2006, the series was voted Best New British Sitcom at the 2006 Comedy.co.uk Awards, out of 17 nominees. In 2007, it was voted Comedy of The Year at the 2007 Comedy.co.uk Awards, out of 100 nominees. Nominated in the 2007 BAFTAs for Best Situation Comedy, alongside Green Wing and Pulling, it lost to The Royle Family. In 2008, the series won the International Emmy Award for Comedy and the 2008 Rose d'Or for Best Sitcom. Nominated in the 2008 BAFTAs for Best Situation Comedy alongside The Thick of It and Benidorm, it lost to Peep Show. In 2009, it won Best Situation Comedy at the 2009 BAFTAs. Also in 2009, Graham Linehan won Best Television Script at the 6th Irish Film and Television Awards, and Katherine Parkinson won Best Comedy Actress at the 2009 British Comedy Awards.\r\nAt the 2014 British Academy Television Awards, Parkinson won Best Female Comedy Performance; Richard Ayoade won Best Male Comedy Performance; and Chris O'Dowd was nominated in the same category.\r\nAdaptations\r\nAmerican versions\r\nAn American version of The IT Crowd was almost aired by NBC in 2007–08, starring Richard Ayoade reprising his role as Moss, with Joel McHale as Roy, Jessica St. Clair as Jen, and Rocky Carroll as Denholm. It was produced by FremantleMedia for Universal Media Studios with Steve Tao as executive producer. Linehan was also credited as executive producer, but stated he had no actual involvement. The writing staff was David Guarascio, Moses Port, Joe Port, and Joe Wiseman. A pilot was filmed in January 2007, and a full series was ordered and advertised by NBC to be aired in 2007–08.\r\nHowever, a September 2007 report in The Hollywood Reporter said that the show would not reach production, despite the development of a number of scripts, as it \"didn't quite spark\" with new NBC chairman Ben Silverman. In 2012, the pilot was leaked online.\r\nIn October 2014, it was announced that NBC would produce another pilot, produced by Bill Lawrence. It, too, did not make it to air.\r\nA third attempt at an NBC remake was confirmed in January 2018. Unlike the two previous versions, Graham Linehan was to be involved as a writer and executive producer. However, no further developments have been announced.\r\nGerman version\r\nA German version of the programme was in production starting June 2007, starring Sky du Mont, Sebastian Münster, Stefan Puntigam and Britta Horn. Originally titled Das iTeam – Die Jungs mit der Maus (The iTeam – The Boys with the Mouse), the title was changed to Das iTeam – Die Jungs an der Maus (The iTeam – The Boys at the Mouse) last minute. The first episode was aired on 4 January 2008 on Sat.1 and received mainly negative receptions. It was criticised for the poor translation of the original stories and jokes, poor direction, poor timing, and the poor performance of the actors, mainly Stefan Puntigam as Gabriel (the German version of Moss). Manuel Weis of Quotenmeter.de heavily panned the programme, commenting: \"It could indeed be possible that the boys of class 10a from secondary school Brunsbüttel made the series. In short: In this form 'The iTeam' should never have come onto the screen. The look is strongly reminiscent of cheap crime documentaries airing in the afternoon and the actors are reminiscent of lousy daytime formats. The climax of these catastrophes is Stefan Puntigam, who embodies the role of the computer geek Gabriel. his role seems artificial, exaggerated and in any case badly acted.\" The IT Crowd creator Graham Linehan noted in his blog that the first gag already does not work due to being wrongly executed. The programme was cancelled after only two episodes due to low ratings. All episodes were later screened on Sat.1 Comedy.",
    "html": "<p>The IT Crowd is a British sitcom originally broadcast by Channel 4, written and directed by Graham Linehan, produced by Ash Atalla and starring Chris O'Dowd, Richard Ayoade, Katherine Parkinson, and Matt Berry. Set in the offices of the fictional Reynholm Industries in London, the series revolves around the three staff members of its IT (Information Technology) department: computer programmer Maurice Moss (Ayoade), work-shy Roy Trenneman (O'Dowd), and Jen Barber (Parkinson), the department head/relationship manager who knows nothing about IT. The show also focuses on the bosses of Reynholm Industries: Denholm Reynholm (Chris Morris) and later, his son Douglas (Matt Berry). Goth IT technician Richmond Avenal (Noel Fielding), who resides in the dark server room, also appears in a number of episodes.</p><p>The comedy premiered on Channel 4 on 3 February 2006, and ran for four series of six episodes each. Although a fifth series was commissioned, it was not produced. The programme was concluded with a special \"farewell\" episode that aired on 27 September 2013. The IT Crowd was critically acclaimed and has a cult following.</p><br/><h3>Series overview</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Series</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">3 February 2006</td><td style=\"padding:0 8px\">3 March 2006</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">24 August 2007</td><td style=\"padding:0 8px\">28 September 2007</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">21 November 2008</td><td style=\"padding:0 8px\">26 December 2008</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">25 June 2010</td><td style=\"padding:0 8px\">30 July 2010</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"3\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Special</span></span></span></span></th><td colspan=\"2\" style=\"padding:0.2em 0.4em\">26 September 2013</td></tr></tbody></table><p>The IT Crowd is set in the offices of Reynholm Industries, a fictional British corporation at 123 Carenden Road in Central London. It focuses on the shenanigans of the three members of the IT support team, who work in a dingy, cluttered basement — a great contrast to the shining modern architecture and stunning London views enjoyed by the rest of the organisation. The obscurity surrounding the company's business is a running gag; all that is known is that it bought and sold ITV, has a chemicals laboratory, and makes an unnamed product. In one episode, Denholm Reynholm claims the company has bought mobile phone carriers and television stations, creating \"the largest communications empire in the UK\", but it is unclear whether this is true. Although 123 Carenden Road is a ficticous address, the trio visit the New Wimbledon Theatre in London, which is said to be a ten-minute walk from the office.</p><p>Roy and Moss, the two technicians, are socially inept geeks or, in Denholm Reynholm's words, \"standard nerds\". Despite the company's dependence on them, they are generally ignored and considered losers. Roy's support techniques include ignoring the phone, hoping it will stop ringing, and using reel-to-reel tape recordings of stock IT suggestions such as, \"Have you tried turning it off and on again?\" and \"Is it definitely plugged in?\". He wears a different T-shirt in most episodes. Moss's deep knowledge of technical topics is reflected in his extended, overdetailed suggestions, while he cannot deal with practical problems such as extinguishing fires and removing spiders. His shyness makes it difficult for him to relate to others, often leading him to cite bizarre facts, or dwell on himself and/or technology. When someone shows their ignorance about computers, he can be arrogant. Moss overcomes his lack of confidence while wearing women's slacks (a tip given to him by Douglas Reynholm) but he cannot wear them all the time because he claims he would have a heart attack.</p><p>Jen, the team's newest member, is hopelessly non-technical, despite claiming on her CV that she has \"a lot of experience with computers\". As Denholm is equally technologically illiterate, Jen's interview bluffing convinces him she should be the head of the IT department. After meeting Roy and Moss, Jen redefines her role as \"Relationship Manager\"; yet her attempts to bridge the gap between the technicians and the company's other employees generally have the opposite effect, landing her and her teammates in ludicrous situations.</p><br/><h3>Cast and characters</h3><ul><li>Chris O'Dowd as Roy Trenneman, an IT technician from Ireland. He despises his job, especially since the IT department is looked down on by the rest of the company, and he often goes to great lengths to distract his workmates so he can do nothing.</li><li>Richard Ayoade as Maurice Moss (typically referred simply as \"Moss\"), a painfully shy, highly intelligent IT technician with few social skills.</li><li>Katherine Parkinson as Jen Barber, Roy's and Moss's tech-illiterate manager. Roy and Moss initially resent her, but soon find she is useful to them in interacting with \"socially normal\" people.</li><li>Noel Fielding as Richmond Avenal (series 1–2, recurring; 4, guest), a former executive banished to the IT department's server room when he became a goth.</li><li>Chris Morris as Denholm Reynholm (series 1–2, recurring; series 3, guest), the egocentric founder and CEO of Reynholm Industries.</li><li>Matt Berry as Douglas Reynholm (series 2, recurring; 3-special, main), Denholm's long-lost, womanising son, who returns to inherit Reynholm Industries in series 2 when his father, under investigation for embezzlement, steps out a window.</li></ul><br/><h3>Production</h3><p>Creator Graham Linehan wrote the series after a PC Tech with poor people skills made a house call. The show was video-recorded before a live studio audience, which at the time was considered \"riskier\" than using a laugh track. Of this choice, Linehan said, \"I trust my instincts, so I'm going to do it my way and hope people come to me.\" The first series was recorded at Teddington Studios, and subsequent series at Pinewood Studios, with intermittent location footage. Cinematic-style footage was also recorded before live tapings. The show's title sequence was produced by Shynola.</p><br/><h3>Broadcast and release</h3><h4>International syndication</h4><p>The programme is broadcast internationally. In Australia it has been broadcast on ABC1 and UKTV. In Bulgaria, GTV began airing it in July 2008, while Comedy Central Germany started airing the first series in September 2009. ETV has aired the programme in Estonia. In Poland it has been shown on Comedy Central Poland, TVP2, and Fox Comedy. In the Czech Republic it was broadcast on Česká televize and HBO. TV 2 Zulu has aired it in Denmark, as has Comedy Central in the Netherlands. Canal+ runs it in Spain. In New Zealand, it was aired on TV One. It airs sporadically in the Republic of Ireland on RTÉ2 and on the RTÉ Player.</p><p>In the United States, episodes have been shown on IFC; all four series and the special are also available on Netflix, Tubi TV, Pluto TV, and Hulu, and for purchase in the iTunes Store. Canadian channel G4 ran the programme during their Adult Digital Distraction block in July 2007. Reruns also aired on BiteTV in Canada until it relaunched as \"Makeful\" in August 2015. In Brazil, Argentina and Chile it has been broadcast on I.Sat. In Mexico it has aired on Canal 11 since 2010. It was also broadcast in Spain on Canal 3xl during 2011.</p><h4>Ending and future</h4><p>A fifth series was commissioned by Channel 4, for release in 2011. Series creator Graham Linehan began pre-production on it, stating it would be the programme's last series, as a \"goodbye to the characters\". The writing team were unable to meet regularly, so they created a virtual writers room using the online project-management tool Basecamp. Linehan found it a disadvantage, calling it \"a stuffy, businesslike service that I think it actually ended up making everyone self-conscious\", but there was no suitable alternative. Nonetheless, the writers did formulate some story ideas (one was reportedly a Die Hard–based episode), but ultimately Linehan did not consider the arrangement practical. Due to this, Linehan's conflicting schedule, and the show's budget requirements, the fifth series was shelved.</p><p>However, Linehan did feel a single, special \"farewell\" episode could be produced. He was already busy with his TV adaptation of Count Arthur Strong and his work on The Walshes, and the IT Crowd actors had also taken on other commitments. Thus it was not until June 2013 that the show's final episode was filmed.</p><p>Linehan has said that there are certain IT Crowd characters he would like to explore in future spin-off-style specials, particularly Matt Berry's character, Douglas. In a 2014 interview, Linehan said he had a half-formed idea about expanding on the Douglas character but that with Matt Berry busy with his series Toast of London, Linehan would need to \"pounce when he's taking a rest\". Linehan has also discussed reprising Benedict Wong's character Prime from the episode \"Final Countdown\". Wong has said he would be \"thrilled\" if Prime got his own series, joking that it could be called Prime Time.</p><h4>Home media</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\" style=\"padding:0 8px;\" colspan=\"2\" rowspan=\"2\">Series</th><th scope=\"col\" style=\"padding:0 8px;\" rowspan=\"2\">Episodes</th><th scope=\"col\" colspan=\"4\">DVD release date</th></tr><tr><th scope=\"col\"><span>Region 1</span></th><th scope=\"col\"><span>Region 2</span></th><th scope=\"col\"><span>Region 4</span></th></tr><tr><td scope=\"row\" style=\"background-color: #E9D66B;\"></td><td><span>1</span></td><td>6</td><td>31 March 2009</td><td>13 October 2006</td><td style=\"padding: 0px 8px\">6 December 2006</td></tr><tr><td scope=\"row\" style=\"background-color: #ee8118;\"></td><td><span>2</span></td><td>6</td><td>30 June 2009</td><td>1 October 2007</td><td>19 March 2009</td></tr><tr><td scope=\"row\" style=\"background-color: #833F7F;\"></td><td><span>3</span></td><td>6</td><td style=\"padding: 0px 8px\">15 September 2009</td><td>16 March 2009</td><td>1 April 2010</td></tr><tr><td scope=\"row\" style=\"background-color: #39AC35;\"></td><td><span>4</span></td><td>6</td><td>14 December 2010</td><td style=\"padding: 0px 8px\">27 September 2010</td><td>2 December 2010</td></tr><tr><td scope=\"row\" style=\"background-color: #39AC35;\"></td><td><span>Special (2013)</span></td><td>1</td><td>17 January 2017</td><td>23 November 2015</td><td>18 December 2013</td></tr></tbody></table><p>The first series was released in the UK as The IT Crowd – Version 1.0 on 13 November 2006 by 2 Entertain Video Ltd. The DVD start-up sequence and subsequent menus are designed to resemble a ZX Spectrum. The DVD also included a short film written and directed by Linehan called Hello Friend, his directorial debut, and a tongue-in-cheek behind-the-scenes documentary presented by Ken Korda, a filmmaker created and portrayed by comedian Adam Buxton (of Adam and Joe). The IT Crowd – Version 2.0 DVD was released in the UK on 1 October 2007, together with a box set containing both the first and second series. Retail chain HMV sold an exclusive limited edition version featuring a set of four postcards in the style of popular viral photos such as Ceiling Cat — here replicated as Ceiling Goth. While the first series DVD menus parodied 8-bit games, the Series 2 DVD menus parody 16-bit games and make reference to the \"All your base are belong to us\" meme popularised by Zero Wing, Mortal Kombat, Tetris and Lemmings. There are also several 'hidden' extras encoded into the subtitles. These are done in much the same way as the base64 subtitles from Series 1, and include three JPG images and a text adventure game file. Episode 4 has a BBC BASIC listing, and Episode 6 has light bars in the corner of the screen which can be decoded using a barcode reader. Series 3 was released on 16 March 2009, the DVD menus are based on such internet games as GROW CUBE, Doeo and flow. The DVD for series 4 was released in the UK on 26 September 2010, also under the 2|entertain label. A box-set containing all four series was also released on the same day, which includes an IT Crowd-themed board game. The series 4 DVD includes a documentary feature on the computer games which served as inspiration for the menus on each of the series' DVDs, culminating in the game Windosill, the basis for the series 4 DVD. The Internet Is Coming was released in Australia 18 December 2013, but had yet to be released elsewhere until it was announced in November 2015 that a Region 2 DVD version would be released in the United Kingdom and throughout Region 2 on 23 November 2015. All episodes of the programme are available to stream in the United Kingdom and the Republic of Ireland on All 4, with the exception of the series three episode \"The Speech\" which has been removed for transphobic themes.</p><br/><h3>Reception</h3><p>Series 1 of The IT Crowd holds an average Metacritic critic score of 67/100 from 8 reviews.</p><h4>Ratings</h4><p>The premiere of the programme on Channel 4 was watched by 1.8m viewers, described as \"disappointing\" by BBC News; however, Linehan stated he was \"playing the long game\" and reflected how the first series of Father Ted also \"went pretty unnoticed\" but went on to gain viewers and awards. The series 4 finale on 30 July 2010 saw the programme reach its current ratings peak of 2.17 million and was highly successful in its time slot.</p><h4>Awards and nominations</h4><p>The IT Crowd has won awards from the British Academy of Film and Television Arts (BAFTAs), the International Academy of Television Arts and Sciences (the International Emmys), the Rose d'Or television entertainment awards, and from the fan-voted Comedy.co.uk Awards organized by the British Comedy Guide. It also received a British Comedy Awards and an Irish Film and Television Award.</p><p>In 2006, the series was voted Best New British Sitcom at the 2006 Comedy.co.uk Awards, out of 17 nominees. In 2007, it was voted Comedy of The Year at the 2007 Comedy.co.uk Awards, out of 100 nominees. Nominated in the 2007 BAFTAs for Best Situation Comedy, alongside Green Wing and Pulling, it lost to The Royle Family. In 2008, the series won the International Emmy Award for Comedy and the 2008 Rose d'Or for Best Sitcom. Nominated in the 2008 BAFTAs for Best Situation Comedy alongside The Thick of It and Benidorm, it lost to Peep Show. In 2009, it won Best Situation Comedy at the 2009 BAFTAs. Also in 2009, Graham Linehan won Best Television Script at the 6th Irish Film and Television Awards, and Katherine Parkinson won Best Comedy Actress at the 2009 British Comedy Awards.</p><p>At the 2014 British Academy Television Awards, Parkinson won Best Female Comedy Performance; Richard Ayoade won Best Male Comedy Performance; and Chris O'Dowd was nominated in the same category.</p><br/><h3>Adaptations</h3><h4>American versions</h4><p>An American version of The IT Crowd was almost aired by NBC in 2007–08, starring Richard Ayoade reprising his role as Moss, with Joel McHale as Roy, Jessica St. Clair as Jen, and Rocky Carroll as Denholm. It was produced by FremantleMedia for Universal Media Studios with Steve Tao as executive producer. Linehan was also credited as executive producer, but stated he had no actual involvement. The writing staff was David Guarascio, Moses Port, Joe Port, and Joe Wiseman. A pilot was filmed in January 2007, and a full series was ordered and advertised by NBC to be aired in 2007–08.</p><p>However, a September 2007 report in The Hollywood Reporter said that the show would not reach production, despite the development of a number of scripts, as it \"didn't quite spark\" with new NBC chairman Ben Silverman. In 2012, the pilot was leaked online.</p><p>In October 2014, it was announced that NBC would produce another pilot, produced by Bill Lawrence. It, too, did not make it to air.</p><p>A third attempt at an NBC remake was confirmed in January 2018. Unlike the two previous versions, Graham Linehan was to be involved as a writer and executive producer. However, no further developments have been announced.</p><h4>German version</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>needs additional citations for <span>verification</span></b>.<span class=\"hide-when-compact\"> Please help <span class=\"external text\">improve this article</span> by <span>adding citations to reliable sources</span> in this section. Unsourced material may be challenged and removed.</span>  <span class=\"date-container\"><i>(<span class=\"date\">March 2022</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><p>A German version of the programme was in production starting June 2007, starring Sky du Mont, Sebastian Münster, Stefan Puntigam and Britta Horn. Originally titled Das iTeam – Die Jungs mit der Maus (The iTeam – The Boys with the Mouse), the title was changed to Das iTeam – Die Jungs an der Maus (The iTeam – The Boys at the Mouse) last minute. The first episode was aired on 4 January 2008 on Sat.1 and received mainly negative receptions. It was criticised for the poor translation of the original stories and jokes, poor direction, poor timing, and the poor performance of the actors, mainly Stefan Puntigam as Gabriel (the German version of Moss). Manuel Weis of Quotenmeter.de heavily panned the programme, commenting: \"It could indeed be possible that the boys of class 10a from secondary school Brunsbüttel made the series. In short: In this form 'The iTeam' should never have come onto the screen. The look is strongly reminiscent of cheap crime documentaries airing in the afternoon and the actors are reminiscent of lousy daytime formats. The climax of these catastrophes is Stefan Puntigam, who embodies the role of the computer geek Gabriel. his role seems artificial, exaggerated and in any case badly acted.\" The IT Crowd creator Graham Linehan noted in his blog that the first gag already does not work due to being wrongly executed. The programme was cancelled after only two episodes due to low ratings. All episodes were later screened on Sat.1 Comedy.</p><br/>"
  },
  "errorMessage": ""
}