{
  "imDbId": "tt10802170",
  "title": "The Rehearsal",
  "fullTitle": "The Rehearsal (TV Series 2022– )",
  "type": "TVSeries",
  "year": "2022",
  "items": [
    {
      "username": "chrsstout",
      "userUrl": "https://www.imdb.com/user/ur104328610",
      "reviewLink": "https://www.imdb.com/review/rw8414639",
      "warningSpoilers": false,
      "date": "8 August 2022",
      "rate": "9",
      "helpful": "81 out of 90 found this helpful.",
      "title": "Nathan Fielder's best",
      "content": "It's self-help reality show satire. Idk how else to put it. If you don't get it, then sorry. His situational comedy hits a little too close to home for some. But for those who have the humility to appreciate the awkwardness of the human condition, then you appreciate just how absurd this show gets. It's comedic inception, I started the show chuckling, and by episode 4 I was in tears. Layers upon layers of absurdity. This show has the perfect guy (and apparently the budget) to do it.A lot of reality shows do the same thing Nathan does in this show. But they polish it up to make it seem like interactions are flawless, use actors to stage nearly everything, and all works out perfectly in the end. This show just exploits that aspect of those reality tv shows. His mindset is (believe it or not) not too far from a regular reality television producer. Nathan just has a little more of a nihilistic approach. I love it."
    },
    {
      "username": "winecellarwomack",
      "userUrl": "https://www.imdb.com/user/ur37498427",
      "reviewLink": "https://www.imdb.com/review/rw8343452",
      "warningSpoilers": false,
      "date": "17 July 2022",
      "rate": "8",
      "helpful": "147 out of 171 found this helpful.",
      "title": "Days like these I curse the Chinese for inventing gunpowder",
      "content": "Fantastic show. So unique and creative! Nothing like this out there! Must watch. I can't even begin to fathom the mind that came up with the idea for this series, but I would certainly love to pick his brain."
    },
    {
      "username": "brettpod",
      "userUrl": "https://www.imdb.com/user/ur20119017",
      "reviewLink": "https://www.imdb.com/review/rw8340394",
      "warningSpoilers": false,
      "date": "16 July 2022",
      "rate": "8",
      "helpful": "122 out of 143 found this helpful.",
      "title": "Nothing like this on TV",
      "content": "I usually wait until the entire season is over before giving a rating. With that said, this show is so funny I couldn't wait. The Rehearsal continues the Nathan Fielder brand of elaborate schemes, awkward interactions, and overall funny situations that he built with Nathan For You. If you loved Nathan for you, you will love The Rehearsal ."
    },
    {
      "username": "thefendiprint",
      "userUrl": "https://www.imdb.com/user/ur26127729",
      "reviewLink": "https://www.imdb.com/review/rw8341062",
      "warningSpoilers": false,
      "date": "16 July 2022",
      "rate": "10",
      "helpful": "90 out of 115 found this helpful.",
      "title": "Another multifaceted comedic masterpiece from Nathan Fielder",
      "content": "If you love Nathan for You, then you'll love this. It's nearly the same in terms of vibe and layout, just with a new way to \"help\" strangers. He's once again proven he's a force to be reckoned with in comedy. Ignore the low ratings... If you get it, you get it. And those people clearly don't."
    },
    {
      "username": "ryanpersaud-59415",
      "userUrl": "https://www.imdb.com/user/ur65683941",
      "reviewLink": "https://www.imdb.com/review/rw8543275",
      "warningSpoilers": false,
      "date": "14 September 2022",
      "rate": "9",
      "helpful": "20 out of 23 found this helpful.",
      "title": "\"Next thing you know, I'll bring home some oranges and that will be Satanic!\"",
      "content": "I've long been a fan of Nathan Fielder (from both Nathan For You and from How To With John Wilson), so one night, I popped The Rehearsal on and could not believe what I was seeing.So, I stopped watching and decided to watch it with some friends and family. And, predictably, they fell in love with the show. You may not love the Rehearsal (at first), you may find it quirky and odd, but you will be unable to look away. This is easily one of the most unique and innovative shows I have ever seen. Fielder is an absolute master and just when you think you know where the season is going, it takes so many different turns.By the end, The Rehearsal goes from a fun social experiment to a profound, contemplative, and deeply human experience. It's a show that questions identity, relationships, our attempts at controlling the world...yeah, just watch it. It's amazing."
    },
    {
      "username": "crbrown25",
      "userUrl": "https://www.imdb.com/user/ur24076408",
      "reviewLink": "https://www.imdb.com/review/rw8400648",
      "warningSpoilers": false,
      "date": "5 August 2022",
      "rate": "10",
      "helpful": "61 out of 72 found this helpful.",
      "title": "So stupid, and yet, it's one of the best things I have ever seen",
      "content": "Everything about this show is amazing. It's an absolute masterpiece.The show is about giving people the ability to rehearse an important event in their life. They go through incredible lengths to make sure everything is perfectly accurate. That part is impressive, but it's not really the best part of the show.Somehow, the makers have an incredible ability to highlight the subtle things that make life complicated, fascinating, weird, and most importantly, human.The Rehearsal is an emotional rollercoaster that everyone should experience."
    },
    {
      "username": "Safetylight",
      "userUrl": "https://www.imdb.com/user/ur19928028",
      "reviewLink": "https://www.imdb.com/review/rw8341752",
      "warningSpoilers": false,
      "date": "16 July 2022",
      "rate": "8",
      "helpful": "84 out of 112 found this helpful.",
      "title": "Horrifying. But very good. This is stealth therapy disguised as something else.",
      "content": "This show has value as a cautionary tale. Nobody should live like this!This is exactly the wrong way of engaging with life; trying to control and micro-manage every possibility is based on fear and a lack of developed connection with one's instinct. People have instincts, and they can tell that something isn't real.I knew a guy who approached women in this way, hyper-studying the object of his obsession and planning flow charts of possible actions and reactions. It sort of worked for a while, but fairly soon, she reacted like a trapped animal. It was insanely frustrating for me to hear about this. \"No, no, no! Don't DO that. That's NOT how you interact with people. (What the hell is wrong with you??)\"You have a soul. Souls are like surfboards. Trying to freeze everything to get it right is like trying to reduce yourself to a reaction machine. It's like trying to cheat god. It cannot last.HOWEVER...The point of this show is not to attempt success through the method of hyper-control.The point is to demonstrate the futility of trying to control god, and through the exercise, stealth-grow the subject's confidence in dealing with random events."
    },
    {
      "username": "krupocin-1",
      "userUrl": "https://www.imdb.com/user/ur20829289",
      "reviewLink": "https://www.imdb.com/review/rw8388301",
      "warningSpoilers": false,
      "date": "31 July 2022",
      "rate": "10",
      "helpful": "100 out of 142 found this helpful.",
      "title": "What's just as fascinating as the show is...",
      "content": "Reading some of these reviews. It's really interesting to read some of the dissenting 1s or 2s on a show with a 9/10 average, it's funny how some people can just completely miss the concept. \"This isn't a comedy!\" as if there's only one way to do this. Everyone doesn't have to like the same things but there's no world in which this is a 1/10, just even considering the execution, originality, ambition, etc. Then again we live in a world where every moron has a voice now and 90% of new movies are people prancing around in costumes pretending to have magic powers so maybe I shouldn't be surprised. One of the low reviews hates the second half of Better Call Saul's final season, another loved The Gray Man but hated Sicario, another I assume is basically a real life version of The Simpsons Comic Book Man...so it's not like we are dealing with anyone you'd likely trust for recommendations but I still think it's really interesting, since I always wonder how some of the completely cheesey new shows on HBO Max or Netflix get picked up for second seasons and I forget how many mouth breathers are out there. At least the small audience who has watched this so far has loved it, and hopefully we get many more seasons. Along with Saul, Succession, Barry, a couple others, it's one of the few bright spots on TV at the moment."
    },
    {
      "username": "CulvertonSmith",
      "userUrl": "https://www.imdb.com/user/ur60965876",
      "reviewLink": "https://www.imdb.com/review/rw8470625",
      "warningSpoilers": false,
      "date": "20 August 2022",
      "rate": "10",
      "helpful": "23 out of 30 found this helpful.",
      "title": "Unique, Hilarious, and Thought-Provoking",
      "content": "Nathan Fielder's new series The Rehearsal is easily one of the best seasons of television I've seen all year. As a big fan of Nathan For You, I couldn't wait to check out his new project. I was delighted to find that I loved it even more. As hard as this show is to describe, I'm going to try my best.Nathan Fielder's awkward comedy finds a new home when he tries his hand at providing people with an opportunity, an opportunity to rehearse important moments in their life. In the first episode a man must rehearse a confession that he will give to his friend, with a re-created studio set of a real location and a paid actor who portrays his friend.Sounds insane? It absolutely is, but in the most bizarre, entertaining, hilarious, and unpredictable way possible. What starts as a ridiculous premise that I found particularly hilarious, ultimately winds up becoming a reflection on its own structure that questions the ethics of the rehearsals themselves. The show gives room to laugh, become invested, and constantly pulls the rug out from its own audience in the most shocking and delightful ways possible.You are almost always aware of what you are watching, because the show doesn't let you forget what it is. I absolutely mean this in a good way, because that is how the show manages to be something so unique, by staying hilarious while reflecting on what its doing.It's impossible to fully sell the experience of The Rehearsal because at the end of the day, you have to experience it for yourself. I loved the first season of this show, and I highly recommend it if you want to watch a unique and extremely funny series unlike anything seen before. I can safely call this one of my new favorite series on television, and I can't wait to see what is explored in Season Two.Season One: 9.3/10."
    },
    {
      "username": "karimnomatch",
      "userUrl": "https://www.imdb.com/user/ur47826159",
      "reviewLink": "https://www.imdb.com/review/rw8408586",
      "warningSpoilers": false,
      "date": "6 August 2022",
      "rate": "9",
      "helpful": "23 out of 28 found this helpful.",
      "title": "No words to describe it!!",
      "content": "This is the most creative, unique, and original show I have watched in many years.. Maybe ever! I loved Nathan For You (NFY) and I knew this show would be good as well. However, while NFY is a comedy show in essence, The Rehearsal is mostly a social experience that is so special and authentic.I will not spoil anything, but I will comment on one scene in Episode 4. When Adam is taken by the ambulance after overdosing, the paramedics are listing his current symptoms, vital signs, and possible drugs he is on, and being a physician I was impressed by the accuracy and amount of work that went into a 5-second scene. This is a simple example of the attention to details and the amount of effort put into this amazing show."
    },
    {
      "username": "ivannushu",
      "userUrl": "https://www.imdb.com/user/ur147764840",
      "reviewLink": "https://www.imdb.com/review/rw8340328",
      "warningSpoilers": false,
      "date": "16 July 2022",
      "rate": "9",
      "helpful": "72 out of 91 found this helpful.",
      "title": "Synecdoche New York",
      "content": "This is where movie becomes reality, and vice versa. After helping with people's careers on Nathan For You, the wizard of loneliness returns to help with people's relationships."
    },
    {
      "username": "ant-medi",
      "userUrl": "https://www.imdb.com/user/ur41435034",
      "reviewLink": "https://www.imdb.com/review/rw8471475",
      "warningSpoilers": false,
      "date": "21 August 2022",
      "rate": "",
      "helpful": "19 out of 23 found this helpful.",
      "title": "Kaufman-esque",
      "content": "I know I'm probably the millionth person to say this but this is the most Charlie Kaufman-esque show I have ever seen in my life. The show is really introspective. Reminded so much of Synechdoche, New York, Adaptation, Being John Malkovich and even other films like Eternal Sunshine and I'm Thinking of Ending things. Especially when it came to the idea of a character viewing themselves through the eyes of another person or trying to view experience in that way. It's something that Charlie Kaufman loves exploring and I loved seeing Nathan Fielder's take on it."
    },
    {
      "username": "joshualholmberg",
      "userUrl": "https://www.imdb.com/user/ur125917066",
      "reviewLink": "https://www.imdb.com/review/rw8468881",
      "warningSpoilers": true,
      "date": "20 August 2022",
      "rate": "10",
      "helpful": "12 out of 16 found this helpful.",
      "title": "After the finale, easy 10",
      "content": "In the end, I was so confused on what this show was and what it was trying to accomplish, as it strayed far from the simple (yet still amazingly complex) first episode. And yet even through the confusion came lots of emotion in what must be the most original tv series ever."
    },
    {
      "username": "vgvczvk",
      "userUrl": "https://www.imdb.com/user/ur138170504",
      "reviewLink": "https://www.imdb.com/review/rw8338907",
      "warningSpoilers": false,
      "date": "16 July 2022",
      "rate": "10",
      "helpful": "76 out of 101 found this helpful.",
      "title": "Comedy Magic",
      "content": "Wow. The work Nathan and the crew put into this is insane. Another comedy masterpiece from Nathan Fielder. I won't go too deep into what happened because I don't want to ruin the magic of just how well they did this."
    },
    {
      "username": "Stranger_Sins",
      "userUrl": "https://www.imdb.com/user/ur133955008",
      "reviewLink": "https://www.imdb.com/review/rw8411601",
      "warningSpoilers": false,
      "date": "7 August 2022",
      "rate": "10",
      "helpful": "15 out of 22 found this helpful.",
      "title": "Masterpiece. Period.",
      "content": "Nathan Fielder being Nathan Fielder again. After following his work since 2011-ish it's fascinating to see how he has evolved. Especially episode 4 is very intriguing.This is human psychology at its best.Think \"Truman show\", but real, to get an idea of what this is."
    },
    {
      "username": "tylerjyounger",
      "userUrl": "https://www.imdb.com/user/ur104252954",
      "reviewLink": "https://www.imdb.com/review/rw8346264",
      "warningSpoilers": false,
      "date": "18 July 2022",
      "rate": "10",
      "helpful": "24 out of 36 found this helpful.",
      "title": "The Genius of Nathan Fielder",
      "content": "Once Nathan For You came to an end, I remember thinking, \"when will we ever get something so funny, yet moving like this again?\" - Well, it turns out it was years later from the same guy.The genius of Nathan Fielder is not only his incredibly dry humor and even dryer delivery - but the fact that there's a true goodness that lies beneath the comedy. He wants things to work out for the people involved and he never intends to shine them in a bad light.The way he concluded the first episode gave me chills and I can't wait for more of those moments as the season goes on."
    },
    {
      "username": "TheVictoriousV",
      "userUrl": "https://www.imdb.com/user/ur19932818",
      "reviewLink": "https://www.imdb.com/review/rw8469591",
      "warningSpoilers": true,
      "date": "20 August 2022",
      "rate": "10",
      "helpful": "8 out of 14 found this helpful.",
      "title": "For all I know, Fielder has prodded me to write this review",
      "content": "Nathan Fielder is the maddest and most ingenious of mad geniuses -- not only because of his \"really good grades\".Ever since Nathan for You, the Comedy Central hit he created shortly after writing for Jon Benjamin Has a Van, he's been taking the format of practical-joke reality shows (often associated with Tom Green, Punk'D, and vile YouTube pranksters but usually deemed at its peak in the exposés of Sacha Baron Cohen) to new heights. Now, with big-budget backing from HBO, he is unleashed, making reality his sandbox and human beings his playthings.Nathan for You was fascinating because it wasn't just a slew of \"pranks\". It was an experiment to see (1) what people in the modern economic climate would do at their most financially desperate, (2) how absurd Fielder's business suggestions -- and mannerisms -- could get before his guests would either see through his performance or decline his aid (neither of which tended to happen), and (3) how far you can actually go when you embrace absurdity.Indeed, many of Fielder's \"schemes\" resulted in success (consider the viral video of a heroic pig that made people want to visit the petting zoo where it lived, not to mention the Dumb Starbucks news story). Somewhat ironically, it may help that Fielder appears as a socially oblivious deadpan version of himself; nobody ever sees him as that skeezy, smirking salesman who's trying to sell you sh-t. It's one of those \"prank\" shows where the embarrassment is just as much -- if not more so, or sometimes exclusively -- on the part of our host. (One critic noted that those who get major second-hand embarrassment or anxiety from The Office would get a heart attack from Nathan for You.)The show was both hilarious and thought-provoking -- in the sense that Fielder's stunts always get at something deeper. With The Rehearsal, he moves on from desperate businesses and makes it personal.Distractify put it best, arguing that The Rehearsal is effectively a commentary on Nathan For You and Fielder's general docu-comedy style, where he would walk into these real situations following a loose script and having to account for as many alternate trajectories as possible. Here, he gives others the chance to do something similar, but with their own personal lives and with more advanced tools.The first episode sets up what seems to be the series formula: Fielder visits someone he has recently befriended and soon reveals that the conversation they are having has been rehearsed dozens of times in a life-size replica of that person's home with a doppelgänger actor. He invites them to do the same; to map out the potential trajectories of a future interaction based on what they know of the other person (and the extraneous circumstances of the meet-up) and indeed \"rehearse\" it -- this is, again, complete with lookalike CraigsList actors and a full-scale, elaborate recreation of the venue where the meeting is to play out. (Think the Finding Frances episode of NFY.)The guest always agrees -- as they're usually about to have one of those meetings that must go exactly right -- but rarely suspects that they, in turn, are being prodded by Fielder and his crew into a certain outcome.As wild as this must sound, it's merely the beginning, and the layers of make-believe grow even more numerous as Fielder starts to get involved in the rehearsals, including an accelerated simulation of parenthood that spans several episodes. At one point, he instructs a new cast of doppelgänger actors to secretly study one person each and immerse themselves in that person's life/persona. Then, Fielder recreates the lecture, casts himself as the actor who received his assignment, casts another person as himself, and begins to immerse himself in the actor's life, asking the questions he imagines that the actor might've been asking about the ordeal. This is foreshadowing episode 6, which I daren't say too much about.In spite of Fielder's fearsome calculations, the show is a testament to the unpredictability of life and humanity. Critics have accused Fielder of manipulating and exposing people for sh-ts and giggles, but their examples always concern insane persons who say insane things with little to no prompting. For the parenthood rehearsal, Fielder -- or his character -- pretends to be in a marriage with a lady who gradually reveals herself to be a kooky, bigoted Christian (the kind who asks you to \"just Google\" things like the evil of the Jews or the very real existence of Satan, but likely wouldn't accept Google's answers to the question \"Are essential oils really medicine?\"). For all we know, this woman might be an actor too, though it doesn't play that way.After she leaves the show and Fielder resumes the parenthood rehearsal alone, now raising the fake child with Jewish values, a friendly-seeming Jewish counselor from earlier in the episode comes to visit for Hannukah supper. What a wholesome ending, one might think. But then, as a final slap in the face to most of us (especially if we've been primed to take one side as good and one side as bad), she gets a few drinks in and starts casually dropping hot takes like \"Well, Israel did WARN those Palestinians to get out of the blast zone\".As an experience, The Rehearsal is both funny and maddening (the expressly staged parts inside Fielder's human-sized dollhouses are surreal enough, but as I've noted, we can never be too sure about what we see in the real world either). To quote The New York Times, however, \"the show has a philosophical core: Is it ever possible to truly understand another person?\" Fielder taps into something that rings true of even the most confident conversationalist. Everyone at some time wishes they could predict exactly how life will go -- what to say at a given moment, what will be said back, what distractions might get in the way of how we want things to go, and so on.The Rehearsal is a next-level comedy; a contemplation on life, choice, make-believe, and other thinkpiece fodder that also happens to be a wild, gloriously uncomfortable watch. The boundaries of what sort of absurdism you can get away with in front of our most desperate kin are pushed, as are the boundaries for how much the \"fiction\" side of the pseudo-realism genre can influence reality before reality fights back. And yes, as others have already joked, you might just come away from this show feeling uncertain whether YOUR life is real, or a big, elaborate set-up by Nathan Fielder. (In season 2, I'm hoping we learn that he deliberately engineered the discourse about how \"manipulative\" he is.)Also worth citing is a tweet suggesting that The Rehearsal is Fielder's own Synecdoche, New York. Someone else clarified: \"Nathan Fielder could do Synecdoche, New York; Charlie Kaufman could not do Nathan for You or The Rehearsal\"."
    },
    {
      "username": "johnnymonsarrat",
      "userUrl": "https://www.imdb.com/user/ur1640094",
      "reviewLink": "https://www.imdb.com/review/rw8616143",
      "warningSpoilers": false,
      "date": "16 October 2022",
      "rate": "5",
      "helpful": "12 out of 24 found this helpful.",
      "title": "Started well, became Self-indulgent",
      "content": "I liked Nathan For You, and I loved the first episode of this show. It seemed like Nathan was going to help quirky people in a clever way, like a super hero.But episodes 2, 3, and 4 drifted into self-indulgence, with Nathan himself becoming the focus, the main theme of helping people getting lost in self-references and meta narratives, and the episode 2 target whom I found unlikable extended into a recurring character.To use an analogy, a zombie movie should never really be about the zombies. It should be on their effects on real people surviving. The Rehearsal was just too much about Nathan and his setups, and it's easy to guess why: their experiments didn't result in enough footage.I get it. When you're filming in the real world, you may not get enough footage to make a show. I think this series should have been planned better though. For example, they invested heavily into helping one target who quit, instead of going through to the end of the experiment."
    },
    {
      "username": "FeastMode",
      "userUrl": "https://www.imdb.com/user/ur104603847",
      "reviewLink": "https://www.imdb.com/review/rw8544218",
      "warningSpoilers": false,
      "date": "15 September 2022",
      "rate": "5",
      "helpful": "7 out of 13 found this helpful.",
      "title": "Love Nathan for You, this not so much",
      "content": "For reference, I think Nathan for You is, to the full extent of the word, genius. I repeatedly could not believe how clever it was. On top of that, it's hysterical. I watched it for the third time not too long ago. At least once per episode, I was literally in tears and had to pause it from how much I was laughing.The Rehearsal starts off so intriguing. It's immediately not as funny, but the rest is up to par. He continues to go to extraordinary lengths to achieve his absurd goals. It's pretty remarkable.Then it slowly starts to meander as the repeated use of the premise wears thin. And a few times it crosses over from good-weird to bad-weird.It's not really fair to compare it to one of the greatest shows of all time, but The Rehearsal is a disappointing follow-up. I wouldn't watch it again. (1 viewing, 9/10/2022)"
    },
    {
      "username": "cdc123",
      "userUrl": "https://www.imdb.com/user/ur14082856",
      "reviewLink": "https://www.imdb.com/review/rw8533639",
      "warningSpoilers": true,
      "date": "10 September 2022",
      "rate": "4",
      "helpful": "12 out of 21 found this helpful.",
      "title": "Interesting start and then...",
      "content": "Creepy show. Messes with very young actors' sense of self. First episode is good and gives you some hopeful anticipation that future participants will emotionally grow and have a cathartic experience. This says it's a comedy and documentary. It's a train wreck. Nathan's initial appeal diminishes with each episode until I find that he's lost more than he gained. And so do we. I hope there's not a season 2. If there is, I won't be watching. A good idea that failed to maintain the same level of interest on the remaining episodes. Amazed to see positive reviews for a disappointing series on HBO. This is an experiment that needs to be dissected and discarded."
    },
    {
      "username": "alexlenceon",
      "userUrl": "https://www.imdb.com/user/ur70743254",
      "reviewLink": "https://www.imdb.com/review/rw8562970",
      "warningSpoilers": false,
      "date": "23 September 2022",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Nathan has outdone himself",
      "content": "This show is an absolute masterpiece. I went in expecting a comedic reality show, but it is so much more. Nathan constantly treads a fine line between what is real and what is not. You never know if you are watching reality or a performance. It gets you confused, doubting, sad, and happy; and all of that at once. This is the first time in my life that I don't know what to feel after watching a show. Like you know how every show or series has a specific aftertaste right? Yeah, The Rehearsal doesn't have that, and instead, this show will leave you with a feeling of completeness, and a mixture of emotions which will, no doubt, be unique to each viewer. This show allows you to discover something new, not only about others, but most of all yourself. After finishing the show you will, as usual, go on with your day, and maybe even forget about it; but the experience will stay with you. I know all of this sounds cheesey, but this is the best way I can describe this show to do it justice."
    },
    {
      "username": "anniec62",
      "userUrl": "https://www.imdb.com/user/ur81312376",
      "reviewLink": "https://www.imdb.com/review/rw8364471",
      "warningSpoilers": false,
      "date": "24 July 2022",
      "rate": "10",
      "helpful": "13 out of 23 found this helpful.",
      "title": "Subtle dry humor, irony and all. Love this!!",
      "content": "When you're watching something and you know it's awesome because it's intelligent and you're getting it - subtle dry humor, irony and all. That's this show. Refreshing and so appreciated. And I've never seen Nathan For You. But will definitely check it out now."
    },
    {
      "username": "emme-29150",
      "userUrl": "https://www.imdb.com/user/ur154705106",
      "reviewLink": "https://www.imdb.com/review/rw8342276",
      "warningSpoilers": false,
      "date": "17 July 2022",
      "rate": "10",
      "helpful": "29 out of 40 found this helpful.",
      "title": "blown away!!",
      "content": "Please watch!! This show is not only funny but a brilliant commentary on modern day anxieties, making it extremely relatable. Nathan goes above and beyond in this show."
    },
    {
      "username": "joey_k-74060",
      "userUrl": "https://www.imdb.com/user/ur92648852",
      "reviewLink": "https://www.imdb.com/review/rw8441321",
      "warningSpoilers": false,
      "date": "13 August 2022",
      "rate": "5",
      "helpful": "18 out of 41 found this helpful.",
      "title": "First 3 episodes are good but goes downhill after that",
      "content": "The concept is brilliant but he simply goes too far with the rehearsal idea. He even rehearses rehearsals plus at times gets dark with melodramatic themes.I really want to like this but just can't. He would have been better off keeping it light and stick with short rehearsals."
    },
    {
      "username": "speedracerisdaman",
      "userUrl": "https://www.imdb.com/user/ur81158652",
      "reviewLink": "https://www.imdb.com/review/rw8415219",
      "warningSpoilers": false,
      "date": "8 August 2022",
      "rate": "8",
      "helpful": "8 out of 11 found this helpful.",
      "title": "Genius, brillant, madness, ridiculous, foolhardy?",
      "content": "Genius, brillant, madness, ridiculous, foolhardy? I can't decide yet.Just finished episode 4. It really is mind blowing what has been created. I watched this with amazement. Wondering how HBO execs tolerated the bills for what must be a super expensive tv show and how Nathan Feilder just brought 'inception' to real life with his deep dive acting methods.Intrigued to see where and how this all ends."
    }
  ],
  "errorMessage": ""
}