{
  "imDbId": "tt7472896",
  "title": "Mr Inbetween",
  "fullTitle": "Mr Inbetween (TV Series 2018–2021)",
  "type": "TVSeries",
  "year": "2018",
  "items": [
    {
      "username": "s3276169",
      "userUrl": "https://www.imdb.com/user/ur49392790",
      "reviewLink": "https://www.imdb.com/review/rw5119075",
      "warningSpoilers": false,
      "date": "14 September 2019",
      "rate": "8",
      "helpful": "57 out of 58 found this helpful.",
      "title": "Don't mess with.....",
      "content": "Mr Inbetween brilliantly captures the raw underbelly of Australian society.The main character Ray is a man of two parts. One is a kind, generous and considerate rough diamond. The other a ruthless monster, who brutalises and kills, with a pragmatic, at times almost jovial, \"you had this coming\", coldness.The juxtaposition of conflicting yet at the same time oddly reconciled personality traits, that constitute Ray's complex persona, make for fascinating viewing. Ray slips with relative ease into and out of a world of pedestrian normalcy, into one fuelled by organised crime, violence and sudden death.It never ceases to amaze me how many quality productions come out of Australia. Mr Inbetween is yet another example. Well acted, intelligently written and ably directed. Great stuff from \"down, down under\".8/10 from me."
    },
    {
      "username": "danielcereto",
      "userUrl": "https://www.imdb.com/user/ur29002389",
      "reviewLink": "https://www.imdb.com/review/rw7148659",
      "warningSpoilers": false,
      "date": "21 July 2021",
      "rate": "10",
      "helpful": "68 out of 70 found this helpful.",
      "title": "Masterpiece",
      "content": "This is the best series I've watched in 2021 by far. First, acting is superb from the main character and most of the others. Brother's performance is terrific. Second, I love the length of every single episode. Impossible to get bored. Last, the storyline is fantastic from begining till the end.So, overall better than 99% of Hollywood series. Amazing Aussie production."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw6530180",
      "warningSpoilers": false,
      "date": "26 January 2021",
      "rate": "9",
      "helpful": "70 out of 73 found this helpful.",
      "title": "So good and so underrated!",
      "content": "Reading through most of these reviews I think mostly everyone can agree on one thing...Mr. InBetween is a really really good show! This show came out of nowhere (Australia actually) and has hooked everyone who has given it a chance. It's easily one of the most underrated shows on right now and I can't wait for more!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8575540",
      "warningSpoilers": false,
      "date": "29 September 2022",
      "rate": "9",
      "helpful": "29 out of 29 found this helpful.",
      "title": "Such an underrated show!",
      "content": "Reading through most of these reviews I think mostly everyone can agree on one thing...Mr. InBetween is a really really good show! This show came out of nowhere (Australia actually) and has hooked everyone who has given it a chance. It's easily one of the most underrated shows I've ever seen. I don't know anyone who's seen it that doesn't love it. The lead character (Scott Ryan as Ray) is both a tough guy who you shouldn't ever mess with and also a kind and good man. This show has something for everyone...it is funny, violent, thrilling, mysterious, etc. It's a show that should be binged because once you finish an episode you can't wait until the next one. If you haven't yet seen this underrated show then do yourself a favor and go watch it as soon as possible."
    },
    {
      "username": "nowego",
      "userUrl": "https://www.imdb.com/user/ur16749093",
      "reviewLink": "https://www.imdb.com/review/rw4391669",
      "warningSpoilers": false,
      "date": "11 October 2018",
      "rate": "10",
      "helpful": "57 out of 60 found this helpful.",
      "title": "Hillarious, Violent and Heart Warming",
      "content": "As an Australian I don't always like our homegrown TV Shows and Movies but this one does Australia proud, so funny that I sat there laughing so hard it hurt.None of the violence is overdone and there is logic to all of the violence even if not everyone would agree with it. None of it is senseless for the sake of violence and it is well explained by the main protagonist. I really liked his principles.Like another reviewer has stated this show is in a league of its own, nothing I have seen compares to this, Scott Ryan was just brilliant as the main character, a complete unknown to me. Justin Rosniak is another complete unknown, Damon Herriman is well known from Justified and always does a good job. Brooke Satchwell is always nice eye candy and did a good job. Matt Nable is another I am familiar with and he played his normal understated character that I am used to, always like seeing him in shows.This show easily gets a 10 from me, just under 3 hours of very entertaining TV, easily watched in one sitting, which I was lucky enough to be able to do."
    },
    {
      "username": "trademarcdesigns",
      "userUrl": "https://www.imdb.com/user/ur89157373",
      "reviewLink": "https://www.imdb.com/review/rw4364097",
      "warningSpoilers": false,
      "date": "27 September 2018",
      "rate": "10",
      "helpful": "102 out of 106 found this helpful.",
      "title": "Good escapist fare",
      "content": "Two episodes in and already I'm a fan. The whole \"thug for hire\" premise suggested this would be a dark show - gritty and serious. Not so. It's actually fairly lighthearted, especially considering the subject matter, and that makes it a fun watch. The cast is largely unknown - at least in the US - but I enjoyed Damon Herriman for years as Dewey Crowe in Justified, and he brings a lot of that Sad Sack charm to this new role. This show isn't going to sweep the Emmys, but it's a pleasant way to kill half an hour, and it has the potential to become a bit more than that.And for those reviewers who complained about the Australian accents, close captioned (subtitled) versions are available on most of the torrent sites.This is an UPDATE - I haven't changed any part of my original review except the rating.I wrote my original review after only 2 episodes, and after having watched the entire series I changed my rating from 8/10 to 10/10. This show really did live up to its full potential - screamingly funny at times (in a dark way), but remarkably poignant as well, especially when addressing Ray's family issues. I'll be keeping an eye on everyone involved in this production to see what they do next..."
    },
    {
      "username": "theknownames",
      "userUrl": "https://www.imdb.com/user/ur12161715",
      "reviewLink": "https://www.imdb.com/review/rw6700670",
      "warningSpoilers": false,
      "date": "16 March 2021",
      "rate": "10",
      "helpful": "28 out of 29 found this helpful.",
      "title": "Well crafted and balanced",
      "content": "This is so well crafted and balanced , I have to leave a review . It's an excellent series ( we have watched both season one and two ) so I speak to the series, in its entirety , as well as individual episodes.I can't think of anything that didn't work . The likability of the characters is never forced. And while the story can be a bit brutal , again it's not forced. In fact there are so many levels of nuisance even my partner (a psychologist who is super picky and doesn't like violence ) watched every episode.I would go so far as to say it's exceptional. We already miss having something of this caliber on our watch list."
    },
    {
      "username": "bjarias",
      "userUrl": "https://www.imdb.com/user/ur48560127",
      "reviewLink": "https://www.imdb.com/review/rw7511450",
      "warningSpoilers": false,
      "date": "5 November 2021",
      "rate": "10",
      "helpful": "26 out of 27 found this helpful.",
      "title": "... don't pass on this terrific little series",
      "content": "... folks down-under do some-really-good-programming ... your-into-this-genre dark-comedy-crime-drama ... finishing up past July this one of the-very-good-ones... all critical acclaim it received is well deserved... Ryan & Yasumura both terrific... series ended w-most all of its fans wanting more.. much more."
    },
    {
      "username": "MadamWarden",
      "userUrl": "https://www.imdb.com/user/ur34187486",
      "reviewLink": "https://www.imdb.com/review/rw5300759",
      "warningSpoilers": true,
      "date": "5 December 2019",
      "rate": "10",
      "helpful": "44 out of 49 found this helpful.",
      "title": "EVERYTHING THE IRISHMAN ISN'T",
      "content": "Scorcese could learn a lot from this series. It is raw, real, sensitive, ugly, emotional and immensely entertaining.A Masterpiece. Not easily said!!!"
    },
    {
      "username": "efd-10467",
      "userUrl": "https://www.imdb.com/user/ur98571307",
      "reviewLink": "https://www.imdb.com/review/rw5261030",
      "warningSpoilers": false,
      "date": "16 November 2019",
      "rate": "8",
      "helpful": "15 out of 15 found this helpful.",
      "title": "Best Australian Show I've Seen in a while",
      "content": "Just watched both Series and must say it kept me entertained throughout, great writing and brilliantly acted.The comedy injections are hilarious but to counteract against them is the violence and sadness surrounding the characters lives.I simply had to go out and eat a Dimmie. (Dim Sim) after Series 1, great to see Australian drama at this level, very well done.I so hope there are more in the pipeline."
    },
    {
      "username": "dgrozier",
      "userUrl": "https://www.imdb.com/user/ur93365971",
      "reviewLink": "https://www.imdb.com/review/rw4372391",
      "warningSpoilers": false,
      "date": "2 October 2018",
      "rate": "10",
      "helpful": "63 out of 69 found this helpful.",
      "title": "Awesome Aussie dry humour. Top bloke",
      "content": "Very hillarious tv show. Wish it was longer per episode but thats the budget i suppose. Whingers and pommie or yank whiners in the reviews Give yourself an uppercut. This is hilarious. Way better than anything out of the states or uk lateky. Why do you think they ripped off animal kingdom? Dry humour and a bit of a softy at heart. Yeah it pays hommage to some classics ,so obviously,its out of respect. Why someone would give this a 3 is pretty illuminating. Same people that didnt like Dunkirk. Hopefully the show gets the support to continue developing this great aussie tv show. The subtlety is lost on some people. I'd ask,why did you watch it? For everyone else ,,toatally addicted. Top show"
    },
    {
      "username": "gringott",
      "userUrl": "https://www.imdb.com/user/ur11777242",
      "reviewLink": "https://www.imdb.com/review/rw4374105",
      "warningSpoilers": false,
      "date": "3 October 2018",
      "rate": "9",
      "helpful": "82 out of 85 found this helpful.",
      "title": "Worth watching, stick with it.",
      "content": "Gritty show from Australia which I found quite believable, unlike shows in the vein of Ray Donovan etc. Having known a few people in my time on earth that actually made a living from crime and violence, I found the portrayals realistic. There is no glamorized violence, kung fu, CGI BS or 90 pound women in high heels and evening dress beating up 220 pound thugs, so if that fake Hollywood world is your thing, this is not for you. In the real world, people are multi-faceted, and this show does a good job of presenting that with the main character. I am not Australian, but I didn't need subtitles to understand the dialogue. As for the reviewer who said the main character is a rip off of Mike from Breaking Bad, you are wrong. The lead in Mr Inbetween is a direct recreation of the lead role in The Magician, 2005, an Australian movie. Scott Ryan wrote the movie and played the lead, and he is a writer on Mr Inbetween and also plays the same character. Note Breaking Bad didn't air until 2008, 3 years after The Magician, so if anything, Mike is a rip off of Ray Shoesmith.Don't miss this show if you like realistic action, settings and characters. If you like Hollywood and typical UK PC police procedurals, you might not like this. Personally, I found Mr Inbetween a breath of fresh air."
    },
    {
      "username": "khunkrumark",
      "userUrl": "https://www.imdb.com/user/ur38492175",
      "reviewLink": "https://www.imdb.com/review/rw4442994",
      "warningSpoilers": false,
      "date": "7 November 2018",
      "rate": "9",
      "helpful": "24 out of 26 found this helpful.",
      "title": "An excellent breath of fresh air. Thanks, Australia!",
      "content": "What a thoroughly entertaining series this is. The story, the characters and the cast are all fantastic.I binge-watched this series, which is easy to do. The episodes are only 28 minutes long and there are only six of them.Casting kids in roles for TV is always a challenge as the lines, the actors and the settings almost always seem forced and unnatural... but Chika Yasumura (as Brittany) is simply awesome in her role. She's cute as a button and a 'natural' on screen.This is simply gripping and exciting telly."
    },
    {
      "username": "chrismonkee",
      "userUrl": "https://www.imdb.com/user/ur69062529",
      "reviewLink": "https://www.imdb.com/review/rw4407128",
      "warningSpoilers": false,
      "date": "19 October 2018",
      "rate": "10",
      "helpful": "13 out of 13 found this helpful.",
      "title": "Excellent",
      "content": "First Aussie TV show I have ever watched. This is excellent, entertaining as hell. Very rare I am looking forward to the next episode of anything.I highly recommend this."
    },
    {
      "username": "celt007",
      "userUrl": "https://www.imdb.com/user/ur16126010",
      "reviewLink": "https://www.imdb.com/review/rw5213293",
      "warningSpoilers": false,
      "date": "25 October 2019",
      "rate": "9",
      "helpful": "11 out of 11 found this helpful.",
      "title": "Ray Shoesmith bad guy heart of gold?",
      "content": "What a great show, Scot is great as Ray Shoesmith a criminal for hire trying to balance life as father and bf and his gangster life! Funny and dark ! A must watch"
    },
    {
      "username": "Eagles409",
      "userUrl": "https://www.imdb.com/user/ur0223217",
      "reviewLink": "https://www.imdb.com/review/rw4375584",
      "warningSpoilers": false,
      "date": "4 October 2018",
      "rate": "10",
      "helpful": "43 out of 46 found this helpful.",
      "title": "Love this new show!",
      "content": "I read a single review for this show and knew nothing about it when I decided to check it out. The show is 100% Australian, filmed in Australia with Australian actors, no Americans. I can see how some people might find the accents and the slang terms a little difficult, but if you can get passed that, the show is amazing. It's one of those shows that I'm always sad is over, I want more episodes and longer episodes, the people and characters are fantastic. I'm surprised they put it on FX, but I'm so glad they did. I'm just hopeful that it's popular enough to warrant more seasons and popular enough in the U.S. that they continue to show it over here. If you're already tuned in for the SOA spinoff, check this show out, you won't be disappointed."
    },
    {
      "username": "fanatix-05187",
      "userUrl": "https://www.imdb.com/user/ur61986016",
      "reviewLink": "https://www.imdb.com/review/rw4391030",
      "warningSpoilers": false,
      "date": "11 October 2018",
      "rate": "9",
      "helpful": "134 out of 141 found this helpful.",
      "title": "Season 1 - Excellent",
      "content": "Just finished watching all 6 episodes and was clapping at the end. If you get aussie humour and their way of life, then you will enjoy this start to finish. If Tarrantino made a TV series in australia with a dash of breaking bad, then this would be it. Roll on season 2....."
    },
    {
      "username": "KOOLAIDBRO",
      "userUrl": "https://www.imdb.com/user/ur18941631",
      "reviewLink": "https://www.imdb.com/review/rw5528951",
      "warningSpoilers": false,
      "date": "5 March 2020",
      "rate": "10",
      "helpful": "16 out of 17 found this helpful.",
      "title": "This show makes you root for the bad guy",
      "content": "Ray is about respect, good father, brother, and friend. You can't help, but like him. Oh yeah. He's also a hitman that does things that make you question your own morals for liking him so much. Much in the way Breaking Bad did with Walter White. It also reminds me a lot of Breaking Bad with a little bit of the movie Falling Down mixed in. You'll be laughing one minute and then getting hit in the feels the next. This show needs to be watched. It's currently streaming on Hulu and if you're like me you did the Disney+ package and other than Letterkenny have found Hulu a waste of time. Well here's probably the best show nobody is watching and possibly the best show currently running."
    },
    {
      "username": "Warren_Scott-55087",
      "userUrl": "https://www.imdb.com/user/ur78219998",
      "reviewLink": "https://www.imdb.com/review/rw4362050",
      "warningSpoilers": false,
      "date": "26 September 2018",
      "rate": "8",
      "helpful": "52 out of 61 found this helpful.",
      "title": "Stay with this one",
      "content": "Though it's only the first two episodes, i can already see this being the sleeper of the year as far as tv shows go. Without giving anything away, this show gives you a little taste of everything, for every tv show enthusiast. I'll definitely be tuning in next week after The Myans."
    },
    {
      "username": "stevelivesey67",
      "userUrl": "https://www.imdb.com/user/ur17235488",
      "reviewLink": "https://www.imdb.com/review/rw8545248",
      "warningSpoilers": false,
      "date": "15 September 2022",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "Oh no, I've found my new favourite TV show.",
      "content": "Saw a clip of this on Facebook and was intrigued. Eventually caught up with it and it definitely gives me the same vibes I had when I first saw The Sopranos, The Wire and Firefly (don't judge me, there's no accounting for taste) Great writing black and bleak, violent and yet funny all at the same time. The character of Ray may be the most disturbing and threatening character I've ever come across.Utter genius.Saw a clip of this on Facebook and was intrigued. Eventually caught up with it and it definitely gives me the same vibes I had when I first saw The Sopranos, The Wire and Firefly (don't judge me, there's no accounting for taste) Great writing black and bleak, violent and yet funny all at the same time. The character of Ray may be the most disturbing and threatening character I've ever come across.Utter genius.Saw a clip of this on Facebook and was intrigued. Eventually caught up with it and it definitely gives me the same vibes I had when I first saw The Sopranos, The Wire and Firefly (don't judge me, there's no accounting for taste) Great writing black and bleak, violent and yet funny all at the same time. The character of Ray may be the most disturbing and threatening character I've ever come across.Utter genius."
    },
    {
      "username": "Beyondtherain",
      "userUrl": "https://www.imdb.com/user/ur112884414",
      "reviewLink": "https://www.imdb.com/review/rw6963734",
      "warningSpoilers": false,
      "date": "25 May 2021",
      "rate": "10",
      "helpful": "15 out of 16 found this helpful.",
      "title": "Has an insanely stong charismatic leading man!!",
      "content": "Nice story and characters. Better than average. This is exactly what Jason Statham used to be!"
    },
    {
      "username": "spokanegolfer",
      "userUrl": "https://www.imdb.com/user/ur60640983",
      "reviewLink": "https://www.imdb.com/review/rw4407751",
      "warningSpoilers": false,
      "date": "19 October 2018",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "Must Watch!!",
      "content": "By far the best show that I've seen this fall! What can't there be more shows like this??"
    },
    {
      "username": "b4blue",
      "userUrl": "https://www.imdb.com/user/ur6569605",
      "reviewLink": "https://www.imdb.com/review/rw7076331",
      "warningSpoilers": false,
      "date": "30 June 2021",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Weird, simple, amazing...",
      "content": "This is the weirdest show on the TV. Sometimes nothing is happening, but some random everyday conversations. Sometimes these are funny and sometimes not at all. Like normal life. But then it is cut by some firearm, knives or axes action. There are scenes that will turn your stomach and question your moral principles. The show doesn't impose them on you, because it just shows you everything, without too many words and leaves you to cope with it. There is no overacting, no forced drama. Brilliant cast."
    },
    {
      "username": "levybob",
      "userUrl": "https://www.imdb.com/user/ur63558972",
      "reviewLink": "https://www.imdb.com/review/rw6996028",
      "warningSpoilers": false,
      "date": "3 June 2021",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "Season One: We Know What's Coming. And that's what makes it great.",
      "content": "I love 'Mr. InBetween'. I love it because it does not try to be what it's not. What it is, is simple enough. A tough guy (really tough, incredibly tough, cold-blooded-tough, killer tough) has a heart of gold (or close to). Which doesn't stop him from bashing the bad guys. But does keep him from bashing those bad guys who are somehow worth saving.He's got a girlfriend who suspects he may be more than merely tough. He's got a daughter who adores him (and rightfully so). He cares for a stroke victim (at least I think it was a stroke), he shows up at his kid's soccer matches, he takes anger-management training, and he's his best-friend's avenger. I mean, What's not to like?I said he's a basher. He's a really good one. But also he's smart. Smart enough to know which of the bad guys is dumb enough to fool. And when he can fool them, he does. Leaving them embarrassed, ashamed, perhaps poorer. But ... alive.So with each and every episode we move between Mr. Soft and Mr. Hard and back to Mr. Soft and so on and so on. And even though we know what's coming, I never get tired of it.As for its star / producer Scott Ryan. You gotta love his portrayal. You gotta loved his smile, his sneer, his boiling over. Never does he fail to deliver."
    },
    {
      "username": "Induswa",
      "userUrl": "https://www.imdb.com/user/ur51660985",
      "reviewLink": "https://www.imdb.com/review/rw4399212",
      "warningSpoilers": false,
      "date": "15 October 2018",
      "rate": "10",
      "helpful": "19 out of 20 found this helpful.",
      "title": "Too funny",
      "content": "This show is awesome. The hero is a bad guy but likable and interesting. He keeps running into bad guys that are dummies and hilarious. Everyone is trying to steal something from everybody else. I wish there were more episodes."
    }
  ],
  "errorMessage": ""
}