{
  "imDbId": "tt0286486",
  "title": "The Shield",
  "fullTitle": "The Shield (TV Series 2002–2008)",
  "type": "TVSeries",
  "year": "2002",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8577117",
      "warningSpoilers": false,
      "date": "30 September 2022",
      "rate": "9",
      "helpful": "35 out of 35 found this helpful.",
      "title": "As good as everyone says it is!",
      "content": "What can I say about The Shield that hasn't already been said? It was absolutely brilliant! It was so far ahead of its time when it came out from 2002-2006 and has been copied many times since. The writing and acting is what makes this show so special. It follows a rogue cop in the Los Angeles police department named Vic Makey (Michael Chilkis), who leads a criminal division task force that will do anything possible and go to any lengths to take down the criminals they're chasing, including breaking the law or working with other criminals. The Shield is one of the best to ever do it. It's one of the most compelling police dramas to ever be on television."
    },
    {
      "username": "mjk280",
      "userUrl": "https://www.imdb.com/user/ur3487897",
      "reviewLink": "https://www.imdb.com/review/rw2320657",
      "warningSpoilers": false,
      "date": "6 October 2010",
      "rate": "10",
      "helpful": "230 out of 245 found this helpful.",
      "title": "Possibly my favorite drama ever",
      "content": "I hate giving 10's because nothing is perfect, but a 9 doesn't do it justice. There have been a lot of 9's over the years but this show is even better than those. Over 7 seasons The Shield consistently provides an incredibly diverse group of characters and more intrigue than most TV has ever provided. The web Vic and his team weaves is always winding in all sorts of directions and is often on the verge of breaking. Vic and the rest of the strike team use their authority and cunning to untangle it as best they can, almost always using tactics that are ethically questionable at best. The whole thing really gets you sucked in and you're always torn because rooting for Vic is easy, facing what he really is is not. What's right and what's wrong? When do the lines begin to blur? It's not always clear, but it's incredibly entertaining to watch.The other thing I really love about the show is how there's always another separate case being pursued by Dutch Waggenbach and company. It keeps each episode going in different directions and the case is always interesting or has an unexpected twist when it's resolved. I think another thing that separates this show from all the others is that you get your murder/rape case that you get everywhere else, but that only compiles about 30% of each episode and the rest is even better than that. Shows like CSI and Law & Order can't even touch the content this show brings, and I haven't even mentioned the gritty, realistic style it's shot and written in. Absolutely unique and done believably and well. The finale? It's as good as you're ever going to get. It really is a stellar show. I would say there was perhaps one season I thought was only above average (not exactly a strike against it) but the rest was a thrill ride that was so gripping I don't know if there's more than a handful of other shows that have ever matched it in that capacity. You're always in for a surprise when you watch it and the characters grow on you, some of them whether you want them to or not. Recommended as highly as possible."
    },
    {
      "username": "danielcereto",
      "userUrl": "https://www.imdb.com/user/ur29002389",
      "reviewLink": "https://www.imdb.com/review/rw5955651",
      "warningSpoilers": false,
      "date": "31 July 2020",
      "rate": "10",
      "helpful": "44 out of 48 found this helpful.",
      "title": "The Shield on 2020",
      "content": "I just finished this series today on July 2020 and all I have to say is that it does not look cheap, old or non interesting, just keeping in mind this was filmed between 2002-2008. First, most of the main cast are extremely good actors. Vic, Aceveda and Shane were the most powerful. Second, the storyline and the length of the chapters are quite good too. Probably the story could have been told with 4-5 seasons easily. But it is what it is. Last, camera work, make up and sound are pretty cool. I can't believe this show started on 2002. On the other hand, seems some characters were not fully developed or look like the writers didn't want to give them credit. But not a big thing. So, overall if you're looking for an excellent cops show, brutal, raw and almost perfect, this one is for you. Now, I'm going to watch The Wire. I want to compare both shows and see which one is better."
    },
    {
      "username": "travola-35109",
      "userUrl": "https://www.imdb.com/user/ur134112709",
      "reviewLink": "https://www.imdb.com/review/rw8418063",
      "warningSpoilers": true,
      "date": "9 August 2022",
      "rate": "10",
      "helpful": "19 out of 19 found this helpful.",
      "title": "Top 10 all time show.",
      "content": "The Shield is incredible and a trailblazer for modern tv drama. It's the greatest cop show ever made and had to be considered a top 10 cable television drama of all time. There are twists and turns and betrayal like never seen before when it came out. The characters are deep and well written. The story arch for the main characters is incredible and everything that happens in the series whether it's season one of the final season matters and is relevant to the show.It is gritty and depressing and that can be tough to watch sometimes but the payoffs are amazing and it makes the show a classic. Breaking Bad before Breaking Bad, Vic is one of the most controversial lead characters ever. He's a bad man and there is no denying that but he had a family and a strange moral code that at times had you rooting for the guy even though he continuously does vile things. Amazing guest characters that go a season or two and matter to the overall plot. In my opinion Vic's end or storyline end is more devestaing than if he was killed or put away forever. The force and his actions essentially took everything and anyone from him that he actually cared about or had a bind with. Then they effectively \"castrate\" Vic in the final episode after one final \"betrayal\" and tragic ending for another one of his team members from the strike team.Watch this show if you enjoy quality television from the beginning stages (HBO and Sopranos really was the spark) of the golden age of television. From 1997 to somewhere in the 2010s is truly the golden age as far as cable dramas and The Shield is one of the best to ever come out of this era. It's slightly forgotten but once you watch it you will never forget again."
    },
    {
      "username": "collectorofsorts",
      "userUrl": "https://www.imdb.com/user/ur91940320",
      "reviewLink": "https://www.imdb.com/review/rw8208343",
      "warningSpoilers": false,
      "date": "5 June 2022",
      "rate": "10",
      "helpful": "15 out of 15 found this helpful.",
      "title": "Probably the best Series of its type!",
      "content": "I watched this during the original TV broadcasts and purchased the DVD set afterwards. It's probably the best police corruption series that I've ever watched. It takes us from the early years when they started taking shortcuts to the later years when they had become full fledged criminals who thought nothing of flooding the streets with drugs or killing people. The thing I really enjoyed about the series was that it showed them as human beings. By the end of the series, their morals had become so twisted that they were going after people just like themselves and somehow justifying it to themselves. It was a great series and I still get the DVD set out yearly for a watch. I just finished watching the final episode and it's just as good as it was the first time I watched it. And the series is probably even more relevant today than it was back then. It tells us that power is a corrupter and too much power can become a great corrupter. I think we've all personally seen that to be true. I know I have in the people I've encountered throughout life. If you haven't watched it yet. Then stream it or buy the DVD/Blu-ray set. You won't regret it!"
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw5948320",
      "warningSpoilers": false,
      "date": "28 July 2020",
      "rate": "9",
      "helpful": "41 out of 46 found this helpful.",
      "title": "Among the best cop shows ever created!",
      "content": "The Shield is absolutely deserving of its hype and still holds up as much today as it did when it was on over 12 years ago! There are sooo many good police shows out there to choose from but The Shield is among the best to ever do it. It will keep you on the edge of your seat throughout the entire series!"
    },
    {
      "username": "GoodTVwatcher",
      "userUrl": "https://www.imdb.com/user/ur69751550",
      "reviewLink": "https://www.imdb.com/review/rw8487293",
      "warningSpoilers": false,
      "date": "25 August 2022",
      "rate": "10",
      "helpful": "19 out of 19 found this helpful.",
      "title": "Watched it last year still think about it sometimes",
      "content": "I'm not movie series buff but do watch occasionally.. Why did the American industry stopped making such shows/movies. This was just next level, the level of engagement, so tight screenplay, the complexity of characters, their dislogues, acting of all the top cast.Specially this show isn't talked about like other from 2000s. What an epic end that was."
    },
    {
      "username": "Eumenides_0",
      "userUrl": "https://www.imdb.com/user/ur4061961",
      "reviewLink": "https://www.imdb.com/review/rw2593147",
      "warningSpoilers": true,
      "date": "7 April 2012",
      "rate": "10",
      "helpful": "43 out of 50 found this helpful.",
      "title": "The Perfect TV Show?",
      "content": "I haven't watched many TV shows ever since The Shield ended, and never again with the same devotion and lack of critical attitude. After The Shield, I just couldn't go back to watching problem-of-the-week type of shows, whether it be super-duper, morally perfect policemen solving a crime every episode (CSI, Criminal Minds, The Mentalist, et cetera), or some young reluctant hero killing monsters (Buffy The Vampire Slayer, Supernatural, et cetera). I became used to long-term plotting, dynamic characters constantly changing, complex narratives developing organically, and incisive critiques of society, race, sexuality, power, politics, family relationships, and more, much more. Yes, I even became used to bleakness, a lot of pessimism and a refusal to offer viewers simple solutions to complex problems. In this sense, The Shield is less a conventional TV show and more a novel in visual form, a long story, carefully plotted, full of meditations and insights into human nature, and a mirror to our times.The story revolves around Vic Mackey and the other members of the Strike Team, a special LAPD unit that deals with street crime by bending the law as much as possible without snapping it. But then David Aceveda, the new captain, arrives at their precinct, demanding better crime stats. Aceveda is a cop with political ambitions and his cleaning up crime is just the first step on the road to become the mayor. This pushes the Strike Team to start using illicit methods to control the crime in their area, which ironically prompts Aceveda to start investigating them, by planting a spy in their group. When they get wind of this, they execute their team-mate and cover it up. This action reverberates throughout the series for all its 89 episodes. The Strike Team starts planning their early retirement by stealing from Armenian criminals, deal with betrayals, frequently try to redeem themselves, skirmish with Internal Affairs, all the while uncovering corruption, forging allies with criminals and federal agencies and simply trying to sort out their messy personal lives.Every character is missed dearly, for no matter how corrupt, evil or Machiavellian, they were clearly loved by the writers. Instead of stock characters, we have human beings with distinct personalities, dreams, motivations, fears, different worldviews, ways of operating and different levels of morality. It was always fascinating to see the outspoken, bullying Vic Mackey share scenes with the subtle, scheming Aceveda; or to compare Detective Claudette's by-the-book approach to morals with Vic's the ends-justify-the-means philosophy; or to compare Captain Monica Rawling's progressive but unpopular methods with Aceveda's media-friendly ones; or Vic's attempts at redemption with his good friend Shane's downward spiral into corruption. Or you can just be enthralled by the characters' personal struggles: Officer Julien's battle with his repressed homosexuality; Detective Dutch's social awkwardness and inability to become popular in spite of being a damn good cop, arguably better than Vic; or I.A. Lieutenant Jon Kavanaugh's own battle to remain a good policeman while allowing his obsession to nail Vic turn him into the criminal he despises. I could write an entire page just listing the fascinating characters in the show. And I haven't even mentioned the villains: Antwon Mitchell, whose attempt to grab power in LA dominated one of the best seasons of the series; or the final villain of the series, the businessman Pezuela and his blackmail network. Still the best villains in the show tend to be the cops: Vic, Kavanaugh, Aceveda, Shane, et cetera. Through them we get a sweeping vista of contemporary society as well as penetrating studies of morality. Season 3, which is undeservedly considered one of the series' weakest parts, is arguably the best study of greed ever written for TV, on par with The Treasure of Sierra Madre. And the fast-paced season 7, after dozens upon dozens of speeches on loyalty, ends with one of the most devastating betrayals ever. I wouldn't say The Shield is a difficult series to watch; in fact it's immensely watchable and entertaining; but unless you're prepared to accept that people are basically corrupt and selfish, you probably won't appreciate it a lot. Like many good novels, it provides an unglamorous, bleak portrayal of people that is a far cry from the soothing pabulum TV offers.The Shield mixes delicate drama with fast-paced action: it's fascinating to watch not only because of the violence, the sex, the cool and badass moments, but also because of the deep inner lives of each character, so well delineated and laid bare that we almost think we know them better than ourselves or our friends and relatives. Every action and decision exists organically; no character does anything that seems out of character or just to service the plot. Frequently they do stupid things, like we all do in our lives, but always for motives resulting from their own psychologies. The characters make the story, which is a nice change from typical TV storytelling, where often it seems characters are made to fit, by hook or by crook, into predetermined plots and conclusions. In opposition, The Shield's seasons build on each previous one, just like in a novel. When the series ends on episode 89, we know it was the only possible conclusion for every character. So it demands an investment of time and patience. In the 21st century, television finally learned that Twin Peak's formula was the way to go, namely long-term storytelling. Many mediocre TV shows were quick to bank on it, like Lost, with its ridiculous twists that screamed lack of planning, and Prison Break that started rehashing the same plot every season. But there were also a few good TV shows that learned the lesson well: The Wire, for instance. The Shield, however, for me is the apex of this new way of making TV shows. Even if it's not perfect, for nothing is, anything less than a 10 would be farce."
    },
    {
      "username": "jackDee-56565",
      "userUrl": "https://www.imdb.com/user/ur110145410",
      "reviewLink": "https://www.imdb.com/review/rw6065389",
      "warningSpoilers": false,
      "date": "5 September 2020",
      "rate": "10",
      "helpful": "18 out of 20 found this helpful.",
      "title": "A gritty and dark masterpiece police drama",
      "content": "This series is pretty damn intense and a true classic, it does not hold back on anything, its quite realistic in terms of its brutal violence and follows some disturbing cases which may be too much for some people, I love this show all the cast are amazing, its very well written every episode is exiciting, I think more crime shows should learn from this"
    },
    {
      "username": "Catspaw57",
      "userUrl": "https://www.imdb.com/user/ur12965242",
      "reviewLink": "https://www.imdb.com/review/rw8556737",
      "warningSpoilers": false,
      "date": "20 September 2022",
      "rate": "9",
      "helpful": "18 out of 18 found this helpful.",
      "title": "As cop series go",
      "content": "The story lines weave in and out and stretch from one season to the next, always leaving a little tension.... The characters are more real in their foibles than one usually expects from television fare, and this is probably what makes the series watchable over a long period. The viewer lives along with them, the ups, the downs, the quirkiness (Dutchboy is a little too quirky)... And the acting and language is by and large excellent. Hand-held cameras make the whole thing immediate.The positives actually manage to drown out the negatives, namely the unreal emotional instability of Vic's crowd, and the contrived emotional structures... Tina and Julian's interactions are exaggerated (no one would stick around Julian the way she does, and her reference to his gayness is simply too much cherry on top of her lack of tact... As for Julian, he is permanently grumpy and his character is, indeed, too 2D for my taste, he never loosens up).Maybe it's really like that at a precinct, but the tendency of American producers and directors to want to create supermen and -women and then try to introduce failings in their character appears irresistible. These men blow up at the slightest provocation, and my main thought is \"They should never wear guns...\" .... That is the star that is missing in the line up.But these are minor errors, and they are natural for a series that is so long. The characters do at least remain consistent, and that does allow them to grow on us.... Chiklis' performance is excellent. Brilliant appearances by Glenn Close and Forest Whitaker... I wonder how many doors were destroyed during the filming .... I lost count."
    },
    {
      "username": "da_gopsta",
      "userUrl": "https://www.imdb.com/user/ur15491343",
      "reviewLink": "https://www.imdb.com/review/rw2595410",
      "warningSpoilers": false,
      "date": "11 April 2012",
      "rate": "9",
      "helpful": "43 out of 46 found this helpful.",
      "title": "One of a kind - a TV Series that actually gets better as it progresses",
      "content": "I only heard of The Shield a few weeks ago. I had only just finished watching a previous TV show from start to finish, and was after a new one to pass the time. I typed in \"The Best TV Shows Ever\", or something similar, on Google, and I noticed that this was on a few lists. I'd never heard of it, but after checking to see that it was given a very respectable 8.7 rating on IMDb, I decided to check it out.When I started, I was not unimpressed, but at the same time, I didn't really get the immediately-hooked feeling like I did at the start of other TV shows like Prison Break, Dexter and Breaking Bad, amongst others.However, unlike most TV dramas, The Shield got progressively better throughout its series. The characters were very complex and I can't think of a single main character who I had both rooted for at times, yet wanted to see their downfall in others.As I said, the series got progressively better, but in no way was I expecting the finale to be as good as it was. I've seen a fair few TV series in my time, but no series finale that I've seen has even come close to matching this one. An absolutely incredible finale of a quality that any series would have been proud of.I'd definitely recommend this show. For me personally, it was a steady 7/10 for the first couple seasons, 8//10 and 9/10 for the next few, but 10/10 for its final season. To give the actual finale a rating out of ten would do it injustice as I'm sceptical that I'll ever see one as good as that."
    },
    {
      "username": "RedrumNeddy",
      "userUrl": "https://www.imdb.com/user/ur68100353",
      "reviewLink": "https://www.imdb.com/review/rw8651958",
      "warningSpoilers": false,
      "date": "2 November 2022",
      "rate": "10",
      "helpful": "12 out of 12 found this helpful.",
      "title": "Different kind of cops",
      "content": "To call this show fantastic, would be an understatement.From the first episode, it is a rollercoaster that just goes up, and up, and up, and even further up, and then it just crashes down. Hard. So hard that it hurts.Fantastic acting from top to bottom. If you spend a lot of time watching shows, you will see some familiar faces here, some nice surprises. Walton Goggins is an absolute standout, first time I was exposed to his work for a longer period. What a performance. The camera work is raw, in your face, and very fast paced. You will love it or hate it.I spend way too much time on the Internet, and this show really is not talked about that often. You could consider it to be on the \"older\" side, but it is timeless. Superb quality, and the dialogue and character writing is top notch. Very hard to find something negative here. More people need to see this.Its hard to emphasize how connected you will feel to the characters after just a few episodes, especially The Strike Team. You got Vic being the de facto Alpha, Shane the cocky redneck, Lem the ultimate bro with a golden heart, and Ronnie the silent, zero BS guy. Not to forget Dutch and his partner Claudette, competent detectives with a strong friendship. And that is just the beginning.For me, this is the selling point of The Shield, you live with these people, and it feels so authentic. A beautiful experience. Please, do yourself a favor and check this out!"
    },
    {
      "username": "SkyFox1",
      "userUrl": "https://www.imdb.com/user/ur2131939",
      "reviewLink": "https://www.imdb.com/review/rw2159512",
      "warningSpoilers": false,
      "date": "17 November 2009",
      "rate": "10",
      "helpful": "222 out of 248 found this helpful.",
      "title": "The best series ever written",
      "content": "The Shield is not for everyone. My wife, for instance does not like violent TV shows. The Shield is raw, violent and full of incredible suspense and intrigue. A good friend of mine recently turned me on to the Shield and I will forever be grateful. I travel quite a lot and watched all 100+ hours of the Shield while on the road. I could not wait to get to the next episode. During a recent 2 week trip to India, I did not turn on the TV one time. I watched a episode or two of The Shield every night and a whole season each way on the plane. There is a lot of debate about the ending, which I thought was perfect. It's difficult to end such an epic saga but these guys did it about as good as you can. The Shield is life changing. Not all for the good.You should be prepared to be affected by this thing. It's gritty but in the same way that A Clockwork Orange is gritty. The difference is that this lasts for a long, delicious time."
    },
    {
      "username": "lynxenn",
      "userUrl": "https://www.imdb.com/user/ur27918206",
      "reviewLink": "https://www.imdb.com/review/rw8530533",
      "warningSpoilers": false,
      "date": "10 September 2022",
      "rate": "10",
      "helpful": "17 out of 18 found this helpful.",
      "title": "Overall THE BEST Show of All Time.",
      "content": "I watched The Shield when it originally aired. It quickly became my favorite show and no other show has surpassed it 20 years later. It may be a little dated today (a lot of things I see on other shows today I saw first on The Shield) and not quite as shocking as it was back then but it still holds up amazingly well. If you enjoy any type of police show or shows that make you question morality and right vs. Wrong, watch The Shield.This is the only series I've ever watched that I enjoyed every single episode. The writing was strong, the actors were amazing (seriously can't say enough good things about the entire cast's performance) and even the guest stars were phenomenal - you'll see some big names on there, some before they were famous! Everything about The Shield just works and meshes together perfectly, even down to the music. Season one the show was still finding its way a bit, but season two it found perfection and stayed there until the end.Most shows falter and stumble somewhere along the way, The Shield did not. Most shows either get cancelled too soon or drag on too long. The Shield does neither. The story is so complete and the ending is perfect. I have no complaints when it comes to The Shield. Maybe that's why after 20 years it's still my favorite completed series.Avoid spoilers of this show like the plague, because the show has some real shockers and knowing them definitely takes a lot away."
    },
    {
      "username": "nicorip22",
      "userUrl": "https://www.imdb.com/user/ur47190847",
      "reviewLink": "https://www.imdb.com/review/rw8043343",
      "warningSpoilers": false,
      "date": "8 April 2022",
      "rate": "8",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Really good",
      "content": "Very good tv show, if you like action, corrupt and violent characters you can't stop watching this show. The development of the characters in the develop of the seasons is excellent. The ending is epic, not all series have good endings, this one does."
    },
    {
      "username": "uncatw6",
      "userUrl": "https://www.imdb.com/user/ur23002130",
      "reviewLink": "https://www.imdb.com/review/rw2222689",
      "warningSpoilers": false,
      "date": "17 March 2010",
      "rate": "10",
      "helpful": "101 out of 113 found this helpful.",
      "title": "Very very very good show...top 3 series finale ever",
      "content": "The shield is one of the best cop shows of all time, only behind \"The Wire.\" The story line is rich and the cast is just brilliant. Michael Chiklis had a career defining role as the brutal Vic Mackey. Chiklis is so good that somehow you continue to root for the guy after all of the brutal crimes he has committed. He truly played that role to perfection. The show continues to get better as the seasons progress. They build on each other perfectly which sets up the epic and heart-wrenching series finale. As the seasons build, life truly seems to be on the line for every member of the strike team. Walton Goggins, who plays Detective Shane Vendrell, continually got better as the show progressed and gave mind blowing performance in the last two seasons.What also makes The Shield so rich are the other characters on the show other than the Strike Team. CCH Pounder was brilliant throughout the series and Detective Dutch Waggenbach and Steve Billings both helped balance out the show.Season long guest stints from stars Forrest Whitaker and Glenn Close helped make this show a top 10 drama of the decade.If you like \"The Wire\" or \"The Sopranos\" then you need to check this show out...It will be worth your time"
    },
    {
      "username": "lokutus-1",
      "userUrl": "https://www.imdb.com/user/ur1397267",
      "reviewLink": "https://www.imdb.com/review/rw2082982",
      "warningSpoilers": false,
      "date": "19 June 2009",
      "rate": "9",
      "helpful": "289 out of 340 found this helpful.",
      "title": "I thought i'd seen it all",
      "content": "I never wrote a review on IMDb, but after reading that many bad reviews about The Shield i felt i had to do this. In fact all that reviews kept me from seeing The Shield for a long time.But now that i am through with all Lost and 24 Seasons, seen The Wire twice, had a good time with Oz it was time for something new, so i finally gave The Shield a chance.And i can tell you it's one hell of a ride, i was hooked after seeing the first episode. I would even compare the series to The Wire, it is different of course and doesn't focus so much on the social aspects, it goes more for the action.It's got all you need, corrupt cops, drugs, violence, betrayal, good detective work (homicide team) and even some hot chicks occasionally ;) So my conclusion is that if you like quality series with a persistent plot and cliffhangers like The Wire, Lost, Sopranos or Oz go for this one you won't regret it! It will keep you on the edge of your seat for a long time.And i really can't understand where all those bad reviews are coming from... go check The Shield out for yourself!"
    },
    {
      "username": "jfcthejock",
      "userUrl": "https://www.imdb.com/user/ur14249268",
      "reviewLink": "https://www.imdb.com/review/rw2252654",
      "warningSpoilers": false,
      "date": "20 May 2010",
      "rate": "10",
      "helpful": "60 out of 81 found this helpful.",
      "title": "The Wire Meets Boys In The Hood",
      "content": "The Shield in my opinion as it is in most people's view, is probably regarded as second to The Wire as one of the greatest shows on television. The Shield is not just a cop show either, just like The Wire. With The Shield, you see politics, family issues, sexuality, and many other hard hitting topics that The Wire covers also but in two separate environments; Baltimore and Los Angeles. I was lucky enough to have bought the entire season 1 - 7 of The Shield on DVD at a good price, and slowly made my way through the vice and darkness that surrounds the show and its characters.All I can really say is The Wire has only barely just topped The Shield in my opinion as a hard hitting gritty show. Both are almost fully fair in greatness, if not for The Wire beating the other by an inch. Through The Shield, you are tagging along on a journey with Vic Mackey and his Strike Team, through some harrowing and disturbing stories to the finale of this amazing show. Just as the The Wire is considered to be an analysis of society, I believe The Shield is too more so through the police but you still see both sides of the same argument from the political and criminal side too. No one is innocent, and no one can pretend to be either as they all hide secrets. Through The shield you will see some harrowing scenes, some gritty cliffhangers to the seasons and some life-changing decisions being made in the show by its cast. Its harrowing, disturbing, gritty, hard hitting, and so down in the dirt realistic you know this happens almost everywhere. If not to watch for the crime side to it, watch The Shield to see an analysis of family life, ones own battle with their sexuality, the ever-running struggle against the corrupt institutions. Its a study of policing in an urban environment torn by strife, violence, racism and definitely the class system.As each season passes and new ones open, we are left with many questions, awaiting answers. We await retribution, vengeance, and just deserves but we keep watching as it it so addictive. The Shield barely scrapes the top of the world of policing, especially in a city like Los Angeles, but it does a good job and comes close to the scale The Wire takes on. Tear jerking acting, top-notch plots and directing. The Shield to me and many others is right up there next to The Wire."
    },
    {
      "username": "jochemunlimited",
      "userUrl": "https://www.imdb.com/user/ur87919913",
      "reviewLink": "https://www.imdb.com/review/rw8112865",
      "warningSpoilers": false,
      "date": "3 May 2022",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Suddenly there was another level",
      "content": "I once saw this on television and then I bought some dvd set. I think 4 was not out. So I was very much surprised. The action was hard, the lives of the cops was hard, everything sucked. It is shot like a reality and everything is in your face. You see many bad things like what drugs is doing to people and their lives. And also a lot of things that are in the grey zone. Are they dirty cops?The acting is great, the shots are great, the scenery is great, the story is well written. But I managed to see till season 5 a few episoded. I bought the wrong dvd box, it was not subtitled. I can understand English, but I had everything in my own language. I tried a few times and also watched season 4 back. I tried also in different years, but I did not make it.It was not about the series, but I lost the story fromt he previous series so I wanted to start over but did not find the time. Maybe it will happen later on. But from what I know and saw and the memories I have many years later I can only give this a high score. I do not know what it will be when I look with the eye of the present."
    },
    {
      "username": "drunken_munki",
      "userUrl": "https://www.imdb.com/user/ur7733052",
      "reviewLink": "https://www.imdb.com/review/rw6126630",
      "warningSpoilers": false,
      "date": "26 September 2020",
      "rate": "10",
      "helpful": "17 out of 21 found this helpful.",
      "title": "The best cop show written and filmed to date.",
      "content": "Often you will hear people praise 'The Wire', another cop show aired at the same time as 'The Shield'; in my opinion this is the better show for several reasons. I still would recommend 'The Wire', but 'The Shield' offers more content with an excellent story that follows Vic and his corrupt line-crossing strike team.Consider that this show runs for 7 seasons, and in many people's opinions it is one of the shows that actually starts strong and gets better and better each season. The writing covers various real world topics and crime wrapped up into the daily cases for the murder police in 'The Barn', as well as coving the beat cops, and Vic's strike team.All the material covered is blended in together in a seamless way, similar to 'The Sopranos'; and also similarly to that show, Vic is the anti-hero who sinks deeper and deeper into his worst nightmare. The Shield offers the best ending of a show, period; and overall the show in my view is on par with 'The Sopranos'. It is slightly different, since it follows from the side of the police; although Vic in many regards is a criminal in his own right.I actually like the camera work in this show, sometimes it glides across; sometimes it feels like it is a fly on the wall; just catching a glimpse of a whispering conversation. I also really like the grittiness of the film and how it matches the content of the show perfectly.The acting is top-class, and there are various characters that will wind you up, make you laugh, make you sad, and sometimes sick to your stomach. The content is brutal sometimes, and the pacing of the show is fast. This is a show you have to pay attention to, missing a scene sometimes can throw you off pace with the story. That might put some off, but for me it is a different style to the slow burn shown in 'The Wire'. I feel that the team who created this show had mastered their art.I give it a perfect 10/10, as the 4th item out of only 8 that I rate that highly. It is worth a watch, alongside 'The Sopranos' -- though I have to admit that show is simply the best piece of cinema that has been created so far, with no exceptions."
    },
    {
      "username": "dk777",
      "userUrl": "https://www.imdb.com/user/ur80922659",
      "reviewLink": "https://www.imdb.com/review/rw8033171",
      "warningSpoilers": false,
      "date": "4 April 2022",
      "rate": "8",
      "helpful": "5 out of 5 found this helpful.",
      "title": "The Weight Of Justice",
      "content": "A series that shows us how to create complex and interesting characters.The plot revolves around a few characters, but mostly around Vic Mackey. Indeed, Vic Mackey is a truly layered and interesting character, his actions vary, sometimes horrible, questionable, and sometimes they make sense and actually help those who need it most.Partly a villain, partly a hero, Vic Mackey is a truly striking character. As events unfold, the show becomes more tense and the characters more interesting. Michael Chiklis is excellent in the role of Vic Mackey.We have a few interesting characters whose actions are hard to predict, and the cast portrayed them superbly. The script varies from very good to brilliant, today it is almost impossible to make such a complex series.Someone turns out to be a villain when we expect the least, and someone, despite all expectations, proves to be a hero when we think that he will turn out to be a villain. The plot sometimes takes place in unpredictable and interesting directions, which makes this series really interesting.The only complaint is the use of the so-called shaky camera, both when it is needed and when it is not needed. But, even with that flaw, the show is truly remarkable and the viewer quickly gets used to this way of shooting, although the series would have been even better if the way of directing was a little different. In the end, even that makes some sense.The characters are really complex, and through the plot we find out what drives them and what kind of people they are. The story is balanced, it is something we rarely see today.The action scenes are tense and brutal. The soundtrack is excellent and fits perfectly into the atmosphere of the show.A complex series that offers us a lot of great characters, a good cast and a tense story."
    },
    {
      "username": "axelpuri-1",
      "userUrl": "https://www.imdb.com/user/ur20744594",
      "reviewLink": "https://www.imdb.com/review/rw5934636",
      "warningSpoilers": false,
      "date": "25 July 2020",
      "rate": "10",
      "helpful": "34 out of 38 found this helpful.",
      "title": "Nothing like it",
      "content": "I know im late to the party but i just wanted to add my two cents. I have seen a lot of shows in my life from the Wire , breaking bad , sons of anarchy , downtown abbey to GOT and everything in between ( of-course not but definitely all the ones worth watching ) but The Shield has a special place in my heart. First it saw me through the corona virus lockdown and had me baited hook line and sinker like i have never been . I almost cried when it ended because i didn't want it to but also had me enthralled to the point that i couldn't wait to see what the next episode would bring .I think i cannot offer any compliments and praises that haven't been offered already . All i will say is it is like The Wire in treatment but with its own unique flavour. The writing is crisp , the hand held shooting gritty with each character addng a different dimension to the storyline. Each season brought with it a different commentary on all kinds of issues be it politics , family life, friendship, duty in the line of fire etcGive it a go and be prepared for one heck of a ride"
    },
    {
      "username": "goldendogs-84396",
      "userUrl": "https://www.imdb.com/user/ur102827428",
      "reviewLink": "https://www.imdb.com/review/rw8422902",
      "warningSpoilers": false,
      "date": "10 August 2022",
      "rate": "10",
      "helpful": "14 out of 14 found this helpful.",
      "title": "The best",
      "content": "This has to be the best homicide detective series I've seen. It differs from others in that each season builds on itself. The final season is the end of the story and it mounts to an incredible crescendo. Excellent series in every way!"
    },
    {
      "username": "Antagonisten",
      "userUrl": "https://www.imdb.com/user/ur0157498",
      "reviewLink": "https://www.imdb.com/review/rw1039257",
      "warningSpoilers": false,
      "date": "14 March 2005",
      "rate": "9",
      "helpful": "114 out of 188 found this helpful.",
      "title": "Amazing",
      "content": "I began watching \"The Shield\" mostly because of a coincidence. The Swedish movie channel \"Canal+\" usually rerun their shows 2-3 episodes at a time on Sundays. And it was one of those times, a Sunday with heavy snowfall and nothing to do, that i sat down and watched three episodes in a row. And instantly i was hooked.The thing that surprised me most about \"The Shield\" is the way that it's hugely exaggerated while at the same time feeling very realistic. The documentary style in which the series is filmed, as well as the solid acting of course contributes to this feeling. And to me it feels like a series that manages to seem realistic, no matter how unrealistic the events in the plot, is truly great TV. That it doesn't shun away from harsh themes or sensitive and sometimes even grotesque subjects only increases my respect for the script-writers and makers of this show.The characters are also mostly very interesting. I have already mentioned the actors, and i must stress again how well the casting is done here. This also adds to the characters that are portrayed admirably throughout.And one thing i know for certain. Watching Vic Mackey and the other more or less corrupt cops in \"The Barn\" balancing on the border (and sometimes slipping across it) has made shows like NYPD Blue feeling forever redundant. This is THE cop show to watch."
    },
    {
      "username": "vikingtales",
      "userUrl": "https://www.imdb.com/user/ur158152483",
      "reviewLink": "https://www.imdb.com/review/rw8866122",
      "warningSpoilers": true,
      "date": "11 February 2023",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Excellent TV even 20 years later",
      "content": "I watched the Shield on TV back when it was first shown and was blown away, with the acting, the dialogue, the interpersonal stuff, the filming, it was in my view revolutionary in 2002.I watched it again some years later, probably 2012,and was still just 10/10 out there, I've recently just re-watched the whole series, over a period of a couple of weeks, and it is still at the top of my ALL TIME favourite tv series even after 20 years, it brings real life gritty realism even after all this time,But and I have to be truthful here, seasons 1-6 get a 9/10, season 7 is just a little lacking, the series, IMHO, goes off the boil in Season 7, although the story plays out in S7, I feel the writers were left with no more bite in the story, and to then for Vic Mackey to screw over Ronnie, for his wife is just poor. When Ronnie was a solid partner and his wife Corinne was flaky at best.And at the end we witness, Vic doing a menial job job for ICE, which tbh he probably deserves after all the doggy stuff, but Ronnie ends up in jail, and he was the most solid of all 4 strike team member's, I guess no good deed goes unpunished."
    }
  ],
  "errorMessage": ""
}