{
  "imDbId": "tt0286486",
  "title": "The Shield",
  "fullTitle": "The Shield (TV Series 2002–2008)",
  "type": "TVSeries",
  "year": "2002",
  "language": "en",
  "titleInLanguage": "The Shield",
  "url": "https://en.wikipedia.org/wiki/The_Shield",
  "plotShort": {
    "plainText": "The Shield is an American crime drama television series starring Michael Chiklis that premiered on March 12, 2002, on FX in the United States, and concluded on November 25, 2008, after seven seasons. Known for its portrayal of corrupt police officers, it was originally advertised as Rampart in reference to the true-life Rampart Division police scandal, on which the show's Strike Team was loosely based. The series was created by Shawn Ryan and the Barn Productions for Fox Television Studios and Sony Pictures Television.\r\nSeveral notable actors took extended roles on the show, including Glenn Close, who was the female lead during the fourth season; Michael Peña, in season 4; Anthony Anderson, in seasons 4, 5, and 6; Forest Whitaker, who guest-starred in seasons 5 and 6; Laura Harring, in season 5; Franka Potente, in season 6; and Laurie Holden, in season 7.\r\nThe Shield is a prime example of TV noir in that it focuses on moral ambiguity, a salient feature to the noir aesthetic.\r\nThe series has received critical acclaim and is widely regarded as one of the greatest television series of all time. It won the Golden Globe Award for Best Television Series – Drama in 2002, and the final season won a 2008 AFI Award for best television series. Chiklis won both the Primetime Emmy Award and Golden Globe Award for Best Lead Actor in a Drama in 2002.",
    "html": "<p>The Shield is an American crime drama television series starring Michael Chiklis that premiered on March 12, 2002, on FX in the United States, and concluded on November 25, 2008, after seven seasons. Known for its portrayal of corrupt police officers, it was originally advertised as Rampart in reference to the true-life Rampart Division police scandal, on which the show's Strike Team was loosely based. The series was created by Shawn Ryan and the Barn Productions for Fox Television Studios and Sony Pictures Television.</p><p>Several notable actors took extended roles on the show, including Glenn Close, who was the female lead during the fourth season; Michael Peña, in season 4; Anthony Anderson, in seasons 4, 5, and 6; Forest Whitaker, who guest-starred in seasons 5 and 6; Laura Harring, in season 5; Franka Potente, in season 6; and Laurie Holden, in season 7.</p><p>The Shield is a prime example of TV noir in that it focuses on moral ambiguity, a salient feature to the noir aesthetic.</p><p>The series has received critical acclaim and is widely regarded as one of the greatest television series of all time. It won the Golden Globe Award for Best Television Series – Drama in 2002, and the final season won a 2008 AFI Award for best television series. Chiklis won both the Primetime Emmy Award and Golden Globe Award for Best Lead Actor in a Drama in 2002.</p>"
  },
  "plotFull": {
    "plainText": "The Shield is an American crime drama television series starring Michael Chiklis that premiered on March 12, 2002, on FX in the United States, and concluded on November 25, 2008, after seven seasons. Known for its portrayal of corrupt police officers, it was originally advertised as Rampart in reference to the true-life Rampart Division police scandal, on which the show's Strike Team was loosely based. The series was created by Shawn Ryan and the Barn Productions for Fox Television Studios and Sony Pictures Television.\r\nSeveral notable actors took extended roles on the show, including Glenn Close, who was the female lead during the fourth season; Michael Peña, in season 4; Anthony Anderson, in seasons 4, 5, and 6; Forest Whitaker, who guest-starred in seasons 5 and 6; Laura Harring, in season 5; Franka Potente, in season 6; and Laurie Holden, in season 7.\r\nThe Shield is a prime example of TV noir in that it focuses on moral ambiguity, a salient feature to the noir aesthetic.\r\nThe series has received critical acclaim and is widely regarded as one of the greatest television series of all time. It won the Golden Globe Award for Best Television Series – Drama in 2002, and the final season won a 2008 AFI Award for best television series. Chiklis won both the Primetime Emmy Award and Golden Globe Award for Best Lead Actor in a Drama in 2002.\r\nPremise\r\nThe Shield follows the activities of an experimental division of the Los Angeles Police Department set up in the fictional Farmington district (\"the Farm\") of Los Angeles, a district rife with gang-related violence, drug trafficking, and prostitution. Operating out of a converted church (\"the Barn\"), they work to maintain the peace in the district and reduce crime.\r\nAt the center of the division is the Strike Team, led by Detectives Vic Mackey, Shane Vendrell, Curtis Lemansky, and Ronnie Gardocki. Mackey and the Strike Team use criminal methods to coerce information and stage arrests and take a share of various drug busts. Although the Strike Team's questionably high success rate leaves the division's head, Captain David Aceveda, suspicious of their methods, he values their success as they help his political efforts to become mayor of Los Angeles.\r\nAttempts to place a fifth member on the Strike Team not in Mackey's circle go astray. The pilot episode concludes with Mackey, suspicious of the loyalty of the latest Strike Team recruit, Terry Crowley, fatally shooting him during an arrest and framing their suspect. This sets in motion events that loom over the Strike Team and continue throughout the series.\r\nThe show has an ensemble cast featuring the other officers in the Farmington district. This includes detectives Holland \"Dutch\" Wagenbach, Steve Billings and Claudette Wyms, uniformed officers Sgt. Danielle \"Danny\" Sofer, Julien Lowe, and Tina Hanlon. The series has a variety of subplots, notably Aceveda's political aspirations and his suffering a sexual assault; Mackey's struggle to cope with a failing marriage, two autistic children, and rebellious eldest daughter; Danny becoming a mother; Vendrell's rocky, new marriage; Lemansky's growing fear for the safety of the Strike Team; Claudette's battle with illness and Lowe's internal conflicts between his Christian beliefs and his homosexuality.\r\nThe Shield and the Strike Team were inspired by the Rampart Division Community Resources Against Street Hoodlums (CRASH) unit within the Los Angeles Police Department. Rampart was seriously considered as the series' name and was even used in some early promotional ads for the series.\r\nCharacters are portrayed with vices and virtues; Vic's loving relationship with his children contrasts with his thuggish approach to police work. Two of the many examples of Mackey's criminal and sociopathic behavior include an attempt to rob the \"Armenian Money Train\", a money laundering operation of the Armenian Mafia in season 2 and having a police dog maul a rape suspect.\r\nThe timeline of the seven seasons of the show covers approximately three years.\r\nSeries overview\r\nSeason 1\r\nSeason 1 premiered on March 12, 2002, and concluded on June 4, 2002, consisting of 13 episodes. The season deals with Mackey and Vendrell covering up their shooting of Terry Crowley, a plant on the Strike Team placed by David Aceveda and the Department of Justice who have been suspicious of the Strike Team's activities. Dutch believes a serial killer is targeting prostitutes. Lowe struggles with his sexual orientation and his Christian morals making him a target for blackmail. Sofer, who is having an affair with Mackey, finds herself both concerned and frustrated while training Lowe.\r\nSeason 2\r\nSeason 2 premiered on January 7, 2003, and concluded April 1, 2003, consisting of 13 episodes. The first half of the season deals with a new drug threat from Armadillo, a highly intelligent immigrant who has coerced the black and Hispanic gangs to work together, making it difficult for the Strike Team to charge him. The second half of the season deals with the Strike Team's discovery of the Armenian \"money train\" used to ship laundered money out of the United States. Mackey and the Strike Team successfully hijack the shipment, ending up with millions of dollars for themselves. Aceveda makes an agreement with Mackey to protect each other while Aceveda runs for city council. Claudette, whose own investigation into Armadillo is hampered by Mackey and Aceveda, is forced out of her passive role and prepares to take an active role as a moral leader. Dutch makes a major mistake in an investigation and begins second guessing himself. Lowe gets married but outed to the department by a former lover. Sofer finds herself becoming a pawn in Barn politics and begins to question the Strike Team's ethics.\r\nSeason 3\r\nSeason 3 premiered on March 9, 2004, and concluded on June 15, 2004, consisting of 15 episodes. The season deals with fallout from the money train robbery. Mackey learns that a portion of the money was marked by the Treasury Department, and the Strike Team figures out ways of diverting any federal attention to their activities. However, the tension of having the money gets to Lemansky, and in an off-the-cuff decision, burns most of the money before the others can stop him. This leads to the dissolution of the Strike Team. Dutch struggles to find balance while looking into both the money train robbery and a serial rapist. Claudette begins administrative duties in preparation to take over as Captain but her qualms over a potentially incompetent defense attorney put her career in jeopardy. After the fallout of being outed in the previous season, Lowe starts taking on a tougher demeanor making Claudette question his future.\r\nSeason 4\r\nSeason 4 premiered on March 15, 2005, and concluded on June 14, 2005, consisting of 13 episodes. During this season, the members of the Strike Team become involved with the affairs of Antwon Mitchell, a highly respected drug lord who ends up blackmailing Vendrell to coerce his help. Mackey, with the help of the new Barn Captain, Monica Rawling, manages to help Vendrell out of his situation, reunites the Strike Team, and eventually ends up with sufficient evidence to send Mitchell to jail. However, Rawling finds herself dismissed as Captain due to her approach of seizing any assets tied to drug money. Claudette and Dutch continue to be shut out of meaningful cases by the DA's office, forcing Dutch to make a backroom deal to save his and Claudette's careers. A rift forms between Lowe and Sofer over the seizures policy. Aceveda uses the seizures policy to get more power on the city council and ultimately push his own agenda.\r\nSeason 5\r\nSeason 5 premiered on January 10, 2006, and concluded on March 21, 2006, consisting of 11 episodes. The LAPD's Internal Affairs Division opens an investigation led by Lt. Jon Kavanaugh against Lemansky, purportedly for not reporting a stash of drugs he had taken, but in actuality to find evidence of the Strike Team's misdeeds. Mackey learns of Kavanaugh's true intent, and tries to humiliate Kavanaugh to show the investigation is personal. Enraged, Kavanaugh puts on more pressure and charges Lemansky. The Strike Team attempts to smuggle Lemansky out of the country, but Vendrell, fearing Lemansky will talk, kills him with a grenade, ending the investigation. Lowe trains Tina Hanlon but quickly believes she may not be cut out for the job. Dutch and Claudette focus on the serial killer they have no evidence against while it becomes clear Claudette's health is deteriorating. Billings' weak management coupled with Kavanaugh's strong-arm tactics force the LAPD chief to name a stronger and more independent Captain to the Barn, Claudette.\r\n\"Wins and Losses\"\r\nThe producers of The Shield produced a 15-minute \"promosode\", which premiered on Google on February 15, 2007, to bridge the gap between seasons 5 and 6. The episode focuses on the aftermath of Lemanksky's death, including his funeral and flashbacks as co-workers reflect upon his life. The episode was said to have cost between $500,000 and $1 million to produce. It was on bud.tv for four weeks and later released to AOL and other media outlets. The \"promosode\" is also one of the special features included on the season 5 DVD set.\r\nSeason 6\r\nSeason 6 premiered on April 3, 2007, and concluded on June 5, 2007, consisting of 10 episodes. The Strike Team struggles with Lemansky's death, and suspect one of the gangs committed it, while Vendrell remains quiet regarding his role. Kavanaugh continues his investigation outside of Internal Affairs, but is eventually forced to admit to planting evidence and is arrested. Mackey learns he is being forced into early retirement and tries to fight back by proving his value. Tensions on the Strike Team led Vendrell to admit to killing Lemansky, and knowing that Mackey will likely kill him, he turns to the Armenian mob for protection, only to expose the team's role in the money-train heist, putting their families at risk. Vendrell writes up all their crimes and mails duplicates to use as blackmail against Mackey. Claudette fights to keep the Barn from being shut down. Dutch tries to adjust to his new partnership with Billings and his crush on Hanlon. Sofer, recently promoted to Sergeant, tries to find balance being a working single mother. Lowe joins the Strike Team now under the command of Kevin Hiatt. Aceveda finds a strong financial backer who may be too good to be true.\r\nSeason 6 was originally intended to be aired as the second half of season 5, but FX decided to refer to these 10 episodes as season 6 instead.\r\nSeason 7\r\nSeason 7 premiered on September 2, 2008, and concluded on November 25, 2008, consisting of 13 episodes. Mackey and Aceveda discover the Mexican cartel is looking to influence Farmington, and work with ICE to take them down. Mackey also uses the opportunity to secure a position at ICE in exchange for immunity for his crimes on the Strike Team. The Barn gains significant evidence to arrest the Strike Team. Vendrell attempts to kill Mackey, but it goes awry, making him and his family fugitives. With no hold over Mackey, he kills himself and his family. Mackey successfully busts the cartel for ICE, but betrays Gardocki, who is arrested for the Strike Team's crimes. Though given an ICE job, Mackey is left to run a desk lest he goes against his terms and be arrested as well. Dutch focuses on a kid he is certain will become a serial killer. Sofer attempts to keep Mackey out of their son's life. Corrine, scared when she finally realizes everything Vic is, asks for Claudette's and Dutch's help. Claudette and Dutch make one final attempt to get evidence to arrest Mackey and the rest of the Strike Team, though ultimately fail to prosecute Vic. The series ends as Mackey, hearing sirens in the distance, takes his gun from his desk and heads out, his destination unknown.\r\nCast and characters\r\nMichael Chiklis as Vic Mackey – a corrupt police officer and for much of the series, leader of the Strike Team. Though effective at apprehending criminals, he has no qualms about using illegal or unethical methods, which include beating and torturing suspects, and planting evidence, tactics he regards as a means to an end. Mackey has committed several murders, including that of a police officer, Terry Crowley, which haunts him thereafter. He is perennially under investigation by his superiors, but the Machiavellian Mackey always eludes them; also, on occasions, they turn a blind eye to his tactics when they need him to crack a high-profile case. Mackey's marriage to Corinne, a nurse, failed because of his numerous infidelities (including with Officer Sofer, which resulted in a child). He and Corinne have three children, two with autism, which puts more strain on him. By Season 7, Mackey is effectively forced out of the LAPD. He cuts an immunity deal with ICE in return for confessing all his crimes, including Crowley's murder, implicating Shane Vendrell and Ronnie Gardocki. Mackey discovers that Corinne and the children have disappeared into the Witness Protection Program while, to his horror, his new job at ICE is a desk job. Though safe from prosecution, Mackey has lost his family and best friends and is now ostracized by his colleagues and forced to sit on the sidelines.\r\nCatherine Dent as Danielle \"Danny\" Sofer – a patrol officer who aspires to become a detective. She has an on-again-off-again sexual relationship with Vic and complicated history with Dutch. She is assigned desk duty as a result of her pregnancy and takes maternity leave after the birth of her son, Lee. The identity of the father was initially unknown; later, in the sixth-season episode \"Chasing Ghosts,\" it was learned that it was Vic. Shortly afterward, Danny returned from maternity leave early so that she could take the position of Sergeant at the Barn. In Season Seven Vic threatens to force Danny to take a paternity test.\r\nReed Diamond as Terry Crowley (season 1; guest: season 2) – an honest, fair, effective, and well-liked detective from the Robbery Division. When the Barn started operating, Aceveda brought Terry in to join the Strike Team to serve as a possible replacement for Vic if he failed as leader of the team. For some time, Terry was the Strike Team's driver. After realizing that his colleagues are all dirty, Terry approached Aceveda who asked him to spy on Vic and the team so that they may build a case against them. After delivering the usual news to Aceveda, Aceveda called an associate from the Justice Department and they asked Terry to testify against the team, in exchange Terry receives a higher-paid job in Washington, D.C., and other expenses. However, Vic learned (off-screen) about the deal through his mentor Assistant Chief Ben Gilroy. After Terry asks Vic to be involved in the team's big busts, he and the rest plan to raid the home of a drug dealer. During the raid, Vic takes the drug dealer's gun and shoots Terry in the face, killing him.\r\nWalton Goggins as Shane Vendrell – Vic Mackey's best friend and partner before the Strike Team was formed. He has a reckless streak, and his attempts to emulate Mackey's dealings quite often take a bad turn. Throughout the series, he meets and marries Mara, who later bears him a son, Jackson. When it appears that Lem has turned on the Strike Team, Vendrell kills him by dropping a grenade into his car. The ensuing guilt and grief force him to become reckless and suicidal, and when Mackey uncovers the truth, their friendship ends. Vendrell grows to regret his actions as part of the Strike Team and expresses great remorse for what he has become. When it is revealed that he blackmailed someone to kill Ronnie Gardocki in retaliation for Mackey and Gardocki's attempt to kill him, Vendrell goes on the run with his wife and son. However, Mackey's immunity deal with ICE ends Vendrell's hopes of sparing himself and Mara from long prison sentences by testifying against Mackey. He, therefore, poisons his son and pregnant wife and then kills himself. His suicide note, and photos of his family's corpses are shown to Vic by Claudette in a last-ditch effort to taunt him.\r\nMichael Jace as Julien Lowe – a uniformed officer who is partnered with Sofer for the majority of the series. During the formation of a new Strike Team, Claudette offered Julien to Kevin Hiatt as a possible addition to the team. Claudette made the offer to Julien, who was hesitant, mainly because of the thought of being partnered with Vic on a daily basis. After being assured that Mackey was going to be moved out of the team, Julien accepted the promotion. Despite his desire to become a fully functioning member of the Strike Team, Julien knew that he was on the outside of the clique. When the Strike Team is dissolved for the final time, he becomes a uniformed officer again. He is asked to choose which side he will be on when Claudette finally has a case to go after Mackey and Vendrell. A recurring plotline for Lowe is the conflict between his Christian beliefs and his homosexual desires.\r\nKenny Johnson as Curtis Lemansky (seasons 1–5) – a cop with a conscience and an original member of the Strike Team. He has a history of working with kids and maintaining a soft spot for them. His loyalty to Vic Mackey and the Strike Team led him to go along with most of their illegal schemes, although he did not know about all of them, such as the murder of Terry Crowley. He burned most of the money from the Armenian Money Train robbery to keep the team from getting caught. Burning the money caused a temporary split within the team, although they later got back together. Shane Vendrell kills Lemansky in the Season 5 finale, under the mistaken impression that Lemansky was going to rat on the rest of the team. Lem was unmarried and had no children.\r\nJay Karnes as Holland \"Dutch\" Wagenbach – a persistent and successful police detective, but is regarded as a pompous and socially inept nerd. He is often the butt of jokes at the Barn, particularly from Mackey. Along with his partner, Claudette Wyms, Dutch is the moral center of the show as a clean cop who does not engage in illegal activities. He shares a close friendship with Claudette and shows genuine concern for her after learning of her lupus diagnosis. Dutch is usually the first called to investigate violent crimes because he specializes in criminal profiling and serial killers. In Season 1 he receives an impromptu round of applause from everyone at the Barn, including Vic, after he painstakingly proves the guilt of a suspected serial killer. Later, he is seen strangling a live cat after questioning an actual serial killer about what he sees in his victims' eyes. Dutch is unsuccessful with women, but he does have several fleeting romances, including with Danny Sofer, and tries to ask out Tina Hanlon. He embarks on a seemingly vengeful relationship with Vic's ex-wife, which caused even more friction with Vic and leads to Dutch challenging him to a fight. Dutch's investigation into the Armenian money train heist and his suspicions that the Strike Team was involved eventually brought about the quartet's downfall.\r\nBenito Martinez as David Aceveda – a politically ambitious man who was the captain of the Barn from seasons one to three. He was then elected to the Los Angeles City Council and had ambitions to become Mayor. He is one of Vic Mackey's main rivals, although on occasions they forged uneasy alliances for their mutual benefit. In Season 3, Aceveda was orally raped at gunpoint by two gang members. He tracked down and killed one of his assailants, and struck a deal with drug lord Antwon Mitchell to have the other killed in prison. During the final season, Aceveda and Mackey worked together to bring down Cruz Pezuela, a corrupt businessman who initially bankrolled Aceveda's mayoral campaign and then tried to blackmail him with photographs of his sexual assault, before switching their target to Beltran, a cartel enforcer. At the series' close, Aceveda looked set to become Los Angeles' next mayor after taking credit for Beltran's arrest.\r\nCCH Pounder as Claudette Wyms – a veteran detective. Claudette, along with her partner Dutch, can be viewed as the voice of morality at the Barn; as a result, she is often at odds with Vic over his tactics. It emerges that Claudette has suffered from lupus for fifteen years and resents Dutch's subsequent over-protectiveness of her. Against the orders of her superiors, Claudette reopened cases overseen by a compromised public defender, which cost her promotion to Captain. She eventually got the job in season 5. As Captain, she did her best to marginalize Mackey and was determined to gather enough evidence to indict him. She was left furious upon discovering Mackey's generous immunity deal with the ICE. During the final season, her lupus returned and began to interfere with her ability to do her job. In the final episode, she admitted to Dutch that her illness is terminal. Despite being unable to prosecute Mackey, Claudette ultimately reveals Shane's suicide note to Vic and also orders Ronnie's arrest in front of him.\r\nCathy Cahlin Ryan as Corrine Mackey (main: seasons 5-7; recurring: seasons 1–3; also starring: season 4) – was once married to Vic Mackey and had three children with him, two of whom have autism. She works as a nurse and once had a brief courtship with Dutch. Despite needing Vic in her life, she eventually turns on him and helps Dutch and Claudette build a case to send Vic behind bars. She is moved to witness protection by ICE to keep her and her children away from Vic, fearing that he may try to harm her if he finds out she has collaborated with the police.\r\nDavid Rees Snell as Ronnie Gardocki (main: seasons 5-7; recurring: seasons 1–3; also starring: season 4) – the Strike Team's surveillance and electronics expert. Though little is known about Ronnie, he has proven to be the most solid, emotionally stable member of the Strike Team and has remained loyal to Vic out of enlightened self-interest, knowing that divisions between them would only lead to bad ends for both. The scars on his face, given to him by Armadillo in season 2, are proof of his loyalty to the team. In the final season, he becomes the official leader of the Strike Team. He was especially angry when he learned that Shane murdered Lem, and uneasy about working with Shane again. He and Vic concoct a plan to have the Mexicans kill Shane along with the Armenians that knew about the Money Train robbery. Shane survives and hires a pimp to kill Ronnie, which also fails. When Shane flees after being implicated, Claudette disbands the Strike Team, forcing Ronnie to become a \"suit and tie\" detective while trying to help Vic and stay out of prison. Vic makes an immunity deal with ICE in return for confessing all the Strike Team's crimes, and lies to Ronnie that he has been granted the same deal. Ronnie only discovers Vic's betrayal when he is arrested in the final episode and is led away, cursing Vic.\r\nGlenn Close as Monica Rawling (season 4) – the appointed Captain at the Barn who took over from Aceveda, after Claudette was rejected. She implemented several changes, such as fixing the Barn's male toilets and, more importantly, creating seizure policies which proved to be somewhat controversial. She had a longstanding hatred of gang leader Antwon Mitchell and was suspicious of Mackey, even having him and his team investigated. She finds out that Shane was solicited by Mitchell to kill Vic. She is fired after she embarrasses the DEA by voiding the immunity deal they granted Mitchell (by getting the Strike Team to catch a Salvadoran cartel leader before Mitchell's information could), and the feds threaten to cut off all federal highway funding to Los Angeles if Rawling stayed. She is mentioned, but not seen in subsequent seasons.\r\nDavid Marciano as Steve Billings (main: season 7; recurring: seasons 4–6) – a slack, somewhat cowardly detective who was made acting Captain after the departure of Rawling and later replaced by Claudette. Billings has an uneasy working relationship with Dutch, who dislikes his nonchalant attitude to the job. He and Dutch were partnered together after Claudette's promotion, which prompted Dutch to request a transfer, which was rejected. When he puts his mind to it, Billings is shown to be a competent detective, but he is mostly known for his schemes, such as bringing his own vending machines into the Barn. He usually brings Dutch in on his plots and the two have come to blows on at least one occasion. After being injured during a brawl between Kavanaugh and Vic, he tries to sue the department for $2 million, although he settles for two days' backpay.\r\nPaula Garcés as Tina Hanlon (main: season 7; recurring: seasons 5–6) – a recruit at the barn, who is trained by Julien. She is very attractive and well aware of her sexuality, which often earns her the ire of Danny Sofer. Tina's constant mistakes would have seen her out of the force had it not been for a bungle in which Billings while trying to see who was stealing from his vending machines, obtained photos of her changing clothes. He involved Dutch and, to protect her old partner, Claudette allowed Tina to remain on the force under Dutch's supervision. She left the Barn after being made a spokesperson for the police force, but opted to transfer back. She had a sexual tryst with Kevin Hiatt, which was organized by Billings, although she later expressed regret and said that Dutch always had a chance with her, only he never took it. The day on which Shane Vendrell killed himself was her first anniversary as an officer, and although he was harsh on her at times, Julien celebrates by buying her a cake and throwing her a little party.\r\nDevelopment\r\nThe series was created by Shawn Ryan. Ryan served as an executive producer for all seven seasons and was the series head writer and showrunner throughout its run. Prior to creating the series Ryan had been working as a producer and writer for the supernatural detective series Angel. He began his television career as a writer for the crime drama Nash Bridges. Nash Bridges was a more up-beat show, and Ryan was required to write scripts that showed the hero succeeding in a positive way, and Ryan sought to write something far different to get that out of his system. He had considered what a cop drama would be like on a premium cable network like HBO and Showtime, taking into account the edge that shows like Homicide: Life on the Street and NYPD Blue had brought to the genre. While trying to decide a direction, the Rampart scandal within the LAPD was exposed, and Ryan took inspiration from those events to craft out a pilot script. He also recently became a father, and wrote into the script his concerns about raising a child in a crime-ridden world. The pilot script had ended with Mackey shooting Crowley; Ryan had the idea of an alternate ending to Donnie Brasco, of where Al Pacino's mobster character would have shot Johnny Depp's undercover FBI character, revealing that the mobster had known his identity all along. He used this ending idea in the pilot for The Shield, not expecting to have to worry about any consequences as he was not sure the script would be picked up. Ryan later commented in 2017 that if he had known how long The Shield would have run for, he would have had a few more episodes to help establish Crowley's character before having Mackey kill him off.\r\nAt the time, around the year 2000, the FX network, a division under 21st Century Fox, was looking to find what would be the network's first drama series to help set the tone for their network, given the ongoing success of The Sopranos on rival network HBO. FX's Kevin Reilly wanted a show about an antihero but believed that the cop genre had become tired. However, Reilly was amazed by Ryan's script, and greenlit the show in mid-2001. Reilly worked with Ryan to help determine how much violence and nudity could be used within the show, as unlike HBO, FX was an ad-sponsored cable channel and beholden to certain content considerations. As they were working towards this, the September 11 attacks occurred, and in their aftermath, Fox was concerned if the show would be appropriate at this time, believing that audiences would not be receptive to seeing police officers portrayed in a negative light. The situation changed following the theatrical release of Training Day in October 2001, a film centered around corrupt cops that was a financial success. Fox was assured by Training Day's reception from audiences that The Shield was allowed to continue, with the pilot first broadcast in March 2002.\r\nRyan had written the part of Mackey for someone with a young Harrison Ford personality. Due to the complexities of the character, he was uncertain they would have found a suitable actor for the role, and cast his own doubt on his writing. During casting, Ryan had been surprised with Michael Chiklis's audition. Chiklis had gained a soft reputation within Hollywood based on his roles from The Commish and Daddio, and felt that he needed to have a change of pace in future roles, as he was finding himself cast for older, overweight parts. Chiklis spent six months away from acting and losing a significant amount of weight, and for his audition on The Shield, had shaved his head. Ryan was taken by this new appearance feeling it was not appropriate, but found that Chiklis had a certain charisma in his delivery that worked well into the Mackey character. This allowed Ryan to write Mackey as a compassionate figure, able to get away with certain improper actions through his charisma, which served to draw fans to sympathize with Mackey throughout the series. Ryan recognized that with Chiklis as his star, it validated his success as a writer.\r\nScott Brazil was a co-executive producer for the first season. He became an executive producer for the second season. He was a regular director for the series until his death during production of the sixth season. Brazil and Ryan had worked together on Nash Bridges.\r\nSeveral of the series more junior writers became executive producers during its run. Glen Mazzara was an executive story editor for the first season and became an executive producer from the fifth season onwards. Mazzara had also worked with Ryan on Nash Bridges. Kurt Sutter and Scott Rosenbaum were staff writers for the first season and became executive producers for the sixth season onwards. Adam E. Fierro joined the crew as a co-producer and writer for the third season and was promoted to executive producer for the seventh season. Veteran television writer Charles H. Eglee joined the crew as a consulting producer for the third season and was promoted to executive producer from the fifth season onwards.\r\nEmmy Award-winning The Sopranos veteran James Manos Jr. served as a consulting producer and writer for the first two seasons. He left the show to develop the Showtime serial killer drama Dexter. NYPD Blue veteran writer Kevin Arkadie was a co-executive producer for the first season only. Nash Bridges writer and producer Reed Steiner replaced Arkadie as co-executive producer for the second season only. Kevin G. Cremin was the series unit production manager throughout its run and became a co-executive producer from the sixth season onwards.\r\nAngel writing team Elizabeth Craft and Sarah Fain joined the crew as co-producers for the third season and became supervising producers before leaving at the close of the sixth season. Dean White was a producer and regular director throughout the series run. Chiklis became a producer from the second season onwards and also regularly directed episodes. Post-production supervisor Craig Yahata joined the crew in the third season and eventually became a producer for the seventh season.\r\nThe series pilot and finale were directed by Clark Johnson; Johnson had previously starred in Homicide: Life on the Street and made his directing debut on that series. Guy Ferland directed episodes for all seven seasons of The Shield. Rohn Schmidt was a cinematographer for all seven seasons and made his television directing debut on the show. Stephen Kay was a frequent director for the series. Gwyneth Horder-Payton was an assistant director for the show's early seasons and made her television directing debut in the fourth season, she continued to regularly direct episodes thereafter.\r\nFilm director Frank Darabont directed an episode for the series. Darabont later reunited with several writers from The Shield for his television adaptation of The Walking Dead comics, including Charles H. Eglee, Glen Mazzara and Adam Fierro. Acclaimed playwright and film writer and director David Mamet directed an episode of the series. Mamet and Ryan collaborated as executive producers on military thriller The Unit. Screenwriter Ted Griffin (Oceans Eleven) wrote a single episode of the show. Griffin later created Terriers and was reunited with Shawn Ryan as a fellow executive producer. The series started with real Los Angeles Police Officers as Technical Advisors; Officers Pablo Vitar and Rafael Dagnesses.\r\nReception\r\nTime magazine's James Poniewozik ranked The Shield #8 in his list of the Top 10 Returning Series of 2007 and later included it in his list of the top 100 greatest TV shows of all time. Entertainment Weekly named it the 8th-best TV show of the 2000s, saying, \"Det. Vic Mackey didn't just clean up the streets—he cleaned up on the streets. Would he pay for those sins? This gutsy TV drama kept us guessing.\" On the review aggregator website Metacritic, season 1 received high acclaim from critics, with a score of 92 out of 100, based on 28 reviews. Season 7 also received high acclaim from critics, with a score of 85 out of 100, based on 14 reviews. In September 2019, The Guardian ranked the show 77th on its list of the 100 best TV shows of the 21st century, stating that \"a key part...of the golden age of antihero drama, this thriller about likable – and utterly corrupt – cops broke new ground for bold, risk-taking television\".\r\nAwards and nominations\r\nThe series received six Primetime Emmy Award nominations during its series run. For the first season, Michael Chiklis won for Outstanding Lead Actor in a Drama Series, and the pilot episode received nominations for Outstanding Writing for a Drama Series and Outstanding Directing for a Drama Series, for Shawn Ryan and Clark Johnson respectively. Chiklis received a consecutive nomination Outstanding Lead Actor in a Drama Series for the second season. For the fourth season, Glenn Close was nominated for Outstanding Lead Actress in a Drama Series and CCH Pounder was nominated for Outstanding Supporting Actress in a Drama Series.\r\nFor the Golden Globe Awards, the series received five nominations, with Chiklis receiving three consecutive nominations for Best Performance by an Actor in a Television Series – Drama, and winning the award for the first season. The first season also earned the series the award for Best Drama Series. Glenn Close was also nominated for Best Performance by an Actress in a Television Series – Drama.\r\nFor the Satellite Awards, the series received seven nominations. CCH Pounder won two consecutive times for Best Performance by an Actress in a Television Series – Drama, Chiklis received two nominations with one win for Best Performance by an Actor in a Television Series – Drama, and Forest Whitaker was nominated for Best Supporting Actor in a Series, Miniseries or Motion Picture Made for Television. The series won the award for Best Television Drama Series and received a nomination for that category the following year.\r\nFor the Television Critics Association Awards, the first season received nominations for Outstanding New Program of the Year, Outstanding Achievement in Drama, and Program of the Year, and Chiklis won for Individual Achievement in Drama. The series received nominations again for Outstanding Achievement in Drama for the next two seasons. For the final season, it was nominated for Outstanding Achievement in Drama and Program of the Year, as well as receiving the Heritage Award. Also, Walton Goggins was nominated for Individual Achievement in Drama.\r\nOther awards and nominations include a 2005 Peabody Award and Chiklis being nominated for a Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Drama Series for the first season.\r\nOther media\r\nComic\r\nIn 2004, IDW Publishing released a five-issue comic book limited series written by Jeff Mariotte and illustrated by Jean Diaz titled The Shield: Spotlight. A controversial journalist is murdered and the Barn is under intense media scrutiny. Vic and the Strike Team find the murderer but uncover a bigger conspiracy which has Dutch enthralled. All the while, Shane is trying to keep his face out of the media when he accidentally sets up a chance to earn the team much money recovering stolen art, and Julien and Danny struggle to realize when is the right time to go \"by the book\" and when is not. When uniformed officers spot the Strike Team with the stolen art, they have no choice but to do things the right way. Aceveda is warned to drop the journalists investigation or risk losing political backing. He drops the case which leaves Dutch feeling disheartened.\r\nHome media\r\nThe first five seasons were originally distributed by 20th Century Fox Home Entertainment for region 1. However, in 2008, Sony Pictures Home Entertainment became the rights holders for the DVDs. They released season 6 and re-released seasons 1–5 in slimmer packaging in 2008, and released season 7 in 2009. International releases have always been distributed by Sony, who have only ever presented the show in 16:9 (widescreen) format, as opposed to the Fox releases, which presented the show in 4:3. All the re-releases by Sony along with seasons 6 and 7, and the complete series box set are presented in widescreen. The Sony region 2 release of season 5 has a shortened version of the season finale—48 minutes, as opposed to the regular 67-minute version.\r\nIn November 2012, all seven seasons were made available for purchase on iTunes. On February 26, 2013, Amazon.com announced the addition of the series to its Prime service, but the series is now only available for purchase. The series is available for streaming on Hulu as part of FX's catalog. All seven seasons are available on Netflix throughout Latin America.\r\nOn August 28, 2015, Shawn Ryan announced that he was revisiting the series for a 4K conversion. In August 2017, Ryan announced the release had been delayed until 2018. In July 2018, Mill Creek Entertainment announced it would be releasing the complete series of The Shield on Blu-ray and that it would include all the extras from the previous DVD sets and includes new, exclusive featurettes. It was released on December 18, 2018.\r\nSoundtrack\r\nOn September 5, 2005, The Shield: Music from the Streets was released by Lakeshore Entertainment. The soundtrack features 19 tracks, including two versions of the theme song and tracks ranging from artists such as Black Label Society to Kelis.\r\nVideo game\r\nAfter a rocky development cycle, The Shield, the video game, was released for the PlayStation 2 on January 9, 2007, and for the PC on January 22, 2007. It is a third-person shooter that bridges the gap between the third and fourth seasons by exploring the gang war between the Byz-Lats and the One-Niners. It received generally negative reviews.",
    "html": "<p>The Shield is an American crime drama television series starring Michael Chiklis that premiered on March 12, 2002, on FX in the United States, and concluded on November 25, 2008, after seven seasons. Known for its portrayal of corrupt police officers, it was originally advertised as Rampart in reference to the true-life Rampart Division police scandal, on which the show's Strike Team was loosely based. The series was created by Shawn Ryan and the Barn Productions for Fox Television Studios and Sony Pictures Television.</p><p>Several notable actors took extended roles on the show, including Glenn Close, who was the female lead during the fourth season; Michael Peña, in season 4; Anthony Anderson, in seasons 4, 5, and 6; Forest Whitaker, who guest-starred in seasons 5 and 6; Laura Harring, in season 5; Franka Potente, in season 6; and Laurie Holden, in season 7.</p><p>The Shield is a prime example of TV noir in that it focuses on moral ambiguity, a salient feature to the noir aesthetic.</p><p>The series has received critical acclaim and is widely regarded as one of the greatest television series of all time. It won the Golden Globe Award for Best Television Series – Drama in 2002, and the final season won a 2008 AFI Award for best television series. Chiklis won both the Primetime Emmy Award and Golden Globe Award for Best Lead Actor in a Drama in 2002.</p><br/><h3>Premise</h3><p>The Shield follows the activities of an experimental division of the Los Angeles Police Department set up in the fictional Farmington district (\"the Farm\") of Los Angeles, a district rife with gang-related violence, drug trafficking, and prostitution. Operating out of a converted church (\"the Barn\"), they work to maintain the peace in the district and reduce crime.</p><p>At the center of the division is the Strike Team, led by Detectives Vic Mackey, Shane Vendrell, Curtis Lemansky, and Ronnie Gardocki. Mackey and the Strike Team use criminal methods to coerce information and stage arrests and take a share of various drug busts. Although the Strike Team's questionably high success rate leaves the division's head, Captain David Aceveda, suspicious of their methods, he values their success as they help his political efforts to become mayor of Los Angeles.</p><p>Attempts to place a fifth member on the Strike Team not in Mackey's circle go astray. The pilot episode concludes with Mackey, suspicious of the loyalty of the latest Strike Team recruit, Terry Crowley, fatally shooting him during an arrest and framing their suspect. This sets in motion events that loom over the Strike Team and continue throughout the series.</p><p>The show has an ensemble cast featuring the other officers in the Farmington district. This includes detectives Holland \"Dutch\" Wagenbach, Steve Billings and Claudette Wyms, uniformed officers Sgt. Danielle \"Danny\" Sofer, Julien Lowe, and Tina Hanlon. The series has a variety of subplots, notably Aceveda's political aspirations and his suffering a sexual assault; Mackey's struggle to cope with a failing marriage, two autistic children, and rebellious eldest daughter; Danny becoming a mother; Vendrell's rocky, new marriage; Lemansky's growing fear for the safety of the Strike Team; Claudette's battle with illness and Lowe's internal conflicts between his Christian beliefs and his homosexuality.</p><p>The Shield and the Strike Team were inspired by the Rampart Division Community Resources Against Street Hoodlums (CRASH) unit within the Los Angeles Police Department. Rampart was seriously considered as the series' name and was even used in some early promotional ads for the series.</p><p>Characters are portrayed with vices and virtues; Vic's loving relationship with his children contrasts with his thuggish approach to police work. Two of the many examples of Mackey's criminal and sociopathic behavior include an attempt to rob the \"Armenian Money Train\", a money laundering operation of the Armenian Mafia in season 2 and having a police dog maul a rape suspect.</p><p>The timeline of the seven seasons of the show covers approximately three years.</p><br/><h3>Series overview</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 12, 2002</td><td style=\"padding:0 8px\">June 4, 2002</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 7, 2003</td><td style=\"padding:0 8px\">April 1, 2003</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">15</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 9, 2004</td><td style=\"padding:0 8px\">June 15, 2004</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 15, 2005</td><td style=\"padding:0 8px\">June 14, 2005</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">11</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 10, 2006</td><td style=\"padding:0 8px\">March 21, 2006</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 3, 2007</td><td style=\"padding:0 8px\">June 5, 2007</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>7</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 2, 2008</td><td style=\"padding:0 8px\">November 25, 2008</td></tr></tbody></table><h4>Season 1</h4><p>Season 1 premiered on March 12, 2002, and concluded on June 4, 2002, consisting of 13 episodes. The season deals with Mackey and Vendrell covering up their shooting of Terry Crowley, a plant on the Strike Team placed by David Aceveda and the Department of Justice who have been suspicious of the Strike Team's activities. Dutch believes a serial killer is targeting prostitutes. Lowe struggles with his sexual orientation and his Christian morals making him a target for blackmail. Sofer, who is having an affair with Mackey, finds herself both concerned and frustrated while training Lowe.</p><h4>Season 2</h4><p>Season 2 premiered on January 7, 2003, and concluded April 1, 2003, consisting of 13 episodes. The first half of the season deals with a new drug threat from Armadillo, a highly intelligent immigrant who has coerced the black and Hispanic gangs to work together, making it difficult for the Strike Team to charge him. The second half of the season deals with the Strike Team's discovery of the Armenian \"money train\" used to ship laundered money out of the United States. Mackey and the Strike Team successfully hijack the shipment, ending up with millions of dollars for themselves. Aceveda makes an agreement with Mackey to protect each other while Aceveda runs for city council. Claudette, whose own investigation into Armadillo is hampered by Mackey and Aceveda, is forced out of her passive role and prepares to take an active role as a moral leader. Dutch makes a major mistake in an investigation and begins second guessing himself. Lowe gets married but outed to the department by a former lover. Sofer finds herself becoming a pawn in Barn politics and begins to question the Strike Team's ethics.</p><h4>Season 3</h4><p>Season 3 premiered on March 9, 2004, and concluded on June 15, 2004, consisting of 15 episodes. The season deals with fallout from the money train robbery. Mackey learns that a portion of the money was marked by the Treasury Department, and the Strike Team figures out ways of diverting any federal attention to their activities. However, the tension of having the money gets to Lemansky, and in an off-the-cuff decision, burns most of the money before the others can stop him. This leads to the dissolution of the Strike Team. Dutch struggles to find balance while looking into both the money train robbery and a serial rapist. Claudette begins administrative duties in preparation to take over as Captain but her qualms over a potentially incompetent defense attorney put her career in jeopardy. After the fallout of being outed in the previous season, Lowe starts taking on a tougher demeanor making Claudette question his future.</p><h4>Season 4</h4><p>Season 4 premiered on March 15, 2005, and concluded on June 14, 2005, consisting of 13 episodes. During this season, the members of the Strike Team become involved with the affairs of Antwon Mitchell, a highly respected drug lord who ends up blackmailing Vendrell to coerce his help. Mackey, with the help of the new Barn Captain, Monica Rawling, manages to help Vendrell out of his situation, reunites the Strike Team, and eventually ends up with sufficient evidence to send Mitchell to jail. However, Rawling finds herself dismissed as Captain due to her approach of seizing any assets tied to drug money. Claudette and Dutch continue to be shut out of meaningful cases by the DA's office, forcing Dutch to make a backroom deal to save his and Claudette's careers. A rift forms between Lowe and Sofer over the seizures policy. Aceveda uses the seizures policy to get more power on the city council and ultimately push his own agenda.</p><h4>Season 5</h4><p>Season 5 premiered on January 10, 2006, and concluded on March 21, 2006, consisting of 11 episodes. The LAPD's Internal Affairs Division opens an investigation led by Lt. Jon Kavanaugh against Lemansky, purportedly for not reporting a stash of drugs he had taken, but in actuality to find evidence of the Strike Team's misdeeds. Mackey learns of Kavanaugh's true intent, and tries to humiliate Kavanaugh to show the investigation is personal. Enraged, Kavanaugh puts on more pressure and charges Lemansky. The Strike Team attempts to smuggle Lemansky out of the country, but Vendrell, fearing Lemansky will talk, kills him with a grenade, ending the investigation. Lowe trains Tina Hanlon but quickly believes she may not be cut out for the job. Dutch and Claudette focus on the serial killer they have no evidence against while it becomes clear Claudette's health is deteriorating. Billings' weak management coupled with Kavanaugh's strong-arm tactics force the LAPD chief to name a stronger and more independent Captain to the Barn, Claudette.</p><h4>\"Wins and Losses\"</h4><p>The producers of The Shield produced a 15-minute \"promosode\", which premiered on Google on February 15, 2007, to bridge the gap between seasons 5 and 6. The episode focuses on the aftermath of Lemanksky's death, including his funeral and flashbacks as co-workers reflect upon his life. The episode was said to have cost between $500,000 and $1 million to produce. It was on bud.tv for four weeks and later released to AOL and other media outlets. The \"promosode\" is also one of the special features included on the season 5 DVD set.</p><h4>Season 6</h4><p>Season 6 premiered on April 3, 2007, and concluded on June 5, 2007, consisting of 10 episodes. The Strike Team struggles with Lemansky's death, and suspect one of the gangs committed it, while Vendrell remains quiet regarding his role. Kavanaugh continues his investigation outside of Internal Affairs, but is eventually forced to admit to planting evidence and is arrested. Mackey learns he is being forced into early retirement and tries to fight back by proving his value. Tensions on the Strike Team led Vendrell to admit to killing Lemansky, and knowing that Mackey will likely kill him, he turns to the Armenian mob for protection, only to expose the team's role in the money-train heist, putting their families at risk. Vendrell writes up all their crimes and mails duplicates to use as blackmail against Mackey. Claudette fights to keep the Barn from being shut down. Dutch tries to adjust to his new partnership with Billings and his crush on Hanlon. Sofer, recently promoted to Sergeant, tries to find balance being a working single mother. Lowe joins the Strike Team now under the command of Kevin Hiatt. Aceveda finds a strong financial backer who may be too good to be true.</p><p>Season 6 was originally intended to be aired as the second half of season 5, but FX decided to refer to these 10 episodes as season 6 instead.</p><h4>Season 7</h4><p>Season 7 premiered on September 2, 2008, and concluded on November 25, 2008, consisting of 13 episodes. Mackey and Aceveda discover the Mexican cartel is looking to influence Farmington, and work with ICE to take them down. Mackey also uses the opportunity to secure a position at ICE in exchange for immunity for his crimes on the Strike Team. The Barn gains significant evidence to arrest the Strike Team. Vendrell attempts to kill Mackey, but it goes awry, making him and his family fugitives. With no hold over Mackey, he kills himself and his family. Mackey successfully busts the cartel for ICE, but betrays Gardocki, who is arrested for the Strike Team's crimes. Though given an ICE job, Mackey is left to run a desk lest he goes against his terms and be arrested as well. Dutch focuses on a kid he is certain will become a serial killer. Sofer attempts to keep Mackey out of their son's life. Corrine, scared when she finally realizes everything Vic is, asks for Claudette's and Dutch's help. Claudette and Dutch make one final attempt to get evidence to arrest Mackey and the rest of the Strike Team, though ultimately fail to prosecute Vic. The series ends as Mackey, hearing sirens in the distance, takes his gun from his desk and heads out, his destination unknown.</p><br/><h3>Cast and characters</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th rowspan=\"2\">Character</th><th rowspan=\"2\">Portrayed by</th><th colspan=\"7\">Seasons</th></tr><tr><th style=\"width:10%;\">1</th><th style=\"width:10%;\">2</th><th style=\"width:10%;\">3</th><th style=\"width:10%;\">4</th><th style=\"width:10%;\">5</th><th style=\"width:10%;\">6</th><th style=\"width:10%;\">7</th></tr><tr><td><span>Vic Mackey</span></td><td><span>Michael Chiklis</span></td><td colspan=\"7\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><td><span class=\"mw-redirect\">Danielle \"Danny\" Sofer</span></td><td><span>Catherine Dent</span></td><td colspan=\"7\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><td><span>Terry Crowley</span></td><td><span>Reed Diamond</span></td><td style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td><td style=\"background: #DEF; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Guest</span></td><td colspan=\"5\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td></tr><tr><td><span class=\"mw-redirect\">Shane Vendrell</span></td><td><span>Walton Goggins</span></td><td colspan=\"7\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><td><span class=\"mw-redirect\">Julien Lowe</span></td><td><span>Michael Jace</span></td><td colspan=\"7\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><td><span class=\"mw-redirect\">Curtis \"Lem\" Lemansky</span></td><td><span>Kenny Johnson</span></td><td colspan=\"5\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td><td colspan=\"2\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td></tr><tr><td><span class=\"mw-redirect\">Holland \"Dutch\" Wagenbach</span></td><td><span>Jay Karnes</span></td><td colspan=\"7\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><td><span class=\"mw-redirect\">David Aceveda</span></td><td><span>Benito Martinez</span></td><td colspan=\"7\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><td><span class=\"mw-redirect\">Claudette Wyms</span></td><td><span>CCH Pounder</span></td><td colspan=\"7\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><td><span class=\"mw-redirect\">Ronnie Gardocki</span></td><td><span>David Rees Snell</span></td><td colspan=\"3\" style=\"background: #FFE3E3; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Recurring</span></td><td colspan=\"1\" style=\"background: #FFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Also starring</td><td colspan=\"3\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><td><span>Corrine Mackey</span></td><td><span>Cathy Cahlin Ryan</span></td><td colspan=\"3\" style=\"background: #FFE3E3; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Recurring</span></td><td colspan=\"1\" style=\"background: #FFD; vertical-align: middle; text-align: center;\" class=\"table-cast\">Also starring</td><td colspan=\"3\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><td><span class=\"mw-redirect\">Monica Rawling</span></td><td><span>Glenn Close</span></td><td colspan=\"3\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td><td style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td><td colspan=\"3\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td></tr><tr><td><span>Steve Billings</span></td><td><span>David Marciano</span></td><td colspan=\"3\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td><td colspan=\"3\" style=\"background: #FFE3E3; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Recurring</span></td><td style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><td><span>Tina Hanlon</span></td><td><span>Paula Garcés</span></td><td colspan=\"4\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td><td colspan=\"2\" style=\"background: #FFE3E3; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Recurring</span></td><td style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr></tbody></table><ul><li>Michael Chiklis as Vic Mackey – a corrupt police officer and for much of the series, leader of the Strike Team. Though effective at apprehending criminals, he has no qualms about using illegal or unethical methods, which include beating and torturing suspects, and planting evidence, tactics he regards as a means to an end. Mackey has committed several murders, including that of a police officer, Terry Crowley, which haunts him thereafter. He is perennially under investigation by his superiors, but the Machiavellian Mackey always eludes them; also, on occasions, they turn a blind eye to his tactics when they need him to crack a high-profile case. Mackey's marriage to Corinne, a nurse, failed because of his numerous infidelities (including with Officer Sofer, which resulted in a child). He and Corinne have three children, two with autism, which puts more strain on him. By Season 7, Mackey is effectively forced out of the LAPD. He cuts an immunity deal with ICE in return for confessing all his crimes, including Crowley's murder, implicating Shane Vendrell and Ronnie Gardocki. Mackey discovers that Corinne and the children have disappeared into the Witness Protection Program while, to his horror, his new job at ICE is a desk job. Though safe from prosecution, Mackey has lost his family and best friends and is now ostracized by his colleagues and forced to sit on the sidelines.</li><li>Catherine Dent as Danielle \"Danny\" Sofer – a patrol officer who aspires to become a detective. She has an on-again-off-again sexual relationship with Vic and complicated history with Dutch. She is assigned desk duty as a result of her pregnancy and takes maternity leave after the birth of her son, Lee. The identity of the father was initially unknown; later, in the sixth-season episode \"Chasing Ghosts,\" it was learned that it was Vic. Shortly afterward, Danny returned from maternity leave early so that she could take the position of Sergeant at the Barn. In Season Seven Vic threatens to force Danny to take a paternity test.</li><li>Reed Diamond as Terry Crowley (season 1; guest: season 2) – an honest, fair, effective, and well-liked detective from the Robbery Division. When the Barn started operating, Aceveda brought Terry in to join the Strike Team to serve as a possible replacement for Vic if he failed as leader of the team. For some time, Terry was the Strike Team's driver. After realizing that his colleagues are all dirty, Terry approached Aceveda who asked him to spy on Vic and the team so that they may build a case against them. After delivering the usual news to Aceveda, Aceveda called an associate from the Justice Department and they asked Terry to testify against the team, in exchange Terry receives a higher-paid job in Washington, D.C., and other expenses. However, Vic learned (off-screen) about the deal through his mentor Assistant Chief Ben Gilroy. After Terry asks Vic to be involved in the team's big busts, he and the rest plan to raid the home of a drug dealer. During the raid, Vic takes the drug dealer's gun and shoots Terry in the face, killing him.</li><li>Walton Goggins as Shane Vendrell – Vic Mackey's best friend and partner before the Strike Team was formed. He has a reckless streak, and his attempts to emulate Mackey's dealings quite often take a bad turn. Throughout the series, he meets and marries Mara, who later bears him a son, Jackson. When it appears that Lem has turned on the Strike Team, Vendrell kills him by dropping a grenade into his car. The ensuing guilt and grief force him to become reckless and suicidal, and when Mackey uncovers the truth, their friendship ends. Vendrell grows to regret his actions as part of the Strike Team and expresses great remorse for what he has become. When it is revealed that he blackmailed someone to kill Ronnie Gardocki in retaliation for Mackey and Gardocki's attempt to kill him, Vendrell goes on the run with his wife and son. However, Mackey's immunity deal with ICE ends Vendrell's hopes of sparing himself and Mara from long prison sentences by testifying against Mackey. He, therefore, poisons his son and pregnant wife and then kills himself. His suicide note, and photos of his family's corpses are shown to Vic by Claudette in a last-ditch effort to taunt him.</li><li>Michael Jace as Julien Lowe – a uniformed officer who is partnered with Sofer for the majority of the series. During the formation of a new Strike Team, Claudette offered Julien to Kevin Hiatt as a possible addition to the team. Claudette made the offer to Julien, who was hesitant, mainly because of the thought of being partnered with Vic on a daily basis. After being assured that Mackey was going to be moved out of the team, Julien accepted the promotion. Despite his desire to become a fully functioning member of the Strike Team, Julien knew that he was on the outside of the clique. When the Strike Team is dissolved for the final time, he becomes a uniformed officer again. He is asked to choose which side he will be on when Claudette finally has a case to go after Mackey and Vendrell. A recurring plotline for Lowe is the conflict between his Christian beliefs and his homosexual desires.</li><li>Kenny Johnson as Curtis Lemansky (seasons 1–5) – a cop with a conscience and an original member of the Strike Team. He has a history of working with kids and maintaining a soft spot for them. His loyalty to Vic Mackey and the Strike Team led him to go along with most of their illegal schemes, although he did not know about all of them, such as the murder of Terry Crowley. He burned most of the money from the Armenian Money Train robbery to keep the team from getting caught. Burning the money caused a temporary split within the team, although they later got back together. Shane Vendrell kills Lemansky in the Season 5 finale, under the mistaken impression that Lemansky was going to rat on the rest of the team. Lem was unmarried and had no children.</li><li>Jay Karnes as Holland \"Dutch\" Wagenbach – a persistent and successful police detective, but is regarded as a pompous and socially inept nerd. He is often the butt of jokes at the Barn, particularly from Mackey. Along with his partner, Claudette Wyms, Dutch is the moral center of the show as a clean cop who does not engage in illegal activities. He shares a close friendship with Claudette and shows genuine concern for her after learning of her lupus diagnosis. Dutch is usually the first called to investigate violent crimes because he specializes in criminal profiling and serial killers. In Season 1 he receives an impromptu round of applause from everyone at the Barn, including Vic, after he painstakingly proves the guilt of a suspected serial killer. Later, he is seen strangling a live cat after questioning an actual serial killer about what he sees in his victims' eyes. Dutch is unsuccessful with women, but he does have several fleeting romances, including with Danny Sofer, and tries to ask out Tina Hanlon. He embarks on a seemingly vengeful relationship with Vic's ex-wife, which caused even more friction with Vic and leads to Dutch challenging him to a fight. Dutch's investigation into the Armenian money train heist and his suspicions that the Strike Team was involved eventually brought about the quartet's downfall.</li><li>Benito Martinez as David Aceveda – a politically ambitious man who was the captain of the Barn from seasons one to three. He was then elected to the Los Angeles City Council and had ambitions to become Mayor. He is one of Vic Mackey's main rivals, although on occasions they forged uneasy alliances for their mutual benefit. In Season 3, Aceveda was orally raped at gunpoint by two gang members. He tracked down and killed one of his assailants, and struck a deal with drug lord Antwon Mitchell to have the other killed in prison. During the final season, Aceveda and Mackey worked together to bring down Cruz Pezuela, a corrupt businessman who initially bankrolled Aceveda's mayoral campaign and then tried to blackmail him with photographs of his sexual assault, before switching their target to Beltran, a cartel enforcer. At the series' close, Aceveda looked set to become Los Angeles' next mayor after taking credit for Beltran's arrest.</li><li>CCH Pounder as Claudette Wyms – a veteran detective. Claudette, along with her partner Dutch, can be viewed as the voice of morality at the Barn; as a result, she is often at odds with Vic over his tactics. It emerges that Claudette has suffered from lupus for fifteen years and resents Dutch's subsequent over-protectiveness of her. Against the orders of her superiors, Claudette reopened cases overseen by a compromised public defender, which cost her promotion to Captain. She eventually got the job in season 5. As Captain, she did her best to marginalize Mackey and was determined to gather enough evidence to indict him. She was left furious upon discovering Mackey's generous immunity deal with the ICE. During the final season, her lupus returned and began to interfere with her ability to do her job. In the final episode, she admitted to Dutch that her illness is terminal. Despite being unable to prosecute Mackey, Claudette ultimately reveals Shane's suicide note to Vic and also orders Ronnie's arrest in front of him.</li><li>Cathy Cahlin Ryan as Corrine Mackey (main: seasons 5-7; recurring: seasons 1–3; also starring: season 4) – was once married to Vic Mackey and had three children with him, two of whom have autism. She works as a nurse and once had a brief courtship with Dutch. Despite needing Vic in her life, she eventually turns on him and helps Dutch and Claudette build a case to send Vic behind bars. She is moved to witness protection by ICE to keep her and her children away from Vic, fearing that he may try to harm her if he finds out she has collaborated with the police.</li><li>David Rees Snell as Ronnie Gardocki (main: seasons 5-7; recurring: seasons 1–3; also starring: season 4) – the Strike Team's surveillance and electronics expert. Though little is known about Ronnie, he has proven to be the most solid, emotionally stable member of the Strike Team and has remained loyal to Vic out of enlightened self-interest, knowing that divisions between them would only lead to bad ends for both. The scars on his face, given to him by Armadillo in season 2, are proof of his loyalty to the team. In the final season, he becomes the official leader of the Strike Team. He was especially angry when he learned that Shane murdered Lem, and uneasy about working with Shane again. He and Vic concoct a plan to have the Mexicans kill Shane along with the Armenians that knew about the Money Train robbery. Shane survives and hires a pimp to kill Ronnie, which also fails. When Shane flees after being implicated, Claudette disbands the Strike Team, forcing Ronnie to become a \"suit and tie\" detective while trying to help Vic and stay out of prison. Vic makes an immunity deal with ICE in return for confessing all the Strike Team's crimes, and lies to Ronnie that he has been granted the same deal. Ronnie only discovers Vic's betrayal when he is arrested in the final episode and is led away, cursing Vic.</li><li>Glenn Close as Monica Rawling (season 4) – the appointed Captain at the Barn who took over from Aceveda, after Claudette was rejected. She implemented several changes, such as fixing the Barn's male toilets and, more importantly, creating seizure policies which proved to be somewhat controversial. She had a longstanding hatred of gang leader Antwon Mitchell and was suspicious of Mackey, even having him and his team investigated. She finds out that Shane was solicited by Mitchell to kill Vic. She is fired after she embarrasses the DEA by voiding the immunity deal they granted Mitchell (by getting the Strike Team to catch a Salvadoran cartel leader before Mitchell's information could), and the feds threaten to cut off all federal highway funding to Los Angeles if Rawling stayed. She is mentioned, but not seen in subsequent seasons.</li><li>David Marciano as Steve Billings (main: season 7; recurring: seasons 4–6) – a slack, somewhat cowardly detective who was made acting Captain after the departure of Rawling and later replaced by Claudette. Billings has an uneasy working relationship with Dutch, who dislikes his nonchalant attitude to the job. He and Dutch were partnered together after Claudette's promotion, which prompted Dutch to request a transfer, which was rejected. When he puts his mind to it, Billings is shown to be a competent detective, but he is mostly known for his schemes, such as bringing his own vending machines into the Barn. He usually brings Dutch in on his plots and the two have come to blows on at least one occasion. After being injured during a brawl between Kavanaugh and Vic, he tries to sue the department for $2 million, although he settles for two days' backpay.</li><li>Paula Garcés as Tina Hanlon (main: season 7; recurring: seasons 5–6) – a recruit at the barn, who is trained by Julien. She is very attractive and well aware of her sexuality, which often earns her the ire of Danny Sofer. Tina's constant mistakes would have seen her out of the force had it not been for a bungle in which Billings while trying to see who was stealing from his vending machines, obtained photos of her changing clothes. He involved Dutch and, to protect her old partner, Claudette allowed Tina to remain on the force under Dutch's supervision. She left the Barn after being made a spokesperson for the police force, but opted to transfer back. She had a sexual tryst with Kevin Hiatt, which was organized by Billings, although she later expressed regret and said that Dutch always had a chance with her, only he never took it. The day on which Shane Vendrell killed himself was her first anniversary as an officer, and although he was harsh on her at times, Julien celebrates by buying her a cake and throwing her a little party.</li></ul><br/><h3>Development</h3><p>The series was created by Shawn Ryan. Ryan served as an executive producer for all seven seasons and was the series head writer and showrunner throughout its run. Prior to creating the series Ryan had been working as a producer and writer for the supernatural detective series Angel. He began his television career as a writer for the crime drama Nash Bridges. Nash Bridges was a more up-beat show, and Ryan was required to write scripts that showed the hero succeeding in a positive way, and Ryan sought to write something far different to get that out of his system. He had considered what a cop drama would be like on a premium cable network like HBO and Showtime, taking into account the edge that shows like Homicide: Life on the Street and NYPD Blue had brought to the genre. While trying to decide a direction, the Rampart scandal within the LAPD was exposed, and Ryan took inspiration from those events to craft out a pilot script. He also recently became a father, and wrote into the script his concerns about raising a child in a crime-ridden world. The pilot script had ended with Mackey shooting Crowley; Ryan had the idea of an alternate ending to Donnie Brasco, of where Al Pacino's mobster character would have shot Johnny Depp's undercover FBI character, revealing that the mobster had known his identity all along. He used this ending idea in the pilot for The Shield, not expecting to have to worry about any consequences as he was not sure the script would be picked up. Ryan later commented in 2017 that if he had known how long The Shield would have run for, he would have had a few more episodes to help establish Crowley's character before having Mackey kill him off.</p><p>At the time, around the year 2000, the FX network, a division under 21st Century Fox, was looking to find what would be the network's first drama series to help set the tone for their network, given the ongoing success of The Sopranos on rival network HBO. FX's Kevin Reilly wanted a show about an antihero but believed that the cop genre had become tired. However, Reilly was amazed by Ryan's script, and greenlit the show in mid-2001. Reilly worked with Ryan to help determine how much violence and nudity could be used within the show, as unlike HBO, FX was an ad-sponsored cable channel and beholden to certain content considerations. As they were working towards this, the September 11 attacks occurred, and in their aftermath, Fox was concerned if the show would be appropriate at this time, believing that audiences would not be receptive to seeing police officers portrayed in a negative light. The situation changed following the theatrical release of Training Day in October 2001, a film centered around corrupt cops that was a financial success. Fox was assured by Training Day's reception from audiences that The Shield was allowed to continue, with the pilot first broadcast in March 2002.</p><p>Ryan had written the part of Mackey for someone with a young Harrison Ford personality. Due to the complexities of the character, he was uncertain they would have found a suitable actor for the role, and cast his own doubt on his writing. During casting, Ryan had been surprised with Michael Chiklis's audition. Chiklis had gained a soft reputation within Hollywood based on his roles from The Commish and Daddio, and felt that he needed to have a change of pace in future roles, as he was finding himself cast for older, overweight parts. Chiklis spent six months away from acting and losing a significant amount of weight, and for his audition on The Shield, had shaved his head. Ryan was taken by this new appearance feeling it was not appropriate, but found that Chiklis had a certain charisma in his delivery that worked well into the Mackey character. This allowed Ryan to write Mackey as a compassionate figure, able to get away with certain improper actions through his charisma, which served to draw fans to sympathize with Mackey throughout the series. Ryan recognized that with Chiklis as his star, it validated his success as a writer.</p><p>Scott Brazil was a co-executive producer for the first season. He became an executive producer for the second season. He was a regular director for the series until his death during production of the sixth season. Brazil and Ryan had worked together on Nash Bridges.</p><p>Several of the series more junior writers became executive producers during its run. Glen Mazzara was an executive story editor for the first season and became an executive producer from the fifth season onwards. Mazzara had also worked with Ryan on Nash Bridges. Kurt Sutter and Scott Rosenbaum were staff writers for the first season and became executive producers for the sixth season onwards. Adam E. Fierro joined the crew as a co-producer and writer for the third season and was promoted to executive producer for the seventh season. Veteran television writer Charles H. Eglee joined the crew as a consulting producer for the third season and was promoted to executive producer from the fifth season onwards.</p><p>Emmy Award-winning The Sopranos veteran James Manos Jr. served as a consulting producer and writer for the first two seasons. He left the show to develop the Showtime serial killer drama Dexter. NYPD Blue veteran writer Kevin Arkadie was a co-executive producer for the first season only. Nash Bridges writer and producer Reed Steiner replaced Arkadie as co-executive producer for the second season only. Kevin G. Cremin was the series unit production manager throughout its run and became a co-executive producer from the sixth season onwards.</p><p>Angel writing team Elizabeth Craft and Sarah Fain joined the crew as co-producers for the third season and became supervising producers before leaving at the close of the sixth season. Dean White was a producer and regular director throughout the series run. Chiklis became a producer from the second season onwards and also regularly directed episodes. Post-production supervisor Craig Yahata joined the crew in the third season and eventually became a producer for the seventh season.</p><p>The series pilot and finale were directed by Clark Johnson; Johnson had previously starred in Homicide: Life on the Street and made his directing debut on that series. Guy Ferland directed episodes for all seven seasons of The Shield. Rohn Schmidt was a cinematographer for all seven seasons and made his television directing debut on the show. Stephen Kay was a frequent director for the series. Gwyneth Horder-Payton was an assistant director for the show's early seasons and made her television directing debut in the fourth season, she continued to regularly direct episodes thereafter.</p><p>Film director Frank Darabont directed an episode for the series. Darabont later reunited with several writers from The Shield for his television adaptation of The Walking Dead comics, including Charles H. Eglee, Glen Mazzara and Adam Fierro. Acclaimed playwright and film writer and director David Mamet directed an episode of the series. Mamet and Ryan collaborated as executive producers on military thriller The Unit. Screenwriter Ted Griffin (Oceans Eleven) wrote a single episode of the show. Griffin later created Terriers and was reunited with Shawn Ryan as a fellow executive producer. The series started with real Los Angeles Police Officers as Technical Advisors; Officers Pablo Vitar and Rafael Dagnesses.</p><br/><h3>Reception</h3><p>Time magazine's James Poniewozik ranked The Shield #8 in his list of the Top 10 Returning Series of 2007 and later included it in his list of the top 100 greatest TV shows of all time. Entertainment Weekly named it the 8th-best TV show of the 2000s, saying, \"Det. Vic Mackey didn't just clean up the streets—he cleaned up on the streets. Would he pay for those sins? This gutsy TV drama kept us guessing.\" On the review aggregator website Metacritic, season 1 received high acclaim from critics, with a score of 92 out of 100, based on 28 reviews. Season 7 also received high acclaim from critics, with a score of 85 out of 100, based on 14 reviews. In September 2019, The Guardian ranked the show 77th on its list of the 100 best TV shows of the 21st century, stating that \"a key part...of the golden age of antihero drama, this thriller about likable – and utterly corrupt – cops broke new ground for bold, risk-taking television\".</p><br/><h3>Awards and nominations</h3><p>The series received six Primetime Emmy Award nominations during its series run. For the first season, Michael Chiklis won for Outstanding Lead Actor in a Drama Series, and the pilot episode received nominations for Outstanding Writing for a Drama Series and Outstanding Directing for a Drama Series, for Shawn Ryan and Clark Johnson respectively. Chiklis received a consecutive nomination Outstanding Lead Actor in a Drama Series for the second season. For the fourth season, Glenn Close was nominated for Outstanding Lead Actress in a Drama Series and CCH Pounder was nominated for Outstanding Supporting Actress in a Drama Series.</p><p>For the Golden Globe Awards, the series received five nominations, with Chiklis receiving three consecutive nominations for Best Performance by an Actor in a Television Series – Drama, and winning the award for the first season. The first season also earned the series the award for Best Drama Series. Glenn Close was also nominated for Best Performance by an Actress in a Television Series – Drama.</p><p>For the Satellite Awards, the series received seven nominations. CCH Pounder won two consecutive times for Best Performance by an Actress in a Television Series – Drama, Chiklis received two nominations with one win for Best Performance by an Actor in a Television Series – Drama, and Forest Whitaker was nominated for Best Supporting Actor in a Series, Miniseries or Motion Picture Made for Television. The series won the award for Best Television Drama Series and received a nomination for that category the following year.</p><p>For the Television Critics Association Awards, the first season received nominations for Outstanding New Program of the Year, Outstanding Achievement in Drama, and Program of the Year, and Chiklis won for Individual Achievement in Drama. The series received nominations again for Outstanding Achievement in Drama for the next two seasons. For the final season, it was nominated for Outstanding Achievement in Drama and Program of the Year, as well as receiving the Heritage Award. Also, Walton Goggins was nominated for Individual Achievement in Drama.</p><p>Other awards and nominations include a 2005 Peabody Award and Chiklis being nominated for a Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Drama Series for the first season.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Association</th><th>Award</th><th>Nominee</th><th>Result</th></tr><tr><td rowspan=\"3\">2002</td><td rowspan=\"3\"><span class=\"mw-redirect\">Primetime Emmy Awards</span></td><td><span>Primetime Emmy Award for Outstanding Lead Actor in a Drama Series</span></td><td>Michael Chiklis</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Primetime Emmy Award for Outstanding Directing for a Drama Series</span></td><td>Clark Johnson</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Primetime Emmy Award for Outstanding Writing for a Drama Series</span></td><td>Shawn Ryan</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"8\">2003</td><td><span>Image Awards</span></td><td>Image Award for Outstanding Actress in a Drama Series</td><td>CCH Pounder</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Satellite Awards</span></td><td><span>Satellite Award for Best Actor – Television Series Drama</span></td><td>Michael Chiklis</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Satellite Award for Best Actress – Television Series Drama</span></td><td>CCH Pounder</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Golden Globe Awards</span></td><td><span>Golden Globe Award for Best Television Series – Drama</span></td><td><i>The Shield</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Golden Globe Award for Best Actor – Television Series Drama</span></td><td>Michael Chiklis</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Primetime Emmy Awards</span></td><td><span>Primetime Emmy Award for Outstanding Lead Actor in a Drama Series</span></td><td>Michael Chiklis</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>GLAAD Media Awards</span></td><td>GLAAD Media Award for Outstanding Drama Series</td><td><i>The Shield</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Screen Actors Guild Awards</span></td><td><span>Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Drama Series</span></td><td>Michael Chiklis</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"5\">2004</td><td><span class=\"mw-redirect\">Golden Globe Awards</span></td><td><span>Golden Globe Award for Best Actor – Television Series Drama</span></td><td>Michael Chiklis</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>Satellite Awards</span></td><td><span>Satellite Award for Best Television Series – Drama</span></td><td><i>The Shield</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Satellite Award for Best Actor – Television Series Drama</span></td><td>Michael Chiklis</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Satellite Award for Best Actress – Television Series Drama</span></td><td>CCH Pounder</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Image Awards</span></td><td>Image Award for Outstanding Actress in a Drama Series</td><td>CCH Pounder</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"6\">2005</td><td><span>AFI Award</span></td><td>AFI Award for TV Program of the Year</td><td><i>The Shield</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Satellite Awards</span></td><td><span>Satellite Award for Best Television Series – Drama</span></td><td><i>The Shield</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Golden Globe Awards</span></td><td><span>Golden Globe Award for Best Actor – Television Series Drama</span></td><td>Michael Chiklis</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Primetime Emmy Awards</span></td><td><span>Primetime Emmy Award for Outstanding Lead Actress in a Drama Series</span></td><td>Glenn Close</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Primetime Emmy Award for Outstanding Supporting Actress in a Drama Series</span></td><td>CCH Pounder</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Peabody Awards</span></td><td>Area of Excellence</td><td><i>The Shield</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"5\">2006</td><td><span>ALMA Awards</span></td><td>ALMA Award for Outstanding Supporting Actor in a Drama Series</td><td>Benito Martinez</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Image Awards</span></td><td>Image Award for Outstanding Actress in a Drama Series</td><td>CCH Pounder</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Image Award for Outstanding Directing in a Dramatic Series</td><td>Philip G. Atwell</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Satellite Awards</span></td><td><span>Satellite Award for Best Supporting Actor – Series, Miniseries or Television Film</span></td><td><span>Forest Whitaker</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Golden Globe Awards</span></td><td><span>Golden Globe Award for Best Actor – Television Series Drama</span></td><td>Michael Chiklis</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\">2007</td><td><span>ALMA Awards</span></td><td>ALMA Award for Outstanding Supporting Actor in a Drama Series</td><td>Benito Martinez</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Image Awards</span></td><td>Image Award for Outstanding Actress in a Drama Series</td><td>CCH Pounder</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\">2008</td><td rowspan=\"2\"><span>ALMA Awards</span></td><td>ALMA Award for Outstanding Actor in a Drama Series</td><td>Benito Martinez</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>ALMA Award for Outstanding Actress in a Drama Series</td><td>Paula Garcés</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Image Awards</span></td><td>Image Award for Outstanding Actress in a Drama Series</td><td>CCH Pounder</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\">2009</td><td><span>AFI Award</span></td><td>AFI Award for TV Program of the Year</td><td><i>The Shield</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Image Awards</span></td><td>Image Award for Outstanding Actress in a Drama Series</td><td>CCH Pounder</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>ALMA Awards</span></td><td>ALMA Award for Outstanding Actor in a Drama Series</td><td>Benito Martinez</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>ALMA Award for Outstanding Actress in a Drama Series</td><td>Paula Garcés</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><br/><h3>Other media</h3><h4>Comic</h4><p>In 2004, IDW Publishing released a five-issue comic book limited series written by Jeff Mariotte and illustrated by Jean Diaz titled The Shield: Spotlight. A controversial journalist is murdered and the Barn is under intense media scrutiny. Vic and the Strike Team find the murderer but uncover a bigger conspiracy which has Dutch enthralled. All the while, Shane is trying to keep his face out of the media when he accidentally sets up a chance to earn the team much money recovering stolen art, and Julien and Danny struggle to realize when is the right time to go \"by the book\" and when is not. When uniformed officers spot the Strike Team with the stolen art, they have no choice but to do things the right way. Aceveda is warned to drop the journalists investigation or risk losing political backing. He drops the case which leaves Dutch feeling disheartened.</p><h4>Home media</h4><p>The first five seasons were originally distributed by 20th Century Fox Home Entertainment for region 1. However, in 2008, Sony Pictures Home Entertainment became the rights holders for the DVDs. They released season 6 and re-released seasons 1–5 in slimmer packaging in 2008, and released season 7 in 2009. International releases have always been distributed by Sony, who have only ever presented the show in 16:9 (widescreen) format, as opposed to the Fox releases, which presented the show in 4:3. All the re-releases by Sony along with seasons 6 and 7, and the complete series box set are presented in widescreen. The Sony region 2 release of season 5 has a shortened version of the season finale—48 minutes, as opposed to the regular 67-minute version.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th rowspan=\"2\">DVD title</th><th colspan=\"4\">Release dates</th></tr><tr><th><span>Region</span> 1 (Fox)</th><th>Region 1 (Sony Pictures)</th><th>Region 2</th><th>Region 4</th></tr><tr><td>The Complete First Season</td><td>January 7, 2003</td><td>March 25, 2008</td><td>July 21, 2003</td><td>February 11, 2004</td></tr><tr><td>The Complete Second Season</td><td>January 6, 2004</td><td>March 25, 2008</td><td>August 9, 2004</td><td>April 5, 2005</td></tr><tr><td>The Complete Third Season</td><td>February 22, 2005</td><td>March 25, 2008</td><td>May 28, 2007</td><td>May 11, 2007</td></tr><tr><td>The Complete Fourth Season</td><td>December 26, 2005</td><td>March 25, 2008</td><td>July 2, 2007</td><td>November 15, 2007</td></tr><tr><td>The Complete Fifth Season</td><td>March 27, 2007</td><td>March 25, 2008</td><td>January 28, 2008</td><td>March 10, 2009</td></tr><tr><td>The Complete Sixth Season</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>August 26, 2008</td><td>March 24, 2008</td><td>August 18, 2009</td></tr><tr><td>The Complete Seventh Season</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>June 9, 2009</td><td>June 8, 2009</td><td>November 24, 2010</td></tr><tr><td>The Complete Series</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>November 3, 2009</td><td>June 8, 2009</td><td>November 23, 2010</td></tr></tbody></table><p>In November 2012, all seven seasons were made available for purchase on iTunes. On February 26, 2013, Amazon.com announced the addition of the series to its Prime service, but the series is now only available for purchase. The series is available for streaming on Hulu as part of FX's catalog. All seven seasons are available on Netflix throughout Latin America.</p><p>On August 28, 2015, Shawn Ryan announced that he was revisiting the series for a 4K conversion. In August 2017, Ryan announced the release had been delayed until 2018. In July 2018, Mill Creek Entertainment announced it would be releasing the complete series of The Shield on Blu-ray and that it would include all the extras from the previous DVD sets and includes new, exclusive featurettes. It was released on December 18, 2018.</p><h4>Soundtrack</h4><p>On September 5, 2005, The Shield: Music from the Streets was released by Lakeshore Entertainment. The soundtrack features 19 tracks, including two versions of the theme song and tracks ranging from artists such as Black Label Society to Kelis.</p><h4>Video game</h4><p>After a rocky development cycle, The Shield, the video game, was released for the PlayStation 2 on January 9, 2007, and for the PC on January 22, 2007. It is a third-person shooter that bridges the gap between the third and fourth seasons by exploring the gang war between the Byz-Lats and the One-Niners. It received generally negative reviews.</p><br/>"
  },
  "errorMessage": ""
}