{
  "imDbId": "tt0264235",
  "title": "Curb Your Enthusiasm",
  "fullTitle": "Curb Your Enthusiasm (TV Series 2000– )",
  "type": "TVSeries",
  "year": "2000",
  "items": [
    {
      "username": "film-critic",
      "userUrl": "https://www.imdb.com/user/ur1601212",
      "reviewLink": "https://www.imdb.com/review/rw0940555",
      "warningSpoilers": false,
      "date": "2 October 2004",
      "rate": "",
      "helpful": "196 out of 225 found this helpful.",
      "title": "He's a victim of circumstance.",
      "content": "Larry David, king of awkward moments and co-creator of the hit television series Seinfeld, has come back to television at full force. His hit series, Curb Your Enthusiasm, is a further extension of his life. Seinfeld has ended, his co-creator name has earned him about $200 million and growing, and his life is just getting excited. On these thirty minute trips, we follow Larry through moments with his wife Cheryl and manager Jeff. Circumstance continues to happen and Larry somehow always happens to be in the middle.To say this is exactly like Seinfeld would be like saying chocolate tastes exactly like vanilla. These two shows are night and day, while others will compare the actions of Larry to that of Jerry, there one crucial element that divides them. Larry's show, Curb Your Enthusiasm, seems a bit more realistic. Seinfeld was a great show, don't get me wrong possibly one of the best live-action series ever, but there was always that question of reality with Seinfeld. Where did Kramer get his money? How was George never put in jail? And so forth. With Larry's new show, he explores those possibilities. We know he is wealthy, he is playing himself and that is why he is able to not work. I would go so far as to say this first season is a dark representation of Seinfeld. Imagine if Seinfeld was released on HBO, how different of a show it would have been. Well, now Larry has that platform to really explore all opportunities and he does with his hilarious show.If you are a fan of awkward silences and coincidences with surprising results you will love this show. I am not sure if die-hard Seinfeld fans will love this program, but I sure did and I have seen every episode of Seinfeld at least twenty times. I will have to warn you, this is yet another show about nothing that just works. I just finished watching my favorite episode with the 'elevator courtesy' and his infamous fight with Richard Lewis (who plays his best friend).Overall, this is a very funny show that I hope remains true to itself and consistent throughout the seasons. I love Larry David's humor, and while it may not be for everyone, I do find that it is very realistic. It will open your eyes to the strange, odd world in which we live.Grade: ***** out of *****"
    },
    {
      "username": "glgioia",
      "userUrl": "https://www.imdb.com/user/ur0970606",
      "reviewLink": "https://www.imdb.com/review/rw0764681",
      "warningSpoilers": false,
      "date": "26 June 2003",
      "rate": "",
      "helpful": "238 out of 272 found this helpful.",
      "title": "Seinfeld Rated R",
      "content": "So what does Larry David do for an encore after the incredibly successful sitcom that detailed his experiences as a stand up in NY, he creates a new sitcom about his experiences as a very succesful creator of said show, post cancellation, living the good life with a ton of dough out in Malibu. Sounds pretty boring, and even snotty right? Its not at all. Like the rest of us, I loved Seinfeld, and still love the reruns. But I gotta say, this show is better. It's the same basic premise, which I guess is to turn a standup monologue into a situation comedy. In other words, instead of having a guy on stage telling jokes about the amusing and annoying happenstances of every day life, you create a format comedy, and use these anecdotes to weave together a plot. What made Seinfeld memorable was the clever way in which everything all in the end tied up in a nice little package. If you notice, that's a common laugh getter for stand-ups, to inject a joke they made earlier in their set and put it into practical anecdotal demonstration. You are right if you are thinking this is complete hogwash and hyper-analyzation of something not meant to be studied as such, but there it is. Having said all of that, I think CYE is the logical next step for fans of the Seinfeld show. It's the advanced course if you will of the more remedial network show. The freedom of HBO allows for obviously more adult material and language, but also for pure artistic expression. A lot of what goes on is definitely not palatable to the mainstream, and I could honestly see people hating it. Not me. I think its a rare chance to see genius, unfettered and uncensored. Yes Larry David was George Costanza or vice versa, but through this series, you also see he was Kramer, Elaine and Jerry. For some reason I totally relate to his inability to relate to everyone else, including his wife. Its often way too contrived, but I love it. If you were a fan of Seinfeld for the reasons I've mentioned, and not just for the run of the mill laugh track jokes, you will be missing something special if you don't give these a shot."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8191996",
      "warningSpoilers": false,
      "date": "31 May 2022",
      "rate": "9",
      "helpful": "42 out of 45 found this helpful.",
      "title": "Laugh Out Loud Funny!",
      "content": "Curb Your Enthusiasm is easily one of my all-time favorite comedies! It has stayed ridiculously funny throughout its entire run and has been just as funny as Seinfeld (which is saying something because Seinfeld is an all-time great). If you don't find this show funny then something is wrong with you. It's hilarious! Larry David is just a flat out genius, he's responsible for two of the funniest shows ever created in Curb Your Enthusiasm and Seinfeld!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8574415",
      "warningSpoilers": false,
      "date": "28 September 2022",
      "rate": "9",
      "helpful": "39 out of 42 found this helpful.",
      "title": "Larry David is a genius!",
      "content": "What can you say about Curb Your Enthusiasm that hasn't already been said? This doesn't have a laugh track and doesn't rely on corny one liners to make it funny. There will never be another Seinfeld but this comes awfully close. Every interaction, every conversation will make you laugh out loud. It's easily one of my all-time favorite comedies! It hooked me during season 1 and never let go. It has stayed ridiculously funny throughout its entire run and has been almost as good as Seinfeld (which is saying something because Seinfeld is also an all-time great). If you don't find this show funny then that's on you because it's freaking hilarious! Larry David is just a flat out genius, he's responsible for two of the funniest shows ever created in Curb Your Enthusiasm and Seinfeld!"
    },
    {
      "username": "MovieMarauder",
      "userUrl": "https://www.imdb.com/user/ur0672120",
      "reviewLink": "https://www.imdb.com/review/rw0764659",
      "warningSpoilers": false,
      "date": "6 October 2002",
      "rate": "",
      "helpful": "410 out of 452 found this helpful.",
      "title": "Some People Just Aren't Getting It...",
      "content": "I think too many people are looking to this show as a Seinfeld spin-off. The truth is, it's not, and you have to take the show for what it truly is. Larry David, in his great comedic brilliance, is not trying to glorify himself with this show, you can tell that just from watching one episode. Instead, he is really utilizing a caricature of a rich, whipped, neurotic yuppie to skewer the image of life at the top. His character (even though he is essentially playing himself), bumbles, complains, talks himself into painful situations, and is ultimately served devilishly funny comeuppance from episode to episode. This self-deprecating humor wouldn't work for anybody else, but for a guy like Larry David, this material works perfectly, because he seems so easy to laugh at (and I have a feeling this is hardly accidental, which is why his comedy is truly brilliant.) I really have to marvel at the idea of anyone NOT being able to laugh at this show. It's the greatest comedic take on life and the human condition that has ever been captured on film. All other television comedies of this era pale in comparison. \"Curb Your Enthusiasm\" is possibly the salvation of true comedy TV, in an age when good television comedies are few and far between."
    },
    {
      "username": "tkdlifemagazine",
      "userUrl": "https://www.imdb.com/user/ur88886235",
      "reviewLink": "https://www.imdb.com/review/rw8054461",
      "warningSpoilers": false,
      "date": "12 April 2022",
      "rate": "9",
      "helpful": "23 out of 25 found this helpful.",
      "title": "The Best Parts of 'Seinfeld\"",
      "content": "I was never a fanatic of Seinfeld when it was in first run; however, I did like it. Larry David's foray into the world of cable and the device of using his Seinfeld success to create a show around the real George Costanza is nothing short of brilliant. The show is cringeworthy at times but always entertaining and always very funny. The characters, like in Seinfeld, are rich and laughable. Larry manages to carry the show but he leaves so much room for so many people to shine- from Jeff Garland to Susie Essman to the terrific JB Smooth. Is this really Larry? Is this scripted or free form? Is this how Hollywood and TV really functions? I am not sure and do not care. I just know its funny and original and I am glad it is coming back for more."
    },
    {
      "username": "jotix100",
      "userUrl": "https://www.imdb.com/user/ur1406078",
      "reviewLink": "https://www.imdb.com/review/rw1157967",
      "warningSpoilers": false,
      "date": "25 August 2005",
      "rate": "10",
      "helpful": "128 out of 165 found this helpful.",
      "title": "Arrest your eagerness!",
      "content": "There are few men working on television today that rival the wit, the insight, or the genius of Larry David. To compare \"Curb Your Enthusiasm\" to \"Seinfeld\" is preposterous. With \"Curb Your Enthusiasm\", Larry David has created one of the greatest comedic series one have ever seen on American television. Fortunately for us, we got hooked right away from his first year and we sadly miss a new installment, which we thought would be forthcoming in the 2004-2005 season.Most of the episodes have been directed by Robert Weide, who seems to be attuned to Mr. David's kind of comedy. The episodes directed by the other guest directors are fine as well, but it seems that Mr. Weide gets the best out of all performers in the ones he is at the helm.The cast is flawless. Larry David is always enjoyable playing himself, something that is no small accomplishment. He is just a natural. Cheryl Hinds plays Larry's wife with a lot of style. Jeff Garlin, as Larry's manager, is good. Many talented performers are seen in different episodes among them, Sisie Essman, Wanda Sykes, Richard Lewis, and Ted Danson.\"Curb Your Enthusiasm\" has a quality that most other sitcoms don't have and it is the ability to amuse us even in reruns! This happens because of Larry David's tremendous intelligent approach to comedy."
    },
    {
      "username": "tindfoting",
      "userUrl": "https://www.imdb.com/user/ur150749021",
      "reviewLink": "https://www.imdb.com/review/rw7975691",
      "warningSpoilers": false,
      "date": "16 March 2022",
      "rate": "8",
      "helpful": "11 out of 11 found this helpful.",
      "title": "The best comedy since Seinfeld",
      "content": "It took time. Larry Davids own, personal bubble took me 3 seasons getting into. By then I was sold. It's simply fantastic, with Larrys view on his surroundings, with cameo stars playing obnoxious versions of themselves. Picking a favorite is almost impossible, but the one driving to a porn stars dinner party is fun as hell. Specially when Larry fails to mention to Cheryl the guy is a porn actor. After 6 seasons, I felt the air went out of it. You have standout seasons like the Seinfeld reunion, but IMHO Leon is more irritating than funny. The last season (so far) was a complete letdown, with an ongoing stream story about making a \"Young Larry\" series. TBF, it takes the piss on studio execs on Netflix, Hulu, etc, which is funny as hell. The first 6 seasons a near perfect 9/10,the last 4-5 between 7-8. And just to put in perspective it's long run; Ted Danson looks 25 years older from 1st to last season."
    },
    {
      "username": "angelorwez",
      "userUrl": "https://www.imdb.com/user/ur150272282",
      "reviewLink": "https://www.imdb.com/review/rw8099293",
      "warningSpoilers": false,
      "date": "28 April 2022",
      "rate": "8",
      "helpful": "20 out of 23 found this helpful.",
      "title": "marvelous...preeety preettyyyy pretty good",
      "content": "What can you say about...in my opinion...the best comedy ever madei like to compare it to its always sunny in philadelphia...not because they are similar in style or anything like that...but in terms of quality of comedyI feel like curb edges out it's always sunny in quality only just....only justi like the naturality of it...some episodes are far from perfect...it has tiny bits of being moronicbut overall...phenomenal!"
    },
    {
      "username": "TomiusJ",
      "userUrl": "https://www.imdb.com/user/ur4518596",
      "reviewLink": "https://www.imdb.com/review/rw1266644",
      "warningSpoilers": true,
      "date": "16 January 2006",
      "rate": "10",
      "helpful": "44 out of 49 found this helpful.",
      "title": "Funny as ever, realistic as hell - one of the best sitcoms of all time.",
      "content": "Normally, I don't go for the type of sitcom made in the United States. As I'm English, the usual classics like \"Friends\" and \"Seinfield\" don't tend to match out against things like \"The Office\" and \"Peep Show\". Now, it's probably because I'm British that I've developed these comedy tastes, but I am in no way against the sort of stuff the USA turn out. \"Scrubs\", \"Home Improvement\" and \"South Park\" are some of my favourite shows of all time, all funny in their own ways. Recently I invested in series one of a very different show, something that I thought I'd buy after seeing a few clips on a TV special. \"Curb Your Enthusiasm\" is the king of sitcoms - and here's why.The idea is simple. Larry David (writer and co-creator of Seinfield) plays himself as he goes from place-to-place on life's adventures with a great supporting cast, including his wife Cheryl and best friend Jeff. As he goes, realistic situations develop, and here lies the comedy; Larry says and does the exact opposite to what a normal person would do - in essence, he says what you'd be thinking instead of pretending to be humble, polite or well-mannered. Of course, Larry can be humble, polite and well-mannered, but only to those who treat him the same way.First off, the tagline \"deep down you know you're him\" is totally spot-on. The character of Larry is (secretly) somebody you know you are, it's just Larry tends to voice his opinion, state what's true and stand up for himself when things aren't his fault. Isn't this somebody we all wish we could be? I sure do, but it's Larry's lack of feelings for anybody but himself that sets him apart. Sure, he's a nice guy too - I'd be pals with him, and even more so for speaking his mind.Of course, the comedy develops from a variety of other areas too. Our poor protagonist is normally punished in some way for speaking his mind, as it seems you can't get through life by simply saying what's right. Take the first episode for instance, Larry jokingly refers to his wife as \"Hitler\" whilst on the phone to his friend Jeff - little did he know, he was on speaker phone and Jeff's parents have heard. They're outraged, and why? ...they've got a cousin who was a gay holocaust survivor. Geesh! That's just one example however, and as the series develops, the plots and little stories tend to get better and better. The characters are very, very well done - and you have to remember, a lot of the show is improvised from a simple script outline. The actors were auditioned with Larry David himself and it shows that he's put time and effort into getting the show perfect - it really does.In a nutshell, \"Curb Your Enthusiasm\" is as realistic as \"The Office\", and in the same way, a very similar show. Where \"The Office\" used cringe-comedy to get us laughing, \"Curb Your Enthusiasm\" gets us laughing at what we know is true. It's a look at a character who we can love and adore, and yet still distance ourselves from because deep down, we know we're him... we just don't want to admit it."
    },
    {
      "username": "Tommy N",
      "userUrl": "https://www.imdb.com/user/ur0023870",
      "reviewLink": "https://www.imdb.com/review/rw0764636",
      "warningSpoilers": false,
      "date": "20 November 2000",
      "rate": "",
      "helpful": "174 out of 213 found this helpful.",
      "title": "This might be the most brilliant TV show ever.",
      "content": "After missing Larry David's much heralded HBO Special which was the pilot for this masterpiece, on premiere night I was treated with a show that seems to be a bit of Seinfield and Larry Sanders, or maybe even more.While many won't get the premise, being much in-tune with inside Hollywood humor and personalities, Curb Your Enthusiasm takes us inside, past the backstage to the actual lifestyles of an \"A-list\" celebrity and shows exactly how they tick-Fear, paranoia, and maybe, just maybe the inner-workings of a creative genius like Larry David.It's clearly evident who the mastermind of Seinfeld was after watching it. Everyone of those Seinfeld characters are parts of Larry David's personality and just like Seinfeld and The Larry Sanders Show, I can hardly wait to see each episode over and over and over.This show shouldn't be labled a \"10\" it's much to brilliant for that. Try \"A+\" with a 210 I.Q."
    },
    {
      "username": "mimiybyazphil",
      "userUrl": "https://www.imdb.com/user/ur69379480",
      "reviewLink": "https://www.imdb.com/review/rw8260507",
      "warningSpoilers": false,
      "date": "21 June 2022",
      "rate": "10",
      "helpful": "21 out of 25 found this helpful.",
      "title": "There's some Larry David in ALL of us!",
      "content": "I am currently watching all 11 seasons of this funny show. I watched it on HBO years ago, but I came in around season # 8. I didn't know it was an eleven season show!Larry is one of the most honest, and OBNOXIOUS men ever!He is as funny, as he is irritating. There are several laugh out loud moments in each episode. We may not admit it but we all have some Larry in us..I am the female version of him myself!"
    },
    {
      "username": "blanche-2",
      "userUrl": "https://www.imdb.com/user/ur0342623",
      "reviewLink": "https://www.imdb.com/review/rw2708937",
      "warningSpoilers": false,
      "date": "23 November 2012",
      "rate": "8",
      "helpful": "17 out of 22 found this helpful.",
      "title": "Totally outrageous",
      "content": "In one way, it's easy to explain the chicanery that goes on during \"Curb Your Enthusiasm\" by stating that the model for Larry David on his creation, \"Seinfeld\" was George Costanza. The other thing is that during a documentary about \"Seinfeld,\" David said when the show got an order for 14 shows after its original four, he went home and cried in his bed. He didn't know how he was going to write 14 shows; he had so much difficulty with the first four.So out of this crazy comic mind comes \"Curb Your Enthusiasm,\" a heavily improvisational show starring David as himself, Cheryl Hines as his lovely wife Cheryl, Jeff Garlin as his manager Jeff, Susie Essman as Jeff's wife Susie, who is always fighting with Larry, and Richard Lewis. Ted Danson, Julia Louis-Dreyfuss and many others as Larry's friends.Larry is usually in trouble over something due to the fact that he's massively inappropriate and doesn't understand boundaries. He invites a sex offender to his house for Seder with other neighbors; when Jeff's dog gets lost, Larry breaks up a wedding reception when he thinks the Korean florist has prepared the dog for reception food; he tries to weasel out of giving Richard Lewis his kidney; he accuses a doctor of stealing his newspaper. In short, the situations on this show are hilariously funny, sometimes sexual in nature, with lots of salty language. It's often adult humor, made even funnier by Larry's complete guilelessness over what he's done.In season 4, Larry is cast as Max Bialystock in \"The Producers,\" and the season ends with his opening night and features the LA cast of The Producers as well as Anne Bancroft and Mel Brooks. David Schwimmer plays Blume. Inspired.What I love is that on the face of it, this seems to be a show about a successful writer living in a beautiful house with a beautiful wife but instead, complete insanity prevails.Very enjoyable, and it's no wonder David finished the series and was begged to come back for more seasons."
    },
    {
      "username": "makavelix5",
      "userUrl": "https://www.imdb.com/user/ur24808118",
      "reviewLink": "https://www.imdb.com/review/rw8166923",
      "warningSpoilers": false,
      "date": "22 May 2022",
      "rate": "10",
      "helpful": "16 out of 18 found this helpful.",
      "title": "Mostly perfect but sometimes Larry char is too annoying",
      "content": "The show is everything i wanted. It's George from Seinfield with better plots in real world. It's great when Larry deals with little problems and those become mountains. But sometimes he becomes ''ANNOYING OLD MAN'' which is where it loses its magic.Dear Larry, if you are reading this, making an annoying character (just like Sheldon character from Big Bang) is not a good idea nor funny. The character can be azhole but annoying is a deal breaker."
    },
    {
      "username": "Ruskington",
      "userUrl": "https://www.imdb.com/user/ur99782462",
      "reviewLink": "https://www.imdb.com/review/rw5303348",
      "warningSpoilers": false,
      "date": "6 December 2019",
      "rate": "9",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Pretty, pretty good",
      "content": "I can certainly understand why many people don't like this show. The improv style is something of an acquired taste, there isn't much of a storyline at any point and Larry David himself (or at least this exaggerated version of him) is a bit of a polarizing figure. However, I personally consider it one of the best TV comedies ever made. It took me a while to really get a feel for it, and I stopped and restarted more than once, but once you get into it there's really nothing else like it. It's also one of the only shows I have seen that has maintained its standards all the way through. We're talking 90 episodes of consistent brilliance with barely a dip. Most comedies run dry after 2 or 3 seasons so it's a credit to the writing and acting that Curb Your Enthusiasm has stood the test of time so well.Larry David is one of the best engineers of situational comedy in the business. The way the episodes unfold is brilliant and there are some hilarious high payoff moments. Yes, the punchlines are telegraphed and yes, the episodes do follow a fairly predictable formula but I don't find that to be a problem. Many great comedies are equally unsubtle, but as long as the characters are rich enough to pull it off, it really doesn't detract from the overall quality of the show.Larry himself is a wonderfully observed character. His dry biting wit coupled with his almost autistic social clumsiness makes him the perfect contrast to the pretentious So-Cal socialites and celebrities. One criticism I have of the show, however, is the string of attractive girlfriends that Larry dates in the later seasons. I can accept him punching above his weight with Cheryl given his wealth and status, but after they separate, he is somehow able to find an endless stream of desirable girlfriends young enough to be his daughter and he does it without flaunting his money or fame.The supporting cast is a huge success. Cheryl Hines and Jeff Garlin occasionally come unstuck in the more heavily improvised scenes, but both of their characters complement Larry perfectly. The infamous entourage of Ted Danson, Richard Lewis and Bob Einstein are brilliant accessory characters who develop very nicely as the show progresses and have a high level of authenticity. They share some great scenes and successfully help take the comedic load off Larry's shoulders. My personal favourite though has to be the amazing Susie Essman who is absolutely hilarious as Susie Greene. Her undiluted disgust at the mere sight of Larry (or indeed, her own husband) never ceases to amuse me and her heavily accented tirades and outbursts are probably my favourite part of the show.Curb Your Enthusiasm is one of the finest comedy shows I have ever seen and I would recommend it to anyone. However, I would urge you to watch at least one full season before writing it off as it can take some getting used to. I hope they continue to make this show indefinitely, there's little else that compares."
    },
    {
      "username": "Andfinally",
      "userUrl": "https://www.imdb.com/user/ur155404678",
      "reviewLink": "https://www.imdb.com/review/rw8569841",
      "warningSpoilers": false,
      "date": "26 September 2022",
      "rate": "10",
      "helpful": "25 out of 28 found this helpful.",
      "title": "Funniest show ever",
      "content": "Much of the script is improvised in this hilarious show about the creator of Seinfeld and his misadventures around LA. Larry David plays himself, a misanthrope who is forever getting into social scrapes. If you are sceptical, watch season 8 episode 3.The real genius of Larry David is how he manages to push back boundaries without crossing them and manages to send up religions in hilarious manner. For him, there is no taboo that cannot be poked at.He is supported with a range of wonderful personalities such as his generally benign manager and best friend Jeff and his hilariously offensive wife Susie. Without a doubt, my favourite comedy show."
    },
    {
      "username": "micah-39739",
      "userUrl": "https://www.imdb.com/user/ur71966883",
      "reviewLink": "https://www.imdb.com/review/rw5568181",
      "warningSpoilers": false,
      "date": "22 March 2020",
      "rate": "10",
      "helpful": "18 out of 21 found this helpful.",
      "title": "Love Larry",
      "content": "Pretty... pretty... pretty good! Def one of my favorite shows. I don't know who all is in on writing the script but I love it. I wish they would come out with more shows like this"
    },
    {
      "username": "Horror-yo",
      "userUrl": "https://www.imdb.com/user/ur12771356",
      "reviewLink": "https://www.imdb.com/review/rw5826649",
      "warningSpoilers": false,
      "date": "15 June 2020",
      "rate": "8",
      "helpful": "5 out of 5 found this helpful.",
      "title": "All in all remarkable",
      "content": "If you've been around comedy series long enough, you'll know it takes a certain kind of indulgence to get into the rhythm of the thing, to the point where the plot often becomes too convoluted or too particular (if the series takes place in a specific field for example). The thing about Larry David and his humor is that anybody, from any culture or background, could understand at least what the main point of the episode is, and understand what the humor is conveying. It doesn't necessarily cater to the American, upper middle class, L.A./N.Y. crowd, which is what we see of most onscreen. It's just so easy to watch, and so intuitive it requires little effort to fully immerse into an episode. The character Larry lives the fancy life of a successful wealthy old guy, but he doesn't behave like one, which shatters the boundaries of social class and even culture. He sees everything from his own personal point of view, and will contest anything and everything he deems unfair, whether christian or jewish, black or white, rich or poor, handicapped or able-bodied, male or female.Now, that premise alone of the ever-critical New York Jew with little regard for sensitivities is indeed funny, but wouldn't fill out 10 full seasons in any substantial enough way. Larry David merely sets the tone of the show, but doesn't flesh it out. The magic in the series happens with the writing, and particularly the interconnected structure of each episode. We'll be shown something at the start of each story, we'll then be shown a couple more seemingly innocuous and independent events, but our attention is focused so much on the present disasters we're shown we'll forget about those earlier occurrences, which somehow come back to connect with the other subplots, with each episode being a climactic converging of all those brewing catastrophes. And it's not just each individual episode that works that way, but the full season. And there's always a subtle yet unconventional moral at the end, some kind of ironic twist of fate.Never at any point does the series look like it's out of breath, as Larry David continues with his perfect 100% record from Seinfeld to this latest CYE season 10. As everything it could be criticized, loathed even, but it is at least consistent with what it does. Times change, but Larry David's character and humor, and virtuosity at his craft, remain."
    },
    {
      "username": "ZaidKarimSlopek",
      "userUrl": "https://www.imdb.com/user/ur112753720",
      "reviewLink": "https://www.imdb.com/review/rw5508329",
      "warningSpoilers": false,
      "date": "25 February 2020",
      "rate": "9",
      "helpful": "27 out of 33 found this helpful.",
      "title": "IMPOSSIBLE NOT TO LAUGH",
      "content": "Each episode will have you begging for more of Larry David"
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw4755321",
      "warningSpoilers": false,
      "date": "1 April 2019",
      "rate": "10",
      "helpful": "13 out of 18 found this helpful.",
      "title": "Among my favorites probably in my top top 10",
      "content": "Love just about every episode; all the quirky interactions, awkward moments, many arguments & the music always makes me smile! I relate to so many conflicts Larry gets into I'm unique & nitpick too just all around great show - don't need to say much more just love this show so much!"
    },
    {
      "username": "nerfmemusique",
      "userUrl": "https://www.imdb.com/user/ur69827678",
      "reviewLink": "https://www.imdb.com/review/rw8453688",
      "warningSpoilers": false,
      "date": "16 August 2022",
      "rate": "9",
      "helpful": "22 out of 25 found this helpful.",
      "title": "Pretty, pretty, pretty...pretty good.",
      "content": "Sorry, your review is too short. It needs to contain at least 150 characters.I don't think so. I think this review is pretty, pretty, pretty... pretty good."
    },
    {
      "username": "smellthecult-com-1",
      "userUrl": "https://www.imdb.com/user/ur22113547",
      "reviewLink": "https://www.imdb.com/review/rw2181750",
      "warningSpoilers": true,
      "date": "28 December 2009",
      "rate": "10",
      "helpful": "15 out of 20 found this helpful.",
      "title": "Larry David post-Seinfeld",
      "content": "Larry David features as himself in this curious, vicious and truly excellent comedy from The States.Larry is a very interesting creature, full of cast in stone beliefs about how the world should be, how people should behave, and standards of behaviour both in society in general and between individuals. His fervent belief system constantly sees him landing himself in hot water as he derides and/or becomes upset by people who don't understand his unique set of rules.Ball tighteningly embarrassing situations present themselves as Larry stumbles from one disaster to another, and his long suffering wife Cheryl tries her best to explain to him just why it is that he always seems to get things wrong.From an individual standpoint, I find the show very interesting as it seems clear that the viewer is meant to consider his beliefs a little over-zealous, but I for one whole-heartedly agree with him the majority of the time. People should be nicer towards one another, people should be more considerate, and those that aren't are deserving of his wrath.Great performances from Jeff Garlin as his agent and Richard Lewis, playing himself, as one of his closest friends gives this show a real edge.Massively recommended to all, but be prepared to squirm almost as much as you laugh. Simply brilliant."
    },
    {
      "username": "capricemariela",
      "userUrl": "https://www.imdb.com/user/ur3889925",
      "reviewLink": "https://www.imdb.com/review/rw0764713",
      "warningSpoilers": false,
      "date": "28 August 2004",
      "rate": "",
      "helpful": "116 out of 131 found this helpful.",
      "title": "rawks!",
      "content": "having spent most of my life sitting in front of a television, i think i've seen a lot of good and bad TV. curb your enthusiasm is, to date, the smartest comedy series i've seen. i enjoy it more than seinfeld because larry is such a dynamically static character. you always know he'll do some sort of bonehead thing but, for some reason, you are always surprised. i think the format of the show is most impressive to me. there is no script; only a storyboard for each episode. thusly, the actors are forced to essentially improv characters and dialogue. every time i laugh at one of the jokes on this show, i laugh even harder when i realize that this is off-the-cuff hilarity. bravo, larry David!"
    },
    {
      "username": "rutland274",
      "userUrl": "https://www.imdb.com/user/ur1852767",
      "reviewLink": "https://www.imdb.com/review/rw1331368",
      "warningSpoilers": false,
      "date": "2 April 2006",
      "rate": "",
      "helpful": "67 out of 85 found this helpful.",
      "title": "Curb Your Enthusiasm",
      "content": "I am writing this because I think that this is the most hilarious and entertaining show on television. Unfortunately, my children do not share my opinion and I had to search awhile to find someone with the same enthusiasm for Larry David's humor. I always find, at least one thing in each of his episodes to send me laughing for all of the good reasons, loud and long! This humor is so therapeutic for me and makes my day. I so 'get' this type of humor and it is wonderful. I particularly enjoyed the episode, when Larry invited the child molester to his home for a dinner for a religious holiday. This was a mix of his neighbors, who were aware of this young man's problem. Larry David is a master of underplaying and was superb!Beatrice"
    },
    {
      "username": "fatherofmichaeluk",
      "userUrl": "https://www.imdb.com/user/ur10185919",
      "reviewLink": "https://www.imdb.com/review/rw1340436",
      "warningSpoilers": false,
      "date": "13 April 2006",
      "rate": "",
      "helpful": "115 out of 137 found this helpful.",
      "title": "The BEST entertainment possible",
      "content": "This is without a doubt the best show to come out of Amercia for years and why does the UK struggle to show it? This is the front runner to comedies like The Office and Extras and is made to a standard higher than anything else that is currently shown.Larry David is just a funny character. He has all the qualities of a perfect leading man and when he is placed into the mundane situations that happen around him he starts to question everything. There have been a few comedies in the past that have tried to do this (not including Seinfield) which he co-created but this is the best.If you have never seen Larry David I would suggest that you buy the DVD box set now because this will change your life. An no I do not work for him!!!! Although given half a chance I would give up a career in medicine to follow him.Definitely a 10/10. The best thing around for years."
    }
  ],
  "errorMessage": ""
}