{
  "imDbId": "tt0995832",
  "title": "Generation Kill",
  "fullTitle": "Generation Kill (TV Series 2008–2008)",
  "type": "TVSeries",
  "year": "2008",
  "items": [
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw2929141",
      "warningSpoilers": false,
      "date": "27 December 2013",
      "rate": "10",
      "helpful": "138 out of 163 found this helpful.",
      "title": "This goes beyond mere entertainment - this is simply the best contemporary television has to offer",
      "content": "What you get to see here is a one-of-a-kind mini-series: this is as close to a documentary as it gets. The realities of modern warfare are shown honestly with no political agenda and you are left to draw your own conclusions. When I watched this series I remembered a quote from another film, 'The Siege' from 1998, where Bruce Willis' character, a high ranking army official, says something along the lines of: \"The army is a broad sword - not a scalpel. So trust me, you do not want to call the army, unless you have absolutely no other option\". From an artistic point of view what stands out the most is the ensemble of actors. Not once during the entire seven episodes did I not believe I was watching the actual characters - the performances and the direction in this production are flawless. I've never seen a series that felt as real as this. This goes beyond mere entertainment - this is simply the best contemporary television has to offer. 10 out of 10.Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/"
    },
    {
      "username": "bayardhiler",
      "userUrl": "https://www.imdb.com/user/ur31376824",
      "reviewLink": "https://www.imdb.com/review/rw3502983",
      "warningSpoilers": false,
      "date": "11 July 2016",
      "rate": "10",
      "helpful": "54 out of 62 found this helpful.",
      "title": "Captures The Full Chaos and Absurdity of War",
      "content": "I had heard of \"Generation Kill\" when it premiered in 2008, but was unable to view since I do not have HBO. So I forgot about it for a while until some time ago I was looking around at the local library when I just happened to sight this little, television masterpiece, and decided, especially in light of what the result of our adventure in Iraq has been in the last few years, to give it a chance. And though I can't say \"Generation Kill\" was necessarily my favorite viewing experience, I'm glad I did. Based off of the memoirs of a Rolling Stone reporter embedded with the 1st Marine Recon Unit during the first days of the US invasion of Iraq, it begins on the eve of that faithful event by introducing the viewer to the men of 1st Marine Recon (many of whom are based off of real life Marines), their code, standards, and every day experience. When they learn that the invasion is going ahead, they also learn that a reporter from Rolling Stone will be coming with them. Initially reluctant to having a greenhorn tag along with them, they warm up to the young writer when they learn he used to write for Penthouse, a magazine many of these young, red blooded males are familiar with! Through the production, we see the course of events through the eyes of the Marines and their \"hang around\" in a the most unsugar coated method possible, and we come away with no illusions about what war is really like.What makes \"Generation Kill\" so different from other war productions is the fact that it strips away the unnecessary fluff and puff and presents the story in an almost character ensemble/documentary style. In \"Generation Kill\" there is no music score or opening theme, only the crackle and chatter of voices over the radio greets us at the beginning and end credits of each episode, multiple units and men sounding off into the dead of night, which truth be told, is far more effective than any music theme could be (That being said, the final scenes of the last episode feature a most appropriate use of Johnny Cash's \"The Man Comes Around\", the only recorded song used in the entire series). There is also not much in the way of heroics or glory for the simple reason that in war, there is none to be found. There are no eagles soaring, or glory sounding tunes, or any other BS like that; only following the orders of your superiors (Even if they're complete fools or incompetent), hurrying up and waiting, and of course, death and destruction. And that last part is especially evident in \"Generation\", as the series pulls no punches in regards to the civilian \"collateral damage\" that occurred in Iraq during our invasion, and thus shows the cost civilians pay when armies, even with the best of intentions, come charging into their environment in a combat role (To those who think US troops patrolling troubled neighborhoods would be a good idea, I challenge them to watch this and then try to argue for that idea!). All of this is effectively shown through the tremendous efforts of the directors, producers, show runners, writers, and actors such as Jon Huertas, Alexander Skarsgard, Lee Tergesen, Stark Sands, Neal Jones, Michael Kelly, Chance Kelly, former real life 1st Marine Rudy Reyes, James Ransone, and many, many more who I don't have the space for. To round it up, \"Generation Kill\" is a mini-series that leaves nothing to the imagination when it comes to the chaos and absurd nature of conflict, be it Iraq or anywhere else. As one former Marine commented here, this is the closet thing to war short of going there and actually filming it. For a former service member to say that, you know they did something right here. If you want to see what the reality of conflict without actually being there, then check out \"Generation Kill\". Stay frosty."
    },
    {
      "username": "vincerodriguez447",
      "userUrl": "https://www.imdb.com/user/ur57049066",
      "reviewLink": "https://www.imdb.com/review/rw5755204",
      "warningSpoilers": false,
      "date": "20 May 2020",
      "rate": "10",
      "helpful": "30 out of 33 found this helpful.",
      "title": "I Lived this story. Very accurate!",
      "content": "As a marine who was part of OIF/OEF & the invasion and crossed paths with and personally knew members of the Force Recon unit profiled, it's one of the most accurate wartime movies I've ever seen! Absolutely perfect to the smallest detail! That aside, the filmmaking was also phenomenal from the cinematography to the special effects. What you see here is exactly how it was and is in modern combat and in the USMC to the letter. Brought back a ton of memories. Great performances great everything! 10/10! A must see!"
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw3373967",
      "warningSpoilers": false,
      "date": "18 December 2015",
      "rate": "10",
      "helpful": "38 out of 54 found this helpful.",
      "title": "Brilliant war drama",
      "content": "Brilliant war drama.The story of 1st Marine Reconnaissance Battalion's participation in the second Allied invasion of Iraq, in 2003. Seen through the eyes of Rolling Stone reporter Evan Wright, who was embedded with the Battalion and upon whose book the series is based.Though dramatized, this is pretty much a warts-and-all account of a military unit in combat. Hardly glamorous, it shows well the problems they face, both external and internal. Not all drama and explosions - there are many great comedic moments, especially in the dialogue.Accurate, engrossing and entertaining."
    },
    {
      "username": "brett-76260",
      "userUrl": "https://www.imdb.com/user/ur71629917",
      "reviewLink": "https://www.imdb.com/review/rw7558066",
      "warningSpoilers": false,
      "date": "18 November 2021",
      "rate": "9",
      "helpful": "16 out of 20 found this helpful.",
      "title": "Solid",
      "content": "As a US Marine I can pretty much relate to everything that went on in this series... From the banter among low ranks, to the stupid games we have to endure, to living in terrible conditions, it's all here. To weapons jamming and MRE's, this series really has it all. The thing that caught my attention was how they captured the terrible leadership at times from the powers that be. I'm here to tell you there is some pitiful officers leading men into battle. And then you have some outstanding NCO's that make things happen. This series shows it all and from my perspective, this is probably as close as it gets to the real thing. Wanna be a United State Marine? This will give you a little insight on what it's like after bootcamp. Some great actors in this show and have to give all the credit to the producers and director. Guarantee they had real Marines on set making sure they got things as accurate as they were allowed. This was a solid solid series and will watch it again and again... man I miss being around my Brothers and everything that goes with being a Marine... Semper Fi Rudy!!!"
    },
    {
      "username": "johnha-1",
      "userUrl": "https://www.imdb.com/user/ur19733719",
      "reviewLink": "https://www.imdb.com/review/rw1925862",
      "warningSpoilers": false,
      "date": "7 August 2008",
      "rate": "10",
      "helpful": "459 out of 544 found this helpful.",
      "title": "Absolutely Phenomenal Show",
      "content": "As a former Marine who was deployed to the same place at the same time, I think this show did an excellent job of capturing the 'essence' of what the invasion of Iraq was like to the men who were there. This show comes closer to accurately portraying wartime Marines than any other show I've ever seen. I think this is as close as Hollywood can get short of being there and filming it live. Sometimes the special effects are a little over the top, but the dress, demeanor and dialog of the characters are very accurate.The attitudes, bearing, and language of the Marines portrayed are spot on, as well as the day to day problems and trials they encounter. I guess what I really like about this show is the lack of cheesy moto propaganda. The films are light on pro- or anti- war propaganda and heavy on truth. I'm sure some people think that the 'get some' attitude of the Marines glorifies the war while others think that pulling no punches in the collateral damage department is anti-war, but that isn't the case. These films boldly show the invasion of Iraq for what it was, for better or worse. The Marines have 'get some' attitudes in this show because Marines really have that attitude. Collateral damage, chaos and confusion among U.S. forces are in the show because it really happens in warfighting."
    },
    {
      "username": "mayank09876",
      "userUrl": "https://www.imdb.com/user/ur44661012",
      "reviewLink": "https://www.imdb.com/review/rw3327247",
      "warningSpoilers": false,
      "date": "2 October 2015",
      "rate": "10",
      "helpful": "20 out of 28 found this helpful.",
      "title": "As Real as it can get, Entertaining & Educational.",
      "content": "Honest look at what went on in America's war for \"Iraqi Freedom\". The series is from the point of view of First Recon Marines. It gives us a realistic look of modern warfare, the combat is the most authentic i have come across, it doesn't hype the action for cinematic values. Be warned you won't get to see much of action but when it happens it's tense. As in real life so in series the Marines are made up of unique characters, there are capable as well as dumb officers. The soldiers come from different background and races, there are Mexicans, South Americans, Blacks, Rednecks, some are educated, some joined out of patriotism, some were given choice between jail term or marine school. Everyone's brain tuned in differently, the only thing common between them are the unity of brotherhood and them being highly trained killers.For me the best part and the highlight of the series are the humors and sarcastic banter among the soldiers. After watching the series I did some research and found out most of the names and designation are from real people and actual facts.In fact two of guys played themselves.The series is pretty much controversy free which is surprising considering it shows some stuff which the Government would have liked kept out of limelight.Do watch it, it's fun as well as education."
    },
    {
      "username": "jemcgarvey",
      "userUrl": "https://www.imdb.com/user/ur19608364",
      "reviewLink": "https://www.imdb.com/review/rw1911035",
      "warningSpoilers": false,
      "date": "15 July 2008",
      "rate": "10",
      "helpful": "181 out of 273 found this helpful.",
      "title": "I'm glad they're doing this right (mostly)",
      "content": "I'm also glad there is no music. Music (though moving) would have taken away the grit to this story and given it a more artificial feel. It's amazing how much of the dialog and situations are straight from the book, and how perfectly spot on they are showing Recon Marine culture.I'm glad Rudy and Kocher got to play themselves. Though I only personally know Pappy out of these characters, it's obvious they are working as hard as they can (within Hollywood's tradition) to portray it as it happened. I hope they continue this series at least until the end of the invasion. I can't wait to see the action at the bridge and the other ambushes.Oh, and the Sgtmaj. harping on grooming standards during combat operations is so hilarious because it's so true!"
    },
    {
      "username": "ametaphysicalshark",
      "userUrl": "https://www.imdb.com/user/ur11842025",
      "reviewLink": "https://www.imdb.com/review/rw2013157",
      "warningSpoilers": false,
      "date": "25 January 2009",
      "rate": "",
      "helpful": "53 out of 103 found this helpful.",
      "title": "A work of immense power on its own, but also a great companion piece to \"The Wire\"",
      "content": "Proof that \"Generation Kill\", the miniseries produced by HBO films and written by David Simon and Ed Burns, their first project after the end of their television landmark \"The Wire\", a series which is completely incomparable in quality and scope to anything which has come before or since, is too intelligent to be concerned with simplistic political sloganeering, blind patriotism, or taking an anti-militaristic stance is the reaction which the political extremes have had to it. Any person with far right views I've spoken to or read on the internet has said similar things: this movie emasculates the marines and turns them into bleeding heart liberals (presumably because the film, and I will be referring to this as a film from this point onwards because it's definitely as much a film as \"Berlin Alexanderplatz\" is, has the guts to portray them as having compassion for wounded or killed civilians), and any person with far left views I've spoken to has apparently found the film to be immoral, presumably because it portrays men who spew violent, racist, homophobic, and misogynist invective as human beings.In fact, \"Generation Kill\" is the farthest thing from either celebrating the military or being anti-militaristic. Like on \"The Wire\", David Simon and Ed Burns are on the side of the working class, as Kent Jones in Film Comment points out, and they have no interest in making a moral judgment on the nature of the work they're portraying, whether it's teaching, politics, drug dealing, or invading a country. Like Simon went beyond portraying drug dealers on \"The Wire\" to transporting us to their world and showing us their own problems, their own moral standards, their own worries and concerns, and introduced us to their own vernacular, he does the same with the marine corps in \"Generation Kill\". Like \"The Wire\", this is cunning and clever drama: it is political without taking sides, concerned with the inefficiency and bad planning coming 'from above' but without putting the blame on any individuals. It portrays people, some less likable and morally or politically correct than others, but people. The only thing keeping \"Generation Kill\" from truly being a military version of \"The Wire\" is that its comparatively limited scope- it takes place within the first, 'triumphant' week of the invasion, and focuses pretty much only on one group of people. I'm entirely convinced that Simon could have written a thoroughly engrossing and fascinating drama about the Iraq war which extended past these five days, one which would have taken us past the marine corps into the lives of the other military units involved in the invasion, and the higher-ups as well, as he did starting in season 3 in \"The Wire\". As it stands, this is not a limitation of the power which \"Generation Kill\" holds, but a masterstroke in its success of making its point: every element which has made the situation in Iraq so chaotic was present in a latent form from the beginning. The film is not even really making a moral judgment of the war in Iraq, if anything it supports a well-executed version of it: most of the Iraqis we see, nearly 90% of them, are incredibly grateful, at least at this early stage, for being relieved of Saddam's rule. Moreover, no American marine or any Iraqi is portrayed simplistically as a 'bad guy' or 'good guy', not even the bloodthirstiest of the Americans, and this writing is brought to life admirably well by the mostly perfect cast and the excellent direction and production value (it is obviously not a big-budget Hollywood film, but it still achieves real authenticity in almost every regard- the closest I came to disbelieving it was when a few Iraqis were portrayed as darker-skinned than any I've seen). The closest thing to a villain in the film is Saddam himself, who makes no literal appearance outside of posters on the streets, but then again he is pretty much the closest thing to a movie 'bad guy' in reality.\"Generation Kill\" is, like \"The Wire\", ultimately a workplace drama about workplace politics. That the stakes are higher and that the innocent are killed even more often than they are on \"The Wire\" is irrelevant to the writers. This may make \"Generation Kill\" boring to those accustomed to and expecting a more standard war film, one which attempts an anti-war or pro-war statement. Like \"The Wire\" again, what the viewer is left with in the end is only a dislike of unnecessary violence and casualties, and a portrayal of the toll they take on those involved in either perpetrating the violence or those related to the victims. Both \"The Wire\" and \"Generation Kill\" are dramatically built on disappointment and disillusionment with the system in place itself, and like \"The Wire\" it is all about bad decisions, mistakes, and the rare good decision. The film ends with a montage and a song, much like every season of \"The Wire\", and with its subtle summation of the hours gone by and its emotional impact it cements David Simon's status as one of the greatest and most important writers of our time."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw1992465",
      "warningSpoilers": false,
      "date": "19 December 2008",
      "rate": "",
      "helpful": "13 out of 23 found this helpful.",
      "title": "Great adaptation of a great book",
      "content": "Like many others, I heard about David Simon et al doing Generation Kill as an idea long before it was made and while The Wire was still being screened. Interested, I read the book and enjoyed it as a piece of journalism and I understood what it was that perhaps attracted those behind The Wire to this in particular. When it came to watching the miniseries myself I had to mind myself in a couple of ways. Firstly I was careful that I didn't have my mind made up in regards how I felt it should be but, more importantly I had to make sure that I didn't start watching it with the decision already made that it was \"brilliant\".I do not mean to criticise others but there is the temptation for Wire fans to love anything associated with it  sometimes before the thing in question is yet to be seen. I forced myself into this mode because I am prone to that quite often  deciding I know what something is before I have seen it. Much like The Wire, Generation Kill has a slow start and a pace that is a lot more patient than the setting (and trailers) would have you believe. To some this will be a problem but to me it just added to how convincing it was that we didn't have huge action sequences and much in the way of shootouts (in an action sense). This is not to say that there is no action, because there is, but it is delivered in a realistic way that is regularly shocking or tense but not really exciting in the Hollywood sense. If anything a lot of it is matter-of-fact in the presentation, while the content is shocking. One good example of this is the incorrect levelling of a village in episode 3  it just happens suddenly and totally, but an ambush on a bridge is perhaps a better example of the series when a fire-fight occurs. It is frantic, chaotic and disorientating and the viewer is in the middle of it much like the reporter.Speaking of chaos, throughout the miniseries you can see what about the story attracted Simon etc to it. Much like The Wire we have a war that is going badly with those at the top protecting themselves and keeping distant from the reality, middle-managers are left to make the toughest calls as the pressure comes down on them from above to solve the problems and all the time those on the ground have the best perspective but no power  only frustration and, in some cases, apathy. It does this really well because, despite what we get to see, at no point could it be accused of being \"against the troops\". Instead it points to unseen authority figures much higher up the power structure than our point of view allows us to see. It never blunders this point home though and it stays away from going after specifics or scoring easy points; in managing this what we get is a much more engaging story because it leaves the viewer to form an opinion without the heavy air of anger or judgement.The \"story\" structure helps this. The obvious adaptation is to do it from the pov of the reporter character and, with his introduction I had assumed this is where it was going as it is a common device. It doesn't do this though and instead has an effective ensemble feel build around a loose focus on one unit in particular, led by Brad Colbert. The slight downside of this is that the show could be accused of having no \"plot\" because in truth it doesn't have a specific flow other than being embedded with the characters  I suppose it could be called an apt point that the narrative certainly doesn't have an \"end\" (although the series does to a point  albeit a rather obvious one that channels but never fulfils the spirit of The Wire's season conclusions).The Wire always had good performances across the board and on the whole Generation Kill manages to do the same thing. The obvious star is the cool and charismatic Skarsgård who is a real rock at the centre of the show. Equally impressive though is someone who I disliked in his character when he was in season 2 of The Wire but who is a lot more natural and engaging here  Ransone. Tergesen brings little because the material isn't there for him and mostly he feels a bit out of place  almost too recognisable for such a role. I go though as performances are roundly solid from Sands, Lush, Huertas, Kelly and others. Some didn't quite work as well  Nenninger seemed to struggle to make something of Capt America, he tries but it was a big ask to make him more than the character that came across in the book. The production standards are high here, with the effects being convincing and the sets worked really well (only one moment in the final episode, driving under the swords statue, didn't feel real).Generation Kill will not garner the praise directed at The Wire and nor should it really because it is not quite that good, mainly down to the nature of the material and the short run. It is however, still very good. Built on similar themes as The Wire, Gen Kill builds a convincing world and allows the viewer to draw the conclusions that are obvious. The acting is mostly good even if many people have limited character in their parts and the production values are high. Very engaging and impressive piece of work from the equally good book of the same name."
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw2161329",
      "warningSpoilers": false,
      "date": "21 November 2009",
      "rate": "10",
      "helpful": "8 out of 14 found this helpful.",
      "title": "A brilliant depiction of the war in Iraq",
      "content": "Having loved The Wire I was interested to see how its producers would deal with the subject of war. Obviously this series is quite different, after all it is only eight episodes long rather than five seasons. It also has a much smaller cast as it follows a small group of US Marines from the desert of Saudi Arabia where they are waiting to go to war to the streets of Baghdad where they realise that even though they've won the war winning the peace will be another thing altogether.The series makes no concession to those who don't know military terminology which makes it all seem very real to the viewer. One might expect a series about war to be non-stop action with our heroic protagonists valiantly battling the enemy while saving women and children caught in the cross fire... not here though most of the time is spent driving or just sitting around and when there is action they are just as likely to be engaging some poor civilian who is in the wrong place at the wrong time as an enemy combatant. I know some people found the inaction boring but I was gripped from start to finish.The series managed to walk a fine line avoiding both the glorification of war and the demonisation of those involved in this unpopular war. Our heroes aren't depicted as angels, they each have their flaws but also they each have their charms.Surprisingly for a series about such a serious subject there are quite a few laugh out loud moments, I particularly laughed in an early episode when they were finding about what was going on by listening to the BBC News... complete with cricket commentary."
    },
    {
      "username": "bigjewfan",
      "userUrl": "https://www.imdb.com/user/ur19703399",
      "reviewLink": "https://www.imdb.com/review/rw1922227",
      "warningSpoilers": false,
      "date": "1 August 2008",
      "rate": "10",
      "helpful": "155 out of 236 found this helpful.",
      "title": "True to the Marines. on a personal level.",
      "content": "Before some one comments on this mini-series they have to understand that is based entirely in truth. I first picked up the book while I was traveling home on leave shortly after returning from Iraq and read it in one sitting on the plane. One of the things that I find to be the most outstanding about the book and the series so far is that it is true to the people. I don't mean that it gives us something new and authentic to ponder. I can't think of any instance where the book or show goes into the political aspect of Iraq. And you know why. Because Marines don't make policy. They enforce it, regardless of there personal feelings towards it.I am personally tired of hearing the comments about the show being cliché' If they spend anytime around the military they will find that most of characters portrayed are just like the young men serving. Marines are a different breed. They are asked to do different things that most of society would not understand. Enjoy the show and try not to get your mind wrapped around it to much."
    },
    {
      "username": "defcon_ronin",
      "userUrl": "https://www.imdb.com/user/ur3062045",
      "reviewLink": "https://www.imdb.com/review/rw1910878",
      "warningSpoilers": false,
      "date": "14 July 2008",
      "rate": "9",
      "helpful": "169 out of 250 found this helpful.",
      "title": "throat cancer. just lucky i guess...",
      "content": "Every Marine that I know who's read this book, and the couple that have caught the first episode has nothing but good things to say about the material. David Simon and Ed Burns did a great job of sticking to the heart of Wright's story--and from what I've heard, even referenced Lt. Fick's personal account (One Bullet Away)--of that deployment as well. As an active duty Sergeant in the USMC, most of my enlistment has involved working with and managing the same kind of colorful personalities seen in GK. I lost track of how many times we laughed at random \"unfunny\" scenes because the accuracy of the mannerisms, terminology, or situations depicted.The one thing that caught me off guard was, after watching all the HBO trailers, the lack of music. I kept expecting to hear that campy trailer music sprite up the background, but it never happened. Oh well, you can't win em all.YOU WILL ABIDE BY THE GROOMING STANDARD."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw5767164",
      "warningSpoilers": false,
      "date": "24 May 2020",
      "rate": "10",
      "helpful": "6 out of 11 found this helpful.",
      "title": "Realler than real",
      "content": "Well it could be more real if you actually went there (if you did, I'm pretty certain you appreciate the way this was made). But not having been there and only being able to judge this from afar, this feels close to a documentary, in a very good sense that is.It is only 7 episodes long and the makers of Wire are behind it as the discs did not fail to state. This is way different than the Wire though. This is about war, this is about a generation and how they got \"hoaxed\" into a war. This is how people view things, what their expectation was and how leadership can be quite failed. Putting the wrong people in charge, not having checked their psychology can lead to quite the disaster. Even if not, it is quite awful to watch what one of the people who commands others does himself.But war does do certain things to a person. Depending on what they want to do, they mental state, they might go overboard. And the series throws you, without much explanation. It is confusing and irritating ... it is also gold and a must see watch."
    },
    {
      "username": "MDBum",
      "userUrl": "https://www.imdb.com/user/ur1496151",
      "reviewLink": "https://www.imdb.com/review/rw1916775",
      "warningSpoilers": false,
      "date": "23 July 2008",
      "rate": "8",
      "helpful": "99 out of 190 found this helpful.",
      "title": "Pretty Good",
      "content": "First off, viewers should realize that this series is about a marine recon team. This is not about the army, navy, air force, etc. Most armed forces members will tell you that the people in the Marines are a different breed from other members. They are often by nature, more aggressive, angry, patriotic, racist, need to prove something, excited to kill something, etc. If you get annoyed by that, then don't watch Generation Kill. Regardless, the series is good because, although the series isn't a deep philosophical \"thin red line\",(judging by the demeanor and mentality of a lot of the soldiers in the film it would seem a bit unrealistic), it is an honest portrayal of the mindset, expectations, and mentality of these specific groups of soldiers. Another strong point is the relatively lack of action. This is also an honest portrayal. Much of war is 95% of sitting around, doing random chores, getting bored out of your mind, mixed in with 5% of terror and serious fighting which can shake anyone's mental foundation and nerves. . I feel this series captured this rather well.The only downside to the film was David simon's typecasting of the obnoxious character from season 2 of the wire (wire fans will know what im talking about). It was good once, but not twice. Additionally, Skarsgard acting is rather wooden and questionable, particularly his accent, which ranges from southern, to standard, to something I've never heard of. I've lived in Scandinavia for quit some time so i've come quite accustomed to hearing their English, which is mostly excellent, but there are still hints.Agree with the war or not, this series shows the bravery, albeit at times maniacal nature of men, who go into action when called upon."
    },
    {
      "username": "rsp_k69",
      "userUrl": "https://www.imdb.com/user/ur19609301",
      "reviewLink": "https://www.imdb.com/review/rw1911170",
      "warningSpoilers": false,
      "date": "15 July 2008",
      "rate": "10",
      "helpful": "114 out of 195 found this helpful.",
      "title": "A nice introductory first episode",
      "content": "I enjoyed this immensely, and without revealing my views on the war on Iraq, I must say that I fail to see where these anti-war propaganda/war mongering commentaries are relevant.Understandingly the Iraqi war has deep-set emotions with the American Public, but I did not feel that this in any way glorified, nor vilified the US troops. Nor did it so for the Iraqis. How anyone can regard this as left-wing anti-war propaganda is beyond me, as it seemed most of the characters had very human and sympathetic traits. As all of us who have served in the military know, there are often extreme personalities(i.e racist, militant, fundamental religious beliefs etc), by the sheer fact that the armed forces are a cross-section of any country's inhabitants, but they all showed camaraderie and discipline more than hostility towards humanity in my point of view.although I said I wouldn't reveal my views regarding, I now feel compelled to do so. I am a huge opposer of the war in Iraq, and I feel great resentment towards many of the US foreign policies, but that does not mean that I do not enjoy the story on a personal level, nor that I can not sympathize with a country in war. By entertainment standards, this is some of the best television I've seen in a long while, and I can't WAIT for the next episode."
    },
    {
      "username": "freemantle_uk",
      "userUrl": "https://www.imdb.com/user/ur17571044",
      "reviewLink": "https://www.imdb.com/review/rw2183440",
      "warningSpoilers": false,
      "date": "31 December 2009",
      "rate": "10",
      "helpful": "7 out of 15 found this helpful.",
      "title": "Excellent Mini-series",
      "content": "This mini-series was what the film The Hurt Locker should have, a interesting, well written series about the Iraqi war and the soldiers involved. This is an adaption of the fact based book by Evan Wright who was a reporter for Rolling Stone during the war.The focus of the series is on First Reconnaissance Battalion's Bravo Company of the Marines, a Battalion that leads the line for the invasion of Iraq in 2003. It starts of like Band of Brothers, where you get to know the characters before the invasion and are introduced to Evan Wright (Lee Tergesen), the reporter. When the invasion happens the main focus is on Second Platoon led by Sgt. Brad 'Iceman' Colbert (Alexander Skarsgård), an intelligence man who cares about men, and treats the Iraqis with respect. He is the most sympathetic character throughout the series. As the Americans invade the country it's clear there was no real military planning, with no plans, tactics or intelligence. There are also undersupplied throughout the invasion. It was lucky that the Iraqis were even worst. Colbert often has to question orders he has been given by officers who seem lack knowledge. Within the ranks some of the Marines are very trigger happy and gung-ho, who see the invasion as an adventure. They so no respect to the locals, calling them by racist terms which I don't like to replete. Some take weapons and helmets as trophies. They reminded me of some people at university in the Officer Training Corp (OTC), and they were basically dicks. After the Americans win the war the situation doesn't improve. They is no post war planning involving helping prevent basic services, non any understanding of the Iraqi people.There is a great team involved with Generation Kill, it had David Simon from the Wire as a writer and production, with Ed Burns from the Wire as a writer. The writing is excellent, no just with plots or stories (which they have to stick to the facts), but all brilliant dialogue and ideas about why America was in Iraq and the ethics of war. It also tries to show a mix picture within the military where people are good and bad, whilst the Iraqis are simply the enemy in the distances. There is an excellent cast, Alexander Skarsgård will be following his father's footsteps. As well the writing and acting there is fine direction throughout the film, giving you information about what is happening in the wider world, and there are decent action scenes.The series itself reminded me of the excellent Band of Brothers, and if you like then you will love Generation Kill."
    },
    {
      "username": "kingdave127",
      "userUrl": "https://www.imdb.com/user/ur15532939",
      "reviewLink": "https://www.imdb.com/review/rw1910070",
      "warningSpoilers": false,
      "date": "13 July 2008",
      "rate": "9",
      "helpful": "78 out of 159 found this helpful.",
      "title": "Excellent start",
      "content": "What can I say? In the first episode I saw great and (for the most part) realistic dialogue, excellent acting, good character development, and an avoidance of most clichés. I especially liked how this episode did not give any kind of glorified look at the heroes of this miniseries; the characters are ordinary people, trained to kill. Because of this, we see people who are unapologetic in their views of the enemy and each other. They are trained to kill, and thank God for that and for them. If we did not have people like that working for us, I doubt any of us would be here posting messages on a website. As a former soldier, I cannot wait to see the rest of this series."
    },
    {
      "username": "standeman1984",
      "userUrl": "https://www.imdb.com/user/ur5274394",
      "reviewLink": "https://www.imdb.com/review/rw1942309",
      "warningSpoilers": false,
      "date": "7 September 2008",
      "rate": "9",
      "helpful": "11 out of 21 found this helpful.",
      "title": "'On the seventh day, when god rested, we overran his perimeter and we've been running the show ever since...'",
      "content": "I watched the finale of this show last night and was left feeling delighted by another great series from The Wire creators, but also very much wanting to see more from the superb cast and production team. Having said that though, the contents of the 7 episode series is more than enough for viewers to appreciate the best fictionalisation of the war in Iraq so far.Generation Kill offers a view of the invasion from the perspective of a Battalion of US Marines, who have an 'embedded' reporter from Rolling Stone tagging along with them. Evan Wright (the reporter), i have just discovered, really did this in 2003 and won an award for his articles before also publishing them as a book. This is not something i was aware of when watching, i thought the characters were fictional, but it looks like their names and likely their characters, are very much the real thing. So it's the writing that is undoubtedly the driving force behind this miniseries, but nothing should be taken away from the production team who brilliantly recreate the look and feel of Iraq - not that i've ever been there, I just experienced it from the comfort and safety of my TV armchair - which they managed on location in Africa. Susanna White in particular caught my eye with the episodes she directed and we'll no doubt be seeing much more great projects from her in the future (how many women have directed war movies/TV? not many i can think of).The soldier's motto's of 'get some' and 'stay frosty' are great summations of their time in Iraq. While they want to see action like any committed soldier would, they also have strict codes and orders from on high to adhere to - some reasonable, some perplexing. Incompetence appears frequently, both in command and lower down the ranks. One itchy trigger finger leads to the christening of Whopper Junior, while their Captain's committence to his country's cause earns him the name Captain America. Iceman though, like many people, was my favourite character. Watch out, the Skarsgard's are coming! The morality of the Battalion is superbly played out, and it's hard not to like any of them, even the more suspect Whopper Junior as they warm to the reporter and the Iraqis during their mission. The series is not really critical of the soldiers, but in truly Wire style, critical of the process and of command, of politics and society, not of Americans but of the systems and powers that govern them with humour and humanity shining all the way through. A really nice touch is the real audio of soldier re-con at the end of each episode. The final ep brings with it the weightiest of these clips where a soldier, ironically or seriously, eloquently assesses his role as a marine, by saying 'On the seventh day, when god rested, we overran his perimeter and we've been running the show ever since...' A brilliant truth of American attitudes toward the world, war and god."
    },
    {
      "username": "gregory-jon",
      "userUrl": "https://www.imdb.com/user/ur3600649",
      "reviewLink": "https://www.imdb.com/review/rw1920382",
      "warningSpoilers": false,
      "date": "29 July 2008",
      "rate": "10",
      "helpful": "45 out of 97 found this helpful.",
      "title": "Great show",
      "content": "Saw the first three episodes of this on cable whilst on holiday, and hope it comes to the UK very soon so that I can see the rest. I also saw part of the 'Making of...' documentary, and many of the production team where a) female and b)British. They've done a really excellent job of portraying the atmosphere of war-torn Iraq, and have not compromised the performances by trying to tone down the language and jingoistic views of many of the characters. Heart pounding action whilst transiting the first town when the convoy comes under fire for the first time, and euphoria when they emerge at the far side largely unscathed. Brilliant. Well done. A really fine piece of work. Snap it up BBC.......please!"
    },
    {
      "username": "siderite",
      "userUrl": "https://www.imdb.com/user/ur3146136",
      "reviewLink": "https://www.imdb.com/review/rw2188188",
      "warningSpoilers": false,
      "date": "8 January 2010",
      "rate": "10",
      "helpful": "5 out of 14 found this helpful.",
      "title": "Like The Hurt Locker was a miniseries and it was about marines",
      "content": "Having seen a lot of American war movies, I had expected an emotional tale of courageous heroes fighting and dying for their country and ideals. However, being an HBO series (thank you for existing, people!) the film was realistic, consistent and complex in a non flashy way.Imagine a reconnaissance team of marines going into Iraq in 2003 after extensive training, only to become the victim of the bureaucracy and politics of the military. The few people fighting them are unskilled and ill equipped fanatics who die slaughtered in their hundreds without landing a shot. The bleak story of 21 days in which the American military totally won the war in Iraq, only to lose gradually whatever glory they have earned in the process.Let me reiterate that the story is not a combat story, but a character piece and a situation piece. Unlike other people, I don't think it was meant to criticize the military beyond the truth. It showed the good and the mostly bad, the pathetic squirming of humans placed in different situations.As a professional software engineer I can't help but notice the resemblance of the military structure to that of tech companies, complete with office politics and lack of communication between leadership levels. The problem is the clients of this \"military company\" are the American and Iraqi civilians, and they get screwed in the end."
    },
    {
      "username": "Cinemaniac1984",
      "userUrl": "https://www.imdb.com/user/ur1444027",
      "reviewLink": "https://www.imdb.com/review/rw3440491",
      "warningSpoilers": false,
      "date": "28 March 2016",
      "rate": "10",
      "helpful": "4 out of 9 found this helpful.",
      "title": "An outstanding, one-of-a-kind mini series.",
      "content": "Generation Kill is a one-of-a-kind seven part mini series that features an authentic warts and all, no punches pulled take on the 2003 Invasion of Iraq told through the eyes of the United States Marine Corps' 1st Reconnaissance Battalion and the Rolling Stones reporter assigned to write a story on the US Marines and their various experiences during their tour of duty in Iraq.While the Marines struggle with inadequate supplies, behind the scenes bureaucratic power plays, and poor communication they kill the time with pizza, pranks, keeping fit, insulting each other, fantasising about killing the enemy, and proving themselves amongst their fellow marines as well as their family and friends at home by being involved in spearheading a campaign that has divided the USA and around the world following the fateful events of September 11. Despite a majority of the time spent in \"stop and start\" moments as well as the dreaded waiting around, when it comes time for switch on they do so when they come under threat or when they successfully take down any enemy combatants.The cast is brilliant. If you are patient with the storyline it will pay off in the end. There is a mixture of comedic, dramatic, horrific and Those that have served in the military will empathise and understand not only what its like on deployment but what it is like to be undersupplied and screwed around by the chain of command as well as serving with a variety of members that are either likable or downright annoying and Generation Kill nails this with the utmost authenticity.Based on the true to life novel by Evan Wright, Generation Kill is brought to life on the television screen and thoroughly deserves its critical acclaim. Generation Kill was also a very rewarding experience and certainly one of my favourite mini series that I had the pleasure of watching.Reward yourself and check this mini series out.10/10."
    },
    {
      "username": "rgh-18543",
      "userUrl": "https://www.imdb.com/user/ur125081512",
      "reviewLink": "https://www.imdb.com/review/rw6167350",
      "warningSpoilers": false,
      "date": "11 October 2020",
      "rate": "10",
      "helpful": "6 out of 8 found this helpful.",
      "title": "Almost Perfect",
      "content": "Ok. First off, I've never served in the military and definitely have been in a combat zone. So - my opinion is the opinion of an educated, but largely personally ingorant viewer of a war series.So. Then. Disclosure having been made, I have watched this series easily, start to finish, 20 times. It's a go-to in my iPad when I travel - and it's always engaging.The depth is was gets me. I read the book, and the series is a good adaptation - giving the viewer the incredibly nuanced view of what the First Recon Marines experienced in the invasion of Iraq.Now - I've read a review form New York Times writer Troy Patterson - who obviously disliked it - and as you would expect from the NYT the opinion comes from a place of intentional ignorance - and, largely, from complete failure to see the depth of the actors and the experience of Marines in that theater.For example - the false bravado - and superficially racist banter that pervades the series - is an incredibly interesting contrast the reality of how every one of these men would put down their lives for their brothers, black, white, brown, whatever. They understand, implicitly, that \"sticks and stone (and bullets) break bones - while people of substance understand just how trivial and inconsequential words are in a place where people are trying to kill you and you need to have faith in your right and left hand fellow soldier.Ultimately, the series is just that - a study in contrasts - the boredom followed by frenetic fear. The need to adhere to orders, and the gross incompetence of some who give them. Ultimately, the series transcends it's own setting and gives us a slice of reality that illustrates how some things matter and some things don't.When people are killing and being killed - there is no place for discussion of \"safe spaces\" or \"microaggressions\".Just a great, great series. Watch it."
    },
    {
      "username": "rrtxdos",
      "userUrl": "https://www.imdb.com/user/ur19665136",
      "reviewLink": "https://www.imdb.com/review/rw1922336",
      "warningSpoilers": false,
      "date": "1 August 2008",
      "rate": "8",
      "helpful": "57 out of 116 found this helpful.",
      "title": "Great TV, no fodder for axe-grinders",
      "content": "The USMC recon environment seems a lot like pretty much any organization: Understaffed, with the most complex decisions being dropped on the shoulders of unknown middle managers who can have their career terminated by a single error. Upper management has to juggle with the demands of hands-off managers with little understanding of the \"battlefield\" and the unpleasant task of making calls that are going to earn them no friends. Toss in with that the unavoidable reality of some commanders who might even just have one bad day - or make a snap judgment based on incomplete information, only to realize with horror what they wish they had known.After watching this and remembering that these are not unlike what we've come to expect from our real troops, I'm a little humbled at my own gripes about the crummy food at my last business meeting.Reality aside, this is a wonderfully rich production. The heat of the days and cold of the nights really comes through, and you can't help but flinch as a stray round whistles past. The characters often exhibit more depth than you expect - but also, sometimes less - allowing us the privilege of an occasional chuckle.After three episodes, I find my political views little changed, but my admiration and empathy for the 20-somethings who live this reality every day, greatly increased. The show is about the characters in it, not the politics or policies which put them in any particular place."
    },
    {
      "username": "leftbanker-1",
      "userUrl": "https://www.imdb.com/user/ur20309759",
      "reviewLink": "https://www.imdb.com/review/rw4265033",
      "warningSpoilers": false,
      "date": "2 August 2018",
      "rate": "10",
      "helpful": "4 out of 12 found this helpful.",
      "title": "Young men think that war is all glamour and glory, but let me tell you, boys, it is all Hell!",
      "content": "Tecumseh Sherman would have given this series 10 stars, I'm sure. Highly entertaining and informative, it tells of the ill-fated Iraq War which any sane person today would say was a total disgrace. Wright definitely sided with the enlisted grunts and portrayed the officers as mostly morons or psychos or both. The series was quite a bit more political than the book.I thought that the football game in the last episode was a brilliant bit of story telling. I also think that the game of football contributes to the violent nature of America.Generation Kill is one of the best series I've ever seen, perhaps THE best. The casting was so spot on that it couldn't have been improved upon. The dialogue at every step of the narrative was filled with humor, insight into the military culture, and tells the viewer a lot about what it is like to be at war."
    }
  ],
  "errorMessage": ""
}