{
  "imDbId": "tt0088509",
  "title": "Dragon Ball",
  "fullTitle": "Dragon Ball (TV Series 1986–1989)",
  "type": "TVSeries",
  "year": "1986",
  "language": "en",
  "titleInLanguage": "Dragon Ball (TV series)",
  "url": "https://en.wikipedia.org/wiki/Dragon_Ball_(TV_series)",
  "plotShort": {
    "plainText": "Dragon Ball (Japanese: ドラゴンボール, Hepburn: Doragon Bōru) is a Japanese anime television series produced by Toei Animation. It is an adaptation of the first 194 chapters of the manga of the same name created by Akira Toriyama, which were published in Weekly Shōnen Jump from 1984 to 1995. The anime is composed of 153 episodes that were broadcast on Fuji TV from February 1986 to April 1989. It was broadcast in 81 countries worldwide. It is part of the Dragon Ball media franchise.",
    "html": "<p>Dragon Ball (Japanese: ドラゴンボール, Hepburn: Doragon Bōru) is a Japanese anime television series produced by Toei Animation. It is an adaptation of the first 194 chapters of the manga of the same name created by Akira Toriyama, which were published in Weekly Shōnen Jump from 1984 to 1995. The anime is composed of 153 episodes that were broadcast on Fuji TV from February 1986 to April 1989. It was broadcast in 81 countries worldwide. It is part of the Dragon Ball media franchise.</p>"
  },
  "plotFull": {
    "plainText": "Dragon Ball (Japanese: ドラゴンボール, Hepburn: Doragon Bōru) is a Japanese anime television series produced by Toei Animation. It is an adaptation of the first 194 chapters of the manga of the same name created by Akira Toriyama, which were published in Weekly Shōnen Jump from 1984 to 1995. The anime is composed of 153 episodes that were broadcast on Fuji TV from February 1986 to April 1989. It was broadcast in 81 countries worldwide. It is part of the Dragon Ball media franchise.\r\nPlot\r\nEmperor Pilaf Saga\r\nThe series begins with a young monkey-tailed boy named Goku befriending a teenage girl named Bulma. Together, they go on an adventure to find the seven mystical Dragon Balls (ドラゴンボール), which have the ability to summon the powerful dragon Shenron, who can grant whoever summons him their greatest desire. The journey leads to a confrontation with the shape-shifting pig Oolong, as well as a desert bandit named Yamcha and his companion Pu'ar, who all later become allies; Chi-Chi, whom Goku unknowingly agrees to marry; and Emperor Pilaf, a blue-skinned imp who seeks the Dragon Balls to fulfill his desire of becoming ruler of the world. Oolong stops Pilaf from using the Dragon Balls by wishing for a pair of panties.\r\nWorld Martial Arts Tournament Saga\r\nGoku undergoes rigorous training under the martial artist Master Roshi in order to fight in the World Martial Arts Tournament (天下一武道会, \"Tenkaichi Budōkai\") that attracts the most powerful fighters in the world. A monk named Krillin becomes his training partner and rival, but they soon become best friends.\r\nRed Ribbon Army Saga\r\nAfter the tournament, Goku sets out on his own to recover the Dragon Ball his deceased grandfather left him and encounters a terrorist organization known as the Red Ribbon Army, whose diminutive leader, Commander Red, wants to collect the Dragon Balls so that he can use them to become taller. He almost single-handedly defeats the army, including their hired assassin Mercenary Tao, whom he originally loses to, but after training under the hermit Korin, easily beats. Goku reunites with his friends to defeat Fortuneteller Baba's fighters and have her locate the last Dragon Ball in order to revive a friend killed by Tao.\r\nKing Piccolo Saga\r\nGoku and his friends reunite at the World Martial Arts Tournament three years later and meet Master Roshi's rival and Tao's brother, Master Shen, and his students Tien Shinhan and Chiaotzu, who vow to exact revenge for Tao's apparent death at the hands of Goku. Krillin is murdered after the tournament and Goku tracks down and is defeated by his killer, Tambourine, and the Demon King Piccolo. The overweight samurai Yajirobe takes Goku to Korin, where he receives healing and a power boost. Meanwhile, Piccolo kills both Master Roshi and Chiaotzu, and uses the Dragon Balls to give himself eternal youth before destroying Shenron, which results in the Dragon Balls' destruction. As King Piccolo prepares to destroy West City as a show of force, Tien Shinhan arrives to confront him, but is defeated and nearly killed. Goku arrives in time to save Tien and then kills King Piccolo by blasting a hole through his chest.\r\nPiccolo Junior Saga\r\nJust before he dies, King Piccolo spawns his final son, Piccolo Junior. Korin informs Goku that Kami, the original creator of the Dragon Balls, might be able to restore Shenron and the Dragon Balls so that Goku can wish his fallen friends back to life, which he does. He also stays and trains under Kami for the next three years, once again reuniting with his friends at the Martial Arts Tournament, as well as a now-teenaged Chi-Chi and the revived Mercenary Tao. Piccolo Junior also enters the tournament to avenge his father's death, leading to the final battle between him and Goku. After Goku narrowly wins and defeats Piccolo Junior, he leaves with Chi-Chi and they get married, leading to the events of Dragon Ball Z.\r\nProduction\r\nKazuhiko Torishima, Toriyama's editor for Dr. Slump and the first half of Dragon Ball, said that because the Dr. Slump anime was not successful in his opinion, he and Shueisha were a lot more hands on for the Dragon Ball anime. Before production even began, they created a huge \"bible\" for the series detailing even merchandise. He himself studied the best way to present anime and its business side, discussing it with the Shogakukan team for Doraemon.\r\nToriyama had some involvement in the production of the anime. When it began he did mention to the staff that they seemed to be making it too colorful by forcing the color palette of Dr. Slump on it. He also listened to the voice actors' audition tapes before choosing Masako Nozawa to play Goku. He would go on to state that he would hear Nozawa's voice in his head when writing the manga. Toriyama specified Kuririn's voice actress be Mayumi Tanaka after hearing her work as the main character Giovanni in Night on the Galactic Railroad. Tōru Furuya remarked that there were not many auditions for the characters because the cast was made up of veteran voice actors. Performing the roles was not without its difficulties, Toshio Furukawa, the voice of Piccolo, said it was difficult to constantly perform with a low voice because his normal lighter voice would break through if he broke concentration.\r\nShunsuke Kikuchi composed the score for Dragon Ball. The opening theme song for all of the episodes is \"Makafushigi Adventure!\" (魔訶不思議アドベンチャー！, Makafushigi Adobenchā!, \"Mystical Adventure!\") performed by Hiroki Takahashi in Japanese and Jimi Tunnell in English. The ending theme is \"Romantic Ageru yo\" (ロマンティックあげるよ, Romantikku Ageru yo, \"I'll Give You Romance\") performed by Ushio Hashimoto in Japanese and Daphne Gere in English.\r\nFeeling that the Dragon Ball anime's ratings were gradually declining because it had the same producer that worked on Dr. Slump, who had a \"cute and funny\" image connected to Toriyama's work and was missing the more serious tone, Torishima asked the studio to change the producer. Impressed with their work on Saint Seiya, he asked its director Kōzō Morishita and writer Takao Koyama to help \"reboot\" Dragon Ball; which coincided with the beginning of Dragon Ball Z.\r\nEnglish localization and Broadcasting\r\nIn 1989 and 1990, Harmony Gold USA licensed the series for an English-language release in North America. In the voice dubbing of the series, Harmony Gold renamed almost all of the characters, including the protagonist Goku, who was renamed \"Zero.\" This dub consisting of 5 episodes and one movie (an 80-minute feature featuring footage of movies 1 and 3 edited together) was cancelled shortly after being test marketed in several US cities and was never broadcast to the general public, thus earning the fan-coined term \"The Lost Dub.\"\r\nA subtitled Japanese version of the series was first broadcast in the United States by the Hawaii-based Nippon Golden Network. The series aired in a 6AM slot on Tuesdays from 1992 to 1994, before the network moved on to Dragon Ball Z.\r\nIn 1995, Funimation (founded a year earlier in California) acquired the license for the distribution of Dragon Ball in the United States as one of its first imports. They contracted Josanne B. Lovick Productions and voice actors from Ocean Productions to create an English version for the anime and first movie in Vancouver, British Columbia. The dubbed episodes were edited for content, and contained different music. Thirteen episodes aired in first-run syndication during the fall of 1995 before Funimation canceled the project due to low ratings.\r\nIn March 2001, as the sequel series Dragon Ball Z became its signature license, Funimation announced the return of the original Dragon Ball series to American television, featuring a new English version produced in-house with slightly less editing for broadcast (though the episodes remained uncut for home video releases), and they notably left the original background music intact. The re-dubbed episodes aired on Cartoon Network from August 20, 2001, to December 1, 2003. Funimation also broadcast the series on Colours TV and their own Funimation Channel starting in 2006. This English dub was also broadcast in Australia and New Zealand. In Canada and Europe, an alternative dubbed version was produced by AB Groupe (in association with Blue Water Studios) and was aired in those territories instead of the Funimation version.\r\nContent edits\r\nThe US version of Dragon Ball was aired on Cartoon Network with numerous digital cosmetic changes, which were done to remove nudity and blood, and dialogue edits, such as when Puar says why Oolong was expelled from shapeshifting school, instead of saying that he stole the teacher's panties, it was changed to him stealing the teacher's papers. Some scenes were deleted altogether, either to save time or remove strong violence. Nudity was also covered up; for Goku's bathing scene, Funimation drew a chair to cover his genitals where it was uncensored previously. References to alcohol and drugs were removed, for example, when Jackie Chun (Master Roshi) uses Drunken Fist Kung Fu in the 21st Tenkaichi Budokai, Funimation called it the \"Mad Cow Attack.\" Also, the famous \"No Balls!\" scene was deleted from episode 2, and when Bulma places panties on the fishing hook to get Oolong (in fish form), they digitally painted away the panties and replaced it with some money.\r\nChanges also lead to confusing context and the content of the scenes; as when Bulma helps Goku take a bath. In the Japanese version, the two characters do not cover their privates because Goku is innocent of the differences in gender and Bulma believes Goku to be a little boy. While bathing Bulma asks Goku his age and only when Goku reveals himself to be fourteen does Bulma throw things at Goku before kicking him out of the bath. In the Funimation version the dialogue was changed; with Goku remarking that Bulma did not have a tail and it must be inconvenient for her when bathing.\r\nOther media\r\nHome media\r\nIn Japan, Dragon Ball did not receive a proper home video release until July 7, 2004, fifteen years after its broadcast. Pony Canyon announced a remastering of the series in a single 26-disc DVD box set, that was made-to-order only, referred to as a \"Dragon Box\". Since then, Pony Canyon content of this set began being released on mass-produced individual 6-episode DVDs on April 4, 2007, and finished with the 26th volume on December 5, 2007.\r\nOriginal releases\r\nDragon Ball's initial VHS release for North America was never completed. Funimation released their initial dub, the edited and censored first thirteen episodes, on six tapes from September 24, 1996, to February 28, 1998 together with Trimark Pictures. These episodes and the first movie were later released in a VHS or DVD box set on October 24, 2000. Funimation began releasing their in-house dub beginning with episode 14 by themselves on December 5, 2001, in both edited and uncut formats, only to cease VHS releases two years later on June 1, 2003 in favor for the DVD box sets. Including the initial 1996-1998 releases with Trimark, 86 episodes of Dragon Ball across 28 volumes were produced on VHS for North America.\r\nFunimation released their own in-house dub to ten two-disc DVD box sets between January 28, 2003, and August 19, 2003. Each box set, spanning an entire \"saga\" of the series, included the English and Japanese audio tracks with optional English subtitles, and uncut video and audio. However, they were unable to release the first thirteen episodes at the time, due to Lions Gate Entertainment holding the home video rights to their previous dub of the same episodes, having acquired them from Trimark after the company became defunct. After Lions Gate Family Entertainment's license and home video distribution rights to the first thirteen episodes expired in 2009, Funimation has released and remastered the complete Dragon Ball series to DVD in five individual uncut season box sets, with the first set released on September 15, 2009, and the final on July 27, 2010.\r\nFunimation's English dub of Dragon Ball has been distributed in other countries by third parties. Madman Entertainment released the first thirteen episodes of Dragon Ball and the first movie uncut in Australasia in a DVD set on March 10, 2004. They produced two box sets containing the entire series in 2006 and 2007. Manga Entertainment began releasing Funimation's five remastered sets in the United Kingdom in 2014.\r\nDragon Ball: Yo! Son Goku and His Friends Return!! (ドラゴンボール オッス！帰ってきた孫悟空と仲間たち！！ Doragon Bōru: Ossu! Kaette Kita Son Gokū to Nakama-tachi!!) is the second Dragon Ball Z OVA and features the first Dragon Ball animation in nearly a decade, following a short story arc in the remade Dr. Slump anime series featuring Goku and the Red Ribbon Army in 1999. The film premiered in Japan on September 21, 2008, at the Jump Super Anime Tour in honor of Weekly Shōnen Jump's fortieth anniversary. Yo! Son Goku and His Friends Return!! is also in the extra DVD included in the Dragon Ball Z: Battle of Gods limited edition, which was released on September 13, 2013.\r\nRemastered releases\r\nManga\r\nFilms\r\nDuring the anime's broadcast, three theatrical animated Dragon Ball films were produced. The first was Curse of the Blood Rubies in 1986, followed by Sleeping Princess in Devil's Castle in 1987, and Mystical Adventure in 1988. In 1996 The Path to Power was produced in order to commemorate the anime's tenth anniversary.\r\nVideo games\r\nSeveral video games based on Dragon Ball have been created, beginning with Dragon Daihikyō in 1986. Shenlong no Nazo, produced that same year, was the first to be released outside Japan. 1988's North American version was titled Dragon Power and was heavily Americanized with all references to Dragon Ball removed; characters' names and appearances were changed. Additional games based on the series include Advanced Adventure, Dragon Ball: Origins, its sequel, and Revenge of King Piccolo.\r\nSoundtracks\r\nDragon Ball has been host to several soundtrack releases, the first being Dragon Ball: Music Collection in 1986. Dragon Ball: Saikyō e no Michi Original Soundtrack is composed entirely of music from the tenth anniversary film. In 1995 Dragon Ball: Original USA TV Soundtrack Recording was released featuring the music from the Funimation/Ocean American broadcast.\r\nReception\r\nThe show's initial U.S. broadcast run in 1995 met with mediocre ratings.\r\nIn 2000 satellite TV channel Animax together with Brutus, a men's lifestyle magazine, and Tsutaya, Japan's largest video rental chain, conducted a poll among 200,000 fans on the top anime series, with Dragon Ball coming in fourth. TV Asahi conducted two polls in 2005 on the Top 100 Anime, Dragon Ball came in second in the nationwide survey conducted among multiple age-groups and third in the online poll. On several occasions the Dragon Ball anime has topped Japan's DVD sales.\r\nOtaku USA's Joseph Luster called Dragon Ball \"one of the most memorable animated action/comedy series of all time.\" He cited the comedy as a key component to the show, noting that this might surprise those only familiar with Z. Todd Douglass of DVD Talk referred to it as \"a classic among classics stands as a genre defining kind of show.\" and wrote that \"It's iconic in so many ways and should be standard watching for otaku in order to appreciate the genius of Akira Toriyama.\" He had strong praise for the \"deep, insightful, and well-developed\" characters, writing \"Few shows can claim to have a cast quite like Dragon Ball's, and that's a testament to the creative genius of Toriyama.\"\r\nT.H.E.M. Anime Reviews' Tim Jones gave the show four out of five stars, referring to it as a forerunner to modern fighting anime and still one of the best. He also stated that it has much more character development than its successors Dragon Ball Z and Dragon Ball GT. Carl Kimlinger of Anime News Network summed up Dragon Ball as \"an action-packed tale told with rare humor and something even rarer—a genuine sense of adventure.\" Kimlinger and Theron Martin, also of Anime News Network, noted Funimation's reputation for drastic alterations of the script, but praised the dub.\r\nThe positive impact of Dragon Ball's characters has manifested itself in the personal messages Masako Nozawa sent to children as taped messages in the voice of Goku, Gohan and Goten. Nozawa takes pride in her role and sends words of encouragement that have resulted in children in comas responding to the voice of the characters.",
    "html": "<p>Dragon Ball (Japanese: ドラゴンボール, Hepburn: Doragon Bōru) is a Japanese anime television series produced by Toei Animation. It is an adaptation of the first 194 chapters of the manga of the same name created by Akira Toriyama, which were published in Weekly Shōnen Jump from 1984 to 1995. The anime is composed of 153 episodes that were broadcast on Fuji TV from February 1986 to April 1989. It was broadcast in 81 countries worldwide. It is part of the Dragon Ball media franchise.</p><br/><h3>Plot</h3><h4>Emperor Pilaf Saga</h4><p>The series begins with a young monkey-tailed boy named Goku befriending a teenage girl named Bulma. Together, they go on an adventure to find the seven mystical Dragon Balls (ドラゴンボール), which have the ability to summon the powerful dragon Shenron, who can grant whoever summons him their greatest desire. The journey leads to a confrontation with the shape-shifting pig Oolong, as well as a desert bandit named Yamcha and his companion Pu'ar, who all later become allies; Chi-Chi, whom Goku unknowingly agrees to marry; and Emperor Pilaf, a blue-skinned imp who seeks the Dragon Balls to fulfill his desire of becoming ruler of the world. Oolong stops Pilaf from using the Dragon Balls by wishing for a pair of panties.</p><h4>World Martial Arts Tournament Saga</h4><p>Goku undergoes rigorous training under the martial artist Master Roshi in order to fight in the World Martial Arts Tournament (天下一武道会, \"Tenkaichi Budōkai\") that attracts the most powerful fighters in the world. A monk named Krillin becomes his training partner and rival, but they soon become best friends.</p><h4>Red Ribbon Army Saga</h4><p>After the tournament, Goku sets out on his own to recover the Dragon Ball his deceased grandfather left him and encounters a terrorist organization known as the Red Ribbon Army, whose diminutive leader, Commander Red, wants to collect the Dragon Balls so that he can use them to become taller. He almost single-handedly defeats the army, including their hired assassin Mercenary Tao, whom he originally loses to, but after training under the hermit Korin, easily beats. Goku reunites with his friends to defeat Fortuneteller Baba's fighters and have her locate the last Dragon Ball in order to revive a friend killed by Tao.</p><h4>King Piccolo Saga</h4><p>Goku and his friends reunite at the World Martial Arts Tournament three years later and meet Master Roshi's rival and Tao's brother, Master Shen, and his students Tien Shinhan and Chiaotzu, who vow to exact revenge for Tao's apparent death at the hands of Goku. Krillin is murdered after the tournament and Goku tracks down and is defeated by his killer, Tambourine, and the Demon King Piccolo. The overweight samurai Yajirobe takes Goku to Korin, where he receives healing and a power boost. Meanwhile, Piccolo kills both Master Roshi and Chiaotzu, and uses the Dragon Balls to give himself eternal youth before destroying Shenron, which results in the Dragon Balls' destruction. As King Piccolo prepares to destroy West City as a show of force, Tien Shinhan arrives to confront him, but is defeated and nearly killed. Goku arrives in time to save Tien and then kills King Piccolo by blasting a hole through his chest.</p><h4>Piccolo Junior Saga</h4><p>Just before he dies, King Piccolo spawns his final son, Piccolo Junior. Korin informs Goku that Kami, the original creator of the Dragon Balls, might be able to restore Shenron and the Dragon Balls so that Goku can wish his fallen friends back to life, which he does. He also stays and trains under Kami for the next three years, once again reuniting with his friends at the Martial Arts Tournament, as well as a now-teenaged Chi-Chi and the revived Mercenary Tao. Piccolo Junior also enters the tournament to avenge his father's death, leading to the final battle between him and Goku. After Goku narrowly wins and defeats Piccolo Junior, he leaves with Chi-Chi and they get married, leading to the events of Dragon Ball Z.</p><br/><h3>Production</h3><p>Kazuhiko Torishima, Toriyama's editor for Dr. Slump and the first half of Dragon Ball, said that because the Dr. Slump anime was not successful in his opinion, he and Shueisha were a lot more hands on for the Dragon Ball anime. Before production even began, they created a huge \"bible\" for the series detailing even merchandise. He himself studied the best way to present anime and its business side, discussing it with the Shogakukan team for Doraemon.</p><p>Toriyama had some involvement in the production of the anime. When it began he did mention to the staff that they seemed to be making it too colorful by forcing the color palette of Dr. Slump on it. He also listened to the voice actors' audition tapes before choosing Masako Nozawa to play Goku. He would go on to state that he would hear Nozawa's voice in his head when writing the manga. Toriyama specified Kuririn's voice actress be Mayumi Tanaka after hearing her work as the main character Giovanni in Night on the Galactic Railroad. Tōru Furuya remarked that there were not many auditions for the characters because the cast was made up of veteran voice actors. Performing the roles was not without its difficulties, Toshio Furukawa, the voice of Piccolo, said it was difficult to constantly perform with a low voice because his normal lighter voice would break through if he broke concentration.</p><p>Shunsuke Kikuchi composed the score for Dragon Ball. The opening theme song for all of the episodes is \"Makafushigi Adventure!\" (魔訶不思議アドベンチャー！, Makafushigi Adobenchā!, \"Mystical Adventure!\") performed by Hiroki Takahashi in Japanese and Jimi Tunnell in English. The ending theme is \"Romantic Ageru yo\" (ロマンティックあげるよ, Romantikku Ageru yo, \"I'll Give You Romance\") performed by Ushio Hashimoto in Japanese and Daphne Gere in English.</p><p>Feeling that the Dragon Ball anime's ratings were gradually declining because it had the same producer that worked on Dr. Slump, who had a \"cute and funny\" image connected to Toriyama's work and was missing the more serious tone, Torishima asked the studio to change the producer. Impressed with their work on Saint Seiya, he asked its director Kōzō Morishita and writer Takao Koyama to help \"reboot\" Dragon Ball; which coincided with the beginning of Dragon Ball Z.</p><h4>English localization and Broadcasting</h4><p>In 1989 and 1990, Harmony Gold USA licensed the series for an English-language release in North America. In the voice dubbing of the series, Harmony Gold renamed almost all of the characters, including the protagonist Goku, who was renamed \"Zero.\" This dub consisting of 5 episodes and one movie (an 80-minute feature featuring footage of movies 1 and 3 edited together) was cancelled shortly after being test marketed in several US cities and was never broadcast to the general public, thus earning the fan-coined term \"The Lost Dub.\"</p><p>A subtitled Japanese version of the series was first broadcast in the United States by the Hawaii-based Nippon Golden Network. The series aired in a 6AM slot on Tuesdays from 1992 to 1994, before the network moved on to Dragon Ball Z.</p><p>In 1995, Funimation (founded a year earlier in California) acquired the license for the distribution of Dragon Ball in the United States as one of its first imports. They contracted Josanne B. Lovick Productions and voice actors from Ocean Productions to create an English version for the anime and first movie in Vancouver, British Columbia. The dubbed episodes were edited for content, and contained different music. Thirteen episodes aired in first-run syndication during the fall of 1995 before Funimation canceled the project due to low ratings.</p><p>In March 2001, as the sequel series Dragon Ball Z became its signature license, Funimation announced the return of the original Dragon Ball series to American television, featuring a new English version produced in-house with slightly less editing for broadcast (though the episodes remained uncut for home video releases), and they notably left the original background music intact. The re-dubbed episodes aired on Cartoon Network from August 20, 2001, to December 1, 2003. Funimation also broadcast the series on Colours TV and their own Funimation Channel starting in 2006. This English dub was also broadcast in Australia and New Zealand. In Canada and Europe, an alternative dubbed version was produced by AB Groupe (in association with Blue Water Studios) and was aired in those territories instead of the Funimation version.</p><h4>Content edits</h4><p>The US version of Dragon Ball was aired on Cartoon Network with numerous digital cosmetic changes, which were done to remove nudity and blood, and dialogue edits, such as when Puar says why Oolong was expelled from shapeshifting school, instead of saying that he stole the teacher's panties, it was changed to him stealing the teacher's papers. Some scenes were deleted altogether, either to save time or remove strong violence. Nudity was also covered up; for Goku's bathing scene, Funimation drew a chair to cover his genitals where it was uncensored previously. References to alcohol and drugs were removed, for example, when Jackie Chun (Master Roshi) uses Drunken Fist Kung Fu in the 21st Tenkaichi Budokai, Funimation called it the \"Mad Cow Attack.\" Also, the famous \"No Balls!\" scene was deleted from episode 2, and when Bulma places panties on the fishing hook to get Oolong (in fish form), they digitally painted away the panties and replaced it with some money.</p><p>Changes also lead to confusing context and the content of the scenes; as when Bulma helps Goku take a bath. In the Japanese version, the two characters do not cover their privates because Goku is innocent of the differences in gender and Bulma believes Goku to be a little boy. While bathing Bulma asks Goku his age and only when Goku reveals himself to be fourteen does Bulma throw things at Goku before kicking him out of the bath. In the Funimation version the dialogue was changed; with Goku remarking that Bulma did not have a tail and it must be inconvenient for her when bathing.</p><br/><h3>Other media</h3><h4>Home media</h4><p>In Japan, Dragon Ball did not receive a proper home video release until July 7, 2004, fifteen years after its broadcast. Pony Canyon announced a remastering of the series in a single 26-disc DVD box set, that was made-to-order only, referred to as a \"Dragon Box\". Since then, Pony Canyon content of this set began being released on mass-produced individual 6-episode DVDs on April 4, 2007, and finished with the 26th volume on December 5, 2007.</p><h4>Original releases</h4><p>Dragon Ball's initial VHS release for North America was never completed. Funimation released their initial dub, the edited and censored first thirteen episodes, on six tapes from September 24, 1996, to February 28, 1998 together with Trimark Pictures. These episodes and the first movie were later released in a VHS or DVD box set on October 24, 2000. Funimation began releasing their in-house dub beginning with episode 14 by themselves on December 5, 2001, in both edited and uncut formats, only to cease VHS releases two years later on June 1, 2003 in favor for the DVD box sets. Including the initial 1996-1998 releases with Trimark, 86 episodes of Dragon Ball across 28 volumes were produced on VHS for North America.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Name</th><th>Tape #</th><th>Release Date</th><th>Episodes</th><th>Saga</th><th>Home Video Distributor</th></tr><tr><td>Secret of the Dragon Balls</td><td>1</td><td>September 24, 1996</td><td>1-2</td><td rowspan=\"6\">The Saga of Goku</td><td rowspan=\"6\">Kidmark / Lionsgate</td></tr><tr><td>The Nimbus Cloud of Roshi</td><td>2</td><td>December 17, 1996</td><td>3-4</td></tr><tr><td>Yamcha the Desert Bandit</td><td>3</td><td>May 23, 1997</td><td>5-6</td></tr><tr><td>The Ox-King on the Fire Mountain</td><td>4</td><td>August 19, 1997</td><td>7-8</td></tr><tr><td>Boss Rabbit's Magic Touch</td><td>5</td><td>January 19, 1998</td><td>9-10</td></tr><tr><td>The Legend of Goku</td><td>6</td><td>February 28, 1998</td><td>11-13</td></tr><tr><td>Roshi's Request</td><td>7</td><td>December 5, 2001</td><td>14-16</td><td rowspan=\"5\">Tournament Saga</td><td rowspan=\"23\">Funimation</td></tr><tr><td>Turtle Hermit Training</td><td>8</td><td>January 9, 2002</td><td>17-19</td></tr><tr><td>Fighters, Begin!</td><td>9</td><td>January 30, 2002</td><td>20-22</td></tr><tr><td>Semi Finals</td><td>10</td><td>February 11, 2002</td><td>23-25</td></tr><tr><td>The Final Test</td><td>11</td><td>February 27, 2002</td><td>26-28</td></tr><tr><td>The Hunt is On</td><td>12</td><td>March 30, 2002</td><td>29-31</td><td rowspan=\"5\">Red Ribbon Army Saga</td></tr><tr><td>Silver</td><td>13</td><td>April 16, 2002</td><td>32-34</td></tr><tr><td>Assault on Muscle Tower</td><td>14</td><td>April 30, 2002</td><td>35-38</td></tr><tr><td>White's Final Stand</td><td>15</td><td>May 9, 2002</td><td>39-42</td></tr><tr><td>West City Chase</td><td>16</td><td>May 21, 2002</td><td>43-45</td></tr><tr><td>Underwater Hunt</td><td>17</td><td>June 2, 2002</td><td>46-48</td><td rowspan=\"4\">General Blue Saga</td></tr><tr><td>The Pirate Cave</td><td>18</td><td>October 21, 2002</td><td>49-51</td></tr><tr><td>Hidden Treasure</td><td>19</td><td>October 28, 2002</td><td>52-54</td></tr><tr><td>Lost in Penguin Village</td><td>20</td><td>October 28, 2002</td><td>55-57</td></tr><tr><td>Danger for Hire</td><td>21</td><td>November 5, 2002</td><td>58-60</td><td rowspan=\"3\">Commander Red Saga</td></tr><tr><td>Korin Tower</td><td>22</td><td>November 15, 2002</td><td>61-64</td></tr><tr><td>The Battle is Won</td><td>23</td><td>November 30, 2002</td><td>65-67</td></tr><tr><td>Five Warriors</td><td>24</td><td>December 14, 2002</td><td>68-70</td><td rowspan=\"5\">Fortuneteller Baba Saga</td></tr><tr><td>Yamcha's Fall</td><td>25</td><td>December 21, 2002</td><td>71-73</td></tr><tr><td>Surprise Reunion</td><td>26</td><td>January 8, 2003</td><td>74-76</td></tr><tr><td>The Seventh Dragon Ball</td><td>27</td><td>January 20, 2003</td><td>77-79</td></tr><tr><td>Goku's Journey</td><td>28</td><td>February 10, 2003</td><td>80-83</td></tr><tr><td>Tournament Day</td><td>29</td><td>June 1, 2003</td><td>84-86</td><td rowspan=\"1\">Tien Shinhan Saga</td></tr></tbody></table><p>Funimation released their own in-house dub to ten two-disc DVD box sets between January 28, 2003, and August 19, 2003. Each box set, spanning an entire \"saga\" of the series, included the English and Japanese audio tracks with optional English subtitles, and uncut video and audio. However, they were unable to release the first thirteen episodes at the time, due to Lions Gate Entertainment holding the home video rights to their previous dub of the same episodes, having acquired them from Trimark after the company became defunct. After Lions Gate Family Entertainment's license and home video distribution rights to the first thirteen episodes expired in 2009, Funimation has released and remastered the complete Dragon Ball series to DVD in five individual uncut season box sets, with the first set released on September 15, 2009, and the final on July 27, 2010.</p><p>Funimation's English dub of Dragon Ball has been distributed in other countries by third parties. Madman Entertainment released the first thirteen episodes of Dragon Ball and the first movie uncut in Australasia in a DVD set on March 10, 2004. They produced two box sets containing the entire series in 2006 and 2007. Manga Entertainment began releasing Funimation's five remastered sets in the United Kingdom in 2014.</p><p>Dragon Ball: Yo! Son Goku and His Friends Return!! (ドラゴンボール オッス！帰ってきた孫悟空と仲間たち！！ Doragon Bōru: Ossu! Kaette Kita Son Gokū to Nakama-tachi!!) is the second Dragon Ball Z OVA and features the first Dragon Ball animation in nearly a decade, following a short story arc in the remade Dr. Slump anime series featuring Goku and the Red Ribbon Army in 1999. The film premiered in Japan on September 21, 2008, at the Jump Super Anime Tour in honor of Weekly Shōnen Jump's fortieth anniversary. Yo! Son Goku and His Friends Return!! is also in the extra DVD included in the Dragon Ball Z: Battle of Gods limited edition, which was released on September 13, 2013.</p><h4>Remastered releases</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Name</th><th>Date</th><th>Discs</th><th>Episodes</th><th>Sagas</th></tr><tr><td>Season One</td><td>September 15, 2009</td><td>5</td><td>1-31</td><td>Emperor Pilaf/Tournament Saga</td></tr><tr><td>Season Two</td><td>November 10, 2009</td><td>5</td><td>32-61</td><td>Red Ribbon Army/General Blue Saga</td></tr><tr><td>Season Three</td><td>February 2, 2010</td><td>5</td><td>62-92</td><td>Commander Red/Fortuneteller Baba Saga</td></tr><tr><td>Season Four</td><td>May 4, 2010</td><td>5</td><td>93-122</td><td>Tien Shinhan/King Piccolo Saga</td></tr><tr><td>Season Five</td><td>July 27, 2010</td><td>5</td><td>123-153</td><td>Piccolo Jr. Saga</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Name</th><th>Date</th><th>Discs</th><th>Episodes</th></tr><tr><td>Dragon Box: Dragon Ball DVD-BOX</td><td>July 7, 2004</td><td>26</td><td>1-153</td></tr></tbody></table><h4>Manga</h4><h4>Films</h4><p>During the anime's broadcast, three theatrical animated Dragon Ball films were produced. The first was Curse of the Blood Rubies in 1986, followed by Sleeping Princess in Devil's Castle in 1987, and Mystical Adventure in 1988. In 1996 The Path to Power was produced in order to commemorate the anime's tenth anniversary.</p><h4>Video games</h4><p>Several video games based on Dragon Ball have been created, beginning with Dragon Daihikyō in 1986. Shenlong no Nazo, produced that same year, was the first to be released outside Japan. 1988's North American version was titled Dragon Power and was heavily Americanized with all references to Dragon Ball removed; characters' names and appearances were changed. Additional games based on the series include Advanced Adventure, Dragon Ball: Origins, its sequel, and Revenge of King Piccolo.</p><h4>Soundtracks</h4><p>Dragon Ball has been host to several soundtrack releases, the first being Dragon Ball: Music Collection in 1986. Dragon Ball: Saikyō e no Michi Original Soundtrack is composed entirely of music from the tenth anniversary film. In 1995 Dragon Ball: Original USA TV Soundtrack Recording was released featuring the music from the Funimation/Ocean American broadcast.</p><br/><h3>Reception</h3><p>The show's initial U.S. broadcast run in 1995 met with mediocre ratings.</p><p>In 2000 satellite TV channel Animax together with Brutus, a men's lifestyle magazine, and Tsutaya, Japan's largest video rental chain, conducted a poll among 200,000 fans on the top anime series, with Dragon Ball coming in fourth. TV Asahi conducted two polls in 2005 on the Top 100 Anime, Dragon Ball came in second in the nationwide survey conducted among multiple age-groups and third in the online poll. On several occasions the Dragon Ball anime has topped Japan's DVD sales.</p><p>Otaku USA's Joseph Luster called Dragon Ball \"one of the most memorable animated action/comedy series of all time.\" He cited the comedy as a key component to the show, noting that this might surprise those only familiar with Z. Todd Douglass of DVD Talk referred to it as \"a classic among classics stands as a genre defining kind of show.\" and wrote that \"It's iconic in so many ways and should be standard watching for otaku in order to appreciate the genius of Akira Toriyama.\" He had strong praise for the \"deep, insightful, and well-developed\" characters, writing \"Few shows can claim to have a cast quite like Dragon Ball's, and that's a testament to the creative genius of Toriyama.\"</p><p>T.H.E.M. Anime Reviews' Tim Jones gave the show four out of five stars, referring to it as a forerunner to modern fighting anime and still one of the best. He also stated that it has much more character development than its successors Dragon Ball Z and Dragon Ball GT. Carl Kimlinger of Anime News Network summed up Dragon Ball as \"an action-packed tale told with rare humor and something even rarer—a genuine sense of adventure.\" Kimlinger and Theron Martin, also of Anime News Network, noted Funimation's reputation for drastic alterations of the script, but praised the dub.</p><p>The positive impact of Dragon Ball's characters has manifested itself in the personal messages Masako Nozawa sent to children as taped messages in the voice of Goku, Gohan and Goten. Nozawa takes pride in her role and sends words of encouragement that have resulted in children in comas responding to the voice of the characters.</p><br/>"
  },
  "errorMessage": ""
}