{
  "imDbId": "tt0108778",
  "title": "Friends",
  "fullTitle": "Friends (TV Series 1994–2004)",
  "type": "TVSeries",
  "year": "1994",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8574743",
      "warningSpoilers": false,
      "date": "29 September 2022",
      "rate": "9",
      "helpful": "62 out of 67 found this helpful.",
      "title": "One of the best sitcoms of all-time!",
      "content": "What can be said about Friends that hasn't already been said? It's easily one of the best sitcoms of all-time. It's on every \"best sitcoms ever\" list for a reason...because it is! If that doesn't convince you just read through these reviews and you'll see just how loved this show really is. The cast is perfect, not a weak link on the entire show. Almost everyone can find someone on the show that they identify with. I've seen every episode numerous times (considering it's always on) and I still laugh just as much on every watch as I did the first time I watched it. I'll continue to watch reruns and laugh and I doubt that I'll ever get bored with this show."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8147578",
      "warningSpoilers": false,
      "date": "16 May 2022",
      "rate": "9",
      "helpful": "64 out of 70 found this helpful.",
      "title": "Just as funny today!",
      "content": "I still love Friends as much now than I did when it was on 15-20 years ago. It's just one of those all-time great sitcoms that are just as funny watching reruns as it was watching for the first time! Not many shows are just as funny today as they were 15-20 years ago but Friends is absolutely one of those shows! All 6 characters are almost equally as funny! This truly is one of the best comedies that has ever been made!"
    },
    {
      "username": "Moviebility",
      "userUrl": "https://www.imdb.com/user/ur62206325",
      "reviewLink": "https://www.imdb.com/review/rw8618934",
      "warningSpoilers": false,
      "date": "18 October 2022",
      "rate": "9",
      "helpful": "43 out of 46 found this helpful.",
      "title": "Go-To show when you're sad",
      "content": "I won't lie when I say I'm probably one of the people who think this show is not funny. This has been recommended to me multiple times before I actually did give it a try. The first episode was meh but I kept watching until I found myself actually loving this show and it's really good and super chill. I think you actually have to know the characters more for you to appreciate their humor. This show is one of my go-to's when I'm feeling so down. Friends is so overrated and is always in most people's recommendations that you just keep on scrolling past through the list but seriously it's a good show and worth giving a shot!"
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw6295322",
      "warningSpoilers": false,
      "date": "21 November 2020",
      "rate": "9",
      "helpful": "91 out of 106 found this helpful.",
      "title": "Classic!",
      "content": "Friends is one of the best and most popular sitcoms in the history of television. I have to say that I still love it as much now than I did when it was originally on 15-20 years ago. Its about the lives of three young men (Matt LeBlanc, Matthew Perry & David Schwimmer) and three young women (Jennifer Aniston, Courtney Cox & Lisa Kidrow) that are all best friends and follows their lives in New York City. It's just one of those all-time great sitcoms that is just as funny watching reruns as it was watching for the first time! Not many shows are just as funny today as they were 15-20 years ago but Friends is absolutely one of those shows! All 6 characters are almost equally as funny! This truly is one of the best comedies that has ever been made!"
    },
    {
      "username": "Silverzero",
      "userUrl": "https://www.imdb.com/user/ur1828453",
      "reviewLink": "https://www.imdb.com/review/rw0332931",
      "warningSpoilers": false,
      "date": "18 January 2003",
      "rate": "",
      "helpful": "550 out of 689 found this helpful.",
      "title": "Still as funny as it was when it started back in '94",
      "content": "People are saying that friends is running out of ideas and that the humour is getting dull. Running out of ideas? possibly. Humour getting feeble? absolutely not. In fact it's getting better. OK, so perhaps they're beginning to \"pair up\" the six of them, but so what. Chandler's sarcasm is still as funny as ever. Monica's quirkiness still works. Phoebe's goofiness still brings about a smile. And Joey,Rachel and Ross are still as funny as they always were. So stop being a bunch of cynics and enjoy the show while it's still on."
    },
    {
      "username": "Mangalassery_Neelakandan",
      "userUrl": "https://www.imdb.com/user/ur88465445",
      "reviewLink": "https://www.imdb.com/review/rw8482342",
      "warningSpoilers": false,
      "date": "24 August 2022",
      "rate": "10",
      "helpful": "29 out of 32 found this helpful.",
      "title": "FINE WINE",
      "content": "The series aged like fine wine. I finished this whole series within a month like 236 episodes or more like 78 hours of content, that's how much interesting this series is. Some cliff hangers at the end of seasons is very suspenseful that i couldn't wait to watch the next season. Joey, Phoebe, Chandler, Monica, Ross & Rachel we like my friends by the end of the series. The comedic timing and all the funny elements of the show is on point. And the most important fact is that after finishing the series we could just start the series all over again and feel fresh. It has an immense amount of repeat value that we wouldn't get bored even after watching several times. I could go on for pages but the memes, the sitcom references, the stars the show created all speak form them selves."
    },
    {
      "username": "rossrobinson",
      "userUrl": "https://www.imdb.com/user/ur2094131",
      "reviewLink": "https://www.imdb.com/review/rw0332983",
      "warningSpoilers": false,
      "date": "12 November 2003",
      "rate": "",
      "helpful": "403 out of 548 found this helpful.",
      "title": "fantastic",
      "content": "Friends has got to be one of the best Us Sitcom comedys ever. I'll be sad for this programme to end next year in 2004 because the whole team did such a fantastic effort to put everthing into this series. It was such a great programme and i think it will always will be. After 10 seasons the programme comes to it's end. I give this 10 out of 10."
    },
    {
      "username": "RahulM007",
      "userUrl": "https://www.imdb.com/user/ur47264037",
      "reviewLink": "https://www.imdb.com/review/rw5212574",
      "warningSpoilers": true,
      "date": "25 October 2019",
      "rate": "10",
      "helpful": "24 out of 28 found this helpful.",
      "title": "The One that started it all!!!!!!!!",
      "content": "I started watching Friends this year and found it hilarious and amazingly written. The writing of the show is flawless. It truly is the funniest comedy I have ever seen. Each character is unique in its own way. The levity in the show is not what you would expect.Joey is the funniest character and his quirks and funny one liners never get old. He taught me to always have a humorous mind set in life and to not worry about what other people think if I do not understand something. Joey is in many ways the womanizer of the group and does not care too much what other people think and perceive of him. It is strange seeing him on the Joey show without Ross, Rachel, Chandler, Monica and Phoebe. He was a much better and funnier character on Friends. To be candid, I am not surprised that the Joey show got cancelled after two seasons.Ross is a character who got funnier over the course of the series. Introduced as a guy who got divorced by his lesbian wife, Ross built up quite a reputation. His relationship with Rachel had its ups and downs, but I always knew they were meant to be together. The writers and producers even teased their relationship in the series premiere. Ross's funniest line of the entire series is undoubtedly \"We were on a break\".Chandler is a character who changed and evolved the most. He was introduced as a guy who made sarcastic jokes about literally everything and never wanted to settle down with someone. He underwent a massive change in his life in the sixth season of the show. Season 6 was a major status quo shift for him.Rachel is a character who was introduced as this spoiled rich girl and slowly became successful and independent. She taught me that it is never too late to grow up and to never give up.Phoebe taught me to seize the day and savor every moment of life. Introduced as a person who never wanted to settle down with someone, that changed dramatically when she met Mike.Monica is a character who developed as a character and really found herself in season 5 when she started dating Chandler. I never expected Chandler and Monica to end up together. The phrase \"opposites attract\" is particularly true for them. Monica taught me to have an open mind and be bold.In a nutshell, Friends has something for everyone. It sheds a light on a variety of issues that are topical today. It is the funniest comedy I have ever seen. It is better than Two and a half men and The Big Bang Theory combined. Every episode is hilarious and makes you happy. For me, it does not decrease in quality nor are there terrible episodes. To be candid, no show can surpass Friends for its hilarity."
    },
    {
      "username": "Pookyiscute",
      "userUrl": "https://www.imdb.com/user/ur2692944",
      "reviewLink": "https://www.imdb.com/review/rw0333017",
      "warningSpoilers": false,
      "date": "23 March 2004",
      "rate": "",
      "helpful": "594 out of 837 found this helpful.",
      "title": "One of the best t.v. shows ever!",
      "content": "Easily in my top five category of funniest and best shows in prime time history.Everyone on this show is so witty and delivers their lines superbly that it's hard not to like all of them equally. However, I do have my favorite characters/actors/actresses, as I'm sure everyone who has watched the show even once or twice, to those who are avid fans of it.We'll start from least favorite to best character/actor.Matt Le Blanc/Joey Tribbiani:Although some might say, because of his boyish good looks, his cute jokes that he delivers now and then (very well, mind you), and his ability to make you feel sweet and sorry for him at the same time, he is a great actor, and plays his part as Joey Tribbiani really well, he's probably my least favorite on the show. I love him, don't get me wrong, but I just appreciate everyone else's talents on the show much more.Jennifer Aniston/Rachel Green: Rachel Green is a fun-loving, cute little waitress, who seems to always have trouble finding Mr. Right, who is plainly right in front of her 24/7. Who is that, you ask? Well, obviously Ross Gellar. Her roommate Monica's brother. Rachel is undoubtedly most everyone's favorite character who watches this show, just not mine. Sometimes her personality can get a little annoying, and although I like her better than Joey, not very much more. But, that doesn't go without saying that I don't love her in movies. Because, well, I do.Courtney Cox/Monica Gellar:It's hard to put Monica Gellar so far down the list, but if I have to make room for the other three, than so be it. As much as I love her on this show, she's just not as good as she is in the 'Scream' trilogy. But, she certainly does a good job convincing you that she hates to be wrong, has to have everything her way, and is a real trooper with most all of her challenges on the show, that the writers give her.Lisa Kudrow/Pheobe Buffey: Now, I love Lisa Kudrow. She is definitely one of the funniest woman comedians, which is why I classify her as my favorite female on the show. She outdid herself in 'Romy And Michele's High School Reunion', but she's extraordinary on this show. She's so ingenious with her comedy which is no doubt why she's won several awards for her role on the program.David Schwimmer/Ross Gellar:It's so funny to me that I like him so much. He's not the best actor in my opinion, but he was really good in Kissing A Fool, and really just ok in The Pallbearer, but my second favorite on the show. He's so funny and he cracks me up with all of his facial expressions and the excellent way he delivers his lines. He is definitely my second favorite character and actor on the show.Matthew Perry/Chandler Bing:They should have a shrine dedicated to this man. He is so outstandingly funny in every single project that he works on! He is so hysterical and a true actor in everything that he does, it is amazing that someone can be so talented. I wish that he were given more roles than just the few comedies he's been in, including Friends. But, he is such a great character on the show, it's hard to picture the program without him. With that being said, I would also like to add that he is not only the best actor on the show, and one of my personal favorites, but I also believe that he would be such a great dramatic actor if given the chance. If you've seen him in 'She's Out Of Control' you'll know what I'm talking about.So, with that I give this show a definite 10/10. It's one of the best shows to come out within the last ten years, and definitely on my top five best shows of all time list.And that's my review."
    },
    {
      "username": "alizafatyma",
      "userUrl": "https://www.imdb.com/user/ur155508516",
      "reviewLink": "https://www.imdb.com/review/rw8571351",
      "warningSpoilers": false,
      "date": "27 September 2022",
      "rate": "10",
      "helpful": "34 out of 37 found this helpful.",
      "title": "MAKES ME FEEL HAPPY AND CALM",
      "content": "Okay, so i watched friends 3 4 years ago and now it has become a daily part of my life. Im engineering student so i often come home exhausted from uni and watch friends with my sister all day to relax . I love the show the characters make me laugh and i forget my worries. A lot of people have complaints about the show saying it doesnt having enough POC characters and being unfunny? As POC i literally have no problem with the show's lack of POC characters honestly, i mean it doesnt bother me that much and i agree Seinfeld has better jokes than friends but it doesnt mean that friends isnt funny, its different and simple and flawed and that what makes the show so good to watch. A lot of people watch friends to learn english too so its fun. Not everything has to be \"woke\" and a masterpiece for people to enjoy and cherish and please do not forget the show came out in 90s and back then creators didnt focus that much about different agendas."
    },
    {
      "username": "midz",
      "userUrl": "https://www.imdb.com/user/ur0091370",
      "reviewLink": "https://www.imdb.com/review/rw0332770",
      "warningSpoilers": false,
      "date": "12 August 1998",
      "rate": "",
      "helpful": "796 out of 972 found this helpful.",
      "title": "My Friends on T.V.",
      "content": "There never has been a sitcom that truly pictures life among the singles (twenty-something) as good as this show does. It's not just comedy, it presents the episodes in such a way that one can truly identify with the situations they face so the audience has something to talk about in coffee shops too. The humor is universal. I feel like I'm part of the group every time I watch it because I feel the different emotions they go through. Plus, of course, it is so much fun because it's fast-paced. Every scene and every moment is relative to what is going to happen next so you don't feel like it is dragging you onto nothing. Just like how a sitcom should be. Funny!"
    },
    {
      "username": "Fabrizio03",
      "userUrl": "https://www.imdb.com/user/ur3278962",
      "reviewLink": "https://www.imdb.com/review/rw1024653",
      "warningSpoilers": false,
      "date": "20 February 2005",
      "rate": "",
      "helpful": "1,333 out of 1,687 found this helpful.",
      "title": "The Best Show Ever",
      "content": "Everyone says that Seinfield is the greatest show ever. I love Seinfield but it doesn't come close to Friends. Every episode of Friends will make you laugh non-stop. We have grown to love the characters and what happens to them. The fitting personalities of these characters are absolute genius. Rachel the spoiled yet sweet girl, Monica the mother figure, Phoebe the hippy chick, Joey the dopey yet cool Italian, Chandler the sarcastic loser and Ross the neurotic victim stay together to help each other with their problems in the big city. I've got every season on DVD. This sitcom, in my opinion, is the greatest sitcom of all time and it changed the TV world forever. It's a great show."
    },
    {
      "username": "saivenkat02",
      "userUrl": "https://www.imdb.com/user/ur5461988",
      "reviewLink": "https://www.imdb.com/review/rw8453957",
      "warningSpoilers": false,
      "date": "16 August 2022",
      "rate": "10",
      "helpful": "21 out of 24 found this helpful.",
      "title": "Ultimatus!",
      "content": "I started watching this show for the first time in 2020, which is 16 years after the final season aired on TV! Never could buy into shows that used laughter tracks (found it repulsive) but somehow the hype for this show always kept growing louder and louder around me, and after 5-6 failed attempts, I tried one more time... And VOILA! Season 1 took time to get into, but once past it, Seasons 2-6 were just freakingly amazing!! The best seasons of the show! By the end of S6, you develop deep attachments towards the cast and the remaining seasons, though not as great, still have a lot of good stuff. The acting in this show is truly exceptional and the comedy is priceless! And its also beautifully complimented with family drama to keep it well rounded! Will always be a fan favorite! I've finished possibly 4-5 reruns of this by now."
    },
    {
      "username": "manojmagecha",
      "userUrl": "https://www.imdb.com/user/ur69882048",
      "reviewLink": "https://www.imdb.com/review/rw5578105",
      "warningSpoilers": false,
      "date": "25 March 2020",
      "rate": "10",
      "helpful": "118 out of 152 found this helpful.",
      "title": "A timeless and endless classic",
      "content": "I cannot remember the amount of times I've sat down and thought \"I want to watch a new series on Netflix and start a new film!\" And after 5 minutes of watching something new I thought, why bother?!? And switch over to watching friends 😂 easy to watch, great comedy and full of content that's completely original. The more I watch it the more I learn about the characters I grew up with, and how I would respond to certain situations, with or without the overhead laughter in the background. I don't know a single person that hasn't seen this, so if your one of them reading my review, do yourself a favour and grab a glass of wine, or whatever, and prepare for back to back television greatness. Thank you \"Friends\""
    },
    {
      "username": "yaxleycratler",
      "userUrl": "https://www.imdb.com/user/ur87760294",
      "reviewLink": "https://www.imdb.com/review/rw4271640",
      "warningSpoilers": false,
      "date": "6 August 2018",
      "rate": "10",
      "helpful": "55 out of 71 found this helpful.",
      "title": "They'll be there for you!!!",
      "content": "Friends is without a doubt the best American TV show ever to air. It has sad and hilarious storylines and makes you feel the sadness and jot out of any situation. The actors do fantastic and you really feel like you know a part of them by the end of the show. This will be a show I will never forget as I make constant references to the episodes. I wish the show could come back on air because I miss them so much, but I'm glad it got all the fame it did because it deserved it."
    },
    {
      "username": "imdb_girl90",
      "userUrl": "https://www.imdb.com/user/ur71931569",
      "reviewLink": "https://www.imdb.com/review/rw5588127",
      "warningSpoilers": false,
      "date": "29 March 2020",
      "rate": "10",
      "helpful": "24 out of 30 found this helpful.",
      "title": "Watched in 2020 for the first time!",
      "content": "I turned 30 this year and I watched this series for the first time! Yah that's true. I started watching from mid Jan 2020 and completed today the 29th March 2020. All I can say to the cast and team of F.R.I.E.N.D.S is THANK YOU! Thank you for making this gem. Thank you for giving me 6 new amazing friends. Thank you for giving me such a wonderful family for life. Thank you for showing that being a single mom, being a mom via adoption, being a surrogate mom is all wonderful and normal. Thank you for making me understand that I must do what I love and love what I do. Thank you for making me understand that with all the traits of mine, if I'm also kind and beautiful from the inside, then am wonderful, am loved, am accepted, AM ENOUGH. Am sad that the series is over and I now understand why so many people are asking for a reunion. Well! Here's another person added to that list.Team! Thank you once again. You all are loved. FOREVER!"
    },
    {
      "username": "ATIE_ZIEYA",
      "userUrl": "https://www.imdb.com/user/ur156083410",
      "reviewLink": "https://www.imdb.com/review/rw8482069",
      "warningSpoilers": false,
      "date": "24 August 2022",
      "rate": "10",
      "helpful": "22 out of 24 found this helpful.",
      "title": "No limited watching",
      "content": "Been watching this series none stop. Like every end of the season I will restarts it all over again. I do not need to see the screen anymore. I can just here the voices and know where is and how the casts portray the scenes. It so good and no other sit-coms can replace it. I love when they did not changed any of the main characters. Each of them brings out their."
    },
    {
      "username": "embless",
      "userUrl": "https://www.imdb.com/user/ur68118586",
      "reviewLink": "https://www.imdb.com/review/rw4283225",
      "warningSpoilers": false,
      "date": "13 August 2018",
      "rate": "10",
      "helpful": "63 out of 82 found this helpful.",
      "title": "Just finished watching whole series on Netflix",
      "content": "I am such a fan of the Friends tv show. The characters are well developed independently and together they play off each other well. Some moments are cheesy while others are funny, while the rest is just very well acted and dialogued by the cast. At least give the first season episodes a go, if you still don't like it, don't watch it. But for those who enjoy a well developed multi character show..... Friends is sure to make you laugh and want to get to know each character more. Its a television show.... there are bound to be goofs or inconsistencies, no television show has ever ever in the history of tv been 200% perfect. I plan on buying the whole series on Blue-Ray soon to add to my dvds."
    },
    {
      "username": "salokurdovanidze",
      "userUrl": "https://www.imdb.com/user/ur126171998",
      "reviewLink": "https://www.imdb.com/review/rw6262652",
      "warningSpoilers": false,
      "date": "12 November 2020",
      "rate": "10",
      "helpful": "147 out of 171 found this helpful.",
      "title": "Can this show be any better?!",
      "content": "Are you happy? watch Friends! are you sad? watch Friends! not sure! yet, watch Friends!"
    },
    {
      "username": "Analog_Devotee",
      "userUrl": "https://www.imdb.com/user/ur107152571",
      "reviewLink": "https://www.imdb.com/review/rw5663870",
      "warningSpoilers": false,
      "date": "22 April 2020",
      "rate": "9",
      "helpful": "7 out of 8 found this helpful.",
      "title": "A timeless classic.",
      "content": "This is the show I come back to time after time when I'm either not sure what to watch next, or just want to relax with something familiar. I've lost count of how many times I've watched this wonderful show from start to finish over the years. At this point, I can recite certain episodes verbatim--as can many other fans, I'm sure.If, somehow, you haven't sat down and given this show a fair shake yet, I implore you wait until you have a considerable amount of time on your hands. The hours will fly by without much notice."
    },
    {
      "username": "ramtrishan",
      "userUrl": "https://www.imdb.com/user/ur107575551",
      "reviewLink": "https://www.imdb.com/review/rw5115566",
      "warningSpoilers": false,
      "date": "12 September 2019",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "G.R.E.A.T.",
      "content": "Even in 2019 it is very funny. A really great show. Must watch"
    },
    {
      "username": "clargarrr",
      "userUrl": "https://www.imdb.com/user/ur67638338",
      "reviewLink": "https://www.imdb.com/review/rw3512778",
      "warningSpoilers": false,
      "date": "26 July 2016",
      "rate": "10",
      "helpful": "84 out of 115 found this helpful.",
      "title": "All-Time Best Sitcom",
      "content": "I love this show so much! F.R.I.E.N.D.S is a sitcom that you could easily binge-watch at any time of the day. I was able to finish the whole 10 seasons, which ran for 10 years, in under a month. That's just how great it is! I can't even give it a negative review about anything. You'll just really learn to love all the characters through time. No wonder people have clamored for a reunion with the cast, you just can't get enough of it.When you're feeling down and think you could use a good laugh, put this one on top of your to-watch list. It doesn't matter that the show ran from 1994-2004, the humor it had is timeless!In a perfect world where we could pick a series that could run forever, F.R.I.E.N.D.S would be that show. Notice how different TV networks are still doing re-runs at present time even after it has ended back in '04. You'll find that a new generation of viewers who are watching and loving it are surprised to discover that the cast are quite old already. Nothing could beat it."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2254449",
      "warningSpoilers": false,
      "date": "24 May 2010",
      "rate": "10",
      "helpful": "41 out of 66 found this helpful.",
      "title": "One of the better American sit-coms",
      "content": "I have nothing against sit-coms in general, as long as they are funny. In America, there is Frasier and Will & Grace, in Britain, there is Only Fools and Horses and Last of the Summer Wine, they are great sit-coms. There was a time when I didn't like Friends very much, then again it was also at a time when I wasn't into sit-coms. My brother and sister, who absolutely adore the show suggested I should try the show again, so I did. Well, my initial reaction of the show was wrong, this show is great, it is funny and smart with appealing characters. It is by far one of the better American sit-coms and I do think it is better than Everybody Loves Raymond.First and foremost, I love the theme song. It may get on some people's nerves, but I find it irresistibly catchy, memorable and fun, with a simple melody and nice lyrics that are relevant.I also love how funny and smart Friends is. Some of the episode titles alone are hilarious and clever. That reminds me when I see and review When Harry Met Sally, maybe the title of the review should be \"The One With the Scene in the Diner\". Along with this the writing is consistently funny, with some wit and intelligence and very rarely becomes clichéd and cringe worthy. I even like the plot lines, I don't find them boring, predictable perhaps occasionally but the funny situations that the characters get into make them absorbing and worthwhile.The direction is also really solid, and the photography and scenery are striking.I love the characters, they are unique and engaging, even with their flaws they manage to be likable. Rachel does have moments when she is spoilt, but she is also the epitome of sweetness. I know there are people who have problems with Jennifer Aniston, the thing is I don't and I find her at her prettiest and most appealing here. Monica is another strong character, not the funniest by all means, but because she is almost like a maternal figure to the other characters with her caring and sympathetic attitude. I loved how Courtney Cox portrayed her. Phoebe is my favourite female character, she is hilarious; I especially love her songs, they are the sort of songs that are so bad they are great. Lisa Kudrow couldn't have been the more perfect choice for her, she pulls off Phoebe's personality to perfection.Joey is stupid admittedly, but I love him anyway because he is also cool. I am not a huge fan of Matt LeBlanc, but he is really good as Joey. Matthew Perry is great as Chandler, who is like a clownish and sarcastic sort of character, who makes jokes that are almost as bad as Phoebe's songs, but he is still a likable character in his own right. Ross is deliciously neurotic, I constantly love his priceless facial expressions and David Schwimmer's delivery is absolutely perfect.There have also been some wonderful guest stars, Elliot Gould as Jack Geller, Gary Oldman(who I really like in films like Dracula and Immortal Beloved) as Richard Crosby, Michael McKean and Danny DeVito as a stripper who arrives at a party in a policeman's outfit, all but to name a few. Overall, I love this show, not only for the writing but for the characters. 10/10 Bethany Cox"
    },
    {
      "username": "renaldo and clara",
      "userUrl": "https://www.imdb.com/user/ur0793218",
      "reviewLink": "https://www.imdb.com/review/rw0332831",
      "warningSpoilers": true,
      "date": "6 October 2000",
      "rate": "",
      "helpful": "69 out of 112 found this helpful.",
      "title": "no other show comes close",
      "content": "I try........not too hard, but I try.........to watch other sitcoms and actually try to \"hee-hee\" and understand the humor, but I can't! Will & Grace, and their annoying \"who's your daddy cr@p\", Two-Men-And Whatever-And-A-Pizza-Place, ohmigod... give me a friggin' break!It's not just that there is so much chemistry between the \"Friends\" cast that the TV could explode, though this is true. Actually, maybe that's the main reason it is as good as it is. What I mean: Although it is a show full of inside jokes that you understand a lot better if you've seen every episode before the one you're watching, it isn't *essential* to have seen any episodes before to start liking it and being hooked instantly. That's how it happened to me.I didn't start watching until season 4!! But once I did, I thought Rachel Green, Jen Aniston's char, was the coolest, and the cutest character. Now, it's more generic. I especially adore Joey and Chandler of course, and I also like the other three. Each character, except unfortunately for Monica, has grown positively in their own way.On a sidenote, I really do hope that the \"anchor\" quality Monica's character used to have can come back a bit in season 7. Especially as Chandler's fiance/ now, it would be a terrible thing to waste her character on just simple humor they exposed her character to in the last few seasons.Being a Friends fanatic, allthesame, I wouldn't want this awesome show (especially) to have even the *slightest* chance of wearing out its welcome. As it is, the cast agreed to sign for 2 more seasons(this one and an 8th), and I really hope it can keep up the quality it's always had in these to come. Although I adore Friends, I don't see any reason why they would want to tire a sitcom after these seasons are over. Especially since all 6 are extremely talented actors in their own right.-----***WATCH FRIENDS EVERY THURSDAY NIGHT, ONLY ON -- NBC -- !!!**----------Could I *be* any more emphatic? =)"
    },
    {
      "username": "SafReviews",
      "userUrl": "https://www.imdb.com/user/ur93969415",
      "reviewLink": "https://www.imdb.com/review/rw4401474",
      "warningSpoilers": false,
      "date": "16 October 2018",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Probably the best sitcom ever",
      "content": "Even Though i didn't live and wasn't born in the 90s, I still find this one of the best sitcoms ever. The characters are just great and the chemistry between them is just amazing; its so hard choosing who my favourite character is because they are all amazing!!! What i also like about this sitcom that it isn't always sexualized, most of the episodes are pretty much PG which makes it watchable for younger audiences or people who are not comfortable with watching sexual activities or references on a sitcom."
    }
  ],
  "errorMessage": ""
}