{
  "imDbId": "tt0434706",
  "title": "Monster",
  "fullTitle": "Monster (TV Series 2004–2005)",
  "type": "TVSeries",
  "year": "2004",
  "items": [
    {
      "username": "BadgerStorm4345",
      "userUrl": "https://www.imdb.com/user/ur113370202",
      "reviewLink": "https://www.imdb.com/review/rw6343028",
      "warningSpoilers": false,
      "date": "6 December 2020",
      "rate": "10",
      "helpful": "61 out of 67 found this helpful.",
      "title": "The Best Seinen Anime",
      "content": "Monster is an incredibly satisfying watch and rewards paying attention to smaller details. The story is intricately woven to make even the smallest advancements seem well worth it. The characters are all very well written and they all have a very distinct role in the story. Tension is built perfectly and the realm of safety doesn't apply to any of the characters. Monster successfully crafts one of the most engaging stories of all time and is one of my favorite anime of all time."
    },
    {
      "username": "hidarimaki",
      "userUrl": "https://www.imdb.com/user/ur7895734",
      "reviewLink": "https://www.imdb.com/review/rw1220493",
      "warningSpoilers": false,
      "date": "20 November 2005",
      "rate": "",
      "helpful": "140 out of 150 found this helpful.",
      "title": "Suspense the way it should be done",
      "content": "This series held surprises into the very last episode.I'm not really going to include any major spoilers for the series in my review. The closest that I'll come will cover what you've probably heard about from any general discussion concerning the TV series, or the books that the story comes from, or the opening TV credits for the very first episode. That means that some key elements from the first 4 episodes, which covers the first 5% of the 74 episode series, will be mentioned. But it's hard to even say what the series is about without going that far, and you're likely to get more spoilers in any major review of the latest Hollywood mega-release anyways.In life, there are two types of monsters. The first is the type that most of us have probably thought of in our childhood, the type that we feared under the bed or in the closet, the type who our parents or guardians told us didn't exist. The second type, however, is what the title of this series refers to. This is the type which adults do fear, the type that does exist. This monster can plan human deaths with the same nonchalance that others have when they decide the details of getting their next coffee.Naoki Urasawa's story is one that covers such a monster, but this monster isn't the main character. Instead, the main character is the highly skilled Japanese neurosurgeon Kenzou Tenma, working in Germany shortly after its reunification. Tenma believes that all life is of equal high worth, and that the value of life isn't changed with wealth, fame, nor with celebrity status. But he discovers that the hospital itself doesn't share that belief. The life that he saved, the life which more desperately needed his skills, looked so much like another anonymous life that was about to get wiped out by the hospital's lack of ethics. But Tenma unknowingly gave life back to a monster. And for the first time ever, Tenma regrets the life that he saved; so much so that he finds himself forced to correct that mistake.From this point, if you saw the opening credits which cover the first 90 seconds of the very first episode, you can guess the general direction of the series. Picture the TV series 'The Fugitive', but with a single storyline which went from the first episode to the last. Now throw in a detective (Inspector Runge) who is as calm, confident, and calculating as the devil himself, pursuing Tenma. There are also other characters in the series, who are crucial to how the story builds, and who are rather difficult to introduce clearly without spoiling some of the many subplots which build through the series. These characters include Tenma's ex-fiancée Eva, as well as a retired detective, a reclusive billionaire, two criminal psychiatrists, members of organized crime, ones involved in possible illegal dealings with the Czech police, a crusading defense attorney, and others.There will be a few times where the main storyline seems to be put on hold, and a new storyline with new characters will be introduced. And you'd likely be wondering why things have taken a detour, or when they'll get back to the actual story. But the overall plot is much more complex and detailed than you may have seen on other serial thrillers such as 'Alias', '24', or 'Lost'. The seemingly disjointed story lines in 'Monster' slowly build to be a critical part in the overall plot, and the series overall doesn't have any wasted scenes or episodes (filler), nor the jumps and jolts which betray signs of last minute rewrites.If you're hoping that the upcoming Hollywood movie based on the series will be as good, you might want to reconsider. For starters, it'll mean rewriting a story which takes 37 broadcast hours to tell, and re-conveying that over a time slot of 90 to 100 minutes. Also, it'll be coming from the same talent pool which took the highly rated Japanese movies 'Ringu', 'Ju-On', and 'Shall We Dance', and turned them into the mediocre Hollywood productions 'The Ring', 'The Grudge', and 'Shall We Dance'. (From 94-64-79 to 72-40-49, according to RottenTomatoes.com.) While Hollywood can make a good original movie occasionally, their record at remaking movies leaves a lot to be desired.In short, this is one of the better suspense stories out there. The writing is solid, the characters are believable (even when their character changes), and the story always makes sense. In some story arcs, just when you think they're getting ready to wrap things up, they find a way to ratchet up the tension again. But it never seems forced, or cheap, like what is by far more common in most thrillers I've seen. 'Monster' is definitely a series which requires your full attention when watching it, due to the pace which events happen and the number of details which all come together as the story progresses. And if you don't mind a long story with a lot of twists and turns, this is definitely one worth following."
    },
    {
      "username": "jon_s_chan",
      "userUrl": "https://www.imdb.com/user/ur9769240",
      "reviewLink": "https://www.imdb.com/review/rw2220582",
      "warningSpoilers": false,
      "date": "13 March 2010",
      "rate": "10",
      "helpful": "132 out of 145 found this helpful.",
      "title": "One of the best experiences ever",
      "content": "This is not typical anime, it is not even a series or a video, it is an experience I have gone through watching this piece of brilliance called Monster.I have been a huge fan of crime dramas of Martin Scorcese and thrillers of Alfred Hitchcock and totally enjoy movies that dive deep into human emotions such as 7even, Taxi Driver, V for Vendetta, Machinist, Schindler's List, American Beauty etc. For anyone out there with similar tastes, this is a must watch content. It is must watch because all those works that we have seen until now seem so little in terms of their emotional intensity before this masterpiece of a thriller.Unlike the title, there are no monsters in this series, well actually there is one, far more deadlier than the ones in our nightmares, monster created as a result of difference in the perception of what we see in society. No, we are not talking about psychopaths with extreme emotions that enjoy hurting people here, but normal human being that can see the difference between good and bad, light and darkness, life and death very clearly and thus obviously does not agree with the society. The whole series is about a monster created out of the extreme surroundings around him and the people he encounters during his life that either get obsessed with his thinking or want to kill him for how dangerous he is.Overall this series could be the best animated work as it would leave you with an everlasting feeling like it did on me. There has been an attempt to make a movie out of the plot and nothing seems to be happening, I wish it stayed that way. A story like this will be a disaster as a 2-3 hour movie, there is just too much good stuff in here that cannot be passed/cut-down to make a movie.For those who watched V for Vendetta, this work will seem relevant to the main theme of series. Be ready to spend some time (74 episodes) and make sure you do not give more than 1 day break between each episode as you could forget everything very fast. You should concentrate on everything in the episode as there are hundreds of characters that have a lot to do with the plot."
    },
    {
      "username": "lisadewaal-98104",
      "userUrl": "https://www.imdb.com/user/ur94618949",
      "reviewLink": "https://www.imdb.com/review/rw5555703",
      "warningSpoilers": false,
      "date": "16 March 2020",
      "rate": "10",
      "helpful": "29 out of 32 found this helpful.",
      "title": "MASTERFUL storytelling",
      "content": "I was always a bit negative about anime because of the childish, almost cringy ways of delivering stories that have the potential of being really good.And that's when I came across Monster. The first episode immediately got me scared and hooked at the same time, and it wasn't necessarily the episode itself that got me. It was the credits. The image I saw, the music that played gave me an indescribable feeling of terror, loneliness... and great anticipation.So I continued watching. Every episode was even better than the last. The story was extremely engaging. I had strong emotions about every character, whether it was love, hatred, disgust or fear. The tension was constantly there, and it was great to see the mysteries unfold. What was so great about it is that the mysteries don't stay mysteries for too long, I always found that when unanswered questions drag on for too long, I lose my interest to even find out the answers (I'm looking at you, BBC Sherlock and the Kingdom Hearts Saga), but this show really got me going.The small backstories were also a lot of fun, I've told people various small tales that come from this show and I always manage to pique their interest. And I'm not even a good storyteller, that's just how amazing the concept of each backstory is!Well, I think I've said plenty. If the animation quality/style is what throws you off, which I can kind of understand, please do keep watching anyway. It's really, really worth it."
    },
    {
      "username": "bmoore07",
      "userUrl": "https://www.imdb.com/user/ur46109250",
      "reviewLink": "https://www.imdb.com/review/rw3106323",
      "warningSpoilers": true,
      "date": "17 October 2014",
      "rate": "10",
      "helpful": "38 out of 43 found this helpful.",
      "title": "Naoki Urasawa at his finest",
      "content": "Words alone are not enough to describe how much I love Monster, the show with the one-word title, but I will try my best. Monster is easily the greatest anime you've never heard of, a hospital drama that speedily shifts into a continuously captivating murder mystery/ suspense story. The basis behind Monster follows Dr. Martin Luther King Jr.'s philosophy that all lives are created equal, that nobody's better than anyone else, and this is why Dr. Kenzo Tenma, the protagonist of Monster, Germany's unbelievably brilliant surgeon, chose to save a wounded boy named Johan Liebert over the mayor himself. Tenma's entirely justified decision destroys his career and his reputation as Johan is revealed to be a psychotic criminal mastermind, and Tenma embarks on a years-long journey to murder the patient he healed, to slay the monster he resurrected.As the audience accompanies Dr. Tenma, Monster presents the most beautifully detailed scenery you'll ever see, from highlighting the dirty and run-down aspects of the red light district to emphasizing the constant and consistent downpour of the Ruhenheim rain. Monster also showcases a masterful soundtrack, perfectly complementing the anime's plot with laid-back melodies in moments of peace, suspenseful organ music in climatic sequences, and tragic piano pieces in Monster's most emotional scenes. The greatest exhibition of Monster's musical genius is the anime's main theme, beginning with bone-chilling Latin chanting before a flurry of drums dominate the rest. The main theme is simple yet ominous, a phenomenal way to introduce a phenomenal anime.Naoki Urasawa (the creator of Monster) is a renowned genius of the manga word with several notable pieces including the immortal 20th Century Boys, a sci-fi adventure/suspense story that epitomizes childhood nostalgia, overflows with drama, and is very, very close to Monster's legendary status. Monster, however, is Naoki Urasawa at his finest, an anime with unbelievable complexity in its plot (although it moves noticeably slow, it doesn't reveal everything at once, and the gut-wrenching twists are definitely worth the wait) and intensely realistic characters. In Dr. Tenma's quest, he encounters Inspector Lunge (an unrivaled detective determined to arrest Tenma for Johan's crimes), Anna Liebert/Nina Fortner (the exceptionally kind and easily likable sister of Johan with the same mission as Tenma), Dieter (the gifted soccer prodigy with a friendly and joyful personality), and my favorite character Grimmer (a ridiculously laid-back journalist/former spy with almost-superhuman strength). There's tons of depth in this show, to the point where a certain bodyguard/ hit-man (who only appears in three episodes) becomes among the most memorable Monster characters ever. The cast of characters in Monster is the best I've ever seen, with world- class acting and a ton of personality (with the exception of the severely socially stunted Inspector Lunge). Compared to the in-depth exploration of other characters, Monster doesn't venture into the main protagonist's character. Dr. Kenzo Tenma is the definitive Good Samaritan, the epitome of selflessness, a mysterious man of benevolence determined to accomplish his goal, and that's all Monster really needed to reveal about him.The Beast, the Demon, and the Devil. These are names used in referring to Johan Liebert, the titular Monster of the series. If Tenma is the epitome of goodness, then Johan is the epitome of evil, a charming blond-haired young man with pale blue eyes, a bland brown sweater, and a sadistic mind. Johan doesn't simply set the plot in motion; he is the plot. Monster is about discovering how that sadistic yet brilliant mind works and what molded Johan into a being of evil (the monster's motive is revealed in the final moments of the anime, something I had to re-watch to fully comprehend). With his exceptionally creepy monotone and the basis of who he is, Johan dominates every scene he's in, even when he's not talking. The man has a presence. In the show Monster, Johan is a sign of bad luck akin to a black cat; there's an unwritten rules that if a minor or major character looks at Johan's face, they are guaranteed to die (with a few exceptions). If you don't believe me, look at what happened to Martin, the aforementioned bodyguard/hit- man. In the episode \"The Man Who Knew Too Much\", Martin walked past Johan and, on that same night, he was shot in the chest and died. Some of the crimes Johan committed were done to maintain his secrecy (like the murder of Mr. Junkers or the psychological destruction of private eye Richard Braun) but most of the crimes were ones Johan executed because he felt like it, and all of them resulted in a self- contained enjoyment from the monster, only revealing a subtle (yet creepy) smile. Monster is filled with examples of the infamous mastermind's greatness, what I dubbed \"Johan moments\", but the most memorable example to me is in the episode \"At the Edge of Darkness\": after listening to the Red Hindenburg's past (which cements her as the most despicable character in an anime filled with them), Johan wordlessly orders her execution before leaving her apartment and calmly walking away with a balloon in hand and the subtle smile on his face. HBO is supposedly making a live-action version of this classic anime, but there will never be a villain like Johan Liebert and there will never be an anime like Monster."
    },
    {
      "username": "maque-3",
      "userUrl": "https://www.imdb.com/user/ur19257662",
      "reviewLink": "https://www.imdb.com/review/rw2087688",
      "warningSpoilers": false,
      "date": "28 June 2009",
      "rate": "10",
      "helpful": "220 out of 237 found this helpful.",
      "title": "For the pickiest watcher, Monster is sure to please.",
      "content": "I've always been very picky about my anime. I don't mind watching most series, but I always hold myself back from really truly liking most of them -- I watch, say, Fullmetal Alchemist, and I get some visceral joy from it, I cry a little bit, but I wouldn't call it a favorite; I find Cowboy Bebop enjoyable, but I wouldn't ever watch it ten times.Monster blows everything I've ever seen out of the water.I stumbled upon the anime by accident. I had just finished watching Moribito -- which was one I truly liked because the characters didn't follow normal anime standards -- and was searching for something to follow up after that. I expected to be disappointed. Someone on a forum suggested Monster, so I looked it up and watched it.I kept expecting something to be horrible. But the show started, and the art was realistic for an anime--something I hadn't quite experienced before. The opening theme song wasn't some annoying pop song that grated on my ears and made me snicker. The characters were real. The background music always fit the scenes and was never overbearing. The language spoken was honest and like something I could hear on the street. Germany looked like Germany and not some twisted version of Japan. The story was compelling.I watched all 74 episodes expecting something, -anything- to go horribly wrong, waiting for it to fall into the tripe I had watched hundreds of other anime go into. But there was never fan service, no overly gory violence. Nothing like that.Monster is a masterpiece. You can truly connect with every character. You'll see a person on screen for, at most, five minutes, but they'll have more depth to them than the main protagonists of other anime. You'll feel overwhelming sorrow whenever someone is killed after only one episode. You'll decide that a certain person fits the title--\"Monster\"--only to decide a few moments later that no, someone else is a monster. And you'll even feel empathy for people you long to hate.This is one of the only anime to ever please this picky fan. It might not be for people wanting more action, but as someone sick of anime where all that happens are flashy fights, this was a more than welcome release. Give Monster a try--you'll probably find it worthwhile."
    },
    {
      "username": "Ryu_Darkwood",
      "userUrl": "https://www.imdb.com/user/ur3412040",
      "reviewLink": "https://www.imdb.com/review/rw1775252",
      "warningSpoilers": false,
      "date": "5 December 2007",
      "rate": "10",
      "helpful": "83 out of 110 found this helpful.",
      "title": "Worth to watch for those who liked Death Note!",
      "content": "I recently watched the popular anime serial Death Note. In search for a similar dark and gritty tale of power and deceit, I stumbled upon this little pearl. Like Death Note it's an epic train ride of plot twists and philosophical visions on the worth of human life. It is about the young surgeon Dr. Tenma who finds himself in an awkward situation. Will he continue the operation on a little boy with a gun wound in the head, or will he save the mayor of the city, and also benefactor of his hospital, from the effects of a stroke? In all his fairness he makes the choice to save the boy. It is the beginning of a tremendous tragedy; his boss and father-in-law doesn't want him anymore, his wife dumps him, colleagues despise him, and he becomes the scapegoat for the hospital. And then something odd happens. The little boy and his twin sister disappear and all the people who meant to do harm are killed. Though everything points at Dr Tenma's direction, there is not enough evidence for prosecution. And from that point on starts the story of Dr Tenma's quest to find out what happened and who was behind the killings. He stumbles upon a terrifying discovery that will alter his life tremendously.I like this cleverly written show for its addictive storyline and emotionally tense scenes. You must be willing to accept the many ''fillers'' - episodes with as only goal to lengthen the story - but it's well worth too watch through them. Those of you who liked Death Note, please give this less famous show a try. In some ways I think Monster even surpasses Death Note by its themes and dark vision on humanity."
    },
    {
      "username": "Playbahnosh",
      "userUrl": "https://www.imdb.com/user/ur14023386",
      "reviewLink": "https://www.imdb.com/review/rw2854930",
      "warningSpoilers": false,
      "date": "21 August 2013",
      "rate": "8",
      "helpful": "27 out of 32 found this helpful.",
      "title": "A seriously unique crime-drama",
      "content": "Let's get this out of the way first: I REALLY liked Monster! But, I wouldn't watch it again...Monster is a down-to-Earth psychological crime drama. At first it might appear to have supernatural elements, but I won't spoil it for you. After watching the entire thing, I would say Monster would've been great as a live-action TV series, which couldn't be said for any other anime I watched so far (and I watched quite a lot). It has everything a great series needs, a cast of characters that the audience can care about, action-packed scenes to liven up the pretty in-depth crime drama, great character development, a good story full of twists and turn that will keep you coming back for more and an astonishing and realistic art-style to wrap it all together. During it's 74 episodes it brings up many hard questions about the human psyche, morality and human connections, relationships. How far are we willing to go to accomplish our goals? How much of your humanity are you willing to trade in for them? What is \"humanity\" anyway? Some of the episodes are frighteningly realistic in describing the human condition and it doesn't back down from touching really hard social and historical taboos either. No, it grabs you by the hair and slams your face in them saying \"Look! That's what you are!\". I can safely say Monster was one of the most unique and thought-provoking experiences I've ever had.But, (and yes, here comes the \"but\") Monster is anything but perfect. While it's action-packed and suspenseful story would stand great on it's own, it's sadly spread too thin and too long. The story needlessly drags on for 74 episodes and the ending feels more like a coup de grace than closure. The cast of main characters is huge, and while they are really well made and fleshed out, we are continuously introduced to a slew of new side-characters that have barely any relevance to the main story (if at all). The writers regularly go off on tangents just to demonstrate a small plot point or tidbits of (mostly irrelevant) character backstory, bringing in and taking out characters on a whim after they \"served their purpose\". In the end, they were seemingly just struggling to give enough individual screen-time to their monstrously bloated cast (pun intended), and it only makes the audience lose interest in them and lose count on who is who why they are even there.The story is mostly delivered in (sometimes painfully dragged out) exposition. The story lurches forward in needlessly detailed investigation sequences flooded with meaningless trivia and extra character backstory that have little to no bearing on the main story itself. The story regularly branches off into dead-ends and meaningless side-plots that fill entire episodes yet don't bring anything new or interesting to the table. The sheer amount of dialogue and narration in Monster would fill entire volumes of books. Even the exposition itself is riddled by double-takes, needlessly repeated \"remembering\" segments and a ton of redundant, rephrased information. You can seriously skip entire dozens of episodes and still understand everything since the characters and the exposition keep repeating themselves over and over. The whole series could've been distilled down to a neat 30-35 episodes without losing any of the story.My third (entirely personal) beef is with the setting. Unlike most anime, the entire story of Monster takes place in 80's and 90's Europe (mostly Germany and the former Czechoslovakia). See, I was born and still living in Europe, I lived in the time and place the show takes place. Monster being a work of fiction, I chalked up most of the factual, cultural and historical errors to \"writer's freedom\" and \"suspension of disbelief\" and such. While the creators of the anime obviously did their homework and got most of the big things right, there were some things that bugged me more than they should've. Little, insignificant things that most people from other parts of the world would miss, were just screaming at me from the screen. Getting used to the obviously Japanese mannerisms, phrases and behaviors forced upon the allegedly European characters is one thing. But small details like choice of words, type of foods/drinks, fashion, architecture or even music in some places were just flat our wrong and felt so out of place that it shoved me right out of the immersion. I know it sounds lame, but since the creators obviously tried to recreate the setting realistically, I just couldn't help it.I know I spent most of this review pandering on what's wrong with Monster, but the truth is, I really liked it, and I stand by my score of 8/10. It's really worth watching for everyone who desires something other than the run-of-mill anime, something unique. If you can overlook the droll exposition and sometimes aimlessly branching and dragged out storytelling, you'll find a really suspenseful and interesting story of crime and punishment, dark secrets, interesting characters, huge plot twists, thrilling psychological expeditions into the human mind and soul and much more."
    },
    {
      "username": "hypernox",
      "userUrl": "https://www.imdb.com/user/ur19473382",
      "reviewLink": "https://www.imdb.com/review/rw1923558",
      "warningSpoilers": false,
      "date": "3 August 2008",
      "rate": "10",
      "helpful": "57 out of 66 found this helpful.",
      "title": "If you like thrillers this is a must see!",
      "content": "I've seen a lot of Animes and I have to say this is the best one in my opinion, a true masterpiece that goes beyond others. I liked Monster since its not a common Anime (japanese cartoon) since it doesn't evolve around supernatural abilities or Futeristic techs. The story is written in a way that make it feel very realistic. The realistic story also makes it a very scary story in a sense that the monsters in this story actually can exists, these are the real monsters we should be scared of.Don't let the fact that its anime scare you off. Even if its hard to watch at first you'll get used to it, the story makes up for it. The story is so compelling that once you get into it it's hard to stop watching. I don't want to spoil any of plot more than it questions a common moral \"all human life is equal worth\". The plot really gets you thinking."
    },
    {
      "username": "TheProteanGirl",
      "userUrl": "https://www.imdb.com/user/ur46025114",
      "reviewLink": "https://www.imdb.com/review/rw5552160",
      "warningSpoilers": false,
      "date": "15 March 2020",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Amazing Philosophical Anime!",
      "content": "I find animes with philosphical/moral questioning and thought provoking narratives take a backseat too many times to these cringy high school \"sexy\" animes or fighting animes like Naruto. This anime is phenomenal, has great development, characters, plot-twists, etc... Yes, it's a bit long but I binged this anime and I don't regret it, still in my top 3 of all time."
    },
    {
      "username": "mayank09876",
      "userUrl": "https://www.imdb.com/user/ur44661012",
      "reviewLink": "https://www.imdb.com/review/rw2882560",
      "warningSpoilers": false,
      "date": "7 October 2013",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "Best Realistic Thriller/ Physiological Animation - Even Non Anime Fans Will Enjoy This",
      "content": "Monster is mostly about the story and it sticks to each and every detail even the dialogs from its adoption of manga. The Plot and Script is so good it would be a bestseller in any format be it a book or a movie.While being a Japanese animation it differs from other works by being realistic. The characters, props , situation , location, the time period all makes it seem it can happen in real life. Nothing is over the top, no super powers or magic involved.The way story evolves and concludes is mind boggling. Most of the episodes leaves you in a cliff hanger making you want to watch one more so you know whats going to happen. The story never tries to push itself so at time it gets slow. But each arc builds itself up for great conclusion.Another great thing in this series are the characters and you will feel for them. They all are unique having there flaws making them real.Many people have a aversion for animation this one will break that as its not aimed for anime fans but for general public who enjoy crime/physiological/detective thrillers."
    },
    {
      "username": "shadowomega",
      "userUrl": "https://www.imdb.com/user/ur5402216",
      "reviewLink": "https://www.imdb.com/review/rw1096104",
      "warningSpoilers": false,
      "date": "28 May 2005",
      "rate": "",
      "helpful": "233 out of 246 found this helpful.",
      "title": "The best suspense/thriller in animation, PERIOD.",
      "content": "I've watched a lot of anime, I've read a lot of manga, but Monster has managed to blow all of my former \"favorites\" out of the water. It manages to combine everything that's great about thrillers, mysteries, character studies, and psychological dramas all at once. The writing is superior, the direction is fantastic, and the way the story builds is slow but undoubtedly engaging. If Alfred Hitchcock had ever endeavored to create a serial work, it would be something like this.The characters are all lovingly and soulfully rendered, and the show never seems to fall into the traps that even the best anime do - that is: needless fanservice, forced comedy, or ludicrous violence.In addition, get ready for a history lesson. This story deals more with the social and political annals of 20th century Eastern Europe - ACCURATELY - than most classes on the subject."
    },
    {
      "username": "Scrius",
      "userUrl": "https://www.imdb.com/user/ur28218693",
      "reviewLink": "https://www.imdb.com/review/rw2525545",
      "warningSpoilers": true,
      "date": "29 November 2011",
      "rate": "",
      "helpful": "20 out of 24 found this helpful.",
      "title": "A Highly Overlooked Exposure to Greatness",
      "content": "Anime is an art that is often under-appreciated and perceived by many as too unusual or nerdy. Animes are often adaptations of Japanese comic books known as mangas, which are read from right to left everywhere, giving the readers a taste of Japanese lifestyle. Originality is not easy to come by nowadays, but I've found plenty within the anime genre, along with some very complex stories and intriguing characters. I watch an anime to experience something different and to escape the styles and clichés that I've long grown accustomed to. There are animes that are meaningful, entertaining, and some that are just plain eccentric. There exists an anime for almost every genre and for every distinct interest, including action, fantasy, horror, drama, and even sports. There are also animes that get seriously overlooked. One of my favorite animes of all time \"Monster\" is an essential example. Praising this show until my breath failed me could never do it justice, but I'll do my best here. \"Monster\" does not succumb to any bizarre anime clichés such as ridiculous hairstyles or far-fetched supernatural abilities. It's a psychological thriller blended with mystery and horror. The original manga written by Naoki Urasawa ran its course from 1994 – 2001 and the anime series would be released three years later. I haven't read the manga but the TV series was a remarkable enough experience. Right from the opening sequence, I was hooked. It has chilling music and atmospheric visuals providing the viewer with insight of the experience that was soon to follow. It's easily among the best anime openings I've seen. The story's protagonist Dr. Kenzo Tenma is a naturally gifted neurosurgeon from Japan working in Dusseldorf, Germany. One day a young boy is brought to his hospital having suffered a gunshot to the head and barely alive. Disobeying the director's orders of saving the mayor's life, Tenma instead rejects the hospitals political bias and operates on the boy, saving his life. Shortly afterwards the boy escapes and Tenma's superiors turn up deceased. Nine years later, similar murder cases resurface and Tenma soon encounters the boy he had operated on years ago, now a psychopathic killer. Feeling responsible for spawning this evil, Tenma becomes hell-bent to stop the titular Monster and uncover the truth behind everything. Little does he realize that it all runs deeper than he can possibly imagine. Dr. Tenma is counted among my favorite heroes. He is symbolic for all of goodness and does everything in his power to make the right decisions and leaving the people he encounters with the appreciation of being alive. Tenma cherishes all of life, unlike his corruptible peers who perceive the lives of the lesser individuals as invaluable next to financial prosperity. But light can never be without casted shadows, and \"Monster\" gives us one of my favorite villains Johan Liebert. The \"Yang\" of Tenma's \"Yin\", Johan is a character with a dark and complex background. The whole of the story centers upon Tenma's journey to stop Johan, while also encountering different characters with their own unique issues, each having a part to play in Tenma's rediscovery of the value of life. Another significant element that makes \"Monster\" such a phenomenon is the changes that the characters go through and the attachments that develop between them and the fortunate viewers. For example, the character Anna, the twin sister of Johan, starts off as naïve and sensitive, but becomes stronger and as determined as Dr. Tenma to stop her evil brother as the story progresses. Another example is Tenma's corruptible fiancé Eva who starts off as vile as her peers believing that \"peoples lives are not created equal\". She encompassed everything despicable about women, something out of a Hemmingway or Fitzgerald story. Pitifully pathetic! One would swear that she was beyond hope, but she later learns the errors of her ways and becomes a strong and sympathetic character that I really got to admire. This barely grazes the surface of the shows greatness! I'll leave it to the readers to see the show for themselves. It's an experience that no one should be without!Not one episode is a waste of time! The story, the atmosphere, the animation, the shadows, and the deep psychological issues are all incredible. The soundtrack alone is amazing and adds to the intensity of the story. In most animes the dubbed voices usually lack the appeal of the original subbed voices. Such is not the case for \"Monster\". All the performances are fantastic, especially Liam O'Brien as Kenzo Tenma, Keith Silverstein as Johan, Richard Epcar as Inspector Lunge, and Karan Strassman as Anna. I only have one issue with the show and that's the ending. It wasn't anywhere near bad, but it could have had a great epilogue. I would've liked to see one made up by Naoki Urasawa. To my knowledge there hasn't been one as of yet, but I hope that one will eventually come to be. I truly detest it when any work of extreme brilliance fails to gain the attention and praise that it rightfully deserves! \"Monster\" is one of the most underrated animes, if not the most! I can only think of few other animes that have been as effective for me. To date, only the first fifteen episodes have been released on DVD due to lack of popularity. However, the whole series is available for download on iTunes. Many anime fans will tell you that Cowboy Bebop is the greatest anime ever made. While that too is an enjoyable show, just turn your attention to \"Monster\". Numerous complex issues, memorable significant characters, stunning atmospheric visuals, a profound, well-paced story, and a powerful theme about the true value of life. It's a masterpiece in all aspects. Why can't \"Monster\" be a contender for the best anime ever I ask of everyone? How can it not stimulate any sense of admiration? \"Monster\" has left me with a mark that will last forever!"
    },
    {
      "username": "Hassaan_Lightstone",
      "userUrl": "https://www.imdb.com/user/ur71993614",
      "reviewLink": "https://www.imdb.com/review/rw4314293",
      "warningSpoilers": false,
      "date": "31 August 2018",
      "rate": "10",
      "helpful": "22 out of 24 found this helpful.",
      "title": "This anime is monster!",
      "content": "I can't take the sadness why this anime ever ended?! I remember I felt deep emptiness when I finished it for the first time. As expected from Madhouse, Monster was a monster creation. Monster is my first work which I got to know of Naoki Urasawa. Monster is literally one of the best anime ever made."
    },
    {
      "username": "TheFarscapeProject747",
      "userUrl": "https://www.imdb.com/user/ur26430634",
      "reviewLink": "https://www.imdb.com/review/rw5930083",
      "warningSpoilers": false,
      "date": "24 July 2020",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "My favorite anime",
      "content": "For some reason people always compare this series with Death Note as which one is the best suspense thriller anime. I honestly can't get that since they are both very different, one has a notebook that can kill and death demons, and the other is about the demons in humanity. I loved both but Monster which I only heard about on a top 10 mystery thriller list on YouTube is 74 episodes long, and I enjoyed every minute of it. I fully believe this underrated gem is one of the best anime ever made along with Cowboy Bebop and Attack on Titan. So do yourself a favor and watch it."
    },
    {
      "username": "honorhorror",
      "userUrl": "https://www.imdb.com/user/ur10348311",
      "reviewLink": "https://www.imdb.com/review/rw2105308",
      "warningSpoilers": false,
      "date": "2 August 2009",
      "rate": "9",
      "helpful": "16 out of 25 found this helpful.",
      "title": "The fact is that we never knew how to redefine anime in the new century until we see \"Monster\"",
      "content": "And yes, that is how good it is. Can a movie question all the human natures yet still promoting good values? Can a movie be smart and mature as well as being widely understandable? \"Monster\" has it all, yet it's only an ANIME.Don't be surprised. If you think low of animes, I am definitely not gonna persuade you into any. The only thing I want to say here is fact. And the only fact is, \"Monster\" almost made all the mystery thrillers fade away, real-set productions and animes alike.All those ordinary mystery thrillers before Monster, were only selling the performances, the production values and gores. That could even be said about Silence of the Lambs. After all, it's not anyone's fault. It's the nature of any feature-length movies. No matter how many dimensions can you put inside a feature length film, it's still so hard to pull every threads ahead easily. The other problem is you won't have enough memorable characters to talk about.(L.A.Confidential is the rare case that overcame all these barriers) It almost feels like we are crying for a great series in this genre that gave you enough time to connect, to digest and enjoy the subtlety of realism behind it.Ironcially, the one that stood out was made in Japan, about a story in Germany. There is no need to mention the connections between the two countries, but if you have an eye for history and social context, \"Monster\" is for you. Don't worry it's only about the length of a full season of \"24\". Let me also tell you about the other bottom lines. Most obviously, \"Monster\"'s concentration is not the stylish drawing. It's certainly not competing with \"Naruto\" or this kind of anime in terms of number of colors and CGI utilization. But this is not to say that Monster is inferior artistically. Ordinary people is the only thing it is trying to do right, and they did it right. You will probably see some of the most fascinating human expressions as well as interactions in any art form. Another bottom line for Monster is that it's NOT FOR CHILDREN. Try to make children understand \"Monster\" is as cruel as putting them in the illusion of the Revelation. So, if you are not sure you can handle all the dark sides of human nature, don't watch it either.Actually, for those who have seen \"Monster\" they don't need the Joker to tell them how weak is our daily morality. But \"Monster\" is illustrating this problem with one exception--our own dedication to make things right. It is discussing this topic in a more detailed and socially responsible way so it also can be very educating after all.I will give no further story about \"Monster\" and suggest any IMDb user over 18 years old to give it a try. At least, rent the first 10 episodes to decide if you will like it. Although, the answer is almost for sure.The only reason I deducted 1 star from my rating is its ending, which could have been so much better. Anyway, it's already a very satisfying story with a lot to reflect on. Thanks God I saw it when I was morally confused. It really gave me some clues."
    },
    {
      "username": "Lord_Nefarius",
      "userUrl": "https://www.imdb.com/user/ur16207289",
      "reviewLink": "https://www.imdb.com/review/rw2111009",
      "warningSpoilers": false,
      "date": "14 August 2009",
      "rate": "9",
      "helpful": "60 out of 71 found this helpful.",
      "title": "An intelligent anime",
      "content": "People traditionally associate Japanese animes with the likes of Pokemon and Dragonball Z and it is often very difficult to convince non-anime fans that there's more to them. I'm no exception! Luckily, Monster was the third serial anime I was introduced to after Death Note and Fruits Basket (odd combos, I know). And to be honest, I was not expecting this.The series starts off ordinarily with the traditional story of a doctor forced to prioritize between patients and his career. The story of two traumatized children is introduced along the way and things start becoming rather interesting. By the time I got to this point, I had completely forgotten I was watching an anime. See, in traditional Japanese animes (and no disrespect to the fans), the writers have no idea how to develop the dialogue and make it work with the story. The height of a character's shock will be repeating somebody's name in a low, gaspy/raspy voice. Among the millions of other queer things, I never got why anime writers felt that was a good emotional expression. I simply dismissed it as another odd Japanese behavior.As a pleasant surprise, Monster does almost everything to stray from that. At so many points during the story, I wondered how brilliant this would've been as a non-animated series. The character development is interesting and not muggled up or confusing, the songs/music make sense for a change, there are no irritating characters trying to be funny and the plot keeps thickening ... although slowly, and that might be a flaw. But to be honest, the gradual development is what keeps you so attached to it.So in conclusion, if you're a japanime fan and want to introduce the haters to the club, I highly recommend you make them watch this as their first ever anime. All in all, a 9.5/10 score. Definitely worth the watch!"
    },
    {
      "username": "jimniexperience",
      "userUrl": "https://www.imdb.com/user/ur78811141",
      "reviewLink": "https://www.imdb.com/review/rw4036900",
      "warningSpoilers": false,
      "date": "19 January 2018",
      "rate": "9",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Classic Suspenseful Storytelling",
      "content": "Doctor Tenma saves a child's life (Yohan) ... The child overhears Tenma confessing his sins about his enemies - and as payment for saving his life , the demon child takes the liberty to eliminate all of Tenma's enemies . Tenma (under suspicions he may be the murderer) treads down the dark path of Yohan's past , uncovering a mystery of a doctor-sponsored monster-breeding medical institute --- and Yohan was the leading star in chargeExcellent Supporting Cast and Background Stories"
    },
    {
      "username": "darkblackpug",
      "userUrl": "https://www.imdb.com/user/ur95149858",
      "reviewLink": "https://www.imdb.com/review/rw4504783",
      "warningSpoilers": false,
      "date": "10 December 2018",
      "rate": "10",
      "helpful": "13 out of 15 found this helpful.",
      "title": "Masterpiece of storytelling albeit it's minor plotholes.",
      "content": "Not going to go into detail like the other reviews since not many that hasn't watched the show reads them. Looking at the reviews in general, you'ld see that it's divided into 2 extremes. People that absolutely love it and people that don't appreciate good storytelling.The show is extremely slow but none of the episodes (well, maybe 3 were filler-like) were a waste of time. Anyone that thought 74 episodes had no plot progression doesn't understand the point of the journey.It's not a show for everyone, if you only seek andrenaline from action packed things or constant 'mind-games' like in death note, this probably isn't for you. If you only like things that give you 'the feels' or lovey-dovey romanctic films expecting a perfect ending, this isn't for you. The operative words being 'only' and 'probably', not saying that everyone that watches those fall into the same catergory. (probably going to get backlash because many people only read what they like)There are minor plotholes or rather, things which are pretty unbelievable unless you have a pretty high suspension of disbelieve but if you look part those, it's a darn perfect thriller. That's about it."
    },
    {
      "username": "ish2222",
      "userUrl": "https://www.imdb.com/user/ur97435356",
      "reviewLink": "https://www.imdb.com/review/rw5978784",
      "warningSpoilers": false,
      "date": "9 August 2020",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Calling it a masterpiece is an understatement",
      "content": "This is a very mature, serious and dark anime that has one of the best stories I have ever experienced. It has maybe the best character development I have ever seen in a work of entertainment. The story has great depth and is very detailed and the way it is portrayed is exceptional at allowing the viewer to understand and form their own judgement on each moment meaning there is no spoon feeding. It is a must watch!"
    },
    {
      "username": "benthebrat",
      "userUrl": "https://www.imdb.com/user/ur5121876",
      "reviewLink": "https://www.imdb.com/review/rw1057795",
      "warningSpoilers": false,
      "date": "10 April 2005",
      "rate": "",
      "helpful": "64 out of 74 found this helpful.",
      "title": "A fantastic anime that not only gets away with taking itself far to serious - but creates one of the most entertaining shows of any type I've ever seen by doing this.",
      "content": "A dark, suspenseful and extremely entertaining anime that boldly answers back to the skeptics who think that all anime must be as brain-dead and child-oriented as the majority of prime-time viewing. (Which is, quite frankly, usually embarrassing to watch in the presence of others.) The plot of Monster is without a doubt the best part, dark but not without cheerful scenes, and centered around the story of a Dr. Tenma, a talented Nero-surgeon, who's upright morals soon send him on a rarely chosen path to correct the wrong he'd unwittingly committed in the name of justice. Unlike other anime, most of which seem to focus on super-powers, fantasy, or sci-fi horror, this one's true chillingness is in the fact that despite being animated, it is portrayed in an all-too-real manner. In reality, the most truly terrifying people are generally people who you wouldn't think out of the ordinary in a crowd, not some supernatural monster who relies on brute force or the inability of the entire world he fights to stop him. The animation isn't the best, but the story more then makes up for it, and even watching it on a 42\" TV, I was far to engrossed with the story to make more then the occasional observation that perhaps the movement wasn't quite as smooth in some places as it might be. The same applies to the sound, which doesn't quite keep pace with the story either. Nonetheless, it is one of the best shows I've seen, period."
    },
    {
      "username": "Zubacz",
      "userUrl": "https://www.imdb.com/user/ur45918993",
      "reviewLink": "https://www.imdb.com/review/rw3034694",
      "warningSpoilers": false,
      "date": "16 June 2014",
      "rate": "8",
      "helpful": "12 out of 18 found this helpful.",
      "title": "Beautiful and thoughtful but needlessly long",
      "content": "This show is one of the most climactic anime I have seen. The fact that it takes place in Germany and Czech Republic is impressive, especially that the scenery in Frankfurt, Düsseldorf and Prague is based on real places and definitely recognisable. Czechoslovakia, having had one of the most amoral and destructive regimes of the Soviet block (due to the fact, that their communist leaders were democratically chosen), is a perfect place to accommodate the terrible themes of the show, as is Eastern Germany.Except for one episode where people in a car are supposed to speak Czech (which is just Czech text horribly read by a clearly Japanese person), all the writing and names are realistic. The amount of effort that was put into making this show feel right is amazing. The characters are very well developed. There is no deus ex machina to push the story along. The characters strive to deal with situations in believable ways and even though its often difficult for the viewer to emphasise with them, their actions are understandable. I write this because many anime fall into the trap of character development leading to drastic changes in behaviour, morality or beliefs which are frankly unrealistic. Monster feels very realistic.The animation is extremely well done. The real scenery, the face expressions (or lack of them) are drawn perfectly. There is no pointless fanservice or gore. The story is brilliantly written, despite many people finding plot holes and complaining about the ending. There are several threads that explain the nuances of the show; I suggest reading them before pointing out, that something makes no sense. The one complaint I have about this show is it's length. I would not mind 74 episodes if all of them added something to the story, but this is not the case. Even though all episodes are connected to the main theme, at least a third of them is not necessary to advance the plot. This is not to say they weren't interesting, however watching three or four episodes of a seemingly random story, before finding the small connection to the main characters was frustrating. I definitely recommend this show for anyone who is not looking for action. It's beauty and thoughtfulness is hard to find elsewhere."
    },
    {
      "username": "almond-tea",
      "userUrl": "https://www.imdb.com/user/ur9883280",
      "reviewLink": "https://www.imdb.com/review/rw1748503",
      "warningSpoilers": false,
      "date": "17 October 2007",
      "rate": "10",
      "helpful": "77 out of 90 found this helpful.",
      "title": "amazing",
      "content": "Once I started reading this manga, I really couldn't stop. It's probably one of the most fascinating, complex and suspenseful stories I've ever read. The artist's grasp of facial expression is amazing. When I compare Monster to other manga I've read...well, for the most part, there is no comparison. Like another commenter said, there is no fanservice, no glorification of violence, pointless gags, characters with cutesy personality quirks, etc...everything seems genuine and real. There were moments that horrified me speechless and scenes that brought tears to my eyes, too. Monster is very moving, but also very disturbing...a powerful commentary on human nature."
    },
    {
      "username": "soloriamagic08",
      "userUrl": "https://www.imdb.com/user/ur3352994",
      "reviewLink": "https://www.imdb.com/review/rw2145343",
      "warningSpoilers": true,
      "date": "22 October 2009",
      "rate": "6",
      "helpful": "60 out of 118 found this helpful.",
      "title": "Dark anime that's to long for its own good among other things.",
      "content": "Monster is a dark anime about human nature. It's main character is a renowned neurosurgeon that works at hospital where money and status come first and human lives second. Dr. Tenma makes a choice one night on just which side of the human life vs money spectrum his on when a little child with a gun shot wound to the head comes in followed a little later by a mayor with an a brain problem to. Well to make a long story short the choice he makes ends up ruining his life 9 years later in more ways then one, and he unfortunately starts out on a 74 episode journey to right his mistake. Yes, 74 episodes. I'll get to what's the problem with that later.The Good Realism in animation and plot for the most part. People looked like real people. No mind-numbing power ups every three episodes. No women with unrealistically large breasts or slut wear that Japanese anime's seem to think all women wear. No mindless cursing just for s**** and giggles etc. Basically take out what's in 99% of anime's and you get Monster,and that's a good thing.Characters- Tenma is a a good protagonist. He's kind, handsome but strong willed to a point. Almost to good to be true. Nina is a good heroine. No mary-suish tendencies except a few unfortunate lapses real late in the series. She's also smart, kinda bad-ass while still being a nice person, and pretty without looking like a sex object. There are more characters that join Tenma on his quest and they are done well for the most part to.Dialouge- For the most part the dialog is okay and realistic. No friendship speeches. No over-dramatic love will win the day monologues etc, but then you do have some of it being naively idealistic, and when you hear this especially in a dark anime like this then it does get a bit annoying.The Neutral- Not titled the bad because I don't think these things are bad or good they just are.Even though the title seems to be referring to one particular monster there are quite a bit of them in the story. I'll even go so far as to say one of the monsters lackeys is more of one then spoiler is. Anyway the main monster who tenma is after can only be called Omniscient. There are to many things in this anime that the monster pulls off that asks for your suspension of disbelief in spades. One of the main ones being that some of the monster's plans, no what am I saying, all of the monster's plans, no matter how w.t.f.ish come of without a hitch.The Ugly 74 episodes- Monster's biggest problem is that it tries to tell,a what's in reality, a 26 to 30 episode tops story into 74. What you get is a story that really doesn't know when to end for its own good. The first half of the show is mixed with small fillers, but still additive to a point, and then it teeters off into full blown filler boredom for the rest until the last four or so episodes.The Monster's plan was inane. You go 74 episodes just to finally find out in the end the master plan, and it just wasn't worth the long ride.The Monster barely shows up in any of the episodes. To the point that if spoiler wasn't such a tension filled presence on those extremely rare occasions when spoiler does decide to show up you would forget spoiler is even in the story.Even though a good villain stays out of sight that doesn't mean said villain should not get sufficient character development.Telling not showing- We are supposed to believe that the monster is this mass murdering sociopath and yet we really never see anything of the sort done by the monster. Sure we hear what the monster has done, but its real rare though 74 episodes that we will every see these deeds.There's this place called 511 that's brought up as a big plot point concerning the monster, and yet you never find out what really went on in there,and you definitely will never see it. It was really just used as a plot device with no ending and no real explanation. So many characters are introduced that they all sort of run together after a while.Most plot points are left unexplained or poorly explained especially things that have to do with the overall plot.Also almost every character without fail will tell the main character, or someone else, their life story to the point that you can't help but roll your eyes in boredom.My apologies if this sounds shallow, but even though the the people look realistic if you aren't a main character then the majority of them will look unusually pudgy, and just downright ugly with some very creepy looking eyes.The Ending- God the ending.When you hit the ending you will literally be asking yourself why you watched this. The ending makes everything done in those 74 episodes pointless as hell. I can literally sum up the bs of an ending in two sentences, and yet those two sentences would spoil the entire plot of Monster."
    },
    {
      "username": "hasanricardo786",
      "userUrl": "https://www.imdb.com/user/ur38218254",
      "reviewLink": "https://www.imdb.com/review/rw2808338",
      "warningSpoilers": false,
      "date": "6 June 2013",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "monster will make the thrillers and mysteries you have watched or read look like child's play.",
      "content": "when i stumbled upon this anime i thought it's going to follow the stereotypes of a typical anime. well, it doesn't. don't be fooled by the title. it's a representation of life- as real as it gets.it's so unique that it doesn't even follow the stereotypes of mysteries and thrillers. it's engaging, suspenseful, horrifying but not in the way most of the films or books of this genre are. never seeking shelter in the shadow of gore or violence it takes the viewer to the darkest corners of inhumanity and poses a serious question- what is a monster and how little or how much does it take to turn a human being into one?before i watched this anime i thought joker is the most sadistic villain of all time. in wikipedia i read- the Trickster remarks, \"When super- villains want to scare each other, they tell Joker stories.\" after watching this anime i have come to realize that the stories of the antagonist of this series will make the joker tremble and shiver in utter fear. that's what he is- the embodiment of fear, manipulation and sadistic. he along with all the characters of this anime are so real and so well developed that nothing will ever contradict or seem out of reality. the narrative is phenomenal. it's historically accurate, emotionally subtle yet engulfing, morally challenging and as a viewing experience greatly entertaining. another thing i must point out- the voice acting is the best i have seen in anime by far.the only thing that's off putting about this series is its finale primarily because it doesn't offer enough closure. but even if u crave for closures in general, after watching this anime u will have to agree- masterpieces like this are better left open to interpretations."
    }
  ],
  "errorMessage": ""
}