{
  "imDbId": "tt1910272",
  "title": "Steins;Gate",
  "fullTitle": "Steins;Gate (TV Series 2011–2015)",
  "type": "TVSeries",
  "year": "2011",
  "items": [
    {
      "username": "serbian_007",
      "userUrl": "https://www.imdb.com/user/ur30724381",
      "reviewLink": "https://www.imdb.com/review/rw3147094",
      "warningSpoilers": false,
      "date": "23 December 2014",
      "rate": "10",
      "helpful": "150 out of 161 found this helpful.",
      "title": "Slow Paced First-Half, But Turns Into Breathtakingly Beautiful Story",
      "content": "This is an amazing anime no doubt. Outstanding story and unbelievably unique characters that will stay with you forever. Unbelievably strong character development and plot structure. This is one of those anime's that you could easily re-watch the early episodes and every time you do you will end up connecting more dots - \"oh, so that's why that happened! I get it now!\", you will think to yourself. The first 11 episodes are slow paced but for a reason. Don't give up watching because the early episodes are necessary to set the context for the outstanding story that follows. If you stick with this anime past the midpoint, you will not regret it. Episode 12 is where the action starts and from there the action doesn't stop until the end. Okarin, the main character, is amazing in the English Dub. You will laugh with him, cry with him, and feel with him throughout his journey. Some characters seem annoying at first, but they grow on you too, so be patient. Honestly, everything about this anime is unique; the characters are unique, the plot is unique, the writing is unique; it's unlike anything I've ever seen before and that is what makes it so wonderful.One of the best anime's I have ever seen. If you are looking for a compelling story and strong character development, look no further. 10/10."
    },
    {
      "username": "A_Different_Drummer",
      "userUrl": "https://www.imdb.com/user/ur44112735",
      "reviewLink": "https://www.imdb.com/review/rw3048461",
      "warningSpoilers": false,
      "date": "11 July 2014",
      "rate": "10",
      "helpful": "41 out of 47 found this helpful.",
      "title": "The best anime ever ... in this world line anyway",
      "content": "Discovered anime late in life and was pretty much gobsmacked not only by the quality (usually high) but the variations. As with any other production most usually do one thing better than another, some have better art, some better scripts, some better voice actors, etc. And then we have Steins Gate, pretty much a 1-of, where every aspect is well perfect. (Yes, I know, a very controversial statement. I have seen anime fans say the same thing in chat groups, only to elicit responses of contempt, suggesting perhaps their parents never married). But folks this is I think as good as it gets. Superb art. Super voice actors (in Japanese of course, but after a while it doesn't matter). Characters so real you think you know them. And a story unlike any other. No crazy wars, no crazy magic, no crazy fantasy world, just a young man with delusions of being a mad scientist, with his own Scooby gang, who actually invents a time machine (sort of) and then has to stand by while his world comes apart. This series is nothing less than extraordinary. And oh yeah I almost forgot. In an entertainment universe of a million love stories (with my favorites being, in no special order, HERE COMES MR. JORDAN, LADYHAWKE, and the Buffy TV series) the love angle in this is nothing short of spectacular. Especially for animee."
    },
    {
      "username": "Spartan_1_1_7",
      "userUrl": "https://www.imdb.com/user/ur8202613",
      "reviewLink": "https://www.imdb.com/review/rw2956770",
      "warningSpoilers": false,
      "date": "7 February 2014",
      "rate": "9",
      "helpful": "67 out of 79 found this helpful.",
      "title": "One of the best take on time travel I have ever seen.",
      "content": "WOW, now this was an amazing anime. Its been a long while since I was this interested in an anime and enjoyed it this much.The characters in this anime are just AWESOME. They are so well made and you just get to love them immediately. The main protagonist is a great one. I immediately liked him and he just kept on getting better and better. Loved his dialogues and character. I self proclaimed evil mad scientist who is a actually a good guy. You get to feel for and love every main character, and even some of the side characters. Their meetings, bafoonery etc etc, its just fun to watch.The writing and dialogue in this anime is another thing I really liked, its just awesome. The anime might seem slow paced to many because it is basically dialogue and interactions for the first few episodes but not for me. It was so enjoyable that it didn't even seemed a tad bit boring or slow paced. Story is also a great one. It is not everyday you get to see a take on time travelling in this way, which is very personal and emotional. You get to see and feel that messing with time, even a tad bit is no joke and shouldn't be taken lightly. It can have great consequences. Even when the plot thickens and gets big, the anime never lets go of its personal touch and feeling instead of pursuing grandeur scenes. The anime is really humorous too at times. But it doesn't get way too much that a person starts cringing or groaning, which is the case with many animes. In fact, the humour in it is one of the best displayed I have seen in an anime which is not specifically a Comedy anime. It doesn't get childish or too animeish etc. It just stays right. I had a pretty good laughs at some scenes while in others a smile was always present on my face.Animation is really good, well defined and detail and pretty to look at. Soundtrack is also really good. Sets the mood in emotional scenes and is rightly appropriate for funny scenes. I do wish that the anime was a little longer so that they could have shown some background of some of the main characters. Overall, I would say, a really great anime and of the best take on time travelling I have ever seen. 9.25/10"
    },
    {
      "username": "cherold",
      "userUrl": "https://www.imdb.com/user/ur0011762",
      "reviewLink": "https://www.imdb.com/review/rw2972180",
      "warningSpoilers": false,
      "date": "1 March 2014",
      "rate": "9",
      "helpful": "55 out of 66 found this helpful.",
      "title": "Utterly fascinating",
      "content": "I just binge-watched the whole series in a few days. It has one of the most compelling story arcs of any anime I've seen. The early episodes are interesting but not exceptionally so, with an unstable protagonist, a schlub, and some idiot cosplay girl. But it's amusing, and various characters are added. The time travel story starts slowly, but this is necessary, and the series becomes incredibly compelling as the results of small time shifts create big problems. At times I got a little lost in the story, but the series does generally catch you up again, and while I would need to see some sort of elaborate diagram to see if this all holds together, in my mind it seems to.The series is swimming in time paradox issues, and at times I think it's closer in spirit to fantasy than to sci fi, especially since there seems to be a rather unscientific concept of fate, but it's incredibly absorbing throughout, and the characters become surprising likable and nuanced as the series progresses."
    },
    {
      "username": "Ore-Sama",
      "userUrl": "https://www.imdb.com/user/ur10963001",
      "reviewLink": "https://www.imdb.com/review/rw2986754",
      "warningSpoilers": false,
      "date": "27 March 2014",
      "rate": "10",
      "helpful": "90 out of 107 found this helpful.",
      "title": "Near Perfection",
      "content": "First off, I will say that the comments the series starts off slow are misleading. True, it takes awhile to get to the main point, but \"Steins;Gate\" never fails to engage on any level, and in fact engages on all levels beautifully. Humor? Gut busting. Intensity? Oh yes. Drama? Undoubtedly. Starting out as the misadventures of a self proclaimed mad scientist who may have stumbled upon a means of time travel, this series can shift gears in the blink of an eye, without any sense of whiplash, because it can do every tone so strongly. It's rare to see such a mishmash of genres pull off all of it's genres. You have a sic-fi thriller with elements of Haruhi Suzumiya esque club based slice of life dramedy, with elements of political thriller to boot. I don't want to say any more. This one should simply be experienced with as little foreknowledge as possible."
    },
    {
      "username": "peterfmodel",
      "userUrl": "https://www.imdb.com/user/ur69383645",
      "reviewLink": "https://www.imdb.com/review/rw4299589",
      "warningSpoilers": false,
      "date": "23 August 2018",
      "rate": "10",
      "helpful": "22 out of 25 found this helpful.",
      "title": "The best time travel story, ever!!!",
      "content": "If you read the description on the DVD you could be excused for believing this was a very lite and trashy story. The trueth could not be more different, this story is astounding. Some claim the first half is too slow, but this is required in order to get you to boind with the characters. When the stakes are raised you can't help but sit on the edge of your seat hoping for a miracle. Keep your tishues ready because this has some amazingly sad moments. Excellent music and suitable for children and non-science fiction viewers. I am really hangtingt out for the next instalment, Steins Gate 0."
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw2493029",
      "warningSpoilers": true,
      "date": "24 September 2011",
      "rate": "10",
      "helpful": "43 out of 53 found this helpful.",
      "title": "A great sci-fi anime series",
      "content": "This is one of my favourite anime series of recent years; it features a good story, a great cast of characters as well as moments of both comedy and tragedy. The story follows Rintaro Okabe a self-styled mad scientist who has invented a time machine from a microwave and a mobile phone he can't transport people but figures out how to send text messages back in time, which can cause time to change; each time it changes only he can remember the previous time line. Itaru \"Daru\" Hashida a computer hacker and Kurisu Makise a girl who died in the opening moments of the first episode but came back to life after one of his experiments assist him along with his old friend Mayuri Shiina. In the early episodes he sets about using the machine to improve the lives of his various friends but becomes aware that he has come to the attention of SERN and they want to stop his actions. One day they find him and in a shocking moment one of his close friends is killed. He repeatedly tries to change the past to save her but whatever he does she dies. If he is to save her he must undo everything he has done and ultimately that will mean Kurisu will die again; will he be able to make that sacrifice or will he find a way to save her? As stated before I really enjoyed this; I was quickly pulled into the story and eagerly looked forward to seeing each new episode. Rintaro was a great lead character as he was both funny and sympathetic and the rest of the group were fun to watch too. I had thought it was a comedy until the 'tragic moment' when I was genuinely shocked! The animation style is more realistic than many anime series and a more subdued colour palette gives it a distinctive feel. I strongly recommend this series to fans of anime and science fiction alike and hope that it gets a DVD release here one day.These comments are based on watching the series in Japanese with English subtitles."
    },
    {
      "username": "ecimir",
      "userUrl": "https://www.imdb.com/user/ur21281971",
      "reviewLink": "https://www.imdb.com/review/rw2556657",
      "warningSpoilers": false,
      "date": "28 January 2012",
      "rate": "10",
      "helpful": "179 out of 207 found this helpful.",
      "title": "Amazing",
      "content": "After Death Note and Code Geass, I finally found another show worth calling amazing.Starts slow and immature. But soon plot develops great as well as the characters and their relations. Amazing and very realistic characters. Great plot. Great sound and animation. Very emotional. I was skeptic when heard that this show was about time travel but it exceeded all my expectations. It's amazing and must watch show. Consider that I gave 10 starts for this show and I am very hard to get impressed. 9 of 10 movies or series I watch I'll probably consider boring, stupid or simply bad but this one is simply amazing."
    },
    {
      "username": "dussaultjulien",
      "userUrl": "https://www.imdb.com/user/ur67595110",
      "reviewLink": "https://www.imdb.com/review/rw4983254",
      "warningSpoilers": true,
      "date": "8 July 2019",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "Quite possibly the best anime I've seen to date",
      "content": "There are not a lot of anime's that can compete with storyline that is as good as Steins:Gate's is, and I can't even count the number of animes on one hand that have the character development, as well as emotion that you would not believe in anime could ever produce.I cried, I cheered and most of all I believed. This is one of the best time travel storylines I have ever had the pleasure of viewing. I recommend watching the show in the original Japanese dub as it does the show much more Justice than the English dub does.If you are looking to be entertained, while watching anime that to this date, I have not seen anybody top oh, please do yourself a favor and watch this anime."
    },
    {
      "username": "achusanjeev",
      "userUrl": "https://www.imdb.com/user/ur76028534",
      "reviewLink": "https://www.imdb.com/review/rw3784469",
      "warningSpoilers": false,
      "date": "19 August 2017",
      "rate": "10",
      "helpful": "46 out of 49 found this helpful.",
      "title": "Underrated",
      "content": "People who voted 1/10 or 2/10 are people who watched one or two episodes and stopped. This anime is really really good. They kept the story simplified , short and the characters are awesome. I really enjoyed the anime and it gave a lot of inspiration for my life. The protagonist's character is one of the best ever."
    },
    {
      "username": "the-fearless-america",
      "userUrl": "https://www.imdb.com/user/ur56393956",
      "reviewLink": "https://www.imdb.com/review/rw7566266",
      "warningSpoilers": false,
      "date": "20 November 2021",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "One of the Best Anime Ever Created !!!",
      "content": "SG is a story about a mad scientist and a time machine. The story is great, original, creative, twisting, and romantic. It will possess viewers with thrill, affection, curiousity, and bewilderment.This is one of the best anime ever created. Seldomly I give my applause at the ending of anime series, but one of them is Steins Gate."
    },
    {
      "username": "raulflober",
      "userUrl": "https://www.imdb.com/user/ur46226481",
      "reviewLink": "https://www.imdb.com/review/rw2868189",
      "warningSpoilers": false,
      "date": "11 September 2013",
      "rate": "10",
      "helpful": "103 out of 119 found this helpful.",
      "title": "A must watch",
      "content": "Im not that of a crazy anime fan or such, i just like amazing stories. Well, you got one of the finest here.At first the show starts slow and kind of childish, but as soon the story develops, it transforms into a quite deep and emotional one.The pacing of the story, the way they play with time in both storytelling and the plot itself is just superb.This show got all packed just right: drama, romance, sci-fi, action and comedy. The music is good. The animation is quite nice and i agree that the voice acting is outstanding, specially with the \"Mad Scientist\", he will become in one of your favorite characters ever, i can tell you, he is incredibly well developed. And for that matter, all the other characters are very well made too, you will feel emotionally connected to them. The premise of the show has some deep philosophical meanings: If time travel would be possible, Could a man escape his fate? What would a man do with almost divine abilities? What does the time really mean? At the end of the show, i was left thinking about the immanence of our existence and many other mindf*cking stuff.If you want a really, really outstanding show, you don't have to look to another place."
    },
    {
      "username": "joyconboyz",
      "userUrl": "https://www.imdb.com/user/ur108147809",
      "reviewLink": "https://www.imdb.com/review/rw7243261",
      "warningSpoilers": false,
      "date": "18 August 2021",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Beautifully intelligent masterpiece",
      "content": "The characters in this series are just so amazing, the dynamic and development between the cast in such a short series is on a whole other level.Some say the first half is slow and while that's true in a way, I don't think the second half would be as good without it. It gives you time to really get to know the characters and once you do, that makes the second half even more compelling.After watching this I had initially put off watching the movie as well as Steins;Gate 0 but I finally watched both and they're just as amazing as the original show!After watching this I would HIGHLY recommend watching the movie and Steins;Gate 0 they're not required but well worth watching.El. Psy. Congroo."
    },
    {
      "username": "irtelam",
      "userUrl": "https://www.imdb.com/user/ur23501222",
      "reviewLink": "https://www.imdb.com/review/rw2488565",
      "warningSpoilers": false,
      "date": "14 September 2011",
      "rate": "10",
      "helpful": "157 out of 179 found this helpful.",
      "title": "Simply Brilliant",
      "content": "Steins Gate managed to get a top spot in my anime collection.Why?Because it is simply brilliant.I have to give a special thanks to writer and director of this series since I hardly wait every week for a new episode.Well enough flattering and let me give suggestions why you should watch this series.Firstly the plot is awesome.I haven't seen any 'time-travel' topic like in this anime.With every passing episode,you left with wanting to see and learn more.Characters fits the show perfectly.Their relation with each other and their progress through the series is worth watching. Voice actors did their job very well.And I love the combination of comedy-drama-action trio.They pulled it so good.All in all,it's a worth watching series and highly recommend for anyone who wants to see something different in an anime,you won't regret it."
    },
    {
      "username": "cfassih",
      "userUrl": "https://www.imdb.com/user/ur52566814",
      "reviewLink": "https://www.imdb.com/review/rw3154397",
      "warningSpoilers": false,
      "date": "2 January 2015",
      "rate": "10",
      "helpful": "24 out of 29 found this helpful.",
      "title": "The best anime I have ever had the pleasure to watch",
      "content": "I logged into the account I never use to write my very first review on IMDb because THIS IS DESERVED of it. Steins;gate is a sci-fi, maybe even on the noir side, epic, that will have you crying, laughing, cringing (in a good way), and laughing again. If you like anime, and you have not seen Steins;gate, this is the thing you should go watch. Steins;gate the series. I have not played through the visual novel, read the manga, or seen the movie. I just know how spell bounding the anime was.Some say it starts off slow, but it actually does kick off to a relatively good pace in the first episode. It just seems slow compared to what lies beyond it, which was very fast paced for me (and I loved it). The English voice actors did a beautiful, beautiful job. The character depth and progression had me hooked very early, and up until the end it was such an emotional journey to be on indeed. The music was just heartwarming and also sad (in a good way).the main character, mad scientist whatever his name is, is a goofy little guy with a love for gadgets and trinkets, and math and physics. In a turn of events he gets himself caught in some kind of time paradox, in which the world goes to ruin, mostly because of the accidental invention of a time machine. Without knowing yet what lies at stake, he rounds up more friends to share in the glory of being able to harness the power of time itself BUT soon enough everything falls apart, and he has to like, y'know fix it, and now I've said enough.This is THE anime epic I had waited to see, and I'm so glad I did. If you haven't seen it, go watch it now!"
    },
    {
      "username": "rdvljunk",
      "userUrl": "https://www.imdb.com/user/ur35662047",
      "reviewLink": "https://www.imdb.com/review/rw5350366",
      "warningSpoilers": false,
      "date": "24 December 2019",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "beyond awesome",
      "content": "When you watch the first few episodes on this series you get the feeling 'what the f* is this?' Why does the guy behave like an idiot (crazy scientist), it's jumping back and forth, there is no cohesion. You get the idea of letting it be and try another series....DON'T! Slowely it develops and after passing a few less meaningfull side lines in the story you finally get totally blown away. The (main) characters develop, the story lines becomes intelligent, suprising clues come up. Like many time travel stories, the actors learn that their actions may have unexpected consequences, but it in this series there are also several apperently inevetable events that drive the characters to dispear. Watch yourself how it is handled, it's worth every second of the time...It's a long time ago I gave 10 out of 10...this fully deserves it: 10+"
    },
    {
      "username": "NicolasTheWolf",
      "userUrl": "https://www.imdb.com/user/ur102956159",
      "reviewLink": "https://www.imdb.com/review/rw7476948",
      "warningSpoilers": false,
      "date": "24 October 2021",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Being a mad scientist",
      "content": "Steins;Gate is from the first episode on great and still it gets better and better.As the first episodes are for the character establishment and developement, the rest is a phenomenal story amazing told with twists at every corner. Because of the perfect character establishment and developement you feel every emotion which the characters are going through.Mayuri Shiina, Kurisu Makise and Rintarou Okabe are amazing characters, they made me laugh and they made me cry but especially they made me love Steins;Gate."
    },
    {
      "username": "ste_palom",
      "userUrl": "https://www.imdb.com/user/ur86565581",
      "reviewLink": "https://www.imdb.com/review/rw4927671",
      "warningSpoilers": false,
      "date": "11 June 2019",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "\"No one knows what the future holds, that's why it's potential is infinite\"",
      "content": "Steins;Gate is the masterpiece of drama and sci-fi anime alike, it is also the greatest time travel series/movie of all time. Yes, I am been serious here, you can bring any other tv series or movie about time travel and Steins;Gate will always win. I have never watched a better written, or better directed time travel story ever, with so many memorable character and moments. With such a brilliantly created time travel system and rules, and by the way, unlike other series, Steins;Gate actually respects the rules of it's own time travel system 100% of the time which makes the writing even more impressive.One aspect of this anime that I always found fascinating is that it incorporates many references to some of the most famous time travel stories of all time but also some references to early internet culture (like 4chan and internet memes) and it manages to somehow make it all work within the story.The characters in Steins;Gate are very unique, so unique in fact that most people will feel very confused once they start watching this anime, specially because of the unique and weird personality of it's protagonist Okabe Rintarou... sorry, I mean the Mad Scientist Hououin Kyouma! Let's also not forget the genius Makise \"Cristina\" Kurise (one of the best female characters ever), the \"super hacker\" Daru, the adorable but also air headed Mayuri and the \"Part-time Warrior\" Suzuha.When it comes to flaws with this anime, there are many people that have expressed their discomfort with the first 11 episodes of Steins;Gate. I for one have enjoyed every single episode from the first one to the last one and I think that is has to do with the fact that once you finish this series, you realize that everything that happened in those first 11 episodes were relevant for the story and are actually really damm good episodes.With almost nine years after it's release, Steins;Gate is still considered one of the greatest animes of all time. One of the very few masterpieces of the current anime era."
    },
    {
      "username": "vivifan",
      "userUrl": "https://www.imdb.com/user/ur69216598",
      "reviewLink": "https://www.imdb.com/review/rw4216485",
      "warningSpoilers": false,
      "date": "26 June 2018",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "This is an anime that will stay with you forever. If you are patient you will be rewarded",
      "content": "What an outstanding series, That's all I can say. This is one of my top five favorite anime's (Clannad After Story, FMA brotherhood, Cowboy bebop, and Death note being my other favorite's.) I loved the storyline, characters, music, voice acting in both English and Japanese (Tho I like the Japanese version a bit more.) it's character development, Art style, comedy, drama, romance, action the list goes on!. Tho I will say you will have to be patient because like many people have said it does start of rather slow in the first 11 episodes. It's not bad or anything far from it but it's rather not as intense and as emotional as the second half is. But it works really well imo since it gives it a lot of time to bond with these characters and learn more about them. So when the second begins you will feel more emotionally involved with what happens to the characters. I loved all of them and felt kind of empty when the series ended. That is what you want in a Good TV show/movie or any other form of entertainment is too feel for the characters and this does a fantastic job. Every character who displays any form of emotion you will feel for them and understand where they are coming from. I Highly Recommend this to any Time Travel/SCI-FI fan and even to people who are not fans of anime."
    },
    {
      "username": "WeAreLive",
      "userUrl": "https://www.imdb.com/user/ur79460801",
      "reviewLink": "https://www.imdb.com/review/rw4550347",
      "warningSpoilers": true,
      "date": "31 December 2018",
      "rate": "10",
      "helpful": "11 out of 14 found this helpful.",
      "title": "Time travel, makes verb tenses so confusing",
      "content": "After watching all 24 episodes including 2 specials I must say I am very impressed. This might even be my new favourite anime. I admit though it does take at least 11 episodes to understand what is happening and to keep up with the pace of things. Also, it did get very tedious at times but luckily not too much. In this review there maybe, spoilers ahead and if you don't want to get spoiled please leave my review and watch it yourself.So, the story is about a young scientist by the name of Rintarou Okabe who finds a researcher called Kurisu Makise and then he enters a symposium for time then she alive and well. The researcher discovers ways they can send messages to each other in time, these are known as demails and they also discover sern (sorry if I have spelt it wrong) which is this organisation which wants to start WW3 with time travel in the future. Every demail that gets sent cause more and more havoc on the present as they are jumping throw different world lines. Nobody remembers anything different from each world line but Okabe himself.That is all I am going to spoil from here.Yeah, just from that paragraph is like the confusing part, and it does get tedious after that for a bit. Okay, just for up head spoilers Mayuri in the next world line dies and Okabe keeps on going back in time just to prevent her death. This wasn't necessarily a bad thing, but an entire episode was focused on that one thing but kept on having the same outcome.Okay,I promise there won't be any more spoilers from here.As an overall the whole series was good, this is just my first time getting into the franchise and I can't wait to watch the movie and the 0 series hopefully those should be good. I liked majority of the episodes and the only one I didn't like was episode 19 as I felt that could have been handled much better then what it was.I watched most of the series dubbed as that's how I prefer to watch anime over subbed and original Japanese. We have a good voice cast staring J Michael Tatum as the mad scientist himself Rinrarou Okabe, Trina Nishimura as the sassy assistant Krystina... just kidding Kurisu Makise, Tyson Rinehart as the hacker Itaru Hashida, Jackie Ross (Ashly Burch) as the cute, must protect and outgoing Mayuri Shiina and Cherami Leigh as badass 18-year-old who is time traveller called Suzuha Amane. I also watched one episode in Japanese and that was fairly good as well.If you want something to be doing with science and time travel I would high recommend this anime. But, like I said it might be confusing at first but as you keep watch it would start piecing the puzzles for you."
    },
    {
      "username": "BoydudeReviews",
      "userUrl": "https://www.imdb.com/user/ur55532299",
      "reviewLink": "https://www.imdb.com/review/rw4553772",
      "warningSpoilers": false,
      "date": "1 January 2019",
      "rate": "10",
      "helpful": "13 out of 17 found this helpful.",
      "title": "A fascinating, time-travel mystory.",
      "content": "When i watched the firsr episode of Stiens Gate, I was not impressed at all. However, as the show went on, I suddenly found myself hooked to this show. Steins Gate is about this man who creates a time machine and a series of strange events ensure. I don't qant to ruin the show bur it is really good. The first half of the season is just the characters trying to make a time machine work. Tbere isn't much in terma of action, but it truly makes up for a series of interesting chracater dynamics. Honestly, all the chsracters in this show are all uniqe and just fsscinating to watch. I could just watch them all day in their lab bassement chatting away. And that is what the first half of the series is. Just these amazing characters working off one another and solving certain puzzles involving time travel. I watched this in english dub and bave to admit that tbis is the BEST englisb dub of an anime series I have beard so far. They way they talk just feels so natrual. There is a scene where a certain characters hot head gets the best of them when he accedently dtarts yelling at a girl and then she starts crying. This character doesn't know how to respond to this as they have never really made anyone cry beforw and the rest of the scene is them just kinda mopeing. There is just something 'Real' about this scene as I have witnessed or experienced something like that before. The story is also very fascinating and just binge worthy stuff. Tbe second half of the show is where thjngs really, REALLY kick off. Something unexpected happens that a certain character has to use time travel to go back in time and try and fix that problem. What ensres is just entertainong yet terribly tragic. You just see how that unexpected event has effectes them and how far they are willing to go to fix that problem.The animation is just amazing. I love the backgrounds, even the charater designs. My only complaints about this show is that the some of the scientific stuff does go over my head sometimws and the whole time teavel thing kinda confuses me at times. Bit apart from that, I 100% recommend yoy to give this show a watch. 😁👍🏾"
    },
    {
      "username": "KingProjector93",
      "userUrl": "https://www.imdb.com/user/ur56862102",
      "reviewLink": "https://www.imdb.com/review/rw3354364",
      "warningSpoilers": true,
      "date": "13 November 2015",
      "rate": "10",
      "helpful": "10 out of 12 found this helpful.",
      "title": "One Of The Finest Pieces Of Animated Television Anywhere",
      "content": "Self styled 'mad scientist' and geek Rintaro Okabe/'Hooin Kyoma' stumbles across the murder of scientific starlet Makise Kurisu during a lecture on time travel. Following a strange temporal 'event', Okabe sees her alive and is desperate to figure out how this is possible, enlisting her in the 'Future Gadget Laboratory' (his little club) and working on his microwave time machine.One of the finest anime I have ever watched, 'Stein;s Gate' is the antithesis of your typical goofy fanservice fest, offering a smart and often touching take on the power and side effects of time travel. The foundation is absurd for sure, and the show's sense of humour has no problem mining that, but when we get to the members using the technology to alter their lives and in the process, change the world around them, the show pulls no punches. This is amplified by the fact that we have a strong and likable lot of characters that make up Okabe's entourage: the eccentric lead, the smart but somewhat high nosed Kurisu, the loveably sweet Miyuri, tech and online geek Daru, the silent and reserved Moeka, the timid & transgendered Lukako, the excitable waitress Faris and the high spirited tomboy Suzuha. They all compliment each other well and as the series progresses, you really get behind them and why they want these changes, some of which do tug hard at the heartstrings.However, it is Okabe's story that is the most grueling, as 'Stein;s Gate also acts as a more fantastical coming of age story as he remembers every change in the timeline, and how he must step up for his friends, as well as solving Kurisu's murder. He goes from petty manchild to a far more mature adult by the end and it can be very harrowing. How'd have thunk this could come from the inventor of a microwave & phone based time machine? And the rest is no slack: the animation is subdued but full of nuance and detail, refreshing for a sci-fi show, the music is often sombre but never overpowering or melodramatic, and the voice cast are tremendous, with J. Michael Tatum on the English front giving a career best performance as Okabe. Frankly, I have practically no genuine complaints or issues to speak of, save for maybe the last episode being little more than perfunctory sugaring of an already satisfying ending, but even then, it still has enough laughs to get by. Honestly, I cannot sing the praises of this show enough: drop whatever you are doing, and go see this show. It is criminally underrated, and of the best animated television series to come out in the last decade, as well as technically one of the good, if not great, video game adaptations."
    },
    {
      "username": "mercfma",
      "userUrl": "https://www.imdb.com/user/ur52251585",
      "reviewLink": "https://www.imdb.com/review/rw3169701",
      "warningSpoilers": true,
      "date": "24 January 2015",
      "rate": "10",
      "helpful": "12 out of 15 found this helpful.",
      "title": "The Best Anime of All Time.",
      "content": "As far as i'm concerned nothing will ever live up to this show. I found myself watching two episodes late at night and was slightly confused on the first episode and slightly more intrigued in the second, so i went to sleep and the next night i watched another three episodes. I planed to go to sleep after the third episode and upon finishing it my exact words were \"welp looks like i'm not sleeping at all\" i never slept that night and watched the next 15 episodes in one sitting. Thats how into this show i got, its spectacular in every aspect. Twists and left turns that your just like OMG i can't believe how great this is!!! I can almost guarantee every person that watches this will absolutely love it and it will become an instant #1 favorite. It reminded me a lot of a mix between \"Death Note\" & \"Future Diary\", it just keeps you guessing and freaking out all the way to the end. This should be at the top of any \"plan to watch\" lists you have, trust me all the hype and praise this series has has earned it through and through. Note: I've also seen the special(just episode 25) but I've yet to see the sequel movie at the time of writing this.5/5 Why? Its just so perfectly put together from start to finish, an absolute masterpiece there's no better words other than this. Character design is great, the music & sound effects are great. You can cut the tension with a knife in so many scenes, you really just get completely submerged into this world its like your right there in it. You'd be a down right idiot to not give this a try, what every you do don't drop it before episode 5."
    },
    {
      "username": "aamirbilvani",
      "userUrl": "https://www.imdb.com/user/ur21051122",
      "reviewLink": "https://www.imdb.com/review/rw3159160",
      "warningSpoilers": true,
      "date": "9 January 2015",
      "rate": "10",
      "helpful": "46 out of 53 found this helpful.",
      "title": "Probably the best anime ever in terms of story",
      "content": "I've seen many anime series and I've never written a review before, but after watching this show i felt I just had to. When starting this series, I was initially confused as to what was going on, and even until almost midway, I was failing to see the point of the show, as nothing really exciting was happening (in my opinion). But in hindsight, this was necessary for character and story development, as around the midpoint, the show just exploded and from then on I was glued to screen. It might not have the best animation or the best music, but in terms of story and character, there is nothing like it (not even the mighty Fullmetal Alchemist: Brotherhood compares, although it comes close). This story and it characters will stay with me for a long time, and I highly encourage everyone to watch the series to its conclusion. You will not be disappointed."
    },
    {
      "username": "eldenwang",
      "userUrl": "https://www.imdb.com/user/ur71570721",
      "reviewLink": "https://www.imdb.com/review/rw3634889",
      "warningSpoilers": false,
      "date": "7 February 2017",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "El Psy Congroo",
      "content": "As a science fiction anime, it has unbelievable logically theoretical base. The theory of \"World Line\" is well developed which makes me admire the screenwriter very much. At first, this anime is annoyingly confusing, and I don't know what is happening at all. The mad scientist has a lot of confusing and embarrassing dialogue. However, as the story goes on, he gradually turns upset and desperate because of countless times of failure. As a man out of the screen, I can even feel the agony and helplessness seeing him trying to save Mayuri again and again. At the end, the exciting ED and operational declaration bring the mad scientist that we are familiar with back and save the world(present and future) at last. I really want to stand up to cheep for him. By the way, EL PSY CONGROO!"
    }
  ],
  "errorMessage": ""
}