{
  "imDbId": "tt1910272",
  "title": "Steins;Gate",
  "fullTitle": "Steins;Gate (TV Series 2011–2015)",
  "type": "TVSeries",
  "year": "2011",
  "language": "en",
  "titleInLanguage": "Steins;Gate (TV series)",
  "url": "https://en.wikipedia.org/wiki/Steins;Gate_(TV_series)",
  "plotShort": {
    "plainText": "Steins;Gate is a Japanese anime television series created by the animation studio White Fox based on 5pb. and Nitroplus's 2009 visual novel of the same name. The series aired for 24 episodes, from April to September 2011. It is set in 2010 and follows Rintaro Okabe, who together with his friends accidentally discovers a method of time travel through which they can send text messages to the past, thereby changing the present.\r\nIt is part of the Science Adventure franchise along with Chaos;Head and Robotics;Notes. The series was directed by Hiroshi Hamasaki and Takuya Satō, and written by Jukki Hanada, with animation direction and character design by Kyuuta Sakai, and music by Takeshi Abo. It was simulcast in North and South America, Africa, the Middle East, and parts of Europe by Crunchyroll and the United Kingdom by Anime on Demand. A 25th episode was later included with the DVD and Blu-ray releases; these releases were handled by Funimation in North America and by Manga Entertainment in the United Kingdom.\r\nCritics praised its character development and its themes of time travel, human nature, gender identity and its perspective on PTSD. It is considered one of the best anime series of the 2010s. The series has spawned four original net animation episodes and a spinoff film. An anime adaptation of Steins;Gate 0, the sequel to the original Steins;Gate game, premiered in 2018.",
    "html": "<p>Steins;Gate is a Japanese anime television series created by the animation studio White Fox based on 5pb. and Nitroplus's 2009 visual novel of the same name. The series aired for 24 episodes, from April to September 2011. It is set in 2010 and follows Rintaro Okabe, who together with his friends accidentally discovers a method of time travel through which they can send text messages to the past, thereby changing the present.</p><p>It is part of the Science Adventure franchise along with Chaos;Head and Robotics;Notes. The series was directed by Hiroshi Hamasaki and Takuya Satō, and written by Jukki Hanada, with animation direction and character design by Kyuuta Sakai, and music by Takeshi Abo. It was simulcast in North and South America, Africa, the Middle East, and parts of Europe by Crunchyroll and the United Kingdom by Anime on Demand. A 25th episode was later included with the DVD and Blu-ray releases; these releases were handled by Funimation in North America and by Manga Entertainment in the United Kingdom.</p><p>Critics praised its character development and its themes of time travel, human nature, gender identity and its perspective on PTSD. It is considered one of the best anime series of the 2010s. The series has spawned four original net animation episodes and a spinoff film. An anime adaptation of Steins;Gate 0, the sequel to the original Steins;Gate game, premiered in 2018.</p>"
  },
  "plotFull": {
    "plainText": "Steins;Gate is a Japanese anime television series created by the animation studio White Fox based on 5pb. and Nitroplus's 2009 visual novel of the same name. The series aired for 24 episodes, from April to September 2011. It is set in 2010 and follows Rintaro Okabe, who together with his friends accidentally discovers a method of time travel through which they can send text messages to the past, thereby changing the present.\r\nIt is part of the Science Adventure franchise along with Chaos;Head and Robotics;Notes. The series was directed by Hiroshi Hamasaki and Takuya Satō, and written by Jukki Hanada, with animation direction and character design by Kyuuta Sakai, and music by Takeshi Abo. It was simulcast in North and South America, Africa, the Middle East, and parts of Europe by Crunchyroll and the United Kingdom by Anime on Demand. A 25th episode was later included with the DVD and Blu-ray releases; these releases were handled by Funimation in North America and by Manga Entertainment in the United Kingdom.\r\nCritics praised its character development and its themes of time travel, human nature, gender identity and its perspective on PTSD. It is considered one of the best anime series of the 2010s. The series has spawned four original net animation episodes and a spinoff film. An anime adaptation of Steins;Gate 0, the sequel to the original Steins;Gate game, premiered in 2018.\r\nPlot\r\nSteins;Gate is an adaptation of the visual novel of the same name. It is set in 2010 in Akihabara, Tokyo, and follows Rintaro Okabe, a self-proclaimed \"mad scientist\", who runs the \"Future Gadget Laboratory\" in an apartment together with his friends Mayuri Shiina and Itaru \"Daru\" Hashida. While attending a conference about time travel, Okabe finds the dead body of Kurisu Makise, a neuroscience researcher; he sends a text message about it to Daru and later discovers that Kurisu is alive and that the message arrived before he sent it. The laboratory members learn that the cell phone-operated microwave oven they are developing can send text messages back in time; they are joined by Kurisu, and investigate it, sending text messages – referred to as \"D-mails\" – to the past to change the present. Kurisu eventually creates a device that can send memories through the microwave oven, effectively allowing the user to time travel.\r\nSERN, a fictional organization based on CERN, learns of the time machine and sends people to the laboratory to retrieve it, killing Mayuri in the process. Okabe goes back in time multiple times to prevent Mayuri's death but fails each time. He learns that he needs to undo all the changes their D-mails have caused and does so until he realizes that undoing the first D-mail would return him to the timeline where Kurisu was found dead.\r\nOkabe and Kurisu tell each other about their romantic feelings for one another, after which Kurisu tells Okabe to save Mayuri. Daru hacks into SERN's database, and they delete the record of the D-mail, returning them to the original timeline. Later, Suzuha Amane, Daru's future daughter, arrives in a time machine to tell Okabe that the only way to prevent a time-travel arms race leading to World War III is to prevent Kurisu's father Nakabachi from killing her and stealing her time travel theories. Suzuha and Okabe travel back in time, but Okabe accidentally kills Kurisu himself. Returning to the present, Okabe receives a message from his future self telling him that to escape the current timeline, he needs to save Kurisu while recreating the vision of the dead Kurisu that his past self saw. Traveling back in time again, he provokes Nakabachi into stabbing him, knocks Kurisu unconscious, and puts her in his pool of blood for his past self to see, causing the timeline to diverge into one where Kurisu lives and World War III does not occur.\r\nCast\r\nProduction\r\nThe anime adaptation was announced in July 2010 by Chiyomaru Shikura, the head of 5pb. Steins;Gate was created at the animation studio White Fox, and was produced by Mika Nomura and Yoshinao Doi, directed by Hiroshi Hamasaki and Takuya Satō, and written by Jukki Hanada, with Kyuuta Sakai serving as character designer and chief animation director.\r\nWhile Takeshi Abo, the composer for the Science Adventure games, only had a small role in the previous anime adaptation of the series, he was appointed to compose for the Steins;Gate anime together with his coworker Jun Murakami. Abo composed new music, and made use of the same atmosphere and musical worldview as when he composed for the Steins;Gate game, but also had to consider that the music had to be synchronized with the motions of the anime; this was a very different way of working than the one he uses when composing for games.\r\nThe anime series has also received an animated film sequel, Steins;Gate: The Movie − Load Region of Déjà Vu, which premiered on April 20, 2013, and an anime adaptation of Steins;Gate 0 premiered in 2018. Footage from the Steins;Gate anime is used in the 2018 game Steins;Gate Elite – a fully animated, updated version of the original Steins;Gate game – along with new animation by White Fox.\r\nRelease\r\nThe series aired for 24 episodes from April 6 to September 14, 2011; and was released on DVD and Blu-ray in nine volumes from June 22, 2011, to February 22, 2012, in Japan; the ninth and final volume included a 25th \"special episode\" not included in the broadcast. For the series' rebroadcast in 2015, an alternate version of episode 23 where Okabe does not save Kurisu was aired to promote the Steins;Gate game's sequel Steins;Gate 0. Steins;Gate: Sōmei Eichi no Cognitive Computing, a series of four original net animation shorts based on the series focusing on how computers could improve people's lives in the future, was made in a collaboration with IBM following a talk between Shikura and representatives from IBM Japan. The episodes were released from October to November 2014 on IBM's Mugendai website in Japanese, and on IBM Japan's YouTube channel in Japanese with English subtitles.\r\nOutside Japan, the series was distributed by different companies. Crunchyroll simulcast the series in North and South America, Scandinavia, the Netherlands, the Middle East, and Africa; Anime on Demand did the same in the United Kingdom. Funimation later acquired the license for the North American rights, produced an English dub, and released the series on DVD and Blu-ray in two volumes in 2012. Madman Entertainment acquired the license for the Australian rights, and streamed the series on their website. Manga Entertainment waited to acquire the license for the United Kingdom rights until Funimation had completed the English dub, and released it in two volumes on DVD and Blu-ray in 2013.\r\nReception\r\nAccolades\r\nThe series was amongst the Best Animes of the 2010s and Rintaro Okabe was awarded Man of the Decade at Anime Trending Awards. In 2011, Steins;Gate was part of the Jury Selections at the 15th Japan Media Arts Festival in the Animation category. It won a Newtype Anime Awards for the Best Male anime character of the year, for Rintaro Okabe. Steins;Gate was nominated for the 43rd Seiun Award in the Best Media category in 2012, but lost to Puella Magi Madoka Magica.\r\nSteins;Gate is considered as one of the best anime series of the 2010s. IGN listed the series among the best anime series of the 2010s. Crunchyroll also listed it in their \"Top 100 best anime of the 2010s\".\r\nCritical response\r\nThe Steins;Gate anime series holds a 100% on Rotten Tomatoes, based on 5 reviews.\r\nThe series has been well received by critics, with Carlo Santos at Anime News Network calling it \"one of the most addictive sci-fi thrillers in recent anime history\", Richard Eisenbeis at Kotaku calling it one of the best anime he had seen, and Chris Beveridge at The Fandom Post calling it his favorite simulcast title of 2011. Critics have enjoyed the series' story and writing. Santos enjoyed how Steins;Gate misleads the viewer by spending the first half of the series on comedy before turning into a thriller for the second half, and how the finale revisits the events of the first episode, making for a \"rock-solid climax\". Rebecca Silverman at Anime News Network described the series as an Interesting concept, nice visual flair when needed and the final episode really is a great hook for the rest of the series. She found the second half of the show to be a step up, compare to the first half; she enjoyed the added urgency, and how the characters were given development and how the viewer was given insight into their motivations from the first half of the series. Aiden Foote from THEM Anime Reviews gave the series a 5 out of 5 stars and described it as \"The build up of characterisation is effective, the show is very entertaining and the complexity is handled with insight and maturity\".\r\nEisenbeis noted the rules for how time travel works as well defined, which he called among the hardest things to do when writing time travel fiction. Pierce Drew at The Fandom Post enjoyed the story and characters. Patrick of Cedar Mill & Bethany Community Libraries called it a \"brilliant mash-up of hard science fiction, comedy, romance and drama\". Santos called the character designs memorable and found it refreshing that the anime featured an overweight person as one of its main characters. He noted that the backgrounds, while making use of muted and grayish tones, still had enough color to be visually appealing.\r\nSilverman thought that the series' visuals were uneven for the first half, having some \"nice visual flair\" at some points, such as a black-and-white scene in episode 11, and some fan-service shots that she found ill-fitting. For the second half, she found the visuals and audio design to have improved, with a focus on visual themes such as clasped hands, and the use of highly detailed and more realistic art during stressful moments in the story. Foote enjoyed the visual presentation of Akihabara, which he described as \"lifeless but ever moving, like sand in the desert wind\"; he called it evocative of morning street scenes in the directors' earlier work Serial Experiments Lain (1998), and proof that they had not lost their touch since then. Drew thought the visuals were of high quality throughout the series, and that they were a good, albeit less detailed, representation of the art style used in the Steins;Gate game.\r\nSales\r\nThe first Japanese Blu-ray volume of the series opened as the week's fourth best selling animation Blu-ray and the seventh best selling Blu-ray overall, with 11,802 copies sold according to Oricon; and remained on the sales charts for an additional three weeks, selling 14,921 copies in total. At the end of 2012, volume 9, 8, and 7 were the 44th, 46th, and 49th best selling animation Blu-rays of the year in Japan. The Japanese DVD and Blu-ray boxes that collect the whole series also charted: the DVD box, which was released in March 2013, was the 26th best selling animation DVD of the week; and the Blu-ray box, which was released in February 2016, premiered on fourth place and charted for two weeks.",
    "html": "<p>Steins;Gate is a Japanese anime television series created by the animation studio White Fox based on 5pb. and Nitroplus's 2009 visual novel of the same name. The series aired for 24 episodes, from April to September 2011. It is set in 2010 and follows Rintaro Okabe, who together with his friends accidentally discovers a method of time travel through which they can send text messages to the past, thereby changing the present.</p><p>It is part of the Science Adventure franchise along with Chaos;Head and Robotics;Notes. The series was directed by Hiroshi Hamasaki and Takuya Satō, and written by Jukki Hanada, with animation direction and character design by Kyuuta Sakai, and music by Takeshi Abo. It was simulcast in North and South America, Africa, the Middle East, and parts of Europe by Crunchyroll and the United Kingdom by Anime on Demand. A 25th episode was later included with the DVD and Blu-ray releases; these releases were handled by Funimation in North America and by Manga Entertainment in the United Kingdom.</p><p>Critics praised its character development and its themes of time travel, human nature, gender identity and its perspective on PTSD. It is considered one of the best anime series of the 2010s. The series has spawned four original net animation episodes and a spinoff film. An anime adaptation of Steins;Gate 0, the sequel to the original Steins;Gate game, premiered in 2018.</p><br/><h3>Plot</h3><p>Steins;Gate is an adaptation of the visual novel of the same name. It is set in 2010 in Akihabara, Tokyo, and follows Rintaro Okabe, a self-proclaimed \"mad scientist\", who runs the \"Future Gadget Laboratory\" in an apartment together with his friends Mayuri Shiina and Itaru \"Daru\" Hashida. While attending a conference about time travel, Okabe finds the dead body of Kurisu Makise, a neuroscience researcher; he sends a text message about it to Daru and later discovers that Kurisu is alive and that the message arrived before he sent it. The laboratory members learn that the cell phone-operated microwave oven they are developing can send text messages back in time; they are joined by Kurisu, and investigate it, sending text messages – referred to as \"D-mails\" – to the past to change the present. Kurisu eventually creates a device that can send memories through the microwave oven, effectively allowing the user to time travel.</p><p>SERN, a fictional organization based on CERN, learns of the time machine and sends people to the laboratory to retrieve it, killing Mayuri in the process. Okabe goes back in time multiple times to prevent Mayuri's death but fails each time. He learns that he needs to undo all the changes their D-mails have caused and does so until he realizes that undoing the first D-mail would return him to the timeline where Kurisu was found dead.</p><p>Okabe and Kurisu tell each other about their romantic feelings for one another, after which Kurisu tells Okabe to save Mayuri. Daru hacks into SERN's database, and they delete the record of the D-mail, returning them to the original timeline. Later, Suzuha Amane, Daru's future daughter, arrives in a time machine to tell Okabe that the only way to prevent a time-travel arms race leading to World War III is to prevent Kurisu's father Nakabachi from killing her and stealing her time travel theories. Suzuha and Okabe travel back in time, but Okabe accidentally kills Kurisu himself. Returning to the present, Okabe receives a message from his future self telling him that to escape the current timeline, he needs to save Kurisu while recreating the vision of the dead Kurisu that his past self saw. Traveling back in time again, he provokes Nakabachi into stabbing him, knocks Kurisu unconscious, and puts her in his pool of blood for his past self to see, causing the timeline to diverge into one where Kurisu lives and World War III does not occur.</p><br/><h3>Cast</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th rowspan=\"2\">Character</th><th colspan=\"2\">Voice actor</th></tr><tr><th>Japanese</th><th>English</th></tr><tr><td><span>Rintaro Okabe</span></td><td><span>Mamoru Miyano</span></td><td><span>J. Michael Tatum</span></td></tr><tr><td>Kurisu Makise</td><td><span>Asami Imai</span></td><td><span>Trina Nishimura</span></td></tr><tr><td>Mayuri Shiina</td><td><span>Kana Hanazawa</span></td><td><span>Ashly Burch</span></td></tr><tr><td>Itaru \"Daru\" Hashida</td><td><span>Tomokazu Seki</span></td><td>Tyson Rinehart</td></tr><tr><td>Suzuha Amane</td><td><span>Yukari Tamura</span></td><td><span>Cherami Leigh</span></td></tr><tr><td>Moeka Kiryu</td><td><span>Saori Gotō</span></td><td>Jessica Cavanagh</td></tr><tr><td>Ruka Urushibara</td><td><span>Yū Kobayashi</span></td><td><span>Lindsay Seidel</span></td></tr><tr><td>Faris NyanNyan</td><td><span>Haruko Momoi</span></td><td><span>Jad Saxton</span></td></tr><tr><td>Yugo \"Mr. Braun\" Tennouji</td><td><span>Masaki Terasoma</span></td><td><span>Christopher Sabat</span></td></tr><tr><td>Nae Tennouji</td><td><span>Ayano Yamamoto</span></td><td><span>Brina Palencia</span></td></tr><tr><td><span>John Titor</span></td><td><span>Hiroshi Tsuchida</span></td><td><span>Patrick Seitz</span></td></tr></tbody></table><br/><h3>Production</h3><p>The anime adaptation was announced in July 2010 by Chiyomaru Shikura, the head of 5pb. Steins;Gate was created at the animation studio White Fox, and was produced by Mika Nomura and Yoshinao Doi, directed by Hiroshi Hamasaki and Takuya Satō, and written by Jukki Hanada, with Kyuuta Sakai serving as character designer and chief animation director.</p><p>While Takeshi Abo, the composer for the Science Adventure games, only had a small role in the previous anime adaptation of the series, he was appointed to compose for the Steins;Gate anime together with his coworker Jun Murakami. Abo composed new music, and made use of the same atmosphere and musical worldview as when he composed for the Steins;Gate game, but also had to consider that the music had to be synchronized with the motions of the anime; this was a very different way of working than the one he uses when composing for games.</p><p>The anime series has also received an animated film sequel, Steins;Gate: The Movie − Load Region of Déjà Vu, which premiered on April 20, 2013, and an anime adaptation of Steins;Gate 0 premiered in 2018. Footage from the Steins;Gate anime is used in the 2018 game Steins;Gate Elite – a fully animated, updated version of the original Steins;Gate game – along with new animation by White Fox.</p><br/><h3>Release</h3><p>The series aired for 24 episodes from April 6 to September 14, 2011; and was released on DVD and Blu-ray in nine volumes from June 22, 2011, to February 22, 2012, in Japan; the ninth and final volume included a 25th \"special episode\" not included in the broadcast. For the series' rebroadcast in 2015, an alternate version of episode 23 where Okabe does not save Kurisu was aired to promote the Steins;Gate game's sequel Steins;Gate 0. Steins;Gate: Sōmei Eichi no Cognitive Computing, a series of four original net animation shorts based on the series focusing on how computers could improve people's lives in the future, was made in a collaboration with IBM following a talk between Shikura and representatives from IBM Japan. The episodes were released from October to November 2014 on IBM's Mugendai website in Japanese, and on IBM Japan's YouTube channel in Japanese with English subtitles.</p><p>Outside Japan, the series was distributed by different companies. Crunchyroll simulcast the series in North and South America, Scandinavia, the Netherlands, the Middle East, and Africa; Anime on Demand did the same in the United Kingdom. Funimation later acquired the license for the North American rights, produced an English dub, and released the series on DVD and Blu-ray in two volumes in 2012. Madman Entertainment acquired the license for the Australian rights, and streamed the series on their website. Manga Entertainment waited to acquire the license for the United Kingdom rights until Funimation had completed the English dub, and released it in two volumes on DVD and Blu-ray in 2013.</p><br/><h3>Reception</h3><h4>Accolades</h4><p>The series was amongst the Best Animes of the 2010s and Rintaro Okabe was awarded Man of the Decade at Anime Trending Awards. In 2011, Steins;Gate was part of the Jury Selections at the 15th Japan Media Arts Festival in the Animation category. It won a Newtype Anime Awards for the Best Male anime character of the year, for Rintaro Okabe. Steins;Gate was nominated for the 43rd Seiun Award in the Best Media category in 2012, but lost to Puella Magi Madoka Magica.</p><p>Steins;Gate is considered as one of the best anime series of the 2010s. IGN listed the series among the best anime series of the 2010s. Crunchyroll also listed it in their \"Top 100 best anime of the 2010s\".</p><h4>Critical response</h4><p>The Steins;Gate anime series holds a 100% on Rotten Tomatoes, based on 5 reviews.</p><p>The series has been well received by critics, with Carlo Santos at Anime News Network calling it \"one of the most addictive sci-fi thrillers in recent anime history\", Richard Eisenbeis at Kotaku calling it one of the best anime he had seen, and Chris Beveridge at The Fandom Post calling it his favorite simulcast title of 2011. Critics have enjoyed the series' story and writing. Santos enjoyed how Steins;Gate misleads the viewer by spending the first half of the series on comedy before turning into a thriller for the second half, and how the finale revisits the events of the first episode, making for a \"rock-solid climax\". Rebecca Silverman at Anime News Network described the series as an Interesting concept, nice visual flair when needed and the final episode really is a great hook for the rest of the series. She found the second half of the show to be a step up, compare to the first half; she enjoyed the added urgency, and how the characters were given development and how the viewer was given insight into their motivations from the first half of the series. Aiden Foote from THEM Anime Reviews gave the series a 5 out of 5 stars and described it as \"The build up of characterisation is effective, the show is very entertaining and the complexity is handled with insight and maturity\".</p><p>Eisenbeis noted the rules for how time travel works as well defined, which he called among the hardest things to do when writing time travel fiction. Pierce Drew at The Fandom Post enjoyed the story and characters. Patrick of Cedar Mill & Bethany Community Libraries called it a \"brilliant mash-up of hard science fiction, comedy, romance and drama\". Santos called the character designs memorable and found it refreshing that the anime featured an overweight person as one of its main characters. He noted that the backgrounds, while making use of muted and grayish tones, still had enough color to be visually appealing.</p><p>Silverman thought that the series' visuals were uneven for the first half, having some \"nice visual flair\" at some points, such as a black-and-white scene in episode 11, and some fan-service shots that she found ill-fitting. For the second half, she found the visuals and audio design to have improved, with a focus on visual themes such as clasped hands, and the use of highly detailed and more realistic art during stressful moments in the story. Foote enjoyed the visual presentation of Akihabara, which he described as \"lifeless but ever moving, like sand in the desert wind\"; he called it evocative of morning street scenes in the directors' earlier work Serial Experiments Lain (1998), and proof that they had not lost their touch since then. Drew thought the visuals were of high quality throughout the series, and that they were a good, albeit less detailed, representation of the art style used in the Steins;Gate game.</p><h4>Sales</h4><p>The first Japanese Blu-ray volume of the series opened as the week's fourth best selling animation Blu-ray and the seventh best selling Blu-ray overall, with 11,802 copies sold according to Oricon; and remained on the sales charts for an additional three weeks, selling 14,921 copies in total. At the end of 2012, volume 9, 8, and 7 were the 44th, 46th, and 49th best selling animation Blu-rays of the year in Japan. The Japanese DVD and Blu-ray boxes that collect the whole series also charted: the DVD box, which was released in March 2013, was the 26th best selling animation DVD of the week; and the Blu-ray box, which was released in February 2016, premiered on fourth place and charted for two weeks.</p><br/>"
  },
  "errorMessage": ""
}