{
  "imDbId": "tt1475582",
  "title": "Sherlock",
  "fullTitle": "Sherlock (TV Series 2010–2017)",
  "type": "TVSeries",
  "year": "2010",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8863480",
      "warningSpoilers": false,
      "date": "10 February 2023",
      "rate": "9",
      "helpful": "46 out of 48 found this helpful.",
      "title": "Brilliant!",
      "content": "Sherlock is just an incredible series. It has a 9.1 rating for a reason. There have been so many shows and movies based off Sherlock Holmes but I can say with confidence that this is the best of them. The writing and acting is would makes this show so special. Every single season is just as good as the others. Benedict Cumberbatch was born to play this role...he is Sherlock Holmes. Martin Freeman also stars as Dr. John Watson and those two lead just an overall great cast. This show won so many awards including 9 Emmys over the course of its run. If you haven't seen this incredible series yet then do yourself a favor and go watch it as soon as possible!"
    },
    {
      "username": "beresfordjd",
      "userUrl": "https://www.imdb.com/user/ur3741901",
      "reviewLink": "https://www.imdb.com/review/rw2286448",
      "warningSpoilers": false,
      "date": "27 July 2010",
      "rate": "10",
      "helpful": "739 out of 855 found this helpful.",
      "title": "Nailed it!!",
      "content": "To my surprise they absolutely nailed it. Cumberbatch is a fantastic choice for Sherlock Holmes-he is physically right (he fits the traditional reading of the character) and he is a damn good actor. Martin Freeman, about whom I wasn't sure at first, is an excellent foil for Holmes without being the dumb sidekick that Dr Watson has often been. I thought that this series would not work, particularly after Robert Downey's interesting take on Conan Doyle's characterisation. I have been proved so wrong-it moved along at a good pace and held the attention brilliantly. My wife started by saying she didn't like it but by the end of the episode she was as enthralled as I. We are both looking forward to the rest of the series, if it is as entertaining as the first story. I was disappointed to read some reviews here that did not love it. Methinks they are too jaded to enjoy anything."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw6824568",
      "warningSpoilers": false,
      "date": "17 April 2021",
      "rate": "9",
      "helpful": "68 out of 76 found this helpful.",
      "title": "Benedict Cumberbatch is terrific as Sherlock!",
      "content": "Sherlock is such an absolutely brilliant show! All you have to do is read through some of the reviews to see how loved this show really is. It's one of the best rated tv shows on just about every website for a reason...because it's incredible! There have been a lot of different versions of Sherlock Holmes with a bunch of really good ones (Robert Downey Jr., Jonny Lee Miller) and with some really bad ones but Benedict Cumberbatch is the best of them!"
    },
    {
      "username": "HafizhMaulana21",
      "userUrl": "https://www.imdb.com/user/ur158897541",
      "reviewLink": "https://www.imdb.com/review/rw8790103",
      "warningSpoilers": false,
      "date": "9 January 2023",
      "rate": "9",
      "helpful": "29 out of 31 found this helpful.",
      "title": "The modern Sherlock... Excellent, brilliant",
      "content": "The story of the famous detective Sherlock Holmes and his partner Doctor John Watson who begin their adventure in solving mysteries in the modern century.Season 1: Famous detective stories that appear differently. It has a time set in the 21st century, which of course the story refers to a more modern case. Sherlock started its premiere season with three pretty good episodes. Featuring Benedict Cumberbatch as Sherlock and Martin Freeman as John Watson, they seemed to perform superbly and fit into their roles. Cumberbatch style capable of perfectly displaying and bringing the role of Sherlock to life. This series has a different story from the general Sherlock story. Featuring Sherlock who lives in modern times but does not forget the characteristics of the original story. This season has a unique and interesting story in its first three episodes. Able to display a good and simple but elegant mystery story. Have complicated conflicts in solving problems. It was the first season that directly introduced Moriarty as Sherlock's main enemy. However, in solving the case or the way Sherlcok reveals the truth, it is done with a quick dialogue so it is necessary to repeat what was said."
    },
    {
      "username": "DaveFilmlover",
      "userUrl": "https://www.imdb.com/user/ur17887428",
      "reviewLink": "https://www.imdb.com/review/rw2285834",
      "warningSpoilers": false,
      "date": "26 July 2010",
      "rate": "10",
      "helpful": "842 out of 954 found this helpful.",
      "title": "Will have Conan Doyle spinning in his grave...............",
      "content": "..with delight. A brilliantly written, well acted programme. Well done to all concerned. The story had me hooked from the start.All the elements of Holmes are present and correct. So far most of the original characters have appeared, with hints of more yet to appear. It is suspenseful and sometimes genuinely funny. I have read all the original stories, and after the late, great Jeremy Brett, despaired of ever seeing another top notch Holmes film. This is it, Brought up to date into the 21st century, but done with affection and respect to the original. Nice to see the writers have continued the theme of an intelligent (slightly bemused) Watson. CAN WE HAVE A FULL SERIES PLEASE. If not this is one I will return to again and again."
    },
    {
      "username": "dszabo-53136",
      "userUrl": "https://www.imdb.com/user/ur142565377",
      "reviewLink": "https://www.imdb.com/review/rw8820288",
      "warningSpoilers": false,
      "date": "23 January 2023",
      "rate": "10",
      "helpful": "30 out of 32 found this helpful.",
      "title": "Masterpiece",
      "content": "I would rate the Sherlock series as a critically acclaimed and must-watch crime-drama television series. The show, created by Steven Moffat and Mark Gatiss, is based on the characters from Sir Arthur Conan Doyle's Sherlock Holmes stories and follows the detective and his friend Dr. John Watson as they solve a series of complex and intriguing crimes in modern-day London.The series features outstanding performances, particularly from Benedict Cumberbatch as Sherlock Holmes and Martin Freeman as Dr. Watson, who deliver powerful and nuanced performances that keep the audience engaged. The writing is also exceptional, with well-crafted and complex storylines that build tension and keep the audience guessing. The series also features a strong sense of atmosphere and setting, adding to the show's unique tone and feel.The show also explores themes of friendship, trust, and the relationship between science and intuition.Overall, I highly recommend the Sherlock series for fans of crime dramas, and those looking for a series with complex and well-crafted storylines, superb acting, and a strong sense of atmosphere and setting. The show's exploration of themes of friendship, trust and the relationship between science and intuition adds a layer of depth to the story. It's a great series that keeps the audience guessing and on the edge of their seats."
    },
    {
      "username": "alexanderliljefors",
      "userUrl": "https://www.imdb.com/user/ur152801547",
      "reviewLink": "https://www.imdb.com/review/rw8653453",
      "warningSpoilers": false,
      "date": "3 November 2022",
      "rate": "10",
      "helpful": "25 out of 27 found this helpful.",
      "title": "A modern classic",
      "content": "This is moving pictures in its finest form. Turning a classical piece into a even more classical piece in a modern type of way. With its great humor and well composed music this is really one of the best series i have ever watched. Its thrilling complext with deep caracters and excellent acting with a well formed manuscript. Fantastic filming and great structure.Its in a poserive way transforming the classic Sherlock Holmes into the modern world and simply ads even wider stories. This is a must seen series and must be remembered as one of the greatest. Everything in this production fits to every last detail."
    },
    {
      "username": "Lukasmj",
      "userUrl": "https://www.imdb.com/user/ur158768880",
      "reviewLink": "https://www.imdb.com/review/rw8671496",
      "warningSpoilers": false,
      "date": "13 November 2022",
      "rate": "9",
      "helpful": "27 out of 30 found this helpful.",
      "title": "Perfect for cuddling up with a cup of tea on a Sunday.",
      "content": "Sherlock Holmes. Everybody knows him and Everybody loves him. Well, at least the viewers do, because Benedict Cumberbatch portrays the character of the arrogant and overly intelligent Detective very good. The people who have to deal with Sherlocks arrogant Character, may not like him that much, but pretty much hate him and get annoyed by him.I watched \"Sherlock\" a long time ago and unfortunately don't really have the memory anymore, but I can remember that I really liked the team of Benedict Cumberbatch and Martin Freeman solving riddles of crimes together and was very entertained by this series."
    },
    {
      "username": "alfa-16",
      "userUrl": "https://www.imdb.com/user/ur0635556",
      "reviewLink": "https://www.imdb.com/review/rw2285573",
      "warningSpoilers": true,
      "date": "26 July 2010",
      "rate": "",
      "helpful": "176 out of 213 found this helpful.",
      "title": "A Study in Picture Gallery Red",
      "content": "What we have here is a very interestingly rendered modern version of Holmes' first appearance, A Study in Scarlet, in which he meets Watson, they take the rooms in Baker Street and successfully investigate a series of murders. The story is rarely adapted for two reasons. The first is that the murders don't make sense without the dull, rambling back story which no one wants to dramatise. The Valley of Fear has hardly ever been dramatised for the same reason. The second is that this is Conan Doyle's first attempt and he introduced significant character changes to both Holmes and Watson in the short stories. Holmes, in A Study in Scarlet, is rather more deranged, more like Cumberbatch's Holmes than Brett's, much more an aggressive, painful thorn in the side of the police rather than the unseen assistant of later stories.So people who haven't read the book or have only seen Holmes on screen need to give this a bit of time. 21C technology aside, it's actually quite a faithful adaptation, even though they ditched the back story and gave the murderer another, more credible motive. Knowledge of the original isn't at all necessary, but it does change the viewpoint. While some were congratulating themselves on beating Holmes to the punch in spotting the profession of the murderer, readers of the original were being conned into believing that his next victim was going to be the American he was driving (the victims in the original are all American). In the original, the word 'Rache' appears at the crime scene, also in an empty house in Lauriston Gardens, written in blood. The police jump to the conclusion that the victim was trying to write the word 'Rachel'. Holmes knows that 'Rache' is German for revenge. Moffat turns it neatly and humorously around. In the original it's a red herring, in the new version, it's a vital clue. These riffs on the original abound and are almost always imaginative and amusing and often more than that. Mycroft as Sherlock's Big Brother, for example.Moffat and Gatiss treat the characters with all the loving respect that an author could wish for and serve up an adaptation which re-imagines everything that Conan Doyle put into his plots and yet delivers something very close to to their original purpose and effect. Holmes and Watson are products of their time, as they should be, but they are recognisably the descendants and inheritors of the originals. The baby is still gurgling happily in the bathwater.There's a lot more here than initially meets the eye and I have a sneaky feeling it'll get better.If it does, it's going to be very, very good indeed."
    },
    {
      "username": "cethi-One",
      "userUrl": "https://www.imdb.com/user/ur149999223",
      "reviewLink": "https://www.imdb.com/review/rw8713699",
      "warningSpoilers": false,
      "date": "3 December 2022",
      "rate": "10",
      "helpful": "26 out of 28 found this helpful.",
      "title": "A pleasure to see and see again.",
      "content": "A pleasure to see and see again.A masterpiece, as much as the actors we knew they were excellent, I had a little hesitation at the beginning when it came to the scenario but from the first 20 minutes we were carried away and we wanted to know we wanted to find Sherlock before.The incredible staging of the texts and deductions makes understanding exellent and the tone is always right, it's a treat for Sherlock Holmes fans like me.What I find incredible is that even a character linked to a single episode we become attached to it. It is not given to everyone to make a detective series so addictive. I'll never grow tired."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw4029274",
      "warningSpoilers": false,
      "date": "10 January 2018",
      "rate": "8",
      "helpful": "32 out of 40 found this helpful.",
      "title": "Initially this was astounding, sadly that form failed in the last two seasons.",
      "content": "I am not surprised that the earliest reviews are all ten stars, I would have also judged Series one and two with that score, sadly they took something away in the latter years, the show became too clever for its own good, they sacrificed style for substance. Back to the positives, the first two series, and in fairness The Abominable Bride I think are outstanding, they are clever, witty, absorbing, genuinely thrilling viewing. The performances throughout are sensational, I cannot compliment Cumberbatch and Freeman enough, they make a great double act, and inject a massive energy. I can appreciate the show as independent from the works of Conan Doyle, but when I want Sherlock Holmes, it's Jeremy Brett I look to. Personally, the highlight of the show was Andrew Scott, who's Moriarty was nothing short of astounding, he stole every scene he appeared in, a shame they killed him off when they did. I think Moffat took on too much with this and Doctor Who, and it seemed both shows dipped at the same time, he should have made a choice and focused on one show, it was surely too much work doing both. I hope very much that the show returns, and the genius that was evident in Series one and Two returns also. Highlight for me has to be The Reichenbach Fall, which is simply incredible."
    },
    {
      "username": "ijasonhyland",
      "userUrl": "https://www.imdb.com/user/ur121178352",
      "reviewLink": "https://www.imdb.com/review/rw8665483",
      "warningSpoilers": false,
      "date": "9 November 2022",
      "rate": "10",
      "helpful": "23 out of 25 found this helpful.",
      "title": "Tv Heaven and not just for all Sherlock Holmes fans",
      "content": "I have watched rewatched and rewatched again ... Steven Moffatt excels with clever writing and deeply buried references to original Holmes stories. The reinvention of Holmes for the modern day is brilliant hoovering up new fans much like how Rathbone did in his time while Jeremy Bret again a magnificent Holmes who encapsulated all the flaws of the original character as does Cumberbach. It's everything TV should be .. entertaining, funny witty dramatic clever twisted dark Moff and Gatiss have got it so right ... and all made better with Martin Freeman, Una Stubbs, Andrew Scott & Lara Pulver !!!"
    },
    {
      "username": "xTkAx",
      "userUrl": "https://www.imdb.com/user/ur9231180",
      "reviewLink": "https://www.imdb.com/review/rw8632043",
      "warningSpoilers": false,
      "date": "23 October 2022",
      "rate": "9",
      "helpful": "26 out of 30 found this helpful.",
      "title": "This was excellent!",
      "content": "This series was just excellent! Don't miss it!This review required exactly 521 characters by the time I typed the 1 in that number.So, this is rather awkward.What else can I say? Don't miss it! Meaning stop reading now and go watch it! You really don't want to spoil it, and it's better to be surprised. If you want my opinion, watch it at 75% speed so it will last longer. Wow, I wish I would have thought of that before, I will do it next time! Well, I must be boring you to death! Go watch it already, gee whiz! O. K! That's it for me! The last required character is this period right here >."
    },
    {
      "username": "user-807-114858",
      "userUrl": "https://www.imdb.com/user/ur47048648",
      "reviewLink": "https://www.imdb.com/review/rw8656819",
      "warningSpoilers": false,
      "date": "5 November 2022",
      "rate": "10",
      "helpful": "24 out of 26 found this helpful.",
      "title": "Best thing I ever saw from these eyes..",
      "content": "Best thing I ever saw from these eyes.. the evil and the good lies within us.. we create a monster to deal with it.. to keep us engaged.. because we get bored.. and mind will do anything, anything at all to keep it engaged..Sherlock created the monster her sister Euros.. and the monster he created for the sake of his engagement..That's how life runs in this century.. The game must be on..Why can't we just be for the sake of being.. That is what ideal life is to attain.. it must be idle.. fit enough to sustain but content enough to love it..Faith is the solution to every problem.But the centre of faith is the root of every problem.."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw6956979",
      "warningSpoilers": false,
      "date": "23 May 2021",
      "rate": "8",
      "helpful": "18 out of 22 found this helpful.",
      "title": "love the style",
      "content": "Steven Moffat modernizes the classic Sherlock Holmes (Benedict Cumberbatch) and brings him into the modern world. Dr. John Watson (Martin Freeman) is his best friend and co-investigator. I like the style. I really love the style. The chemistry between Cumberbatch and Freeman is terrific. The stories get be a bit messy but I put it down more due to the chaotic style and I do like the style. This show has a real visual energy to the old material."
    },
    {
      "username": "angrychicken85",
      "userUrl": "https://www.imdb.com/user/ur161831356",
      "reviewLink": "https://www.imdb.com/review/rw8843389",
      "warningSpoilers": false,
      "date": "1 February 2023",
      "rate": "10",
      "helpful": "28 out of 30 found this helpful.",
      "title": "Feels most like the novels",
      "content": "IF you are a fan of the Sherlock Holmes novels, then this show is an incredible proximity to the written works. I know its a modern take, but the core of the stories and its characters are the same. I have watched the Hollywood movies and while I love Robert downey, his portrayal was not true to the written Sherlock.Additionally, I didn't even realized the parallels that existed between the two time periods. Only when modern Watson came back from Afghanistan did I recall that novel Watson was indeed a veteran of a war in Afghanistan. The modern show aligned the story so well that I almost didn't notice a difference in time periods.The core of the novels is true in form in the show. Cumberbatch's version of Sherlock is dead on. I am so pleased by the production. It is my favorite and in my opinion, the most accurate portrayal of the Sherlock Holmes novels.Excellent. Excellent adaption. Highly recommended for lovers or the original novels."
    },
    {
      "username": "cintiapmarins",
      "userUrl": "https://www.imdb.com/user/ur148458641",
      "reviewLink": "https://www.imdb.com/review/rw8694340",
      "warningSpoilers": false,
      "date": "25 November 2022",
      "rate": "10",
      "helpful": "25 out of 27 found this helpful.",
      "title": "Plot after plot, very clever.",
      "content": "Brillant! Applause for the director, the scene changes, the clues left, those who didn't like it were because they didn't realize the complexity of the scenes. The main actors give an entertaining show. Very intelligent series, they don't tell you directly, they just leave clues. I always thought I was going to hit the plot twist and I never ever got it right, and when I had already imagined one thing, another one came right in your face, by surprise. Excellent excellent. Best sherlock I've ever seen. Every scene takes you by surprise. It's exciting to think you know and surprise you. The director's insight is genius."
    },
    {
      "username": "carla-godfrey2506",
      "userUrl": "https://www.imdb.com/user/ur19759881",
      "reviewLink": "https://www.imdb.com/review/rw2285729",
      "warningSpoilers": false,
      "date": "26 July 2010",
      "rate": "10",
      "helpful": "406 out of 490 found this helpful.",
      "title": "Brilliant!",
      "content": "I think it is always a bit uncertain and tricky when a 19th century series or film is modernised and most of the time it doesn't work, especially if it is well known and liked but I was very very impressed. Benedict does a brilliant job portraying the famous sleuth and made a 19th century character and modern day London merge beautifully. Martin Freeman was also great as Dr Watson. Rupert Graves made a brilliant Lestrade. It was sharp, quick and kept you on your toes and you just couldn't wait to see what happened next, this was of course completed by brilliant acting from the actors. I'm so pleased it got favourable reviews from the critics, roll on the next episode!!!!"
    },
    {
      "username": "akilamike",
      "userUrl": "https://www.imdb.com/user/ur23628948",
      "reviewLink": "https://www.imdb.com/review/rw2287794",
      "warningSpoilers": false,
      "date": "30 July 2010",
      "rate": "10",
      "helpful": "372 out of 473 found this helpful.",
      "title": "A masterpiece",
      "content": "One word to describe this show..'excellent'. A true master piece. I am a huge fan of the original Sherlock Holmes books and TV shows. When I sat down to watch this, at the first glimpse I was a bit disappointed. The show started in a somewhat different way than I imagined. Few minutes later, I found out that the 'difference' I experienced is what makes this series unique and brilliant. The cast is spot on. Couldn't have picked a better guy for Holmes or Lestrade. Yet, Dr. Watson doesn't match the original picture.Who cares hey? The story is full of twists and turns and fascinating to see the techniques of deduction. The merging of old reasoning and new technology has been done magnificently. So, its a Holmes with a laptop and a smart phone.that who we see.and that can be easily related than those 1800's detective.Hope this show will continue for many full seasons."
    },
    {
      "username": "Benja075",
      "userUrl": "https://www.imdb.com/user/ur23618017",
      "reviewLink": "https://www.imdb.com/review/rw2286776",
      "warningSpoilers": false,
      "date": "28 July 2010",
      "rate": "10",
      "helpful": "646 out of 748 found this helpful.",
      "title": "Was going to vote, but that's not enough... A MUST FOR ALL!",
      "content": "It's after 2am and I have just registered on IMDb after watching the first ep of Sherlock as I was compelled to get it out there that this show presents some PURE BRILLIANCE in its delivery of my favourite fictional detective. Hard to believe they could create a setting in modern times where the illustrious Holmes and Watson set off on their adventures and absolutely GET IT RIGHT, in every aspect. Sir Arthur would, I believe, approve of this adaptation and be pleased that yet another generation is able to live the thrill of the chase, the connection of obscure yet obvious (to a genius) clues... the little things that have a far greater relevance than you would normally perceive. For a first episode... BUGGER ME, I am more than hooked and now await more installments and hope that each episode is as brilliant as the last... I have a feeling it will continue from strength to strength as we delve deeper into the darkness that is the mind of Sherlock Holmes. if they had an 11 out of 10 rating... that's my vote. The game is definitely on my dear Watson!"
    },
    {
      "username": "tubibii",
      "userUrl": "https://www.imdb.com/user/ur155251031",
      "reviewLink": "https://www.imdb.com/review/rw8511887",
      "warningSpoilers": false,
      "date": "3 September 2022",
      "rate": "10",
      "helpful": "26 out of 30 found this helpful.",
      "title": "Truly incredible, best Sherlock series out there",
      "content": "Let me start by saying this, you will not find a better Sherlock adaption than this. Benedict Cumberbatch is amazing as Sherlock, I really can't see anyone else playing him. And Martin Freeman is just immaculate as dr Watson. Oh and don't get me started on Andrew Scott, holy moly!The whole show is an emotional roller coaster and despite watching it weeks ago I can't stop thinking about it! I cried at least 5 times just the first hour after I watched it. And countless times while watching it.I didn't eat for 26 hours just because I had to finish this show, and I don't regret it.The acting is probably the best acting I have ever seen. The cast is incredible.While I've only said positive things about this show, it doesn't mean it's completely flawless. The 2 first seasons are superior to the 2 last ones. Season 3&4 weren't bad by any means, but the 2 first ones are the best pieces of TV-material I've ever come by, while season 3&4 are just very good.This show deserves so much more fame than it has. Watch it. Now. You won't regret it.Overall rating: 9,7/10."
    },
    {
      "username": "xidingjie",
      "userUrl": "https://www.imdb.com/user/ur160746507",
      "reviewLink": "https://www.imdb.com/review/rw8782890",
      "warningSpoilers": false,
      "date": "6 January 2023",
      "rate": "10",
      "helpful": "26 out of 27 found this helpful.",
      "title": "Great",
      "content": "Great TV series. I watched it with my whole class during lunch break in my high school years. I don't know if this is the first of its kind, but I definitely find many resemblance to this series from many later TV series such as forever. It's basically the same idea with slightly different story background for main characters. Definitely worth watching. And it's definitely one of the first bromance TV series I have ever watched too. The relationship between Watson and Sherlock is so rare such that I keep looking for such relationship whenever I saw some TV series with at least two male main characters."
    },
    {
      "username": "ninjacow225285",
      "userUrl": "https://www.imdb.com/user/ur23602888",
      "reviewLink": "https://www.imdb.com/review/rw2285618",
      "warningSpoilers": false,
      "date": "25 July 2010",
      "rate": "10",
      "helpful": "504 out of 592 found this helpful.",
      "title": "Unique and well done",
      "content": "I have been an avid fan of Sherlock Holmes from a very young age, and my first reaction upon hearing of a modern TV remake was \"oh bugger, they are so going to screw this up\". However, i am glad to report that, unlike so many other TV adaptations and especially ones that modernise, i found it witty, clever and above all, entertaining. It was extremely reverential of its considerable pedigree and included a large number of coded references and callbacks for the more avid fan, e.g. the use of scratches around a persons mobile phone charger port to indicate a drunkard rather than a pocket watches winding keyhole. I imagine many were irked by this and as i can see from the ratings many did not care for it at all, but for me it was simply sublime, and well deserving of a 10 out of 10"
    },
    {
      "username": "bradydm2001",
      "userUrl": "https://www.imdb.com/user/ur8353713",
      "reviewLink": "https://www.imdb.com/review/rw2303306",
      "warningSpoilers": true,
      "date": "27 August 2010",
      "rate": "10",
      "helpful": "283 out of 361 found this helpful.",
      "title": "Sounds like a bad idea, right? Think again. The more things change...",
      "content": "As a die-hard fan of the source material, I have tracked down and went through nearly every radio, television, film, and comic book interpretation of Sherlock Holmes - which run a mean gamut regarding quality, as you probably already know - and so I approached this incarnation skeptical but sanguine. Doubtful it would match the eminent Jeremy Brett series in quality, but hopeful it might preserve Conan's tone - something I think that series did well and the Downey Jr. movie did not.To my surprise, and delight, this show just so happens to be the bomb-diggity. Let me explain.Ever notice how lots of Agatha Christie fans complain when screenwriters change Poirot and Marple stories? I'm not one of them. I like new and different interpretations of those stories because otherwise, in the case of literary characters brought on screen, what's the point? What's the point if we film and re-film the same story, the same story which we've already read once, twice, maybe three times? Especially in many cases, what's the point when it's been done so perfectly before? In the case of Sherlock Holmes, The Hound of the Baskervilles has been filmed at least 24 times according to Wikipedia. So another iteration won't thrill me. However, one that takes liberties with the source material, i.e. bringing the characters into the 21st century, I'm all for it. Surprise me. That's what I say.And there are two things I really love about this series. 1) For longtime fans there are many, many \"Easter eggs\" to discover in each episode. And, best of all, 2) My boyfriend loves this series. And I can't pay him to watch a Jeremy Brett episode. He did enjoy the Downey Jr. movie (as did I, I just prefer a less swashbuckling Holmes - one reason among many that I didn't love the film), but he's never excited to watch Sherlock anything. This series is different. He loves it. For any Sherlock fan that would like to get their significant others on the band wagon, this is a great gateway. (And my boyfriend's actually a very good barometer for high-quality mainstream television shows. Usually, if something's firing on all cylinders, he knows it. More risky fare - he's off-put.)And, you may rightly ask, why should I give a crap what my boyfriend likes? Good question. I happen to be of the mind that TV and film can accomplish what my favorite art form - literature - cannot. The TV and film experience can be enjoyed by a group. Sure, book clubs discuss books, but with TV and film you and whomever you want to hang out with, experience story at the exact same time, in real time, and you can easily observe each other's initial, unguarded reactions. Plain and simple, it's fun to enjoy the mediums with others - to laugh together, to be scared, sad, thrilled, etc. It enhances the experience. I think literature's strength is the opposite. For me, the best thing about settling into a good book is that I'm alone. Just me and the test, together making up a story.Well, if anybody has read this far, I apologize for the rant. But if you're on the fence about buying the DVD or renting it or whatever, take a chance. Take a tip from me. You'll be pleasantly surprised. The more things change, the more they stay the same."
    },
    {
      "username": "Imme-van-Gorp",
      "userUrl": "https://www.imdb.com/user/ur76725747",
      "reviewLink": "https://www.imdb.com/review/rw6904250",
      "warningSpoilers": false,
      "date": "11 May 2021",
      "rate": "10",
      "helpful": "14 out of 18 found this helpful.",
      "title": "So very captivating.",
      "content": "Season One: 10/10Themes: Detective, Crime Solving, Genius, Drama, Suspense, Friendship, Humour, Archnemesis & Socially Inept.Top three characters: 1) Sherlock Holmes, 2) Dr. John Watson and 3) Mycroft Holmes."
    }
  ],
  "errorMessage": ""
}