{
  "imDbId": "tt0149460",
  "title": "Futurama",
  "fullTitle": "Futurama (TV Series 1999–2023)",
  "type": "TVSeries",
  "year": "1999",
  "items": [
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2241675",
      "warningSpoilers": false,
      "date": "27 April 2010",
      "rate": "10",
      "helpful": "95 out of 101 found this helpful.",
      "title": "Can I be honest? I think Futurama is better than the Simpsons!",
      "content": "Now that is not to say the Simpsons is bad or anything, I really like it, but it has jumped the shark for a few years now. Futurama is everything I love an animated series to be, funny, original and witty. I seriously don't know where to begin praising the show. Well for one thing the animation is amazing. The characters are really well drawn, the backgrounds are audacious and the visual effects are eye-popping. And the music is brilliant, it is cleverly composed with some funky songs featuring such as \"Conga\" and \"Sunshine of Your Love\" and the theme tune is definitely memorable. The writing is outstanding, the comedy works brilliantly and the more touching and subtle parts work just as well. The episode ideas springing from a brilliant concept are really original and fun, and the pacing is great. And the characters with the help of a truly talented voice cast are really unique and endearing, especially Fry, Bender and Zoidberg, and Leela is a feisty and headstrong character that I related to immediately. Overall, a truly wonderful show, with all the fun and originality that are lacking in the later episodes of the Simpsons. 10/10 Bethany Cox"
    },
    {
      "username": "ajkbiotech",
      "userUrl": "https://www.imdb.com/user/ur130506467",
      "reviewLink": "https://www.imdb.com/review/rw6720855",
      "warningSpoilers": false,
      "date": "20 March 2021",
      "rate": "10",
      "helpful": "44 out of 46 found this helpful.",
      "title": "Genius",
      "content": "This show is so brilliant you don't deserve to watch it."
    },
    {
      "username": "Aaron1375",
      "userUrl": "https://www.imdb.com/user/ur1111192",
      "reviewLink": "https://www.imdb.com/review/rw0547518",
      "warningSpoilers": false,
      "date": "10 March 2003",
      "rate": "",
      "helpful": "285 out of 333 found this helpful.",
      "title": "I actually like it better than The Simpsons",
      "content": "Don't get me wrong, I like the Simpsons, but there is just something about Futurama that I like more. It irks me to see people who hate this show and are glad it is cancelled. If you don't like a show just don't watch it...to many shows have gotten a premature axe these days mainly cause television networks haven't realized no show is going to have the ratings of shows from the past. I am sure to all those who hated the show, there have been shows you liked that have been cancelled as well. This one about a pizza boy frozen and waking up in the future was for me quite enjoyable. Which is the kiss of death right there, because if I like a show, it usually does get cancelled and it usually does have a pretty good following, but for some reason the networks still somehow think all shows should average 20 or more million viewers or its a failure."
    },
    {
      "username": "Baldrick44",
      "userUrl": "https://www.imdb.com/user/ur3766841",
      "reviewLink": "https://www.imdb.com/review/rw0946608",
      "warningSpoilers": false,
      "date": "13 October 2004",
      "rate": "",
      "helpful": "236 out of 259 found this helpful.",
      "title": "The best cartoon series on TV ever",
      "content": "I loved Futurama when it was TV and I always find myself watching it on my DVD player ( I have all 4 series ). I think the thing that carries it above other cartoons ( and it's not like I don't like the Simpsons or Family Guy ) is the wonderful mix of characters. Dimwitted Phillip J. Fry, who has trouble constructing a coherent sentence and whenever he attempts to say something profound it invariably ends up flying back in his face. Turanga Leela, a outcast amongst outcasts, who when not brushing off Fry is captaining the ship between planets while wondering about her own origins. Bender, a wisecracking, gambling chain-smoking robot that is on the crew of the ship for no apparent reason apart from bumming around. Dr Zoidberg, a penniless joke of a medical practionioner that has no friends and seems to ignite hostility for just being him. Hermes Conrad, a Rastafarian bureaucrat who when not limboing for his nation is filing and shredding with an obsessive fever. Professor Hubert J. Farnsworth, whose wonderous inventions are perhaps only eclipsed by his seemingly growing amorality towards almost all living things. Amy Wong, the daughter of the rich Wong family and as such finds herself slightly naive about things that are deeper than hair gel and nail polish. Add to this the military hijinks of Zapp Brannigan and his long-suffering lieutenant Kif Croker as well as thespian robot Calculon, Warlord alien Lur and President Nixon as well as others and I think you have a group of characters that all have their own quirks and flaws to add to a very funny show.I only hope that they have enough sense to put it back on again."
    },
    {
      "username": "Li-1",
      "userUrl": "https://www.imdb.com/user/ur1830094",
      "reviewLink": "https://www.imdb.com/review/rw0952025",
      "warningSpoilers": false,
      "date": "25 October 2004",
      "rate": "",
      "helpful": "111 out of 129 found this helpful.",
      "title": "Equal parts clever, hilarious, and moving, Futurama is the greatest animated series ever.",
      "content": "Reviews of Volume 3 and 4Volume 3: 10/10Futurama was even funnier than The Simpsons in its heyday (which, to my eyes, was seasons 8-10), and much of what made the series so great was perfectly exemplified by the DVD collection volume 3. There's an equal mix of cool sci-fi tales, brilliantly creative humor, and the addition of genuine heart that made this show unbeatable. Favorite Episodes: Time Keeps on Slipping, Amazon Women in the Mood, Parasites Lost, The Luck of the Fryfish, That's LobstertainmentVolume 4: 10/10Probably my favorite volume, this last collection of episodes has all the humor, heart, and beautiful animation of the previous seasons. As the show wound to a close, the series satisfyingly touched on many emotional levels that most shows, animated or otherwise, wouldn't even dare approach with a ten-foot pole (most exemplified by Jurassic Bark). Special mention must definitely go out to the final episode, The Devil's Hands are Idle Playthings, which is one of the series' best episodes (the only flaw being the lack of screen time given to Farnsworth), full of big laughs (Dan Castallaneta's guest role as the Robot Devil is priceless) and a strong emotional climax, capping off with a touching final scene that provides a sense of closure between the love and burgeoning romance of heroes Fry and Leela, while still keeping an open door for future possibilities. Fry, Leela, Bender, Farnsworth, Zapp, Kif, Calculon, Chicken Lawyer, Robot Devil, Morbo; I'm gonna miss you all. No doubt, it's been a great four seasons.Favorite episodes: The Devil's Hands are Idle Playthings, The Farnsworth Parabox, Where No Fan Has Gone Before, Kif Gets Knocked Up a Notch"
    },
    {
      "username": "lakenstein",
      "userUrl": "https://www.imdb.com/user/ur3475727",
      "reviewLink": "https://www.imdb.com/review/rw0959428",
      "warningSpoilers": false,
      "date": "8 November 2004",
      "rate": "",
      "helpful": "263 out of 288 found this helpful.",
      "title": "\"Now Zoidberg is the popular one!\"",
      "content": "man, this show was freaking awesome, so of course it got canned. it was funny, had great characters, wonderful dialouge and was way too good for TV. In fact, at times I find myself enjoying this show more then the simpsons. I find myself enjoying the antics of the characters more. so if i had to choose i would say this is more entertaining then the simpsons. although the simpsons had more better side characters (although zapp brannagin and his alien sidekick are friggin hilarious) in the end, i would advise anyone looking for a laugh to catch reruns whenever you can or buy the dvds. I don't think you'll be disappointed. a wonderful show canned way too soon."
    },
    {
      "username": "mamamiasweetpeaches",
      "userUrl": "https://www.imdb.com/user/ur2700318",
      "reviewLink": "https://www.imdb.com/review/rw0547605",
      "warningSpoilers": true,
      "date": "27 September 2004",
      "rate": "",
      "helpful": "152 out of 176 found this helpful.",
      "title": "FUTURAMA is a great show that might come back...and should!",
      "content": "I am a huge fan of THE SIMPSONS, the funniest show to ever be on television. When I heard Matt Groening was behind FUTURAMA I was excited...but not TOO excited because I didn't think it would be as good as THE SIMPSONS (I mean...what COULD be?) The first episode of FUTURAMA I was not all that impressed. But by the fourth episode (LOVES LABOURS LOST IN SPACE where Leela sleeps with Zap Brannigan) they had me: I was hooked.This show may not be as laugh-out-loud funny as THE SIMPSONS but it is funny, clever, well-written and well \"acted\". The cast does a great job, especially those who have to do multiple voices (I will make special mention of Billy West here who does the voice of main character Fry. I was surprised to find out he does a lot of other characters too: Zoidberg and Farnsworth to mention just a few).If your not familiar the story goes like this: Philip Fry is a pizza delivery boy (or should I say \"pizza delivery Man\"...he's in his 20's although at times acts more like a teen than a grown-up) who is sort of a Born Loser type. He's working on New Years Eve (he runs into his girlfriend Michelle going to a New Years Eve party with another guy and \"begins to suspect she's cheating\") and ends up making a delivery to a cryogenic freezing lab. He accidentally freezes himself and when he's found and thawed out its New Years Eve 3000. In a way this sucks because everyone he knows is long dead. But in a way its good because its a second chance for him to start life new and maybe be not such a loser this time around. Apparently after they thaw you out and probe you they insert a chip in your hand that helps place you in your field of expertise for a job. His chip is \"Delivery Boy\" and he doesn't want it so he is trying to avoid the sexy one-eyed alien woman Leela whose job it is to make sure he gets his chip put in. When he's notified he has a great-great-great-great (keep going) nephew named Professor Farnsworth he goes to seek him out. He goes to what he thinks is a pay phone booth and its actually a suicide machine...thats where he meets Bender a wise-ass,drinking,smoking robot who wants to kill himself because his main purpose is to aid in the making of suicide machines. The two of them try to escape Leela and when she finally catches up to them she admits she doesn't like her job either so now the three of them seek out Professor Farnsworth to see if they can work for him.He runs an intergalactic delivery service and works with once-limbo champion Hermes, a rich girl intern named Amy,and a lobster-man doctor named Zoidberg. I feel funny pointing this out, but I will anyway: There's always a big to do about shows today not having interracial characters as friends working together and FUTURAMA definitely goes beyond the call of duty in that area. We have single white male Fry, white Cyclops alien/mutant female Leela, Asian female Amy, Senior citizen white male Farnsworth, African American male Hermes, male robot Bender as well as male crustacean Zoideberg! And they all work together wonderfully (and although they make a lot of rude jokes at each others expense you can tell they all really love each other! And this is a cartoon, folks!)A lesson to be learned: if these people can get along, cant we?)This show isn't on FOX Sundays anymore although there is rumor that it might come back. A cable station shows re-runs and they have Seasons One, Two, Three and Four on DVD box sets. I bought myself the first season and my six year old daughter stole it from me! I quickly bought her the other three seasons and she's a real devotee now: watches an hour of FUTURAMA every night before she goes to sleep. We watch it together...which is a nice summary...FUTURAMA is a show both adults and children can enjoy. Here's hoping it makes a return.Out of 5 stars: ***** 5 stars"
    },
    {
      "username": "atomius",
      "userUrl": "https://www.imdb.com/user/ur3783846",
      "reviewLink": "https://www.imdb.com/review/rw1658092",
      "warningSpoilers": true,
      "date": "19 May 2007",
      "rate": "10",
      "helpful": "19 out of 21 found this helpful.",
      "title": "Thanks, Mr. Groening!",
      "content": "This marvelous animation, from the creator of my all time favourite motion picture, The Simpsons, uses a subtle integration of cgi graphics with a more flashy version of Groenings style of animation to produce half hours of non stop gags (quite intelligent in some cases) and fun adventure. The pop culture references so great in The Simpsons only go farther and wider here in this story of Fry, a pizza delivery boy sent through suspended animation to the year 3000 from the year 1999.Phillip J. Fry, better known simply as 'Fry', was a pizza delivery boy in the late nineties. The first episode deals with his being frozen in a cryogenic capsule for a thousand years, in the background through the window we see the changing of New York, which has become New New York, and remains the central setting for the series after this episode. Fry soon meets Turanga Leela, a one eyed girl who believes she is an alien, who was raised at an orphanage. (we later find out she is in fact a mutant and her parents live underground) Fry runs from Leela after being assigned work as a delivery boy (for he wished for a fresh start) and meets Bender the robot, who is programmed to bend, and has a selfish and indulgent persona, enjoying cigars and alcohol (incidentally the fuel of all robots). Leela then turns to Fry's side and the three find Fry's only living relative, Professor Farnsworth, who employs them in his delivery company, Planet Express. Other members of the crew are Zoidberg, a alien lobster like creature, and Amy Wong, a wealthy martian, as well as Scruffy the janitor (often ignored despite caring for the company deeply) and a Jamaican businessman who is good at financial operations. The series generally follows adventures on different planets, or Earth, involving a variety of recurring characters like Zapp Brannigan, who admires Leela, and many 'heads', famous personalities in the form of heads inside glass containers filled with fluid, such as Richard Nixon. The series' style shares much with The Simpsons, but is cleaner animated and uses cgi for spacecraft and other objects to some degree. Also of note is the colour of skin, pink rather than Simpsons yellow. The characters are great, and the humour and dialogue are very worthy of the corner box's schedule. If you only allowed programs of this quality on the TV guide would be almost empty. This series is very amusing and enjoyable, and is almost as good as The Simpsons for entertainment. The characters have interesting personalities and the plots are, considering it's setting, quite extraordinary. Quite an enjoyable show.So, all in all, thanks Matt Groening for another brilliant series, and may there be more episodes!"
    },
    {
      "username": "grimdodger",
      "userUrl": "https://www.imdb.com/user/ur2415414",
      "reviewLink": "https://www.imdb.com/review/rw0939501",
      "warningSpoilers": false,
      "date": "30 September 2004",
      "rate": "",
      "helpful": "158 out of 180 found this helpful.",
      "title": "Can be watched till the end of time..",
      "content": "Futurama is the second series by Matt Groening. Now when I was watching The Simpsons one idea was that why we can't see this guy more, why he is only behind a widely known TV series while poking some other people. But with Futurama I say he is (OK, was) unleashed.Futurama deals with moron pizza delivery boy Fry being accidentally frozen and wake up 1000 years after into a whole new world. Strangely this is not the story of the Fry's adaptation, because he is not. He is still the same stupid guy back in 20th century.. Maybe a little improvement but that's all.. Then we meet Leela, who is the only cyclops alien in the whole galaxy (as far as she knows), orphan, different from others. Last but not least the main cast includes Bending Unit Bender which is a robot. Nice thing about him is that the general idea of a robot is that they are always serving and helping and supporting, but Bender does not. He lies, cheats, steals...Then the supporting cast has the cute and horny Chinese (or Japanese?) Amy, Fry's great^20 nephew professor Farnsworth with crazy inventions but an unstable mind, doctor Zoidberg that mastered on human medical but not a human itself, Jamaican manager who is a qualified limbo master and denying machine...I like Futurama because it creates an unexpected, yet tempting future and combines it with cunning references and a strange comedy style. It's range of poking is 'wider'..Futurama can turn any depressed mood to a happy mood if just the watcher accepts the fact that show does not require a deep concentration for the whole concept, but likes to catch it slowly by using trivial extras and nicely planted sci-fi references.This show was one of the best. Ever. It's a pity that it was canceled an I pity the fool who canceled it. Such things should continue till the end of time.. Thanks to the makers of DVD, they partially do.Futurama is mandatory for all sci-fi and comedy lovers, and highly recommended for everyone else."
    },
    {
      "username": "briancham1994",
      "userUrl": "https://www.imdb.com/user/ur5788055",
      "reviewLink": "https://www.imdb.com/review/rw5967844",
      "warningSpoilers": false,
      "date": "5 August 2020",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "The best science fiction show",
      "content": "This is the best science fiction show I have seen. It combines all sorts of science fiction settings, technologies and tropes with a cast of lovable characters. The stories are all memorable and often get quite emotional. Futurama combines comedic satire with heartfelt plots and is overall a great series."
    },
    {
      "username": "DarkAwakening",
      "userUrl": "https://www.imdb.com/user/ur2021002",
      "reviewLink": "https://www.imdb.com/review/rw0974790",
      "warningSpoilers": false,
      "date": "8 December 2004",
      "rate": "",
      "helpful": "195 out of 215 found this helpful.",
      "title": "Futurama - One of God's Gift to Animation.",
      "content": "Looking for the a comedy cartoon with perfectly timed humor and characters that you actually want to meet and/or grope? Then Futurama is for you.Whether you're looking for Science, Fiction, or Science Fiction, you're in for a treat as Fry, Leela, Bender, the Professor, Amy, Hermes, and to a much lesser extent Dr. Zoidberg travel through time and space to deliver/battle/mate with creatures/aliens/humanoid alien creatures from the past/future.Let's just say that if I had the choice between living and watching Futurama repeatedly for an eternity in purgatory, you would never see me again.10/10, 5/5, 1/1, *****/*****"
    },
    {
      "username": "Rectangular_businessman",
      "userUrl": "https://www.imdb.com/user/ur13538926",
      "reviewLink": "https://www.imdb.com/review/rw1641878",
      "warningSpoilers": false,
      "date": "22 April 2007",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "This was a fantastic show !",
      "content": "\"Futurama \" was a excellent show from the same creator of \"The Simpsons\" .Like that show \"Futurama \" had a brilliant and satirical sense of humor ,and also many references to sci-fi shows that work very well . The characters are very funny and original , And while the story advances we learn more about them .The animation is very much like \"The Simpsons \" ,but it doesn't matter ,because the stories are hilarious and unpredictable . Many of the stories work very much fro the parallels between modern events ,so the sci-fi is just a element used to make satire of contemporary events . And even if you aren't a sci -fi fan , the show still have many interesting elements that make recommend it to anybody . This was a excellent show .I can't believe that it was canceled ."
    },
    {
      "username": "dobbin-4",
      "userUrl": "https://www.imdb.com/user/ur9187930",
      "reviewLink": "https://www.imdb.com/review/rw1772785",
      "warningSpoilers": false,
      "date": "1 December 2007",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Futurama is the best animated show behind The Simpsons.",
      "content": "Well 2 days ago making a review for the Futurama movie I realized I have not put a review down for the show that started it all. The show is about Fry a 21 year old pizza delivery boy who always wanted to be an astronaut and when he accidentally gets himself chrogenically frozen and wakes up in the year 3000. The show is hilarious from the start of the first episode till the end of the last. I think that if you love The Simpsons then you will definitely like Futurama as Matt Groening has done a brilliant job changing from series to series which is a very difficult thing to do. Overall the show is a must watch for everyone and despite the fact the idiots a Fox canceled it after 72 episodes. I rate this 97%."
    },
    {
      "username": "pavlomir",
      "userUrl": "https://www.imdb.com/user/ur71314129",
      "reviewLink": "https://www.imdb.com/review/rw7739542",
      "warningSpoilers": false,
      "date": "9 January 2022",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "How you won't give it 10/10!",
      "content": "One of kind anime show. I don't feel ashamed to say I have watched it about 5 times already and I will keep watching it, because there is no modern day match for the enjoyment and the quality of the fun stories of the world of tomorrow- Futurama! Shows like Rick &Morty are mere shadows of the popular culture, while Futurama is popular culture of itself, is original in it's majority."
    },
    {
      "username": "GarethJThomas",
      "userUrl": "https://www.imdb.com/user/ur1611141",
      "reviewLink": "https://www.imdb.com/review/rw0547530",
      "warningSpoilers": false,
      "date": "6 June 2003",
      "rate": "",
      "helpful": "19 out of 20 found this helpful.",
      "title": "\"Another science fiction show cancelled before it's time.\"",
      "content": "It's such a shame that Futurama has been cancelled, for I feel the producers and cast had a lot more episodes planned and a lot more stories to tell.I don't know why FOX cancelled Futurama, other than:1) It's funny - much funnier than most other programmes on the network.2) It's intelligent - the science fiction references for instance (some of the writers have PhDs!).3) You care about the characters, each one is different and interesting in their own ways. Unlike many other cartoons, there has been a lot of character development.4) There is a sense of continuity (the characters age, unusual in a cartoon, and there are various stories that spread out throughout different episodes, such as the Fry/Nibbler one).5) The show has something for everyone - comedy, drama, romance, sci-fi, farce.6) It is entirely original.7) The animation is amazing.8) IT'S FUNNY!Yep, I can see why FOX cancelled it.Start watching Futurama and you'll be hooked. Episodes to look out for in particual are the pilot, \"Space Pilot 3000\"; \"Luck Of The Ftyrish\", \"Roswell That Ends Well\" (this one won an Emmy!), \"The Why Of Fry\", \"Anthology Of Interest I\" and \"Xmas Story\"."
    },
    {
      "username": "TorontoLiver",
      "userUrl": "https://www.imdb.com/user/ur22230702",
      "reviewLink": "https://www.imdb.com/review/rw2269360",
      "warningSpoilers": false,
      "date": "25 June 2010",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "One of the best cartoons around!",
      "content": "As most of us know, Futurama is a really, really funny show, and every character has something special about them. There is nothing wrong with this show at all! I don't see any flaws, and I don't care if there are any. This is a show with a truly touching and hilarious story line.The show is about Phillip J. Fry, a 25 year old pizza man who gets frozen in a test tube in a New York City lab on December 31, 1999. Poor Fry accidentally falls into the tube and can't get out. He is finally unthawed on December 31, 2999, exactly 1000 years later. He gets out of the tube and is mortified with what he sees, and at the same time, ecstatic. He hated his job as a pizza boy, which is what he did that for a living. When he came out of the tube, he meets Turanga Leela, another major character. Leela is quite obnoxious and has a quick temper, but some good comes out of her. Then Fry meets Bender, the slam-bang funniest character on the show! His trademark quote used in almost all episodes is 'Bite my shiny metal ass.', and no one says anything. Fry then becomes enrolled in Planet Express, a delivery crew in the year 3000 with Leela and Bender. The head of the Planet Express is Hubert J. Farnsworth, a 160 year old man. Well, it is a cartoon. At times, he's unbearable. Hubert is Fry's great x30 (the word great is used 30 times) nephew, making Fry actually older than his 160 year old nephew. The other three people who work at the Planet Express are Hermes Conrad, Amy Wong, a woman actually from the planet Mars, and then John Zoidberg, a hilarious human sized lobster. He has two giant claws that are sharp and used a lot to open food. Fry, Leela, and Bender are the crew who go on hilarious missions in outer space with the company spaceship. This show is anything but bad!Futurama has a truly touching and hilarious storyline. I cried tears of joy in one episode, I remember. If you don't like the show, that's sort of okay with me, but here's what bender will have to say: \"People who hate this show can bite my shiny metal ass.\" And the show kicks ass! Be sure to look for it on DVD and Blu-ray today."
    },
    {
      "username": "justinprime",
      "userUrl": "https://www.imdb.com/user/ur3888790",
      "reviewLink": "https://www.imdb.com/review/rw0547606",
      "warningSpoilers": false,
      "date": "29 September 2004",
      "rate": "",
      "helpful": "315 out of 337 found this helpful.",
      "title": "A Misunderstood Series",
      "content": "Futurama is the whipping boy of modern prime time cartoons. Since it was made by the creator of the Simpsons it was expected to be exactly like it. Futurama had its own brand of comedic flair, which is absolutely hilarious. Bender, Fry, Leela, Hermes, Zoidberg, all of these characters are well thought out and work incredibly well together, on top of the fact that situations and anecdotes from previous episodes are brought up all the time, adding continuity to an already excellent series. I'll admit that I too was among the people crying foul when Futurama first came out, I didn't grow to truly appreciate it until it was put in syndication on adult swim, and more so later as I bought all the episodes on DVD. I don't think the world was ready for what futurama had to offer when it first came out, and everyone should give it another shot through adult swim or by DVD rental. It has solid entertainment value, and a unique comedic style.4.5 out of 5 stars"
    },
    {
      "username": "eragonshades",
      "userUrl": "https://www.imdb.com/user/ur47353092",
      "reviewLink": "https://www.imdb.com/review/rw2887647",
      "warningSpoilers": false,
      "date": "15 October 2013",
      "rate": "10",
      "helpful": "61 out of 66 found this helpful.",
      "title": "Much Better Than the Simpsons. Smart and Hilarious.",
      "content": "This show has always been ignored, or passed over by some old Simpson's fans, simply because it isn't the Simpsons. Futurama and the Simpsons share little in common, aside from one thing...they are both extremely funny. Futurama however, continues to push the envelope of what is entertaining. With an extremely amusing cast of characters, plot lines, laugh out loud jokes and even some emotional moments, this show has everything. Adventure, Comedy and Romance can all be found within the cornucopia of episodes this show has to offer.In the Simpson, the quality has gone downhill and has kept going further and further down. In Futurama it is the exact opposite. It just gets better and better and better.Anyone can enjoy Futurama as it is full of smart laughs, slapstick humour, and great characters. I give this show ten out of ten. If you enjoy The Simpson's, Star Wars, or anything else, this show is perfect for you."
    },
    {
      "username": "FistOfNoRemorse",
      "userUrl": "https://www.imdb.com/user/ur12328160",
      "reviewLink": "https://www.imdb.com/review/rw2960295",
      "warningSpoilers": false,
      "date": "13 February 2014",
      "rate": "10",
      "helpful": "25 out of 26 found this helpful.",
      "title": "One of the best animated series EVER",
      "content": "Futurama is an absolutely hilarious show. The jokes are great and the characters are unique. Fry's stupidity is hilarious. Bender is great. The professor says some really funny stuff, especially the insults he comes up with. The whole show is an entertaining, comic masterpiece. I was actually pretty surprised at how good the last season was. My girlfriend and I thoroughly enjoyed it. I'm deeply saddened that this show is canceled.. Again!! It's better than a couple of the adult animated series that are still running on Sunday nights. The last season was so funny that it made us even more confused that it's being canceled. How is this happening when some other terrible junk is still on the air?? It's a brilliant show. The creators did an excellent job and I'd love to thank them for this. It's worth watching again and again! I will miss seeing new episodes."
    },
    {
      "username": "Covey-3",
      "userUrl": "https://www.imdb.com/user/ur0482211",
      "reviewLink": "https://www.imdb.com/review/rw0547465",
      "warningSpoilers": false,
      "date": "20 September 2000",
      "rate": "",
      "helpful": "112 out of 149 found this helpful.",
      "title": "All hail, the NEW king of animated series.",
      "content": "While the later episodes of The Simpson's have suffered, Futurama has matured, far more quickly than the Simpson's did, into a fantastic work of animation.The similarities between the Simpson's are obvious and not to be ignored. A show as good as The Simpson's was is ripe for theft and Futurama, the brainchild of Matt Groening, borrows well from the former show. Bender is the Homer Simpson, devoid of responsibility, yet, as this lack of responsibility is placed in a robot, we do not have to feel anger at his wayward ways.Leela is the far less annoying Marge. Less annoying for the simple facts. A) She has something resembling a personality, something that Marge definitely suffered from. and B) You can listen to her speak without wanting to kill yourself.Fry however grounds the show with the emotional base that made the Simpson's great. A Pizza delivery boy from the 20th century transported forwards in time 1000 years into a world that he knows nothing about. While our imaginations might find it a little too easy coming to terms with the future and all the few new inventions that go with it (Perhaps a nod to how poor an inventor Farnsworth is that there seems nothing overly unusual about this future), we forgive this minor blip and embrace Groening new world vision.As with The Simpson's, Groening has given us a host of superb background characters. Zoidberg the lobster Doctor, Amy daughter of money, Hermes the Jamaican limbo champion who keeps the business together and of course Zap Brannigan, the genius of lacklustre. All of these characters are easily the match of Chief Wiggum, Smithers, Krusty, Frink, etc.Groening, clearly by taking the best writers from the Simpson's with him when he jumped ship, has done the impossible and found an animated series that is superior to the unsurpassable Simpson's. Groening's world is a good one. And so is his show."
    },
    {
      "username": "JessK916",
      "userUrl": "https://www.imdb.com/user/ur1775028",
      "reviewLink": "https://www.imdb.com/review/rw0547517",
      "warningSpoilers": false,
      "date": "28 February 2003",
      "rate": "",
      "helpful": "143 out of 159 found this helpful.",
      "title": "Grade A Hilarity",
      "content": "I disagree with those who hate Futurama with a passion. On the contrary, I find the show so completely funny and original. Let me explain what I mean:The plot of having a crude, broke pizza delivery-kid wander into a cryogenics lab and fall into a freezer shell for a thousand years is so creative...I'll expand further; He befriends a very well voiced \"cyclops\" mutant named Leela (Katey Sagal), a trash talking robot named Bender, his great, great,great (etc.) nephew Prof. Farnsworth, an alien-crab that sounds remarkably Jewish, Dr. Zoidberg, the list of imaginative characters and plot situations just doesn't stop! The humor is just awesome. I have never sat through Futurama once without laughing until I cried about something. I find it incredible that one could hold such disdain for the comedy. It really is so entertaining. But to each his own, I say.Fry: Wait you're the only friend I have... Bender: You really want a robot for a friend? Fry: Yeah ever since I was six. Bender: Well, ok but I don't want people thinking we're robosexuals, so if anyone asks, you're my debugger.Leela: Hey, he stole my ring! Bender: Sorry. Well, that solves the mystery of the missing ring. This calls for a drink.Farnsworth: Let me show you around. That's my lab table and this is my work-stool. And over there is my intergalactic spaceship. And here's where I keep assorted lengths of wire. Fry: Whoa! A real live spaceship! Farnsworth: I designed it myself, let me show you some of the different lengths of wire I used.Just a sampling of the amusing lines in the show. Thanks all!"
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw2038899",
      "warningSpoilers": false,
      "date": "17 March 2009",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "A great animated sci-fi comedy",
      "content": "Futurama is probably my favourite Western animation, I first watched it because it was \"from the creator of The Simpsons\" and found myself preferring it. The style of animation is similar to that in The Simpsons although the characters look more human.Set 1000 years in the future Futurama follows the life of Fry, a 20th century pizza delivery boy who got frozen in a cryogenics lab on New Year's Eve 1999. He awakens to find himself in a strange world where he makes friends with Bender, a kleptomaniac robot and Leela, a purple haired cyclops who is the only one of her kind on Earth. The three of them find employment with Fry's great-great-great... etc nephew, the 150 year old Professor Farnsworth. Their work for his delivery firm takes them to a variety of strange worlds although not all of their adventures are on alien planets, some involve the professor's strange inventions and others just involve them living their lives on 31st century Earth. There is also a good collection of secondary characters such as Dr Zoidberg the incompetent company doctor who is a crustacean, Zapp Brannigan, leader of the Democratic Order Of Planet's military leader who is also infatuated with Leela. The show manages to have several guest stars even though it is set centuries in the future by having the technology to keep people's heads preserved in jars, strangely this even works for people who are long dead in the present.Like all series there are a few week episodes but these are far outnumbered by the excellent ones, most episodes will have viewers laughing and one or two might you cry. The voice actors all do a great job as do the animators."
    },
    {
      "username": "lesleyharris30",
      "userUrl": "https://www.imdb.com/user/ur23055365",
      "reviewLink": "https://www.imdb.com/review/rw3173383",
      "warningSpoilers": false,
      "date": "30 January 2015",
      "rate": "9",
      "helpful": "8 out of 10 found this helpful.",
      "title": "One of the Cleverest and Most Well Written Animated Series There is,I'm Gonna Miss it,",
      "content": "Futurama is an outstanding television series that is extremely well written and developed,with an absolutely stellar voice cast.I have my doubts that any one reading this hasn't watched it yet,but if you haven't then I would highly recommend you start.It is from the same people who brought you the Simpsons,but it is very different,the humour is quite similar but the characters and the concept is certainly not similar.I grew up watching this show as a child,Fry,Bender,Leela and the rest of the gang are like family members to me and it would go high up on my list of favourite animated series.The show has been cancelled before and I'm sad to see it leave again,they had such a wide variety of fantastic episodes,ones that are hilarious,and even emotional,it can be very versatile.The final episode dosen't end in a way that it has to be the final time we ever see these characters,I could easily imagine the show coming back,or at least doing a movie to finish it off once and for all,I just hope to see the Planet Express crew again soon.A classic series that kids and adults will love,I would highly recommend Futurama to anyone looking for a good comedy or animated series. Phillip J. Fry is accidentally frozen in 1999 on New Years Eve and wakes up in the year 3000,where he starts working with a delivery company run by a crazy professor,where he works with a robot,cyclops,talking lobster and others as they are sent on many adventures. Best Episode: The Late Phillip J. Fry Worst Episode: The Honking"
    },
    {
      "username": "jboothmillard",
      "userUrl": "https://www.imdb.com/user/ur4248714",
      "reviewLink": "https://www.imdb.com/review/rw1078138",
      "warningSpoilers": true,
      "date": "11 May 2005",
      "rate": "10",
      "helpful": "9 out of 12 found this helpful.",
      "title": "Futurama",
      "content": "After the long success of The Simpsons, Matt Groening and his cartoon creators decided to make another successful series, and they did. Some pizza delivery guy named Philip J. \"Fry\" (Bill West) accidentally freezes himself for 1000 years and wakes up in the 30th century. In this new world he befriends his great, great, great (you get the idea) nephew, clever Prof. Hubert J. Farnsworth (West), the weird and funny Dr. Zoidberg (West), the cyclops Turanga Leela (Katey Sagal), Amy Wong (Lauren Tom), Hermes Conrad (Phil LaMarr) and of course, the best character, similar to Homer Simpson, Bender the robot (John DiMaggio). Throughout the show they have many weird and wonderful adventures of futuristic and funny proportions. Guests included Frank Welker, Leonard Nimoy, Pamela Anderson, Nancy Cartwright, Dan Castellaneta, John Goodman, Conan O'Brien, Parker Posey, Al Gore, Stephen Hawking, Hank Azaria, Lucy Liu, William Shatner, Jonathan Frakes and Roseanne Barr. Groening has done a very good job of creating another watchable cartoon. It won the Emmys for Outstanding Animated Program (For Programming Less Than One Hour) (also nominated 4 times) and twice for Outstanding Individual Achievement in Animation, and it was nominated for Outstanding Music and Lyrics. It was number 26 on The 100 Greatest Cartoons. Outstanding!"
    },
    {
      "username": "bat-5",
      "userUrl": "https://www.imdb.com/user/ur0100620",
      "reviewLink": "https://www.imdb.com/review/rw0547453",
      "warningSpoilers": false,
      "date": "19 December 1999",
      "rate": "",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Keeps getting better.",
      "content": "Futurama had a shaky start, but after that first episode, things are getting better on the show. The exploits of Fry, Leela, Bender and the rest make for some of the funniest things I've ever seen in a TV show. Pop culture references abound and if you're quick, you'll catch them all. The most recent episode with Richard M. Nixon coming back to take control of the world was a hoot. The episode where Bender is captured on the robot world is great and the entire Titanic knock off with Zap Brannigan was priceless. Another great show from the twisted, but very gifted Matt Groening."
    }
  ],
  "errorMessage": ""
}