{
  "imDbId": "tt0877057",
  "title": "Death Note",
  "fullTitle": "Death Note (TV Series 2006–2007)",
  "type": "TVSeries",
  "year": "2006",
  "items": [
    {
      "username": "loncarkristina",
      "userUrl": "https://www.imdb.com/user/ur62482296",
      "reviewLink": "https://www.imdb.com/review/rw5104051",
      "warningSpoilers": true,
      "date": "6 September 2019",
      "rate": "9",
      "helpful": "239 out of 255 found this helpful.",
      "title": "I'm glad Death Note was my first anime.",
      "content": "The first time I heard of Death Note was from a youtube channel Hello Future Me and his storytelling analyses. Previously I had resented anime as childish and totally weird-looking, but after Timothy took Death Note as an example of a good story-beat management, I was wiling to give it a shot. And boy, was I hooked.Never before have I seen any show try to copy that sherlock-ey way of thinking and incorporate it so cleverly with mystery and fantasy elements. Death Note has such an unique feel to it that no other anime has... every moment Light's and L's theme play, I get slight goosebumps while wondering who will outsmart whom next. It is a matter of simple beauty seeing the writers play with the contrast of Light's and L's personality, making them grow close while simultaneously growing further apart. Ant to top it off with so much symbolism and biblical references in the final episode of L's saga is a matter of pure perfection.Yes, people will say that the second part sucks. Truth be told, even though it may not be equally as engaging as the first one, I wouldn't say it was unbearable either. The fact is that by this point Light is so cornered that he cannot operate on his own; therefore the tension is dissipated towards minor characters and Near that we don't get enough time to care about. Nonetheless, seeing Light maneuver through all the traps Near sets for him provides a proper build-up towards the eagerly expected end.And about the end... I really felt for Light in those final moments. Part of me didn't want the series to end the way it did, simply because Light was the embodiment of my answer to the fundamental questions of justice that stem from Dostoyevski's Crime and Punishment. As much as I may be a follower of Kira in one part of my mind, I also cannot deny that Near is absolutely right - Light Yagami is just another serial killer; nothing more and nothing less.Death note is the first of all the animated series that has introduced me with the fact that not all things animated have to have a happy ending. Think of it, how many western-animation movies do you know that do not end on a happy note? Very few would be my guess. And from this time on, my journey through japanese animation has started. I couldn't be more grateful for the way it began and therefore, Death Note will always be the No. 1 anime I will recommend to people new to anime. If you haven't seen it yet, I really do not know what you are waiting for...... btw I hear the bells. Do you?"
    },
    {
      "username": "premnigamkarpnk",
      "userUrl": "https://www.imdb.com/user/ur103904119",
      "reviewLink": "https://www.imdb.com/review/rw4909534",
      "warningSpoilers": true,
      "date": "3 June 2019",
      "rate": "9",
      "helpful": "415 out of 448 found this helpful.",
      "title": "Brilliant first half, and the rest of it was just okay.",
      "content": "Seriously the first half of it was the one of the best things I've ever watched in my whole life. The psychological warfare was brilliant and the show had me on the edge of my seat at every single moment. And once L died, everything went downhill. Light turned into an absolute physcopath and it was almost unbelievably stupid of him to fall in Nears trap. Near was nowhere nearly as smart as L or Light, yet she had the last laugh. If the second half would've continued like the first half, this would be the best show ever made."
    },
    {
      "username": "eirenightshade",
      "userUrl": "https://www.imdb.com/user/ur13584741",
      "reviewLink": "https://www.imdb.com/review/rw1564944",
      "warningSpoilers": false,
      "date": "6 January 2007",
      "rate": "10",
      "helpful": "536 out of 595 found this helpful.",
      "title": "Clever, Slick, and Suspenseful",
      "content": "This is anime at its best. I'm fairly new to the world of anime, but I have to say from what I've seen that Death Note goes above and beyond your typical run-of-the-mill action based anime. Whereas a lot of anime strategically relies on action packed battles and fights, Death Note is a refreshing change of pace. It's slick, clever, and witty with the eccentric \"L\" heading the investigation. It's a constant game of cat and mouse as the lead investigator and the suspected \"Kira\" or \"Killer\" always seem to be one step ahead of one another. The two brilliant minds constantly outwit each other. The plot is complex but easily laid out for you and the story is remarkably intelligent and inventive. All the while you're watching you think, \"Wow, this can't possibly get any deeper,\" but each new episode proves you wrong. What I like the most is that this is very, very complex material but it's flawlessly and easily presented so each new development in the case comes as an excited shock.This is great stuff and I would definitely recommend it to anyone who might be looking for a change of pace in anime. It's not for everyone, of course since it's more of an intellectual thriller and not so much an action fantasy, but anyone who can appreciate the mental challenge of following along with this suspenseful battle of wits will be in heaven with Death Note."
    },
    {
      "username": "dj_vlado",
      "userUrl": "https://www.imdb.com/user/ur58430943",
      "reviewLink": "https://www.imdb.com/review/rw5046996",
      "warningSpoilers": false,
      "date": "8 August 2019",
      "rate": "9",
      "helpful": "194 out of 212 found this helpful.",
      "title": "Masterpiece but latter half ruined the series slightly",
      "content": "I will be short, the series is a gem: character buildup, screenwriting, tension, drama, art, cinematography, everything. Truly captivating story......until (without spoiling it) the main story arc ends quite anticlimactically and new subplot begins with new characters in the primal focus. The latter half takes away a hint of brilliance from rest of the story.Still I would recommend it!"
    },
    {
      "username": "kojisuzuki",
      "userUrl": "https://www.imdb.com/user/ur4616813",
      "reviewLink": "https://www.imdb.com/review/rw1515431",
      "warningSpoilers": false,
      "date": "30 October 2006",
      "rate": "10",
      "helpful": "291 out of 356 found this helpful.",
      "title": "let them eat cake!",
      "content": "From the pages of the manga to the silver screen and then to the small screen. Manga = breathtaking, Film = groundbreaking, Anime = phenomenal.Death Note the anime is one of the best animes to come out for a very long time. The storyline is amazing but not complicated or cliché. Like the film and manga, it depicts the cat and mouse hunt between L and Light on who will uncover one another's identity.Death Note is a cake; everything good about a cake; and therefore people should see this landmark. Overall, Death Note will remain a classic forever... if the Americans don't remake and ruin it!!!10/10"
    },
    {
      "username": "dewo96",
      "userUrl": "https://www.imdb.com/user/ur22287525",
      "reviewLink": "https://www.imdb.com/review/rw5442893",
      "warningSpoilers": false,
      "date": "28 January 2020",
      "rate": "9",
      "helpful": "67 out of 78 found this helpful.",
      "title": "Brilliant start, weak finish, but still great show",
      "content": "No spoilers... This show has a great starting foothold. The mixing between mythical fantasy world of god of death and police detective story line is brilliant, just works brilliantly. But as the story grows the details on how things work out gets blurry and un logical character decision making happens more and more often But overall very enjoyable despite the weak finish, and oddly i am hoping there is a death note 2"
    },
    {
      "username": "Ore-Sama",
      "userUrl": "https://www.imdb.com/user/ur10963001",
      "reviewLink": "https://www.imdb.com/review/rw1778333",
      "warningSpoilers": false,
      "date": "10 December 2007",
      "rate": "9",
      "helpful": "142 out of 185 found this helpful.",
      "title": "Well Written, Masterful Anime",
      "content": "I have to say two things turned me off. First is the idiot reviewer on the front page who feels the need to use 70% of his review(even titled it \"Eat Your Heart Out Naruto\"-really subtle) to bash Naruto like some insecure 12 year old spoiled brat fan boy. Pathetic. The second was that it sounded like some Gothic action anime from others. However when I finally saw it I thought, meh, okay. However as it went on I got more and more drawn in.The plot is simple enough to start:successful and brilliant student Light stumbles upon the Death Note, which will kill anyone who's name he writes down provided it's their real name and he knows his face. He experiments with it and sees that it's real. He plays with the other rules all the while killing other criminals and meeting up with the shinigami who wrote the death note. The deaths of these criminals does not go unnoticed as the renound and mysterious detective El is trying to discover who Light, under the name Kira, is. Whoever finds the other's identity first will win in this power struggle.Like I said, the first episode is interesting enough. The story however develops and becomes better and more complex as it goes on. The moral ambiguity of the anime gives it a unique feel among others of it's kind. I was shocked to see a show like this under Shounen jump which usually host anime that combine strong actions scenes with a complex plot and character development. What we have here instead is an anime that dosen't have adrenaline pumping action scenes advancing the plot(not that there's anything wrong with that, in fact I enjoy that as well) but the proverbial chess game between Light and the police as Light becomes well aware the police are after him as he does everything possible to hide himself all the while continuing to do away with criminals at his whim.Ryuk, the shinigami who follows Light, actually provies some of the comic relief of the show believe it or not. He's not over the top goofy by any means however if there's any laughs to be derived, it's usually from him.Even if you're not a fan of Shounen Jump anime, you should give Death Note a try. It easily rivals the majority of thriller films. It is well worth your time."
    },
    {
      "username": "BadgerStorm4345",
      "userUrl": "https://www.imdb.com/user/ur113370202",
      "reviewLink": "https://www.imdb.com/review/rw5830372",
      "warningSpoilers": false,
      "date": "16 June 2020",
      "rate": "8",
      "helpful": "19 out of 22 found this helpful.",
      "title": "Incredible until it Wasn't",
      "content": "Death Note was a stellar TV Show and on its way to being one of my favorite animated TV Shows. With its incredible concept, interesting villainous protagonists and an antithesis to the protagonist that complimented his genius perfectly. The formula was great with the exception of episodes 18-22 which features our protagonists cunning on a boring way that leads to a lackluster payoff. After this however. Episodes 23, 24 and 25 are phenomenal works of art. This is where the series goes from Incredible to incredibly mediocre. With the exception of the last 3 episodes of the show, there is no right for any of the episodes after episode 25 to exist. The show went from having me completely invested to it feeling like a chore to finish, which is a shame because of how great the last 3 episodes actually were. They introduce new antagonists that are literally the exact same thing as the last one we had, except much worse and no fun at all to watch. I was frustrated with these new characters and their placement in the show. In my opinion Death Note should have ended at episode 25 then it would have been a nearly perfect anime."
    },
    {
      "username": "jared-25331",
      "userUrl": "https://www.imdb.com/user/ur106224983",
      "reviewLink": "https://www.imdb.com/review/rw6035903",
      "warningSpoilers": false,
      "date": "28 August 2020",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Simply Phenomenal!",
      "content": "Despite the fact that I haven't read the manga, I can say that Death Note is one of the best anime I've ever seen. The story & characters amazing and complex. It's a classic cat & mouse game between the hero and the villain on who try to find out about the others' identity. The animation is amazing, which is that you can always expect from japan. Overall, Death Note is a classic anime that is beloved by many and will continue to remain beloved for many years to come."
    },
    {
      "username": "FrenchEddieFelson",
      "userUrl": "https://www.imdb.com/user/ur3257585",
      "reviewLink": "https://www.imdb.com/review/rw4704597",
      "warningSpoilers": false,
      "date": "7 March 2019",
      "rate": "9",
      "helpful": "36 out of 47 found this helpful.",
      "title": "Two thumbs up!",
      "content": "This manga is exceptional: smart, captivating and suspenseful. The script is up to the drawings: astonishing and entertaining. I loved it!"
    },
    {
      "username": "noitidart",
      "userUrl": "https://www.imdb.com/user/ur34781181",
      "reviewLink": "https://www.imdb.com/review/rw3634524",
      "warningSpoilers": true,
      "date": "6 February 2017",
      "rate": "9",
      "helpful": "119 out of 152 found this helpful.",
      "title": "The L saga is superb, the ending half weak",
      "content": "This review does not contain any spoilers. It is OK to read this. I only mention \"L\".The first half is absolutely absolutely superb. I call this the \"L saga\". When you watch it, you will clearly know when it ends. I recommend you stop there. I wish I did. It's the halfway point of the series. The main characters story really does end there. But to show some moral lessons they put in another half to show that \"good through evil isn't good\". All world governments and empires disagree with this, so why did this show have to forcefully fabricate new stories in the second half. It totally ruined it. It takes away from the characters that had been established.Due to the first half being the best thing I have ever ever seen, I give this 9 stars. Even though the second half was so bad I should reduce it to 5 stars."
    },
    {
      "username": "TheJaisenberg",
      "userUrl": "https://www.imdb.com/user/ur104859603",
      "reviewLink": "https://www.imdb.com/review/rw5546894",
      "warningSpoilers": true,
      "date": "13 March 2020",
      "rate": "8",
      "helpful": "166 out of 186 found this helpful.",
      "title": "The second half of the series ruined a masterpiece",
      "content": "Don't get me wrong, this is an awesome series. From the first episode you can note the well characterized characters, incredible production and direction by MadHouse, the good tone and a story that can be interesting for casual viewers and for smarter people. The constant fight between Kira and L was the point where the series harnessed its potential, you know, THE SERIES STAYED ALIVE BECAUSE OF IT and it was damn awesome, you were always thinking what Kira would do next and what would L do to catch him, it was unpredictable in a good way and fascinating.This was until episode 25 unfortunately, and everything just goes down. Without L, Light feels so distant from the viewer making the next events monotonous and boring to watch,he suddenly starts acting like an impulsive idiot that betrayes his previous character, and about Near, it seems like a plot device being just there for finishing what L started. There's no personality or characterization in him, so it's a nonsense. And then we get to the final episode, Light seems he's going to win but you know what? Let's make an stupid and forced situation where Mikami has the stupid idea to leave the note in a place like the bank. Are you serious? After we saw Light's elaborated plan to hide it in the first episodes, Why didn't he tell him to do that? What I hate from this is that they tell you that Mikami is a very intelligent and metodic guy, but he acts like a fool making decisions without Light's orders. Forced, convenient, inconsistent and rushed.Death Note starts as an incredible and smart show, then they took the smart part and got rid of it. On it's defense, I have to say that the second half isn't too long to ruin the series, so it goes from being a masterpiece to just a very good show.8/10"
    },
    {
      "username": "EVON1TY",
      "userUrl": "https://www.imdb.com/user/ur47939660",
      "reviewLink": "https://www.imdb.com/review/rw4942745",
      "warningSpoilers": false,
      "date": "18 June 2019",
      "rate": "10",
      "helpful": "30 out of 38 found this helpful.",
      "title": "Effective and brilliant fantasy story. Absolutely an amazing Anime!",
      "content": "Death Note has really good details on it's script. Deeply amazing, brilliant storyline. The New World rises with Kira. So different than the other Fantasies. It's so immersive and detailed, so effective. I personally like the other half too. But as you can expected yes, It's not good as the L episodes."
    },
    {
      "username": "Jamex_",
      "userUrl": "https://www.imdb.com/user/ur3619114",
      "reviewLink": "https://www.imdb.com/review/rw1521716",
      "warningSpoilers": false,
      "date": "15 November 2006",
      "rate": "10",
      "helpful": "379 out of 426 found this helpful.",
      "title": "Rush!",
      "content": "After watching the first six episodes, I find that the story line is very well though out. Unlike many series, Death Note has a way of keeping ahead of the watcher, and one can never predict what is about to happen. The series is obviously dark. One of the things that I find interesting about Death Note that the protagonist isn't the good guy, like that of the stereotypical protagonist. The fact that this series goes morally were few others will go is definitely one of the reasons I find this series to be so enticing.I'm definitely hooked!"
    },
    {
      "username": "NicolasTheWolf",
      "userUrl": "https://www.imdb.com/user/ur102956159",
      "reviewLink": "https://www.imdb.com/review/rw7344828",
      "warningSpoilers": false,
      "date": "14 September 2021",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Genius",
      "content": "The first 25 episodes of Death Note are simply insane. The mental fight between L and Yagame Light is something I've never seen before in that intensity. They are both such great characters so if either of them wins you will be sad for the other one. The last 12 episodes were still pretty good but just not at the same level as before. But the ending was really great again and a worthy one."
    },
    {
      "username": "jasminn_tan",
      "userUrl": "https://www.imdb.com/user/ur102222939",
      "reviewLink": "https://www.imdb.com/review/rw5803962",
      "warningSpoilers": true,
      "date": "6 June 2020",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Wow",
      "content": "I know I'm really late but this was amazing. Light is probably one of the best villains that also happens to be the protagonist. He was despicable and a psychopath that thought himself a God. It was chilling to watch him transform into Kira because he was willing to kill anyone that stood in his way. I enjoyed every second of it. If I could make a comparison, the dynamic between Light and L is similar to that between Hannibal and Will in the tv show Hannibal. This anime kept me on my toes in every episode as Light outsmarted the people who were against Kira, until he was eventually outsmarted. I kind of wished that Light would've won in the end but honestly the ending meant that nobody but Ryuk won. Ryuk had the most fun being around Light and it was only right that Ryuk was the one who took Light's life. It had come full circle and it was a little bittersweet to see this end."
    },
    {
      "username": "gianmarcoronconi",
      "userUrl": "https://www.imdb.com/user/ur134783880",
      "reviewLink": "https://www.imdb.com/review/rw7945059",
      "warningSpoilers": false,
      "date": "12 March 2022",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Wonderful",
      "content": "This series is a boundless wonder, it is one of the most beautiful cartoons that exist. The plot is wonderful, the characters are all characterized to perfection and in general the series manages to keep you in tension throughout its duration, too bad the ending is slightly pulled away."
    },
    {
      "username": "birdsonthings",
      "userUrl": "https://www.imdb.com/user/ur24096923",
      "reviewLink": "https://www.imdb.com/review/rw8487084",
      "warningSpoilers": false,
      "date": "25 August 2022",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Best anime",
      "content": "This is in my top 5 favorite anime. I love everything about Death Note: the music, anime style, plot, characters...If you haven't seen Death Note, do yourself a favor and watch it NOW. It's just a timeless, amazing anime show. I've watched it all the way through twice and it doesn't get old."
    },
    {
      "username": "sebasvictoria-62058",
      "userUrl": "https://www.imdb.com/user/ur156462309",
      "reviewLink": "https://www.imdb.com/review/rw8869719",
      "warningSpoilers": false,
      "date": "13 February 2023",
      "rate": "9",
      "helpful": "7 out of 7 found this helpful.",
      "title": "The fine line between justice and morality",
      "content": "Death Note puts on the table the eternal debate between what is correct or not, even when just one person has the \"absolute power\" to judge others and decide how to punish them. Whereby, Death Note proposes a complex conversation about justice and morality and what is the fine line between them that must not be crossed.Death Note was smartly made. The anime does not treat people as fool. The serie puts people into a big chess game where each move is unpredectable, giving the spectators brilliant and well created situations that do not insult the intelligence of the viewer. They make you part of the game but from other perspective.The development of the plot is full of lies, betrayals, tricks and the multiple plot twist. It is not impossible to perceive the tension, the suspense, and the intrigue behind each chapter, creating an atmosphere of mystery that is supported by its characters and their personalities, adding layers of depth to the plot.Death Note keeps in a high level most of time during the chapters, until one point where it goes down, but it gets keeping enough high until the end."
    },
    {
      "username": "maddiebuggie",
      "userUrl": "https://www.imdb.com/user/ur117143265",
      "reviewLink": "https://www.imdb.com/review/rw5683923",
      "warningSpoilers": false,
      "date": "27 April 2020",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Death note review",
      "content": "I loved every second of this show. Not one second was the show boring. The animation of this show was good. They did a good job on the plot of this story. This was the first crime/ action anime I finished. I loved how the story turned out. The hats tee development was nice. I liked the fact that the police son was the person killing everyone using the death note book but yet the police and everyone didn't know it or want to believe it for most of the series. L was my fav character hands down even know everyone else was good too. Something about L made him so good. I when I first saw L from the way he looked I thought he would have been the person using the notebook killing anyone but he wasn't. It turned out that he was on the good side and was working with the police. At first I thought the police son was gonna be good but it turns out he had the notebook and was using it to kill anyone and was getting more and more power hungry as time when on. I like how L was on the good side working with the police instead of the son it made the story so much better then it would have been if the son was on the good side working with the police instead of fooling them like he was in the anime. I loved the fanstay/ magical creature that we're suppose to be caring for the death notes books so they didn't get in the hands of someone that would use it for bad. I like how they were designed. All of the other character designs where good too. I liked the colors they choose for this anime to be in. It had lots of action. I liked how the anime had darker colors in it. I would recommend this anime to everyone."
    },
    {
      "username": "khandelwalkartik-87733",
      "userUrl": "https://www.imdb.com/user/ur85356558",
      "reviewLink": "https://www.imdb.com/review/rw6536325",
      "warningSpoilers": false,
      "date": "28 January 2021",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Best Anime",
      "content": "Its a perfect anime ever made,the combination of suspence is next level and with the great music and dubbing."
    },
    {
      "username": "lennoxxx",
      "userUrl": "https://www.imdb.com/user/ur9351983",
      "reviewLink": "https://www.imdb.com/review/rw1617232",
      "warningSpoilers": false,
      "date": "13 March 2007",
      "rate": "10",
      "helpful": "167 out of 218 found this helpful.",
      "title": "A must see for anyone, don't even need too like anime to love this!!!",
      "content": "I watched one episode and thought the first episode wasn't pretty good, but when i started too watch(watching episode 11 now) i started too love it, its genius and the guy who made this movie got too be one of the smartest filmmaker ever, The animation is one of the best, the story is smart, deep and exemplary written , the characters are interesting, i can gladly say i haven't found one error in this series, so even if you don't watch much anime i just recommend you too watch this and i can swear that you will like it, i think this is as good as elfen lied(or even better). The story is about a guy named light who is top-student and smartest guy in school(without being a geek), one day some kind of diary named ''death note'' falls down from the sky and he picks it up, and then the story begins.. a must see for everyone!!!10/10"
    },
    {
      "username": "fjmahi",
      "userUrl": "https://www.imdb.com/user/ur96749714",
      "reviewLink": "https://www.imdb.com/review/rw6540441",
      "warningSpoilers": false,
      "date": "29 January 2021",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "A masterpiece",
      "content": "The story of Death Note is simply amazing. It is a story of how a genius highschool student wants to rid the world of evil,by killing them and a genius Detective tries to catch him. The storyline is just awesome it was the first anime I ever saw and it made me fall in love with anime ever since. I'm so glad I decided to watch this anime. This anime contains one of the greatest cat and mouse chase. Some might say that the anime got bad after the first half and while yes it may have gotten slightly bad but it was still pne of the best anime ever. A must watch"
    },
    {
      "username": "dipankarkarmakarzander",
      "userUrl": "https://www.imdb.com/user/ur98284676",
      "reviewLink": "https://www.imdb.com/review/rw4628042",
      "warningSpoilers": false,
      "date": "5 February 2019",
      "rate": "10",
      "helpful": "55 out of 74 found this helpful.",
      "title": "BEST IN THE WORLD!!!!!!",
      "content": "Honestly, I'm not a regular anime viewer but I rather consider this show as live action due to its realistic nature and I really love it from core of my heart. Just♥ it"
    },
    {
      "username": "s-50307-95732",
      "userUrl": "https://www.imdb.com/user/ur134739541",
      "reviewLink": "https://www.imdb.com/review/rw8883017",
      "warningSpoilers": false,
      "date": "20 February 2023",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Definitely 10/10 in my opinion even moreIt is amazing how an animation series is so wonderful and perfect",
      "content": "From the moment this fascinating animation starts, you will be surprised and nailed, the story is extremely beautiful and full of surprises, even with its movie version, which cannot be compared in 2017, because this is an insult to this animation. The really interesting and thought-provoking character of Light really needs to be explored, and also the character of L. I really didn't want to go to the next episode after the end of the episode because I was afraid that it would end. Every moment of the series, your breath will be locked in your chest. I really want to be like a kid once again in this anime. To see. Watch and enjoy."
    }
  ],
  "errorMessage": ""
}