{
  "imDbId": "tt0306414",
  "title": "The Wire",
  "fullTitle": "The Wire (TV Series 2002–2008)",
  "type": "TVSeries",
  "year": "2002",
  "episodes": [
    {
      "id": "tt0749453",
      "seasonNumber": "3",
      "episodeNumber": "1",
      "title": "Time After Time",
      "image": "https://m.media-amazon.com/images/M/MV5BNzJjYzA2NTItYzE1OC00NGQ2LWE1ODMtMzBlNWZmODI3NmIxXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "19 Sep. 2004",
      "plot": "After the notorious Franklin Terrace public housing towers are razed, the Barksdale drug crew searches for a new home on the streets of West Baltimore. McNulty and the detail look to make a case against Stringer Bell with a wiretap on a drug ring run by his ally, Proposition Joe. Daniels' promotion is derailed by City Hall due to his estranged wife's political ambitions.",
      "imDbRating": "8.0",
      "imDbRatingCount": "3780"
    },
    {
      "id": "tt0749418",
      "seasonNumber": "3",
      "episodeNumber": "2",
      "title": "All Due Respect",
      "image": "https://m.media-amazon.com/images/M/MV5BYjZjMGIzOTctOTg3My00NDNhLWFjOWQtZjJlNGVjMzU2ZjQ0XkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "26 Sep. 2004",
      "plot": "Omar continues his bold strikes on the heavily guarded Barksdale stash houses. McNulty launches his own investigation into last year's prison suicide of D'Angelo Barksdale. On the streets the bloodbath continues, prompting Burrell and Rawls to jack up the heat on their district commanders. The street violence also presents Daniels with a tough decision. A beleaguered Cutty tries to get his life back on track.",
      "imDbRating": "8.3",
      "imDbRatingCount": "3710"
    },
    {
      "id": "tt0749426",
      "seasonNumber": "3",
      "episodeNumber": "3",
      "title": "Dead Soldiers",
      "image": "https://m.media-amazon.com/images/M/MV5BMTRhZDk0NTYtNTQ4Yi00ZGE3LWE0YWYtOTk3MjY2MGIxMTQ0XkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "3 Oct. 2004",
      "plot": "The brutality at police headquarters continues over the perceived failure of department commanders to rein in the city's crime stats. Another hit by Omar on the Barksdale stash houses goes horribly wrong. Proposition Joe summons Stringer Bell to a meeting and tells him that the cops have screwed up. Daniels reassigns his detail after the wire on Stringer Bell goes dead.",
      "imDbRating": "8.4",
      "imDbRatingCount": "3709"
    },
    {
      "id": "tt0749420",
      "seasonNumber": "3",
      "episodeNumber": "4",
      "title": "Amsterdam",
      "image": "https://m.media-amazon.com/images/M/MV5BMGNjYTQyOGUtZjg5ZC00MDIyLWFhMzgtYTFjMGVmNDU2ZGYxXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "10 Oct. 2004",
      "plot": "Greggs and McNulty recruit Bubbles to gather street intelligence on the Barksdale gang. Cutty seeks out the Barksdale gang after he loses his taste for the straight life. Bunk feels the pressure to find Dozerman's gun. Daniels worries that Avon Barksdale, having cut a prison deal, will be paroled. Stringer Bell tries to make amends with Donette.",
      "imDbRating": "8.4",
      "imDbRatingCount": "3677"
    },
    {
      "id": "tt0749444",
      "seasonNumber": "3",
      "episodeNumber": "5",
      "title": "Straight and True",
      "image": "https://m.media-amazon.com/images/M/MV5BMzg1NjJiYjMtZGJkYi00YTI1LWEwMjQtN2YxMjQwNmE0OTNmXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "17 Oct. 2004",
      "plot": "Johnny pressures Bubbles to stop snitching for the detail. Cutty lies to his grandmother about going straight. McNulty realizes pursuing Barksdale and Bell is a losing cause, so he turns his attention to nailing Kintel Williamson. Colvin's free drug dealing zone, now known in the streets as Hamsterdam, scores a small victory. Avon Barksdale emerges from prison to a warm welcome from Stringer Bell.",
      "imDbRating": "8.5",
      "imDbRatingCount": "3671"
    },
    {
      "id": "tt0749431",
      "seasonNumber": "3",
      "episodeNumber": "6",
      "title": "Homecoming",
      "image": "https://m.media-amazon.com/images/M/MV5BMGJiMWFlOTUtOWIwZS00ZDUxLWEwZjQtZjUxMmNjN2M3NGQ0XkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "31 Oct. 2004",
      "plot": "Major Colvin instructs his men to use brute force to get the message out to street dealers about his free zone. Avon Barksdale and Stringer Bell discover that real estate development has its own pitfalls. McNulty and Greggs ask Daniels to let them renew the Bell and Barksdale investigation. On Barksdale's orders, Cutty plans to take back corners from Marlo's crew.",
      "imDbRating": "8.6",
      "imDbRatingCount": "3661"
    },
    {
      "id": "tt0749421",
      "seasonNumber": "3",
      "episodeNumber": "7",
      "title": "Back Burners",
      "image": "https://m.media-amazon.com/images/M/MV5BODg3M2U1MzgtOTQwZC00MGFmLWI4ZDAtODcxNjUwN2RhMDdkXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "7 Nov. 2004",
      "plot": "Daniels goes ballistic when the detail gets reassigned to the Western District. Stringer Bell learns from Donette that Brianna is thinking about talking to McNulty. Bunk receives a gift wrapped surprise. A single cell phone allows Freamon to begin mapping out a communications network for the Barksdale organization. Marlo dispatches a drive-by on a Barksdale drug corner.",
      "imDbRating": "8.5",
      "imDbRatingCount": "3589"
    },
    {
      "id": "tt0749436",
      "seasonNumber": "3",
      "episodeNumber": "8",
      "title": "Moral Midgetry",
      "image": "https://m.media-amazon.com/images/M/MV5BYThmNDhmN2UtYTA3NC00NmRkLWE3MTItOTViZWVmOWUzYjU3XkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "14 Nov. 2004",
      "plot": "Prez impresses the detail with what he's found out from Bodie's cell phone, information that sends McNulty and Greggs on a road trip. Colvin sees the benefits of his plan working. Carcetti confronts a hurdle he must clear if he wants to run for higher office, while Marlo appears to take the bait set by the Barksdale crew.",
      "imDbRating": "8.9",
      "imDbRatingCount": "3960"
    },
    {
      "id": "tt0749442",
      "seasonNumber": "3",
      "episodeNumber": "9",
      "title": "Slapstick",
      "image": "https://m.media-amazon.com/images/M/MV5BYmYxZjg1MzYtZDgzYy00MzM0LTljYmEtMGMxYmFkZTAxM2UwXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "21 Nov. 2004",
      "plot": "Responding to an officer's call for help, McNulty and Prez turn up the wrong alley with unanticipated results. Cutty is surprised to find help from within Baltimore's power structure for his proposed boxing gym. Omar decides to go it alone against Avon Barksdale and Stringer Bell. Bubbles is wired up and sent into Hamsterdam",
      "imDbRating": "8.7",
      "imDbRatingCount": "3697"
    },
    {
      "id": "tt0749440",
      "seasonNumber": "3",
      "episodeNumber": "10",
      "title": "Reformation",
      "image": "https://m.media-amazon.com/images/M/MV5BZmVmYWI3OWItMjc4Zi00NWQyLWFmZDQtZjQ4YjgyNDg0NmEzXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "28 Nov. 2004",
      "plot": "Brother Mouzone returns to Baltimore on a mission of revenge and casts a wide net in his search for Omar. Colvin manages to put off a Sun reporter inquiring about Amsterdam. Pearlman and Daniels plead their case for a new kind of wiretap. Stringer Bell falls out of the loop with Avon Barksdale, while Marlo raises the stakes against the Barksdale gang.",
      "imDbRating": "8.7",
      "imDbRatingCount": "3699"
    },
    {
      "id": "tt0749434",
      "seasonNumber": "3",
      "episodeNumber": "11",
      "title": "Middle Ground",
      "image": "https://m.media-amazon.com/images/M/MV5BOTM0YmViZTUtNWZjMC00YWVjLWI2NTQtNDc3OTFkZjU5N2UyXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "12 Dec. 2004",
      "plot": "The wire begins to yield information about the Barksdale organization. Stringer and Avon reminisce on how far they have come. McNulty finds the way to a key piece of the puzzle in an unlikely place. Awaiting his fate, Colvin works behind the scenes to shape the outcome of Amsterdam, while protecting his men from possible repercussions. Bubbles considers a new partner.",
      "imDbRating": "9.6",
      "imDbRatingCount": "6113"
    },
    {
      "id": "tt0749435",
      "seasonNumber": "3",
      "episodeNumber": "12",
      "title": "Mission Accomplished",
      "image": "https://m.media-amazon.com/images/M/MV5BM2YwZmVkMDYtZTdiMi00MmFjLTk2ODAtMjc5ZTlhYWUyYWVkXkEyXkFqcGdeQXVyNTgyNDM1OTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "19 Dec. 2004",
      "plot": "Avon readies his troops for a seemingly endless war against Marlo. The detail works towards the top rungs of the Barksdale organization with the information garnered from the wire. While Royce continues to grapple with Amsterdam, Burrell offers a deal to minimize the fallout. Carcetti's political plans become obvious to his friend and fellow councilman Tony Gray. Bubbles offers his view of the world. McNulty changes tack.",
      "imDbRating": "9.3",
      "imDbRatingCount": "4625"
    }
  ],
  "errorMessage": ""
}