{
  "imDbId": "tt0163507",
  "title": "Whose Line Is It Anyway?",
  "fullTitle": "Whose Line Is It Anyway? (TV Series 1998–2007)",
  "type": "TVSeries",
  "year": "1998",
  "items": [
    {
      "username": "Op_Prime",
      "userUrl": "https://www.imdb.com/user/ur0199296",
      "reviewLink": "https://www.imdb.com/review/rw0570522",
      "warningSpoilers": false,
      "date": "29 February 2000",
      "rate": "",
      "helpful": "64 out of 71 found this helpful.",
      "title": "Whose Line rocks",
      "content": "This show is great and so much more hilarious than so many sitcoms on ABC and other networks. Drew Carey is a pretty good host. Maybe not as good as Clive Anderson but he's still funny and does an okay job. Some may disagree with me but I think the best performers on this show are without a doubt: Ryan Stiles, Colin Mochrie, Greg Proops, Wayne Brady, Brad Sherwood, Chip Esten and Josie Lawrence. The best games, I think, are: \"Props\", \"Questions only\", \"Scenes from a hat\", and \"Hoedown\". What's great about this show is how the performers are not afraid of looking stupid and just do crazy things at random times in the show. This show is a winner."
    },
    {
      "username": "TOMNEL",
      "userUrl": "https://www.imdb.com/user/ur4195782",
      "reviewLink": "https://www.imdb.com/review/rw1772747",
      "warningSpoilers": false,
      "date": "1 December 2007",
      "rate": "10",
      "helpful": "21 out of 22 found this helpful.",
      "title": "Very talented people make a hilarious show.",
      "content": "\"Whose Line is it Anyway?\" is an Americanized version of an English show with a new host and some of the same cast, and it is downright hilarious. Drew Carrey is an excellent host, and even though he is no where near as comically talented as the improv actors, he is still funny, and doesn't take himself seriously, so seems very likable. The improv actors are all talented in their own ways. Wayne Brady is excellent at singing, and is better working by himself, or with one of the rotation guests. Ryan Stiles and Colin Mochrie are hilarious together because of their dry sarcasm. Even when they mess up it's funny, because they brilliantly cover it up and joke about it. If you watch one improvisational comedy show, this should be it!My rating: **** out of ****. 30 mins."
    },
    {
      "username": "unbend_5440",
      "userUrl": "https://www.imdb.com/user/ur1241749",
      "reviewLink": "https://www.imdb.com/review/rw0570575",
      "warningSpoilers": false,
      "date": "2 April 2004",
      "rate": "",
      "helpful": "66 out of 70 found this helpful.",
      "title": "5 times a week is not enough",
      "content": "Sitcoms get repetitive and boring. Comedy movies are repetitive and boring. Saturday Night Live is.......... sad and pathetic. The one show that can make me laugh on a regular basis, the one show I never get sick of, the one show that's always original because it's the whole concept of the show is WHOSE LINE IS IT ANYWAY? I watch this 5 times a week. I have hours worth of episodes on tape. That's not enough. Colin Mochrie may very well be the funniest man alive. He's on like 12 different TV shows here in Canada. That's not good enough. There's no replacement for what Whose Line offered. Since I believe it was the peak of comedy television, and it's off the air now, I can only conclude that the world will soon become very unfunny and I will probably die a depressed and empty man. Unless.......... ABC stops wasting our time with \"The Bachelor\", \"The Bachelorette\", and probably soon to be made \"The Bachelor: The Senior Citizen Edition\"! Get a decent show like Whose Line back on so I won't die depressed and unfulfilled with my human existence! Here for your reading pleasure is a run down of my favourite all-time Whose Line moments.PARTY QUIRKS: Where Ryan was playing Carol Channing and his head was supposed to get stuck to things. He dragged himself over to Drew's desk and accidentally smashed his head on the front, breaking the glass covering to the neon light thing.HATS: When they were doing the World's Worst Dating service video. Colin puts on a motorcycle helmet, and all he says is \"Hi, I'm Eric Estrada.\"RYAN doing an impression of John Wayne and Scooby Doo at the same time.DREW in 3 Headed Broadway Star. They're supposed to sing one word at a time, and Drew suddenly goes \"And take me on a......\" in a very enthusiastic voice.WAYNE BRADY grabbing a girl from out of the audience and accidentally pulling up her dress.NEWS FLASH: Colin was standing in front of the screen showing clips of HIMSELF. Without realizing what was on the screen, he then utters the line \"It all started with a poorly timed Bald Joke\"."
    },
    {
      "username": "RueMorgue",
      "userUrl": "https://www.imdb.com/user/ur0476267",
      "reviewLink": "https://www.imdb.com/review/rw0570527",
      "warningSpoilers": false,
      "date": "31 May 2000",
      "rate": "",
      "helpful": "44 out of 46 found this helpful.",
      "title": "A New and Updated Version of a Classic",
      "content": "This is the American version of the original British improvisation show, with many recognizable faces from the first series. Drew Carey is the most recent host, and he does a good job, but nobody can do it like Clive Anderson once did. Apparently, Anderson has returned here as an occasional host, but I have yet to see him on the re-runs, something that I am looking forward to.Ryan Stiles and Colin Mochrie, both of whom made the original show very entertaining in the latter years, have returned here to once again amaze and entertain with their on-the-spot comedy. As well, Wayne Brady has been added to the cast, and he is a heavy-hitter, especially when it comes to making up songs on the spot. Often pairing with Brad Sherwood or Chip Esten, his musical/comedic talents are second to none. Other past contestants such as Josie Lawrence and Greg Proops can be seen on some nights, which is a welcome gesture to fans of the show's older cousin.Once again, the comedic talents of all the contestants are simply amazing, as they make up skits on the spot. Many of the games from the original version of the show have been kept, with the addition of some new ones that maintain originality. Much of the show's format remains the same, which is excellent, but unfortunately, the show is kept more mainstream by the American censors, as the original show contained more off-colour humour, and even some profanity, which added to the show in general. Despite this fact, the new WLiiA rises above many of the other comedy shows on national television.My Rating: 10/10"
    },
    {
      "username": "JBoze313",
      "userUrl": "https://www.imdb.com/user/ur0220011",
      "reviewLink": "https://www.imdb.com/review/rw0570534",
      "warningSpoilers": false,
      "date": "28 September 2000",
      "rate": "",
      "helpful": "44 out of 51 found this helpful.",
      "title": "How do they do this?!",
      "content": "This show is just amazing. I think it's one of the funniest shows on t.v. I have seen many of the episode of the British version, and I'd say both are funny in their own ways. A lot of jokes on the British version are things you might expect to see from those crazy Brits, but that makes it all the better. My two favorite guys on the show would definitely have to be Ryan Stiles, who is on both versions, and Colin Mochorie? I should probably look back on the main page to spell his name right, but I'm lazy! When it comes to making up songs, and really good ones at that, the best is definitely Wayne, who never stops amazing me. These guys are all hilarious and they have so much talent, it isn't funny. It's a great show, and I hope it stays on for decades...give or take a few years."
    },
    {
      "username": "Smells_Like_Cheese",
      "userUrl": "https://www.imdb.com/user/ur1293485",
      "reviewLink": "https://www.imdb.com/review/rw0570574",
      "warningSpoilers": false,
      "date": "2 April 2004",
      "rate": "",
      "helpful": "31 out of 37 found this helpful.",
      "title": "One of the funniest shows ever created",
      "content": "Now, I'm not just saying this to prefer or anything, but I always did enjoy the US version of WLIIA better than the UK. Both are hysterical. But I saw the US version first and started watching the UK episodes, and they are funny, but the US version always got me in tears.This show is beyond hilarious. Without scripts, 4 performers entertain through imprave. With fun games, suggestions from the audience, and a fun host this show should be watched. I lost track of it for a while until I found out that it's on ABC family at night. And I'm still on the floors crying from laughter. This is without a doubt one of the funniest shows I have ever seen in my life. Watch it!"
    },
    {
      "username": "theguys1",
      "userUrl": "https://www.imdb.com/user/ur3724407",
      "reviewLink": "https://www.imdb.com/review/rw1110425",
      "warningSpoilers": false,
      "date": "24 June 2005",
      "rate": "",
      "helpful": "30 out of 33 found this helpful.",
      "title": "this is the funniest TV show ever",
      "content": "I watch Whose Line Is It Anyway? every night at 10 and it is fantastic and original. I don't care if they show the same episodes all the time, they just never get old. This is one of my favorite game shows, mainly because it's improvising and it's actually funny. As I hope everyone does, I have a list of my favorite games on this show like: News Flash, Let's Make a Date, Hoe Down, Weird Newscasters, Hollywood Directors, Scenes From a Hat, and many others. Trust me, this show is a real treat that will keep you laughing the entire half-an-hour you're watching it. Personally, my favorite actor on that show is Ryan Stiles, and I give the show 1,000 points. 10/10* This is TV's best show!"
    },
    {
      "username": "clorby",
      "userUrl": "https://www.imdb.com/user/ur3074473",
      "reviewLink": "https://www.imdb.com/review/rw0570573",
      "warningSpoilers": false,
      "date": "25 February 2004",
      "rate": "",
      "helpful": "64 out of 69 found this helpful.",
      "title": "Funny, no matter how many times I see them",
      "content": "This show is absolutely hilarious!! No matter how many times I see the episodes, i laugh as hard as if I had never seen it. I love improve, and i now like to go watch a local improve group in a town nearby where i live because of Whose Line. I love the show partially because I can act along, I think of things I would do if I were on the show. My family joins in too, we watch it whenever it is on. I think it takes a lot of humor and talent to think up these things. Plus the way Colin Mockery says lines in some of the games it seems like he has all of the one-liners planned, because they are so perfect and intricate. Which makes him all the funnier, because he says this long line and it all leads up to a simple, funny punch line.So I do believe this to be a great comedy game show. It is probably for the adult viewing audiance though because of it's content and some language sometimes. It is called a game show, but they make it clear in the beginning that the points are worthless, or are they?"
    },
    {
      "username": "flight_angel77",
      "userUrl": "https://www.imdb.com/user/ur3677848",
      "reviewLink": "https://www.imdb.com/review/rw1046688",
      "warningSpoilers": false,
      "date": "25 March 2005",
      "rate": "",
      "helpful": "36 out of 40 found this helpful.",
      "title": "The only show that truly makes me laugh",
      "content": "I have been a fan of Whose Line? since forever, and I'm am so relieved that they are coming back for another season. I've always favored the Amercian version over the British version, only because it is more current and has more American humor. I do however miss some of the old pros like Mike Mcshayne and Tony Slattery. I'm torn between the hosts Drew Carey and Clive Anderson, but for now, I think Drew is holding up nicely. Anyway, Whose Line? is the only show that ever really made me cry from laughter. I love the colorful cast and the clever yet random humor. What I love most about it is the concept of a bunch of friends doing old fashion improv and having a good time just being dumb and random.Whose Line is it Anyway? is totally worth watching for comedy lovers all around."
    },
    {
      "username": "Michele_with_one_L",
      "userUrl": "https://www.imdb.com/user/ur20196927",
      "reviewLink": "https://www.imdb.com/review/rw1980606",
      "warningSpoilers": false,
      "date": "25 November 2008",
      "rate": "10",
      "helpful": "26 out of 28 found this helpful.",
      "title": "Perfection!",
      "content": "Whose Line Is It Anyway? is perfection. No matter what the scene is and no matter the how bad and offtrack it goes, the entire cast put 100 per cent of their creativity into it to make it absolutely hilarious! A special mention has to go, obviously, to Colin Mochrie (my personal favorite) and Ryan Stiles. They are the best comedy duo I have ever seen. As best friends, they take nothing seriously and never hesitate to insult each other (various bald jokes and big nose quirks are aplenty!) and host Drew Carey. And it's especially hilarious how annoyed Ryan gets with the Hoe Down's - by far the best game ever. Oh, and Colin's impressions also get a shout-out...plainly because he can't do any. But don't worry Colin, we love you still the same!They brought improv comedy to the mass attention of the world and it's been ablaze ever since.So massive congratulations and ongoing thank you's go to this remarkably talented cast and for their great effort at making the world a funnier and happier place! BRING BACK WHOSE LINE IS IT ANWAY?!"
    },
    {
      "username": "Xophianic",
      "userUrl": "https://www.imdb.com/user/ur0097753",
      "reviewLink": "https://www.imdb.com/review/rw0570518",
      "warningSpoilers": false,
      "date": "15 February 2000",
      "rate": "",
      "helpful": "14 out of 21 found this helpful.",
      "title": "Just as good as the British version, in some ways better",
      "content": "I love comedy, and WHOSE LINE IS IT ANYWAY? is without a doubt the best comedy show on TV right now. I love this show a lot, it's even inspired me to practice improv comedy on my own. I also watch the British version on Comedy Central. It's good, but I like this version a little better. This is probably because I prefer American comedy over British comedy. I'll take SATURDAY NIGHT LIVE over MONTY PYTHON anyday.Drew Carey is a fairly good host, although most of his jokes really don't work, and the ones that do are obviously prepared before hand and he tends to use over and over. But Clive was a lot like this too, even though he was much wittier than Drew is.Part of the reason that the American version is better is because most of the best performers from the British version are back in this version, such as Ryan Stiles, Colin Mochrie, Greg Proops and Josie Lawrence. It's a shame that we're missing such greats as Tony Slattery and Mike McShane, though. A lot of the other performers on the British version weren't so good, but the American version has had their share of bad performers (Karen Maruyama, Kathy Kinney). There are also some fresh new faces that are really good, like Kathryn Greenwood, Denny Siegel, Greg Proops and Wayne Brady.The set is also a lot cooler looking on the American version and Laura Hall is a better musician than Richard Vranch. One thing the British version has that is better is the randomness. Even though I prefer Colin and Ryan being in every episode, I don't like how it's often the same four guys over and over and wish we could get some new people, or show some of the others more often. For the record, my favorite performer is Colin Mochrie, my favorite hodown is \"Going Bald\" and my favorite game is \"Whose Line\". I love this show, and hope it lasts for a long, long time."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2876718",
      "warningSpoilers": false,
      "date": "27 September 2013",
      "rate": "8",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Great fun but got repetitive",
      "content": "Drew Carey is the host of this 'game' where the audience picks the style and the story that the four 'contestants' must improvise a skit from. The contestants are usually quick minded comedians. The usual suspects are Colin Mochrie, Ryan Stiles, and Wayne Brady with sometimes a guest trying to keep up.This has great fun, and originality at the start. It was truly laugh out loud. After a couple of seasons, the games get repetitive. There's only so many games they had to play with. But it's asking too much to keep it fresh all the time. They do have guest stars once in awhile, but they're usually ineffective."
    },
    {
      "username": "safenoe",
      "userUrl": "https://www.imdb.com/user/ur34307814",
      "reviewLink": "https://www.imdb.com/review/rw7586902",
      "warningSpoilers": true,
      "date": "26 November 2021",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "This show matters",
      "content": "The points may not matter, but this show does very much, and I love it! Drew Carey was the perfect host and it's a shame he doesn't make cameo appearances in the reboot. Still, I love catching up on clips online, for example the \"If you know what I mean\" and scenes from a hat."
    },
    {
      "username": "Angelus2",
      "userUrl": "https://www.imdb.com/user/ur8131454",
      "reviewLink": "https://www.imdb.com/review/rw1843760",
      "warningSpoilers": true,
      "date": "21 March 2008",
      "rate": "10",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Will definitely put a smile on your face !",
      "content": "This show is unlike many other comedy shows. Its takes simple games from theatre studies and places real comedians. I first caught this show when I was flicking through channels and since then I have become a addict. The performers play off each other beautifully and have some great ideas and keep making the audience laugh out loud, literally;Drew Carrey is sometimes annoying. But he was in the original so I guess its natural to have him apart of this show.Colin is simply hilarious, he is quick witted and makes the audience laugh with the simplest of things. Ryan is my favourite he is just as funny as Colin but he has his moments with physical theatre. Wayne. Wayne is a genius simply put. He can improvise anything into a song and knows how to make the crowd laugh. Special guests which are my favourite are, Chip who is extremely lovable. Jeff does a mean impression of Christopher Walken, Brad is funny while Greg is very funny with the Superhero games. It always keeps me smiling."
    },
    {
      "username": "I_Am_The_Taylrus",
      "userUrl": "https://www.imdb.com/user/ur11934874",
      "reviewLink": "https://www.imdb.com/review/rw1732463",
      "warningSpoilers": true,
      "date": "18 September 2007",
      "rate": "10",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Definitely One Of The Greatest Shows Ever (SPOILERS)",
      "content": "SPOILERSI mean, how could you hate Whose Line Is It Anyway? It was one of the funniest shows ever, and Ryan Stiles, Greg Proops, Wayne Brady, Colin Mochrie, Drew Carey, and everyone else on this show are truly amazing and talented. I prefer this one over the British version, but that version is still fantastic, too. The games in this show are great, too. Greatest Hits could get annoying and overdone at times, but Film, Television, Theater Styles, Scenes From a Hat, Whose Line, Hoedown, Props, are terrific. The list of good games could go on and on.Here is the basis of Whose Line Is It Anyway? A group of comedians have to play games with help from the audience. However, everything is totally ad-libbed, so they have to do the best they can to improv. The host Drew Carey then decides who won the episode after all the games and the winner gets to sit back and relax as the rest do something like Hoedown or Props.Overall, this is definitely in my top five favorite television shows of all time. Why was it canceled? The concept was so simple, and yet so elaborate at the same time. This was an incredible show to watch. It was so bright, so witty, and if you watch one episode, you would never want to miss another one. Anyway, this is a fantastic show that you must see.10/10 Recommended Shows: Thank God You're Here"
    },
    {
      "username": "CrassActionHero",
      "userUrl": "https://www.imdb.com/user/ur11358081",
      "reviewLink": "https://www.imdb.com/review/rw1614212",
      "warningSpoilers": false,
      "date": "9 March 2007",
      "rate": "2",
      "helpful": "7 out of 20 found this helpful.",
      "title": "A Shadow Of The Original Series",
      "content": "Whose Line is it anyway?(1998) Review: I loved The original series. It was uncensored, witty, fresh and downright hilarious. Now, Whose Line goes Hollywood. Here's my take:Let me start off with the improvisers in seat order:Seat #1: The seat-filler comic. This one is named that for a reason. This seat is normally taken by improvisers who have little to no talent. They barely lift a finger throughout the show and are insignificant. Or it is filled by Chip Esten who is no different. The only exception here is it is rarely filled by Greg Proops. Greg is funny. He still has got it. He is one of the few that does deliver the goods, but is starting to show some rust. Remember, he is rarely here.Seat #2 Wayne Brady. Wayne is different. He is however not a improviser. Wayne is here to pretty much sing and show off. He has single handedly butchered Song styles. It's the same thing every time. Every time! The original Whose Line's Song styles had songs about such mundane things such as dog poop to a bag of chips. That's what improv is about! Not the same love song EVERY time. This is Whose Line, not American Idol! Wayne does have tons of charisma, but improv is not his style.Seat #3 Colin. Colin is a Whose line alumni. He was awesome during the British version, but here is still funny, but is showing lots of rust. Every once in a while, he would use some stuff from the original whose line. Other times it just is not funny. He still has lots of energy and can deliver some laughs, he is a shadow of his former self. He not awful at all, just washed up. He does get a little old after a while.Seat #4 Ryan Styles. Ryan is another Whose Line alumni. However see Colin for pretty much the same thing. Only difference is Colin has more energy, and is a little more funny.More: We hardly see any of the old school games. Also, the new Whose Line has butchered \"Questions Only\". Instead of just the original of just asking questions, we get additions such as \"impressions\". You ask a question while impersonating someone. 99% of the time, I do not know who they are until Wayne Brady does his Scooby Doo(which he does every time during this game). Hideous.Drew Carey is another problem. He is not a good host. His host power is not there. Clive had wit and charm. Drew is wooden and lame. Drew should also learn that improv is not as easy as it looks. Drew at the end decides to partake in the improv 90% of the time replacing the seat filler comic. Drew is TERRIBLE at improv. He has not wit, no comedic charisma, and a terrible delivery. Clive Anderson knew he was not a improviser so he stayed as host. Drew should do the same.And lastly, Josie Lawrence made a special appearance here. It was nice till during her improv she cursed. Just then Drew stopped her act and said that you can't do that here. In the British version, anything goes and you can get away with anything you say, here you cannot. This show has restrictions. The original did not.One more thing, I HATE the Irish drinking song. Annoying is just the start of this. It gets worse if Drew Carey gets involved. (cold shiver goes up my spine) The Last Word: Desecration. Whose Line went Hollywood. What a damn mistake. The comedy is watered down. The antics are sometimes lame to re-used. Drew Carey is a terrible host, and the show has restrictions. What was once great has fallen so far. Ignore this. Stick to the original series instead."
    },
    {
      "username": "Siloty",
      "userUrl": "https://www.imdb.com/user/ur18200502",
      "reviewLink": "https://www.imdb.com/review/rw1894848",
      "warningSpoilers": false,
      "date": "18 June 2008",
      "rate": "10",
      "helpful": "1 out of 1 found this helpful.",
      "title": "always funny, never a let down",
      "content": "i used to flick through on foxtel and would see the name of this show pop up on the guide and i used to always change channel without giving it a chance. and then one time i sat and watched a 5 episode back-to-back thing and i absolutely cracked up with laughter. my dad and i are great fans of the show and would often be brought to tears by laughing so much.i find it hard to pick a favourite. Ryan Stiles, Colin Mochrie, Wayne Brady, Drew Carey (can be quite funny at times), and the regular guests as the fourth person. like Brad Sherwood, Greg Proops, Kathryn Greenwood. these guys are a bunch of geniuses at improv.i often enjoyed how there would be one main thing of the episode (like one of Colin's many colourful shirts, or one of Ryan's very interesting pair of shoes, or even a stuff up) and would often refer to those things in another sketch, putting it in somewhere.this show i found was always funny and even episodes i had already seen, i still found funny.remember, the points don't matter"
    },
    {
      "username": "heirman_steven",
      "userUrl": "https://www.imdb.com/user/ur54534710",
      "reviewLink": "https://www.imdb.com/review/rw7063011",
      "warningSpoilers": true,
      "date": "25 June 2021",
      "rate": "8",
      "helpful": "1 out of 1 found this helpful.",
      "title": "As a non american i love this show",
      "content": "I remember i got videos recommend on youtube from Whose line and i started watching them i loved it From making fun of colin being bald To messing with drew to ryan stiles his shoes. Then later i got recommend videos from whos line with.aisha tyler And this where i stopped watching whos line videos I loved drew as the host I found aisha tyler just boring as the show host."
    },
    {
      "username": "Monika-5",
      "userUrl": "https://www.imdb.com/user/ur0220605",
      "reviewLink": "https://www.imdb.com/review/rw0570508",
      "warningSpoilers": false,
      "date": "12 August 1999",
      "rate": "",
      "helpful": "2 out of 4 found this helpful.",
      "title": "Best comedy show there is",
      "content": "I love this show. Usually after an episode ends I'm in tears because I've been laughing so much. I love the \"Weird Newscasters\" skit, \"News Flash\", \"Party Quirks\", and anything that has to do with music.I've had the great pleasure of meeting Colin Mochrie. He is the most down-to-earth, nicest celebrity you will ever meet. Everyone on the show does a great, side-splitting job!!!"
    },
    {
      "username": "Catherine_Grace_Zeh",
      "userUrl": "https://www.imdb.com/user/ur2095936",
      "reviewLink": "https://www.imdb.com/review/rw1431254",
      "warningSpoilers": false,
      "date": "26 July 2006",
      "rate": "9",
      "helpful": "1 out of 2 found this helpful.",
      "title": "Absolutely freakin' hilarious ABC classic!",
      "content": "\"WHOSE LINE IS IT ANYWAY?,\" in my opinion, is an absolutely freakin' hilarious ABC classic! I haven't seen every episode, but I still enjoyed it. It's hard to say which game was my favorite. I said that because they're all really funny, especially Irish Drinking Song, Greatest Hits, and Hoedown. However, I think it was always funny when they did skits or whatnot. I always laughed at that. It was all that everyone stayed with the show throughout its entire run. Everyone always gave a good performance, the episodes were funny, and the writing was always very strong. In conclusion, I hope it stays on FOX Family Channel for fans of the show to see for a long time."
    },
    {
      "username": "yearspew",
      "userUrl": "https://www.imdb.com/user/ur4374919",
      "reviewLink": "https://www.imdb.com/review/rw1896981",
      "warningSpoilers": false,
      "date": "21 June 2008",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "One of the funniest shows ever put on screen.",
      "content": "Wildly original, laugh-out-loud funny, impressing performances. That and more is Whose Line Is It Anyway?I started watching this show around 2001 and been loving it ever since. I didn't know much about improv comedy before watching this and was pleasantly surprised afterwards.Ryan Stiles, Colin Mochrie, Wayne Brady, Greg Proops, Brad Sherwood, Chip Esten, Jeff Davis and more are the people who have to act out scenes using improvisation as their only tool. It's great to see a show that manages to be so creative and funny at the same time and allowing the performers to show their wide abilities. Whether it's Ryan playing a foal being born, Colin playing a man being gradually eaten by ants, or Wayne and Jeff singing an opera about motorcycles, this show has it all.Hosted by Drew Carey, who does a good job of interacting with the performers and even participating in a skit at the end. He's not that good at improv, but one of the great things about Whose Line is that even when the performers can't entirely handle a game (like Colin in If You Know What I Mean) it's hilarious as well.So, get ready for some of the best material that comedy has to offer. Tapioca!"
    },
    {
      "username": "kclambeth",
      "userUrl": "https://www.imdb.com/user/ur15080916",
      "reviewLink": "https://www.imdb.com/review/rw1815998",
      "warningSpoilers": false,
      "date": "8 February 2008",
      "rate": "5",
      "helpful": "3 out of 7 found this helpful.",
      "title": "Could have been a lot better...and should have had a good host.",
      "content": "I don't hate this programme despite my score of 5 but it is one of those shows that has good and bad points.Of course i am a huge fan of the British original version but i do think it's good that they made it in America for a new audience. This version provides some laughs but i don't find myself having to watch every episode like i do with the British one.OK firstly the good points- Ryan and Colin are as funny as ever and are a great team, they are very talented improvisers and are clearly pros.Any appearance of Greg Proops is a definite advantage (although he gets less to do in this version).Good games like Greatest hits and party quirks are always filled with laughs.OK, the not so good points- In my opinion far too many songs games, i love music but there was far too much and it was always Wayne Brady (sure, he's a very good singer but sometimes it's funnier to have a not so good singer) There isn't a rotation of the players, it was Ryan, Colin and Wayne every single episode with usually either Greg, Brad or Chip as the other guest which became hugely repetitive. The same people did the same games and the guest player always had to be the host of the party or the guesser.There were no guests from the original series apart from Josie Lawrence once. The best thing about the original is the players being from Britain, America, Canada and more.There was no Tony Slattery (the best player ever).The bad point- Drew Carey, i'm sorry but he is the most unfunny man ever, i don't get his appeal at all. My family and I almost press mute every time he speaks, in fact the show would be a lot funnier if he weren't involved. There is something so smug about him and when he joins in i cringe as he is usually terrible.I think this programme could have been a lot funnier considering the talent of the performers but it almost feels too polished a lot of the time. Colin in fact is the main reason i watch it and if he wasn't on it, it would probably put me off."
    },
    {
      "username": "angelorwez",
      "userUrl": "https://www.imdb.com/user/ur150272282",
      "reviewLink": "https://www.imdb.com/review/rw8107869",
      "warningSpoilers": false,
      "date": "1 May 2022",
      "rate": "10",
      "helpful": "1 out of 2 found this helpful.",
      "title": "extremely phenomenal",
      "content": "I didn't think it would this good...i had doubts..I've seen both the original and the rebooted one....aisha seems like a perfect host...but drew was waay better...which is funny coz he did mostly nothing...it's creative intelligent and i wouldn't change anything about it...some Jokes of course fly over my head...but when they land...damn it they land!"
    },
    {
      "username": "Bill21",
      "userUrl": "https://www.imdb.com/user/ur0328632",
      "reviewLink": "https://www.imdb.com/review/rw0570509",
      "warningSpoilers": false,
      "date": "16 September 1999",
      "rate": "",
      "helpful": "2 out of 3 found this helpful.",
      "title": "Funny, but not as good as the British one",
      "content": "This version has Colin Mochrie, Ryan Stiles, Greg Proops (sometimes) and that's about all it has in common with the true spirit of the superior British version. Anyone who has seen the British version knows that host Clive Anderson's sense of humor was much more subtle (and funny) than Drew Carey, who is just not funny enough to sit at the adults' table on this show. (Most annoyingly, every week he says, \"It's the show where everything's made up and the points don't matter!\" and then looks around for laughter/applause and only gets a mocking laugh from Ryan Stiles. Clive would say \"I'm going to give Ryan a million points...\" and move on.. much funnier. Note to Drew: it's funnier when you don't laugh at yourself.)The cast is terrific. Ryan Stiles is an improvisational genius, and he and Colin Mochrie have a great working chemistry together. The other members are hits and misses (usually pretty competent). The real find is Wayne Brady who is very talented, although he seems to be more of a performer than a true comedian. Still, he seems to bring out the most highlights because of his clever songs and characterizations.The American \"Who's line...\" pales in comparison in two major regards. The first is that it seems to rely on non-obscure pop culture references (like when the usually funny Greg Proops put on a blond wig and said \"My name is Mimi, and i just hate that Drew Carey!\" Semi-humorous as a reference to the Drew Carey show, but not more than that). The other downfall is the absence of the inimitable Tony Slattery, the straightlaced psycho of the English show. \"Who's line...\" is a fun show, but it lacks the wit, the edge and the out-loud laughter of the original... but if you've never seen the original, then you wouldn't care, would you?"
    }
  ],
  "errorMessage": ""
}