{
  "imDbId": "tt0163507",
  "title": "Whose Line Is It Anyway?",
  "fullTitle": "Whose Line Is It Anyway? (TV Series 1998–2007)",
  "type": "TVSeries",
  "year": "1998",
  "language": "en",
  "titleInLanguage": "Whose Line Is It Anyway? (American TV series)",
  "url": "https://en.wikipedia.org/wiki/Whose_Line_Is_It_Anyway%3F_(American_TV_series)",
  "plotShort": {
    "plainText": "Whose Line Is It Anyway? (sometimes shortened to Whose Line? or WLIIA) is an American improvisational comedy television series, and is an adaptation of the British series of the same name. It originally aired on ABC and ABC Family from August 5, 1998 to December 15, 2007, hosted by Drew Carey. A revival of the show, hosted by Aisha Tyler, began airing on The CW on July 16, 2013.\r\nThe series features Ryan Stiles, Colin Mochrie, and Wayne Brady as its regular performers with the fourth seat occupied by a guest panelist. Performers are sometimes assisted by another guest star.\r\nThe nineteenth season premiered in October 2022, and the twentieth season premiered in March 2023.",
    "html": "<p>Whose Line Is It Anyway? (sometimes shortened to Whose Line? or WLIIA) is an American improvisational comedy television series, and is an adaptation of the British series of the same name. It originally aired on ABC and ABC Family from August 5, 1998 to December 15, 2007, hosted by Drew Carey. A revival of the show, hosted by Aisha Tyler, began airing on The CW on July 16, 2013.</p><p>The series features Ryan Stiles, Colin Mochrie, and Wayne Brady as its regular performers with the fourth seat occupied by a guest panelist. Performers are sometimes assisted by another guest star.</p><p>The nineteenth season premiered in October 2022, and the twentieth season premiered in March 2023.</p>"
  },
  "plotFull": {
    "plainText": "Whose Line Is It Anyway? (sometimes shortened to Whose Line? or WLIIA) is an American improvisational comedy television series, and is an adaptation of the British series of the same name. It originally aired on ABC and ABC Family from August 5, 1998 to December 15, 2007, hosted by Drew Carey. A revival of the show, hosted by Aisha Tyler, began airing on The CW on July 16, 2013.\r\nThe series features Ryan Stiles, Colin Mochrie, and Wayne Brady as its regular performers with the fourth seat occupied by a guest panelist. Performers are sometimes assisted by another guest star.\r\nThe nineteenth season premiered in October 2022, and the twentieth season premiered in March 2023.\r\nFormat\r\nThe show consists of a panel of four performers who create characters, scenes, and songs on the spot, in the style of short-form improvisation games. Topics for the games are based on either audience suggestions or predetermined prompts from the host, who would set up a game and situation that the performers would improvise. The original host Drew Carey awarded arbitrary point values after each game, often citing a humorous reason for his decision. The points were purely decorative and served no practical purpose. He would reiterate this at the beginning of, and multiple times throughout, each episode by describing Whose Line as \"the show where everything's made up and the points don't matter\". The style of the games were varied (see Games, below). Some featured all four performers, while others featured fewer. Between games, the performers sat in four chairs facing the audience. The performers who were not involved in a game remained in their seats. Additionally, the show was marked by humorous banter among the performers and host.\r\nAt the conclusion of each episode, a winner or several winners were chosen arbitrarily by Carey. The \"prize\" was either to play a game with the host, or to sit out while the other performers did so. After this game during the first season of the series, credits simply rolled under the show's theme. In the second season, the reading of the credits was performed by one or more cast members in a comedic fashion, based on a theme announced by Carey that often derived from a successful joke earlier in the show.\r\nThe show's \"short-form\" approach to improv received criticism from some improv actors. Performer Colin Mochrie has stated the show was never intended to be the \"be-all and end-all\" of improv, but that it was meant to introduce improv to the masses.\r\nPerformers/players\r\nWhose Line Is It Anyway? features four performers, two of whom, Colin Mochrie and Ryan Stiles, were featured prominently in the UK original. Another performer who made frequent, recurring appearances was Wayne Brady. During his tenure as host, Drew Carey also took part, though only in one game, after one of the performers was declared the \"winner\" and allowed to take his place at his desk in the studio; host Aisha Tyler does not take part in games, but occasionally joins in for quick scenes on different games (mostly Scenes from a Hat).\r\nAlongside Mochrie and Stiles, other veterans of the UK series who appeared on the U.S. version included Greg Proops, Brad Sherwood, and Chip Esten. The U.S. version introduced several newcomers that took part, including Denny Siegel, Kathy Greenwood, Jeff Davis, Patrick Bristow, Stephen Colbert, Kathy Kinney, and Ian Gomez, though mainly in the early seasons of the show. Unlike the UK original, the US version occasionally featured a celebrity guest performer, such as Robin Williams, Kathy Griffin, and Whoopi Goldberg, while on other occasions, a celebrity made a guest appearance for individual games; such appearances have included Sid Caesar, David Hasselhoff, Florence Henderson, Jerry Springer, Joanie \"Chyna\" Laurer, Richard Simmons, Katie Harman, Jayne Trcka, the Loyola Marymount University cheerleaders, Hugh Hefner, and Lassie. Celebrity guests became a regular feature of the show beginning with season nine.\r\nImprovisational musician Laura Hall, who appeared in the final season of the UK original, joined the original U.S. format for its entire run and performed piano and keyboards in games featuring improvisational singing by the cast members. Hall, originally from Chicago, gained valuable experience for Whose Line? by performing as a pianist for various theater and improvisational companies including The Second City and the Improv Institute. From the second season onward, other musicians joined Hall – Linda Taylor made frequent appearances playing guitar and occasionally keyboards, while Cece Worrall-Rubin, Anne King, Candy Girard, and Anna Wanselius appeared alongside Hall (and sometimes also Taylor) on occasion.\r\nGames\r\nThe number and type of games played varied from episode to episode, yet while some games became more common over time, others faded from use. Some games are based on traditional improv games, with a considerable number brought over from the UK original, including Scenes from a Hat, Greatest Hits, Props, Hoedown, Helping Hands, Questions Only and Party Quirks. Others were new and uniquely created for both the U.S. original format, and the revived show, with several only being played once or twice, due either to the games not having been well received by audiences, or to Stiles' reluctance to perform certain rounds. There are eight games that have been performed at least once in every season; these are Scenes from a Hat, Greatest Hits, Props, Let's Make a Date, Weird Newscasters, Duet, Helping Hands, and Questions Only.\r\nAll games are designed to test the performers' improvisational comedy skills, with some games requiring the host to ask the studio audience for suggestions for specific topics or situations, while at other times these suggestions were written by the production staff, or submitted by the audience in advance, and chosen from among these. In addition, the host would control a buzzer that would signify the end of most games, or the end of individual sections of rapid-fire games such as \"Scenes from a Hat\".\r\nIn addition to being tested on their comedy skills in improv games, the performers are also tested on other skills, such as singing, dancing, or impressions, as Whose Line features a number of musical games, with one or more of the show's resident musicians playing live backing music for them, except on a few occasions when pre-recorded music was also used. Although they had no bad feelings about these sort of games, many of the performers disliked them. While Wayne Brady turned out to be well suited to them, having Chip Esten, Jeff Davis, Brad Sherwood and Gary Anthony Williams making frequent appearances as his duet partner, Stiles frequently expressed open disdain towards the \"Hoedown\" game, which became a bit of a running gag, while Mochrie, who cannot sing, mainly preferred to deliver his lines in a spoken word fashion, much like in the UK original.\r\nHistory\r\nWhose Line Is It Anyway? was created by Dan Patterson and Mark Leveson in 1988 as a radio show on BBC Radio 4 in the United Kingdom. This early incarnation of the show is notable as being the origin of its tradition of having the performers read the credits in an amusing style; as it was a radio show, it was necessary for somebody to read the credits, and it was decided that it might as well be done as part of the program, rather than being done by a traditional BBC Radio announcer. This approach to reading credits was pioneered by the earlier BBC radio show I'm Sorry, I'll Read That Again. Indeed, the title of the show itself is a comedic riposte to another radio show, What's My Line, merged with the title of a 1972 teleplay (and eventual theatrical play) Whose Life Is It Anyway?.\r\nThe radio series lasted for six episodes, after which Channel 4 developed the franchise for television. The British television version lasted for a total of 10 seasons, with 136 episodes, all of which were hosted by Clive Anderson. Colin Mochrie and Ryan Stiles, who would later star in the U.S. version, became regular cast members in the seventh and eighth seasons.\r\nThe format of the American version was very similar to the British program. A major difference was Carey's use of the game-show facade, explicitly stating at the start of each episode that \"the points don't matter,\" and sometimes emphasizing this throughout the episodes. The difference in standards in the UK compared to U.S. prime time meant stricter censoring of both language and content on the U.S. series.\r\nProduction of the American version was canceled by ABC in 2003 because of low ratings, with already-produced episodes airing first-run into 2004. The ABC Family cable channel, which had been airing repeats of the show since 2002, also showed \"new\" episodes from January 2005 to December 2007, formed from previously filmed but unaired performances.\r\nHiatus\r\nFollowing the cancellation, Drew Carey went on to create the short-lived Drew Carey's Green Screen Show, which premiered in 2004 on The WB. The series was very similar to Whose Line?, and featured many of the same cast. The major gimmick on that series was that the acting was done in front of a green screen, and animators later added cartoon imagery to the scenes.\r\nCarey and several cast members also started touring North America with a live-action show called (Drew Carey's) Improv All-Stars. The show was a live stage show similar to Whose Line?, and featuring many of the same games, though also with some new ones. The live shows started in 2003, and since 2006, are only seen on occasion, mostly due to Carey's current television obligations. Colin Mochrie, Brad Sherwood and Drew Carey performed at the Just for Laughs festival in Montreal as \"Improv All-Stars\" in 2003 and 2004. Since 2005, Mochrie and Sherwood have toured semi-regularly as An Evening With Colin and Brad.\r\nThe show was recorded on Stage 29 at Paramount Studios.\r\nGreg Proops and Ryan Stiles presented Stiles & Proops Unplanned, a live improv comedy show based on the successful Baddiel and Skinner Unplanned format that took place at Centaur Theatre in Montreal, Quebec, Canada in July 2008. They also tour with former co-star Jeff Davis under the name Whose Live Anyway? doing live improv. Proops appeared as Max Madigan on Nickelodeon's True Jackson, VP, and is currently hosting Head Games on The Science Channel and was the host of \"Odd News\" segments for Yahoo! (now called Broken News Daily) while Esten has made multiple appearances in various TV series including The Office, ER (also produced by Warner Bros.) and Big Love and guest-starred in Enlightened. In 2007, Mochrie was host of a five-episode run of Are You Smarter Than a Canadian 5th Grader? on Global TV in Canada.\r\nCarey, Stiles, Brady, and Esten were all later employed by American television network CBS; Carey succeeded Bob Barker as the host of the long-running game show The Price Is Right (after a short stint as host of another game show, Power of 10). In addition, Sherwood and Davis served as guest announcers for the 2010–11 season of The Price Is Right, after the departure of Rich Fields, who was eventually replaced by George Gray. Stiles appeared as a supporting character on the sitcom Two and a Half Men. Esten had a recurring role on The New Adventures of Old Christine and made a guest appearance in NCIS: Los Angeles, before moving to star in the ABC drama Nashville.\r\nBrady had a summer variety show on ABC in 2001, The Wayne Brady Show and then hosted a daytime talk show of the same name for two seasons, starting in September 2002. He also was the host of Fox's Don't Forget the Lyrics. In 2007, he made a guest appearance in one episode of 30 Rock, and has made several appearances on How I Met Your Mother as Barney Stinson's brother. He also had a couple of guest appearances on Chappelle's Show. Since October 5, 2009, Brady has been the host of CBS' revival of the classic game show Let's Make a Deal. Featuring Jonathan Mangum as announcer and co-host, this new iteration utilized some classic elements of improv from Whose Line, most notably Brady's singing and comedic abilities, occasionally breaking out into spontaneous musical improv in front of or involving contestants, and not being a stipulated aspect of the particular game to be played. As of 2009, every main Whose Line participant has hosted at least one game show except Ryan Stiles.\r\nOn November 18, 2010, Variety announced that Drew Carey would host a primetime improv show on GSN. The series, entitled Drew Carey's Improv-A-Ganza, debuted on April 11, 2011, and featured most of the Whose Line regular cast before ending in June 2011; Rich Fields was the announcer for the series. It lasted one season.\r\nOn July 10, 2012, ABC premiered a new improv comedy series featuring several of the Whose Line alumni called Trust Us With Your Life. The players included Colin Mochrie, Wayne Brady, Greg Proops, Jonathan Mangum, and Nicole Parker. On July 30, however, after only six episodes had aired, ABC pulled the remaining episodes after its host Fred Willard was arrested on a lewd-conduct charge at the Tiki Theater, an adult movie theater in Hollywood, California.\r\nIn February 2013, Ryan Stiles revealed in an interview that he would be returning to Los Angeles in April for a new season of Whose Line, hosted by Aisha Tyler and featuring the original cast of the U.S. version. The revival was later officially announced on March 1, 2013.\r\nCW revival\r\nWhose Line Is It Anyway? returned to television, this time on The CW, with Colin Mochrie, Ryan Stiles, and Wayne Brady all returning, with Aisha Tyler taking the role of the host (Brady also continued to host Let's Make a Deal at the time). In addition to the traditional rotating fourth improv player (often drawn from same pool of regulars that appeared on the original show), a new feature was that of a \"special guest\". This fifth player would not necessarily have an improv background, but would still participate in some of the improv games.\r\nThe initial 2013 summer run was made up of twelve half-hour episodes with the three veteran players joined by a featured player, along with a different special guest for each episode who would play in some of the games.\r\nOn July 29, 2013, The CW announced that it had renewed the show for a 24-episode season, airing Fridays at 8 ET/PT starting March 21, 2014, due to solid ratings. Illness prevented Stiles from appearing in two season 10 episodes, the first Whose Line shows he had missed in nearly 20 years, dating back to the original British series. Frequent guest Greg Proops filled in for Stiles on these occasions.\r\nOn July 18, 2014, The CW announced that the show would be returning for a 24-episode eleventh season (and third season on The CW) that started airing on April 17, 2015. On August 11, 2015, the series was renewed for a twelfth season (fourth on The CW) to start airing May 23, 2016. On October 24, 2016, The CW renewed the show for a thirteenth season (fifth season on The CW) to start airing May 29, 2017. On October 26, 2017, The CW renewed the show for a fourteenth season (sixth on the CW). The first two episodes aired June 4, 2018. On October 9, 2018, The CW renewed the show for a fifteenth season (seventh on the CW) that began airing June 17, 2019. The CW renewed the show for a 16th season, with new episodes airing since March 30, 2020 in order to fill the void left by TV series affected by the COVID-19 pandemic. On May 14, 2020, The CW renewed the series for a seventeenth season that began airing in January 2021. On May 25, 2021, The CW renewed the series for an eighteenth season, which premiered on October 9, 2021. On May 19, 2022, it was announced that the series was renewed for a nineteenth season, which premiered on October 14, 2022. On January 23, 2023, it was announced that the twentieth season will premiere on March 31, 2023.\r\nPotential ending\r\nOn November 4, 2022, regular performer Mochrie announced that the show would film its final season in January 2023. After the CW stated that this was inaccurate as no decision had been made yet, Mochrie clarified his comments in a February 2023 interview, saying that the cast never received fair compensation nor were paid residuals. He also said how producers and cast members referred to it as their last season, and that if the show continues afterwards, it, \"probably won't be with this cast\". Mochrie also voiced displeasure regarding the show's minimal publicizing, saying that they did most of the publicizing on their own social media.\r\nPerformers\r\nSeveral of the performers, including the three regulars Brady, Mochrie and Stiles, had previously appeared in the original UK run of Whose Line; other performers who had made appearances in the British version are Greg Proops, Brad Sherwood, Chip Esten, Karen Maruyama and Josie Lawrence, as well as musician Laura Hall. Mochrie and Stiles have been regulars since the show started airing in the States, whilst Brady became a regular from season two to seven, and from season nine onwards, appearing as a recurring performer in seasons 1 and 8. Mochrie is the only performer to have appeared in every episode of the U.S. series of Whose Line?, with Stiles having missed two recordings due to illness. Greg Proops is the most prolific recurring performer, having appeared in 76 episodes, with Brad Sherwood not far behind with 71 appearances.\r\nThe show also included occasional guest fourth chairs during the first 8 seasons, each appearing in only one or two episodes, such as Stephen Colbert, Drew Carey Show performer Kathy Kinney, Robin Williams and Whoopi Goldberg. After the 2013 revival on the CW, celebrity guests appeared far more frequently, although only generally as an alternative to audience members in games such as Helping Hands or Living Scenery; such special guest stars have included Verne Troyer, Penn & Teller, Bill Nye and Alfonso Ribeiro. Occasionally more musically inclined guests, like Christopher Jackson, and David Hasselhoff, also partook in singing games.\r\nThe original host of the U.S. show was Drew Carey, who appeared in every episode of seasons one through eight. Carey notably took more of an active role in the show than his predecessor Clive Anderson, as following the announcement of the \"winner\" of each show, Carey would perform a game with the other performers. After the CW revival in 2013, Aisha Tyler took over as host, as Carey was the host of The Price is Right, which ran at the same time as Whose Line; Carey is mentioned numerous times by Tyler and the other performers, however. Unlike Carey, Tyler does not perform full games with the other performers; nonetheless, she does occasionally interject in quick fire games such as Scenes from a Hat with her own suggestions or to help another performer with their scene. Tyler has also surpassed Carey in tenure, although Carey hosted more episodes of the show.\r\nImprovisational musician Laura Hall, who appeared in the final season of the UK original, joined the original U.S. format for its entire run, and performed piano, keyboards and other instruments in games featuring improvisational singing by the cast members, such as Hoedown, Greatest Hits and Songstyles.\r\nMain\r\nSeries overview\r\nAwards and nominations\r\nInternational broadcast\r\nThe U.S. version of Whose Line? has been broadcast in the UK, originally on Channel 4. Challenge was the first non-terrestrial channel to broadcast the show for a brief period in 2005. From 2007 to 2012, 5USA aired the show. Since February 2021, Dave has also broadcast the show. It is also available on its on-demand service UKTV Play starting from season eleven onwards, marketed as series three of the revival. Several series of the show are also available on Amazon Prime Video.\r\nIn Canada, the show also ran on the CTV network from 1998 to 2003, and then on The Comedy Network from 2003 onwards.\r\nThe show's original run in Australia was on the Nine Network in an early morning time slot; One repeated the program from 2011. It also airs on The Comedy Channel. ABC has also aired the CW revival of the show on ABC Comedy.\r\nHome media\r\nThe first DVD, Season 1, Volume 1, of the U.S. version of Whose Line? was released on September 26, 2006. It comes in \"censored\" or \"uncensored\" versions. Both releases include the first ten episodes of the first season, with the episodes being the same on either version. The first seven episodes have had their original theme music (including all credits and ad bumpers) replaced with the version used for the rest of the episodes. Warner Home Video released Season 1, Volume 2 on October 9, 2007, but only in an \"uncensored\" version.\r\nWarner Home Video released a two-disc \"best of\" compilation with ten episodes on June 9, 2009. Featured in this release were celebrity guest episodes including appearances by David Hasselhoff, Florence Henderson, Jerry Springer, Richard Simmons and bodybuilder Jayne Trcka, along with the hour-long \"Best of Whose Line\" compilation episode aired at the beginning of season three.\r\nOf the 219 episodes from the original eight seasons, 186 of them are available to stream on HBO Max.",
    "html": "<p>Whose Line Is It Anyway? (sometimes shortened to Whose Line? or WLIIA) is an American improvisational comedy television series, and is an adaptation of the British series of the same name. It originally aired on ABC and ABC Family from August 5, 1998 to December 15, 2007, hosted by Drew Carey. A revival of the show, hosted by Aisha Tyler, began airing on The CW on July 16, 2013.</p><p>The series features Ryan Stiles, Colin Mochrie, and Wayne Brady as its regular performers with the fourth seat occupied by a guest panelist. Performers are sometimes assisted by another guest star.</p><p>The nineteenth season premiered in October 2022, and the twentieth season premiered in March 2023.</p><br/><h3>Format</h3><p>The show consists of a panel of four performers who create characters, scenes, and songs on the spot, in the style of short-form improvisation games. Topics for the games are based on either audience suggestions or predetermined prompts from the host, who would set up a game and situation that the performers would improvise. The original host Drew Carey awarded arbitrary point values after each game, often citing a humorous reason for his decision. The points were purely decorative and served no practical purpose. He would reiterate this at the beginning of, and multiple times throughout, each episode by describing Whose Line as \"the show where everything's made up and the points don't matter\". The style of the games were varied (see Games, below). Some featured all four performers, while others featured fewer. Between games, the performers sat in four chairs facing the audience. The performers who were not involved in a game remained in their seats. Additionally, the show was marked by humorous banter among the performers and host.</p><p>At the conclusion of each episode, a winner or several winners were chosen arbitrarily by Carey. The \"prize\" was either to play a game with the host, or to sit out while the other performers did so. After this game during the first season of the series, credits simply rolled under the show's theme. In the second season, the reading of the credits was performed by one or more cast members in a comedic fashion, based on a theme announced by Carey that often derived from a successful joke earlier in the show.</p><p>The show's \"short-form\" approach to improv received criticism from some improv actors. Performer Colin Mochrie has stated the show was never intended to be the \"be-all and end-all\" of improv, but that it was meant to introduce improv to the masses.</p><h4>Performers/players</h4><p>Whose Line Is It Anyway? features four performers, two of whom, Colin Mochrie and Ryan Stiles, were featured prominently in the UK original. Another performer who made frequent, recurring appearances was Wayne Brady. During his tenure as host, Drew Carey also took part, though only in one game, after one of the performers was declared the \"winner\" and allowed to take his place at his desk in the studio; host Aisha Tyler does not take part in games, but occasionally joins in for quick scenes on different games (mostly Scenes from a Hat).</p><p>Alongside Mochrie and Stiles, other veterans of the UK series who appeared on the U.S. version included Greg Proops, Brad Sherwood, and Chip Esten. The U.S. version introduced several newcomers that took part, including Denny Siegel, Kathy Greenwood, Jeff Davis, Patrick Bristow, Stephen Colbert, Kathy Kinney, and Ian Gomez, though mainly in the early seasons of the show. Unlike the UK original, the US version occasionally featured a celebrity guest performer, such as Robin Williams, Kathy Griffin, and Whoopi Goldberg, while on other occasions, a celebrity made a guest appearance for individual games; such appearances have included Sid Caesar, David Hasselhoff, Florence Henderson, Jerry Springer, Joanie \"Chyna\" Laurer, Richard Simmons, Katie Harman, Jayne Trcka, the Loyola Marymount University cheerleaders, Hugh Hefner, and Lassie. Celebrity guests became a regular feature of the show beginning with season nine.</p><p>Improvisational musician Laura Hall, who appeared in the final season of the UK original, joined the original U.S. format for its entire run and performed piano and keyboards in games featuring improvisational singing by the cast members. Hall, originally from Chicago, gained valuable experience for Whose Line? by performing as a pianist for various theater and improvisational companies including The Second City and the Improv Institute. From the second season onward, other musicians joined Hall – Linda Taylor made frequent appearances playing guitar and occasionally keyboards, while Cece Worrall-Rubin, Anne King, Candy Girard, and Anna Wanselius appeared alongside Hall (and sometimes also Taylor) on occasion.</p><h4>Games</h4><p>The number and type of games played varied from episode to episode, yet while some games became more common over time, others faded from use. Some games are based on traditional improv games, with a considerable number brought over from the UK original, including Scenes from a Hat, Greatest Hits, Props, Hoedown, Helping Hands, Questions Only and Party Quirks. Others were new and uniquely created for both the U.S. original format, and the revived show, with several only being played once or twice, due either to the games not having been well received by audiences, or to Stiles' reluctance to perform certain rounds. There are eight games that have been performed at least once in every season; these are Scenes from a Hat, Greatest Hits, Props, Let's Make a Date, Weird Newscasters, Duet, Helping Hands, and Questions Only.</p><p>All games are designed to test the performers' improvisational comedy skills, with some games requiring the host to ask the studio audience for suggestions for specific topics or situations, while at other times these suggestions were written by the production staff, or submitted by the audience in advance, and chosen from among these. In addition, the host would control a buzzer that would signify the end of most games, or the end of individual sections of rapid-fire games such as \"Scenes from a Hat\".</p><p>In addition to being tested on their comedy skills in improv games, the performers are also tested on other skills, such as singing, dancing, or impressions, as Whose Line features a number of musical games, with one or more of the show's resident musicians playing live backing music for them, except on a few occasions when pre-recorded music was also used. Although they had no bad feelings about these sort of games, many of the performers disliked them. While Wayne Brady turned out to be well suited to them, having Chip Esten, Jeff Davis, Brad Sherwood and Gary Anthony Williams making frequent appearances as his duet partner, Stiles frequently expressed open disdain towards the \"Hoedown\" game, which became a bit of a running gag, while Mochrie, who cannot sing, mainly preferred to deliver his lines in a spoken word fashion, much like in the UK original.</p><br/><h3>History</h3><p>Whose Line Is It Anyway? was created by Dan Patterson and Mark Leveson in 1988 as a radio show on BBC Radio 4 in the United Kingdom. This early incarnation of the show is notable as being the origin of its tradition of having the performers read the credits in an amusing style; as it was a radio show, it was necessary for somebody to read the credits, and it was decided that it might as well be done as part of the program, rather than being done by a traditional BBC Radio announcer. This approach to reading credits was pioneered by the earlier BBC radio show I'm Sorry, I'll Read That Again. Indeed, the title of the show itself is a comedic riposte to another radio show, What's My Line, merged with the title of a 1972 teleplay (and eventual theatrical play) Whose Life Is It Anyway?.</p><p>The radio series lasted for six episodes, after which Channel 4 developed the franchise for television. The British television version lasted for a total of 10 seasons, with 136 episodes, all of which were hosted by Clive Anderson. Colin Mochrie and Ryan Stiles, who would later star in the U.S. version, became regular cast members in the seventh and eighth seasons.</p><p>The format of the American version was very similar to the British program. A major difference was Carey's use of the game-show facade, explicitly stating at the start of each episode that \"the points don't matter,\" and sometimes emphasizing this throughout the episodes. The difference in standards in the UK compared to U.S. prime time meant stricter censoring of both language and content on the U.S. series.</p><p>Production of the American version was canceled by ABC in 2003 because of low ratings, with already-produced episodes airing first-run into 2004. The ABC Family cable channel, which had been airing repeats of the show since 2002, also showed \"new\" episodes from January 2005 to December 2007, formed from previously filmed but unaired performances.</p><h4>Hiatus</h4><p>Following the cancellation, Drew Carey went on to create the short-lived Drew Carey's Green Screen Show, which premiered in 2004 on The WB. The series was very similar to Whose Line?, and featured many of the same cast. The major gimmick on that series was that the acting was done in front of a green screen, and animators later added cartoon imagery to the scenes.</p><p>Carey and several cast members also started touring North America with a live-action show called (Drew Carey's) Improv All-Stars. The show was a live stage show similar to Whose Line?, and featuring many of the same games, though also with some new ones. The live shows started in 2003, and since 2006, are only seen on occasion, mostly due to Carey's current television obligations. Colin Mochrie, Brad Sherwood and Drew Carey performed at the Just for Laughs festival in Montreal as \"Improv All-Stars\" in 2003 and 2004. Since 2005, Mochrie and Sherwood have toured semi-regularly as An Evening With Colin and Brad.</p><p>The show was recorded on Stage 29 at Paramount Studios.</p><p>Greg Proops and Ryan Stiles presented Stiles & Proops Unplanned, a live improv comedy show based on the successful Baddiel and Skinner Unplanned format that took place at Centaur Theatre in Montreal, Quebec, Canada in July 2008. They also tour with former co-star Jeff Davis under the name Whose Live Anyway? doing live improv. Proops appeared as Max Madigan on Nickelodeon's True Jackson, VP, and is currently hosting Head Games on The Science Channel and was the host of \"Odd News\" segments for Yahoo! (now called Broken News Daily) while Esten has made multiple appearances in various TV series including The Office, ER (also produced by Warner Bros.) and Big Love and guest-starred in Enlightened. In 2007, Mochrie was host of a five-episode run of Are You Smarter Than a Canadian 5th Grader? on Global TV in Canada.</p><p>Carey, Stiles, Brady, and Esten were all later employed by American television network CBS; Carey succeeded Bob Barker as the host of the long-running game show The Price Is Right (after a short stint as host of another game show, Power of 10). In addition, Sherwood and Davis served as guest announcers for the 2010–11 season of The Price Is Right, after the departure of Rich Fields, who was eventually replaced by George Gray. Stiles appeared as a supporting character on the sitcom Two and a Half Men. Esten had a recurring role on The New Adventures of Old Christine and made a guest appearance in NCIS: Los Angeles, before moving to star in the ABC drama Nashville.</p><p>Brady had a summer variety show on ABC in 2001, The Wayne Brady Show and then hosted a daytime talk show of the same name for two seasons, starting in September 2002. He also was the host of Fox's Don't Forget the Lyrics. In 2007, he made a guest appearance in one episode of 30 Rock, and has made several appearances on How I Met Your Mother as Barney Stinson's brother. He also had a couple of guest appearances on Chappelle's Show. Since October 5, 2009, Brady has been the host of CBS' revival of the classic game show Let's Make a Deal. Featuring Jonathan Mangum as announcer and co-host, this new iteration utilized some classic elements of improv from Whose Line, most notably Brady's singing and comedic abilities, occasionally breaking out into spontaneous musical improv in front of or involving contestants, and not being a stipulated aspect of the particular game to be played. As of 2009, every main Whose Line participant has hosted at least one game show except Ryan Stiles.</p><p>On November 18, 2010, Variety announced that Drew Carey would host a primetime improv show on GSN. The series, entitled Drew Carey's Improv-A-Ganza, debuted on April 11, 2011, and featured most of the Whose Line regular cast before ending in June 2011; Rich Fields was the announcer for the series. It lasted one season.</p><p>On July 10, 2012, ABC premiered a new improv comedy series featuring several of the Whose Line alumni called Trust Us With Your Life. The players included Colin Mochrie, Wayne Brady, Greg Proops, Jonathan Mangum, and Nicole Parker. On July 30, however, after only six episodes had aired, ABC pulled the remaining episodes after its host Fred Willard was arrested on a lewd-conduct charge at the Tiki Theater, an adult movie theater in Hollywood, California.</p><p>In February 2013, Ryan Stiles revealed in an interview that he would be returning to Los Angeles in April for a new season of Whose Line, hosted by Aisha Tyler and featuring the original cast of the U.S. version. The revival was later officially announced on March 1, 2013.</p><h4>CW revival</h4><p>Whose Line Is It Anyway? returned to television, this time on The CW, with Colin Mochrie, Ryan Stiles, and Wayne Brady all returning, with Aisha Tyler taking the role of the host (Brady also continued to host Let's Make a Deal at the time). In addition to the traditional rotating fourth improv player (often drawn from same pool of regulars that appeared on the original show), a new feature was that of a \"special guest\". This fifth player would not necessarily have an improv background, but would still participate in some of the improv games.</p><p>The initial 2013 summer run was made up of twelve half-hour episodes with the three veteran players joined by a featured player, along with a different special guest for each episode who would play in some of the games.</p><p>On July 29, 2013, The CW announced that it had renewed the show for a 24-episode season, airing Fridays at 8 ET/PT starting March 21, 2014, due to solid ratings. Illness prevented Stiles from appearing in two season 10 episodes, the first Whose Line shows he had missed in nearly 20 years, dating back to the original British series. Frequent guest Greg Proops filled in for Stiles on these occasions.</p><p>On July 18, 2014, The CW announced that the show would be returning for a 24-episode eleventh season (and third season on The CW) that started airing on April 17, 2015. On August 11, 2015, the series was renewed for a twelfth season (fourth on The CW) to start airing May 23, 2016. On October 24, 2016, The CW renewed the show for a thirteenth season (fifth season on The CW) to start airing May 29, 2017. On October 26, 2017, The CW renewed the show for a fourteenth season (sixth on the CW). The first two episodes aired June 4, 2018. On October 9, 2018, The CW renewed the show for a fifteenth season (seventh on the CW) that began airing June 17, 2019. The CW renewed the show for a 16th season, with new episodes airing since March 30, 2020 in order to fill the void left by TV series affected by the COVID-19 pandemic. On May 14, 2020, The CW renewed the series for a seventeenth season that began airing in January 2021. On May 25, 2021, The CW renewed the series for an eighteenth season, which premiered on October 9, 2021. On May 19, 2022, it was announced that the series was renewed for a nineteenth season, which premiered on October 14, 2022. On January 23, 2023, it was announced that the twentieth season will premiere on March 31, 2023.</p><h4>Potential ending</h4><p>On November 4, 2022, regular performer Mochrie announced that the show would film its final season in January 2023. After the CW stated that this was inaccurate as no decision had been made yet, Mochrie clarified his comments in a February 2023 interview, saying that the cast never received fair compensation nor were paid residuals. He also said how producers and cast members referred to it as their last season, and that if the show continues afterwards, it, \"probably won't be with this cast\". Mochrie also voiced displeasure regarding the show's minimal publicizing, saying that they did most of the publicizing on their own social media.</p><br/><h3>Performers</h3><p>Several of the performers, including the three regulars Brady, Mochrie and Stiles, had previously appeared in the original UK run of Whose Line; other performers who had made appearances in the British version are Greg Proops, Brad Sherwood, Chip Esten, Karen Maruyama and Josie Lawrence, as well as musician Laura Hall. Mochrie and Stiles have been regulars since the show started airing in the States, whilst Brady became a regular from season two to seven, and from season nine onwards, appearing as a recurring performer in seasons 1 and 8. Mochrie is the only performer to have appeared in every episode of the U.S. series of Whose Line?, with Stiles having missed two recordings due to illness. Greg Proops is the most prolific recurring performer, having appeared in 76 episodes, with Brad Sherwood not far behind with 71 appearances.</p><p>The show also included occasional guest fourth chairs during the first 8 seasons, each appearing in only one or two episodes, such as Stephen Colbert, Drew Carey Show performer Kathy Kinney, Robin Williams and Whoopi Goldberg. After the 2013 revival on the CW, celebrity guests appeared far more frequently, although only generally as an alternative to audience members in games such as Helping Hands or Living Scenery; such special guest stars have included Verne Troyer, Penn & Teller, Bill Nye and Alfonso Ribeiro. Occasionally more musically inclined guests, like Christopher Jackson, and David Hasselhoff, also partook in singing games.</p><p>The original host of the U.S. show was Drew Carey, who appeared in every episode of seasons one through eight. Carey notably took more of an active role in the show than his predecessor Clive Anderson, as following the announcement of the \"winner\" of each show, Carey would perform a game with the other performers. After the CW revival in 2013, Aisha Tyler took over as host, as Carey was the host of The Price is Right, which ran at the same time as Whose Line; Carey is mentioned numerous times by Tyler and the other performers, however. Unlike Carey, Tyler does not perform full games with the other performers; nonetheless, she does occasionally interject in quick fire games such as Scenes from a Hat with her own suggestions or to help another performer with their scene. Tyler has also surpassed Carey in tenure, although Carey hosted more episodes of the show.</p><p>Improvisational musician Laura Hall, who appeared in the final season of the UK original, joined the original U.S. format for its entire run, and performed piano, keyboards and other instruments in games featuring improvisational singing by the cast members, such as Hoedown, Greatest Hits and Songstyles.</p><h4>Main</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\" rowspan=\"2\">Name</th><th scope=\"col\" rowspan=\"2\">Role</th><th scope=\"col\" rowspan=\"2\">Episodes</th><th scope=\"col\" colspan=\"20\">Seasons</th></tr><tr><th scope=\"col\" style=\"width:5%;\"><span>1<br>1998–99</span></th><th scope=\"col\" style=\"width:5%;\"><span>2<br>1999–00</span></th><th scope=\"col\" style=\"width:5%;\"><span>3<br>2000–01</span></th><th scope=\"col\" style=\"width:5%;\"><span>4<br>2001–02</span></th><th scope=\"col\" style=\"width:5%;\"><span>5<br>2002–03</span></th><th scope=\"col\" style=\"width:5%;\"><span>6<br>2004</span></th><th scope=\"col\" style=\"width:5%;\"><span>7<br>2005</span></th><th scope=\"col\" style=\"width:5%;\"><span>8<br>2005–07</span></th><th scope=\"col\" style=\"width:5%;\"><span>9<br>2013</span></th><th scope=\"col\" style=\"width:5%;\"><span>10<br>2014</span></th><th scope=\"col\" style=\"width:5%;\"><span>11<br>2015</span></th><th scope=\"col\" style=\"width:5%;\"><span>12<br>2016</span></th><th scope=\"col\" style=\"width:5%;\"><span>13<br>2017</span></th><th scope=\"col\" style=\"width:5%;\"><span>14<br>2018</span></th><th scope=\"col\" style=\"width:5%;\"><span>15<br>2019</span></th><th scope=\"col\" style=\"width:5%;\"><span>16<br>2020</span></th><th scope=\"col\" style=\"width:5%;\"><span>17<br>2021</span></th><th scope=\"col\" style=\"width:5%;\"><span>18<br>2021–22</span></th><th scope=\"col\" style=\"width:5%;\"><span>19<br>2022–23</span></th><th scope=\"col\" style=\"width:5%;\"><span>20<br>2023</span></th></tr><tr><td scope=\"row\"><span>Colin Mochrie</span></td><td rowspan=\"3\">Performer</td><td>398</td><td colspan=\"20\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><td scope=\"row\"><span>Ryan Stiles</span></td><td>395</td><td colspan=\"20\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><td scope=\"row\"><span>Wayne Brady</span></td><td>385</td><td style=\"background: #FFE3E3; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Recurring</span></td><td colspan=\"6\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td><td style=\"background: #FFE3E3; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Recurring</span></td><td colspan=\"12\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><td scope=\"row\"><span>Drew Carey</span></td><td rowspan=\"2\">Host</td><td>219</td><td colspan=\"8\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td><td colspan=\"12\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td></tr><tr><td scope=\"row\"><span>Aisha Tyler</span></td><td>178</td><td colspan=\"8\" style=\"background: #EEE; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span style=\"display: none\">Does not appear</span></td><td colspan=\"12\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td style=\"text-align: left; vertical-align: top;\"><h3><span class=\"mw-headline\" id=\"Recurring\">Recurring</span><span class=\"mw-editsection\"><span data-section=\"10\" class=\"mw-ui-icon mw-ui-icon-element mw-ui-icon-wikimedia-edit-base20 edit-page mw-ui-icon-flush-right mw-ui-button mw-ui-quiet\">Edit</span></span></h3><ul><li><span>Greg Proops</span> – 79 episodes <small>(Seasons one–eight, ten–present)</small></li><li><span>Brad Sherwood</span> – 74 episodes <small>(Seasons one–eight, ten–sixteen, nineteen–present)</small></li><li><span>Jeff Davis</span> – 54 episodes <small>(Seasons three–five, seven–present)</small></li><li><span>Charles \"Chip\" Esten</span> – 45 episodes <small>(Seasons two–eight, thirteen–sixteen)</small></li><li><span>Gary Anthony Williams</span> – 36 episodes <small>(Seasons nine–seventeen, nineteen–present)</small></li><li><span>Kathy Greenwood</span> – 33 episodes <small>(Seasons two–five, seven–eight)</small></li><li><span>Jonathan Mangum</span> – 29 episodes <small>(Seasons nine–present)</small></li><li><span>Heather Anne Campbell</span> – 15 episodes <small>(Seasons nine–eleven, thirteen–fifteen, seventeen–present)</small></li><li><span>Denny Siegel</span> – 14 episodes <small>(Seasons one–two, six, eight)</small></li><li><span>Keegan-Michael Key</span> – 13 episodes <small>(Seasons nine–twelve, fourteen, eighteen, twenty)</small></li><li>Nyima Funk – seven episodes <small>(Seasons nine–ten, seventeen-present)</small></li><li><span>Kathy Griffin</span> – four episodes <small>(Season five)</small></li><li><span>Karen Maruyama</span> – three episodes <small>(Seasons one–two)</small></li></ul></td><td style=\"text-align: left; vertical-align: top;\"><h3><span class=\"mw-headline\" id=\"Musicians\">Musicians</span><span class=\"mw-editsection\"><span data-section=\"11\" class=\"mw-ui-icon mw-ui-icon-element mw-ui-icon-wikimedia-edit-base20 edit-page mw-ui-icon-flush-right mw-ui-button mw-ui-quiet\">Edit</span></span></h3><ul><li><span>Laura Hall</span> – 350 episodes</li><li>Linda Taylor – 240 episodes</li><li>Cece Worrall – 37 episodes</li><li>Anne King – 10 episodes</li><li>Anna Wanselius – six episodes</li></ul><p> </p></td></tr></tbody></table><br/><h3>Series overview</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"3\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th><th scope=\"col\" style=\"padding:0 8px\">Network</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">20</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">August 5, 1998</td><td style=\"padding:0 8px\">March 24, 1999</td><td rowspan=\"6\"><span>ABC</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">39</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 16, 1999</td><td style=\"padding:0 8px\">May 18, 2000</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">39</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 12, 2000</td><td style=\"padding:0 8px\">June 21, 2001</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">31</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 6, 2001</td><td style=\"padding:0 8px\">April 11, 2002</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">34</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 9, 2002</td><td style=\"padding:0 8px\">September 5, 2003</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 24, 2004</td><td style=\"padding:0 8px\">September 4, 2004</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>7</span></span></span></span></th><td colspan=\"2\">25</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 17, 2005</td><td style=\"padding:0 8px\">May 23, 2005</td><td rowspan=\"2\"><span class=\"mw-redirect\">ABC Family</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>8</span></span></span></span></th><td colspan=\"2\">21</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 3, 2005</td><td style=\"padding:0 8px\">December 15, 2007</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>9</span></span></span></span></th><td colspan=\"2\">12</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">July 16, 2013</td><td style=\"padding:0 8px\">September 24, 2013</td><td rowspan=\"12\"><span>The CW</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>10</span></span></span></span></th><td colspan=\"2\">24</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 21, 2014</td><td style=\"padding:0 8px\">November 21, 2014</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>11</span></span></span></span></th><td colspan=\"2\">20</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 17, 2015</td><td style=\"padding:0 8px\">October 5, 2015</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>12</span></span></span></span></th><td colspan=\"2\">20</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">May 23, 2016</td><td style=\"padding:0 8px\">September 28, 2016</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>13</span></span></span></span></th><td colspan=\"2\">15</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">May 29, 2017</td><td style=\"padding:0 8px\">September 28, 2017</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>14</span></span></span></span></th><td colspan=\"2\">17</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 4, 2018</td><td style=\"padding:0 8px\">October 1, 2018</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>15</span></span></span></span></th><td colspan=\"2\">12</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 17, 2019</td><td style=\"padding:0 8px\">September 23, 2019</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>16</span></span></span></span></th><td colspan=\"2\">20</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 30, 2020</td><td style=\"padding:0 8px\">November 16, 2020</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>17</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 8, 2021</td><td style=\"padding:0 8px\">April 16, 2021</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>18</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 9, 2021</td><td style=\"padding:0 8px\">April 9, 2022</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>19</span></span></span></span></th><td colspan=\"2\">14</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 14, 2022</td><td style=\"padding:0 8px\">March 24, 2023</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>20</span></span></span></span></th><td data-sort-value=\"\" class=\"table-na\" colspan=\"2\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\">TBA</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 31, 2023</td><td data-sort-value=\"\" class=\"table-na\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center; ;padding:0 8px\">TBA</td></tr></tbody></table><br/><h3>Awards and nominations</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Recipient</th><th>Result</th><th>Refs</th></tr><tr><td rowspan=\"2\">2001</td><td rowspan=\"2\"><span class=\"nowrap\"><span>Primetime Emmy Awards</span></span></td><td><span>Outstanding Individual Performance in a Variety or Music Program</span></td><td><span>Wayne Brady</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Outstanding Technical Direction, Camerawork, Video for a Series</span></td><td>Ted Ashton, Sam Drummy, Larry Heider, Bob Keys, John O'Brien, John Pritchett, Brian Reason, Easter Xua, Brad Zerbst</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"2\">2002</td><td rowspan=\"2\"><span>Primetime Emmy Awards</span></td><td>Outstanding Individual Performance in a Variety or Music Program</td><td><span>Ryan Stiles</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td>Outstanding Individual Performance in a Variety or Music Program</td><td>Wayne Brady</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td>2003</td><td><span>Primetime Emmy Awards</span></td><td>Outstanding Individual Performance in a Variety or Music Program</td><td>Wayne Brady</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr></tbody></table><br/><h3>International broadcast</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>needs additional citations for <span>verification</span></b>.<span class=\"hide-when-compact\"> Please help <span class=\"external text\">improve this article</span> by <span>adding citations to reliable sources</span> in this section. Unsourced material may be challenged and removed.</span>  <span class=\"date-container\"><i>(<span class=\"date\">April 2021</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><p>The U.S. version of Whose Line? has been broadcast in the UK, originally on Channel 4. Challenge was the first non-terrestrial channel to broadcast the show for a brief period in 2005. From 2007 to 2012, 5USA aired the show. Since February 2021, Dave has also broadcast the show. It is also available on its on-demand service UKTV Play starting from season eleven onwards, marketed as series three of the revival. Several series of the show are also available on Amazon Prime Video.</p><p>In Canada, the show also ran on the CTV network from 1998 to 2003, and then on The Comedy Network from 2003 onwards.</p><p>The show's original run in Australia was on the Nine Network in an early morning time slot; One repeated the program from 2011. It also airs on The Comedy Channel. ABC has also aired the CW revival of the show on ABC Comedy.</p><br/><h3>Home media</h3><p>The first DVD, Season 1, Volume 1, of the U.S. version of Whose Line? was released on September 26, 2006. It comes in \"censored\" or \"uncensored\" versions. Both releases include the first ten episodes of the first season, with the episodes being the same on either version. The first seven episodes have had their original theme music (including all credits and ad bumpers) replaced with the version used for the rest of the episodes. Warner Home Video released Season 1, Volume 2 on October 9, 2007, but only in an \"uncensored\" version.</p><p>Warner Home Video released a two-disc \"best of\" compilation with ten episodes on June 9, 2009. Featured in this release were celebrity guest episodes including appearances by David Hasselhoff, Florence Henderson, Jerry Springer, Richard Simmons and bodybuilder Jayne Trcka, along with the hour-long \"Best of Whose Line\" compilation episode aired at the beginning of season three.</p><p>Of the 219 episodes from the original eight seasons, 186 of them are available to stream on HBO Max.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>DVD title</th><th>No. of<br>episodes</th><th>Run time<br>(minutes)</th><th>Release</th><th>Notes</th></tr><tr><td>Whose Line Is It Anyway?: Season One, Vol. 1</td><td align=\"center\">10</td><td align=\"center\">110</td><td>September 26, 2006</td><td>Uncensored</td></tr><tr><td>Whose Line Is It Anyway?: Season One, Vol. 1</td><td align=\"center\">10</td><td align=\"center\">220</td><td>October 9, 2007</td><td>Censored</td></tr><tr><td>Whose Line Is It Anyway?: Season One, Vol. 2</td><td align=\"center\">10</td><td align=\"center\">260</td><td>October 9, 2007</td><td>Uncensored</td></tr><tr><td>The Best of Whose Line Is It Anyway?</td><td align=\"center\">11</td><td align=\"center\">300</td><td>June 9, 2009</td><td>Uncensored; includes the special \"Best of Whose Line\" episode</td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}