{
  "imDbId": "tt1518542",
  "title": "Sarabhai V/S Sarabhai",
  "fullTitle": "Sarabhai V/S Sarabhai (TV Series 2004–2017)",
  "type": "TVSeries",
  "year": "2004",
  "items": [
    {
      "username": "mithilbhoras-103-581296",
      "userUrl": "https://www.imdb.com/user/ur26953865",
      "reviewLink": "https://www.imdb.com/review/rw2507036",
      "warningSpoilers": false,
      "date": "23 October 2011",
      "rate": "10",
      "helpful": "42 out of 44 found this helpful.",
      "title": "Greatest Indian sitcom on television history....",
      "content": "I never get tired of watching Sarabhai again and again. It's funny, imaginative, different and brilliant. Never knew that this series will become an important part of my life. All my friends and family members love it. I adore this sitcom from my heart.It's sad to see though that the series is lost and the producers had promised season 2 but that was 5 years ago! This is a lost classic and begs to be released on DVD. If you want, it's available on Youtube. But still it requires a proper tribute.I really hope that in the next 10-20 years people will recognize this sitcom and do something about it. Because it's just too much fun and joys are plentiful. Hats Off to the entire team!!!!"
    },
    {
      "username": "bvnisarga",
      "userUrl": "https://www.imdb.com/user/ur71302704",
      "reviewLink": "https://www.imdb.com/review/rw4585896",
      "warningSpoilers": false,
      "date": "16 January 2019",
      "rate": "10",
      "helpful": "13 out of 13 found this helpful.",
      "title": "CULT CLASSIC",
      "content": "I remember being blown away while watching 'Sarabhai vs Sarabhai' when it first aired in 2004. It was unlike anything on Indian television at the time. A trailblazer, different from the usual saas-bahu dramas. Even in terms of sitcoms, It was completely different. Refreshing, intelligent, witty and funny. It was addictive to watch. I fell in love with it immediately, right from the first episode. The writing ruled and the terrific cast just elevated it to another level. The main characters trademark quirks, be it Indravardhan's pranks or Maya's elegance or Monisha's craziness or Rosesh's poetry or Sahil's frustration, elevate normal-mundane situations to insane and out-of-control situations. Add to it the bonkers supporting characters and their quirks, Dushyant's helpfulness (ahem!) or Madhu-kaka's slight deafness (ahem!ahem!) added a whole level of insanity to the already insane situation. Creating plenty of laughs and making it one of the best shows of Indian Television. It was the perfect cocktail of great writing, smart directing and brilliant acting. No other show has been able to achieve this level of perfection. I watched it again recently and could reconnect with it immediately. It is as relevant in 2019 as it was in 2004. It has aged like fine wine. A Cult Classic for the ages."
    },
    {
      "username": "hardik-parikh",
      "userUrl": "https://www.imdb.com/user/ur26699927",
      "reviewLink": "https://www.imdb.com/review/rw2449757",
      "warningSpoilers": false,
      "date": "24 June 2011",
      "rate": "10",
      "helpful": "46 out of 47 found this helpful.",
      "title": "One of the best TV shows ever !!!",
      "content": "Sarabhai vs Sarabhai is one of the best and the most sophisticated comedy show you will ever see.Sahil, Roshesh, Maya and Indravadan are an atypical south mumbai family. Roshesh with his poems and mannerisms is absolutely humorous. Sahil with all his wittiness and solutions is right on money. Indravadan and Maya have unusual husband-wife quarrels. Maya with her upper class status always amuses me.Enter Monisha - a middle class girl who marries Sahil and everything from there is a roller coaster ride.The way Indravadan abuses Roshesh, roshesh's horrible poems, Maya and Monisha's fights and taunts - everything is just perfect.To add icing to the cake is Dushyant. A gizmo's freak who is on the prowl to repair anything.All in all a completely humorous show. Not a single second in each show will you feel bored.Definitely on 10 things to do before you DIE !!! Watch this show..10/10 for everything !!!"
    },
    {
      "username": "deepakkhasa",
      "userUrl": "https://www.imdb.com/user/ur23638253",
      "reviewLink": "https://www.imdb.com/review/rw2957190",
      "warningSpoilers": false,
      "date": "8 February 2014",
      "rate": "10",
      "helpful": "21 out of 23 found this helpful.",
      "title": "Humour in every sense of the term",
      "content": "One of the most humorous shows to have ever been aired on Indian Television. It generated moments of sheer magic in my life and everyone else's, i presume. The very funny attributes the characters of the show are infused with,along with the brilliantly written dialogues of the show all add to the immense popularity that the show garnered amongst the masses. Truly changed the face of Indian T.V. Sarabhai was a pathbreaker and a trendsetter in every respect.For every other shows that were aired after Sarabhai, it was difficult to follow fashion and match up to the standards set by Sarabhai vs Sarabhai. I wonder how many of them managed to surpass this. Extremely delighted that the DVD's have released."
    },
    {
      "username": "sampandey31",
      "userUrl": "https://www.imdb.com/user/ur28264323",
      "reviewLink": "https://www.imdb.com/review/rw2492960",
      "warningSpoilers": false,
      "date": "23 September 2011",
      "rate": "10",
      "helpful": "73 out of 78 found this helpful.",
      "title": "Best Ever in India",
      "content": "It is the best TV show.No matter how many times you watch it, you wanna watch it again. Excellent, Excellent and Excellent.Why isn't there a 2nd season of it?I request from the makers of Sarabhai Vs Sarabhai to launch a 2nd season and please with the same characters, no changes at all.It can be compared to FRIENDS or HOW I MET YOUR MOTHER.The Direction is awesome.All the characters have done awesome acting and it looks as if everything is totally natural.Hats off the the cast and crew."
    },
    {
      "username": "abtheboss",
      "userUrl": "https://www.imdb.com/user/ur80370095",
      "reviewLink": "https://www.imdb.com/review/rw6007250",
      "warningSpoilers": false,
      "date": "18 August 2020",
      "rate": "",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Cult show!",
      "content": "I don't know how many times I have watching this show on repeat mode. You can still re-watch all the episodes without getting bored even once! There is not a single episode which will not make you laugh. India have produced so many great sitcoms like Flop Show, Shriman Shrimati, Office office, Khichdi, TMKOC etc but nothing can be compare with this classic. This show was brilliantly written and executed."
    },
    {
      "username": "nanoo-shashwat",
      "userUrl": "https://www.imdb.com/user/ur23546761",
      "reviewLink": "https://www.imdb.com/review/rw3268890",
      "warningSpoilers": false,
      "date": "23 June 2015",
      "rate": "10",
      "helpful": "15 out of 19 found this helpful.",
      "title": "Andaz Apna Apna of Indian Television",
      "content": "Way ahead of its age just like andaz apna apna , this is a pure masterpiece . All characters suited best and thoroughly deserve 9+ rating out of 10 .Watch it again and again and i bet you wont get bored even after 20th turn of an episode .Start was slow but with 3rd episode , it picked it pace and never looked back . Best char is maya followed by rosesh indu monisha and sahil .I hope they bring 2nd season , maybe too late but still fingers crossed .Acting :- 10/10 Cast :- 10/10 Direction :- 10/10 Add on char :- 10/10OVERALL 10/10 .... Don't miss this ;)"
    },
    {
      "username": "rahulkale-rahulkale",
      "userUrl": "https://www.imdb.com/user/ur45895458",
      "reviewLink": "https://www.imdb.com/review/rw4324662",
      "warningSpoilers": false,
      "date": "6 September 2018",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Funniest Indian Sitcom. Period.",
      "content": "Sarabhai vs Sararbhai is probably the funniest Indian sitcom. There's no other show that even comes even close to it. The writing, the story and the characters are all just perfect. The gags and the jokes work very well as the characters are so nicely fleshed out and established."
    },
    {
      "username": "ankurm28",
      "userUrl": "https://www.imdb.com/user/ur28850369",
      "reviewLink": "https://www.imdb.com/review/rw2510296",
      "warningSpoilers": false,
      "date": "29 October 2011",
      "rate": "9",
      "helpful": "32 out of 35 found this helpful.",
      "title": "Slick Comedy. Best Indian Sitcom!",
      "content": "This is unarguably one of the best sitcoms in Indian Television. We have had some nice funny TV shows but none of them are so nicely scripted.The show had a very interesting and unusual cast. Crisp direction, Well researched scripts, and High IQ humor made it so much more interesting than other comedy shows on Indian TV channels.Maya and Monisha's (Elite vs middle class) sequences are such a delight! And the best thing in the show was Rosesh's KILLER Poetry. So irritating yet so enjoyable:)Too bad that we do not have another season coming! I still hope a new season starts someday."
    },
    {
      "username": "vegetarulzagain",
      "userUrl": "https://www.imdb.com/user/ur42928079",
      "reviewLink": "https://www.imdb.com/review/rw3165706",
      "warningSpoilers": true,
      "date": "19 January 2015",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "The Very Best!!!",
      "content": "I started watching this series about 10 days back. I liked it so much that I finished the entire season in just 10 days. It is one of the best sitcoms I have ever seen in my life. It offers a unique combination of slapstick and subtle \"sophisticated\" humor.The characters of this series are unique and are instantly likable. Only after 1 episode, you are able to form a bond with them and understand the situation from their perspective. The acting is top notch. I would specially like to praise the choice of cast. No one else would have done a better job in their respective roles.Satish Shah is just so immensely comic. Ratna Pathak gives a splendid performance, perhaps the best of the lot. Roopali Ganguly is sweet, innocent and bubbly and Sumeet Raghavan is mature and rational. These are joined by Rajesh Kumar who I believe was the source of most of the humor in the series.The characters are constantly shown to be one dimensional. All of life's situations are characterized differently by each of them because of their characteristics and this generates intense humor. There's always friction between some family members but the latent love that they have for each other always prevails.The background score is just too good. The theme music when Maya starts to count the list of middle class things that Monisha does/like lifts the mood instantly. Even in crisis situations, the \"list\" of middle class things instantly makes you laugh and smile.I believe the show deserves every hype it gets. Because it always kept a big smile on my face. Even if there was no humor, I never stopped smiling.Recommended for everyone looking for light hearted but good comedy!!!"
    },
    {
      "username": "Jini-B",
      "userUrl": "https://www.imdb.com/user/ur45019515",
      "reviewLink": "https://www.imdb.com/review/rw5083841",
      "warningSpoilers": false,
      "date": "27 August 2019",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "The Most Iconic Indian Comedy Ever",
      "content": "This is one of the best shows that ever aired on Indian TV, and arguably the best Indian comedy series made. The characters became so famous among the Indian audience that they made their way into pop culture- Maya Sarabhai and her rants about the Middle Class, Monisha Sarabhai and her budget-living ways, Indravadan Sarabhai's Naradmuni turn and Rosesh Sarabhai's terrible poems. In the midst of it all is Sahil Sarabhai, trying to live with this madness. The supporting characters like near-deaf Madhu Fufa and gadget-freak Dushyant are also endearing and hilarious. Each actor has done their roles complete justice.Complement that with the dialog and the story in each episode, and this show is near-perfect. I have watched the show multiple times and I know I will never tire of it. Indian TV needs more shows like this one."
    },
    {
      "username": "anu-18586",
      "userUrl": "https://www.imdb.com/user/ur63158868",
      "reviewLink": "https://www.imdb.com/review/rw4398902",
      "warningSpoilers": false,
      "date": "15 October 2018",
      "rate": "",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Pure perfection",
      "content": "No comedy program can touch the level of Sarabhai. Awesome family comedy."
    },
    {
      "username": "aaarjun888",
      "userUrl": "https://www.imdb.com/user/ur42557053",
      "reviewLink": "https://www.imdb.com/review/rw5610533",
      "warningSpoilers": false,
      "date": "5 April 2020",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "I am among unlucky who didn't watch it on tv when it aired on star one",
      "content": "Yup, I watched this series in 2018 about 12-14 years later on hotstar. Undoubtedly it was way far ahead show from their time."
    },
    {
      "username": "Abhishek_goyal",
      "userUrl": "https://www.imdb.com/user/ur35991224",
      "reviewLink": "https://www.imdb.com/review/rw3342135",
      "warningSpoilers": false,
      "date": "24 October 2015",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Best Indian series ever made",
      "content": "It is undoubtedly the best Hindi TV Series. It is famous amongst youngsters because they prefer witty, sarcastic punches which Satish Shah (Indravadan Sarabhai) delivers with such an ease. Intelligent jokes, which Sumeet Raghavan (Sahil Sarabhai) never fails to deliver. The silly comedy as depicted by Rupali Ganguly (Monisha Sarabhai) and Rajesh Kumar (Rosesh Sarabhai). And of course, the brilliant acting by Ratna Pathak Shah (Maya Sarabhai).The thing that stands out for me, is, that apart from the main cast, the supporting cast is equally funny and brilliant.Right from Madhusudhan Fufa's \"hain, hain?\", to Dushyant Sarabhai explaining each and every thing. Every character in this show has it's unique charm and is equally important. The script of each and every episode is really good. I never felt that any joke is being repeated, or is being over-used, even though I have watched each episode at least 5 time (NO! I am not exaggerating) It's one amongst those Hindi TV serials which can be said to match the level of shows like friends,two and a half men,big bang theory and how I met your mother in terms of sarcastic dialogs...Acting and intelligent humour.... I really hope they come up with it's second season already. It is time Indian television has had some intelligent comedy."
    },
    {
      "username": "vinayjoshiii",
      "userUrl": "https://www.imdb.com/user/ur58891170",
      "reviewLink": "https://www.imdb.com/review/rw3191796",
      "warningSpoilers": false,
      "date": "25 February 2015",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Best comedy serial ever!!",
      "content": "Sarabhai vs Sarabhi is the best comic serial I've ever seen. The cast and direction is awesome and even today, I watch the downloaded episodes regularly.. In an era of all saas bahu non-sense, this show still shows the conflicts, but in the best humorous manner possible. I'm so much addicted to Sarabhai vs Sarabhi and have seen all the episodes so many times, that I remember Rosesh's poetry line by line.. Each and every character is awesome and all the actors are gems, Satish Shah being my favorite.. Hats off to dushyant for his perfect direction. 9.4/10 on IMDb by close to 3k users itself speaks about the show. Please please come up with a new season with same cast. I'm dying to see some new episodes."
    },
    {
      "username": "nidhiamlani",
      "userUrl": "https://www.imdb.com/user/ur124161340",
      "reviewLink": "https://www.imdb.com/review/rw6399629",
      "warningSpoilers": false,
      "date": "25 December 2020",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Love this series !",
      "content": "One of the best underrated series of India. This show can be watched with family and have no absurdity, the show cast had done hatts off performance and all the performance is praiseworthy."
    },
    {
      "username": "maanikroda",
      "userUrl": "https://www.imdb.com/user/ur108708694",
      "reviewLink": "https://www.imdb.com/review/rw5918080",
      "warningSpoilers": false,
      "date": "19 July 2020",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Maya's sarcasms, Monisha's idiocy and Indravadan's escapades!",
      "content": "Undoubtedly a great show! Good script and good acting makes it a must watch! An out and out comedy. I think it was those days when we did know how to laugh at ourselves and also had our sense of humour intact. I worry everyday , from the time it has started its reruns, whether someone will object to its contents. I wish there were more such shows and more directors who will cater to the intelligence in us and not make us regressive. Loved Maya Sarabhai! The grip that she has, is impeccable if I may use the word. This show though deserves 10. However for that S02 I rightfully take one mark. Sure shot pathetic!"
    },
    {
      "username": "dreamtowinamit",
      "userUrl": "https://www.imdb.com/user/ur76604009",
      "reviewLink": "https://www.imdb.com/review/rw3714848",
      "warningSpoilers": true,
      "date": "24 May 2017",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "If you love comedy,you are gonna fall in love with these characters.",
      "content": "The best Indian comedy show ever without any doubt,all those saas bahu drama taken so interstingly and those Roshesh's poetry,Maaya's sarcastic taanas and Monisha's kanjooshi,oh even writing this my mind starts thinking and i am chuckling thinking about those scenes,way way better than these shitty serials going on the TV these days."
    },
    {
      "username": "tinytots2",
      "userUrl": "https://www.imdb.com/user/ur144605672",
      "reviewLink": "https://www.imdb.com/review/rw8128675",
      "warningSpoilers": false,
      "date": "9 May 2022",
      "rate": "7",
      "helpful": "1 out of 1 found this helpful.",
      "title": "The quintessential Indian family sitcom",
      "content": "A regaling Hindi sitcom and soap opera, Sarabhai v/s Sarabhai revolves around the daily lives of the quirky characters that make up the Sarabhai family.The show fares well at depicting a typical urban upper middle class Indian family in the early 2000s. It effectively captures the lifestyle and interpersonal dynamics as well as common attitudes and beliefs of that time. The characters span a wide range of natures - the genial prankster Indravadan, his domineering acerbic wife Maya, their straight man elder son Sahil and irresponsible daughter-in-law Monisha, and their younger son and mother's pet Rosesh form the core family. Along with witty wordplay and humorous dialogue, the comedy is also brought out by employing recurring gags such as Maya's contempt for the middle class, Monisha's miserliness and Rosesh's unappreciated attempts at poetry.However, it should be emphasized that Sarabhai v/s Sarabhai is unlikely to be appreciated by international audiences unfamiliar with the Indian setting and culture. There is also a dire lack of character progression; the family members never change or develop significantly as a result of their experiences, instead remaining one-note personalities. Events that should be treated with a modicum of seriousness are instead used solely for comedic effect. Romance subplots especially are extremely corny and work lives are barely featured. In general, the choice of independent episodic storylines prevents references to past happenings. There is a lot of overacting as well; this is even more evident in the needless Season 2. Finally, the sound effects that are played after each retort quickly become grating.Despite these criticisms, Sarabhai v/s Sarabhai is among the foremost Indian sitcoms. Even if incidents and personalities are exaggerated for dramatic effect, the stories nonetheless tend to be endearing and amusing. The show is best suited for Indian audiences and Indian diaspora abroad who will be better able to relate to the content and derive enjoyment from it."
    },
    {
      "username": "parth-23048",
      "userUrl": "https://www.imdb.com/user/ur65590881",
      "reviewLink": "https://www.imdb.com/review/rw3421700",
      "warningSpoilers": false,
      "date": "25 February 2016",
      "rate": "10",
      "helpful": "3 out of 4 found this helpful.",
      "title": "All time best comic show of TV",
      "content": "Undoubtedly Sarabhai vs Sarabhai is the finest TV sitcom in Indian history. What a characters and what a mixture they produced was just hilarious.My most favorite comic star Satish Shah led show like anything, his timing, his expression, his chemistry with all actors was amazing. He is the gem in Indian industry and it was outstanding performance from acting supremo.He was well supported by Ratna Pathak, much versatile and balanced actors like Satishjee. She played sophisticated Mother in law and also Home minister of family with acting implicate and with great humour.Rupali Ganguly played role of Monnisha with ease and perfection. It was unique role performed first time in Indian history. She was outstanding throughout show. Hats off to her unexpected excellenceMost sensible person in house, Sahil played by Sumit , extremely well. His silent comedy was brilliant. Exp actor played one of the best role and joined legends with ease.Next is Roshesh , Rajesh Kumar. Outstadning performance. His combination with Ratna was great, and with Satish Shah was just hilarious. He added great flavor to show.Dushyant, Director Deven Bhojani was super enzyme to show. He was mind blowing with each act and with Satish, Rajesh and Ruplai , he added superb chemistry.Other actors, Vitthal , Raadhabai was also great.Show was bestest !!!"
    },
    {
      "username": "shirkenilesh-57427",
      "userUrl": "https://www.imdb.com/user/ur124231755",
      "reviewLink": "https://www.imdb.com/review/rw6142071",
      "warningSpoilers": false,
      "date": "2 October 2020",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Funny",
      "content": "Fun overloaded. One of the best comedy show of its time."
    },
    {
      "username": "pritishjain2009",
      "userUrl": "https://www.imdb.com/user/ur25085917",
      "reviewLink": "https://www.imdb.com/review/rw3150021",
      "warningSpoilers": false,
      "date": "28 December 2014",
      "rate": "9",
      "helpful": "3 out of 4 found this helpful.",
      "title": "One of the Best Comedy Show till Date",
      "content": "This show is one of the best we had on Indian television. It has great writing, great direction, great acting, great comic timing specially by Satish Shah one of the legend in Television Comedy. Satire and hypocrisy on the \"high class\" of Indian society is very well presented.Show has several running gag all throughout the season like rosesh's poetry, indravadan's childish prank, Maya's sophistication and hypocrisy, Monisha's middle class habits and stuck between them is Sahil. Great thing is even if these gags are repeated multiple times it is written in such a beautiful manner that you will never be bored from it. in fact each time this will make you laugh.I have seen this show multiple time after it went off air on youtube and still watch them whenever feeling bored.I will recommend it to everyone to give it a try. Giving it 9 out of 10 only because they did not produce second season even though at the end they hinted that they might come up with second season."
    },
    {
      "username": "laureny-90542",
      "userUrl": "https://www.imdb.com/user/ur74677222",
      "reviewLink": "https://www.imdb.com/review/rw3677522",
      "warningSpoilers": false,
      "date": "3 April 2017",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "The best sitcom on Indian TV",
      "content": "Love all the characters, specially Maya Sarabhai. Have so many memories with this show. Poems of Roshesh are hilarious! Beautiful direction, well written script. Such talented people and thoughts associated with it ! Need more and more and more.Thankfully they are coming back this year after the leap of 11 years. Looking forward to see it, very excited actually!"
    },
    {
      "username": "N1dhi",
      "userUrl": "https://www.imdb.com/user/ur162711072",
      "reviewLink": "https://www.imdb.com/review/rw8936470",
      "warningSpoilers": false,
      "date": "18 March 2023",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Season 1 - 10, season 2 - 0",
      "content": "This was my favourite hindi show after Dekh bhai Delhi and season 1 had me in splits.The chemistry of the cast and their dialogues is funny like hell. Missed the show when it was over and eagerly waited for the second season but hate hate hate the introduction of the new character jasmine.She couldn't keep up with the cast in terms of dialogue, comedy or acting. Every time she is on scene it breaks the organic vibe of the original cast. Any scene with the original cast will have you laughing till you are in tears but it does not work at all with her.What a disappointing development. You can watch 70 episodes of season 1 without needing a break but I couldn't sit through even one episode with this jasmine character.If you want to experience the actual humour of the show, watch season 1 and skip the second."
    },
    {
      "username": "trurohzes",
      "userUrl": "https://www.imdb.com/user/ur89353044",
      "reviewLink": "https://www.imdb.com/review/rw6190611",
      "warningSpoilers": false,
      "date": "20 October 2020",
      "rate": "10",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Awesome Season 1, Nostalgic Season 2",
      "content": "The best and smartest Indian comedy show till date. Season 1 was terrific, was in school when I watched it. Recently finished Season 2, it's simply too good. Bought back memories from my childhood watching all the cast come together. A big thanks to the cast for another season. New added characters also did a great job, Superb writing, amazing HUMOR. I would love to see another season, but doubt it will bear fruit."
    }
  ],
  "errorMessage": ""
}