{
  "imDbId": "tt0417299",
  "title": "Avatar: The Last Airbender",
  "fullTitle": "Avatar: The Last Airbender (TV Series 2005–2008)",
  "type": "TVSeries",
  "year": "2005",
  "items": [
    {
      "username": "mjplysaght",
      "userUrl": "https://www.imdb.com/user/ur25921696",
      "reviewLink": "https://www.imdb.com/review/rw3631815",
      "warningSpoilers": false,
      "date": "2 February 2017",
      "rate": "10",
      "helpful": "328 out of 338 found this helpful.",
      "title": "The best show Nickelodeon has aired",
      "content": "OK, so I was 12 when this show came out and needless to say, I was completely enamored by it. For a TV station like Nickelodeon, best known for its wacky shows like SpongeBob, Rocko's Modern Life and their sitcoms like Drake and Josh, to suddenly come out with this anime-inspired animated series with deep philosophical themes as well as tackling genocide and war, this was a massive step forward.Of course, this isn't the first form of media that has incorporated the power of the elements, but their method of how they do it here is remarkable. For every element to be adopted into its own nation, reflecting the psyches and philosophies attributed to the respective element is truly inspiring.All the characters are written for and performed expertly, save for maybe some of the guest characters (*cough cough* Jet). My favourite character by far is Zuko. The progression and development of this character is incredible and captures perfectly the transition from villain to antihero to hero. Aang is a good character too, but he's a bit of a goody-two-shoes half the time. Katara and Sokka are equally appealing characters, as well as Toph.The brilliance of this show is that it is perfectly paced. Sure, you get the occasional filler episode, but every episode (leaving out The Great Divide) has a purpose and adds more layers to this intriguing story and the world it is set in.Again, for a children's show to incorporate seriously heavy topics and still have a silly sense of humour is just impressive. I get annoyed every time someone stereotypes this series as just a 'kids show', brushing it off. This show can be watched by someone of any age, and that is one of the reasons I admire it so much. It's not pandering at all and tackles the heavy subject matter in a mature way.Sadly, after The Legend of Korra, Nickelodeon never seemed to follow in the footsteps of Avatar which I found upsetting. Kids need more shows like this, if I'm being honest."
    },
    {
      "username": "cuzzinman",
      "userUrl": "https://www.imdb.com/user/ur91406586",
      "reviewLink": "https://www.imdb.com/review/rw4350505",
      "warningSpoilers": false,
      "date": "21 September 2018",
      "rate": "10",
      "helpful": "305 out of 313 found this helpful.",
      "title": "Great show with fantastic messages, lessons, philosophical discussions, character development, plots, and comedy",
      "content": "This is show is one of the best shows ever created. There are many great lessons in this show that all people (adults and kids) should learn. The show delves into many branches of philosophy, including moral philosophy, that teaches people how to think critically and to always help and understand others. The show has a fantastic plot filled with great comedy and character development. The show has great action scenes as well! I highly recommend this show to everyone!"
    },
    {
      "username": "A_Different_Drummer",
      "userUrl": "https://www.imdb.com/user/ur44112735",
      "reviewLink": "https://www.imdb.com/review/rw3546654",
      "warningSpoilers": false,
      "date": "18 September 2016",
      "rate": "10",
      "helpful": "489 out of 527 found this helpful.",
      "title": "I just rewatched the best TV series in the history of the world",
      "content": "Hi there.It is September 2016, more than a decade this this series was done, and I will be your reviewer this evening.Our menu is simple -- we are only offering just one review and that review only comes with the very rare \"perfect score\" of 10. Sorry, no substitutions.I am a prolific reviewer here (over 1350 reviews) which is a polite way of saying I watch too much TV and have too much time on my hands.When I first watched this series I made the same \"mistake\" most reviewers do when reviewing anything for the first time. As good as it was, I \"assumed\" that over time something better would appear. But that never happened.So after 10 years I have given up. I just rewatched the whole series top to bottom and currently have a nice endorphin buzz going because this astonishing series just gets better as you go, and the final episode just plants a big smile on your face.Perfect writing, direction, story, dialog, animation, characters. And all with a chewy moral center.(And some really deep metaphysical concepts -- like the island where everything is connected. That is a reference to one of the oldest religions in the world.)I know what you are thinking. I tried to get into Korra but all I kept seeing there were the many errors the producers made in trying to improve on something which simply cannot be improved on.It is official. I am calling it.The best overall series in the history of TV.And it just gets better with age.((Designated \"IMDb Top Reviewer.\" Please check out my list \"167+ Nearly-Perfect Movies (with the occasional Anime or TV miniseries) you can/should see again and again (1932 to the present))"
    },
    {
      "username": "ericjcant-1",
      "userUrl": "https://www.imdb.com/user/ur7329240",
      "reviewLink": "https://www.imdb.com/review/rw1204417",
      "warningSpoilers": false,
      "date": "30 October 2005",
      "rate": "10",
      "helpful": "825 out of 861 found this helpful.",
      "title": "The best in animated storytelling...",
      "content": "Even though Avatar is of American origin, it has a lot of Japanese anime influence, particularly visually, but keeps the best of both animation cultures with it's American sense of playfulness and more realized characterization. The creators of Avatar have really crafted an artistic piece of fun and creative storytelling that is a rare gem for American TV. Avatar has strength in all the major areas of film and story, starting at ground level with an exceptionally believable world setting where war is taking place among the different nations. The main characters who find themselves caught in this struggle are three teens named Katara, Sokka, and Aang (the Avatar) who have set forth to bring harmony to the world through their influence and through the powers of the still developing Avatar. There is lot of humor and fun in this show, and you can't help but to really love these characters and their pets. But this is just the beginning of the glue that keeps you coming back. Great plots and stunning visuals are just as much of importance to the overall success of the show. The story lines are top notch, being both episodic in nature and chronologically integral from one show to the next. Each episode usually introduces a new and genuinely interesting opposition and/or characters to be overcome by the end of the show, and visually there is plenty of awe inspiring backgrounds and quality animation. With just enough well paced action, some sincere points of moral conviction (can you believe it), and witty humor makes the show a winning combination. This is entertainment for all ages, and definitely a must see."
    },
    {
      "username": "theblackscythe",
      "userUrl": "https://www.imdb.com/user/ur51463304",
      "reviewLink": "https://www.imdb.com/review/rw3069437",
      "warningSpoilers": false,
      "date": "15 August 2014",
      "rate": "10",
      "helpful": "307 out of 321 found this helpful.",
      "title": "A Statement On Perfection. True Unequaled Bliss.",
      "content": "This review will be very long. I adore this show with every fibre of my being, and view it to be a piece of animated perfection. I implore people to avoid the disgusting live-action adaptation by director M. Night Shyamalan, as it is a disrespectful sham that mocks everything that the show stood for and mastered.So as for the show itself, where to begin? Well let's start with the story overall. Avatar tells a complete a perfectly paced epic plot over the course of 61 22 minute episodes. The show contains several unique and beautifully detailed characters among its main cast, all of whom are given consistent and engaging development throughout. From family related guilt and angst, identity dilemmas and the characters constant, overarching and looming quest, the characters are pressed with many trials which actually truly change them over the course of their magnificent journey. Aside from the primary cast, many intriguing and varied side characters appear throughout the adventure. They offer comedic levity, new forms of drama and help to add to the deep mythological and philosophical backbone of the show. All characters are exquisitely written and voice acted, with not a badly portrayed among them. Next I will cover the show's borderline legendary animation. It is a sight to behold indeed. I believe I am justified in believing that such stellar production values will never again be pared with this level of artistic imagination again, at least not in my lifetime. The scope, creativity and energy of the shows animation is second to no other show, and it's balance of colour is never anything less than sublime. Aside from sweeping and moving visuals, Avatar also offers fast paced and unbelievably well choreographed action scenes (once again, second to none) and well timed slapstick comedy. Not only is the animation stunning, it is also staggeringly versatile. The show's epic mythos is also very strong, and demands to be deepened and added to (thankfully Korra is doing just that). It takes inspiration from Buddhist, Inuit, Western, Japanese and Korean cultures to deliver it's unique world, as well as many original and creative elements in conjunction with the more recognisable real world concepts. The show manages to weave philosophy and deep moral concepts within its world and characters, creating one of the most fleshed out fantasy worlds of the last several decades. In conclusion, what can I even say? I love Avatar: TLA more every time I experience it, and it is one of very few shows (or even films) which can provoke a primal emotional response from me each time I see it, without fail. It sends shivers down my spine, and puts a tear to my eye, leaving me totally satisfied and fulfilled each time. My favourite television show, of all time."
    },
    {
      "username": "KineticSeoul",
      "userUrl": "https://www.imdb.com/user/ur22171966",
      "reviewLink": "https://www.imdb.com/review/rw2322788",
      "warningSpoilers": false,
      "date": "11 October 2010",
      "rate": "9",
      "helpful": "42 out of 43 found this helpful.",
      "title": "One of the best animated shows I seen",
      "content": "This is a anime style cartoon that kids and adults will enjoy watching. It really is one of the best cartoon show I seen in a while, there is little to almost no flaw to this show. I really wished it was longer though, instead of just 3 seasons. It really is a memorable adventure, which has many elements that will keep your attention from beginning to end. Plus just about every characters in this show is memorable and not just the main characters either, and for a bunch of cartoon characters I actually cared about what happens to them. One of the best animated series I seen, and I highly recommend anyone that enjoys a good story in a cartoon to watch this amazing show.9.3/10"
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw2112481",
      "warningSpoilers": false,
      "date": "16 August 2009",
      "rate": "10",
      "helpful": "64 out of 67 found this helpful.",
      "title": "not just a great animated show or 'kids' show, it's a major show of this decade",
      "content": "Avatar The Last Airbender shouldn't be underestimated. For a while I didn't even look twice at it due to it being on Nickelodeon and me being past the age of watching anything on Nick aside from the classic Nicktoons or Nick shows from the 1990s. But word got around that it was really fantastic, a sort of Kung fu style show where a master goes from place to place having adventures. Turns out the people I heard the word from weren't kidding: the saga of Aang, the last airbender and Avatar, who masters the four elements (air, earth, water, fire) and has to save the world by stopping the power-hungry fire lord, Ozai, is as epic as anything I've ever seen. It's an achievement of storytelling that creeps up on you, and while the first season isn't perfect the second season delivers episode after episode that enriches the characters and makes us care about them as we would in, for obvious example, Star Wars.In fact, the only minor complaint I would have against the second season (not sure yet about the third) is that it borrows quite heavily from the Empire Stikes Back (i.e. the 'one-who-will-save-us-all' mythology from Joseph Campbell is off training with an old master, feels his friend(s) in pain and danger in the future, rushes off before finishing training, bad things ensue, etc). But really, all of the characters get developed quite well, and if anything the development of the character Prince Zuko, a scarred son of Ozai who has been banished until he can bring back the Avatar along with his banished uncle Iroh, is astonishing in its complexity. We don't care about this character at first, in the first season he comes off like a whiner with Iroh as the wonderful comic relief (think Pokemon if the brother and sister weren't so annoying). But by season two a whole other dimension comes into play: who are you, and what are you doing with yourself? The trek with the three main characters, and the extra characters like Toph (a little blind girl who is one of those great bad-asses you have to see to believe), is one that is sophisticated enough to bring in adults, and for kids it's often just rollicking fun when it isn't deep or dark. The villains are convincing and scary, the humor hits when it needs to (and sometimes it can be just downright trippy and hilarious, like the second episode of season two, the Cave of Two Lovers), and the animation is often breathtaking. As they say on the internet now: it's made of Win!"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2292409",
      "warningSpoilers": false,
      "date": "8 August 2010",
      "rate": "10",
      "helpful": "77 out of 84 found this helpful.",
      "title": "Brilliant",
      "content": "Recently, I replied to a thread on the Rocko's Modern Life boards, and I was absolutely shocked to learn that there were those who considered this as Nick's worst. Sorry, I disagree completely. Avatar:The Last Airbender in my opinion doesn't deserve to be included down there with ChalkZone and Rocket Power, if anything this is one of Nick's best shows along with Rocko's Modern Life, Ren and Stimpy and Angry Beavers.The concept may appear simple and basic on paper, but as the show progresses the storytelling is grander, more epic and perhaps even more powerful. The animation is excellent, the music is great, the writing is consistently strong and the stories are outstanding in my opinion. And the characters, heroes and villains, have depth to them and are very likable. Avatar:The Last Airbender also benefits from superb voice work.In conclusion, this is a brilliant show and somewhat underestimated. 10/10 Bethany Cox"
    },
    {
      "username": "Bluereviews4you",
      "userUrl": "https://www.imdb.com/user/ur100988276",
      "reviewLink": "https://www.imdb.com/review/rw5951945",
      "warningSpoilers": false,
      "date": "29 July 2020",
      "rate": "10",
      "helpful": "23 out of 23 found this helpful.",
      "title": "Saw for the first time age 25: one of my fav shows now",
      "content": "I'm not big on cartoons or the like but my husband had been asking me for years to watch the avatar. Well it came to Netflix so I said ok begrudgingly, thinking it was more so a show for him to enjoy his nostalgia and I definitely didn't think it would be enjoyable to see as an adult, assuming it was a kids show.I was very wrong! I loved the show, it's def one of my favorites. So wish there was more! It is humorous and touching, generally it put me in a good mood afterwards. I'll def rewatch it.The characters are all interesting and have great development. Scenes are beautiful. It's just a great show. Give it a watch!!"
    },
    {
      "username": "BadgerStorm4345",
      "userUrl": "https://www.imdb.com/user/ur113370202",
      "reviewLink": "https://www.imdb.com/review/rw5763263",
      "warningSpoilers": false,
      "date": "23 May 2020",
      "rate": "10",
      "helpful": "37 out of 39 found this helpful.",
      "title": "The Greatest American Animation of All Time",
      "content": "Avatar: The Last Airbender is a very mature show that can be enjoyed at any age. This show has some of the greatest characters of all time and all of them go through realistic character arcs that natural. Gorgeous animation and amazing music give the show a cinematic feel. Despite an incredible first season, each season improves its quality greatly and doesn't cease to surprise and amaze me. Avatar: The Last Airbender is a perfect animated show."
    },
    {
      "username": "Trixie_reviews",
      "userUrl": "https://www.imdb.com/user/ur28459710",
      "reviewLink": "https://www.imdb.com/review/rw4375336",
      "warningSpoilers": false,
      "date": "3 October 2018",
      "rate": "10",
      "helpful": "20 out of 20 found this helpful.",
      "title": "Breathtaking",
      "content": "I love it, it's amazing. It did have a few weaker episodes, but overall I can easily say this is one of the best anime I've ever seen. Most memorable too. The protagonists were very relatable and easy to root for. Although the show tried to convince us that \"the Avatar team members\" were just kids, they all looked and acted at least a few years older, especially Aang (he really doesn't sell a 12-year-old kid, especially in season 2 and 3). But that's a good thing. I liked it better for it. Prince Zuko is another great example. He was supposed to be around 16, but seemed more like 18, if not even 19. Again, I preferred it this way.Characters' archers were done splendidly. Especially Zuko's. His journey was by far the most transforming and I liked how he struggled to choose between good and evil. Aang's crush on Katara was cute at first, and I thought nothing of it, but then it has developed into something more, even if it did take a long time for it. Their love was definitely something to root for.And last but not least, Sokka and Toph. Both were absolutely amazing. One a warrior with a fun side, always saying something funny, but also really looking out for his sister and other friends, and the other a blind girl with unimaginable power. Even animal companions had their own characters. Loved it. And the finale! It was amazing. One of the best ones in the history of TV shows. \"Avatar\" really built up to it. Just go see it. I couldn't recommend more.PS: If you haven't watched yet \"The Legend of Korra\", which is supposed to be Avatar's sequel, please don't. It destroys everything \"The Last Airbender\" holds dear. You'll just end up depressed. instead, pretend it doesn't exist. Trust me, it's better this way."
    },
    {
      "username": "joshkej-84077",
      "userUrl": "https://www.imdb.com/user/ur85310416",
      "reviewLink": "https://www.imdb.com/review/rw4058229",
      "warningSpoilers": false,
      "date": "10 February 2018",
      "rate": "10",
      "helpful": "80 out of 84 found this helpful.",
      "title": "It's 2018 and I still watch this show",
      "content": "I grew up with this show and I can't imagine my life without it. It truly is not only the best cartoon series, but also one of the best series out there. With an incredible story, beautiful animation, amazing characters, great villains and awesome action sequences, it's simply flawless in every way possible.Season 1 starts off slowly but only because of the terrific character introductions and world building, introducing the lovable team of protagonists, Aang, Katara and Sokka, being chased by the angsty Prince Zuko, accompanied by his adorable and wise uncle.Season 2 is probably the best of the three, and introduces an awesome new character, Toph, and a perfect new villain, Azula. The animation also improves and is packed with action, emotion and epicness.The Final Season is also magnificent and the characters are at their best at this point, and so is the animation quality.Overall this show is a must! I've shown it to several kids and adults alike and they always end up getting hooked."
    },
    {
      "username": "salinaqvi",
      "userUrl": "https://www.imdb.com/user/ur108662740",
      "reviewLink": "https://www.imdb.com/review/rw5733080",
      "warningSpoilers": false,
      "date": "13 May 2020",
      "rate": "10",
      "helpful": "18 out of 18 found this helpful.",
      "title": "That's Rough Buddy",
      "content": "Where to begin with this series, despite being a series made for children, this is one of those rare shows that could be enjoyed by all ages. The journey that Aang and his team experience is some of the best character development I have seen with a particular praise for the redemption arc of a certain character which is the BEST redemption arc on television. The series tackles a lot of adult con-tent with humorous segments sprinkled in which helps balances the series out with a fantastic world not unlike anything else on television. There is a reason as to why this show has has persisted in the publics' memory and you have to see this to truly experience the legend of the last Airbender."
    },
    {
      "username": "Alex_Hodgkinson",
      "userUrl": "https://www.imdb.com/user/ur45288156",
      "reviewLink": "https://www.imdb.com/review/rw2997406",
      "warningSpoilers": false,
      "date": "13 April 2014",
      "rate": "10",
      "helpful": "33 out of 35 found this helpful.",
      "title": "Satisfyingly Well-Rounded",
      "content": "This series has brought out the child in me. I have been watching a series of TV marathons, and started to grow tired of the situation comedies which are there for humour and the serious dramas where everything is so dark and real. I wanted an adventure that is fun and I don't have to see all of the dark, realistic moments. This show was perfect for that. It brought out my inner child with its silly, fun and happy nature, yet still had an exciting, well rounded and intense story. It hit almost every mark.I disagree with people who say that if you dislike the first season, you'll dislike the rest. No, this series does change. I actually didn't really like the first season. It was too childish and relied on childish humour too much. The characters felt rather two dimensional and the story didn't appeal to me. But as the series progresses, the characters have turning points. You don't know when they change, but you can see that they're growing up. I didn't even know Aang (voiced by Zach Tyler) had changed until the last episode, where I realised that he had gradually became grown up and was no longer a naive child.You do gradually find yourself getting attached to the characters. They begin to feel three dimensional, which is a sign of a brilliant show. I even grew feelings for and felt sorry for who I assumed would be the main antagonist of the show. Zuko (voiced by Dante Basco) gradually gets his own back story. He's in his confusing hormonal year, sixteen. He can't tell right from wrong and is becoming his own person. Throughout the series, we see him gradually evolve until he makes a big change in the final season.Not only this, but for once I straight away warmed to a newly introduced character. 'Avatar: The Last Airbender' is certainly great with new additions. Toph (voiced by Jessie Flower) quickly became my favourite character due to how bad-ass and adorable she is in her own way. So 'Avatar' certainly succeeds with its characters, which is what I mainly look for in a show. Each character undergoes changes, which also changes the show from being extremely childish and rather boring to more of an intense, family show.Michael Dante DiMartino and Bryan Konietzko have both created an amazing, well rounded show. Not just these two deserve credit, though, as I believe each of the crew did an amazing job. Many writers and directors have contributed. It has a somewhat Japanese feel too it. I believe the writing in the show is Japanese, as well as parts of certain beliefs and lifestyles. It also looks very much like an anime. It's sort of like an American, children's anime. The Japanese influence is definitely noticeable.Quite possibly the best thing about the series is how well-rounded it is. There's a sense of accomplishment when you reach the end. The entire journey that the characters must undertake is explained at the beginning, and that journey is what happened throughout the show. We had the structure of the entire series right from the beginning, and that's what we got. We waited patiently, watching Aang on a long adventure with his friends, Katara (voiced by Mae Whitman), Sokka (voiced by Jack De Sena), Appa (voiced by Dee Bradley Baker) and Toph, until the huge, climactic finale which ended everything satisfyingly.So, as you can tell from my review, this is a brilliant series. Rounding my votes up (adding the ratings together and dividing them by the number of episodes), I got an average of 7.9/10. That's mainly due to the series being rather slow, in a way. It's well-rounded, but not all of the episodes are great. I would still give the series an 8/10, though, because I wasn't satisfied with the first season. The reason it got a 9/10 is because it is a children's show. I would have loved all of it as a child. So it isn't perfect, but it's better than an 8/10.This series brought out the inner child of me. It was fun, and adventurous and reminded me to enjoy certain things which I have forgotten about. I even began to find certain bits of child humour funny, such as Sokka's jokes at times. It deserves the attention is gets as it should fully satisfy both children and adult alike. Technically, I'm still a child, but I'm close enough to an adult to enjoy the stuff adults do. This series got everything right, and I enjoyed it more and more as it progressed. I look forward to one day seeing this series' successor, 'The Legend of Korra'.Edit: I finished the series earlier and I now, for some reason, extremely miss it. I'm considering giving it a 10/10 instead..."
    },
    {
      "username": "BoxwoodExpress",
      "userUrl": "https://www.imdb.com/user/ur71356826",
      "reviewLink": "https://www.imdb.com/review/rw3646589",
      "warningSpoilers": false,
      "date": "23 February 2017",
      "rate": "10",
      "helpful": "28 out of 30 found this helpful.",
      "title": "Best Cartoon In Existence",
      "content": "Haters gonna hate! This show is the best cartoon in the entire world! It's not supposed to be an anime, even though it looks like one. Avatar the Last Airbender was a strong show with good writing, acting, storytelling, art/animation, music, pretty much everything. It is set in an imaginative world where people have aerokinesis, hydrokinesis, geokinesis, or pyrokinesis. the Sozin's Comet four part series finale was the best of the series. Even in the filler eps it was still good, I mean watch Tales of Ba Sing Se. Overall this is the best show ever."
    },
    {
      "username": "poseyfan",
      "userUrl": "https://www.imdb.com/user/ur83316413",
      "reviewLink": "https://www.imdb.com/review/rw8225535",
      "warningSpoilers": false,
      "date": "11 June 2022",
      "rate": "10",
      "helpful": "13 out of 13 found this helpful.",
      "title": "The greatest TV show of all time. Yep, i said it.",
      "content": "Utterly fantastic show. Here are the things i love the most (trust me there are even more) Character development!!! Zuko is one of my favorite characters of all time. His redemption arc is awesome.Character moments. For example: Iroh forgiving Zuko. Need i say more?Visuals.Humor. Drink cactus juice!it's technically a kids show, but it's really for anyone.Compelling villians. I think azula is even scarier than the Firelord himself hahahaThe score!Satisfying Ending.Ok i think you get the idea.... Basically everything is great."
    },
    {
      "username": "haris_manda",
      "userUrl": "https://www.imdb.com/user/ur23932395",
      "reviewLink": "https://www.imdb.com/review/rw2444834",
      "warningSpoilers": false,
      "date": "17 June 2011",
      "rate": "10",
      "helpful": "15 out of 15 found this helpful.",
      "title": "The best out there",
      "content": "I never thought I'd say this, but this is one of the best things ever on TV. It is so mature, yet so childish; the perfect balance suitable for anyone. I am 16y old, and I find this show fascinating. There is so much wisdom in it, yet collided with humor and plain stupidity that you just can't say 'No' to this show. I am just glad they ended it the way they did, without bumping out the money of him, like people did to many shows. It started so naively, and ended so gloriously. What really made this show are characters; each and every one of them - from the king of the Earth Kingdom, to the very Avatar. There's a mix of 'sweet love' of childhood, 'sweet pain' of it, yet there are losses, honesty, discovery of the depths of the souls and so much more.I watched whole three seasons in three days, and I was swallowing all that I could get. Of course, I will watch show again, slowly, to consume all that it can offer. But from what I've seen, I know that this show is something that everyone should watch. It offers so much fun for the younger ones, so much guidance and wisdom for the teens of my age, and yet so much of everything for the elder ones. It is no wonder this show has great rating on IMDb, but I think it deserves even more, just because it IS the BEST on the world.If you didn't watch it, go buy it, WATCH IT NOW, you won't regret ONE SECOND of the time you watched it. 100 out of 10; even more."
    },
    {
      "username": "Rectangular_businessman",
      "userUrl": "https://www.imdb.com/user/ur13538926",
      "reviewLink": "https://www.imdb.com/review/rw2265330",
      "warningSpoilers": true,
      "date": "16 June 2010",
      "rate": "10",
      "helpful": "16 out of 17 found this helpful.",
      "title": "Very good series",
      "content": "This was a very good animated series. At first, one could think that it is something like \"Ben 10\" (Read: an American cartoon that tries too hard to imitate the visual style and characterization from anime series) but I ended liking this series. The animation is nice and detailed, the characters are interesting and have a great development while the plot advances, the storyline is complex and very well made, full of action, drama, comedy and mystery. Many of the elements of the story seem to be influenced by the mythology of China and India, and the result is simply incredible. The writers managed very well to keep the plot interesting, from the very beginning until the end. \"Avatar: The Last Airbender\" is one of the best cartoons ever produced by Nickelodeon, along with \"Invader Zim\", \"Rocko\" and \"Ren & Stimpy\" (Despite being completely different to those series) I highly recommend to anyone.10/10"
    },
    {
      "username": "EVON1TY",
      "userUrl": "https://www.imdb.com/user/ur47939660",
      "reviewLink": "https://www.imdb.com/review/rw8926223",
      "warningSpoilers": false,
      "date": "13 March 2023",
      "rate": "9",
      "helpful": "11 out of 11 found this helpful.",
      "title": "A unique world with different rules and great characters.",
      "content": "This Animated Serie is offering you something special. It actually starts with some simple way. A villain wants to find and kill the hero. But is it going to be that simple always? Not at all. Things are getting complicated.Through the seasons, some the characters evolves. I know some of them remains the same as White characters or Black characters. But those are not the reason why this serie is stunning. The grey characters that evolves. That's the reason why this series is unique.With that amazing intro you're diving into a great world with different rules and system. That great world is just extends more in every season. I don't know why but you'll love nearly all the charaters in this animated serie. Some of them aren't complex and some of them they don't have an effective background story but you're loving nearly each one of them. They all are unique and special in some way."
    },
    {
      "username": "dee.reid",
      "userUrl": "https://www.imdb.com/user/ur0892646",
      "reviewLink": "https://www.imdb.com/review/rw1443812",
      "warningSpoilers": false,
      "date": "9 August 2006",
      "rate": "10",
      "helpful": "39 out of 46 found this helpful.",
      "title": "An incredibly good show?",
      "content": "When I first heard of \"Avatar: The Last Airbender,\" I was more than a little skeptic. The fact that it was airing on Nickelodeon was probably the reason I just kind of shook my head. Then about three months ago, on a complete whim, I bought the first two chapters of \"Avatar: The Last Airbender\" on DVD from Barnes & Noble Booksellers and, boy, was I blown away! This is one of the most humorous, fun, action-packed, and generally all-around entertaining cartoons I've seen in the longest time. It's just a pity that shows like \"Avatar: The Last Airbender\" are such a rarity these days. I'll be turning 21 on the 12th of next month; 13 years ago around this time at the age of 7, I remember that Nickelodeon had some of the best of children's programming on cable television. Then, 10 years ago, Nick began to slide into idiocy and continues to do so as I write this. Then around 1999, I gave up on Nickelodeon and Cartoon Network completely. My opinion of both channels hasn't changed. But \"Avatar: The Last Airbender,\" what I presume is an attempt to add a little pseudo-Anime'-style animation to its lineup in order to catch stragglers from other cultures (and perhaps Nick-weary adults like myself), is a breath of fresh air for this once-tired soul. While I don't think today's kids may completely understand the overall significance of some of this show's philosophy, subtext and terms (how many 5-year-olds know what an \"avatar\" is?), they may not have to be versed in Eastern Thought to get everything. \"Avatar: The Last Airbender,\" a fusion of Eastern philosophy, Hinduism and martial arts, is set in a far-off land (dare I say, a Middle-Earth clone?) where four tribes rule the world and the most gifted members of each tribe have mastery over the Four Greek Elements: Air, Earth, Fire, and Water. The mastery of each of these is the term \"bending,\" the ability to manipulate each element and use it for creative or destructive purposes. The Avatar, a sort of Christ-/Buddha-like figure, has mastery over all elements and is the most powerful bender of all. The main plot of the story gets underway when the Fire Nation grows too powerful and sets off on a campaign of world domination. But they first need the Avatar, who has mysteriously disappeared. Prince Zuko, from the Fire Nation, is leading a mission to capture the Avatar and gain re-admittance back to his kingdom. Two Water Tribe teenagers, a brother and sister named Sokka and Katara, respectively, make the discovery of a lifetime when they find that Aang, a 12-year-old Airbender who was frozen in a block of ice and also happens to be the last of his kind, is the new Avatar. But he still has many skills to master in a very short period of time, and the show follows the trio's journey to the North Pole with the mammoth six-legged bison Appa and the lemur Momo. If only more shows on Nickelodeon could follow the promise that \"Avatar: The Last Airbender\" has. What boggles my mind about this cartoon is its style, which, it really has that is completely original, even though the influence of Japanese Anime' is obviously apparent. We get some fairly funny jokes here and there, way out-there philosophy, and kung-fu-style element-bending battles that are pretty hard to top; it's the single greatest piece of imagination in today's children's programming! But my praise for \"Avatar: The Last Airbender\" doesn't really restore my faith in this channel (unless they wipe the slate clean and bring back all the original programs from my youthful years), it just reaffirms a hunch that they do have an ounce of competency left when it comes to entertainment.10/10"
    },
    {
      "username": "MissSimonetta",
      "userUrl": "https://www.imdb.com/user/ur28071275",
      "reviewLink": "https://www.imdb.com/review/rw3063988",
      "warningSpoilers": false,
      "date": "7 August 2014",
      "rate": "10",
      "helpful": "19 out of 21 found this helpful.",
      "title": "We still haven't seen anything else like it",
      "content": "I became interested in this show after watching the disappointing first season of its successor, The Legend of Korra. I wondered why people loved it so and doubted it would impress. Well, thank God, I was proved wrong!This is a fantastic program, one of the finest fantasy series I have ever seen. The characters and their development are finely crafted. The world-building is nothing short of glorious. And though the story is your basic \"chosen one fights an evil empire,\" the show goes beyond black-and-white morality, with characters wondering about the moral implications of their actions.It's a shame Nickelodeon or any other channel has not had more animated fare like this. Sure, there was Korra, but the writing in that devolved quickly, and I only got a little bit into the second season before I gave up on it. This show is golden and should be seen in its entirety at least once if you love fantasy or adventure."
    },
    {
      "username": "purplepoka",
      "userUrl": "https://www.imdb.com/user/ur118906502",
      "reviewLink": "https://www.imdb.com/review/rw5769928",
      "warningSpoilers": false,
      "date": "25 May 2020",
      "rate": "10",
      "helpful": "17 out of 17 found this helpful.",
      "title": "I will never get tired of watching this show",
      "content": "It is amazing. Truly amazing.No matter what episode you start on, you get instantly hooked and wanting more. I've probably watched this show 10 times because there is truly nothing else like it. If there is, I have yet to find it. It may sound silly but this show holds a special place in my heart because that is how much I adore it."
    },
    {
      "username": "Styrophoamicus",
      "userUrl": "https://www.imdb.com/user/ur3420510",
      "reviewLink": "https://www.imdb.com/review/rw1441044",
      "warningSpoilers": false,
      "date": "6 August 2006",
      "rate": "10",
      "helpful": "88 out of 96 found this helpful.",
      "title": "Avatar",
      "content": "When I fist heard of Avatar: The Last Airbender, I was a little septic. It seemed like it would just turn out to be another cheesy, serialized anime whose only purpose is to make cash. That, and when I watched the first Avatar episode, I noticed that it wasn't a 'true' anime. Avatar is, what I call, 'hybrid' anime: in other words, anime created here in North America. This only added to my skepticism. I have had bad experiences with hybrid anime. Shows like Martin Mystery and Totally Spies are hybrids, and watching them nearly makes me gag. The anime style is chosen for no reason other than to attract audiences. Their movements are quick, jerky, and you can tell they try way to hard to mimic traditional anime style, but in that sense, they fail horribly. Their written is witless and linear (i.e: the jokes in Totally Spies all relate to some sort of stereotype of girls, like hair, nails, etc) and the plot lines are all contrived (i.e: every episode of Martin Mystery). Yet Avatar: The Last Airbender succeeded where all other 'hybrids' had failed. The anime style was chosen for artistic reasons, and each of the character's movements are very fluid, and almost reach movie quality. There are typical anime elements that give the show a surreal touch without taking it over the edge, such as Appa, the flying bison, or the Spirit World. The action scenes probably impressed me the most, as the animators focus mainly on the ensuing battle, and not so much as the reactions of the fighter's or the onlookers. Each battle has a point, as well, and not just some random duel. The character's are very well drawn out, not just in an animated-sense, but also the depth of each character. But more importantly, we see these characters evolve through their adversities, and we see how they struggle to cope with their tasks, which sometimes require them to question their morals. Again, the humour in Avatar is genuine, and always makes me laugh, whether it be a quick quip from Sako, the running joke of the Cabbage Man, or even the coincidential irony. Even it's serious moments are well written, and the character's words have a deeper meaning. One of my favourite quotes is, \"Part of being a man is knowing where you are needed\". But what impressed me the most is how deep Avatar actually goes. The show has it's own mythology that is easy to follow, but sports a deeper meaning. Each tribe or nation represents a different element, but the fire nation is the main antagonist in Avatar. Yet we gain insight as to why this is. Fire is probably the most dangerous element, as it is essentially alive, and can destroy almost anything. This give us insight into the fire nation's need for power. Yet the fire nation has its own morals too, and we occasionally see things from their side, a technique that helps us gain better understanding for the fire nation, and even creates pathos for character's like Prince Zuko. Each tribe has it's own special abilities, relating to their element, and this relationship between man and nature is a common motif that permeates through many anime movies and shows (Hayao Miyazaki's \"Princess Mononoke\" and \"Nausicaa\" are excellent examples of this). Various symbols of Chinese mythology also show up in the series (i.e: panda bear's, dragons, etc.) giving the show another level of depth. Avatar is, at its core, a story of growing up and facing fate, no matter how hard it is. I am so glad I was introduced to Avatar, and I am pleasantly surprised by its depth and wit. The voice acting fits the character's perfectly, and even the music is a joy to listen to. I would gladly recommend Avatar: The Last Airbender to practically anyone."
    },
    {
      "username": "antonwaas",
      "userUrl": "https://www.imdb.com/user/ur77894330",
      "reviewLink": "https://www.imdb.com/review/rw4047385",
      "warningSpoilers": false,
      "date": "29 January 2018",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "As Good As Animation Gets",
      "content": "Avatar: The Last Airbender is one of my favourite animated TV Shows. Awesome Characters, a fantastic World and an great Storyline awaits you in Nicks best and standout Series."
    },
    {
      "username": "ProjectAnomaly",
      "userUrl": "https://www.imdb.com/user/ur105954145",
      "reviewLink": "https://www.imdb.com/review/rw5873219",
      "warningSpoilers": false,
      "date": "1 July 2020",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Avatar: The Last Airbender",
      "content": "Emotionally taut and wonderfully animated. Great comedic timing, characters, and portrayals of the four elements."
    }
  ],
  "errorMessage": ""
}