{
  "imDbId": "tt0111958",
  "title": "Father Ted",
  "fullTitle": "Father Ted (TV Series 1995–1998)",
  "type": "TVSeries",
  "year": "1995",
  "items": [
    {
      "username": "didi-5",
      "userUrl": "https://www.imdb.com/user/ur0137908",
      "reviewLink": "https://www.imdb.com/review/rw0353048",
      "warningSpoilers": false,
      "date": "14 July 2004",
      "rate": "",
      "helpful": "103 out of 104 found this helpful.",
      "title": "Ah, go on, go on, go on ...",
      "content": "Where to begin in praise of Father Ted? This hilarious Irish comedy about three dysfunctional priests and their crazy tea-obsessed housekeeper came from nowhere to light up the Channel 4 schedules in 1995. Then it was critically slammed but gained a viewer following right from episode one, where Dougal thought a spider baby was real.Episodes to come featured boring Father Paul, mad Father Noel, gloating Father Dick Byrne, accident-prone Father Larry, and the permanently bewildered Bishop Brennan. But it was the core quartet of characters that kept you watching - Father Ted himself, the much missed Dermot Morgan; drunken and obscene Father Jack, Frank Kelly; vacant Father Dougal, Ardal O'Hanlon (who hasn't done much of interest since - 'My Hero' was awful); and Mrs Doyle, Pauline McLynn.Too many happy moments to list here but if you haven't seen this, prepare for a laugh. Life is never without incident on Craggy Island!"
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw6384682",
      "warningSpoilers": false,
      "date": "20 December 2020",
      "rate": "10",
      "helpful": "20 out of 20 found this helpful.",
      "title": "Glorious comedy.",
      "content": "Father Ted still ranks as one of the best sitcoms ever made, it is three series of the most glorious, zany, scream out loud comedy ever made.Whenever I think of Morgan's tragic death I always get so incredibly sad, it's one of those shows that needed to go on, go on, go on, go on......What can I say that hasn't been said before? I'll try something a bit different, whenever I feel sad or down I reach for this show, and within minutes I'm back to myself, such is the power of comedy here.I love each of the characters, but there was just something about Father Jack Hackett, he didn't need to speak, he just had an air of comedy about him.Speed three, Are you right there Father Ted and Hell are three favourites, but genuinely they're all classics.Will there ever be a show that's so funny?Thanks for the laughter Father Ted, 10/10."
    },
    {
      "username": "fibreoptic",
      "userUrl": "https://www.imdb.com/user/ur3045058",
      "reviewLink": "https://www.imdb.com/review/rw0353044",
      "warningSpoilers": false,
      "date": "22 April 2004",
      "rate": "10",
      "helpful": "83 out of 88 found this helpful.",
      "title": "One of a kind.",
      "content": "Never has there been a comedy series like this and never will there be one like this again. I've never been an avid fan of Father Ted (don't know why) but as a person who doesn't watch that much television anymore this certainly gives me an excuse to turn the tv on and be entertained. Has done for years. Extremely unique and funny i would gladly sit down and watch a Father Ted marathon and watch every episode back to back. What is rare for a tv programme/movie is that i actually havn't met a single person who dislikes Father Ted! My favourite episode is the one where the whistle gets stolen. Fantastic. Shame there will be no more series but thank ourselves lucky they made three fantastic series. An all time great."
    },
    {
      "username": "Sylviastel",
      "userUrl": "https://www.imdb.com/user/ur0033913",
      "reviewLink": "https://www.imdb.com/review/rw0353015",
      "warningSpoilers": false,
      "date": "8 February 2002",
      "rate": "10",
      "helpful": "45 out of 52 found this helpful.",
      "title": "This show might offend some Catholics but not me, I loved It",
      "content": "I have to say that I was surprised at my amazement of enjoying this Irish comedy. Sadly, the actor played Father Ted died in 1998. But he left us with lots of laughter and unforgettable scenes. It used to be shown on WLIW and they began putting warnings before the show. Then, it may have gotten a little too offensive for a New York Catholic audience. But despite everything, it is a classic comedic series. You'll laugh more than be offended. Maybe a few people in the television audience might answer their true callings of priesthood and sisterhood. We need more religious people. Maybe in a way, Father Ted shows a fun side of priest life without the stuffiness associated with it. Priests can and do have fun. They're even hysterical to watch over and over again. You can't forget the wonderful Mrs. Doyle as the bit crazed housekeeper to the priests. Don't miss the Lent episode and Father Stone episode. They are just too funny to miss up this show's offer."
    },
    {
      "username": "chocolate_frog",
      "userUrl": "https://www.imdb.com/user/ur0679719",
      "reviewLink": "https://www.imdb.com/review/rw0353019",
      "warningSpoilers": false,
      "date": "7 May 2002",
      "rate": "10",
      "helpful": "78 out of 82 found this helpful.",
      "title": "A comedy masterpiece",
      "content": "The day I moved to Ireland, I didn't know I was about to discover one of the greatest comedy series of all times as \"Father Ted\" certainly is!The basic plot in itself is amazingly simple, a stroke of genius: three \"peculiar\" priests and a housekeeper in an island off the Irish West coast. It's unbelievable how much fun, irony, satire, surreal humour and great characters can come out of so little. And if you are of Catholic extraction, the fun is even greater (we all have met a Dougal, a Ted or a Jack at some stage...)It's even too hard for me to pick a favourite episode: Ted and Dougal entering the \"EuroVision Song Contest\" with the excellent pop hit (and video clip) \"My lovely horse\"? Ted is believed a racist by the islanders and organises a great multi-cultural event? Dougal becomes a milkman only to discover that his life is in danger at Speed 3? Father Stone comes for a visit and for playing a bit of mini-golf? \"The Passion of St. Tibulus\" is being shown at the local cinema? Cigarettes, drink and rollerblades are given up for Lent? Bishop Len Brennan is kicked up the arse? Impossible to decide. I would recommend to anyone buying the complete series 1, 2 and 3 as they come out in DVD. You can watch \"Father Ted\" over and over and still laugh your head off.One of my favourite quotes:Dougal: \"Ted, was Jack really dead? How could he come back to life?\"Ted: \"I don't know, Dougal. I'd say he's resurrected from the grave...Like that fella...what's he called...E.T.!\""
    },
    {
      "username": "OscarBewildered",
      "userUrl": "https://www.imdb.com/user/ur2321404",
      "reviewLink": "https://www.imdb.com/review/rw0353034",
      "warningSpoilers": false,
      "date": "5 April 2003",
      "rate": "",
      "helpful": "49 out of 51 found this helpful.",
      "title": "Impossible to dislike.",
      "content": "How anyone can fault this remarkably funny sitcom is utterly beyond me. The comedy ranges from the most crude to the superiorly intelligent. I particularly like Dougal's (Ardal O'Hannon) take on the death of Kurt Cobain, offensive as it was. There is nothing to dislike about this; the characters are lovable (especially Dougal), they're hilarious and it is the most Irish humour possible. It's a big pity this show was not as renowned around the globe as it was in Ireland.Eleven out of ten, just for showing us how unsophisticated comedy can win over every time."
    },
    {
      "username": "Lupercali",
      "userUrl": "https://www.imdb.com/user/ur1187307",
      "reviewLink": "https://www.imdb.com/review/rw0353049",
      "warningSpoilers": false,
      "date": "17 September 2004",
      "rate": "",
      "helpful": "79 out of 95 found this helpful.",
      "title": "Amazing. One of the greats.",
      "content": "'Father Ted' came out during a period when I seldom watched TV, so it was purely by accident that I happened to catch an episode whilst at my parent's place. At first I thought it was going to be a fairly typical middle-of-the-road British sitcom, but it soon became evident that this veneer of normalcy was a Trojan horse, allowing in the show's pointed satire of The Catholic Church, and its wonderful, off-the-wall surrealism, mostly supplied by the young Father Dougal, some of whose utterances had me almost literally in tears.Take this dialog, when the islanders are convinced that some kind of monster is prowling 'the moors', taking sheep.\"They say it's as big as four cats, and it's got a retractable leg so as it can leap up at you better and you know what Ted, it lights up at night, and it's got four ears. Two of them are for listening and the other two are kind of back-up ears, and it's claws are as big as cups and for some reason it's got a tremendous fear of stamps and Mrs. Doyle was tellin' me that it's got magnets on it's tail so as if you're made out of metal it can attach itself to you, and instead of a mouth it's got four arses. \"Needless to say, after that, as a fan of the British surrealist tradition, I was hooked, and soon learned to love the other characters and the show as a whole.Perhaps what makes it so great is that it managed to combine satire and surrealism with other more conventional comic styles which appealed to my parent's generation (my mother is 71 and loved the show).If there was a finer sitcom to come out of the UK in the 90's, I don't know what it is. But then, I probably wouldn't."
    },
    {
      "username": "mmallon4",
      "userUrl": "https://www.imdb.com/user/ur55846361",
      "reviewLink": "https://www.imdb.com/review/rw3215100",
      "warningSpoilers": false,
      "date": "5 April 2015",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "My Favourite TV Show",
      "content": "Yes, Father Ted is my favourite TV show of all time. In the UK and Ireland, we quote this show as much as the rest of the world quotes The Simpsons, with so many lines and terms from the show becoming implanted into our psyche. I've been watching Father Ted since I was a kid and even though I didn't get off any of the adult jokes back then, the wacky and surreal humour always had me in fits of laughter. I don't think there's been a month in the last 17 years that I haven't watched one of its 25 episodes, yet I still can't pick a favourite!Every joke in Father Ted works on so many levels. The setting of the fictional Craggy Island is surely the most backward ended place on Earth but this is all brilliantly downplayed. Whenever anything absurd happens, the characters react in an unsurprised or not surprised enough manner. For example, when Ted discovers Craggy Island has its own Chinatown. Just how does an island off the coast of Ireland have a significant Chinese population and how does a person living there not even know about it?! I could take any joke from this show and list on multiple levels as to why it's so absurd and surreal. The inconsistencies and even the odd plot hole just makes everything funnier.I suspect one of the reasons Father Ted became so successful is that it dispelled the notion that the Irish are completely oblivious to the outside world in the sense that the characters talk about popular culture just like people in any other civilized county would. Granted the characters in every other sense don't act like people in the real world but I believe this one aspect made the show more relatable to a wider audience, from references to bands such as Oasis and Radiohead to various film references (Dougal, we are not watching Aliens!). I'm from Ireland and even to this day, I hear stories from Irish people who have gone abroad and meet people who think Ireland is technologically un-advanced country and that we all live in cottages. One story I always remember was an Irish guy telling me of how he told an American he owned an Xbox 360 and the American couldn't believe it.Allow me to hold up my cup of tea to Father Ted. May I continue to watch it for years, with Dougal and Mrs. Doyle and Father Jack forever and ever and ever and ever and ever and ever..."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw1248200",
      "warningSpoilers": false,
      "date": "27 December 2005",
      "rate": "",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Consistently hilarious and imaginative comedy series that stands at its peak",
      "content": "On the small parish of Craggy Island lives a group of three priests. The head of these is the ambitious but frustrated Father Ted Crilly, a man who feels, nay, knows that he is better than his lot. His young support is Father Dougal McGuire, a man who feels confused by anything and everything; and finally the old guard Father Jack Hackett, a man who feels rage, lust or sleepy depending on how much alcohol he has managed to get down him that day. They are looked after by the persistent and serving Mrs Doyle as they try to deal with the daily problems of their parish and being a Catholic priest in general.Although about seven years have now gone passed, Father Ted still stands up as a hilariously surreal and inventive sitcom based around the live of three priests living together. The plots range from the strange to the completely weird but generally they all work because the humour consistently comes off. It is hard to describe because it is filled with touches of genius, references that are not obvious, plots that are clever and silly and characters that are very well observed. It is certainly not the sort of sitcom that I'm used to seeing  although it does conform to a sitcom standard if you condense it right down to its base. As it is rather off the wall, it will not appeal to everybody but for those that get it the comedy is amazing consistent and I do struggle to think of an episode that I was class as \"bad\" across the whole run.Although his death was very unexpected, the loss of Morgan has allowed the series to simply stop and stand up as one of those programmes that went out on a high, rather than slowly fading away (like so many do  a true class act knows when to leave). With his death the show had no choice but to end completely (as opposed to the everlasting \"specials\" hell suffered by things like Only Fools & Horses) as such was the reliance on the cast that nobody could really replace him. He is excellent as Ted, the more \"together\" character who is still all over the place and has a great sense of comic timing. He so completely gets the humour that he makes for a great lead. O'Hanlon will forever be Dougal and his career has suffered as a result  his next project (the horrible \"My Hero\") essentially made him a Dougal-lite to significantly less effect. Here the writing is strong though and he really works well, contrasting nicely with Ted and often being a driver for the plot. Kelly has much more of a one-note performance but is still very enjoyable as such, while McLynn was always funny despite occasionally overworking her catchphrase. The support is roundly good from the other \"priests\" etc brought in as the plots require.Overall a manically imaginative comedy that conforms to the basic sitcom standards but vastly exceeds them in regards what it then does. The plots are rarely logical or sensible but within them the humour is sharp and rarely less than funny. Working with Catholic priests as its characters, the show could have just gone for easy targets but it doesn't and, although hardly respectful to the church, it is certainly not holding it up to ridicule in the same some think it is. An excellent series that deserves to continue to be seen for years and years to come."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1908813",
      "warningSpoilers": false,
      "date": "11 July 2008",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "My favorite comedy",
      "content": "I have long been a lover of British comedy, such as MONTY PYTHON, WAITING FOR GOD and THE VICAR OF DIBLEY, but I must say that my absolutely favorite of these shows is FATHER TED--though it isn't British. Let me explain. In the States, it's shown on BBC American AND marketed by BBC on DVDs. I thought it was another Brit-com but recently received an email from a feisty Irishman who insisted (correctly) it isn't British. Despite my mistake, it is a brilliant comedy and as good as anything that you'll see in the UK or the States. Ted is a Catholic priest cursed to being forced to serve in the most god-forsaken island in Ireland. In addition to Ted, Fathers Dougal and Jack are also forced to be in this purgatory because, let's face it, they are probably the worst priests in the entire church. However, Dougal is so incredibly thick and Jack is so incredibly ill-tempered, you really do feel sorry for Ted---even he doesn't deserve this! Their housekeeper is the ever cheerful and bizarre Mrs. Doyle.Unlike THE VICAR OF DIBLEY, where the Vicar is one of the only sane ones in town, in FATHER TED, the priests are definitely the most bizarre folks on the island. In each episode they prove that they are truly lovable misfits (again, other than Father Jack who is truly insane and dangerous).See this show. The writing is brilliant, the acting excellent and the show is so strange and funny you can't help but enjoy yourself. If you like this, see THE VICAR OF DIBLEY--it's nearly as funny and shows that the BBC (who released it in America on DVD and showed it on BBC America) can not only alienate the Catholics but Anglicans as well!"
    },
    {
      "username": "gibbs-18172",
      "userUrl": "https://www.imdb.com/user/ur103624323",
      "reviewLink": "https://www.imdb.com/review/rw4911046",
      "warningSpoilers": false,
      "date": "4 June 2019",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Fecking Brilliant",
      "content": "One of the funniest ever on T.V. No weak characters , no weak jokes . Such a shame that even though the 3rd series was the last that the tragic death of Dermott Morgan the day after filming ended the 3rd series as we may have had more specials.As it is The 3 series we are left with and a Christmas one.If you have not watched this do so, it took me over 10 years before i did by chance."
    },
    {
      "username": "blanche-2",
      "userUrl": "https://www.imdb.com/user/ur0342623",
      "reviewLink": "https://www.imdb.com/review/rw3205086",
      "warningSpoilers": false,
      "date": "19 March 2015",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "I'm Catholic, and I love it.",
      "content": "Irreverent, politically incorrect, and absolutely hilarious, Father Ted is a phenomenal series about three priests living on Craggy Island in Ireland. Talk about an outpost - the opening shot shows a house with nothing around it.The late Dermot Morgan plays Father Ted, not above a shady deal or two. He lives with Father Dougal McGuire (Ardal O'Hanlon) an impossibly stupid young priest, and Father Jack Hackett (Frank Kelly) an old priest who hasn't drawn a sober breath in probably fifty years. Helping them out is Mrs. Doyle (Pauline McLynn), a somewhat unstable housekeeper. It's obvious the priests have been sent as far away as possible to dwell in obscurity.It's very hard to choose a favorite episode, but I'm partial to Speed 3. My favorite part of that is Ted working feverishly at the blackboard while lots of discussion is going on. One poster mentioned the stolen whistle - I just saw that one, and it is hilarious. I also love the raffle, when they raffle a car in order to fix their leaky roof. And the vacation episode is a classic as well.A no-miss. There are only three seasons of this wonderful show, all well worth seeing. Great when you need a laugh."
    },
    {
      "username": "Dermot-6",
      "userUrl": "https://www.imdb.com/user/ur0745877",
      "reviewLink": "https://www.imdb.com/review/rw0353007",
      "warningSpoilers": false,
      "date": "2 October 2000",
      "rate": "",
      "helpful": "42 out of 50 found this helpful.",
      "title": "Drink, Girls, Arse, Feck!",
      "content": "This is one of the best things to come out of Ireland since U2. Dermot Morgan plays Fr. Ted Crilly, a priest on Craggy Island which is supposedly off the west coast of Ireland somewhere. However, Ardal O'Hanlon who plays Fr. Dougal Mc Guire and Frank Kelly who plays Fr. Jack Hackett, steal all the shows as far as I'm concerned.Graham Norton appears frequently throughout the series as Fr. Noel Furlong. He is very funny and my favourite episode of the series is Hell. This is where we meet Fr. Furlong for the first time. Ted goes on holidays to a caravan and he is already there with some youngsters from a youth club.Some great one liners that will remain in the Irish psyche for a long time to come. \"Drink, girls, arse, feck\", the immortal words of Fr. Jack for example. You are missing out if you haven't seen this series. Rent it out today or buy it. It is definitely worth buying the series on tape. Feckin brilliant."
    },
    {
      "username": "13Funbags",
      "userUrl": "https://www.imdb.com/user/ur68345682",
      "reviewLink": "https://www.imdb.com/review/rw4260178",
      "warningSpoilers": false,
      "date": "30 July 2018",
      "rate": "9",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Hilarious",
      "content": "This show is extremely funny. One of the best sitcoms ever, end of story."
    },
    {
      "username": "ronbell-23984",
      "userUrl": "https://www.imdb.com/user/ur81499083",
      "reviewLink": "https://www.imdb.com/review/rw4678174",
      "warningSpoilers": false,
      "date": "21 February 2019",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Frickin brilliant",
      "content": "This has to be one of the funniest comedy sitcoms made. Certainly the best one from the nineties by a mile. The stories and characters are hilarious and played perfectly. Hilarious."
    },
    {
      "username": "Artimidor",
      "userUrl": "https://www.imdb.com/user/ur16162453",
      "reviewLink": "https://www.imdb.com/review/rw2698209",
      "warningSpoilers": false,
      "date": "2 November 2012",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Three priests, two writers, one heavenly masterpiece",
      "content": "When the sitcom idea to portray the adventures of three priests in Ireland - a drunk, a dimwit and the main character in between - was pitched to TV executives, the reaction was lukewarm at best. Religion, a joking matter? Impossible! But well, \"The Vicar of Dibley\" with comedy heavyweight Dawn French worked, so the OK was given, all doubts aside. And thus it so happened that Arthur Mathews and Graham Linehan, writers with an edge, set out to delve into the rural conservative catholic setting and run the gamut, starting from the custom sitcom weirdness to out and out absurdity in the parochial house somewhere on Craggy Island. Not with the intention to ridicule the catholic church, but to follow through with everything it has developed into, to satirize its reality and at the same time humanize its unbalanced shepherds. Interestingly, it works.\"Father Ted\" gets off with a slow start, but once the characters and writers have hit their stride comedy-wise, the series delivers like no other. The Fathers Ted (Dermot Morgan), Dougal (Ardal O'Hanlon), Hackett (Frank Kelly) and Mrs. Doyle (Pauline McLynn) stumble from one farcical situation into another and the punch lines get sharper and wittier the longer the journey lasts. There's slapstick, well timed cartoonish back and forth, strong language and directness thanks to the naivety of the characters, yes, there's even cursing among priests and still it's entirely inconspicuous thanks to the changing of a vowel. And we get subversive social commentary served the fun way and it's, pardon the pun, a hell of a ride. If you book your trip to Craggy island you'll witness priests struggling through lent, have a crush on a lady visitor, go on a disastrous unholy holiday, turn into racists by trying to demonstrate the exact opposite and help to heal a depressed sheep. You can learn from priests how to get people to watch a raunchy movie thanks to their campaign against it, or how to kick a bishop up the arse - just pretend it never happened. Intrigued? Then off you go to visit undiscovered land in this highly original, creative, addictive and outright hilarious sitcom, a comedy milestone that will last for ages."
    },
    {
      "username": "Lone_Shark",
      "userUrl": "https://www.imdb.com/user/ur2478981",
      "reviewLink": "https://www.imdb.com/review/rw0353042",
      "warningSpoilers": false,
      "date": "14 January 2004",
      "rate": "",
      "helpful": "47 out of 50 found this helpful.",
      "title": "By God, it is hilarious!",
      "content": "With reference to previous comments, nobody in the Catholic Church (including me) has a problem with this show. It's absolutely hilarious, as will be evident to almost any viewer (assuming you have a decent sense of humour). In 5 words: Surrealist irreverent Irish priest comedy."
    },
    {
      "username": "Rabical-91",
      "userUrl": "https://www.imdb.com/user/ur41552750",
      "reviewLink": "https://www.imdb.com/review/rw3318090",
      "warningSpoilers": true,
      "date": "16 September 2015",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "''Feck off!''",
      "content": "There have been many sitcoms over the years with a religious theme - 'All Gas & Gaiters', 'Oh Brother!' ( which was followed by 'Oh Father!' ), 'Our Man At St. Mark's', 'All In Good Faith', 'Bless Me Father' and 'The Vicar Of Dibley'. 'Father Ted', in my view, wipes the floor with all of them.Father Ted Crilly is a priest who is banished to the desolate Parochial House in Craggy Island, off the Irish coast, for stealing charity money ( which he claims was 'just resting in his account!' ). Also living with him are Father Dougal MacGuire ( who is sent there following what is only known as 'the black rock incident'! ), a man so dense as to make Homer Simpson look like Sigmund Freud and Father Jack Hackett ( who is sent there following the unknown events of a wedding he performed in Athlone ), a cantankerous old git who is interested mainly in women and alcohol. Their mad housekeeper is Mrs. Doyle who is always seen supplying the priests with endless cups of tea, whether they want it or not.Other characters appeared from time to time including Ted's arch nemesis and rival priest Father Dick Byrne ( Maurice O'Donoughue ), bickering shopkeeping couple John ( Patrick Drury ) and Mary ( Rynagh O'Grady ), grotesque village idiot Tom ( Pat Shortt ) and fearsome Bishop Len Brennan ( Jim Norton ).'Father Ted' is a prime contender for the comedy hall of fame. Every episode is intelligently written ( though there is a fair share of slapstick on display as well ) and the fine cast - Dermot Morgan, Ardal O'Hanlon, Frank Kelly and Pauline McLynn - do the wonderful scripts more than justice. Like Dave Allen's comedy shows, 'Father Ted' attracted criticism in some quarters for its bashing of the Catholic church, though nationwide popularity defied all odds. Among my favourite episodes were the appropriately named 'Speed 3' ( a milkman exacts revenge on Ted and Dougal after they cause him to lose his job ), 'Song For Europe' ( home of the hilarious 'My Lovely Horse' song ), 'Flight Into Terror' ( a spoof of 'Airport '75 in which Ted endeavours to save the lives of passengers when a plane's cockpit goes into difficulty ), 'Cigarettes, Alcohol & Rollerblading' ( Ted, Dougal & Jack agree to give up their vices for Lent ), 'Entertaining Father Stone' ( the dour Father Stone makes himself an unwelcome guest in the Parochial House ), 'The Mainland' ( in which they meet Richard Wilson from 'One Foot In The Grave' ) and 'Kicking Bishop Brennan Up The Arse' ( Ted has to carry out the aforementioned task as a forfeit for cheating at a football match ).'Father Ted' ran for three series on Channel 4. Its star, Dermot Morgan, said prior to the making of the third series that it would be the last ( ''I don't want to be another Clive Dunn and go on playing the same character for years!'' he said in an interview ) but alas after completion of the final series, Morgan sadly dropped dead of a heart attack. He was 45. As a mark of respect, the first episode of series three was postponed for a week after its planned broadcast date. The final scene in the final episode in which Ted planned to commit suicide was removed in the interests of good taste and replaced with clips from the earlier series, backed up by the show's theme tune.Many of the surviving cast and crew went onto other things ( Ardal O'Hanlon went on to play George 'Thermoman' Sunday in 'My Hero' ) but 'Father Ted' remains unequalled. For those not already acquainted with it, go on, give it a go. Ah go on, go on, go on, go on."
    },
    {
      "username": "paulwattriley",
      "userUrl": "https://www.imdb.com/user/ur55597043",
      "reviewLink": "https://www.imdb.com/review/rw6577742",
      "warningSpoilers": false,
      "date": "8 February 2021",
      "rate": "9",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Hilariously Fantastic",
      "content": "On another level Comedy when you were allowed to be funny without offending the PR brigade. The only thing wrong with Father Ted is 25 episodes is not enough."
    },
    {
      "username": "ShadeGrenade",
      "userUrl": "https://www.imdb.com/user/ur7743887",
      "reviewLink": "https://www.imdb.com/review/rw1450668",
      "warningSpoilers": true,
      "date": "17 August 2006",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "\"More tea, Father?\"",
      "content": "Ecclesiastical sitcoms have always proved popular in the past - think of 'All Gas & Gaiters' ( starring Derek Nimmo ), 'Our Man At St.Mark's ) ( with Leslie Phillips ), and the underrated 'Bless Me Father' ( with Arthur Lowe ).'Father Ted' is nothing like these. Craggy Island, off the Irish coast, is a kind of dumping ground for failed clerics. Its main characters are white-haired, chain-smoking 'Father Ted Crilly' ( the late Dermot Morgan ), 'Father Dougal MacGuire' ( Ardal O'Hanlon ) and 'Father Jack Hackett' ( Frank Kelly ). Ted is the only normal character in the show ( he was sent there after allegedly pocketing charity money ). Dougal is so thick he makes Stan Laurel look like Einstein, while Jack's main obsession is drink ( and girls ). They have a housekeeper - the deranged 'Mrs.Doyle' ( Pauline McLynn ), who keeps urging them to drink tea. Other characters appear from time to time including Bishop Len Brennan ( Jim Norton ) and hyperactive 'Father Noel Furlong' ( Graham Norton ). Then there's 'John' ( Patrick Drury ) and 'Mary' ( Rynagh O'Grady ), a shopkeeping couple who hate each other but get all lovey-dovey when they see a priest. Ted's main rival is 'Father Dick Byrne' ( Maurice O'Donoughue ) of Rugged Island.The humour was firmly established by the title sequence in which Ted, Dougal, Jack, and Mrs.Doyle wave to an overhead helicopter, only for it to then crash! Its impossible to deliver an objective review of this show because everything about it is near-perfect. Graham Linehan and Arthur Mathews' surreal scripts are the funniest written for television since 'Fawlty Towers'. The Catholic Church came in for a bit of a battering, but no more than Dave Allen used to do on his show. My favourites include 'Song For Europe' in which Ted and Dougal bid to represent Ireland in The Eurovision Song Contest, a vengeful milkman menaces our heroes in 'Speed 3', 'The Mainland' had them meeting Richard Wilson ( as himself ), 'Nightmare' saw them on the caravan holiday from hell. Best of all was 'A Christmassy Ted', containing a classic scene as Ted, Dougal and a number of other priests endeavour to escape from the lingerie section of a department store.The show was always intended to end after the third series ( \"I'm collared out!\", said Morgan, in an interview ). But as soon as filming ended, tragedy struck. The star died of a heart attack. The last scene in the last episode had to be hurriedly reworked. After clips from earlier shows, it ended with a shot of Craggy Island Parochial House, and Dougal and Ted saying \"Goodnight\" to one another. Dermot may be gone, but he's left behind a classic that will last forever.If anyone even suggests remaking this fine show, I will personally throw them head first into Father Jack's underpants hamper!"
    },
    {
      "username": "azathothpwiggins",
      "userUrl": "https://www.imdb.com/user/ur25105932",
      "reviewLink": "https://www.imdb.com/review/rw7804078",
      "warningSpoilers": false,
      "date": "27 January 2022",
      "rate": "",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Blasphemously Hilarious...",
      "content": "FATHER TED is an immaculately uproarious show that's guaranteed to lift your spirits and resurrect your funny bone. There are simply NO bad episodes, only a steady stream of spew-out-your-beverage comedy.Lighthearted and satirical throughout, Ted (the late great Dermot Morgan), Dougal (Ardal O'Hanlon), Jack (Frank Kelly), Mrs. Doyle (Pauline McLynn), and a host of other zanies inhabit the incredibly desolate spot known as Craggy Island.The entire series (1-3) is watchable straight through, with limited bathroom breaks!If you have any sense of humor at all, do yourself a favor and watch this immediately, if not sooner..."
    },
    {
      "username": "JonanthanNewOrleans",
      "userUrl": "https://www.imdb.com/user/ur46356078",
      "reviewLink": "https://www.imdb.com/review/rw6091009",
      "warningSpoilers": false,
      "date": "13 September 2020",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "ABSOLUTELY HILARIOUS !!",
      "content": "This show is soooo funny, has its own style and personality, one of my all time favorite!!10/10"
    },
    {
      "username": "screenman",
      "userUrl": "https://www.imdb.com/user/ur9227049",
      "reviewLink": "https://www.imdb.com/review/rw1896637",
      "warningSpoilers": true,
      "date": "21 June 2008",
      "rate": "9",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Lord Be Praised.",
      "content": "If 'Red Dwarf' was the classic sitcom of the late 1980's, then 'Father Ted' lifted those laurels come the early 1990's.You just can't fail (unless there's something wrong with your sense of humour) to laugh out loud at some of the set-piece gags in this series. Four completely disparate people, a mad old priest, a young imbecile priest, and Father Ted as the comparatively normal one with whom we can often identify, share home with an almost equally bonkers house-keeper.Some of their adventures are quite surreal, whilst others are just grotesque parodies of the kind of normal dilemma most of us encounter from time to time.You pays your money and you takes your choice. Some episodes were only 'very good' and deserving just 8 stars. Others were beyond reproach and justified 10 stars. My award strikes a balance.Institutions are always good for poking fun. We saw this in 'Yes Minister' and many others. But religious institutions, with their overwhelming pompous vanity, are the stuff of absolute screams.If only Muslims had a sense of humour, what joy they could bring to the world. And no-one would have to be blown-up to do it. Or then again..."
    },
    {
      "username": "deloudelouvain",
      "userUrl": "https://www.imdb.com/user/ur58525162",
      "reviewLink": "https://www.imdb.com/review/rw7022796",
      "warningSpoilers": false,
      "date": "12 June 2021",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Laughing with religion, just my kind of humor.",
      "content": "Father Ted is another perfect comedy series from the United Kingdom, well in this case it's filmed in Ireland but still you get the point. It's one of those shows you can watch over and over (in my case I must have seen it at last five times). It's only three seasons (twenty-five short episodes in total) and to be honest they could have made much more as it's never boring. The adventures of Father Ted Crilly, Father Dougal McGuire, Father Jack Hackett and Mrs. Doyle are all funny, everything you wouldn't expect coming from the catholic church. It's repetitive humor, but even then it's never getting old. Faher Ted is one of my favorites British series, along with Fawlty Towers, Black Adder, or more recently The Office. It's timeless, very funny, and a keeper."
    },
    {
      "username": "paudie",
      "userUrl": "https://www.imdb.com/user/ur4017833",
      "reviewLink": "https://www.imdb.com/review/rw1964153",
      "warningSpoilers": false,
      "date": "22 October 2008",
      "rate": "10",
      "helpful": "10 out of 12 found this helpful.",
      "title": "Simply one of the Best Comedy Series Ever",
      "content": "The best thing you can say about Father Ted is that even though it is being constantly repeated on British and Irish TV channels it is still very funny. There is an almost irresistible temptation to watch an episode when you find one by accident while channel hopping.This is hard to explain to someone who hasn't seen the programme. Of the four main characters three are completely cartoonish. Dougal is thick, Jack is manky, Mrs Doyle is bizarre. Their characters don't change in any way but this doesn't stop them being funny.Perhaps it's the litany of even more bizarre characters that drop in on Craggy Island in each episode. The acceptance that the stories are surreal and not to look for any sense or realism in them will also help your enjoyment.Too much analysis from me. Whether you buy this DVD or just stop flicking to watch the second half of a random episode you will get plenty of laughs from Father Ted."
    }
  ],
  "errorMessage": ""
}