{
  "imDbId": "tt0412142",
  "title": "House",
  "fullTitle": "House (TV Series 2004–2012)",
  "type": "TVSeries",
  "year": "2004",
  "items": [
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2859424",
      "warningSpoilers": false,
      "date": "28 August 2013",
      "rate": "9",
      "helpful": "44 out of 46 found this helpful.",
      "title": "iconic character acting",
      "content": "Dr. Gregory House (Hugh Laurie) revels in solving the hardest of medical riddles. He chooses his team which changes over the years. Dr. Eric Foreman (Omar Epps), Dr. Robert Chase (Jesse Spencer), and Dr. Allison Cameron (Jennifer Morrison) are the three original underlings. Dr. James Wilson (Robert Sean Leonard) is his only true friend. Dr. Lisa Cuddy (Lisa Edelstein) starts as his boss.Hugh is a British actor playing an American doctor who has a badly damaged leg. He's a grumpy caustic know-it-all. Too bad for everybody else, he is almost always right. He is inevitably the smartest man in the room. Oh did I mention that he's a drug addict. It's master acting class from Hugh. It's physical. It's accent work. It's character work. It's a great character."
    },
    {
      "username": "blanche-2",
      "userUrl": "https://www.imdb.com/user/ur0342623",
      "reviewLink": "https://www.imdb.com/review/rw2727193",
      "warningSpoilers": true,
      "date": "28 December 2012",
      "rate": "10",
      "helpful": "35 out of 38 found this helpful.",
      "title": "A fantastic show, a fascinating character, a phenomenal actor",
      "content": "Hugh Laurie is \"House, M. D.\" in this eight-season show, also starring Robert Sean Leonard, Jesse Spencer, Omar Epps, Lisa Edelstein, and, at various times, Jennifer Morrison, Peter Jacobson, Olivia Wilde, Amber Tamblyn, Charlyne Yi, Anne Dudek, and Odette Annable.The setting is a New Jersey hospital where Gregory House, M. D., (Hugh Laurie) the brilliant, infantile, inappropriate, rude, and often downright mean physician is the head of Diagnostic Medicine. The character, like the Vincent D'Onofrio character on Law and Order: Criminal Intent, is based on Sherlock Holmes, and House can certainly diagnose the most obscure disease. His staff is his sounding board and also make suggestions, despite having the gamut of emotions toward him, ranging from fear to sexual attraction.In his eight years on the air, House stalks and later romances the head of the hospital (Edelstein), pranks Wilson (Leonard), the only person who can tolerate him, is himself hounded by a police detective who hates him, goes into rehab for his Vicodin addiction, and goes to prison, all the time suffering intractable pain in his nearly-destroyed leg. He also forges prescriptions, hires actors for various reasons, gives himself as the name of everyone's Secret Santa, steals food off of cafeteria trays as they go by, and various other things that do not endear him to many. And his interest in the diagnostic puzzle enables him to save many lives -- but for House, that's just a byproduct.House is played to perfection by British actor Hugh Laurie. For everyone who complained about his accent, I usually can spot a British actor speaking with an American accent right away. Laurie not only has an American accent but has lowered the timbre of his voice. When I first saw him in an interview speaking with his British accent, he seemed dubbed! In fact, even after seeing another series of his, the British accent coming out of his mouth is still the one that doesn't seem natural.Laurie carries the show, but he has wonderful writers, directors, producers, and actors behind him that put the show on the highest level possible. The rest of the cast is terrific - the adorable Spencer, the underplayed Leonard (whom I have seen on Broadway twice), the beautiful Morrison, the troubled Taub, the elegant and sexy Edelstein -- the dynamics of House's staff change with the people, but every actor makes a strong contribution. And each character's story is interesting and fully developed.I can't recommend this series highly enough. Some of the episodes are thought-provoking, like the one where House and his staff have to care for a third world dictator bent on genocide, some are gut-wrenching, others funny, tragic, or poignant, but they're always absorbing and beautifully done."
    },
    {
      "username": "ahmedgorshy",
      "userUrl": "https://www.imdb.com/user/ur106582401",
      "reviewLink": "https://www.imdb.com/review/rw6119794",
      "warningSpoilers": false,
      "date": "24 September 2020",
      "rate": "10",
      "helpful": "76 out of 84 found this helpful.",
      "title": "Simply House is the best medical series made or will be !",
      "content": "Simply House is the best medical series made or will be! If you happen to read my previous reviews, you will know that I do not like long interviews, in short, House is the best medical series that is integrated in all of its 176 episodes . My rate : 9.7"
    },
    {
      "username": "enddust",
      "userUrl": "https://www.imdb.com/user/ur0180067",
      "reviewLink": "https://www.imdb.com/review/rw0987335",
      "warningSpoilers": false,
      "date": "29 December 2004",
      "rate": "",
      "helpful": "282 out of 319 found this helpful.",
      "title": "Finally, a network show I like. .",
      "content": "So I like medicine and mysteries and watched CSI the first couple of times but got bored quickly with the repetitive format and self-important characters. Nowadays there's usually not that much in the way of mystery shows on (US) TV anymore--cop shows, sure, but mysteries? And while ER is certainly a quality show, I never really cared that much for it either--too much like a daytime soap but with blood. \"House,\" however, seems a nice combo of medicine, mystery, and character. Hugh Laurie's Dr. House is someone you feel guilty loving because he's so arrogant and callous, but he keeps you entertained because you can't wait to hear what he'll say next. House loves to tell the truth as he sees it, cutting through the nice happy lies that your average urban US adult tells and believes, never mind the hurt feelings he might leave lying bleeding by the roadside. But of course, his character *may* hide a heart of gold, so in the end he's trying to do the right thing. Sure, it's a formula, and House is even a stock character maybe, but it works.If the creators/writers are smart, they'll allow a little character development, especially amongst the excellent supporting cast, but not ruin it by changing House or allowing him a romance with either of his female costars. Keep that sexual tension going!For fun, catch Hugh Laurie--who is British by the way--sometime on one of the seasons of Black Adder (usually rebroadcast on PBS, but also available at better video rental shops). He plays a complete idiot and is as convincing in that role as he is as the brilliant and misanthropic Dr. House. . ."
    },
    {
      "username": "acedj",
      "userUrl": "https://www.imdb.com/user/ur96416540",
      "reviewLink": "https://www.imdb.com/review/rw5223951",
      "warningSpoilers": false,
      "date": "30 October 2019",
      "rate": "10",
      "helpful": "12 out of 12 found this helpful.",
      "title": "Brilliance",
      "content": "This is my all time favorite television show. This is based on anything that falls within this category, from Game of Thrones on HBO to Stranger Things on Netflix, this is the best of the best. I remember, quite vividly, sitting down to watch the pilot, and I was almost instantly hooked. Here we were presented a medical show with a doctor that did not hide behind social norms, was not kind, but damn it, he would find out what was killing you. He always did, consequences be damned. I have long been a fan of Holmes, the books not the Downy JR. movies, and this show is the next best thing to the great detective. I was deeply sad when this went off the air, but he will live on in perpetuity in my movie collection. House, was Mr. Laurie's crowning achievement in acting and the best show to ever grace my TV screen."
    },
    {
      "username": "dspman11",
      "userUrl": "https://www.imdb.com/user/ur37609885",
      "reviewLink": "https://www.imdb.com/review/rw2703330",
      "warningSpoilers": false,
      "date": "12 November 2012",
      "rate": "10",
      "helpful": "84 out of 88 found this helpful.",
      "title": "One of the most intelligent programs in television history - not your average medical show",
      "content": "I never paid much attention to \"House MD\" when it first premiered. I heard from a couple of people that it was basically the same thing every episode: Impossible disease to diagnose, House messes with his team, House suddenly solves the case.But one day when I was bored, I switched the TV to House. And it happened to be the Season 6 finale (titled \"Help Me\"). Going to be honest, it blew me away. I did not know what was happening to the characters at the point in the story, but the acting was fantastic. The atmosphere was superb. The complexity of Dr. Gregory House intrigued me. I saw him as a tragic hero (something you find in works of literature) and his tragic flaw was his leg. Not only the physical limitations brought on by his leg, but the mental ones as well. The pain he suffers day by day that lead him to be the man he is. You see House as an ass...but you feel for him, because you know why he's an ass. Also, Hugh Laurie does such a good job with his accent, if I had not watched \"A Bit of Fry and Laurie\", I probably never would have guessed Hugh was British.\"House\" is like a beautiful novel. It has its themes from episode to episode, and it has its overall themes as a television show. It is a work of art, and I hate that so many dismiss it because of its premise in a hospital. I have watched every episode of \"House\" since I first saw it and those were many hours well spent. If you've never seen it...the Complete Series is on DVD now!"
    },
    {
      "username": "GaMEChldREBORN",
      "userUrl": "https://www.imdb.com/user/ur3279399",
      "reviewLink": "https://www.imdb.com/review/rw0973689",
      "warningSpoilers": false,
      "date": "7 December 2004",
      "rate": "",
      "helpful": "657 out of 722 found this helpful.",
      "title": "The most brilliant medical show to date",
      "content": "House is a brilliant show medically speaking but so much more than that at the same time. The show is a kind of \"24\" meets medicine extravaganza. The main character, Dr. Gregory House, is played beautifully by Hugh Laurie. Dr. House is a bitter but brilliant doctor who is crippled in one leg due to the inability of doctors to properly diagnose his problem in time. This makes him a decidedly bitter person when dealing with others yet he is one of the best doctors in his field of diagnostic medicine. He is being forced to serve his clinic hours that he had avoided for a number of years, and this is where the show takes place; in a walk in clinic. Each show is a mysterious new case that puts the patient's life on the line as time runs out. I am disheartened by all of the bad comments people are making about this show, but everyone I have seen this show with and everyone I have shown the show to love it and find it enormously entertaining, funny, and brilliant."
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw5923899",
      "warningSpoilers": false,
      "date": "21 July 2020",
      "rate": "10",
      "helpful": "23 out of 26 found this helpful.",
      "title": "I absolutely love this show so much, seen several times!",
      "content": "Hugh Laurie master of being head doctor, jerk, sophisticated, and quirky! This show is so enjoyable it gives me goosebumps often. House M.D. is so well done very much deserves the 2 Emmys earned. Filled with complex circumstances that are bumpy with many accurate or mishaps but more wins than not throughout. The characters go through a lot which is intriguing and always entertaining! Even the simple patients are always worth seeing. I love the show and all interesting facts around it!"
    },
    {
      "username": "NerdyNinja49",
      "userUrl": "https://www.imdb.com/user/ur34483296",
      "reviewLink": "https://www.imdb.com/review/rw3154179",
      "warningSpoilers": false,
      "date": "2 January 2015",
      "rate": "8",
      "helpful": "38 out of 40 found this helpful.",
      "title": "It's Lupus!",
      "content": "Normally when I watch a series, I mildly enjoy it and wander through the series mindlessly, particularly with sitcoms. On very rare occasions, a show will pop up that I enjoy the main actor so much I follow him around for a couple years. This happened with House. Hugh Laurie plays the part so perfectly and does this incredible thing where you absolutely hate him and love him at the same time. You want him to be happy, but you also can't help but feel like he deserves some of the things he goes through. The thing that impressed me the most about House is the fact that House stays House from the first episode of season one to the last one of season eight. His personality doesn't waiver for one second, and that's a feat in and of itself. While all of the medical jargon wasn't necessarily accurate and they had a habit of people coughing up blood in almost every episode, I did find it far more fascinating than any of the crime dramas that pop up. That might just be my personal opinion. It did get old the last couple of seasons though. \"It's lupus!\" Probably the best part of the whole show was House and Wilson's relationship. All of my favorite moments surround their crazy shenanigans. Like the chickens. Ah, the chickens... The worst part is when it's over. You are depressed for a few days. You know a show is good when it does that to you. I wholeheartedly recommend you go watch House."
    },
    {
      "username": "bch035",
      "userUrl": "https://www.imdb.com/user/ur2786105",
      "reviewLink": "https://www.imdb.com/review/rw0974160",
      "warningSpoilers": false,
      "date": "7 December 2004",
      "rate": "",
      "helpful": "1,112 out of 1,222 found this helpful.",
      "title": "Interesting bordering on excellent",
      "content": "Great show, despite what others say, especially if a show like ER doesn't appeal to you. House is a unique character to be appreciated among the saps of TV nowadays.I must say something to Hugh Laurie. People complain about his accent. He's English playing an American. I lived in England for a year on exchange. I'm an American. Though I'm no expert on accents, I have to say I didn't notice that Hugh Laurie had any sort of English accent. A slight accent can show if you're really looking for it, but, other than that, he's version of an American accent is great.House is a great show, but it's not for the weak of heart or weak of stomach. It's not like ER at all. House is like the Sherlock Holmes of medicine. It's a drama without the screaming and tears.Sorry if this is a horrible comment, but it's my first review on IMDb of a show :)"
    },
    {
      "username": "GMP1",
      "userUrl": "https://www.imdb.com/user/ur0242960",
      "reviewLink": "https://www.imdb.com/review/rw0984056",
      "warningSpoilers": false,
      "date": "23 December 2004",
      "rate": "",
      "helpful": "215 out of 255 found this helpful.",
      "title": "Fine \"medical detective\" show",
      "content": "I'll admit that the main I reason I first watched this show was to see Hugh Laurie in a drama series. Besides his role in the film \"Peter's Friends\", I mainly knew his work from his comedy roles in \"Blackadder\" and \"Jeeves and Wooster\". Now, having seen him in \"House\", I find that he's a fine dramatic actor, as well. From previous reviews, you'll have read that Laurie plays Dr. House, an ill-tempered, disabled yet brilliant physician who doesn't like patients, but is challenged by unusual ailments. Aided by a small team of younger doctors, he tries to figure out a correct diagnosis and treatment. In the meantime, he also must deal with patients that he is forced to see in the hospital's walk-in clinic. As noted, Laurie's performance is very good; the early talk about an Emmy nomination for him is quite justified. The rest of the cast is also good, though the scripts have yet to fully examine each character. (Viewers may remember Omar Epps from his earlier medical role as the ill-fated Gant on \"ER\".) The stories, while set up as brain-teasers, are also refreshingly complex about the doctors, the patients and the hospital; they don't resort to the done-to-death \"HMO's are the source of all evil\" plot line. These doctors are brilliant, but not perfect; mistakes are made. In the end, I hope that Fox will allow the show to continue. It's good to see an interesting medical show on TV, now that \"ER\" has degenerated into a \"tragedy of the week\" soap opera. And, as for Hugh Laurie's accent, I've heard better, but I've heard a lot worse. Give him time. (In a recent episode, he got to use his native English accent for a joke.) One important note: \"House\" is not for the squeamish. There are some pretty graphic and disturbing scenes in the series that some viewers may find upsetting. (For example, one episode featured critically ill infants and pulled very few punches.)"
    },
    {
      "username": "forever_swirl",
      "userUrl": "https://www.imdb.com/user/ur3876250",
      "reviewLink": "https://www.imdb.com/review/rw0978354",
      "warningSpoilers": false,
      "date": "14 December 2004",
      "rate": "",
      "helpful": "677 out of 753 found this helpful.",
      "title": "You must watch this show!",
      "content": "\"House\" is one of the best new shows of the season that no one is watching.Yes, it is another medical drama (and haven't we seen enough of those?) but what this show lacks in originality it makes up in character. Namely - Dr. Greg House.House is a cranky, cynical highly intelligent doctor with a limp that specializes in weird medical cases. Each week he, and his team of fresh faced young doctors, tackle some new medical mystery. With the use of CSI camera views and mouth-numbing medical jargon, the show tries not to bore you to tears with the specific case.Still, though the cases are entertaining and puzzling, that's not why you should watch this show.Unlike most stale TV cop/medical/lawyer shows out there, \"House\" doesn't focus on the cases alone. Week by week we actually get a chance to...GASP!...learn about the characters! But the character that everyone will be obsessed with his Hugh Laurie's Dr. House.House, even though cranky and unlovable, is a sweet guy at heart. He's the type of guy you want curing you. Though he rarely visits his patients, at least he doesn't sugar coat things for you. He will call you an idiot to your face and you'll love him for it. Each time you watch you'll want to know what else he likes besides \"General Hospital\" and Vicadin pills.Dr. House is hiding out Tuesday nights at 8pm amid all the other bored-with-their-jobs characters. Whenever you're sick of case obsessed Gil Grissom or any Law and Order detective, tune into \"House\".I promise you'll at least leave with a fresh feeling in your brain."
    },
    {
      "username": "cosmic_quest",
      "userUrl": "https://www.imdb.com/user/ur1935875",
      "reviewLink": "https://www.imdb.com/review/rw1665752",
      "warningSpoilers": false,
      "date": "31 May 2007",
      "rate": "9",
      "helpful": "24 out of 29 found this helpful.",
      "title": "One of the best things on the box",
      "content": "'House' is like a breath of fresh air to television screens. It's an intelligent show complete with solid, interesting characters in a sea of bland, predictable and repetitive shows that bombard the airwaves. The show revolves around diagnostician Doctor Gregory House, a bitter and antisocial cynic whose heightened intelligence leaves him with little patience for most people around him. On the surface, he has little interest in patients and instead it is solving the puzzle of their ailment that draws him in but we see many subtle instances which prove he does have a heart for both his patients and his friends. Reeling him in are his best friend Doctor James Wilson, who sees House as fulfilling his need to be needed, and his boss Doctor Lisa Cuddy, one of the few who can give House as good as he dishes out in terms of insults. Training under House as his fellows are Robert Chase, Allison Cameron and Eric Foreman, who all realise what a trial their job (or rather, their boss) can be at times.Hugh Laurie, in the title role of House, is absolutely perfect. He is able to depict House's startlingly genius IQ that is intertwined with his childishness and sullenness, which, in turn, hide the fact he does care for his patients and those close to him. As such, he turns what could have been an detestable character into one the audience can like. Robert Sean Leonard also delivers a strong performance as Wilson in a manner that shows the character's kindly yet, at times, manipulative nature. The chemistry between Laurie and Leonard is excellent, which is essential in portraying the complex friendship between House and Wilson. Lisa Edelstein, as Cuddy, excels in playing the school marm to the eight-year-old boy House can be without comprising the deeper attributes of the character. Jennifer Morrison, Jesse Spencer and Omar Epps, as House's three fellows, also shine through in displaying the individual traits of their characters and how each interact differently with House.One of the first things that drew me into the show was the sarcastic humour. Almost everything that comes out of House is humorous, even if it does make the person he is speaking to cry! House is a true anti-hero, inherently a good guy but is willing to do whatever it takes to solve his puzzle regardless of patients' views and colleagues' opinions. The character probably has also done more for disability awareness (House walks with a limp and is in chronic pain after suffering an infarction to his right thigh) than any PC government campaign. Here we have a show that isn't afraid to depict a disabled person acting like an arrogant oaf at times instead of being as some sort of glowing hero and example to us all, as most shows enjoy doing when portraying a character with disabilities.The show is more like a detective drama along the lines of 'Law and Order' with medicine as opposed to a purely medical show like 'ER'. As such, there is more time dedicated to development of the characters as they go about trying to cure their patient. Everything is portrayed in a darker adult manner and there isn't too much focus on romance (which can ruin a show). Story lines are meaningful and involving, with no softly option taken in showing the realities of life and death. That said, the medical aspects on the show are almost always realistic.'House' is a highly recommended show for those looking for something put together with intelligence and adult characters who act like adults instead of over-grown adolescent children in high school. Long may it continue!"
    },
    {
      "username": "mndoc",
      "userUrl": "https://www.imdb.com/user/ur4745363",
      "reviewLink": "https://www.imdb.com/review/rw1015157",
      "warningSpoilers": false,
      "date": "6 February 2005",
      "rate": "",
      "helpful": "1,449 out of 1,517 found this helpful.",
      "title": "My kind of show",
      "content": "Let me put it simply. I am a physician, and as an inviolable rule, I HATE medical shows. Granted, TV series tend to be one dimensional, due to inherent difficulties in the genre, but \"doctor shows\" are something I avoid like the proverbial plague. And then one evening I caught \"House, MD\" and was completely drawn into the show. In House I find the anti-hero that I've been waiting for in a medical show. The guy who knows everything, but is wrong often enough to keep us all guessing. I enjoy the contrast of House and his cadre of young fresh faced colleagues, complete with starched white lab coats, who struggle as much with their professionally imposed constraints, and sense of decorum, as they do with his personality. And, wonder of wonders, the use of ironic and tragic comedy is without peer in what I've seen in the TV world in recent memory. In a nutshell, I really never know what any given character will say or do and it's that freshness that will keep me coming back for more. Somewhere there is a team of writers who actually know their craft, and an acting ensemble that knows how to pull it off. Now I can watch my TV one hour a week........"
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1671275",
      "warningSpoilers": false,
      "date": "9 June 2007",
      "rate": "10",
      "helpful": "14 out of 17 found this helpful.",
      "title": "certainly the most entertaining, riveting, and wholly satisfying medical show on TV, at least now",
      "content": "When one gets a little tired of there being too much about the doctors and not enough about the patients- or at least that so many overlapping characters and plot lines get thrown together- on ER, there's the temptation to go elsewhere. For fans that is; I was always more of a casual admirer of the show, but couldn't really get into medical dramas in general. House MD, however, is not so much about your typical medical drama, even if it does appear to be. Watching it for a few minutes it will look like a standard: doctors try and figure out what's wrong with a patient, with it being more like a scientific process then one might expect, and it's not always 100% guess right. The difference is, we get a wonderful mix of doctor characters who are given just the right moments of development and exposition and strong and captivating medical cases varying from episode to episode. It's structure then, in a sense, is like Law & Order, only with the predictability factor eschewed by the fact that the character of House, and his staff (which may come under some change in season 4 if it comes), are not kept as simple expository units for the plot. It is, even with its cynicism level sometimes quite high due to its main character, probably closer to life than we might think watching the high melodrama on ER.And, of course, it's Hugh Laurie that will either draw a viewer in or just make him/her think 'he's what all the hoopla is about?' Laurie, who's already won an Emmy &/or Golden Globe for his performance, is like a consummate professional only with the level of sarcasm one would expect from Garfield the cat, only if he weren't a cat but a, well, Vicodin popping screwball in his early 40s. He's always got a remark around the corner, or maybe two in thirty seconds depending on the situation or who's in the room, and Laurie makes House never into a caricature, and even makes him compelling when the drama has to get sky high (i.e. getting off Vicodin, a major crisis with a patient, a crisis with one of his fellow staff like Foreman's viral infection). He's like one of those cool detective heroes on those mystery shows from the 60s and 70s, only more acidic with his tone and, in his strange way, more sympathetic then one might expect. At the same time Laurie is surrounded by supporting players up for the task, and handles guest stars just as well.Overall, it's not just another simple medical drama but more of a tragic-comedy where the errors spell big problems, and the two sides of saving someone's life and making quick quips about things whether the mood is light (House to Wilson about his change in a tie), or dark (will they figure out what the hell is wrong before death comes around?), is all part of what's fun and truly compelling about the material. It's also one of the few shows on right now, especially for prime-time network TV, to work as well with character with story."
    },
    {
      "username": "doors43",
      "userUrl": "https://www.imdb.com/user/ur0303976",
      "reviewLink": "https://www.imdb.com/review/rw0971339",
      "warningSpoilers": false,
      "date": "2 December 2004",
      "rate": "10",
      "helpful": "226 out of 276 found this helpful.",
      "title": "Best hospital show since ER!",
      "content": "This show has the potential to be wonderful. Hugh Laurie does an excellent job (and American accent I might add - he's British) as a sarcastic, yet super intelligent doctor. The show has a wonderful cast and the illnesses these patients come in with are very interesting. The acting is brilliant. It hasn't really been about the doctors yet, but it's starting to get a bit more personal. Up until now (the 3rd episode), it's been mostly about the patients, which is what you want in the beginning of a show. The comic relief is that Dr. House has to do work in the walk-in clinic where every hypochondriac in New Jersey comes walking in... his dealing with them is hilarious. And just as additional enjoyment, Jesse Spencer is very pleasing to the eyes. :)"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2291777",
      "warningSpoilers": false,
      "date": "7 August 2010",
      "rate": "10",
      "helpful": "23 out of 31 found this helpful.",
      "title": "Not THE perfect show, but a truly interesting and fun one",
      "content": "When I first watched House I wasn't expecting to like it. But the thing is, I do, even if it has its minor problems along the way, it is a truly interesting and fun show, that is also witty, funny and intelligent.House is great to look at, particularly with the photography and lighting which are very good and skillful, while the music is good too with some very interesting song choices. The direction is solid, and the pacing is fine so none of the episodes feel boring or tiresome. The writing is witty and fresh, especially in the one-liners, while the story lines are somewhat original and intelligent. True, realism can go out of the window and there are some plot points that may go over your head at first, but I am still entertained by them. And the acting is superb, all the actors are wonderful and the characters are believable but it is Hugh Laurie's show all the way. Gregory House is a bit of a bastard granted, but Laurie's performance is so good that you can't help like him, in fact it is my favourite Laurie role with his roles in Jeeves and Wooster and Black Adder not far off.All in all, a great show, not 100% perfect but it is still thoroughly entertaining- and these flaws are occasional and very minor to me- with a brilliant Hugh Laurie. 10/10 Bethany Cox"
    },
    {
      "username": "rebel_lover_16",
      "userUrl": "https://www.imdb.com/user/ur4402212",
      "reviewLink": "https://www.imdb.com/review/rw0978827",
      "warningSpoilers": false,
      "date": "15 December 2004",
      "rate": "",
      "helpful": "415 out of 447 found this helpful.",
      "title": "Great Show",
      "content": "Hugh Laurie as Dr. House is my new hero. This is a terrific show with some absolutely great writing. A little over the layman's head as far as medical jargon, but the characters, plot and script more than make up for any questions about a diagnosis. The show is really carried by House, but the team of doctors who work with him add dimension and depth to his character. Any negative comments I've read about the show dealt with complaints about how the television doctors don't diagnose the way the viewing medical professionals do. May I point out to these people, this is a television show. Please get a grip on reality and watch it for it's pure entertainment value. I hope this show has a good following and I'm already hoping for, and looking forward to, more seasons."
    },
    {
      "username": "izil",
      "userUrl": "https://www.imdb.com/user/ur0225521",
      "reviewLink": "https://www.imdb.com/review/rw0973599",
      "warningSpoilers": false,
      "date": "2 December 2004",
      "rate": "",
      "helpful": "219 out of 252 found this helpful.",
      "title": "A show worth looking forward to",
      "content": "I love this show. Fell in love with the pilot, which I got on DVD. I tried watching NBC's Medical Investigation, but it just felt and looked too corny. House is a definite improvement of Medical Investigation. It's smart and daring. I love the sarcasm and snide comments coming from Dr. House. Supporting actors are great. It's CSI-ish but quirky like Arrested Development. I hope it stays on the air. Cancel Medical Investigation but keep House. It's a good sign that FOX is pushing plenty of promos for the show, such as free DVD previews of the pilot. I look forward to watching the show every week. I'd like to see the show develop more of the characters and why Dr. House limps."
    },
    {
      "username": "rajaasimgolden",
      "userUrl": "https://www.imdb.com/user/ur56886251",
      "reviewLink": "https://www.imdb.com/review/rw4562064",
      "warningSpoilers": false,
      "date": "5 January 2019",
      "rate": "10",
      "helpful": "24 out of 27 found this helpful.",
      "title": "If you see it as a medical mystery show, you had missed the whole point of this show",
      "content": "It is NOT a mystery show. This show tells you about friendship, love, hypocrisy, being alone, enjoying life on your own, harsh truths of life and MISERABLE-NESS. Altough House saves lives by solving medical puzzles yet this show is about the character evolution. It shows how and why he likes being alone, why he can't love and show likeness to anyone, why he is ALWAYS in pain physically and emotionally and about the most selfless deed anyone has ever done for anybody. This show portrays almost every aspect of life in the perfect manner, not by making superficial hero who is best at everything but by portraying a most screwed person in the world who is far from being perfect. If I can summarize the best character ever in one line I would like to share this dialogue of 13(Hadley).Dr. Remy Hadley: \"You have spent your whole life looking for answers because you think that the next answer will change something, maybe will make you a little less miserable but you know that when you run out of questions you don't only run out of answers. YOU RUN OUT OF HOPE."
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw2613816",
      "warningSpoilers": false,
      "date": "19 May 2012",
      "rate": "9",
      "helpful": "9 out of 11 found this helpful.",
      "title": "A misanthrope's point of view",
      "content": "I \"get\" House, and not just because I too am a misanthrope of sorts with a chronic condition that cannot be cured. This show was sold to Fox as a \"Medical Law and Order\" with the network being told that the cases not the cast would be the focus, and I think it would have been a failure had there been truth in advertising. The interesting thing about this show are the relationships and in particular, Hugh Laurie as Greg House M.D., a genius at diagnostic medicine that saves lives but does not like people.And why should he? He develops an infarction in his leg, is misdiagnosed until it becomes so serious his leg may have to be amputated, clearly expresses his wishes to take a medical path that will mean either his death or complete recovery THEN has the hospital administrator conspire with his girlfriend at the time, who has his medical directive powers, to come up with an intermediate solution while House is unconscious. House keeps his leg, but will have deep chronic pain in that leg for the rest of his life plus the leg is now virtually useless. This is all told in flashback in the first season.So for eight seasons House's friends and colleagues chastise him for not embracing his friends. Why should he? If he had been friendless at the time of his infarction, nobody would have meddled in his medical decision about his own body. His friends betrayed his wishes and left him in this state, pushing him away when he doesn't meet their high standards of behavior - standards of behavior that are fine for someone who isn't constantly in pain with a deep justified sense of betrayal.Hypochondriacs - you have nothing to fear here. The medical cases are so bizarre and such one-in-a-million kinds of things that you have a better chance of winning the lottery than getting the diseases that House's patients get. Nobody House treats has breast cancer or Lyme disease or Parkinson's or any other highly probable illness.Let me finally say just one thing about season seven, where most people think House jumped the shark in the action he took in the last episode of season seven. You don't start a love affair with someone who has grown comfortable in their isolation, tell him that you don't want him to change and tell him you think he is \"an amazing man\" just as he is, give him a big taste of of happiness and belonging and even family for perhaps the first time in his life, only to rip it away because of one isolated case of failure that should have been predictable. In other words you break your word and change the rules - you really did want change - and if you do these things, to quote House, \"you really are an idiot\" if you expect anything but an eventual emotional explosion.House is the best thing on TV today, I highly recommend it for the social and unsocial viewer alike - it has something for everyone."
    },
    {
      "username": "prsd_yr",
      "userUrl": "https://www.imdb.com/user/ur14847559",
      "reviewLink": "https://www.imdb.com/review/rw1629799",
      "warningSpoilers": false,
      "date": "2 April 2007",
      "rate": "10",
      "helpful": "30 out of 35 found this helpful.",
      "title": "The Greatest Medical Show Ever",
      "content": "They say that if you combine a great character with a great actor, you're halfway to a great show. \"House M.D.\" seems to do that with most of its cast, but especially Gregory House and Hugh Laurie. House is a snarky, sarcastic, occasionally callous but adorable jerk. He is also the most brilliant yet least well-adjusted doctor at Princeton-Plainsboro Teaching Hospital. Around him are three junior doctors, all three of whom have varied but interesting personalities. There is also his only friend, James Wilson, an oncologist and his superior with whom he has a rather antagonistic relationship. House involves strange, rare and complicated cases with no easy diagnosis, resulting in the spouting of some mind-numbing medical terminology(which I thought was a brave and successful attempt at retaining some reality)and often character-driven story lines. \"House\" has the best writing for any show in America, if you don't believe me just check the \"quotes\" section for samples of dialogue. House had an infarction in his leg, resulting in it becoming painful and near-impossible to move, which made him addicted to a painkilling drug known as Vicodin., which proves to be the source of many problems. House is, for all his imperfectness, a genius, a master of observation which is depicted in his clinic cases as he can instantly detect either and environmental cause for the disease/problem or find some the patient themselves do not know about. He is a deep character, though, and flawed, but likable, making him a cornerstone for this shows incredible success with the critics, though mainstream audiences prove less receptive and prefer to tune into pseudo-romantic, unintelligent trash like \"Grey's Anatomy\", a classic example of catering to the mainstream resulting in distaste from most critics. Why have not even FIVE ratings come for this show? Please rate it, even if your opinion differs to mine, rate it!!!!"
    },
    {
      "username": "lambiepie-2",
      "userUrl": "https://www.imdb.com/user/ur0874373",
      "reviewLink": "https://www.imdb.com/review/rw1303202",
      "warningSpoilers": true,
      "date": "28 February 2006",
      "rate": "10",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Finally...innovation",
      "content": "This is the kind of program that will have two types of audiences: those that are totally upset that nothing really sexual, pretty or soapy is going on here, and those who like a good medical drama that focuses on the medicine which isn't too sexy, pretty or soapy. I'm with the latter group. And what I like the best? The up and down put-off attitude of this doctor who is not perfect in any way, very human and sadly, very brilliant. So why is he in a \"training hospital\"? Ah, there is the beauty of this series.This isn't your glossy, over set television fare. It's bare, it focuses on the medical, and yes it uses many of today's TV technical advances to portray them.The central doctor in this series, Dr. House, has a few charges who are also smart, young and cocky. This is good because they will learn much from their assigned mentor who is flawed, moody and not very sociable - but a medical genius - and how hard it is to unlock that information so these doctors in training can learn. And the Administration. There's nothing like the hospital administration (business) to interfere with the medicine..and the egos.I love the failure rate given to many in this series: patients as well as doctors. There are successes, but the failure rate is important as well - because not everything in the medical profession has a happy ending in 60 minutes..and not just because someone has to expire, but because of decisions, negligence, prejudice and much more.A hard show for some, but a true gem above the alternatives out there."
    },
    {
      "username": "cinemamoviecars",
      "userUrl": "https://www.imdb.com/user/ur11590833",
      "reviewLink": "https://www.imdb.com/review/rw7325843",
      "warningSpoilers": false,
      "date": "10 September 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "all my family love this show, and thats weird(we watch movies often, no tv series)",
      "content": "The sherlock holmes of the doctors, to me, thats the best way to say who is the dr.house. The serie is funny, emotional, crazy in some episodes and is always aware that you want to have a good time finding why everything is happening. Is really good. Even if i stopped watching the show after my aunt died(she loved this show, even called real doctors ''dr house'', thats how she loved this show) i know maybe someday ill re watch again all the episodes, including the end that i dont remember being aired here, or if i was on tv, i miss that episode. To me dr house was more a introvert with smart skills that helps him being a doctor, than just a stereotype. I dont see him as a nihilist, to me is more a introvert that loves his job and help people, but sometimes in some episodes they try to make him be kind of crazy...and still accepting that, this is one of the few tv series i watched when was new.also thanks to this series i found olivia wilde, so thanks for that, and his love of bikes makes sense.bikes and cars represents freedom, and thats why the fast saga have 10 movies...well, thats also means if u dont like any vehicle, you must be boring."
    },
    {
      "username": "robert-625",
      "userUrl": "https://www.imdb.com/user/ur4662405",
      "reviewLink": "https://www.imdb.com/review/rw1007257",
      "warningSpoilers": false,
      "date": "26 January 2005",
      "rate": "",
      "helpful": "59 out of 66 found this helpful.",
      "title": "Hugh Laurie",
      "content": "While most of my fellow Americans have never heard of him before I have been a fan of Hugh Laurie since I first saw him in Black Adder back in the 1980's (Thank goodness my local PBS station showed British shows back then).When I first saw Hugh in House, M.D, I couldn't believe this is the same person who played silly Prince George and Lt George. Here he is playing a serious character without his British accent! I had to check the name in the credits to make sure it was him.I hope the American public recognizes what a great actor he is.If you like him in House, MD, watch him in the Black Adder series."
    }
  ],
  "errorMessage": ""
}