{
  "imDbId": "tt0412142",
  "title": "House",
  "fullTitle": "House (TV Series 2004–2012)",
  "type": "TVSeries",
  "year": "2004",
  "episodes": [
    {
      "id": "tt1697219",
      "seasonNumber": "7",
      "episodeNumber": "1",
      "title": "Now What?",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc4MDY3Mzc3M15BMl5BanBnXkFtZTgwODE0ODEzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "20 Sep. 2010",
      "plot": "House and Cuddy are exploring the ramifications of those feelings and attempting to make a real relationship work. Meanwhile, due to a colleague's illness, Princeton Plainsboro is left without a neurosurgeon on site, threatening the hospital's accreditation as a Level 1 Trauma Center. As the team attempts treatment to get their sick colleague back to work, they discover there is more to the illness than they originally suspected and turn to House for direction. Instead, House remains elusive, leaving the team on its own.",
      "imDbRating": "8.2",
      "imDbRatingCount": "2699"
    },
    {
      "id": "tt1685104",
      "seasonNumber": "7",
      "episodeNumber": "2",
      "title": "Selfish",
      "image": "https://m.media-amazon.com/images/M/MV5BODc1MzkxMjIzMV5BMl5BanBnXkFtZTgwNDY1MzIzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "27 Sep. 2010",
      "plot": "When Della, a seemingly healthy and active 14-year-old, suddenly collapses during a skateboarding exhibition, House and his team struggle to diagnose her condition and reassure her parents who already have to cope with their son's terminal illness. After her body rejects a donor lung, and with time running out to save her life, Della's family is left with little hope of securing a new donor and faced with a seemingly impossible decision regarding the fate of both children. Meanwhile, House tries to appease an elderly father and his son at the clinic, and House and ...",
      "imDbRating": "8.6",
      "imDbRatingCount": "2377"
    },
    {
      "id": "tt1726377",
      "seasonNumber": "7",
      "episodeNumber": "3",
      "title": "Unwritten",
      "image": "https://m.media-amazon.com/images/M/MV5BMTA1OTQyODA0ODZeQTJeQWpwZ15BbWU4MDg1NjIyMzIx._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "4 Oct. 2010",
      "plot": "A famous novelist finishes her last novel and gets ready to shoot herself, when she has a seizure. House gives her a 72 hour psych hold to find out what's wrong with her. House and Wilson go on a go-kart double-date.",
      "imDbRating": "8.2",
      "imDbRatingCount": "2138"
    },
    {
      "id": "tt1726378",
      "seasonNumber": "7",
      "episodeNumber": "4",
      "title": "Massage Therapy",
      "image": "https://m.media-amazon.com/images/M/MV5BMTUyODc4NjMyOV5BMl5BanBnXkFtZTgwOTk2MjIzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "11 Oct. 2010",
      "plot": "When a patient named Margaret McPherson is admitted to Princeton Plainsboro after suffering severe and uncontrollable vomiting, House and the team make unexpected discoveries about her identity as they assess her symptoms. When the symptoms don't improve, the team looks to the patient's medical history to unearth more about her past. Meanwhile, House gives Chase's new hire a cold welcome, and a visit from House's massage therapist forces House and Cuddy to confront the reservations in their relationship.",
      "imDbRating": "7.8",
      "imDbRatingCount": "2023"
    },
    {
      "id": "tt1726379",
      "seasonNumber": "7",
      "episodeNumber": "5",
      "title": "Unplanned Parenthood",
      "image": "https://m.media-amazon.com/images/M/MV5BMTk3MzA4MTQ2N15BMl5BanBnXkFtZTcwMTIwOTAwNA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "18 Oct. 2010",
      "plot": "A newborn baby has problems breathing. House and team run diagnosis. House babysits Cuddy's daughter. Did she eat a dime? Foreman finds a new female doctor for the team. House fires her and Taub has to find a new one.",
      "imDbRating": "8.1",
      "imDbRatingCount": "2131"
    },
    {
      "id": "tt1708695",
      "seasonNumber": "7",
      "episodeNumber": "6",
      "title": "Office Politics",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU0NzI3NDM4OV5BMl5BanBnXkFtZTgwMjMxNDEzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "8 Nov. 2010",
      "plot": "It's election season, and in the midst of a tight campaign, an incumbent New Jersey senator's campaign manager falls ill with liver failure and temporary paralysis. Cuddy pushes House to add a female doctor to his team by hiring brilliant third-year medical student Martha Masters in Thirteen's absence. House and the team are wary of the young doctor's lack of experience and medical perspective, but are forced to give their new by-the-book teammate a chance to prove herself. After the campaigning senator makes a surprising announcement, House and the team look to the ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "2026"
    },
    {
      "id": "tt1726380",
      "seasonNumber": "7",
      "episodeNumber": "7",
      "title": "A Pox on Our House",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA2Mzg3Nzg5M15BMl5BanBnXkFtZTcwOTcxMDAxNA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "15 Nov. 2010",
      "plot": "After a 200-year-old medicine jar found on an off-shore shipwreck shatters in a teenage girl's palm, she is admitted to Princeton Plainsboro for symptoms closely linked to smallpox. When the Center for Disease Control's Dr. Dave Broda institutes a lockdown on the hospital and suspends House's team's ability to diagnose, Masters is skeptical about Broda's diagnosis and becomes convinced that the patient is suffering from a different disease. The girl's father soon experiences similar symptoms, and House is forced to make a precarious decision that puts his own life in ...",
      "imDbRating": "8.6",
      "imDbRatingCount": "2426"
    },
    {
      "id": "tt1726381",
      "seasonNumber": "7",
      "episodeNumber": "8",
      "title": "Small Sacrifices",
      "image": "https://m.media-amazon.com/images/M/MV5BMjQwMzk4NjA5Ml5BMl5BanBnXkFtZTgwNjA2MjIzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "22 Nov. 2010",
      "plot": "Science and faith are called into question when a patient is admitted to the hospital following his reenactment of the Crucifixion. The patient, Ramon Silva, refuses to undergo the prescribed treatment, and the team learns that after his daughter's cancer was cured, he pledged an oath of self-sacrifice to God. With little time to save Ramon's life, the team struggles to understand his reasoning and seemingly extreme religious convictions, but eventually learn that faith is not an argument. Meanwhile, Taub questions his wife Rachel about her relationship with an ...",
      "imDbRating": "7.7",
      "imDbRatingCount": "2025"
    },
    {
      "id": "tt1726382",
      "seasonNumber": "7",
      "episodeNumber": "9",
      "title": "Larger Than Life",
      "image": "https://m.media-amazon.com/images/M/MV5BMjEzMTE0MDM3N15BMl5BanBnXkFtZTcwMTcwODQzNA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "17 Jan. 2011",
      "plot": "When a woman falls on the subway tracks, Jack jumps down, saves her and faints. Martha finds him in ER. When the hospital uses Taub's photo for promotion, his wife's aroused. House meets Cuddy's mom.",
      "imDbRating": "8.3",
      "imDbRatingCount": "2133"
    },
    {
      "id": "tt1726371",
      "seasonNumber": "7",
      "episodeNumber": "10",
      "title": "Carrot or Stick",
      "image": "https://m.media-amazon.com/images/M/MV5BMTk5MzQxMDIzOF5BMl5BanBnXkFtZTgwMjc4MjIzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "24 Jan. 2011",
      "plot": "A disciplinary training camp drill instructor collapses with back pain. One of the 24 boys joins him in hospital. Someone has access to Chase's social media account and credit card. Cuddy wants Rachel in a good preschool.",
      "imDbRating": "7.9",
      "imDbRatingCount": "2004"
    },
    {
      "id": "tt1726372",
      "seasonNumber": "7",
      "episodeNumber": "11",
      "title": "Family Practice",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ2NjA5MDcwMV5BMl5BanBnXkFtZTcwNTg5MDQ0NA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "7 Feb. 2011",
      "plot": "Cuddy's mom has heart problems and is admitted. Secrets come out about her mom.",
      "imDbRating": "8.5",
      "imDbRatingCount": "2252"
    },
    {
      "id": "tt1726373",
      "seasonNumber": "7",
      "episodeNumber": "12",
      "title": "You Must Remember This",
      "image": "https://m.media-amazon.com/images/M/MV5BMTcyOTIyMjg5N15BMl5BanBnXkFtZTcwNDc1Nzc0NA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "14 Feb. 2011",
      "plot": "When a waitress with a perfect memory suffers temporary paralysis, her older sister visits her in the hospital, which triggers high stress levels and even more health complications. The patient's sharp memory proves detrimental when a grudge she's been holding against her sibling gets in the way of receiving proper medical treatment, and Masters discovers that patching a broken sisterhood may prove to be more complex than diagnosing the patient. Meanwhile, Foreman volunteers to help Taub prepare for a medical examination, and House, determined to help Wilson get back ...",
      "imDbRating": "7.8",
      "imDbRatingCount": "1975"
    },
    {
      "id": "tt1726374",
      "seasonNumber": "7",
      "episodeNumber": "13",
      "title": "Two Stories",
      "image": "https://m.media-amazon.com/images/M/MV5BODMwZWRkZmUtODI5NS00NjI2LTkwNzktNDc0ZWFlOTMwNGYzXkEyXkFqcGdeQXVyMDY5NDgzOQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "21 Feb. 2011",
      "plot": "House entertains a school class on Career Day telling about his patient, a college student, who coughed up his lung. He spices up the story with quotes from movies. He later gets advice from 2 students outside principal's office.",
      "imDbRating": "8.8",
      "imDbRatingCount": "3053"
    },
    {
      "id": "tt1726375",
      "seasonNumber": "7",
      "episodeNumber": "14",
      "title": "Recession Proof",
      "image": "https://m.media-amazon.com/images/M/MV5BNDMwOTUxMzg1MV5BMl5BanBnXkFtZTgwNjk3MjIzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "28 Feb. 2011",
      "plot": "A man cleans crime scenes after losing his real estate company. His wife doesn't know. He suddenly gets a fit at a restaurant. Masters thinks he lied about his job. Foreman throws Taub out. Cuddy gets an award.",
      "imDbRating": "7.8",
      "imDbRatingCount": "2001"
    },
    {
      "id": "tt1726376",
      "seasonNumber": "7",
      "episodeNumber": "15",
      "title": "Bombshells",
      "image": "https://m.media-amazon.com/images/M/MV5BMTcxMTM3NTI5NV5BMl5BanBnXkFtZTcwMTU2ODc1NA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "7 Mar. 2011",
      "plot": "Tension reaches new heights when Cuddy faces sobering news that propels her to reevaluate her priorities. While House is distracted by his concern for Cuddy's well-being, the team treats a teenage patient whose worsening symptoms and suspicious body scars indicate more than just physical illness. Sensing the teen's troubled emotional and mental state, Taub turns to the patient's personal life for clues and uncovers disturbing home videos that could put the lives of his peers in danger. Meanwhile, Cuddy remains hopeful that House will be fully present when she needs ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "2779"
    },
    {
      "id": "tt1842688",
      "seasonNumber": "7",
      "episodeNumber": "16",
      "title": "Out of the Chute",
      "image": "https://m.media-amazon.com/images/M/MV5BMTM4NjE5ODA5OV5BMl5BanBnXkFtZTcwNTA4NDA3NA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "14 Mar. 2011",
      "plot": "Cuddy dumped House. He moves into a luxury hotel and goes on a Vicodin, booze and cute hooker binge. The team gets a trampled rodeo bull rider but needs House to save him. Masters has a crush on their patient.",
      "imDbRating": "8.8",
      "imDbRatingCount": "2773"
    },
    {
      "id": "tt1842081",
      "seasonNumber": "7",
      "episodeNumber": "17",
      "title": "Fall from Grace",
      "image": "https://m.media-amazon.com/images/M/MV5BMTMwNjkzOTYxNV5BMl5BanBnXkFtZTcwMjQ0NTY3NA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "21 Mar. 2011",
      "plot": "A young homeless man who is a former drug addict is found in a park showing signs of olfactory impairment and horrific scars and burn marks on his chest. With an uncertain identity and the patient's severely worsening conditions, the team looks to the patient's personal records and family history in order to understand his detachment. Meanwhile, Cuddy confides in Wilson and expresses her guilt for ending her relationship with House, and just as the team warms up to the patient, they discover a disturbing secret about the man whose life they saved.",
      "imDbRating": "8.3",
      "imDbRatingCount": "2259"
    },
    {
      "id": "tt1878391",
      "seasonNumber": "7",
      "episodeNumber": "18",
      "title": "The Dig",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU2MDQ4NzU1Ml5BMl5BanBnXkFtZTcwNDI3NzE5NA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "11 Apr. 2011",
      "plot": "The team treats a patient with a secret home life. Thirteen is released from prison. House enlists Thirteen to participate in a spud gun competition.",
      "imDbRating": "8.8",
      "imDbRatingCount": "2598"
    },
    {
      "id": "tt1880571",
      "seasonNumber": "7",
      "episodeNumber": "19",
      "title": "Last Temptation",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU2MzIyNTg3M15BMl5BanBnXkFtZTgwNzMwNjEzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "18 Apr. 2011",
      "plot": "Masters faces a career crossroads on her last day as a medical student and struggles with the choice to continue on the path to become a surgeon or to accept the rare opportunity to join House's team officially. Meanwhile, the team treats a 16-year-old girl who inexplicably collapsed days before embarking on an ambitious sailing tour around the globe. Despite the patient's life-changing diagnosis, the patient's family insists on getting her back on the seas in time for her potentially record-breaking launch. But to the team's surprise, including House, Masters makes a...",
      "imDbRating": "8.4",
      "imDbRatingCount": "2115"
    },
    {
      "id": "tt1883788",
      "seasonNumber": "7",
      "episodeNumber": "20",
      "title": "Changes",
      "image": "https://m.media-amazon.com/images/M/MV5BODEzNjEyNTM2OF5BMl5BanBnXkFtZTcwNDU0MDQxNQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "2 May 2011",
      "plot": "Arlene Cuddy returns and House and Cuddy's jobs are in danger when Arlene tries to sue the hospital.",
      "imDbRating": "7.8",
      "imDbRatingCount": "1887"
    },
    {
      "id": "tt1902562",
      "seasonNumber": "7",
      "episodeNumber": "21",
      "title": "The Fix",
      "image": "https://m.media-amazon.com/images/M/MV5BMjI4MzE3NjE5MV5BMl5BanBnXkFtZTcwOTYzNTEyNQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "9 May 2011",
      "plot": "When House and Wilson bet on a boxing match and disagree over the outcome, Wilson gives him exactly one day to pay up or prove him wrong.",
      "imDbRating": "7.7",
      "imDbRatingCount": "1892"
    },
    {
      "id": "tt1900094",
      "seasonNumber": "7",
      "episodeNumber": "22",
      "title": "After Hours",
      "image": "https://m.media-amazon.com/images/M/MV5BMTM3MjUyNzU5NF5BMl5BanBnXkFtZTcwMjM5MTkyNQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "16 May 2011",
      "plot": "Darrien steals a car after getting stabbed and hurries to her friend 13's home for help. Chase brings an ultrasound and helps. House performs surgery on his own leg at home after using experimental drugs.",
      "imDbRating": "9.1",
      "imDbRatingCount": "3079"
    },
    {
      "id": "tt1919895",
      "seasonNumber": "7",
      "episodeNumber": "23",
      "title": "Moving On",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ2MTIzMzE0NF5BMl5BanBnXkFtZTgwODIwNjEzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "23 May 2011",
      "plot": "A known performance artist collapses during a performance. She ends with House's team, which is what she wanted. House is more self-destructive and irresponsible than usual. Cuddy's sister finds a date for her.",
      "imDbRating": "8.4",
      "imDbRatingCount": "2729"
    }
  ],
  "errorMessage": ""
}