{
  "imDbId": "tt0459159",
  "title": "The Thick of It",
  "fullTitle": "The Thick of It (TV Series 2005–2012)",
  "type": "TVSeries",
  "year": "2005",
  "items": [
    {
      "username": "motor89",
      "userUrl": "https://www.imdb.com/user/ur0624770",
      "reviewLink": "https://www.imdb.com/review/rw1207918",
      "warningSpoilers": false,
      "date": "3 November 2005",
      "rate": "",
      "helpful": "98 out of 105 found this helpful.",
      "title": "Calling this sharp and funny just doesn't do it justice.",
      "content": "Calling this sharp and funny just doesn't do it justice. It's a bit of a cliché to describe it as \"Yes Minister\" for the 21st century, but it does fit rather well.Any British person who has followed the news over the last few years will be painfully familiar with \"spin\" as practised by the current government of the United Kingdom. Where \"Yes Minister\" dealt with hapless ministers being manipulated by the civil-service mandarins (the power brokers of the time) ... \"The Thick Of It\" deals primarily with hapless ministers being manipulated by spin doctors (the current power brokers). Spot the difference? Series one kicks off with the clinical execution of a cabinet minister (department of \"Social Affairs\") by the party communications director Malcolm Tucker, played to perfection by a fantastically high-powered and abusive Peter Capaldi. In comes the completely ineffectual Hugh Abbott (Chris Langham) as his replacement -- the most recent in a long line we are led to believe -- and off we go. It's a picture of near-total ineptitude. The business of government is to please the media, all the time under the baleful gaze of Tucker and his team of ferocious Rottweilers, and of course the 24 hour gaze of the media... forever on the lookout for stories. Useless empty policy statements, petty oneupmanship, and doing anything to please \"Number 10\", or the Chancellor at \"Number 11\" -- or rather not, since pleasing one side can bring down the wrath of the other as you are obviously part of a plot to undermine them. No, it's best just to churn out focus grouped policies that are bland enough not to upset anyone, all the while dreaming of advancement to departments that matter.It's all desperately funny and insightful. There are no bad performances. Series one and two combined add up to just six half-hour episodes in total. That may surprise Americans used to much longer runs... but when it's this funny and insightful, you are just glad it exists at all."
    },
    {
      "username": "MovieBuff57",
      "userUrl": "https://www.imdb.com/user/ur22623218",
      "reviewLink": "https://www.imdb.com/review/rw2948932",
      "warningSpoilers": false,
      "date": "25 January 2014",
      "rate": "10",
      "helpful": "30 out of 32 found this helpful.",
      "title": "Simply sublime",
      "content": "10 stars out of 10 is just simply not enough! This series warrants at least 11. IMDb is largely US based (I think?) but I can't believe there's only 9 reviews for this series?I still mourn it's passing and with Peter Capaldi turning into Dr Who (!) any hope of another series is at least 2 or 3 years away - if at all?This is classic comedy which for me rises above even Fawlty Towers and sit's alongside Cheers and Frazier.Yes, it is meant be a fly on the wall type mockumentary and the camera work is edgy but it simply adds to the realism of it all.Yes - a knowledge of and interest in UK politics are probably desirable but not essential.Get the box-set and the movie spin off (In the Loop) and steady yourselves because you'll end up in tears. Tears of joy that is!"
    },
    {
      "username": "beresfordjd",
      "userUrl": "https://www.imdb.com/user/ur3741901",
      "reviewLink": "https://www.imdb.com/review/rw2165644",
      "warningSpoilers": false,
      "date": "29 November 2009",
      "rate": "10",
      "helpful": "34 out of 40 found this helpful.",
      "title": "Mortified!!",
      "content": "I am mortified that I have only just picked up on this wonderful series in the past 6 weeks!! I had read that it was good but felt I couldn't commit to another \"must watch\" TV series. However against my better judgement I recorded one programme to see what all the fuss was about. I was totally blown away by the whole thing. I never really rated Peter Capaldi before this but the guy is a genius!! His intimidating, foul-mouthed character is some creation!! Whether it is him or Ianucci that is responsible, I do not know, but the end result is pure gold. Of course lots of viewers are going to find the bad language hard to get past but it really is worth it. I am rarely shocked by bad language but it shocked me - at first I found it gratuitous and almost switched off. However when you get into it the language seems (for the characters) just right and very funny. Who knows if this is the way that the people behind the scenes speak but it works. I actually know someone involved in politics on the Tory side (not my preference) and can believe in the Thick of It characters totally. I am addicted top it already and am about to get the series I have missed on DVD. Brilliant is not the word for it. People who berate the camera-work need to get a life. It is not my favourite style either but it works for this. If you have not seen it make a point of getting it immediately!!"
    },
    {
      "username": "rebecca-ry",
      "userUrl": "https://www.imdb.com/user/ur26267201",
      "reviewLink": "https://www.imdb.com/review/rw2634596",
      "warningSpoilers": false,
      "date": "29 June 2012",
      "rate": "10",
      "helpful": "27 out of 31 found this helpful.",
      "title": "Excellent",
      "content": "'The Thick of It' is slowly becoming more and more popular especially as political scandals are becoming more frequent in headlines. The writing, acting and dialogue are all strong points in this series. The acting from people such as Rebecca Front, Chris Addison, Paul Higgins and of course Peter Capaldi are excellent. They don't all play particularly likable characters but that is the purpose of this show, to highlight the dark side of British politics. Armando Ianucci's direction and scripts are excellent, the stories are very realistic and on some occasions this show has even managed to predict an actual occurrence in Westminster before it has actually happened, that is how intelligent this show is. If you have an interest in politics you will love this show, if you dislike swearing you will loathe it; the dialogue particularly from Capaldi's Malcolm Tucker is obscene nearly all the time, he provides about 75% of the comedy in this series. The show is quite unique because of the amount of swearing included within it, especially since it is a BBC programme. The first and second series were good but the third series has been the best so far. The only thing missing from the third series was Paul Higgins' character Jamie MacDonald who had small parts in the first and second series and worked really well alongside Malcolm Tucker. The fourth series has now been shot and is scheduled to return later on this year (2012). Overall, I would thoroughly recommend this TV series. People outside the UK may struggle understanding the plots of each episode, however. Its documentary style filming method takes a while to get used to but it suits the nature of the series perfectly. If you like this programme try 'In The Loop', the film based on this series, also starring Peter Capaldi, Paul Higgins and Chris Addison."
    },
    {
      "username": "r-lythgoe",
      "userUrl": "https://www.imdb.com/user/ur52197068",
      "reviewLink": "https://www.imdb.com/review/rw3081330",
      "warningSpoilers": false,
      "date": "5 September 2014",
      "rate": "10",
      "helpful": "20 out of 22 found this helpful.",
      "title": "Amazing and hilarious satire",
      "content": "The Thick Of It is a sitcom which has been hurt by many issues, such as the loss of main character Hugh Abbot after Season 2, the splitting up of Seasons and the changes in format....But NONE of these issues matter because The Thick Of It is just so bloody good. It is a hilarious satire of British politicians and what goes on with them behind the scenes, and is almost completely accurate with it's similarities to, and even predictions of, real-life political scandals. It's mostly driven by dialogue, and the dialogue (most of which is profanity) is terrific, especially when coming from the hilarious, cold and fierce character of Malcolm Tucker, played to perfection by the brilliant Peter Capaldi (who you may know now from Doctor Who). The Series has been so good and popular it has even inspired a spin-off film, In The Loop, which received critical acclaim from critics.Overall, The Thick Of It is a classic sitcom and one of the best sitcoms to come out of the UK. Brilliant! 10/10"
    },
    {
      "username": "RatedVforVinny",
      "userUrl": "https://www.imdb.com/user/ur16998042",
      "reviewLink": "https://www.imdb.com/review/rw5433842",
      "warningSpoilers": false,
      "date": "24 January 2020",
      "rate": "9",
      "helpful": "8 out of 9 found this helpful.",
      "title": "A classic British comedy, that gets better with each view.",
      "content": "Three series of delight, joy and some of the very best lines (most of a highly blue nature) delivered by 'Policy Enforcer' Malcolm Tucker. Peter Capaldi, is just like poetry in motion, as he spits fire and venom, to whoever is in the line of fire! His performance alone is one of such magnitude, it elevates 'The Thick of It' up to a level rarely seen on TV. Another worthy mention is the tremendously funny Chris Langham (who was part of the 'Alternative Comedy' scene) as the Minister Hugh Abbot. but all of the cast and crew (which are too many to mention) are superb. Disturbing yet hilarious."
    },
    {
      "username": "bilko-1",
      "userUrl": "https://www.imdb.com/user/ur3609164",
      "reviewLink": "https://www.imdb.com/review/rw2174059",
      "warningSpoilers": false,
      "date": "14 December 2009",
      "rate": "10",
      "helpful": "41 out of 49 found this helpful.",
      "title": "Possibly one of the greatest pieces of television in any genre",
      "content": "I have just finished series three, and am left feeling totally in awe of everyone involved in this programme. As a huge fan of The Wire, I am glad that one does not have to judge the merit of a programme in terms of how it rates against another. Suffice it to say, The Thick Of It succeeds on every level. Not only does it work as a comedy, but it turns out to be a tremendously powerful piece of drama. Full marks to the cast, who give a powerhouse performance that is absolutely staggering. Particular praise must go to Rebecca Front, who I have always admired, but who has produced here an award-winning performance and I hope that she does receive recognition for this. I could mention every actor who has appeared in the series, they are all wonderful. If you have not seen this show, do so and follow it to its amazing climax."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw3717904",
      "warningSpoilers": false,
      "date": "28 May 2017",
      "rate": "10",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Brilliant, and the greatest politics-centric TV series ever made",
      "content": "Set in a UK government ministerial department, we meet the people who work there, from the minister all the way on down. The minister is a bit of a buffoon, a trait that has not escaped the Prime Minister's notice. The PM has a man who keeps underperforming / errant ministers in line, an enforcer. That man is Malcolm Tucker, truly a man to be feared.Brilliant. A superb satire of British politics, with no sacred subjects or limits on language usage. Pretty much Yes Minister with edgier plots and heaps of (very creative) swearing.The series is made by the character of Malcolm Tucker and the performance of Peter Capaldi in portraying him. Hysterically funny in his intensity and over-the-topness and use (or abuse) of the English language. The creativity displayed in the ways Tucker finds in insulting people is off-the-chart brilliant. One of the most memorable characters in TV history.Created by Armando Iannucci, who, once this series had run its course, turned his attention to US politics. The result was the equally-hilarious Veep."
    },
    {
      "username": "brianethomas2001",
      "userUrl": "https://www.imdb.com/user/ur6099142",
      "reviewLink": "https://www.imdb.com/review/rw1267974",
      "warningSpoilers": false,
      "date": "17 January 2006",
      "rate": "10",
      "helpful": "40 out of 51 found this helpful.",
      "title": "the office + yes minister = a slice of pure fried gold",
      "content": "In the thick of it is what you would get if you mixed the office with yes minister. shot as a documentary (like the office) it's about the office of social affairs and how they get in and out of trouble every week with hilarious results. Hugh abbot (Chris Langham) is pretty much the Dave Brent of it all while his sidekicks, Olly, Glen and Terri are pretty much there to take the blows for him. The show isn't for everyone because the humour is really dry but if you are a fan of the now modern day British sitcom then this is the most intelligent of the lot. witty dialogue, superb acting, and brilliant originality gives this underrated sitcom a 10/10."
    },
    {
      "username": "aequus314",
      "userUrl": "https://www.imdb.com/user/ur39829877",
      "reviewLink": "https://www.imdb.com/review/rw2737777",
      "warningSpoilers": false,
      "date": "16 January 2013",
      "rate": "8",
      "helpful": "16 out of 21 found this helpful.",
      "title": "Dry humor in maniacal proportions",
      "content": "It is difficult to find comedies that elicit genuine laughter these days and The Thick Of It distinguishes itself. A cold open format demands attention right away before the humor seeps in; by the time you realize what your gut is in for, the crays in Department of \"Social Affairs\" have crept their way into your system. Every preemptive political misstep creates so much hysteria and disaster it's impossible for bystanders not to find amusement in the absurdity and idiocy of it all.I am rather cautious about over hyped programs. Especially after feeling disappointed with The Office (UK), Little Britain and The Peep Show. But the lyrical filth snaps and pops too delightfully in this one to look away. Par course for the comic timing seized with perfection by Malcolm and Hugh.Although The Thick of It functions as satirical commentary on the British government, I find that anyone with a soft spot for political feuds and human nature will relate to it, and thus enjoy watching. Unless plot points and character device are specifically designed to allude to real life figures/events in each episode (in which case, I'm too uninformed to \"catch\"), you don't need sound knowledge of UK's current affairs to \"get it\". Much like how you don't need to be black or American to acknowledge the simple premise behind The Wire—classic institutional dysfunction and media consumption. Only difference between the two being the latter is a slow-burning novelistic tale layered with stoic horror, while the former flips like a sprightly comic book punctuated with wags and wit.Issues such as uninspired leadership, reluctant lackeys, chasing ranks, falsifying stats and information are things that guide and obstruct real progress within any system. In this sense, I think the appeal of The Thick Of It is universal. That the self-involved, self-defeating, borderline-sociopathic qualities harassing its spin doctors promptly blow up in their own clueless faces is just icing on the cake. Dry humor in maniacal proportions with accurate insights into the bureaucratic condition are worth the viewer ship. One season in and I think The Thick Of It is absolutely winning and hilarious."
    },
    {
      "username": "bevo-13678",
      "userUrl": "https://www.imdb.com/user/ur76062573",
      "reviewLink": "https://www.imdb.com/review/rw6193760",
      "warningSpoilers": false,
      "date": "21 October 2020",
      "rate": "10",
      "helpful": "8 out of 14 found this helpful.",
      "title": "Bum",
      "content": "That Scottish bloke sure does swear a lot. Wee bum poo"
    },
    {
      "username": "dzalokar-151-957721",
      "userUrl": "https://www.imdb.com/user/ur56258650",
      "reviewLink": "https://www.imdb.com/review/rw3117214",
      "warningSpoilers": false,
      "date": "4 November 2014",
      "rate": "10",
      "helpful": "15 out of 17 found this helpful.",
      "title": "Pure Gold!",
      "content": "I discovered The Thick of It after somebody suggested I watch In the Loop. This series is pure gold: Edgy, raw and totally believable. Peter Capaldi is a force of nature as Malcolm Tucker! His ability the rip a person apart and yet get them to buy-in with ideas is a work of art. The character of Malcolm Tucker ranks up there with TV characters like Archie Bunker as one of the most memorable in history. The rest of the cast (Chris Addison, Joanna Scanlan, Rebecca Front, James Smith etc ) have the daunting task of keeping up with Peter. Not only do they keep up, they make it possible to the chaos that is Malcolm Tucker possible. Brilliant from top to bottom! In a way the limited number of episodes, at first, seems like far too little. But after watching the series again (and again), offering more would be indulgent- Leave the audience satisfied!"
    },
    {
      "username": "mazowermax",
      "userUrl": "https://www.imdb.com/user/ur56906632",
      "reviewLink": "https://www.imdb.com/review/rw3135665",
      "warningSpoilers": true,
      "date": "4 December 2014",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Genius! Incredibly intelligent script!",
      "content": "Not only is this a hilarious TV show, it is also a strangely addictive. Armando and his team have written one of the greatest and funniest scripts of all time. Peter Capaldi is frighteningly good as Malcolm Tucker it just seems to get funnier every time you watch it. Easily the funniest TV programme I've ever seen. You need to watch each episode at least two times to get all of the jokes. It seems as though the episodes get better and better every time. Series 1 is good but series 2 is brilliant and it just progresses from then on. I wand lent the box set by a friend and after watching the first episode I became completely addicted and watched every single episode within a couple of weeks. The whole cast is fantastic and it is brilliantly rude. This is quite passable the greatest TV show ever made. Brilliant! Easily better than the Simpsons or anything else like that. It is educational, addictive and absolutely hilarious!"
    },
    {
      "username": "Spartan_1_1_7",
      "userUrl": "https://www.imdb.com/user/ur8202613",
      "reviewLink": "https://www.imdb.com/review/rw7186470",
      "warningSpoilers": false,
      "date": "1 August 2021",
      "rate": "9",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Sharp, Witty, Tight. The Thick of It is one Amazing series with Comedy that is rarely seen.",
      "content": "Set in the British Governmental system, Armando Iannucci's #TheThickofIt is a masterpiece of a series that satirizes the inner workings of the Government. Comedy like this is why I absolutely love British Humor.The writing is on another level. It's so sharp, witty, subtle yet bombastic and walking that line perfectly, and has layers of commentary with dark undertones while also being laugh out loud hilarious. It's just a joy to behold.Of course, none of it would matter if it weren't for the amazing cast that puts their best in every instance. All of the actors do their parts perfectly. One among them takes it to infinity and beyond, #PeterCapaldi. This man became one of my favourite actors after this series (and the spin-off movie In The Loop). The way he effortlessly goes on profanity-laced insults and demonizes everyone was beautiful.The way it's presented/directed, you feel like a fly on the wall having insider access to this escapist Government System and regardless of how much you know about Governments in general, the experience is enthralling.The only issue I have with the entire 4 Season run is that I wish there was more connective tissue between seasons and specials since there were events that I would have loved to see play out instead of skipping over them.One of the best series I've watched in a long while, especially when it comes to comedy. I'd highly recommend this to anyone who has any interest in British Comedies and can stomach the onslaught that is presented by Peter Capaldi. And if I were to rate it, I'd give it a 9/10."
    },
    {
      "username": "Red_Identity",
      "userUrl": "https://www.imdb.com/user/ur15562504",
      "reviewLink": "https://www.imdb.com/review/rw3125029",
      "warningSpoilers": false,
      "date": "16 November 2014",
      "rate": "",
      "helpful": "5 out of 9 found this helpful.",
      "title": "Fantastic.",
      "content": "What a fantastic series. Having seen Veep, definitely plays in the same ballpark, but it's edgier, darker, and meaner. The whole cast is absolutely fantastic. Capaldi is unbelievable in the role, already one of my all-time favorite comedic performances ever TV. Rebecca Front enters the series halfway and almost steals the whole thing. First two seasons are really good, but it's the last two that really resonate and make the whole thing hit another level. Great stuff. In The Loop is fine, but doesn't hit these levels. I find it especially impressive when a cast in a series knows they're in a comedy but know they have to play everything absolutely straight. If you knew nothing about what this was and stumbled upon almost any scene for a minute or so, you'd swear you were watching a political drama."
    },
    {
      "username": "pjdickinson-27822",
      "userUrl": "https://www.imdb.com/user/ur109568640",
      "reviewLink": "https://www.imdb.com/review/rw6465633",
      "warningSpoilers": false,
      "date": "11 January 2021",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Wonderfully toxic TV",
      "content": "Malcom Tucker is a sight to behold as he runs rampant through the corridors of power. Peter Capaldi plays this malevolent and ultimately tragic beast of a man to perfection and the use of extremely coarse language is elevated to become high art. Obviously this is not for the squeamish but it's a joy to watch."
    },
    {
      "username": "bubbareal",
      "userUrl": "https://www.imdb.com/user/ur103765723",
      "reviewLink": "https://www.imdb.com/review/rw4902333",
      "warningSpoilers": false,
      "date": "31 May 2019",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "One of the best",
      "content": "Written brilliantly. Peter Capaldi is outstanding, and the writing and the situations that occur make you wonder if that is what government is like. Outstanding."
    },
    {
      "username": "mraos",
      "userUrl": "https://www.imdb.com/user/ur0136488",
      "reviewLink": "https://www.imdb.com/review/rw3554450",
      "warningSpoilers": false,
      "date": "2 October 2016",
      "rate": "7",
      "helpful": "14 out of 21 found this helpful.",
      "title": "Nigh perfect yet almost completely destroyed by moronic shakycam.",
      "content": "Almost perfect series almost completely destroyed by the moronic usage of shakycam that was, for some unfathomable reason, the bees knees at the time.Whoever had the bright idea that shaking the camera like you've got seizures is in any way going to contribute to the \"immediacy\" of what is being shown? Jeez, when I take home videos with my phone it certainly doesn't look like that - this just looks like someone is deliberately flailing the camera about because it is \"cool\". It just distracting to the level that makes the show almost unwatchable. What a terrible terrible pity because otherwise this is a tremendous series on all levels... just made almost unwatchable because of some stupid fad."
    },
    {
      "username": "RodrigAndrisan",
      "userUrl": "https://www.imdb.com/user/ur20962118",
      "reviewLink": "https://www.imdb.com/review/rw4302165",
      "warningSpoilers": false,
      "date": "24 August 2018",
      "rate": "10",
      "helpful": "3 out of 5 found this helpful.",
      "title": "The acting is great!",
      "content": "It took me a while to realize whether it's a documentary filmed with a hidden camera or not. When I saw Armando Ianucci's name, I understood what I was watching, the guy is a super director."
    },
    {
      "username": "joecnh",
      "userUrl": "https://www.imdb.com/user/ur96800460",
      "reviewLink": "https://www.imdb.com/review/rw5402210",
      "warningSpoilers": false,
      "date": "12 January 2020",
      "rate": "3",
      "helpful": "11 out of 20 found this helpful.",
      "title": "I tried. I really did.",
      "content": "Had hoped it would be a modern take on Yes, but the God awful, annoying, overdone shaky (suppose to be reality/documentary style?) camera style was just too irritating. Took away from the performances, rather than enhancing them....."
    },
    {
      "username": "Dr_Coulardeau",
      "userUrl": "https://www.imdb.com/user/ur3836774",
      "reviewLink": "https://www.imdb.com/review/rw2075783",
      "warningSpoilers": true,
      "date": "3 June 2009",
      "rate": "10",
      "helpful": "8 out of 21 found this helpful.",
      "title": "Brilliantly muddy",
      "content": "It is fabulous but definitely not that funny. We must not imagine but realize we are governed by this kind of social climbers, this kind of social egotistic selfish egocentric psychopaths who only try to capture some power, not really for the power of it, or at the most the power it provides them with over their direct employees, their direct associates, their friends who are friends as long as they are useful. These people have no vision whatsoever. They can advocate a solution today and exactly the reverse on the following day. They can be gross and pretend they are dainty, or just plain liars and let you know they are suffering so much because they told a lie because they could not avoid telling such a lie because otherwise their wives, husbands, spouses, boy or girl friends, plain friends, children pets or even gold fish, or whatever, would have suffered in a way or another if they had not changed positions and convictions during the night and over the week end. Then you end up wondering why they are in their position of power, who in hell elected them, and you suddenly realize you elected them by not voting at all or by wasting your vote on a marginal side-kick candidate. After seeing such a perilous voyage in the stormy waters of political intrigue and the schizophrenic superman complex, you can only finally decide to vote for the good side next time. But is there a good side? Can we vote for Head without seeing that Head entails Tail, or vice versa? The only thing that changes in these people are not the teeth but the dentures. They all bite abundantly with steel or gold but always with gusto since for them the public is a piece of meat and the media are the pepper and the salt of the barbecued beef.Dr Jacques COULARDEAU, University Paris 1 Pantheon Sorbonne, University Versailles Saint Quentin en Yvelines, CEGID"
    },
    {
      "username": "surfisfun",
      "userUrl": "https://www.imdb.com/user/ur71501643",
      "reviewLink": "https://www.imdb.com/review/rw6765743",
      "warningSpoilers": false,
      "date": "1 April 2021",
      "rate": "8",
      "helpful": "3 out of 5 found this helpful.",
      "title": "seasons 1-2-3 very good, 4 feel lot less funny.",
      "content": "From s1 good start, it get in full steam in s2 and s3.Incredibly, s3 last 2 episodes are like an epic finale after watching all previous episode.S4 lost steam in writing/production. Too bad. Especially after the craziness of s3 finale, it is difficult to keep going.Recommended!!!"
    },
    {
      "username": "andrewinet",
      "userUrl": "https://www.imdb.com/user/ur9190288",
      "reviewLink": "https://www.imdb.com/review/rw6669006",
      "warningSpoilers": false,
      "date": "7 March 2021",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "One of the greatest political satires ever",
      "content": "This is political satire stripped to the bone, like a babbling, sweaty Beckett on speed.Brilliantly conceived and delivered by Armando Ianucci, scribed by great comedy scriptwriters including Jesse Armstrong, Sam Bain and Tony Roche, and made flesh by superlative performances by an outstanding cast, this puts policy and principles aside to focus on ego, venality and human self-delusion.It's raw and unforgiving, and definitely not for the faint-hearted, with powerhouse Peter Capaldi at the heart of it. If you only know him as The Doctor, you're in for a very big shock!"
    },
    {
      "username": "drfcx",
      "userUrl": "https://www.imdb.com/user/ur104081583",
      "reviewLink": "https://www.imdb.com/review/rw6376228",
      "warningSpoilers": false,
      "date": "18 December 2020",
      "rate": "9",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Intelligent comedy at its finest",
      "content": "It's simply excellent if you can get into the thick of it. I must have attempted watching through it at least 3 times before i finally sat through the whole 4 series, and once I managed to do so I found a great level of comedy that only a few series have been able to match, the narcissistic personalities of those in power seem very close to home. Whether this is how government runs is not for me to decide, but it feels true. And it's in that truth where the comedy lies, the beautiful semi scripted rants, the human worming and the media spin only add to the foundations, the fly on the wall camara work seem to have put some off, bit this is a listening comedy still very much attached to its roots in radio. The thick skinned characters all contribute something, and we all end up wishing we could talk to our colleagues the way they do. I really enjoyed the thick of it, It seemed to get better as it went along, and by the end I just wanted more. It's weird because I don't know if I could recommend it to anyone. You'll just have to see if you like it for yourself."
    },
    {
      "username": "jboothmillard",
      "userUrl": "https://www.imdb.com/user/ur4248714",
      "reviewLink": "https://www.imdb.com/review/rw2968683",
      "warningSpoilers": true,
      "date": "25 February 2014",
      "rate": "7",
      "helpful": "3 out of 8 found this helpful.",
      "title": "The Thick of It",
      "content": "I had heard many positive reviews about the this British series, especially about the cast and the inventive and frequent swearing, and to be honest I think that's mainly why I wanted to try it before seeing the spin-off film In the Loop, so I did, from writer Armando Iannucci (The Day Today, Alan Partridge). Basically it is a satirical look at the inner workings of modern British government, in the fictional Department of Social Affairs and Citizenship, with blundering minister Hugh Abbot (BAFTA and British Comedy Award winning Chris Langham) heading the department, who tries to do the right thing in situations, under the watch of aggressive Number 10's highly aggressive and domineering enforcer Malcolm Tucker (BAFTA and twice British Comedy Award winning, and three times BAFTA nominated Peter Capaldi), other characters include junior policy adviser Ollie Reeder (British Comedy Award nominated Chris Addison), senior special adviser Glenn Cullen (James Smith) and civil service press secretary Terri Coverley (Joanna Scanlan), the third series saw Abbot replaced by new head Nicola Murray (BAFTA and British Comedy Award winning Rebecca Front). Also starring Olivia Poulet as Emma Messinger, Vincent Franklin as Stewart Pearson, Will Smith as Phil Smith and Roger Allam as Peter Mannion. I can't really write a full review on what goes on, because all the politics stuff going on is to me is a bit mumbo jumbo and I can't always make much sense, I realise obviously it is conflicts between politicians, party spin doctors, advisers, civil servants and the media, and characters are cocking things up and that, but for me the best reason to watch the series is for the characters and swearing, Capaldi is fantastic always being in a huff and swearing every few minutes if not seconds, and Addison is a good bumbler, but also it is clever because although there is a script most of the dialogue is improvised by the cast, so it is a certainly a worthwhile political comedy. It won the BAFTAs for Best Situation Comedy (twice) (also twice nominated), and it was nominated for Best Writer, Best Writer: Comedy and Best Editing: Fiction, it won the British Comedy Awards for Best New TV Comedy, and it was nominated for Best TV Comedy and Best TV Sitcom (twice). Very good!"
    }
  ],
  "errorMessage": ""
}