{
  "imDbId": "tt0459159",
  "title": "The Thick of It",
  "fullTitle": "The Thick of It (TV Series 2005–2012)",
  "type": "TVSeries",
  "year": "2005",
  "episodes": [
    {
      "id": "tt2128315",
      "seasonNumber": "4",
      "episodeNumber": "1",
      "title": "Episode #4.1",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ5NzE2ODkwNV5BMl5BanBnXkFtZTgwMDk3MDg3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "8 Sep. 2012",
      "plot": "Peter Mannion is now secretary of state for the Department of Social Affairs and Citizenship. Spin doctor Stewart Pearson, on PM's orders, instructs him to launch an education initiative, to the annoyance of junior minister Fergus and the embittered Glenn. Glenn is supported by Terri, who is fed up and wants redundancy. Peter's brief is to launch an Apps initiative in a local school but the press conference shows him to be wholly out of touch with the subject. Ultimately he must reconcile with Fergus at a further press call to gain street cred - and just about does it.",
      "imDbRating": "7.4",
      "imDbRatingCount": "353"
    },
    {
      "id": "tt2128316",
      "seasonNumber": "4",
      "episodeNumber": "2",
      "title": "Episode #4.2",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU0MjM0NzYyNl5BMl5BanBnXkFtZTgwNjA4MDg3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "15 Sep. 2012",
      "plot": "Nicola is the leader of the opposition and, with Glenn gone, her new policy advisor is Helen Hatley. As Remembrance Sunday approaches Nicola feels the party should be realistic and agree with two unpopular policies of the government that they previously opposed. Tucker is appalled - as are the rest of the party - and things get worse when the press photograph Helen on the street with the notes from the policy meeting. Tucker is supportive - to her face but is secretly grooming Dan Miller, as he feels Nicola will commit political suicide soon anyway. And her ...",
      "imDbRating": "7.9",
      "imDbRatingCount": "327"
    },
    {
      "id": "tt2128317",
      "seasonNumber": "4",
      "episodeNumber": "3",
      "title": "Episode #4.3",
      "image": "https://m.media-amazon.com/images/M/MV5BMTY2MjQ4NjQ4N15BMl5BanBnXkFtZTgwMjk3MDg3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "22 Sep. 2012",
      "plot": "Mannion is a reluctant participant at Pearson's Thought Camp at a country hotel, where mobile phones are forbidden. Back at the ministerial office Phil finds the place deserted except for Glenn, still working on the Fourth Sector for Nicola, and Fergus and his advisor Adam, who are talking to economist Tara. Then the news breaks that anti-government protester Tickel has killed himself. Everybody rushes to inform Mannion, who can only get a phone signal on his mobile by standing on a children's slide - in which embarrassing pose he is photographed. But there is worse ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "339"
    },
    {
      "id": "tt2128318",
      "seasonNumber": "4",
      "episodeNumber": "4",
      "title": "Episode #4.4",
      "image": "https://m.media-amazon.com/images/M/MV5BMjI4NzUzMjE5M15BMl5BanBnXkFtZTgwMzk3MDg3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "29 Sep. 2012",
      "plot": "With Nicola on a train heading for Yorkshire, beset by Sky news reporters after scandal, Tucker plots her downfall for the party good, intending to replace her with Dan Miller and getting Ben Swain on side with the promise of a cabinet post. Tipped off by Glenn, Nicola offers Ben the role of shadow chancellor but Ollie, in hospital after a burst appendix, and persuaded by Tucker, prevails upon Glenn to find an email to discredit Nicola. It also incriminates Swain, leading to his being duped into resigning, whilst denouncing Nicola, who also stands down as leader with ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "320"
    },
    {
      "id": "tt2128319",
      "seasonNumber": "4",
      "episodeNumber": "5",
      "title": "Episode #4.5",
      "image": "https://m.media-amazon.com/images/M/MV5BMTg1NDMyODA5NF5BMl5BanBnXkFtZTgwMzY3MDg3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "13 Oct. 2012",
      "plot": "After Nicola's resignation Mannion considers following suit but saves himself on Phil's advice by putting the blame on Nicola for Mr Tickel's death, since her husband was part of the housing project which made Tickel homeless. Adam and Fergus persuade Glenn to send an email from Terri's computer to the Guardian, outlining all the snide jokes Mannion and his advisers made at Mr Tickel's expense, but end up getting incriminated themselves. Thus both political parties must now face investigation.",
      "imDbRating": "8.1",
      "imDbRatingCount": "323"
    },
    {
      "id": "tt2128320",
      "seasonNumber": "4",
      "episodeNumber": "6",
      "title": "Episode #4.6",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ3NjU1MjM3NV5BMl5BanBnXkFtZTgwMTM3MDg3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "20 Oct. 2012",
      "plot": "Ministers and aides from all parties are summoned to give evidence at the Goolding Inquiry into the events involving and following Tickel's suicide. First witness is Pearson, whose obscure jargonese strikes the panel as being at odds with his role as an information giver, whilst Tucker is reprimanded for trying to score political points. It soon becomes apparent that opposing sides are using the inquiry to discredit each other whilst those who sent the emails do a good job of discrediting themselves. Mannion struggles, as does Nicola (even though she called for the ...",
      "imDbRating": "8.8",
      "imDbRatingCount": "401"
    },
    {
      "id": "tt2469726",
      "seasonNumber": "4",
      "episodeNumber": "7",
      "title": "Episode #4.7",
      "image": "https://m.media-amazon.com/images/M/MV5BMjE2MTM3OTU2M15BMl5BanBnXkFtZTgwNjcxMDg3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "27 Oct. 2012",
      "plot": "The witnesses from the Goolding Inquiry nervously await the result. A further crisis looms over the number of police staff being cut by the Home office, leading to a backlog of paper work and queues outside police stations. Whilst Mannion and his advisers panic, Ollie sends Dan on a fact finding mission to Lewisham police station though it is not very productive. After delivering a rant to Ollie about his inadequacy as a replacement, Tucker tries to create a smoke screen by getting himself arrested, though this also falls flat. Glenn also quits, tearing strips off his...",
      "imDbRating": "8.3",
      "imDbRatingCount": "310"
    }
  ],
  "errorMessage": ""
}