{
  "imDbId": "tt0459159",
  "title": "The Thick of It",
  "fullTitle": "The Thick of It (TV Series 2005–2012)",
  "type": "TVSeries",
  "year": "2005",
  "episodes": [
    {
      "id": "tt0759886",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "Episode #1.1",
      "image": "https://m.media-amazon.com/images/M/MV5BNTg1MTk0MTgxNF5BMl5BanBnXkFtZTgwMDAyODg3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "19 May 2005",
      "plot": "Minister for Social Affairs Cliff Lawton is about to be sacked if the press is to be believed. Conniving political advisor Malcolm Tucker comes up with a solution. He must resign before he is fired and thus seem to be doing the decent thing. Cliff's replacement is Hugh Abbot, well-meaning and anxious to instigate his Snooper Force, issuing honest press releases irrespective of government directives. Policy advisors Ollie and Glenn are called in to make a compromise. Tucker is horrified and has his own response.",
      "imDbRating": "7.7",
      "imDbRatingCount": "653"
    },
    {
      "id": "tt0720699",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "Episode #1.2",
      "image": "https://m.media-amazon.com/images/M/MV5BMTYxOTk4Nzc4OV5BMl5BanBnXkFtZTgwODM2NDc3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "26 May 2005",
      "plot": "As press secretary Terri piles more departmental press releases on Hugh's desk, hard-hitting journalist Simon Hewitt publicly denounces his ability and Tucker is aghast to find out how ignorant Hugh is of popular culture, providing him with an idiot's guide tape. Ollie decides there should be a focus group and that they should be guided by a representative of middle England - Mary. Hugh is charmed by her. Tucker is wary and determined to get one over on Hewitt.",
      "imDbRating": "8.1",
      "imDbRatingCount": "565"
    },
    {
      "id": "tt0720700",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "Episode #1.3",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA0MTgwNjYwOV5BMl5BanBnXkFtZTgwMzM2NDc3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "2 Jun. 2005",
      "plot": "Not only is Hugh unsettled by the popularity of junior minister Dan Miller but his new Housing Bill is almost ready and it is discovered that he actually owns two houses - which would seem to be at odds with the spirit of the bill. Glenn suggests he tries to sell his flat in Notting Hill before the bill is read. Hugh hopes for some friendly publicity from the usually sympathetic journalist Angela Heaney but she is unimpressed by the dual ownership and it needs Tucker to deal with her.",
      "imDbRating": "7.8",
      "imDbRatingCount": "522"
    }
  ],
  "errorMessage": ""
}