{
  "imDbId": "tt0459159",
  "title": "The Thick of It",
  "fullTitle": "The Thick of It (TV Series 2005–2012)",
  "type": "TVSeries",
  "year": "2005",
  "episodes": [
    {
      "id": "tt1534321",
      "seasonNumber": "3",
      "episodeNumber": "1",
      "title": "Episode #3.1",
      "image": "https://m.media-amazon.com/images/M/MV5BMjExMjkyNDQ0MV5BMl5BanBnXkFtZTgwMDM1OTc3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "24 Oct. 2009",
      "plot": "Following the PM's resignation there is a cabinet reshuffle and Hugh is to be replaced as secretary of state for Social Affairs and Citizenship. Unfortunately only one person is interested in taking on the post, obscure junior minister Nicola Murray. True she is very keen but she also has a fear of lifts, a husband whose firm gets government contracts and a daughter about to start at a private school. Tucker is appalled but the only other likely candidate is his left bollock with a smiley face on it so he has to steer Nicola very carefully through a by-election poster...",
      "imDbRating": "8.0",
      "imDbRatingCount": "395"
    },
    {
      "id": "tt1538188",
      "seasonNumber": "3",
      "episodeNumber": "2",
      "title": "Episode #3.2",
      "image": "https://m.media-amazon.com/images/M/MV5BMTExMTQyMDQwNTleQTJeQWpwZ15BbWU4MDUyMTA4NzIx._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "31 Oct. 2009",
      "plot": "Nicola has been in post for a week and already the press are doubting her competence. So it is not a good time to learn that 'somebody' in the department has accidentally wiped the immigration records of 170,00 people over the past few months. Nicola has a press meeting with hostile Guardian journalists coming up and Tucker must ensure that they do not get to learn of the mistake. Needless to say they do and when Glenn refuses to obey her by sacking secretary Robyn as the scapegoat Nicola feels even more undermined.",
      "imDbRating": "8.4",
      "imDbRatingCount": "393"
    },
    {
      "id": "tt1543171",
      "seasonNumber": "3",
      "episodeNumber": "3",
      "title": "Episode #3.3",
      "image": "https://m.media-amazon.com/images/M/MV5BOTQ4MDY0MzA1OF5BMl5BanBnXkFtZTgwMTQ1Mjg3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "7 Nov. 2009",
      "plot": "Nicola and Ollie are in a hotel room at Eastbourne with annoying press officer John Duggan, trying to write her speech for the annual party conference. Glenn meets Julie Price, a tragic widow whose situation could be useful to Nicola but when Tucker tries to beef up the story it leads to a fight with Glenn - which Julie leaks on Twitter. Glenn does end up with a little T.L.C. and Nicola's speech could have been a lot worse, given that Terri was asking Robyn to provide jokes for her.",
      "imDbRating": "8.3",
      "imDbRatingCount": "388"
    },
    {
      "id": "tt1547407",
      "seasonNumber": "3",
      "episodeNumber": "4",
      "title": "Episode #3.4",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ2MzIzNTE2OV5BMl5BanBnXkFtZTgwMzUwNDg3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "14 Nov. 2009",
      "plot": "Opposition minister Peter Mannion comes to visit with his spin doctor Stewart Pearson and ambitious researcher Phil. Pearson is desperate to bring old style Tory Mannion into the twenty-first century but Mannion is the only one of the party unenthusiastic about the visit. Terri is looking forward to new blood taking over the building but for Nicola, anxious to push through her Fourth Sector Path-finder policy, the visit is just another unwelcome diversion to add to the phone calls from her mother and her daughter's school.",
      "imDbRating": "7.9",
      "imDbRatingCount": "362"
    },
    {
      "id": "tt1552594",
      "seasonNumber": "3",
      "episodeNumber": "5",
      "title": "Episode #3.5",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ4Njg3MTA2MV5BMl5BanBnXkFtZTgwMDE0Njg3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "21 Nov. 2009",
      "plot": "Nicola and Peter Mannion go head to head on Richard Bacon's Radio 5 phone-in show. Nicola does not do well with her idea of \"being inspired out of poverty\" and Mannion, despite Phil's sycophantic praise, fares no better. Tucker and Pearson, listening in, decide they must come to the rescue of their charges and, after exchanging insults and blackmail threats regarding members of the other's party, come to see that they have a lot in common. Emma meanwhile dumps Ollie.",
      "imDbRating": "8.7",
      "imDbRatingCount": "435"
    },
    {
      "id": "tt1557084",
      "seasonNumber": "3",
      "episodeNumber": "6",
      "title": "Episode #3.6",
      "image": "https://m.media-amazon.com/images/M/MV5BMTk2NDAwNDM3Nl5BMl5BanBnXkFtZTgwNjMyNTc3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "28 Nov. 2009",
      "plot": "In an interview Nicola makes it sound like Tom may be the \"right man\" for the job, but maybe she is \"the right woman\", starting a hide-and-seek game with the media. Now she's stuck on her own floor with her team, Ben Swain and Tucker.",
      "imDbRating": "8.2",
      "imDbRatingCount": "383"
    },
    {
      "id": "tt1557470",
      "seasonNumber": "3",
      "episodeNumber": "7",
      "title": "Episode #3.7",
      "image": "https://m.media-amazon.com/images/M/MV5BMjI2NDc3ODQwNV5BMl5BanBnXkFtZTgwNzgwNTc3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "5 Dec. 2009",
      "plot": "Nicola is keen to find a famous sports person to front her Healthy Choices campaign but Tucker is officially on holiday - or rather recovering from the result of his spat with Terri. Thus new spin doctor Steve Fleming is brought in and whilst Ollie may regard him as a saviour this is the man Tucker once drummed out of the party. The last thing he wants is to give his old adversary power over him so he hosts a cosy lunch for the press, stressing that, whatever people think, he is still in charge.",
      "imDbRating": "8.5",
      "imDbRatingCount": "377"
    },
    {
      "id": "tt1566416",
      "seasonNumber": "3",
      "episodeNumber": "8",
      "title": "Episode #3.8",
      "image": "https://m.media-amazon.com/images/M/MV5BMTg1NTMzNjkxM15BMl5BanBnXkFtZTgwMjQ5ODc3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "12 Dec. 2009",
      "plot": "Tucker's out of government, looking for a new job. So is Nicola. But her resignation might start a coup led by Dan Miller. Can Tucker get his office back and mess things up for Steve Fleming in the process?",
      "imDbRating": "8.1",
      "imDbRatingCount": "355"
    }
  ],
  "errorMessage": ""
}