{
  "imDbId": "tt0459159",
  "title": "The Thick of It",
  "fullTitle": "The Thick of It (TV Series 2005–2012)",
  "type": "TVSeries",
  "year": "2005",
  "episodes": [
    {
      "id": "tt0720701",
      "seasonNumber": "2",
      "episodeNumber": "1",
      "title": "Episode #2.1",
      "image": "https://m.media-amazon.com/images/M/MV5BMjAzOTQ5MDc5M15BMl5BanBnXkFtZTgwNDM2NDc3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "20 Oct. 2005",
      "plot": "Whilst visiting a factory Hugh is accosted by an irate woman complaining about her mother's treatment on the N.H.S. At the same time Ollie is dating a woman who is an advisor for the opposition party in the hopes that he will act as Tucker's spy. Hugh's discomfort is of course a Godsend to the other side but Ollie has to appreciate that loyalty to the party is more important than a girlfriend and help Tucker dig Hugh out of the mess.",
      "imDbRating": "8.2",
      "imDbRatingCount": "491"
    },
    {
      "id": "tt0720702",
      "seasonNumber": "2",
      "episodeNumber": "2",
      "title": "Episode #2.2",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc4MTA2MTY2N15BMl5BanBnXkFtZTgwMTM2NDc3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "27 Oct. 2005",
      "plot": "Following a cabinet reshuffle Julius Nicholson, an outside advisor, arrives to investigate the policies of all the major departments. Tucker is outraged and sees it as his job to be obstructive. Learning that the P.M.'s wife is known for her dislike of him and with his appearance on 'Question Time' fallen through, Hugh aims to soften up the press by throwing a party, only to find that Nicholson is doing the same. This really is the time for Tucker to start those Chinese whispers and put paid to Nicholson.",
      "imDbRating": "7.8",
      "imDbRatingCount": "443"
    },
    {
      "id": "tt0720703",
      "seasonNumber": "2",
      "episodeNumber": "3",
      "title": "Episode #2.3",
      "image": "https://m.media-amazon.com/images/M/MV5BMTUwNTg1NjY5M15BMl5BanBnXkFtZTgwODI2NDc3MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "3 Nov. 2005",
      "plot": "Terri has returned from compassionate leave after her father's death and Hugh is back from holiday. The department has a new name, the Department of Social Affairs and Citizenship, though they seem to be dealing with issues no other departments want. They also have a new building but it is a disappointment - with no ventilation and the email system is down so the staff must temporarily use their own email addresses. Hugh takes a dislike to educational advisor Roy Smedley over special schools and uses Terri's computer to send Glenn an email calling him a four letter ...",
      "imDbRating": "8.4",
      "imDbRatingCount": "458"
    },
    {
      "id": "tt0933666",
      "seasonNumber": "2",
      "episodeNumber": "4",
      "title": "The Rise of the Nutters",
      "image": "https://m.media-amazon.com/images/M/MV5BZTRmMDg3ZmItNmMzMS00N2E2LTkwYmMtNDdlYTU2MTU3Yjg1XkEyXkFqcGdeQXVyMjc5Mjg2MTk@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "10 Jan. 2007",
      "plot": "With Hugh in Australia and Glenn in Wales, Ollie is left in charge, feeding policies to junior minister Ben Swain. He is one of the 'Nutters', the group keen to take power when the P.M. resigns and keen to make a name for himself - which he does in the wrong sense when Jeremy Paxman skewers him on 'Newsnight'. This is music to Tucker's ears as it is in his interest for the P.M. to remain in power for as long as he can. Ollie's new girlfriend Emma is working for Shadow Minister Peter Mannion and hopes to impress by stealing one of Ollie's idea for use on their ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "452"
    },
    {
      "id": "tt1062832",
      "seasonNumber": "2",
      "episodeNumber": "5",
      "title": "Spinners and Losers",
      "image": "https://m.media-amazon.com/images/M/MV5BMzYzN2IyNGItMjFiNS00ODYzLTgxYjEtZmYzNmJlZjI1NzZjXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "3 Jul. 2007",
      "plot": "Peter Mannion's speech on immigration, leaking the PM's policy, did not have the effect Tucker desired and now the PM is resigning, leaving the way clear for the Nutters and their leader Tom. Ollie has been promised a job by young Nutter Ben Swain, Tucker's assistant has encouraged Hugh's predecessor Cliff to stand as a stalking horse and Glenn is keen to keep Hugh in the frame whilst his boss is in Australia. Fortunately Tom has a dark secret which is just what Tucker is looking for but will it be enough?",
      "imDbRating": "8.5",
      "imDbRatingCount": "443"
    },
    {
      "id": "tt1096734",
      "seasonNumber": "2",
      "episodeNumber": "6",
      "title": "Spinners and Losers: Opposition Extra",
      "image": "https://m.media-amazon.com/images/M/MV5BYjVjZTQzZjQtNGFhYy00YmEyLWE5NmUtOTYyYjFlYTQ5YzFkXkEyXkFqcGdeQXVyMjc5Mjg2MTk@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "3 Jul. 2007",
      "plot": "Following the events of \"Spinners and Losers\" from the perspective of the Opposition.",
      "imDbRating": "7.6",
      "imDbRatingCount": "172"
    }
  ],
  "errorMessage": ""
}