{
  "imDbId": "tt0367279",
  "title": "Arrested Development",
  "fullTitle": "Arrested Development (TV Series 2003–2019)",
  "type": "TVSeries",
  "year": "2003",
  "items": [
    {
      "username": "vonnoosh",
      "userUrl": "https://www.imdb.com/user/ur34196744",
      "reviewLink": "https://www.imdb.com/review/rw8702904",
      "warningSpoilers": false,
      "date": "30 November 2022",
      "rate": "8",
      "helpful": "29 out of 29 found this helpful.",
      "title": "\"What has gotten into you? Have you been eating cheese?\"",
      "content": "10 stars belong to the Fox network run of the series. I still remember watching the debut season on Sunday evenings. The netflix reboot was just.........wrong and I knocked off 2 stars because it feels little more than a knock off than an actual continuation of the show. The reboot feels like there's 2/3rds less comedy in each episode compared to the shows in the first 3 seasons. Also, it does a really lousy job trying to pick things up years down the line. More clumsy than offbeat funny. They really could have done better. Maybe it tries too hard but its years too late, maybe it forgot the show had likable characters, maybe it was too busy trying to be a political allegory instead of being funny like, a sitcom. I guess it's true what they say about any art. You can't go back and pretend it's the same. Then again, there's a few netflix reboots that failed miserably after moving to that streaming service (Designated Survivor anyone??].So the show has the appearance of a reality tv show/mockumentary about a rich family who ends up broke and mired in legal troubles. In the orginal run, it focused on the middle son of the family trying to keep the family and business going despite his desperation to abandon them. The show throws alot of comedic curves and stays fresh for awhile as things get more outlandish. I rank the oringal 53 episode run up there with Fawlty Towers considering the amount of jokes and gags stuffed into a single episode. It is incredible how much they got into one 23 minute episode. Its like a joke every 7 seconds and yet they still develop a story in that. Those first 3 seasons are the fastest feeling and most enjoyable binge watching experience of all time.Arrested Development had a very strong cult following (sadly lousy ratings) hence its demand for a reboot but honestly the first 3 seasons are a perfect bookend. It ends where it begins under similar circumstances but with opposite resolutions. One can only do so much for people who only think of themselves but are still somehow incapable of helping themselves. That was the lesson learned and leaving it there was right.If you only know the series from its initial 3 season 53 episode run but never got around to the 4th and 5th season netflix run, you aren't missing anything. They're forgettable. The reboot is like those Gilligan's Island movies after that show ended or the Revenge of the Nerds movies that never made it to theaters. The fast paced humor is gone, the story is a mess, the premise restated during the opening credits is abandoned and instead of the narration helping fuel comedy, it turns into boring exposition most of the time. Like the plot and existence of the characters alone is meant to be the joke and the show was always about black comedy which it never was (more of a screwball comedy than anything else). I question if anyone involved in the reboot really wanted to do it for more than just money."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8573954",
      "warningSpoilers": false,
      "date": "28 September 2022",
      "rate": "9",
      "helpful": "44 out of 46 found this helpful.",
      "title": "One of the most underrated comedies ever!",
      "content": "As you can tell by reading through most of these reviews, Arrested Development is loved by just about everyone who's seen it. It ended only after three seasons which was way too soon for such a great show. Netflix renewed it 8yrs after it went off the air. Season 3 was in 2005 and it wasn't until 2013 until season 4 finally made its debut. But those first few seasons were so good that it didn't still have to put this among my favorite sitcoms of all-time! It's about the Bluth family and how one of the sons, Micheal Bluth (Jason Bateman), takes over the family business and affairs when his father George Bluth (Jeffrey Tambor) goes to prison. This family is so dysfunctional that they make Michaels life impossible. If you haven't seen this yet then do yourself a favor and watch it asap!"
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw7033923",
      "warningSpoilers": false,
      "date": "16 June 2021",
      "rate": "9",
      "helpful": "48 out of 51 found this helpful.",
      "title": "So Funny!",
      "content": "Arrested Development really is one of the funniest and most underrated tv shows ever created, especially the first three seasons! As most of the reviews have already said the quality dropped off for the last 2 seasons when it came back after taking a few years off. But those first few seasons were so good that it makes this show an all-time great sitcom!"
    },
    {
      "username": "jimdbs",
      "userUrl": "https://www.imdb.com/user/ur134212221",
      "reviewLink": "https://www.imdb.com/review/rw8432710",
      "warningSpoilers": false,
      "date": "12 August 2022",
      "rate": "9",
      "helpful": "34 out of 34 found this helpful.",
      "title": "Score out of 10 by season: 1 - 9, 2 - 10, 3 - 8, 4&5 - 5",
      "content": "The main score is excluding the last 2 seasons. Judging by the first 3 seasons, this is one of the best sitcoms ever made but various factors led to it not doing so well while it ran and getting cut. It became a lot more popular after it had ended and word of mouth got around about how great it was. Due to popular demand and the show being cut so soon, there were rumors about it being revived for years but unfortunately that didn't happen until Netflix decided to pick it up about 7 years after the last season.I don't know what happened with season 4, but the end result was a season with some big issues and lacking the clever comedy of the first 3 seasons. Season 5 was released nearly 5 years later that unfortunately was also very disappointing. I suspect a key person or people were not involved in season 4 and 5 (like Larry David was not involved in the last few seasons of Seinfeld, though the drop in quality wasn't as severe) or Netflix people butted in too much thinking they knew better.Again, the first 3 seasons are excellent and up there with other top sitcoms. Several of those sitcoms also had disappointing seasons towards the end, just most had made it at least 5 seasons before the quality started to decline. Arrested Development most likely would have been similar had Fox not canceled it after season 3."
    },
    {
      "username": "Snoopy1",
      "userUrl": "https://www.imdb.com/user/ur1700115",
      "reviewLink": "https://www.imdb.com/review/rw0924015",
      "warningSpoilers": false,
      "date": "9 August 2004",
      "rate": "",
      "helpful": "524 out of 583 found this helpful.",
      "title": "Very funny",
      "content": "This show takes a few episodes before you *really* GET it. And once you get it, you'll realize why everybody thinks it's one of the best sitcoms ever.Each character is really defined and original...with real, unique personalities. All of the actors have fantastic chemistry, making for really great interactions and relationships within the show.The writing for this show is great, and the plots are so absurd that you can't help but find them funny. A refreshing change in a world where people like reality shows...it's the only good sitcom left."
    },
    {
      "username": "Lukasmj",
      "userUrl": "https://www.imdb.com/user/ur158768880",
      "reviewLink": "https://www.imdb.com/review/rw8781933",
      "warningSpoilers": false,
      "date": "6 January 2023",
      "rate": "8",
      "helpful": "24 out of 25 found this helpful.",
      "title": "Very good, when you don't watch the last seasons.",
      "content": "His family drives Michael Bluth to despair: his father George is in custody for fraud. His mother Lucille thinks only of the damaged image of the family. His older brother, Gob, is such an unsuccessful wizard that even the Mages Union threw him out. Younger brother Buster is 30 and still a mama's boy. Then there's his sister Lindsay, who is in a bizarre marriage to ex-psychiatrist and untalented actor Dr. Tobias Funke leads.\"Arrested Development\" offers hours of good entertainment due to very funny humor and good actors.The revival of the series in 2013 felt a lot more like necrophilia and wasn't pretty to look at."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2458062",
      "warningSpoilers": false,
      "date": "13 July 2011",
      "rate": "10",
      "helpful": "19 out of 20 found this helpful.",
      "title": "One of the funniest and smartest shows I have seen",
      "content": "I have seen a lot of great shows and a few bad ones. Arrested Development is brilliant, at least in my view. The show is well made visually, with very nice photography and sets that don't look cheap in any way. The music is memorable, particularly the theme tune, the story lines are well-structured with any big themes executed cleverly and the writing and jokes are some of the funniest and smartest I've seen. The characters are admittedly strange, but they are also unique and have their likability too, while the acting from the whole cast is consistently top-notch and the show even uses their guest stars in a creative way. All in all, funny, smart and engaging, quite simply a brilliant show. 10/10 Bethany Cox"
    },
    {
      "username": "nightswatch",
      "userUrl": "https://www.imdb.com/user/ur8396180",
      "reviewLink": "https://www.imdb.com/review/rw1494586",
      "warningSpoilers": false,
      "date": "10 October 2006",
      "rate": "10",
      "helpful": "182 out of 208 found this helpful.",
      "title": "UNparalleled",
      "content": "You've doubtless heard fans rave and rave about this show, and may have even checked it out. The camp is sharply divided, people either absolutely love it, or tend to just \"not get it.\" In that sense it may not be for everyone (great television, and great art in general, rarely is), and to each his own. But after watching each season multiple times, I can easily say that it is the funniest show that I have ever seen by an ENORMOUS margin. Even after many repeat viewings, I still end up in tears all the time.DVD treats this series well simply because it suits itself to rapid digestion (and after getting hooked, you won't be able to get up). The writers include many, many running gags that persist through entire seasons, or even the entire series (\"I've made a huge mistake.\" \"Her?\"). The entire cast is extremely WELL cast and everyone's comedic timing is spot on. The real stars are David Cross as Tobias, and Will Arnett as GOB. Their physical comedy is drop dead hilarious as well. But Jessica Walters and Jeffrey Tambor are phenomenal, the former most especially in the third season.As others have stated there is no laugh track and this is part of what throws some of the \"we don't get it\" camp off. The humor is very fast paced as well, and many of the biggest laughs are very subtle physical comedy, or a line of dialog that is dropped in the midst of a conversation. Some of the music that was written for the show is absolutely hilarious as well, especially the song that plays often when George Micheal is put in an awkward (sexual) situation (\"whatcha trying to say to me??\").Start with season 1, give it 4 episodes (go through at least the episode \"key decisions\" which I believe is ep 4). If you're not hooked, or at least intrigued by then, its likely you wont be at all. But if you're like me, and MANY others, you'll find that you've just stumbled upon one of the greatest shows ever made. VERY highly recommended. 10/10"
    },
    {
      "username": "safenoe",
      "userUrl": "https://www.imdb.com/user/ur34307814",
      "reviewLink": "https://www.imdb.com/review/rw7867390",
      "warningSpoilers": false,
      "date": "15 February 2022",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "The first three seasons",
      "content": "I have only watched the first three seasons and I wish I could rate this 11/10 but IMDb doesn't allow this. Anyway, Arrested Development is smart and whipsmart all at once. So much has been written about Arrested Development, and what more can I add? The direction, writing and acting is smart and subversive without a doubt."
    },
    {
      "username": "metalgoth",
      "userUrl": "https://www.imdb.com/user/ur1564589",
      "reviewLink": "https://www.imdb.com/review/rw0974769",
      "warningSpoilers": false,
      "date": "8 December 2004",
      "rate": "",
      "helpful": "333 out of 385 found this helpful.",
      "title": "Great TV",
      "content": "Strange, Fox's promos almost made me miss out on this whole thing.It's a sit-com made with very high standards, it's a career revival for Ron Howard, Henry Winkler and Liza Minelli, and it's a show that puts Fox's profile into HBO territory. \"It's Arrested Development\"\"In fact...\", a Ron Howard quote that has become a cliché around our house, in fact, it's all those things and more. The writing is as good as everyone says it is, the cast is on par with that of Seinfeld or Roseanne. (Say what you will about her, that was a dream cast) Whenever new characters appear, they are inevitably played by people familiar to fans of edgy, intelligent humor. People like Jeffrey Tambor and Jason Bateman are dependably good, Michael Cera is a standout, and David Cross is finally being seen for the talent that he is. The strongest thing I can say about this is that I find myself repeating various running gags, things that, like \"In fact...\", have become clichés. \"I've made a huge mistake.\" \"I'm having the time of my LIFE in here!\" \"surprisingly cat-like\" \"Take a powder, willya fellas?\"This last one, uttered by Liza Minelli as Lucille Austero, sticks with me especially, and I hope that Liza stays with the show longer. As good as the principles are, she manages to outclass even them. The same with Henry Winkler, whose Barry Zuckercorn is the sort of lawyer television's been dying for. Among those main players, Lindsay and Tobias are pretty strange characters to begin with, but when you consider that they are an old married couple, that crosses the line into the bizarre. This show is full of people and situations you just won't see anywhere else, at least until other derivative shows start appearing.Watch carefully, as there are many bit and pieces lingering in the background that you might miss. Recently, George Michael was dumped by his girlfriend. As he trudged home in a state of misery, you could hear sad Charlie Brown music. In the background, you could see a real - but bright red - dog house, with a real dog lying on top of it. It's things like these that tell me that the creators are just pleased to be doing this show for it's own sake, and that kind of love of the work shows through in the end.Who knows if this show will last? There's an audience out there for this sort of thing, but they've generally settled into the Sunday night HBO schedule. Hopefully the Emmys, the word of mouth, and the critical raves will draw attention to this show. If not, we'll just have our A.D. dvds to keep us warm, and thank God for 'em!"
    },
    {
      "username": "Paddurick",
      "userUrl": "https://www.imdb.com/user/ur113123844",
      "reviewLink": "https://www.imdb.com/review/rw8254147",
      "warningSpoilers": false,
      "date": "19 June 2022",
      "rate": "8",
      "helpful": "24 out of 25 found this helpful.",
      "title": "8/10",
      "content": "One of the best American comedies. Really clever and consistently funny. Amazing performances from all character, not a single weak link and rarely a dull moment in the show. Quality."
    },
    {
      "username": "masckerdoom",
      "userUrl": "https://www.imdb.com/user/ur158562533",
      "reviewLink": "https://www.imdb.com/review/rw8661400",
      "warningSpoilers": false,
      "date": "7 November 2022",
      "rate": "9",
      "helpful": "24 out of 24 found this helpful.",
      "title": "A New Beginning",
      "content": "With a masterpiece of a first season, it perfected and pioneered a new industry of televised comedy, while simultaneously remaining unsurpassed in all the years of attempts to mimic its success.It's nearly perfect and never feels like it's trying to hard to be. The concept, music, direction, and cast are all amicable with one another to a point where one can only deify its miracle.The characters who support this story feel like they couldn't be adequately played by anyone else, and furthermore, as if their actors were born for the role.It isn't rude or aggressive. It's clever, subtle, and debatably suitable for family viewing, and it's comforting to watch. It takes character struggles that are so zany and far removed from your reality that you you won't be presumptuously bothered to invest yourself and draw comparison, and supplements those with honest, endearing character moments that remind you the characters are human. This show thrives on its own merit, and I get sudden urges to watch it.I wish I could review individual seasons, because man, this one was disgraced. Count this for season one."
    },
    {
      "username": "benps",
      "userUrl": "https://www.imdb.com/user/ur98017655",
      "reviewLink": "https://www.imdb.com/review/rw5964155",
      "warningSpoilers": false,
      "date": "3 August 2020",
      "rate": "10",
      "helpful": "24 out of 25 found this helpful.",
      "title": "Excluding season 4 & 5",
      "content": "I'm excluding those seasons because I barley watched season 4 as it was unbearable, and I didn't even attempt to watch season 5. To me, Arrested Development is 3 incredible seasons of inventive, clever, witty television. This show was so funny. I loved the use of narration, visual gags, running gags, and how they contributed to the storytelling. It was always very well written, and the cast was amazing. They all bought something very distinct to their characters. I particularly liked Gob and Tobias the most, and Will Arnett and David Cross were both brilliant respectively. Loved this show, and it's a shame what it's slowly turned into."
    },
    {
      "username": "AlphabetCity",
      "userUrl": "https://www.imdb.com/user/ur2676065",
      "reviewLink": "https://www.imdb.com/review/rw0923999",
      "warningSpoilers": false,
      "date": "14 December 2003",
      "rate": "10",
      "helpful": "508 out of 573 found this helpful.",
      "title": "The smartest thing Fox has done yet",
      "content": "This is the funniest show currently on television. All you need to enjoy this show is an appreciation for high-quality acting and incredibly hilarious writing. Jason Bateman as Michael Bluth is perfect as the under-appreciated do-good guy who's just trying to keep his family together and himself sane. Other highlights of the show include Will Arnett as GOB (George Oscar Bluth II), Michael's lame-excuse-for-a-magician brother; Jeffrey Tambor as George Sr., Michael's incarcerated father (he was jailed for \"shifty accounting practices\"); and Michael Cera as George Michael Bluth, Michael Bluth's perpetually nervous 13-year-old son (who just happens to have a strange infatuation with his cousin, Maebe, played by \"State of Grace\"'s Alia Shawkat). All in all this show is sure to be a hit, at least with those people whose level of understanding of comedy is above slapstick and bathroom jokes. TREMENDOUSLY hilarious writing and outstanding performances by the whole cast will have you laughing the whole time. Ten out of ten!"
    },
    {
      "username": "crothman",
      "userUrl": "https://www.imdb.com/user/ur0029708",
      "reviewLink": "https://www.imdb.com/review/rw0923998",
      "warningSpoilers": false,
      "date": "25 November 2003",
      "rate": "",
      "helpful": "129 out of 166 found this helpful.",
      "title": "Hilarious comedy!",
      "content": "Probably the best show of the 2003 season, and the best new comedy in years. It's very hard to describe, since the comedy is entirely character-based, not plot- or wisecrack-based.Basically, it's the story of the Bluth family, developers who are in bankruptcy with the father in prison for fraud. One son, Michael, tries to be responsible and keep things going, while the rest of the group is entirely self-centered and can't seem to focus on the fact they are broke and in disgrace.The various family members go off in various directions: George (GOB) fancies himself a magician, Buster is a momma's boy, Lindsay goes off supporting odd causes, Lindsay's husband Tobias fancies himself an actor. It's a show you need to watch closely, but the laughs are all over the place, from unexpected directions."
    },
    {
      "username": "deepfrieddodo",
      "userUrl": "https://www.imdb.com/user/ur123203865",
      "reviewLink": "https://www.imdb.com/review/rw6113682",
      "warningSpoilers": false,
      "date": "21 September 2020",
      "rate": "8",
      "helpful": "7 out of 7 found this helpful.",
      "title": "A Tale of Two Productions",
      "content": "Seasons 1-3:Arresting & Constantly DevelopingThe first three seasons of this comedy are brilliant. Maybe a few episodes have to be sat through before you can truly appreciate it, and at times it can be incredibly frustrating to see the character's selfishness, but this all builds excellently.Call backs to previous episodes, characters and jokes provide a lot of the big laughs, and at times you have to pay attention to notice the background jokes which just make this comedy so unique. The cast have brilliant chemistry, and the serialisation flows so well.Bateman is perfect as the lead, and all the supporting characters could not have been cast better. So, definitely watch the first 3 series.Rating: 10/10Netflix Reboot:Reboot DudUnfortunately seasons 4 & 5 are a far cry from the original show. They were right to re-edit season 4 into 20-minute episodes after the original releases were too long. But, this means that 25% of every episode is now a recap of what's already happened, as you try to follow a timeline chronologically from several different arcs which eventually interlink.The template to the first three seasons are similar in terms of jokes, but they fall flat, and there aren't anywhere near as many laughs. Frequently in every episode voices are dubbed and it's so evident that it can't fall into fourth wall breaking but just amateurism. The decision to cast Seth Rogan and Kristen Wiig as the young Bluths seems like an attempt to shoehorn in a couple more big names, but their scenes lose a lot of the humour created by having the original actors playing their younger selves. It's disappointing that the original show couldn't hold on to its quality after Netflix picked it up.Season 5 is more of the same. Fortunately no constant recaps, and it actually has arcs where the family are together, plus Barry and Buster offer some relief occasionally, but ultimately the show is no better. Another recast of the young Bluths makes flashback scenes just painful to watch. Just let it die, Netflix.Rating: 5/10."
    },
    {
      "username": "Nicholai",
      "userUrl": "https://www.imdb.com/user/ur0883636",
      "reviewLink": "https://www.imdb.com/review/rw0958132",
      "warningSpoilers": false,
      "date": "7 November 2004",
      "rate": "",
      "helpful": "166 out of 217 found this helpful.",
      "title": "HI-Larious as Well As Intelligent",
      "content": "In this age of lazily-conceived, hastily-produced, fill-in-the-blank reality shows that the FOX network seems to corner the market on, it's refreshing to see them invest in a show that doesn't fit a clichéd formula and challenges the audience's intellect with hilarious results.Previously, I had written off this show without giving it a chance, assuming that it's just another show about rich people with problems, a la \"The OC\". It's too bad I didn't give it a chance because I just happened to watch a random episode right while waiting for \"Malcom in the Middle\". Little did I expect to laugh so hard at George Michael continuously wearing a muscle suit just because his COUSIN. Maebe, gave him a passing compliment. And the absurdity of the situation was amplified by Ron Howard's deadpan narration of the episode, giving it the seriousness the situation doesn't deserve.The show was still confusing because I wasn't clear on all the relationships and the origninating humor that the episodes look back to. Good think FOX did a marathon of the show in order to set me straight.Bottom line, this show did not win all those Emmies for nothing. It could give Frasier, Friends and Seinfeld a run for their money any day. Let's hope the Emmys shielded the show from the FOX cancellation bug that afflicted other good shows such as \"Action\", \"Titus\", \"Greg The Bunny\" and ESPECIALLY \"Family Guy\".**** out of ****"
    },
    {
      "username": "13Funbags",
      "userUrl": "https://www.imdb.com/user/ur68345682",
      "reviewLink": "https://www.imdb.com/review/rw4390380",
      "warningSpoilers": false,
      "date": "11 October 2018",
      "rate": "5",
      "helpful": "20 out of 25 found this helpful.",
      "title": "Should have ended after 3 seasons.",
      "content": "What is the deal with season 5? Are George Michael and Maeby supposed to still be teenagers? Why do they call the model home George Michael's childhood home? I knew it was over when GM punched his dad. Another great show has been ruined."
    },
    {
      "username": "franciscocole",
      "userUrl": "https://www.imdb.com/user/ur132337692",
      "reviewLink": "https://www.imdb.com/review/rw6898583",
      "warningSpoilers": false,
      "date": "9 May 2021",
      "rate": "9",
      "helpful": "25 out of 29 found this helpful.",
      "title": "only recognize the first 3 seasons",
      "content": "Season 1: 8/10 Season 2: 10/10 Season 3: 9/10I don't recognize the rest."
    },
    {
      "username": "rdatsun",
      "userUrl": "https://www.imdb.com/user/ur0688202",
      "reviewLink": "https://www.imdb.com/review/rw0986761",
      "warningSpoilers": true,
      "date": "28 December 2004",
      "rate": "",
      "helpful": "472 out of 646 found this helpful.",
      "title": "Am I watching the same show you guys are watching?",
      "content": "OK, seriously, after reading the recent past reviews of the show am starting to ask myself if you people are even giving the show at least five minutes of your time before rushing online to bash it. You guys are saying that season 2 is going downhill yet your not even explaining why the this season is so inferior to the first. I've seen the second season and I have to say it right on par with the first with more funny twist and situations that Michael and the Bluths have to deal with. Yes they changed some of the story lines now (George Sr. on the run, Gob taking over the company, Buster threating to join the army, and so forth) but THATS HOW SEASONS GO. If they kept the same storyline from the first the show would've haven't gotten repetitive before the first two episodes. And beside the show still retains it wit and subtle humor from the first show while continuing storyline from previous episodes. So really whats the problem with the second season? Cause all am hearing is whining and undeserved bashings from folks with short attention spans."
    },
    {
      "username": "modhvatsal",
      "userUrl": "https://www.imdb.com/user/ur53649942",
      "reviewLink": "https://www.imdb.com/review/rw4400601",
      "warningSpoilers": false,
      "date": "16 October 2018",
      "rate": "9",
      "helpful": "137 out of 152 found this helpful.",
      "title": "Well Netflix ruined it....",
      "content": "First three seasons were like best thing you could see in a sitcom ever. But from 4th season it's all going downhill. I couldn't even get through season 5. If it wasn't for last two seasons, this show would have been my favourite sitcom."
    },
    {
      "username": "LaxAxl",
      "userUrl": "https://www.imdb.com/user/ur77652165",
      "reviewLink": "https://www.imdb.com/review/rw4746587",
      "warningSpoilers": false,
      "date": "27 March 2019",
      "rate": "10",
      "helpful": "27 out of 29 found this helpful.",
      "title": "The best show, for the most part",
      "content": "Seasons 1-3: 10/10Season 4 (Original edit): 6/10Season 4 (Re-edit): 6/10Season 5: 6/10This show really dipped in quality once Netflix picked it up. The new seasons still have their moments, but it never lived up to the original episodes."
    },
    {
      "username": "ITALUKE",
      "userUrl": "https://www.imdb.com/user/ur83793226",
      "reviewLink": "https://www.imdb.com/review/rw7956419",
      "warningSpoilers": false,
      "date": "14 March 2022",
      "rate": "9",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Incredible.",
      "content": "After seeing all the five seasons I can finalky write my review. Second season is my favourite season. The writing of the whole show is incredible and so is the comedy. I am so glad that this is not a show with dumb jokes. The cast is also incredible."
    },
    {
      "username": "adam111111",
      "userUrl": "https://www.imdb.com/user/ur77731270",
      "reviewLink": "https://www.imdb.com/review/rw3741411",
      "warningSpoilers": false,
      "date": "28 June 2017",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Hilarious and well-executed show.",
      "content": "This is, without a doubt, the greatest TV comedy in capturing the 2000s. It mocks the paranoia surrounding the Iraq War, the 24-hour news cycle, the housing boom and bust, and the cult of reality television without missing a beat.It does all of that without ever seeming preachy or losing its charming sense of humor. There is no scene in the series that lacks the self- referential humor that characterizes the show, and almost every episode builds on the quirks of either one of the main characters or one of the many background characters of Orange County. Jason Bateman (Michael) does a solid job, but the real stars are the other members of the family. Michael Cera (George Michael), David Cross (Tobias Fünke), and Jessica Walter (Lucille) are particularly memorable.I will never look at a seal, model homes, or Southern California itself without thinking about the wonderfully dysfunctional Bluths and the time that I spent watching them on \"Arrested Development.\"(I have seen this show several times over the years, but I have mostly recently watched in its entirety in June 2017)"
    },
    {
      "username": "mathisstl",
      "userUrl": "https://www.imdb.com/user/ur153345430",
      "reviewLink": "https://www.imdb.com/review/rw8192111",
      "warningSpoilers": false,
      "date": "31 May 2022",
      "rate": "10",
      "helpful": "25 out of 25 found this helpful.",
      "title": "Reboot isn't canon",
      "content": "Season 4-5 were not necessary and kinda ruined it. The show was ahead of it's time it its is perfect for streaming. Seasons 1 to 3 is the funniest show of all time."
    }
  ],
  "errorMessage": ""
}