{
  "imDbId": "tt0367279",
  "title": "Arrested Development",
  "fullTitle": "Arrested Development (TV Series 2003–2019)",
  "type": "TVSeries",
  "year": "2003",
  "language": "en",
  "titleInLanguage": "Arrested Development",
  "url": "https://en.wikipedia.org/wiki/Arrested_Development",
  "plotShort": {
    "plainText": "Arrested Development is an American television sitcom created by Mitchell Hurwitz. It aired on Fox for three seasons from November 2, 2003, to February 10, 2006, followed by two seasons on Netflix, season four being released in 2013 and season five being released in 2018 and 2019.\r\nArrested Development follows the Bluths, a formerly wealthy dysfunctional family. It is presented in a serialized format, incorporating handheld camera work, voice-over narration, archival photos, historical footage and maintains numerous running gags and catchphrases. Ron Howard served as both an executive producer and the omniscient narrator and, in later seasons, appears in the show as a fictionalized version of himself. Set in Newport Beach, California, Arrested Development was filmed primarily in Culver City and Marina del Rey.\r\nArrested Development received critical acclaim. It won six Primetime Emmy Awards and a Golden Globe Award, and attracted a cult following. It has been named one of the greatest TV shows of all time by publications including Rolling Stone, Time, Entertainment Weekly, and IGN. It influenced later single-camera comedy series such as 30 Rock and Community.\r\nDespite the positive response from critics, Arrested Development received low ratings and viewership on Fox, which canceled the series in 2006. In 2011, Netflix licensed new episodes and distributed them on its streaming service. These episodes were released in May 2013. Netflix commissioned a fifth season of Arrested Development, the first half of which premiered on May 29, 2018, and the second half on March 15, 2019. The show was due to be removed from Netflix in March 2023 but will remain on the service until 2026.",
    "html": "<p>Arrested Development is an American television sitcom created by Mitchell Hurwitz. It aired on Fox for three seasons from November 2, 2003, to February 10, 2006, followed by two seasons on Netflix, season four being released in 2013 and season five being released in 2018 and 2019.</p><p>Arrested Development follows the Bluths, a formerly wealthy dysfunctional family. It is presented in a serialized format, incorporating handheld camera work, voice-over narration, archival photos, historical footage and maintains numerous running gags and catchphrases. Ron Howard served as both an executive producer and the omniscient narrator and, in later seasons, appears in the show as a fictionalized version of himself. Set in Newport Beach, California, Arrested Development was filmed primarily in Culver City and Marina del Rey.</p><p>Arrested Development received critical acclaim. It won six Primetime Emmy Awards and a Golden Globe Award, and attracted a cult following. It has been named one of the greatest TV shows of all time by publications including Rolling Stone, Time, Entertainment Weekly, and IGN. It influenced later single-camera comedy series such as 30 Rock and Community.</p><p>Despite the positive response from critics, Arrested Development received low ratings and viewership on Fox, which canceled the series in 2006. In 2011, Netflix licensed new episodes and distributed them on its streaming service. These episodes were released in May 2013. Netflix commissioned a fifth season of Arrested Development, the first half of which premiered on May 29, 2018, and the second half on March 15, 2019. The show was due to be removed from Netflix in March 2023 but will remain on the service until 2026.</p>"
  },
  "plotFull": {
    "plainText": "Arrested Development is an American television sitcom created by Mitchell Hurwitz. It aired on Fox for three seasons from November 2, 2003, to February 10, 2006, followed by two seasons on Netflix, season four being released in 2013 and season five being released in 2018 and 2019.\r\nArrested Development follows the Bluths, a formerly wealthy dysfunctional family. It is presented in a serialized format, incorporating handheld camera work, voice-over narration, archival photos, historical footage and maintains numerous running gags and catchphrases. Ron Howard served as both an executive producer and the omniscient narrator and, in later seasons, appears in the show as a fictionalized version of himself. Set in Newport Beach, California, Arrested Development was filmed primarily in Culver City and Marina del Rey.\r\nArrested Development received critical acclaim. It won six Primetime Emmy Awards and a Golden Globe Award, and attracted a cult following. It has been named one of the greatest TV shows of all time by publications including Rolling Stone, Time, Entertainment Weekly, and IGN. It influenced later single-camera comedy series such as 30 Rock and Community.\r\nDespite the positive response from critics, Arrested Development received low ratings and viewership on Fox, which canceled the series in 2006. In 2011, Netflix licensed new episodes and distributed them on its streaming service. These episodes were released in May 2013. Netflix commissioned a fifth season of Arrested Development, the first half of which premiered on May 29, 2018, and the second half on March 15, 2019. The show was due to be removed from Netflix in March 2023 but will remain on the service until 2026.\r\nProduction\r\nConception\r\nDiscussion that led to the creation of the series began in the summer of 2002. Ron Howard had the original idea to create a comedy series in the style of handheld cameras and reality television, but with an elaborate, highly comical script resulting from repeated rewritings and rehearsals. Howard met with David Nevins, the president of Imagine Television, Katie O'Connell, a senior vice president, and two writers, including Mitchell Hurwitz. In light of recent corporate accounting scandals, such as Enron and Adelphia, Hurwitz suggested a story about a \"riches to rags\" family. Howard and Imagine were interested in using this idea, and signed Hurwitz to write the show. The idea was pitched and sold in Q3 2002. There was a bidding war for the show between Fox and NBC, with the show ultimately selling to Fox as a put pilot with a six-figure penalty.\r\nOver the next few months, Hurwitz developed the characters and plot for the series. The script of the pilot episode was submitted in January 2003 and filmed in March 2003. It was submitted in late April to Fox and was added to the network's fall schedule that May.\r\nCasting\r\nAlia Shawkat was the first cast in the series. Michael Cera, Tony Hale, and Jessica Walter were cast from video tapes and flown in to audition for Fox. Jason Bateman and Portia de Rossi both read and auditioned for the network and were immediately chosen. The character of Gob was the most challenging to cast. When Will Arnett auditioned, he played the character \"like a guy who thought of himself as the chosen son, even though it was obvious to everyone else that he was the least favorite\"; he was chosen immediately for his portrayal. The characters of Tobias and George Sr. were originally going to have minor roles, but David Cross and Jeffrey Tambor's portrayals mixed well with the rest of the characters, and they were given more significant parts. Howard provided the narration for the initial pilot, and his narrating meshed so well with the tone of the program that the decision was made to keep his voice. Howard aided in the casting of \"Lucille 2\"; the producers told him that their dream actress for the role was Liza Minnelli but that they assumed no one of her stature would take the part. She agreed when Ron Howard asked her himself, because they were old friends; she had been his babysitter when she was a teenager.\r\nProduction design\r\nArrested Development uses several elements which were rare at the time for American live-action sitcoms. It was shot on location and in HD video (at 24 frames per second) with multiple cameras, parodying tactics often employed in documentary film and reality television, straying from the \"fixed-set, studio audience, laugh track\" style long dominant in comedy production. The show makes heavy use of cutaway gags, supplementing the narrative with visual punchlines like security camera footage, Bluth family photos, website screenshots, archive films, and flashbacks. An omniscient third-person narrator (producer Ron Howard) ties together the multiple plot threads running through each episode, while humorously undercutting and commenting on the characters. Arrested Development developed self-referentiality through use of in-jokes that evolved over multiple episodes, which rewarded longtime viewership (and in turn may have discouraged new viewers and contributed to the show's ratings difficulties).\r\nCancelation and revival\r\nDuring the series' third season in 2006, despite months-long rumors of Arrested Development having been picked up by the cable television network Showtime, creator Hurwitz declined to move the show to another network. Hurwitz said, \"I had taken it as far as I felt I could as a series. I told the story I wanted to tell, and we were getting to a point where I think a lot of the actors were ready to move on.\" He said that he was \"more worried about letting down the fans in terms of the quality of the show dropping\" than he was about disappointing fans by not giving them more episodes. He also said, \"If there's a way to continue this in a form that's not weekly episodic series television, I'd be up for it\".\r\nAfter the series cancellation, Fox Entertainment Group sold the initial 53-episode run for syndication. In a first for its kind, the syndication involved a three-year deal with Microsoft's nascent internet video streaming service MSN Video (now Bing Video) before the series would go on to cable channel G4.\r\nOn October 2, 2011, the cast of Arrested Development reunited for a panel at The New Yorker Festival in New York. At the panel, Hurwitz declared his intention of producing a truncated fourth season as a lead-in to a film adaptation.\r\nSix years after the series had been canceled by Fox, filming for a fourth season began on August 7, 2012. Fifteen episodes of the show's revival season were released simultaneously on Netflix on May 26, 2013. The first eight episodes of the fifth season were released on Netflix on May 29, 2018, and the remaining eight episodes premiered on March 15, 2019.\r\nCharacters\r\nMain characters\r\nThe plot of Arrested Development revolves around the members of the Bluth family, a formerly wealthy family who continue to lead extravagant lifestyles despite their changed circumstances. At the center of the show is Michael Bluth (Jason Bateman), the show's straight man, who strives to do the right thing and keep his family together, despite their materialism, selfishness, and manipulative natures. Michael is a widowed single father. His teenage son, George Michael (Michael Cera), has the same qualities of decency but feels a constant pressure to live up to his father's expectations and is often reluctant to follow his father's plans. He battles with a crush he has on cousin Maeby, which developed from a kiss she gave him as part of a prank.\r\nMichael's father, George Bluth Sr. (Jeffrey Tambor), is the patriarch of the family and a corrupt real estate developer who is arrested in the first episode. George goes to considerable lengths to manipulate and control his family in spite of his imprisonment, and makes numerous efforts to evade justice. His wife, and Michael's mother, Lucille (Jessica Walter), is ruthlessly manipulative, materialistic, and hypercritical of every member of her family, and constantly drinks alcohol. Her grip is tightest on her youngest son, Byron \"Buster\" Bluth (Tony Hale), an overeducated (yet still undereducated) mother's boy who has dependency issues and is prone to panic attacks.\r\nMichael's older brother is George Oscar Bluth II (Will Arnett), known by the acronym \"Gob\" (/dʒoʊb/). An unsuccessful professional magician whose business and personal schemes usually fail or become tiresome and are quickly abandoned, Gob is competitive with Michael over women and bullies Buster. Michael's twin sister Lindsay (Portia de Rossi) is spoiled and materialistic, continually seeking the center of attention and leaping on various social causes for the sake of vanity. She is married to Tobias Fünke (David Cross), a discredited psychiatrist-turned-aspiring actor. Tobias is a self-diagnosed \"never-nude\" (a disorder comparable to gymnophobia), whose language and behavior have heavily homosexual overtones to which he seems oblivious and which are the center of much tongue-in-cheek comedy throughout the series. Their daughter is Mae \"Maeby\" Fünke (Alia Shawkat), a rebellious teen with an opportunistic streak, who seeks to defy her parents for the sake of attention, and otherwise pursues boys and power, and furthers her complicated relationship with George Michael.\r\nRecurring cast\r\nSeveral other characters regularly appear in recurring roles.\r\nJeffrey Tambor as Oscar Bluth, George Sr.'s identical twin brother, a lethargic ex-hippie seeking the affection of Lucille.\r\nHenry Winkler as Barry Zuckerkorn, the family's lawyer, an incompetent sexual deviant who often hinders the family's legal battles rather than helping them. He is eventually replaced by Bob Loblaw (Scott Baio). (Max Winkler portrays Barry in flashbacks)\r\nLiza Minnelli as Lucille Austero, AKA \"Lucille 2\", Lucille's \"best friend and chief social rival\" as well as a sometimes-love-interest of Buster and later, Gob.\r\nJustin Grant Wade as Steve Holt, a high school super-senior and football star at the high school George Michael and Maeby attend, and is later discovered to be Gob's son.\r\nCarl Weathers as Carl Weathers, a parodied version of himself as Tobias' acting coach.\r\nJohn Beard as John Beard, a fictional version of himself as a news anchor reporting on the characters' antics.\r\nMae Whitman as Ann Veal, George-Michael's stern Christian girlfriend, often forgotten or disparaged by Michael (Ann was first played by Alessandra Torresani.)\r\nPatricia Velasquez as Marta Estrella, Gob's girlfriend who eventually reciprocates Michael's infatuation with her and ends up causing conflict between the two brothers. (Leonor Varela originally played Marta)\r\nSteve Ryan as J. Walter Weatherman, a one-armed amputee, and a former employee of George Sr.; Weatherman appears in flashbacks in several episodes where, as hired by George Sr., he would teach the Bluth children lessons by participating in staged accidents where he would \"lose\" his (prosthetic) arm.\r\nCharlize Theron as Rita Leeds, an intellectually disabled British woman who becomes Michael's female companion.\r\nJudy Greer as Kitty Sanchez, George Bluth Senior's assistant, lover and partner-in-crime.\r\nEd Begley, Jr. as Stan Sitwell, the owner of Sitwell Enterprises, a rival company to the Bluth Company.\r\nChristine Taylor as Sally Sitwell, Stan Sitwell's daughter and a consistent love interest for Michael.\r\nJustin Lee as Annyeong, the adopted Korean son of Lucille and George Sr.\r\nJulia Louis-Dreyfus as Maggie Lizer, an attorney and compulsive liar who has a recurring relationship with Michael.\r\nRob Corddry as Moses Taylor, the star of the fictional TV show Wrench! and a noted gun rights activist.\r\nBen Stiller as Tony Wonder, a magician and Gob's chief rival, well known for baking himself into a loaf of bread to feed the troops.\r\nAmy Poehler as Gob's unnamed and frequently forgotten wife, who married Gob as the final in a long line of escalating dares.\r\nJane Lynch as Cindi Lightballoon, a government mole who tries to gather incriminating information from an incarcerated George Sr. but ends up falling in love with him instead.\r\nEpisodes\r\nSeason 1 (2003–04)\r\nGeorge Bluth Sr., patriarch of the wealthy Bluth family, is the founder and former CEO of the successful Bluth Company which markets and builds mini-mansions among many other activities. His son Michael serves as manager of the company, and, after being passed over for a promotion, decides to leave both the company and his family. Just as he makes this decision, however, George Sr. is arrested by the Securities and Exchange Commission for defrauding investors and gross spending of the company's money for \"personal expenses\". His wife Lucille becomes CEO, and immediately names as the new president her extremely sheltered youngest son Buster, who proves ill-equipped, as his only experience with business is a class he took concerning 18th century agrarian business. Furious at being passed over again, Michael secures another job with a rival company and plans on leaving his family behind for good. Realizing that they need Michael, the family asks him to come back and run the company, which Michael scoffs at until he sees how much the family means to his teenaged son George Michael. To keep the family together, Michael asks his self-centered twin sister Lindsay, her husband Tobias and their daughter Maeby to live together in the Bluth model home with him and George Michael.\r\nThroughout the first season, different characters struggle to change their identities. Buster works to escape from his mother's control by bonding with brothers Michael and Gob as well as with love interest Lucille Austero, Lucille Bluth's neighbor and chief social rival. George Michael nurses a forbidden crush on his cousin Maeby, while continually trying to meet his father's expectations. Lindsay's husband Tobias searches for work as an actor, with the aid of Carl Weathers. Michael falls in love with his screw-up older brother Gob's neglected girlfriend Marta, and is torn between being with her and putting \"family first\". After seeing Michael physically fight with Gob, Marta realizes that they do not share the same family values and she leaves them both. To spite Buster, Lucille adopts a Korean son whom she calls \"Annyong\" after she mistakes the Korean word for \"hello\" as his name. Through an escalating series of dares, Gob marries a woman he just met, played by Will Arnett's then real-life wife Amy Poehler, but cannot get an annulment because he refuses to admit that he did not consummate the marriage. Kitty, George Sr.'s former assistant and mistress, tries to blackmail the company. She is caught in the Bluth family yacht's explosion, as used in one of Gob's magic acts, but survives with a cooler full of damning evidence labeled \"H Maddas\". After previous failed attempts, and a brief religious stint in Judaism, George Sr. finally escapes from prison by faking a heart attack. It is also revealed that George Sr. committed \"light treason\" by using the company to build mini-palaces for Saddam Hussein in Iraq.\r\nSeason 2 (2004–05)\r\nBecause of his father's latest prison break deception (a faked heart attack), Michael decides to leave his family and move to Phoenix, Arizona with George Michael, but discovers that he cannot leave the state due to the Bluth Company being under investigation and him having to go to jail as a replacement for his father. Lucille appoints Gob the new Bluth Company president, but since Gob proves utterly incompetent, the position's real duties revert to Michael. During the rest of the season Gob serves as figurehead president; Michael is still under scrutiny for George Sr.'s illegal activity.\r\nGeorge Sr. is not, in fact, gone. After faking his death in Mexico by paying off the cops, George Sr. returns to the family model home, where George Michael discovers him hiding in the attic. To protect his son from legal implications, Michael hides George Sr. in Gob's prop Aztec Tomb, orchestrates a diversion, and tells the family that George Sr. has escaped once more. Throughout the rest of the season, Michael sneaks George Sr. provisions, and George Sr. keeps tabs on the Bluth family through the ventilation system. George Sr. also faces an onslaught from the outside world; the press begins looking for him in Iraq, fumigators surround the house while he's still in the attic, and Kitty returns to steal a sample of his semen to make her own Bluth baby.\r\nBuster meanwhile joins the army, but escapes serving in Iraq when his hand is bitten off by a loose seal (a play on \"Lucille\") Gob had mistakenly trained to develop a taste for mammal flesh. Buster is refitted with a sharp hook, which he copes with poorly and often brandishes dangerously in social situations. During Buster's long psychological recovery, he bonds with George Sr.'s stoner twin brother Oscar, who moves in with Lucille in an attempt to rekindle a past love affair. Uncle Oscar slowly reveals himself as Buster's presumptive biological father. Eventually, George Sr. takes revenge on the adulterous Oscar and Lucille by kidnapping Oscar, knocking him unconscious, exchanging appearances with him, and sending him to prison in his place.\r\nLindsay and Tobias continue their disastrous open relationship. Lindsay tries—but fails—to secure a lover, while Tobias paints himself blue each night in a futile attempt to join the Blue Man Group. When Lindsay kicks him out of the house, Tobias disguises himself as a singing British nanny named \"Mrs. Featherbottom\" (an idea he gets from the film Mrs. Doubtfire) so he can watch over his daughter Maeby. The family sees right through this incompetent disguise, but they humor Tobias since—in the guise of Mrs. Featherbottom—he does their chores.\r\nGeorge Michael begins dating a deeply religious girl, Ann Veal, who encourages him to smash pop music CDs and to run for student body president against perennial favorite Steve Holt. Michael dislikes her and tries to disrupt the kids' relationship, most notably by breaking up Ann and George Michael's pre-engagement. Meanwhile, Maeby cons her way into an after school job as a film studio executive. When Maeby's studio remakes \"Les Cousins Dangereux\", George Michael abandons Ann to pursue his crush on Maeby. Maeby herself realises she has feelings for George Michael in light of his relationship, and the two kiss while the living room of the model home collapses.\r\nSeason 3 (2005–06)\r\nMichael again searches for his runaway father, George Sr. Gob receives an invitation to a father/son reunion outing, and believes it to be George Sr. trying to contact him. In reality, the invitation was meant to reunite Gob with Steve Holt, son of Eve Holt, a girl Gob slept with in high school. Meanwhile, George Michael and Maeby deal with their previous kiss by avoiding each other.\r\nIn an attempt to remain in disguise, George Sr. joins the Blue Man Group. Michael discovers this and arranges to have his father placed under house arrest. George Sr. claims that he was set up by an underground British group. Michael goes to Wee Britain, a fictional British-themed city district, to investigate, and in the process meets a new love interest, Rita Leeds (Charlize Theron). Michael and the audience are led to believe that Rita is a mole for the underground British group, working for a man named \"Mr. F\". However, love-struck Michael proposes to her, and the couple run off to wed. Finally, it is revealed that Rita is actually an \"MRF\", or \"mentally retarded female\". Despite Rita's \"condition\", the family pushes him to go forward with the marriage because Rita is wealthy and they want her money. Michael is not persuaded and gently ends the relationship just as he and Rita are about to walk down the aisle. Meanwhile, Tobias and Lindsay seek legal help from Bob Loblaw (Scott Baio) concerning their troubled marriage.\r\nWith the family's retainer used up because of Lindsay's and Tobias's advances, Bob Loblaw chooses to no longer represent the Bluth family. Attorney Jan Eagleman offers to represent the family, on the condition that they participate in a mock trial in a new reality courtroom show called \"Mock Trial with J. Reinhold\". Musical accompaniment for the show's theme song and perceived jokes from testifying witnesses is provided by \"William Hung And His Hung Jury\". Michael uses an illegal threat from prosecutor Wayne Jarvis to have the mock case \"dismissed\". Gob and Franklin briefly appear in another courtroom show presided over by Bud Cort. Meanwhile, Maeby and George Michael perform a mock wedding for Alzheimer's patients that is accidentally conducted by a real priest; the two become legally married.\r\nThe family members are afraid to testify at the mock trial and at the real deposition; Buster fakes a coma, Lindsay and Lucille fake entering rehab, and Gob flees the country to perform in a USO Tour in Iraq. The deceptions are all uncovered by the prosecution, and in Iraq Gob is arrested for inadvertently inciting an anti-US riot. Buster and Michael travel to Iraq to rescue Gob, and while there, uncover evidence that the mini-palaces George Sr. built in Iraq were actually ordered and paid for by the CIA for wiretapping purposes. After this discovery, the US government drops all of the charges against George Sr. In the general confusion, everyone except George Michael forgets Maeby's sixteenth birthday.\r\nTo celebrate their victory in Iraq, the Bluths throw a shareholders' party on the RMS Queen Mary. During preparation for the party, it is revealed that Lindsay was adopted, meaning that George Michael and Maeby are not blood relatives. At the party, the Bluth's other adopted child, Annyong, reappears. He reveals that he is there to avenge the Bluth family's theft of his grandfather's frozen banana idea and the cause of his subsequent deportation, an event orchestrated many years earlier by Lucille Bluth. Annyong has turned over evidence implicating Lucille in the Bluth Company's accounting scandals. Before the police arrive, Michael and George Michael flee on Gob's yacht, The C-Word, and depart to Cabo with half a million dollars in cashier's checks, finally leaving the family to fend for themselves. However, it is revealed in the epilogue that George Sr. is also on the yacht, having lured his brother Oscar into taking his place once again. Also in the epilogue, Maeby tries to sell the television rights to the story of the Bluth family to Ron Howard, who tells her that he sees it as a movie rather than a series.\r\nSeason 4 (2013)\r\nFilming for a fourth season to be released on Netflix began on August 7, 2012, more than six years after the series had been canceled by Fox. The season consists of 15 new episodes, all debuting at the same time on Netflix on May 26, 2013, in the United States, Canada, the United Kingdom, Ireland, Latin America, and the Nordic countries. Several actors who had recurring roles in the original series returned to reprise their roles, including Carl Weathers as himself, Henry Winkler as Barry Zuckerkorn, Ben Stiller as Tony Wonder, Mae Whitman as Ann Veal, Scott Baio as Bob Loblaw, Judy Greer as Kitty Sanchez, and Liza Minnelli as Lucille Austero; while new characters are played by Debra Mooney, John Slattery, Tommy Tune, Terry Crews, Isla Fisher and John Krasinski. Kristen Wiig and Seth Rogen appear as Lucille and George Sr., respectively, in flashbacks.\r\nAll episodes of the season occur over approximately the same stretch of time, but each focuses on a different character. Information on events depicted in a given episode is often partial and filled in during a later episode.\r\nCreator Mitch Hurwitz created a recut of season four called Arrested Development Season 4 Remix: Fateful Consequences, in which the season's story is presented in chronological order. The recut consists of 22 episodes and was released May 3, 2018, on Netflix.\r\nSeason 5 (2018–19)\r\nNetflix confirmed on May 17, 2017, that a fifth season featuring the full cast had been ordered. The fifth season includes 16 episodes; the first eight were released on May 29, 2018, and the remaining eight episodes premiered on March 15, 2019.\r\nReception\r\nTelevision ratings\r\nThe show, while critically acclaimed, did not gain a sizable audience. According to the Nielsen ratings system, the show's first season was the 120th most popular show among households and the 88th among viewers aged 18 to 49, averaging 6.2 million viewers.\r\nU.S. ratings in the second season averaged about six million viewers, while the third season averaged about four million viewers. Fox announced that it would halt the production of the second season at eighteen episodes—four episodes short of the planned season.\r\nFor the third season, Fox positioned the show on Mondays at 8:00 p.m. ET. Ratings dropped further than previous seasons. On November 9, 2005, Fox announced that the show would not be airing in November sweeps, and that they had cut the episode order for the third season from 22 to 13. Fox ended up showing the last four episodes in a two-hour timeslot—directly opposite the opening ceremonies of the 2006 Winter Olympics. The series finale episode received 3.43 million viewers.\r\nCritical response\r\nThroughout its original run, Arrested Development received critical acclaim. It is widely regarded as one of the defining shows of the 2000s and has been praised by many critics as one of the greatest comedies of all time. In 2007, the show was listed as one of Time magazine's \"100 Best TV Shows of All-Time\".\r\nTim Stack of Entertainment Weekly praised the series, saying \"Is it beating a dead horse to once again state that this underappreciated gem is the best sitcom on TV? Too bad. Arrested Development is the best sitcom on TV!\"\r\nDavid Bianculli from the New York Daily News stated \"If you're not watching this series on Fox, the least you can do is buy it on DVD. You'll love it, and it's such a dense show (in the best sense of the word) that it rewards repeated viewing. Like Scrubs and the British version of The Office, it is the sort of show that truly deserves to be seen uninterrupted, several episodes at a time, for maximum enjoyment. The laughs-per-minute quotient here is insanely high, making it great value as a home library purchase.\"\r\nAlison Powell of The Guardian said \"As Hollywood agents worry about the demise of the town's lowing cash cow, the multi-camera, staged sitcom, here to save the day is Arrested Development, a farce of such blazing wit and originality, that it must surely usher in a new era in comedy.\"\r\nGillian Flynn of Entertainment Weekly named Arrested Development the best television show of 2005 and said in her review that \"As oddball as Arrested is, it's also humane. A flawless cast—from Will Arnett's breathy, bombastic Gob to Jessica Walter's boozy Lucille—grounds it, aided by Ron Howard's affable narration. The center of sensibility is good son Michael (Jason Bateman) and his even better son, George Michael (Michael Cera). Bateman and Cera give the best reacts around—the former all weary exasperation, the latter adorably bunny-stunned. Together, they're the sweetest, awkwardest straight men on the smartest, most shockingly funny series on TV ... which is likely canceled, despite six Emmy wins. It's a perversion not even the Bluths deserve.\" In 2012, Entertainment Weekly listed the show at No. 2 in the \"25 Best Cult TV Shows from the Past 25 Years\", praising its \"fast, delirious, interlocking jokes that don't pander to the masses; winky gags (e.g. fake preview scenes for the following week's episode); and a cast of absurd characters\". In 2013, the Writers Guild of America ranked it No. 16 on their list of the 101 Best Written TV Series.\r\nAccolades\r\nIn 2004, the first season received seven Emmy Award nominations with five wins. It won for Outstanding Comedy Series, Outstanding Directing for a Comedy Series, Outstanding Casting for a Comedy Series, Outstanding Single-Camera Picture Editing for a Comedy Series and Outstanding Writing for a Comedy Series, for the pilot episode written by Mitchell Hurwitz and directed by brothers Anthony and Joe Russo. Jeffrey Tambor was nominated that year for Outstanding Supporting Actor in a Comedy Series.\r\nIn 2005, the second season received eleven Emmy nominations in seven categories with one win. Notable nominations included Outstanding Comedy Series, Outstanding Lead Actor in a Comedy Series (Jason Bateman), Outstanding Supporting Actor in a Comedy Series (Jeffrey Tambor), Outstanding Supporting Actress in a Comedy Series (Jessica Walter) as well as three nominations for Outstanding Writing for a Comedy Series, in which it won for \"Righteous Brothers\", written by Mitchell Hurwitz and Jim Vallely.\r\nIn 2006, the third season received four Emmy nominations, for Outstanding Comedy Series, Outstanding Supporting Actor in a Comedy Series (Will Arnett), Outstanding Single-Camera Picture Editing for a Comedy Series and Outstanding Writing for a Comedy Series for the series finale \"Development Arrested\".\r\nIn 2013, the fourth season received three Emmy nominations, for Outstanding Actor in a Comedy Series (Jason Bateman), Outstanding Music Composition for a Series (Original Dramatic Score) and Outstanding Single-camera Picture Editing for a Comedy Series.\r\nOther awards include:\r\nThe 2004 TV Land Award for \"Future Classic\", the first recognition the series received. The award presentation is included on the season one DVD release.\r\nThe 2004 Television Critics Association Awards for Outstanding Comedy and Outstanding New Program, and the 2005 award for Outstanding Achievement in Comedy.\r\nThe 2005 Golden Globe Award for Best Performance by an Actor in a Television Series – Musical or Comedy for Jason Bateman.\r\nThe 2004 Writers Guild of America Award for Episodic Comedy, for the episode \"Pier Pressure\", written by Mitchell Hurwitz and Jim Vallely.\r\nThe 2004 Satellite Award for Best Television Series – Comedy or Musical, along with Jeffrey Tambor and Jessica Walter for Best Performance by an Actor and Actress in a Supporting Role in a Series – Comedy or Musical. In 2005, Jason Bateman and Portia de Rossi won for Best Actor and Actress in a Series – Comedy or Musical. Jason Bateman also won the same award the following ceremony.\r\nThe 2005 Young Artist Award for Best Performance in a TV Series (Comedy or Drama) – Supporting Young Actress for Alia Shawkat.\r\nControversies\r\nLawsuit\r\nIn November 2003, the producers of the show were sued by the hip hop group Arrested Development over the alleged use of their name. Rapper Speech from the group said \"The use of our name by Fox is not only confusing to the public, but also has the potential to significantly dilute what the 'Arrested Development' name means to our fans\". The lawsuit was settled for an undisclosed sum. This incident was alluded to in the episode \"Motherboy XXX\". The narrator claims the show is \"legally required to make a distinction\" between the \"Motherboy\" event happening in the episode and a band called \"Motherboy\".\r\nTambor's misconduct\r\nIn an interview with The Hollywood Reporter in May 2018, Tambor apologized for actions that led to sexual misconduct accusations against him by co-workers on the TV show Transparent, and mentioned one \"blowup\" he had with co-star Jessica Walter during production of Arrested Development. Walter was asked about the incident during a cast interview with The New York Times. She became emotional, stating that \"in almost 60 years of working, I've never had anybody yell at me like that on a set and it's hard to deal with, but I'm over it now ... never crossed the line on our show, with any, you know, sexual whatever. Verbally, yes, he harassed me, but he did apologize. I have to let it go.\"\r\nBateman stated that \"in the entertainment industry it is incredibly common to have people who are, in quotes, 'difficult' ... is a weird thing, and it is a breeding ground for atypical behavior and certain people have certain processes.\" Hale said that \"we all have bad moments\", while Cross suggested that Tambor's outbursts were a \"cumulative effect\". The Daily Beast criticized Cross's comment as suggesting that Walter had \"asked for it\". Shawkat came to Walter's defense, saying that being difficult \"doesn't mean it's acceptable\" to treat someone badly. After outlets criticized the men's statements, Hale, Bateman, and Cross issued apologies to Walter. Netflix cancelled the show's UK press tour. Cera, who was not part of the group interview, stated that \"obviously I have to give a lot of consideration to whether I take jobs with anyone and think about how it affects people\".",
    "html": "<p>Arrested Development is an American television sitcom created by Mitchell Hurwitz. It aired on Fox for three seasons from November 2, 2003, to February 10, 2006, followed by two seasons on Netflix, season four being released in 2013 and season five being released in 2018 and 2019.</p><p>Arrested Development follows the Bluths, a formerly wealthy dysfunctional family. It is presented in a serialized format, incorporating handheld camera work, voice-over narration, archival photos, historical footage and maintains numerous running gags and catchphrases. Ron Howard served as both an executive producer and the omniscient narrator and, in later seasons, appears in the show as a fictionalized version of himself. Set in Newport Beach, California, Arrested Development was filmed primarily in Culver City and Marina del Rey.</p><p>Arrested Development received critical acclaim. It won six Primetime Emmy Awards and a Golden Globe Award, and attracted a cult following. It has been named one of the greatest TV shows of all time by publications including Rolling Stone, Time, Entertainment Weekly, and IGN. It influenced later single-camera comedy series such as 30 Rock and Community.</p><p>Despite the positive response from critics, Arrested Development received low ratings and viewership on Fox, which canceled the series in 2006. In 2011, Netflix licensed new episodes and distributed them on its streaming service. These episodes were released in May 2013. Netflix commissioned a fifth season of Arrested Development, the first half of which premiered on May 29, 2018, and the second half on March 15, 2019. The show was due to be removed from Netflix in March 2023 but will remain on the service until 2026.</p><br/><h3>Production</h3><h4>Conception</h4><p>Discussion that led to the creation of the series began in the summer of 2002. Ron Howard had the original idea to create a comedy series in the style of handheld cameras and reality television, but with an elaborate, highly comical script resulting from repeated rewritings and rehearsals. Howard met with David Nevins, the president of Imagine Television, Katie O'Connell, a senior vice president, and two writers, including Mitchell Hurwitz. In light of recent corporate accounting scandals, such as Enron and Adelphia, Hurwitz suggested a story about a \"riches to rags\" family. Howard and Imagine were interested in using this idea, and signed Hurwitz to write the show. The idea was pitched and sold in Q3 2002. There was a bidding war for the show between Fox and NBC, with the show ultimately selling to Fox as a put pilot with a six-figure penalty.</p><p>Over the next few months, Hurwitz developed the characters and plot for the series. The script of the pilot episode was submitted in January 2003 and filmed in March 2003. It was submitted in late April to Fox and was added to the network's fall schedule that May.</p><h4>Casting</h4><p>Alia Shawkat was the first cast in the series. Michael Cera, Tony Hale, and Jessica Walter were cast from video tapes and flown in to audition for Fox. Jason Bateman and Portia de Rossi both read and auditioned for the network and were immediately chosen. The character of Gob was the most challenging to cast. When Will Arnett auditioned, he played the character \"like a guy who thought of himself as the chosen son, even though it was obvious to everyone else that he was the least favorite\"; he was chosen immediately for his portrayal. The characters of Tobias and George Sr. were originally going to have minor roles, but David Cross and Jeffrey Tambor's portrayals mixed well with the rest of the characters, and they were given more significant parts. Howard provided the narration for the initial pilot, and his narrating meshed so well with the tone of the program that the decision was made to keep his voice. Howard aided in the casting of \"Lucille 2\"; the producers told him that their dream actress for the role was Liza Minnelli but that they assumed no one of her stature would take the part. She agreed when Ron Howard asked her himself, because they were old friends; she had been his babysitter when she was a teenager.</p><h4>Production design</h4><p>Arrested Development uses several elements which were rare at the time for American live-action sitcoms. It was shot on location and in HD video (at 24 frames per second) with multiple cameras, parodying tactics often employed in documentary film and reality television, straying from the \"fixed-set, studio audience, laugh track\" style long dominant in comedy production. The show makes heavy use of cutaway gags, supplementing the narrative with visual punchlines like security camera footage, Bluth family photos, website screenshots, archive films, and flashbacks. An omniscient third-person narrator (producer Ron Howard) ties together the multiple plot threads running through each episode, while humorously undercutting and commenting on the characters. Arrested Development developed self-referentiality through use of in-jokes that evolved over multiple episodes, which rewarded longtime viewership (and in turn may have discouraged new viewers and contributed to the show's ratings difficulties).</p><h4>Cancelation and revival</h4><p>During the series' third season in 2006, despite months-long rumors of Arrested Development having been picked up by the cable television network Showtime, creator Hurwitz declined to move the show to another network. Hurwitz said, \"I had taken it as far as I felt I could as a series. I told the story I wanted to tell, and we were getting to a point where I think a lot of the actors were ready to move on.\" He said that he was \"more worried about letting down the fans in terms of the quality of the show dropping\" than he was about disappointing fans by not giving them more episodes. He also said, \"If there's a way to continue this in a form that's not weekly episodic series television, I'd be up for it\".</p><p>After the series cancellation, Fox Entertainment Group sold the initial 53-episode run for syndication. In a first for its kind, the syndication involved a three-year deal with Microsoft's nascent internet video streaming service MSN Video (now Bing Video) before the series would go on to cable channel G4.</p><p>On October 2, 2011, the cast of Arrested Development reunited for a panel at The New Yorker Festival in New York. At the panel, Hurwitz declared his intention of producing a truncated fourth season as a lead-in to a film adaptation.</p><p>Six years after the series had been canceled by Fox, filming for a fourth season began on August 7, 2012. Fifteen episodes of the show's revival season were released simultaneously on Netflix on May 26, 2013. The first eight episodes of the fifth season were released on Netflix on May 29, 2018, and the remaining eight episodes premiered on March 15, 2019.</p><br/><h3>Characters</h3><h4>Main characters</h4><p>The plot of Arrested Development revolves around the members of the Bluth family, a formerly wealthy family who continue to lead extravagant lifestyles despite their changed circumstances. At the center of the show is Michael Bluth (Jason Bateman), the show's straight man, who strives to do the right thing and keep his family together, despite their materialism, selfishness, and manipulative natures. Michael is a widowed single father. His teenage son, George Michael (Michael Cera), has the same qualities of decency but feels a constant pressure to live up to his father's expectations and is often reluctant to follow his father's plans. He battles with a crush he has on cousin Maeby, which developed from a kiss she gave him as part of a prank.</p><p>Michael's father, George Bluth Sr. (Jeffrey Tambor), is the patriarch of the family and a corrupt real estate developer who is arrested in the first episode. George goes to considerable lengths to manipulate and control his family in spite of his imprisonment, and makes numerous efforts to evade justice. His wife, and Michael's mother, Lucille (Jessica Walter), is ruthlessly manipulative, materialistic, and hypercritical of every member of her family, and constantly drinks alcohol. Her grip is tightest on her youngest son, Byron \"Buster\" Bluth (Tony Hale), an overeducated (yet still undereducated) mother's boy who has dependency issues and is prone to panic attacks.</p><p>Michael's older brother is George Oscar Bluth II (Will Arnett), known by the acronym \"Gob\" (/dʒoʊb/). An unsuccessful professional magician whose business and personal schemes usually fail or become tiresome and are quickly abandoned, Gob is competitive with Michael over women and bullies Buster. Michael's twin sister Lindsay (Portia de Rossi) is spoiled and materialistic, continually seeking the center of attention and leaping on various social causes for the sake of vanity. She is married to Tobias Fünke (David Cross), a discredited psychiatrist-turned-aspiring actor. Tobias is a self-diagnosed \"never-nude\" (a disorder comparable to gymnophobia), whose language and behavior have heavily homosexual overtones to which he seems oblivious and which are the center of much tongue-in-cheek comedy throughout the series. Their daughter is Mae \"Maeby\" Fünke (Alia Shawkat), a rebellious teen with an opportunistic streak, who seeks to defy her parents for the sake of attention, and otherwise pursues boys and power, and furthers her complicated relationship with George Michael.</p><h4>Recurring cast</h4><p>Several other characters regularly appear in recurring roles.</p><ul><li>Jeffrey Tambor as Oscar Bluth, George Sr.'s identical twin brother, a lethargic ex-hippie seeking the affection of Lucille.</li><li>Henry Winkler as Barry Zuckerkorn, the family's lawyer, an incompetent sexual deviant who often hinders the family's legal battles rather than helping them. He is eventually replaced by Bob Loblaw (Scott Baio). (Max Winkler portrays Barry in flashbacks)</li><li>Liza Minnelli as Lucille Austero, AKA \"Lucille 2\", Lucille's \"best friend and chief social rival\" as well as a sometimes-love-interest of Buster and later, Gob.</li><li>Justin Grant Wade as Steve Holt, a high school super-senior and football star at the high school George Michael and Maeby attend, and is later discovered to be Gob's son.</li><li>Carl Weathers as Carl Weathers, a parodied version of himself as Tobias' acting coach.</li><li>John Beard as John Beard, a fictional version of himself as a news anchor reporting on the characters' antics.</li><li>Mae Whitman as Ann Veal, George-Michael's stern Christian girlfriend, often forgotten or disparaged by Michael (Ann was first played by Alessandra Torresani.)</li><li>Patricia Velasquez as Marta Estrella, Gob's girlfriend who eventually reciprocates Michael's infatuation with her and ends up causing conflict between the two brothers. (Leonor Varela originally played Marta)</li><li>Steve Ryan as J. Walter Weatherman, a one-armed amputee, and a former employee of George Sr.; Weatherman appears in flashbacks in several episodes where, as hired by George Sr., he would teach the Bluth children lessons by participating in staged accidents where he would \"lose\" his (prosthetic) arm.</li><li>Charlize Theron as Rita Leeds, an intellectually disabled British woman who becomes Michael's female companion.</li><li>Judy Greer as Kitty Sanchez, George Bluth Senior's assistant, lover and partner-in-crime.</li><li>Ed Begley, Jr. as Stan Sitwell, the owner of Sitwell Enterprises, a rival company to the Bluth Company.</li><li>Christine Taylor as Sally Sitwell, Stan Sitwell's daughter and a consistent love interest for Michael.</li><li>Justin Lee as Annyeong, the adopted Korean son of Lucille and George Sr.</li><li>Julia Louis-Dreyfus as Maggie Lizer, an attorney and compulsive liar who has a recurring relationship with Michael.</li><li>Rob Corddry as Moses Taylor, the star of the fictional TV show Wrench! and a noted gun rights activist.</li><li>Ben Stiller as Tony Wonder, a magician and Gob's chief rival, well known for baking himself into a loaf of bread to feed the troops.</li><li>Amy Poehler as Gob's unnamed and frequently forgotten wife, who married Gob as the final in a long line of escalating dares.</li><li>Jane Lynch as Cindi Lightballoon, a government mole who tries to gather incriminating information from an incarcerated George Sr. but ends up falling in love with him instead.</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"3\">Originally released</th></tr><tr><th scope=\"col\">First released</th><th scope=\"col\">Last released</th><th scope=\"col\" style=\"padding:0 8px\">Network</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">22</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">November 2, 2003</td><td style=\"padding:0 8px\">June 6, 2004</td><td rowspan=\"3\"><span>Fox</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">18</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">November 7, 2004</td><td style=\"padding:0 8px\">April 17, 2005</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 19, 2005</td><td style=\"padding:0 8px\">February 10, 2006</td></tr><tr style=\"height:100%\"><th scope=\"row\" rowspan=\"2\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"1\" rowspan=\"2\">37</td><td colspan=\"1\">15</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">May 26, 2013</td><td rowspan=\"4\"><span>Netflix</span></td></tr><tr style=\"height:100%\"><td colspan=\"1\">22</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">May 4, 2018</td></tr><tr style=\"height:100%\"><th scope=\"row\" rowspan=\"2\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"1\" rowspan=\"2\">16</td><td colspan=\"1\">8</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">May 29, 2018</td></tr><tr style=\"height:100%\"><td colspan=\"1\">8</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">March 15, 2019</td></tr></tbody></table><h4>Season 1 (2003–04)</h4><p>George Bluth Sr., patriarch of the wealthy Bluth family, is the founder and former CEO of the successful Bluth Company which markets and builds mini-mansions among many other activities. His son Michael serves as manager of the company, and, after being passed over for a promotion, decides to leave both the company and his family. Just as he makes this decision, however, George Sr. is arrested by the Securities and Exchange Commission for defrauding investors and gross spending of the company's money for \"personal expenses\". His wife Lucille becomes CEO, and immediately names as the new president her extremely sheltered youngest son Buster, who proves ill-equipped, as his only experience with business is a class he took concerning 18th century agrarian business. Furious at being passed over again, Michael secures another job with a rival company and plans on leaving his family behind for good. Realizing that they need Michael, the family asks him to come back and run the company, which Michael scoffs at until he sees how much the family means to his teenaged son George Michael. To keep the family together, Michael asks his self-centered twin sister Lindsay, her husband Tobias and their daughter Maeby to live together in the Bluth model home with him and George Michael.</p><p>Throughout the first season, different characters struggle to change their identities. Buster works to escape from his mother's control by bonding with brothers Michael and Gob as well as with love interest Lucille Austero, Lucille Bluth's neighbor and chief social rival. George Michael nurses a forbidden crush on his cousin Maeby, while continually trying to meet his father's expectations. Lindsay's husband Tobias searches for work as an actor, with the aid of Carl Weathers. Michael falls in love with his screw-up older brother Gob's neglected girlfriend Marta, and is torn between being with her and putting \"family first\". After seeing Michael physically fight with Gob, Marta realizes that they do not share the same family values and she leaves them both. To spite Buster, Lucille adopts a Korean son whom she calls \"Annyong\" after she mistakes the Korean word for \"hello\" as his name. Through an escalating series of dares, Gob marries a woman he just met, played by Will Arnett's then real-life wife Amy Poehler, but cannot get an annulment because he refuses to admit that he did not consummate the marriage. Kitty, George Sr.'s former assistant and mistress, tries to blackmail the company. She is caught in the Bluth family yacht's explosion, as used in one of Gob's magic acts, but survives with a cooler full of damning evidence labeled \"H Maddas\". After previous failed attempts, and a brief religious stint in Judaism, George Sr. finally escapes from prison by faking a heart attack. It is also revealed that George Sr. committed \"light treason\" by using the company to build mini-palaces for Saddam Hussein in Iraq.</p><h4>Season 2 (2004–05)</h4><p>Because of his father's latest prison break deception (a faked heart attack), Michael decides to leave his family and move to Phoenix, Arizona with George Michael, but discovers that he cannot leave the state due to the Bluth Company being under investigation and him having to go to jail as a replacement for his father. Lucille appoints Gob the new Bluth Company president, but since Gob proves utterly incompetent, the position's real duties revert to Michael. During the rest of the season Gob serves as figurehead president; Michael is still under scrutiny for George Sr.'s illegal activity.</p><p>George Sr. is not, in fact, gone. After faking his death in Mexico by paying off the cops, George Sr. returns to the family model home, where George Michael discovers him hiding in the attic. To protect his son from legal implications, Michael hides George Sr. in Gob's prop Aztec Tomb, orchestrates a diversion, and tells the family that George Sr. has escaped once more. Throughout the rest of the season, Michael sneaks George Sr. provisions, and George Sr. keeps tabs on the Bluth family through the ventilation system. George Sr. also faces an onslaught from the outside world; the press begins looking for him in Iraq, fumigators surround the house while he's still in the attic, and Kitty returns to steal a sample of his semen to make her own Bluth baby.</p><p>Buster meanwhile joins the army, but escapes serving in Iraq when his hand is bitten off by a loose seal (a play on \"Lucille\") Gob had mistakenly trained to develop a taste for mammal flesh. Buster is refitted with a sharp hook, which he copes with poorly and often brandishes dangerously in social situations. During Buster's long psychological recovery, he bonds with George Sr.'s stoner twin brother Oscar, who moves in with Lucille in an attempt to rekindle a past love affair. Uncle Oscar slowly reveals himself as Buster's presumptive biological father. Eventually, George Sr. takes revenge on the adulterous Oscar and Lucille by kidnapping Oscar, knocking him unconscious, exchanging appearances with him, and sending him to prison in his place.</p><p>Lindsay and Tobias continue their disastrous open relationship. Lindsay tries—but fails—to secure a lover, while Tobias paints himself blue each night in a futile attempt to join the Blue Man Group. When Lindsay kicks him out of the house, Tobias disguises himself as a singing British nanny named \"Mrs. Featherbottom\" (an idea he gets from the film Mrs. Doubtfire) so he can watch over his daughter Maeby. The family sees right through this incompetent disguise, but they humor Tobias since—in the guise of Mrs. Featherbottom—he does their chores.</p><p>George Michael begins dating a deeply religious girl, Ann Veal, who encourages him to smash pop music CDs and to run for student body president against perennial favorite Steve Holt. Michael dislikes her and tries to disrupt the kids' relationship, most notably by breaking up Ann and George Michael's pre-engagement. Meanwhile, Maeby cons her way into an after school job as a film studio executive. When Maeby's studio remakes \"Les Cousins Dangereux\", George Michael abandons Ann to pursue his crush on Maeby. Maeby herself realises she has feelings for George Michael in light of his relationship, and the two kiss while the living room of the model home collapses.</p><h4>Season 3 (2005–06)</h4><p>Michael again searches for his runaway father, George Sr. Gob receives an invitation to a father/son reunion outing, and believes it to be George Sr. trying to contact him. In reality, the invitation was meant to reunite Gob with Steve Holt, son of Eve Holt, a girl Gob slept with in high school. Meanwhile, George Michael and Maeby deal with their previous kiss by avoiding each other.</p><p>In an attempt to remain in disguise, George Sr. joins the Blue Man Group. Michael discovers this and arranges to have his father placed under house arrest. George Sr. claims that he was set up by an underground British group. Michael goes to Wee Britain, a fictional British-themed city district, to investigate, and in the process meets a new love interest, Rita Leeds (Charlize Theron). Michael and the audience are led to believe that Rita is a mole for the underground British group, working for a man named \"Mr. F\". However, love-struck Michael proposes to her, and the couple run off to wed. Finally, it is revealed that Rita is actually an \"MRF\", or \"mentally retarded female\". Despite Rita's \"condition\", the family pushes him to go forward with the marriage because Rita is wealthy and they want her money. Michael is not persuaded and gently ends the relationship just as he and Rita are about to walk down the aisle. Meanwhile, Tobias and Lindsay seek legal help from Bob Loblaw (Scott Baio) concerning their troubled marriage.</p><p>With the family's retainer used up because of Lindsay's and Tobias's advances, Bob Loblaw chooses to no longer represent the Bluth family. Attorney Jan Eagleman offers to represent the family, on the condition that they participate in a mock trial in a new reality courtroom show called \"Mock Trial with J. Reinhold\". Musical accompaniment for the show's theme song and perceived jokes from testifying witnesses is provided by \"William Hung And His Hung Jury\". Michael uses an illegal threat from prosecutor Wayne Jarvis to have the mock case \"dismissed\". Gob and Franklin briefly appear in another courtroom show presided over by Bud Cort. Meanwhile, Maeby and George Michael perform a mock wedding for Alzheimer's patients that is accidentally conducted by a real priest; the two become legally married.</p><p>The family members are afraid to testify at the mock trial and at the real deposition; Buster fakes a coma, Lindsay and Lucille fake entering rehab, and Gob flees the country to perform in a USO Tour in Iraq. The deceptions are all uncovered by the prosecution, and in Iraq Gob is arrested for inadvertently inciting an anti-US riot. Buster and Michael travel to Iraq to rescue Gob, and while there, uncover evidence that the mini-palaces George Sr. built in Iraq were actually ordered and paid for by the CIA for wiretapping purposes. After this discovery, the US government drops all of the charges against George Sr. In the general confusion, everyone except George Michael forgets Maeby's sixteenth birthday.</p><p>To celebrate their victory in Iraq, the Bluths throw a shareholders' party on the RMS Queen Mary. During preparation for the party, it is revealed that Lindsay was adopted, meaning that George Michael and Maeby are not blood relatives. At the party, the Bluth's other adopted child, Annyong, reappears. He reveals that he is there to avenge the Bluth family's theft of his grandfather's frozen banana idea and the cause of his subsequent deportation, an event orchestrated many years earlier by Lucille Bluth. Annyong has turned over evidence implicating Lucille in the Bluth Company's accounting scandals. Before the police arrive, Michael and George Michael flee on Gob's yacht, The C-Word, and depart to Cabo with half a million dollars in cashier's checks, finally leaving the family to fend for themselves. However, it is revealed in the epilogue that George Sr. is also on the yacht, having lured his brother Oscar into taking his place once again. Also in the epilogue, Maeby tries to sell the television rights to the story of the Bluth family to Ron Howard, who tells her that he sees it as a movie rather than a series.</p><h4>Season 4 (2013)</h4><p>Filming for a fourth season to be released on Netflix began on August 7, 2012, more than six years after the series had been canceled by Fox. The season consists of 15 new episodes, all debuting at the same time on Netflix on May 26, 2013, in the United States, Canada, the United Kingdom, Ireland, Latin America, and the Nordic countries. Several actors who had recurring roles in the original series returned to reprise their roles, including Carl Weathers as himself, Henry Winkler as Barry Zuckerkorn, Ben Stiller as Tony Wonder, Mae Whitman as Ann Veal, Scott Baio as Bob Loblaw, Judy Greer as Kitty Sanchez, and Liza Minnelli as Lucille Austero; while new characters are played by Debra Mooney, John Slattery, Tommy Tune, Terry Crews, Isla Fisher and John Krasinski. Kristen Wiig and Seth Rogen appear as Lucille and George Sr., respectively, in flashbacks.</p><p>All episodes of the season occur over approximately the same stretch of time, but each focuses on a different character. Information on events depicted in a given episode is often partial and filled in during a later episode.</p><p>Creator Mitch Hurwitz created a recut of season four called Arrested Development Season 4 Remix: Fateful Consequences, in which the season's story is presented in chronological order. The recut consists of 22 episodes and was released May 3, 2018, on Netflix.</p><h4>Season 5 (2018–19)</h4><p>Netflix confirmed on May 17, 2017, that a fifth season featuring the full cast had been ordered. The fifth season includes 16 episodes; the first eight were released on May 29, 2018, and the remaining eight episodes premiered on March 15, 2019.</p><br/><h3>Reception</h3><h4>Television ratings</h4><p>The show, while critically acclaimed, did not gain a sizable audience. According to the Nielsen ratings system, the show's first season was the 120th most popular show among households and the 88th among viewers aged 18 to 49, averaging 6.2 million viewers.</p><p>U.S. ratings in the second season averaged about six million viewers, while the third season averaged about four million viewers. Fox announced that it would halt the production of the second season at eighteen episodes—four episodes short of the planned season.</p><p>For the third season, Fox positioned the show on Mondays at 8:00 p.m. ET. Ratings dropped further than previous seasons. On November 9, 2005, Fox announced that the show would not be airing in November sweeps, and that they had cut the episode order for the third season from 22 to 13. Fox ended up showing the last four episodes in a two-hour timeslot—directly opposite the opening ceremonies of the 2006 Winter Olympics. The series finale episode received 3.43 million viewers.</p><h4>Critical response</h4><p>Throughout its original run, Arrested Development received critical acclaim. It is widely regarded as one of the defining shows of the 2000s and has been praised by many critics as one of the greatest comedies of all time. In 2007, the show was listed as one of Time magazine's \"100 Best TV Shows of All-Time\".</p><p>Tim Stack of Entertainment Weekly praised the series, saying \"Is it beating a dead horse to once again state that this underappreciated gem is the best sitcom on TV? Too bad. Arrested Development is the best sitcom on TV!\"</p><p>David Bianculli from the New York Daily News stated \"If you're not watching this series on Fox, the least you can do is buy it on DVD. You'll love it, and it's such a dense show (in the best sense of the word) that it rewards repeated viewing. Like Scrubs and the British version of The Office, it is the sort of show that truly deserves to be seen uninterrupted, several episodes at a time, for maximum enjoyment. The laughs-per-minute quotient here is insanely high, making it great value as a home library purchase.\"</p><p>Alison Powell of The Guardian said \"As Hollywood agents worry about the demise of the town's lowing cash cow, the multi-camera, staged sitcom, here to save the day is Arrested Development, a farce of such blazing wit and originality, that it must surely usher in a new era in comedy.\"</p><p>Gillian Flynn of Entertainment Weekly named Arrested Development the best television show of 2005 and said in her review that \"As oddball as Arrested is, it's also humane. A flawless cast—from Will Arnett's breathy, bombastic Gob to Jessica Walter's boozy Lucille—grounds it, aided by Ron Howard's affable narration. The center of sensibility is good son Michael (Jason Bateman) and his even better son, George Michael (Michael Cera). Bateman and Cera give the best reacts around—the former all weary exasperation, the latter adorably bunny-stunned. Together, they're the sweetest, awkwardest straight men on the smartest, most shockingly funny series on TV ... which is likely canceled, despite six Emmy wins. It's a perversion not even the Bluths deserve.\" In 2012, Entertainment Weekly listed the show at No. 2 in the \"25 Best Cult TV Shows from the Past 25 Years\", praising its \"fast, delirious, interlocking jokes that don't pander to the masses; winky gags (e.g. fake preview scenes for the following week's episode); and a cast of absurd characters\". In 2013, the Writers Guild of America ranked it No. 16 on their list of the 101 Best Written TV Series.</p><h4>Accolades</h4><p>In 2004, the first season received seven Emmy Award nominations with five wins. It won for Outstanding Comedy Series, Outstanding Directing for a Comedy Series, Outstanding Casting for a Comedy Series, Outstanding Single-Camera Picture Editing for a Comedy Series and Outstanding Writing for a Comedy Series, for the pilot episode written by Mitchell Hurwitz and directed by brothers Anthony and Joe Russo. Jeffrey Tambor was nominated that year for Outstanding Supporting Actor in a Comedy Series.</p><p>In 2005, the second season received eleven Emmy nominations in seven categories with one win. Notable nominations included Outstanding Comedy Series, Outstanding Lead Actor in a Comedy Series (Jason Bateman), Outstanding Supporting Actor in a Comedy Series (Jeffrey Tambor), Outstanding Supporting Actress in a Comedy Series (Jessica Walter) as well as three nominations for Outstanding Writing for a Comedy Series, in which it won for \"Righteous Brothers\", written by Mitchell Hurwitz and Jim Vallely.</p><p>In 2006, the third season received four Emmy nominations, for Outstanding Comedy Series, Outstanding Supporting Actor in a Comedy Series (Will Arnett), Outstanding Single-Camera Picture Editing for a Comedy Series and Outstanding Writing for a Comedy Series for the series finale \"Development Arrested\".</p><p>In 2013, the fourth season received three Emmy nominations, for Outstanding Actor in a Comedy Series (Jason Bateman), Outstanding Music Composition for a Series (Original Dramatic Score) and Outstanding Single-camera Picture Editing for a Comedy Series.</p><p>Other awards include:</p><ul><li>The 2004 TV Land Award for \"Future Classic\", the first recognition the series received. The award presentation is included on the season one DVD release.</li><li>The 2004 Television Critics Association Awards for Outstanding Comedy and Outstanding New Program, and the 2005 award for Outstanding Achievement in Comedy.</li><li>The 2005 Golden Globe Award for Best Performance by an Actor in a Television Series – Musical or Comedy for Jason Bateman.</li><li>The 2004 Writers Guild of America Award for Episodic Comedy, for the episode \"Pier Pressure\", written by Mitchell Hurwitz and Jim Vallely.</li><li>The 2004 Satellite Award for Best Television Series – Comedy or Musical, along with Jeffrey Tambor and Jessica Walter for Best Performance by an Actor and Actress in a Supporting Role in a Series – Comedy or Musical. In 2005, Jason Bateman and Portia de Rossi won for Best Actor and Actress in a Series – Comedy or Musical. Jason Bateman also won the same award the following ceremony.</li><li>The 2005 Young Artist Award for Best Performance in a TV Series (Comedy or Drama) – Supporting Young Actress for Alia Shawkat.</li></ul><br/><h3>Controversies</h3><h4>Lawsuit</h4><p>In November 2003, the producers of the show were sued by the hip hop group Arrested Development over the alleged use of their name. Rapper Speech from the group said \"The use of our name by Fox is not only confusing to the public, but also has the potential to significantly dilute what the 'Arrested Development' name means to our fans\". The lawsuit was settled for an undisclosed sum. This incident was alluded to in the episode \"Motherboy XXX\". The narrator claims the show is \"legally required to make a distinction\" between the \"Motherboy\" event happening in the episode and a band called \"Motherboy\".</p><h4>Tambor's misconduct</h4><p>In an interview with The Hollywood Reporter in May 2018, Tambor apologized for actions that led to sexual misconduct accusations against him by co-workers on the TV show Transparent, and mentioned one \"blowup\" he had with co-star Jessica Walter during production of Arrested Development. Walter was asked about the incident during a cast interview with The New York Times. She became emotional, stating that \"in almost 60 years of working, I've never had anybody yell at me like that on a set and it's hard to deal with, but I'm over it now ... never crossed the line on our show, with any, you know, sexual whatever. Verbally, yes, he harassed me, but he did apologize. I have to let it go.\"</p><p>Bateman stated that \"in the entertainment industry it is incredibly common to have people who are, in quotes, 'difficult' ... is a weird thing, and it is a breeding ground for atypical behavior and certain people have certain processes.\" Hale said that \"we all have bad moments\", while Cross suggested that Tambor's outbursts were a \"cumulative effect\". The Daily Beast criticized Cross's comment as suggesting that Walter had \"asked for it\". Shawkat came to Walter's defense, saying that being difficult \"doesn't mean it's acceptable\" to treat someone badly. After outlets criticized the men's statements, Hale, Bateman, and Cross issued apologies to Walter. Netflix cancelled the show's UK press tour. Cera, who was not part of the group interview, stated that \"obviously I have to give a lot of consideration to whether I take jobs with anyone and think about how it affects people\".</p><br/>"
  },
  "errorMessage": ""
}