{
  "imDbId": "tt2395695",
  "title": "Cosmos: A Spacetime Odyssey",
  "fullTitle": "Cosmos: A Spacetime Odyssey (TV Series 2014–2014)",
  "type": "TVSeries",
  "year": "2014",
  "items": [
    {
      "username": "lavatch",
      "userUrl": "https://www.imdb.com/user/ur2767381",
      "reviewLink": "https://www.imdb.com/review/rw2976836",
      "warningSpoilers": true,
      "date": "9 March 2014",
      "rate": "10",
      "helpful": "179 out of 205 found this helpful.",
      "title": "Superb Production Values, Content, and Commentary",
      "content": "This series is a breath of fresh air when compared to the mindless programming typical of network television.When the original Cosmos series aired on PBS in the early 1980s, the dynamism of Carl Sagan showed how educational television could also be enormously popular. Now, over three decades later, the next edition of \"Cosmos\" retains the integrity of the original series while providing the latest findings in science and astronomy.Carl Sagan was a true Renaissance man, who synthesized history, philosophy, art, and science in the Cosmos series and the superb book that accompanied the program. Now, one of our finest scientists, Neil deGrasse Tyson, serves as our guide to the universe with outstanding commentary in the sequel. There was an especially moving moment when Professor Tyson recalled the time when he was warmly greeted by Carl Sagan, who took time out of his busy schedule to provide a personal tour of the Cornell campus when Tyson was about to enter college.It is impressive that a television personality on the order of Seth MacFarlane would produce this series that includes animated recreations of historical events, such as the trial and execution of the seventeenth century \"heretic\" Giordano Bruno. The animations are a cut above the generic dramatizations with actors, wherein the bottom drops out of most television documentaries.In the Academic Awards telecast hosted by MacFarlane, he closed the show with a star turn in singing \"Here's to the Losers.\" But in this truly outstanding series of \"Cosmos: A Space Time Odyssey,\" it is clear that everyone is a winner, especially the viewers who can embark on the voyage of a lifetime when they climb aboard The Ship of the Imagination for thirteen stellar episodes."
    },
    {
      "username": "willwri14",
      "userUrl": "https://www.imdb.com/user/ur42785006",
      "reviewLink": "https://www.imdb.com/review/rw2976938",
      "warningSpoilers": true,
      "date": "10 March 2014",
      "rate": "10",
      "helpful": "238 out of 271 found this helpful.",
      "title": "For a program that makes us feel so small, Cosmos has a lot of heart",
      "content": "Neil deGrasse Tyson's remake of Carl Sagan's original docu-series \"Cosmos: A Personal Voyage\". Carl Sagan allowed the public to see the wonders of science in an entertaining, thought-provoking and immensely educational way, and Tyson manages to capture the spirit and integrity of the original series, while giving the science and facts of the 1980 original a breath of fresh air. Tyson's narration is full of charm, and the program does the audience an immense favour, and makes \"Cosmos: A Spacetime Odyssey\" an easily absorbed yet thought-provoking experience.As an admirer of the universe, I couldn't wait to view Tyson's Cosmos - even as someone who is constantly trying to absorb facts about the universe, I still managed to pick up some facts I wasn't already aware of, and this is merely the beginning. The series has 13 episodes, spread over three months, and I can already tell the program has a huge amount to give. Full of lush imagery and wonderful animation, Cosmos is a pleasure to watch, and makes learning extremely easy, something that is becoming extremely difficult in the age of no attention span. Not only does Tyson allow for lighthearted, absorbable fact, but he also allows us to probe into our own imagination, and explore the universe ourselves. Everything in Cosmos is simplified for easy learning, yet isn't dumbed down so far that the fact is closer to fiction - the visuals alongside Tyson's wonderful commentary are absolutely mind-blowingly beautiful, but allow for visual learners to take something away from Cosmos as well.Tyson finished the episode with a heartfelt story involving his relationship with Carl Sagan, and his inspirational ways - I hope that many are inspired by Tyson's breath of fresh air in the documentary genre, and allows for the population of the world to reach for the stars. Cosmos: A Spacetime Odyssey is absolutely worth a watch, it is entertaining, heartfelt, absorbable, and most important, educational. As Sagan once said, \"The Cosmos is all that is, or ever was, or ever will be\", and I hope 'Cosmos' never ends, because all that it is is awe-inspiring and jaw-dropping in its beauty and splendour."
    },
    {
      "username": "brighterside11",
      "userUrl": "https://www.imdb.com/user/ur30299286",
      "reviewLink": "https://www.imdb.com/review/rw2977508",
      "warningSpoilers": false,
      "date": "11 March 2014",
      "rate": "10",
      "helpful": "123 out of 150 found this helpful.",
      "title": "A great narration into the vastness of the universe",
      "content": "Absolutely blown away by Neil deGrasse Tyson's hosting of Cosmos. You can tell he enjoys telling the story of the Cosmos. What makes the Cosmos remake most exciting to me is that new theories such as the 'Multiverse' theory and new findings are inevitably making its way to the front-line of grand-audience explanations of the universe. Also, now that graphics technology is more advanced than it was years ago during the first Cosmos series, the illustrations are much more telling and mesmerizing; this helps the viewer to visually break down some complexities that Neil alludes to in some of his narrative discussion.I can't think of anyone better to narrate this story other than Neil. It's obvious he's passionate about this show. Neil's tribute to Carl was touching in explaining how Carl inspired 'just a 17 year old kid from the Bronx' to become one of the most influential scientists of our modern generation. I'm extremely excited for the rest of the series to evolve and use the previous Cosmos series formula as a sort of foundation to continue captivating and inspiring the audience. After viewing the first episode, it's evident that future episodes will not disappoint."
    },
    {
      "username": "rmax304823",
      "userUrl": "https://www.imdb.com/user/ur0819382",
      "reviewLink": "https://www.imdb.com/review/rw2976859",
      "warningSpoilers": true,
      "date": "9 March 2014",
      "rate": "10",
      "helpful": "66 out of 92 found this helpful.",
      "title": "Fly Me To The Moon.",
      "content": "You can't help comparing \"Cosmos: A Space Time Odyssey\" to the original \"Cosmos\" from thirty years ago, hosted by Carl Sagan. Among the first things you notice about the new show is that the graphics are, well, light years ahead of \"Cosmos\". The set of the \"space craft\" -- what there is of it -- looks less like a 2050 suite in a Las Vegas hotel. The music is more dramatic. And Neil DeGrasse Tyson is the host because Sagan is no longer with us.Tyson is not Sagan. He's pleasant, looks good, sounds convincing, but there are times when his narration acquires a sing-song quality that turns the explanation into an address to a group of kids on a field trip from some nearby middle school. He's not Sagan, but then who is? I liked Sagan a great deal. He was of the moment -- longish hair, cool looking, bell bottom trousers, and he smoked grass once in a while. I also liked him because he was on the faculty when I was in graduate school and he could have chosen to drop in on my comprehensive oral exams and ask me what life would look like on a planet identical to earth except for a complete absence of calcium. (He didn't.)But that doesn't matter. As host, Tyson may not be as familiar a figure as Sagan was -- God, Sagan was all over the telly -- but he's likable in his own right. And there is no question of his knowing his subject, beginning at the Bronx High School of Science and reaching dazzling heights thereafter.There is an expectable amount of continuity between this program, which is a sort of up-dated sequel, and the original. One writer, Ann Druyan, had a hand in both. So we have the cosmic calendar which reduces the chronology of the universe to a single year. And even some expressions are carried over -- \"star stuff.\" I can't wait until Tyson gets to Sagan's awesome \"holy of holies.\" I thrilled the first time around.I do have a problem though, regarding chronology. \"Cosmos\" appeared in 1980. This show is appearing in 2014. Let's see. Sums were never my forte, but my pocket calculator tells me that 2014 minus 1980 is equal to 34. That means I'm 34 years older than I was when I watched the original. I hope Tyson is all finished dealing with the dimension of time. Let's move on to something else in the next episode -- pronto.Anyway, if he's so smart I'd have some questions for him. If the universe or universes are expanding, what are they expanding INTO? And if everything that exists started with the Big Bang of 13 billion years ago, what caused that Big Bang in the first place? And where did all those original hydrogen atoms COME from? Who's pulling the wool over whose eyes around here? Of course that gets us into metaphysics and he has nothing to say about it in this introductory episode, the only one I've seen. Judging from his Wikipedia entry, he'll have something to say about it later, and it won't make everyone happy. But, man, we need his messages now more than ever."
    },
    {
      "username": "pvineet131",
      "userUrl": "https://www.imdb.com/user/ur28451245",
      "reviewLink": "https://www.imdb.com/review/rw2976853",
      "warningSpoilers": false,
      "date": "9 March 2014",
      "rate": "10",
      "helpful": "150 out of 184 found this helpful.",
      "title": "Excited after watching the first episode",
      "content": "Neil really takes the baton from Carl and does a fine job with the show. With Ann co-producing and Seth also involved, I can't wait for the rest of the episodes. All in all, 10/10 for the show. Bringing astronomy and science to everyone, Neil was the most apt person to do this. Tip: watch in 720p or higher only because the visuals are brilliant. They tried to take some elements from the 1980 Cosmos, which is noticeable. Also Seth's influence is noticeable, with a few animations. The music at times was suiting the mood, and felt modern. Seth said in an interview that he wanted to make a difference, and with this, he surely is."
    },
    {
      "username": "gannoncannon-944-122285",
      "userUrl": "https://www.imdb.com/user/ur51262020",
      "reviewLink": "https://www.imdb.com/review/rw2977258",
      "warningSpoilers": false,
      "date": "9 March 2014",
      "rate": "10",
      "helpful": "302 out of 346 found this helpful.",
      "title": "My First review",
      "content": "i have been watching and loving films and TV shows for years now, and loving the study of the universe for even longer than that.that being said, this is the first time i have ever felt the need to create an account on IMDb solely to rate something a \"10\"this has an absolutely stunning, heartfelt, emotional introduction, and i only anticipate it getting better from here.i will probably update this review as the series goes on, or i may just review episodes individually. but either way, i firmly suggest that every human being on earth watch this show.have a good life everyone."
    },
    {
      "username": "gabkoost",
      "userUrl": "https://www.imdb.com/user/ur13405268",
      "reviewLink": "https://www.imdb.com/review/rw3006678",
      "warningSpoilers": false,
      "date": "29 April 2014",
      "rate": "10",
      "helpful": "26 out of 33 found this helpful.",
      "title": "When a TV Show should me mandatory.",
      "content": "What can i say about this remake of an already epic TV/Documentary show? If it is not enough that we are talking about an upgrade of something that was brilliant by itself, it had to be done by one of the greatest communicators of the scientific world; Dr. Neil Degrasse Tyson!Everything about these series is brilliant. To watch the universe at work in HD tanks to wonderful animations, plus the deep and mysterious voice of Dr. Tyson, is a real experience.Plus, the science behind it as well as the learning experience is something really worth of anyones time. When people talk about having fun while learning this is the best example.This TV Show should be MANDATORY for everyone. There is something almost mystical about it. The perspective that we get from it about our reality is something that keeps e wondering all day long after the episode.I would like to thank Dr. Tyson and all the people involved for this piece of Scientific Cinematography! I never saw learning, fun, science and even life lessons, fused together this well before!"
    },
    {
      "username": "compcyantist",
      "userUrl": "https://www.imdb.com/user/ur45761980",
      "reviewLink": "https://www.imdb.com/review/rw2978967",
      "warningSpoilers": false,
      "date": "13 March 2014",
      "rate": "10",
      "helpful": "135 out of 159 found this helpful.",
      "title": "An excellent successor to Carl Sagan.",
      "content": "Neil deGrasse Tyson is a marvelous astrophysicist who really loves his field and you can see this in the way he narrates the series. Cosmos is not only a journey, it also shows how much science has improved since the original series, all the new evidence, technology, and ideas, they encourage the next generation to pursue knowledge and discover something amazing. The visuals are stunning, the animation is unique, and most importantly it is very informative. The way Neil describes the universe is very coherent and easy for everyone to understand. This is an excellent series that shows science isn't just flat rigorous work, it is about discovery, asking questions, wonder, achievement."
    },
    {
      "username": "FabledGentleman",
      "userUrl": "https://www.imdb.com/user/ur0406567",
      "reviewLink": "https://www.imdb.com/review/rw3030157",
      "warningSpoilers": false,
      "date": "7 June 2014",
      "rate": "10",
      "helpful": "16 out of 21 found this helpful.",
      "title": "The greatest Odyssey",
      "content": "After seeing all 13 episodes of this, i can hands down say, that this is the best science program that has ever been aired. From the very first episode the grip tightens, and never lets go.All humans will greatly benefit watching this series. The depth, details, knowledge, vision and quality is beyond anything else ever made. All this thanks to Ann Druyan which also wrote the story for Contact starring Jodie Foster, and Seth MacFarlane who basically paid for the whole journey. And last but not least, Neil deGrasse Tyson. I bow down before you in awe of this magnificent creation.I rarely give 10's in my life. 10 is like above and beyond. For me to give something a 10, either if it is a movie, TV series, documentary etc. It must deliver above expectations, i call my 10's the \"raise the bar score\".And this show does just that. I am very glad i have seen it, and i will never forget it. It is simply the crown jewel of \"space documentary\".I can not recommend this enough."
    },
    {
      "username": "hauklanglo",
      "userUrl": "https://www.imdb.com/user/ur13939886",
      "reviewLink": "https://www.imdb.com/review/rw2978978",
      "warningSpoilers": false,
      "date": "13 March 2014",
      "rate": "9",
      "helpful": "68 out of 88 found this helpful.",
      "title": "Very true to the original",
      "content": "Disclaimer: This review is based exclusively on the first episode.First things first. Audience of the original by Carl Sagan may be disappointed by this remake. It's almost exactly the same as the original, word by word. But with cheaper production methods, brighter colors and crisper sound. Most importantly, it's without Carl Sagan and Vangelis' excellent music. Also, the stuff covered is not as amusing to the grown up audience who had the pleasure of enjoying the original. You already know this stuff.However, the qualities Cosmos presented to us in 1980, are still the same. It's a very inspiring series well suited to kickstart a young mind into independent critical thinking, curiosity and appreciation of science. The pace and presentation have been changed to better suit todays young, and older audience may not appreciate this. The pace is however still comfortably relaxed compared to other TV material aimed towards the same audience, making me think they will have a very similar experience to the own we had all those years ago. But this series is for the young, and I'm sure it has all the qualities the original had needed when it comes to trigger their curiosity, fascination and generally change the way they see themselves and the world they live in. Personally I think Tyson does a great job walking in Sagans footsteps.Adults with much knowledge about our world criticizing the series for being shallow and bring few new details to the original don't impress me at all. They have misunderstood the whole point of this series, which is all about creating enthusiasm for science among the younger. Not updating adult geeks on the very latest on string theory.Adults may not learn a lot, but you will be entertained. For the younger, this has the potential to be the same amazing ride as it was for us 35 years ago."
    },
    {
      "username": "chatless46",
      "userUrl": "https://www.imdb.com/user/ur22245639",
      "reviewLink": "https://www.imdb.com/review/rw3031431",
      "warningSpoilers": false,
      "date": "9 June 2014",
      "rate": "10",
      "helpful": "14 out of 17 found this helpful.",
      "title": "Just Like Carl",
      "content": "I've watched this series from the beginning. Meaning Carl Sagan. And I've gotta tell you, Dr. Sagan's protégé, the justifiably lauded Neil deGrasse Tyson, sublimely captures the spirit of the original. He's a pleasure to watch and listen to, as he guides us viewers through the cosmos with his lovely tones and masterful grasp of science - a lot like Carl.I just watched last Sunday night's concluding season one episode, and Neil and his team pulled out all the stops. Thrilling, exhilarating, jaw-dropping stuff. And it made me cry. That's a tough bar for a science program. What caused the waterworks for me was the replay near the end, of Carl's editorial on the existence of the Earth, what it means to us, and the role it plays in the cosmos - which, let's face it, is relatively insignificant.As Dr. Tyson imparts, what IS significant, for us, is how we perceive the universe - that's pretty much the point of the show. The final episode's discussion of dark matter, supernovas, and Earth's billion-year missive to the galaxy in the form of a seriously long-playing album - dispatched by President Jimmy Carter - was splendid.But let's return to Neil. Dr. Tyson's scientific expertise and allure as a performer are unparalleled. He has equaled and, I think, bested those qualities of his his mentor. Dr. Sagan would be very proud of that.I'm ready for Season Two."
    },
    {
      "username": "jetmox-458-423688",
      "userUrl": "https://www.imdb.com/user/ur35938765",
      "reviewLink": "https://www.imdb.com/review/rw2977838",
      "warningSpoilers": false,
      "date": "10 March 2014",
      "rate": "10",
      "helpful": "82 out of 105 found this helpful.",
      "title": "Great show !",
      "content": "Thank You Seth MacFarlane for having the foresight for bringing this back with your own money. Carl Sagan when I was growing up influenced me with the original Cosmos series to go into science and also gave me the love of science fiction.Astrophysicist Neil deGrasse Tyson is brilliant in continuing in Mr Sagan's footsteps. The the score written by Alan Silvestri also fantastic. I will be introducing this to my young family as the love of Cosmos should be for all generations.There is updated animation no doubt influenced by Seth's Family Guy roots but this should hold the attention of the kids as the this combined with the special effects should keep them engrossed and learn at the same time.Look forward to more episodes and questions from kids !"
    },
    {
      "username": "melinazahalka",
      "userUrl": "https://www.imdb.com/user/ur51304540",
      "reviewLink": "https://www.imdb.com/review/rw2978005",
      "warningSpoilers": false,
      "date": "11 March 2014",
      "rate": "10",
      "helpful": "103 out of 124 found this helpful.",
      "title": "Absolutely cannot wait until the next episode.",
      "content": "This was so much fun--and it is so amazing that Carl Sagan's wife, Seth McFarlane, and Tyson Degrasse from NOVA are all together on this! I love the idea of using animation to portray ancient people--it completely avoids the campy feel of actors in strange beards and so-so backgrounds. Genius, Family Guy guy. I love the perspective it gives you, by really squishing enormous concepts into feasible bits of knowledge. It's not so you'll impress your friends--its so that you watch, and understand why you are so amazed by the universe. The computer animation of some of one of the first creatures to walk on land looks pretty darn tootin' real, as well--something that I loved. No strange feelings that their feet were hovering above the sand as they were animated--this is high quality. Additionally, Tyson seems more personable, even more likable, and definitely watchable because of his knowledge and enthusiasm for the subject. This is worth the watch, a wonderful surprise, and I am super excited for episode two. It's getting me to the gym to watch it on the treadmill. :)"
    },
    {
      "username": "xscd",
      "userUrl": "https://www.imdb.com/user/ur15834221",
      "reviewLink": "https://www.imdb.com/review/rw3039620",
      "warningSpoilers": false,
      "date": "25 June 2014",
      "rate": "10",
      "helpful": "11 out of 14 found this helpful.",
      "title": "One of the Best Science Shows",
      "content": "We don't have satellite or cable TV, so we watched the over-the-air broadcasts of Cosmos, and were fascinated by them despite the low resolution, static on the TV image and so many commercials. I was anxious to see the entire series again so I ordered the Blu-Ray version of the series and have greatly enjoyed seeing the series again in crisp and beautiful high resolution.It seems that the relatively small ratio of people who give this series very low ratings have one or more of just several objections: they don't believe that the Earth is as old as it is, for religious reasons; they object to the scientific material and assessment of the carbon dioxide we're adding to the atmosphere and its implications for the global warming we're experiencing, for ideological (almost religious) reasons; and an objection to the \"theory\" of evolution, for religious reasons.I have a couple questions for the religious people who believe that the Earth is only 6-10 thousand years old-- How did Noah and his family collect and place on the ark the many tiny or microscopic animals on Earth at that time, all the insects, the tiny tardigrades, all the bacteria and other microscopic organisms? And since the flood covered the world and must have killed all the land plants from both submersion and the poisonous effects of the dissolved salts in ocean water, and since plants weren't included in the species to be saved by the ark, why do we have the vast diversity of plants that exist today? Did they all evolve after Noah and the Flood? Cosmos is an extremely good series that accomplishes the astonishing feat of being appealing and fascinatingly educational to both adults and children. It is a great asset to us as a society. Thank you to everyone involved in its production."
    },
    {
      "username": "sckioskanderson",
      "userUrl": "https://www.imdb.com/user/ur48280105",
      "reviewLink": "https://www.imdb.com/review/rw2977263",
      "warningSpoilers": false,
      "date": "10 March 2014",
      "rate": "10",
      "helpful": "107 out of 133 found this helpful.",
      "title": "Breathtaking and exciting...",
      "content": "This was an absolute blast to watch! I was excited from the moment that I found out that Cosmos would be returning to TV. It was, and still is, one of the shows as a child that really made me feel an overwhelming awe about reality and life as we have come to understand it. I applaud Seth Macfarlane and the FOX Network for taking a chance, and bringing this amazing mini- series to a new generation. Also HUGE kudos to Neil Degrasse Tyson for really taking the reigns, and conveying such amazing topics in thought provoking narrative terms that my daughter, and all children, can now easily understand and enjoy immensely. I really thought that everyone involved handled these topics in an elegant way in which to minimize the offense that a few may try to find with these subjects in which scientific evidence can actually back up. Thank you, to everyone involved, for the beautiful and amazing masterpiece that is... Cosmos..."
    },
    {
      "username": "llltdesq",
      "userUrl": "https://www.imdb.com/user/ur0583640",
      "reviewLink": "https://www.imdb.com/review/rw3086314",
      "warningSpoilers": true,
      "date": "14 September 2014",
      "rate": "10",
      "helpful": "8 out of 11 found this helpful.",
      "title": "Absolutely beautiful reboot on a series I recall with fondness",
      "content": "Full disclosure: I was and am a big fan of the original show Cosmos with Carl Sagan, I typically dislike re-makes (retreads) of successful movies or shows from before and approached this with very mixed feelings. I wanted it to be good and expected to be disappointed to some degree. I watched it mainly because I was pretty sure that Neil deGrasse Tyson would have a certain respect for the original and that Ann Druyan was involved.Strangely enough, the only part of this which even mildly disappointed me was the animated sequences and they were actually better than I expected them to be. Sometimes they worked for me and sometimes they didn't, but on the whole, they were fairly good.There was/is a fair amount of overlap between the two, which is reflected in the writing credits (the late Carl Sagan is given a writing credit based on material done for the original) but that was to be expected. The new series gave proper respect and credit to the original while also working in its own right. The visuals are as breathtaking is those in the original, probably moreso. Exceptionally well-crafted and well worth watching.This is available on DVD and Blu-Ray with either being acceptable. Most highly recommended."
    },
    {
      "username": "Arnror_II",
      "userUrl": "https://www.imdb.com/user/ur39357985",
      "reviewLink": "https://www.imdb.com/review/rw2988906",
      "warningSpoilers": false,
      "date": "30 March 2014",
      "rate": "10",
      "helpful": "20 out of 30 found this helpful.",
      "title": "For the new people",
      "content": "This is a program made for (and rightly so) children, and should be rated as such. Production: Excellent. Neil Tyson is so comfortable in front of the camera, it's almost embarrassing. He should have been a rock star or something.Anyway, if you do not remember anything from science class, or just want your children away from the brain destroying reality shows. This is the one. I was definitely not bored, and I'm 41.I would even go so far as to say this should be implemented in elementary school. Especially in the country where it was made, as \"Evolution\" seams to be a controversy there. Perhaps the main reason this was made, is because there is Americans who believe humans rode the dinosaurs. THAT's tragic.Edit. Not just for children. A theory is fact, Tyson? Really?Newton rules!"
    },
    {
      "username": "christian94",
      "userUrl": "https://www.imdb.com/user/ur0960268",
      "reviewLink": "https://www.imdb.com/review/rw3412688",
      "warningSpoilers": false,
      "date": "10 February 2016",
      "rate": "10",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Heads over Heals with Science",
      "content": "This series is stupendous and even perhaps better than the original it pays homage to with a labour of love, dedication and diligence. I am watching it with my 5 year son who is equally impressed by imagery (bravo Bill Pope) as with the thought-provocative content. My curious son's questions about deep cosmological conundrums or simple ideas, concepts, events, objects, forces and interactions are mind- boggling. He is already becoming familiar with our wider reality we were not familiar with a few generations back.One of our debates is also which episode is better because frankly, we like them almost all the same, save Electric Boy which is slightly below par but great in its own right and necessary. Episodes are different flavours of the overall satisfying meal. The feel that makes you think and feel. The awe that it inspires and which bounds us. The special effects, animated storytelling sequences, location shooting, new cosmic calendar and updated slick ship of the imagination which becomes a character are out of this world. But beyond everything, and even if my son does not understand most of the subtleties yet, the passion for science, exploration and curiosity are clearly conveyed and palpable. The content for a more astute audience is just as intriguing and interesting point for further conversations. What converges is the confluence of historical perspective of science, thought, exploration in a philosophical reflection of the human existence and experience.No small task and especially when Sagan, his lore and love for science and ability to demystify and simplify with a smile, had done it so well in 1980. Cosmos: A Spacetime Odyssey accepts and accomplish the challenge to make it relevant, pay respect to Sagan's work, but also make it its own and take off like a space rocket towards the future and end up in a daring voyage like Voyager space probes.This 2014 version is heads and shoulders above any science or non- science show, and better than most mesmerizing TV dramas even because it is the greatest story every told: the whole story as we know it. I don't know of many science documentaries that have the ability to make you cry, but this is so well written, narrated and directed that it achieves even that. Be ready for content and context with class. This should be required viewing for this whole upcoming generations of wide-eyed kids. It makes you heads over heals in love with life and this wonderful cosmos we are still discovering since Sagan, way before and surely after.Share the love. Keep questioning. Nurture curiosity and creativity. Stand in awe of nature and cherish it."
    },
    {
      "username": "TheMarwood",
      "userUrl": "https://www.imdb.com/user/ur4361516",
      "reviewLink": "https://www.imdb.com/review/rw3042452",
      "warningSpoilers": false,
      "date": "30 June 2014",
      "rate": "9",
      "helpful": "8 out of 11 found this helpful.",
      "title": "A visually arresting experience and a wealth of information",
      "content": "The always watchable Neil deGrasse Tyson hosts this 13 part series on all things science, as he takes us through space and time and makes enigmatic material easy to understand and digest without ever pandering to a broad audience. Cosmos is a visual experience as much as it is educational and we are in the great hands of cinematographer Bill Pope who gives us stunning images and the effects work are top notch. Over the course of the 13 episodes, a brilliant narrative plays out of the men and women and the heroes and villains of science who paved the path of discovery and our understanding of the impossibly complex universe. But it's Neil deGrasse Tyson who makes this wealth of information worth viewing, with his infectious love of the material, he commands the screen and makes this journey into the unknown and known a treat."
    },
    {
      "username": "eryui",
      "userUrl": "https://www.imdb.com/user/ur24473961",
      "reviewLink": "https://www.imdb.com/review/rw6240902",
      "warningSpoilers": false,
      "date": "6 November 2020",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "This documentary should be mandatory in all schools",
      "content": "Do yourself a favor and watch this series, it really broadens your horizons, even the mental ones. It is so well told, perfect in every respect. This series makes you understand more about humans and the universe in a few hours than you will understand in a lifetime.10/10 masterpiece"
    },
    {
      "username": "mikecart1",
      "userUrl": "https://www.imdb.com/user/ur3306125",
      "reviewLink": "https://www.imdb.com/review/rw3080135",
      "warningSpoilers": true,
      "date": "3 September 2014",
      "rate": "10",
      "helpful": "9 out of 12 found this helpful.",
      "title": "Possibly the Greatest Non-Fiction Show of the Past Decade!",
      "content": "This show is astronomically good! Haha! But seriously, I didn't know about this show until just a few weeks ago. Now every night before I go to sleep, I got to watch a few minutes of Cosmos.Why just a few minutes? Every show is packed with information! Those wanting your everyday low-level nonsense should look elsewhere. Anyone can recite high level theories and ideas. It takes a true genius like Neil Tyson to break down these high level ideas into simple terms that anyone can follow and understand.I used to watch him when he was on PBS and he is better than ever here. The show is slightly different from Morgan Freeman's Through the Wormhole series. This show is more of a prequel of knowledge you should know in order to watch Through the Wormhole or other scientific shows.What I really like about this show is that after an episode I can remember most of the ideas. During many shows, I have found myself pausing and looking on the internet to research more about topics.From learning how dogs evolved from wolves, to how the light you see in the sky is really looking back in time, to how the visible light spectrum is a gift that only humans can see completely, to how things so tiny to the human eye are really the superheroes of the universe. It is all here and more.I just hope it can continue for several more years and it doesn't get cancelled for \"religious\" reasons.Before I was 50/50 on evolution theories. Now after watching over half of season 1, I am over 90% on evolution.This show is awesome and is a must see whether you are in the religious camp, evolution camp, or a little of both. It doesn't shut down religion, it just opens doors to believe in both because science still can't go back before the \"big bang\".CHEERS!"
    },
    {
      "username": "ChandRath",
      "userUrl": "https://www.imdb.com/user/ur23516404",
      "reviewLink": "https://www.imdb.com/review/rw3031000",
      "warningSpoilers": false,
      "date": "9 June 2014",
      "rate": "10",
      "helpful": "11 out of 15 found this helpful.",
      "title": "Highly Recommended to those who living in this Planet !!",
      "content": "\"Cosmos: A SpaceTime Odyssey\" is those rare Documentary that might appear twice in a human lifetime. ....like \"Halley's Comet\". One of the #BestDocumentaryEverMadeInThisPlanetHISTORYAn emotionally moving show about the wonders of understanding science, how science works, and the hearts and minds of those who follow the rigors of science, Carefully examines the Universe and our place in it.This not the that type of Documentary which tells people, the current status of science but it is the documentary that touch the core of the heart of people. I consider myself lucky to have seen this series. A Life-Changing Experience A Life-Changing Odyssey .........Hats Off to Carl Sagan (The Original Creator), Hats Off to Neil Tyson (The Current Presenter Of COSMOS)One of the #BestDocumentaryEverMadeInThisPlanetHISTORY"
    },
    {
      "username": "kld0068",
      "userUrl": "https://www.imdb.com/user/ur17433770",
      "reviewLink": "https://www.imdb.com/review/rw3003704",
      "warningSpoilers": false,
      "date": "23 April 2014",
      "rate": "10",
      "helpful": "11 out of 16 found this helpful.",
      "title": "Excellent show to introduce young minds to astronomy",
      "content": "Many of the concepts were a nice refresher of the astronomy course that I took in college. I particularly liked the comparison and relationship of the micro universe (the atom) to the macro universe.Neil deGrasse Tyson is obviously quite passionate and excited to teach cosmic evolution. I can tell that the show is geared more towards engaging young minds in an effort to introduce them to the wonders of the physical sciences. At first, I thought that the animations were overly simplistic, but have since decided that they are just right to convey the intended information without distracting from the subject matter.I would like to see more shows about science and of this caliber being produced. It is good to see television programming which is informative, educational, and entertaining rather than shows that cater to the lowest common denominator. Keep up the good work!"
    },
    {
      "username": "rzajac",
      "userUrl": "https://www.imdb.com/user/ur1517556",
      "reviewLink": "https://www.imdb.com/review/rw3010137",
      "warningSpoilers": false,
      "date": "5 May 2014",
      "rate": "9",
      "helpful": "9 out of 14 found this helpful.",
      "title": "Pushing back the tide",
      "content": "It's the rare person who has the temperament to truly \"do\" science. It's a lot of hard work, and you have to be lucky enough to be born into a society that--through some social mechanism or other--collectively places a high value on the exertions of those personality types. No one expects everyone to value science enough to become a scientist.But, at the same time, there's also an inescapable reality: One of the enlightenment principles needed to sustain good republican governance and a \"decent\" society is a scientific principle; at least from the standpoint that evidence is key to any truths worth knowing. And America is sort of drawing back to a kind of willful abnegation of that kind of probity. People are \"believing\" more and more and knowing less and less. And that doesn't bode well for the American experiment.And the new Cosmos, in its own small, media circus way, would, if it could, press back against the encroaching obscurantism. With its very attractive graphic communication, straightforward prose, and compelling narratives, people can be painlessly reminded of the wonderful productivity and discovery that science affords its practitioners and to a lesser extent the lay public.I think I've said all I need to. Check it out."
    },
    {
      "username": "Lewis01-228-458550",
      "userUrl": "https://www.imdb.com/user/ur29508832",
      "reviewLink": "https://www.imdb.com/review/rw3018176",
      "warningSpoilers": false,
      "date": "18 May 2014",
      "rate": "10",
      "helpful": "12 out of 18 found this helpful.",
      "title": "Cosmos Needs To Be Kept Alive",
      "content": "Fox needs to make sure that Cosmos is on next season and for many more. It is the only show on science. This country needs scientists now more than ever and the only way for that to happen is for youngster to get excited about it. Neil deGrasse Tyson is the perfect host with his passion for the subjects presented and this passion will hopefully effect those watching the show.I understand that shows are presented so as there is a profit through sponsorship. However, in this instances the sponsors have to consider the effect of the show on the country. Please maintain the show as a public service and your rewards will show up in other ways besides profits.Today a youngster watches the show and gets excited and wants to become a scientist. Tomorrow he finds a cure for cancer."
    }
  ],
  "errorMessage": ""
}