{
  "imDbId": "tt2395695",
  "title": "Cosmos: A Spacetime Odyssey",
  "fullTitle": "Cosmos: A Spacetime Odyssey (TV Series 2014–2014)",
  "type": "TVSeries",
  "year": "2014",
  "language": "en",
  "titleInLanguage": "Cosmos: A Spacetime Odyssey",
  "url": "https://en.wikipedia.org/wiki/Cosmos:_A_Spacetime_Odyssey",
  "plotShort": {
    "plainText": "Cosmos: A Spacetime Odyssey is a 2014 American science documentary television series. The show is a follow-up to the 1980 television series Cosmos: A Personal Voyage, which was presented by Carl Sagan on the Public Broadcasting Service and is considered a milestone for scientific documentaries. This series was developed to bring back the foundation of science to network television at the height of other scientific-based television series and films. The show is presented by astrophysicist Neil deGrasse Tyson, who, as a young high school student, was inspired by Sagan. Among the executive producers are Seth MacFarlane, whose financial investment was instrumental in bringing the show to broadcast television, and Ann Druyan, a co-author and co-creator of the original television series and Sagan's wife. The show is produced by Brannon Braga, and Alan Silvestri composed the backing score.\r\nThe series loosely follows the same thirteen-episode format and storytelling approach that the original Cosmos used, including elements such as the \"Ship of the Imagination\" and the \"Cosmic Calendar\", but features information updated since the 1980 series, along with extensive computer-generated graphics and animation footage augmenting the narration.\r\nThe series premiered on March 9, 2014, simultaneously in the United States across ten 21st Century Fox networks. The remainder of the series aired on the Fox Network, with the National Geographic Channel rebroadcasting the episodes the next night with extra content. The series has been rebroadcast internationally in dozens of other countries by local National Geographic and Fox stations. The series concluded on June 8, 2014, with home media release of the entire series on June 10, 2014. Cosmos has been critically praised, winning several television broadcasting awards and a Peabody Award for educational content.\r\nA sequel series, Cosmos: Possible Worlds, premiered on March 9, 2020, on National Geographic.",
    "html": "<p>Cosmos: A Spacetime Odyssey is a 2014 American science documentary television series. The show is a follow-up to the 1980 television series Cosmos: A Personal Voyage, which was presented by Carl Sagan on the Public Broadcasting Service and is considered a milestone for scientific documentaries. This series was developed to bring back the foundation of science to network television at the height of other scientific-based television series and films. The show is presented by astrophysicist Neil deGrasse Tyson, who, as a young high school student, was inspired by Sagan. Among the executive producers are Seth MacFarlane, whose financial investment was instrumental in bringing the show to broadcast television, and Ann Druyan, a co-author and co-creator of the original television series and Sagan's wife. The show is produced by Brannon Braga, and Alan Silvestri composed the backing score.</p><p>The series loosely follows the same thirteen-episode format and storytelling approach that the original Cosmos used, including elements such as the \"Ship of the Imagination\" and the \"Cosmic Calendar\", but features information updated since the 1980 series, along with extensive computer-generated graphics and animation footage augmenting the narration.</p><p>The series premiered on March 9, 2014, simultaneously in the United States across ten 21st Century Fox networks. The remainder of the series aired on the Fox Network, with the National Geographic Channel rebroadcasting the episodes the next night with extra content. The series has been rebroadcast internationally in dozens of other countries by local National Geographic and Fox stations. The series concluded on June 8, 2014, with home media release of the entire series on June 10, 2014. Cosmos has been critically praised, winning several television broadcasting awards and a Peabody Award for educational content.</p><p>A sequel series, Cosmos: Possible Worlds, premiered on March 9, 2020, on National Geographic.</p>"
  },
  "plotFull": {
    "plainText": "Cosmos: A Spacetime Odyssey is a 2014 American science documentary television series. The show is a follow-up to the 1980 television series Cosmos: A Personal Voyage, which was presented by Carl Sagan on the Public Broadcasting Service and is considered a milestone for scientific documentaries. This series was developed to bring back the foundation of science to network television at the height of other scientific-based television series and films. The show is presented by astrophysicist Neil deGrasse Tyson, who, as a young high school student, was inspired by Sagan. Among the executive producers are Seth MacFarlane, whose financial investment was instrumental in bringing the show to broadcast television, and Ann Druyan, a co-author and co-creator of the original television series and Sagan's wife. The show is produced by Brannon Braga, and Alan Silvestri composed the backing score.\r\nThe series loosely follows the same thirteen-episode format and storytelling approach that the original Cosmos used, including elements such as the \"Ship of the Imagination\" and the \"Cosmic Calendar\", but features information updated since the 1980 series, along with extensive computer-generated graphics and animation footage augmenting the narration.\r\nThe series premiered on March 9, 2014, simultaneously in the United States across ten 21st Century Fox networks. The remainder of the series aired on the Fox Network, with the National Geographic Channel rebroadcasting the episodes the next night with extra content. The series has been rebroadcast internationally in dozens of other countries by local National Geographic and Fox stations. The series concluded on June 8, 2014, with home media release of the entire series on June 10, 2014. Cosmos has been critically praised, winning several television broadcasting awards and a Peabody Award for educational content.\r\nA sequel series, Cosmos: Possible Worlds, premiered on March 9, 2020, on National Geographic.\r\nProduction\r\nBackground\r\nThe original 13-part Cosmos: A Personal Voyage first aired in 1980 on the Public Broadcasting Service, and was hosted by Carl Sagan. The show has been considered highly significant since its broadcast; David Itzkoff of The New York Times described it as \"a watershed moment for science-themed television programming\". The show has been watched by at least 400 million people across 60 countries, and until the 1990 documentary The Civil War, remained the network's highest rated program.\r\nFollowing Sagan's death in 1996, his widow Ann Druyan, the co-creator of the original Cosmos series along with Steven Soter, and astrophysicist Neil deGrasse Tyson sought to create a new version of the series, aimed to appeal to as wide an audience as possible and not just to those interested in the sciences. They had struggled for years with reluctant television networks that failed to see the broad appeal of the show.\r\nDevelopment\r\nSeth MacFarlane had met Druyan through Tyson at the 2008 kickoff event for the Science & Entertainment Exchange, a new Los Angeles office of the National Academy of Sciences, designed to connect Hollywood writers and directors with scientists. A year later, at a 2009 lunch in New York City with Tyson, MacFarlane learned of their interest to re-create Cosmos. He was influenced by Cosmos as a child, believing that Cosmos served to \" the gap between the academic community and the general public\". At the time MacFarlane told Tyson, \"I'm at a point in my career where I have some disposable income ... and I'd like to spend it on something worthwhile.\" MacFarlane had considered the reduction of effort for space travel in recent decades to be part of \"our culture of lethargy\". MacFarlane, who has several series on the Fox network, was able to bring Druyan to meet the heads of Fox programming, Peter Rice and Kevin Reilly, and helped secure the greenlighting of the show. MacFarlane admits that he is \"the least essential person in this equation\" and the effort is a departure from work he's done before, but considers this to be \"very comfortable territory for me personally\". He and Druyan have become close friends, and Druyan stated that she believed that Sagan and MacFarlane would have been \"kindred spirits\" with their respective \"protean talents\". In June 2012, MacFarlane provided funding to allow about 800 boxes of Sagan's personal notes and correspondences to be donated to the Library of Congress.\r\nIn a Point of Inquiry interview, Tyson discussed their goal of capturing the \"spirit of the original Cosmos\", which he describes as \"uplifting themes that called people to action\". Druyan describes the themes of wonder and skepticism they are infusing into the scripts, in an interview with Skepticality, \"In order for it to qualify on our show it has to touch you. It still has to be rigorously good science—no cutting corners on that. But then, it also has to be that equal part skepticism and wonder both.\" In a Big Picture Science interview, Tyson credits the success of the original series for the proliferation of science programming, \"The task for the next generation of Cosmos is a little bit different because I don't need to teach you textbook science. There's a lot of textbook science in the original Cosmos, but that's not what you remember most. What most people who remember the original series remember most is the effort to present science in a way that has meaning to you that can influence your conduct as a citizen of the nation and of the world—especially of the world.\" Tyson states that the new series will contain both new material and updated versions of topics in the original series, but primarily, will service the \"needs of today's population\". \"We want to make a program that is not simply a sequel to the first, but issues forth from the times in which we are making it, so that it matters to those who is this emergent 21st century audience.\" Tyson considered that recent successes of science-oriented shows like The Big Bang Theory and CSI: Crime Scene Investigation, along with films like Gravity, showed that \"science has become mainstream\" and expects Cosmos \"will land on hugely fertile ground\".\r\nTyson spoke about the \"love-hate relationship\" viewers had with the original series' Spaceship of the Imagination, but confirmed during production that they were developing \"vehicles of storytelling\". Tyson affirmed that defining elements of the original series, such as the Spaceship of the Imagination and the Cosmic Calendar with improved special effects, as well as new elements, would be present. Animation for these sequences was ultimately created by a team hand-picked by MacFarlane for the series. Kara Vallow developed and produced the animation, and the animation studio used was Six Point Harness in Los Angeles, California. The sound of the Spaceship of the Imagination, and sound design in general, was created by Rick Steele, who said of the show: \"Cosmos has been, by far, the most challenging show of my career.\" The updated Spaceship was designed to \"remain timeless and very simple\", according to MacFarlane, using the ceiling to project future events and the floor for those in the past, to allow Tyson, as the host, to \"take to the places that he's talking about\".\r\nMusic\r\nAll music is composed by Alan Silvestri.\r\nAll music is composed by Alan Silvestri.\r\nAll music is composed by Alan Silvestri.\r\nAll music is composed by Alan Silvestri.\r\nEpisodes\r\nCast\r\nNeil deGrasse Tyson Himself / Host\r\nCarl Sagan as Himself (archive footage)\r\nPeter Emshwiller as the voice of George Tilton\r\nPiotr Michael as the voice of Edmund Muskie\r\nSeth MacFarlane as the voice of Giordano Bruno\r\nJohn Steven Rocha as the voice of Robert Bellarmine\r\nPaul Telfer as the voice of an angry scholar\r\nMichael Chochol as the voice of Jan Oort\r\nKirsten Dunst as the voice of Cecilia Payne-Gaposchkin\r\nCary Elwes as the voice of Edmond Halley and Robert Hooke\r\nRichard Gere as the voice of Clair Patterson\r\nJonathan Morgan Heit as the voice of John Herschel\r\nMartin Jarvis as the voice of Humphry Davy\r\nTom Konkle as the voice of Samuel Pepys\r\nMarlee Matlin as the voice of Annie Jump Cannon\r\nAlfred Molina as the voice of Ibn al-Haytham\r\nHeiko Obermoller as the voice of Hermann Einstein\r\nJulian Ovenden as the voice of Michael Faraday\r\nNadia Rochelle Pfarr as the voice of Malala Yousafzai\r\nEnn Reitel as the voice of Albert Einstein\r\nWesley Salter as the voice of James Clerk Maxwell\r\nAmanda Seyfried as the voice of Marie Tharp\r\nAlexander Siddig as the voice of Isaac Newton\r\nAndré Sogliuzzo as the voice of Christopher Wren and Weichelberger\r\nPatrick Stewart as the voice of William Herschel\r\nOliver Vaquer as the voice of Joseph von Fraunhofer\r\nJulie Wittner as the voice of Sarah Faraday\r\nMarc Worden as the voice of Harrison Brown\r\nBroadcast\r\nIn August 2011, the show was officially announced for primetime broadcast in the spring of 2014. The show is a co-production of Druyan's Cosmos Studios, MacFarlane's Fuzzy Door Productions, and National Geographic Channel; Druyan, MacFarlane, Cosmos Studios' Mitchell Cannold, and director Brannon Braga are the executive producers.\r\nFox's CEO Kevin Reilly considered that the show would be a risk and outside the network's typical programming, but that \"we believe this can have the same massive cultural impact that the original series delivered,\" and committed the network's resources to the show. The show would first be broadcast on Fox, re-airing the same night on the National Geographic Channel.\r\nIn Canada, it was broadcast simultaneously on Global, National Geographic Channel and Nat Geo Wild. A preview of the show's first episode was aired for student filmmakers at the White House Student Film Festival on February 28, 2014.\r\nCosmos premiered simultaneously in the US across ten Fox networks: Fox, FX, FXX, FXM, Fox Sports 1, Fox Sports 2, National Geographic Channel, Nat Geo WILD, Nat Geo Mundo, and Fox Life. According to Fox Networks, this was the first time that a TV show was set to premiere in a global simulcast across their network of channels.\r\nThe Fox network broadcast averaged about 5.8 million viewers in Nielsen's affiliate-based estimates for the 9 o'clock hour Sunday, as well as a 2.1 rating/5 share in adults 18-49. The under-50 audience was roughly 60% men. Viewing on other networks raised these totals to 8.5 million and a 2.9 rating in the demo, according to Nielsen.\r\nReception\r\nCritical reception\r\nCosmos: A Spacetime Odyssey has received highly positive reviews from critics, receiving a Metacritic rating of 83 out of 100 based on 19 reviews.\r\nThe miniseries won the 4th Critics' Choice Television Award for \"Best Reality Series\", with Tyson awarded for \"Best Reality Host\". The miniseries was also nominated for \"Outstanding Achievement in News and Information\" for the 30th TCA Awards and 12 Emmy Awards, including \"Outstanding Documentary or Nonfiction Series\". The program won the Emmy for \"Outstanding Writing for Nonfiction Programming\" and \"Outstanding Sound Editing for Nonfiction Programming (Single or Multi-Camera)\", and Silvestri won the Emmys for both \"Outstanding Original Main Title Theme Music\" and \"Outstanding Music Composition for a Series (Original Dramatic Score)\". The series won a 2014 Peabody Award within the Education category. In 2014, the Committee for Skeptical Inquiry (CSICOP) presented Cosmos with the Robert B. Balles Prize in Critical Thinking. \"Cosmos: A Spacetime Odyssey opened the eyes of a new generation to humanity's triumphs, its mistakes, and its astounding potential to reach unimagined heights.\"\r\nCriticism\r\nThe new miniseries has been criticized by some Christians and the religious right for some of the things stated during the show. Christian fundamentalists were upset that the scientific theories covered in the show opposed the Genesis creation narrative in the Bible. The Catholic League was upset over their claim that the science show smears Catholicism. A spokesman for the League noted how the show focused on Giordano Bruno, whom the Catholic Church turned over to secular authorities to be burnt at the stake for blasphemy, immoral conduct, practice of hermeticism, and heresy in matters of dogmatic theology, in addition to some of the basic doctrines of his philosophy and cosmology, and claimed that the show \"skipped Copernicus and Galileo—two far more consequential men in proving and disseminating the heliocentric theory\", further claiming that \"in their cases, the Church's role was much more complicated\".\r\nHome media release\r\nCosmos: A Spacetime Odyssey was released on Blu-ray and DVD on June 10, 2014 by 20th Century Fox Home Entertainment. The set contains all 13 episodes, plus an audio commentary on the first episode, and three featurettes: \"Celebrating Carl Sagan: A Selection from the Library of Congress Dedication\", \"Cosmos at Comic-Con 2013\" and \"Cosmos: A Spacetime Odyssey – The Voyage Continues\". Exclusive to the Blu-ray version is the interactive Cosmic Calendar.\r\nSequel series\r\nOn January 13, 2018, it was announced that another season titled Cosmos: Possible Worlds would debut on Fox and National Geographic channels. It is hosted by Neil deGrasse Tyson and executive produced by Ann Druyan, Seth MacFarlane, Brannon Braga, and Jason Clark. On November 7, 2019, it was announced that the sequel series would premiere on National Geographic on March 9, 2020, and will also premiere on Fox later that year.",
    "html": "<p>Cosmos: A Spacetime Odyssey is a 2014 American science documentary television series. The show is a follow-up to the 1980 television series Cosmos: A Personal Voyage, which was presented by Carl Sagan on the Public Broadcasting Service and is considered a milestone for scientific documentaries. This series was developed to bring back the foundation of science to network television at the height of other scientific-based television series and films. The show is presented by astrophysicist Neil deGrasse Tyson, who, as a young high school student, was inspired by Sagan. Among the executive producers are Seth MacFarlane, whose financial investment was instrumental in bringing the show to broadcast television, and Ann Druyan, a co-author and co-creator of the original television series and Sagan's wife. The show is produced by Brannon Braga, and Alan Silvestri composed the backing score.</p><p>The series loosely follows the same thirteen-episode format and storytelling approach that the original Cosmos used, including elements such as the \"Ship of the Imagination\" and the \"Cosmic Calendar\", but features information updated since the 1980 series, along with extensive computer-generated graphics and animation footage augmenting the narration.</p><p>The series premiered on March 9, 2014, simultaneously in the United States across ten 21st Century Fox networks. The remainder of the series aired on the Fox Network, with the National Geographic Channel rebroadcasting the episodes the next night with extra content. The series has been rebroadcast internationally in dozens of other countries by local National Geographic and Fox stations. The series concluded on June 8, 2014, with home media release of the entire series on June 10, 2014. Cosmos has been critically praised, winning several television broadcasting awards and a Peabody Award for educational content.</p><p>A sequel series, Cosmos: Possible Worlds, premiered on March 9, 2020, on National Geographic.</p><br/><h3>Production</h3><h4>Background</h4><p>The original 13-part Cosmos: A Personal Voyage first aired in 1980 on the Public Broadcasting Service, and was hosted by Carl Sagan. The show has been considered highly significant since its broadcast; David Itzkoff of The New York Times described it as \"a watershed moment for science-themed television programming\". The show has been watched by at least 400 million people across 60 countries, and until the 1990 documentary The Civil War, remained the network's highest rated program.</p><p>Following Sagan's death in 1996, his widow Ann Druyan, the co-creator of the original Cosmos series along with Steven Soter, and astrophysicist Neil deGrasse Tyson sought to create a new version of the series, aimed to appeal to as wide an audience as possible and not just to those interested in the sciences. They had struggled for years with reluctant television networks that failed to see the broad appeal of the show.</p><h4>Development</h4><p>Seth MacFarlane had met Druyan through Tyson at the 2008 kickoff event for the Science & Entertainment Exchange, a new Los Angeles office of the National Academy of Sciences, designed to connect Hollywood writers and directors with scientists. A year later, at a 2009 lunch in New York City with Tyson, MacFarlane learned of their interest to re-create Cosmos. He was influenced by Cosmos as a child, believing that Cosmos served to \" the gap between the academic community and the general public\". At the time MacFarlane told Tyson, \"I'm at a point in my career where I have some disposable income ... and I'd like to spend it on something worthwhile.\" MacFarlane had considered the reduction of effort for space travel in recent decades to be part of \"our culture of lethargy\". MacFarlane, who has several series on the Fox network, was able to bring Druyan to meet the heads of Fox programming, Peter Rice and Kevin Reilly, and helped secure the greenlighting of the show. MacFarlane admits that he is \"the least essential person in this equation\" and the effort is a departure from work he's done before, but considers this to be \"very comfortable territory for me personally\". He and Druyan have become close friends, and Druyan stated that she believed that Sagan and MacFarlane would have been \"kindred spirits\" with their respective \"protean talents\". In June 2012, MacFarlane provided funding to allow about 800 boxes of Sagan's personal notes and correspondences to be donated to the Library of Congress.</p><p>In a Point of Inquiry interview, Tyson discussed their goal of capturing the \"spirit of the original Cosmos\", which he describes as \"uplifting themes that called people to action\". Druyan describes the themes of wonder and skepticism they are infusing into the scripts, in an interview with Skepticality, \"In order for it to qualify on our show it has to touch you. It still has to be rigorously good science—no cutting corners on that. But then, it also has to be that equal part skepticism and wonder both.\" In a Big Picture Science interview, Tyson credits the success of the original series for the proliferation of science programming, \"The task for the next generation of Cosmos is a little bit different because I don't need to teach you textbook science. There's a lot of textbook science in the original Cosmos, but that's not what you remember most. What most people who remember the original series remember most is the effort to present science in a way that has meaning to you that can influence your conduct as a citizen of the nation and of the world—especially of the world.\" Tyson states that the new series will contain both new material and updated versions of topics in the original series, but primarily, will service the \"needs of today's population\". \"We want to make a program that is not simply a sequel to the first, but issues forth from the times in which we are making it, so that it matters to those who is this emergent 21st century audience.\" Tyson considered that recent successes of science-oriented shows like The Big Bang Theory and CSI: Crime Scene Investigation, along with films like Gravity, showed that \"science has become mainstream\" and expects Cosmos \"will land on hugely fertile ground\".</p><p>Tyson spoke about the \"love-hate relationship\" viewers had with the original series' Spaceship of the Imagination, but confirmed during production that they were developing \"vehicles of storytelling\". Tyson affirmed that defining elements of the original series, such as the Spaceship of the Imagination and the Cosmic Calendar with improved special effects, as well as new elements, would be present. Animation for these sequences was ultimately created by a team hand-picked by MacFarlane for the series. Kara Vallow developed and produced the animation, and the animation studio used was Six Point Harness in Los Angeles, California. The sound of the Spaceship of the Imagination, and sound design in general, was created by Rick Steele, who said of the show: \"Cosmos has been, by far, the most challenging show of my career.\" The updated Spaceship was designed to \"remain timeless and very simple\", according to MacFarlane, using the ceiling to project future events and the floor for those in the past, to allow Tyson, as the host, to \"take to the places that he's talking about\".</p><h4>Music</h4><p>All music is composed by Alan Silvestri.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><b><i>Cosmos: A Spacetime Odyssey</i> (Music from the Original TV Series) Vol. 1</b></caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Cosmos Main Title\"</td><td class=\"tracklist-length\">1:38</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Come With Me\"</td><td class=\"tracklist-length\">2:02</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"The Cosmos Is Yours\"</td><td class=\"tracklist-length\">6:25</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Virgo Supercluster\"</td><td class=\"tracklist-length\">4:06</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Multiverse\"</td><td class=\"tracklist-length\">2:11</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Giordano Bruno\"</td><td class=\"tracklist-length\">2:40</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Revelation of Immensity\"</td><td class=\"tracklist-length\">3:59</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"The Inquisition\"</td><td class=\"tracklist-length\">3:36</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"The Staggering Immensity of Time\"</td><td class=\"tracklist-length\">2:14</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Star Stuff\"</td><td class=\"tracklist-length\">4:14</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Chance Nature of Existence\"</td><td class=\"tracklist-length\">3:28</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"New Year's Eve\"</td><td class=\"tracklist-length\">3:50</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Our Journey Is Just Beginning\"</td><td class=\"tracklist-length\">3:04</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"2\" scope=\"row\"><span>Total length:</span></th><td>43:27</td></tr></tbody></table><p>All music is composed by Alan Silvestri.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><b><i>Cosmos: A Spacetime Odyssey</i> (Music from the Original TV Series) Vol. 2</b></caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"S.O.T.I.\"</td><td class=\"tracklist-length\">1:31</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"You and Me and Your Dog\"</td><td class=\"tracklist-length\">2:28</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Interspecies Partnership\"</td><td class=\"tracklist-length\">2:25</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Artificial Selection\"</td><td class=\"tracklist-length\">3:10</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Living in an Ice Age\"</td><td class=\"tracklist-length\">1:10</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Genetic Alphabet\"</td><td class=\"tracklist-length\">2:44</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Natural Selection\"</td><td class=\"tracklist-length\">3:06</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"Family Tree\"</td><td class=\"tracklist-length\">3:50</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"The Eye\"</td><td class=\"tracklist-length\">3:55</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Theory of Evolution\"</td><td class=\"tracklist-length\">2:53</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"The Permian Period\"</td><td class=\"tracklist-length\">5:12</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"Tartigrades\"</td><td class=\"tracklist-length\">1:54</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Titan\"</td><td class=\"tracklist-length\">2:59</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"The Story of My Life\"</td><td class=\"tracklist-length\">3:11</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"4 Billion Years of Evolution\"</td><td class=\"tracklist-length\">1:05</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"2\" scope=\"row\"><span>Total length:</span></th><td>41:33</td></tr></tbody></table><p>All music is composed by Alan Silvestri.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><b><i>Cosmos: A Spacetime Odyssey</i> (Music from the Original TV Series) Vol. 3</b></caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"All That Is or Ever Was or Ever Will Be\"</td><td class=\"tracklist-length\">1:35</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Halley's Efforts\"</td><td class=\"tracklist-length\">2:57</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"The Speed of Light\"</td><td class=\"tracklist-length\">3:01</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Physical State of the Stars\"</td><td class=\"tracklist-length\">3:18</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Ibn Al-Haytham\"</td><td class=\"tracklist-length\">2:10</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"The Way We Live Now\"</td><td class=\"tracklist-length\">3:04</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"The Lead Hearing\"</td><td class=\"tracklist-length\">3:34</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"August, 1684\"</td><td class=\"tracklist-length\">3:31</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"The Rules of Science\"</td><td class=\"tracklist-length\">3:05</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Mo Tze\"</td><td class=\"tracklist-length\">2:29</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"He Broke Through the Walls of Heaven\"</td><td class=\"tracklist-length\">2:51</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"The Ultimate Green Power\"</td><td class=\"tracklist-length\">4:51</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Endless Searching\"</td><td class=\"tracklist-length\">4:01</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Halley's Comet\"</td><td class=\"tracklist-length\">2:55</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"2\" scope=\"row\"><span>Total length:</span></th><td>43:22</td></tr></tbody></table><p>All music is composed by Alan Silvestri.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><b><i>Cosmos: A Spacetime Odyssey</i> (Music from the Original TV Series) Vol. 4</b></caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:100%\">Title</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"The Pale Blue Dot\"</td><td class=\"tracklist-length\">3:25</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Duck Soup?\"</td><td class=\"tracklist-length\">3:55</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Pat Patterson\"</td><td class=\"tracklist-length\">3:07</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"4.5 Billion Years Old\"</td><td class=\"tracklist-length\">4:11</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Sifting the Stars\"</td><td class=\"tracklist-length\">4:10</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Stellar Atmospheres\"</td><td class=\"tracklist-length\">4:34</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"What About Us?\"</td><td class=\"tracklist-length\">2:23</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"Adaptable Species\"</td><td class=\"tracklist-length\">2:25</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"Paris, 1878\"</td><td class=\"tracklist-length\">2:38</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Once There Was a World\"</td><td class=\"tracklist-length\">3:56</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Islands of Light\"</td><td class=\"tracklist-length\">2:01</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"Sacred Searching\"</td><td class=\"tracklist-length\">1:23</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Cosmos: A Spacetime Odyssey - DVD End Credits\"</td><td class=\"tracklist-length\">2:30</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"2\" scope=\"row\"><span>Total length:</span></th><td>40:38</td></tr></tbody></table><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#1D2951;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#1D2951\">Title</th><th scope=\"col\" style=\"background:#1D2951\">Directed by</th><th scope=\"col\" style=\"background:#1D2951\">Original air date</th><th scope=\"col\" style=\"background:#1D2951;width:7%\"><abbr title=\"Production\">Prod.</abbr><br>code</th><th scope=\"col\" style=\"background:#1D2951;width:10%\">US viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Standing Up in the Milky Way</span>\"</td><td style=\"text-align:center\"><span>Brannon Braga</span></td><td style=\"text-align:center\">March 9, 2014</td><td id=\"pc101\" rowspan=\"1\" style=\"text-align:center\">101</td><td style=\"text-align:center\">5.77</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #1D2951\"><div class=\"thumb tright\"></div><p>Tyson opens the episode to reflect on the importance of Sagan's original <i>Cosmos</i>, and the goals of this series. He introduces the viewer to the \"Ship of the Imagination\", the show's narrative device to explore the universe's past, present, and future. Tyson takes the viewer to show where Earth sits in the scope of the <span>known universe</span>, defining the Earth's \"address\" within the <span>Virgo Supercluster</span>. Tyson explains how humanity has not always seen the universe in this manner, and describes the hardships and persecution of <span>Renaissance Italian</span> <span>Giordano Bruno</span> in challenging the prevailing <span>geocentric model</span> held by the <span>Catholic Church</span>. To show Bruno's <i>vision</i> of the cosmic order he uses an animated adaptation of the <span>Flammarion engraving</span>, a 19th century illustration that has now become a common meme for the revealing of the mysteries of the Universe.</p>The episode continues onto the scope of time, using the concept of the <span>Cosmic Calendar</span> as used in the original series to provide a metaphor for this scale. The narration describes how if the <span>Big Bang</span> occurred on January 1, all of humankind's recorded history would be compressed into the last few seconds of the last minute on December 31. Tyson concludes the episode by recounting how Sagan inspired him as a student as well as his other contributions to the scientific community.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Some of the Things That Molecules Do</span>\"</td><td style=\"text-align:center\"><span>Bill Pope</span></td><td style=\"text-align:center\">March 16, 2014</td><td id=\"pc102\" rowspan=\"1\" style=\"text-align:center\">102</td><td style=\"text-align:center\">4.95</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #1D2951\"><div class=\"thumb tright\"></div><p>The episode covers several facets of the origin of life and <span>evolution</span>. Tyson describes both <span class=\"mw-redirect\">artificial selection</span> via <span>selective breeding</span>, using the example of humankind's domestication of wolves into dogs, and <span>natural selection</span> that created species like polar bears. Tyson uses the Ship of the Imagination to show how <span>DNA</span>, <span class=\"mw-redirect\">genes</span>, and <span>mutation</span> work, and how these led to the diversity of species as represented by the <span>Tree of life</span>, including how complex organs such as the <span>eye</span> came about as a common element.</p>Tyson describes <span>extinction</span> of species and the five great <span>extinction events</span> that wiped out numerous species on Earth, while some species, such as the <span>tardigrade</span>, were able to survive and continue life. Tyson speculates on the possibility of life on other planets, such as Saturn's moon, <span>Titan</span>, as well as how <span>abiogenesis</span> may have originated <span>life on Earth</span>. The episode concludes with an animation from the original <i>Cosmos</i> showing the evolution of life from a single cell to humankind today.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>When Knowledge Conquered Fear</span>\"</td><td style=\"text-align:center\">Brannon Braga</td><td style=\"text-align:center\">March 23, 2014</td><td id=\"pc103\" rowspan=\"1\" style=\"text-align:center\">103</td><td style=\"text-align:center\">4.25</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #1D2951\"><div class=\"thumb tright\"></div> Tyson describes how <span>pattern recognition</span> manifested in early civilization as using <span>astronomy</span> and <span>astrology</span> to predict the passing of the seasons, including how the passage of a <span>comet</span> was often taken as an omen. Tyson then explains that the origin of comets only became known in the 20th century due to the work of <span>Jan Oort</span> and his hypothesis of the <span>Oort cloud</span>.<p>Tyson then relates the collaboration between <span>Edmond Halley</span> and <span>Isaac Newton</span> in the last part of the 17th century in <span>Cambridge</span>. The collaboration would result in the publication of <i><span>Philosophiæ Naturalis Principia Mathematica</span></i>, the first major work to describe the laws of physics in mathematical terms, despite objections and claims of plagiarism from <span>Robert Hooke</span> and financial difficulties of the <span class=\"mw-redirect\">Royal Society of London</span>. Tyson explains how this work challenged the prevailing notion that God had planned out the heavens, but would end up influencing many factors of modern life, including <span class=\"mw-redirect\">space flight</span>.</p>Tyson describes Halley's contributions based on Newton's work, including determining <span>Earth's distance to the Sun</span>, the <span>motion of stars</span> and predicting the orbit of then-unnamed <span>Halley's Comet</span> using Newton's laws. Tyson contrasts these scientific approaches to understanding the galaxy compared to what earlier civilizations had done, and considers this advancement as humankind's first steps into exploring the universe. The episode ends with an animation of the Milky Way and <span>Andromeda</span> galaxies' <span>merging</span> based on the principles of Newton's laws.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>A Sky Full of Ghosts</span>\"</td><td style=\"text-align:center\">Brannon Braga</td><td style=\"text-align:center\">March 30, 2014</td><td id=\"pc105\" rowspan=\"1\" style=\"text-align:center\">105</td><td style=\"text-align:center\">3.91</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #1D2951\"><div class=\"thumb tright\"></div><p>Tyson begins the episode by explaining the nature of the <span>speed of light</span> and how much of what is seen of the observable universe is from light emanated from billions of years in the past. Tyson further explains how modern astronomy has used such analyses via <span>deep time</span> to identify the <span>Big Bang</span> event and the age of the universe.</p><p>Tyson proceeds to describe how the work of <span>Isaac Newton</span>, <span>William Herschel</span>, <span>Michael Faraday</span>, and <span>James Clerk Maxwell</span> contributed to understanding the nature of <span class=\"mw-redirect\">electromagnetic waves</span> and <span class=\"mw-redirect\">gravitational force</span>, and how this work led towards <span>Albert Einstein</span>'s <span class=\"mw-redirect\">Theory of Relativity</span>, that the speed of light is a fundamental constant of the universe and gravity can be seen as distortion of the fabric of space-time. Tyson describes the concept of <span>dark stars</span> as postulated by <span>John Michell</span> which are not visible but detectable by tracking other stars trapped within their <span class=\"mw-redirect\">gravity wells</span>, an idea Herschel used to discover <span>binary stars</span>.</p><p>Tyson then describes the nature of <span>black holes</span>, their enormous gravitational forces that can even capture light, and their discovery via <span>X-ray sources</span> such as <span>Cygnus X-1</span>. Tyson uses the Ship of Imagination to provide a postulate of the warping of <span>spacetime</span> and <span>time dilation</span> as one enters the <span>event horizon</span> of the black hole, and the possibility that these may lead to other points within our universe or others, or even time travel. Tyson ends on noting that Herschel's son, <span>John</span> would be inspired by his father to continue to <span>document the known stars</span> as well as contributions towards <span>photography</span> that play on the same nature of deep time used by astronomers.</p>Animated sequences in this episode feature caricatures of William and John Herschel; <span>Patrick Stewart</span> provided the voice for William in these segments.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Hiding in the Light</span>\"</td><td style=\"text-align:center\">Bill Pope</td><td style=\"text-align:center\">April 6, 2014</td><td id=\"pc104\" rowspan=\"1\" style=\"text-align:center\">104</td><td style=\"text-align:center\">3.98</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #1D2951\"><div class=\"thumb tright\"></div><p>This episode explores the <span>wave theory of light</span> as studied by humankind, noting that light has played an important role in scientific progress, with such early experiments from over 2000 years ago involving the <span>camera obscura</span> by the Chinese philosopher <span>Mozi</span>. Tyson describes the work of the 11th century Arabic scientist <span>Ibn al-Haytham</span>, considered to be one of the first to postulate on the nature of light and optics leading to the concept of the <span>telescope</span>, as well as one of the first researchers to use the <span>scientific method</span>.</p>Tyson proceeds to discuss the nature of light as discovered by humankind. Work by <span>Isaac Newton</span> using <span>diffraction</span> through <span>prisms</span> demonstrated that light was composed of the <span>visible spectrum</span>, while findings of <span>William Herschel</span> in the 19th century showed that light also consisted of <span>infrared</span> rays. <span>Joseph von Fraunhofer</span> would later come to discover that by magnifying the spectrum of visible light, gaps in the spectrum would be observed. These <span>Fraunhofer lines</span> would later be determined to be caused by the absorption of light by <span>electrons</span> in moving between <span>atomic orbitals</span> (in the show illustrated by the <span>Bohr model</span>) when it passed through atoms, with each atom having a characteristic signature due to the <span>quantum nature</span> of these orbitals. This since has led to the core of <span>astronomical spectroscopy</span>, allowing astronomers to make observations about the composition of stars, planets, and other stellar features through the spectral lines, as well as observing the motion and expansion of the universe, and the hypothesized existence of <span>dark matter</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Deeper, Deeper, Deeper Still</span>\"</td><td style=\"text-align:center\">Bill Pope</td><td style=\"text-align:center\">April 13, 2014</td><td id=\"pc106\" rowspan=\"1\" style=\"text-align:center\">106</td><td style=\"text-align:center\">3.49</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #1D2951\"><div class=\"thumb tright\"></div><p>This episode looks to the nature of the cosmos on the micro and atomic scales, using the Ship of the Imagination to explore these realms. Tyson describes some of the micro-organisms that live within a dew drop, demonstrating <span>parameciums</span> and <span>tardigrades</span>. He proceeds to discuss how plants use <span>photosynthesis</span> via their <span class=\"mw-redirect\">chloroplasts</span> to convert sunlight into chemical reactions that convert carbon dioxide and water into oxygen and energy-rich sugars. Tyson then discusses the nature of molecules and atoms and how they relate to the evolution of species. He uses the example set forth by <span>Charles Darwin</span> postulating the existence of the long-tongued <span class=\"mw-redirect\">Morgan's sphinx moth</span> based on the nature of the <span>comet orchid</span> with pollen far within the flower. He further demonstrates that scents from flowers are used to trigger <span class=\"mw-redirect\">olfactory centers in the brain</span>, stimulating the mind to threats as to aid in the survival of the species.</p>Tyson narrates how two Greek philosophers contributed to our understanding of science. <span class=\"mw-redirect\">Thales</span> was among the first thinkers to examine a \"universe governed by the order of natural laws that we could actually figure out,\" and <span>Democritus</span> postulated that all matter was made up of combinations of atoms in a large number of configurations. He then describes how <span>carbon</span> forms the basic building block for life on Earth due to its unique chemical nature. Tyson explains the basic atomic structure of <span>protons</span>, <span>neutrons</span>, and <span class=\"mw-redirect\">electrons</span>, and the process of <span>nuclear fusion</span> that occurs in most stars that can overcome the <span>electrostatic forces</span> that normally keeps atoms from touching each other. He then discusses the existence of <span>neutrinos</span> that are created by these nuclear processes, and that typically pass through all matter, making them virtually undetectable. He explains how subterranean water pool facilities lined with special detectors like the <span>Super-Kamiokande</span> are used to detect neutrinos when they collide with water molecules, and how neutrinos from supernova <span>SN 1987A</span> in the <span>Large Magellanic Cloud</span> were detected three hours before the <span>photons</span> of light from the explosion were observed due to the neutrinos' ability to pass through matter of the dying star. Tyson concludes by noting that there are neutrinos from the <span>Big Bang</span> still existing in the universe but due to the nature of light, there is a \"wall of infinity\" that cannot be observed beyond.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>The Clean Room</span>\"</td><td style=\"text-align:center\">Brannon Braga</td><td style=\"text-align:center\">April 20, 2014</td><td id=\"pc107\" rowspan=\"1\" style=\"text-align:center\">107</td><td style=\"text-align:center\">3.74</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #1D2951\"><div class=\"thumb tright\"></div><p>This episode is centered around how science, in particular the work of <span>Clair Patterson</span> (voiced in animated sequences by <span>Richard Gere</span>) in the middle of the 20th century, was able to determine the <span class=\"mw-redirect\">age of the Earth</span>. Tyson first describes how the Earth was formed from the coalescence of matter some millions of years after the formation of the Sun, and while scientists can examine the formations in <span>rock stratum</span> to date some geological events, these can only trace back millions of years. Instead, scientists have used the debris from meteor impacts, such as the <span>Meteor Crater</span> in Arizona, knowing that the material from such meteors coming from the <span>asteroid belt</span> would have been made at the same time as the Earth.</p><p>Tyson then outlines the work Patterson did as a graduate under his adviser <span>Harrison Brown</span> to provide an accurate count of lead in <span>zircon</span> particles from Meteor Crater, and to work with similar results being collected by <span>George Tilton</span> on uranium counts; with the established <span>half-life</span> of uranium's <span>radioactive decay</span> to lead, this would be used to estimate the age of the Earth. Patterson found that his results were contaminated by lead from the ambient environment, compared to Tilton's results, and required the construction of the first ultra-high <span>cleanroom</span> to remove all traces of environmental lead. With these clean results, Patterson was able to estimate the age of the Earth to 4.5 billion years.</p>Tyson goes on to explain that Patterson's work in performing lead-free experiments directed him to investigate the sources for lead. Tyson notes how lead does not naturally occur at Earth's surface but has been readily mined by humans (including the <span>Roman Empire</span>), and that <span>lead is poisonous to humans</span>. Patterson examined the levels of lead in the common environment and in deeper parts of  the oceans and <span>Antarctic</span> ice, showing that lead had only been brought to the surface in recent times. He would discover that the higher levels of lead were from the use of <span>tetraethyllead</span> in leaded gasoline, despite long-established claims by <span>Robert A. Kehoe</span> and others that this chemical was safe. Patterson would continue to campaign against the use of lead, ultimately resulting in government-mandated restrictions on the use of lead. Tyson ends by noting that similar work by scientists continues to be used to help alert humankind to other fateful issues that can be identified by the study of nature.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Sisters of the Sun</span>\"</td><td style=\"text-align:center\">Brannon Braga</td><td style=\"text-align:center\">April 27, 2014</td><td id=\"pc108\" rowspan=\"1\" style=\"text-align:center\">108</td><td style=\"text-align:center\">3.66</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #1D2951\"><div class=\"thumb tright\"></div><p>This episode provides an overview of the composition of stars, and their fate in billions of years. Tyson describes how early humans would identify stars via the use of <span>constellations</span> that tied in with various myths and beliefs, such as the <span>Pleiades</span>. Tyson describes the work of <span>Edward Charles Pickering</span> to capture the spectra of multiple stars simultaneously, and the work of the <span>Harvard Computers or \"Pickering's Harem\"</span>, a team of women researchers under Pickering's mentorship, to catalog the spectra. This team included <span>Annie Jump Cannon</span>, who developed the <span>stellar classification</span> system, and <span>Henrietta Swan Leavitt</span>, who discovered the means to measure the distance from a star to the Earth by its spectra, later used to identify other galaxies in the universe. Later, this team included <span>Cecilia Payne</span>, who would develop a good friendship with Cannon; Payne's thesis based on her work with Cannon was able to determine the composition and temperature of the stars, collaborating with Cannon's classification system.</p>Tyson then explains the lifecycle of stars, being borne out from <span>interstellar clouds</span>. He explains how stars like the <span>Sun</span> keep their size due to the conflicting forces of gravity that pulls the gases in, and the expansion from escaping gases from the fusion reactions at its core. As the Sun ages, it will grow hotter and brighter to the point where the balance between these reactions will fail, causing the Sun to first expand into a <span>red giant</span>, and then collapse into a <span>white dwarf</span>, the collapse limited by <span>the atomic forces</span>. Tyson explains how larger stars may form even more collapsed forms of matter, creating <span>novas</span> and <span>supernovas</span> depending on their size and leading to <span>pulsars</span>. Massive stars can collapse into <span>black holes</span>. Tyson then describes that stars can only be so large, using the example of <span>Eta Carinae</span> which is considered an unstable solar mass that could become a <span>hypernova</span> in the relatively near future. Tyson ends describing how all matter on Earth is the same stuff that stars are made of, and that light and energy from the stars is what drives life on Earth.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>The Lost Worlds of Planet Earth</span>\"</td><td style=\"text-align:center\">Brannon Braga</td><td style=\"text-align:center\">May 4, 2014</td><td id=\"pc110\" rowspan=\"1\" style=\"text-align:center\">110</td><td style=\"text-align:center\">4.08</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #1D2951\"><div class=\"thumb tright\"></div><p>This episode explores the <span>palaeogeography</span> of Earth over millions of years, and its impact on the development of life on the planet. Tyson starts by explaining that the <span>lignin</span>-rich trees evolved in the <span>Carboniferous</span> period about 300 million years ago, were not edible by species at the time and would instead fall over and become carbon-rich <span>coal</span>. Some 50 million years later, near the end of the <span>Permian</span> period, volcanic activity would burn the carbonaceous matter, releasing carbon dioxide and acidic components, creating a sudden <span>greenhouse gas</span> effect that warmed the oceans and <span>released methane from the ocean beds</span>, all leading towards the <span>Permian–Triassic extinction event</span>, killing 90% of the species on Earth.</p><p>Tyson then explains the nature of <span>plate tectonics</span> that would shape the landmasses of the world. Tyson explains how scientists like <span>Abraham Ortelius</span> hypothesized the idea that land masses may have been connected in the past, <span>Alfred Wegener</span> who hypothesized the idea of a super-continent <span>Pangaea</span> and <span>continental drift</span> despite the prevailing idea of flooded land-bridges at the time, and <span>Bruce C. Heezen</span> and <span>Marie Tharp</span> who discovered the <span>Mid-Atlantic Ridge</span> that supported the theory of plate tectonics. Tyson describes how the landmasses of the Earth lay atop the <span>mantle</span>, which moves due to the motion and heat of the Earth's <span class=\"mw-redirect\">outer</span> and <span class=\"mw-redirect\">inner core</span>.</p>Tyson moves on to explain the asteroid impact that initiated the <span>Cretaceous–Paleogene extinction event</span>, leaving small mammals as the dominant species on Earth. Tyson proceeds to describe more recent geologic events such as the formation of the <span>Mediterranean Sea</span> due to the breaking of the natural dam at the <span>Strait of Gibraltar</span>, and how the geologic formation of the <span>Isthmus of Panama</span> broke the free flow of the Atlantic Ocean into the Pacific, causing large-scale climate change such as turning the bulk of Africa from lush grasslands into arid plains and further influencing evolution towards tree-climbing mammals. Tyson further explains how the influence of other planets in the Solar System have small effects on the <span>Earth's rotation</span> and <span>axial tilt</span>, creating the various <span>ice ages</span>, and how these changes influenced early human's nomadic behavior. Tyson concludes the episode by noting how Earth's landmasses are expected to change in the future and postulates what may be the next great extinction event.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>The Electric Boy</span>\"</td><td style=\"text-align:center\">Bill Pope</td><td style=\"text-align:center\">May 11, 2014</td><td id=\"pc109\" rowspan=\"1\" style=\"text-align:center\">109</td><td style=\"text-align:center\">3.46</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #1D2951\"><div class=\"thumb tright\"></div><p>This episode provides an overview of the nature of <span>electromagnetism</span>, as discovered through the work of <span>Michael Faraday</span>. Tyson explains how the idea of another force of nature, similar to gravitational forces, had been postulated by Isaac Newton before. Tyson continues on Faraday, coming from poor beginnings, would end up becoming interested in studying <span>electricity</span> after reading books and seeing lectures by <span>Humphry Davy</span> at the <span>Royal Institution</span>. Davy would hire Faraday after seeing extensive notes he had taken to act as his secretary and lab assistant.</p><p>After Davy and chemist <span>William Hyde Wollaston</span> unsuccessfully tried to build on <span>Hans Christian Ørsted</span>'s discovery of the electromagnetic phenomena to harness the ability to create motion from electricity, Faraday was able to create his own device to create the first <span>electric motor</span> by applying electricity aligned along a magnet. Davy, bitter over Faraday's breakthrough, put Faraday on the task of improving the quality of high-quality optical glass, preventing Faraday from continuing his research. Faraday, undeterred, continued to work in the Royal Institution, and created the <span>Christmas Lectures</span> designed to teach science to children. Following Davy's death, Faraday returned to full time efforts studying electromagnetism, creating the first <span class=\"mw-redirect\">electrical generator</span> by inserting a magnet in a coil of wires.</p>Tyson continues to note that despite losing some of his mental capacity, Faraday concluded that electricity and magnetism were connected by unseen fields, and postulated that light may also be tied to these forces. Using a sample of the optical glass that Davy had him make, Faraday discovered that an applied magnetic field could affect the <span class=\"mw-redirect\">polarization</span> of light passing through the glass sample (a <span class=\"mw-redirect\">dielectric material</span>), leading to what is called the <span>Faraday effect</span> and connecting these three forces. Faraday postulated that these fields existed across the planet, which would later be called <span>Earth's magnetic field</span> generated by the rotating molten iron <span class=\"mw-redirect\">inner core</span>, as well as the phenomena that caused the planets to rotate around the Sun. Faraday's work was initially rejected by the scientific community due to his lack of mathematical support, but <span>James Clerk Maxwell</span> would later come to rework Faraday's theories into the <span>Maxwell's equations</span> that validated Faraday's theories. Their combined efforts created the basis of science that drives the principles of modern communications today.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep11\" style=\"text-align:center\">11</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>The Immortals</span>\"</td><td style=\"text-align:center\">Brannon Braga</td><td style=\"text-align:center\">May 18, 2014</td><td id=\"pc111\" rowspan=\"1\" style=\"text-align:center\">111</td><td style=\"text-align:center\">3.24</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #1D2951\"><p>This episode covers how life may have developed on Earth and the possibility of life on other planets. Tyson begins by explaining how the human development of writing systems enabled the transfer of information through generations, describing how <span>Princess Enheduanna</span> ca. 2280 BC would be one of the first to sign her name to her works, and how <span>Gilgamesh</span> collected stories, including that of <span>Utnapishtim</span> documenting a <span>great flood</span> comparable to the story of <span>Noah's Ark</span>. Tyson explains how <span>DNA</span> similarly records information to propagate life, and postulates theories of how DNA originated on Earth, including <span>evolution</span> from a shallow tide pool, or from the <span>ejecta</span> of meteor collisions from other planets. In the latter case, Tyson explains how comparing the composition of the <span>Nakhla meteorite</span> in 1911 to results collected by the <span>Viking program</span> demonstrated that material from Mars could transit to Earth, and the ability of some <span class=\"mw-redirect\">microbes</span> to survive the harsh conditions of space. With the motions of solar systems through the galaxy over billions of years, life could conceivably propagate from planet to planet in the same manner.</p>Tyson then moves on to consider if life on other planets could exist. He explains how <span>Project Diana</span> performed in the 1940s showed that radio waves are able to travel in space, and that all of humanity's broadcast signals continue to radiate into space from our planet. Tyson notes that projects have since looked for similar signals potentially emanating from other solar systems. Tyson then explains that the development and lifespan of extraterrestrial civilizations must be considered for such detection to be realized. He notes that civilizations can be wiped out by cosmic events like supernovae, natural disasters such as the <span>Toba disaster</span>, or even self-destruct through war or other means, making probability estimates difficult. Tyson describes how <span>elliptical galaxies</span>, in which some of the oldest <span>red dwarf</span> stars exist, would offer the best chance of finding established civilizations. Tyson concludes that human intelligence properly applied should allow our species to avoid such disasters and enable us to migrate beyond the Earth before the Sun's eventual transformation into a <span>red giant</span>.  Princess Enheduanna's animation is modeled on CNN's <span>Christiane Amanpour</span>, who also did Enheduanna's voice.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep12\" style=\"text-align:center\">12</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>The World Set Free</span>\"</td><td style=\"text-align:center\">Brannon Braga</td><td style=\"text-align:center\">June 1, 2014</td><td id=\"pc112\" rowspan=\"1\" style=\"text-align:center\">112</td><td style=\"text-align:center\">3.52</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #1D2951\"><div class=\"thumb tright\"></div><p>This episode explores the nature of the <span>greenhouse effect</span> (discovered by <span>Joseph Fourier</span> and <span>Svante Arrhenius</span>), and the evidence demonstrating the existence of <span class=\"mw-redirect\">global warming</span> from humanity's influence. Tyson begins by describing the long-term history of the planet Venus; based on readings from the <span>Venera</span> series of probes to the planet, the planet once had an ocean and an atmosphere, but due to the release of <span>carbon dioxide</span> from <span class=\"mw-redirect\">volcanic eruptions</span>, the <span>runaway greenhouse effect</span> on Venus caused the surface temperatures to increase and boiled away the oceans.</p><p>Tyson then notes the delicate nature of the amount of <span>carbon dioxide in the atmosphere</span> can influence Earth's <span>climate</span> due to the greenhouse effect, and that levels of carbon dioxide have been increasing since the start of the 20th century. Evidence has shown this to be from humankind's <span>consumption</span> of <span>oil</span>, coal, and <span>gas</span> instead of from volcanic eruptions due to the <span>isotopic signature</span> of the carbon dioxide. The increase in carbon dioxide has led to an increase in temperatures, in turn leading to <span class=\"mw-redirect\">positive feedback loops</span> of the melting polar ice caps and dethawing of the <span>permafrost</span> to increase carbon dioxide levels.</p>Tyson then notes that humans have discovered means of harvesting <span>solar power</span>, such as <span>Augustin Mouchot</span>'s solar-driven motor in the 19th century, and <span>Frank Shuman</span>'s solar-based steam generator in the 1910s. Tyson points out that in both cases, the economics and ease of using cheap coal and oil caused these inventions to be overlooked at the time. Today, solar and wind-power systems would be able to collect enough solar energy from the sun easily. Tyson then compares the motivation for switching to these cleaner forms of energy to the efforts of the <span class=\"mw-redirect\">Space race</span> and emphasizes that it is not too late for humanity to correct its course.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep13\" style=\"text-align:center\">13</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Unafraid of the Dark</span>\"</td><td style=\"text-align:center\"><span>Ann Druyan</span></td><td style=\"text-align:center\">June 8, 2014</td><td id=\"pc113\" rowspan=\"1\" style=\"text-align:center\">113</td><td style=\"text-align:center\">3.09</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #1D2951\"><div class=\"thumb tright\"></div><p>Tyson begins the episode by noting how the <span class=\"mw-redirect\">destruction of the Library of Alexandria</span> lost much of humanity's knowledge to that point.  He then contrasts on the strive for humanity to continue to discover new facts about the universe and the need to not close off further discovery.</p><p>Tyson then proceeds to describe the discovery of <span class=\"mw-redirect\">cosmic rays</span> by <span class=\"mw-redirect\">Victor Hess</span> through high-altitude balloon trips, where radiation increased the farther one was from the surface. <span>Swiss</span> <span>Astronomer</span> <span>Fritz Zwicky</span>, in studying <span class=\"mw-redirect\">supernovae</span>, postulated that these cosmic rays originated from these events instead of electromagnetic radiation. Zwicky would continue to study supernovae, and by looking at <span>standard candles</span> that they emitted, estimated the movement of the galaxies in the universe. His calculations suggested that there must be more mass in the universe than those apparent in the observable galaxies, and called this <span>dark matter</span>. Initially forgotten, Zwicky's theory was confirmed by the work of <span>Vera Rubin</span>, who observed that the rotation of stars at the edges of observable galaxies did not follow expected rotational behavior without considering dark matter. This further led to the proposal of <span>dark energy</span> as a viable theory to account for the universe's increasing rate of expansion.</p><p>Tyson then describes the interstellar travel, using the two <span>Voyager</span> probes. Besides the abilities to identify several features on the planets of the Solar System, <i>Voyager I</i> was able to recently demonstrate the existence of the Sun's variable <span>heliosphere</span> which helps buffer the Solar System from <span>interstellar winds</span>. Tyson describes Carl Sagan's role in the Voyager program, including creating the <span>Voyager Golden Record</span> to encapsulate humanity and Earth's position in the universe, and convincing the program directors to have <i>Voyager I</i> to take a picture of Earth from beyond the orbit of Neptune, creating the image of the <i><span>Pale Blue Dot</span></i>. Tyson concludes the series by emphasizing <span>Sagan's message</span> on the human condition in the vastness of the cosmos, and to encourage viewers to continue to explore and discover what else the universe has to offer.</p>The series concludes with the empty-seated Ship of the Imagination leaving Earth and traveling through space as Tyson looks on from planet Earth.</td></tr></tbody></table><br/><h3>Cast</h3><ul><li>Neil deGrasse Tyson Himself / Host</li><li>Carl Sagan as Himself (archive footage)</li><li>Peter Emshwiller as the voice of George Tilton</li><li>Piotr Michael as the voice of Edmund Muskie</li><li>Seth MacFarlane as the voice of Giordano Bruno</li><li>John Steven Rocha as the voice of Robert Bellarmine</li><li>Paul Telfer as the voice of an angry scholar</li><li>Michael Chochol as the voice of Jan Oort</li><li>Kirsten Dunst as the voice of Cecilia Payne-Gaposchkin</li><li>Cary Elwes as the voice of Edmond Halley and Robert Hooke</li><li>Richard Gere as the voice of Clair Patterson</li><li>Jonathan Morgan Heit as the voice of John Herschel</li><li>Martin Jarvis as the voice of Humphry Davy</li><li>Tom Konkle as the voice of Samuel Pepys</li><li>Marlee Matlin as the voice of Annie Jump Cannon</li><li>Alfred Molina as the voice of Ibn al-Haytham</li><li>Heiko Obermoller as the voice of Hermann Einstein</li><li>Julian Ovenden as the voice of Michael Faraday</li><li>Nadia Rochelle Pfarr as the voice of Malala Yousafzai</li><li>Enn Reitel as the voice of Albert Einstein</li><li>Wesley Salter as the voice of James Clerk Maxwell</li><li>Amanda Seyfried as the voice of Marie Tharp</li><li>Alexander Siddig as the voice of Isaac Newton</li><li>André Sogliuzzo as the voice of Christopher Wren and Weichelberger</li><li>Patrick Stewart as the voice of William Herschel</li><li>Oliver Vaquer as the voice of Joseph von Fraunhofer</li><li>Julie Wittner as the voice of Sarah Faraday</li><li>Marc Worden as the voice of Harrison Brown</li></ul><br/><h3>Broadcast</h3><p>In August 2011, the show was officially announced for primetime broadcast in the spring of 2014. The show is a co-production of Druyan's Cosmos Studios, MacFarlane's Fuzzy Door Productions, and National Geographic Channel; Druyan, MacFarlane, Cosmos Studios' Mitchell Cannold, and director Brannon Braga are the executive producers.</p><p>Fox's CEO Kevin Reilly considered that the show would be a risk and outside the network's typical programming, but that \"we believe this can have the same massive cultural impact that the original series delivered,\" and committed the network's resources to the show. The show would first be broadcast on Fox, re-airing the same night on the National Geographic Channel.</p><p>In Canada, it was broadcast simultaneously on Global, National Geographic Channel and Nat Geo Wild. A preview of the show's first episode was aired for student filmmakers at the White House Student Film Festival on February 28, 2014.</p><p>Cosmos premiered simultaneously in the US across ten Fox networks: Fox, FX, FXX, FXM, Fox Sports 1, Fox Sports 2, National Geographic Channel, Nat Geo WILD, Nat Geo Mundo, and Fox Life. According to Fox Networks, this was the first time that a TV show was set to premiere in a global simulcast across their network of channels.</p><p>The Fox network broadcast averaged about 5.8 million viewers in Nielsen's affiliate-based estimates for the 9 o'clock hour Sunday, as well as a 2.1 rating/5 share in adults 18-49. The under-50 audience was roughly 60% men. Viewing on other networks raised these totals to 8.5 million and a 2.9 rating in the demo, according to Nielsen.</p><br/><h3>Reception</h3><h4>Critical reception</h4><p>Cosmos: A Spacetime Odyssey has received highly positive reviews from critics, receiving a Metacritic rating of 83 out of 100 based on 19 reviews.</p><p>The miniseries won the 4th Critics' Choice Television Award for \"Best Reality Series\", with Tyson awarded for \"Best Reality Host\". The miniseries was also nominated for \"Outstanding Achievement in News and Information\" for the 30th TCA Awards and 12 Emmy Awards, including \"Outstanding Documentary or Nonfiction Series\". The program won the Emmy for \"Outstanding Writing for Nonfiction Programming\" and \"Outstanding Sound Editing for Nonfiction Programming (Single or Multi-Camera)\", and Silvestri won the Emmys for both \"Outstanding Original Main Title Theme Music\" and \"Outstanding Music Composition for a Series (Original Dramatic Score)\". The series won a 2014 Peabody Award within the Education category. In 2014, the Committee for Skeptical Inquiry (CSICOP) presented Cosmos with the Robert B. Balles Prize in Critical Thinking. \"Cosmos: A Spacetime Odyssey opened the eyes of a new generation to humanity's triumphs, its mistakes, and its astounding potential to reach unimagined heights.\"</p><h4>Criticism</h4><p>The new miniseries has been criticized by some Christians and the religious right for some of the things stated during the show. Christian fundamentalists were upset that the scientific theories covered in the show opposed the Genesis creation narrative in the Bible. The Catholic League was upset over their claim that the science show smears Catholicism. A spokesman for the League noted how the show focused on Giordano Bruno, whom the Catholic Church turned over to secular authorities to be burnt at the stake for blasphemy, immoral conduct, practice of hermeticism, and heresy in matters of dogmatic theology, in addition to some of the basic doctrines of his philosophy and cosmology, and claimed that the show \"skipped Copernicus and Galileo—two far more consequential men in proving and disseminating the heliocentric theory\", further claiming that \"in their cases, the Church's role was much more complicated\".</p><br/><h3>Home media release</h3><p>Cosmos: A Spacetime Odyssey was released on Blu-ray and DVD on June 10, 2014 by 20th Century Fox Home Entertainment. The set contains all 13 episodes, plus an audio commentary on the first episode, and three featurettes: \"Celebrating Carl Sagan: A Selection from the Library of Congress Dedication\", \"Cosmos at Comic-Con 2013\" and \"Cosmos: A Spacetime Odyssey – The Voyage Continues\". Exclusive to the Blu-ray version is the interactive Cosmic Calendar.</p><br/><h3>Sequel series</h3><p>On January 13, 2018, it was announced that another season titled Cosmos: Possible Worlds would debut on Fox and National Geographic channels. It is hosted by Neil deGrasse Tyson and executive produced by Ann Druyan, Seth MacFarlane, Brannon Braga, and Jason Clark. On November 7, 2019, it was announced that the sequel series would premiere on National Geographic on March 9, 2020, and will also premiere on Fox later that year.</p><br/>"
  },
  "errorMessage": ""
}