{
  "imDbId": "tt7259746",
  "title": "Queer Eye",
  "fullTitle": "Queer Eye (TV Series 2018– )",
  "type": "TVSeries",
  "year": "2018",
  "items": [
    {
      "username": "sohn717",
      "userUrl": "https://www.imdb.com/user/ur8251240",
      "reviewLink": "https://www.imdb.com/review/rw4068115",
      "warningSpoilers": false,
      "date": "19 February 2018",
      "rate": "10",
      "helpful": "323 out of 345 found this helpful.",
      "title": "all the negative reviews have something in common.",
      "content": "The small handful of negative reviews I've read seem to take issue with Jonathan's flamboyancy, but a lot of these critics are self-proclaimed gay men who have a problem with \"negative gay stereotypes.\" I'm here to tell you there is nothing innately negative about flamboyancy other than the fact that our society deemed all things associated with femininity as inferior. In other words, those reviewers are projecting their own self-hate and internalized homophobia onto this show, and their reviews reflects their own baggage, NOT the quality of the show. So what if Jonathan is a bit extra? If you can't learn to find him endearing, admire his unapologetic courage, or appreciate how he really rounds out the spectrum of masculinity displayed on the cast, you won't see how much of an essential part he is to the show's theme of acceptance in the diversity of people.That aside, the design transformations are aesthetically on point, incredibly tasteful and thoughtfully custom-tailored to the hero subjects. And, the best part is, the show has a lot of heart. It is uplifting and motivating--it transcends outer beauty as it promotes self-care, self-respect, self-confidence and self-worth, but also love and acceptance in a toxic culture. It's a feel-good without the escapism which makes for a cathartic viewing experience."
    },
    {
      "username": "adamsandel",
      "userUrl": "https://www.imdb.com/user/ur82336280",
      "reviewLink": "https://www.imdb.com/review/rw7723656",
      "warningSpoilers": false,
      "date": "5 January 2022",
      "rate": "9",
      "helpful": "13 out of 14 found this helpful.",
      "title": "This show just keeps getting better",
      "content": "As entertaining as the original was, the new version is even better - and it gets better with each season.Aside from the laugh out loud moments, and genuine warmth that permeates each episode, the overwhelming feeling that the viewer gets from the Fab Five (individually and collectively) is kindness.While many reality shows focus on the least appealing aspects of human nature, Queer Eye focuses on the best."
    },
    {
      "username": "rebeckaflygare",
      "userUrl": "https://www.imdb.com/user/ur102534463",
      "reviewLink": "https://www.imdb.com/review/rw4843074",
      "warningSpoilers": false,
      "date": "11 May 2019",
      "rate": "10",
      "helpful": "32 out of 39 found this helpful.",
      "title": "THANK YOU!",
      "content": "Jonathan Ness makes every gray or sad day shine bright like the sun. He alone is worth giving the show ten stars. But all five of this heart warming, kind, smart, handsome and caring guys make pure magic out if this show. Me and my ten year old daughter always watch this together, and we smile, cry, laugh, hug and cry again. We have been through a lot and this show is like medicine for our souls. THANK YOU!"
    },
    {
      "username": "zel_jee",
      "userUrl": "https://www.imdb.com/user/ur99754469",
      "reviewLink": "https://www.imdb.com/review/rw4687318",
      "warningSpoilers": false,
      "date": "26 February 2019",
      "rate": "10",
      "helpful": "47 out of 54 found this helpful.",
      "title": "God Bless Gays",
      "content": "Everyone that has a negative opinion or thinking of the LGBT community...watch this. I'm a Christian and my Jesus never once told me to hate on gays. They are genuine and real...more than most ppl I know anyways!"
    },
    {
      "username": "li0904426",
      "userUrl": "https://www.imdb.com/user/ur28425280",
      "reviewLink": "https://www.imdb.com/review/rw7585817",
      "warningSpoilers": false,
      "date": "26 November 2021",
      "rate": "10",
      "helpful": "15 out of 18 found this helpful.",
      "title": "Definitely worth watching it!!!",
      "content": "Please disregard the bad comments and watch just one episode, if you don't like it, switch to another series.As for me, it's inspirational, it tackled some of my issues and above it all, it made me feel much better. Definitely worth watching it!!!"
    },
    {
      "username": "henryshear",
      "userUrl": "https://www.imdb.com/user/ur89269798",
      "reviewLink": "https://www.imdb.com/review/rw5224711",
      "warningSpoilers": false,
      "date": "30 October 2019",
      "rate": "9",
      "helpful": "17 out of 23 found this helpful.",
      "title": "Unexpected and Surprisingly Emotional!",
      "content": "I was referred to this show by an individual very important to me and was deeply surprised by how much I loved it. There is such a therapeutic aspect to the show and it talks about important modern world issues such as racism, gun control and of course homophobia.Each member of the Fab Five is amazing because each one is able to have deep, meaningful conversations with someone they are attempting to help. The Fab Five have experienced addiction, homelessness and horrible pressures from their families. The show gives me so much hope that there are actually human beings who can be kind and care for others in a sincere way.I thought I would hate the show, but I always feel lighter after watching it. I highly suggest that you try it out. Please watch it!!!"
    },
    {
      "username": "felipeaugum",
      "userUrl": "https://www.imdb.com/user/ur69303863",
      "reviewLink": "https://www.imdb.com/review/rw4061007",
      "warningSpoilers": false,
      "date": "13 February 2018",
      "rate": "10",
      "helpful": "136 out of 148 found this helpful.",
      "title": "Not expected.",
      "content": "Usually I research a lot before I watch a movie or a show, but I pick this show randomly. And I gotta say: this is the best thing I've watched in a LONG time. I've wondering why I was so blowed away by this (and I'm a straight guy) and I realise it's because it is real. Of course there are some unnatural scenes, like extrapolation or disconfort in front of the cameras, and whatever, but The Fab Five are not professional actors, they are themselves doing and living what they believe, and the guys chosen are real people, working their dreams and fears in between the scenes. I laughed, I wondered, I felt alive watching this (and I even cry). Wonderful job to everyone involved in the show. Thank you."
    },
    {
      "username": "robert_farrimond",
      "userUrl": "https://www.imdb.com/user/ur22874331",
      "reviewLink": "https://www.imdb.com/review/rw4058375",
      "warningSpoilers": false,
      "date": "10 February 2018",
      "rate": "9",
      "helpful": "35 out of 43 found this helpful.",
      "title": "Fun, emotional and binge-worthy!",
      "content": "Not being too old when the original season aired, I was unfamiliar with the concept of this show, so when I saw all 8 episodes had been added to Netflix I had no idea what to expect. I was so pleasantly surprised.The show is life-affirming and emotional. Whilst at times the guys seem a little too intrusive and border on being overly judgemental, they win me, and the people they're there to help, over with their charm, friendship and emotional support. Their chemistry and friendship brings a smile to my face and really is magic. The way they allowed others and themselves to open up was a privilege to see, and I have come away from each episode with a smile on my face. Definitely worth a watch, the first episode with Tom had me beaming, sobbing and awwing. A true delight."
    },
    {
      "username": "Avwillfan89",
      "userUrl": "https://www.imdb.com/user/ur22066568",
      "reviewLink": "https://www.imdb.com/review/rw6011754",
      "warningSpoilers": false,
      "date": "20 August 2020",
      "rate": "7",
      "helpful": "17 out of 24 found this helpful.",
      "title": "Sometimes it's OK not to be OK",
      "content": "Although the show is very uplifting and is pushing to be inclusive in all areas, I do find sometimes the guys can be a little intrusive and displaying quite a bit of toxic positivity at times. While they certainly mean well and don't try to change anyone - instead enhancing all aspects of the people's lives to make them more confident and think for themselves rather than constantly helping other people - I cannot help but think what it would be like for me to go on that show.As someone who is depressed, has Aspergers and does not own a lot of money, I don't exactly have much in common with so many of the contestants that appear on this show. I'm also not all together a very nice person, nor can I pretend to be happy all the time.I had recently read Jonathan Van Ness's autobiography - and the way he presents himself in that book is almost completely different to the one in the show. He is a cheater, a drug abuser, a depressive, and someone so starved for his independence and for money he had once resorted to prostitution - which made him profoundly miserable. He's also very passionate about his goals, very honest, loving, funny and grateful. And all of that is brilliant.Someone should tell these guys that it's OK not to be OK - that flaws are good, that messing up is alright and that we all human and different in the end. They honestly should strive for the notion at perfectibility doesn't exist. Not all this crap about 'You're gorgeous, you're fab, you're a queen... bla bla bla'."
    },
    {
      "username": "itsactuallyamanda",
      "userUrl": "https://www.imdb.com/user/ur55960521",
      "reviewLink": "https://www.imdb.com/review/rw4056657",
      "warningSpoilers": false,
      "date": "8 February 2018",
      "rate": "10",
      "helpful": "28 out of 43 found this helpful.",
      "title": "Powerful show that shows true power of LGBT community!",
      "content": "Queer Eye to me, the first time I saw it I thought it was some sort of cheesy documentary but was I wrong. Queer Eye is such an inspirational show that takes 5 men of the LGBT community who have a mission to help change other men's lives. The show has a good blend of inspiration and comedy at the same time as the guys have a very upbeat and happy personality. Now would I say some of it is kinda stupid? yes. But, stupid can be good right? And in this case it sure is. I would say out of all netflix original series, this would be on my top 5 no doubt. If you need a show with a lot of heart and comedy, Queer Eye is for sure one to watch."
    },
    {
      "username": "trimblecali",
      "userUrl": "https://www.imdb.com/user/ur71384678",
      "reviewLink": "https://www.imdb.com/review/rw4911837",
      "warningSpoilers": false,
      "date": "4 June 2019",
      "rate": "10",
      "helpful": "14 out of 20 found this helpful.",
      "title": "My favorite show ever",
      "content": "This show is amazing. Never seen a show so positive and endearing. I could watch a million episodes and never get tired of it"
    },
    {
      "username": "shirlone",
      "userUrl": "https://www.imdb.com/user/ur134654371",
      "reviewLink": "https://www.imdb.com/review/rw7714882",
      "warningSpoilers": false,
      "date": "2 January 2022",
      "rate": "10",
      "helpful": "7 out of 9 found this helpful.",
      "title": "love it",
      "content": "I am not gay and I love this show. It has it all. It's light, funny, drama, If you tried hard enough you could find something you like about the show, I love the makeovers and the way these guys talk to people. It's just amazing. Forget the negative reviews on this show and watch it for yourself."
    },
    {
      "username": "juliesarasecondo",
      "userUrl": "https://www.imdb.com/user/ur85250346",
      "reviewLink": "https://www.imdb.com/review/rw4056739",
      "warningSpoilers": false,
      "date": "8 February 2018",
      "rate": "10",
      "helpful": "82 out of 95 found this helpful.",
      "title": "On point!",
      "content": "I fell in love with this show and the 5 guys the very first episode. I cannot wait for the next season! Everything is on point; the sense of humour, the taste, the discussions, the characters and I love the respect for everyone involved. A really touching and entertaining show! Give it a try :)"
    },
    {
      "username": "mariabrandybuck",
      "userUrl": "https://www.imdb.com/user/ur32769020",
      "reviewLink": "https://www.imdb.com/review/rw4205921",
      "warningSpoilers": false,
      "date": "17 June 2018",
      "rate": "10",
      "helpful": "46 out of 54 found this helpful.",
      "title": "A true ray of sunshine in a bleak world",
      "content": "Considering how dark and bleak everything can seem at times, Queer Eye has such a true, heartwarming quality about it that is hard to come by. The inclusivity, diversity and the respect for all of it is amazing. The way this group reaches out to not only expand people's views on what, for an example, masculinity is and can be, but also to expand their own mindsets about things, is truly priceless. This is a show of diversity, kindness and spreading joy, and I love every bit of it.There's not a single episode that would've left me dry-eyed and there's not a single person I would not recommend this to. All in all, Queer Eye is 100% a show that is current and important, and definitely worth the watch."
    },
    {
      "username": "tilokaudaman",
      "userUrl": "https://www.imdb.com/user/ur93895656",
      "reviewLink": "https://www.imdb.com/review/rw6113712",
      "warningSpoilers": false,
      "date": "21 September 2020",
      "rate": "10",
      "helpful": "8 out of 11 found this helpful.",
      "title": "Positive and wise",
      "content": "I have to admit I'm not a reality show kind of guy but this show has really got me hooked. It was recommended to me by my sister who recommended it to me on a day I was depressed and feeling negative about myself. After watching the first episode, I found I started to feel better. The hosts are all enlightened and have something to teach us in every episode as well spinning a joyful and positive message we can all use right now. I recommend it with all of my heart."
    },
    {
      "username": "lyly1313",
      "userUrl": "https://www.imdb.com/user/ur21194869",
      "reviewLink": "https://www.imdb.com/review/rw4056375",
      "warningSpoilers": false,
      "date": "8 February 2018",
      "rate": "",
      "helpful": "38 out of 46 found this helpful.",
      "title": "It's everything we hoped for!",
      "content": "The show is sweet, funny, charming, and the best part is the dialogue being had about race, religion and mutual respect, is what's most important. We loved it!"
    },
    {
      "username": "fabianavancetto",
      "userUrl": "https://www.imdb.com/user/ur10071376",
      "reviewLink": "https://www.imdb.com/review/rw4056600",
      "warningSpoilers": false,
      "date": "8 February 2018",
      "rate": "10",
      "helpful": "33 out of 43 found this helpful.",
      "title": "Super fun and touching!",
      "content": "The minute the show started it brought all the good memories I had with the previous show. I had so much fun watching it! The cast seems to get along great and they are all super fun and excited in helping these guys - despite what I read about ir here on making fun of them first. Guys tease each other all the time and at any moment they said mean things like fat or ugly... I bing watched it and I can't wait for season 2!!! P.S. I laughed so hard with Jonathan and the mattress scene! He is the new Carlson only a little bit more outrageous! loved it!"
    },
    {
      "username": "jandriod2012",
      "userUrl": "https://www.imdb.com/user/ur56224928",
      "reviewLink": "https://www.imdb.com/review/rw4561016",
      "warningSpoilers": false,
      "date": "4 January 2019",
      "rate": "10",
      "helpful": "10 out of 16 found this helpful.",
      "title": "Charming and entertaining",
      "content": "I approached this reboot with some apprehension as I was a big fan of the original series and had a great fondness for the Fab 5. I didn't need to worry however; it took a bit of time to warm to the new Fab 5, but I think this is a good series in the making. The new characters are interesting and I think the more we get to know them the better it will be. I also like to see how the makeovers affect not only the recipients of them, but also the individuals in the group. I think there is a risk of the 'lessons learned' approach becoming a bit heavy handed though, and hope the production team don't labour this too much. At a time when there is a lot of bile and hatred spewed out in the media, its refreshing to watch a programme which advocates acceptance and tolerance. The Fab 5 are so lovely, treating each participant with kindness and humour without putting them down or humiliating them in any way. I can't wait for the next series and look forward to getting to know each of the Fab 5 a lot better"
    },
    {
      "username": "gizemdetas",
      "userUrl": "https://www.imdb.com/user/ur84514683",
      "reviewLink": "https://www.imdb.com/review/rw4055884",
      "warningSpoilers": true,
      "date": "7 February 2018",
      "rate": "10",
      "helpful": "24 out of 33 found this helpful.",
      "title": "Good show to be honest",
      "content": "I like their style, and let's not judge Netflix on this since it is their first reality show! And I think they actually nailed it for a first one.This an unique show and I like that it's something different. I recommend watching it if you feel like you want to watch something casual yet fun"
    },
    {
      "username": "pamelathornton-56373",
      "userUrl": "https://www.imdb.com/user/ur78241922",
      "reviewLink": "https://www.imdb.com/review/rw4419913",
      "warningSpoilers": false,
      "date": "26 October 2018",
      "rate": "10",
      "helpful": "10 out of 13 found this helpful.",
      "title": "Why Be Sad About The Current State Of America When You Could Watch Queer Eyes",
      "content": "I've never watched a show before that has made me cry, learn about the importance of beard grooming and made me want to believe in humanity again. That was until I watch Queer Eye. The critics are right in saying that this is what the world needs right now. From fashion tips to encouraging words from mature, wise, funny, amazing gay men, this is what we've all been waiting for. I (almost) would like to describe this show as an ointment for sadness and tears. I watch an episode as often as possible because of the hope it gives me. I have never rated a movie about an eight but this show deserves, earned, a ten!"
    },
    {
      "username": "w-08323",
      "userUrl": "https://www.imdb.com/user/ur114791022",
      "reviewLink": "https://www.imdb.com/review/rw5605240",
      "warningSpoilers": false,
      "date": "4 April 2020",
      "rate": "8",
      "helpful": "8 out of 13 found this helpful.",
      "title": "Happiness can be infectious",
      "content": "Their greatest common denominator is their love of praise, praise and hugs. From the beginning of the transformation, you can hear them praising you all the time.Especially the kind of happy energy emanating from them, the self-confidence of dressing up themselves, the freedom of enjoying delicious food, the appeal is too strong.Five people put together, it's like a calorie bomb, and it can relieve depression in an instant."
    },
    {
      "username": "cristiadu",
      "userUrl": "https://www.imdb.com/user/ur26887035",
      "reviewLink": "https://www.imdb.com/review/rw5279204",
      "warningSpoilers": false,
      "date": "25 November 2019",
      "rate": "10",
      "helpful": "6 out of 8 found this helpful.",
      "title": "I love the way the show deals with its premise",
      "content": "This show doesn't really force specific styles or beauty standards while actively improving the appearance and self-esteem of those that participate in the program. That's remarkable I would say.I don't know if everything is agreed upon before, if this is entirely produced and not natural, but it does feel natural. I genuinely end up caring about them AND the people they are helping, which says a lot.I specially love Johnathan. I think a lot of the show spark comes from him having his moments, which I see some people don't like because of gay stereotypes but I feel that's just his personality, he is not forcing that, so it shouldn't be a problem (as being \"flamboyant\" is not supposed to be a bad thing in my pov, it's only bad if together with arrogance which Johnathan never has). Also, feels forced to say the show is perpetuating a gay stereotype by having just ONE of 5 gay men with this kind of personality."
    },
    {
      "username": "silverlve",
      "userUrl": "https://www.imdb.com/user/ur2424229",
      "reviewLink": "https://www.imdb.com/review/rw4345355",
      "warningSpoilers": false,
      "date": "18 September 2018",
      "rate": "9",
      "helpful": "7 out of 10 found this helpful.",
      "title": "This fabulous, wonderful, uplifting show.. ugh, I can't even!",
      "content": "I adored the first run of QE with the original crew but this new team is truly majestic. Now, at first Jonathan was a bit much with the overt femininity he presented with but I saw his realness and true self and he has won me over. I have not known many gay men who are at that level and I blame that for the initial hesitance. Now after several episodes and listening to his podcast (Getting curious) I see and understand his side of life. Antoni is a bunch of hot cuteness but he is pulls his worth in the kitchen, helping out the ones spice up their life (yes, intended pun LOL). Bobby has such good taste in how he sets up the interiors of places and I have yet to dislike any of the rebuilds, want to buy all his stuff. Tan breaks out a sassy English/Pakistani representation and scrapes the clouds with his never wilted pompadour cut, his style is as sharp as his intelligence. Karamo is a gift, yes, he's sexy but what's even better... he's smart, compassionate and throwing down the psychotherapist realness in the talks with folks, teaching without making anyone feel down. May this show be on for many seasons... there are lots of folks out there that need a touch of wonderful and caring in their lives and QE brings it!"
    },
    {
      "username": "unikorn-67905",
      "userUrl": "https://www.imdb.com/user/ur127613192",
      "reviewLink": "https://www.imdb.com/review/rw7134999",
      "warningSpoilers": false,
      "date": "17 July 2021",
      "rate": "4",
      "helpful": "11 out of 20 found this helpful.",
      "title": "Forced Joy. Pop Consumerism.",
      "content": "Some episodes are breezy casual fun and others are inspiring and sweet but it's just a bit too inauthentic, manufactured and forced for me.The friendship between the crew feels forced sometimes and some of the people being made over seemed like they're being forced into awkward or intimate moments.Yes, it's sweet and joyful but also kind of vapid and shallow. It's about objects, clothes and googled recipes, pretty wrapping paper over deep issues.Even though it's largely forced at least we get to see real everyday people, some with rich personalities, experiencing magic and their potential.If you're choosy about episodes and pick the more mellow few, it's okay."
    },
    {
      "username": "mach229",
      "userUrl": "https://www.imdb.com/user/ur54881409",
      "reviewLink": "https://www.imdb.com/review/rw4730402",
      "warningSpoilers": false,
      "date": "18 March 2019",
      "rate": "10",
      "helpful": "9 out of 12 found this helpful.",
      "title": "My Daughter Made Me Watch It",
      "content": "I had no interest in seeing the revamped version of Queer Eye which I assumed would be more of the same, and I see enough snarkiness on Twitter. Of course I was dead wrong as my huge fan daughter showed me. The warmth, love and respect the Fab Five show the weekly subject is life-affirming. I know that editing is showing me what it wants me to see but it apparently wants to show good people doing good things with joy and acceptance while allowing the very diverse group of guests learn to love themselves. Colorful, funny, kind and great design and clothing advice - what's not to like?"
    }
  ],
  "errorMessage": ""
}