{
  "imDbId": "tt2244495",
  "title": "The Eric Andre Show",
  "fullTitle": "The Eric Andre Show (TV Series 2012– )",
  "type": "TVSeries",
  "year": "2012",
  "items": [
    {
      "username": "diesixdie",
      "userUrl": "https://www.imdb.com/user/ur0577656",
      "reviewLink": "https://www.imdb.com/review/rw2614555",
      "warningSpoilers": false,
      "date": "21 May 2012",
      "rate": "8",
      "helpful": "79 out of 103 found this helpful.",
      "title": "Is This Comedy?",
      "content": "I'm not sure this is comedy. It presents itself as a talk show. The host, Eric Andre, seems to be trapped in the role. The show opens with Eric absolutely destroying the set. Within seconds, like in a bad dream the set magically reassembles itself and the show continues, the host, his defenses momentarily derailed declares, \"I'm dying\". There is something that appears to be comedy, but, all the while, the participants seem to be holding back a pent-up fear and generalized hostility, if not disorientation. The participants don't quite seem to be in control, and react to the hidden forces around them with horror. At one point, the show subjects Andre and his co-host to an insane game show, without warning, where Andre is drenched with scalding hot coffee after every question. We seem to be viewing some sort inescapable closed universe containing nothing but an endless slightly nightmarish talk show. It feels like a bad dream, half remembered. It feels like there's some unspeakable horror lurking just off-camera that the people on-stage can see, but, we can't, and they can only stay safe by pretending to ignore it.I like what the show is trying to do, even if it's more unsettling, then funny, much like \"Tim and Eric's Awesome Show, Great Job\", produced by the same production company. There's just something kind of compelling, here. More so than most of Adult Swim's live action shows. It'll be interesting to see where they go with this."
    },
    {
      "username": "loonatwok",
      "userUrl": "https://www.imdb.com/user/ur51221342",
      "reviewLink": "https://www.imdb.com/review/rw6901080",
      "warningSpoilers": false,
      "date": "10 May 2021",
      "rate": "10",
      "helpful": "16 out of 19 found this helpful.",
      "title": "FUNNNNNNNNNNY!",
      "content": "Eric Andre is responsible for some big laughs. I have tears streaming down my face as i write this review for the 7 ppl who will read it.Its not going to be most folks' cup of tea but for those who love the craziest most ridiculous stunts, pranks, jokes get ready to piss your pants. Eric would be proud."
    },
    {
      "username": "lycopodium-15410",
      "userUrl": "https://www.imdb.com/user/ur126795943",
      "reviewLink": "https://www.imdb.com/review/rw6324653",
      "warningSpoilers": false,
      "date": "30 November 2020",
      "rate": "10",
      "helpful": "22 out of 25 found this helpful.",
      "title": "A show about nothing",
      "content": "Arguably one of the most important comedies ever. For everyone saying that it has no meaning or reason- that's the point. Everything the character of Eric does is a complete opposite of the way we are told to live and behave. He strips naked in front of other people, destroys stuff, takes no interest in his guest. And yet, it creates an almost more human connection and experience than any other normal talk show could. Whilst other talk show hosts behave how is seen as 'acceptable' and 'correct', Eric does the opposite. He breaks down the barrier that talk shows create between the host and the audience, reaching to the primal instincts to just not care about anything. What was intended to just be the worst talk show ever ended up one of the most important comedies of all time."
    },
    {
      "username": "jaysonpullen",
      "userUrl": "https://www.imdb.com/user/ur51755208",
      "reviewLink": "https://www.imdb.com/review/rw4153766",
      "warningSpoilers": true,
      "date": "4 May 2018",
      "rate": "10",
      "helpful": "37 out of 46 found this helpful.",
      "title": "PIZZA NEVER ARRIVED",
      "content": "WTF BRO, I ORDERED AN EXTRA SUPREME, TWO DIET DOUBLE DEWS, WITH ANCHOVIES AND MY ORDER NEVER SHOWED UP. I DEMAND A REFUND AND EXTRA CREDIT FOR MORE OTHERWISE MY REVIEW WITH REMAIN UNCHANGED. DON'T EAT HERE."
    },
    {
      "username": "epicbrowniez",
      "userUrl": "https://www.imdb.com/user/ur113600061",
      "reviewLink": "https://www.imdb.com/review/rw6209380",
      "warningSpoilers": false,
      "date": "26 October 2020",
      "rate": "",
      "helpful": "11 out of 13 found this helpful.",
      "title": "One of the most hilarious shows and some of the best from adult swim",
      "content": "It's basically like a parody of talk shows mixed with borat if you seen borat you know what to expect but there is a lot of originality throughout this show."
    },
    {
      "username": "metaick",
      "userUrl": "https://www.imdb.com/user/ur60268120",
      "reviewLink": "https://www.imdb.com/review/rw5295411",
      "warningSpoilers": false,
      "date": "2 December 2019",
      "rate": "10",
      "helpful": "20 out of 27 found this helpful.",
      "title": "Either you get it or you don't",
      "content": "This show is genius and will only appeal to a certain audience. If thisnis your type of comedy then stap in and get ready for one heck of a ride! I binged these episodes whenever I've watched them and busted a lung laughing my ass off! The guests reactions on here and skits are next level!"
    },
    {
      "username": "Doctor-rockzo291",
      "userUrl": "https://www.imdb.com/user/ur35499017",
      "reviewLink": "https://www.imdb.com/review/rw2653923",
      "warningSpoilers": false,
      "date": "4 August 2012",
      "rate": "10",
      "helpful": "81 out of 97 found this helpful.",
      "title": "Great Show",
      "content": "I'd disregard taking any review into consideration from someone who says for Adult Swim to play more Family Guy and American Dad. This show is great, the comedy can be in your face or really subtle and witty at times. Eric Adre's skits are well thought out in my opinion, and Hannibal is one of the funniest co-hosts on any television show I've watched.The guests are great, the sketches in between the studio shots make me laugh harder than anything. Telling the Tea-Party that they \"forgot their masks\" was one of the greatest things I've seen on Adult Swim in awhile, and I've been watching since the beginning.TL;DR-At least give it a shot once, there's not one bad episode"
    },
    {
      "username": "ducreux",
      "userUrl": "https://www.imdb.com/user/ur35554735",
      "reviewLink": "https://www.imdb.com/review/rw2656924",
      "warningSpoilers": false,
      "date": "10 August 2012",
      "rate": "10",
      "helpful": "51 out of 67 found this helpful.",
      "title": "Another great absurd show from Adult Swim",
      "content": "I've been watching adult swim since I was a young buck and they've managed to surprise me once again by how far they can take comedy away from the norm. I didn't expect much after watching the commercials but after I gave it a try, I became addicted. It's unlike any talk show I've seen before, the discomfort and awkwardness in the guests is clearly visible, partly due to Hannibal standing behind them during interviews. The sketches are original and hilarious and the comedic timing of Eric Andre is amazing. This show is better than Family Guy or Robot Chicken by a mile. The interview with a grizzly bear is one of the funniest things I've ever seen in my life.Eric and Hannibal make a great comedic team, give this show a try."
    },
    {
      "username": "jambalulu",
      "userUrl": "https://www.imdb.com/user/ur86878276",
      "reviewLink": "https://www.imdb.com/review/rw4988992",
      "warningSpoilers": false,
      "date": "11 July 2019",
      "rate": "10",
      "helpful": "11 out of 15 found this helpful.",
      "title": "The best thing that has ever been made ever?",
      "content": "I would say that this is at least like the best comedy thing that has ever been made ever.. The unimaginable absurdity that constantly flows from the brains of Eric and Hannibal, the way that they constantly fool celebrities and troll them into a shocked and traumatic state, the ridiculousness of the stuff that they film out in the streets, and the random incoherent way in which it is all edited into a show.. it's just some of the most perfect, flawless comedic brilliance that a human mind can possibly conceive.. Watching the Eric Andre show really is like being hit by a suicide bomber of comedy, and once you start to feel like your'e fully getting an idea of what the show is actually about it just becomes funnier and funnier, as you understand more and more how it's not actually about anything, as literally anything can happen in this unexpected universe of madness that adult swim has allowed Eric Andre to build for us all.. I would honestly say that this is better than any sitcom, any movie, any other show\\book\\stand-up routine or anything else, literally nothing can make me laugh as hard as I do when I watch bits from the Eric Andre show."
    },
    {
      "username": "uzumakiharikari",
      "userUrl": "https://www.imdb.com/user/ur40189051",
      "reviewLink": "https://www.imdb.com/review/rw2741186",
      "warningSpoilers": false,
      "date": "22 January 2013",
      "rate": "8",
      "helpful": "32 out of 42 found this helpful.",
      "title": "masterful deconstruction of late-night talk shows",
      "content": "The Eric Andre show is a parody of every terrible art school party, every terrible noise show, and every stand-up act that was only laughable because of how bad it was. These flavors are combined to create a deconstruction of the talk/skit late-night show that occasionally ascends to brilliance.The sublime intro sequence begins slowly but rapidly advances in tempo as mr. andre destroys his set and clothes in an escalating fit of madness before, suddenly clothed again, sitting down exhausted. As a new curtain descends behind him and a fresh desk pushed in front of him the audience is left with the illusion that this act repeats week after week and the show is performed in the expanding refuse of previous sets."
    },
    {
      "username": "jukeboksi-52442",
      "userUrl": "https://www.imdb.com/user/ur68377409",
      "reviewLink": "https://www.imdb.com/review/rw3527128",
      "warningSpoilers": false,
      "date": "17 August 2016",
      "rate": "10",
      "helpful": "42 out of 55 found this helpful.",
      "title": "Catharsis over wasted years",
      "content": "You flip through channels and you've seen it all. Building suspense over the most worthless of things, only to not even deliver on what's promised. Story lines that get rehashed over and over until you know exactly what's gonna happen next, when and how. Obviously staged happenings acted poorly with stunted emotional growth. TV, it's nothing but mindless drivel.Tim, Eric and Doug Lussenhop share my hate for TV (even the whole of entertainment business) and what it has become, what it may have always been. If not hate, apathy. Now, they have a new tool in their box, to unleash their furious vision over and on viewers lost in the void of the remote: one Mr. Eric Andre, supported by Hannibal Buress mainly.TV being mindless drivel, a show that is purposefully and deliberately mindless drivel is the logical next step. No ground is broken here, references are all over the place, conclusions aim to disappoint, segments are filtered through low-brow running gags. If you let yourself get agitated, you have lost.I love the creators of this show for giving us this fine fifteen minutes ten times a year. This show lets you release all the pent-up anger you've built over the years over crappy, boring and never-ending drama, entertainment, sports and news. Release all the dread you realize over the time spent on watching screens with moving images and sound through-out time. Just, forget it all and linger in the actualization of the insane that is and envelopes this world. Anything can happen next and the beautiful part is: you cannot prepare for the future, just let it in.I love this show. It does not look to cater to anybody. It does not deceive you into viewing. It does not exploit your emotions or deeper needs. It is openly, honestly and proudly what it is and as such transcends all media. It might treat the viewer like crap, but if you can't take it, you deserved it.\"Hey, you're watching Bird Up! The WORST show on television!\""
    },
    {
      "username": "rajatbarman-80502",
      "userUrl": "https://www.imdb.com/user/ur68854041",
      "reviewLink": "https://www.imdb.com/review/rw3550481",
      "warningSpoilers": false,
      "date": "25 September 2016",
      "rate": "10",
      "helpful": "44 out of 59 found this helpful.",
      "title": "Worst Show Ever",
      "content": "I just finished watching 20 episodes of this show, I loved it. The show has great energy and insanity embedded in every frame, I recommend everyone to watch it with their families. Season 2 episode 10 had me doubt my sanity. The show is humorless, the host of this show \"Eric Andre\" keeps on vomiting and farting most of the time and that disgusting visual is supposed to be funny. The randomness and unpredictability of the show will keep you entertained, some bits are pure genius which can be observed only if you watch it with full attention. This show isn't for kids, and avoid seeing it with your parents/families at all costs. The show keeps repeating the same pattern, destruction of random things, crying, naked body, vomit, farts, emotional dramas, Sherlock, poems, piano, planets, Saturn, hawk and Obama. Overall the show is funny and hence humorless."
    },
    {
      "username": "krogchoi-69376",
      "userUrl": "https://www.imdb.com/user/ur65015846",
      "reviewLink": "https://www.imdb.com/review/rw6305811",
      "warningSpoilers": false,
      "date": "24 November 2020",
      "rate": "10",
      "helpful": "6 out of 8 found this helpful.",
      "title": "There is nothing like it",
      "content": "So many shows are labeled as comedy, yet don't even get a smile out of their audience. Well The Eric Andre Show delivers ! Some sequences had me in tears. Fans of absurd humor rejoice, this is a true gem. Note : This is clearly not for everyone. The show is as insane as it is hyper."
    },
    {
      "username": "alexanderjgt",
      "userUrl": "https://www.imdb.com/user/ur98533208",
      "reviewLink": "https://www.imdb.com/review/rw5133706",
      "warningSpoilers": false,
      "date": "21 September 2019",
      "rate": "9",
      "helpful": "7 out of 10 found this helpful.",
      "title": "Genius",
      "content": "The only talk show worth watching. Every episode is a hit"
    },
    {
      "username": "derekhill1594",
      "userUrl": "https://www.imdb.com/user/ur57255866",
      "reviewLink": "https://www.imdb.com/review/rw3145395",
      "warningSpoilers": false,
      "date": "21 December 2014",
      "rate": "10",
      "helpful": "26 out of 39 found this helpful.",
      "title": "Not only a great show, but a life changing one for the open mind.",
      "content": "I have never loved a TV show more than The Eric Andre Show. This show speaks to me so hard it's unreal.The main theme of the show is mental chaos. Eric is one crazy individual (like myself) who knows exactly how to grab people's souls, shake it around, and throw it back without hesitation. His actions are so subtle that he leaves his guests struck with all kinds of emotions. Hannibal, too, but he is a little more reserved about it.Before this show, I never really understood social norms (or at least how they were used in context). Growing up, I wasn't too much of a social kid, but only because I wasn't raised in a social environment. I was always interested in being social, however. Watching this show has made me realize something important. Social norms don't really apply to you if you have little to zero knowledge about them. For example, Eric goes out in public and makes a fool of himself. In reality, he's actually making YOU look like a fool. Eric doesn't give a crap how people view him, so, in his mind, he is not acting like a fool. In his mind, he is acting how Eric Andre would normally act, even if other people think he's totally lost it. He knows what to expect except everybody around him.The key message this show gives to the world is timeless: All of humanity is going to act how they want to act when they want to act and, overall, there is nothing you can do about it. You can't force people to act a certain way, especially if you care about that person/they care about you. Whatever is happening up top in THEIR head is out of YOUR control. Sally will always act like Sally and Joe-Bob will always act like Joe-Bob. A perfect example of this is at the very end of Season 1 Episode 10. Eric does a bit where he falls onto his knees on a busy sidewalk dressed as a homeless man, crying as he pretends to have lost all hope in himself as a person. The people around him BARELY react. A few people glance over at him, but that's it. Most people just walk past as if nothing is happening. Those people had no idea that he was faking it for a TV show, so those are AUTHENTIC REACTIONS. This shows a lot about the society we live in today. Even if you have hit rock bottom and are giving up hope completely, people don't give a damn, especially if they don't know you. What if that was a real-life situation? What if that \"homeless man\" really WAS completely giving up hope in himself and his last chance for relief was a stranger assisting him in some sort of way? The next option for a person like that would most likely be suicide. Do you know how good it could feel to supply happiness into a stranger in a random act of kindness? You'd never know unless you'd try."
    },
    {
      "username": "teteter2004",
      "userUrl": "https://www.imdb.com/user/ur36292677",
      "reviewLink": "https://www.imdb.com/review/rw2919086",
      "warningSpoilers": false,
      "date": "8 December 2013",
      "rate": "10",
      "helpful": "20 out of 28 found this helpful.",
      "title": "A breath of fresh air for adult swim, and TV in general",
      "content": "The past year Adult Swim has shown me nothing new or exciting, every show is either competing with Tim and Eric, or mimicking it. Although their style is genius it was gotten a little dry since the billion dollar movie. When i first saw the trailer for the Eric Andre show I was even more disappointed, ready for yet another tim and eric knock off. After watching the premier episode I felt as if I had never laughed before. Everything was unexpected, and completely over the top in a way that nobody has ever gotten close to. I never know what to expect, and the commercials for each episode have entirely no footage from the actual episode. The Eric Andre show refreshed the talk show vibe with original pranks, and a surprisingly deep layers of humor. One must watch each episode 3 or 4 times to really see everything they pack into it. What i'd really like to see is everything that doesn't air."
    },
    {
      "username": "anastasiacampbell-27771",
      "userUrl": "https://www.imdb.com/user/ur86591115",
      "reviewLink": "https://www.imdb.com/review/rw6018780",
      "warningSpoilers": false,
      "date": "22 August 2020",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "I don't think there's anything else like this on TV.",
      "content": "This show makes me think of a specific moment from Seinfeld (a show I personally find to be tepid, boring and milquetoast), where Jerry and some other guy were pitching a show about nothing to NBC.This show is basically a show about nothing. It's complete chaos and it's great. I cannot recommend this show enough."
    },
    {
      "username": "metaick",
      "userUrl": "https://www.imdb.com/user/ur60268120",
      "reviewLink": "https://www.imdb.com/review/rw5691099",
      "warningSpoilers": false,
      "date": "30 April 2020",
      "rate": "10",
      "helpful": "4 out of 6 found this helpful.",
      "title": "Hilarious and innovative",
      "content": "Original and great to watch while self medicating or intoxicated, or just into seriously wild and hilarious stuff. You'll know if it's your flavor after one episode. It will fell like genius or complete nonsense."
    },
    {
      "username": "liorkorobeynikov",
      "userUrl": "https://www.imdb.com/user/ur124439963",
      "reviewLink": "https://www.imdb.com/review/rw6450022",
      "warningSpoilers": false,
      "date": "6 January 2021",
      "rate": "8",
      "helpful": "3 out of 4 found this helpful.",
      "title": "Unique",
      "content": "The type of humor on the show isn't for everyone but I really am glad that it's out there.If you like this type of humor then this is the perfect show for you."
    },
    {
      "username": "georgegware",
      "userUrl": "https://www.imdb.com/user/ur120170800",
      "reviewLink": "https://www.imdb.com/review/rw5851407",
      "warningSpoilers": false,
      "date": "24 June 2020",
      "rate": "8",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Very Neish but if it's your thing it's your thing",
      "content": "Adult Swim is known for their randomness and that's what I love. Eric Andre takes this randomness to the extreme just by being crazy all the time, the only problem that I have is that I feel the guest stars do not play a big enough part and just kind of sit there acting confused"
    },
    {
      "username": "joehonaker",
      "userUrl": "https://www.imdb.com/user/ur3404323",
      "reviewLink": "https://www.imdb.com/review/rw2921660",
      "warningSpoilers": false,
      "date": "14 December 2013",
      "rate": "9",
      "helpful": "10 out of 18 found this helpful.",
      "title": "12 minutes of at Least a few big laughs",
      "content": "Eric's show is different and does a lot of out of the norm thing that end up giving the viewer a big laugh.In just 12 minutes you can expect at least 3 big big laughs. I normally watch them 5-6 at a time on the DVR when I'm in the mood. I love the destruction of the set and the shock value he does to his guests. The Maria Menounos episode was perfect \" Pick a person\" and when she finally picks a person, that person is immediately shot. Pure Genius! I love the band and Hannibal who is always funny. Everyone welcome James Van Der Beek, cut to a shot of the guest band leader vomiting, how could anyone not understand the genius of this show? I hope he keeps this show or gets a bigger one."
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw8540922",
      "warningSpoilers": false,
      "date": "13 September 2022",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Bonkers of silliness and ridiculous that is wonderful!",
      "content": "Been meaning to review/watch the rest of the series for awhile I figured why not and I forgot how enjoyable The Eric Andre Show is! Starts off with chaos with destroy multiple things around the set which is hilarious then eases into guests half are the right person and other ones not the famous actors. Sometimes hard to watch cause it's often weird but it's well worth it at least once in awhile. It's nice how short it is pretty simple and smooth this show is a lot of fun entertainment. I'm blown away by the ratings on IMDb of 8.6 that's way than better I would imagine I didn't realize so many liked the show; humor is always a wonderful experience even if it's in a ridiculous form! Hannibal Buress is so great too I love him in anything!"
    },
    {
      "username": "justindemus",
      "userUrl": "https://www.imdb.com/user/ur50570250",
      "reviewLink": "https://www.imdb.com/review/rw2958537",
      "warningSpoilers": false,
      "date": "10 February 2014",
      "rate": "10",
      "helpful": "27 out of 44 found this helpful.",
      "title": "this show is amazing, comedy for people who do not understand comedy, AVANT GARDE",
      "content": "PRETZELS IS THE SAMEDUE PROCESS AND THE COURT OF LAW AND ALL THAT LOOK AT MY SUIThaven't laughed this much since the first season of bob's burgersten lines, sch-men linesthis show is not for racists and/or conservativeseverything is well planned and a lot of people just don't get it. it has a constant charm of everything falling apart, yet it is meticulously crafted. Andre and Hannibal compliment each other well and one cannot predict what happens nextwhich is great."
    },
    {
      "username": "heryffernllsc",
      "userUrl": "https://www.imdb.com/user/ur86544181",
      "reviewLink": "https://www.imdb.com/review/rw4106091",
      "warningSpoilers": false,
      "date": "27 March 2018",
      "rate": "9",
      "helpful": "7 out of 11 found this helpful.",
      "title": "Pretty good stuff",
      "content": "Nothing can prepare you for this show. It is unlike anything else on tv. It may at first seem crude and immature to some people, and i will admit it takes a certain type of person to enjoy this show. If you are easily grossed out or prefer a sort of sophisticated sense of humor, then this isnt the show for you. That being said i think this show is great. It will get you to laugh at stuff you never thought you would laugh at. Its essentially a prank show, in the fact that it frames itself as a legit late night talk show and gets unsuspecting celebrities to come on, then proceeds to devolve into usually some gross stuff happening and Eric breaking his desk. You'll get to see your favorite celebrities like you've never seen them before, which is wierded out and having no idea what is going on. It is always interesting to see celebrities out of their comfort zones and their unfiltered reactions to stuff as well. I read a youtube comment that once said \"this show is like a fever dream\", and that pretty much sums the eric andre show up. If you're looking for something weird and different, i recommend this show."
    },
    {
      "username": "loki_mon",
      "userUrl": "https://www.imdb.com/user/ur47808047",
      "reviewLink": "https://www.imdb.com/review/rw5243428",
      "warningSpoilers": false,
      "date": "8 November 2019",
      "rate": "10",
      "helpful": "5 out of 8 found this helpful.",
      "title": "Very different, very brave",
      "content": "There is catharsis to be found in this utter sea of chaos. The trolling is completely harmless and fascinating, the reactions of the unknown to the sheer absurdism adds to the brilliance."
    }
  ],
  "errorMessage": ""
}