{
  "imDbId": "tt2244495",
  "title": "The Eric Andre Show",
  "fullTitle": "The Eric Andre Show (TV Series 2012– )",
  "type": "TVSeries",
  "year": "2012",
  "language": "en",
  "titleInLanguage": "The Eric Andre Show",
  "url": "https://en.wikipedia.org/wiki/The_Eric_Andre_Show",
  "plotShort": {
    "plainText": "The Eric Andre Show is an American sketch comedy television series which began airing on May 20, 2012. The show premiered on Cartoon Network's night-time programming block Adult Swim and is a parody of late night talk shows. The series is hosted by comedian Eric André and formerly co-hosted by fellow comedian Hannibal Buress and Blannibal (played by James Hazley). All episodes of the show have been directed by Kitao Sakurai and Andrew Barchilon. Gary Anthony Williams served as the announcer in the first season, being replaced by Tom Kane in the second season and Robert Smith from the third season onwards.\r\nA total of 55 episodes have aired over the course of six seasons. On December 31, 2012, The Eric Andre Show aired a 45-minute live New Year's special, titled The Eric Andre New Year's Eve Spooktacular. A second special, named Eric Andre Does Paris, aired on February 18, 2018.\r\nThe fifth season premiered on October 25, 2020. On May 18, 2022, Adult Swim announced the show had been renewed for a sixth season, which premiered on June 4, 2023.",
    "html": "<p>The Eric Andre Show is an American sketch comedy television series which began airing on May 20, 2012. The show premiered on Cartoon Network's night-time programming block Adult Swim and is a parody of late night talk shows. The series is hosted by comedian Eric André and formerly co-hosted by fellow comedian Hannibal Buress and Blannibal (played by James Hazley). All episodes of the show have been directed by Kitao Sakurai and Andrew Barchilon. Gary Anthony Williams served as the announcer in the first season, being replaced by Tom Kane in the second season and Robert Smith from the third season onwards.</p><p>A total of 55 episodes have aired over the course of six seasons. On December 31, 2012, The Eric Andre Show aired a 45-minute live New Year's special, titled The Eric Andre New Year's Eve Spooktacular. A second special, named Eric Andre Does Paris, aired on February 18, 2018.</p><p>The fifth season premiered on October 25, 2020. On May 18, 2022, Adult Swim announced the show had been renewed for a sixth season, which premiered on June 4, 2023.</p>"
  },
  "plotFull": {
    "plainText": "The Eric Andre Show is an American sketch comedy television series which began airing on May 20, 2012. The show premiered on Cartoon Network's night-time programming block Adult Swim and is a parody of late night talk shows. The series is hosted by comedian Eric André and formerly co-hosted by fellow comedian Hannibal Buress and Blannibal (played by James Hazley). All episodes of the show have been directed by Kitao Sakurai and Andrew Barchilon. Gary Anthony Williams served as the announcer in the first season, being replaced by Tom Kane in the second season and Robert Smith from the third season onwards.\r\nA total of 55 episodes have aired over the course of six seasons. On December 31, 2012, The Eric Andre Show aired a 45-minute live New Year's special, titled The Eric Andre New Year's Eve Spooktacular. A second special, named Eric Andre Does Paris, aired on February 18, 2018.\r\nThe fifth season premiered on October 25, 2020. On May 18, 2022, Adult Swim announced the show had been renewed for a sixth season, which premiered on June 4, 2023.\r\nPremise\r\nEach episode opens on the show's main set: a standard talk-show set-up with a desk, a chair, and some decor. The show's announcer declares \"Ladies and gentlemen, it's The Eric Andre Show!\" and the opening song begins to play. During this time, André runs onto set and destroys the backdrop, desk, and various furnishings around him. Once the song is completed, stagehands swiftly remove the broken furniture and replace it with identical pieces. Buress, the co-host, walks in at this time, usually to weak applause from the audience. André may then perform a monologue, incorporating dark comedy and surrealism. While he struggles to perform, his monologue usually turns defensive and aggressive as Buress derides him. The show will then typically be a mix of surreal celebrity interviews and short sketches, candid camera footage, and non sequiturs, usually focused on André's absurd behavior in regular settings.\r\nAt the end, a performer of some type plays over the ending credits. Ending performances are usually parodies of amateur acts common to public-access television, while other times they are real musicians playing their own songs with heavy twists, such as punk band Trash Talk playing while wearing volume-sensitive shock collars or a female opera singer performing while rapper Killer Mike serves as her hype man. Killer Mike also appeared in a later episode, performing a rap battle against rapper Action Bronson while the two rap battled while on treadmills. Mac DeMarco once played while André initiated a segment styled after Japanese game shows titled \"Attack DeMarco!\", in which numerous samurai began tormenting DeMarco. In one episode, comedian Rory Scovel had a cooking segment in which he increasingly got upset and destroyed his work station while rapper T-Pain sang the Star Spangled Banner and fired a gun in the air.\r\nAndré has expressed that each season of the show is shot with a unique style in mind, intended to be thematically cohesive while remaining distinct from other seasons. Season 1 stylistically follows the series pilot which was shot without studio backing on a limited budget, using vintage Ikegami cameras and a darkly lit set built in an abandoned bodega. For all subsequent seasons the show were filmed in high-definition and featured more modern late-night comedy talk show elements, including André's appearance in a formal gray suit. For season 3, André grew out and straightened his hair in imitation of the distinctive hairstyle of comedian Katt Williams and decorated the set with tropical plants, intending to give the season an upbeat feeling to audiences. In stark contrast, season 4 took place in a darkly lit setting reminiscent of the first season, where André wore a tuxedo and professed to have avoided bathing or grooming, and lost weight during production, dubbing this season the \"dystopian Eraserhead\" season. This season also featured a new house band. Countering season 4, André's season 5 set included a revamping of the set with more vibrant decorations and a green screen behind the curtain where guests come out. André himself shaved all of his body hair except for his eyebrows, wore inexpensive cologne, tanned his skin and gained weight throughout. For season 6, André had his hair slicked back and tied into a ponytail.\r\nGuest stars appear throughout the show, with a number of them being faked with impersonators or random people, including Jerry Seinfeld, Russell Brand, George Clooney, The Hulk, Beyonce, Arnold Schwarzenegger (portrayed by Bruce Vilanch on a mobility scooter), and Jay-Z. From season two onwards, more actual celebrities appeared, including musicians (Tyler, the Creator, Pete Wentz, Devendra Banhart, Killer Mike, Wiz Khalifa, T-Pain, George Corpsegrinder Fisher, Demi Lovato, Chance the Rapper, Mr. Muthafuckin' eXquire, Flying Lotus, Open Mike Eagle, Dave Koz, Mac DeMarco, 311), actors (Ryan Phillipe, Krysten Ritter, Dolph Lundgren, Jack Black, Aubrey Peeples, Jack McBrayer, James Van Der Beek, Chris Jericho, Seth Rogen, Macaulay Culkin), or 1980s/1990s television stars (Sinbad, Tatyana Ali, Lorenzo Lamas, Jodie Sweetin), although other guests have appeared, including television personality Lauren Conrad, talk show host Jimmy Kimmel, animation veteran John Kricfalusi, and porn star Asa Akira. The season 5 episode \"Blannibal Quits\" marked the final television appearance of the late actress Naya Rivera, who was pronounced dead from accidental drowning at the age of 33 on July 8, 2020.\r\nDevelopment\r\nEarly development\r\nThe show was partly influenced by Space Ghost Coast to Coast, a series that aired on Cartoon Network and later Adult Swim. André had said that prior to shooting the first season, he rewatched several episodes of it to \"absorb as much Space Ghost as could\". André also asked many questions of Adult Swim executive Mike Lazzo, the show's creator, who, according to André, had no interest in the old show. Other influences include Chris Farley’s talk show host character from Saturday Night Live, \"The Merv Griffin Show\" episode of Seinfeld, Jiminy Glick, Tom Green (who join in on destroying the set with André with an electric chainsaw in the second season's 10th episode, also André has done several interviews on his Tom Green Live web series), Da Ali G Show and Conan O'Brien.\r\nThe look of the show, according to co-director Andrew Barchilon was intended to mimic \"this iconic feeling that drove back to (early) Letterman and back to Carson.” Regarding the tone of the show, co-director Kitao Sakurai eschewed labelling the show as a spoof, saying in 2012: \"I think implies that we’re 100% dependent on the material that other, legitimate talk shows supply, that we’re just living off of that. I think it’s more of a deconstruction, an alternate reality talk show rather than a spoof. I think that the interviews that we have with real people and celebrities have their own value that goes beyond spoof\".\r\nPilot (2009)\r\nAndré described himself as being \"flat broke\" and \"scraping by doing commercials and random stand-up,\" including performing as a caveman for Geico, when he produced the pilot for The Eric Andre Show, known originally as Duh Air Ache On Dre Shoe.\r\nThe pilot was co-hosted with Hannibal Buress and was directed by Andrew Barchilon and Kitao Sakurai. It was filmed \"over a few days\" in an abandoned bodega in Brooklyn in 2009.\r\nAfter filming some man on the street segments, André ran out of money and couldn't afford an editor. Knowing that it would be too difficult to explain how to edit the \"slop pile of footage\", André took on the task himself, spending a year learning Final Cut. The pilot was then sent to \"a bunch of networks\" (including NBC and MTV) where it was rejected on at least one occasion for \"look a little cheap and public access-y\". Keith Crofford of Adult Swim said in 2013 that, on seeing the pilot, making the show \"was pretty much a no-brainer from there\".\r\nParts of the pilot were shown at San Diego Comic Con 2013, although it is unknown if the full panel has been recorded.\r\nProduction\r\nWriting team\r\nThe core writing cast of the show consists of André, the show's directorial team Andrew Barchilon and Kitao Sakurai, and producer, as well as \"Kraft Punk\" actor, Dan Curry. Series editor Doug Lussenhop joined the writing staff beginning with season two. Additionally, Hannibal Buress was a writer for the first three seasons of the show.\r\nThe other writers who contributed to more than one season are Eric Moneypenny and Tommy Blacha (seasons 1 and 2), Jesse Elias and Rory Scovel, who also appeared in the show as \"Chef Rory Scovel\" (seasons 2 and 4), and Heather Anne Campbell and Pat Regan, who had been working at the show since the first season (seasons 3 and 4).\r\nOther writers of note include Josh Fadem (season 1), Kevin Barnett and television producer Erica Oyama (season 2), Jon Daly, Ron Funches, Seth Morris, Brent Weinbach (season 3), Colton Dunn, Brett Gelman, Adam Pally, Jake Weisman, Hampton Yount (season 4) and Sarah Sherman (season 5).\r\nSeason 1 (2012)\r\nSeason 1 was filmed over the course of ten days, with the opening sequences all filmed together over two and a half days at the end of the shoot. At least twenty desks were broken while filming the first season and despite the desk being constructed of drywall to make it easier to break, André did suffer injuries during the season's production.\r\nFilming of the first season of the show saw André receive a large amount of creative freedom, but The Eric Andre Show did receive notes from \"Standards and Production\" at Adult Swim, particularly regarding suicide, drug use and insulting specific deities: André commented that \"I can curse out God, but I can't curse out Jesus\". In a 2012 interview, André described production difficulties when planning a scene where \"I shit so hard that my organs fall out of my anus\". Adult Swim had already flagged the sketch, writing to the show: \"He can shit so hard that organs fall out of his anus, but he can’t make it look like he’s intentionally doing it\".\r\nAnother scene planned, but not shot, for season 1 involved André jumping out of a manhole on the street wearing a prison uniform and handcuffs, yelling \"I'm free! I'm free!\" but André was concerned with \"get shot\" and when the show contacted the city, they were warned of \"toxic gasses in the sewer that you need special Hazmat suits for.\" A scene which would have featured Andrew Dice Clay performing as Andrew Nice Clay, a comedian whose punchlines always espouse positive feminist ideologies, was not filmed due to a scheduling conflict with Clay.\r\nGuests for season 1 included actor Dolph Lundgren. Celebrity impersonators included an actor portraying George Clooney and a character named Russell Brand played by actor Semere Etmet who André described as \" sweetest guy\". Co-directors Sakurai and Barchilon admitted that \"they entirely sure where Etmet came from and that he keeps showing up on set\".\r\nMan on the street segments included André hiding in a trash can to jump out and surprise people who used it (claiming they were the \"millionth person\" to use said can) and André visiting a Mensa convention, dressed in a complete suit of armor.\r\nCo-director Sakurai stated that during the filming of the first season, \"ironically the most angry and violent people we’ve got from things are like people at a Mensa convention, was physically attacked.\" Additionally, André was arrested and spent time in jail during production of season 1 when he attended a town hall meeting in a frat-boy getup and announced his plans to put \"beer in the water fountains and cameras in the girls’ locker room\".\r\nAndré, who was also known for his role as Mark Reynolds on the ABC sitcom Don't Trust the B---- in Apartment 23 when The Eric Andre Show launched, was warned by ABC network executives not to mention the series on The Eric Andre Show, as they did not want to create an association between the two. According to André, several cast and crew members on Don't Trust the B---- in Apartment 23 were not even aware of the existence of Adult Swim when explaining to them The Eric Andre Show. Don't Trust the B---- in Apartment 23 was cancelled in January 2013 and in April 2013, it was announced that The Eric Andre Show had been renewed for another season, with a few of his former co-stars from the ABC show to make appearances as guests.\r\nThe Eric Andre New Years Eve Spooktacular (2012)\r\nOn December 31, 2012, Adult Swim aired a 27-minute Halloween-themed New Years special titled The Eric Andre New Years Eve Spooktacular. André commented in 2016 that filming on a live-to-tape format is \"kind of difficult\" and \"I don't think I'd do that again. I think you can fit in more jokes per square inch in something that's heavily edited\".\r\nSeason 2 (2013)\r\nWith season 2, The Eric Andre Show changed to an HD camera setup, a new set design, and a new announcer, whilst André began wearing a suit. (Indeed, the show was reintroduced as \"The NEW Eric Andre Show\" for the opening of the season premiere, the HD change being revealed through a blurry picture of the new set becoming clearer just before the episode began.) Because of the difficulties with gaining consent under California's regulations, some of the impromptu and hidden camera sketches had to be re-recorded in New York City. André also admitted to using tactics on real celebrities to make them visibly uncomfortable during the taping without informing them, such as putting \"old, rotten clams under their seat before they come out, or heat ducts in their seats so they're just sweltering.\" The studio space is not airconditioned. André said this was because the studio's airconditioning was too loud to run while filming, but that it had the added effect of making the guests feel uncomfortable, in line with the show's theme.\r\nGuests for season 2 included Vivica A. Fox, during whose interview André jumped onto—and through—his desk. André explained that the ground \"was solid concrete evidently\", and that he landed on his tailbone, \"in this way that had this domino ripple effect up my spine so my body was asymmetrical for the rest of the year. I was walking around all weird\".\r\nIn the final episode André tackled drummer Pfelton H. Sutton twice and the episode concluded with a mock \"In Memoriam\" tribute to the musician. Fans of the show mistakenly thought the memoriam was real until the musician confirmed via Twitter that he wasn't dead.\r\nSeason 3 (2014)\r\nCo-director Kitao Sakurai described season 3's interview methods as \"Vietcong interrogation tactics\". \"We almost always use the first moment of an interview\", said co-director Andrew Barchilon, \"And then we skip to the end, when they're exhausted and confused. That's where the gold is\".\r\nGuests on the third season included Lauren Conrad who \"walked off and was really hostile afterwards\". The actress \"somewhat gamely endured\" André until he ate his own vomit (which was actually oatmeal, unbeknownst to her), at which point she fled the interview. According to a 2016 interview with André, \"Lauren Conrad was wanting blood afterwards,\" and he later reflected \"she’ll probably forever hate me, but I think she’s fantastic\". Chris Rock appeared on the show after calling André, saying, \"I'm going to do the show. I'm flying myself out and putting myself up. I’m a huge fan.\"\r\nMusical guests Exhumed performed during the third season with three backup singers impersonating The Supremes. According to guitarist Matt Harvey, The Eric Andre Show originally wanted Pig Destroyer to perform, but they were unavailable, \"so since we were in California, we got the nod.\" Harvey explained that part of the reason their appearance was so short was that they \"went to the taping and just got hideously, disgustingly drunk. I’m talking like – drunk to unprofessional levels I wish we had been a bit more level headed about it in hindsight, though\".\r\nMan on the street segments included dragging a leaking body bag through New York's Chinatown; the production hadn't wanted to spend $300 on a filming permit and were ultimately met by police and other first responders. In another instance, André splashed people on the subway with breakfast cereal and milk. \"It was the hottest day of the year and the milk reeked,\" said André of the segment. \"They just thought I was a lunatic\".\r\nSeason 4 (2016)\r\nScenes planned but not filmed for season 4 included an underwater sequence based on a scene from the film Top Secret! André explained: \"We came close to doing it two years in a row. We even went as far as having a tank in the outskirts of Los Angeles County where we were going to get all this scuba gear and diving and crane operators; all of these underwater stunt performers. But it's just so expensive and so time consuming that it's not worth sacrificing a million other things for just fifty seconds\".\r\nGuests for season 4 included rapper T.I. \"We had T.I. walk off,\" according to a 2016 interview with André, \"but he had just had enough.\" Rapper Flava Flav's interview ended on a freeze-frame of co-host Hannibal Buress kicking Flav in the face; a move Flav denies happened. Flav posted on Facebook in October, 2016, \"People asking about that B.S. Eric Andre show. That kick in the face, NEVER HAPPENED. That's some Bullshit editing done to disparage Flav. Yo Eric Andre - FUCK YOU for that move gee - Flavor Flav\". Guests intended but not booked for season 4 included Jay Leno and Katt Williams.\r\nAndré was nearly arrested while filming man on the street segments during production. André spent time in hospital having stitches in his hand due to filming a segment where he was supposed to \"hail through a car window, but my entire hand went through the window and got sliced up. It was also during the first week of shooting so my fingers are like in weird silver finger casts for a lot of the street stuff\".\r\nSeason 5 (2020)\r\nAdult Swim confirmed via Twitter that the show would air its fifth season in late 2020. André said in an interview that he put on 20 pounds, shaved all of his body hair (except for his eyebrows), and \"sat in many tanning beds\" in preparation, describing his look as \"this weird uncanny valley version of myself\" which contrasts with his fourth season appearance. He confirmed that the season would again feature pranks on the show's guests, stating, \"We would very reluctantly or not at all tell the celebrity guests the name of the show so that they’d just come in blind\".\r\nFilming of season 5 was finished just before the start of the COVID-19 pandemic in March 2020.\r\nOn September 10, 2020, the release date was announced for season 5, October 25, 2020. On September 30, 2020, a trailer was released for the season.\r\nOn October 22, 2020, Eric confirmed in an interview that Hannibal Buress would leave the series during the season for personal reasons, and he would be replaced with Blannibal, who is played by James Hazley. André found Hazley on Craigslist. After Hazley left, no recurring co-host took his place, but often Felipe Esparza and Lakeith Stanfield acted as co-hosts during interviews for the rest of the season. On his exit from the show, Buress said: \"It's been a fun ride, but I'm almost 40; it's time to do something else.\"\r\nDuring filming of one episode's set destruction intro, Eric ended up suffering a concussion when a shelf John Cena had thrown him into proceeded to fall backwards, causing one of its metal bars to hit him in the back of the head. As a result, Eric had to go to the hospital, a situation he admitted in the season's behind the scenes special happened often enough that he had a special phrase to use (calling it a \"popcorn\") whenever he needed medical attention; he also did not place any blame on Cena, admitting he performed his role as requested and it was simply a matter of he and his crew not planning it out properly.\r\nSeason 6 (2023)\r\nAndre initially planned to end the series after season five, but was motivated to come back after he \"didn't make any money\" on his film Bad Trip after it was sold to Netflix and the creative freedom provided by Adult Swim. In March 2023, Adult Swim announced that season 6 would premiere on June 4, 2023. It is directed by Kitao Sakurai and Jeff Tremaine.\r\nEpisodes\r\nCast\r\nBoth host Eric André and co-host Hannibal Buress play exaggerated caricatures of themselves, with André being consistently eccentric, dysfunctional, violent and psychotic, whilst Buress serves as a relative straight man to André's antics, despite usually acting as bizarrely as he does. André consistently overacts during interviews, acts aggressively towards his crew members, diverts from the script, continuously exposes himself to everyone around him, and overall sets out to make his guests feel as uncomfortable as possible (all of which is intended acting, a tactic used on celebrity guests to show the distinctions between each of their reactions to the environment of the set). Although just as outlandish, Buress is less of an oddity than André, and usually ends up correcting André's mistakes, shaming him on stage. Since there are only two chairs on the set, Buress ends up giving away his seat when a guest appears, awkwardly standing next to them and attempting to unnerve them from the host's behavior. The announcer has been voiced by three actors: Gary Anthony Williams during season 1, Tom Kane during season 2, and Robert Smith from season 3 onward. Other than the introduction, they typically announce only during one-off game segments on the show.\r\nIn season 5, the show's status quo changes significantly, with Hannibal quitting half-way into the second episode and being replaced with a mutant clone named \"Blannibal\" made from Hannibal's nose-hair. Blannibal himself also quits in the middle of the season, leaving Eric without a recurring co-host.\r\nThe house band is also notable for regular participation in the show. The initial house band was on the show from season 1 to season 3, and consisted of Tom Ato as the guitarist, Early McCalister as the saxophonist, Pfelton Sutton as the drummer (who is almost always tackled during the show's opening), Jerry Wheeler as the trombonist, and Adora Dei as the keyboardist. The bassist changed frequently, being portrayed by Karen Elaine in season 1, JV Smith in season 2, and RJ Farrington in season 3. This entire band was replaced at the start of season 4 with a group of elderly men, including Don Peake as the guitarist, Emilio Palame as the keyboardist, Harold Cannon as the singer, Oscar Rospide as the bassist, and Tony Katsaras as the drummer. Semere-Ab Etmet Yohannes has also portrayed Russell Brand in several episodes. John Bueno, Jermaine Fowler, Roy Subida, Pat Regan, Vanessa Burns, Byron Bowers, and Buddy Daniels Friedman have all made recurring appearances as crew members throughout various seasons. In season 5, the band is replaced with an all-Japanese crew with the members being Sumiyo Iwasawa as the maraca and recorder player, Masatoshi Nishimura as a guitarist and vocalist, Jiro Okabe as the bassist, Ryo Okumoto as the keyboardist, Takashi \"Chi\" Saito as the drummer, and Rayko as the vocalist.\r\nLive tours\r\nThe Eric Andre Show Live was a touring production of The Eric Andre Show in live venues that were booked during the airing of the first season of the show in 2012. The tour was extended through September 21, 2012, with four additional east coast venues added to the schedule. A follow-up tour was scheduled for November 2013.\r\nHome media\r\nAll five seasons, with the exception of the New Year’s special, have been released on iTunes, Google Play, PlayStation Video (before shutting down on August 31, 2021), Microsoft Movies & TV, Channel 4's streaming website channel4.com (in the UK) and Amazon Video. All of the five seasons, as well as the New Year's special, are also available on Hulu, although it may not be available in several countries.\r\nReception\r\nAt the conclusion of the first season, Christopher R. Weingarten of SPIN described the show as \"possibly the weirdest (and most engrossing) ten minutes on contemporary television.\" Adding that the show combines \"the home-brewed humanity of Fernwood 2 Night, the surrealist Möbius strips of Tim & Eric, the Dada puckishness of Tom Green and the kinetic pranksterism of Jackass, ultimately an Andy Kaufman for the Four Loko generation\".\r\nAnalysis\r\nSome analysts have identified strong nihilistic and post-ironic themes in the show. Sociologist Alex Prong of The University of Western Ontario explains that \"Eric Andre’s embrace of postmodern irony serves him and his audience well, revealing the absurdity of American politics through satire and mimicry...Eric Andre may practice nihilism in that absurdism makes great comedy, but it is a hopeful nihilism, still with an eye for the future.\" According to former editor Andrew DeYoung, The Eric Andre Show and similar shows on Adult Swim are meant to \"reflect the frenetic distribution of information on the internet – that’s why a lot of their shows are so chaotic and absurd.\"",
    "html": "<p>The Eric Andre Show is an American sketch comedy television series which began airing on May 20, 2012. The show premiered on Cartoon Network's night-time programming block Adult Swim and is a parody of late night talk shows. The series is hosted by comedian Eric André and formerly co-hosted by fellow comedian Hannibal Buress and Blannibal (played by James Hazley). All episodes of the show have been directed by Kitao Sakurai and Andrew Barchilon. Gary Anthony Williams served as the announcer in the first season, being replaced by Tom Kane in the second season and Robert Smith from the third season onwards.</p><p>A total of 55 episodes have aired over the course of six seasons. On December 31, 2012, The Eric Andre Show aired a 45-minute live New Year's special, titled The Eric Andre New Year's Eve Spooktacular. A second special, named Eric Andre Does Paris, aired on February 18, 2018.</p><p>The fifth season premiered on October 25, 2020. On May 18, 2022, Adult Swim announced the show had been renewed for a sixth season, which premiered on June 4, 2023.</p><br/><h3>Premise</h3><p>Each episode opens on the show's main set: a standard talk-show set-up with a desk, a chair, and some decor. The show's announcer declares \"Ladies and gentlemen, it's The Eric Andre Show!\" and the opening song begins to play. During this time, André runs onto set and destroys the backdrop, desk, and various furnishings around him. Once the song is completed, stagehands swiftly remove the broken furniture and replace it with identical pieces. Buress, the co-host, walks in at this time, usually to weak applause from the audience. André may then perform a monologue, incorporating dark comedy and surrealism. While he struggles to perform, his monologue usually turns defensive and aggressive as Buress derides him. The show will then typically be a mix of surreal celebrity interviews and short sketches, candid camera footage, and non sequiturs, usually focused on André's absurd behavior in regular settings.</p><p>At the end, a performer of some type plays over the ending credits. Ending performances are usually parodies of amateur acts common to public-access television, while other times they are real musicians playing their own songs with heavy twists, such as punk band Trash Talk playing while wearing volume-sensitive shock collars or a female opera singer performing while rapper Killer Mike serves as her hype man. Killer Mike also appeared in a later episode, performing a rap battle against rapper Action Bronson while the two rap battled while on treadmills. Mac DeMarco once played while André initiated a segment styled after Japanese game shows titled \"Attack DeMarco!\", in which numerous samurai began tormenting DeMarco. In one episode, comedian Rory Scovel had a cooking segment in which he increasingly got upset and destroyed his work station while rapper T-Pain sang the Star Spangled Banner and fired a gun in the air.</p><p>André has expressed that each season of the show is shot with a unique style in mind, intended to be thematically cohesive while remaining distinct from other seasons. Season 1 stylistically follows the series pilot which was shot without studio backing on a limited budget, using vintage Ikegami cameras and a darkly lit set built in an abandoned bodega. For all subsequent seasons the show were filmed in high-definition and featured more modern late-night comedy talk show elements, including André's appearance in a formal gray suit. For season 3, André grew out and straightened his hair in imitation of the distinctive hairstyle of comedian Katt Williams and decorated the set with tropical plants, intending to give the season an upbeat feeling to audiences. In stark contrast, season 4 took place in a darkly lit setting reminiscent of the first season, where André wore a tuxedo and professed to have avoided bathing or grooming, and lost weight during production, dubbing this season the \"dystopian Eraserhead\" season. This season also featured a new house band. Countering season 4, André's season 5 set included a revamping of the set with more vibrant decorations and a green screen behind the curtain where guests come out. André himself shaved all of his body hair except for his eyebrows, wore inexpensive cologne, tanned his skin and gained weight throughout. For season 6, André had his hair slicked back and tied into a ponytail.</p><p>Guest stars appear throughout the show, with a number of them being faked with impersonators or random people, including Jerry Seinfeld, Russell Brand, George Clooney, The Hulk, Beyonce, Arnold Schwarzenegger (portrayed by Bruce Vilanch on a mobility scooter), and Jay-Z. From season two onwards, more actual celebrities appeared, including musicians (Tyler, the Creator, Pete Wentz, Devendra Banhart, Killer Mike, Wiz Khalifa, T-Pain, George Corpsegrinder Fisher, Demi Lovato, Chance the Rapper, Mr. Muthafuckin' eXquire, Flying Lotus, Open Mike Eagle, Dave Koz, Mac DeMarco, 311), actors (Ryan Phillipe, Krysten Ritter, Dolph Lundgren, Jack Black, Aubrey Peeples, Jack McBrayer, James Van Der Beek, Chris Jericho, Seth Rogen, Macaulay Culkin), or 1980s/1990s television stars (Sinbad, Tatyana Ali, Lorenzo Lamas, Jodie Sweetin), although other guests have appeared, including television personality Lauren Conrad, talk show host Jimmy Kimmel, animation veteran John Kricfalusi, and porn star Asa Akira. The season 5 episode \"Blannibal Quits\" marked the final television appearance of the late actress Naya Rivera, who was pronounced dead from accidental drowning at the age of 33 on July 8, 2020.</p><br/><h3>Development</h3><h4>Early development</h4><p>The show was partly influenced by Space Ghost Coast to Coast, a series that aired on Cartoon Network and later Adult Swim. André had said that prior to shooting the first season, he rewatched several episodes of it to \"absorb as much Space Ghost as could\". André also asked many questions of Adult Swim executive Mike Lazzo, the show's creator, who, according to André, had no interest in the old show. Other influences include Chris Farley’s talk show host character from Saturday Night Live, \"The Merv Griffin Show\" episode of Seinfeld, Jiminy Glick, Tom Green (who join in on destroying the set with André with an electric chainsaw in the second season's 10th episode, also André has done several interviews on his Tom Green Live web series), Da Ali G Show and Conan O'Brien.</p><p>The look of the show, according to co-director Andrew Barchilon was intended to mimic \"this iconic feeling that drove back to (early) Letterman and back to Carson.” Regarding the tone of the show, co-director Kitao Sakurai eschewed labelling the show as a spoof, saying in 2012: \"I think implies that we’re 100% dependent on the material that other, legitimate talk shows supply, that we’re just living off of that. I think it’s more of a deconstruction, an alternate reality talk show rather than a spoof. I think that the interviews that we have with real people and celebrities have their own value that goes beyond spoof\".</p><h4>Pilot (2009)</h4><p>André described himself as being \"flat broke\" and \"scraping by doing commercials and random stand-up,\" including performing as a caveman for Geico, when he produced the pilot for The Eric Andre Show, known originally as Duh Air Ache On Dre Shoe.</p><p>The pilot was co-hosted with Hannibal Buress and was directed by Andrew Barchilon and Kitao Sakurai. It was filmed \"over a few days\" in an abandoned bodega in Brooklyn in 2009.</p><p>After filming some man on the street segments, André ran out of money and couldn't afford an editor. Knowing that it would be too difficult to explain how to edit the \"slop pile of footage\", André took on the task himself, spending a year learning Final Cut. The pilot was then sent to \"a bunch of networks\" (including NBC and MTV) where it was rejected on at least one occasion for \"look a little cheap and public access-y\". Keith Crofford of Adult Swim said in 2013 that, on seeing the pilot, making the show \"was pretty much a no-brainer from there\".</p><p>Parts of the pilot were shown at San Diego Comic Con 2013, although it is unknown if the full panel has been recorded.</p><br/><h3>Production</h3><h4>Writing team</h4><p>The core writing cast of the show consists of André, the show's directorial team Andrew Barchilon and Kitao Sakurai, and producer, as well as \"Kraft Punk\" actor, Dan Curry. Series editor Doug Lussenhop joined the writing staff beginning with season two. Additionally, Hannibal Buress was a writer for the first three seasons of the show.</p><p>The other writers who contributed to more than one season are Eric Moneypenny and Tommy Blacha (seasons 1 and 2), Jesse Elias and Rory Scovel, who also appeared in the show as \"Chef Rory Scovel\" (seasons 2 and 4), and Heather Anne Campbell and Pat Regan, who had been working at the show since the first season (seasons 3 and 4).</p><p>Other writers of note include Josh Fadem (season 1), Kevin Barnett and television producer Erica Oyama (season 2), Jon Daly, Ron Funches, Seth Morris, Brent Weinbach (season 3), Colton Dunn, Brett Gelman, Adam Pally, Jake Weisman, Hampton Yount (season 4) and Sarah Sherman (season 5).</p><h4>Season 1 (2012)</h4><p>Season 1 was filmed over the course of ten days, with the opening sequences all filmed together over two and a half days at the end of the shoot. At least twenty desks were broken while filming the first season and despite the desk being constructed of drywall to make it easier to break, André did suffer injuries during the season's production.</p><p>Filming of the first season of the show saw André receive a large amount of creative freedom, but The Eric Andre Show did receive notes from \"Standards and Production\" at Adult Swim, particularly regarding suicide, drug use and insulting specific deities: André commented that \"I can curse out God, but I can't curse out Jesus\". In a 2012 interview, André described production difficulties when planning a scene where \"I shit so hard that my organs fall out of my anus\". Adult Swim had already flagged the sketch, writing to the show: \"He can shit so hard that organs fall out of his anus, but he can’t make it look like he’s intentionally doing it\".</p><p>Another scene planned, but not shot, for season 1 involved André jumping out of a manhole on the street wearing a prison uniform and handcuffs, yelling \"I'm free! I'm free!\" but André was concerned with \"get shot\" and when the show contacted the city, they were warned of \"toxic gasses in the sewer that you need special Hazmat suits for.\" A scene which would have featured Andrew Dice Clay performing as Andrew Nice Clay, a comedian whose punchlines always espouse positive feminist ideologies, was not filmed due to a scheduling conflict with Clay.</p><p>Guests for season 1 included actor Dolph Lundgren. Celebrity impersonators included an actor portraying George Clooney and a character named Russell Brand played by actor Semere Etmet who André described as \" sweetest guy\". Co-directors Sakurai and Barchilon admitted that \"they entirely sure where Etmet came from and that he keeps showing up on set\".</p><p>Man on the street segments included André hiding in a trash can to jump out and surprise people who used it (claiming they were the \"millionth person\" to use said can) and André visiting a Mensa convention, dressed in a complete suit of armor.</p><p>Co-director Sakurai stated that during the filming of the first season, \"ironically the most angry and violent people we’ve got from things are like people at a Mensa convention, was physically attacked.\" Additionally, André was arrested and spent time in jail during production of season 1 when he attended a town hall meeting in a frat-boy getup and announced his plans to put \"beer in the water fountains and cameras in the girls’ locker room\".</p><p>André, who was also known for his role as Mark Reynolds on the ABC sitcom Don't Trust the B---- in Apartment 23 when The Eric Andre Show launched, was warned by ABC network executives not to mention the series on The Eric Andre Show, as they did not want to create an association between the two. According to André, several cast and crew members on Don't Trust the B---- in Apartment 23 were not even aware of the existence of Adult Swim when explaining to them The Eric Andre Show. Don't Trust the B---- in Apartment 23 was cancelled in January 2013 and in April 2013, it was announced that The Eric Andre Show had been renewed for another season, with a few of his former co-stars from the ABC show to make appearances as guests.</p><h4>The Eric Andre New Years Eve Spooktacular (2012)</h4><p>On December 31, 2012, Adult Swim aired a 27-minute Halloween-themed New Years special titled The Eric Andre New Years Eve Spooktacular. André commented in 2016 that filming on a live-to-tape format is \"kind of difficult\" and \"I don't think I'd do that again. I think you can fit in more jokes per square inch in something that's heavily edited\".</p><h4>Season 2 (2013)</h4><p>With season 2, The Eric Andre Show changed to an HD camera setup, a new set design, and a new announcer, whilst André began wearing a suit. (Indeed, the show was reintroduced as \"The NEW Eric Andre Show\" for the opening of the season premiere, the HD change being revealed through a blurry picture of the new set becoming clearer just before the episode began.) Because of the difficulties with gaining consent under California's regulations, some of the impromptu and hidden camera sketches had to be re-recorded in New York City. André also admitted to using tactics on real celebrities to make them visibly uncomfortable during the taping without informing them, such as putting \"old, rotten clams under their seat before they come out, or heat ducts in their seats so they're just sweltering.\" The studio space is not airconditioned. André said this was because the studio's airconditioning was too loud to run while filming, but that it had the added effect of making the guests feel uncomfortable, in line with the show's theme.</p><p>Guests for season 2 included Vivica A. Fox, during whose interview André jumped onto—and through—his desk. André explained that the ground \"was solid concrete evidently\", and that he landed on his tailbone, \"in this way that had this domino ripple effect up my spine so my body was asymmetrical for the rest of the year. I was walking around all weird\".</p><p>In the final episode André tackled drummer Pfelton H. Sutton twice and the episode concluded with a mock \"In Memoriam\" tribute to the musician. Fans of the show mistakenly thought the memoriam was real until the musician confirmed via Twitter that he wasn't dead.</p><h4>Season 3 (2014)</h4><p>Co-director Kitao Sakurai described season 3's interview methods as \"Vietcong interrogation tactics\". \"We almost always use the first moment of an interview\", said co-director Andrew Barchilon, \"And then we skip to the end, when they're exhausted and confused. That's where the gold is\".</p><p>Guests on the third season included Lauren Conrad who \"walked off and was really hostile afterwards\". The actress \"somewhat gamely endured\" André until he ate his own vomit (which was actually oatmeal, unbeknownst to her), at which point she fled the interview. According to a 2016 interview with André, \"Lauren Conrad was wanting blood afterwards,\" and he later reflected \"she’ll probably forever hate me, but I think she’s fantastic\". Chris Rock appeared on the show after calling André, saying, \"I'm going to do the show. I'm flying myself out and putting myself up. I’m a huge fan.\"</p><p>Musical guests Exhumed performed during the third season with three backup singers impersonating The Supremes. According to guitarist Matt Harvey, The Eric Andre Show originally wanted Pig Destroyer to perform, but they were unavailable, \"so since we were in California, we got the nod.\" Harvey explained that part of the reason their appearance was so short was that they \"went to the taping and just got hideously, disgustingly drunk. I’m talking like – drunk to unprofessional levels I wish we had been a bit more level headed about it in hindsight, though\".</p><p>Man on the street segments included dragging a leaking body bag through New York's Chinatown; the production hadn't wanted to spend $300 on a filming permit and were ultimately met by police and other first responders. In another instance, André splashed people on the subway with breakfast cereal and milk. \"It was the hottest day of the year and the milk reeked,\" said André of the segment. \"They just thought I was a lunatic\".</p><h4>Season 4 (2016)</h4><p>Scenes planned but not filmed for season 4 included an underwater sequence based on a scene from the film Top Secret! André explained: \"We came close to doing it two years in a row. We even went as far as having a tank in the outskirts of Los Angeles County where we were going to get all this scuba gear and diving and crane operators; all of these underwater stunt performers. But it's just so expensive and so time consuming that it's not worth sacrificing a million other things for just fifty seconds\".</p><p>Guests for season 4 included rapper T.I. \"We had T.I. walk off,\" according to a 2016 interview with André, \"but he had just had enough.\" Rapper Flava Flav's interview ended on a freeze-frame of co-host Hannibal Buress kicking Flav in the face; a move Flav denies happened. Flav posted on Facebook in October, 2016, \"People asking about that B.S. Eric Andre show. That kick in the face, NEVER HAPPENED. That's some Bullshit editing done to disparage Flav. Yo Eric Andre - FUCK YOU for that move gee - Flavor Flav\". Guests intended but not booked for season 4 included Jay Leno and Katt Williams.</p><p>André was nearly arrested while filming man on the street segments during production. André spent time in hospital having stitches in his hand due to filming a segment where he was supposed to \"hail through a car window, but my entire hand went through the window and got sliced up. It was also during the first week of shooting so my fingers are like in weird silver finger casts for a lot of the street stuff\".</p><h4>Season 5 (2020)</h4><p>Adult Swim confirmed via Twitter that the show would air its fifth season in late 2020. André said in an interview that he put on 20 pounds, shaved all of his body hair (except for his eyebrows), and \"sat in many tanning beds\" in preparation, describing his look as \"this weird uncanny valley version of myself\" which contrasts with his fourth season appearance. He confirmed that the season would again feature pranks on the show's guests, stating, \"We would very reluctantly or not at all tell the celebrity guests the name of the show so that they’d just come in blind\".</p><p>Filming of season 5 was finished just before the start of the COVID-19 pandemic in March 2020.</p><p>On September 10, 2020, the release date was announced for season 5, October 25, 2020. On September 30, 2020, a trailer was released for the season.</p><p>On October 22, 2020, Eric confirmed in an interview that Hannibal Buress would leave the series during the season for personal reasons, and he would be replaced with Blannibal, who is played by James Hazley. André found Hazley on Craigslist. After Hazley left, no recurring co-host took his place, but often Felipe Esparza and Lakeith Stanfield acted as co-hosts during interviews for the rest of the season. On his exit from the show, Buress said: \"It's been a fun ride, but I'm almost 40; it's time to do something else.\"</p><p>During filming of one episode's set destruction intro, Eric ended up suffering a concussion when a shelf John Cena had thrown him into proceeded to fall backwards, causing one of its metal bars to hit him in the back of the head. As a result, Eric had to go to the hospital, a situation he admitted in the season's behind the scenes special happened often enough that he had a special phrase to use (calling it a \"popcorn\") whenever he needed medical attention; he also did not place any blame on Cena, admitting he performed his role as requested and it was simply a matter of he and his crew not planning it out properly.</p><h4>Season 6 (2023)</h4><p>Andre initially planned to end the series after season five, but was motivated to come back after he \"didn't make any money\" on his film Bad Trip after it was sold to Netflix and the creative freedom provided by Adult Swim. In March 2023, Adult Swim announced that season 6 would premiere on June 4, 2023. It is directed by Kitao Sakurai and Jeff Tremaine.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"3\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Pilot</span></span></span></span></th><td colspan=\"2\" style=\"padding:0.2em 0.4em\"><i>unaired</i></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">10 <span style=\"font-size:85%;\">(+1 special)</span></td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">May 20, 2012</td><td style=\"padding:0 8px\">July 29, 2012<br>December 31, 2012 <span style=\"font-size:85%;\">(special)</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 3, 2013</td><td style=\"padding:0 8px\">December 12, 2013</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">November 6, 2014</td><td style=\"padding:0 8px\">January 23, 2015</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">10 <span style=\"font-size:85%;\">(+1 special)</span></td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">August 5, 2016</td><td style=\"padding:0 8px\">October 14, 2016<br>February 18, 2018 <span style=\"font-size:85%;\">(special)</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">10 <span style=\"font-size:85%;\">(+1 special)</span></td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 25, 2020</td><td style=\"padding:0 8px\">November 22, 2020<br>November 13, 2020 <span style=\"font-size:85%;\">(special)</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td data-sort-value=\"\" class=\"table-na\" colspan=\"2\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\">TBA</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 5, 2023</td><td data-sort-value=\"\" class=\"table-na\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center; ;padding:0 8px\">TBA</td></tr></tbody></table><br/><h3>Cast</h3><p>Both host Eric André and co-host Hannibal Buress play exaggerated caricatures of themselves, with André being consistently eccentric, dysfunctional, violent and psychotic, whilst Buress serves as a relative straight man to André's antics, despite usually acting as bizarrely as he does. André consistently overacts during interviews, acts aggressively towards his crew members, diverts from the script, continuously exposes himself to everyone around him, and overall sets out to make his guests feel as uncomfortable as possible (all of which is intended acting, a tactic used on celebrity guests to show the distinctions between each of their reactions to the environment of the set). Although just as outlandish, Buress is less of an oddity than André, and usually ends up correcting André's mistakes, shaming him on stage. Since there are only two chairs on the set, Buress ends up giving away his seat when a guest appears, awkwardly standing next to them and attempting to unnerve them from the host's behavior. The announcer has been voiced by three actors: Gary Anthony Williams during season 1, Tom Kane during season 2, and Robert Smith from season 3 onward. Other than the introduction, they typically announce only during one-off game segments on the show.</p><p>In season 5, the show's status quo changes significantly, with Hannibal quitting half-way into the second episode and being replaced with a mutant clone named \"Blannibal\" made from Hannibal's nose-hair. Blannibal himself also quits in the middle of the season, leaving Eric without a recurring co-host.</p><p>The house band is also notable for regular participation in the show. The initial house band was on the show from season 1 to season 3, and consisted of Tom Ato as the guitarist, Early McCalister as the saxophonist, Pfelton Sutton as the drummer (who is almost always tackled during the show's opening), Jerry Wheeler as the trombonist, and Adora Dei as the keyboardist. The bassist changed frequently, being portrayed by Karen Elaine in season 1, JV Smith in season 2, and RJ Farrington in season 3. This entire band was replaced at the start of season 4 with a group of elderly men, including Don Peake as the guitarist, Emilio Palame as the keyboardist, Harold Cannon as the singer, Oscar Rospide as the bassist, and Tony Katsaras as the drummer. Semere-Ab Etmet Yohannes has also portrayed Russell Brand in several episodes. John Bueno, Jermaine Fowler, Roy Subida, Pat Regan, Vanessa Burns, Byron Bowers, and Buddy Daniels Friedman have all made recurring appearances as crew members throughout various seasons. In season 5, the band is replaced with an all-Japanese crew with the members being Sumiyo Iwasawa as the maraca and recorder player, Masatoshi Nishimura as a guitarist and vocalist, Jiro Okabe as the bassist, Ryo Okumoto as the keyboardist, Takashi \"Chi\" Saito as the drummer, and Rayko as the vocalist.</p><br/><h3>Live tours</h3><p>The Eric Andre Show Live was a touring production of The Eric Andre Show in live venues that were booked during the airing of the first season of the show in 2012. The tour was extended through September 21, 2012, with four additional east coast venues added to the schedule. A follow-up tour was scheduled for November 2013.</p><br/><h3>Home media</h3><p>All five seasons, with the exception of the New Year’s special, have been released on iTunes, Google Play, PlayStation Video (before shutting down on August 31, 2021), Microsoft Movies & TV, Channel 4's streaming website channel4.com (in the UK) and Amazon Video. All of the five seasons, as well as the New Year's special, are also available on Hulu, although it may not be available in several countries.</p><br/><h3>Reception</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>needs expansion</b>. You can help by <span class=\"external text\">adding to it</span>.  <span class=\"date-container\"><i>(<span class=\"date\">July 2020</span>)</i></span></div></td></tr></tbody></table><p>At the conclusion of the first season, Christopher R. Weingarten of SPIN described the show as \"possibly the weirdest (and most engrossing) ten minutes on contemporary television.\" Adding that the show combines \"the home-brewed humanity of Fernwood 2 Night, the surrealist Möbius strips of Tim & Eric, the Dada puckishness of Tom Green and the kinetic pranksterism of Jackass, ultimately an Andy Kaufman for the Four Loko generation\".</p><h4>Analysis</h4><p>Some analysts have identified strong nihilistic and post-ironic themes in the show. Sociologist Alex Prong of The University of Western Ontario explains that \"Eric Andre’s embrace of postmodern irony serves him and his audience well, revealing the absurdity of American politics through satire and mimicry...Eric Andre may practice nihilism in that absurdism makes great comedy, but it is a hopeful nihilism, still with an eye for the future.\" According to former editor Andrew DeYoung, The Eric Andre Show and similar shows on Adult Swim are meant to \"reflect the frenetic distribution of information on the internet – that’s why a lot of their shows are so chaotic and absurd.\"</p><br/>"
  },
  "errorMessage": ""
}