{
  "imDbId": "tt0795176",
  "title": "Planet Earth",
  "fullTitle": "Planet Earth (TV Series 2006–2006)",
  "type": "TVSeries",
  "year": "2006",
  "language": "en",
  "titleInLanguage": "Planet Earth (2006 TV series)",
  "url": "https://en.wikipedia.org/wiki/Planet_Earth_(2006_TV_series)",
  "plotShort": {
    "plainText": "Planet Earth is a 2006 British television series produced by the BBC Natural History Unit. Five years in the making, it was the most expensive nature documentary series ever commissioned by the BBC and also the first to be filmed in high definition. The series received multiple awards, including four Emmy Awards, a Peabody Award, and an award from the Royal Television Society.\r\nPlanet Earth premiered on 5 March 2006 in the United Kingdom on BBC One, and by June 2007 had been shown in 130 countries. The original version was narrated by David Attenborough, whilst some international versions used alternative narrators.\r\nThe series has eleven episodes, each of which features a global overview of a different biome or habitat on Earth. At the end of each fifty-minute episode, a ten-minute featurette takes a behind-the-scenes look at the challenges of filming the series.\r\nTen years later, the BBC announced a six-part sequel had been commissioned, titled Planet Earth II, the first television series produced by the BBC in ultra-high-definition (4K). David Attenborough returned as narrator and presenter. A second sequel, Planet Earth III is currently announced and planned to air in 2023.",
    "html": "<p>Planet Earth is a 2006 British television series produced by the BBC Natural History Unit. Five years in the making, it was the most expensive nature documentary series ever commissioned by the BBC and also the first to be filmed in high definition. The series received multiple awards, including four Emmy Awards, a Peabody Award, and an award from the Royal Television Society.</p><p>Planet Earth premiered on 5 March 2006 in the United Kingdom on BBC One, and by June 2007 had been shown in 130 countries. The original version was narrated by David Attenborough, whilst some international versions used alternative narrators.</p><p>The series has eleven episodes, each of which features a global overview of a different biome or habitat on Earth. At the end of each fifty-minute episode, a ten-minute featurette takes a behind-the-scenes look at the challenges of filming the series.</p><p>Ten years later, the BBC announced a six-part sequel had been commissioned, titled Planet Earth II, the first television series produced by the BBC in ultra-high-definition (4K). David Attenborough returned as narrator and presenter. A second sequel, Planet Earth III is currently announced and planned to air in 2023.</p>"
  },
  "plotFull": {
    "plainText": "Planet Earth is a 2006 British television series produced by the BBC Natural History Unit. Five years in the making, it was the most expensive nature documentary series ever commissioned by the BBC and also the first to be filmed in high definition. The series received multiple awards, including four Emmy Awards, a Peabody Award, and an award from the Royal Television Society.\r\nPlanet Earth premiered on 5 March 2006 in the United Kingdom on BBC One, and by June 2007 had been shown in 130 countries. The original version was narrated by David Attenborough, whilst some international versions used alternative narrators.\r\nThe series has eleven episodes, each of which features a global overview of a different biome or habitat on Earth. At the end of each fifty-minute episode, a ten-minute featurette takes a behind-the-scenes look at the challenges of filming the series.\r\nTen years later, the BBC announced a six-part sequel had been commissioned, titled Planet Earth II, the first television series produced by the BBC in ultra-high-definition (4K). David Attenborough returned as narrator and presenter. A second sequel, Planet Earth III is currently announced and planned to air in 2023.\r\nBackground\r\nIn 2001 the BBC broadcast The Blue Planet, a series on the natural history of the world's oceans. It received critical acclaim, high viewing figures, audience appreciation ratings, and many awards. It also became a hugely profitable global brand, eventually being sold to 150 countries worldwide. Feedback showed that audiences particularly liked the epic scale, the scenes of new and unusual species and the cinematic quality of the series. Programme commissioners were keen for a follow-up, so Alastair Fothergill decided that the Natural History Unit should repeat the formula with a series looking at the whole planet. The idea for Planet Earth was born, and the series was commissioned by Lorraine Heggessey, then Controller of BBC One, in January 2002.\r\nA feature film version of Planet Earth was commissioned alongside the television series, repeating the successful model established with The Blue Planet and its companion film, Deep Blue. Earth was released around the world from 2007 to 2009. There was also another accompanying television series, Planet Earth: The Future, which looked at the environmental problems facing some of the species and habitats featured in the main series in more detail.\r\nBroadcast\r\nPlanet Earth premiered on BBC One on 5 March 2006 in the United Kingdom. On the same day or in the subsequent weeks or months, the series also began airing in several other countries.\r\nInternational broadcasters carrying Planet Earth include Australia on ABC and GEM, Canada on CBC and CTV, New Zealand on Prime, the Philippines on GMA Network and GMA News TV, the U.S. on Discovery Channel, Velocity, Science, Animal Planet, Destination America and BBC America.\r\nBritish television\r\nThe episodes are each an hour in length, comprising the main programme and a 10-minute featurette called Planet Earth Diaries, which details the filming of a particular event. In the UK, Planet Earth was split into two parts, broadcast in spring and autumn 2006. The first five episodes premiered on BBC One at 9:00 pm on Sundays, beginning on 5 March 2006. The programmes were repeated the following Saturday in an early evening slot on BBC Two. Along with its 2005 dramatisation of Bleak House, the BBC selected Planet Earth for its trial of high-definition broadcasts. The opening episode was its first-ever scheduled programme in the format, shown 27 May 2006 on the BBC HD channel.\r\nThe first episode in the autumn series, Great Plains, received its first public showing at the Edinburgh International Television Festival on 26 August 2006. It was shown on a giant screen in Conference Square. The remaining episodes were broadcast from 5 November 2006 in the same primetime BBC One slot, following a further repeat run of the spring programmes on BBC Four. The autumn episodes were broadcast simultaneously on BBC HD and were repeated on BBC Four the following week.\r\nBesides being BBC One's featured One to Watch programme of the day, Planet Earth was heavily trailed on the BBC's television and radio channels both before and during its run. The music that was featured in the BBC trailers for the series is the track \"Hoppípolla\" from the album Takk... by Icelandic post-rock band Sigur Rós. Following the advertisements, interest was so widespread that the single was re-released. In the United States, the series was promoted using \"The Time Has Come\" from trailer music company Epic Score, composed by Gabriel Shadid and Tobias Marberger. The Australian trailers initially used Jupiter: The Bringer of Jollity from Gustav Holst's orchestral suite The Planets, but later reverted to \"Hoppípolla\".\r\nInternational\r\nThe BBC pre-sold the series to several overseas broadcasters, including the Discovery Channel for the United States, the Australian Broadcasting Corporation, the Canadian Broadcasting Corporation, China Central Television, WDR for Germany, Discovery Channel for India, Prime Television for New Zealand, and C1R for Russian broadcasts. The series was eventually sold to 130 countries.\r\nOn 25 March 2007, the series began its run on American television on the Discovery network, premiering on the Discovery Channel and Discovery HD Theater. There were a number of revisions to the original British programme. Actress and conservationist Sigourney Weaver was brought in to replace David Attenborough as narrator, as it was thought her familiarity to American audiences would attract more viewers. The Discovery programmes also used a slightly different script to the British original. The series was broadcast on Sundays in one 3-hour block followed by four 2-hour blocks. The Planet Earth Diaries segments were not shown immediately after each episode, but collectively in Planet Earth: The Filmmakers' Story, a two-hour special which was broadcast after the series had finished its initial network run. Edited versions were later broadcast on The Science Channel, Animal Planet, and Planet Green.\r\nIn Canada, the series did not air on the Canadian Discovery Channel, as it is owned by CTV and the Canadian rights were exclusively sold to the CBC.\r\nEpisodes\r\n\"A hundred years ago, there were one and a half billion people on Earth. Now, over six billion crowd our fragile planet. But even so, there are still places barely touched by humanity. This series will take you to the last wildernesses and show you the planet and its wildlife as you have never seen them before.\"— David Attenborough's opening narration\r\n\"Our planet is still full of wonders. As we explore them, so we gain not only understanding, but power. It's not just the future of the whale that today lies in our hands: it's the survival of the natural world in all parts of the living planet. We can now destroy or we can cherish. The choice is ours.\"— David Attenborough, in closing\r\nPlanet Earth: The Future\r\nThe latter episodes were supplemented by Planet Earth: The Future, a series of three 60-minute films that highlight the conservation issues surrounding some of the featured species and environments. The programmes are narrated by Simon Poland and the series producer was Fergus Beeley. The series began transmission on BBC Four after the ninth episode, \"Shallow Seas\".\r\nFeature film\r\nAlongside the commissioning of the television series, BBC Worldwide and GreenLight Media secured financing for a US$15 million film version of Planet Earth. This followed the earlier success of Deep Blue, the BBC's 2003 theatrical nature documentary which used re-edited footage from The Blue Planet. The film was co-directed by Alastair Fothergill and Mark Linfield and produced by Alix Tidmarsh and Sophokles Tasioulis. Only 30% of the footage shown in Earth is new, with the remainder being reworked from the television series to suit the narrative of the film. David Attenborough was replaced as narrator by high-profile actors: Patrick Stewart for the UK market and James Earl Jones for the United States.\r\nEarth had its worldwide premiere in September 2007 at the San Sebastián International Film Festival in San Sebastián, Spain, in Basque Country. Lionsgate released the film in several international markets over the following year. In the United States, it became the first film to be released by Disneynature, the Walt Disney Company's new nature documentary arm. When released on Earth Day 2009 it set the record for the highest opening weekend gross for a nature documentary, and went on to become the third highest grossing documentary of all time. It has grossed more than $108 million worldwide; in the nature documentary genre, only March of the Penguins has achieved greater box-office success.\r\nReception\r\nCritical reception\r\nPlanet Earth received widespread critical acclaim. On review aggregation website Rotten Tomatoes, the miniseries has an approval rating of 95% based on 22 reviews, with an average rating of 9/10. The critical consensus reads \"Planet Earth weaves innovative camera techniques and patient observation to deliver viewers an astounding glimpse of the world's perils and wonders, capturing jaw-dropping scenery and animals on both an epic and intimate scale.\" Time magazine's James Poniewozik named it one of the Top 10 New TV Series of 2007, ranking it at No. 4. In 2019, Planet Earth and its sequel were ranked 72nd on The Guardian's list of the 100 best TV shows of the 21st century.\r\nAccolades\r\nPlanet Earth: From Pole to Pole won the Science and Natural History award at the Royal Television Society Programme Awards in 2007. The RTS also awarded it a Judge's Award and a Photography Award at its Craft and Design Awards. The series picked up two awards from the Broadcasting Press Guild for Best Documentary Series and Innovation in Broadcasting, and won Best Documentary Series at the 2007 Broadcast Awards. At the 2007 BAFTA Television Awards, Planet Earth was nominated in the Specialist Factual and Pioneer Audience Award categories, but lost out to Nuremberg: Goering's Last Stand and Life on Mars respectively. It received three nominations at the BAFTA Television Craft Awards later the same year. George Fenton's original score won him Soundtrack Composer of the Year at the 2007 Classical BRIT Awards. Planet Earth was also nominated for the NTA for Most popular Factual program but lost to Top Gear (Supernanny and Bad Lad's Army: Officer Class were also nominated).\r\nPlanet Earth was recognised by the American television industry, collecting the award for Nonfiction Series at the 59th Primetime Emmy Awards in September 2007 and winning a further three prizes in technical categories at the Creative Arts Emmy Awards. It also collected two awards from the Television Critics Association in Los Angeles in July 2007 and a Peabody Award in April 2008.\r\nThe series was also fêted at wildlife film festivals around the globe, collected multiple prizes at the Wildscreen Festival 2006, the International Wildlife Film Festival 2007 and the Jackson Hole Wildlife Film Festival 2007.\r\nAwards and nominations\r\nAudience response\r\nThe credentials of the filmmakers, the size of the production, a high-profile marketing campaign and a primetime BBC One timeslot all resulted in Planet Earth attracting large audiences when it debuted in the UK in March 2006. The first episode, \"From Pole to Pole\", was watched by more people than any natural history programme since Attenborough and Fothergill's previous series, The Blue Planet, in 2001. The first five episodes drew an average audience of 11.4 million viewers, including the early evening repeats, outperforming even The Blue Planet. When the series returned to British screens after a six-month break, it remained popular but viewing figures did not reach the same levels. The final six episodes attracted an average audience of 6.8 million viewers, appreciably lower than the spring episodes, but still higher than BBC One's average for the timeslot. The BBC's 2007 Annual Report revealed that the series \"received the highest audience appreciation score of any British programme on TV this year\".\r\nIn the United States, Planet Earth drew equally impressive ratings when it premiered on Discovery and Discovery HD Theater on 25 March 2007. The first three episodes (screened back to back) averaged 5.72 million viewers with a peak of 6.07 million viewers, giving the network its third highest audience ever. It was also the most watched Discovery programme since The Flight That Fought Back in 2005.\r\nSequel\r\nIn February 2016, the BBC announced a six-part sequel had been commissioned, titled Planet Earth II, for release in late 2016, with Sir David Attenborough returning as narrator and presenter. As with the 2006 series, the trailer features the track 'Hoppipolla' by Icelandic group Sigur Ros.\r\nMerchandise\r\nThe popularity of the television series around the world translated into strong sales of associated Planet Earth merchandise. In the United States, it became the fastest and bestselling documentary DVD in Discovery Channel's history, and the high-definition (HD) discs generated US$3.2 million in sales in just two months. By the end of 2007, U.S. sales had topped 3 million units, making it the highest-grossing HD title and one of the top ten DVD titles of the year.\r\nIn addition, the brand was licensed to other companies to produce children's books, calendars, a board game, jigsaws, stationery, cards, and more.\r\nDVD\r\nA five-disc DVD box set of the complete series (BBCDVD1883) was released in the UK for Regions 2 and 4 (PAL) on 27 November 2006 by 2 entertain. It is presented in 5.1-channel Dolby Digital surround sound and 16:9 widescreen video. The bonus features include Planet Earth Diaries (presented immediately after each episode as for the original TV broadcast) and Planet Earth: The Future. In the United States, two versions of the same five-disc set were released as a Region 1 (NTSC) DVD on 24 April 2007. The BBC Warner release retained David Attenborough's narration from the original British television broadcasts, but the Discovery Channel edition used the alternative Sigourney Weaver voice-over. Even in the United States the Attenborough version was much the better for sales.\r\nHD DVD and Blu-ray\r\nExcept for a small amount of extremely hard-to-obtain footage, Planet Earth was filmed entirely in high-definition, and consequently became one of the first television series to take advantage of the new HD disc formats.\r\nThe series was released in both Blu-ray and HD DVD formats as a five-disc Region B box set on 12 November 2007. On the fifth disc, the bonus features from the standard-definition DVD set were replaced by two episodes from the BBC's Natural World series, \"Desert Lions\" and \"Snow Leopard: Beyond the Myth\", both also presented in high-definition.\r\nIn the United States, the series was released as a four-disc set in both high-definition formats, the Blu-ray version on single-layer BD-25 discs and the HD DVD set on dual-layer HD DVD-30 discs. The first U.S. high-definition releases omitted the extra disc of bonus features from the standard-definition boxed set, though these extras were included with new material in a special-edition Blu-ray released in 2011.\r\nBooks\r\nFour official tie-in volumes were published by BBC Books in 2006 and 2007:\r\nPlanet Earth: As You've Never Seen It Before, written by Alastair Fothergill with a foreword by David Attenborough, was published in hardback on 5 October 2006 (ISBN 978-0563522126).\r\nThe paperback title Planet Earth: The Future was also published on 5 October 2006 (ISBN 978-0563539056). It was edited by Fergus Beeley and Rosamund Kidman Cox with a foreword by Jonathon Porritt.\r\nA second paperback volume revealed some of the tales from the field during filming expeditions. Planet Earth: The Making of an Epic Series was written by David Nicholson-Lord and published on 9 March 2006 (ISBN 978-0563493587).\r\nA collection of still images from the series was published in a hardcover volume as Planet Earth: The Photographs on 7 October 2007 (ISBN 978-1846073465).\r\nSoundtrack album\r\nOn 20 November 2006, a two-disc soundtrack CD was released with a compilation of the incidental music specially commissioned for Planet Earth. The award-winning score was composed by George Fenton and performed by the BBC Concert Orchestra and has been performed during \"Planet Earth Live\" events in the United States and the United Kingdom.",
    "html": "<p>Planet Earth is a 2006 British television series produced by the BBC Natural History Unit. Five years in the making, it was the most expensive nature documentary series ever commissioned by the BBC and also the first to be filmed in high definition. The series received multiple awards, including four Emmy Awards, a Peabody Award, and an award from the Royal Television Society.</p><p>Planet Earth premiered on 5 March 2006 in the United Kingdom on BBC One, and by June 2007 had been shown in 130 countries. The original version was narrated by David Attenborough, whilst some international versions used alternative narrators.</p><p>The series has eleven episodes, each of which features a global overview of a different biome or habitat on Earth. At the end of each fifty-minute episode, a ten-minute featurette takes a behind-the-scenes look at the challenges of filming the series.</p><p>Ten years later, the BBC announced a six-part sequel had been commissioned, titled Planet Earth II, the first television series produced by the BBC in ultra-high-definition (4K). David Attenborough returned as narrator and presenter. A second sequel, Planet Earth III is currently announced and planned to air in 2023.</p><br/><h3>Background</h3><p>In 2001 the BBC broadcast The Blue Planet, a series on the natural history of the world's oceans. It received critical acclaim, high viewing figures, audience appreciation ratings, and many awards. It also became a hugely profitable global brand, eventually being sold to 150 countries worldwide. Feedback showed that audiences particularly liked the epic scale, the scenes of new and unusual species and the cinematic quality of the series. Programme commissioners were keen for a follow-up, so Alastair Fothergill decided that the Natural History Unit should repeat the formula with a series looking at the whole planet. The idea for Planet Earth was born, and the series was commissioned by Lorraine Heggessey, then Controller of BBC One, in January 2002.</p><p>A feature film version of Planet Earth was commissioned alongside the television series, repeating the successful model established with The Blue Planet and its companion film, Deep Blue. Earth was released around the world from 2007 to 2009. There was also another accompanying television series, Planet Earth: The Future, which looked at the environmental problems facing some of the species and habitats featured in the main series in more detail.</p><br/><h3>Broadcast</h3><p>Planet Earth premiered on BBC One on 5 March 2006 in the United Kingdom. On the same day or in the subsequent weeks or months, the series also began airing in several other countries.</p><p>International broadcasters carrying Planet Earth include Australia on ABC and GEM, Canada on CBC and CTV, New Zealand on Prime, the Philippines on GMA Network and GMA News TV, the U.S. on Discovery Channel, Velocity, Science, Animal Planet, Destination America and BBC America.</p><h4>British television</h4><p>The episodes are each an hour in length, comprising the main programme and a 10-minute featurette called Planet Earth Diaries, which details the filming of a particular event. In the UK, Planet Earth was split into two parts, broadcast in spring and autumn 2006. The first five episodes premiered on BBC One at 9:00 pm on Sundays, beginning on 5 March 2006. The programmes were repeated the following Saturday in an early evening slot on BBC Two. Along with its 2005 dramatisation of Bleak House, the BBC selected Planet Earth for its trial of high-definition broadcasts. The opening episode was its first-ever scheduled programme in the format, shown 27 May 2006 on the BBC HD channel.</p><p>The first episode in the autumn series, Great Plains, received its first public showing at the Edinburgh International Television Festival on 26 August 2006. It was shown on a giant screen in Conference Square. The remaining episodes were broadcast from 5 November 2006 in the same primetime BBC One slot, following a further repeat run of the spring programmes on BBC Four. The autumn episodes were broadcast simultaneously on BBC HD and were repeated on BBC Four the following week.</p><p>Besides being BBC One's featured One to Watch programme of the day, Planet Earth was heavily trailed on the BBC's television and radio channels both before and during its run. The music that was featured in the BBC trailers for the series is the track \"Hoppípolla\" from the album Takk... by Icelandic post-rock band Sigur Rós. Following the advertisements, interest was so widespread that the single was re-released. In the United States, the series was promoted using \"The Time Has Come\" from trailer music company Epic Score, composed by Gabriel Shadid and Tobias Marberger. The Australian trailers initially used Jupiter: The Bringer of Jollity from Gustav Holst's orchestral suite The Planets, but later reverted to \"Hoppípolla\".</p><h4>International</h4><p>The BBC pre-sold the series to several overseas broadcasters, including the Discovery Channel for the United States, the Australian Broadcasting Corporation, the Canadian Broadcasting Corporation, China Central Television, WDR for Germany, Discovery Channel for India, Prime Television for New Zealand, and C1R for Russian broadcasts. The series was eventually sold to 130 countries.</p><p>On 25 March 2007, the series began its run on American television on the Discovery network, premiering on the Discovery Channel and Discovery HD Theater. There were a number of revisions to the original British programme. Actress and conservationist Sigourney Weaver was brought in to replace David Attenborough as narrator, as it was thought her familiarity to American audiences would attract more viewers. The Discovery programmes also used a slightly different script to the British original. The series was broadcast on Sundays in one 3-hour block followed by four 2-hour blocks. The Planet Earth Diaries segments were not shown immediately after each episode, but collectively in Planet Earth: The Filmmakers' Story, a two-hour special which was broadcast after the series had finished its initial network run. Edited versions were later broadcast on The Science Channel, Animal Planet, and Planet Green.</p><p>In Canada, the series did not air on the Canadian Discovery Channel, as it is owned by CTV and the Canadian rights were exclusively sold to the CBC.</p><br/><h3>Episodes</h3><blockquote>\"A hundred years ago, there were one and a half billion people on Earth. Now, over six billion crowd our fragile planet. But even so, there are still places barely touched by humanity. This series will take you to the last wildernesses and show you the planet and its wildlife as you have never seen them before.\"— David Attenborough's opening narration</blockquote><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#00B050;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#00B050\">Title</th><th scope=\"col\" style=\"background:#00B050\">Original air date</th><th scope=\"col\" style=\"background:#00B050\">U.S. air date</th><th scope=\"col\" style=\"background:#00B050;width:10%\">UK viewers<br>(millions) <span style=\"background-color:white;padding:1px;display:inline-block;line-height:50%\"></span></th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"From Pole to Pole\"</td><td style=\"text-align:center\">5 March 2006</td><td style=\"text-align:center\">25 March 2007</td><td style=\"text-align:center\">9.41</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #00B050\"><p>The first episode illustrates a journey around the globe and reveals the effect of gradual <span class=\"mw-redirect\">climatic change</span> and seasonal transitions <span class=\"extiw\">en route</span>. During <span>Antarctica</span>'s winter, <span>emperor penguins</span> endure four months of darkness, with no food, in temperatures of −70 <span>°C</span> (−94 <span>°F</span>). Meanwhile, as spring arrives in the <span>Arctic</span>, <span>polar bear</span> cubs take their first steps into a world of rapidly thawing ice. In northern Canada, 3 million <span class=\"mw-redirect\">caribou</span> complete an overland migration of 3,200 kilometres (2,000 mi), longer than that of any animal, and are hunted by wolves during their journey. The forests of eastern Russia are home to the <span>Amur leopard</span>; with a population of just 40 individuals in the wild, it is now the world's rarest cat. This is primarily because of the destruction of its habitat, and Attenborough states that it \"symbolizes the fragility of our natural heritage\". However, in the <span>tropics</span>, the jungle that covers 3% of the planet's surface supports 50% of its species. Other species shown include <span>New Guinea</span>'s <span class=\"mw-redirect\">birds of paradise</span>, <span>African hunting dogs</span> in their efficient pursuit of <span>impala</span>, <span>elephants</span> in Africa migrating towards the waters of the <span>Okavango Delta</span>, a seasonal bloom of life in the otherwise arid <span>Kalahari Desert</span>, and 300,000 migrating <span>Baikal teal</span>, containing the world's entire population of the species in one flock. The episode ends with Antarctica where the male Emperor penguins nurture their newly young chicks after four months of the Antarctic polar night.</p>The <i>Planet Earth Diaries</i> segment shows how the wild dog hunt was filmed unobtrusively with the aid of the <i><span>Heligimbal</span></i>, a powerful, <span>gyro</span>-stabilised camera mounted beneath a <span>helicopter</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Mountains\"</td><td style=\"text-align:center\">12 March 2006</td><td style=\"text-align:center\">25 March 2007</td><td style=\"text-align:center\">8.57</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #00B050\"><div class=\"thumb tright\"></div><p>The second instalment focuses on the <span>mountains</span>. All the main ranges are explored with extensive <span>aerial photography</span>. <span>Ethiopia</span>'s <span>Erta Ale</span> is the <span>longest continually erupting</span> <span>volcano</span>—for over 100 years. On the nearby highlands of <span>Simien Mountains</span>, <span>geladas</span> (the only primate whose diet is almost entirely grass) inhabit precipitous slopes nearly five kilometres (3 mi) up, in troops that are 800-strong: the most numerous of their kind. Alongside them live the <span class=\"mw-redirect\">critically endangered</span> <span>walia ibex</span>,  the two species take turns to act as a lookout for predatory <span>Ethiopian wolves</span>. The <span>Andes</span> have the most volatile weather and <span>guanacos</span> are shown enduring a flash blizzard, along with an exceptional group sighting of the normally solitary <span>puma</span>. The <span>Alpine</span> summits are always <span>snow</span>-covered, apart from that of the <span>Matterhorn</span>, which is too sheer to allow it to settle. <span>Grizzly bear</span> cubs emerge from their den for the first time in the <span>Rockies</span>, while <span>Himalayan</span> inhabitants include <span>rutting</span> <span>markhor</span> and the rare <span>snow leopard</span>. At the eastern end of the range, the <span>giant panda</span> cannot hibernate due to its poor nutriment of <span>bamboo</span> and one of them cradles its week-old cub. Also shown is the Earth's biggest mountain <span>glacier</span>—the <span>Baltoro</span> in <span>Pakistan</span>, which is 70 kilometres (43 mi) long and visible from space. The episode ends with the flock of <span>Demoiselle cranes</span> flying across the Himalayan mountain peak to avoid the hostile air currents and predatory <span>Golden eagles</span> that threaten their migration.</p><i>Planet Earth Diaries</i> explains how difficult it was to get close-up footage of <span class=\"mw-redirect\">snow leopards</span>; it was a three-year process and is the world's first-ever video footage of snow leopards.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Fresh Water\"</td><td style=\"text-align:center\">19 March 2006</td><td style=\"text-align:center\">15 April 2007</td><td style=\"text-align:center\">8.83</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #00B050\"><p>The <span class=\"mw-redirect\">fresh water</span> programme describes the course taken by <span>rivers</span> and some of the species that take advantage of such a habitat. Only 3% of the world's water is fresh, yet all life on land ultimately depends on it. Its journey begins as a stream in the mountains, illustrated by <span>Venezuela</span>'s <span>Tepui</span>, where there is a tropical downpour almost every day. It then travels hundreds of kilometers before forming <span>rapids</span>. With the aid of some expansive helicopter photography, one sequence demonstrates the vastness of <span>Angel Falls</span>, the world's highest free-flowing <span>waterfall</span>. Its waters drop unbroken for nearly 1,000  meters (3,000  feet) and are blown away as a mist before they reach the bottom. In Japan, the water is inhabited by the biggest amphibian, the two-meter long <span>giant salamander</span>, while in the Northern Hemisphere, <span>salmon</span> undertake the largest freshwater migration, and are hunted en route by grizzly bears. The erosive nature of rivers is shown by the <span>Grand Canyon</span>, created over five million years by the <span>Colorado River</span>. Also featured are <span class=\"mw-redirect\">smooth coated otters</span> repelling <span>mugger crocodiles</span> and the latter's <span>Nile cousin</span> ambushing <span>wildebeest</span> as they cross the <span>Mara River</span>. East African rift valley holds three of the world's largest lakes: <span>Malawi</span>, <span>Tanganyika</span>, and <span>Victoria</span>. Lake Malawi contains 850 different <span>Cichlids</span> that originated from their same ancestors that were isolated thousands of years ago, along with nocturnal predatory dolphin fish. Deep in the dead zone of Malawi, swarms of fly midges emerge from larvae during the rainy season and began their process of mating. In lake Baikal of Eastern Siberia, <span>Baikal seal</span> and freshwater sponges thrive here despite the ice sheet that covers the lake. The <span class=\"mw-redirect\">Amazon river</span>, the biggest river in the world, flows from the Andes toward the Atlantic oceans carrying a billion tonnes of sediments. Its tributary, <span>Rio Negro</span>, contains a mixture of sediments and saltwater where it supports <span>botos</span> feeding habit. Between the border of Brazil and Argentina lies <span class=\"mw-redirect\">Iguassu Falls</span>, which is the widest waterfall ever known. In <span>Pantanal</span> wetlands, 300 species of fish breed here, including the <span>Red-bellied piranhas</span> and <span>Dorados</span>. Along with fish, <span>Roseate spoonbills</span> are numerous in the <span>Pantanal</span> and are prey to <span>spectacled caiman</span> waiting for the chicks to fall from the tree. In <span>Bangladesh</span>, the <span>Ganges</span> and <span class=\"mw-redirect\">Brahmaputra</span> join together to form the world's <span class=\"mw-redirect\">largest river delta</span> and create the largest mangrove forest known as the <span class=\"mw-redirect\">Sundarbans</span>. The mangroves of <span>Indonesia</span> provide a home to <span>crab-eating macaques</span> for their aquatic lifestyle. The programme ends in North America where 400000 <span class=\"mw-redirect\">snow geese</span> settle in the estuaries to rest and refuel on their long migrational journey.</p><i>Planet Earth Diaries</i> shows how a camera crew filmed a piranha feeding frenzy in <span>Brazil</span>—after a two-week search for the opportunity.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Caves\"</td><td style=\"text-align:center\">26 March 2006</td><td style=\"text-align:center\">22 April 2007</td><td style=\"text-align:center\">8.98</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #00B050\"><div class=\"thumb tright\"></div><p>This episode explores \"Planet Earth's final frontier\": <span>caves</span>. At a depth of 400 metres (1,300  ft), Mexico's <span>Cave of Swallows</span> is Earth's deepest <span>pit cave</span> freefall drop, allowing entry by <span class=\"mw-redirect\">BASE jumpers</span>. Its volume could contain <span>New York City</span>'s <span>Empire State Building</span>. In this episode divers explore the otherworldly <span class=\"mw-redirect\">cenotes</span> of the <span>Yucatán Peninsula</span>, appearing to be flying in water (because it is so clear), allowing viewers a glimpse of the hundreds of kilometers of caves that have already been mapped. The <span class=\"mw-redirect\">Waitomo Caves</span> with the <i><span>Arachnocampa luminosa</span></i> is also shown. Also featured is <span>Borneo</span>'s <span>Deer Cave</span> and <span class=\"mw-redirect\">Gomantong Cave</span>. Inhabitants of the former include three million <span>wrinkle-lipped free-tailed bat</span>, which have deposited <span>guano</span> on to an enormous mound. In <span class=\"mw-redirect\">Gomantong Cave</span>, guano is many metres high and is blanketed with hundreds of thousands of <span class=\"mw-redirect\">cockroaches</span> and other invertebrates. Also depicted are eyeless, subterranean creatures, such as the <span>Texas blind salamander</span> and (bizarrely) a species of <span>crab</span>. <span>Carlsbad Caverns National Park</span> is featured with its calcite formations. Mexico's <span>Cueva de Villa Luz</span> is also featured, with its flowing stream of <span class=\"mw-redirect\">sulphuric acid</span> and <span>snottite</span> formations made of living bacteria. A fish species, the shortfin molly, has adapted to this habitat. The programme ends in <span>New Mexico</span>'s <span>Lechuguilla Cave</span> (discovered in 1986) where sulphuric acid has produced unusually ornate, <span>gypsum</span> crystal formations.</p><i>Planet Earth Diaries</i> reveals how a camera team spent a month among the cockroaches on the guano mound in Gomantong Cave and describes the logistics required to photograph Lechuguilla. Permission for the latter took two years and local authorities are unlikely to allow another visit.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Deserts\"</td><td style=\"text-align:center\">2 April 2006</td><td style=\"text-align:center\">1 April 2007</td><td style=\"text-align:center\">9.23</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #00B050\"><p>This instalment features the harsh environment that covers one-third of the land on Earth: the <span>deserts</span>. Due to <span>Siberian</span> winds, <span>Mongolia</span>'s <span>Gobi Desert</span> reaches extremes of temperature like no other, ranging from −40 °C to +50 °C (−40 °F to 122 °F). It is home to the rare <span>Bactrian camel</span>, which eats snow to maintain its fluid level and must limit itself to 10 liters (2.6 U.S. gal; 2.2 imp gal) a day if it is not to prove fatal. <span>Africa</span>'s <span class=\"mw-redirect\">Sahara</span> is the size of the United States, and just one of its severe <span>dust storms</span> could cover the whole of <span>Great Britain</span>. While some creatures, such as the <span>dromedary</span>, take them in their stride, for others the only escape from such bombardments is to bury themselves in the sand. Few rocks can resist them either and the outcrops shown in <span>Egypt</span>'s <span>White Desert</span> are being inexorably eroded. The biggest dunes (300 m or 1,000 ft high) are found in <span>Namibia</span>, while other deserts featured are <span>Death Valley</span> in <span>California</span> and <span>Nevada</span>, the <span>Sonoran</span> in <span>Arizona</span>, the deserts of <span>Utah</span>, all in the United States, the <span>Atacama</span> in <span>Chile</span>, and areas of the Australian outback. Animals are shown searching for food and surviving in such an unforgiving habitat: <span>African elephants</span> that walk up to 80 kilometres (50 mi) per day to find food; <span>lions</span> (hunting <span>oryx</span>); <span>red kangaroos</span> (which moisten their forelegs with saliva to keep cool); nocturnal <span>fennec foxes</span>, acrobatic <span class=\"mw-redirect\">flat lizards</span> feeding on <span>black flies</span>, and duelling <span>Nubian ibex</span>. The final sequence illustrates one of nature's most fearsome spectacles: a billion-strong plague of <span>desert locusts</span>, destroying all vegetation in its path.</p><i>Planet Earth Diaries</i> explains how the hunt for the elusive Bactrian camels necessitated a two-month trek in Mongolia.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Ice Worlds\"</td><td style=\"text-align:center\">5 November 2006</td><td style=\"text-align:center\">1 April 2007</td><td style=\"text-align:center\">6.37</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #00B050\"><div class=\"thumb tright\"></div><p>The sixth programme looks at the regions of the <span>Arctic</span> and <span>Antarctica</span>. The latter contains 90% of the world's ice, and stays largely deserted until the spring, when visitors arrive to harvest its waters. <span>Snow petrels</span> take their place on <span>nunataks</span> and begin to court, but are preyed on by <span>south polar skuas</span>. During summer, a pod of <span>humpback whales</span> hunt <span>krill</span> by creating a spiralling net of bubbles. The onset of winter sees the journey of <span>emperor penguins</span> to their breeding grounds, 160 kilometres (99 mi) inland. Their eggs transferred to the males for safekeeping, the females return to the ocean while their partners huddle into large groups to endure the extreme cold. At the northern end of the planet, Arctic residents include <span class=\"mw-redirect\">musk oxen</span>, who are hunted by <span>Arctic foxes</span> and <span>wolves</span>. A female <span>polar bear</span> and her two cubs head off across the ice to look for food. As the sun melts the ice, a glimpse of the Earth's potential future reveals a male polar bear that is unable to find a firm footing anywhere and has to resort to swimming—which he cannot do indefinitely. His desperate need to eat brings him to a colony of <span>walrus</span>. Although he attacks repeatedly, the herd is successful in evading him by returning to the sea. Wounded and unable to feed, the bear will not survive. Meanwhile, back in Antarctica, the eggs of the emperor penguins finally hatch while two adult Polar bear cubs from Arctic travels onward as they wander across vast track of frozen ocean independently from their mother.</p><i>Planet Earth Diaries</i> tells of the battle with the elements to obtain the penguin footage and of unwelcome visits from polar bears.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Great Plains\"</td><td style=\"text-align:center\">12 November 2006</td><td style=\"text-align:center\">8 April 2007</td><td style=\"text-align:center\">6.72</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #00B050\"><p>This episode deals with <span>savanna</span>, <span>steppe</span>, <span>tundra</span>, <span>prairie</span>, and looks at the importance and resilience of <span class=\"mw-redirect\">grasses</span> in such treeless ecosystems. Their vast expanses contain the largest concentration of animal life. In <span>Outer Mongolia</span>, a herd of <span>Mongolian gazelle</span> flee a <span>bush fire</span> and is forced to find new grazing, but grass self-repairs rapidly and soon reappears. Over Africa's savanna, a swarm of 1.5 billion <span>red-billed queleas</span> are caught on camera, the largest flock of birds ever depicted. On the Arctic tundra during spring, millions of <span>migratory</span> <span>snow geese</span> arrive to breed and their young are preyed on by Arctic foxes. Meanwhile, <span>time-lapse photography</span> depicts moving herds of caribou as a calf is brought down by a chasing wolf. On the <span>North American</span> prairie, <span>bison</span> engage in the ritual to establish the dominant males. In <span>Veld</span> of <span>South Africa</span>, flowers began to openly bloom every summer allowing <span>Ostriches</span> and <span>springboks</span> to thrive before nightfall. The <span>Tibetan Plateau</span> is the highest of the plains and despite its relative lack of grass, animals do survive there, including <span>yak</span> and <span>wild ass</span>. However, the area's most numerous resident is the <span>pika</span>, whose nemesis is the <span>Tibetan fox</span>. In tropical India, the tall grasses hide some of the largest creatures,such as <span class=\"mw-redirect\">Indian Elephants</span> and <span>Indian rhinoceros</span>, and also the smallest, such as the <span>pygmy hog</span> and <span>Lesser florican</span>. The final sequence depicts <span>African bush elephants</span> that are forced to share a waterhole with a pride of thirty lions. The insufficient water makes it an uneasy alliance and the latter gain the upper hand during the night when their hunger drives them to hunt and eventually kill one of the pachyderms.</p><i>Planet Earth Diaries</i> explains how the lion hunt was filmed in darkness using <span>infrared</span> light.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Jungles\"</td><td style=\"text-align:center\">19 November 2006</td><td style=\"text-align:center\">15 April 2007</td><td style=\"text-align:center\">7.04</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #00B050\"><div class=\"thumb tright\"></div><p>This episode examines <span>jungles</span> and <span>tropical rainforests</span>. These environments occupy only 3% of the land yet are home to over half of the world's species. <span>New Guinea</span> is inhabited by almost 40 kinds of <span class=\"mw-redirect\">birds of paradise</span>, which avoid conflict with each other by living in different parts of the island. Some of their elaborate courtship displays are shown. Within the dense <span class=\"mw-redirect\">forest canopy</span>, <span>sunlight</span> is prized, and the death of a <span>tree</span> triggers a race by saplings to fill the vacant space. <span>Figs</span> are a widespread and popular food, and as many as 44 types of <span>bird</span> and <span>monkey</span> have been observed picking from a single tree. The sounds of the jungle throughout the day are explored, from the early morning calls of <span>siamangs</span> and <span>orangutans</span> to the nocturnal cacophony of courting <span>tree frogs</span>. The importance of <span>fungi</span> to the <span>Amazon rainforest</span> is illustrated by a sequence of them fruiting, including a <span>parasite</span> that infested insects, called <span>cordyceps</span>. In <span>Borneo</span>, nocturnal <span>colugo</span> is one of the rare species ever discovered and travels two miles while foraging for young leaves.The mutual benefits of the relationship between carnivorous <span>pitcher plants</span> and red <span class=\"mw-redirect\">crab spiders</span> is also discussed. In the <span>Congo</span>, roaming <span>forest elephants</span> are shown reaching a clearing to feed on essential <span>clay</span> minerals within the mud. Finally, <span class=\"mw-redirect\">chimpanzees</span> are one of the few jungle animals able to traverse both the forest floor and the canopy in search of food. In <span>Uganda</span>, members of a 150-strong community of the primates mount a raid into neighbouring territory in order to gain control of it.</p><i>Planet Earth Diaries</i> looks at filming displaying birds of paradise, focusing mainly on the filming of the <span>six-plumed bird of paradise</span>. \"Jungles\" served as a major inspiration in developing the video game <i><span>The Last of Us</span></i>, which features a mutated strain of the cordyceps fungus infecting humans and almost destroying mankind.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Shallow Seas\"</td><td style=\"text-align:center\">26 November 2006</td><td style=\"text-align:center\">8 April 2007</td><td style=\"text-align:center\">7.32</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #00B050\"><p>This programme is devoted to the shallow seas that fringe the world's <span>continents</span>. Although they constitute 8% of the oceans, they contain most marine life. As <span class=\"mw-redirect\">humpback whales</span> return to breeding grounds in the tropics, a mother and its calf are followed. While the latter takes in up to 500 litres of milk a day, its parent will starve until it travels back to the poles to feed—and it must do this while it still has sufficient energy left for the journey. The coral reefs of <span>Indonesia</span> are home to the biggest variety of ocean dwellers, including the <span>Pygmy seahorses</span>, and <span>file clam</span>. Other ocean dwellers such as banded sea <span>kraits</span>, which ally themselves with <span>goatfish</span> and <span>trevally</span> in order to hunt. Beyond the coral stretches the world of shifting sands, ocean dwellers, such as <span class=\"mw-disambig\">Gurnard</span>, <span class=\"mw-redirect\">Jawfish</span>, <span>Green sea turtle</span>, and <span class=\"mw-redirect\">Wonderpus octopus</span>, are forced to cope with their environment through crucial camouflage and foraging where they have nowhere else hide. In <span>Shark Bay</span> of <span>Western Australia</span>, <span>Dugongs</span> forage across the largest aquatic grassland  eating tons of seagrasses a day while <span>bottlenose dolphins</span> perform their \"hydroplane\" in the shallowest waters to catch a meal. Meanwhile in the desert shores of <span>Bahrain</span>, 100,000 <span>Socotra cormorants</span> rely on <span>shamals</span> that blow sand grains into the nearby <span>Persian Gulf</span>, transforming it into a rich fishing ground. The appearance of <span>algae</span> in the spring starts a food chain that leads to an abundant harvest of <span>Salps</span>, <span>Krills</span>, and <span>comb jellies</span>. As shoals of migratory fish feasts on the krills, <span>sea lions</span> and <span>dusky dolphins</span> are among those taking advantage of it. Within the coastline of <span>California</span>, <span class=\"mw-redirect\">Giant kelps</span> fertilizes algaes making them the tallest kelps ever recorded which causes group of <span>Sea urchins</span> to infest them creating urchin barrens. Within the urchin barrens, group of <span>starfishes</span>, <span>sand dollars</span>, and <span>brittle stars</span> scavenge across the barrens while facing against their fierce predator, <span>Sunflower sea star</span>. In <span>Southern Africa</span>, as <span>chokka squid</span> are preyed on by <span>short-tail stingray</span> and <span>sand tiger shark</span>, the <span class=\"mw-redirect\">Cape fur seals</span> that share the waters are hunted by the world's largest predatory fish—the <span>great white shark</span>. On <span>Marion Island</span> in the <span>Indian Ocean</span>, a group of <span>king penguins</span> must cross a beach occupied by neighboring <span class=\"mw-redirect\">Elephant seals</span> that are harmless and predatory <span class=\"mw-redirect\">Fur seals</span> that do not hesitate to attack them. In spring, The humpback whales ended their winter migration as they travel to the polar seas of the <span>Bering Sea</span> along with five million <span class=\"mw-redirect\">shearwaters</span>, migrated from Australia, as they flourish across the shallow waters for krills. The programme ends with the mother and calf, who is now old enough to separate with its mother and continues its epic journey across the ocean.</p><i>Planet Earth Diaries</i> shows the difficulties of filming the one-second strike of a great white shark, filmed by <span class=\"mw-redirect\">Simon King</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Seasonal Forests\"</td><td style=\"text-align:center\">3 December 2006</td><td style=\"text-align:center\">22 April 2007</td><td style=\"text-align:center\">7.42</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #00B050\"><div class=\"thumb tright\"></div><p>The penultimate episode surveys the <span class=\"mw-redirect\">coniferous</span> and <span>deciduous</span> seasonal <span>woodland</span> habitats—the most extensive forests on Earth. Conifers begin sparsely in the <span>subarctic</span> but soon dominate the land, and the <span>taiga</span> circles the globe, containing a third of all the Earth's trees. Few creatures can survive the Arctic climate year round, but the <span>moose</span>, <span class=\"mw-redirect\">capercaillie</span>, and <span>wolverine</span> are exceptions. 1,600 kilometres (990 mi) to the south, on the <span>Pacific</span> coast of North America, conifers have reached their full potential. These include some of the world's <span>tallest trees</span>: the <span>redwoods</span>. Here, a <span>pine marten</span> is shown stalking a <span>squirrel</span>, and <span>great grey owl</span> chicks take their first flight. Further south still, in <span>Chile</span>'s <span class=\"mw-redirect\">Valdivian forests</span>, a population of smaller animals exist, including the <span class=\"mw-redirect\">pudú</span> and the <span>kodkod</span>. During spring in a European broad-leafed forest, a <span>mandarin duck</span> leads its day-old family to leap from its tree trunk nest to the leaf litter below. The <span class=\"mw-redirect\">Bialowieza Forest</span> typifies the habitat that characterised Europe around 6,000 years ago: only a fragment remains in <span>Poland</span> and <span>Belarus</span>. On a summer night on North America's east coast, <span class=\"mw-redirect\">periodical cicadas</span> emerge en masse to mate—an event that occurs every seventeen years. After revisiting Russia's <span>Amur leopards</span> in winter, a time-lapse sequence illustrates the effect of the ensuing spring on the deciduous forest floor. In India's teak forests, a <span class=\"mw-redirect\">langur monkey</span> strays too far from the <span>chital</span> that act as its sentinels and falls prey to a <span>tiger</span>. In <span>Madagascar</span>, <span class=\"mw-redirect\">mouse lemurs</span> feed on the nectar of flowering <span>baobab</span> trees.</p><i>Planet Earth Diaries</i> explains how aerial shots of the <span>baobab</span> were achieved by the use of a <span>cinebulle</span>, an adapted <span>hot air balloon</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep11\" style=\"text-align:center\">11</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Ocean Deep\"</td><td style=\"text-align:center\">10 December 2006</td><td style=\"text-align:center\">25 March 2007</td><td style=\"text-align:center\">6.02</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #00B050\"><p>The final instalment concentrates on the least explored area of the planet—the <span class=\"mw-redirect\">deep ocean</span>. It begins with a <span>whale shark</span> used as a shield by a shoal of <span>bait fish</span> to protect themselves from <span>yellowfin tuna</span>. Also shown is an <span>oceanic whitetip shark</span> trailing rainbow runners. Meanwhile, a 500-strong school of <span>dolphins</span> head for the <span>Azores</span>, where they work together to feast on <span>scad mackerel</span> along with a flock of <span>shearwaters</span>. Down in the ocean's furthest reaches, some creatures defy classification. Beneath the dark seafloor, <span class=\"mw-redirect\">Deep sea creatures</span> such as the <span>sea spider</span> filtering on marine snow, <span>sawtooth eel</span> gazing upward for prey shimmering from above the surface, <span class=\"mw-redirect\">Dumbo octopus</span> roaming through the dark void, <span>Vampire squid</span> performing a special display of defense and predation, <span class=\"mw-redirect\">Monkfish</span> luring prey for necessities, and the <span>spider crab</span> bid their time, awaiting carrion from above along with eels and <span class=\"mw-redirect\">woodlices</span>.  The volcanic mountain chain at the bottom of the <span>Atlantic Ocean</span> also sustains life through the bacteria that surround its sulphide vents which allows shrimps to feed. Within the Western Pacific bordering <span>Japan</span> lies the Dragon chimneys erupted from thermal vents where different forms of baterias thrives. In <span class=\"mw-redirect\">Atlantic</span>, <span>Squat lobsters</span> settle near the hydrothermal vents grazing on bacterias. From the depths of Galapagos Island at the site of the Nine North, the chimneys provides energy for <span>tube worms</span> to grow and support settlement, but after nine months the chimneys turns cold causing the tube worms to wither and extinguished. There are thought to be around 30,000 <span class=\"mw-redirect\">undersea volcanoes</span>, some of them taller than <span>Mount Everest</span>. Their sheer cliffs provide anchorage for several corals and sponges. Nearer the surface, the currents that surround these <span>seamounts</span> force nutrients up from below and thus marine life around them is abundant, which allows the <span>Nautilus</span> to forage freely before retreat to the depth. Thirty miles away, the shoal of squids jets upwards to the stream to hunt small fish and planktons while avoiding the <span>pacific spotted dolphins</span> as they use sonar to confuse their prey. The giant <span class=\"mw-redirect\">Mola Mola</span> settle at reef for cleaning via <span class=\"mw-redirect\">butterfly fish</span> feeding parasites and cool temperature. <span>Ascension Island</span> is a nesting ground for <span>frigatebirds</span> and <span class=\"mw-redirect\">green turtles</span>. Off the <span>Mexican</span> coast, a large group of <span>sailfish</span> feed on another shoal of bait fish, changing colour to signal their intentions to each other, allowing them to coordinate their attack. The last sequence depicts the largest animal on Earth—the <span>blue whale</span>, of which 300,000 once roamed the world's oceans with 3000 individuals roam the planet which they are now fewer than 3% remain.</p><i>Planet Earth Diaries</i> shows the search in the <span class=\"mw-redirect\">Bahamas</span> for oceanic whitetip sharks.</td></tr></tbody></table><blockquote>\"Our planet is still full of wonders. As we explore them, so we gain not only understanding, but power. It's not just the future of the whale that today lies in our hands: it's the survival of the natural world in all parts of the living planet. We can now destroy or we can cherish. The choice is ours.\"— David Attenborough, in closing</blockquote><br/><h3>Planet Earth: The Future</h3><p>The latter episodes were supplemented by Planet Earth: The Future, a series of three 60-minute films that highlight the conservation issues surrounding some of the featured species and environments. The programmes are narrated by Simon Poland and the series producer was Fergus Beeley. The series began transmission on BBC Four after the ninth episode, \"Shallow Seas\".</p><br/><h3>Feature film</h3><p>Alongside the commissioning of the television series, BBC Worldwide and GreenLight Media secured financing for a US$15 million film version of Planet Earth. This followed the earlier success of Deep Blue, the BBC's 2003 theatrical nature documentary which used re-edited footage from The Blue Planet. The film was co-directed by Alastair Fothergill and Mark Linfield and produced by Alix Tidmarsh and Sophokles Tasioulis. Only 30% of the footage shown in Earth is new, with the remainder being reworked from the television series to suit the narrative of the film. David Attenborough was replaced as narrator by high-profile actors: Patrick Stewart for the UK market and James Earl Jones for the United States.</p><p>Earth had its worldwide premiere in September 2007 at the San Sebastián International Film Festival in San Sebastián, Spain, in Basque Country. Lionsgate released the film in several international markets over the following year. In the United States, it became the first film to be released by Disneynature, the Walt Disney Company's new nature documentary arm. When released on Earth Day 2009 it set the record for the highest opening weekend gross for a nature documentary, and went on to become the third highest grossing documentary of all time. It has grossed more than $108 million worldwide; in the nature documentary genre, only March of the Penguins has achieved greater box-office success.</p><br/><h3>Reception</h3><h4>Critical reception</h4><p>Planet Earth received widespread critical acclaim. On review aggregation website Rotten Tomatoes, the miniseries has an approval rating of 95% based on 22 reviews, with an average rating of 9/10. The critical consensus reads \"Planet Earth weaves innovative camera techniques and patient observation to deliver viewers an astounding glimpse of the world's perils and wonders, capturing jaw-dropping scenery and animals on both an epic and intimate scale.\" Time magazine's James Poniewozik named it one of the Top 10 New TV Series of 2007, ranking it at No. 4. In 2019, Planet Earth and its sequel were ranked 72nd on The Guardian's list of the 100 best TV shows of the 21st century.</p><h4>Accolades</h4><p>Planet Earth: From Pole to Pole won the Science and Natural History award at the Royal Television Society Programme Awards in 2007. The RTS also awarded it a Judge's Award and a Photography Award at its Craft and Design Awards. The series picked up two awards from the Broadcasting Press Guild for Best Documentary Series and Innovation in Broadcasting, and won Best Documentary Series at the 2007 Broadcast Awards. At the 2007 BAFTA Television Awards, Planet Earth was nominated in the Specialist Factual and Pioneer Audience Award categories, but lost out to Nuremberg: Goering's Last Stand and Life on Mars respectively. It received three nominations at the BAFTA Television Craft Awards later the same year. George Fenton's original score won him Soundtrack Composer of the Year at the 2007 Classical BRIT Awards. Planet Earth was also nominated for the NTA for Most popular Factual program but lost to Top Gear (Supernanny and Bad Lad's Army: Officer Class were also nominated).</p><p>Planet Earth was recognised by the American television industry, collecting the award for Nonfiction Series at the 59th Primetime Emmy Awards in September 2007 and winning a further three prizes in technical categories at the Creative Arts Emmy Awards. It also collected two awards from the Television Critics Association in Los Angeles in July 2007 and a Peabody Award in April 2008.</p><p>The series was also fêted at wildlife film festivals around the globe, collected multiple prizes at the Wildscreen Festival 2006, the International Wildlife Film Festival 2007 and the Jackson Hole Wildlife Film Festival 2007.</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Nominee</th><th>Result</th><th class=\"unsortable\"><abbr title=\"References\">Ref.</abbr></th></tr><tr><td rowspan=\"3\">2006</td><td rowspan=\"3\"><span>Royal Television Society Craft &amp; Design Awards</span></td><td>Lighting, Photography and Camera - Photography (Documentary/Factual &amp; Non Drama Productions)</td><td>Photography Team <span style=\"font-size:85%;\">(for \"From Pole to Pole\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"3\"></td></tr><tr><td>Sound - Entertainment &amp; Non Drama Productions</td><td>Andrew Wilson, Graham Wild, Kate Hopkins, Tim Owens</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Judges' Award</td><td rowspan=\"2\"><i>Planet Earth</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"20\">2007</td><td rowspan=\"7\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Documentary or Nonfiction Series</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"7\"></td></tr><tr><td><span>Outstanding Cinematography for a Nonfiction Program</span></td><td><span>Doug Allan</span>, Martyn Colbeck, Paul Stewart, Simon King, Michael Kelem and Wade Fairley <small>(for \"Pole to Pole\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Music Composition for a Series</span></td><td><span>George Fenton</span> <small>(for \"Pole to Pole\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Picture Editing for a Nonfiction Program</span></td><td>Andy Netley <small>(for \"Mountains\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Sound Editing for a Nonfiction or Reality Program (Single or Multi-Camera)</span></td><td>Kate Hopkins <small>(for \"Pole to Pole\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Primetime Emmy Award for Outstanding Sound Mixing for a Nonfiction or Reality Program (Single or Multi-Camera)</span></td><td>Graham Wild <small>(for \"Pole to Pole\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Writing for a Nonfiction Programming</span></td><td>Vanessa Berlowitz and Gary Parker <small>(for \"Mountains\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>British Academy Television Awards</span></td><td><span>Best Specialist Factual</span></td><td rowspan=\"2\"><i>Planet Earth</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"5\"></td></tr><tr><td>Audience Award</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>British Academy Television Craft Awards</span></td><td><span>Best Original Television Music</span></td><td><span>George Fenton</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Photography: Factual</span></td><td>Camera Team</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Sound: Factual</span></td><td>Andrew Wilson, Kate Hopkins, Tim Owens, Graham Wild</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Saturn Awards</span></td><td><span>Best DVD Television Release</span></td><td><i>Planet Earth: The Complete BBC Series</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td colspan=\"2\"><span>Peabody Award</span></td><td rowspan=\"2\"><i>Planet Earth</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Producers Guild of America Awards</span></td><td><span>Best Non-Fiction Television</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Royal Television Society Programme Awards</span></td><td>Science &amp; Natural History</td><td>\"From Pole to Pole\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>Royal Television Society Craft &amp; Design Awards</span></td><td>Photography - Documentary/Factual &amp; Non-Drama</td><td>Camera Team <span style=\"font-size:85%;\">(for \"Ice Worlds\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"3\"><span>Television Critics Association Awards</span></td><td><span>Program of the Year</span></td><td rowspan=\"3\"><i>Planet Earth</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\"></td></tr><tr><td><span>Outstanding Achievement in Movies, Miniseries and Specials</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Achievement in News and Information</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><h4>Audience response</h4><p>The credentials of the filmmakers, the size of the production, a high-profile marketing campaign and a primetime BBC One timeslot all resulted in Planet Earth attracting large audiences when it debuted in the UK in March 2006. The first episode, \"From Pole to Pole\", was watched by more people than any natural history programme since Attenborough and Fothergill's previous series, The Blue Planet, in 2001. The first five episodes drew an average audience of 11.4 million viewers, including the early evening repeats, outperforming even The Blue Planet. When the series returned to British screens after a six-month break, it remained popular but viewing figures did not reach the same levels. The final six episodes attracted an average audience of 6.8 million viewers, appreciably lower than the spring episodes, but still higher than BBC One's average for the timeslot. The BBC's 2007 Annual Report revealed that the series \"received the highest audience appreciation score of any British programme on TV this year\".</p><p>In the United States, Planet Earth drew equally impressive ratings when it premiered on Discovery and Discovery HD Theater on 25 March 2007. The first three episodes (screened back to back) averaged 5.72 million viewers with a peak of 6.07 million viewers, giving the network its third highest audience ever. It was also the most watched Discovery programme since The Flight That Fought Back in 2005.</p><br/><h3>Sequel</h3><p>In February 2016, the BBC announced a six-part sequel had been commissioned, titled Planet Earth II, for release in late 2016, with Sir David Attenborough returning as narrator and presenter. As with the 2006 series, the trailer features the track 'Hoppipolla' by Icelandic group Sigur Ros.</p><br/><h3>Merchandise</h3><p>The popularity of the television series around the world translated into strong sales of associated Planet Earth merchandise. In the United States, it became the fastest and bestselling documentary DVD in Discovery Channel's history, and the high-definition (HD) discs generated US$3.2 million in sales in just two months. By the end of 2007, U.S. sales had topped 3 million units, making it the highest-grossing HD title and one of the top ten DVD titles of the year.</p><p>In addition, the brand was licensed to other companies to produce children's books, calendars, a board game, jigsaws, stationery, cards, and more.</p><h4>DVD</h4><p>A five-disc DVD box set of the complete series (BBCDVD1883) was released in the UK for Regions 2 and 4 (PAL) on 27 November 2006 by 2 entertain. It is presented in 5.1-channel Dolby Digital surround sound and 16:9 widescreen video. The bonus features include Planet Earth Diaries (presented immediately after each episode as for the original TV broadcast) and Planet Earth: The Future. In the United States, two versions of the same five-disc set were released as a Region 1 (NTSC) DVD on 24 April 2007. The BBC Warner release retained David Attenborough's narration from the original British television broadcasts, but the Discovery Channel edition used the alternative Sigourney Weaver voice-over. Even in the United States the Attenborough version was much the better for sales.</p><h4>HD DVD and Blu-ray</h4><p>Except for a small amount of extremely hard-to-obtain footage, Planet Earth was filmed entirely in high-definition, and consequently became one of the first television series to take advantage of the new HD disc formats.</p><p>The series was released in both Blu-ray and HD DVD formats as a five-disc Region B box set on 12 November 2007. On the fifth disc, the bonus features from the standard-definition DVD set were replaced by two episodes from the BBC's Natural World series, \"Desert Lions\" and \"Snow Leopard: Beyond the Myth\", both also presented in high-definition.</p><p>In the United States, the series was released as a four-disc set in both high-definition formats, the Blu-ray version on single-layer BD-25 discs and the HD DVD set on dual-layer HD DVD-30 discs. The first U.S. high-definition releases omitted the extra disc of bonus features from the standard-definition boxed set, though these extras were included with new material in a special-edition Blu-ray released in 2011.</p><h4>Books</h4><p>Four official tie-in volumes were published by BBC Books in 2006 and 2007:</p><ul><li>Planet Earth: As You've Never Seen It Before, written by Alastair Fothergill with a foreword by David Attenborough, was published in hardback on 5 October 2006 (ISBN 978-0563522126).</li><li>The paperback title Planet Earth: The Future was also published on 5 October 2006 (ISBN 978-0563539056). It was edited by Fergus Beeley and Rosamund Kidman Cox with a foreword by Jonathon Porritt.</li><li>A second paperback volume revealed some of the tales from the field during filming expeditions. Planet Earth: The Making of an Epic Series was written by David Nicholson-Lord and published on 9 March 2006 (ISBN 978-0563493587).</li><li>A collection of still images from the series was published in a hardcover volume as Planet Earth: The Photographs on 7 October 2007 (ISBN 978-1846073465).</li></ul><h4>Soundtrack album</h4><p>On 20 November 2006, a two-disc soundtrack CD was released with a compilation of the incidental music specially commissioned for Planet Earth. The award-winning score was composed by George Fenton and performed by the BBC Concert Orchestra and has been performed during \"Planet Earth Live\" events in the United States and the United Kingdom.</p><br/>"
  },
  "errorMessage": ""
}