{
  "imDbId": "tt1641384",
  "title": "Young Justice",
  "fullTitle": "Young Justice (TV Series 2010–2022)",
  "type": "TVSeries",
  "year": "2010",
  "items": [
    {
      "username": "Johnny-the-Film-Sentinel-2187",
      "userUrl": "https://www.imdb.com/user/ur24085266",
      "reviewLink": "https://www.imdb.com/review/rw4240981",
      "warningSpoilers": false,
      "date": "16 July 2018",
      "rate": "9",
      "helpful": "38 out of 43 found this helpful.",
      "title": "Young Justice is the follow-up to the DC-Animated-Universe we all deserved.",
      "content": "Don't confuse this show with Teen Titans or anything like that; yes there are adolescent teens in this show discovering their potential like many other great kids shows on the market, like Avatar, Steven Universe, Adventure Time, DragonBall, The Legend of Korra and so-forth, but Young Justice is like a spiritual sequel to the Justice League & Justice League Unlimited cartoons from the 2000s and more. This cartoon is super kick-ass stuff! It's what superhero shows like Ultimate Spider-Man WANT to be, but struggle to find the right balance between entertainment and broadly appealing wisdom that kids and adults can enjoy in the same way. Young Justice masters that: it's got solid drama, nice splashes of humor throughout and of course some great action that shows this great team working some difficult stuff out.This superhero fest gets 4.5/5 stars."
    },
    {
      "username": "Rectangular_businessman",
      "userUrl": "https://www.imdb.com/user/ur13538926",
      "reviewLink": "https://www.imdb.com/review/rw2723556",
      "warningSpoilers": true,
      "date": "22 December 2012",
      "rate": "8",
      "helpful": "28 out of 33 found this helpful.",
      "title": "Too awesome for words",
      "content": "\"Young Justice\" is simply one of the best animated shows from the recent years.At first I thought it was going to be another anime-influenced series like \"Teen Titans\". Fortunately, it surpassed all my expectations, following the same tradition of other mature and well made animations inspired in DC comics, like the \"Batman\", \"Superman\" and \"Justice League\" series from the nineties.\"Young Justice\" had a great script in every episode, is funny to watch, has likable and interesting characters, and also has a great animation with pretty cool designs, which combine modern and classic elements, with excellent results.In my opinion, this is a flawless series which I would recommend to anyone.10/10 (And I would give this 11 stars if I could)"
    },
    {
      "username": "rapettif",
      "userUrl": "https://www.imdb.com/user/ur36131943",
      "reviewLink": "https://www.imdb.com/review/rw5494481",
      "warningSpoilers": false,
      "date": "19 February 2020",
      "rate": "9",
      "helpful": "46 out of 52 found this helpful.",
      "title": "Season 1 & 2 are great. Season 3 is dissapointing.",
      "content": "This is a good example of why you shouldn't cancel a great show like this. And if it does gets cancelled, it would be a good idea to hear the fans, and re-establish it as soon as possible, and with the same writers and overall team. I'll keep the rating, but that's meant just for season 1 & 2. Season 3 would rate much lower."
    },
    {
      "username": "tollyjamesmaggs",
      "userUrl": "https://www.imdb.com/user/ur25204328",
      "reviewLink": "https://www.imdb.com/review/rw2566524",
      "warningSpoilers": false,
      "date": "15 February 2012",
      "rate": "10",
      "helpful": "130 out of 143 found this helpful.",
      "title": "One of THE best DC cartoons of all time, in my opinion.",
      "content": "DC has always been well known for making fantastic children's cartoons that can be aimed for the hardcore adult fans as-well, bringing nothing but top-notch shows. However, in recent years, it seems that the quality of DC cartoons have dropped. The two main shows that come to mind are \"The Batman\", a terrible show which is clearly aimed at the younger audience, and \"Batman: The brave and bold\", A decent cartoon that isn't on par with classic DC cartoons. However, this cartoon has brought back the best parts of the best DC cartoons and combined them into one. The \"Justice League\" series was fantastic, but as the series went on it was clear that each episode focused on the development of particular characters (Especially in JL: Unlimited) which did not have an ultimate affect in the series. episode was a one-off that usually didn't require viewing of the previous or next episode. Young Justice saw this, and tried to do something new. Firstly, it made sure that the team stays small, like the early days of the Justice League, so that it could make these characters actually important to the plot lines. Secondly, it made each episode a one-off adventure that tied to a single string plot that brought each episode together. JL and JL:U did this a few times, but Young Justice has a clear sense of what's happening in the plot, and what the characters are going through. THIS is why I love Young Justice: it knows what it is trying to do, and it makes you constantly want more.The cartoon style is an updated version of the Justice League's animation style, which shows both seriousness in the tone of the storyline, and the professionalism of the series as a whole. Teen Titans was a 'fun' series, but it was difficult sometimes to accept the serious moments amidst the childish artwork. That's not so much a complaint of Teen Titans, but I appreciate what Young Justice is doing and I prefer it.Voice work is fine, and the music works. Both are easily above par. I actually think EVERY voice is great, even Batman's (even though I am a die-hard Conroy fan, Bruce Greenwood gives a voice I would definitely expect from Batman). There is one exception, though: I was not impressed by the Joker's voice, or his character. I could see they were trying to make him more \"Sane\", but that doesn't work, as the character should be the definition of insanity. However, he only appears once, and the other actors are really good.If you look at my other reviews, you can see that I often give good scores in my reviews. Let me clarify that I am not always giving full marks to what I like, but I prefer to review great shows/movies which I think deserve to be praised. This is definitely a show that deserves to be praised, and I hope the show goes on to be very successful. Bottom line: Fantastic. I would recommend to anyone, not just DC fans."
    },
    {
      "username": "oliverriordan",
      "userUrl": "https://www.imdb.com/user/ur135949016",
      "reviewLink": "https://www.imdb.com/review/rw8147509",
      "warningSpoilers": false,
      "date": "15 May 2022",
      "rate": "6",
      "helpful": "24 out of 28 found this helpful.",
      "title": "Greatness followed by a slow decline",
      "content": "The first season of \"Young Justice\" is phenomenal, and completely worth checking out. It was a great introduction to these underutilized characters and had no trouble incorporating appearances from other more recognizable characters. But, as the show goes on more and more characters are added, and it gets more difficult to have connections with them, especially when their all fighting for screen time. Characters who I've never heard of before are introduced offscreen, and the show expects you know who they are despite there being no proper introduction to them. This problem is more prevalent in seasons 3 and 4, and isn't helped by the political messages that these seasons adopt. It's great that this show is giving representation to groups with a lack of representation, but it can be extremely pandering at times, as they use scenarios that act as metaphors for racism and homophobia. So while this first season is great, and some of the second season as well, the third and fourth season bring this show down for me. It's a very flawed show, but I can't ignore the good things."
    },
    {
      "username": "WeAreLive",
      "userUrl": "https://www.imdb.com/user/ur79460801",
      "reviewLink": "https://www.imdb.com/review/rw3781752",
      "warningSpoilers": true,
      "date": "16 August 2017",
      "rate": "10",
      "helpful": "16 out of 19 found this helpful.",
      "title": "Best DC show ever",
      "content": "I must say I am very impressed by this series it almost made me forget about Teen Titans. The episodes are all well written, the stories are amazing, the voice acting and character development is awesome and the animation is top notch. I am very happy this is coming back for a season 3 which I have been wanting for the last two years and unlike some people I actually patiently waited for season 3 and didn't watch the show a billion until I lost interest. (not going to mention who) Instead I got into other shows which I had never seen before like the rest of the DCAU, Green Lantern the animated series, Beware the Batman, the Star Wars franchise, some marvel shows and Yo Kai Watch (which kept my mind off the show for a bit)Okay at first when discovered this show I thought what the hell am I watch but when I watched it from start to finish the show grew on me alongside the characters within this show. However it did take time for me to get used to Superboy getting angry a lot, Miss Martian saying \"Hello Meagan\" every two minutes and Kid Flash being annoying. But this wasn't always the case because I got used to it after 5 episodes. This show even showed me never to judge someone by there appearance (Image and Episode 25) and not to hide secrets behind your close friends (The Fix). Spoiler alert: Kid Flash dies but lets hope that is not true. Even though there was one thing I didn't like about Miss Martian as I stated above call me crazy but I actually had a crush on her in the first season her cute looks, human form, and outfits she wore won me over. I also had a crush on other women on the show which includes Zatanna, Bette Kane and Batgirl/ Barbra Gordan. I would defiantly recommend this show to any DC fan.Avoid shows like Teen Titans Go!, Justice League Action and DC Super Hero Girls and watch shows like Justice League, Teen Titans, and this shows. I just hope season 3 can save DC because at the moment DC in terms of animation isn't doing very well.Trust me once when you get into young justice you will enjoy it. For people who hate it or just aren't interested, I can respect that but you don't know what you are missing. The whole series is a blast after episode 5 and more fun stuff will be coming your way when season 3 gets made and if that is successful then Greg Wiseman and Brandon might be generous enough to give us season 4 and 5."
    },
    {
      "username": "langsts21",
      "userUrl": "https://www.imdb.com/user/ur24583482",
      "reviewLink": "https://www.imdb.com/review/rw2360752",
      "warningSpoilers": false,
      "date": "29 December 2010",
      "rate": "10",
      "helpful": "88 out of 111 found this helpful.",
      "title": "Better than Teen Titans",
      "content": "This series has most of my favorite DC Comics characters whether it be from Young Justice or the Justice League. The show unlike Teen Titans' TV-Y7 rating is rated TV-PG which promises more mature themes and better action sequences. My favorite Young Justice member is Robin followed By Speedy. Robin is my favorite member because I'm a huge fan of the superheroes that Batman regularly teams up with and the super villains that he regularly fights. Not just the storyline is better than Teen Titans, so is the animation. The animation reminds me of the straight to DVD PG-13 movie Justice League: Crisis On Two Earths. The action, the comedy, the characters, and the animation are all top-notch."
    },
    {
      "username": "MoistMovies",
      "userUrl": "https://www.imdb.com/user/ur19484559",
      "reviewLink": "https://www.imdb.com/review/rw7834599",
      "warningSpoilers": false,
      "date": "4 February 2022",
      "rate": "7",
      "helpful": "36 out of 47 found this helpful.",
      "title": "S4 is just awful soap opera",
      "content": "What has happened? S3 was already a major step down from 1 and 2 but 4 is a new low that unfortunately deserves cancellation.I hope we get a new animated justice league series in the spirit of the originals, focusing on 2 or 3 parters and story of the week.. then at least when there were bad episodes they were out outweighed by the great ones.It seems if you think something is woke you're far right or whatever. But this series writers clearly don't care about telling a good story this season and wanted to use this show as a platform for their opinions. Kicked off for shock value in a episode early on to make you think they're bold and smart... this is followed by some of the worst writing I've seen in a animated series.Please DC go back to your roots of being the smart and darker animated super hero place to go. Your core audience doesn't want soapy 'woke' crud. Stop listening to the vocal minority."
    },
    {
      "username": "sayen_shin",
      "userUrl": "https://www.imdb.com/user/ur34702522",
      "reviewLink": "https://www.imdb.com/review/rw2729968",
      "warningSpoilers": false,
      "date": "2 January 2013",
      "rate": "10",
      "helpful": "70 out of 78 found this helpful.",
      "title": "DC - This is the Series We Needed and the One We Need Right Now!",
      "content": "Everything fits perfectly in this magical series. These days, if a series shows quality, it is because it was taken seriously by high- ranked people. I love the tone, the characters, the plot-line, the themes, the secrets, the chemistry between many characters, the relationship between Justice League (mentors) and Young Justice (sidekicks), the way they make superheroes used to be forgettable now memorable, etc. I absolutely didn't care about Superboy, Speedy, Blue Beetle, etc., but now I really am interested and I think that is the strength of this show.The only tiny, small and little complaint I have concerns the music. Actually, I love how it is played throughout each episode, but to make it truly epic, it needs a better introduction or a standout song just like ''The Batman'' (90s, ''Superman'' (90s) and both ''Justice League'' and ''Justice League Unlimited'' : Tananan! Tananan! Tananananan! ... Of course, it is only a personal opinion and it certainly does not diminish the quality of this show.I have watched the entire ''Young Justice'' season 1 and everything that has aired of season 2 in the last four days and whaouh! I want more and more and more. Whe I started watching season 2, I was utterly surprised to see a 5 years jump from where season 1 left and CHUCK NORRIS or GOD was I pleased! It truly is an intelligent move because it allows to bring new young superheroes like Blue Beetle or Impulse, etc. I am 20 years old and this show certainly is for young teenagers and young adults and even adults. Many theme are for mature people, with life and death decisions.I can't believe how great the animation is, almost as great as every single DC animated movie they release each year, last one being ''The Dark Knight Returns, Part 1''. I truly hope they'll continue this series for many years to come because it is AMAZINGLY AWESOME! This series take risks and it works just fine in my book. That is what keeps it fresh. However, I hope they stay focus on the main characters they developed in the first season, not making the same mistake of some episodes of ''Justice League Unlimited''.I can only give it a minimum of 9.5/10, but IMDb approximates, so to me, it is a 10/10! If any of the designers see this review, I encourage your awesome work and make you know that you have my total admiration. I was searching for a good show and I found yours by total luck. I am not very lucky in my life, but I think, that day, I totally was!THANK YOU ;)"
    },
    {
      "username": "007Waffles",
      "userUrl": "https://www.imdb.com/user/ur64050638",
      "reviewLink": "https://www.imdb.com/review/rw7022614",
      "warningSpoilers": true,
      "date": "12 June 2021",
      "rate": "5",
      "helpful": "32 out of 42 found this helpful.",
      "title": "Craptastic!!!",
      "content": "I quit this show after episode 1/Season 4. It's horrible!!!The first season was great. The characters and story were fun. Season 2 starts to take a turn and things get really ugly in season 3.By season 3 they are all middle age. It should be called \"Middle Age Justice\". The characters seem to enjoy going to bed at a reasonable hour and having a variety of different teas. Yeah, season 3 is that boring. I think in one of the final episodes Megan and Connor are getting audited by the IRS while Night Wing is being sued by someone he rescued who stubbed their toe, but don't worry, Batman's lawyers are on the case. Get ready for more justice! Zzzzzzzzz..."
    },
    {
      "username": "Gromstaur",
      "userUrl": "https://www.imdb.com/user/ur64250964",
      "reviewLink": "https://www.imdb.com/review/rw7509789",
      "warningSpoilers": false,
      "date": "4 November 2021",
      "rate": "2",
      "helpful": "42 out of 54 found this helpful.",
      "title": "Seasons 1 and 2 were great!",
      "content": "Season 3 was something else entirely! A bunch of new characters nobody cares about.and enough allegory to present day events to choke that word clean out of the dictionary. With Season 4 they've managed to take the losing formula of Season 3 to a sickening new high, while they've at the same time found a way to make cheaper animations. DC hates their fan base!"
    },
    {
      "username": "markq-75654",
      "userUrl": "https://www.imdb.com/user/ur106084755",
      "reviewLink": "https://www.imdb.com/review/rw5032064",
      "warningSpoilers": true,
      "date": "31 July 2019",
      "rate": "9",
      "helpful": "26 out of 33 found this helpful.",
      "title": "First two seasons are best DC has to offer, but season 3 is just uhh",
      "content": "The first two seasons of this show are amazing. The best DC has to offer, it gives us in depth characters and story. The first season is God's with getting all these side not wanting to be known as side but as their own people. It lets you connect to the heroes it also shows them grow as a team. With them being kids having crushes, or dealing with school or even with their parents.Season 2 takes things on a whole new level. With a five year tone jump, now seeing new heroes. And heroes we loved from the first season grown up. Suck as Dick Grayson, who is nightwing. It also gives us Aqualad who is now evil, and Wally and Artemis retried. And Connor and Megan not together anymore. And our new heroes are Blue Beetle, Impulse, wondergirl, batgirl and etc. This season is crazier with villains such as the reach, Mongul, and of course the light. With season we see our heroes undercover and keep secrets from other team members. It is an Insane and intense fun season.Season 3, after six years of no young justice we finally got a new season. This season takes place two years later. With the major issue being meta human trafficking. It also includes new characters like Geo Force, Halo, Cyborg and etc.All in all this series is great, but season 3 is alright. The story seems to be all over the place and it has a little too much political stuff in it. It's not as in depth with its stories and it feels the team aren't as connected. With some episodes not really having villains or only half the episode being about them on a mission. I'm at watching the show but this season is not the same. I hope that the writers do a better job with season 4. But there is still six episodes left this season hopefully their all great."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2852476",
      "warningSpoilers": false,
      "date": "17 August 2013",
      "rate": "9",
      "helpful": "13 out of 16 found this helpful.",
      "title": "One of Cartoon Network's best shows in recent years, not perfect but terrific all the same",
      "content": "Not quite among Cartoon Network's all-time best shows(Dexter's Laboratory, Courage the Cowardly Dog, Johnny Bravo, Powerpuff Girls, Cow and Chicken). But in recent years, alongside Regular Show, Adventure Time and the first three Ben 10 series- Omniverse is a huge disappointment- it is one of their better shows in recent years, The Amazing World of Gumball is also mostly great apart from some weak writing early on. Young Justice isn't quite perfect, the season 2 finale does feel too convenient and incomplete and not all the voice acting was quite there; Brent Spiner is nowhere near sinister or insane enough as Joker, too restrained, Kevin Michael Richardson is over-parted and all his characters sound exactly the same(Mal Duncan is the worst case), and while Nolan North has times where he is right on the money at others he is not powerful or heroic enough as Superman.The rest of the voice acting though is fabulous, all the Young Justice team are voiced with depth and a great dynamic. Even if Jesse McCartney does start off a tad too lightweight for Nightwing he does mature, as Robin and Dick Grayson he is spot on. Bruce Greenwood is pitch-perfect as Batman, he doesn't erase memories of Kevin Conroy but is suitably dark and brooding. There are no complaints to be made of Vanessa Marshall and Maggie Q as Black Canary and Wonder Woman, and Phil LaMarr is a good Aquaman. For the villain roles, Miguel Ferrer, Oded Ferr, Mark Rolston, Keith Szarabajka, Danny Trejo and Arnold Vosloo are particularly good, though all except for Joker are good. The secondary characters are memorable, the likes of Phil LaMarr, Tara Strong, Edward Asner, Crispin Freeman, Jeff Bennett Geoff Pierson and Cree Summer are without fault. G. Gordon Godfrey is annoying in a way and the only character who isn't (intentionally) likable, but Tim Curry voices with such adept smarmy drollness and sinks his teeth into Godfrey's monologues.But it's not just the voice acting that makes up and comes across strongly in Young Justice. The animation is great here, somewhat anime in look but colourful, detailed and atmospheric, when it calls for it to have a serious approach- and there are numerous cases of that- it does so very effectively without being overly so. The fluidity of the backgrounds and character movements and how dynamically the colours and shadings are used are to much admired. The music has a feel and orchestration that suits the tone perfectly without making too serious or upbeat, with some beautiful and haunting moments. There's nothing cheesy or forgettable about the theme tune either(unlike other Cartoon Network shows like Ben 10: Omniverse and Johnny Test, how is that show still airing?) From a writing and narrative standpoint, Young Justice also scores. The dialogue is very thought-provoking and intelligently written, doing a great job at giving the characters depth and complexity and also with an ability to provide emotional depth and a some subtle humour. The story lines are always compelling and succeeds in drawing us into the world the characters live in, there is great atmosphere and the action is exciting and well-animated. It is true that narratively the first season is better than the second, the second season was still interesting and well done on the most part if not quite as well-developed and focused in tone. The characters really make the show work, Robin and Speedy stand out in the Young Justice team though all of them have likable and resourceful personalities. Batman, Black Canary, Wonder Woman and Aquaman come off best in the Justice League, and you even root for the fun and charismatic villains especially Vandal Savage and Ras'Al Ghul.All in all, a terrific show and it is a shame that it was cancelled- maybe its erratic scheduling got the better of it- because it did have potential to have more and the ending of season 2 did suggest that somewhat. 8.5/10 Bethany Cox"
    },
    {
      "username": "calebgarcia46",
      "userUrl": "https://www.imdb.com/user/ur40451737",
      "reviewLink": "https://www.imdb.com/review/rw4255099",
      "warningSpoilers": false,
      "date": "27 July 2018",
      "rate": "10",
      "helpful": "34 out of 40 found this helpful.",
      "title": "Exceptional",
      "content": "As always, DC's domination in the animation field exceeds all expectations. Young Justice is far superior to Justice League/Unlimited, Teen Titans and every other animated super hero series. To start off YJ's animation is much higher in quality then the other shows not to mention far more detailed. The action sequences are also more realistic and enjoyable. The show is also better scripted than past DC shows as well as more mature in themes and dialogue. Watching just one episode you can't know what's going on, the long story arcs make it more consistent as well as entertaining. The show also focuses on the main characters which gives it more intensity and depth. You may not relate to all the characters but you do connect with them as the voice actors give amazing performances. All in all this action packed, emotional show will not disappoint, and will definitely keep you hooked until the end. I'd say many would agree that Young Justice is the best DC Animated Series since Batman TAS. Glad the show was popular enough for renewal"
    },
    {
      "username": "paperback_wizard",
      "userUrl": "https://www.imdb.com/user/ur7233664",
      "reviewLink": "https://www.imdb.com/review/rw2344716",
      "warningSpoilers": false,
      "date": "27 November 2010",
      "rate": "8",
      "helpful": "44 out of 58 found this helpful.",
      "title": "'Independence Day' or 'All we want to do is save the world!'",
      "content": "There has been no lack of series about the young, troubled, and super-powered set. Arguably, the very concept of the super-hero genre has been called a teen power fantasy. The hero IS the teenager, striking out at the world, righting wrongs in a way a kid never could.And I can see that. I can also see the implications of that notion. Because teens are sometimes scared of themselves. Scared of the new thoughts and feelings they have, the older they get. Scared of the changes in how they perceive themselves and how they see the world.Why, even Robin has days when Batman seems like a weird control freak rather than the beloved mentor who keeps Gotham City safe! There comes a time when a young super-hero wants to venture out with his peers.This is the core premise behind Young Justice, the latest series based on DC Comics' vast and rich mythos of super-heroes. Heading the series is Greg Weisman, perhaps best known for his work on the cult classic Disney series \"Gargoyles\" and the highly popular \"Spectacular Spider-Man\" animated series.His strengths are character development, intelligent and complex villains, and world-building. We get quite a lot of each in the first episode.The partners (do NOT call them \"sidekicks\") of the sixteen-member strong Justice League are getting ready to take their first step into, well, the Big League. Access to the Hall of Justice. Participation in the missions that save the World, the Universe, All of Reality, etc.But when the League does get an alert, they're left to pose for tourists and stay put. How infuriating.Why, it's almost enough to make them want to sneak out and investigate a mysterious fire at a top secret genetic research facility! Which they do only to find that someone's after-school science project involves cloning the most powerful hero on Earth, and transforming him into a loyal, brainwashed slave. My, my, my The banter is crisp and funny, ranging from Robin's pondering on why people are always being over or underwhelmed, yet one never hears about someone just being \"whelmed\", to the classic bit about confusing codenames: Bystander #1: \"Hey, look. It's Speedy!\" Bystander #2: \"Oh. Is he the Flash's sidekick?\" Bystander #1: \"No, he's Green Arrow's.\" Bystander #2: \" * well, that makes NO sense at ALL.\" Most of the episode sets up the cast dynamic. Speedy is the hot-headed rebel. So rebellious, in fact, that he storms off in a rage a mere eight minutes into the episode. Robin is the tech geek. Kid Flash is the plucky comedy relief . Aqualad is the calm, natural leader who always finds his center, despite increasing misgivings about the world and his place in it. And Superboy is the freshly-minted son Superman never knew he had much to each other's mutual confusion and anger.I loved the usage of obscure characters from the DC mythos, such as Blockbuster, the Golden Guardian and Dubbilex the DNAlien. I loved the twist about the true goals of the eerie creatures being created by the Big Bads.The Big Bads themselves, an ominous unseen council of ominous known as \"The Light\" managed to seem creepy and smart rather than cliché and trite. Always a plus.If I have a complaint about the pilot, it's that the female members of them team were either absent entirely (Artemis won't join until episode six) or only made a cameo in the coda (Miss Martian, the sweet-natured niece of J'Onn J'Onzz, Manhunter From Mars). Hopefully they'll be given a prominent role in the actual series.All in all an exciting, witty, satisfying pilot. The scope of the series looks ambitious, the animation budget seems to be sky high, and the young heroes are now basically the Black Ops branch of the Justice League! That's a notion as disturbing as it is awesome. I'm sure the moral ambiguity will be addressed.Count me in for the regular series, coming out January of next year.(Originally appeared at http://fourthdayuniverse.com/reports/ )"
    },
    {
      "username": "rajaramautt",
      "userUrl": "https://www.imdb.com/user/ur83402191",
      "reviewLink": "https://www.imdb.com/review/rw4120661",
      "warningSpoilers": false,
      "date": "7 April 2018",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "DC - Best super hero series, addictive and awesome",
      "content": "Best super hero series I ever watched. After DC failure in movies, I lost interest in DC characters. But after this series I understand , DC got lot more potential. I love the young justice team, looking forward to see the team in live action movie. DC got their own style , I would like if they don't change their style like marvel comics, it don't suit for DC for some hero's like batman ( best super hero of all time ), suicide squad ."
    },
    {
      "username": "me-998-978033",
      "userUrl": "https://www.imdb.com/user/ur52680197",
      "reviewLink": "https://www.imdb.com/review/rw3512767",
      "warningSpoilers": false,
      "date": "26 July 2016",
      "rate": "9",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Gone too Soon",
      "content": "Young Justice, it could have been a pathetic attempt at a kids show with superheroes, but it became an icon for everyone from 10 to mid 30s. The show tackles difficult boundaries not just young love, but identity, morality & many more. Young Justice follows the story of the sidekicks of the Justice League, Robin, Superboy, Kid Flash, Speedy, Miss Martian, Artemis & a whole lot more. The show doesn't just deal with fighting the bad guys & saving the day, there's also their \"normal\" lives they have to traverse through. With 2 spectacular & heartbreaking seasons, fans are still waiting & petitioning for a 3rd & rightly so. Young Justice did something, no other show, superhero or not, at such a short amount of time, they made you care for the characters, both hero, villain & anti hero.If you're a fan of good storytelling, great characters & don't mind getting a little misty eyed, you'll love Young Justice."
    },
    {
      "username": "zwjonas",
      "userUrl": "https://www.imdb.com/user/ur87689283",
      "reviewLink": "https://www.imdb.com/review/rw7240798",
      "warningSpoilers": false,
      "date": "18 August 2021",
      "rate": "7",
      "helpful": "14 out of 18 found this helpful.",
      "title": "Great Show On The Decline",
      "content": "First Season 9/10. Second Season 8/10. Third Season 6.5/10. Oh Boy! This show at the beginning rocks. It doesnt rely on big names and super popular characters. Its great. When the third season rolls around we hit a bump. Boring characters. Desperate appeal to college age kids. I found myself going from really enjoying and being impressed with S1 and S2 to just trying to make it through S3. The gore, sexual content and some lazy writing take front and center with no real purpose. The plot gets cyclical. Feeling like everything ends the same all the time. Has me worried about upcoming season 4. My suggestion enjoy S1 and S2. Dont waste your time on S3. Also S1 and S2 great for kids. S3 still has youth rating but definently not for kids."
    },
    {
      "username": "Smarmelade",
      "userUrl": "https://www.imdb.com/user/ur37677124",
      "reviewLink": "https://www.imdb.com/review/rw3173834",
      "warningSpoilers": false,
      "date": "31 January 2015",
      "rate": "9",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Surprisingly good",
      "content": "When big studios announce something related to their big franchises but \"teen version\" of it, I'm usually pretty wary about it.Luckily, there are some great shows that surpass that teen-cliché stuff, for example Armored Adventures and X-Men Evolution.In that same manner comes Young Justice with young, post-sidekick heroes eager to prove themselves as equal counterparts to the legendary Justice League. Show spans through connected multiarces into one big story over two seasons and one not-so-good-but-not-that-bad video game that fills the 5 year gap between seasons.Acting is AAA solid, animation is mostly great, scripts and stories could use a bit less of deus ex machina resolutions but overall are good and in true DC spirit. Main characters are pretty damn interesting even if they don't look like that in the beginning because they have great shoes to fill. Which is also a big plot point of the show as well, them, escaping from the shadows of the main JL team.Episodes are mostly connected so you can't watch \"just one episode\" and feel the aster, you can try, but good luck with that :D"
    },
    {
      "username": "kjell-ahlstrom",
      "userUrl": "https://www.imdb.com/user/ur24516350",
      "reviewLink": "https://www.imdb.com/review/rw7627145",
      "warningSpoilers": false,
      "date": "8 December 2021",
      "rate": "3",
      "helpful": "25 out of 33 found this helpful.",
      "title": "S1 and S2 were really good",
      "content": "Now it's not worth my time.Season 4 is just one boring flat note. Almost every VA seems to be directed to having the same nondescript monotone voice for almost every character. Plot is not engaging. I can barely keep my eyes open through an episode.This is where I jump off."
    },
    {
      "username": "magooford123",
      "userUrl": "https://www.imdb.com/user/ur36853804",
      "reviewLink": "https://www.imdb.com/review/rw2684564",
      "warningSpoilers": false,
      "date": "6 October 2012",
      "rate": "9",
      "helpful": "44 out of 49 found this helpful.",
      "title": "Second season picks up fast",
      "content": "I've seen a couple of reviews that say the jump between the second season and the first is a huge mistake, and initially I would agree with those reviews. The team from the first season was the one I knew and loved, and for the first couple episodes, the decision seems to be a mistake. However, as they have fleshed out this seasons story line and developed these new characters, I have liked the series more and more. Impulse and Blue Beetle have turned into some of my favorite characters, and the plot twists throughout this season have been absolutely incredible. I know it might be hard to jump into the first few episodes of the second season, but if you give it a chance, you will enjoy it just as much of the first."
    },
    {
      "username": "thenerdygamer",
      "userUrl": "https://www.imdb.com/user/ur66552661",
      "reviewLink": "https://www.imdb.com/review/rw5538793",
      "warningSpoilers": false,
      "date": "9 March 2020",
      "rate": "6",
      "helpful": "22 out of 29 found this helpful.",
      "title": "I loved season 1 and 2 but season 3....",
      "content": "Season was an unbearable mess. I almost gave up watching it. Cringe worthy new characters added for no reason and build up from season 2 gone to waste."
    },
    {
      "username": "a_sad_cow",
      "userUrl": "https://www.imdb.com/user/ur9344916",
      "reviewLink": "https://www.imdb.com/review/rw3004172",
      "warningSpoilers": false,
      "date": "24 April 2014",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Truly outstanding",
      "content": "To the writers/directors/artists/actors: You are truly incredible. The quality of DC Comics with the Justice League series is unparalleled. Never stop.To the producers: Give this talent room to breathe. I know they're pitching to the right side of the bell curve, but it inspires all of us to be better. This series didn't need to fast forward 5 years...I would gladly have waited 5 more seasons to see the continuation from Season 1.To anyone who is unfamiliar with DC Comics: watch Justice League and Justice League Unlimited. This caliber of writing has a precedent."
    },
    {
      "username": "tallerthanyoutwo",
      "userUrl": "https://www.imdb.com/user/ur59937468",
      "reviewLink": "https://www.imdb.com/review/rw8025561",
      "warningSpoilers": false,
      "date": "2 April 2022",
      "rate": "5",
      "helpful": "23 out of 27 found this helpful.",
      "title": "Started from the top now we're here",
      "content": "Started out fantastic 10/10 would recommend for the first 3 seasons. Season 4 was a surprise that it even happened and it seems to exists solely to serve as furthering the ____ agenda. First it was racial equality, which is important 100%. Then they sprinkled in some LGBTQIA+ in combination with Islam. I'm not an expert on Islam but I do know that generally those communities do not agree with one another on major principles. Emphasis on the word generally. There was even a polyamorous couple in one episode. Polyamory, is this show not targeted toward kids and teenagers!?I am not hating on anyone from any of these cultures (except polyamory, I will never stand behind that) even though many (the rest) of you may think I am. I am also aware of the fact that media often is reflects current culture climate. However to jam all current agendas into one season of one show to me detracts from the shows story itself.So thumbs down my comment all you want but this is my opinion on the state of the show. I've been a fan since season 1 aired on television in 2010 so as cringe as it sounds I feel as though I am actually entitled to my opinion on this show."
    },
    {
      "username": "DangerousDag",
      "userUrl": "https://www.imdb.com/user/ur109988032",
      "reviewLink": "https://www.imdb.com/review/rw5956857",
      "warningSpoilers": false,
      "date": "1 August 2020",
      "rate": "6",
      "helpful": "12 out of 16 found this helpful.",
      "title": "The First 2 seasons are excellent",
      "content": "The animation on this series is excellent, and the characterizations, the plots and complex storylines make it perhaps the best animated superhero show since Batman: The Animated Series.The Team we got in Season 1 was perhaps the perfect ensemble cast, and although I do agree with many of the criticisms leveled at Season 2, many of the new characters are still at least well-written and likeable, and if the writers had been allowed to carry through their storyline for the number of episodes they had originally been promised, it could have been just as good as the first season, in spite of the wrench thrown into the works by the change in the Team dynamics.Season 3 is the reason I gave the show a rating of 6 overall. If I were rating it on Season 1 and 2 alone, it would be a 9 or 10. If I were rating season 3 alone, it would be a 1. Get the original writers back, and get rid of the so-called \"characters\" we had to put up with in this Season, or don't bother giving us any more."
    }
  ],
  "errorMessage": ""
}