{
  "imDbId": "tt1641384",
  "title": "Young Justice",
  "fullTitle": "Young Justice (TV Series 2010–2022)",
  "type": "TVSeries",
  "year": "2010",
  "language": "en",
  "titleInLanguage": "Young Justice (TV series)",
  "url": "https://en.wikipedia.org/wiki/Young_Justice_(TV_series)",
  "plotShort": {
    "plainText": "Young Justice is an American superhero animated television series developed by Brandon Vietti and Greg Weisman for Cartoon Network and Distributed By Warner Bros. Domestic Television. Despite its title, it is not a direct adaptation of Peter David, Todd Dezago and Todd Nauck's Young Justice comic series, but rather an original story set in the DC Universe with a focus on teenage and young adult superheroes.\r\nThe series follows the lives of teenage superheroes and sidekicks, namely Nightwing, Kid Flash, Aqualad, Superboy, Miss Martian, and Artemis, who are members of a fictional covert operation group. Within the show, \"the Team\" is a group of young heroes attached to the famous adult team, the Justice League, but operating outside of the bureaucracy that constrains the more established superhero team. The main setting is a fictional universe apart from the previous DCAU and other continuities, designated at one point as Earth-16, during a time period in which superheroes are a relatively recent phenomenon, and supervillains have all began working in tandem in a grand conspiracy on behalf of a cabal of key villains known as the Light.\r\nThe series debuted with an hour-long special on November 26, 2010. Young Justice premiered on September 9, 2011, on Teletoon in Canada. After airing its second season, subtitled Invasion, the series was canceled in early 2013. In November 2016, Warner Bros. Animation announced that the series would be returning for a third season, subtitled Outsiders, which premiered on January 4, 2019, on DC Universe. In July 2019, DC Universe renewed the series for a fourth season, later subtitled Phantoms and eventually moved to HBO Max. The fourth season premiered on October 16, 2021, and ended its complete season run on June 9, 2022. The series was cancelled once again in August 2022, as part of Warner Bros. Discovery streaming reorganization.",
    "html": "<p>Young Justice is an American superhero animated television series developed by Brandon Vietti and Greg Weisman for Cartoon Network and Distributed By Warner Bros. Domestic Television. Despite its title, it is not a direct adaptation of Peter David, Todd Dezago and Todd Nauck's Young Justice comic series, but rather an original story set in the DC Universe with a focus on teenage and young adult superheroes.</p><p>The series follows the lives of teenage superheroes and sidekicks, namely Nightwing, Kid Flash, Aqualad, Superboy, Miss Martian, and Artemis, who are members of a fictional covert operation group. Within the show, \"the Team\" is a group of young heroes attached to the famous adult team, the Justice League, but operating outside of the bureaucracy that constrains the more established superhero team. The main setting is a fictional universe apart from the previous DCAU and other continuities, designated at one point as Earth-16, during a time period in which superheroes are a relatively recent phenomenon, and supervillains have all began working in tandem in a grand conspiracy on behalf of a cabal of key villains known as the Light.</p><p>The series debuted with an hour-long special on November 26, 2010. Young Justice premiered on September 9, 2011, on Teletoon in Canada. After airing its second season, subtitled Invasion, the series was canceled in early 2013. In November 2016, Warner Bros. Animation announced that the series would be returning for a third season, subtitled Outsiders, which premiered on January 4, 2019, on DC Universe. In July 2019, DC Universe renewed the series for a fourth season, later subtitled Phantoms and eventually moved to HBO Max. The fourth season premiered on October 16, 2021, and ended its complete season run on June 9, 2022. The series was cancelled once again in August 2022, as part of Warner Bros. Discovery streaming reorganization.</p>"
  },
  "plotFull": {
    "plainText": "Young Justice is an American superhero animated television series developed by Brandon Vietti and Greg Weisman for Cartoon Network and Distributed By Warner Bros. Domestic Television. Despite its title, it is not a direct adaptation of Peter David, Todd Dezago and Todd Nauck's Young Justice comic series, but rather an original story set in the DC Universe with a focus on teenage and young adult superheroes.\r\nThe series follows the lives of teenage superheroes and sidekicks, namely Nightwing, Kid Flash, Aqualad, Superboy, Miss Martian, and Artemis, who are members of a fictional covert operation group. Within the show, \"the Team\" is a group of young heroes attached to the famous adult team, the Justice League, but operating outside of the bureaucracy that constrains the more established superhero team. The main setting is a fictional universe apart from the previous DCAU and other continuities, designated at one point as Earth-16, during a time period in which superheroes are a relatively recent phenomenon, and supervillains have all began working in tandem in a grand conspiracy on behalf of a cabal of key villains known as the Light.\r\nThe series debuted with an hour-long special on November 26, 2010. Young Justice premiered on September 9, 2011, on Teletoon in Canada. After airing its second season, subtitled Invasion, the series was canceled in early 2013. In November 2016, Warner Bros. Animation announced that the series would be returning for a third season, subtitled Outsiders, which premiered on January 4, 2019, on DC Universe. In July 2019, DC Universe renewed the series for a fourth season, later subtitled Phantoms and eventually moved to HBO Max. The fourth season premiered on October 16, 2021, and ended its complete season run on June 9, 2022. The series was cancelled once again in August 2022, as part of Warner Bros. Discovery streaming reorganization.\r\nOverview\r\nSeason 1\r\nYoung Justice focuses on the lives of a group of teenage sidekicks attempting to establish themselves as proven superheroes as they deal with normal adolescent issues in their personal lives. The show corresponds to the present time of our world, a time period Vietti has called \"a new age of heroes\".\r\nRobin, Aqualad, Kid Flash, and Speedy (later revealed to be a clone of the original Roy Harper) are invited by their mentors Batman, Aquaman, Flash, and Green Arrow to tour the Hall of Justice and sit in on a meeting of the Justice League. At the last minute however they are called away. This angers Speedy, who resigns from being a sidekick. The other three use this as an opportunity to prove themselves and investigate a fire at Cadmus Labs. While there they uncover a clone of Superman named Superboy. They free him and in the ensuing escape expose Cadmus' illegal activities. Impressed, Batman and the rest of the Justice League agree to allow the sidekicks to form their own team to run secret missions for the League. Batman establishes Young Justice in a secret cave located inside a former Justice League headquarters, Mount Justice, a hollowed-out mountain. Here the teens are trained by Black Canary, given missions by Batman, and are watched over by Red Tornado. They are joined by Miss Martian, niece of the Martian Manhunter, and Artemis, Green Arrow's newest protégé. The team frequently clashes with the Light, a secret cabal of super villains, whose actions and identities are unknown to the Justice League. The Light consist of Vandal Savage, Ra's al Ghul, Lex Luthor, Queen Bee of Bialya, Ocean Master, Brain, and Klarion the Witch Boy. Young Justice also wrestles with internal problems when it is revealed that one of their members is working for the Light. When Speedy, now going by Red Arrow, becomes a member of the Justice League, he is revealed to be the traitor and enslaves the entire League with magic and alien tech infused nano-mites. Young Justice is able to break the Light's hold on all the members of Justice League, though several members had been briefly transported off world for reasons unknown or where.\r\nSeason 2: Invasion\r\nFive years later, Robin (now going by \"Nightwing\"), Miss Martian, and Superboy have been offered a chance to join the Justice League, but they have decided to remain with the Young Justice. Nightwing now serves as team leader, trainer, guardian, and League liaison. Kid Flash and Artemis have retired, while Aqualad has left the team to be with his villainous long-lost father Black Manta, a member of the Light who replaces Ocean Master. New members include Beast Boy, Blue Beetle (Jaime Reyes), Robin (Tim Drake), Batgirl, Bumblebee, Lagoon Boy, Wonder Girl (Cassie Sandsmark), and Impulse (Bart Allen).\r\nWhen an alien force attempts a hostile takeover of Earth, it is revealed that the Justice League had, in a show of force, attacked a peaceful planet while under the control of \"the Light\" five years ago. This showed multiple alien races that Earth could be considered a viable member of their empires. After the invasion is defeated, those members of the Justice League who led the attack leave Earth in an attempt to clear their names.\r\nAs more and more aliens come to Earth, the people's faith in the Justice League begins to dwindle and shift to the Reach, an alien race that offered a peaceful, diplomatic relationship. It is revealed that the Reach are allies of the Light who are looking to conquer Earth. Their actions attract the attention of their enemy Mongul, who brings his planetary destruction weapon, the War World, to destroy the Reach. Young Justice is able to defeat Mongul. Aqualad reveals himself to be a double agent during a summit between the Light and the Reach that Lex Luthor and Queen Bee are unable to attend. He provides the Reach with evidence that the Light was going to betray them and together with his teammates takes down Black Manta and Brain while Vandal Savage, Ra's al Ghul, and Klarion are evacuating. Meanwhile, the other half brings the War World to Darkseid on Apokolips as Vandal Savage quotes \"business as usual.\"\r\nSeason 3: Outsiders\r\nTwo years later, the Team battles metahuman trafficking since the Reach had revealed the existence of the meta-gene dormant within humans and how they could be activated. As a result, various nations and organizations have started participating in such activities. Geo-Force and Halo are among the experiments done by the Markovian government. In addition, they must also deal with the further plots of the Light (who now have Deathstroke, Ultra-Humanite, and Gretchen Goode replacing Ra's al Ghul, Brain, and Black Manta) as well as the appearance of brand-new characters from the planets New Genesis and Apokolips. Concurrently to all this, Geo-Force searches for his long-lost younger sister Terra. After it is revealed that the higher-ups of \"The Team\" discovered that Terra was secretly in league with Deathstroke, Geo-Force kills his tyrannical uncle, becoming the king of Markovia and ending relations with them.\r\nSeason 4: Phantoms\r\nOn July 20, 2019, at San Diego Comic-Con, it was announced by series creators Vietti and Weisman that DC Universe had renewed the series for a fourth season. On September 12, 2020, it was announced that the fourth season will be titled Young Justice: Phantoms. On September 18, 2020, it was announced Young Justice will be moving to HBO Max. On July 2, 2021, Greg Weisman confirmed that the entirety of season four would be animated by Studio Mir. The first two episodes of season 4 were released on October 16, 2021, on HBO Max. Season 4's narrative, which takes place one year after season 3, is divided into four part arcs focused on specific Team members from season 1, with a background focus on the Legion of Super-Heroes who also play a part in the story and a strong focus on Superboy as the central character of the season.\r\nMiss Martian and Superboy go to Mars for their wedding ceremony as racial turmoil erupts from the murder of the Martian king and the actions of Miss Martian's revolutionary brother Ma'alefa'ak; Tigress tries to get through to her sister Cheshire as Lady Shiva makes a move to claim possible League of Shadows defectors Onyx, Cassandra Savage, and her mute daughter Orphan; Zatanna and her Sentinels of Magic are faced with the arrival of Child, seeking to replace Klarion as the primary Lord of Chaos; Kaldur'ahm returns to Atlantis as a prophecy involving Ocean Master and Arion reverberates throughout the oceans; Rocket is deployed to New Genesis for Justice League business as the machinations of Apokolips rear their heads; and Nightwing and various other teams of heroes must stop an impending invasion of Kryptonian criminals led by General Zod from escaping from the Phantom Zone, an inter-dimensional prison, who threaten to conquer the galaxy, all the while trying to save one of their own.\r\nHowever, as each Team member deals with their plots, the background narrative of Superboy's presumed death from stopping a gene bomb belonging to Ma'alefa'ak reverberates throughout the mini-arcs, leaving Miss Martian profoundly heartbroken over the loss of her fiancé, further driving Beast Boy into a downward spiral of depression, being the incentive behind Tigress reaching out to Cheshire, Zatanna learning he is still alive in another dimension, Kaldur struggling to hold back his grief, Rocket unknowingly coming into contact with his attempted murderer Lor-Zod, the son of General Zod, while Nightwing finally uncovers the mystery and conspiracy surrounding Superboy's disappearance, discovering he is trapped inside the Phantom Zone and works alongside the original Team to rescue him, which is complicated by Superboy suffering from Zone Sickness and being molded into loyalty to Zod.\r\nFollowing the defeat of the House of Zod and finally freed from General Zod's control, Superboy and Miss Martian finally get married on Earth in a private ceremony with a large gathering of heroes, friends, family and allies attending the wedding, including past and present members of the Justice League, Team and Outsiders. In the meantime, The Light have captured the Kryptonians on the War World whilst on Apokolips, Darkseid is introduced to the next generation of Furies, consisting of Supergirl and Black Mary.\r\nCast and characters\r\nOriginal members\r\nDick Grayson (Jesse McCartney) is Robin, the protege of Batman and a young genius who uses high-tech gadgets and security hacking. During the time skip between seasons one and two, he outgrows the Robin identity to become Nightwing. He serves as the Team's leader in the second season, until returning the duties back to over to Aqualad. He was also best friends with Kid Flash.\r\nKaldur'ahm (Khary Payton) is Aqualad, an original character and the protege of Aquaman from Atlantis, who can breathe underwater and use hydrokinesis, the ability to increase the local specific density of water and then manipulate its shape. He is the leader of the Team, who is a natural due to his calm and level-headed demeanour. In season 2, he takes part in a deep cover mission to infiltrate the Light, pretending he betrayed the Team after discovering he is the son of Black Manta. In season 3, he becomes the second Aquaman and joins the Justice League. He is also revealed to be bisexual.\r\nWally West (Jason Spisak) is Kid Flash, the protege of The Flash. He is capable of running at hypersonic speed. He was the Team's resident flirtatious jokester, always quick with a joke or comeback, but gradually grows more mature and later begins a romantic relationship with Artemis. In Season 2, he retired from heroics and left the Team with Artemis, but returned to help stop the impending alien invasion and later dies saving the world from an alien bomb in the finale. He is later seen in hallucinations by various characters in Season 3.\r\nSuperboy (Nolan North) is a kryptonian-human hybrid who is a genomorph clone of Superman, and shares several of his abilities. He later takes the human name, Conner Kent, joins the Outsiders at the end of season 3 and eventually inspires the Legion of Super-Heroes in the 31st Century. He is also in a longtime romantic relationship with Miss Martian and they get married in the series finale.\r\nM'gann M'orzz or Megan Morse (Danica McKellar) is Miss Martian, the niece of Martian Manhunter. Like her uncle, she possesses telekinetic, empathic and telepathic abilities as well as flight and shape-shifting. In season 1, she is a rookie who lacks formal training, but later discovers her powers are far stronger than initially realized. By season 2, she has fully mastered her powers, but began to abuse them for most of the season until she eventually realized the error of her ways. She is also in a serious committed romance with Superboy and they marry by the end of the series.\r\nArtemis Crock (Stephanie Lemelin) is the protegee of Green Arrow, although she initially pretends to be his niece to the Team to hide the truth of her criminal family background. She is a highly athletic fighter and expert archer and weaponist. She takes on the identity of Tigress for the deep cover mission in the second season and later makes it her new permanent identity following the death of her lover, Wally West.\r\nAdditional members\r\nSeason 1\r\nThe Sphere, a sentient machine from the distant planet of New Genesis, who can take various forms. It is usually used by the Team as transport, but fights alongside them as well. It develops a strong relationship with Superboy.\r\nWolf (Dee Bradley Baker) is an oversized Indian wolf who becomes Superboy's pet after being freed from mind control during one of their missions.\r\nRoy Harper / Will Harper (Crispin Freeman) is Red Arrow, formerly Speedy, another protege of Green Arrow who initially declines joining the Team, but ultimately does before becoming a member of the Justice League. He is revealed to be a clone of the original Roy Harper, whom he manages to rescue in Season 2. In Season 3, he goes by the name Will Harper to distinguish himself from Roy, William being their middle name.\r\nZatanna (Lacey Chabert) is the daughter of Zatara and a skilled magician. During the hiatus between season one and two, she leaves the Team to join the Justice League.\r\nRaquel Ervin (Kittie and later Denise Boutte) is Rocket, who is capable of kinetic energy manipulation, usually to create a shield. Like Zatanna, she leaves the team and joins the Justice League between the Season One finale and the Season Two premiere.\r\nSeason 2: Invasion\r\nJaime Reyes (Eric Lopez) is Blue Beetle, a superhero who became infected with an alien scarab that provides him with a powerful armor, but is often in conflict with Beetle's own interests.\r\nGarfield Logan (Logan Grove in Invasion, Greg Cipes in Outsiders and Phantoms) is Beast Boy. He is initially introduced in season one as an ordinary child who becomes Miss Martian's adoptive brother, a blood transfusion from Miss Martian gives him his shapeshifting abilities. During the hiatus between seasons one and two, he acquires shape shifting abilities similar to hers and joins the Team. In the two-year gap between Season 2 and 3, Gar has left the Team to become an actor and has started a romantic relationship with Queen Perdita, revealing they met at Wally's funeral.\r\nTim Drake (Cameron Bowen) as the new Robin. He is the third Robin to join the team, following Dick Grayson, who became Nightwing, and Jason Todd, who joined and died during the time jump between seasons one and two.\r\nKaren Beecher (Masasa Moyo) is Bumblebee, a girl who possesses bee-like wings, use sonic force blasts and can shrink to an insect-like size. She originally appears briefly as a civilian in season one.\r\nMal Duncan (Kevin Michael Richardson) is a skilled hand-to-hand combatant and Bumblebee's boyfriend. He later takes the identity of Guardian. He originally appears briefly as a civilian in season one.\r\nLa'gaan (Yuri Lowenthal) is Lagoon Boy, an amphibious citizen of Atlantis highly skilled in water and capable of gaining size like a puffer fish. He originally appeared briefly as a student at the sorcery school in Atlantis in season 1.\r\nBarbara Gordon (Alyson Stoner) is Batgirl, another protegee of Batman. She originally appears briefly as a civilian in season one. She later becomes Oracle after becoming paralyzed and assists Nightwing.\r\nCassie Sandsmark (Mae Whitman) is Wonder Girl, a protegee of Wonder Woman who possesses super-strength, speed, flight, durability, as well as hand-to-hand combat skills.\r\nBart Allen (Jason Marsden) is Impulse, a time traveller from the future and Flash's grandson. He travels to the present during season two to alter history and save Earth from an upcoming apocalypse, joining the Team in the process. Like his grandfather, he can run at hypersonic speed; he can also use his powers to cause molecular vibration on himself, thus allowing him to phase through objects. He took the title of Kid Flash in the final episode of season 2.\r\nRoy Harper (Crispin Freeman) is Arsenal, the real Speedy, of whom the above-mentioned Roy Harper is a clone. He previously appeared in season one, following the revelation that he had been abducted and cloned years prior, and kept prisoner since. After being freed and receiving a cybernetic arm from Lex Luthor, he joins the Team, but is later fired for his impulsive and unsafe behavior on missions. He is given the chance to rejoin the Team after the Reach is defeated, though ultimately declines to be a solo hero.\r\nVirgil Hawkins (Bryton James) is Static, a young man who gained electromagnetic powers from alien experimentation.. He joins the Team in \"Endgame\", the Season 2 finale. In the show, his electricity is light blue, while in his own animated TV show, they were light purple. He mentions that \"his folks are cool\" which implies that his mother, Jean Hawkins, is alive here.\r\nSeason 3: Outsiders\r\nCissie King-Jones / Arrowette (Kelly Stables). She originally appears briefly as a civilian in Season One.\r\nStephanie Brown / Spoiler (Mae Whitman). She originally appeared briefly as a civilian in Season Two.\r\nTraci Thurston / Thirteen (Lauren Tom).\r\nPrince Brion/Geo-Force (Troy Baker): The younger Prince Twin of Markovia and elder brother to Princess Tara/Terra. He becomes infatuated with \"Violet\"/Halo. As with his younger sister and uncle Fredric, he exhibits earth-related abilities, capable of controlling lava and magma to create miniature volcanoes and emit bursts of lava from his hands.\r\nViolet Harper / Halo (Zehra Fazal): A young Quraci metahuman who was nearly buried by Bedlam thugs, believing them to be dead, before they suddenly resurrect themself and is rescued by Tigress; joining the Outsiders as a result. Later on, it is revealed that their real name is \"Gabrielle Daou\" a refugee who used to work for Markovia's royal family. Despite this, they say their name is \"Violet\", after Brion gave them the name after seeing their violet aura. It's further revealed that \"Violet\" is actually the spirit of a Mother Box, which inhabited Daou's body after she was killed by Bedlam's experiments. During their time with the group, they discover a vast range of powerful abilities and develops a romantic relationship with the exiled Prince Brion of Markovia.\r\nForager (Jason Spisak): A bug-like alien from the world New Genesis. He is eventually given a glamor charm from Zatanna for him to take on the human form and alias \"Fred Bugg\" to go to high school and interact more with the human race. He speaks in the third person.\r\nVictor Stone / Cyborg (Zeno Robinson): A high school football player hoping to earn a football scholarship. His deeply strained relationship with his father, Dr. Silas Stone, results in him becoming critically and fatally wounded via a massive explosion. To save his life, his father had infused him with the evil cybernetic components of a Father-Box. His left arm, rib cage and half of his chest now has gray robotic armor, as opposed to his other animated incarnations, showing his wholly robotic except his left face. After Halo was revealed to be host to a Mother-Box, he is now fully purified of his Father-Box's dark influence.\r\nPrincess Tara Markov / Terra (Tara Strong): Unlike her other animated counterparts, she is the Princess of Markovia and has a German accent similar to her elder twin brothers Gregor and Brion/Geo-Force. Her earth-controlling abilities were awakened when her inherent meta-gene was activated at the behest of her power-hungry uncle. Since then she was mind-controlled to carry out the League of Shadows plans. Rescued in the finale of the first saga \"True Heroes\", she is revealed to be willingly working with Deathstroke who is now the leader of the League of Shadows to attain crucial and personal information about the Team to him.\r\nSeason 4: Phantoms\r\nCassandra Wu-San / Orphan: The daughter of Lady Shiva who defected from the League of Shadows after inadvertently paralyzing Batgirl while attempting to assassinate The Joker.\r\nAndie Murphy / Mist (Daniela Bobadilla): A young girl with the ability to turn her body in vapor. She was the victim of a meta-human trafficking ring.\r\nContinuity\r\nAlthough Young Justice follows a continuity considerably different from that of the mainstream DC Universe, Weisman has stated that the series covers its early stages. Earth-16 was chosen by DC Entertainment for the show because it was largely untapped, freeing the series and its franchise from established continuity restraints set by either the main DC Universe or other worlds in the Multiverse. However, it was later discovered that Earth-16 had been previously used. That pre-existing continuity was ignored by Young Justice, as it was too late to move the show to another Earth. Later, DC's The Multiversity comic series explained Young Justice as a fictional series within the original Earth-16.\r\nThere are differences in the line-up of this Young Justice team as compared to the team in the comic series of the same name. Dick Grayson and Wally West were chosen over Tim Drake and Bart Allen/Impulse. Miss Martian was added because the date of her arrival to Earth could still fit in the early DC Universe concept. Aqualad, as opposed to Robin, is established in the beginning as the leader of the team. Furthermore, the Aqualad presented in the show is an entirely new character created by Weisman and Vietti, with Bourassa responsible for the original character design. Arrowette was replaced by Artemis because of the producers' desire to focus on the latter's storylines. Some of the Young Justice characters' ages are tweaked from those of their original counterparts; however, the spirit and intent of the characters were kept.\r\nCharacters who are a part of the Teen Titans and Young Justice line-ups in the comic also make an appearance in the show. This includes Garth, the first incarnation of Aqualad who later becomes the third Tempest in DC Comics; Arrowette, the archer of the team in the Young Justice comic book series; and Wonder Girl, whose legal issues originally prohibited the producers from using the character but later allowed her to be included.\r\nDevelopment\r\nConception and creation\r\nThe series began development in March 2009, when Sam Register, executive vice president of creative affairs of Warner Bros. Animation, wanted a show based on the concept of a cross between the Teen Titans and Young Justice series of comics, but was not solely an adaptation of one or the other. The title chosen for the show by Register was Young Justice, as it was appropriately meaningful to the concept the creative team was looking for. Greg Weisman, whom Register sought immediately after the cancellation of The Spectacular Spider-Man, and Brandon Vietti, whose work in directing the animated film Batman: Under the Red Hood caught Register's attention, were hired to produce. Register jokingly described the two as being similar in appearance, in addition to being similar in thought. Peter David, who penned a majority of the comic book issues of Young Justice, was approached to write several episodes. Also attached to write were Greg Weisman, Kevin Hopps, Andrew Robinson, Nicole Dubuc, Jon Weisman, and Tom Pugsley—with Vietti heavily involved in the book writing process. The show's production was started after the cancellation of a planned Nightwing series, which was scrapped in favor of this project.\r\nThe result of the collaboration of Weisman and Vietti was a show about young heroes based on a combination of the 1960s Teen Titans run and the 1990s Young Justice run, in addition to the recent Teen Titans and Young Justice comics, and revolved around the theme of secrets and lies. In drawing material from a variety of comic book sources, the creative team sought to differentiate the tone of the show from that of the Teen Titans animated television series, which the team believed resembled the tone of the Young Justice series of comics rather than that of Marv Wolfman and George Pérez' New Teen Titans series on which it was based. The concept of a covert operations team has been compared to Impossible Missions Force, a fictional independent espionage agency in the Mission: Impossible series. Together, Weisman and Vietti came up with ideas, characters, and plot points for at least two seasons, although it is unknown as to how many season runs DC Entertainment and Warner Bros. Animation were looking for the series. Although there were several characters the producers were not allowed to use in the first season (a list that became shorter along the course of the development), they were usually in charge of the decisions determining which DC Universe character would or would not be used. Geoff Johns, chief creative officer of DC Entertainment, and Phil Bourassa, lead character designer for the show, also played a role in the conception and development process.\r\nVoice casting\r\nThe initial six main characters were chosen by the producers, from a list of potential candidates of 50 to 60 DC Comics teenage superheroes. The criteria consisted of age, powers, personality, cultural icon status, and dynamics. An additional regular, Zatanna, was introduced partway through the first season, and Rocket was added at the end of the season.\r\nProduction and design\r\nThe producers intended to create costumes based in reality to match the tone of the series while keeping consistent with traditional DC Universe continuity. A majority of the art direction was led by Vietti, who established that the costume designs should not only reflect the physical needs of the wearer, but also his or her personality, with Bourassa incorporating these ideas into his designs. In the case of Kid Flash's suit, for instance, the padding serves to reduce the force of impact experienced during skids and collisions, and the leathery texture stabilizes his \"human cannonball\" momentum.\r\nVietti cites the differences between the respective costumes of Aqualad and Robin to best illustrate what he calls \"unique tailoring\". Aqualad's costume is designed for the purposes of quick movement in water, and is composed of a \"slick and textureless material\", giving the costume its \"nearly seamless and shiny\" appearance. Robin's costume provides bodily protection (even against bullets) in the streets of Gotham City, and is padded and stitched with seams and sewn-in materials. Batman's batsuit matches the extra stitching lines of Robin's outfit for similar functions, except that the batsuit is more military in style whereas Robin's costume is additionally influenced by athletic outfits to match his youthful energy.\r\nAnimation\r\nArtists at the U.S. animation studio in Los Angeles, Warner Bros. Animation, drew storyboards; designed new characters, backgrounds, and props; drew character and background layouts; and made animatics. However, Greg Weisman notes that some storyboards were done in Seoul. The overseas studios in Seoul, South Korea, MOI Animation, Inc. and Lotto Animation, drew the key animation and inbetweens. Certain episodes of Young Justice: Outsiders are also being animated by Digital eMation, another international animation studio located in South Korea. In the final stages, ink and paint and editing were done by Warner Bros. Animation. DR Movie has contributed some of the animation for this series.\r\nCancellation and revival\r\nIn January 2013, Cartoon Network had meetings with potential clients and promotional partners in which they announced their 2013–14 programming lineup. Cartoon Network had confirmed that the remaining episodes of the second season, Young Justice: Invasion, had aired entirely. Green Lantern: The Animated Series received the same treatment, and both shows were expected to have their DC Nation slots replaced by new shows, Teen Titans Go! and Beware the Batman. Warner Bros. officially stated that they were not open to a third-party crowdfunding-campaign, intended to result in a third season of Young Justice. Therefore, the ending of the Apokolips storyline was not likely to get resolved. In December 2013, Kevin Smith and Paul Dini had a conversation in an episode of Smith's Fat Man on Batman podcast addressing the 2013 cancellation of Tower Prep (created by Dini), Young Justice, Green Lantern: The Animated Series, claiming that the network executives did not want girls watching the programs because \"they don't buy toys,\" and wanted more boys watching. Greg Weisman denied that the show's female viewership was a factor in its cancellation.\r\nIn January 2016, Weisman finally revealed the reason for the show's cancellation on the podcast \"The Hip-Hop Nerd.\" The show's funding was based on a toy deal with Mattel. The toys were not selling enough so Mattel cancelled the toy line, pulling the funding for the show. With no sources of income large enough to replace the money from Mattel, the show was not picked up for a third season. In February 2016, in response to season 2 of the show being released on Netflix, Greg Weisman posted a tweet advising fans that the chances for a third season could be helped by watching on Netflix or buying the Blu-ray releases. Later that month, rumors began circulating that Netflix was considering reviving Young Justice for a third season based on its viewership numbers. When asked if he thought a third season was possible, producer Brandon Vietti replied, \"I don't know. That's the best answer I can give you. I'd be happy to do another one; Greg would be; Phil Bourassa, the character designer. We'd all in a heartbeat come back to do a third season if the Powers-That-Be feel they want to do that.\" Weisman clarified in subsequent tweets that while Warner Bros. (or Netflix) had not expressed interest in a third season, a strong showing on Netflix could motivate WB into action on a potential third season. Some voice actors from the show, including Jason Spisak, Eric Lopez, Khary Payton, Yuri Lowenthal, Nolan North, Stephanie Lemelin, Danica McKellar, Crispin Freeman, Vanessa Marshall, Kelly Hu, and Jason Marsden have all voiced their interest in a third season, as well as Young Justice comic illustrator Christopher Jones, who also vouched his support on his personal blog, and other voice actors like Susan Eisenberg, the voice of Wonder Woman in Justice League and Justice League Unlimited.\r\nIn March 2016, a petition was made to convince DC Comics and Warner Bros. to revive the Young Justice comic book line, written by Christopher Jones & Greg Weisman. On June 26, 2016, Greg Weisman commented that the possibility of Young Justice returning for a third season is \"very real,\" but noted that fans need to keep the show trending to convince Netflix and Warner Bros. to pick it up for a season three. On August 23, 2016, a Reddit user claimed to have heard that Peter David was approached by Netflix about a potential Young Justice season 3. This was later debunked by both Greg Weisman and Peter David. Later that day, Peter David clarified on his website that when he was having lunch with Greg Weisman a few weeks before, he stated that Weisman told him that Netflix is \"seriously considering\" a third season. On September 9, 2016, Greg Weisman gave response to questions on his website Station Eight regarding the possibility of Netflix picking up the show for a third season. He stated, \"I think there's a decent chance of the show coming back. Not a guarantee, mind you, but a solid decent chance. I don't say that lightly either.\"\r\nOn November 7, 2016, a third season was officially announced. Sam Register, President of Warner Bros. Animation and Warner Digital Series stated, \"The affection that fans have had for Young Justice, and their rallying cry for more episodes, has always resonated with us. We are excited to bring the show back for this loyal fanbase and to provide an opportunity for new viewers to discover this excellent series.\" The original showrunners, Brandon Vietti and Greg Weisman, will be returning. On February 7, 2017, Khary Payton, who plays Aqualad in the series, confirmed to ComicBook.com that he would return to voice the character in season 3. On February 27, 2017, Phil Bourassa, Young Justice's lead character designer, revealed, via Instagram, that he had begun working on the third season, and a week later, also revealed that some scripts have been completed. On April 25, 2017, Warner Bros. announced that the third season would be titled as Young Justice: Outsiders, with the series debuting on a new DC-branded digital service. At their 2017 San Diego Comic-Con International panel, it was revealed that the Team line-up would consist of Wonder Girl, Robin (Tim Drake), Blue Beetle, Impulse, Beast Boy, Arsenal, Static and new characters Spoiler, Arrowette and Thirteen. The season premiered on January 4, 2019. The second half of 13 episodes premiered on July 2, 2019.\r\nOn July 20, 2019, while at San Diego Comic-Con it was announced by series creators Vietti and Weisman that DC Universe had renewed the series for a fourth season. On September 12, 2020, at DC FanDome: Explore the Multiverse, Weisman and Vietti announced that the fourth season would be titled Young Justice: Phantoms.\r\nHiatus\r\nSince August 5, 2022, Warner Bros. Discovery, the new parent company of Warner Bros. after the WarnerMedia-Discovery, Inc. merger, canceled multiple HBO Max original contents and dropped several non-original contents, with Young Justice being left in limbo during the first wave of cancellations. On August 17, 2022, it was reported that HBO Max only ordered one season of Young Justice (Phantoms) and Warner Brothers Discovery had no current plans to order a new season. No official statement regarding the show being officially canceled has been issued from Warner Bros. Discovery.\r\nReception\r\nCritical response\r\nSince its original airing, Young Justice has garnered critical acclaim for its originality as well as its mature and complex storyline. In December 2011, Young Justice was placed at number 20 on IGN's \"Top 25 Comic Book Shows of All Time.\" In March 2012, DC Nation garnered double and triple digit ratings gains versus the previous year for Cartoon Network. Young Justice: Invasion averaged an audience of 1.9 million viewers every Saturday since returning to Cartoon Network with the series finale episode “Endgame” being the top-rated show for Cartoon Network for the week of March 11–17, 2013, beating out other network stalwarts such as Regular Show, Adventure Time, and Dragons: Riders of Berk. Following cancellation, the entire show was called \"mature, intelligent... struck an emotional chord with viewers... incredible\".\r\nMany actors have also garnered acclaim for their roles such as Jesse McCartney, Khary Payton, and Jason Spisak. According to critic Ava Dordi, Spisak \"captures the lighthearted essence of Kid Flash well\" as well as Nolan North, who producer Greg Weisman notes provides \"good separation\" between the dual roles he portrays as Superman and Superboy.\r\nGeoff Johns took a liking to Kaldur'ahm as Aqualad, who was consequently introduced to mainstream continuity altered in comic book issue No. 4 of Brightest Day as the second incarnation of the mantle. In Brightest Day, he is introduced as a teenager from New Mexico by the name of Jackson Hyde who is largely unaware of his Atlantean roots. In addition to his design, many aspects of the new Aqualad's back-story had to be altered to fit within the established continuity of the DC Universe. Artemis was also brought into the main timeline during the early days of the New 52, but was killed within one issue of her appearance, to great fan outcry.\r\nOn the program Conan, Conan O'Brien visited Bruce Timm during one of his segments and they developed a super hero named The Flaming C. However, on several occasions, their original creation would be animated in preexisting sequences from Young Justice using the voice acting of whichever character Flaming C was placed over. These scenes were taken from \"Fireworks\", \"Welcome to Happy Harbor\", \"Schooled\", and \"Denial\". In the comic book Young Justice/Batman: The Brave & The Bold: Super Sampler, the Team is seen watching the Flaming C on television.\r\nAwards and nominations\r\nThe series also took third place (after My Little Pony: Friendship Is Magic and The Legend of Korra) in a TV.com readers' poll for the \"Best Animated Series\" of 2012 and placed fifth in 2013 even after being cancelled.\r\nRelated media\r\nHome media\r\nThree volumes of four episodes each were individually released to cover the first half of the first season, and later sold together as a \"fun-pack\". The remainder of the first season was released as a single package with all 14 episodes. Season 2 was released as two different 2 disc volumes containing 10 episodes each. Season 2 part 1 is called \"Young Justice: Invasion Destiny Calling\". It was released on January 22, 2013. Season 2 part 2 is called \"Young Justice: Invasion Game of Illusions\" and was released on July 16, 2013. The Blu-ray releases were handled by Warner Archive Collection. The first season's Blu-ray was released on August 12, 2014. The second season, Invasion was released on Blu-ray on December 2, 2014. The third season Outsiders was released on DVD and Blu-ray on November 26, 2019, by Warner Home Entertainment and Warner Archive Collection respectively.\r\nWarner Bros. also released Volume 1 as part of the Justice League: 3-Pack Fun box set, which also includes the two-part Justice League episodes \"The Brave and the Bold\" and \"Injustice For All\", and the Justice League Unlimited episodes \"For The Man Who Has Everything\", \"The Return\", and \"The Greatest Story Never Told\".\r\nComic series\r\nYoung Justice has an official tie-in comic book series outside the television broadcast, expanding on the show's coverage of the continuity. It was written by Greg Weisman and Kevin Hopps, who were a part of the show's writing team. Mike Norton provided the interior art for the first four issues and cover art for the first six issues. Christopher Jones provided interior art beginning with issue #5, and cover art beginning with issue #7. Art Baltazar and Franco Aureliani substituted in place of Weisman and Hopps for issues #1–6, due to the latter duo's conflicting schedule and workload. Along with Brandon Vietti, Weisman and Hopps oversaw the issues for the maintenance of continuity. While children of all ages are said to be able to enjoy the series, it is specifically aimed at teenagers.\r\nThe comic series largely takes place in-between the episodes of the show, and often expands upon events alluded to or mentioned in the series. For instance, issue No. 0 follows Kid Flash and Superboy as they attempt to kill time while the members of the Justice League set up Mount Justice for their arrival at the end of the pilot episode. In the episode \"Welcome to Happy Harbor\", Robin mentions that the Justice League had been forced to abandon their headquarters in Happy Harbor after its location was compromised by supervillains, which is revealed in issue No. 2 of the comic book series to have been orchestrated by the Joker. In addition, Baltazar and Aureliani confirmed that they were asked to introduce the Joker in the comic to set up his eventual appearance on the show.\r\nStarting with the 20th issue, the comic was rebranded Young Justice: Invasion to match the title of the show's second season. The series was canceled in November 2012, with issue #25 being the last.\r\nThe comics were republished in two omnibus editions (with additional bonus comics), with Young Justice Book One: The Early Missions being released on October 8, 2019 and Young Justice Book Two: Growing Up on May 18, 2021.\r\nOn April 6, 2022, it was announced there would be a six-issue digital-first miniseries Young Justice: Targets, which acts as a follow up to Young Justice: Phantoms. The first issue was released on June 14, 2022, on DC Universe Infinite and had a physical release on July 26, 2022. The trade paperback collecting all issues is slated to be released in July 2023.\r\nYoung Justice Vol. 1 has also been translated into French, released by Urban Comics in 2019.\r\nVideo games\r\nA video game based on the show called Young Justice: Legacy was released in November 2013, for Nintendo 3DS, Microsoft Windows, PlayStation 3 and Xbox 360. Young Justice: Legacy was originally going to be released on the Wii and Wii U consoles as well, but these versions of the game were canceled due to quality issues. The game was published by Little Orbit and developed by Freedom Factory Studios, and features 12 playable characters and 12 villains. It is set in the five-year gap between Season 1 and 2.\r\nA Young Justice-themed downloadable content pack was released for Lego DC Super-Villains on May 14, 2019. The pack adds several playable characters from the series, along with a bonus level based on the Season 2 episode \"Summit\".\r\nOther\r\nAdditionally, several products based on the series were licensed for release. Mattel released lines of character action figures and accompanying playsets, among other toys and games. In addition to toys for the six lead characters, figures of Cheshire, Icicle Jr., Black Canary, Batman, Aquaman, the Flash and Ra's al Ghul have been confirmed as well. Starting March 13, 2011, McDonald's restaurants began featuring Young Justice toys in their Happy Meals. Figures include Robin, Aqualad, Kid Flash, Superboy, Superman, Batman, and the villains Captain Cold and Black Manta.\r\nThe diner that Bruce Wayne and Clark Kent meet at in the episode \"Schooled\" makes in appearance in the Batman: Death in the Family interactive film. The film also features Bruce Greenwood and Nolan North reprising their roles as Bruce and Clark respectively.\r\nCharacters based on the Young Justice versions of Zatanna, Artemis Crock, Wonder Girl, and Miss Martian, make a cameo appearance as home viewers in Scooby-Doo! WrestleMania Mystery.\r\nAqualad, Superboy & Miss Martian make an appearance in the season 2 Teen Titans Go! episode \"Let's Get Serious\", as well as cameos in the episodes \"Justice League's Next Top Talent Idol Star: Second Greatest Team Edition\" and \"Justice League's Next Top Talent Idol Star: Justice League Edition.\"\r\nAn audio story titled \"The Prize\" was released at DC FanDome prior to season 4, set as a \"Season 3.9\".\r\nA DC Universe Animated Original Movie, Catwoman: Hunted, a DC Showcase Short Film, Green Arrow, and a fellow DC Nation show, Green Lantern: The Animated Series are all considered by Weisman to be adjacent to Young Justice, meaning versions of these events all happened within the continuity of Young Justice. In 2022, the back-up story of Young Justice: Targets shows the canon version of the Green Arrow short.",
    "html": "<p>Young Justice is an American superhero animated television series developed by Brandon Vietti and Greg Weisman for Cartoon Network and Distributed By Warner Bros. Domestic Television. Despite its title, it is not a direct adaptation of Peter David, Todd Dezago and Todd Nauck's Young Justice comic series, but rather an original story set in the DC Universe with a focus on teenage and young adult superheroes.</p><p>The series follows the lives of teenage superheroes and sidekicks, namely Nightwing, Kid Flash, Aqualad, Superboy, Miss Martian, and Artemis, who are members of a fictional covert operation group. Within the show, \"the Team\" is a group of young heroes attached to the famous adult team, the Justice League, but operating outside of the bureaucracy that constrains the more established superhero team. The main setting is a fictional universe apart from the previous DCAU and other continuities, designated at one point as Earth-16, during a time period in which superheroes are a relatively recent phenomenon, and supervillains have all began working in tandem in a grand conspiracy on behalf of a cabal of key villains known as the Light.</p><p>The series debuted with an hour-long special on November 26, 2010. Young Justice premiered on September 9, 2011, on Teletoon in Canada. After airing its second season, subtitled Invasion, the series was canceled in early 2013. In November 2016, Warner Bros. Animation announced that the series would be returning for a third season, subtitled Outsiders, which premiered on January 4, 2019, on DC Universe. In July 2019, DC Universe renewed the series for a fourth season, later subtitled Phantoms and eventually moved to HBO Max. The fourth season premiered on October 16, 2021, and ended its complete season run on June 9, 2022. The series was cancelled once again in August 2022, as part of Warner Bros. Discovery streaming reorganization.</p><br/><h3>Overview</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" style=\"padding:0 8px\">Subtitle</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"3\">Originally released</th></tr><tr><th scope=\"col\">First released</th><th scope=\"col\">Last released</th><th scope=\"col\" style=\"padding:0 8px\">Network</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td scope=\"col\" rowspan=\"1\" style=\"padding:0 8px\"><i>Young Justice</i></td><td colspan=\"2\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">November 26, 2010</td><td style=\"padding:0 8px\">April 21, 2012</td><td rowspan=\"2\"><span>Cartoon Network</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td scope=\"col\" rowspan=\"1\" style=\"padding:0 8px\"><i>Invasion</i></td><td colspan=\"2\">20</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 28, 2012</td><td style=\"padding:0 8px\">March 16, 2013</td></tr><tr style=\"height:100%\"><th scope=\"row\" rowspan=\"2\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td scope=\"col\" rowspan=\"2\" style=\"padding:0 8px\"><i>Outsiders</i></td><td colspan=\"1\" rowspan=\"2\">26</td><td colspan=\"1\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 4, 2019</td><td style=\"padding:0 8px\">January 25, 2019</td><td rowspan=\"2\"><span>DC Universe</span></td></tr><tr style=\"height:100%\"><td colspan=\"1\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">July 2, 2019</td><td style=\"padding:0 8px\">August 27, 2019</td></tr><tr style=\"height:100%\"><th scope=\"row\" rowspan=\"2\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td scope=\"col\" rowspan=\"2\" style=\"padding:0 8px\"><i>Phantoms</i></td><td colspan=\"1\" rowspan=\"2\">26</td><td colspan=\"1\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 16, 2021</td><td style=\"padding:0 8px\">December 30, 2021</td><td rowspan=\"2\"><span class=\"mw-redirect\">HBO Max</span></td></tr><tr style=\"height:100%\"><td colspan=\"1\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 31, 2022</td><td style=\"padding:0 8px\">June 9, 2022</td></tr></tbody></table><h4>Season 1</h4><p>Young Justice focuses on the lives of a group of teenage sidekicks attempting to establish themselves as proven superheroes as they deal with normal adolescent issues in their personal lives. The show corresponds to the present time of our world, a time period Vietti has called \"a new age of heroes\".</p><p>Robin, Aqualad, Kid Flash, and Speedy (later revealed to be a clone of the original Roy Harper) are invited by their mentors Batman, Aquaman, Flash, and Green Arrow to tour the Hall of Justice and sit in on a meeting of the Justice League. At the last minute however they are called away. This angers Speedy, who resigns from being a sidekick. The other three use this as an opportunity to prove themselves and investigate a fire at Cadmus Labs. While there they uncover a clone of Superman named Superboy. They free him and in the ensuing escape expose Cadmus' illegal activities. Impressed, Batman and the rest of the Justice League agree to allow the sidekicks to form their own team to run secret missions for the League. Batman establishes Young Justice in a secret cave located inside a former Justice League headquarters, Mount Justice, a hollowed-out mountain. Here the teens are trained by Black Canary, given missions by Batman, and are watched over by Red Tornado. They are joined by Miss Martian, niece of the Martian Manhunter, and Artemis, Green Arrow's newest protégé. The team frequently clashes with the Light, a secret cabal of super villains, whose actions and identities are unknown to the Justice League. The Light consist of Vandal Savage, Ra's al Ghul, Lex Luthor, Queen Bee of Bialya, Ocean Master, Brain, and Klarion the Witch Boy. Young Justice also wrestles with internal problems when it is revealed that one of their members is working for the Light. When Speedy, now going by Red Arrow, becomes a member of the Justice League, he is revealed to be the traitor and enslaves the entire League with magic and alien tech infused nano-mites. Young Justice is able to break the Light's hold on all the members of Justice League, though several members had been briefly transported off world for reasons unknown or where.</p><h4>Season 2: Invasion</h4><p>Five years later, Robin (now going by \"Nightwing\"), Miss Martian, and Superboy have been offered a chance to join the Justice League, but they have decided to remain with the Young Justice. Nightwing now serves as team leader, trainer, guardian, and League liaison. Kid Flash and Artemis have retired, while Aqualad has left the team to be with his villainous long-lost father Black Manta, a member of the Light who replaces Ocean Master. New members include Beast Boy, Blue Beetle (Jaime Reyes), Robin (Tim Drake), Batgirl, Bumblebee, Lagoon Boy, Wonder Girl (Cassie Sandsmark), and Impulse (Bart Allen).</p><p>When an alien force attempts a hostile takeover of Earth, it is revealed that the Justice League had, in a show of force, attacked a peaceful planet while under the control of \"the Light\" five years ago. This showed multiple alien races that Earth could be considered a viable member of their empires. After the invasion is defeated, those members of the Justice League who led the attack leave Earth in an attempt to clear their names.</p><p>As more and more aliens come to Earth, the people's faith in the Justice League begins to dwindle and shift to the Reach, an alien race that offered a peaceful, diplomatic relationship. It is revealed that the Reach are allies of the Light who are looking to conquer Earth. Their actions attract the attention of their enemy Mongul, who brings his planetary destruction weapon, the War World, to destroy the Reach. Young Justice is able to defeat Mongul. Aqualad reveals himself to be a double agent during a summit between the Light and the Reach that Lex Luthor and Queen Bee are unable to attend. He provides the Reach with evidence that the Light was going to betray them and together with his teammates takes down Black Manta and Brain while Vandal Savage, Ra's al Ghul, and Klarion are evacuating. Meanwhile, the other half brings the War World to Darkseid on Apokolips as Vandal Savage quotes \"business as usual.\"</p><h4>Season 3: Outsiders</h4><p>Two years later, the Team battles metahuman trafficking since the Reach had revealed the existence of the meta-gene dormant within humans and how they could be activated. As a result, various nations and organizations have started participating in such activities. Geo-Force and Halo are among the experiments done by the Markovian government. In addition, they must also deal with the further plots of the Light (who now have Deathstroke, Ultra-Humanite, and Gretchen Goode replacing Ra's al Ghul, Brain, and Black Manta) as well as the appearance of brand-new characters from the planets New Genesis and Apokolips. Concurrently to all this, Geo-Force searches for his long-lost younger sister Terra. After it is revealed that the higher-ups of \"The Team\" discovered that Terra was secretly in league with Deathstroke, Geo-Force kills his tyrannical uncle, becoming the king of Markovia and ending relations with them.</p><h4>Season 4: Phantoms</h4><p>On July 20, 2019, at San Diego Comic-Con, it was announced by series creators Vietti and Weisman that DC Universe had renewed the series for a fourth season. On September 12, 2020, it was announced that the fourth season will be titled Young Justice: Phantoms. On September 18, 2020, it was announced Young Justice will be moving to HBO Max. On July 2, 2021, Greg Weisman confirmed that the entirety of season four would be animated by Studio Mir. The first two episodes of season 4 were released on October 16, 2021, on HBO Max. Season 4's narrative, which takes place one year after season 3, is divided into four part arcs focused on specific Team members from season 1, with a background focus on the Legion of Super-Heroes who also play a part in the story and a strong focus on Superboy as the central character of the season.</p><p>Miss Martian and Superboy go to Mars for their wedding ceremony as racial turmoil erupts from the murder of the Martian king and the actions of Miss Martian's revolutionary brother Ma'alefa'ak; Tigress tries to get through to her sister Cheshire as Lady Shiva makes a move to claim possible League of Shadows defectors Onyx, Cassandra Savage, and her mute daughter Orphan; Zatanna and her Sentinels of Magic are faced with the arrival of Child, seeking to replace Klarion as the primary Lord of Chaos; Kaldur'ahm returns to Atlantis as a prophecy involving Ocean Master and Arion reverberates throughout the oceans; Rocket is deployed to New Genesis for Justice League business as the machinations of Apokolips rear their heads; and Nightwing and various other teams of heroes must stop an impending invasion of Kryptonian criminals led by General Zod from escaping from the Phantom Zone, an inter-dimensional prison, who threaten to conquer the galaxy, all the while trying to save one of their own.</p><p>However, as each Team member deals with their plots, the background narrative of Superboy's presumed death from stopping a gene bomb belonging to Ma'alefa'ak reverberates throughout the mini-arcs, leaving Miss Martian profoundly heartbroken over the loss of her fiancé, further driving Beast Boy into a downward spiral of depression, being the incentive behind Tigress reaching out to Cheshire, Zatanna learning he is still alive in another dimension, Kaldur struggling to hold back his grief, Rocket unknowingly coming into contact with his attempted murderer Lor-Zod, the son of General Zod, while Nightwing finally uncovers the mystery and conspiracy surrounding Superboy's disappearance, discovering he is trapped inside the Phantom Zone and works alongside the original Team to rescue him, which is complicated by Superboy suffering from Zone Sickness and being molded into loyalty to Zod.</p><p>Following the defeat of the House of Zod and finally freed from General Zod's control, Superboy and Miss Martian finally get married on Earth in a private ceremony with a large gathering of heroes, friends, family and allies attending the wedding, including past and present members of the Justice League, Team and Outsiders. In the meantime, The Light have captured the Kryptonians on the War World whilst on Apokolips, Darkseid is introduced to the next generation of Furies, consisting of Supergirl and Black Mary.</p><br/><h3>Cast and characters</h3><h4>Original members</h4><ul><li>Dick Grayson (Jesse McCartney) is Robin, the protege of Batman and a young genius who uses high-tech gadgets and security hacking. During the time skip between seasons one and two, he outgrows the Robin identity to become Nightwing. He serves as the Team's leader in the second season, until returning the duties back to over to Aqualad. He was also best friends with Kid Flash.</li><li>Kaldur'ahm (Khary Payton) is Aqualad, an original character and the protege of Aquaman from Atlantis, who can breathe underwater and use hydrokinesis, the ability to increase the local specific density of water and then manipulate its shape. He is the leader of the Team, who is a natural due to his calm and level-headed demeanour. In season 2, he takes part in a deep cover mission to infiltrate the Light, pretending he betrayed the Team after discovering he is the son of Black Manta. In season 3, he becomes the second Aquaman and joins the Justice League. He is also revealed to be bisexual.</li><li>Wally West (Jason Spisak) is Kid Flash, the protege of The Flash. He is capable of running at hypersonic speed. He was the Team's resident flirtatious jokester, always quick with a joke or comeback, but gradually grows more mature and later begins a romantic relationship with Artemis. In Season 2, he retired from heroics and left the Team with Artemis, but returned to help stop the impending alien invasion and later dies saving the world from an alien bomb in the finale. He is later seen in hallucinations by various characters in Season 3.</li><li>Superboy (Nolan North) is a kryptonian-human hybrid who is a genomorph clone of Superman, and shares several of his abilities. He later takes the human name, Conner Kent, joins the Outsiders at the end of season 3 and eventually inspires the Legion of Super-Heroes in the 31st Century. He is also in a longtime romantic relationship with Miss Martian and they get married in the series finale.</li><li>M'gann M'orzz or Megan Morse (Danica McKellar) is Miss Martian, the niece of Martian Manhunter. Like her uncle, she possesses telekinetic, empathic and telepathic abilities as well as flight and shape-shifting. In season 1, she is a rookie who lacks formal training, but later discovers her powers are far stronger than initially realized. By season 2, she has fully mastered her powers, but began to abuse them for most of the season until she eventually realized the error of her ways. She is also in a serious committed romance with Superboy and they marry by the end of the series.</li><li>Artemis Crock (Stephanie Lemelin) is the protegee of Green Arrow, although she initially pretends to be his niece to the Team to hide the truth of her criminal family background. She is a highly athletic fighter and expert archer and weaponist. She takes on the identity of Tigress for the deep cover mission in the second season and later makes it her new permanent identity following the death of her lover, Wally West.</li></ul><h4>Additional members</h4><h4>Season 1</h4><ul><li>The Sphere, a sentient machine from the distant planet of New Genesis, who can take various forms. It is usually used by the Team as transport, but fights alongside them as well. It develops a strong relationship with Superboy.</li><li>Wolf (Dee Bradley Baker) is an oversized Indian wolf who becomes Superboy's pet after being freed from mind control during one of their missions.</li><li>Roy Harper / Will Harper (Crispin Freeman) is Red Arrow, formerly Speedy, another protege of Green Arrow who initially declines joining the Team, but ultimately does before becoming a member of the Justice League. He is revealed to be a clone of the original Roy Harper, whom he manages to rescue in Season 2. In Season 3, he goes by the name Will Harper to distinguish himself from Roy, William being their middle name.</li><li>Zatanna (Lacey Chabert) is the daughter of Zatara and a skilled magician. During the hiatus between season one and two, she leaves the Team to join the Justice League.</li><li>Raquel Ervin (Kittie and later Denise Boutte) is Rocket, who is capable of kinetic energy manipulation, usually to create a shield. Like Zatanna, she leaves the team and joins the Justice League between the Season One finale and the Season Two premiere.</li></ul><h4>Season 2: Invasion</h4><ul><li>Jaime Reyes (Eric Lopez) is Blue Beetle, a superhero who became infected with an alien scarab that provides him with a powerful armor, but is often in conflict with Beetle's own interests.</li><li>Garfield Logan (Logan Grove in Invasion, Greg Cipes in Outsiders and Phantoms) is Beast Boy. He is initially introduced in season one as an ordinary child who becomes Miss Martian's adoptive brother, a blood transfusion from Miss Martian gives him his shapeshifting abilities. During the hiatus between seasons one and two, he acquires shape shifting abilities similar to hers and joins the Team. In the two-year gap between Season 2 and 3, Gar has left the Team to become an actor and has started a romantic relationship with Queen Perdita, revealing they met at Wally's funeral.</li><li>Tim Drake (Cameron Bowen) as the new Robin. He is the third Robin to join the team, following Dick Grayson, who became Nightwing, and Jason Todd, who joined and died during the time jump between seasons one and two.</li><li>Karen Beecher (Masasa Moyo) is Bumblebee, a girl who possesses bee-like wings, use sonic force blasts and can shrink to an insect-like size. She originally appears briefly as a civilian in season one.</li><li>Mal Duncan (Kevin Michael Richardson) is a skilled hand-to-hand combatant and Bumblebee's boyfriend. He later takes the identity of Guardian. He originally appears briefly as a civilian in season one.</li><li>La'gaan (Yuri Lowenthal) is Lagoon Boy, an amphibious citizen of Atlantis highly skilled in water and capable of gaining size like a puffer fish. He originally appeared briefly as a student at the sorcery school in Atlantis in season 1.</li><li>Barbara Gordon (Alyson Stoner) is Batgirl, another protegee of Batman. She originally appears briefly as a civilian in season one. She later becomes Oracle after becoming paralyzed and assists Nightwing.</li><li>Cassie Sandsmark (Mae Whitman) is Wonder Girl, a protegee of Wonder Woman who possesses super-strength, speed, flight, durability, as well as hand-to-hand combat skills.</li><li>Bart Allen (Jason Marsden) is Impulse, a time traveller from the future and Flash's grandson. He travels to the present during season two to alter history and save Earth from an upcoming apocalypse, joining the Team in the process. Like his grandfather, he can run at hypersonic speed; he can also use his powers to cause molecular vibration on himself, thus allowing him to phase through objects. He took the title of Kid Flash in the final episode of season 2.</li><li>Roy Harper (Crispin Freeman) is Arsenal, the real Speedy, of whom the above-mentioned Roy Harper is a clone. He previously appeared in season one, following the revelation that he had been abducted and cloned years prior, and kept prisoner since. After being freed and receiving a cybernetic arm from Lex Luthor, he joins the Team, but is later fired for his impulsive and unsafe behavior on missions. He is given the chance to rejoin the Team after the Reach is defeated, though ultimately declines to be a solo hero.</li><li>Virgil Hawkins (Bryton James) is Static, a young man who gained electromagnetic powers from alien experimentation.. He joins the Team in \"Endgame\", the Season 2 finale. In the show, his electricity is light blue, while in his own animated TV show, they were light purple. He mentions that \"his folks are cool\" which implies that his mother, Jean Hawkins, is alive here.</li></ul><h4>Season 3: Outsiders</h4><ul><li>Cissie King-Jones / Arrowette (Kelly Stables). She originally appears briefly as a civilian in Season One.</li><li>Stephanie Brown / Spoiler (Mae Whitman). She originally appeared briefly as a civilian in Season Two.</li><li>Traci Thurston / Thirteen (Lauren Tom).</li><li>Prince Brion/Geo-Force (Troy Baker): The younger Prince Twin of Markovia and elder brother to Princess Tara/Terra. He becomes infatuated with \"Violet\"/Halo. As with his younger sister and uncle Fredric, he exhibits earth-related abilities, capable of controlling lava and magma to create miniature volcanoes and emit bursts of lava from his hands.</li><li>Violet Harper / Halo (Zehra Fazal): A young Quraci metahuman who was nearly buried by Bedlam thugs, believing them to be dead, before they suddenly resurrect themself and is rescued by Tigress; joining the Outsiders as a result. Later on, it is revealed that their real name is \"Gabrielle Daou\" a refugee who used to work for Markovia's royal family. Despite this, they say their name is \"Violet\", after Brion gave them the name after seeing their violet aura. It's further revealed that \"Violet\" is actually the spirit of a Mother Box, which inhabited Daou's body after she was killed by Bedlam's experiments. During their time with the group, they discover a vast range of powerful abilities and develops a romantic relationship with the exiled Prince Brion of Markovia.</li><li>Forager (Jason Spisak): A bug-like alien from the world New Genesis. He is eventually given a glamor charm from Zatanna for him to take on the human form and alias \"Fred Bugg\" to go to high school and interact more with the human race. He speaks in the third person.</li><li>Victor Stone / Cyborg (Zeno Robinson): A high school football player hoping to earn a football scholarship. His deeply strained relationship with his father, Dr. Silas Stone, results in him becoming critically and fatally wounded via a massive explosion. To save his life, his father had infused him with the evil cybernetic components of a Father-Box. His left arm, rib cage and half of his chest now has gray robotic armor, as opposed to his other animated incarnations, showing his wholly robotic except his left face. After Halo was revealed to be host to a Mother-Box, he is now fully purified of his Father-Box's dark influence.</li><li>Princess Tara Markov / Terra (Tara Strong): Unlike her other animated counterparts, she is the Princess of Markovia and has a German accent similar to her elder twin brothers Gregor and Brion/Geo-Force. Her earth-controlling abilities were awakened when her inherent meta-gene was activated at the behest of her power-hungry uncle. Since then she was mind-controlled to carry out the League of Shadows plans. Rescued in the finale of the first saga \"True Heroes\", she is revealed to be willingly working with Deathstroke who is now the leader of the League of Shadows to attain crucial and personal information about the Team to him.</li></ul><h4>Season 4: Phantoms</h4><ul><li>Cassandra Wu-San / Orphan: The daughter of Lady Shiva who defected from the League of Shadows after inadvertently paralyzing Batgirl while attempting to assassinate The Joker.</li><li>Andie Murphy / Mist (Daniela Bobadilla): A young girl with the ability to turn her body in vapor. She was the victim of a meta-human trafficking ring.</li></ul><h4>Continuity</h4><p>Although Young Justice follows a continuity considerably different from that of the mainstream DC Universe, Weisman has stated that the series covers its early stages. Earth-16 was chosen by DC Entertainment for the show because it was largely untapped, freeing the series and its franchise from established continuity restraints set by either the main DC Universe or other worlds in the Multiverse. However, it was later discovered that Earth-16 had been previously used. That pre-existing continuity was ignored by Young Justice, as it was too late to move the show to another Earth. Later, DC's The Multiversity comic series explained Young Justice as a fictional series within the original Earth-16.</p><p>There are differences in the line-up of this Young Justice team as compared to the team in the comic series of the same name. Dick Grayson and Wally West were chosen over Tim Drake and Bart Allen/Impulse. Miss Martian was added because the date of her arrival to Earth could still fit in the early DC Universe concept. Aqualad, as opposed to Robin, is established in the beginning as the leader of the team. Furthermore, the Aqualad presented in the show is an entirely new character created by Weisman and Vietti, with Bourassa responsible for the original character design. Arrowette was replaced by Artemis because of the producers' desire to focus on the latter's storylines. Some of the Young Justice characters' ages are tweaked from those of their original counterparts; however, the spirit and intent of the characters were kept.</p><p>Characters who are a part of the Teen Titans and Young Justice line-ups in the comic also make an appearance in the show. This includes Garth, the first incarnation of Aqualad who later becomes the third Tempest in DC Comics; Arrowette, the archer of the team in the Young Justice comic book series; and Wonder Girl, whose legal issues originally prohibited the producers from using the character but later allowed her to be included.</p><br/><h3>Development</h3><h4>Conception and creation</h4><p>The series began development in March 2009, when Sam Register, executive vice president of creative affairs of Warner Bros. Animation, wanted a show based on the concept of a cross between the Teen Titans and Young Justice series of comics, but was not solely an adaptation of one or the other. The title chosen for the show by Register was Young Justice, as it was appropriately meaningful to the concept the creative team was looking for. Greg Weisman, whom Register sought immediately after the cancellation of The Spectacular Spider-Man, and Brandon Vietti, whose work in directing the animated film Batman: Under the Red Hood caught Register's attention, were hired to produce. Register jokingly described the two as being similar in appearance, in addition to being similar in thought. Peter David, who penned a majority of the comic book issues of Young Justice, was approached to write several episodes. Also attached to write were Greg Weisman, Kevin Hopps, Andrew Robinson, Nicole Dubuc, Jon Weisman, and Tom Pugsley—with Vietti heavily involved in the book writing process. The show's production was started after the cancellation of a planned Nightwing series, which was scrapped in favor of this project.</p><p>The result of the collaboration of Weisman and Vietti was a show about young heroes based on a combination of the 1960s Teen Titans run and the 1990s Young Justice run, in addition to the recent Teen Titans and Young Justice comics, and revolved around the theme of secrets and lies. In drawing material from a variety of comic book sources, the creative team sought to differentiate the tone of the show from that of the Teen Titans animated television series, which the team believed resembled the tone of the Young Justice series of comics rather than that of Marv Wolfman and George Pérez' New Teen Titans series on which it was based. The concept of a covert operations team has been compared to Impossible Missions Force, a fictional independent espionage agency in the Mission: Impossible series. Together, Weisman and Vietti came up with ideas, characters, and plot points for at least two seasons, although it is unknown as to how many season runs DC Entertainment and Warner Bros. Animation were looking for the series. Although there were several characters the producers were not allowed to use in the first season (a list that became shorter along the course of the development), they were usually in charge of the decisions determining which DC Universe character would or would not be used. Geoff Johns, chief creative officer of DC Entertainment, and Phil Bourassa, lead character designer for the show, also played a role in the conception and development process.</p><h4>Voice casting</h4><p>The initial six main characters were chosen by the producers, from a list of potential candidates of 50 to 60 DC Comics teenage superheroes. The criteria consisted of age, powers, personality, cultural icon status, and dynamics. An additional regular, Zatanna, was introduced partway through the first season, and Rocket was added at the end of the season.</p><h4>Production and design</h4><p>The producers intended to create costumes based in reality to match the tone of the series while keeping consistent with traditional DC Universe continuity. A majority of the art direction was led by Vietti, who established that the costume designs should not only reflect the physical needs of the wearer, but also his or her personality, with Bourassa incorporating these ideas into his designs. In the case of Kid Flash's suit, for instance, the padding serves to reduce the force of impact experienced during skids and collisions, and the leathery texture stabilizes his \"human cannonball\" momentum.</p><p>Vietti cites the differences between the respective costumes of Aqualad and Robin to best illustrate what he calls \"unique tailoring\". Aqualad's costume is designed for the purposes of quick movement in water, and is composed of a \"slick and textureless material\", giving the costume its \"nearly seamless and shiny\" appearance. Robin's costume provides bodily protection (even against bullets) in the streets of Gotham City, and is padded and stitched with seams and sewn-in materials. Batman's batsuit matches the extra stitching lines of Robin's outfit for similar functions, except that the batsuit is more military in style whereas Robin's costume is additionally influenced by athletic outfits to match his youthful energy.</p><h4>Animation</h4><p>Artists at the U.S. animation studio in Los Angeles, Warner Bros. Animation, drew storyboards; designed new characters, backgrounds, and props; drew character and background layouts; and made animatics. However, Greg Weisman notes that some storyboards were done in Seoul. The overseas studios in Seoul, South Korea, MOI Animation, Inc. and Lotto Animation, drew the key animation and inbetweens. Certain episodes of Young Justice: Outsiders are also being animated by Digital eMation, another international animation studio located in South Korea. In the final stages, ink and paint and editing were done by Warner Bros. Animation. DR Movie has contributed some of the animation for this series.</p><h4>Cancellation and revival</h4><p>In January 2013, Cartoon Network had meetings with potential clients and promotional partners in which they announced their 2013–14 programming lineup. Cartoon Network had confirmed that the remaining episodes of the second season, Young Justice: Invasion, had aired entirely. Green Lantern: The Animated Series received the same treatment, and both shows were expected to have their DC Nation slots replaced by new shows, Teen Titans Go! and Beware the Batman. Warner Bros. officially stated that they were not open to a third-party crowdfunding-campaign, intended to result in a third season of Young Justice. Therefore, the ending of the Apokolips storyline was not likely to get resolved. In December 2013, Kevin Smith and Paul Dini had a conversation in an episode of Smith's Fat Man on Batman podcast addressing the 2013 cancellation of Tower Prep (created by Dini), Young Justice, Green Lantern: The Animated Series, claiming that the network executives did not want girls watching the programs because \"they don't buy toys,\" and wanted more boys watching. Greg Weisman denied that the show's female viewership was a factor in its cancellation.</p><p>In January 2016, Weisman finally revealed the reason for the show's cancellation on the podcast \"The Hip-Hop Nerd.\" The show's funding was based on a toy deal with Mattel. The toys were not selling enough so Mattel cancelled the toy line, pulling the funding for the show. With no sources of income large enough to replace the money from Mattel, the show was not picked up for a third season. In February 2016, in response to season 2 of the show being released on Netflix, Greg Weisman posted a tweet advising fans that the chances for a third season could be helped by watching on Netflix or buying the Blu-ray releases. Later that month, rumors began circulating that Netflix was considering reviving Young Justice for a third season based on its viewership numbers. When asked if he thought a third season was possible, producer Brandon Vietti replied, \"I don't know. That's the best answer I can give you. I'd be happy to do another one; Greg would be; Phil Bourassa, the character designer. We'd all in a heartbeat come back to do a third season if the Powers-That-Be feel they want to do that.\" Weisman clarified in subsequent tweets that while Warner Bros. (or Netflix) had not expressed interest in a third season, a strong showing on Netflix could motivate WB into action on a potential third season. Some voice actors from the show, including Jason Spisak, Eric Lopez, Khary Payton, Yuri Lowenthal, Nolan North, Stephanie Lemelin, Danica McKellar, Crispin Freeman, Vanessa Marshall, Kelly Hu, and Jason Marsden have all voiced their interest in a third season, as well as Young Justice comic illustrator Christopher Jones, who also vouched his support on his personal blog, and other voice actors like Susan Eisenberg, the voice of Wonder Woman in Justice League and Justice League Unlimited.</p><p>In March 2016, a petition was made to convince DC Comics and Warner Bros. to revive the Young Justice comic book line, written by Christopher Jones & Greg Weisman. On June 26, 2016, Greg Weisman commented that the possibility of Young Justice returning for a third season is \"very real,\" but noted that fans need to keep the show trending to convince Netflix and Warner Bros. to pick it up for a season three. On August 23, 2016, a Reddit user claimed to have heard that Peter David was approached by Netflix about a potential Young Justice season 3. This was later debunked by both Greg Weisman and Peter David. Later that day, Peter David clarified on his website that when he was having lunch with Greg Weisman a few weeks before, he stated that Weisman told him that Netflix is \"seriously considering\" a third season. On September 9, 2016, Greg Weisman gave response to questions on his website Station Eight regarding the possibility of Netflix picking up the show for a third season. He stated, \"I think there's a decent chance of the show coming back. Not a guarantee, mind you, but a solid decent chance. I don't say that lightly either.\"</p><p>On November 7, 2016, a third season was officially announced. Sam Register, President of Warner Bros. Animation and Warner Digital Series stated, \"The affection that fans have had for Young Justice, and their rallying cry for more episodes, has always resonated with us. We are excited to bring the show back for this loyal fanbase and to provide an opportunity for new viewers to discover this excellent series.\" The original showrunners, Brandon Vietti and Greg Weisman, will be returning. On February 7, 2017, Khary Payton, who plays Aqualad in the series, confirmed to ComicBook.com that he would return to voice the character in season 3. On February 27, 2017, Phil Bourassa, Young Justice's lead character designer, revealed, via Instagram, that he had begun working on the third season, and a week later, also revealed that some scripts have been completed. On April 25, 2017, Warner Bros. announced that the third season would be titled as Young Justice: Outsiders, with the series debuting on a new DC-branded digital service. At their 2017 San Diego Comic-Con International panel, it was revealed that the Team line-up would consist of Wonder Girl, Robin (Tim Drake), Blue Beetle, Impulse, Beast Boy, Arsenal, Static and new characters Spoiler, Arrowette and Thirteen. The season premiered on January 4, 2019. The second half of 13 episodes premiered on July 2, 2019.</p><p>On July 20, 2019, while at San Diego Comic-Con it was announced by series creators Vietti and Weisman that DC Universe had renewed the series for a fourth season. On September 12, 2020, at DC FanDome: Explore the Multiverse, Weisman and Vietti announced that the fourth season would be titled Young Justice: Phantoms.</p><h4>Hiatus</h4><p>Since August 5, 2022, Warner Bros. Discovery, the new parent company of Warner Bros. after the WarnerMedia-Discovery, Inc. merger, canceled multiple HBO Max original contents and dropped several non-original contents, with Young Justice being left in limbo during the first wave of cancellations. On August 17, 2022, it was reported that HBO Max only ordered one season of Young Justice (Phantoms) and Warner Brothers Discovery had no current plans to order a new season. No official statement regarding the show being officially canceled has been issued from Warner Bros. Discovery.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>Since its original airing, Young Justice has garnered critical acclaim for its originality as well as its mature and complex storyline. In December 2011, Young Justice was placed at number 20 on IGN's \"Top 25 Comic Book Shows of All Time.\" In March 2012, DC Nation garnered double and triple digit ratings gains versus the previous year for Cartoon Network. Young Justice: Invasion averaged an audience of 1.9 million viewers every Saturday since returning to Cartoon Network with the series finale episode “Endgame” being the top-rated show for Cartoon Network for the week of March 11–17, 2013, beating out other network stalwarts such as Regular Show, Adventure Time, and Dragons: Riders of Berk. Following cancellation, the entire show was called \"mature, intelligent... struck an emotional chord with viewers... incredible\".</p><p>Many actors have also garnered acclaim for their roles such as Jesse McCartney, Khary Payton, and Jason Spisak. According to critic Ava Dordi, Spisak \"captures the lighthearted essence of Kid Flash well\" as well as Nolan North, who producer Greg Weisman notes provides \"good separation\" between the dual roles he portrays as Superman and Superboy.</p><p>Geoff Johns took a liking to Kaldur'ahm as Aqualad, who was consequently introduced to mainstream continuity altered in comic book issue No. 4 of Brightest Day as the second incarnation of the mantle. In Brightest Day, he is introduced as a teenager from New Mexico by the name of Jackson Hyde who is largely unaware of his Atlantean roots. In addition to his design, many aspects of the new Aqualad's back-story had to be altered to fit within the established continuity of the DC Universe. Artemis was also brought into the main timeline during the early days of the New 52, but was killed within one issue of her appearance, to great fan outcry.</p><p>On the program Conan, Conan O'Brien visited Bruce Timm during one of his segments and they developed a super hero named The Flaming C. However, on several occasions, their original creation would be animated in preexisting sequences from Young Justice using the voice acting of whichever character Flaming C was placed over. These scenes were taken from \"Fireworks\", \"Welcome to Happy Harbor\", \"Schooled\", and \"Denial\". In the comic book Young Justice/Batman: The Brave & The Bold: Super Sampler, the Team is seen watching the Flaming C on television.</p><h4>Awards and nominations</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Notes</th><th>Result</th></tr><tr><td>2011</td><td><span>Emmy Awards</span></td><td>Outstanding Individual in Animation</td><td>Awarded to Phillip Bourassa for work in \"<span>Independence Day</span>\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>2013</td><td><span>Daytime Emmy Awards</span></td><td>Outstanding Sound Mixing – Animation</td><td>Carlos Sanches and Eric Lewis</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>2014</td><td><span>Daytime Emmy Awards</span></td><td>Outstanding Sound Mixing – Animation</td><td>Eric Lewis and Carlos Sanches</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>2014</td><td>Online Film &amp; Television Association Award</td><td>Best Animated Series</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>2014</td><td>Online Film &amp; Television Association Award</td><td>Best Voice-Over Performance (twice)</td><td>Mae Whitman For playing \"Wonder Girl / Cassie Sandsmark\" and Miguel Ferrer For playing \"Vandal Savage\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><p>The series also took third place (after My Little Pony: Friendship Is Magic and The Legend of Korra) in a TV.com readers' poll for the \"Best Animated Series\" of 2012 and placed fifth in 2013 even after being cancelled.</p><br/><h3>Related media</h3><h4>Home media</h4><p>Three volumes of four episodes each were individually released to cover the first half of the first season, and later sold together as a \"fun-pack\". The remainder of the first season was released as a single package with all 14 episodes. Season 2 was released as two different 2 disc volumes containing 10 episodes each. Season 2 part 1 is called \"Young Justice: Invasion Destiny Calling\". It was released on January 22, 2013. Season 2 part 2 is called \"Young Justice: Invasion Game of Illusions\" and was released on July 16, 2013. The Blu-ray releases were handled by Warner Archive Collection. The first season's Blu-ray was released on August 12, 2014. The second season, Invasion was released on Blu-ray on December 2, 2014. The third season Outsiders was released on DVD and Blu-ray on November 26, 2019, by Warner Home Entertainment and Warner Archive Collection respectively.</p><p>Warner Bros. also released Volume 1 as part of the Justice League: 3-Pack Fun box set, which also includes the two-part Justice League episodes \"The Brave and the Bold\" and \"Injustice For All\", and the Justice League Unlimited episodes \"For The Man Who Has Everything\", \"The Return\", and \"The Greatest Story Never Told\".</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>DVD title</th><th>Release date</th><th>Episodes</th><th>Number of Discs</th></tr><tr><td><i>Young Justice: Season One, Volume One</i></td><td>July 19, 2011</td><td>1–4</td><td rowspan=\"3\"><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">1</div></td></tr><tr><td><i>Young Justice: Season One, Volume Two</i></td><td>October 25, 2011</td><td>5–8</td></tr><tr><td><i>Young Justice: Season One, Volume Three</i></td><td>February 21, 2012</td><td>9–12</td></tr><tr><td><i>Young Justice: Dangerous Secrets</i> (Season 1, Part 2)</td><td>July 31, 2012</td><td>13–26</td><td rowspan=\"5\"><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">2</div></td></tr><tr><td><i>Young Justice Invasion: Destiny Calling</i> (Season 2, Part 1)</td><td>January 22, 2013</td><td>1–10</td></tr><tr><td><i>Young Justice Invasion: Game of Illusions</i> (Season 2, Part 2)</td><td>July 16, 2013</td><td>11–20</td></tr><tr><td><i>Young Justice</i> (Blu-ray)</td><td>August 12, 2014</td><td>1–26</td></tr><tr><td><i>Young Justice: Invasion</i> (Blu-ray)</td><td>November 18, 2014</td><td>1–20</td></tr><tr><td><i>Young Justice: Outsiders</i> (DVD/Blu-ray)</td><td>November 26, 2019</td><td>1–26</td><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">3</div></td></tr></tbody></table><h4>Comic series</h4><p>Young Justice has an official tie-in comic book series outside the television broadcast, expanding on the show's coverage of the continuity. It was written by Greg Weisman and Kevin Hopps, who were a part of the show's writing team. Mike Norton provided the interior art for the first four issues and cover art for the first six issues. Christopher Jones provided interior art beginning with issue #5, and cover art beginning with issue #7. Art Baltazar and Franco Aureliani substituted in place of Weisman and Hopps for issues #1–6, due to the latter duo's conflicting schedule and workload. Along with Brandon Vietti, Weisman and Hopps oversaw the issues for the maintenance of continuity. While children of all ages are said to be able to enjoy the series, it is specifically aimed at teenagers.</p><p>The comic series largely takes place in-between the episodes of the show, and often expands upon events alluded to or mentioned in the series. For instance, issue No. 0 follows Kid Flash and Superboy as they attempt to kill time while the members of the Justice League set up Mount Justice for their arrival at the end of the pilot episode. In the episode \"Welcome to Happy Harbor\", Robin mentions that the Justice League had been forced to abandon their headquarters in Happy Harbor after its location was compromised by supervillains, which is revealed in issue No. 2 of the comic book series to have been orchestrated by the Joker. In addition, Baltazar and Aureliani confirmed that they were asked to introduce the Joker in the comic to set up his eventual appearance on the show.</p><p>Starting with the 20th issue, the comic was rebranded Young Justice: Invasion to match the title of the show's second season. The series was canceled in November 2012, with issue #25 being the last.</p><p>The comics were republished in two omnibus editions (with additional bonus comics), with Young Justice Book One: The Early Missions being released on October 8, 2019 and Young Justice Book Two: Growing Up on May 18, 2021.</p><p>On April 6, 2022, it was announced there would be a six-issue digital-first miniseries Young Justice: Targets, which acts as a follow up to Young Justice: Phantoms. The first issue was released on June 14, 2022, on DC Universe Infinite and had a physical release on July 26, 2022. The trade paperback collecting all issues is slated to be released in July 2023.</p><p>Young Justice Vol. 1 has also been translated into French, released by Urban Comics in 2019.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Title</th><th>Material collected</th><th>Year</th><th>ISBN</th></tr><tr><td><span rel=\"nofollow\" class=\"external text\">Young Justice Vol. 1</span></td><td><i>Young Justice</i> #0–6</td><td>January 2012</td><td><style data-mw-deduplicate=\"TemplateStyles:r1133582631\">.mw-parser-output cite.citation{font-style:inherit;word-wrap:break-word}.mw-parser-output .citation q{quotes:\"\\\"\"\"\\\"\"\"'\"\"'\"}.mw-parser-output .citation:target{background-color:rgba(0,127,255,0.133)}.mw-parser-output .id-lock-free a,.mw-parser-output .citation .cs1-lock-free a{background:url(\"//upload.wikimedia.org/wikipedia/commons/6/65/Lock-green.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-limited a,.mw-parser-output .id-lock-registration a,.mw-parser-output .citation .cs1-lock-limited a,.mw-parser-output .citation .cs1-lock-registration a{background:url(\"//upload.wikimedia.org/wikipedia/commons/d/d6/Lock-gray-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .id-lock-subscription a,.mw-parser-output .citation .cs1-lock-subscription a{background:url(\"//upload.wikimedia.org/wikipedia/commons/a/aa/Lock-red-alt-2.svg\")right 0.1em center/9px no-repeat}.mw-parser-output .cs1-ws-icon a{background:url(\"//upload.wikimedia.org/wikipedia/commons/4/4c/Wikisource-logo.svg\")right 0.1em center/12px no-repeat}.mw-parser-output .cs1-code{color:inherit;background:inherit;border:none;padding:inherit}.mw-parser-output .cs1-hidden-error{display:none;color:#d33}.mw-parser-output .cs1-visible-error{color:#d33}.mw-parser-output .cs1-maint{display:none;color:#3a3;margin-left:0.3em}.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right{padding-right:0.2em}.mw-parser-output .citation .mw-selflink{font-weight:inherit}</style><span>978-1-4012-3357-0</span></td></tr><tr><td><span rel=\"nofollow\" class=\"external text\">Young Justice Vol. 2: Training Day</span></td><td><i>Young Justice</i> #7–13</td><td>November 2012</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-4012-3748-6</span></td></tr><tr><td><span rel=\"nofollow\" class=\"external text\">Young Justice Vol. 3: Creature Features</span></td><td><i>Young Justice</i> #14–19</td><td>13 February 2013</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-4012-3854-4</span></td></tr><tr><td><span rel=\"nofollow\" class=\"external text\">Young Justice Vol. 4: Invasion</span></td><td><i>Young Justice: Invasion</i> #20–25</td><td>11 December 2013</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-4012-4288-6</span></td></tr><tr><td><span rel=\"nofollow\" class=\"external text\">Young Justice Book One: The Early Missions</span></td><td><i>Young Justice</i> #0–13 and FCBD 2011 YOUNG JUSTICE BATMAN BRAVE AND THE BOLD SAMPLER</td><td>8 October 2019</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>1-77950-141-2</span>, <link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-77950-141-7</span></td></tr><tr><td><span rel=\"nofollow\" class=\"external text\">Young Justice Book Two: Growing Up</span></td><td><i>Young Justice</i> #14–25 and <i>Young Justice: Outsiders</i> #1–2</td><td>18 May 2021</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>1-77950-924-3</span>, <link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1133582631\"><span>978-1-77950-924-6</span></td></tr></tbody></table><h4>Video games</h4><p>A video game based on the show called Young Justice: Legacy was released in November 2013, for Nintendo 3DS, Microsoft Windows, PlayStation 3 and Xbox 360. Young Justice: Legacy was originally going to be released on the Wii and Wii U consoles as well, but these versions of the game were canceled due to quality issues. The game was published by Little Orbit and developed by Freedom Factory Studios, and features 12 playable characters and 12 villains. It is set in the five-year gap between Season 1 and 2.</p><p>A Young Justice-themed downloadable content pack was released for Lego DC Super-Villains on May 14, 2019. The pack adds several playable characters from the series, along with a bonus level based on the Season 2 episode \"Summit\".</p><h4>Other</h4><p>Additionally, several products based on the series were licensed for release. Mattel released lines of character action figures and accompanying playsets, among other toys and games. In addition to toys for the six lead characters, figures of Cheshire, Icicle Jr., Black Canary, Batman, Aquaman, the Flash and Ra's al Ghul have been confirmed as well. Starting March 13, 2011, McDonald's restaurants began featuring Young Justice toys in their Happy Meals. Figures include Robin, Aqualad, Kid Flash, Superboy, Superman, Batman, and the villains Captain Cold and Black Manta.</p><p>The diner that Bruce Wayne and Clark Kent meet at in the episode \"Schooled\" makes in appearance in the Batman: Death in the Family interactive film. The film also features Bruce Greenwood and Nolan North reprising their roles as Bruce and Clark respectively.</p><p>Characters based on the Young Justice versions of Zatanna, Artemis Crock, Wonder Girl, and Miss Martian, make a cameo appearance as home viewers in Scooby-Doo! WrestleMania Mystery.</p><p>Aqualad, Superboy & Miss Martian make an appearance in the season 2 Teen Titans Go! episode \"Let's Get Serious\", as well as cameos in the episodes \"Justice League's Next Top Talent Idol Star: Second Greatest Team Edition\" and \"Justice League's Next Top Talent Idol Star: Justice League Edition.\"</p><p>An audio story titled \"The Prize\" was released at DC FanDome prior to season 4, set as a \"Season 3.9\".</p><p>A DC Universe Animated Original Movie, Catwoman: Hunted, a DC Showcase Short Film, Green Arrow, and a fellow DC Nation show, Green Lantern: The Animated Series are all considered by Weisman to be adjacent to Young Justice, meaning versions of these events all happened within the continuity of Young Justice. In 2022, the back-up story of Young Justice: Targets shows the canon version of the Green Arrow short.</p><br/>"
  },
  "errorMessage": ""
}