{
  "imDbId": "tt0237123",
  "title": "Coupling",
  "fullTitle": "Coupling (TV Series 2000–2004)",
  "type": "TVSeries",
  "year": "2000",
  "items": [
    {
      "username": "jmatrixrenegade",
      "userUrl": "https://www.imdb.com/user/ur0616506",
      "reviewLink": "https://www.imdb.com/review/rw0708724",
      "warningSpoilers": false,
      "date": "4 August 2003",
      "rate": "",
      "helpful": "70 out of 85 found this helpful.",
      "title": "Hilarious, Mature, and Intelligent",
      "content": "A British show about six people ultimately connected by \"coupling\" (relationships) more than just friendship ... thus this is not really a \"British Friends,\" but is a sort of \"British Seinfeld.\" It is sharper than \"Friends\" and the characters are more complex than \"Seinfeld\" (which has one \"straight\" guy and three knuckleheads), a good combination. The \"Seinfeld\" influence is specifically shown by the Jeff character, who outrageously explains different relationship concepts in a Seinfeld-like way, a sort of invented language.On the other hand, the characters are all more mature ... having real jobs, unlike say Kramer or the ne'er'do'well George. The show at times has mature humor, but it earns it by being a mature show ... these are not the twentysomethings (now in their mid-thirties and much more boring) of \"Friends\" or the largely childish \"Seinfeld\" gang, these are mature adults with serious concerns, even if they are portrayed in often amusing ways. And they don't submit to the lowest common denominater or do things quite in the meanspirited way at times seen in \"Seinfeld.\" And the fact there are six interrelated individuals makes things more complicated ... but still, the \"friend\" aspects of it all aren't really emphasized as much.The show also is often hilarious, much so than the often mildly amusing (and less so in recent years, but then again, there are so fewer episodes of this show) \"Friends.\" A particular find is Jane ... the egotistical sexual focused nut ... her very voice is funny. Susan is the beauty that is levelheaded, but she is played by a gifted comic actress as well. The other roles are also well played.I don't know if the US version will know how to translate all of these positives to our shores, but I hope so. We need more comic gems like this in the wasteland that is American sitcoms.-j"
    },
    {
      "username": "karl-devos",
      "userUrl": "https://www.imdb.com/user/ur2112656",
      "reviewLink": "https://www.imdb.com/review/rw0979383",
      "warningSpoilers": false,
      "date": "16 December 2004",
      "rate": "",
      "helpful": "65 out of 70 found this helpful.",
      "title": "One of the best",
      "content": "Just simply amazing how Steve Moffat and his wife are getting away with it: words that would be censored in most series, fly about in this one and you don't feel offended. Every episode is different and the build-up (flash forwards, split screens, themes that run through various episodes) is amazing for a comedy series. British humor at it's very best and very recognizable for every modern day couple. Don't hesitate to go out and buy the four series, you will not regret it and they will put a smile on your face over and over again."
    },
    {
      "username": "Eumenides_0",
      "userUrl": "https://www.imdb.com/user/ur4061961",
      "reviewLink": "https://www.imdb.com/review/rw2633401",
      "warningSpoilers": true,
      "date": "26 June 2012",
      "rate": "10",
      "helpful": "16 out of 18 found this helpful.",
      "title": "Excellent Show About Relationships",
      "content": "The USA have made all my favourite TV dramas, but when it comes to humor, no one beats the UK. Every year I must watch one or two shows that make me think, \"Wow, this is the greatest comedy show I've ever seen!\" A couple of years ago it was The League of Gentlemen, then The Mighty Boosh, then The IT Crowd. Last year it was The Thick of It, and indeed it's very, very hard to top Malcolm Tucker's foul-mouthed tirades and the government's screw ups he has to solve. But for now I'll go with Coupling as the best comedy show ever.Coupling is a deceptively simple show about relationships - between sexes, between friends, between husband and wife, between rivals - but it's made with quirkiness, a great cast and some of the most intelligent dialogue ever to grace TV. Steven Moffat, the writer, loads the dialogues with insightful and original observations about language, human behaviour, the different way men and women think about certain topics like sex, faithfulness, marriage, etc., that makes this show one of the sharpest modern treatises on human relationships of our times. I think male and female viewers, watching this show, will frequently nod, \"He's absolutely right!,\" even when he's saying something very insolent about men and women.He's also helped by an excellent cast - Jack Davenport, Richard Coyle (the real star of the show, who sadly left after season 3), Ben Miles, Kate Isitt, Gina Bellman, Sarah Alexander, and the under-appreciated Richard Mylan (who has the unenviable task of replacing Coyle as the crazy, wacky character); they worked well together and their friendship and occasional spats were convincing and emotional. Richard Coyle stole the show as the socially awkward, sex-crazy Jeff - any scene with him is unforgettable, as are the weird situations he gets himself into. He sadly left the show after three seasons. Although I missed him, I disagree with some who think the show took a nosedive in the last series - Mylan was quite good as the comic book store owner Oliver, an insecure but lovable geek.In fact the last season has many of my favourite episodes. One of the things that made Coupling so good was that it also played with timelines and parallel stories, and sometimes told stories out of order. In episode 4.1 we have the same story told from three perspectives, and 4.2 has one of the highlights of the show, a phone conversation that starts with two people and ends with the five characters all getting in it. Moffat's scripts are brilliant at a sense of crescendo - they start small and turn into epic situations that completely distort the everyday world. And what of 4.5, when Jane visits Oliver's porn-filled apartment? As far as hilariously embarrassing moments, only Jeff stripping naked in front of his co-workers tops it.Coupling is one of the few TV shows I'd call perfect. The writing, the acting, the jokes, the timing, everything is just right about it. It's a pity it didn't go on for more seasons, but then probably it wouldn't have been so good. Excellence can only be sustained for so long. So thanks to Moffat and the cast for four amazing seasons!"
    },
    {
      "username": "blackburnj-1",
      "userUrl": "https://www.imdb.com/user/ur4309318",
      "reviewLink": "https://www.imdb.com/review/rw0992710",
      "warningSpoilers": false,
      "date": "5 January 2005",
      "rate": "",
      "helpful": "48 out of 59 found this helpful.",
      "title": "The Funniest Sitcom on British TV",
      "content": "Many people have drawn comparisons between \"Coupling\" and \"Friends\". I'll admit there are similarities. Six friends in the city living out their lives. But what Moffat has created is a comedy with multiple levels, superb plots and fantastic comedy. The performances from the six main actors are superb. Mention must be made of Richard Mylan (Oliver Morris Series 4 -)who had the difficult job of stepping into the shoes of Richard Coyle (Jeff Series 1-3), while Jeff is holidaying in Lesbos (cue many Lesbian jokes). Mylan does this successfully and , with the help of Moffat, has created a Jeff-like character but a character who is distinctly not Jeff. The Programme is quite simply the best sitcom on British TV."
    },
    {
      "username": "Foz90",
      "userUrl": "https://www.imdb.com/user/ur3462401",
      "reviewLink": "https://www.imdb.com/review/rw0708748",
      "warningSpoilers": false,
      "date": "17 August 2004",
      "rate": "",
      "helpful": "90 out of 102 found this helpful.",
      "title": "Very, very funny",
      "content": "Steve Moffat has created a rare thing. A rude sitcom which is actually funny. Most people will say that Richard Coyle steals the show with his fantastical character Geoff, but I personally believe that most of the credit should go to Ben Miles for his interpretation of the character Patrick. When Miles produces just one funny line he steals the show, and the other actors and actresses aren't bad either. Each person who has seen it has their favourite character whether it be statistical Sally, mad Jane, sensible Susan or paranoid Steve. It is virtually impossible not to like this show. I love this show, and I recommend that you should see it today for you will fall in love with it too."
    },
    {
      "username": "shrugfestival",
      "userUrl": "https://www.imdb.com/user/ur0876248",
      "reviewLink": "https://www.imdb.com/review/rw0708734",
      "warningSpoilers": false,
      "date": "24 February 2004",
      "rate": "",
      "helpful": "66 out of 77 found this helpful.",
      "title": "The UK trumps the Yanks in the sitcom dept.",
      "content": "I'm an American who just saw Season 1 of \"Coupling\" on DVD for the first time. Based on those first six episodes, I think the BBC's \"Coupling\" -- along with a new US series over here called \"Arrested Development\" -- is possibly the sharpest, funniest, and best-written situation comedy since the golden days of Norman Lear and MJM Productions.The cast chemistry is amazing. The archetypes are extremely identifiable, even over here, which is why the series translates so well. In comedies the subject of sex is often treated adolescently, and it's true that the characters in \"Coupling\" have some childish, \"American Pie\" reactions to sexual politics, but they're still, clearly, adults. As with \"American Pie,\" there's a big heart behind the hormones and phermones. But the gags in \"Coupling\" are brilliantly written and executed. The writers don't take the easy way out; the bawdiness of their humor is cut with intelligence and a really, REALLY great sense of left-field punch lines. Maybe naysayers have to wander through the bereft nature of many American sitcoms to understand why \"Coupling\" is so appreciated by a cult American audience, but it's the real deal.Episode 4 of Season 1, called \"Inferno,\" contains an extended monologue in which an embarrassed male character attempts to outline the plot of a lesbian porn film. He is forced to defend his affection for the stuff by being asked to give a cogent plot summary. He's squirming under this challenge -- he's got to defend his proclivities, maintain a balance between self-defense and self-effacement, and STILL intellectualize the plot of the film enough to prove he's smart enough to rise above it. This whole sequence is, possibly, the best-written and funniest 5-minute quasi-monologue ever to be televised.\"Coupling\" takes a traditionally pubescent subject matter, the puerile male fascination with sex, opposes it with the progress of rational thought, and is extremely funny in the process. Lots of US sitcoms (and some UK ones) are lucky if they get one horse laugh from the viewer every three minutes. \"Coupling's\" ratio is more like one horselaugh every thirty seconds. It's that good.(I never saw the NBC version of this show, incidentally, and have no interest -- apparently it sucked. I can understand why someone would want to use the BBC version as source material, though.)"
    },
    {
      "username": "biba_yu",
      "userUrl": "https://www.imdb.com/user/ur4767539",
      "reviewLink": "https://www.imdb.com/review/rw1882771",
      "warningSpoilers": false,
      "date": "29 May 2008",
      "rate": "10",
      "helpful": "19 out of 22 found this helpful.",
      "title": "The best comedy TV series I've ever watched!",
      "content": "This is, by far, the best comedy with best lines I've ever watched, and maybe the best of all considering relationships between men and women. I simply couldn't stop laughing and it's hard to make some more describing comment for this big piece of comedy art. It's simply impressive how besides very open language and pretty open conversations about anything in this relationship and sex area, there is nothing offensive in the script, and how almost every sentence is hilariously funny. ALthough all main characters are really great, I am almost more impressed with female characters because in many series of this (or any) type, they tend to be cliché, plain boring or stupid, or just annoying, but not these girls. They are cool as much as male characters even though writer is a guy. And that's just wonderful! Total recommendation, a must see!"
    },
    {
      "username": "Jon Kolenchak",
      "userUrl": "https://www.imdb.com/user/ur0947082",
      "reviewLink": "https://www.imdb.com/review/rw0708696",
      "warningSpoilers": false,
      "date": "23 January 2003",
      "rate": "",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Unbelievably Funny",
      "content": "I came across \"Coupling\" quite by accident one evening on BBC America. I have always been a fan of most Britcoms, and watched the remainder of the episode that was being aired, and then the next episode that followed immediately thereafter.I discovered something very interesting. Somehow this show could present just about anything and not only get away with it, but made it extremely funny at the same time. Subjects that would come across as crude, rude, and in poor taste in American sitcoms are presented here with surprisingly funny results. The cast's ensemble is just about perfect, and all are very likable in their own quirky way.It's been a very long time since I have laughed so hard watching a television show. I believe the last time was watching \"The Vicar of Dibley\" -- surprise! -- another Britcom."
    },
    {
      "username": "liquidcelluloid-1",
      "userUrl": "https://www.imdb.com/user/ur3027087",
      "reviewLink": "https://www.imdb.com/review/rw1844848",
      "warningSpoilers": false,
      "date": "22 March 2008",
      "rate": "",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Should be on anyone's list of 20 TV Shows To See Before You Die. \"Coupling\" is simply one of the funniest and most inventive sitcoms ever.",
      "content": "Network: BBC America; Genre: Sitcom; Content Rating: TV-MA (for profanity and pervasive innuendo and sexual content); Available: DVD; Perspective: Classic (star range: 1 - 5); Seasons Reviewed: Complete Series (4 seasons) Don't let the rancid after-taste of NBC's feeble attempt at a remake back in 2003 frighten you off (as it almost did me) from the original British creation that is \"Coupling\". But the remake was a scene-for-scene remake, how could the original possibly be that much better? Are the performances really that much better as to overcome such potentially stale material? Well, simply, yes. Because while NBC's bastardized version had the words on the page, it didn't have the spirit, the heart and it didn't have Jack Davenport, Richard Coyle and Gina Bellows. Now let's forget this and flash back 3 years prior.When Steve (Jack Davenport) breaks up with his ex (Gina Bellows), he falls for Susan (Jane Alexander), the ex or his friend, Patrick (Ben Miles),. As Steve and Susan enter into the tumultuous winding road of a relationship, this brings all of their friends together, including caustic, self-loathing Sally (Kate Isitt) and sexual man-child Jeff (Richard Coyle).With it's 3 guys/3 girls cast, \"Coupling\" has most often been compared to a British version of \"Friends\". Except that \"Coupling\" is smart, creative, insightful, howlingly funny and generally better in every imaginable way. I'd prefer to compare it to an American product that is worthy of this comparison. Different than \"Sex and the City\" in that it focuses on the progression of a single relationship, and sharing \"Seinfeld's\" fanatical obsession with picking apart the minutia of social mores - \"Coupling\" works so brilliantly because it narrows its sights on one thing and smokes it into the ground. That one thing: the sex joke.The sex joke. A time honored crutch by hack comedians and writers everywhere. The sitcom landscape is riddled with them, most of them tacky, 90% of them unfunny. But in \"Coupling\", creator Stephen Moffet elevates the sex joke to a witty art form with an unparalleled wit and imagination. Every single episode of the show's 4 season run deals with pulling apart and critiquing some aspect of sex and relationships from a fresh point of view.Going down the list of all the things that can annoy me about a sitcom, I find that \"Coupling\" lacks or directly contradicts all of them. Canned laugh track? Not here. The nagging know-it-all woman paired with a spineless man cliché? Nope, the show is too well written for that. Behold as Jack Davenport grabs a page-long monologue from the script and tears the through scene with a feverish rant, usually standing up for the male perspective that is usually just marginalized to a corner in an American sitcom. The bathroom is a man's sanctuary, men like looking at breasts and they don't know what the hell a couch cushion is for. Davenports' rant at the end of \"Inferno\" (a modern classic episode all around) is worth the price of a DVD purchase alone.Equally well written are the women, who strike back at the guy's long-standing befuddlement over sex and their bodies with clever clarity. \"What's so difficult about Front and Center\", a line spoken by Jane while critiquing her lover had me wondering why I'd never heard this before on TV. Susan, Sally and Jane know the power of their own sexuality and wield it like a weapon against any \"half-man half-erection\" in their path.The way Moffett tells his stories never flags in it's invention. He can't just give us a comedy of errors, he constructs just about every episode through a complex series of flashbacks, metaphorical dream sequences, time shifts and multiple character points of view. Holding back on just the right bits of information and weaving it all together to maximize the delivery of every joke. Season 3's remarkable \"Split\" is literally told entirely in split-screen. Season 4's \"Night Lines\" finds everyone crossing phone lines with hilarious complication. \"Remember This\" takes the cake for intertwining the male/female perspective on a single event brilliantly.Like any great sitcom, the strength and cohesion of this cast cannot be understated. Richard Coyle makes Jeff Murdoch one of the best spastic side-kicks in TV history. Which is why his departure from the series leaves a huge hole in the final season. A hastily conceived replacement in Oliver (Richard Mylan in an uphill battle) along with a pregnancy story makes season 4 in every way feel like a series that is winding down. It also starts straining reliability. Moffett had me at The Naked Window, The Giggle Loop and even The H-Word, but when he starts relating childbirth to The John Hurt Moment in \"Alien\" - I just can't go there.While the show is crammed with more \"Seinfeldian\" catch-phrases than you can fight off with a torch, there is such warmth and intelligence behind the show. Under the clothes \"Coupling\" finds it's biggest laughs in the differences between men and women, depicting us as worlds apart, attempting to overcome ludicrous communication and perception hurdles in order to simply cohabiting under the same roof in relative peace.\"Coupling\" is simply one of the all-around best studio-audience sitcoms ever. Trust me when I tell you that if nothing else the laughs this show has to offer are huge.* * * * * / 5"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3266600",
      "warningSpoilers": false,
      "date": "28 June 2015",
      "rate": "8",
      "helpful": "5 out of 5 found this helpful.",
      "title": "some hilarious sex romp sitcom",
      "content": "On their first date, the woman flashes her breast (the right one) to her date, her ex, her best friend, his ex and his best friend.Steve Taylor (Jack Davenport) is desperate to break up with the unflushable Jane Christie (Gina Bellman). His best friend is the strange and disturbing Jeff Murdock (Richard Coyle). Jeff works with Susan Walker (Sarah Alexander). Susan breaks up her casual relationship with the womanizing tripod Patrick Maitland (Ben Miles). Her best friend is the bitter, skin-elasticity-obsessed Sally Harper (Kate Isitt).This is Friends with more explicit sex talk and it is hilarious. Jeff is probably the funniest characters. There are some gut busting laughs. The interconnected story telling is used exceptional well. Basically, it has 3 series or 22 good episodes before Richard Coyle didn't return for the fourth series. At its best, this is a hilarious sex romp comedy."
    },
    {
      "username": "preppy-3",
      "userUrl": "https://www.imdb.com/user/ur0463200",
      "reviewLink": "https://www.imdb.com/review/rw1724110",
      "warningSpoilers": false,
      "date": "3 September 2007",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Dirty but funny",
      "content": "The lives and loves of three Britsh men and women. Sort of like a British version of \"Friends\".I was surprised to see there's only a grand total of 28 episodes considering it ran 4 years! I caught this on BBC America. The insertion of commercials hurt the shows a little--it broke up the flow of dialogue and acting. Still it was always very funny. The shows have VERY explicit sexual talk (for USA viewers at least) and it shocked me a little...but I'd be lying if I said I didn't laugh. The cast were all attractive and young and were very good in their respective roles. Also there is some partial nudity (both male and female) in certain episodes. This isn't for everybody but if you would like a fun, sexually explicit (mostly in talk) British sitcom--it's right here! Well worth seeing."
    },
    {
      "username": "Kreme",
      "userUrl": "https://www.imdb.com/user/ur0083257",
      "reviewLink": "https://www.imdb.com/review/rw0708710",
      "warningSpoilers": false,
      "date": "15 May 2003",
      "rate": "10",
      "helpful": "19 out of 23 found this helpful.",
      "title": "Possibly the best \"sitcom\" ever",
      "content": "Every episode of Coupling (22 to date) has been a brilliant gem showing just what is possible when you start with the assumption that your audience has an IQ higher than paste and is comprised of adults. The show is wickedly funny, occasionally profane, and smartly written the writers (and their cast) never back down.One can only hope that the intelligence of the show is not totally destroyed by NBC's remake, although home seems faint."
    },
    {
      "username": "Mr_Sensitive",
      "userUrl": "https://www.imdb.com/user/ur1457119",
      "reviewLink": "https://www.imdb.com/review/rw1032587",
      "warningSpoilers": false,
      "date": "4 March 2005",
      "rate": "",
      "helpful": "8 out of 9 found this helpful.",
      "title": "3 Guys and 3 Girls That Actually Make You Laugh",
      "content": "There is no doubt in my mind that this is the Funniest shows on my list and is at the top. The show is brilliantly funny and unlike the other show both the guys and the girls are funny here.It is the sex related story that has been brought out so beautifully (Sex and the City, not even close). It is sex, and sex and nothing but sex. After all if you know that, so you can't wind about \"ohh, it only have bathroom joke\" and all that.Most of the time it is Men Vs Women, talking about their sex point of view. There no word to describe how funny this show is, you have to see it for yourself.Recommendation: Yes! Definitely, 110 % Rating: 9.5/10 (Grade: A++)"
    },
    {
      "username": "disdressed12",
      "userUrl": "https://www.imdb.com/user/ur11423174",
      "reviewLink": "https://www.imdb.com/review/rw1639499",
      "warningSpoilers": false,
      "date": "17 April 2007",
      "rate": "10",
      "helpful": "10 out of 12 found this helpful.",
      "title": "easily 10/10 * stars on the laughometer",
      "content": "this 'Brit Com' gets an easy 10/10 from me.the Brits really know how to make a great sitcom.the writing easily rivals that of any North American show of this genre or any genre.the show is more risqué than many shows we have here,though things have changed in the that regard in the last few years.this is due mainly to the proliferation of specially channels.anyway,back to \"Coupling\".the writing is superb as are the performances.i would probably say that this show is equal to \"Friends\" in quality writing and performances,but that is just my opinion.if you have fairly conservative tastes,this show is not for you,as it could be considered offensive or worse.everybody has their own opinions.for me,nothing beats \"Coupling\" for pure hysterics and misunderstandings.as i said,an easy 10/10 for me"
    },
    {
      "username": "LoneAssassin",
      "userUrl": "https://www.imdb.com/user/ur0552501",
      "reviewLink": "https://www.imdb.com/review/rw1382732",
      "warningSpoilers": false,
      "date": "1 June 2006",
      "rate": "10",
      "helpful": "15 out of 18 found this helpful.",
      "title": "hilarious",
      "content": "I don't like British shows (excluding Dr Who and Red Dwarf) and I find sex jokes vulgar. Coupling changed my mind and within a month of seeing one episode I bought the whole series. Yes there are many many sex jokes in this show but their delivery is not vulgar the way they are in American shows. I'm quite disappointed that there are only 4 seasons. Each show cracks me up totally. You cannot watch just one episode you must watch them all. The cast is perfectly suited to their roles and it is nice to see Jack Davenport dressed in something that is not comparable to a Mardi Gras float.The Americans did try to make their own version and failed miserably as usual (see Dr Who and Red Dwarf US versions). Perhaps the Americans should stick to Pie and Scary movies and quit trying to copy the Brits."
    },
    {
      "username": "Bondorf39",
      "userUrl": "https://www.imdb.com/user/ur1916270",
      "reviewLink": "https://www.imdb.com/review/rw0708747",
      "warningSpoilers": true,
      "date": "19 August 2004",
      "rate": "",
      "helpful": "15 out of 18 found this helpful.",
      "title": "Perhaps, perhaps...definitely",
      "content": "This is, without question, the best situation comedy I have seen in a good many years. As a devout follower of the medium, an expert in its ways and a firm believer that it is NOT dead, but rather misunderstood, I can state unequivocally that \"Coupling\" is as good as it gets.I will not belittle this show by comparing it (as everyone else seems so fond of doing) to \"Friends\" \"Seinfeld\" and \"Sex and the City\" three American comedy series to which it bears fleeting resemblances. There is nothing that p***es me off than taking an original and innovative show and trying to explain it by cramming together a handful of old shows. It is a show about single friends who discuss love, dating and sex but there the similarities end...Except to \"Friends\" I guess, seeing as there are three girls and three boys...anyway...The strength of the show comes from the same place that it does in all great shows, and that is in the characters. Compare \"Star Trek\" to the obviously superior \"Next Generation.\" The difference? The former is concept-driven while the latter is character-driven. So \"Coupling\" may be a show about nothing, but unlike \"Seinfeld\" it is saved by seven wonderful characters.Primarily \"Coupling\" is about Steve and Susan, who are quite clearly ideal for one another but keep splitting up because Steve is stupid and indecisive and Susan is strict and unrelenting. But they gravitate back together with alarming regularity. Joining these two are Patrick (Susan's Ex), a ridiculously well-endowed pursuer of S-E-X and little else, Jane (Steve's Ex), a self-obsessed, delusional, bisexual horror who, in her capacity as a traffic reporter, has caused several accidents, Jeff (Steve's best friend and a coworker of Susan's), who is like a twelve-year-old boy who just discovered sex and hasn't grown out of his obsession with boobies, and Sally (Susan's best friend) torn between her own obsessions, one with sleeping with Patrick and another with looking forever young. In the fourth series, a new character was introduced, a nervous, comic shop owner with what can only be described as \"verbal diarrhea,\" Oliver is a charming addition to this group of confused singles.Here's the number one reason why British shows are better than American shows: After the opening titles of \"Coupling\" after all six of the cast members' names have been listed the ONLY credit that we see (apart from the actors) is \"By Steven Moffat.\" Writing is the first and most important ingredient to a good show. \"Fawlty Towers,\" \"Absolutely Fabulous,\" \"The Office,\" \"Blackadder,\" and \"Father Ted\" were not created by a staff under pressure from network execs. Each was the vision of but one writer.Okay, I guess that's everything. And since I can't think of a clever ending I shall simply stop right here."
    },
    {
      "username": "welkum2moviefone",
      "userUrl": "https://www.imdb.com/user/ur5177007",
      "reviewLink": "https://www.imdb.com/review/rw1129353",
      "warningSpoilers": false,
      "date": "15 July 2005",
      "rate": "",
      "helpful": "149 out of 165 found this helpful.",
      "title": "OMFG -- Brilliant!!",
      "content": "I'm a Yank who is only now catching the show on local PBS, courtesy of BBC America. I never saw the (aborted) NBC attempt and, having seen about a half dozen episodes, I'm glad I *didn't* As someone old enough to remember \"Monty Python\" from it's original run, I must agree with other posters that I feared that truly hysterical \"Brit wit\" was a thing of the past. I never really cared much for \"Fawlty Towers\" (as much as I love Mr. Cleese), and only the medieval episodes of Black Adder really tickled me fancy.But \"Coupling\" -- hoo hah! Anyone who compares this to \"Friends\" has clearly never watched more than an episode. At the height of its mild amusement, \"Friends\" never equaled the least of this absolutely *brilliant* series. For all the stereotypes of Brits as dry, stuck-up and stodgy, I've found that, humour-wise, we across the pond can't hold a candle...\"Coupling\" is the height of \"cultured rudeness\" in the vein of \"Absolutely Fabulous\" -- one of the most adult Brit-coms I've ever seen. Every episode is consistently ROTFLMAO funny. I couldn't even begin to pick a fave character.Patrick plays the \"stud\" character in an amusingly original manner: he has his way with the chicks, and yet is dim enough to not *totally* emasculate us lesser males. The episode where one of the gals has him bring out the \"big guns\" in the loo, to intimidate a bloke, is something you'd NEVER see on American TV.Jeff is.... well, the most creatively addled loon since Seinfeld's Kramer, albeit *nothing* like him. Almost a child-man, he reminds me of the Frasier line in \"Cheers\" - \"What color is the sky in *your* world?\" Jane is so annoyingly self-absorbed and yet, like Jeff, also such a waif that you don't totally despise her. It amazes how the series' creators walk the edge, crafting characters that *ought* to pluck your last nerve but, unlike George and Kramer from Seinfeld, could actually be tolerable in real life.The other three characters are brilliantly crafted as well, but these three stand out after the limited viewing I've been exposed to. I have never even considered purchasing a TV series on DVD but, in addition to wanting to see at least the entire first three seasons (I have read here that Jeff is not in the fourth season, and I don't think I could warm up to a substitute), I really must turn on many of my close friends to this marvelous show.For those of you Yanks out there who only know of this show from NBC's feeble attempt to import it, you *must* catch this on your local PBS station if and when it airs, or pester them incessantly until it does. You'll not only understand why the attempt at translation failed, but you'll finally get to see what the fuss was all about.If *anything* on the American telly was this consistently funny, we wouldn't have to suffer the endless rot of \"reality\" TV, and the \"dead in half a season\" warmed over '70s-era situation (non)comedies. Twelve out of ten... a *MUST SEE*!!!"
    },
    {
      "username": "tiggergoddess76",
      "userUrl": "https://www.imdb.com/user/ur3621339",
      "reviewLink": "https://www.imdb.com/review/rw0708743",
      "warningSpoilers": false,
      "date": "26 June 2004",
      "rate": "",
      "helpful": "184 out of 208 found this helpful.",
      "title": "I totally disagree with the previous review!",
      "content": "I totally disagree with the previous reviewer's comments. I found \"Coupling\" to be hilarious. It was unlike anything I had ever seen before. This person seemed to be totally confused as to the origins of the show. First it is said to be a copy of an American show, then it is stated that it is unbelievable that America wants to make their own version. It is originally a British show. It will tell you that on the special features of the DVD. The special features also include a lovely story about how the concept of the show came about. Everyone is entitled to their opinion, and mine is that \"Coupling\", while different, is brilliant and should be given a chance by all to form their own opinions of it. By the way, here's an example of the hilarity:Sally: Mary Kelly thinks you're a complete idiot.Patrick: Then why does she keep looking at my arse when we're talking?Sally: She's lip-reading."
    },
    {
      "username": "SanteeFats",
      "userUrl": "https://www.imdb.com/user/ur24907049",
      "reviewLink": "https://www.imdb.com/review/rw2967037",
      "warningSpoilers": true,
      "date": "23 February 2014",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Excellent",
      "content": "Six Brits, three men and three women are in a kind of circular, sex fueled relationship. Some have slept with each other, some have slept with several of the others. This leads to some very funny and interesting scenarios. This series plays off of the sexual tensions and mores of the single, sexual obsessions and insecurities of both sexes. Women thinking one way about the men and the men thinking not the same way but hoping for a happy ending. Jeff is the odd man out in more ways than one. He is generally a loser with women and he has some very strange ideas about the interactions between men and women, very strange indeed. Jeff is absent for some reason for the last six episodes and I miss his character. He is replaced by a man named Oliver and he is not a good replacement for Jeff. All six actors do admirable jobs in portraying their characters. This is an extremely well written and acted series and I love it."
    },
    {
      "username": "jabraltaweel",
      "userUrl": "https://www.imdb.com/user/ur4176847",
      "reviewLink": "https://www.imdb.com/review/rw0972887",
      "warningSpoilers": false,
      "date": "5 December 2004",
      "rate": "",
      "helpful": "169 out of 191 found this helpful.",
      "title": "Perhaps the greatest television comedy. Ever.",
      "content": "I've just spent the weekend watching seasons 1 and 3, and this is about the funniest show that I've ever seen. People compare it to Friends (the only real similarity is that there are 6 people involved, Coupling, however, is actually really funny instead of kinda funny.) but I'd say the show reminds me of Seinfeld, or Arrested Development in the sense that a variety of completely separate plots come together in an unexpected way in the end. It's flawless in its execution. Jeff really steals the show for me. I'd give a list of suggested episodes, but that list would essentially be a list of the entire running.My sides are still sore from laughing so hard. If you live in America, you can either get it on BBC America or get the DVD's. And you should. Seriously."
    },
    {
      "username": "Homer_Ate2",
      "userUrl": "https://www.imdb.com/user/ur49667288",
      "reviewLink": "https://www.imdb.com/review/rw5234938",
      "warningSpoilers": false,
      "date": "4 November 2019",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "This is an utterly hilarious comedy that'll keep you coming back",
      "content": "With the exception of the laughter track, this show is excellent! Every character is stereotyped to perfection."
    },
    {
      "username": "DavidYZ",
      "userUrl": "https://www.imdb.com/user/ur74935180",
      "reviewLink": "https://www.imdb.com/review/rw3682833",
      "warningSpoilers": false,
      "date": "11 April 2017",
      "rate": "10",
      "helpful": "13 out of 18 found this helpful.",
      "title": "Much funnier, sexier & more intelligent than Friends",
      "content": "This is one of the best sitcoms of all time and is massively superior to Friends. Coupling has much stronger characters, is better-acted and better-written than Friends. Coupling is hilarious. I can't understand why Friends is beloved by many millions of people whilst most people haven't even heard of Coupling.The US remake of Coupling is dreadful and bland. They took away the characters' personalities."
    },
    {
      "username": "abknor",
      "userUrl": "https://www.imdb.com/user/ur2493833",
      "reviewLink": "https://www.imdb.com/review/rw0708720",
      "warningSpoilers": false,
      "date": "17 July 2003",
      "rate": "",
      "helpful": "68 out of 104 found this helpful.",
      "title": "apples and oranges",
      "content": "First, this show is nothing like Friends. Comparing Coupling to Friends is comparing apples and oranges. They've both got three male and three female leads, and that's about the only similarity. To those who think that that's enough to call the two shows variations on the same theme I would like to say: congratulations, you can count to six. You are slightly smarter than a rabbit.Friends is about friendship. You could develop an allergy to hugging by just watching one episode. Coupling is about sexual attractiveness; how we exploit it and how we deal with getting stung by it. The jokes may be cheap at times, but the telling is never crude; nakedness is suggested, rather than shown.Coupling could have been, say, five gay guys and a straight one. The jokes would have worked as well (different jokes, of course), but then the series probably would have been compared to Kids in the Hall. Sigh. I guess I should just be glad that Coupling does not (yet) play in New York, because then we would be in a comparitivational quagmire.Also, the Jeff character is not all that brilliant. Sure, he's the crackpot, the clown. They had them in circuses, you know? Where Seinfeld's Kramer is off the map, Jeff is just normal abnormal. The true funniness of this show--and it is funny, let me assure you of that!--stems from the sharp observations, and these are made by all the cast, including but not limited to Jeff.I liked Rob Belcher's review. He wrote: \"this show will speak to anyone who's ever dated, been in a relationship, or just noticed that men and women are different creatures.\" But if you really want to get a taste of the show, don't rely on these reviews, but visit the official web site, which has clips and quotes (including the 'breasts with brains' and 'sock gap' bits). Judge for yourself.If you want to see similar British humour, I recommend \"Game On!\"(P.S. I like Friends too, but for totally different reasons, which is just as well, as it is a totally different show.)"
    },
    {
      "username": "ddbanddtt",
      "userUrl": "https://www.imdb.com/user/ur2727039",
      "reviewLink": "https://www.imdb.com/review/rw1005683",
      "warningSpoilers": true,
      "date": "24 January 2005",
      "rate": "",
      "helpful": "11 out of 14 found this helpful.",
      "title": "I've seen it all ..",
      "content": "Having seen all the Brit version on DVD I can assure anyone that it is the best Brit comedy since Monty Python .. funnier than Fawlty Towers. It isn't above adolescents, but it is aimed at thirty somethings. If I were to criticize it, I would complain that there were not enough episodes, as Brit seasons have shorter runs than the US. The six characters are well balanced, three guys and three girls. They are in various stages of being couples. One couple are cohabiting, another are getting along and another are learning to see eye to eye.The structure of the episodes involve great comic timing, occasionally a single act is played from six different perspectives to great effect.This is a series that is not just about love, it is made with love. Detail is observed in the smallest. Things change, characters that lose a limb one week don't have it grown back the next. It wouldn't surprise me if you found yourself in these characters."
    },
    {
      "username": "joydeepzerocool",
      "userUrl": "https://www.imdb.com/user/ur23805258",
      "reviewLink": "https://www.imdb.com/review/rw4775276",
      "warningSpoilers": false,
      "date": "11 April 2019",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Extremely funny and hasn't aged at all",
      "content": "I just saw 2nd season and it was hilarious. Its been 18 years since it was made and it hasn't aged at all. Though I find Friends to be the best sitcom ever but this is just the next best thing.I don't prefer british accent so I saw the 1st season of the american version which I liked but this is way better than that."
    }
  ],
  "errorMessage": ""
}