{
  "imDbId": "tt0237123",
  "title": "Coupling",
  "fullTitle": "Coupling (TV Series 2000–2004)",
  "type": "TVSeries",
  "year": "2000",
  "episodes": [
    {
      "id": "tt0549663",
      "seasonNumber": "3",
      "episodeNumber": "1",
      "title": "Split",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU5NzMwNzAwM15BMl5BanBnXkFtZTgwMzAyNDgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "23 Sep. 2002",
      "plot": "Now Steve and Susan have broken up, he has nightmares, willing to give up a lot and beg to get her back. The boys try to comfort him and contemplate weird paths of thought about phoning, sex and lust. Susan won't even admit it to herself but she is just as miserable. Sally nearly convinced Susan to call him, but that doesn't work out. Steve got Jeff to call in his place to see if Susan called him, but the idiot doesn't use his cellphone. In times of despair, each group turns to its temple: the boys to a strip-club, where Jeff remembers pole-dancer Jenny Turbot as a ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "538"
    },
    {
      "id": "tt0549648",
      "seasonNumber": "3",
      "episodeNumber": "2",
      "title": "Faithless",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ1Mjk5NzA0OF5BMl5BanBnXkFtZTgwNDA2MzgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "30 Sep. 2002",
      "plot": "Jeffs tells his mates he fears that he has caused irreparable disaster just by saying 'Hi' to office colleague Wilma Lettings. Her desk gave her the best view on his posterior during a photocopying disaster. This leads to a date with her, although her boyfriend is in Australia and Julia forbids co-workers to know about them. Jane explains 'how well' she addressed the religious program presenter James, whose sexy presence makes her substitute 'penis' for 'car'. She went to his Bible group, posing as a fellow Christian, only in her ruthlessly atheist, rude, promiscuous ...",
      "imDbRating": "8.4",
      "imDbRatingCount": "497"
    },
    {
      "id": "tt0549671",
      "seasonNumber": "3",
      "episodeNumber": "3",
      "title": "Unconditional Sex",
      "image": "https://m.media-amazon.com/images/M/MV5BMjAxODkyMDMwN15BMl5BanBnXkFtZTgwOTkxNDgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "7 Oct. 2002",
      "plot": "Jeff's date with Wilma is coached by helpful cues from the friends by phone, but he still make up absurd lies.",
      "imDbRating": "8.8",
      "imDbRatingCount": "534"
    },
    {
      "id": "tt0549660",
      "seasonNumber": "3",
      "episodeNumber": "4",
      "title": "Remember This",
      "image": "https://m.media-amazon.com/images/M/MV5BMjExMDMwMzExMF5BMl5BanBnXkFtZTgwNDQyNDgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "14 Oct. 2002",
      "plot": "Sally's dream causes her to wonder about Patrick's role in her life. After recounting the night they met, Patrick and Sally face an uncomfortable truth.",
      "imDbRating": "8.7",
      "imDbRatingCount": "517"
    },
    {
      "id": "tt0549665",
      "seasonNumber": "3",
      "episodeNumber": "5",
      "title": "The Freckle, the Key and the Couple Who Weren't",
      "image": "https://m.media-amazon.com/images/M/MV5BMTczOTgzMzI3N15BMl5BanBnXkFtZTgwNjMyNDgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "21 Oct. 2002",
      "plot": "After a row about Susan's thoughtless inability to tell Steve whether his butt had an old mole or fresh freckles, they join the friends in the pub. Jeff arrives, oblivious he's wearing an SM mask, as Steve drags out of him from playing 'Spankman' with Julia, desperate for advice about the use of laxatives to recuperate jewelry swallowed from his irresistibly naked girlfriend. Back in her apartment, where she's handcuffed and Jeff still clue- and key-less, they freak at a knock she fears to be her parents. It's worse: her military ex Joe. Jane reveals more ways to be ...",
      "imDbRating": "8.3",
      "imDbRatingCount": "478"
    },
    {
      "id": "tt0549666",
      "seasonNumber": "3",
      "episodeNumber": "6",
      "title": "The Girl with One Heart",
      "image": "https://m.media-amazon.com/images/M/MV5BMjYyOTcyMjI4OF5BMl5BanBnXkFtZTgwMTEyNDgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "28 Oct. 2002",
      "plot": "When Steve tells that Susan redecorated his bathroom, without a lock, Jeff considers this problem #1: a women-made hell where no man can ever de-clench again. Sally is toxic jealous when told Patrick, whom she hypocritically told to go for an open relationship, has a girlfriend, Jennifer- he believed to simplify matters by telling her Sally is a lesbian. Jane is madly in love, at first at sight, of a studly pizza delivery man. At a dinner, all the friends and their present significant others meet, in various rooms, ways and moods, never comfortably. Steve sings the ...",
      "imDbRating": "8.7",
      "imDbRatingCount": "528"
    },
    {
      "id": "tt0549659",
      "seasonNumber": "3",
      "episodeNumber": "7",
      "title": "Perhaps, Perhaps, Perhaps",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQzNDk2NTgyN15BMl5BanBnXkFtZTgwMzYyNDgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "4 Nov. 2002",
      "plot": "The girls make a shocking discovery.",
      "imDbRating": "8.9",
      "imDbRatingCount": "526"
    }
  ],
  "errorMessage": ""
}