{
  "imDbId": "tt0237123",
  "title": "Coupling",
  "fullTitle": "Coupling (TV Series 2000–2004)",
  "type": "TVSeries",
  "year": "2000",
  "language": "en",
  "titleInLanguage": "Coupling (British TV series)",
  "url": "https://en.wikipedia.org/wiki/Coupling_(British_TV_series)",
  "plotShort": {
    "plainText": "Coupling is a British television sitcom written by Steven Moffat that aired on BBC Two from 12 May 2000 to 14 June 2004. Produced by Hartswood Films for the BBC, the show centres on the dating, sexual adventures, and mishaps of six friends in their early 30s, often depicting the three women and the three men each talking among themselves about the same events, but in entirely different terms.\r\nThe series was inspired by Moffat's relationship with producer Sue Vertue, to the extent that they gave their names to two of the characters. Coupling is an example of the \"group-genre\", an ensemble show that had proven popular at the time. Critics compared the show to the American sitcoms Friends and Seinfeld.\r\nThe critical reaction was largely positive, and the show was named \"Best TV Comedy\" at the 2003 British Comedy Awards. The show debuted to unimpressive ratings, but its popularity soon increased, and by the end of the third series, the show had achieved respectable ratings in the UK. The series first aired on PBS stations and on BBC America in the United States beginning in late 2002 and quickly gained a devoted fanbase there, as well. The show is syndicated around the world. Short-lived American and Greek adaptations were briefly produced in 2003 and 2007, respectively. In a 2004 poll to find Britain's Best Sitcom, Coupling came in 54th.",
    "html": "<p>Coupling is a British television sitcom written by Steven Moffat that aired on BBC Two from 12 May 2000 to 14 June 2004. Produced by Hartswood Films for the BBC, the show centres on the dating, sexual adventures, and mishaps of six friends in their early 30s, often depicting the three women and the three men each talking among themselves about the same events, but in entirely different terms.</p><p>The series was inspired by Moffat's relationship with producer Sue Vertue, to the extent that they gave their names to two of the characters. Coupling is an example of the \"group-genre\", an ensemble show that had proven popular at the time. Critics compared the show to the American sitcoms Friends and Seinfeld.</p><p>The critical reaction was largely positive, and the show was named \"Best TV Comedy\" at the 2003 British Comedy Awards. The show debuted to unimpressive ratings, but its popularity soon increased, and by the end of the third series, the show had achieved respectable ratings in the UK. The series first aired on PBS stations and on BBC America in the United States beginning in late 2002 and quickly gained a devoted fanbase there, as well. The show is syndicated around the world. Short-lived American and Greek adaptations were briefly produced in 2003 and 2007, respectively. In a 2004 poll to find Britain's Best Sitcom, Coupling came in 54th.</p>"
  },
  "plotFull": {
    "plainText": "Coupling is a British television sitcom written by Steven Moffat that aired on BBC Two from 12 May 2000 to 14 June 2004. Produced by Hartswood Films for the BBC, the show centres on the dating, sexual adventures, and mishaps of six friends in their early 30s, often depicting the three women and the three men each talking among themselves about the same events, but in entirely different terms.\r\nThe series was inspired by Moffat's relationship with producer Sue Vertue, to the extent that they gave their names to two of the characters. Coupling is an example of the \"group-genre\", an ensemble show that had proven popular at the time. Critics compared the show to the American sitcoms Friends and Seinfeld.\r\nThe critical reaction was largely positive, and the show was named \"Best TV Comedy\" at the 2003 British Comedy Awards. The show debuted to unimpressive ratings, but its popularity soon increased, and by the end of the third series, the show had achieved respectable ratings in the UK. The series first aired on PBS stations and on BBC America in the United States beginning in late 2002 and quickly gained a devoted fanbase there, as well. The show is syndicated around the world. Short-lived American and Greek adaptations were briefly produced in 2003 and 2007, respectively. In a 2004 poll to find Britain's Best Sitcom, Coupling came in 54th.\r\nProduction\r\nConception\r\nMoffat had used the breakdown of his first marriage as inspiration for his 1990s sitcom Joking Apart. Retaining this semiautobiographical trend, Coupling was based on him meeting his wife, Sue Vertue, and on the issues that arise in new relationships.\r\nMoffat met Vertue at the Edinburgh International Television Festival in 1996. Vertue had been working for Tiger Aspect, a production company run by Peter Bennett-Jones. Bennett-Jones and his friend and former colleague Andre Ptaszynski, who had worked with Moffat on the sitcoms Joking Apart and Chalk, told Moffat and Vertue that each fancied the other. A relationship blossomed and they left their respective production companies to join Hartswood Films, run by Beryl Vertue, Sue's mother. After production wrapped on Chalk in 1997, Moffat announced to the cast that he was marrying Vertue.\r\nWhen she eventually asked him to write a sitcom for Hartswood, he decided to base it around the evolution of their own relationship. Drunk one evening, he went into her office, wrote the word \"Coupling\" on a sheet of paper and told her to ask him about it later.\r\nThe couple formed the basis for the main characters Steve and Susan. The four other characters are Steve and Susan's best friends and last ex-relationships (one of each for both Steve and Susan). The fourth episode, \"Inferno\", was written shortly after Vertue had found a similar tape in the VCR, although Moffat added the 'spanking' element to the script as he \"didn't think the real tape was quite pervy enough.'\"\r\nThe show used the \"group genre\", a type of programme using ensemble casts that was proving popular, with then-recent successes as Friends, This Life (also starring Davenport), and Cold Feet. Moffat feels the group genre reflects young people's modern mores more so than traditional sitcoms, saying, \"Young people watch because it is the lifestyle which is just ahead of them and older people reminisce. Coupling is about two people who get together and bring with them baggage from their past, friends, and ex-partners - people who would never meet under normal circumstances. It deals in the kind of trivia people talk about, important questions like when should a man take off his socks during foreplay?\" Moffat believes group shows would not have been popular with earlier generations of television audiences, stating:\r\nFriends would have run for only half a series if it had been set during my parents' time. I am sure there has always been misbehaving by people before they settle down, but there was this perception that anyone who ever got married before the '60s was a virgin. What has changed is that all important gap between having left mummy and daddy and becoming a parent yourself. This is the time in which you make decisions which will define you. These few years are pivotal and they are getting longer. There are now people running round with disposable incomes who still want to do lots of things before they settle down to one partner.\r\nWriting\r\nAccording to Vertue, Steven Moffat wrote on the top floor of their family home. Once he finished a script, she read it two floors away so he could not hear her laughing. The producer says that his first drafts were \"pretty much ready to shoot\". She did not give him many notes; she would tick all of the places where she laughed, and then he revised the script accordingly.\r\nThe humour of the show, according to Moffat, is in the context. He says that there are \"no jokes per se\" and if they did put jokes in, they were normally taken out because they did not work. He found writing the show difficult at first because he was writing his own voice six times over, with none of the characteristics and inflections of the performers to inspire him.\r\nMoffat used a range of styles and techniques, such as split screen and nonlinear narratives, that are unconventional in sitcoms. The first series episode \"The Girl with Two Breasts\", in which half of the episode is in Hebrew, proved so popular that the producers tried to do something similar every series. Moffat says that the simplicity of the setting encouraged an \"epic, ridiculous way of telling an ordinary story.\" The opening episode of series three, \"Split\", uses split screen to simultaneously depict what happens with Steve and Susan after separating. The series four opener, \"Nine and a Half Minutes\", depicts the same events in the bar from three different perspectives.\r\nRehearsals\r\nBritish sitcoms usually cannot afford to occupy a studio facility for the entire run, meaning that they are unable to rehearse in the studio. Rehearsals for Coupling took place in a church hall off Kensington High Street.\r\nThe actors received their scripts on Friday mornings. Following a read-through, Moffat was generally forced to cut minutes worth of material to achieve the requisite length. Director Martin Dennis designed and compiled the camera script on Saturday afternoons. After a day off on Sundays, the sets were erected for a producer's run on Mondays, and then a technical run on Tuesdays. Much of Wednesdays was spent camera blocking, a process which regularly overran at the expense of a dress rehearsal.\r\nAs the actors became familiar with the material, they would sometimes develop a joke. However, according to Moffat, such elaboration could overcomplicate a joke for an audience coming to the material for the first time. Martin Dennis, according to Moffat, regularly told the actors, \"You know that funny thing you're doing? Don't do that\". The director encouraged them to deliver their lines as well as they had in the original read-through.\r\nRecording\r\nAll of the location sequences for each series were filmed in London during the first week of each production block. As Moffat was generally late delivering the final few scripts of each series, those episodes contained no location material. The exterior shots of the bar were filmed in Clerkenwell in the first series. After a nearby Thai restaurant complained that filming was disrupting their business, a street just off Tottenham Court Road was used from series two. The house in which Moffat and Vertue lived at the time was used as the exterior for Steve's flat, with the surrounding area used for other sequences.\r\nMaterial that was technically difficult was filmed the day before the recording with the live studio audience. A common example of this would be a dinner-table sequence, where some characters would be filmed against the fourth wall, rather than the often-used contrived method of cramming everyone together around the proscenium. Readjusting the set and refilming against the fourth wall would have been too time-consuming. However, the absence of the studio audiences made it more difficult for the actors to judge the timing of the laughs. For instance, Moffat says that this prevented Gina Bellman from \"milking\" a particular laugh in the episode \"Dressed\", an episode in which most of her scenes were prerecorded because she was wearing minimal clothing on set to provide the illusion of complete nudity. The prerecorded sequences were tightened in the editing process once the scenes had been played to the studio audience.\r\nEpisodes were mostly filmed in front of a live studio audience at Teddington Studios in London Borough of Richmond upon Thames on Wednesday evenings. Sue Vertue says that the live audience reinvigorated the company because no one had laughed at the material for a few days, as everyone knew it so well. A warm-up comedian updated the studio audiences about any important plot detail, introduced them to the performers, and provided entertainment while cameras and sets were being repositioned. Rob Rouse fulfilled this role for the fourth series.\r\nDespite some critics' comments, all of the laughter in Coupling was from a genuine live studio audience. Although artificial, canned laughter was not used, the laughter sometimes had to be tweaked during the editing process. For instance, the studio audience might laugh for longer than might be expected of the home audience. Also, the audience's laughter decreased if a scene was shot multiple times; in these cases the laughter from an earlier take would be used.\r\nMoffat felt uncomfortable and powerless during the studio recording. Sitting in the gallery, he wrote the word 'help' repeatedly on the back of his scripts. In an interview for the DVD release, he says he was aware that their most successful show received the least amount of laughter from the studio audience. Conversely, studio audiences reacted emphatically to his previous studio sitcom, Chalk, yet it received a poor critical reception upon transmission. Martin Dennis would start editing from the following Monday afternoon. The episodes were then colour graded and dubbed with sound effects and music.\r\nMari Wilson performed the song \"Perhaps, Perhaps, Perhaps\", written by Osvaldo Farrés and Joe Davis, to accompany the opening and closing credits. Simon Brint composed and arranged the incidental music. The title sequence, as Mark Lawson described, consists of \"brightly coloured and suggestive shapes swirl around the screen: circles, curves, and angles tumble like limbs locked together in sex. As the names of the actors discreetly sweep across in black lettering, the bright shapes form the title: Coupling.\" Lawson calls the design \"elegant simplicity, showing how a clever choice of theme tune can evoke an atmosphere and set a pace to which images can be cut.\" The colour scheme was changed for the fourth series, although the basic design remained.\r\nCharacters\r\nMain characters\r\nCoupling is almost entirely based around the antics of the six main characters. The show was inspired by Moffat's relationship with producer Sue Vertue, to the extent that they gave their names to two of the characters. Coupling features no other recurring characters that last beyond a few episodes. In the series, \"the women are mainly confident and sexually quite voracious, whilst the blokes are completely useless, riddled with self-doubt and awkwardness.\"\r\nSteve Taylor (Jack Davenport) is in the process of breaking off his relationship with Jane as the series begins. The remainder of the series shows the development of a relationship with Susan, from dating, proposal of marriage, and as the last series concludes, becoming father to her baby. No reference is made to Steve's job during the series, but in a DVD commentary, Moffat mentions that Steve is, like him, a writer. Moffat had used the surname \"Taylor\" for Robert Bathurst's character in his earlier sitcom Joking Apart.\r\nAccording to the BBC's website, Steve \"tries to be the voice of reason while talking to his mates over a pint, but more often than not he stumbles into more complex and ridiculous situations than any of them.\" Writer Moffat says that Steve\r\ncan be just as erratic as Jeff can be, and certainly in the first part of the series, he remonstrates with Jeff for his madness. At the same time he tells Patrick off for being ruthless with women, and yet the evidence shows that Steve himself is a bit of a bastard. For example he asks Susan out on a date while he's having sex with Jane. He is quite typical of having all the same lusts and appetites as Patrick while also having the nervousness of Jeff and the new character Oliver. He forms a compromise of a politically correct weasel, which helps him to believe that he's a decent chap. Actually he's really too frightened of Susan to misbehave!\r\nSusan Walker (Sarah Alexander) – Best friend to Sally, girlfriend/fiancée to Steve and ex-girlfriend of Patrick, Susan is one of Jeff's co-workers. Susan is usually very sensible and organised, a fact often resented by her friends Sally and Jane. Susan can be very insecure and often takes this out on Steve. When angry, she generally says \"apparently\", a habit first noted in the first-series episode \"Inferno\" and shown to be inherited from her mother in \"My Dinner in Hell\". In the series-one episode \"Size Matters\", Susan is implied to view Angus Deayton in the same way that Steve views Mariella Frostrup, even keeping two pictures of him hidden in her bedroom. Steve and Susan's various arguments and differences of opinion make up a majority of the comic exchanges between them. Susan is a successful career woman, speaks French fluently, and takes her work life very seriously. Whilst Susan's job is never directly referred to, she works alongside Jeff, an accountant, and she reveals she has a degree in economics. In series four, she has a baby boy with Steve.\r\nJeff Murdock (Richard Coyle) – Best friend to Steve, he is a co-worker to Susan, whom he dated one time. Jeff's constant sexual frustration, ridiculous stories, and fantasies about women and sex make up a major part of the comedy. Scholar Jeffrey Griffin observes, \"Jeff is known for his bizarre theories, one or two of which he outlines in every episode the defining element of an episode, with the plot unfolding in some way that tests one of Jeff’s theories.\"\r\nJeff is terrible at talking to women, often stumbling and unintentionally making up lie upon lie in an attempt to avoid looking stupid. These always backfire on him. From titbits he occasionally lets slip, his problems apparently can largely be traced back to his eccentric and domineering mother (who appears in series two's \"Naked\", played by Anwen Williams). Jeff works as an accountant in an office with Susan, and through him, Steve and Susan initially meet. Coyle quit his role as Jeff before the fourth series. However, his character returns in a dream sequence in Steve's imagination in the final episode, \"Nine and a Half Months\"; portrayed by Samantha Spiro, \"Jeffina\" has undergone sex-reassignment surgery whilst living on the island of Lesbos, in a failed attempt to see another woman naked again. Jeff is also featured in the written epilogue published by Moffat online for the show.\r\nSally Harper (Kate Isitt) – Best friend to Susan (and girlfriend to Patrick by series four), Sally is obsessed with her own appearance and constantly worries about the effects of aging and life in general on her looks. Her worst fear seems to be of dying alone, but she seems totally inept at relationships due to her frequent paranoia, which tends to make her out as a very mean-spirited woman. Sally runs her own beauty parlour and is a successful businesswoman, but of the entire group, she is the most insecure and resentful. A Labour supporter, she finds reconciling this with her attraction to Patrick, a Conservative, to be difficult.\r\nPatrick Maitland (Ben Miles) – Ex-boyfriend to Susan (and Sally's boyfriend by series four), Patrick has a one-track mind: sex. This gives him a very narrow view of women, but he is great at courting them. Frequent references are made to his rather large penis; Susan nicknames him \"donkey\" and \"tripod\", sparking much of Sally's initial interest in him despite her objections to his political beliefs (Patrick is a Conservative, which conflicts with Sally's Leftish attitudes). Patrick has a habit of saying things without thinking that give the impression that he is rather dense. Two explanations for this given in the series are his own claim that he 'doesn't have a subconscious' and thus 'nothing is going on' in his head and Sally's remark that there's not enough blood in his body for 'both ends' (making reference to his abnormally large penis). He is very good at getting women to bed, and cannot comprehend meeting a woman and not having sex with her. In the fourth series, he is revealed to generally leave in the middle of the night. In one episode, unknown to him, a woman from his past made a vibrator from a plaster cast of Patrick's erect penis and marketed as the Junior Patrick; the box clearly has a 10-inch measurement on the side when seen later in the episode. Patrick's love of the ladies often backfires, and the series frequently features story lines about his possessive lovers and ex-lovers. Patrick is a successful businessman and is very competitive with others in the same business, but he does have a vague sense of loyalty to his friends. He collects videos of nights with his girlfriends in his rather large \"cupboard of love.\" Patrick proposes to Sally in the last episode when she finds the engagement ring in the cupboard, but her answer is left unknown.\r\nJane Christie (Gina Bellman) – Ex-long-time partner of Steve, Jane is a histrionic who is very possessive, and despite breaking up with Steve in the first episode, she never truly seems to let go. Jane has a problem talking to men, often coming on much too strong and appearing desperate or rude to others in her pursuit of a man. Her character also seems not to be too bright, perhaps even disturbed, and is known to be incredibly self-obsessed, as shown in a second-series episode when a 'subtext detector' shows that the only thing she ever really means when talking is the word \"me\". In the fourth series, everyone starts referring to her as being \"mad\". Jane claims to be bisexual, although she is never seen dating a woman. Susan time and again expresses scepticism, so this claim may be a ploy to entice men. However, Susan (for her own reasons) French kisses Jane in the fourth series and Jane seems to be overwhelmed, but enjoys it. However, her claim is also successfully challenged by Oliver Morris in the fourth series, where he points out that she is indeed not bisexual. Jane works in a local radio station as a traffic reporter, and is popular mainly due to her flirtatious nature and sexually explicit reports. She was once briefly fired for telling all the drivers to close their eyes to centre themselves and changing the names of streets for her own amusement, among other things, but was rehired due to her popularity.\r\nOliver Morris (Richard Mylan) is introduced in the fourth series and eventually becomes involved with Jane. He runs a local science-fiction media store called \"Hellmouths\" and has been out of a relationship for several months. Oliver often has a very cynical outlook, but is prone to accidents, often making a fool of himself in the process. He is sometimes shown gearing himself up to meet women and have sex by thinking to himself, which the audience can hear. The geekiness of his job is also used for comic effect. Oliver also seems to have inherited Jeff's inability to talk to women, however, unlike Jeff he believes himself to be a ladies' man, or in his thoughts' words \"a woman-killer, I mean lady-killer...\". Oliver has a tendency to use the word 'craziness' frequently in conversations, usually as an attempt to alleviate tension when he starts blabbering. Richard Mylan has said in interview that people took a long time to accept his character due to Jeff's popularity.\r\nOther characters\r\nJulia Davis (Lou Gish) appears in five episodes spanning over series two and three. She first appears in \"Naked\", as the new head of department in the office where Jeff and Susan work. Julia and Jeff soon fall for each other due to their shared inability to hold a reasonable conversation with a member of the opposite sex. Despite overcoming the inevitable troubles with each other, their relationship ends when Julia's ex, Joe, a soldier, returns believing Julia to still be his girlfriend. After finding Julia chained to the bed in her room, dressed in bondage gear, Joe attacks Jeff. In the final episode of series three, Jeff explains that Julia and Joe have left together to discover their feelings for each other, in Bolton.\r\nTamsin (Olivia Caffrey) is Oliver's Irish ex-girlfriend, who left him for unknown reasons around six months prior to the beginning of the fourth series, and has since become pregnant by another man, with whom she has now split. She befriends Susan at an antenatal class and is also revealed to be one of Patrick's many ex-girlfriends. Tamsin and Oliver seem to have a sour relationship, as is shown over the three episodes in which she features. She refers to him as a cross between brother and sister.\r\nJames (Lloyd Owen) appears in three episodes of series three. He hosts the religious programme at the radio station where Jane works, and Jane pretends to have an interest in religion to become his girlfriend. Jane is devastated to find he does not believe in sex before marriage, and even more so to find that he had a fervent sex life before finding God, which included a night with Susan. He leaves on a trip to Germany at the end of '\"The Freckle, the Key and the Couple Who Weren't\" and returns in \"Perhaps, Perhaps, Perhaps\", just as Jane is expressing her amazement that the many sexual encounters she has had while he was away have not made her pregnant (\"I have shagged and shagged and shagged and all the little bastards missed!\").\r\nJill (Elizabeth Marmur) appears in an episode of series one and once again in series four. In the first series, Jill is Jane's therapist whom Jane constantly manages to manipulate. She challenges Jane's statement that she can be a vegetarian whilst still eating meat. She is dragged to a dinner party with Jane in an episode called \"Inferno\", where everyone assumes she is a lesbian. She witnesses one of Steve's monologues about loving naked bottoms when the subject of one of his videos, the legendary Lesbian Spank Inferno, comes up. Jill reappears in the fourth series as a pregnancy specialist, having retrained to avoid encountering Jane again; to her dismay, Jane attends one of her antenatal classes wearing a fake pregnancy belly, claiming to be simultaneously pregnant and not pregnant.\r\nWilma Lettings (Emilia Fox) Wilma Lettings appears in two consecutive episodes of series three (\"Faithless\" and \"Unconditional Sex\") as a woman working in the same office as Jeff. In the first episode, Jeff agrees to go out for a drink with her, but is unsure whether or not it is a date, as they are both in relationships, but her boyfriend is away in Australia and he cannot tell her who his girlfriend is, as Julia does not want anyone in the office to know that they are dating. To further complicate matters, Wilma was present at an incident in which Jeff got his head trapped in a photocopier, and Jeff does not know if she found it funny or horrifying. The second episode starts with Jeff in the bar with Wilma, using an earpiece to allow the others to instruct him on the subtext of the conversation and how to respond. However, this is unnecessary, as Wilma quickly asked Jeff if he fancies her, to which he is forced to say yes, as Julia has taken the phone from Steve and asks him if he loves her at the same moment. Things quickly spiral out of control as Jeff tells Wilma that his girlfriend had recently died, on Jane's suggestion, to get out of 'the fork'. The episode ends with Wilma running out of Jeff's flat after seeing Julia's feet sticking out from under his duvet, when sleeping at his flat.\r\nEpisodes\r\nFour series of Coupling were produced for the BBC. The first series of six episodes was broadcast on Friday evenings from 12 May to 16 June 2000. Nine episodes were commissioned for the second series, which was broadcast on Monday evenings in Autumn 2001. The third series, consisting of seven episodes, were broadcast a year later. The fourth series was first broadcast on BBC Three in May and June 2004, although the six episodes were repeated on BBC Two a few months later.\r\nThe BBC approached Moffat about writing a fifth series, but other commitments made gathering the cast impossible. Moffat began writing for Doctor Who when the show was revived in 2005, becoming the show's executive producer and lead writer for Doctor Who's fifth series in 2010. However, to finalise Coupling, Moffat posted some short storyline \"conclusions\" about the eventual fate of the characters on the website Outpost Gallifrey.\r\nReception\r\nCritical reception was generally positive. The Guardian's Mark Lawson applauded Moffat's writing, specifically assessing the episode \"The Girl with Two Breasts\" as \"comic writing of astonishing originality and invention.\" The Daily Record called the show \"frank and funny.\" Writing in The Independent, Mark Thompson, then director of television at the BBC, mentioned Moffat's earlier sitcoms Joking Apart and Chalk to suggest \"ambition in television is also about sharing the long road to originality and creative achievement.\" The Guardian also comments, \"Moffat ... has long seemed to me one of the most original TV writers and it's good that ratings-crazed television has persevered with him. His particular talent is for intricately plotted sexual farce.\" The Times commented, \"Steven Moffat is turning out to be one of the boldest, most inventive, sitcom writers around.\" Scholar James Monaco comments that Coupling is \"witty and elegantly structured ... the Seinfeld/Friends model to new heights with intricately wrought plots built on the interactions of six young friends. Replete with rich dialogue and bright timing it renewed the British comedy franchise.\"\r\nVarious journalists compared the show to the American sitcoms Friends and Seinfeld. Melbourne's The Age commented that the show was \"as a 'highly original' and 'unrestricted' cross of Friends and Seinfeld\", while The Guardian's Mark Lawson similarly said, \"British commissioners have long dreamed that some local comedy lab would clone Friends or Seinfield. Moffat's managed to cross them while creating a series which feels highly original.\" Further comparisons were made to Friends when NBC commissioned an American version of the show in 2003, although some newspapers still pointed out that Coupling \"owes much to Seinfeld, with laugh-out-loud riffs on 'unflushable' exes, escalating 'giggle loops' during solemn moments of silence and 'porn buddies,' who in the event of your sudden demise will remove all of the naughty pictures and videos from your flat before your parents arrive.\" New York's Daily News, which quotes Moffat \"boozier, smokier, more shag-infested series\" than Friends, also thought that \"some characters ... have ties closer to Seinfeld ... Jane, who, despite her beauty, is so abrasive she's like a female Newman. And Richard Coyle's Jeff is very much like Kramer: He's uncomfortable in a topless club, he explains, because he equates the women to 'porn that can see you'.\"\r\nCoupling was nominated for several awards, winning some of the accolades. It was awarded the Silver Rose for Best UK Sitcom at the Rose d'Or Light Entertainment Festival in 2001. It was nominated as \"Best TV Comedy\" in the 2001 British Comedy Awards, a category it won in 2003. In 2004, lighting cameraman Martin Kempton was nominated for a Royal Television Society Craft Award for Best Lighting, Photography and Camera (Lighting for Multicamera) for his work on the fourth series.\r\nAll four series were released in the UK, US, Israel, Canada, Hungary, Australia, New Zealand, Germany, Sweden, Portugal, the Benelux countries, Kenya, Turkey, and Latin America. In India, selected episodes were telecast on Comedy Central and BBC, and DVDs are available for sale online.\r\nRemakes\r\nIn 2001, the American network NBC commissioned an adaptation of the show, which was reported as a possible replacement for Friends, which was coming to the end of its run. Moffat and Sue and Beryl Vertue served as executive producers alongside Phoef Sutton and Ben Silverman. Unlike most adaptations, the NBC version would reuse Moffat's original scripts, although these were adapted by Sutton, and were shortened to comply with the shorter running time (NBC has multiple advertisement breaks compared to the original broadcaster, BBC Two, which has none). Other writers, such as Danny Zuker and Paul Corrigan, worked on episodes later in the series. The adaptation was attacked in the press before the first episode aired, because it was more sexually explicit than typical American television. The US version starred Colin Ferguson, Jay Harrington, Christopher Moynihan, Lindsay Price, Rena Sofer, and Sonya Walger; Gina Bellman, who plays Jane in the British series, made a cameo appearance in the first episode. The time slot was Thursday night at 9:30 pm following Will & Grace, and the show premiered on 25 September 2003. Following a poor audience and critical reception, the series was pulled from the schedules after airing just four episodes. By that point, 10 of 13 episodes commissioned by the network had been filmed; the remaining six remain unaired. Moffat blamed the show's failure on NBC's intervention during the creative and production processes.\r\nA Greek adaptation was broadcast on ANT1 in 2007 and 2008.",
    "html": "<p>Coupling is a British television sitcom written by Steven Moffat that aired on BBC Two from 12 May 2000 to 14 June 2004. Produced by Hartswood Films for the BBC, the show centres on the dating, sexual adventures, and mishaps of six friends in their early 30s, often depicting the three women and the three men each talking among themselves about the same events, but in entirely different terms.</p><p>The series was inspired by Moffat's relationship with producer Sue Vertue, to the extent that they gave their names to two of the characters. Coupling is an example of the \"group-genre\", an ensemble show that had proven popular at the time. Critics compared the show to the American sitcoms Friends and Seinfeld.</p><p>The critical reaction was largely positive, and the show was named \"Best TV Comedy\" at the 2003 British Comedy Awards. The show debuted to unimpressive ratings, but its popularity soon increased, and by the end of the third series, the show had achieved respectable ratings in the UK. The series first aired on PBS stations and on BBC America in the United States beginning in late 2002 and quickly gained a devoted fanbase there, as well. The show is syndicated around the world. Short-lived American and Greek adaptations were briefly produced in 2003 and 2007, respectively. In a 2004 poll to find Britain's Best Sitcom, Coupling came in 54th.</p><br/><h3>Production</h3><h4>Conception</h4><p>Moffat had used the breakdown of his first marriage as inspiration for his 1990s sitcom Joking Apart. Retaining this semiautobiographical trend, Coupling was based on him meeting his wife, Sue Vertue, and on the issues that arise in new relationships.</p><p>Moffat met Vertue at the Edinburgh International Television Festival in 1996. Vertue had been working for Tiger Aspect, a production company run by Peter Bennett-Jones. Bennett-Jones and his friend and former colleague Andre Ptaszynski, who had worked with Moffat on the sitcoms Joking Apart and Chalk, told Moffat and Vertue that each fancied the other. A relationship blossomed and they left their respective production companies to join Hartswood Films, run by Beryl Vertue, Sue's mother. After production wrapped on Chalk in 1997, Moffat announced to the cast that he was marrying Vertue.</p><p>When she eventually asked him to write a sitcom for Hartswood, he decided to base it around the evolution of their own relationship. Drunk one evening, he went into her office, wrote the word \"Coupling\" on a sheet of paper and told her to ask him about it later.</p><p>The couple formed the basis for the main characters Steve and Susan. The four other characters are Steve and Susan's best friends and last ex-relationships (one of each for both Steve and Susan). The fourth episode, \"Inferno\", was written shortly after Vertue had found a similar tape in the VCR, although Moffat added the 'spanking' element to the script as he \"didn't think the real tape was quite pervy enough.'\"</p><p>The show used the \"group genre\", a type of programme using ensemble casts that was proving popular, with then-recent successes as Friends, This Life (also starring Davenport), and Cold Feet. Moffat feels the group genre reflects young people's modern mores more so than traditional sitcoms, saying, \"Young people watch because it is the lifestyle which is just ahead of them and older people reminisce. Coupling is about two people who get together and bring with them baggage from their past, friends, and ex-partners - people who would never meet under normal circumstances. It deals in the kind of trivia people talk about, important questions like when should a man take off his socks during foreplay?\" Moffat believes group shows would not have been popular with earlier generations of television audiences, stating:</p><blockquote>Friends would have run for only half a series if it had been set during my parents' time. I am sure there has always been misbehaving by people before they settle down, but there was this perception that anyone who ever got married before the '60s was a virgin. What has changed is that all important gap between having left mummy and daddy and becoming a parent yourself. This is the time in which you make decisions which will define you. These few years are pivotal and they are getting longer. There are now people running round with disposable incomes who still want to do lots of things before they settle down to one partner.</blockquote><h4>Writing</h4><p>According to Vertue, Steven Moffat wrote on the top floor of their family home. Once he finished a script, she read it two floors away so he could not hear her laughing. The producer says that his first drafts were \"pretty much ready to shoot\". She did not give him many notes; she would tick all of the places where she laughed, and then he revised the script accordingly.</p><p>The humour of the show, according to Moffat, is in the context. He says that there are \"no jokes per se\" and if they did put jokes in, they were normally taken out because they did not work. He found writing the show difficult at first because he was writing his own voice six times over, with none of the characteristics and inflections of the performers to inspire him.</p><p>Moffat used a range of styles and techniques, such as split screen and nonlinear narratives, that are unconventional in sitcoms. The first series episode \"The Girl with Two Breasts\", in which half of the episode is in Hebrew, proved so popular that the producers tried to do something similar every series. Moffat says that the simplicity of the setting encouraged an \"epic, ridiculous way of telling an ordinary story.\" The opening episode of series three, \"Split\", uses split screen to simultaneously depict what happens with Steve and Susan after separating. The series four opener, \"Nine and a Half Minutes\", depicts the same events in the bar from three different perspectives.</p><h4>Rehearsals</h4><p>British sitcoms usually cannot afford to occupy a studio facility for the entire run, meaning that they are unable to rehearse in the studio. Rehearsals for Coupling took place in a church hall off Kensington High Street.</p><p>The actors received their scripts on Friday mornings. Following a read-through, Moffat was generally forced to cut minutes worth of material to achieve the requisite length. Director Martin Dennis designed and compiled the camera script on Saturday afternoons. After a day off on Sundays, the sets were erected for a producer's run on Mondays, and then a technical run on Tuesdays. Much of Wednesdays was spent camera blocking, a process which regularly overran at the expense of a dress rehearsal.</p><p>As the actors became familiar with the material, they would sometimes develop a joke. However, according to Moffat, such elaboration could overcomplicate a joke for an audience coming to the material for the first time. Martin Dennis, according to Moffat, regularly told the actors, \"You know that funny thing you're doing? Don't do that\". The director encouraged them to deliver their lines as well as they had in the original read-through.</p><h4>Recording</h4><p>All of the location sequences for each series were filmed in London during the first week of each production block. As Moffat was generally late delivering the final few scripts of each series, those episodes contained no location material. The exterior shots of the bar were filmed in Clerkenwell in the first series. After a nearby Thai restaurant complained that filming was disrupting their business, a street just off Tottenham Court Road was used from series two. The house in which Moffat and Vertue lived at the time was used as the exterior for Steve's flat, with the surrounding area used for other sequences.</p><p>Material that was technically difficult was filmed the day before the recording with the live studio audience. A common example of this would be a dinner-table sequence, where some characters would be filmed against the fourth wall, rather than the often-used contrived method of cramming everyone together around the proscenium. Readjusting the set and refilming against the fourth wall would have been too time-consuming. However, the absence of the studio audiences made it more difficult for the actors to judge the timing of the laughs. For instance, Moffat says that this prevented Gina Bellman from \"milking\" a particular laugh in the episode \"Dressed\", an episode in which most of her scenes were prerecorded because she was wearing minimal clothing on set to provide the illusion of complete nudity. The prerecorded sequences were tightened in the editing process once the scenes had been played to the studio audience.</p><p>Episodes were mostly filmed in front of a live studio audience at Teddington Studios in London Borough of Richmond upon Thames on Wednesday evenings. Sue Vertue says that the live audience reinvigorated the company because no one had laughed at the material for a few days, as everyone knew it so well. A warm-up comedian updated the studio audiences about any important plot detail, introduced them to the performers, and provided entertainment while cameras and sets were being repositioned. Rob Rouse fulfilled this role for the fourth series.</p><p>Despite some critics' comments, all of the laughter in Coupling was from a genuine live studio audience. Although artificial, canned laughter was not used, the laughter sometimes had to be tweaked during the editing process. For instance, the studio audience might laugh for longer than might be expected of the home audience. Also, the audience's laughter decreased if a scene was shot multiple times; in these cases the laughter from an earlier take would be used.</p><p>Moffat felt uncomfortable and powerless during the studio recording. Sitting in the gallery, he wrote the word 'help' repeatedly on the back of his scripts. In an interview for the DVD release, he says he was aware that their most successful show received the least amount of laughter from the studio audience. Conversely, studio audiences reacted emphatically to his previous studio sitcom, Chalk, yet it received a poor critical reception upon transmission. Martin Dennis would start editing from the following Monday afternoon. The episodes were then colour graded and dubbed with sound effects and music.</p><p>Mari Wilson performed the song \"Perhaps, Perhaps, Perhaps\", written by Osvaldo Farrés and Joe Davis, to accompany the opening and closing credits. Simon Brint composed and arranged the incidental music. The title sequence, as Mark Lawson described, consists of \"brightly coloured and suggestive shapes swirl around the screen: circles, curves, and angles tumble like limbs locked together in sex. As the names of the actors discreetly sweep across in black lettering, the bright shapes form the title: Coupling.\" Lawson calls the design \"elegant simplicity, showing how a clever choice of theme tune can evoke an atmosphere and set a pace to which images can be cut.\" The colour scheme was changed for the fourth series, although the basic design remained.</p><br/><h3>Characters</h3><h4>Main characters</h4><p>Coupling is almost entirely based around the antics of the six main characters. The show was inspired by Moffat's relationship with producer Sue Vertue, to the extent that they gave their names to two of the characters. Coupling features no other recurring characters that last beyond a few episodes. In the series, \"the women are mainly confident and sexually quite voracious, whilst the blokes are completely useless, riddled with self-doubt and awkwardness.\"</p><p>Steve Taylor (Jack Davenport) is in the process of breaking off his relationship with Jane as the series begins. The remainder of the series shows the development of a relationship with Susan, from dating, proposal of marriage, and as the last series concludes, becoming father to her baby. No reference is made to Steve's job during the series, but in a DVD commentary, Moffat mentions that Steve is, like him, a writer. Moffat had used the surname \"Taylor\" for Robert Bathurst's character in his earlier sitcom Joking Apart.</p><p>According to the BBC's website, Steve \"tries to be the voice of reason while talking to his mates over a pint, but more often than not he stumbles into more complex and ridiculous situations than any of them.\" Writer Moffat says that Steve</p><blockquote>can be just as erratic as Jeff can be, and certainly in the first part of the series, he remonstrates with Jeff for his madness. At the same time he tells Patrick off for being ruthless with women, and yet the evidence shows that Steve himself is a bit of a bastard. For example he asks Susan out on a date while he's having sex with Jane. He is quite typical of having all the same lusts and appetites as Patrick while also having the nervousness of Jeff and the new character Oliver. He forms a compromise of a politically correct weasel, which helps him to believe that he's a decent chap. Actually he's really too frightened of Susan to misbehave!</blockquote><p>Susan Walker (Sarah Alexander) – Best friend to Sally, girlfriend/fiancée to Steve and ex-girlfriend of Patrick, Susan is one of Jeff's co-workers. Susan is usually very sensible and organised, a fact often resented by her friends Sally and Jane. Susan can be very insecure and often takes this out on Steve. When angry, she generally says \"apparently\", a habit first noted in the first-series episode \"Inferno\" and shown to be inherited from her mother in \"My Dinner in Hell\". In the series-one episode \"Size Matters\", Susan is implied to view Angus Deayton in the same way that Steve views Mariella Frostrup, even keeping two pictures of him hidden in her bedroom. Steve and Susan's various arguments and differences of opinion make up a majority of the comic exchanges between them. Susan is a successful career woman, speaks French fluently, and takes her work life very seriously. Whilst Susan's job is never directly referred to, she works alongside Jeff, an accountant, and she reveals she has a degree in economics. In series four, she has a baby boy with Steve.</p><p>Jeff Murdock (Richard Coyle) – Best friend to Steve, he is a co-worker to Susan, whom he dated one time. Jeff's constant sexual frustration, ridiculous stories, and fantasies about women and sex make up a major part of the comedy. Scholar Jeffrey Griffin observes, \"Jeff is known for his bizarre theories, one or two of which he outlines in every episode the defining element of an episode, with the plot unfolding in some way that tests one of Jeff’s theories.\"</p><p>Jeff is terrible at talking to women, often stumbling and unintentionally making up lie upon lie in an attempt to avoid looking stupid. These always backfire on him. From titbits he occasionally lets slip, his problems apparently can largely be traced back to his eccentric and domineering mother (who appears in series two's \"Naked\", played by Anwen Williams). Jeff works as an accountant in an office with Susan, and through him, Steve and Susan initially meet. Coyle quit his role as Jeff before the fourth series. However, his character returns in a dream sequence in Steve's imagination in the final episode, \"Nine and a Half Months\"; portrayed by Samantha Spiro, \"Jeffina\" has undergone sex-reassignment surgery whilst living on the island of Lesbos, in a failed attempt to see another woman naked again. Jeff is also featured in the written epilogue published by Moffat online for the show.</p><p>Sally Harper (Kate Isitt) – Best friend to Susan (and girlfriend to Patrick by series four), Sally is obsessed with her own appearance and constantly worries about the effects of aging and life in general on her looks. Her worst fear seems to be of dying alone, but she seems totally inept at relationships due to her frequent paranoia, which tends to make her out as a very mean-spirited woman. Sally runs her own beauty parlour and is a successful businesswoman, but of the entire group, she is the most insecure and resentful. A Labour supporter, she finds reconciling this with her attraction to Patrick, a Conservative, to be difficult.</p><p>Patrick Maitland (Ben Miles) – Ex-boyfriend to Susan (and Sally's boyfriend by series four), Patrick has a one-track mind: sex. This gives him a very narrow view of women, but he is great at courting them. Frequent references are made to his rather large penis; Susan nicknames him \"donkey\" and \"tripod\", sparking much of Sally's initial interest in him despite her objections to his political beliefs (Patrick is a Conservative, which conflicts with Sally's Leftish attitudes). Patrick has a habit of saying things without thinking that give the impression that he is rather dense. Two explanations for this given in the series are his own claim that he 'doesn't have a subconscious' and thus 'nothing is going on' in his head and Sally's remark that there's not enough blood in his body for 'both ends' (making reference to his abnormally large penis). He is very good at getting women to bed, and cannot comprehend meeting a woman and not having sex with her. In the fourth series, he is revealed to generally leave in the middle of the night. In one episode, unknown to him, a woman from his past made a vibrator from a plaster cast of Patrick's erect penis and marketed as the Junior Patrick; the box clearly has a 10-inch measurement on the side when seen later in the episode. Patrick's love of the ladies often backfires, and the series frequently features story lines about his possessive lovers and ex-lovers. Patrick is a successful businessman and is very competitive with others in the same business, but he does have a vague sense of loyalty to his friends. He collects videos of nights with his girlfriends in his rather large \"cupboard of love.\" Patrick proposes to Sally in the last episode when she finds the engagement ring in the cupboard, but her answer is left unknown.</p><p>Jane Christie (Gina Bellman) – Ex-long-time partner of Steve, Jane is a histrionic who is very possessive, and despite breaking up with Steve in the first episode, she never truly seems to let go. Jane has a problem talking to men, often coming on much too strong and appearing desperate or rude to others in her pursuit of a man. Her character also seems not to be too bright, perhaps even disturbed, and is known to be incredibly self-obsessed, as shown in a second-series episode when a 'subtext detector' shows that the only thing she ever really means when talking is the word \"me\". In the fourth series, everyone starts referring to her as being \"mad\". Jane claims to be bisexual, although she is never seen dating a woman. Susan time and again expresses scepticism, so this claim may be a ploy to entice men. However, Susan (for her own reasons) French kisses Jane in the fourth series and Jane seems to be overwhelmed, but enjoys it. However, her claim is also successfully challenged by Oliver Morris in the fourth series, where he points out that she is indeed not bisexual. Jane works in a local radio station as a traffic reporter, and is popular mainly due to her flirtatious nature and sexually explicit reports. She was once briefly fired for telling all the drivers to close their eyes to centre themselves and changing the names of streets for her own amusement, among other things, but was rehired due to her popularity.</p><p>Oliver Morris (Richard Mylan) is introduced in the fourth series and eventually becomes involved with Jane. He runs a local science-fiction media store called \"Hellmouths\" and has been out of a relationship for several months. Oliver often has a very cynical outlook, but is prone to accidents, often making a fool of himself in the process. He is sometimes shown gearing himself up to meet women and have sex by thinking to himself, which the audience can hear. The geekiness of his job is also used for comic effect. Oliver also seems to have inherited Jeff's inability to talk to women, however, unlike Jeff he believes himself to be a ladies' man, or in his thoughts' words \"a woman-killer, I mean lady-killer...\". Oliver has a tendency to use the word 'craziness' frequently in conversations, usually as an attempt to alleviate tension when he starts blabbering. Richard Mylan has said in interview that people took a long time to accept his character due to Jeff's popularity.</p><h4>Other characters</h4><p>Julia Davis (Lou Gish) appears in five episodes spanning over series two and three. She first appears in \"Naked\", as the new head of department in the office where Jeff and Susan work. Julia and Jeff soon fall for each other due to their shared inability to hold a reasonable conversation with a member of the opposite sex. Despite overcoming the inevitable troubles with each other, their relationship ends when Julia's ex, Joe, a soldier, returns believing Julia to still be his girlfriend. After finding Julia chained to the bed in her room, dressed in bondage gear, Joe attacks Jeff. In the final episode of series three, Jeff explains that Julia and Joe have left together to discover their feelings for each other, in Bolton.</p><p>Tamsin (Olivia Caffrey) is Oliver's Irish ex-girlfriend, who left him for unknown reasons around six months prior to the beginning of the fourth series, and has since become pregnant by another man, with whom she has now split. She befriends Susan at an antenatal class and is also revealed to be one of Patrick's many ex-girlfriends. Tamsin and Oliver seem to have a sour relationship, as is shown over the three episodes in which she features. She refers to him as a cross between brother and sister.</p><p>James (Lloyd Owen) appears in three episodes of series three. He hosts the religious programme at the radio station where Jane works, and Jane pretends to have an interest in religion to become his girlfriend. Jane is devastated to find he does not believe in sex before marriage, and even more so to find that he had a fervent sex life before finding God, which included a night with Susan. He leaves on a trip to Germany at the end of '\"The Freckle, the Key and the Couple Who Weren't\" and returns in \"Perhaps, Perhaps, Perhaps\", just as Jane is expressing her amazement that the many sexual encounters she has had while he was away have not made her pregnant (\"I have shagged and shagged and shagged and all the little bastards missed!\").</p><p>Jill (Elizabeth Marmur) appears in an episode of series one and once again in series four. In the first series, Jill is Jane's therapist whom Jane constantly manages to manipulate. She challenges Jane's statement that she can be a vegetarian whilst still eating meat. She is dragged to a dinner party with Jane in an episode called \"Inferno\", where everyone assumes she is a lesbian. She witnesses one of Steve's monologues about loving naked bottoms when the subject of one of his videos, the legendary Lesbian Spank Inferno, comes up. Jill reappears in the fourth series as a pregnancy specialist, having retrained to avoid encountering Jane again; to her dismay, Jane attends one of her antenatal classes wearing a fake pregnancy belly, claiming to be simultaneously pregnant and not pregnant.</p><p>Wilma Lettings (Emilia Fox) Wilma Lettings appears in two consecutive episodes of series three (\"Faithless\" and \"Unconditional Sex\") as a woman working in the same office as Jeff. In the first episode, Jeff agrees to go out for a drink with her, but is unsure whether or not it is a date, as they are both in relationships, but her boyfriend is away in Australia and he cannot tell her who his girlfriend is, as Julia does not want anyone in the office to know that they are dating. To further complicate matters, Wilma was present at an incident in which Jeff got his head trapped in a photocopier, and Jeff does not know if she found it funny or horrifying. The second episode starts with Jeff in the bar with Wilma, using an earpiece to allow the others to instruct him on the subtext of the conversation and how to respond. However, this is unnecessary, as Wilma quickly asked Jeff if he fancies her, to which he is forced to say yes, as Julia has taken the phone from Steve and asks him if he loves her at the same moment. Things quickly spiral out of control as Jeff tells Wilma that his girlfriend had recently died, on Jane's suggestion, to get out of 'the fork'. The episode ends with Wilma running out of Jeff's flat after seeing Julia's feet sticking out from under his duvet, when sleeping at his flat.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Series</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">12 May 2000</td><td style=\"padding:0 8px\">16 June 2000</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">9</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">3 September 2001</td><td style=\"padding:0 8px\">29 October 2001</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">23 September 2002</td><td style=\"padding:0 8px\">4 November 2002</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">10 May 2004</td><td style=\"padding:0 8px\">14 June 2004</td></tr></tbody></table><p>Four series of Coupling were produced for the BBC. The first series of six episodes was broadcast on Friday evenings from 12 May to 16 June 2000. Nine episodes were commissioned for the second series, which was broadcast on Monday evenings in Autumn 2001. The third series, consisting of seven episodes, were broadcast a year later. The fourth series was first broadcast on BBC Three in May and June 2004, although the six episodes were repeated on BBC Two a few months later.</p><p>The BBC approached Moffat about writing a fifth series, but other commitments made gathering the cast impossible. Moffat began writing for Doctor Who when the show was revived in 2005, becoming the show's executive producer and lead writer for Doctor Who's fifth series in 2010. However, to finalise Coupling, Moffat posted some short storyline \"conclusions\" about the eventual fate of the characters on the website Outpost Gallifrey.</p><br/><h3>Reception</h3><p>Critical reception was generally positive. The Guardian's Mark Lawson applauded Moffat's writing, specifically assessing the episode \"The Girl with Two Breasts\" as \"comic writing of astonishing originality and invention.\" The Daily Record called the show \"frank and funny.\" Writing in The Independent, Mark Thompson, then director of television at the BBC, mentioned Moffat's earlier sitcoms Joking Apart and Chalk to suggest \"ambition in television is also about sharing the long road to originality and creative achievement.\" The Guardian also comments, \"Moffat ... has long seemed to me one of the most original TV writers and it's good that ratings-crazed television has persevered with him. His particular talent is for intricately plotted sexual farce.\" The Times commented, \"Steven Moffat is turning out to be one of the boldest, most inventive, sitcom writers around.\" Scholar James Monaco comments that Coupling is \"witty and elegantly structured ... the Seinfeld/Friends model to new heights with intricately wrought plots built on the interactions of six young friends. Replete with rich dialogue and bright timing it renewed the British comedy franchise.\"</p><p>Various journalists compared the show to the American sitcoms Friends and Seinfeld. Melbourne's The Age commented that the show was \"as a 'highly original' and 'unrestricted' cross of Friends and Seinfeld\", while The Guardian's Mark Lawson similarly said, \"British commissioners have long dreamed that some local comedy lab would clone Friends or Seinfield. Moffat's managed to cross them while creating a series which feels highly original.\" Further comparisons were made to Friends when NBC commissioned an American version of the show in 2003, although some newspapers still pointed out that Coupling \"owes much to Seinfeld, with laugh-out-loud riffs on 'unflushable' exes, escalating 'giggle loops' during solemn moments of silence and 'porn buddies,' who in the event of your sudden demise will remove all of the naughty pictures and videos from your flat before your parents arrive.\" New York's Daily News, which quotes Moffat \"boozier, smokier, more shag-infested series\" than Friends, also thought that \"some characters ... have ties closer to Seinfeld ... Jane, who, despite her beauty, is so abrasive she's like a female Newman. And Richard Coyle's Jeff is very much like Kramer: He's uncomfortable in a topless club, he explains, because he equates the women to 'porn that can see you'.\"</p><p>Coupling was nominated for several awards, winning some of the accolades. It was awarded the Silver Rose for Best UK Sitcom at the Rose d'Or Light Entertainment Festival in 2001. It was nominated as \"Best TV Comedy\" in the 2001 British Comedy Awards, a category it won in 2003. In 2004, lighting cameraman Martin Kempton was nominated for a Royal Television Society Craft Award for Best Lighting, Photography and Camera (Lighting for Multicamera) for his work on the fourth series.</p><p>All four series were released in the UK, US, Israel, Canada, Hungary, Australia, New Zealand, Germany, Sweden, Portugal, the Benelux countries, Kenya, Turkey, and Latin America. In India, selected episodes were telecast on Comedy Central and BBC, and DVDs are available for sale online.</p><h4>Remakes</h4><p>In 2001, the American network NBC commissioned an adaptation of the show, which was reported as a possible replacement for Friends, which was coming to the end of its run. Moffat and Sue and Beryl Vertue served as executive producers alongside Phoef Sutton and Ben Silverman. Unlike most adaptations, the NBC version would reuse Moffat's original scripts, although these were adapted by Sutton, and were shortened to comply with the shorter running time (NBC has multiple advertisement breaks compared to the original broadcaster, BBC Two, which has none). Other writers, such as Danny Zuker and Paul Corrigan, worked on episodes later in the series. The adaptation was attacked in the press before the first episode aired, because it was more sexually explicit than typical American television. The US version starred Colin Ferguson, Jay Harrington, Christopher Moynihan, Lindsay Price, Rena Sofer, and Sonya Walger; Gina Bellman, who plays Jane in the British series, made a cameo appearance in the first episode. The time slot was Thursday night at 9:30 pm following Will & Grace, and the show premiered on 25 September 2003. Following a poor audience and critical reception, the series was pulled from the schedules after airing just four episodes. By that point, 10 of 13 episodes commissioned by the network had been filmed; the remaining six remain unaired. Moffat blamed the show's failure on NBC's intervention during the creative and production processes.</p><p>A Greek adaptation was broadcast on ANT1 in 2007 and 2008.</p><br/>"
  },
  "errorMessage": ""
}