{
  "imDbId": "tt14986406",
  "title": "Bleach: Thousand-Year Blood War",
  "fullTitle": "Bleach: Thousand-Year Blood War (TV Series 2022– )",
  "type": "TVSeries",
  "year": "2022",
  "items": [
    {
      "username": "sukmydikbeaotch",
      "userUrl": "https://www.imdb.com/user/ur115290999",
      "reviewLink": "https://www.imdb.com/review/rw8617763",
      "warningSpoilers": false,
      "date": "17 October 2022",
      "rate": "10",
      "helpful": "61 out of 66 found this helpful.",
      "title": "WHAT A RETURN!!!!",
      "content": "Wish I could rate this higher Been a long time bleach fan first saw it on Adult swim Years ago... was the very first Japanese animation I watched and eventually fell in love with (I love sword fighting) and now what a surprise to find out that this was releasing here America alongside Japan's release of it (Come on DRAGON BALL SUPER!!) So we as fans can experience it together. So much detail in the animation top of the line and I love how they added in city noise to karakura town. And the CGI hollows were great had to rewatch the first episode 3times in a row to take it all in and I can't wait to see my boy kenpachi!!!An I can't wait for more episodes and wish there was more than 52 but I'm grateful to see it last until year."
    },
    {
      "username": "nidhishben",
      "userUrl": "https://www.imdb.com/user/ur129052014",
      "reviewLink": "https://www.imdb.com/review/rw8600287",
      "warningSpoilers": true,
      "date": "10 October 2022",
      "rate": "10",
      "helpful": "82 out of 93 found this helpful.",
      "title": "BANKAI !!!!",
      "content": "Its a Absolutely Fantastic ARC™ ~ It reveals a lot of the Past.Its definelty one of Bleach's greatest arc, and is on par with (if not better) than the Arrancar ARC, here are a few reasons to WATCH the TYBW arc:1]. Reveal of Masaki and Isshins Past.2]. Ichigo's Heritage and Truth about Zangetsu3]. Ywach and his Attack on the Soul Society4] Ichigo \"True\" Shikai.5]. Plenty of characters join the fight against the Quincy king, Espada , Fullbringers, Friends and Foes alike.6] Reveal of many banakai's, like Kenpachi's bankai, Yammamoto's bankai, Rukia's bankai etc & Aizen's Return!!9]Entry of the Zero Division10] Unohana and the truth about the \"kenpachi\" title & Alot more..."
    },
    {
      "username": "zohrezkhan",
      "userUrl": "https://www.imdb.com/user/ur125429124",
      "reviewLink": "https://www.imdb.com/review/rw8601997",
      "warningSpoilers": false,
      "date": "11 October 2022",
      "rate": "10",
      "helpful": "71 out of 82 found this helpful.",
      "title": "PEAK HAS RETURNED",
      "content": "Man, they said Bleach was mid they said Bleach was never coming back, but now I bet most people are eating their own words right now because this show is incredible. Words don't even begin to do it justice I have no doubt this return will go down as the biggest come back in history, not only did this episode have godlike animation but the music and voice acting was beautiful. I was waiting for months and now it is finally here and I cant believe it I was not expecting it to be this good I can only imagine where it is going to go from here this is looking like its going to be one of the best animes of the year."
    },
    {
      "username": "Deafy the Timid Diver",
      "userUrl": "https://www.imdb.com/user/ur1306269",
      "reviewLink": "https://www.imdb.com/review/rw8622933",
      "warningSpoilers": false,
      "date": "19 October 2022",
      "rate": "10",
      "helpful": "17 out of 20 found this helpful.",
      "title": "Simply Amazing...",
      "content": "The first two episodes have been amazing AF - the animation has improved, the storyline is gripping, and the music has more depth. The only \"downside\" is that someone really needs to watch the 300+ episodes that preceded this to fully understand the \"what\" and \"why\" of what's going on...assuming they haven't read the manga, of course. Can't wait to see where they bring us in the upcoming episodes. Tite Kubo is a master storyteller, thank goodness he was involved in the making of the anime. For those of you who know next-to-nothing about Bleach, watch the previous seasons QUICKLY so you can sooner enjoy the TYBW arc!"
    },
    {
      "username": "ariliusvaldimar",
      "userUrl": "https://www.imdb.com/user/ur157600690",
      "reviewLink": "https://www.imdb.com/review/rw8601995",
      "warningSpoilers": false,
      "date": "11 October 2022",
      "rate": "10",
      "helpful": "47 out of 57 found this helpful.",
      "title": "Amazing",
      "content": "The artstyle the music the animation is fantastic, you can't ask for anything better that this. The first episode has completely blown my expectations. So gorgeous I almost cried. There is a resone bleach is in the big 3 and always Wil. I won't be surprised if it will be the number 1 anime this year, only time will tell. If you are a bleach fan u should strap your self because this is going to be an amazing year for all of us. No one can honestly tell me that this wasn't a movie scale animation sound design. I recommend to watch bleach from beginning to catch of with thousands year blod war it is worth it!!!"
    },
    {
      "username": "sanchitanag-88966",
      "userUrl": "https://www.imdb.com/user/ur160692602",
      "reviewLink": "https://www.imdb.com/review/rw8775772",
      "warningSpoilers": false,
      "date": "3 January 2023",
      "rate": "10",
      "helpful": "66 out of 68 found this helpful.",
      "title": "Best anime of fall 2022",
      "content": "Words aren't enough to describe this show if you're not a fan even just give it a try it will break ur hopelessness and bring an incredible taste to your anime life You get everything the visuals,fight scenes,story arc everything is on insane level and the CGI effects are next to impossible you will become a true fan after this so far it is the best anime of 2022 in terms of story and everything.I hope u enjoy just go and hit the first episode if you're new and don't forget to give this series a rating i hope u love it.And yeah if you want to know the full story just go and hit the first part of bleach which is very good in animation according to old days it's very good."
    },
    {
      "username": "tshedzamugwedi",
      "userUrl": "https://www.imdb.com/user/ur148262046",
      "reviewLink": "https://www.imdb.com/review/rw8603808",
      "warningSpoilers": false,
      "date": "12 October 2022",
      "rate": "10",
      "helpful": "40 out of 46 found this helpful.",
      "title": "Bleach is amazing",
      "content": "This episode surpassed my expectations Animation and music and art style everything about the episode was amazing words can't fully express how amazing the episode was it easily live up to its hype this is only the beginning more amazing episodes are coming bleach fans we are eating good. When you watch the episode you will clearly see that Kubo was directly involved as promised the anime is uncensored the voice actors really did good job animation is movie quality and episodes is longer than Normal and there added contents too shout out to studio Pierrot for surpassing our expectations. Yeah."
    },
    {
      "username": "hannahwilliams-mail",
      "userUrl": "https://www.imdb.com/user/ur55123826",
      "reviewLink": "https://www.imdb.com/review/rw8606137",
      "warningSpoilers": false,
      "date": "13 October 2022",
      "rate": "10",
      "helpful": "20 out of 25 found this helpful.",
      "title": "Wow...",
      "content": "I haven't been this excited for a Bleach episode since I was a kid. The joy I felt seeing the first episode was palpable, the animation was gorgeous, the music nostalgic but slightly different. And the end song for the first episode brought back so many memories but not in a cheesy way, they did a phenomenal job. I never actually read the thousand year blood war arc, and I think I'm going to wait until after I've watched this so I'll be surprised. I now want to go and rewatch everything from before! I can't wait to potentially get my younger sibling into bleach with this. The first few bleach episodes I watched amazed me when I was younger. I had rented a bleach dvd from blockbuster, I remember sitting in my grandparents tv room feeling awestruck by the first few episodes, that is the feeling I got after watching this first episode."
    },
    {
      "username": "aliy-69465",
      "userUrl": "https://www.imdb.com/user/ur152809412",
      "reviewLink": "https://www.imdb.com/review/rw8601189",
      "warningSpoilers": false,
      "date": "10 October 2022",
      "rate": "10",
      "helpful": "63 out of 75 found this helpful.",
      "title": "We are winning Bleach fans",
      "content": "Bleach has returned, and I'm so grateful that bleach is returning oh my God I can't wait for the next episode to come. I hope we will get a game of bleach when the serious end and we have to get a movie after. If you didn't watch bleach, what are you waiting for? Just go watch it right now. It is one of the best anime of all time in. That's why is a part of the big 3. I hope beach will get so much popular and all people can see what is bleach for. I don't know what to say. The quality of the episode in the movement in the color. I just love bleach. Bleach episode look like a movie. Don't forget bleach is better than Naruto and one piece."
    },
    {
      "username": "rsrawat-51415",
      "userUrl": "https://www.imdb.com/user/ur151540644",
      "reviewLink": "https://www.imdb.com/review/rw8602412",
      "warningSpoilers": false,
      "date": "11 October 2022",
      "rate": "10",
      "helpful": "41 out of 48 found this helpful.",
      "title": "UP TO THE MARK!!",
      "content": "Finally we get the rewards of our wait and patience. The animation is top notch and unreal. And the plot is fire, it is one of the best plot and arc among all the anime. The series is directed by Tomohisa Taguchi and premiered on TV Tokyo on October 11, 2022. The series will run for four cours with breaks in between. Tatsuya Kitani performs the opening theme \"Scar\" while SennaRin performs the ending theme \"Saihate\". \"The Farthest Reaches\"). Kitani performed the ending theme for the first episode, \"Rapport\", which was previously used as the main theme song for the series' 20th Anniversary Exhibition, Bleach EX."
    },
    {
      "username": "jonathan-wenger",
      "userUrl": "https://www.imdb.com/user/ur45327772",
      "reviewLink": "https://www.imdb.com/review/rw8601915",
      "warningSpoilers": true,
      "date": "11 October 2022",
      "rate": "10",
      "helpful": "25 out of 31 found this helpful.",
      "title": "We're back!!!",
      "content": "10 years of waiting and the first episode is already setting the right tone for what's to come. Obviously it's an anime episode so it's not that long, but it already has one death, fighting that show off the amazing new animation, and it introduces the enemy group immediately. While it is very manga accurate, there are a few small scenes from the manga that it didn't show, but those could be saved for later episodes where they might fit better. They did what they needed to do, and looked brilliant the entire time. Highly recommend. 10 year wait so 10/10 seems pretty poetic. Oh, and the end credits showing past Bleach scenes was a great touch."
    },
    {
      "username": "medicalmashle",
      "userUrl": "https://www.imdb.com/user/ur157588739",
      "reviewLink": "https://www.imdb.com/review/rw8601133",
      "warningSpoilers": false,
      "date": "10 October 2022",
      "rate": "10",
      "helpful": "65 out of 78 found this helpful.",
      "title": "BLEACH",
      "content": "Amazing, One of the best anime ever. Like I have never seen such peak fiction in my eyes and heart. It's one of the best shonen ever made with cool designs , powers, plot, war arc is insane! Ichigo is such an awesome mc! This episode for the comeback is the best! I have never seen such an episode with amazing pacing like this, Action was great, It was so good it felt so short like I was watching it for only 2 mins! I had to rewatch & will be watching it again for the 4th time! I cannot wait until the next episode airs because this right here is peak fiction. Was an amazing piece of media. BANKAI!"
    },
    {
      "username": "hamzgilan",
      "userUrl": "https://www.imdb.com/user/ur77680167",
      "reviewLink": "https://www.imdb.com/review/rw8645056",
      "warningSpoilers": false,
      "date": "30 October 2022",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "What an Anime should be.",
      "content": "This anime is what I have been waiting for. I perviously watch the original bleach series and as a comparison so far, I am loving this show a lot more. There has been a lot of updates. Visuals are amazing, combat is as great. Voice acting is still S tier. Story is compelling. I only hope they do away with bad habits such as filler season and episodes. They only negative I have is the requirement to watch the original series if you're a new viewer. Not that the original is bad, just 300 episodes of time needed to invest in it. This is because you will not be able to appreciate the story or characters in its entirety if viewed otherwise.Great show.10/10."
    },
    {
      "username": "pranayjalvi",
      "userUrl": "https://www.imdb.com/user/ur62249628",
      "reviewLink": "https://www.imdb.com/review/rw8761267",
      "warningSpoilers": false,
      "date": "27 December 2022",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "This is how a comeback is supposed to be done",
      "content": "Bleach TYBW gives an insanely amazing comeback to a long ended shounen anime without adapting the final arc of the manga. Starting from the characters to the animation, Bleach TYBW improves a lot. The final arc is a serious and bloody one, with a lot of fights and the first cour is just a start.Pierrot has done an amazing job in splitting the cours, which will not impact the overall production of the final arc, which resumes after 10 years. The characters became more bold, aggressive and the action sequences were totally heavenly. It feels nostalgic and amazing to see an action battle shounen anime to be back with it's most intense arc. Will eagerly wait for the 2nd cour till Summer 2023.My Rating : 10/10."
    },
    {
      "username": "ntedragon",
      "userUrl": "https://www.imdb.com/user/ur157594558",
      "reviewLink": "https://www.imdb.com/review/rw8601521",
      "warningSpoilers": false,
      "date": "10 October 2022",
      "rate": "10",
      "helpful": "46 out of 55 found this helpful.",
      "title": "BANKAI",
      "content": "I started watching bleach only a year and a half ago and it was the last in the big 3 for me to watch at first I struggled through it but after awhile I started to love the characters then I caught up and was disappointed when I realized I had to wait for October to continue the show I can't imagine waiting over a decade for this show but if I watch it back then then I would have waited a decade. The first ep was incredible when ichigos song came on I jumped out of my seat I got so excited that now I'm mad that I have to wait a week for ep 2 let alone waiting for ep 3 or 4 or 5. But no matter how much I love bleach my love for ONE PIECE will always be deeper."
    },
    {
      "username": "ahmed-yehia-yousef",
      "userUrl": "https://www.imdb.com/user/ur106330550",
      "reviewLink": "https://www.imdb.com/review/rw8603378",
      "warningSpoilers": false,
      "date": "11 October 2022",
      "rate": "10",
      "helpful": "18 out of 22 found this helpful.",
      "title": "Awesome comeback!",
      "content": "I liked a lot how the studio was able to develop from drawing and animation.. Really another level that serves the amazing story without stretching the events only the events pass at a fast pace.also the intro and outro music is fantastic i thought i was watching a movie not a series. I watched the episode more than once because of my great admiration for this masterpiece, and I hoped that the episode would not end.. I really wait for the next episodes to watch the splendor of the Quincy. I also missed hearing the famous bankai of Kurosaki Ichigo and I was also waiting for the appearance of the rest of the Shinigami characters, especially Zaraki Kenpachi."
    },
    {
      "username": "johaneskp",
      "userUrl": "https://www.imdb.com/user/ur157588602",
      "reviewLink": "https://www.imdb.com/review/rw8601131",
      "warningSpoilers": true,
      "date": "10 October 2022",
      "rate": "10",
      "helpful": "34 out of 41 found this helpful.",
      "title": "The Hype is REAL!",
      "content": "The music, image quality etc is perfect for the first episode! Finally, after a long 10 years wait! Can't wait how many episodes will be until it finishes the arc.If you're new of this anime, i recommend you should watch from the beginning. I know it's long, but trust me. It's worth it! The buildup character, storyline, it's all worth it.I remember every week i anticipated the next episode with my cousin and friends and watch it on the living room and eating popcorn.This is one of the OG's and one of the anticipated anime of the year. And because it's an OG, don't underestimate it because the HYPE IS REAL."
    },
    {
      "username": "vdjc-98230",
      "userUrl": "https://www.imdb.com/user/ur157599028",
      "reviewLink": "https://www.imdb.com/review/rw8601875",
      "warningSpoilers": false,
      "date": "11 October 2022",
      "rate": "10",
      "helpful": "38 out of 57 found this helpful.",
      "title": "Bleach> All anime",
      "content": "Enough said best anime hands dumps on every other anime show. Don't believe me watch 365 episodes before this season ...even the fillers which were decent at times..the main storyline is the best I've ever had to honor to watch or read and with this new animation production team giving our main man Tite Kubo a chance to work his magic instead of working himself to an early grave now we will have even better animation and fights in the final arc. This season will give Tite Kubo and the rest of the crew their much needed and deserved recognition for the amount of quality content he has produced over the years hopefully new viewers will go back and watch all of the series including the live action Bleach (which was amazing and they need to continue the story because it had a high score on Netflix) and the 4 anime movies. I hope Bleach can finally assert its dominance in the anime sector. Thank you Tite Kubo."
    },
    {
      "username": "tidusford",
      "userUrl": "https://www.imdb.com/user/ur156391971",
      "reviewLink": "https://www.imdb.com/review/rw8603673",
      "warningSpoilers": false,
      "date": "11 October 2022",
      "rate": "10",
      "helpful": "15 out of 20 found this helpful.",
      "title": "Finally!",
      "content": "Purely here to show support for the show and it's return after watching the first episode.I'm extremely happy we finally get to witness the final arc of this outstanding anime and the first episode does not disappoint.The art style is new and fresh but still feels somewhat 'Bleach' in it's nature.The show was well known for it's brilliant intros and again it doesn't disappoint here either, serving as a perfect homage to how we got to where we are.First episode gave just enough of everything to make it a decent recap and set up the story to come. Hopefully the next episode continues to expand on what we've seen so far but I genuinely feel from what I've seen in this episodes it's in good hands and will live up to the hype."
    },
    {
      "username": "nafayseher",
      "userUrl": "https://www.imdb.com/user/ur150013205",
      "reviewLink": "https://www.imdb.com/review/rw8602555",
      "warningSpoilers": true,
      "date": "11 October 2022",
      "rate": "10",
      "helpful": "25 out of 32 found this helpful.",
      "title": "Bleach",
      "content": "Amazing show , Amazing animation , Amazing characters. The cast is really good.i have read the manga so the anime in person was amazing the extended fights were amazing just everything is a 10/10 to be honest it has to be the best first episode I have watched.waiting for the yammato vs yhwach fight to be animated and other things like ichigos final bankai and horn of salvation to be animated cannot wait for next week to see the next episode of bleach and how amazing that's going to be.studio Pierrot is definitely going all out with this animation because this episode was insanely and a 10/20 Ep."
    },
    {
      "username": "sneakaninjaz",
      "userUrl": "https://www.imdb.com/user/ur37133414",
      "reviewLink": "https://www.imdb.com/review/rw8630037",
      "warningSpoilers": false,
      "date": "23 October 2022",
      "rate": "10",
      "helpful": "9 out of 12 found this helpful.",
      "title": "Ohhhh joy what a COMEBACK...",
      "content": "I will just say this. Have a good TV and it's even better with a good soundbar. They put some real effort into this comeback and you won't regret it.Soooo beautiful. And there is no build up so far, lol it gets right to the point from the beginning. Stakes are high and the bad guys are OP. There's actually a sense of danger again finally. I'm guessing there will be some big deaths early.I was disappointed with the direction they started taking before and it just got boring yet had so much potential. This anime was a TOP 3 for a reason and it wants its spot back......I won't say any more, enjoy!"
    },
    {
      "username": "ean81",
      "userUrl": "https://www.imdb.com/user/ur4641302",
      "reviewLink": "https://www.imdb.com/review/rw8652086",
      "warningSpoilers": false,
      "date": "3 November 2022",
      "rate": "10",
      "helpful": "9 out of 12 found this helpful.",
      "title": "Awesome!!",
      "content": "It might be because I'm getting older but there aren't that many shows these days that keeps me excited and wanting more but Bleach is definitely one of them. Love this show!!That's all I really wanted to say but apparently this needs to be at least six hundred characters so I'm just gonna ramble until it allows me to post. I do have to say, the last story line before it ended was, in my opinion, not the best. I'm really glad it came back with such an amazing story line. Not sure if it lines up with the manga version but I love it. It's a pain having to wait a week between episodes :( Oh Well."
    },
    {
      "username": "omjoshi-49833",
      "userUrl": "https://www.imdb.com/user/ur132778003",
      "reviewLink": "https://www.imdb.com/review/rw8688773",
      "warningSpoilers": false,
      "date": "22 November 2022",
      "rate": "10",
      "helpful": "10 out of 12 found this helpful.",
      "title": "THE GOAT IS BACK",
      "content": "THIS IS THE GREATEST ANIME ARC IN THE HISTORY . EVERY CHARACTER DEVELOP SO WELL . ANIMATION IS NOW AWESOME . FIGHT SCENE LEGENDRY . NEW MAIN ANTAGONIST IS DAMN POWERFUL . HE IS NOT ONLY THE STRONGEST VILLAIN IN BLEACH BUT ONE OF THE STRONGEST VILLAIN IN ANIME HISTORY . YHWACH CARRY VERY INTRESTING ABILITIES . THIS ANIME ARC IS IS MY PERSONAL FAV ANIME ARC THIS IS MUST WATCH ANIME . IF YOU HAVN'T WATCHED BLEACH YET GO AND WATCH IT . BLEACH CONTAIN 45% FILERS . FILLERS ARE NOT THAT BAD YOU CAN ENJOY IT BUT IF YOU WANT TO LINK TO THE STORY YOU CAN SIMPLYSKIP FILLERS . BLEACH IS MY 2ND FAV ANIME AFTER NARUTO. BUT THIS ARC IS ON ANOTHER LEVEL."
    },
    {
      "username": "hummainbaber",
      "userUrl": "https://www.imdb.com/user/ur128828747",
      "reviewLink": "https://www.imdb.com/review/rw8768097",
      "warningSpoilers": true,
      "date": "30 December 2022",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "WOW. An Epic come back",
      "content": "The show has done justice to it's name and legacy. It's the best show ever. The way it has provided closure to all the stories that were still pending like Kenpachi, Unohana, Ichigo's Mom , his dad was awesome. The fight between Head Captain Yamamoto and Ywabach was unbelievable . The moment of Bankai usage of Head Captain was out of this world. Finally the backstory behind Zangetsu and Ichigo's new power .I am totally amazed by the animation and story line. Congratulations to all the team that put in a lot of effort to make this show the best show ever made. This is going to stay for centuries as the best fighting anime of all times."
    },
    {
      "username": "HardLight",
      "userUrl": "https://www.imdb.com/user/ur3283404",
      "reviewLink": "https://www.imdb.com/review/rw8758669",
      "warningSpoilers": false,
      "date": "26 December 2022",
      "rate": "10",
      "helpful": "5 out of 7 found this helpful.",
      "title": "Cour 1 = HOLY HELL!!",
      "content": "I write this after just watching the last episode of Cour 1 - the opening Arc of the 1000 year blood war and I am beyond words, everything about it has been magnificent in every single way imaginable, from voice acting to animation and even ironing out story issues with the original Manga run, this is by far the best experience with Bleach I've had since before the Fake Karakura Town Arc.Studio Perriot have done something unimaginable with this, they have reignited a love for a series that I thought I'd tossed aside a long time ago due to the author having massive burn out.But they did it. How they did it is well beyond me but they managed to make this possibly my top 3 anime of the year and it's only Cour 1 of what I'm guessing is going to be a 4 cour series - the only downside is that I have to wait til July to see the next part, but if they can keep this hype going, I'm all for it."
    }
  ],
  "errorMessage": ""
}