{
  "imDbId": "tt0072500",
  "title": "Fawlty Towers",
  "fullTitle": "Fawlty Towers (TV Series 1975–1979)",
  "type": "TVSeries",
  "year": "1975",
  "items": [
    {
      "username": "BroadswordCallinDannyBoy",
      "userUrl": "https://www.imdb.com/user/ur2214855",
      "reviewLink": "https://www.imdb.com/review/rw1234527",
      "warningSpoilers": false,
      "date": "9 December 2005",
      "rate": "10",
      "helpful": "113 out of 119 found this helpful.",
      "title": "Escalating Frustration",
      "content": "This is probably one of the best situational comedies ever made and in my opinion few other television programs compare to it. It is hard to say what is so good about this little show as the main character is a rude prick, the story lines are rather simplistic, and the characters pretty much cardboard cut outs of class stereotypes (this is a British show after all), but each episode is a nearly perfect choreographed dance of escalating frustration with an impeccable touch of absurdity.From brick walls appearing in doorways to mishaps during fire drills, from guests dying overnight to getting the right food for a gourmet, from class issues to just plain old mayhem this show has got it all. It is all in a meager 12 episodes, but that is what makes each episode absolutely priceless with hardly a dull moment. A classic in every sense of the word. 10/10 Not rated, suitable for everyone."
    },
    {
      "username": "film-critic",
      "userUrl": "https://www.imdb.com/user/ur1601212",
      "reviewLink": "https://www.imdb.com/review/rw0973992",
      "warningSpoilers": false,
      "date": "7 December 2004",
      "rate": "",
      "helpful": "104 out of 119 found this helpful.",
      "title": "He's from Barcelona...",
      "content": "If you were to look up some of the most hysterical moments on the BBC, you would no doubtably come across two names. Those names would be John Cleese and Ricky Gervais. While Gervais recently found comedy through his program called 'The Office', Cleese has been providing wit, wisdom, and down-right hysteria for the past several decades. While away from his namesake (Monty Python), you can find Cleese comfortable in several other roles that showcase his bubbling talent. One of those programs just happens to be the funniest bit of crumpet called 'Fawlty Towers'. Remembering this show when I was a child and was on our local PBS station, I eagerly bought it when it was released on DVD about a year ago. Since then, I have watched random episodes here and there but never fully taking in the enjoyment from watching it all. So, today I decided to sit down and watch this series from beginning to end and I have yet to finish laughing. If this program doesn't define comic genius, I don't know what does. Never have I witnessed a show that has continually been fresh, hysterical (I cannot use that word enough), real, and outlandish all at the same time. Normally, with our current television programming, you need to pick or choose which it will be, but thankfully 'Fawlty Towers' is all of these and many more. Cleese remains in top form as Basil Fawlty, the owner/manager of the B&B that just happens to have his hands and over-worked imagination in everything. With the aid of his helpers Manuel (he's from Barcelona) and Polly (co-writer Connie Booth and ex-wife of Cleese), Cleese always seems to find himself in a heap of trouble with his wife Sybil (the dragon of the hotel). Armed with physical humor and a snake-like banter, we witness everything from a dead body, hotel inspectors, a failed anniversary party, a moose head, and a Himalayan rodent of sorts happen to this simple, everyday, B&B. This is not only a few of the episodes you will find in the complete set, but also the daily stress that Basil finds himself falling into daily.This series, again, is hysterical. Cleese is the master of his trade while proving that he can manage any task thrown in front of him. While some will argue that he overshadows the rest of the cast, I would say 'hogwash' to that. My two favorite characters in this series were Major and Manuel. The comedy that they provide cannot be found on television today. All I need to say is thank God for the BBC. Grade: ***** out of *****"
    },
    {
      "username": "deloudelouvain",
      "userUrl": "https://www.imdb.com/user/ur58525162",
      "reviewLink": "https://www.imdb.com/review/rw3184748",
      "warningSpoilers": false,
      "date": "16 February 2015",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "This will never grow old",
      "content": "One of my all time favorite comedy series. I must have seen those at least ten times and still I would watch it again. I know almost every line out of my head. Every character in this show fits perfectly to make this British comedy an old time classic. Basil Fawlty (John Cleese) is absolutely brilliant as the super nervous hotel manager that always tries to get the upper class in his establishment. Riff-Raff is not for him. Sybil (Prunella Scales) his wife on the other hand just wants to run the hotel normally. Her bossy attitude towards her husband Basil is hilarious. Polly the maid (Connie Booth) looks like the most normal person in this series. Manuel (Andrew Sachs) drives Basil completely bonkers, he's from Barcelona and doesn't get anything that Basil is trying to explain to him. Those four run the show but the other characters are all funny as well. I like every episode but \"The Germans\" must be my favorite one. If you never watched this show then I can only highly recommend it. You don't know what you are missing."
    },
    {
      "username": "kurt_messick",
      "userUrl": "https://www.imdb.com/user/ur0744234",
      "reviewLink": "https://www.imdb.com/review/rw1236587",
      "warningSpoilers": false,
      "date": "12 December 2005",
      "rate": "",
      "helpful": "75 out of 81 found this helpful.",
      "title": "Checking in?",
      "content": "Come visit the worst-run hotel in the whole of western Europe (well, except for that place in Eastbourne...) In a field with many top contenders, 'Fawlty Towers' remains my favourite of all 'Britcoms' - situation comedies originating on British television. Fawlty Towers has a cult following decades after the originals aired; it is sometimes hard to believe that there are but 12 episodes, six hours total. The regular cast is led by John Cleese, veteran of the famous Monty Python comedy troupe, as the irrepressible Basil Fawlty, titular head of the hotel with dreams of class and glory; Prunella Scales is his long-suffering and hardworking wife, Sybil, who recognises that while Basil may think 'the sky's the limit!', in fact, '22 rooms is the limit'. Connie Booth (Cleese's real-life wife) played the level-headed and sensible, overworked maid Polly, and in a role matched only by Fawlty's own bizarre manner, Andrew Sachs plays the lovable and ever-incompetent Spanish waiter, Manuel (he's from Barcelona...). Ballard Berkeley makes Ballard Berkeley makes a regular appearance as the Major, a retired long-term resident at the hotel. Brian Hall joined the cast for the second season as the not-quite-gourmet chef, Terry.From the very first episode (first aired in 1975) featured a social-climbing Fawlty as perhaps the most rude and insufferable hotel manager in existence, in the resort town of Torquay, on the Channel coast of Britain. Sybil tries to maintain a reasonable level of service, but Fawlty's snobbishness permits him to be gracious (indeed, excessively fawning) toward those he considers 'worthy', which in this episode turns out to be Lord Melbury, who ends up not being Lord Melbury, but rather a confidence trickster, and Fawlty's revenge scares away the real 'posh' guests, whom Fawlty sends off with the hilarious shout, 'Snobs!' In each of the episodes, there is a crisis - one gets the sense that the life of Fawlty is non-stop crisis, with his wife and Polly forever picking up the pieces, Manuel always complicating things, and the others wandering around in a state of disbelief (or, in the case of the Major, perpetual daze). The twelve episodes highlight all the things that could wrong at hotel in classic comedic fashion - the institution of a Gourmet Night falls flat when the not-quite-recovering alcoholic chef starts drinking the night of the main event; a guest dies in the middle of the night, and Fawlty tries to slip him out unnoticed; remodelers install and remove the wrong doors; the health inspector unexpected shows up and gets served a bit of rat with his cheese.However, nothing quite matches the kinds of situations Basil can get himself into. When trying to plan a surprise anniversary dinner for his wife, she leaves the hotel thinking that Basil has forgotten again, and Basil dresses Polly up as a sick-bed-bound Sybil to fool the guests. When Polly's friends check in for a wedding over the weekend, Basil suspects the group of free sexual expression (highlighting his own repression); this theme is carried over to a glorious extreme in the episode about the visiting Psychiatrist.'How does he make his living?' Basil protests. 'He makes his money by sticking his nose into others' private parts, er, details...' This is also the episode where Sybil finally confronts Basil about his double-sided hotel manner toward guests: 'You're either crawling all over them, licking their boots, or spitting poison at them like some Benzedrine puff adder,' she declares. He replies in perfect form, 'Just trying to enjoy myself, dear.' As the psychiatrist will comment near the end, there's enough material for an entire psychiatrist conference. Indeed there is, as this is slapstick humour with a difference. Intelligent and witty while utterly chaotic and beyond the pale, one is treated to the moose-head incident and the ingrowing toenail as well as Fawlty's unique form of automobile motivation (how many of us have ever been tempted to whack away at a stalled car with a stick!) and a nice performance of Brahms (his 'third racket', to be precise). One must not overlook the little details, either, including the ever-changing sign in front (the actual hotel used for the exteriors unfortunately burned down many years after the show), and the fact that the interior and exterior layouts of the building cannot correspond (shades of 'The Simpsons' whose furniture layout changes from scene to scene).It is almost inconceivable that the two series, each of six episodes, were four years apart (1975 and 1979), as they flow rather seamlessly together. Popular on television networks worldwide, it can be seen variously on BBC America and local public television channels, often during the fund drives, when the most popular pieces are shown."
    },
    {
      "username": "AaronCapenBanner",
      "userUrl": "https://www.imdb.com/user/ur23589178",
      "reviewLink": "https://www.imdb.com/review/rw2854296",
      "warningSpoilers": false,
      "date": "20 August 2013",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "Funniest Series Ever Made!",
      "content": "Unlike many comedies which try to be topical, end up being very much of their time, and as a consequence don't age well, which certainly can't be said about this show, which stars John Cleese as Basil Fawlty, manager(along with his wife Sybil, played by Prunella Scales) of an English hotel, and the various staff and guest problems he would face.The comedy in this series built over the course of the 12 episodes, which would frequently end in Basil being humiliated in a predicament of his own making. Curious thing is how Fawlty isn't really a likable character, but a funny one, which was what John Cleese was going for.Highlights are Basil suffering a concussion, and his subsequent encounter with a group of German guests...or how a rat gets loose, and Basil's frantic attempts to deal with a crazy tenant hunting it with an Elephant gun... Priceless!"
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw3709281",
      "warningSpoilers": false,
      "date": "16 May 2017",
      "rate": "10",
      "helpful": "15 out of 18 found this helpful.",
      "title": "The jewel in The British comedy crown",
      "content": "I can only imagine what it must have been like for the millions of viewers back in 1975 and subsequently 1979 to sit down and watch an episode of Fawlty Towers for the first time. Considered by many as the greatest sitcom of all time, certainly by me. Made before I was born I connect with each character and laugh out loud at each episode, whether it's Basil's frustrations, Manuel's lack of understanding, Cybil's coarseness, or indeed the array of amusing guests.Only twelve episodes made, all concerned made every effort to ensure that what was put out was quality, a four year gap in between Series shows just what perfectionists Cleese, Booth and co. were. When I reach the sixth episode of Series 2, I often wonder 'if only there were more,' but to maintain the standard they did, they made the right decision. Twelve episodes of pure comedy gold.How do you go about picking a favourite episode, for many it's The Germans, for many it's Basil the Rat, personally I'll always have a fondness for The Kipper and The Corpse, even the title shows a level of genius.It's one of the few shows that can genuinely make you forget about a bad situation, you can check into Fawlty Towers and laugh your head off. Laughter will forever be the best medicine, and this show will forever remain Britain's best loved comedy. 10/10"
    },
    {
      "username": "UACW",
      "userUrl": "https://www.imdb.com/user/ur0103460",
      "reviewLink": "https://www.imdb.com/review/rw1501962",
      "warningSpoilers": false,
      "date": "20 October 2006",
      "rate": "",
      "helpful": "29 out of 34 found this helpful.",
      "title": "All Downhill From Here",
      "content": "Of all you'll ever see on the telly or the silver screen this has got to be the best. If you don't own this series you'll regret it - for if you rent it you'll be hard pressed to return it and everything you rent will be downhill afterwards.Donald Sinclair goes into history as the most brilliantly rude hotelier ever and John Cleese and then spouse Connie Booth go into history as the best sitcom writer duo ever. The teleplays were meticulously written and rewritten and the acting is better than superb.This series has been voted best television series of all time so many times now it's not funny. Odds are you will never laugh as hard as you do when you see this. And you won't tire of it quickly either."
    },
    {
      "username": "jdmu7",
      "userUrl": "https://www.imdb.com/user/ur6772314",
      "reviewLink": "https://www.imdb.com/review/rw1413491",
      "warningSpoilers": false,
      "date": "7 July 2006",
      "rate": "10",
      "helpful": "74 out of 78 found this helpful.",
      "title": "This is what comedy is all about!",
      "content": "This is pure comedy. It is genius. It is hilarity that transcends the boundary of comedy. Fawlty Towers is the kind of comedy that has you on the floor gasping for air in a puddle of your own tears. John Cleese has created one of the defining characters of comedy in Basil Fawlty. Manuel Sachs is superb as Manuel, the confused waiter from Barcelona. Prunella Scales is brilliant as the tyrannical wife. Connie Booth is very good as Polly, the hassled waitress. Put it all together inside a small hotel in Torquay and you get one of the greatest, most alluring comedies ever to grace the screen. The only bad thing about Fawlty Towers is that they didn't make more.Fawlty Towers will always be tearfully, heart stoppingly, deadly, and disasterously funny."
    },
    {
      "username": "basford",
      "userUrl": "https://www.imdb.com/user/ur8719955",
      "reviewLink": "https://www.imdb.com/review/rw1286726",
      "warningSpoilers": false,
      "date": "8 February 2006",
      "rate": "",
      "helpful": "45 out of 51 found this helpful.",
      "title": "Hilarious! Classic British comedy.",
      "content": "Fawlty Towers is one the best, most popular but sadly slightly overshadowed comedies in Britain. it has the ingredients for perfect comedy and contains perfect characters. It is about this misanthropic arrogant man, Basil Fawlty, played brilliantly by the genius John Cleese, who is totally in the wrong job. He runs hotel and is rude to nearly everyone within a ten mile radius of him, but determined to make a success of his business. His wife Sybille played by Prunella Scales, whom he despises to the nth degree because she rules him with a rod of iron. Then there is Polly the waitress played by Connie Booth, the most intelligent character in the show who always ends up sorting out all the problems and keeps the hotel running. There is Manuel played by Andrew Sachs, the lovable gormless Spanish waiter who Basil bullies and tries to kill in nearly every episode. Other additional characters are the batty Major Gowen played by Ballard Berkeley, the dotty old ladies Miss Gatsby and Miss Tibs played by Renee Roberts and Gilly Flower and Terry the chef played by Brian Hall. All played very well.One thing this programme didn't do like others is go on for series after series and eventually become far-fetched like several British sitcoms seem to do (cough, Last of the Summer Wine). It only ran for two series and left the audience starving for more. I think that it was a wise move not to do more, even though I would have loved it if they had. This is probably what John Cleese might be best remembered for in Britain, he not only stared in it he wrote it as well with wife Connie Booth. He based the character on a hotel proprietor in while staying at a hotel in England with the Python Gang.I have no issues with this show at all, brilliant work. This kind of stuff needs to be treasured in Britain because it captures British humour perfectly. Whether you know the show or not, treat yourself to a DVD of series one or two (or both if want) and enjoy. And to those of you who haven't seen it before, I guarantee that you'll be in stitches within the first ten minutes of any episode.QUOTE:- Basil Fawlty (trying to start his car)-Come on! Come on, start....START YOU VICIOUS BASTARD!"
    },
    {
      "username": "noelbotevera",
      "userUrl": "https://www.imdb.com/user/ur1391302",
      "reviewLink": "https://www.imdb.com/review/rw0139514",
      "warningSpoilers": false,
      "date": "14 May 2004",
      "rate": "",
      "helpful": "96 out of 106 found this helpful.",
      "title": "Still funny after all these years",
      "content": "Just saw again the first four episodes of John Cleese's wonderful, wonderful Fawlty Towers, the dysfunctional hotel run by the inimitable Basil Fawlty (Cleese), and his battle-wagon wife, Sybil (Prunella Scales). Amazing how many belly laughs and guffaws the show can still inspire, and this is probably my third or fourth viewing (still, it's been years). Even more amazing is the short documentary on the realBasil Fawlty--Donald Sinclair, manager and owner of the Gleneagle, an ex Navy commander who (as Ray Marks, present manager of the Gleneagle puts it) thought running the Gleneagle \"would have been a wonderful job, if it wasn't for the guests. The guests spoiled his job.\"According to legend, the Monty Python troupe once booked rooms at the Gleneagle, in the seaside town of Torquay; they still remember some of the things Sinclair did to them there. Pythoner Eric Idle carried an alarm clock inside his briefcase at the hotel reception; when Sinclair heard the ticking he said \"My God, there's a bomb in there!\" and threw it off a cliff. Later, Pythoner Terry Gilliam sat down to a meal and ate American style, cutting up the food first before picking up the pieces with his fork; Sinclair, passing by, picked up Gilliam's knife and snapped \"we don't eat like that here!\"Eventually the entire Python troupe moved to another hotel--all except Cleese, who stayed. Apparently, he thought there was an idea for a TV show here somewhere.It wasn't only the Pythoners that suffered; one guest asked for a drink at the bar, to which Sinclair replied by slamming down the grill and saying \"the bar's closed.\" When his friend invited him to a nearby hotel to drink, Sinclair informed him that if he isn't back by 11 pm, the front door will be locked. He comes back late, and just as Sinclair threatened, the front door was locked. \"This is ridiculous,\" he said, \"my wife and daughter are in there,\" and started banging on the door; a light turned on in a window, and Sinclair popped his head out and said \"I told you I'd lock the doors by 11!\" The guest replied: \"If you don't open the doors I'm going to knock them down!\" Three or four minutes later, Sinclair opens the door, lets him in, bangs the door behind him loud enough to, as the guest put it, wake everyone in the hotel, and yells \"Don't let that happen again!\" Sinclair was also hard on the hired help. He hated builders, and would yell and curse at them; one Greek waiter was so fed up with Sinclair's treatment of him he jumped into a taxi and demanded to be driven to London. Rosemary Harrison, who once worked for Sinclair, describes how when one waiter, tired of waiting for Sinclair to make the tea, took a teapot meant for another table. Sinclair stopped the serving of breakfast and \"went up and down the tables like a policeman, questioning the guests. He came across a set of teapots at a table for two. He realised because of their size they were meant for a table for four, and he asked the guests for a description of the waiter.\"Sinclair was apparently so appalling that when his wife had to go out shopping, she would lock him up in their room, and say to the staff \"don't let him out, he's only going to upset you.\" Ian Jones, owner of the nearby Coppice Hotel, said \"fugitives from the Gleneagle used to come knocking on our door, pleading accommodations.\"He was, as Cleese would put it, \"the most wonderfully rude man I have ever met.\""
    },
    {
      "username": "ShadeGrenade",
      "userUrl": "https://www.imdb.com/user/ur7743887",
      "reviewLink": "https://www.imdb.com/review/rw1465241",
      "warningSpoilers": true,
      "date": "3 September 2006",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "\"Papers Arrived Yet, Fawlty?\"",
      "content": "It shames me to have to admit that I missed the first three 'Fawlty Towers' episodes on its original run as I was hooked on the I.T.V. series 'Beryl's Lot' ( starring Carmel McSharry ). My first encounter with Basil was Episode Four - 'The Hotel Inspectors'. Even now I can feel the pain in my side from laughing too hard. I spent the next few days telling everyone how great this show was. 'Fawlty Towers' takes place in a hotel in Torquay, run by the world's rudest man - Basil Fawlty ( John Cleese ) and his henpecking wife Sybil ( Prunella Scales ) who has a laugh like someone machine-gunning a seal. The permanently overworked staff includes American art student Polly Shearman ( Connie Booth, then Cleese's wife ), Cockney chef Terry ( the late Terry Hall ) and, of course, Manuel ( Andrew Sachs ), a Spanish waiter whose command of the English language leaves a lot to be desired. Among the regular guests are the senile Major Gowen ( Ballard Berkeley ). What gives the show much of its humour is that Basil is snobbish and quick-tempered, barely disguising his contempt for the guests.'Fawlty' was based on the late Donald Sinclair, owner of 'The Gleneagles' in Torquay. He was so rude that the Python cast, there on a location shoot, moved out! Cleese remembered him when writing for the L.W.T. sitcom 'Doctor At Large'. The episode 'No Ill Feeling!' was a success and it was clear that there was a series based around its setting and characters.The show debuted on B.B.C.-2 less than a year after the final season of 'Monty Python'. It was not an immediate hit. Repeats came to the rescue. When it moved over to B.B.C.-1 on Sunday evenings a year later, ratings skyrocketed. It got off to a fantastic start with 'A Touch Of Class' in which Basil is taken in by a confidence trickster ( Michael Gwynn ). Other classic episodes include 'The Hotel Inspectors' ( boasting a marvellous guest performance from Bernard Cribbins ), 'Gourmet Night' in which Basil tries to make the hotel famous for its cooking, and, memorably, 'The Germans' with a concussed Basil offending a party of Germans by making constant references to the war.It was a triumph, yet a second season did not appear until 1979. The first was a tough act to follow, but the second managed it. Memorable episodes include 'Communication Problems' with Joan Sanderson as a fussy old woman who uses her deafness to get her own way, 'Waldorf Salad' in which a loud American ( Bruce Boa ) tries to bribe Basil into keeping the chef working, 'The Kipper & The Corpse' has Basil trying to conceal the fact one of the guests has died, and the final edition - 'Basil The Rat' - involves the staff hunting for an escaped rodent before a Health Inspector is due to call.It goes without saying that 'Fawlty Towers' is the most perfectly realised British sitcom of them all. Excellent scripts superbly performed by a top-notch cast. It has not diminished with the passage of time."
    },
    {
      "username": "doggans",
      "userUrl": "https://www.imdb.com/user/ur1363877",
      "reviewLink": "https://www.imdb.com/review/rw0139502",
      "warningSpoilers": false,
      "date": "22 January 2003",
      "rate": "",
      "helpful": "36 out of 42 found this helpful.",
      "title": "Hilarious sitcom",
      "content": "Based on an actual hotel Cleese and the MP gang stayed at once, Fawlty Towers is a hilarious British sitcom with great characters and situations. Probably the most famous episode is the one with the Germans, as I hear it referred to the most.Basil Fawlty (Cleese) is a grumpy hotel manager, with his domineering wife Sybil, the hotel maid Polly (co-creator and Cleese's wife at the time of the show Connie Booth), the Spanish waiter Manuel (\"I learned classical Spanish, not this strange dialect he's using\"), and the hotel's longest standing resident, the Major. Witty dialogue and hilarious slapstick situations make this a great show."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2257455",
      "warningSpoilers": false,
      "date": "31 May 2010",
      "rate": "10",
      "helpful": "12 out of 16 found this helpful.",
      "title": "Why didn't this show last longer?",
      "content": "Britain have had their fair share of great sit-coms, Last of the Summer Wine, Black Adder and Only Fools and Horses are classics. So is Fawlty Towers- it is just a shame the show didn't last longer, it only lasted for 12 episodes which is a real shame as this show is a comedy jewel! The writing is consistently hilarious, it's not everyday we hear somebody say stuff like \"if you bother me again I shall visit you in the small hours of the morning and put a bat up your nightdress\", and the story lines are always well written and original, the Kipper and the Corpse episode especially is a classic, so is The Germans(especially for the final insult). If I had a least favourite episode it is Waldorf Salad, merely because I found the American tourist annoying and unlikeable, but that is such a minor criticism, plus there were some very good moments still in that episode, especially Basil's facial expressions. The production values are well above average, the music is also good and the direction is very well done. And I love the acting; John Cleese is superb in what I consider the best of his non-Monty Python roles, and Prunella Scales matches him perfectly as his wife. Everyone else is wonderful too. Overall, just a gem of a comedy series. 10/10 Bethany Cox"
    },
    {
      "username": "IridescentTranquility",
      "userUrl": "https://www.imdb.com/user/ur4150182",
      "reviewLink": "https://www.imdb.com/review/rw1312687",
      "warningSpoilers": false,
      "date": "12 March 2006",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Thirty-one years old and absolutely perfect",
      "content": "An interesting thought about the famous Basil Fawlty occurs to me on reflection - if his dear wife Sybil (\"my little nest of vipers\"), his put-upon chambermaid/receptionist/waitress Polly and his unfortunate Spanish waiter Manuel all died tomorrow, he'd never be able to cope running the hotel. He'd internally explode or offend the guests just that little bit too much, and that would be the end of Fawlty Towers.If Basil died, on the other hand, I don't think Sybil, Manuel and Polly would worry at all about carrying on without him. Although he's a hotelier, Mr. Fawlty clearly doesn't like people at all. He exploits the fact that the slightly deaf and constantly complaining Mrs. Richards has her hearing aid switched off to ask, \"Is this a piece of your brain?\". Obviously sexually repressed, Basil can't come to terms with the liberated 1970s that he lives in. He goes out of his way to avoid giving an unmarried couple a double room, then spends the night \"checking the walls\" for woodworm and having misunderstandings with a pretty Australian guest, leading Sybil to respond with \"If you're going to grope a girl, have the gallantry to stay in the room with her while you're doing it!\". With lines like this, you can see why it took Connie Booth and John Cleese weeks to write each episode. Basil himself is an interesting physical character. I think it particularly helps that John Cleese is well over six feet in height, because when Basil gets in a rage he seems trapped in his own body. Anyone else would be throwing things and flailing their arms about and screaming, but Basil, being emotionally (and certainly sexually) repressed, doesn't seem to know how to handle his anger and his physical struggle is very funny to watch.There are a wonderful host of interesting characters for Basil to bounce off - a small guest named Mrs. Hall that he doesn't notice, a highly-strung (\"Yes, he should be\") teenager who demands salad cream instead of fresh mayonnaise and the priceless builder Mr. \"lick o'paint\" O'Reilly, as well as the better builder Mr. Stubbs (\"That's a supporting wall! God help the floors above!\"), the Major and the old ladies who seem to live in the hotel.If Basil Fawlty was still alive today (though I imagine he'd have long since expired of a heart attack or astronomically high blood pressure), I'm not sure if he'd have retired or if he'd be clinging on to his treasured establishment until he dropped down dead. I'd like to think that Sybil could outlive him - perhaps in a twist on Basil's reference to the film \"How To Murder Your Wife\" she'd have gone mad and killed him - so whether she'd be in prison or retired or mourning the loss of Basil, I can't tell but I hope she'd enjoy her retirement."
    },
    {
      "username": "SimonJack",
      "userUrl": "https://www.imdb.com/user/ur17816293",
      "reviewLink": "https://www.imdb.com/review/rw3567329",
      "warningSpoilers": false,
      "date": "23 October 2016",
      "rate": "10",
      "helpful": "9 out of 12 found this helpful.",
      "title": "The best TV comedy of all time",
      "content": "\"Fawlty Towers\" must be the funniest programming ever put on television. I include in that the comedy shows of old, the modern sitcoms and the various series over the years. This BBC production is called a mini-series, and it was produced just two years - and those, four years apart. The initial season was 1975 with six episodes. It proved so popular, and John Cleese and Connie Booth had enough material, that it returned for another season of six episodes in 1979. Not only did it go against the grain of ongoing shows wearing out (diminishing in quality), \"Fawlty Towers\" was even better the second time around. Each episode seemed to be a little funnier than the one before it.I rate comedy by a few factors. Uppermost is how much it makes one laugh. Not just me, but others as well. And not just once, but on repeated viewings. Then, is its broad audience appeal. It must be clean (not toilet humor or foul language). Witty, clever lines appeal to more mature audiences; slapstick appeals to all ages but is especially catching for younger audiences; and hilarious antics reach across the board. Add to these smaller things such as tongue- in-cheek comments, off-hand jabs, aside glances, double takes, and various comedy nuances. Finally is its longevity and timelessness. Regardless of when it was made, or where, the humor is not dated. It's just as funny to succeeding audiences over time.Since the advent of TV in the mid-20th century, there have been hundreds of comedy shows, mini-series, and what today are called sitcoms. Few TV comedy programs today fit the above criteria that make for great, lasting comedies. Few of them today will sustain the laughter some old shows generated. \"I Love Lucy\" of 1951-1957 often had people rolling with laughter. Reruns of it today still are very funny. The Carol Burnett Show of 1967-1978 had some of the most outlandishly funny and clever skits ever done on TV. The reruns of those still get much laughter.But, since I first saw \"Fawlty Towers\" after it came out in the 1970s, I haven't seen any comedy that can top it. So, once a year or so, I trot out my DVD set of the complete series and watch it again. John Cleese's Basil Fawlty is the perfect antidote for the blues or lethargy that may set in at times. The egocentric, stuffed shirt, proud, prudish and bombastic Basil is a surefire cure for the doldrums.My DVD set Includes some bonus materials on the background for the series. Cleese and Connie Booth (who plays Polly in the series) got the material for the show while staying at a hotel in Torquay on the English Channel. That was while they were working on \"Monty Python's Flying Circus.\" Apparently, the innkeeper was a boorish character who tended to turn customers away. So, they modeled Basil on him. All the members of the cast contribute to the success and humor of the series. But this is a Cleese show all the way. I enjoy great humor, and \"Warty Fowls\" (one of the many derivatives of the title shown with the opening credits of succeeding shows) is my favorite TV comedy of all time."
    },
    {
      "username": "BearLover",
      "userUrl": "https://www.imdb.com/user/ur0026270",
      "reviewLink": "https://www.imdb.com/review/rw0139491",
      "warningSpoilers": false,
      "date": "12 February 1999",
      "rate": "",
      "helpful": "62 out of 80 found this helpful.",
      "title": "Brilliant",
      "content": "I consider this series one of the best comedies ever produced! Outstanding humor, exquisite physical comedy. It doesn't get any better than this!"
    },
    {
      "username": "Sylviastel",
      "userUrl": "https://www.imdb.com/user/ur0033913",
      "reviewLink": "https://www.imdb.com/review/rw1384585",
      "warningSpoilers": false,
      "date": "3 June 2006",
      "rate": "10",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Twelve Episodes isn't enough!",
      "content": "Fawlty Towers sadly should have been more than 12 episodes or two seasons by British standards. John Cleese who turned down an C.B.E. (Commander of the Order of the British Empire) in 1996 should have been knighted but if he refused the C.B.E. then why bother but he is a comedic genius and brilliant intellectually. Sadly, he and his partner, his then wife American playing British woman, Connie Booth was also a major part. SHe played the only sane person among a sea of lunatics. Basil Fawlty is one of the most memorable characters in British television history. Who can forget the German episode or the wedding episode where the unmarried couple believe he is fooling around with Manuel played perfectly by Andrew Sachs. Prunella Scales C.B.E. is quite the opposite of her actual personality. I still love her and think she should become a Dame soon by now. Her performance as Sybil Fawlty is etched in stone. The cast including the older two women who are probably a lesbian couple which was never talked about on the show broke barriers even though they played it straight and Ballard Berkeley's performance as the Major in the moose episode is unforgettable. Twelve episodes is not enough. It should have ran for a 100."
    },
    {
      "username": "Bison74",
      "userUrl": "https://www.imdb.com/user/ur0241562",
      "reviewLink": "https://www.imdb.com/review/rw0139449",
      "warningSpoilers": false,
      "date": "6 May 1999",
      "rate": "",
      "helpful": "49 out of 56 found this helpful.",
      "title": "Hilarious romp",
      "content": "This is quite possibly the funniest set of videos I have ever seen. There were situations here that had me laughing so hard my sides ached. What makes it so magical is an incredible sense of timing topped with Cleese's flawless physical humor. To add to this a supporting cast who can literally \"dance\" around these two aspects makes for a symmetry so perfect that it'll leave you in tears. I would recommend any one of the videos in this set."
    },
    {
      "username": "michaelrustage",
      "userUrl": "https://www.imdb.com/user/ur6712008",
      "reviewLink": "https://www.imdb.com/review/rw1488183",
      "warningSpoilers": true,
      "date": "2 October 2006",
      "rate": "",
      "helpful": "10 out of 11 found this helpful.",
      "title": "A fantastic example of how comedy should be done.",
      "content": "Like most people, I love Fawlty Towers and I personally think that it's one of the best ( if not THE best ) sitcoms around. John Cleese and Connie Booth really did leave the world a terrific example of how comedies should have been done. Fawlty Towers puts most comedies today to shame. This is because Fawlty Towers was very original. It was beautifully written and constructed, it had an incredibly fast pace and had characters that we loved. There is more material and humour in one episode of Fawty Towers than there is in an entire series of most comedies today. John and Connie had fantastic ideas and most importantly they knew how to present them. They took longer than 6 weeks to produce just one script. That explains why they were so good. The writers of Are you being served? for example took just 2 days to produce a script. That explains why they were so poor. I think a lot can be learned from the making of Fawlty Towers. I think the most important thing to learn though is to call it a day when you're at your peak. John and Connie were very wise to do that and because of that Fawlty Towers will never become tired. It's a shame no other comedy writers have ever done it."
    },
    {
      "username": "haildevilman",
      "userUrl": "https://www.imdb.com/user/ur3987336",
      "reviewLink": "https://www.imdb.com/review/rw1428604",
      "warningSpoilers": false,
      "date": "23 July 2006",
      "rate": "10",
      "helpful": "9 out of 12 found this helpful.",
      "title": "Britain's best",
      "content": "Just ekes out 'The Young Ones' for best Brit TV comedy. (Sorry Rik.)This show kept the laughs coming fast and furious and never let up.Think about it for a second. Stressed out husband, nagging shrew of a wife, incompetent employees, family owned Inn, plots include health inspectors, overnight death, criminal hiding out...My point? Hardly very original. But that's the genius.Cleese and crew took these basic overused devices and turned them into a riot. No situation was left untouched. If you think about it still, it was just Basil Fawlty (Cleese, you knew that right?) constantly trying to cover up a gaffe only it leads to a bigger one. And so on and so forth.The frantic pacing and wild anarchy was perfect.Kudos go to Prunella Scales, Andrew Sachs, Connie Booth (Cleese's ex) and the Major for their excellent support."
    },
    {
      "username": "Red-Barracuda",
      "userUrl": "https://www.imdb.com/user/ur1616919",
      "reviewLink": "https://www.imdb.com/review/rw2393484",
      "warningSpoilers": false,
      "date": "3 March 2011",
      "rate": "9",
      "helpful": "7 out of 10 found this helpful.",
      "title": "TV sitcom at it's finest",
      "content": "Fawlty Towers is a sitcom that virtually needs no introduction. There surely cannot be too many people who don't know what it's about. On paper the idea of the show is surprisingly unremarkable. It just sounds like many other sitcoms. Of course the reality is that Fawlty Towers is seriously far from being ordinary. Like all great TV comedy, the strength of the show is a combination of its writing and its performances. In the case of the screenplay, the show works like clockwork. Each episode works like a finely tuned clock, with no wastage and every single event in the narrative is there for a greater overall purpose. It's precision writing of the first order. And as for the performances? We have comic acting of the highest level from John Cleese, Andrew Sachs and Ballard Berkley in particular, with extremely able support from the other regulars and guests. Basil Fawlty in particular is a fantastic comic creation from Cleese. He is a well-rounded believable character who is both unpleasant and completely sympathetic. He not only has great lines but Cleese's height is used to great effect here. It's impossible to imagine the character any other way than a venom-spitting stick insect.It's been mentioned so many times but yes there were only twelve episodes. It was very much a case of quality over quantity, and all the better for it. I personally wouldn't go so far as to say all twelve were perfect however, as I have always felt that 'The Waldorf Salad' and 'The Anniversary' were two episodes that made the mistake of stretching the farce too far to the point where they just became silly at points. Nevertheless, even these lesser episodes still had their moments of comic greatness. But of course there are shows that displayed pure genius from start to finish - 'The Psychiatrist' in particular is pretty much comic perfection. Comedy does tend to date far worse than any other genre. What one generation finds funny changes and varies very rapidly. And while Fawlty Towers does suffer from a bit of wear and tear here and there due to age, it remains for the most part a terrific example of the sitcom as an art form."
    },
    {
      "username": "chris_gaskin123",
      "userUrl": "https://www.imdb.com/user/ur1532079",
      "reviewLink": "https://www.imdb.com/review/rw1362529",
      "warningSpoilers": false,
      "date": "8 May 2006",
      "rate": "10",
      "helpful": "7 out of 10 found this helpful.",
      "title": "I wouldn't like a holiday at this hotel!",
      "content": "Fawlty Towers is certainly one of the best ever comedies to exist. Its up there with Dad's Army, Only Fools and Horses and Open All Hours.Set on the English Rivera in Torquay, Fawlty Towers is run by Basil Fawlty and his wife Sybil. He employs Spanish waiter Manuel, who Basil is always bullying. Basil is always rude to his guests.Memorble episodes include \"The Germans\", where Basil does his Hitler impression in front of some German guests and the one which includes Basil attacking his own car with a twig! Basil is played by the excellent John Clesse, Prunella Scales plays Cibol, the long suffering Manual is played by Andrew Sachs and Cleese's then wife Connie Booth is Polly. The rest of the cast includes Ballard Berkeley as the Major.Of all the holidays I have had, I've never had a hotel like this! Watch it for a good laugh."
    },
    {
      "username": "jeremy3",
      "userUrl": "https://www.imdb.com/user/ur11996903",
      "reviewLink": "https://www.imdb.com/review/rw1685085",
      "warningSpoilers": true,
      "date": "2 July 2007",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "John Cleese is brilliant",
      "content": "A few years ago someone boldly declared that John Cleese is not funny. What planet is she living on? John Cleese has the acrobatics of Jim Carey, Buster Keaton, and Roberto Benigni. Witness his goosestepping in front of the German guests. John Cleese has the fastest timing imaginable. Witness when it turns out that \"the little crumpette\" is really the guest's 76 years old mother. (P.S. - I noted that the guest and the older gentleman psychiatrist next door were real life father and son). Fawlty turns from scorn to politeness with complete ease and spontaneity. The jokes on the show are completely ridiculous and hilarious. Cleese plays Fawlty. He is an extremely unpolitically correct manager of a hotel in Torquay, England. Torquay (near Cornwall) is in the southwestern part of England. There are real palms trees at the ocean level. Fawlty is a nasty man, who says exactly how he feels. This is probably how most hotel workers feel after 15 years, but don't usually say how they feel outloud. Fawlty is supposed to represent the rural Tory mentality of the 1970s. There is a great supporting cast. Connie Booth, co-writer of the episodes, plays English enough to not realize that she is from Indianapolis, Indiana. Andrew Sachs plays a very convincing Spaniard. Of course, Fawlty treats Manuel like absolute dirt, representative of how lowly regarded EU workers are in England. The only fault of this show is that there were only 12 episodes. I would have loved to be rolling on the floor at many more episodes. Instead, I just roll on the floor when the Major says \"you silly Moose\"."
    },
    {
      "username": "wellthatswhatithinkanyway",
      "userUrl": "https://www.imdb.com/user/ur0345596",
      "reviewLink": "https://www.imdb.com/review/rw0139462",
      "warningSpoilers": false,
      "date": "27 August 2000",
      "rate": "",
      "helpful": "8 out of 13 found this helpful.",
      "title": "An absolute masterpiece",
      "content": "STAR RATING:*****Unmissable****Very Good***Okay**You Could Go Out For A Meal Instead*Avoid At All CostsFawlty Towers is absolutely brilliant.To describe this unrivalable masterpiece as perfect barely does it justice.Currently enjoying reruns on BBC1 on Sunday afternoons,it can be watched again and again and again,and there are always new and interesting angles to watch it from.Possibly the best out the lot being The Hotel Inspectors,a marvellous piece of slapstick and sillieness.John Cleese is,and remains to this day,a comic genius,masterfully managing to apply his own unique application to the genre of comedy.Second best comes in as Andrew Sachs as hopelessly incompetent Spanish waiter Manuel whose 'que' and 'sie'cries have become just as appreciated amongst today's comic generation.It's stunning to think all this great accomplishment was churned out as long ago as 25 years.*****"
    }
  ],
  "errorMessage": ""
}