{
  "imDbId": "tt0121220",
  "title": "Dragon Ball Z",
  "fullTitle": "Dragon Ball Z (TV Series 1989–1996)",
  "type": "TVSeries",
  "year": "1989",
  "items": [
    {
      "username": "Zombie-Kermit",
      "userUrl": "https://www.imdb.com/user/ur12139954",
      "reviewLink": "https://www.imdb.com/review/rw1873280",
      "warningSpoilers": false,
      "date": "12 May 2008",
      "rate": "10",
      "helpful": "40 out of 44 found this helpful.",
      "title": "What Can Be Said about This Show?",
      "content": "I mean it is awesome.This anime is based on the later part of the Dragon Ball manga written by the insanely talented Akira Toriyama. It is the follow on from the incredible Dragon Ball anime. (see review on my comments page)Set 5 years after the battle against Piccolo, Son Goku is living peacefully. But in the Dragon Ball universe peace is never lasting. Pretty soon the past he didn't even know he had escaped from catches up from him leading to a series of epic battles. The series goes across four main sagas- Saiyan, Freeza, Cell and Majin Boo. It takes place over a time span of about 27 years, which is pretty cool, and something you rarely get to see in a show like this. You get to see the characters grow up and change. Some character you will like a lot more by the time the series is finished. It contains some of the most likable characters of all time. I don't see how anyone could not like Son Goku. Or Son Gohan. Of course almost all of the old characters return in this series, although most have smaller roles. But most of them still get a chance at some action in at least one part. Piccolo and Kuririn still have fairly large roles, in the first half of the series at least. Yamucha and Tenshinhan have a lot less to do in the series, and Chaozu doesn't play much of a role at all. The villains are awesome. Vegeta is an awesome and well rounded character, Freeza may be one of the most memorable villains around, Cell is awesome just because of the basis of his character, and Boo.... well Boo is just the ultimate killing machine.The series is really different from the first series. Dragon Ball focused more on humour and martial arts, this focuses more on powerful ki blasts, hardcore action and ridiculously powerful character. It will never be the most challenging series around, but it is still a whole lot of fun. Great action scenes, really cool transformations, and a bunch of alien races. What more can you really ask for? The show spans for 291 Episodes, 13 movies and 2 TV specials. And you will still be sad when it ends.The Dragon Ball Z movies can be seen as separate stories, as most do not fit into the timeline of the series well. Also, you will find some of the material in the anime doesn't fit in very well. For the most part, this is because it is filler material that wasn't in the original manga. An example of filler is the Garlic Jr. Saga, which was put in after the Freeza saga and is a sequel of sorts to the first movie. The movies and filler are sometimes not as good as the stuff taken from the original manga, but that's not to say it isn't enjoyable. Some of the movies are pretty cool with villains like Brolli and Cooler. So I would recommend you check them out.As with Dragon Ball, there is not much to say about the animation, although by the end it had improved a fair bit. It is drawn well, and is nice to watch. The characters all have their charms in terms of the way they are designed. The music of the series is nothing spectacular either, although I like the theme songs to the series a whole lot.This is the show that, along with Evangelion: Neon Genesis, helped me get into anime, way back when I was just a dumb kid. Now I've grown up and become a dumb adult and I still love it. I watch it differently now than I did all those years ago. I grew up with the edited and dubbed version, which is great for kids, but if you are looking for the true series, try and get your hands on some DVDs with Japanese language options. I find them much better. But that's just me. No matter how you want to watch it, I would just advise you to sit down, switch off, and enjoy.With the upcoming Dragon Ball live action movie, I can only hope that it is successful enough to warrant a few sequels, as a Dragon Ball Z movie would be awesome. I would not expect it to quality cinema, just a whole lot of fun.There is also a sequel to the series, known as Dragon Ball GT, which is not based on the work of Akira Toriyama. Worth a look if you're a fan, but don't expect it to be as good as Dragon Ball Z10/10"
    },
    {
      "username": "MrLister",
      "userUrl": "https://www.imdb.com/user/ur0440841",
      "reviewLink": "https://www.imdb.com/review/rw0483757",
      "warningSpoilers": false,
      "date": "23 June 2003",
      "rate": "",
      "helpful": "18 out of 21 found this helpful.",
      "title": "I love it.",
      "content": "I was going to write a huge long comment on this, but a lot of people really seem to hate this show so I just can't be bothered preaching to the unconvertable. I will say, however, I am a big fan of anime and this is one of my favourites. It's certainly my favourite anime TV series. People don't seem to realise that this is for kids, so screw the voice acting (which is better than many other kids shows) and animation (which is also better than many other kids shows). Comparing this to serious anime like Akira is like comparing He-Man to Gladiator. DBZ is light on the brain and heavy on the adrenal gland. Once you get into it it becomes very addictive, and your imagination covers over any bad acting or animation. Unless you have no imagination... Watch it from the beginning and just let yourself get sucked in to the amazing fights and ever increasing displays of power."
    },
    {
      "username": "Johnny-the-Film-Sentinel-2187",
      "userUrl": "https://www.imdb.com/user/ur24085266",
      "reviewLink": "https://www.imdb.com/review/rw6141720",
      "warningSpoilers": false,
      "date": "2 October 2020",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "One of the world's unifying Anime milestones!",
      "content": "Dragon Ball has become a super-franchise that's attained a foothold on pop-culture like Star Wars and MARVEL, even if it's a somewhat more niche taste for some fanboys out there. Ever since 1996, when Dragon Ball Z (or DBZ) first got imported in the United States via Cartoon Network, the franchise's status in Western popular culture has become cataclysmic in scale and its characters have become household names, especially Goku himself.Anime has become an interesting paradox in the entertainment industry: some relish its high-detail animation and storytelling whilst some reckon too many are all the same as each other. Yet in Japan anime is simply a domestic term for 'animation' period: not just specific to their own stuff. DBZ is like a nice concentrated form of all the good stuff that's come to define anime over the past couple of decades, even if it has some of the cliches built-in as part of its story. Thankfully the cliches add to the charm and over-the-top nature of the show's many fight scenes and character-driven comedy helps make DBZ a plentiful experience for even the most casual viewers of animated television.This show is an energetic blast from the past that still has loads of charm and appeal for modern television audiences everywhere. Even if this isn't the very start of Goku's story (the original Dragon Ball covers that), it's still a great introduction to some of animation's most memorable characters."
    },
    {
      "username": "lucas-42",
      "userUrl": "https://www.imdb.com/user/ur0936229",
      "reviewLink": "https://www.imdb.com/review/rw0483731",
      "warningSpoilers": false,
      "date": "10 June 2001",
      "rate": "",
      "helpful": "15 out of 19 found this helpful.",
      "title": "A really cool show.",
      "content": "It may have been years since this ORIGINALLY came out, but to most of us Americans, the show is brand new material. Sometimes people may say the shows tend to \"drag on,\" but this is a clever way to keep you begging for more and tuning in again and again. Also, the characters actually develop and change throughout the series, unlike some other shows. The american translated versions may lose something in the translation, but the show is still a very cool show, and I hope Cartoon Network picks up the entire seven year run of the series. The adjusted script makes some previously \"possibly offensive\" terms absent, replacing them with less intimidating terms like \"bully.\" But this show IS for kids, and if they didn't take away some terms, it wouldn't air. Then we would be stuck buying the videos for $15.00 a piece instead of taping entire sagas for free. ;) The voice actors aren't spectacular, but they get the point across and tell a good story. The storylines are intriguing and make you want to watch every last episode to see what happens next. The show, despite it's older animation techniques, is still a good looking animated piece. I watch the series everyday on Cartoon Network when they air two episodes side-by-side (which makes since seeing as how the show moves along so slow). The show is divided into \"sagas\" or series of episodes telling a certain story. My favorite sagas are the Saya-jin Saga, Frieza Saga, Garlic Jr. Saga, Android Saga, and the Cell Saga. I hope this show keeps airing again and again. It's truly remarkable."
    },
    {
      "username": "Rectangular_businessman",
      "userUrl": "https://www.imdb.com/user/ur13538926",
      "reviewLink": "https://www.imdb.com/review/rw6623413",
      "warningSpoilers": false,
      "date": "22 February 2021",
      "rate": "6",
      "helpful": "5 out of 6 found this helpful.",
      "title": "The Buu saga is my favorite part",
      "content": "Personally, I think the best part of Dragon Ball Z was the Buu saga.Yes, I know, narratively speaking it was pretty uneven, introducing many plot points which are quickly abandoned.And yet, I found it to be far more entertaining to watch than the previous sagas, due how unpredictable it was. By now, it seems pretty obvious than Toriyama largely prefers making comical stories rather than serious ones, which would explain the sudden change in tone once the main antagonist enters in scene.I also like how in this saga the battle scenes are more varied and less repetitive, with the characters showing some bizarre and unusual fighting techniques, instead of just exchanging punches or throwing ki blasts at each other. This saga also has a lot less of filler.In many ways, the Buu saga feels like a parody of the \"dramatic\" path Dragon Ball Z was taking. That kind of genre-twist probably wouldn't work for all series, but honestly, it worked quite well here, finding an appropiate mixture of comedy and action.Both Dragon Ball GT and Dragon Ball Super totally failed at that."
    },
    {
      "username": "Gir_is_here",
      "userUrl": "https://www.imdb.com/user/ur4000297",
      "reviewLink": "https://www.imdb.com/review/rw0959979",
      "warningSpoilers": false,
      "date": "9 November 2004",
      "rate": "",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Came in 2002 (Where I live), looked like garbade, but underrated",
      "content": "Wha-? Are you crazy, Nah...the thing is, I really like this show, and it's NOT because of the fighting. Too many people just dimiss the show as a mindless punch-a-thon, as \"that fighting anime that turned me off all fighting anime.\" The thing is, the characters are all really nicely developed. As we watch the show over the years, we get to see the characters grow, and it happens so gradually that we don't even realize it's happening. Toriyama's Freeza saga was probably the best-told part, despite the fact that the anime completely f-ed it up--the reason for everyone to be there in the first place actually made sense, and the transition from the Vegeta fight to the Freeza fight (and the reason Vegeta eventually joined with the rest of the group) was actually logical. I think the show has a lot more substance than everyone else says, but I realize by now that everyone's already made up their mind about the show and no matter what I say, their opinions will stay the soon."
    },
    {
      "username": "max-61",
      "userUrl": "https://www.imdb.com/user/ur0113467",
      "reviewLink": "https://www.imdb.com/review/rw0483733",
      "warningSpoilers": false,
      "date": "16 January 1999",
      "rate": "",
      "helpful": "17 out of 24 found this helpful.",
      "title": "Probably the greatest animated series of alltime.",
      "content": "Probably the greatest animated series of alltime.The drawings are simply superb, the characters and the whole story is so complex and thrilling you simply can't miss it. It's great the way they involve humor features in an epic story. 9,9/10"
    },
    {
      "username": "DBZ",
      "userUrl": "https://www.imdb.com/user/ur0150771",
      "reviewLink": "https://www.imdb.com/review/rw0483734",
      "warningSpoilers": false,
      "date": "5 February 1999",
      "rate": "",
      "helpful": "15 out of 22 found this helpful.",
      "title": "YES! YES! THE GREATEST SHOW OF TIME!",
      "content": "Dragonball Z, yet messed up by English editing and translation, is the greatest and best animated cartoon in the world. Kakarot, the star, with the help of Piccolo, fight off Raditz and that starts the show. Vegita and Nappa come and after some fighting, Nappa is destroyed and Vegita leaves to rejuvinate. Gohan, Kakarot's son, and his friend Krilian, leave for the Planet Namek to find the Dragonballs, 7 magical balls which when joined can call forth the Eternal Dragon who grants any three wishes you want. Frieza, another villain, is also on Namek and so is the rejuvinated Vegita. After a mess of episodes of fighting, Kakarot finally arrives, destroys the Ginyu Force, Frieza's private army, and fights Frieza, practically destroying the Planet Namek in the process. The show continues on and on but is always great to watch."
    },
    {
      "username": "ein2021",
      "userUrl": "https://www.imdb.com/user/ur2650164",
      "reviewLink": "https://www.imdb.com/review/rw0483760",
      "warningSpoilers": false,
      "date": "23 August 2003",
      "rate": "",
      "helpful": "31 out of 40 found this helpful.",
      "title": "Weird, don't you think?",
      "content": "First of all, yes I am a big anime fan and yes Dragonball Z is my hands down favorite anime. And let me tell you I've seen quite a bit. I'm not saying it's the best show out there, it's just \"my\" favorite. But I didn't write here just to praise the show. Not that at all. Here's why I wrote. I noticed that most of the negative comments written about this series all talk about how the show's sagas are basically the same thing over and over again (and yes I know they basically are). The writers of these comments also, more often than not, talk about how they hated the show so much that they stopped watching it after two or three episodes. Here is the weird part. How could they know all the sagas are pretty much the same thing over and over again if they only watched two or three episodes? More over, if they only watched two or three episodes of a show with well over 150 episodes, they have no right to write any kind of commentary about it at all. Finally, one more point. Lets say yes they did watch more episodes. If they hated it so much, why keep watching? If it was \"that\" bad, why watch another episode? There must have been something there that cried out for them to keep watching. Something they couldn't ignore no matter how much they tried. Something that had them watching every \"crappy\" episode in every \"crappy\" saga. And lets face it, if a show has that, it can't be all bad :)"
    },
    {
      "username": "Aaron1375",
      "userUrl": "https://www.imdb.com/user/ur1111192",
      "reviewLink": "https://www.imdb.com/review/rw0483753",
      "warningSpoilers": false,
      "date": "22 April 2003",
      "rate": "",
      "helpful": "4 out of 6 found this helpful.",
      "title": "They should have stopped with this one.",
      "content": "I love this show...very fast paced and entertaining. I don't mind the English dub either, because Goku sounds a lot better in the English version than he does in the Japanese (I think he is dubbed by a gal). This show is basically one long story with five chapters...1) the Saiyans, 2) Frieza, 3) Garlic Jr., 4) Cell, and 5) Buu. Each one has its good points though Garlic is short and the weakest. The reason I say they should have ended with this one though is that I have read the plot for GT and it just doesn't sound like it belongs. This show focuses mainly on Goku as he must train and train to overcome evil in many forms. One person said there is no plot, but I disagree. I like most anime, but the plots are sometimes very confusing, this is actually one of the easier animes to follow. Though if you are a fan of the show you will notice how some of the characters from the original Dragonball are just phased out more and more as this one progresses. This one was more fighting, while DB was more comedy and GT is a combo of both."
    },
    {
      "username": "enigma43",
      "userUrl": "https://www.imdb.com/user/ur4921156",
      "reviewLink": "https://www.imdb.com/review/rw1214062",
      "warningSpoilers": false,
      "date": "12 November 2005",
      "rate": "",
      "helpful": "8 out of 11 found this helpful.",
      "title": "Should only be watched in the Japanese",
      "content": "I first saw Dragon Ball Z on the International Channel. It was entirely in Japanese with no subtitles, yet I could still get the gist of the story.When tried watching the English dub on Cartoon Network, I couldn't get over it. It was an entirely different show. The music is different, the dubbing is horrible, they cut out huge scenes practically blotting entire episodes, digitize out a lot of the blood, change a lot of the great lines, for some reason change a lot of the names, and basically change plot points.I couldn't stand it. Since then, I've gone to collecting it on DVD so I can watch the show as I am accustomed to watching, in Japanese. It's definitely not for children. It has profanity (and for some reason some of the profanity is in English some of it is your basic \"k'usos\"), nudity, blood, violence, and a lot of death (see Bejita;).I keep my kids from watching those. They can see it on Cartoon Network if they want. That's just fine. The show was definitely \"dumbed down\" for children as if should have been for a non \"Adult Swim\" show. (But don't ask me why CN never thought DBZ qualified for Adult Swim instead of \"Inuyasha.\") However, if you are an adult, and want to watch the best anime show this side of \"Akira,\" definitely watch DBZ, but ONLY in Japanese."
    },
    {
      "username": "xamtaro",
      "userUrl": "https://www.imdb.com/user/ur19392148",
      "reviewLink": "https://www.imdb.com/review/rw2112778",
      "warningSpoilers": false,
      "date": "17 August 2009",
      "rate": "4",
      "helpful": "19 out of 49 found this helpful.",
      "title": "The best anime in the world.......to only the most ignorant and unexposed",
      "content": "First there was dragonball, then came DRAGONBALL Z which showed(I don't know if it was a first run or a rerun) in my country in 2000. I was 11 going on 12 that year and having loved Dragonball, i immediately grew to like its sequel. Oh how I enjoyed the toys, the keychains, the trading cards, even my water bottle which had pictures of both young and grown up Goku. I was enthralled by the awesome action and captivated by the vast array of cool looking characters. But that was a long time ago. Watching it now, 9 years later, the series does not hold the same amount of appeal as it used to. It's a \"frog in a well\" syndrome. Apparently I only thought Dragonball Z was that great because I was never exposed to anything better. For starters, the characters I once thought were \"cool\" are still cool, but nothing else beyond that. There isn't really much character development to speak off as the stories are more focused on the plot and the characters are just pre-set anime stock characters, put in place to advance the plot from one fight to the next. There are a couple of instances where the characters get some development and really shine as being remotely likable, but those come rarely and tend to get buried under all the action.The story is split into a number of distinct \"sagas\" but each of them progress slower than a sloth/snail hybrid. The pacing drags to the point of being unbearable only to the most patient and devoted of viewers. The horrendous story progression is not helped by the fact that every episode features lengthy rambling monologues, badly timed close-up shots that linger for too long, unnecessary dialogue and other cheap amateurish tactics just to fill up 25 minutes for an episode which contains no more than 15 minutes of actual story material. What starts off as an interesting premise soon falls into a set formula that goes from unoriginal to just painfully boring. The director's decision to follow different groups of characters on different adventures was a poor one and just made the convoluted plot so much more confusing. The fights are intense, epic and would please any action junkie out there. However some exceptionally poor animation and an over usage of animation short cuts give this whole show a very cheap look even for its time.(Some of the worse episodes of G I Joe were better animated than Dragonball Z). Thankfully, it makes up for that by providing some stunning and highly detailed artwork. So many anime fans extol the fact that Dragonball Z was so influential in making anime as famous as it is and influenced a whole generation of anime and manga creators. They cite Dragonball's numerous spin-offs and products as a testament to its greatness. Guess what, Adam West's Batman was influential too but I would hardly call it a good show. A popular show does not mean a good showIn the land of the blind, the one eyed man is king. To kids who are not exposed to greater world of animated series and graphic novels, Dragonball Z would no doubt be one of the best shows around. People's minds tend to get clouded by the fact that Dragonball Z was so influential or might have been one of the first anime they ever watched(and thus introduced them to anime in general) that they remember only the good points and overlook the numerous jarring flaws of the series.Objectively speaking, Dragonball Z definitely does not deserve its current rating of 9.0/10. It is like a hot air balloon. It is beautiful to look at and even grand to behold, but look any deeper and it's just an empty basket and whole lot of nothing inside. This show has his moments like some good character progression, but nevertheless, it has too many flaws to speak of."
    },
    {
      "username": "justin-fencsak",
      "userUrl": "https://www.imdb.com/user/ur18723110",
      "reviewLink": "https://www.imdb.com/review/rw4586601",
      "warningSpoilers": false,
      "date": "16 January 2019",
      "rate": "10",
      "helpful": "1 out of 1 found this helpful.",
      "title": "The poster child for serialized anime in the late 80s early 90s...",
      "content": "If you were a millenial growing up in the mid to late 90s, you mightve seen a little known cartoon by the name of Dragon Ball Z. A sequel to the original Dragon Ball saga that debuted in the mid 80s, this successor to the manga based comic book franchise has it all...pryotechnics, stunning animation, and catchy phrases like \"This goes to 1000!!!\". Goku has become a household name among anime and casual fans that a balloon debuted at last year's thanksgiving day parade and deflated itself!!! Between the american and japanese dubs,i prefer the american version since it's easier to follow."
    },
    {
      "username": "VichusSmith",
      "userUrl": "https://www.imdb.com/user/ur0951654",
      "reviewLink": "https://www.imdb.com/review/rw0483748",
      "warningSpoilers": false,
      "date": "19 November 2002",
      "rate": "",
      "helpful": "6 out of 12 found this helpful.",
      "title": "Listen up...",
      "content": "Dragonball Z is not anything like Dragonball. If you want a faster paced story, then Dragonball is for you.If you can sit through villain after villain and ass-whipping after ass-whipping, all with supernatural powers, than you should watch Dragonball Z. A lot of hardcore anime fans diss Dragonball Z because it's so simple and there is hardly any plot after the Saiya-jin Saga.But on weekdays, when you need something fun to watch, then it's a great show. If you're into martial arts as well, then you will admire some of the hand to hand combat. I applaud Dragonball because it was (and still is) a gateway into the world of anime for newbies who haven't seen much anime in their life.I give DBZ 8/10"
    },
    {
      "username": "Baxter9289",
      "userUrl": "https://www.imdb.com/user/ur1890601",
      "reviewLink": "https://www.imdb.com/review/rw0483744",
      "warningSpoilers": false,
      "date": "20 September 2002",
      "rate": "",
      "helpful": "3 out of 5 found this helpful.",
      "title": "quality anime",
      "content": "Despite the fact that it's virtually plotless (which is a major problem in some shows, but doesn't matter here) it keeps me entertained. The fighting is absolutely great in this show, though the dub edits out all the good stuff. I've only seen the dub, but I think it's good. Dragonball Z is one of the greatest animes out there, but it's NOT THE GREATEST. All things considered I'd give it a 9.9."
    },
    {
      "username": "TheMan3051",
      "userUrl": "https://www.imdb.com/user/ur1196715",
      "reviewLink": "https://www.imdb.com/review/rw0483747",
      "warningSpoilers": false,
      "date": "6 November 2002",
      "rate": "",
      "helpful": "2 out of 4 found this helpful.",
      "title": "Dragonball Z",
      "content": "Likewise Dragonball I haven't seen the original Japanese version but the censored American version is still entertaining. I haven't seen all the Saga's yet but the ones I've seen so far have been pretty good. The show itself is pretty good but it contain one MAJOR flaw which is that it's too long. I know Saga's are supposed to be long but this is more like a soap opera then a saga. Sometimes they spend ten episodes on the same scene. It's just a little frustrating and irritating and that's perhaps why I think Dragonball is much more superior. But aside from all that DBZ is still quite entertaining sometimes and it has great storylines. Plus the fight scenes are amazing!"
    },
    {
      "username": "srgu_17",
      "userUrl": "https://www.imdb.com/user/ur11392361",
      "reviewLink": "https://www.imdb.com/review/rw1975454",
      "warningSpoilers": false,
      "date": "14 November 2008",
      "rate": "9",
      "helpful": "7 out of 11 found this helpful.",
      "title": "One word: The Best!",
      "content": "The only reason i gave it a 9 is because in some sagas like Frieza for example the graphics kind of suck and the tendency of the series to\"kill time\" like showing us the terrain and stuff which clearly is annoying,other than that the plot is awesome with minor holes, basically this is my favorite anime of all time since i was in the 6th grade!I remember back when i couldn't wait to catch an episode of DBZ only the sad part was that the only network that actually aired it in my country was RTL II,but i quickly got used to it,learned German :P and actually understood the series,and in comparison to the us version it was pretty good,the soundtrack was the original Japanese one and it didn't have to chsese lines like funimation does,in other words good ol RTL II saved me some trouble :D"
    },
    {
      "username": "AllSunday",
      "userUrl": "https://www.imdb.com/user/ur2993425",
      "reviewLink": "https://www.imdb.com/review/rw1045110",
      "warningSpoilers": false,
      "date": "22 March 2005",
      "rate": "",
      "helpful": "3 out of 5 found this helpful.",
      "title": "Over criticized but still with flaws",
      "content": "It took my years to truly appreciate the brilliance that is Dragonball Z. I wish I had overlooked my own ego years ago so I could have loved this again and again. When I was roughly 11, and still getting into the whole 'anime' scene, Dragonball Z was one of my first series. It was the English version, and I thought it was great. But by chance, I saw an episode of the original version, and never went back to the dub. The subbed is far superior, in voice acting, dialog and music. No, I am not the kind of fan to hail 'ALL DUBS ARE GARBAGE, NEVER CHANGE ANYTHING FROM THE ORIGINAL!!!', for I have the guilty pleasure of sitting down and enjoying dubs many a time, but in this situation the dub is nothing in comparison. It does succeed in being a wildly popular children's show, because that is what it was made to be for North America, not a mirror of the original.After constantly seeing the dub on TV, and all the hype surrounding it, I simply told myself it was garbage, people know nothing, and just stopped watching the series all together. I couldn't stand to look at what it had been reduced to and sought more 'intelligent' animes (Vampire Hunter D, Hellsing, Fushigi Yuugi, Escaflowne, Akira). There were many other fans like me at that time reviewing Dragonball Z on IMDb, and to you I say, get off your high horses. Dragonball Z is pure entertainment.Just look at the fact that such manga creators like Eiichirô Oda (One Piece), Masashi Kishimoto (Naruto), Kouta Hirano (Hellsing), Taito Kubo (Bleach), Shin'ya Suzuki (Mr. Fullswing), Kôshi Rik(u)dô (Excel Saga), and Kentarô Yabuki (Black Cat) were all genius creators on there own, and all admitted to being influenced by Dragonball. I think it's hilarious that even the 'master creators' can take the time to appreciate Toriyama's work.I'm sick of seeing so many stuck-up anime fans regard shows like Pokemon, Digimon, Dragonball Z, Yu-Gi-Oh, etc (despite in truth, some of those shows aren't very good no matter what version you're watching) because they don't showcase the utter brilliance and beautiful animation of the likes of lets say, Miyazaki. Miyazaki's works and Toriyama's works are completely different, plain and simple, but they're amazing in there own ways. The best thing about Dragonball Z is it's characters. Everyone of them in there own little world that sucks you in and makes you care. The universe Toriyama created alone is great and wildly original. These different races and different values are alone allow some praise to the show. The music and voice acting (props to Ryo Harikawa and Masako Nozawa) really set a good tone to whatever scene they're in, and almost makes up for the plot lag.Almost. The biggest problem the world has with Dragonball Z is it's plot and pacing, and no. It's not plot less, and people who would go as far to say that are exaggerating. Dragonball Z has a pretty good plot, it just drags and drags and drags it as far as it can, making the series last so long, and scenes go unbearably slow. If you watch an episode, notice how many times the animators bring you shots of them staring/breathing/pointless setting/random face reactions. That is the biggest flaw of the show.If you can overlook the lag, and the obnoxious hardcore 'I'm-too-good-for-this' otaku's, and truly appreciate this world that Akira Toriyama has created, then it's your treat. Truly one of the best Animes/Mangas ever created 8/10"
    },
    {
      "username": "SuperVegitoLover",
      "userUrl": "https://www.imdb.com/user/ur3942267",
      "reviewLink": "https://www.imdb.com/review/rw0483764",
      "warningSpoilers": false,
      "date": "12 September 2004",
      "rate": "",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Better than Yu Yu Hakusho",
      "content": "The reason why DBZ is so long because the manga lasted 11 years. The anime writers had to make fillers because sometime they were catching up to the manga story. So they had to give the manga writer some breathing. I also recall the character in YYH had to train before or during the battles. YYH characters are not all that interesting while some of DBZ like Vegeta, Piccolo, Gohan Trunks and Goku are more interesting then the entire cast of YYH. At lest Goku has lost some battles in both series while Yuske has yet to lost. How lame is that? And don't get me started on the music from YYH.Eh, I don't know. I liked the Buu saga. Not because of its story, which was the most ridiculous of the three, but because it had some of the coolest battles in the show. I also love the furious game of one-ups that goes on between Buu and the good guys (Goku goes SSJ3, then has to leave. Then Gotenks arrives, but Buu becomes Super Buu. Gotenks goes SSJ3, but then diffuses, but is saved by Gohan who kicks the crap out of Buu. Buu counters by absorbing Gotenks and Piccolo, then Goku comes to fuse with Gohan, but Buu absorbs him, so Goku finally fuses with Vegeta, but Buu absorbs them, but then they rescue the others from inside his body, but then he becomes Kid Buu, etc etc etc). One side keeps topping the other throughout the whole saga, which left me on the edge of my seat when I first saw it. I don't really see why they had to make GT though. I guess because the fans wanted to see what it was like for the Z squad when they grew up, but if you ask me, the Buu saga took care of that pretty nicely."
    },
    {
      "username": "18Buddha",
      "userUrl": "https://www.imdb.com/user/ur87524412",
      "reviewLink": "https://www.imdb.com/review/rw7322124",
      "warningSpoilers": false,
      "date": "8 September 2021",
      "rate": "10",
      "helpful": "2 out of 6 found this helpful.",
      "title": "Best Anime ever!",
      "content": "Theirs not much to say since everyone by now has watched DBZ but if you havent & you're reading this review from the future then please give it a chance! It has impacted lives across the world, kids imaginations, society, cultural impact definitely!It has Action, it has amazing storyline, it has graphics ahead of its time, it has cool transformations and crazy visual Effects For their power moves.Need i say more? Check it out now!"
    },
    {
      "username": "Crunkenstein",
      "userUrl": "https://www.imdb.com/user/ur0104930",
      "reviewLink": "https://www.imdb.com/review/rw0483722",
      "warningSpoilers": false,
      "date": "8 January 1999",
      "rate": "",
      "helpful": "2 out of 3 found this helpful.",
      "title": "AWESOME SHOW! (yet destroyed in the English dub)",
      "content": "DragonBall Z is a classic anime from Akira Toriyama, also the creator of \"Doctor Slump\" and \"Dragonball\". The show centers around seven mystic yellow balls, and when you put them together, you summon the Eternal Dragon; he will grant you one wish. The major character is Son Goku (voiced by Masako Nozawa), who is a man with incredible powers (actually from another planet). His companions include his son, Son Gohan (also voiced by Masako Nozawa), Piccolo, who is a demon (voiced by Toshiro Furugawa), and Krillin (a buddhist monk with no nose and six little strange-colored ball-shaped blotches on his forehead, voiced by Mayumi Tanaka). Let's not forget Bulma, the technological genius (voiced by Hiromi Tsuru), or Vegeta (first evil then good, voiced by Ryo Horikawa). More people join later, such as Trunks. The US Dubbed version has a TON of cuts in it. From as little things as getting punched in the face to INCREDIBLY stupid vocabulary. The original had expletives everywhere, to emphasize the situation. The English version uses such pathetic words as \"jerk\" and \"bully\". It's a classic show, but the places where you can buy the original Japanese with subtitles, I have NO idea."
    },
    {
      "username": "TheTransfan",
      "userUrl": "https://www.imdb.com/user/ur0159061",
      "reviewLink": "https://www.imdb.com/review/rw0483728",
      "warningSpoilers": false,
      "date": "20 July 2000",
      "rate": "",
      "helpful": "1 out of 2 found this helpful.",
      "title": "Perhaps the greatest ANIME in existence.",
      "content": "This show's so awesome and everything about it is excellent! The characters, plotline, and animation were all well executed. I especially like Krillen! My only complaint is that some episodes tend to \"Drag-On\" (which the series earned its often-used nickname, \"Drag On Ball Z\") but sometimes, it adds to the tension. I can't understand people who think the dub destroyed the show. I'd rather watch it dubbed than subtitled. Who'd wanna look down at the screen to see the letters?! I'd rather watch the characters talk and the tension."
    },
    {
      "username": "jonny_",
      "userUrl": "https://www.imdb.com/user/ur58377665",
      "reviewLink": "https://www.imdb.com/review/rw4899945",
      "warningSpoilers": false,
      "date": "30 May 2019",
      "rate": "10",
      "helpful": "1 out of 2 found this helpful.",
      "title": "The Best Long Running Anime.",
      "content": "For a lot of us this show was a staple of many of our childhood years, it's hard not to look at it through rose tinted glasses and feel overwhelming nostalgia. Of course it has flaws, but there is no film or tv series that doesn't. I could easily talk for hours about why this show is so great, but it will always boil down to the characters. The show is a big commitment DBZ on it's own is pushing almost 300 episodes which i'm sure is a downside for people looking at it, but it's also a huge strength of the show. You can see the progression of the characters and they aren't like other animated shows, they completely change and they grow up. They all have strengths and flaws, they aren't all perfect and they aren't invincible.The show sets a good pace, it is split into sagas which has a combination of fast pace action and has a mix of slower paced filler which has become infamous. The filler episodes are usually the go to criticism for many, but in the bigger picture it was necessary in keeping the show true to the source material in terms of it's main storylines. It divides opinion but a lot of the filler adds to show and gives you a break and a bit of a wind down from all of the action as well as some extra insight into the characters. It's easy to follow but there is a lot to the show as well and there's always something new to notice. I'm fast approaching 30 years old and I can still watch this show and not be bored with it which is another benefit of the length of the show."
    },
    {
      "username": "novis",
      "userUrl": "https://www.imdb.com/user/ur1840747",
      "reviewLink": "https://www.imdb.com/review/rw0483746",
      "warningSpoilers": false,
      "date": "27 October 2002",
      "rate": "",
      "helpful": "4 out of 6 found this helpful.",
      "title": "The Best Anime Series, Toriyama = genius",
      "content": "It always amuses me to read the comments section of each movie/TV show. The people who view classic series/movies such as this as negative obviously didn't really watch it. If you don't dedicate yourself to watch an entire saga, you won't grasp the full concept of the show. It is a continuous series and it's quite apparent other members don't understand the meaning.Anyway, it is a kid show in Japan, but realize a kid show in Japan has violence, nudity, and profanity. I admit the FUNimation version isn't as great as the original Japanese, but it is still a great anime series, easily one of the best.If you're new to the show, watch it from the very beginning to understand. You don't need to see Dragonball to appreciate this series because they do constant flashbacks.Highest recommendation...10/10."
    },
    {
      "username": "Ericho",
      "userUrl": "https://www.imdb.com/user/ur1358424",
      "reviewLink": "https://www.imdb.com/review/rw0483755",
      "warningSpoilers": false,
      "date": "16 May 2003",
      "rate": "",
      "helpful": "1 out of 2 found this helpful.",
      "title": "Surprisly good show",
      "content": "Now, when I first saw this show advertised on Cartoon Network, I was like, \"This is so stupid\". But I really forgave the show, and after I started becoming more involved and learning about the plot, I have come to the conclusion that this is an enjoyable show. The thing is, in order to like it, you need to learn to accept the \"alternate-world\" to enjoy it. And yes, a lot of people are right. The fights last for many episodes, and the villians never seem to die, and such. But there's so many complex characters all with different backgrounds and personalites, that you kind of forget it. I mean, if you want to see an anime with repetiveness and confusion, see that dang \"Yu-Gi-Oh!\".With the arrogance of Vegeta, the smart-aleckyness of Trunks and Goten, and the funny child-like character of Mr. Buu/Fat Buu, it's quite enjoyable. The villians are cool, and it's nice when they find a villian that's really so evil they're entertaining.(especially Babidi, he's such a wicked little troll^_^?) Although I was wondering how many times they would have Vegeta become GOOD before he actually BECAME GOOD, he is indeed one of the finest characters. I'm glad they did alot with him, though I wished they'd do more, such as tell how he married Bulma. Anyway, try to catch it. \"Dragonball GT\" sounds stupid, but I'll have to watch it sometime. An 8/10."
    }
  ],
  "errorMessage": ""
}