{
  "imDbId": "tt0121220",
  "title": "Dragon Ball Z",
  "fullTitle": "Dragon Ball Z (TV Series 1989–1996)",
  "type": "TVSeries",
  "year": "1989",
  "language": "en",
  "titleInLanguage": "Dragon Ball Z",
  "url": "https://en.wikipedia.org/wiki/Dragon_Ball_Z",
  "plotShort": {
    "plainText": "Dragon Ball Z is a Japanese anime television series produced by Toei Animation. Part of the Dragon Ball media franchise, it is the sequel to the 1986 Dragon Ball anime series and adapts the latter 325 chapters of the original Dragon Ball manga series created by Akira Toriyama. The series aired in Japan on Fuji TV from April 1989 to January 1996 and was later dubbed for broadcast in at least 81 countries worldwide.\r\nDragon Ball Z continues the adventures of Goku in his adult life as he and his companions defend the Earth against villains including aliens (Vegeta, Frieza), androids (Cell), and magical creatures (Majin Buu). At the same time, the story parallels the life of his son, Gohan, as well as the development of his rivals, Piccolo and Vegeta.\r\nDue to the success of the anime in the United States, the manga chapters making up its story were initially released by Viz Media under the Dragon Ball Z title. The anime's popularity has also spawned numerous media and merchandise that has come to represent the majority of content within the Dragon Ball franchise. Dragon Ball Z remains a cultural icon through numerous adaptations and re-releases, including a remastered broadcast titled Dragon Ball Z Kai.\r\nDragon Ball Z has since been followed by two sequel series: Dragon Ball GT (1996–1997) and Dragon Ball Super (2015–2018).",
    "html": "<p>Dragon Ball Z is a Japanese anime television series produced by Toei Animation. Part of the Dragon Ball media franchise, it is the sequel to the 1986 Dragon Ball anime series and adapts the latter 325 chapters of the original Dragon Ball manga series created by Akira Toriyama. The series aired in Japan on Fuji TV from April 1989 to January 1996 and was later dubbed for broadcast in at least 81 countries worldwide.</p><p>Dragon Ball Z continues the adventures of Goku in his adult life as he and his companions defend the Earth against villains including aliens (Vegeta, Frieza), androids (Cell), and magical creatures (Majin Buu). At the same time, the story parallels the life of his son, Gohan, as well as the development of his rivals, Piccolo and Vegeta.</p><p>Due to the success of the anime in the United States, the manga chapters making up its story were initially released by Viz Media under the Dragon Ball Z title. The anime's popularity has also spawned numerous media and merchandise that has come to represent the majority of content within the Dragon Ball franchise. Dragon Ball Z remains a cultural icon through numerous adaptations and re-releases, including a remastered broadcast titled Dragon Ball Z Kai.</p><p>Dragon Ball Z has since been followed by two sequel series: Dragon Ball GT (1996–1997) and Dragon Ball Super (2015–2018).</p>"
  },
  "plotFull": {
    "plainText": "Dragon Ball Z is a Japanese anime television series produced by Toei Animation. Part of the Dragon Ball media franchise, it is the sequel to the 1986 Dragon Ball anime series and adapts the latter 325 chapters of the original Dragon Ball manga series created by Akira Toriyama. The series aired in Japan on Fuji TV from April 1989 to January 1996 and was later dubbed for broadcast in at least 81 countries worldwide.\r\nDragon Ball Z continues the adventures of Goku in his adult life as he and his companions defend the Earth against villains including aliens (Vegeta, Frieza), androids (Cell), and magical creatures (Majin Buu). At the same time, the story parallels the life of his son, Gohan, as well as the development of his rivals, Piccolo and Vegeta.\r\nDue to the success of the anime in the United States, the manga chapters making up its story were initially released by Viz Media under the Dragon Ball Z title. The anime's popularity has also spawned numerous media and merchandise that has come to represent the majority of content within the Dragon Ball franchise. Dragon Ball Z remains a cultural icon through numerous adaptations and re-releases, including a remastered broadcast titled Dragon Ball Z Kai.\r\nDragon Ball Z has since been followed by two sequel series: Dragon Ball GT (1996–1997) and Dragon Ball Super (2015–2018).\r\nPlot summary\r\nSaiyan Saga\r\nDragon Ball Z picks up five years after the end of the Dragon Ball anime, with Goku now a young adult and father to his son, Gohan.\r\nA humanoid alien named Raditz arrives on Earth in a spacecraft and tracks down Goku, revealing to him that he is his long-lost older brother and that they are members of a near-extinct alien warrior race called the Saiyans (サイヤ人, Saiya-jin). The Saiyans had sent Goku (originally named Kakarot (カカロット, Kakarotto)) to Earth as an infant to conquer the planet for them, but he suffered a severe blow to the head shortly after his arrival and lost all memory of his mission, as well as his blood-thirsty Saiyan nature.\r\nRaditz along with two elites, Vegeta and Nappa, are the only remaining Saiyan warriors, so Raditz comes to enlist Goku's help in conquering frontier worlds. When Goku refuses to join them, Raditz takes Goku and Krillin down with one strike, kidnaps Gohan, and threatens to murder him if Goku does not kill 100 humans within the next 24 hours. Goku decides to team up with his arch-enemy Piccolo, who was also defeated by Raditz in an earlier encounter, to defeat him and save his son. During the battle, Gohan's rage momentarily makes him stronger than Piccolo and Goku as he attacks Raditz to protect his father. The battle ends with Goku restraining Raditz so that Piccolo can hit them with a deadly move called Special Beam Cannon (魔貫光殺砲, Makankōsappō, lit. \"Demon Penetrating, Killing Ray Gun\"), mortally wounding them both, and kills them after a short while. But before Raditz succumbs to his injuries, he reveals to Piccolo that the other two Saiyans are much stronger than him and will come for the Dragon Balls in one year.\r\nHaving witnessed Gohan's latent potential, Piccolo takes him into the wilderness to train for the upcoming battle against the Saiyan Elites. In the afterlife, Goku travels the million-kilometer Snake Way so that he can train under the ruler of the North Galaxy, King Kai. King Kai teaches him the Kaio-ken (界王拳, Kaiōken, lit. \"Fist of Kings of Worlds\") and the Spirit Bomb (元気玉, Genki Dama, lit. \"Energy Sphere\") techniques. Despite his gruff nature, Piccolo grows fond of Gohan while he oversees him learning to fend for himself. This forges an unlikely emotional bond between the two.\r\nAfter a year, Goku is revived with the Dragon Balls, but King Kai panics as he realizes that Goku will have to take Snake Way again to get back and will not make it until hours after the Saiyans arrive. Goku's allies group up to fight until Goku gets back, but prove to be no match for Nappa and the \"Prince of All Saiyans\", Vegeta. Yamcha, Tien Shinhan, Chiaotzu and Piccolo all perish in the battle, with Piccolo's death causing both Kami and the Dragon Balls to fade from existence. When Goku finally arrives at the battlefield, he avenges his fallen friends by easily defeating Nappa before crippling him by breaking his spine in half. A furious Vegeta then executes Nappa for his failure to kill Goku.\r\nGoku uses several grades of the Kaio-ken to win the first clash with Vegeta, which concludes with a climactic ki beam struggle, but it comes at a great cost to his body. Vegeta comes back and creates an artificial moon to transform into a Great Ape, which he uses to torture Goku. Krillin and Gohan sense that Goku is in trouble, and they return for a group fight with the now-seemingly unstoppable Vegeta. They are aided at key moments by Yajirobe, who cuts Vegeta's tail to revert him into his normal state. Goku gives Krillin a Spirit Bomb that he made, and Krillin uses it to severely damage Vegeta. Vegeta is ultimately defeated when he is crushed by Gohan's Great Ape form, and he retreats to his spaceship as Krillin approaches to finish him off. Goku convinces Krillin to spare Vegeta's life and allow him to escape Earth, with Vegeta vowing to return and destroy the planet in revenge for his humiliation at Goku's hands.\r\nFrieza Saga\r\nDuring the battle, Krillin overhears Vegeta mentioning the original set of Dragon Balls from Piccolo's homeworld, Namek (ナメック星, Namekku-sei). While Goku recovers from his injuries, Gohan, Krillin, and Goku's oldest friend Bulma depart for Namek to use these Dragon Balls to revive their fallen friends in the battle.\r\nUpon their arrival on Namek, Krillin, Gohan, and Bulma discover that Vegeta and his superior, the galactic tyrant Frieza, are already there, each looking to use the Dragon Balls to obtain immortality. Vegeta is stronger than before, as Saiyans become stronger when they recover from the brink of death, so he seizes the opportunity to rebel against Frieza. A triangular game of cat-and-mouse ensues, with Frieza, Vegeta, and Gohan plus Krillin alternately possessing one or more of the Dragon Balls, with no one managing to possess all seven at any given time.\r\nVegeta manages to isolate Frieza's lieutenants one by one and kill them. When Frieza sees that Vegeta is posing too big of a problem, he summons the Ginyu Force, a team of elite mercenaries led by Captain Ginyu, who can switch bodies with his opponents. Vegeta reluctantly teams up with Gohan and Krillin to fight them, knowing that they are too much for him to handle alone. The Ginyu Force proves too powerful, but Goku finally arrives and defeats them single-handedly, saving Vegeta, Gohan, and Krillin. Vegeta believes Goku may have become the legendary warrior of the Saiyans, the Super Saiyan (超(スーパー)サイヤ人, Sūpā Saiya-jin). As Goku heals from a brutal fight with Captain Ginyu, Krillin, Dende, and Gohan secretly use the Dragon Balls behind Vegeta's back to wish for Piccolo's resurrection and teleport him to Namek. Vegeta finds them using the Dragon Balls without him, but the Grand Elder dies and rendering the Dragon Balls inert before he can wish for immortality. Just as this happens, Frieza arrives and decides to kill the four of them for denying him his wish for immortality.\r\nPiccolo arrives on Namek but is accidentally separated from the others due to a badly-worded wish. He finds the strongest Namekian warrior, Nail, who was defeated by Frieza and fuses with him to greatly increase his power.\r\nDespite both Piccolo and Vegeta's advances in power, they are greatly outclassed by Frieza, who goes through several transformations before reaching his final form, which he then uses to kill Dende.\r\nGoku arrives after healing from his injuries, and Vegeta tells him that Frieza was the one who destroyed the Saiyan homeworld and massacred the Saiyan race, as he feared that he would one day be overthrown by a Super Saiyan. Frieza then kills Vegeta in front of Goku.\r\nThough Goku's power exceeds Vegeta's, he is still no match for Frieza. Goku uses his last resort, a massive Spirit Bomb with the energy of Namek and the surrounding worlds, and it seemingly defeats the tyrant. However, Frieza manages to survive, and he unleashes his wrath upon the group by gravely wounding Piccolo and murdering Krillin. Goku's rage finally erupts, and he undergoes a strange transformation that turns his hair blond, his eyes green, and causes a golden aura to radiate from his body. Goku has finally become a Super Saiyan.\r\nMeanwhile, the revived Kami uses Earth's Dragon Balls to resurrect everyone on Namek that was killed by Frieza and his henchmen, which also allows the Grand Elder to be resurrected for a short time, and the Namekian Dragon to return. Dende uses the final wish to teleport everyone on Namek to Earth except for Goku and Frieza.\r\nEven at 100% power, Frieza proves to be no match for the Super Saiyan transformation, and Goku defeats the evil tyrant before escaping Namek as the planet is destroyed in a massive explosion.\r\nGarlic Jr. Saga\r\nAfter the battle with Frieza, Goku's friends and family are waiting for word on his return when a demonic star drifts into Earth's orbit and opens up a rift in space, allowing the malevolent immortal Garlic Jr. to break free from his imprisonment inside the Dead Zone. Seeking revenge for a past defeat at the hands of Goku and Piccolo, Garlic Jr. traps Kami and Mr. Popo inside a bottle and uses his Black Water Mist to turn all of Earth's inhabitants into bloodthirsty, vampire-like beings. Gohan, Krillin, Piccolo, Krillin's then-girlfriend Maron, and Gohan's pet dragon Icarus are the only ones unaffected and set out to stop Garlic Jr. and restore the Earth and its inhabitants. This proves to be easier said than done, as Garlic Jr. has complete immortality, making him impossible to kill. Luckily, Gohan's hidden potential gives him the edge he needs to eradicate Garlic Jr.'s forces and send him back into the Dead Zone. He also destroys the star, ensuring that Garlic Jr. will remain trapped in the Dead Zone for all eternity.\r\nAndroids Saga\r\nOne year later, Frieza is revealed to have survived and arrives on Earth with his father, King Cold, seeking revenge. However, a mysterious young man named Trunks appears, transforms into a Super Saiyan, and kills Frieza and King Cold. Goku returns a few hours later, having spent the past year on the alien planet Yardrat learning a new technique: Instant Transmission, which allows him to teleport to any location he desires. Trunks reveals privately to Goku that he is the son of Vegeta and Bulma, and has traveled from 17 years in the future to warn Goku that two Androids (人造人間, Jinzōningen, lit. \"Artificial Humans\") created by Dr. Gero will appear in three years to seek revenge against Goku for destroying the Red Ribbon Army when he was a child. Trunks says all of Goku's friends will fall to them - while Goku himself will die from a heart virus six months before their arrival.\r\nTrunks gives Goku medicine from the future that will save him from the heart virus and departs back to his own time. When the androids arrive, Goku falls ill during his fight with Android 19 but is saved by Vegeta, who reveals that he has also achieved the Super Saiyan transformation. Vegeta and Piccolo easily defeat Android 19 and Dr. Gero (who turned himself into \"Android 20\"), but Trunks returns from the future to check on their progress and reveals that the androids they defeated are not the ones that killed all of them in the future.\r\nGoku is out of commission and his allies are overwhelmed by the arrival of Androids 16, 17 and 18, while an even stronger bio-Android called Cell emerges from a different timeline and embarks on a quest to find and absorb Androids 17 and 18, which will allow him to attain his \"perfect form\".\r\nCell successfully absorbs Android 17, becoming considerably more powerful, but Vegeta returns to the battle, having greatly elevated his power, and easily overpowers him. However, Vegeta allows Cell to absorb Android 18, believing that his \"perfect form\" will be no match for his Super Saiyan power. Vegeta is subsequently defeated, with Cell sarcastically thanking him for helping him achieve perfection.\r\nCell allows everyone to live for the time being and announces his fighting tournament to decide the fate of the Earth, known as the \"Cell Games\". Goku, recovered from the heart virus and having reached the zenith of the Super Saiyan form, takes on Cell at the tournament. Goku eventually realizes that Cell is far too powerful for him to handle, and forfeits the fight to the astonishment of everyone else. Goku proclaims that Gohan will be able to defeat Cell. Though initially outclassed, Gohan is eventually able to tap into his latent power and achieve the Super Saiyan 2 transformation after Android 16 sacrifices himself in a failed attempt to kill Cell. Refusing to accept defeat, Cell prepares to self-destruct and destroy the Earth.\r\nGoku uses his Instant Transmission ability to teleport himself and Cell to King Kai's planet, where Cell explodes and kills everyone there. However, Cell survives the blast and returns to Earth more powerful than ever, where he promptly murders Trunks, but Gohan unleashes the totality of his power in a massive Kamehameha wave and obliterates Cell for good.\r\nThe Dragon Balls are then used to revive everyone that was killed by Cell, while Goku chooses to remain in the afterlife, refusing an offer by his friends to use the Namekian Dragon Balls to bring him back. Trunks returns to his timeline and uses his bolstered power to finally slay the Future Androids and Cell.\r\nMajin Buu Saga\r\nSeven years later, Goku is allowed to go back to Earth for one day to reunite with his loved ones and meet his youngest son, Goten, at the World Martial Arts Tournament (天下一武道会, Tenkaichi Budōkai, \"Strongest Under the Heavens Martial Arts Tournament\"). Soon after, Goku and his allies are drawn into a fight by the Supreme Kai against a magical being named Majin Buu (魔人ブウ, ”Demon Person Buu”) summoned by the evil wizard Babidi. All efforts of preventing the resurrection prove to be futile as Buu is successfully revived, resulting in Vegeta, who had willingly joined forces with Babidi so he could surpass Goku, committing suicide in a failed attempt to kill Buu. Goten and Trunks are taught the fusion technique by Goku, while Gohan is trained by the Supreme Kai to unlock his latent potential. Meanwhile, Buu befriends Mr. Satan and vows to never kill anyone ever again, but is interrupted when a deranged gunman shoots and nearly kills Mr. Satan. As a result, Majin Buu becomes so angry that he expels the evil within himself, creating an evil Buu that proceeds to absorb the good Buu. The result is Super Buu, a psychopathic monster who wants nothing more than the destruction of the universe. After numerous battles that result in the deaths of many of Goku's allies as well as the destruction of Earth, Goku (whose life is fully restored by the Elder Supreme Kai) defeats Kid Buu (the original and most dangerous form of Majin Buu) with a Spirit Bomb attack containing the energy of all the inhabitants of Earth, who were resurrected along with the planet by the Namekian Dragon Balls. Goku makes a wish for Kid Buu to be reincarnated as a good person and, ten years later at another Tenkaichi Budōkai, he meets Kid Buu's human reincarnation, Uub. Leaving the match between them unfinished, Goku departs with Uub so he can train him to become Earth's new defender.\r\nProduction and broadcasting\r\nKazuhiko Torishima, Akira Toriyama's editor for Dr. Slump and the first half of Dragon Ball, felt that the Dragon Ball anime's ratings were gradually declining because it had the same producer that worked on Dr. Slump. Torishima said this producer had this \"cute and funny\" image connected to Toriyama's work and was missing the more serious tone in the newer series, and therefore asked the studio to change the producer. Impressed with their work on Saint Seiya, he asked its director Kōzō Morishita and writer Takao Koyama to help \"reboot\" Dragon Ball, which coincided with Goku growing up. The new producer explained that ending the first anime and creating a new one would result in more promotional money, and the result was the start of Dragon Ball Z. The title was suggested by Toriyama because Z is the last letter of the alphabet and he wanted to finish the series because he was running out of ideas for it. Ironically enough, the sequel series would end up producing more episodes than its predecessor.\r\nDragon Ball Z is adapted from the final 324 chapters of the manga series which were published in Weekly Shōnen Jump from 1988 to 1995. It premiered in Japan on Fuji Television on April 26, 1989, taking over its predecessor's time slot, and ran for 291 episodes until its conclusion on January 31, 1996. Because Toriyama was writing the manga during the production of the anime, Dragon Ball Z added original material not adapted from the manga, including lengthening scenes or adding new ones, and adding new attacks and characters not present in the manga. For example, Toriyama was asked to create an additional character for Goku's training with King Kai, resulting in the cricket Gregory.\r\nThroughout the production, the voice actors were tasked with playing different characters and performing their lines on cue, switching between roles as necessary. The voice actors were unable to record the lines separately because of the close dialogue timing. When asked if juggling the different voices of Goku, Gohan and Goten were difficult, Masako Nozawa said that it was not and that she was able to switch roles simply upon seeing the character's picture. She did admit that when they were producing two films a year and television specials in addition to the regular series, there were times when they had only line art to look at while recording, which made giving finer nuanced details in her performance difficult.\r\nOne of the character designers for Dragon Ball Z was Tadayoshi Yamamuro. He was responsible for designing and animating Goku's Super Saiyan form in the series. He used the martial artist Bruce Lee as a reference for Goku's Super Saiyan form, stating that, when he \"first becomes a Super Saiyan, his slanting pose with that scowling look in his eyes is all Bruce Lee.\" In the original manga itself, Goku's piercing eyes in Super Saiyan form were also based on Bruce Lee's paralyzing glare.\r\nSeries Director Daisuke Nishio left the series after personally directing Episode #202. Nishio left the series to become series director of Aoki Densetsu Shoot!. The role of series director was not officially filled for Episodes #200-291, despite Nishio's directing of Episode #202.\r\nEnglish dub production and broadcasting\r\nIn 1996, Funimation Productions (now known as Crunchyroll, LLC) licensed Dragon Ball Z for an English-language release in North America, after cancelling their initial dub of Dragon Ball half-way through their originally-planned 26-episode first season. Funimation's 1996 release was not the first broadcast in the United States, as some networks had already aired versions of the series in other languages on a smaller scale. This included Nippon Golden Network's broadcast of a subtitled Japanese version in Hawaii from 1994. Funimation worked with Saban Entertainment to syndicate the series on television, and Pioneer Entertainment to handle home video distribution. A Vancouver-based cast recording at the Ocean Studios were hired by Funimation to dub the anime (Funimation had previously used a similar Vancouver-based voice cast in their initial Dragon Ball dub, recorded at Dick & Roger's Sound Studio). Contract musicians for Saban, Ron Wasserman and Jeremy Sweet, known for their work on the Power Rangers franchise, composed a new guitar-driven background score and theme song (nicknamed \"Rock the Dragon\"). Funimation's initial English dub of Dragon Ball Z had mandated cuts to content and length, which reduced the first 67 episodes into 53 (though TV episode 53 actually ends half-way through uncut episode 67). Most of the edits were done to make the anime more tame and kid-friendly, most notably having references to death sidestepped with phrases like \"sent to the next dimension\". It premiered in the United States on September 13, 1996, in first-run syndication, but halted production in 1998 after two seasons despite strong ratings. This was due to Saban scaling down its syndication operations, in order to focus on producing original material for the Fox Kids Network and its newly acquired Fox Family Channel. Pioneer also ceased its home video release of the series at volume 17 (the end of the dub) and retained the rights to produce an uncut subtitled version, but did not do so. They did, however, release uncut dubs of the first three Z movies on home video.\r\nOn August 31, 1998, re-runs of this canceled dub began airing on Cartoon Network as part of the channel's weekday afternoon Toonami block. Cartoon Network eventually ordered more episodes of Dragon Ball Z, and Funimation resumed production on the series' English dub without Saban's assistance. However, they also replaced the original Vancouver-based cast with an in-house voice cast at their Texas-based studio, with the goal of the new voices sounding similar to the Vancouver cast. The Saban-produced soundtrack from the first two seasons was replaced with a new background score composed by Bruce Faulconer and his team of musicians, which was used throughout the rest of Funimation's Dragon Ball Z dub. This renewed dub featured less censorship due to both Saban's absence and fewer restrictions on cable programming, and aired new episodes on Cartoon Network's Toonami block from September 13, 1999, to April 7, 2003 (continuing in re-runs through 2008). Kids' WB briefly ran Dragon Ball Z in 2001 on its short-lived Toonami block.\r\nIn 2005, Funimation began to re-dub episodes 1–67 with their in-house voice cast, including content originally cut from their dub with Saban. This dub's background score was composed by Nathan M. Johnson (Funimation had ceased working with Faulconer Productions after the final episode of Dragon Ball Z in 2003). Funimation's new uncut dub of these episodes aired on Cartoon Network beginning in June 2005. Funimation's later remastered DVDs of the series saw them redub portions of the dialogue, mostly after episode 67, and had the option to play the entire series' dub with both the American and Japanese background music.\r\nIn January 2011, Funimation and Toei announced that they would stream Dragon Ball Z within 30 minutes before their simulcast of One Piece.\r\nThe Funimation dubbed episodes also aired in Canada, Ireland, the United Kingdom, the Netherlands, Belgium, Australia, and New Zealand. However, beginning with episode 108 (123 uncut), Westwood Media (in association with Ocean Studios) produced an alternate English dub, distributed to Europe by AB Groupe. The alternate dub was created for broadcast in the UK, the Netherlands and Ireland, although it also aired in Canada beginning from episode 168 (183 uncut) to fulfill Canadian content requirements. Funimation's in-house dub continued to air in the U.S., Australia, and New Zealand. The Westwood Media production used the same voice cast from the original 53-episode dub produced by Funimation, it featured an alternate soundtrack by Tom Keenlyside and John Mitchell, though most of this score was pieces Ocean reused from other productions Keenlyside and Mitchell had scored for them, and it used the same scripts and video master as the TV edit of Funimation's in-house dub. The Westwood Media dub never received a home video release. In Australia, Dragon Ball Z was broadcast by the free-to-air commercial network, Network Ten during morning children's programming, Cheez TV, originally using the censored Funimation/Saban dub before switching to Funimation's in-house dub. Dragon Ball Z originally aired on the British Comedy Network in Fall 1998.\r\nThe series was also available on the Funimation video streaming service (formerly FunimationNOW) upon its launch in 2016. In March 2022, Dragon Ball Z is now on Crunchyroll, a service that Funimation acquired a year before which in turn was acquired in 2018 by its current parent company Sony Pictures Television.\r\nDragon Ball Z Kai\r\nIn February 2009, Toei Animation announced that it would begin broadcasting a revised version of Dragon Ball Z as part of the series's 20th anniversary celebrations. The series premiered on Fuji TV in Japan on April 5, 2009, under the title Dragon Ball Kai. The ending suffix Kai (改「かい」) in the name means \"updated\" or \"altered\" and reflects the improvements and corrections of the original work. The original footage was remastered for HDTV, featuring updated opening and ending sequences, new music, and a re-recording of the vocal tracks. The original material and any damaged frames were removed, along with the majority of the filler episodes to more closely follow the manga, resulting in a faster-moving story. Torishima later explained the origins of Kai: Bandai was having a hard time increasing their sales and asked if a new Dragon Ball anime could be made, but Toriyama refused to create a new story. Realizing that the anime-exclusive scenes that were added to increase the distance between the original anime and the manga hurt the pacing of the series, Torishima thought of cutting them so that it faithfully followed the manga. He said the reception to Kai was positive, \"so it all worked out\".\r\nThe series initially concluded on its 97th episode in Japan on March 27, 2011, with the finale of the Cell saga. It was originally planned to run 98 episodes; however, due to the Tōhoku offshore earthquake and tsunami, the final episode was not aired and was later released direct-to-video in Japan on August 2, 2011.\r\nIn November 2012, Mayumi Tanaka, the Japanese voice actor of Krillin announced that she and the rest of the cast were recording more episodes of Dragon Ball Kai. In February 2014, the Kai adaptation of the Majin Buu saga was officially confirmed. The new run of the series, which is titled Dragon Ball Z Kai: The Final Chapters internationally, began airing in Japan on Fuji TV on April 6, 2014 and ended its run on June 28, 2015. The final arc of Kai was originally produced to last 69 episodes (as most of the international versions run), but the Japanese broadcast cut it down to 61 episodes.\r\nEnglish dub production and broadcasting\r\nFunimation licensed Kai for an English-language release in February 2010. The series was initially broadcast in the U.S. on Nicktoons from May 24, 2010, to January 1, 2012, continuing in re-runs until April 2013. In addition to Nicktoons, the series also began airing on the 4Kids-owned Saturday morning programming block Toonzai on The CW in August 2010, then on its successor, the Saban-owned Vortexx, beginning in August 2012 until the block ended in September 2014. Both the Nicktoons and CW airings were edited for content. Kai began airing uncut on Adult Swim's Toonami block on November 8, 2014, and re-runs of the previous weeks' episodes aired at the beginning of Adult Swim from February 2015 to June 2016. In the United Kingdom, CSC Media Group acquired the broadcast rights to Kai and began airing it on Kix! in early 2013.\r\nDespite Kai's continuation not being officially confirmed at the time even in Japan, Funimation voice actors Sean Schemmel (Goku) and Kyle Hebert (Gohan), announced in April 2013 that they had started recording an English dub for new episodes. In November 2013, Kai's Australasian distributor Madman Entertainment revealed that the Majin Buu arc of Kai would be released in 2014 and that they were waiting on dubs to be finished. In February 2014, Funimation officially stated that they had not yet started recording a dub for the final arc of Kai. On December 6, 2016, Funimation announced the continuation of Kai would begin airing on Adult Swim's Toonami block. The series aired from January 7, 2017, to June 23, 2018, alongside Dragon Ball Super.\r\nAn alternate English dub of Kai by Ocean Productions was recorded for the original 98 episodes, featuring many of the original Vancouver cast reprising their roles, but it has yet to air.\r\nEditing\r\nDragon Ball Z's original North American release was the subject of heavy editing which resulted in a large amount of removed content and alterations that greatly changed the original work. Funimation CEO Gen Fukunaga is often criticized for his role in the editing; but it was the initial distributor Saban which required such changes or they would not air the work, as was the case with the episode dealing with orphans. These changes included altering every aspect of the show from character names, clothing, scenes and dialogue of the show. The character Mr. Satan was renamed Hercule and this change has been retained in other English media such as Viz's Dragon Ball Z manga and video games, though the English dubs of Dragon Ball Kai and Dragon Ball Super changed the name back to Mr. Satan. The dialogue changes would sometimes contradict the scenes itself; after the apparent fatal explosion of a helicopter, one of the characters said, \"I can see their parachutes; they're okay!\" Funimation's redub for the 2005 release would address many of the issues raised by Saban, with the uncut releases preserving the integrity of the original Japanese release.\r\nDuring the original Japanese TV airing of Dragon Ball Kai, scenes involving blood and brief nudity were removed. Nicktoons would also alter Kai for its broadcast; it released a preview showcasing these changes which included removing the blood and cheek scar from Bardock and altering the color of Master Roshi's alcohol. The show was further edited for its broadcast on The CW; most notoriously, the character Mr. Popo was tinted blue. The show's DVD and Blu-ray releases only contained the edits present in the original Japanese version. A rumor that Cartoon Network would be airing Kai uncut was met with an official statement to debunk the rumor in June 2010;. However, it would later air uncut on the channel as part of Adult Swim's Toonami block.\r\nSteven Simmons, who did the subtitling for Funimation's home video releases, offered commentary on the subtitling from a project and technical standpoint, addressing several concerns. Simmons said that Gen Fukunaga did not want any swearing on the discs, but because there was no taboo word list, Simmons would substitute a variation in the strength of the words by situation with the changes starting in episode 21. The typographical errors in the script were caused by dashes (—) and double-quotes (\") failing to appear, which resulted in confusing dialogue.\r\nMusic\r\nDragon Ball Z has released a series of 21 soundtracks as part of the Dragon Ball Z Hit Song Collection Series. In total, dozens of releases exist for Dragon Ball Z which includes Japanese and foreign adapted releases of the anime themes and video game soundtracks.\r\nShunsuke Kikuchi composed the score for Dragon Ball Z. The opening theme for the first 199 episodes is \"Cha-La Head-Cha-La\" performed by Hironobu Kageyama. The second opening theme used up until the series finale at episode 291 is \"We Gotta Power\" also performed by Kageyama. Both opening themes were replaced with an original piece in the remastered Funimation dub due to licensing issues. The ending theme used for the first 199 episodes is \"Detekoi Tobikiri Zenkai Power!\" (でてこいとびきりZENKAIパワー!, \"Come Out, Incredible Full Power!\") performed by MANNA. The second ending theme used for the remaining episodes is \"Bokutachi wa Tenshi Datta\" (僕達は天使だった, \"We Were Angels\") performed by Kageyama. The initial English-Language release used a completely new musical score composed by Faulconer Productions. It was used for the North American broadcasts of the show from 1999 to 2005.\r\nKenji Yamamoto composed the score for Dragon Ball Kai. The opening theme, \"Dragon Soul\", and the first ending theme used for the first 54 episodes, \"Yeah! Break! Care! Break!\", are both performed by Takayoshi Tanimoto of the unit, Dragon Soul, in Japanese. Sean Schemmel, Justin Cook, Vic Mignogna, Greg Ayres, Sonny Strait and Brina Palencia performed the English version of the opening theme, while Jerry Jewell performed the English version of the ending theme. The second ending theme, used from episodes 55–98, is \"Kokoro no Hane\" (心の羽根, \"Wings of the Heart\") performed by Team Dragon, a unit of the idol girl group AKB48, in Japanese and Leah Clark in English. On March 9, 2011, Toei announced that due to Yamamoto's score infringing on the rights of an unknown third party or parties, the music for remaining episodes and reruns of previous episodes would be replaced. Later reports from Toei stated that except for the series' opening and closing songs, as well as eyecatch music, Yamamoto's score was replaced with Shunsuke Kikuchi's from Dragon Ball Z.\r\nThe music for The Final Chapters is composed by Norihito Sumitomo. The opening theme is \"Kuu•Zen•Zetsu•Go\" (空•前•絶•後) by Takayoshi Tanimoto of Dragon Soul, while the first ending song is \"Haikei, Tsuratsusutora\" (拝啓、ツラツストラ, \"Dear Zarathustra\") by Japanese rock band Good Morning America, and the second \"Junjō\" (純情, \"Pure Heart\") by Leo Ieiri from episode 112 to 123. The third ending song is \"Oh Yeah!!!!!!!\" by Czecho No Republic from episode 124 to 136, the fourth \"Galaxy\" by Kyūso Nekokami from 137 to 146, and the fifth is \"Don't Let Me Down\" by Gacharic Spin from 147 to 159. The international broadcast features two pieces of theme music. The opening theme, titled \"Fight It Out\", is performed by rock singer Masatoshi Ono, while the ending theme is \"Never Give Up!!!\", performed by rhythm and blues vocalist Junear.\r\nRelated media\r\nHome media\r\nIn Japan, Dragon Ball Z did not receive a home video release until 2003, seven years after its broadcast. Pony Canyon announced a remastering of the series in two 26-disc DVD box sets, that were made-to-order only, released on March 19 and September 18 and referred to as \"Dragon Box\". Since then, Pony Canyon content of these sets began being released on mass-produced individual 6-episode DVDs on November 2, 2005 and finished with the 49th volume released on February 7, 2007. In July 2009, Funimation announced that they would be releasing the Japanese frame-by-frame \"Dragon Box\" restoration of Dragon Ball Z in North America. These seven limited edition collector's DVD box sets were released uncut and unedited in the show's original 4:3 fullscreen format between November 10, 2009, and October 11, 2011.\r\nThe international home release structure of Dragon Ball Z is complicated by the licensing and release of the companies involved in producing and distributing the work. Releases of the media occurred on both VHS and DVD with separate edited and uncut versions being released simultaneously. Both versions of the edited and uncut material are treated as different entries and would frequently make Billboard rankings as separate entries. Home release sales were featured prominently on the Nielsen VideoScan charts. Further complicating the release of the material was Funimation itself; which was known to release \"DVDs out of sequence in order to get them out as fast as possible\"; as in the case of their third season. Pioneer Entertainment distributed the Funimation/Saban edited-only dub of 53 episodes on seventeen VHS between 1997 and 1999, and seventeen DVDs throughout 1999. Two box sets separating them into the Saiyan and Namek arcs were also released on VHS in 1999, and on DVD in 2001. In 1999, Funimation's own distribution of their initial onward dub, which began with episode 54, in edited or uncut VHS ran between 1999 and 2006. A DVD version was produced alongside these, although they were only produced uncut and contained the option to watch the original Japanese with subtitles.\r\nIn 2005, Funimation began releasing their onward dub of the beginning of Dragon Ball Z on DVD, marking the first time the episodes were seen uncut in North America. However, only nine volumes were released, leaving it incomplete. Instead, Funimation remastered and cropped the entire series into 16:9 widescreen format and began re-releasing it to DVD in nine individual \"season\" box sets; the first set released on February 6, 2007, and the final on May 19, 2009. On August 13, 2013, Funimation released all 53 episodes and the three movies from their first Dragon Ball Z dub created with Saban and Ocean Studios in a collector's DVD box set, titled the Rock the Dragon Edition.\r\nIn July 2011, Funimation announced plans to release Dragon Ball Z in Blu-ray format, with the first set released on November 8, 2011. However, production of these 4:3 sets was suspended after the second volume, citing financial and technical concerns over restoring the original film material frame by frame, with Funimation noting that the price of the sets would not justify the restoration costs. Only a year later, the company began producing a cropped 16:9 remastered Blu-ray release in 2013, with nine sets released in total.\r\nIn March 2019, Funimation announced plans to release a 30th anniversary Blu-ray release of Dragon Ball Z, with the box set being remastered in 4:3 aspect ratio, and containing an artbook and a collectible figure. It would be crowdfunded, originally requiring a minimum of 2500 pre-orders in order to be manufactured, but was later increased to a minimum of 3,000 units. The release sparked controversy amongst fans due to the framing of the video, color saturation and digital video noise reduction. Funimation responded by stating that they cropped the release by going in \"scene-by-scene to make judgements based on the image available in each frame of how much to trim to get to a consistent 4:3 aspect ratio, while still attempting to cut as little out of the picture as possible,\" and that they felt the digital video noise reduction was \"mandatory for this release based on the different levels of fan support from various past DBZ releases with different levels of noise reduction over the years.\"\r\nKai\r\nIn Japan, Dragon Ball Kai was released on wide-screen on 33 DVDs and fullscreen on a single Blu-ray and eight four-disc Blu-ray sets from September 18, 2009, to August 2, 2011.\r\nFunimation released eight DVD and Blu-ray box sets of Dragon Ball Z Kai from May 18, 2010, to June 5, 2012. These sets contain the original Japanese audio track with English subtitles, as well as the uncut version of the English dub, which does not contain any of the edits made for the TV airings. Before the final volume was even published, Funimation began re-releasing the series in four DVD and Blu-ray \"season\" sets between May 22, 2012, and March 12, 2013. Funimation released The Final Chapters in three DVD and Blu-ray volumes from April 25 to June 20, 2017.\r\nManga\r\nWhile the manga was all titled Dragon Ball in Japan, due to the popularity of the Dragon Ball Z anime in the west, Viz Media initially changed the title of the last 26 volumes of the manga to \"Dragon Ball Z\" to avoid confusion. The volumes were originally published in Japan between 1988 and 1995. It began serialization in the American Shonen Jump, beginning in the middle of the series with the appearance of Trunks; the tankōbon volumes of both Dragon Ball Z and Dragon Ball were released simultaneously by Viz Media in the United States. In March 2001, Viz continued this separation by re-shipping the Dragon Ball and Dragon Ball Z titles starting with the first volumes of each work. Viz's marketing for the manga made distinct the differences between Dragon Ball and Dragon Ball Z tone. Viz billed Dragon Ball Z: \"More action-packed than the stories of Goku's youth, Dragon Ball Z is pure adrenaline, with battles of truly Earth-shaking proportions!\" Between 2008 and 2010, Viz re-released the two series in a format called \"Viz Big Edition,\" which collects three individual volumes into a single large volume. However, in 2013 Viz began publishing new 3-in-1 volumes collecting the entire manga series, including what they previously released as Dragon Ball Z, under the Dragon Ball name.\r\nFilms\r\nThe Dragon Ball Z films comprise a total of 15 entries as of 2015. The first 13 films were typically released every March and July during the series' original run by the spring and summer vacations of Japanese schools. They were typically double features paired up with other anime films, and were thus, usually an hour or less in length. These films themselves offer contradictions in both chronology and design that make them incompatible with a single continuity. All 15 films were licensed in North America by Funimation, and all have received in-house dubs by the company. Before Funimation, the third film was a part of the short-lived Saban syndication, being split into three episodes, and the first three films received uncut English dubs in 1998 produced by Funimation with Ocean Studios and released by Pioneer. Several of the films have been broadcast on Cartoon Network and Nicktoons in the United States, Toonami UK in the United Kingdom (these featured an alternate English dub produced by an unknown cast by AB Groupe), and Cartoon Network in Australia.\r\nTelevision specials and original video animations\r\nThree TV specials based on Dragon Ball Z were produced and broadcast on Fuji TV. The first two were Dragon Ball Z: Bardock – The Father of Goku in 1990 and Dragon Ball Z: The History of Trunks in 1993, the latter being based on a special chapter of the original manga. Both were licensed by Funimation in North America and AB Groupe in Europe. In 2013, a two-part hour-long crossover with One Piece and Toriko, titled Dream 9 Toriko & One Piece & Dragon Ball Z Chō Collaboration Special!!, was created and aired.\r\nAdditionally, two original video animations (OVAs) bearing the Dragon Ball Z title have been made. The first is Dragon Ball Z Side Story: Plan to Eradicate the Saiyans, which was originally released in 1993 in two parts as \"Official Visual Guides\" for the video game of the same title. Dragon Ball: Plan to Eradicate the Super Saiyans was a 2010 remake of this OVA. None of the OVAs have been dubbed into English, and the only one to see a release in North America is the 2010 remake, which was subtitled and included as a bonus feature in Dragon Ball: Raging Blast 2.\r\nVideo games\r\nOver 57 video games are bearing the Dragon Ball Z name across a range of platforms from the Nintendo Entertainment System to the current generation consoles, with the most recent release being Dragon Ball Z: Kakarot in 2020.\r\nIn North America, licensing rights had been given to both Namco Bandai and Atari. In 1999, Atari acquired exclusive rights to the video games through Funimation, a deal which was extended for five more years in 2005. A 2007 dispute would end with Atari paying Funimation $3.5 million. In July 2009, Namco Bandai was reported to have obtained exclusive rights to release the games for a period of five years. This presumably would have taken effect after Atari's licensing rights expired at the end of January 2010.\r\nReception\r\nDragon Ball Z was listed as the 78th best animated show in IGN's \"Top 100 Animated Series\", and was also listed as the 50th greatest animated show in Wizard magazine's \"Top 100 Greatest Animated shows\" list. The series ranked sixth on Wizard's Anime Magazine on their \"Top 50 Anime released in North America\".\r\nIn Asia, the Dragon Ball Z franchise, including the anime and merchandising, earned a profit of $3 billion by 1999. In the United States, the series sold over 14 million videos by 2002, and over 25 million DVDs as of January 2012.\r\nIn 2005, media historian Hal Erickson wrote that \"Dragon Ball may be the closest thing on American television to an animated soap opera — though this particular genre is an old, established and venerated one in Japan, the series' country of origin.\" Christopher J. Olson and CarrieLynn D. Reinhard note that \"Western fans flocked to Dragon Ball Z because it offered exciting action not found in movies or television shows (animated or otherwise) at that time.\" A key characteristic that set Dragon Ball Z (and later other anime shows) apart from American television shows at the time was a serialization format, where a continuous story arc stretches over multiple episodes or seasons. Traditional American television had an episodic format, with each episode typically consisting of a self-contained story. Serialization has since also become a common characteristic of American streaming television shows during the \"Peak TV\" era.\r\nFunimation's in-house English dub though has received mixed reviews from some critics over the years. IGN criticized the dub for \"having poor quality, along with some over the top, and quite annoying voice acting.\" Frieza's female voice in particular left many fans confused over the character's gender. Other criticisms have been towards the English dub's script, and inaccurately translating the source material, such as portraying Goku's character as a more stoic superhero.\r\nCultural impact and legacy\r\nDragon Ball Z's popularity is reflected through a variety of data through online interactions which show the popularity of the media. In 2001, it was reported that the official website of Dragon Ball Z recorded 4.7 million hits per day and included 500,000+ registered fans. The term \"Dragonball Z\" ranked fourth in 1999 and second in 2000 by Lycos' web search engine. For 2001, \"Dragonball\" was the most popular search on Lycos and \"Dragonball Z\" was fifth on Yahoo!. and \"Dragonball\" was the third most popular search term in 2002.\r\nIt's Over 9000! became a famous Internet meme and is referenced both within and outside Dragonball related media.\r\nIn 2015, Ford Motor Company released two commercials featuring characters from the series, the first advertising the Ford Fusion and the second for the Ford Focus.\r\nDragon Ball fans set a Guinness World Record for Largest Kamehameha attack move at San Diego Comic-Con on July 17, 2019.\r\nRatings\r\nDragon Ball Z's Japanese run was very popular with an average viewer rating of 20.5% across the series. Dragon Ball Z also proved to be a rating success in the United States, outperforming top shows such as Friends and The X-Files in some parts of the country in sweeps ratings during its first season. The premiere of season three of Dragon Ball Z in 1999, done by Funimation's in-house dub, was the highest-rated program ever at the time on Cartoon Network. In 2002, in the week ending September 22, Dragon Ball Z was the #1 program of the week on all of television with tweens 9-14, boys 9-14 and men 12-24, with the Monday, Tuesday and Wednesday telecasts of Dragon Ball Z ranked as the top three programs in all of television, broadcast or cable, for delivery of boys 9-14. In 2001, Cartoon Network obtained licensing to run 96 more episodes and air the original Dragon Ball anime and was the top rated show in the Toonami block of Cartoon network. Beginning March 26, 2001, Cartoon Network ran a 12-week special promotion \"Toonami Reactor\" which included a focus on Dragon Ball Z, which would stream episodes online to high-speed internet users. Many home video releases were met with both the edited and unedited versions placing on in the top 10 video charts of Billboard. For example, \"The Dark Prince Returns\" (containing episodes 226-228) and \"Rivals\" (containing episodes 229-231) edited and unedited, made the Billboard magazine top video list for October 20, 2001.\r\nThe first episode of Dragon Ball Kai earned a viewer ratings percentage of 11.3, ahead of One Piece and behind Crayon Shin-chan. Although following episodes had lower ratings, Kai was among the top 10 anime in viewer ratings every week in Japan for most of its run. Towards the end of the original run the ratings hovered around 9%-10%. Dragon Ball Z Kai premiered on Nicktoons in May 2010 and set the record for the highest-rated premiere in total viewers, and in tweens and boys ages 9–14. Nielsen Mega Manila viewer ratings ranked Dragon Ball Kai with a viewer ratings with a high of 18.4% for October 30 – November 4 in 2012. At the end of April 2013, Dragon Ball Kai would trail just behind One Piece at 14.2%. Broadcasters' Audience Research Board ranked Dragon Ball Z Kai as the second most viewed show in the week it debuted on Kix. On its debut on Vortexx, Dragon Ball Z Kai was the third highest rated show on the Saturday morning block with 841,000 viewers and a 0.5 household rating.\r\nMerchandising\r\nDragon Ball Z merchandise was a success prior to its peak American interest, with more than $3 billion in sales from 1996 to 2000. In 1996, Dragon Ball Z grossed $2.95 billion in merchandise sales worldwide. As of January 2012, Dragon Ball Z grossed $5 billion in merchandise sales worldwide.\r\nIn 1998, Animage-ine Entertainment, a division of Simitar, announced the sale of Chroma-Cels, mock animation cels to capitalize on the popularity of Dragon Ball Z. The original sale was forecasted for late 1998, but were pushed back to January 12, 1999.\r\nIn 2000, MGA Entertainment released more than twenty toys, consisting of table-top games and walkie-talkies. Irwin Toy released more than 72 figures consisting of 2-inch and 5 inch action figures, which became top-selling toys in a market dominated by the Pokémon Trading Card Game. Irwin Toys would release other unique Dragon Ball Z toys including a battery powered Flying Nimbus Cloud which hovered without touching the ground and a die-cast line of vehicles with collector capsules. In June 2000, Burger King had a toy promotion which would see 20 million figurines; Burger King bore the cost of the promotion which provided free marketing for Funimation. The Halloween Association found Dragon Ball Z costumes to be the fourth most popular costumes in their nationwide survey.\r\nIn December 2002, Jakks Pacific signed a three-year deal for licensing Dragon Ball Z toys, which was possible because of the bankruptcy of Irwin Toy. Jakks Pacific's Dragon Ball Z 5-inch figures were cited as impressive for their painting and articulation.\r\nIn 2010, Toei closed deals in Central and South American countries which included Algazarra, Richtex, Pil Andina, DTM, Doobalo and Bondy Fiesta. In 2012, Brazil's Abr-Art Bag Rio Comercio Importacao e Exportacao closed a deal with Toei.",
    "html": "<p>Dragon Ball Z is a Japanese anime television series produced by Toei Animation. Part of the Dragon Ball media franchise, it is the sequel to the 1986 Dragon Ball anime series and adapts the latter 325 chapters of the original Dragon Ball manga series created by Akira Toriyama. The series aired in Japan on Fuji TV from April 1989 to January 1996 and was later dubbed for broadcast in at least 81 countries worldwide.</p><p>Dragon Ball Z continues the adventures of Goku in his adult life as he and his companions defend the Earth against villains including aliens (Vegeta, Frieza), androids (Cell), and magical creatures (Majin Buu). At the same time, the story parallels the life of his son, Gohan, as well as the development of his rivals, Piccolo and Vegeta.</p><p>Due to the success of the anime in the United States, the manga chapters making up its story were initially released by Viz Media under the Dragon Ball Z title. The anime's popularity has also spawned numerous media and merchandise that has come to represent the majority of content within the Dragon Ball franchise. Dragon Ball Z remains a cultural icon through numerous adaptations and re-releases, including a remastered broadcast titled Dragon Ball Z Kai.</p><p>Dragon Ball Z has since been followed by two sequel series: Dragon Ball GT (1996–1997) and Dragon Ball Super (2015–2018).</p><br/><h3>Plot summary</h3><h4>Saiyan Saga</h4><p>Dragon Ball Z picks up five years after the end of the Dragon Ball anime, with Goku now a young adult and father to his son, Gohan.</p><p>A humanoid alien named Raditz arrives on Earth in a spacecraft and tracks down Goku, revealing to him that he is his long-lost older brother and that they are members of a near-extinct alien warrior race called the Saiyans (サイヤ人, Saiya-jin). The Saiyans had sent Goku (originally named Kakarot (カカロット, Kakarotto)) to Earth as an infant to conquer the planet for them, but he suffered a severe blow to the head shortly after his arrival and lost all memory of his mission, as well as his blood-thirsty Saiyan nature.</p><p>Raditz along with two elites, Vegeta and Nappa, are the only remaining Saiyan warriors, so Raditz comes to enlist Goku's help in conquering frontier worlds. When Goku refuses to join them, Raditz takes Goku and Krillin down with one strike, kidnaps Gohan, and threatens to murder him if Goku does not kill 100 humans within the next 24 hours. Goku decides to team up with his arch-enemy Piccolo, who was also defeated by Raditz in an earlier encounter, to defeat him and save his son. During the battle, Gohan's rage momentarily makes him stronger than Piccolo and Goku as he attacks Raditz to protect his father. The battle ends with Goku restraining Raditz so that Piccolo can hit them with a deadly move called Special Beam Cannon (魔貫光殺砲, Makankōsappō, lit. \"Demon Penetrating, Killing Ray Gun\"), mortally wounding them both, and kills them after a short while. But before Raditz succumbs to his injuries, he reveals to Piccolo that the other two Saiyans are much stronger than him and will come for the Dragon Balls in one year.</p><p>Having witnessed Gohan's latent potential, Piccolo takes him into the wilderness to train for the upcoming battle against the Saiyan Elites. In the afterlife, Goku travels the million-kilometer Snake Way so that he can train under the ruler of the North Galaxy, King Kai. King Kai teaches him the Kaio-ken (界王拳, Kaiōken, lit. \"Fist of Kings of Worlds\") and the Spirit Bomb (元気玉, Genki Dama, lit. \"Energy Sphere\") techniques. Despite his gruff nature, Piccolo grows fond of Gohan while he oversees him learning to fend for himself. This forges an unlikely emotional bond between the two.</p><p>After a year, Goku is revived with the Dragon Balls, but King Kai panics as he realizes that Goku will have to take Snake Way again to get back and will not make it until hours after the Saiyans arrive. Goku's allies group up to fight until Goku gets back, but prove to be no match for Nappa and the \"Prince of All Saiyans\", Vegeta. Yamcha, Tien Shinhan, Chiaotzu and Piccolo all perish in the battle, with Piccolo's death causing both Kami and the Dragon Balls to fade from existence. When Goku finally arrives at the battlefield, he avenges his fallen friends by easily defeating Nappa before crippling him by breaking his spine in half. A furious Vegeta then executes Nappa for his failure to kill Goku.</p><p>Goku uses several grades of the Kaio-ken to win the first clash with Vegeta, which concludes with a climactic ki beam struggle, but it comes at a great cost to his body. Vegeta comes back and creates an artificial moon to transform into a Great Ape, which he uses to torture Goku. Krillin and Gohan sense that Goku is in trouble, and they return for a group fight with the now-seemingly unstoppable Vegeta. They are aided at key moments by Yajirobe, who cuts Vegeta's tail to revert him into his normal state. Goku gives Krillin a Spirit Bomb that he made, and Krillin uses it to severely damage Vegeta. Vegeta is ultimately defeated when he is crushed by Gohan's Great Ape form, and he retreats to his spaceship as Krillin approaches to finish him off. Goku convinces Krillin to spare Vegeta's life and allow him to escape Earth, with Vegeta vowing to return and destroy the planet in revenge for his humiliation at Goku's hands.</p><h4>Frieza Saga</h4><p>During the battle, Krillin overhears Vegeta mentioning the original set of Dragon Balls from Piccolo's homeworld, Namek (ナメック星, Namekku-sei). While Goku recovers from his injuries, Gohan, Krillin, and Goku's oldest friend Bulma depart for Namek to use these Dragon Balls to revive their fallen friends in the battle.</p><p>Upon their arrival on Namek, Krillin, Gohan, and Bulma discover that Vegeta and his superior, the galactic tyrant Frieza, are already there, each looking to use the Dragon Balls to obtain immortality. Vegeta is stronger than before, as Saiyans become stronger when they recover from the brink of death, so he seizes the opportunity to rebel against Frieza. A triangular game of cat-and-mouse ensues, with Frieza, Vegeta, and Gohan plus Krillin alternately possessing one or more of the Dragon Balls, with no one managing to possess all seven at any given time.</p><p>Vegeta manages to isolate Frieza's lieutenants one by one and kill them. When Frieza sees that Vegeta is posing too big of a problem, he summons the Ginyu Force, a team of elite mercenaries led by Captain Ginyu, who can switch bodies with his opponents. Vegeta reluctantly teams up with Gohan and Krillin to fight them, knowing that they are too much for him to handle alone. The Ginyu Force proves too powerful, but Goku finally arrives and defeats them single-handedly, saving Vegeta, Gohan, and Krillin. Vegeta believes Goku may have become the legendary warrior of the Saiyans, the Super Saiyan (超(スーパー)サイヤ人, Sūpā Saiya-jin). As Goku heals from a brutal fight with Captain Ginyu, Krillin, Dende, and Gohan secretly use the Dragon Balls behind Vegeta's back to wish for Piccolo's resurrection and teleport him to Namek. Vegeta finds them using the Dragon Balls without him, but the Grand Elder dies and rendering the Dragon Balls inert before he can wish for immortality. Just as this happens, Frieza arrives and decides to kill the four of them for denying him his wish for immortality.</p><p>Piccolo arrives on Namek but is accidentally separated from the others due to a badly-worded wish. He finds the strongest Namekian warrior, Nail, who was defeated by Frieza and fuses with him to greatly increase his power.</p><p>Despite both Piccolo and Vegeta's advances in power, they are greatly outclassed by Frieza, who goes through several transformations before reaching his final form, which he then uses to kill Dende.</p><p>Goku arrives after healing from his injuries, and Vegeta tells him that Frieza was the one who destroyed the Saiyan homeworld and massacred the Saiyan race, as he feared that he would one day be overthrown by a Super Saiyan. Frieza then kills Vegeta in front of Goku.</p><p>Though Goku's power exceeds Vegeta's, he is still no match for Frieza. Goku uses his last resort, a massive Spirit Bomb with the energy of Namek and the surrounding worlds, and it seemingly defeats the tyrant. However, Frieza manages to survive, and he unleashes his wrath upon the group by gravely wounding Piccolo and murdering Krillin. Goku's rage finally erupts, and he undergoes a strange transformation that turns his hair blond, his eyes green, and causes a golden aura to radiate from his body. Goku has finally become a Super Saiyan.</p><p>Meanwhile, the revived Kami uses Earth's Dragon Balls to resurrect everyone on Namek that was killed by Frieza and his henchmen, which also allows the Grand Elder to be resurrected for a short time, and the Namekian Dragon to return. Dende uses the final wish to teleport everyone on Namek to Earth except for Goku and Frieza.</p><p>Even at 100% power, Frieza proves to be no match for the Super Saiyan transformation, and Goku defeats the evil tyrant before escaping Namek as the planet is destroyed in a massive explosion.</p><h4>Garlic Jr. Saga</h4><p>After the battle with Frieza, Goku's friends and family are waiting for word on his return when a demonic star drifts into Earth's orbit and opens up a rift in space, allowing the malevolent immortal Garlic Jr. to break free from his imprisonment inside the Dead Zone. Seeking revenge for a past defeat at the hands of Goku and Piccolo, Garlic Jr. traps Kami and Mr. Popo inside a bottle and uses his Black Water Mist to turn all of Earth's inhabitants into bloodthirsty, vampire-like beings. Gohan, Krillin, Piccolo, Krillin's then-girlfriend Maron, and Gohan's pet dragon Icarus are the only ones unaffected and set out to stop Garlic Jr. and restore the Earth and its inhabitants. This proves to be easier said than done, as Garlic Jr. has complete immortality, making him impossible to kill. Luckily, Gohan's hidden potential gives him the edge he needs to eradicate Garlic Jr.'s forces and send him back into the Dead Zone. He also destroys the star, ensuring that Garlic Jr. will remain trapped in the Dead Zone for all eternity.</p><h4>Androids Saga</h4><p>One year later, Frieza is revealed to have survived and arrives on Earth with his father, King Cold, seeking revenge. However, a mysterious young man named Trunks appears, transforms into a Super Saiyan, and kills Frieza and King Cold. Goku returns a few hours later, having spent the past year on the alien planet Yardrat learning a new technique: Instant Transmission, which allows him to teleport to any location he desires. Trunks reveals privately to Goku that he is the son of Vegeta and Bulma, and has traveled from 17 years in the future to warn Goku that two Androids (人造人間, Jinzōningen, lit. \"Artificial Humans\") created by Dr. Gero will appear in three years to seek revenge against Goku for destroying the Red Ribbon Army when he was a child. Trunks says all of Goku's friends will fall to them - while Goku himself will die from a heart virus six months before their arrival.</p><p>Trunks gives Goku medicine from the future that will save him from the heart virus and departs back to his own time. When the androids arrive, Goku falls ill during his fight with Android 19 but is saved by Vegeta, who reveals that he has also achieved the Super Saiyan transformation. Vegeta and Piccolo easily defeat Android 19 and Dr. Gero (who turned himself into \"Android 20\"), but Trunks returns from the future to check on their progress and reveals that the androids they defeated are not the ones that killed all of them in the future.</p><p>Goku is out of commission and his allies are overwhelmed by the arrival of Androids 16, 17 and 18, while an even stronger bio-Android called Cell emerges from a different timeline and embarks on a quest to find and absorb Androids 17 and 18, which will allow him to attain his \"perfect form\".</p><p>Cell successfully absorbs Android 17, becoming considerably more powerful, but Vegeta returns to the battle, having greatly elevated his power, and easily overpowers him. However, Vegeta allows Cell to absorb Android 18, believing that his \"perfect form\" will be no match for his Super Saiyan power. Vegeta is subsequently defeated, with Cell sarcastically thanking him for helping him achieve perfection.</p><p>Cell allows everyone to live for the time being and announces his fighting tournament to decide the fate of the Earth, known as the \"Cell Games\". Goku, recovered from the heart virus and having reached the zenith of the Super Saiyan form, takes on Cell at the tournament. Goku eventually realizes that Cell is far too powerful for him to handle, and forfeits the fight to the astonishment of everyone else. Goku proclaims that Gohan will be able to defeat Cell. Though initially outclassed, Gohan is eventually able to tap into his latent power and achieve the Super Saiyan 2 transformation after Android 16 sacrifices himself in a failed attempt to kill Cell. Refusing to accept defeat, Cell prepares to self-destruct and destroy the Earth.</p><p>Goku uses his Instant Transmission ability to teleport himself and Cell to King Kai's planet, where Cell explodes and kills everyone there. However, Cell survives the blast and returns to Earth more powerful than ever, where he promptly murders Trunks, but Gohan unleashes the totality of his power in a massive Kamehameha wave and obliterates Cell for good.</p><p>The Dragon Balls are then used to revive everyone that was killed by Cell, while Goku chooses to remain in the afterlife, refusing an offer by his friends to use the Namekian Dragon Balls to bring him back. Trunks returns to his timeline and uses his bolstered power to finally slay the Future Androids and Cell.</p><h4>Majin Buu Saga</h4><p>Seven years later, Goku is allowed to go back to Earth for one day to reunite with his loved ones and meet his youngest son, Goten, at the World Martial Arts Tournament (天下一武道会, Tenkaichi Budōkai, \"Strongest Under the Heavens Martial Arts Tournament\"). Soon after, Goku and his allies are drawn into a fight by the Supreme Kai against a magical being named Majin Buu (魔人ブウ, ”Demon Person Buu”) summoned by the evil wizard Babidi. All efforts of preventing the resurrection prove to be futile as Buu is successfully revived, resulting in Vegeta, who had willingly joined forces with Babidi so he could surpass Goku, committing suicide in a failed attempt to kill Buu. Goten and Trunks are taught the fusion technique by Goku, while Gohan is trained by the Supreme Kai to unlock his latent potential. Meanwhile, Buu befriends Mr. Satan and vows to never kill anyone ever again, but is interrupted when a deranged gunman shoots and nearly kills Mr. Satan. As a result, Majin Buu becomes so angry that he expels the evil within himself, creating an evil Buu that proceeds to absorb the good Buu. The result is Super Buu, a psychopathic monster who wants nothing more than the destruction of the universe. After numerous battles that result in the deaths of many of Goku's allies as well as the destruction of Earth, Goku (whose life is fully restored by the Elder Supreme Kai) defeats Kid Buu (the original and most dangerous form of Majin Buu) with a Spirit Bomb attack containing the energy of all the inhabitants of Earth, who were resurrected along with the planet by the Namekian Dragon Balls. Goku makes a wish for Kid Buu to be reincarnated as a good person and, ten years later at another Tenkaichi Budōkai, he meets Kid Buu's human reincarnation, Uub. Leaving the match between them unfinished, Goku departs with Uub so he can train him to become Earth's new defender.</p><br/><h3>Production and broadcasting</h3><p>Kazuhiko Torishima, Akira Toriyama's editor for Dr. Slump and the first half of Dragon Ball, felt that the Dragon Ball anime's ratings were gradually declining because it had the same producer that worked on Dr. Slump. Torishima said this producer had this \"cute and funny\" image connected to Toriyama's work and was missing the more serious tone in the newer series, and therefore asked the studio to change the producer. Impressed with their work on Saint Seiya, he asked its director Kōzō Morishita and writer Takao Koyama to help \"reboot\" Dragon Ball, which coincided with Goku growing up. The new producer explained that ending the first anime and creating a new one would result in more promotional money, and the result was the start of Dragon Ball Z. The title was suggested by Toriyama because Z is the last letter of the alphabet and he wanted to finish the series because he was running out of ideas for it. Ironically enough, the sequel series would end up producing more episodes than its predecessor.</p><p>Dragon Ball Z is adapted from the final 324 chapters of the manga series which were published in Weekly Shōnen Jump from 1988 to 1995. It premiered in Japan on Fuji Television on April 26, 1989, taking over its predecessor's time slot, and ran for 291 episodes until its conclusion on January 31, 1996. Because Toriyama was writing the manga during the production of the anime, Dragon Ball Z added original material not adapted from the manga, including lengthening scenes or adding new ones, and adding new attacks and characters not present in the manga. For example, Toriyama was asked to create an additional character for Goku's training with King Kai, resulting in the cricket Gregory.</p><p>Throughout the production, the voice actors were tasked with playing different characters and performing their lines on cue, switching between roles as necessary. The voice actors were unable to record the lines separately because of the close dialogue timing. When asked if juggling the different voices of Goku, Gohan and Goten were difficult, Masako Nozawa said that it was not and that she was able to switch roles simply upon seeing the character's picture. She did admit that when they were producing two films a year and television specials in addition to the regular series, there were times when they had only line art to look at while recording, which made giving finer nuanced details in her performance difficult.</p><p>One of the character designers for Dragon Ball Z was Tadayoshi Yamamuro. He was responsible for designing and animating Goku's Super Saiyan form in the series. He used the martial artist Bruce Lee as a reference for Goku's Super Saiyan form, stating that, when he \"first becomes a Super Saiyan, his slanting pose with that scowling look in his eyes is all Bruce Lee.\" In the original manga itself, Goku's piercing eyes in Super Saiyan form were also based on Bruce Lee's paralyzing glare.</p><p>Series Director Daisuke Nishio left the series after personally directing Episode #202. Nishio left the series to become series director of Aoki Densetsu Shoot!. The role of series director was not officially filled for Episodes #200-291, despite Nishio's directing of Episode #202.</p><h4>English dub production and broadcasting</h4><p>In 1996, Funimation Productions (now known as Crunchyroll, LLC) licensed Dragon Ball Z for an English-language release in North America, after cancelling their initial dub of Dragon Ball half-way through their originally-planned 26-episode first season. Funimation's 1996 release was not the first broadcast in the United States, as some networks had already aired versions of the series in other languages on a smaller scale. This included Nippon Golden Network's broadcast of a subtitled Japanese version in Hawaii from 1994. Funimation worked with Saban Entertainment to syndicate the series on television, and Pioneer Entertainment to handle home video distribution. A Vancouver-based cast recording at the Ocean Studios were hired by Funimation to dub the anime (Funimation had previously used a similar Vancouver-based voice cast in their initial Dragon Ball dub, recorded at Dick & Roger's Sound Studio). Contract musicians for Saban, Ron Wasserman and Jeremy Sweet, known for their work on the Power Rangers franchise, composed a new guitar-driven background score and theme song (nicknamed \"Rock the Dragon\"). Funimation's initial English dub of Dragon Ball Z had mandated cuts to content and length, which reduced the first 67 episodes into 53 (though TV episode 53 actually ends half-way through uncut episode 67). Most of the edits were done to make the anime more tame and kid-friendly, most notably having references to death sidestepped with phrases like \"sent to the next dimension\". It premiered in the United States on September 13, 1996, in first-run syndication, but halted production in 1998 after two seasons despite strong ratings. This was due to Saban scaling down its syndication operations, in order to focus on producing original material for the Fox Kids Network and its newly acquired Fox Family Channel. Pioneer also ceased its home video release of the series at volume 17 (the end of the dub) and retained the rights to produce an uncut subtitled version, but did not do so. They did, however, release uncut dubs of the first three Z movies on home video.</p><p>On August 31, 1998, re-runs of this canceled dub began airing on Cartoon Network as part of the channel's weekday afternoon Toonami block. Cartoon Network eventually ordered more episodes of Dragon Ball Z, and Funimation resumed production on the series' English dub without Saban's assistance. However, they also replaced the original Vancouver-based cast with an in-house voice cast at their Texas-based studio, with the goal of the new voices sounding similar to the Vancouver cast. The Saban-produced soundtrack from the first two seasons was replaced with a new background score composed by Bruce Faulconer and his team of musicians, which was used throughout the rest of Funimation's Dragon Ball Z dub. This renewed dub featured less censorship due to both Saban's absence and fewer restrictions on cable programming, and aired new episodes on Cartoon Network's Toonami block from September 13, 1999, to April 7, 2003 (continuing in re-runs through 2008). Kids' WB briefly ran Dragon Ball Z in 2001 on its short-lived Toonami block.</p><p>In 2005, Funimation began to re-dub episodes 1–67 with their in-house voice cast, including content originally cut from their dub with Saban. This dub's background score was composed by Nathan M. Johnson (Funimation had ceased working with Faulconer Productions after the final episode of Dragon Ball Z in 2003). Funimation's new uncut dub of these episodes aired on Cartoon Network beginning in June 2005. Funimation's later remastered DVDs of the series saw them redub portions of the dialogue, mostly after episode 67, and had the option to play the entire series' dub with both the American and Japanese background music.</p><p>In January 2011, Funimation and Toei announced that they would stream Dragon Ball Z within 30 minutes before their simulcast of One Piece.</p><p>The Funimation dubbed episodes also aired in Canada, Ireland, the United Kingdom, the Netherlands, Belgium, Australia, and New Zealand. However, beginning with episode 108 (123 uncut), Westwood Media (in association with Ocean Studios) produced an alternate English dub, distributed to Europe by AB Groupe. The alternate dub was created for broadcast in the UK, the Netherlands and Ireland, although it also aired in Canada beginning from episode 168 (183 uncut) to fulfill Canadian content requirements. Funimation's in-house dub continued to air in the U.S., Australia, and New Zealand. The Westwood Media production used the same voice cast from the original 53-episode dub produced by Funimation, it featured an alternate soundtrack by Tom Keenlyside and John Mitchell, though most of this score was pieces Ocean reused from other productions Keenlyside and Mitchell had scored for them, and it used the same scripts and video master as the TV edit of Funimation's in-house dub. The Westwood Media dub never received a home video release. In Australia, Dragon Ball Z was broadcast by the free-to-air commercial network, Network Ten during morning children's programming, Cheez TV, originally using the censored Funimation/Saban dub before switching to Funimation's in-house dub. Dragon Ball Z originally aired on the British Comedy Network in Fall 1998.</p><p>The series was also available on the Funimation video streaming service (formerly FunimationNOW) upon its launch in 2016. In March 2022, Dragon Ball Z is now on Crunchyroll, a service that Funimation acquired a year before which in turn was acquired in 2018 by its current parent company Sony Pictures Television.</p><h4>Dragon Ball Z Kai</h4><p>In February 2009, Toei Animation announced that it would begin broadcasting a revised version of Dragon Ball Z as part of the series's 20th anniversary celebrations. The series premiered on Fuji TV in Japan on April 5, 2009, under the title Dragon Ball Kai. The ending suffix Kai (改「かい」) in the name means \"updated\" or \"altered\" and reflects the improvements and corrections of the original work. The original footage was remastered for HDTV, featuring updated opening and ending sequences, new music, and a re-recording of the vocal tracks. The original material and any damaged frames were removed, along with the majority of the filler episodes to more closely follow the manga, resulting in a faster-moving story. Torishima later explained the origins of Kai: Bandai was having a hard time increasing their sales and asked if a new Dragon Ball anime could be made, but Toriyama refused to create a new story. Realizing that the anime-exclusive scenes that were added to increase the distance between the original anime and the manga hurt the pacing of the series, Torishima thought of cutting them so that it faithfully followed the manga. He said the reception to Kai was positive, \"so it all worked out\".</p><p>The series initially concluded on its 97th episode in Japan on March 27, 2011, with the finale of the Cell saga. It was originally planned to run 98 episodes; however, due to the Tōhoku offshore earthquake and tsunami, the final episode was not aired and was later released direct-to-video in Japan on August 2, 2011.</p><p>In November 2012, Mayumi Tanaka, the Japanese voice actor of Krillin announced that she and the rest of the cast were recording more episodes of Dragon Ball Kai. In February 2014, the Kai adaptation of the Majin Buu saga was officially confirmed. The new run of the series, which is titled Dragon Ball Z Kai: The Final Chapters internationally, began airing in Japan on Fuji TV on April 6, 2014 and ended its run on June 28, 2015. The final arc of Kai was originally produced to last 69 episodes (as most of the international versions run), but the Japanese broadcast cut it down to 61 episodes.</p><h4>English dub production and broadcasting</h4><p>Funimation licensed Kai for an English-language release in February 2010. The series was initially broadcast in the U.S. on Nicktoons from May 24, 2010, to January 1, 2012, continuing in re-runs until April 2013. In addition to Nicktoons, the series also began airing on the 4Kids-owned Saturday morning programming block Toonzai on The CW in August 2010, then on its successor, the Saban-owned Vortexx, beginning in August 2012 until the block ended in September 2014. Both the Nicktoons and CW airings were edited for content. Kai began airing uncut on Adult Swim's Toonami block on November 8, 2014, and re-runs of the previous weeks' episodes aired at the beginning of Adult Swim from February 2015 to June 2016. In the United Kingdom, CSC Media Group acquired the broadcast rights to Kai and began airing it on Kix! in early 2013.</p><p>Despite Kai's continuation not being officially confirmed at the time even in Japan, Funimation voice actors Sean Schemmel (Goku) and Kyle Hebert (Gohan), announced in April 2013 that they had started recording an English dub for new episodes. In November 2013, Kai's Australasian distributor Madman Entertainment revealed that the Majin Buu arc of Kai would be released in 2014 and that they were waiting on dubs to be finished. In February 2014, Funimation officially stated that they had not yet started recording a dub for the final arc of Kai. On December 6, 2016, Funimation announced the continuation of Kai would begin airing on Adult Swim's Toonami block. The series aired from January 7, 2017, to June 23, 2018, alongside Dragon Ball Super.</p><p>An alternate English dub of Kai by Ocean Productions was recorded for the original 98 episodes, featuring many of the original Vancouver cast reprising their roles, but it has yet to air.</p><h4>Editing</h4><p>Dragon Ball Z's original North American release was the subject of heavy editing which resulted in a large amount of removed content and alterations that greatly changed the original work. Funimation CEO Gen Fukunaga is often criticized for his role in the editing; but it was the initial distributor Saban which required such changes or they would not air the work, as was the case with the episode dealing with orphans. These changes included altering every aspect of the show from character names, clothing, scenes and dialogue of the show. The character Mr. Satan was renamed Hercule and this change has been retained in other English media such as Viz's Dragon Ball Z manga and video games, though the English dubs of Dragon Ball Kai and Dragon Ball Super changed the name back to Mr. Satan. The dialogue changes would sometimes contradict the scenes itself; after the apparent fatal explosion of a helicopter, one of the characters said, \"I can see their parachutes; they're okay!\" Funimation's redub for the 2005 release would address many of the issues raised by Saban, with the uncut releases preserving the integrity of the original Japanese release.</p><p>During the original Japanese TV airing of Dragon Ball Kai, scenes involving blood and brief nudity were removed. Nicktoons would also alter Kai for its broadcast; it released a preview showcasing these changes which included removing the blood and cheek scar from Bardock and altering the color of Master Roshi's alcohol. The show was further edited for its broadcast on The CW; most notoriously, the character Mr. Popo was tinted blue. The show's DVD and Blu-ray releases only contained the edits present in the original Japanese version. A rumor that Cartoon Network would be airing Kai uncut was met with an official statement to debunk the rumor in June 2010;. However, it would later air uncut on the channel as part of Adult Swim's Toonami block.</p><p>Steven Simmons, who did the subtitling for Funimation's home video releases, offered commentary on the subtitling from a project and technical standpoint, addressing several concerns. Simmons said that Gen Fukunaga did not want any swearing on the discs, but because there was no taboo word list, Simmons would substitute a variation in the strength of the words by situation with the changes starting in episode 21. The typographical errors in the script were caused by dashes (—) and double-quotes (\") failing to appear, which resulted in confusing dialogue.</p><br/><h3>Music</h3><p>Dragon Ball Z has released a series of 21 soundtracks as part of the Dragon Ball Z Hit Song Collection Series. In total, dozens of releases exist for Dragon Ball Z which includes Japanese and foreign adapted releases of the anime themes and video game soundtracks.</p><p>Shunsuke Kikuchi composed the score for Dragon Ball Z. The opening theme for the first 199 episodes is \"Cha-La Head-Cha-La\" performed by Hironobu Kageyama. The second opening theme used up until the series finale at episode 291 is \"We Gotta Power\" also performed by Kageyama. Both opening themes were replaced with an original piece in the remastered Funimation dub due to licensing issues. The ending theme used for the first 199 episodes is \"Detekoi Tobikiri Zenkai Power!\" (でてこいとびきりZENKAIパワー!, \"Come Out, Incredible Full Power!\") performed by MANNA. The second ending theme used for the remaining episodes is \"Bokutachi wa Tenshi Datta\" (僕達は天使だった, \"We Were Angels\") performed by Kageyama. The initial English-Language release used a completely new musical score composed by Faulconer Productions. It was used for the North American broadcasts of the show from 1999 to 2005.</p><p>Kenji Yamamoto composed the score for Dragon Ball Kai. The opening theme, \"Dragon Soul\", and the first ending theme used for the first 54 episodes, \"Yeah! Break! Care! Break!\", are both performed by Takayoshi Tanimoto of the unit, Dragon Soul, in Japanese. Sean Schemmel, Justin Cook, Vic Mignogna, Greg Ayres, Sonny Strait and Brina Palencia performed the English version of the opening theme, while Jerry Jewell performed the English version of the ending theme. The second ending theme, used from episodes 55–98, is \"Kokoro no Hane\" (心の羽根, \"Wings of the Heart\") performed by Team Dragon, a unit of the idol girl group AKB48, in Japanese and Leah Clark in English. On March 9, 2011, Toei announced that due to Yamamoto's score infringing on the rights of an unknown third party or parties, the music for remaining episodes and reruns of previous episodes would be replaced. Later reports from Toei stated that except for the series' opening and closing songs, as well as eyecatch music, Yamamoto's score was replaced with Shunsuke Kikuchi's from Dragon Ball Z.</p><p>The music for The Final Chapters is composed by Norihito Sumitomo. The opening theme is \"Kuu•Zen•Zetsu•Go\" (空•前•絶•後) by Takayoshi Tanimoto of Dragon Soul, while the first ending song is \"Haikei, Tsuratsusutora\" (拝啓、ツラツストラ, \"Dear Zarathustra\") by Japanese rock band Good Morning America, and the second \"Junjō\" (純情, \"Pure Heart\") by Leo Ieiri from episode 112 to 123. The third ending song is \"Oh Yeah!!!!!!!\" by Czecho No Republic from episode 124 to 136, the fourth \"Galaxy\" by Kyūso Nekokami from 137 to 146, and the fifth is \"Don't Let Me Down\" by Gacharic Spin from 147 to 159. The international broadcast features two pieces of theme music. The opening theme, titled \"Fight It Out\", is performed by rock singer Masatoshi Ono, while the ending theme is \"Never Give Up!!!\", performed by rhythm and blues vocalist Junear.</p><br/><h3>Related media</h3><h4>Home media</h4><p>In Japan, Dragon Ball Z did not receive a home video release until 2003, seven years after its broadcast. Pony Canyon announced a remastering of the series in two 26-disc DVD box sets, that were made-to-order only, released on March 19 and September 18 and referred to as \"Dragon Box\". Since then, Pony Canyon content of these sets began being released on mass-produced individual 6-episode DVDs on November 2, 2005 and finished with the 49th volume released on February 7, 2007. In July 2009, Funimation announced that they would be releasing the Japanese frame-by-frame \"Dragon Box\" restoration of Dragon Ball Z in North America. These seven limited edition collector's DVD box sets were released uncut and unedited in the show's original 4:3 fullscreen format between November 10, 2009, and October 11, 2011.</p><p>The international home release structure of Dragon Ball Z is complicated by the licensing and release of the companies involved in producing and distributing the work. Releases of the media occurred on both VHS and DVD with separate edited and uncut versions being released simultaneously. Both versions of the edited and uncut material are treated as different entries and would frequently make Billboard rankings as separate entries. Home release sales were featured prominently on the Nielsen VideoScan charts. Further complicating the release of the material was Funimation itself; which was known to release \"DVDs out of sequence in order to get them out as fast as possible\"; as in the case of their third season. Pioneer Entertainment distributed the Funimation/Saban edited-only dub of 53 episodes on seventeen VHS between 1997 and 1999, and seventeen DVDs throughout 1999. Two box sets separating them into the Saiyan and Namek arcs were also released on VHS in 1999, and on DVD in 2001. In 1999, Funimation's own distribution of their initial onward dub, which began with episode 54, in edited or uncut VHS ran between 1999 and 2006. A DVD version was produced alongside these, although they were only produced uncut and contained the option to watch the original Japanese with subtitles.</p><p>In 2005, Funimation began releasing their onward dub of the beginning of Dragon Ball Z on DVD, marking the first time the episodes were seen uncut in North America. However, only nine volumes were released, leaving it incomplete. Instead, Funimation remastered and cropped the entire series into 16:9 widescreen format and began re-releasing it to DVD in nine individual \"season\" box sets; the first set released on February 6, 2007, and the final on May 19, 2009. On August 13, 2013, Funimation released all 53 episodes and the three movies from their first Dragon Ball Z dub created with Saban and Ocean Studios in a collector's DVD box set, titled the Rock the Dragon Edition.</p><p>In July 2011, Funimation announced plans to release Dragon Ball Z in Blu-ray format, with the first set released on November 8, 2011. However, production of these 4:3 sets was suspended after the second volume, citing financial and technical concerns over restoring the original film material frame by frame, with Funimation noting that the price of the sets would not justify the restoration costs. Only a year later, the company began producing a cropped 16:9 remastered Blu-ray release in 2013, with nine sets released in total.</p><p>In March 2019, Funimation announced plans to release a 30th anniversary Blu-ray release of Dragon Ball Z, with the box set being remastered in 4:3 aspect ratio, and containing an artbook and a collectible figure. It would be crowdfunded, originally requiring a minimum of 2500 pre-orders in order to be manufactured, but was later increased to a minimum of 3,000 units. The release sparked controversy amongst fans due to the framing of the video, color saturation and digital video noise reduction. Funimation responded by stating that they cropped the release by going in \"scene-by-scene to make judgements based on the image available in each frame of how much to trim to get to a consistent 4:3 aspect ratio, while still attempting to cut as little out of the picture as possible,\" and that they felt the digital video noise reduction was \"mandatory for this release based on the different levels of fan support from various past DBZ releases with different levels of noise reduction over the years.\"</p><h4>Kai</h4><p>In Japan, Dragon Ball Kai was released on wide-screen on 33 DVDs and fullscreen on a single Blu-ray and eight four-disc Blu-ray sets from September 18, 2009, to August 2, 2011.</p><p>Funimation released eight DVD and Blu-ray box sets of Dragon Ball Z Kai from May 18, 2010, to June 5, 2012. These sets contain the original Japanese audio track with English subtitles, as well as the uncut version of the English dub, which does not contain any of the edits made for the TV airings. Before the final volume was even published, Funimation began re-releasing the series in four DVD and Blu-ray \"season\" sets between May 22, 2012, and March 12, 2013. Funimation released The Final Chapters in three DVD and Blu-ray volumes from April 25 to June 20, 2017.</p><h4>Manga</h4><p>While the manga was all titled Dragon Ball in Japan, due to the popularity of the Dragon Ball Z anime in the west, Viz Media initially changed the title of the last 26 volumes of the manga to \"Dragon Ball Z\" to avoid confusion. The volumes were originally published in Japan between 1988 and 1995. It began serialization in the American Shonen Jump, beginning in the middle of the series with the appearance of Trunks; the tankōbon volumes of both Dragon Ball Z and Dragon Ball were released simultaneously by Viz Media in the United States. In March 2001, Viz continued this separation by re-shipping the Dragon Ball and Dragon Ball Z titles starting with the first volumes of each work. Viz's marketing for the manga made distinct the differences between Dragon Ball and Dragon Ball Z tone. Viz billed Dragon Ball Z: \"More action-packed than the stories of Goku's youth, Dragon Ball Z is pure adrenaline, with battles of truly Earth-shaking proportions!\" Between 2008 and 2010, Viz re-released the two series in a format called \"Viz Big Edition,\" which collects three individual volumes into a single large volume. However, in 2013 Viz began publishing new 3-in-1 volumes collecting the entire manga series, including what they previously released as Dragon Ball Z, under the Dragon Ball name.</p><h4>Films</h4><p>The Dragon Ball Z films comprise a total of 15 entries as of 2015. The first 13 films were typically released every March and July during the series' original run by the spring and summer vacations of Japanese schools. They were typically double features paired up with other anime films, and were thus, usually an hour or less in length. These films themselves offer contradictions in both chronology and design that make them incompatible with a single continuity. All 15 films were licensed in North America by Funimation, and all have received in-house dubs by the company. Before Funimation, the third film was a part of the short-lived Saban syndication, being split into three episodes, and the first three films received uncut English dubs in 1998 produced by Funimation with Ocean Studios and released by Pioneer. Several of the films have been broadcast on Cartoon Network and Nicktoons in the United States, Toonami UK in the United Kingdom (these featured an alternate English dub produced by an unknown cast by AB Groupe), and Cartoon Network in Australia.</p><h4>Television specials and original video animations</h4><p>Three TV specials based on Dragon Ball Z were produced and broadcast on Fuji TV. The first two were Dragon Ball Z: Bardock – The Father of Goku in 1990 and Dragon Ball Z: The History of Trunks in 1993, the latter being based on a special chapter of the original manga. Both were licensed by Funimation in North America and AB Groupe in Europe. In 2013, a two-part hour-long crossover with One Piece and Toriko, titled Dream 9 Toriko & One Piece & Dragon Ball Z Chō Collaboration Special!!, was created and aired.</p><p>Additionally, two original video animations (OVAs) bearing the Dragon Ball Z title have been made. The first is Dragon Ball Z Side Story: Plan to Eradicate the Saiyans, which was originally released in 1993 in two parts as \"Official Visual Guides\" for the video game of the same title. Dragon Ball: Plan to Eradicate the Super Saiyans was a 2010 remake of this OVA. None of the OVAs have been dubbed into English, and the only one to see a release in North America is the 2010 remake, which was subtitled and included as a bonus feature in Dragon Ball: Raging Blast 2.</p><h4>Video games</h4><p>Over 57 video games are bearing the Dragon Ball Z name across a range of platforms from the Nintendo Entertainment System to the current generation consoles, with the most recent release being Dragon Ball Z: Kakarot in 2020.</p><p>In North America, licensing rights had been given to both Namco Bandai and Atari. In 1999, Atari acquired exclusive rights to the video games through Funimation, a deal which was extended for five more years in 2005. A 2007 dispute would end with Atari paying Funimation $3.5 million. In July 2009, Namco Bandai was reported to have obtained exclusive rights to release the games for a period of five years. This presumably would have taken effect after Atari's licensing rights expired at the end of January 2010.</p><br/><h3>Reception</h3><p>Dragon Ball Z was listed as the 78th best animated show in IGN's \"Top 100 Animated Series\", and was also listed as the 50th greatest animated show in Wizard magazine's \"Top 100 Greatest Animated shows\" list. The series ranked sixth on Wizard's Anime Magazine on their \"Top 50 Anime released in North America\".</p><p>In Asia, the Dragon Ball Z franchise, including the anime and merchandising, earned a profit of $3 billion by 1999. In the United States, the series sold over 14 million videos by 2002, and over 25 million DVDs as of January 2012.</p><p>In 2005, media historian Hal Erickson wrote that \"Dragon Ball may be the closest thing on American television to an animated soap opera — though this particular genre is an old, established and venerated one in Japan, the series' country of origin.\" Christopher J. Olson and CarrieLynn D. Reinhard note that \"Western fans flocked to Dragon Ball Z because it offered exciting action not found in movies or television shows (animated or otherwise) at that time.\" A key characteristic that set Dragon Ball Z (and later other anime shows) apart from American television shows at the time was a serialization format, where a continuous story arc stretches over multiple episodes or seasons. Traditional American television had an episodic format, with each episode typically consisting of a self-contained story. Serialization has since also become a common characteristic of American streaming television shows during the \"Peak TV\" era.</p><p>Funimation's in-house English dub though has received mixed reviews from some critics over the years. IGN criticized the dub for \"having poor quality, along with some over the top, and quite annoying voice acting.\" Frieza's female voice in particular left many fans confused over the character's gender. Other criticisms have been towards the English dub's script, and inaccurately translating the source material, such as portraying Goku's character as a more stoic superhero.</p><h4>Cultural impact and legacy</h4><p>Dragon Ball Z's popularity is reflected through a variety of data through online interactions which show the popularity of the media. In 2001, it was reported that the official website of Dragon Ball Z recorded 4.7 million hits per day and included 500,000+ registered fans. The term \"Dragonball Z\" ranked fourth in 1999 and second in 2000 by Lycos' web search engine. For 2001, \"Dragonball\" was the most popular search on Lycos and \"Dragonball Z\" was fifth on Yahoo!. and \"Dragonball\" was the third most popular search term in 2002.</p><p>It's Over 9000! became a famous Internet meme and is referenced both within and outside Dragonball related media.</p><p>In 2015, Ford Motor Company released two commercials featuring characters from the series, the first advertising the Ford Fusion and the second for the Ford Focus.</p><p>Dragon Ball fans set a Guinness World Record for Largest Kamehameha attack move at San Diego Comic-Con on July 17, 2019.</p><h4>Ratings</h4><p>Dragon Ball Z's Japanese run was very popular with an average viewer rating of 20.5% across the series. Dragon Ball Z also proved to be a rating success in the United States, outperforming top shows such as Friends and The X-Files in some parts of the country in sweeps ratings during its first season. The premiere of season three of Dragon Ball Z in 1999, done by Funimation's in-house dub, was the highest-rated program ever at the time on Cartoon Network. In 2002, in the week ending September 22, Dragon Ball Z was the #1 program of the week on all of television with tweens 9-14, boys 9-14 and men 12-24, with the Monday, Tuesday and Wednesday telecasts of Dragon Ball Z ranked as the top three programs in all of television, broadcast or cable, for delivery of boys 9-14. In 2001, Cartoon Network obtained licensing to run 96 more episodes and air the original Dragon Ball anime and was the top rated show in the Toonami block of Cartoon network. Beginning March 26, 2001, Cartoon Network ran a 12-week special promotion \"Toonami Reactor\" which included a focus on Dragon Ball Z, which would stream episodes online to high-speed internet users. Many home video releases were met with both the edited and unedited versions placing on in the top 10 video charts of Billboard. For example, \"The Dark Prince Returns\" (containing episodes 226-228) and \"Rivals\" (containing episodes 229-231) edited and unedited, made the Billboard magazine top video list for October 20, 2001.</p><p>The first episode of Dragon Ball Kai earned a viewer ratings percentage of 11.3, ahead of One Piece and behind Crayon Shin-chan. Although following episodes had lower ratings, Kai was among the top 10 anime in viewer ratings every week in Japan for most of its run. Towards the end of the original run the ratings hovered around 9%-10%. Dragon Ball Z Kai premiered on Nicktoons in May 2010 and set the record for the highest-rated premiere in total viewers, and in tweens and boys ages 9–14. Nielsen Mega Manila viewer ratings ranked Dragon Ball Kai with a viewer ratings with a high of 18.4% for October 30 – November 4 in 2012. At the end of April 2013, Dragon Ball Kai would trail just behind One Piece at 14.2%. Broadcasters' Audience Research Board ranked Dragon Ball Z Kai as the second most viewed show in the week it debuted on Kix. On its debut on Vortexx, Dragon Ball Z Kai was the third highest rated show on the Saturday morning block with 841,000 viewers and a 0.5 household rating.</p><br/><h3>Merchandising</h3><p>Dragon Ball Z merchandise was a success prior to its peak American interest, with more than $3 billion in sales from 1996 to 2000. In 1996, Dragon Ball Z grossed $2.95 billion in merchandise sales worldwide. As of January 2012, Dragon Ball Z grossed $5 billion in merchandise sales worldwide.</p><p>In 1998, Animage-ine Entertainment, a division of Simitar, announced the sale of Chroma-Cels, mock animation cels to capitalize on the popularity of Dragon Ball Z. The original sale was forecasted for late 1998, but were pushed back to January 12, 1999.</p><p>In 2000, MGA Entertainment released more than twenty toys, consisting of table-top games and walkie-talkies. Irwin Toy released more than 72 figures consisting of 2-inch and 5 inch action figures, which became top-selling toys in a market dominated by the Pokémon Trading Card Game. Irwin Toys would release other unique Dragon Ball Z toys including a battery powered Flying Nimbus Cloud which hovered without touching the ground and a die-cast line of vehicles with collector capsules. In June 2000, Burger King had a toy promotion which would see 20 million figurines; Burger King bore the cost of the promotion which provided free marketing for Funimation. The Halloween Association found Dragon Ball Z costumes to be the fourth most popular costumes in their nationwide survey.</p><p>In December 2002, Jakks Pacific signed a three-year deal for licensing Dragon Ball Z toys, which was possible because of the bankruptcy of Irwin Toy. Jakks Pacific's Dragon Ball Z 5-inch figures were cited as impressive for their painting and articulation.</p><p>In 2010, Toei closed deals in Central and South American countries which included Algazarra, Richtex, Pil Andina, DTM, Doobalo and Bondy Fiesta. In 2012, Brazil's Abr-Art Bag Rio Comercio Importacao e Exportacao closed a deal with Toei.</p><br/>"
  },
  "errorMessage": ""
}