{
  "imDbId": "tt2401256",
  "title": "The Night Of",
  "fullTitle": "The Night Of (TV Series 2016–2016)",
  "type": "TVSeries",
  "year": "2016",
  "items": [
    {
      "username": "lvilardo-551-49220",
      "userUrl": "https://www.imdb.com/user/ur22212110",
      "reviewLink": "https://www.imdb.com/review/rw3500701",
      "warningSpoilers": false,
      "date": "7 July 2016",
      "rate": "9",
      "helpful": "484 out of 514 found this helpful.",
      "title": "It's not the story; it's the telling",
      "content": "What struck me after watching the first episode of \"The Night Of\" is that this is a story that has been told on countless iterations of \"Law and Order\". The difference is the luxury of not having to tell it in 40 minutes and the bringing to bear of HBO's prodigious production values combined with a first-rate cast of mostly little-known actors. The portrayal of the police is unlike anything I've seen before: annoyance about working past the end of a shift, the passing of the buck so someone else gets a case that will doubtless go into the wee hours of the morning, the careless handling of evidence due to available manpower. Here the police are neither heroes nor villains, rather they're just working men and women doing a job. The atmosphere of the precinct house in the middle of the night is palpable as is the overwhelming sense of helplessness felt by the naive lead character as his night goes from bad to worse. John Torturro's portrayal of a low rent defense attorney who stumbles onto a case much bigger than he imagined holds great promise for future episodes. As I said at the beginning, it's hardly a story we've not seen before but we've never seen it told this well. I look forward to watching it develop."
    },
    {
      "username": "filgray84",
      "userUrl": "https://www.imdb.com/user/ur28495330",
      "reviewLink": "https://www.imdb.com/review/rw3504036",
      "warningSpoilers": false,
      "date": "13 July 2016",
      "rate": "10",
      "helpful": "357 out of 395 found this helpful.",
      "title": "It's a curve ball, but I'm so glad I give this show a chance",
      "content": "This show has received mixed reviews. Some have loved it. Some have hated it. I don't often leave reviews however I do often read reviews when deciding whether to watch something. I decided to write this review based on the poor reviews because I felt very strongly about this that I just had to put my opinion across. This show is amazing. It's draws you in, puts you in the main characters position and never lets go. The acting is fantastic, the mood, the music the visuals are also great. I watch a lot of shows, most of them are entertaining enough but not very often do I come across a show like this that gets you completely enthralled and then has you screaming at the screen as the end credits role because you cant stand the thought of having to wait 7 days for the next episode. Like I said at the beginning. Some people are slamming this show for being \"unoriginal\" \"boring\" \"stupid\". My reply to these are as follows:Unoriginal? OK, so the premise is nothing new, its not earth shattering but trust me, you've never seen it told like this before! Boring? Absolutely not, this person must have the attention span of a 3 year old because I couldn't get enough of the suspense and drama. I just could not wait to find out what happens next and you genuinely care about the characters! And finally stupid? I'm sorry but this is very narrow minded. This is a naive young man who makes some pretty silly decisions under the influence of alcohol and drugs. We've all been there. Which is what makes this show so great. It resonates with us all. It's very real.In closing I would just like to say. Watch the first episode. I think you will absolutely love it."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw3826846",
      "warningSpoilers": false,
      "date": "9 October 2017",
      "rate": "10",
      "helpful": "48 out of 60 found this helpful.",
      "title": "A fabulous series which highlights the art of telling a story",
      "content": "A mild mannered, young man 'Naz' takes his father's cab to head to a House Party, en route he encounters a mysterious, attractive girl. Captivated by her, Has heads back to her place, where the two make out, his life changes the following morning.The bug question is, did her or didn't he?This is the art of storytelling at its finest, as a story, it's not exactly unique, but the way it's told, the way it unravels, the realism, that feels unique.Riz Ahmed is a revelation as Naz, brilliant from the first scene to the last, I believed every aspect of the character, he had an innocence and a sincerity that was crucial for the role. The transformation in his character throughout was amazingly played out. You'd struggle to recognise Naz in the last from the first episode.I loved John Turturro and his character John Stone, a superb performance, he made John so interesting, his eczema/psoriasis gave him a unique side story.I won't pretend to know a great deal about the American legal and penal service, but I think what the writer was trying to show was that you put a shy kid into the prison service, and he'll come out of it worse then when he went in.I can think of no negatives whatsoever, possibly only the ambiguity at the end, did he do it or not? I think I it was made 99% clear that he was innocent, but I'm sure a second series will reply explore.The Night of is fantastic 10/10."
    },
    {
      "username": "jql_longhurst",
      "userUrl": "https://www.imdb.com/user/ur55353049",
      "reviewLink": "https://www.imdb.com/review/rw4332906",
      "warningSpoilers": false,
      "date": "11 September 2018",
      "rate": "10",
      "helpful": "75 out of 91 found this helpful.",
      "title": "Sets a new bar",
      "content": "Stunning, unpredictable, fresh, cynical. Perfect casting and sub plots. Scarily close to the bone on key social and religious tensions all around us. Authentic, gripping, binge-worthy"
    },
    {
      "username": "chancellorpink",
      "userUrl": "https://www.imdb.com/user/ur22223892",
      "reviewLink": "https://www.imdb.com/review/rw3502491",
      "warningSpoilers": false,
      "date": "10 July 2016",
      "rate": "9",
      "helpful": "79 out of 101 found this helpful.",
      "title": "Engrossing and Talented Beginning to a Mystery",
      "content": "I thought the opening episode of the new HBO limited series The Night Of, which Roger Ebert's website called Agatha Christie meets The Wire, was engrossing and compelling. Richard Price is a solid writer, having knocked out juicy realism before in scripts for solid films like Sea of Love, Color of Money & the Scorsese \"Life's Lessons\" segment of New York Stories, and Steven Zaillian, an even better writer, directs here with the same precision for detail he brought to the underrated A Civil Action (Travolta, Duvall).Great subtle acting abounds, and a modern day Twin Peaks meets True Detective emerges. I've always been a big John Turturro fan, and his grizzled and weary performance here as the suspect's attorney just might end up being Emmy worthy (time will tell). Riz Ahmed, as the main protagonist, brings the same innocent, befuddled but smarter-than-you-think characterization to the mystery storyline here that he aced as Gyllenhaal's doomed side-kick in Nightcrawler, and we just can't stop watching, because every time we ever felt stupid, cornered or scared is echoed in his soft spoken mannerisms of trapped anguish.I'm looking forward to watching the remaining 7 episodes every Sunday night at 9 on HBO."
    },
    {
      "username": "brentarmour-446-399487",
      "userUrl": "https://www.imdb.com/user/ur35637599",
      "reviewLink": "https://www.imdb.com/review/rw3503092",
      "warningSpoilers": false,
      "date": "11 July 2016",
      "rate": "10",
      "helpful": "132 out of 161 found this helpful.",
      "title": "Most gripping mystery since 'The Killing'",
      "content": "If you were a fan of 'The Killing', especially the first three seasons, then 'The Night Of' will be right up your alley. Gripping, engaging, methodical story telling that is somehow simultaneously slow and fast paced. Even when not much is happening, you will find yourself bracing in anticipation. Sad it's a limited series. I hope HBO decides to produce more content like this. In the meantime, I'll be eagerly awaiting the next installment. The acting is superb but the pacing is the real gem. Long before the first installment gets to the meat of the plot, intense, ominous moments of foreshadowing are peppered at the perfect times to really keep you biting your nails without even knowing why. I sighed in bittersweet relief when the credits rolled. And this is only the first episode."
    },
    {
      "username": "gridoon2023",
      "userUrl": "https://www.imdb.com/user/ur17901972",
      "reviewLink": "https://www.imdb.com/review/rw4904492",
      "warningSpoilers": true,
      "date": "1 June 2019",
      "rate": "7",
      "helpful": "50 out of 71 found this helpful.",
      "title": "Opens with a bang, ends with....if not a whimper, something close to it",
      "content": "The first episode of \"The Night Of\" is phenomenal, and uncommonly suspenseful; the remaining seven episodes never reach the same level. They are engrossing but slow, more of a docudrama on the American justice system, daily prison life, ethnic prejudices, etc. than the promised murder mystery. The resolution of the whodunit is disappointing, using the classic cheating technique of a previously unseen character who pops out of nowhere and turns out to be the real killer (also: are we supposed to not care what happens to the female lawyer?). The series is extremely well-made and acted, but at Top 156 of all time on IMDb as of this comment, I'd also have to say slightly overrated. *** out of 4 (first episode only is a ***1/2 out of 4)."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8576982",
      "warningSpoilers": false,
      "date": "30 September 2022",
      "rate": "8",
      "helpful": "17 out of 21 found this helpful.",
      "title": "Great Crime Drama!",
      "content": "The Night Of is a great mini-series that won a bunch of awards including five Emmy's. This series will hook you from the start and keep you on the edge of your seat throughout the entire series. The twists and turns will keep you guessing and mesmerized until the very end. It has a great cast, led by Riz Ahmed and John Turturro, who are all just terrific in this. It's also beautifully written. It's about a college student who meets a girl and the next thing he knows he's in custody for murder. If you're looking for a great crime drama to pass the time then give this a chance. You won't be disappointed."
    },
    {
      "username": "drvii",
      "userUrl": "https://www.imdb.com/user/ur80175408",
      "reviewLink": "https://www.imdb.com/review/rw3799452",
      "warningSpoilers": true,
      "date": "6 September 2017",
      "rate": "7",
      "helpful": "215 out of 242 found this helpful.",
      "title": "Missed Big Clue",
      "content": "They totally missed, or ignored, the biggest defense clue of any vicious, bloody murder. There was blood all over the room, the walls, the bed and nothing on him. they picked him up shortly afterward and never mentioned this. No wet towels or blood in the shower drain or.....nothing! Big gap in the reality of the whole thing. And one that ruined it for me."
    },
    {
      "username": "MattBayliss",
      "userUrl": "https://www.imdb.com/user/ur9867873",
      "reviewLink": "https://www.imdb.com/review/rw3498366",
      "warningSpoilers": false,
      "date": "3 July 2016",
      "rate": "9",
      "helpful": "162 out of 195 found this helpful.",
      "title": "Dramatically convincing and a pleasantly dark atmosphere (Revelry Review)",
      "content": "HBO's new crime drama 'The Night Of' has sucked me in right from the very beginning. The pilot starts up very slow but builds suspense as it starts to tell the story, and that's where it shines; in it's storytelling. It was dramatically convincing and had a pleasantly dark atmosphere.The pilot was very long (1hr 20min) but it felt much shorter, it was tense from start to finish, in the sense of the story it was actually very predictable, but it was the acting and how the story was portrayed that made it so gripping and watchable. Not a second went by where my attention wasn't glued to the TV screen. What really made me love the pilot was how REAL the story felt, there wasn't a moment that made me think that it was a stupid story, it felt REAL. The acting was superb by everyone, the cinematography was perfect with it's overall dark tone and lighting, and the music just set the scene playing in the background to the tone of the show.The overall mood of the show has been set for the series, and if it stays at this standard for the rest of the series it will be an ultimate success. I look forward to where the rest of this series takes us! No complaints yet!9/10"
    },
    {
      "username": "jenkothetarheel",
      "userUrl": "https://www.imdb.com/user/ur44693592",
      "reviewLink": "https://www.imdb.com/review/rw6051544",
      "warningSpoilers": false,
      "date": "31 August 2020",
      "rate": "7",
      "helpful": "16 out of 19 found this helpful.",
      "title": "Good but not great",
      "content": "Let me start off by saying there are alot of positives to this show: acting(specifically John Turturro's plea for Nas near the end), suspense, drama, and Riz Ahmed's breakout role. However the ending was a bit underwhelming for me. It seemed like the show was building up to this grand finale and the ending was just anticlimactic. Thats about all I can say without giving anything away; but this show was neither bad nor great to me."
    },
    {
      "username": "lamichhane-ranjan",
      "userUrl": "https://www.imdb.com/user/ur23508023",
      "reviewLink": "https://www.imdb.com/review/rw3503987",
      "warningSpoilers": false,
      "date": "13 July 2016",
      "rate": "10",
      "helpful": "177 out of 204 found this helpful.",
      "title": "The story is just a small part of it",
      "content": "What I like about this kind of series is that the story is good by itself but its by no means outstanding. The most important aspect is the storytelling, the presentation, the psychological tour of the characters, the portrayal of different cultures, and family, and relationships, and professions. That's the most impressive thing about this series.One of the most fascinating things about shows like this is the characters itself are so rich. I've seen very few TV shows that covers extremely sophisticated characters like Matthew on True Detective, and this girl on 'The Night of', and Naz himself. For me, just focusing on the story line for the sole purpose of entertainment is like just focusing on guitar sounds in a piece of music.This is the reason why I love the first season of True Detective, and this is the same reason why I love this series just after one episode."
    },
    {
      "username": "altugozhan",
      "userUrl": "https://www.imdb.com/user/ur48745501",
      "reviewLink": "https://www.imdb.com/review/rw3497952",
      "warningSpoilers": true,
      "date": "3 July 2016",
      "rate": "10",
      "helpful": "56 out of 75 found this helpful.",
      "title": "Good storytelling",
      "content": "This show got me from the first episode. A great example of storytelling for mystery, crime and drama shows. It was slow in the beginning but after few minutes it gets exciting and tense with each second. You wonder what is next?A naive, Pakistani, Muslim young man in NYC suspected for murder for killing a girl he just met. He looks innocent but every clue shows otherwise and he's desperate and helpless. A veteran experienced detective sure of boys crime has a strong case against him. At the end of the episode help arrives from a low cost lawyer with little hope of salvation.Looks like another great chapter waits for us and I'm quite sure it's going to get better and better. I can't wait for the next episode.Pros -Nice storytelling. Very good acting. Good character development. Music fits for the drama and mystery. It gives you the feeling but you hardly notice it playing.Cons -None yet."
    },
    {
      "username": "ben-mckimm",
      "userUrl": "https://www.imdb.com/user/ur33572331",
      "reviewLink": "https://www.imdb.com/review/rw8534144",
      "warningSpoilers": true,
      "date": "11 September 2022",
      "rate": "8",
      "helpful": "10 out of 12 found this helpful.",
      "title": "Really good but...",
      "content": "This was really good but they completely bottled it with the ending. It could have been really powerful, showing the level of corruption and professional pride, in the judicial system, that ruins so many lives but they cheaped out with a \"good\" ending. Wrapping up all loose ends and essentially making sure the \"good guys\" win.The ideal ending would have been Naz getting killed in prison just before the real killer was exposed, creating a bittersweet but ultra realistic ending to this story. Instead everyone got their comeuppance and everything was wrapped in a neat bow (aside from the heroin thing and possibly the cat).The amount of comedy also felt a little out of place at times.Well worth watching but a complete bottle job in the final 30 minutes."
    },
    {
      "username": "liaflower-82721",
      "userUrl": "https://www.imdb.com/user/ur108875537",
      "reviewLink": "https://www.imdb.com/review/rw6874073",
      "warningSpoilers": false,
      "date": "2 May 2021",
      "rate": "6",
      "helpful": "20 out of 24 found this helpful.",
      "title": "Great at first",
      "content": "The first episode was really good and I got excited that I had found something else to watch , however as the series went on it became extremely dull .The feet situation was just a bit pointless and began to get on my nerves .The main character Naz started off promising but quickly turned from being a shy student to some rough looking affiliated gang member . It all got a bit stupid .As the end approached I eagerly awaited some unexpected twist however just got the 'end credits' .Very promising but lost its way and faded into dullnes."
    },
    {
      "username": "claudio_carvalho",
      "userUrl": "https://www.imdb.com/user/ur2488512",
      "reviewLink": "https://www.imdb.com/review/rw7116826",
      "warningSpoilers": true,
      "date": "12 July 2021",
      "rate": "9",
      "helpful": "13 out of 18 found this helpful.",
      "title": "Outstanding TV Miniseries",
      "content": "\"The Night Of\" is an outstanding TV miniseries divided in eight parts as follows: (1) \"The Beach\" (2) \"Subtle Beast\" (3) \"A Dark Crate\" (4) \"The Art of War\" (5) \"The Season of the Witch\" (6) \"Samson and Delilah\" (7) \"Ordinary Death\" (8) \"The Call of the Wild\"The storyline takes place in 2014, when the college student Nasir 'Naz' Khan (Riz Ahmed), who lives in Queen, is invited to a party in Manhattan. His ride blows him off and Naz decides to steal the taxi owned by his father and two partners and drives to Manhattan. He meets a young woman called Andrea Cornish (Sofia Black-D'Elia) by chance and he spends a night of sex with her in her place, playing Knife Game and using drinks and drugs. Naz awakes in the kitchen, and when he goes to the bedroom to say goodbye to Andrea, he finds her stabbed to death. Panicked and without recollection of what happened, Naz runs from the crime scene but is arrested after a traffic violation by two police officers and he goes to the 21st Precinct. After some hours, Detective Dennis Box (Bill Camp) finds evidence that Naz may be the murderer of Andrea and locks him in a cell. The ambulance chaser John Stone (John Turturro) sees Naz in the cell and offers his service, in the beginning of The Night Of.This film is impressively realistic, without the glamour of other crime series like \"Law and Order\" or \"Chicago P. D.\" and ambiguous since the killer's identity is not found. The performances are top-notch and the although the long running time, the viewer is kept in tension waiting to see the next parts asap. The most important, shows the consequences of a terrible police investigation to the protagonists of the story. The former college student Naz ends addicted in crack and with friction with his family and friends in the Pakistanis community. His father loses his taxi driver license and his partnership with two former friends and needs to pawn his few valuable goods. His mother loses her job and has to work as janitor. His brother has to be transferred to another school. The defense lawyer Chandra Kapoor (Amara Karan) loses her job and probably her bar. The retired Detective Dennis Box feels guilty for his poor investigation in his last assignment and is consumed by his faul. The prosecutor Helen Weiss (Jeannie Berlin) feels bad for her poor work and ignoring other information. Maybe only the lawyer John Stone and the inmate Freddy Knight (Michael Kenneth Williams) end the film without any change in their behavior. My vote is nine.Title (Brazil): \"The Night Of\""
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw3534090",
      "warningSpoilers": false,
      "date": "29 August 2016",
      "rate": "10",
      "helpful": "24 out of 38 found this helpful.",
      "title": "Brilliant - utterly compelling, engaging and intriguing and highly plausible",
      "content": "Nasir \"Naz\" Khan is a 20-something University student living in New York. One night he takes his father's taxi to go to a party. Along the way he meets a beautiful young woman, Andrea, and his plans change. They go back to her place and after a night of drugs and passion, Naz wakes up to find Andrea dead, stabbed to death. Naz panics and flees the scene, only to be picked up by the police for a traffic offence. ULtimately Naz ends up at the police station, where the police then realise they have the prime suspect in a murder, and Naz is held for questioning. On the case is the methodical, perceptive Detective Sergeant Box. Box builds a compelling case against Naz and arrests him for Andrea's murder. Also on the scene is small-time lawyer Jack Stone who convinces Naz to hire him. However, the weight of evidence against Naz is massive and Jack Stone may be out of his depth.Incredibly compelling drama. Shows in detail how the justice system operates, its processes and flaws. Shows how innocence or guilt doesn't really matter to the police and prosecutor - chance of conviction is what matters. Also shows the conditions prisoners face while awaiting trial and how this imprisonment with criminals can affect them, potentially turning innocent citizens into criminals.Very engaging - you empathise with Naz and his family and what they are going through. Moreover, the situation is so plausible and could easily happen to many everyday, innocent people. Very solid plot.Quite gripping too - the final outcome is in doubt until the very end and there are many twists and turns along the way. The final few scenes are incredibly enthralling and ultimately quite emotional.Solid performance by Riz Ahmed in the lead role. Stand out performance goes to John Turturro as Jack Stone. His character is decidedly non-glamorous and Turturro thrives on those sorts of roles. Wonderful everyman downtroddedness-yet-resourcefulness to his performance.Great supporting cast too. Nobody puts a foot wrong."
    },
    {
      "username": "joheker",
      "userUrl": "https://www.imdb.com/user/ur135659428",
      "reviewLink": "https://www.imdb.com/review/rw7238838",
      "warningSpoilers": true,
      "date": "17 August 2021",
      "rate": "4",
      "helpful": "22 out of 23 found this helpful.",
      "title": "Can't seem to identify the core of this series",
      "content": "I enjoyed this series for a different reason than was probably intended.From the first episode I was very interested in what was about to happen next, what clues will show up, how will the investigation proceed, etc.During the entire series I was waiting for a big twist or a big reveal of some sort but it never came. This made me wonder, what is this series actually about?The journey Naz does from a good school boy to a felon feels so obvious. The system put him in a cage with monsters so now he becomes the monster etc. There is nothing original about this.The police work is terrible, they ignore so many details in the investigation yet they act as if they did not in court. Anyone in the court room could have just raised their hand at any moment in this series and asked \"where was the blood on Naz?\" and the series would have been over. When they find out that Box gave the inhaler back to Naz it gets all hyped up, omg this is such a big thing, and they make us believe that they will use this as an entry point to dropping the bomb on the entire investigation, perhaps Box is involved himself? But then nothing happens, \"that was unprofessional, please don't do it again\" and the entire inhaler plot is now felled.We are given the interpretation that Naz panicked after finding the dead body and that made him make those bad decisions of saving the knife amongst other tings. But after this, Naz becomes eager to claim his innocence, yet he literally refuses to actually give his entire story. The only time the game with the knife is mentioned is by some random pathologist turns up and assumingly makes a guess that this is indeed what happened. Naz has so much more information to give about this night, yet just ignores to tell it? \"Did you bring anything else?, No!, What about the knife?, Oh yeah I brought that too\" is a conversation we hear in, what? The last episode?The entire series is filled to the brim of these scenarios and in the beginning I was thinking \"Its by purpose, they will make a big twist out of this in the end and reveal that Naz is actually a serial killer\" or something like that. (since they hint about other people getting murdered with knives several times). But it never happens. This inconsistency keeps repeating over and over again and in the end there is just.. Nothing? He is free to go, says \"Thanks\" to the attorney and that's it.I watched this to the end, and while there were moments I enjoyed and an overall mystery-like atmosphere that made me wonder, what's gonna happen now? I can't seem to figure out, what is this series actually about? In one sense, this could have been 8 random episodes from 8 random crime series and the outcome would have been pretty much the same.I give this series a 4 because of John Stone. The story about him single single handedly boosted this show, but the rest is actually pretty bad."
    },
    {
      "username": "marco_magdi",
      "userUrl": "https://www.imdb.com/user/ur19552051",
      "reviewLink": "https://www.imdb.com/review/rw7195147",
      "warningSpoilers": true,
      "date": "4 August 2021",
      "rate": "6",
      "helpful": "34 out of 46 found this helpful.",
      "title": "OVERRATED ... From very good starting to a disappointing drama",
      "content": "Good start then everything fell apart ... \"BIG Disappointment\"1) Naz ... He started the series basically unable to even talk to a girl and being a shy reclusive kind of guy then in 1 night he takes drugs & get laid with a strange girl who he didnt even knew her name.Also he decides it's gonna be a great idea to shave his head, get addicted to drugs and tattoo sin on his knuckles before a trial!!?2) The DA ... She lays the picture of his cut hand BELOW the nude man's crotch, just so we can get a clear view of his penis? ... FOR WHAT PURPOSE!!!!?3) The quirky lawyer with weird attributes and a skin condition.4) the female lawyer ... The pathetic crush of Chandra & seriously How she helped him to bring DRUGs to the prison !!!?5) The crime ... With that much blood splatter, no one ever wondered why his clothes had not a speck of blood.6) The cat ... WHY ???"
    },
    {
      "username": "abu3mer",
      "userUrl": "https://www.imdb.com/user/ur80577380",
      "reviewLink": "https://www.imdb.com/review/rw7597411",
      "warningSpoilers": false,
      "date": "29 November 2021",
      "rate": "7",
      "helpful": "12 out of 14 found this helpful.",
      "title": "they could have done this show in 3 eposides",
      "content": "I really dont get the high ratings of this show. Super long and in the middle of the show I was so close from just not finishing it. They also ended the show in a very unsatisfying way."
    },
    {
      "username": "margaritakor-63497",
      "userUrl": "https://www.imdb.com/user/ur85403477",
      "reviewLink": "https://www.imdb.com/review/rw7792752",
      "warningSpoilers": false,
      "date": "23 January 2022",
      "rate": "4",
      "helpful": "14 out of 17 found this helpful.",
      "title": "Disappointing",
      "content": "Only the first two episodes were interesting. After that the movie focused more on attorney John's feet and his relationship with the cat rather than the murder case and the trial. It was going very slow and very boring."
    },
    {
      "username": "navendu_krishnan",
      "userUrl": "https://www.imdb.com/user/ur25793041",
      "reviewLink": "https://www.imdb.com/review/rw7174987",
      "warningSpoilers": true,
      "date": "29 July 2021",
      "rate": "3",
      "helpful": "26 out of 40 found this helpful.",
      "title": "Overrated",
      "content": "Blood Red Sky / Transatlantic 473 - German - 2021 OTT - NetflixThe Night of (Mini Series) - 2016 OTT - HotstarI wonder how this series got so overrated. I begun watching this due to 8.5+ rating in IMDB and the history of awards for the same.The direction is so poor and dragging as even 8 episodes feels like 20.Story is a murder mystery it felt interesting when it started for 1-2 episodes From 3rd to 7th episodes it feels like they are just filling the episodes.Major portion of series went for the skin disease of John Stone - advocate which doesnt have any specific connection to the murder.And the twist for the murder happens only in the last episode, just for the climaxPathetic series i would say highly overrated, which brings3 out of 10."
    },
    {
      "username": "betucho1993",
      "userUrl": "https://www.imdb.com/user/ur39652567",
      "reviewLink": "https://www.imdb.com/review/rw3505695",
      "warningSpoilers": false,
      "date": "16 July 2016",
      "rate": "9",
      "helpful": "139 out of 175 found this helpful.",
      "title": "Oh my God.",
      "content": "I never expected it to be this good, of course the creators are awesome guys with some amazing series in the curriculum like The Wire. And even our man Gandolfini was inside this awesome work at some point (RIP Tony Soprano).The story is so thrilling and immersive that you can feel yourself inside the show, the actors make it feel real fellas, you feel scary as if everything is happening to you, your heart will just burst up when you see a cop.We will be introduced to smart dialogues and awesome actuation.It is a must watch and there is no person who wont love this show, HBO is killing it again and we must follow this astonishing story. Even a 10 isn't enough to give for this series,nit is already a new hit and is already on my top 3."
    },
    {
      "username": "851222",
      "userUrl": "https://www.imdb.com/user/ur4405474",
      "reviewLink": "https://www.imdb.com/review/rw3574052",
      "warningSpoilers": false,
      "date": "3 November 2016",
      "rate": "10",
      "helpful": "19 out of 31 found this helpful.",
      "title": "Hands Down Thumbs Up - \"The Night Of\" Restored My Faith In Television",
      "content": "Greetings from Lithuania.\"The Night Of\" (2016) is simply the best and the most involving TV series i've seen in years, yes - in years. Many. This is it. This is what \"True Detective\" wanted to be and failed miserably in season two. Damn, i even liked \"The Night Of\" better then the first amazing season of \"True Detective\".Everything worked in \"The Night Of\" on the highest possible note. Writing was simply perfect. Directing of each scene is absolutely top notch. There weren't any scenes in here meant to simply \"occupy airtime\". Everything here leads to something in the most realistic and plausible way.The story itself could have been shown on one of \"Law&Order\" episodes in ~60 min. Here it lasts for 9 hours. 9 amazing hours. Acting was incredible, especially by Bill Camp from who's detective Dennis Box i just couldn't take my eyes of and ... well... everyone.Overall, i can not praise this limited series any higher. This is the best show i have seen since ... i don't know which season of \"Game Of Thrones\". Although it is slowly paced, every damn scene is just done so involvingly that i just kinda didn't wanted this show to end. Unfortunately it did end. Perfectly."
    },
    {
      "username": "bola_de_pu",
      "userUrl": "https://www.imdb.com/user/ur30155746",
      "reviewLink": "https://www.imdb.com/review/rw3513385",
      "warningSpoilers": false,
      "date": "27 July 2016",
      "rate": "10",
      "helpful": "24 out of 37 found this helpful.",
      "title": "Another HBO Masterpiece",
      "content": "True Detective. GOT and The Wire just a few examples of great shows that HBO produce over the years. The Night Of only need 20 minutes to make you feel part of the story. Riz Ahmed is just so great in the personification of Nasir, and in some point I feel bad for that guy. The characters are amazing and the suspense presented along the show is outstanding.If you're a fan of thriller movies you don't want to miss this show. I think this is one of the best shows ever made and I found this by chance when I was looking for some new TV show to view. The problem is when probably the best TV shows are made, is hard to find new shows that can march the quality presented by GOT, The Wire, Breaking Bad, Luther, True Detective and some other shows. I don't want to say anymore, just view it, if you're capable of see deep, slow, suspense, but mesmerizing thriller."
    }
  ],
  "errorMessage": ""
}