{
  "imDbId": "tt0118273",
  "title": "Brass Eye",
  "fullTitle": "Brass Eye (TV Series 1997–2001)",
  "type": "TVSeries",
  "year": "1997",
  "language": "en",
  "titleInLanguage": "Brass Eye",
  "url": "https://en.wikipedia.org/wiki/Brass_Eye",
  "plotShort": {
    "plainText": "Brass Eye is a British satirical television series parodying current affairs news programming. A series of six episodes aired on Channel 4 in 1997, and a further episode in 2001. The series was created and presented by Chris Morris, written by Morris, David Quantick, Peter Baynham, Jane Bussmann, Arthur Mathews, Graham Linehan and Charlie Brooker and directed by Michael Cumming.",
    "html": "<p>Brass Eye is a British satirical television series parodying current affairs news programming. A series of six episodes aired on Channel 4 in 1997, and a further episode in 2001. The series was created and presented by Chris Morris, written by Morris, David Quantick, Peter Baynham, Jane Bussmann, Arthur Mathews, Graham Linehan and Charlie Brooker and directed by Michael Cumming.</p>"
  },
  "plotFull": {
    "plainText": "Brass Eye is a British satirical television series parodying current affairs news programming. A series of six episodes aired on Channel 4 in 1997, and a further episode in 2001. The series was created and presented by Chris Morris, written by Morris, David Quantick, Peter Baynham, Jane Bussmann, Arthur Mathews, Graham Linehan and Charlie Brooker and directed by Michael Cumming.\r\nOverview\r\nOriginally planned as a spin-off from The Day Today (1994), the pilot (then called Torque tv™) was passed on by the BBC. Channel 4 commissioned a new pilot, which would be called Brass Eye. The name mixes together the titles of two popular current affairs shows, (Brass Tacks and Public Eye).\r\nThe series satirised media portrayal of social ills, in particular sensationalism, unsubstantiated establishmentarian theory masquerading as fact, and creation of moral panics, and is a sequel to Morris's earlier spoof news programmes On the Hour (1991–92) and The Day Today (1994). The series stars Morris's The Day Today colleague Doon Mackichan, along with Gina McKee, Mark Heap, Amelia Bullmore, Simon Pegg, Julia Davis, Claire Skinner, John Guerrasio, Hugh Dennis, and Kevin Eldon.\r\nOriginal series (1997)\r\nThe second episode, \"Drugs\", has been described by Professor Michael Gossop as illustrative of the ease with which anti-drug hysteria can be evoked in the United Kingdom. In the opening scene of this episode, a voiceover tells viewers that there are so many drugs on the streets of Britain that \"not even the dealers know them all\". An undercover reporter (Morris) asks a purportedly real-life drug dealer in London for various fictitious drugs, including \"Triple Sod\", \"Yellow Bentines\" and \"Clarky Cat\", leaving the dealer puzzled and increasingly irritated until he asks the reporter to leave him alone. He also explains that possession of drugs without physical contact and the exchange of drugs through a mandrill are perfectly legal in English law.\r\nOne drug mentioned was a fictitious drug called \"Cake\", described as being from Czechoslovakia, despite the country no longer existing when the episode was screened. The drug purportedly affected an area of the brain called \"Shatner's Bassoon\" (altering the user's perception of time), while also giving them a bloated neck due to \"massive water retention\", a \"Czech neck\", and was frequently referred to as \"a made-up drug\" during the show. Other celebrities such as Sir Bernard Ingham, Noel Edmonds, and Rolf Harris were shown holding the bright-yellow cake-sized pill as they talked, with Bernard Manning telling viewers a fictitious story about how one girl regurgitated her own pelvis, and recounts that \"One young kiddy on Cake cried all the water out of his body. Just imagine how his mother felt. It's a fucking disgrace\".\r\nDavid Amess, the Conservative Member of Parliament for Basildon, was fooled into filming an elaborate video warning against the dangers of this drug, and went as far as to ask a question about \"Cake\" in the UK Parliament, alongside real substances khat and gamma-hydroxybutyric acid. In response, the Home Office minister incorrectly identified the fictitious drug \"Cake\" as a pseudonym for the hallucinogenic drug methylenedioxybenzylamphetamine.\r\nMorris posed as a talk show host who took a starkly discriminatory attitude in favour of those with \"Good AIDS\" (e.g. from a contaminated blood transfusion) over those with \"Bad AIDS\" (caught through sexual activity or drug abuse).\r\n\"Paedogeddon!\" special (2001)\r\nA special one-off edition of the show aired four years after the series had ended. Originally scheduled to broadcast on 5 July 2001, it was delayed as Channel 4 were unhappy with the timing in connection to the disappearances of 15-year-old Danielle Jones in June and 11-year-old Bunmi Shagaya in early July. It eventually aired on Thursday 26 July 2001, and was repeated on Friday 27 July 2001.\r\nIt tackled paedophilia and the moral panic in parts of the British media following the murder of Sarah Payne, focusing on the name-and-shame campaign conducted by the News of the World in its wake. This included an incident in 2000 in which a paediatrician in Newport had the word \"PAEDO\" daubed in yellow paint on her home. News of the World's then Editor Rebekah Brooks would years later discuss this campaign at the Leveson Inquiry.\r\nTo illustrate the media's knee-jerk reaction to the subject, various celebrities were duped into presenting fatuous and often ridiculous pieces to camera in the name of a campaign against paedophiles. Gary Lineker and Phil Collins endorsed a spoof charity, Nonce Sense, (pronounced \"nonsense\"—\"nonce\" being British slang for people convicted or suspected of molestation or sexual crimes), with Collins saying, \"I'm talking Nonce Sense!\" Tomorrow's World presenter Philippa Forrester and ITN reporter Nicholas Owen were shown explaining the details of fictional \"Hidden Online Entrapment Control System\", or HOECS (pronounced \"hoax\") computer games, which online paedophiles were using to abuse children via the internet. Capital Radio DJ Neil \"Doctor\" Fox told viewers that \"paedophiles have more genes in common with crabs than they do with you and me\", adding \"Now that is scientific fact—there's no real evidence for it—but it is scientific fact\". At one point, bogus CCTV footage was shown of a paedophile attempting to seduce children by stalking the streets while disguised as a school.\r\nLineker described paedophile text slang, stating that \"P2PBSH\" translates to \"pipe-to-pipe bushman; code for two paedophiles having sex with each other while watching children from a shrub\" and \"BALTIMORA\" translates to \"I'm running at them now with my trousers down\". Labour MP Syd Rapson related that paedophiles were using \"an area of internet the size of Ireland\". Richard Blackwood stated that internet paedophiles could make computer keyboards emit noxious fumes to subdue children, subsequently sniffing a keyboard and claiming that he could smell the fumes, which made him feel \"suggestible\". Blackwood also warned watching parents that exposure to the fumes would make their children \"smell like hammers\". Other notable figures appearing as themselves were Sebastian Coe, Michael Hames, Andy McNab, Kate Thornton, Barbara Follett MP and Gerald Howarth MP. Morris reported that convicted child murderer Sidney Cooke had been sent into space to keep him away from children. Prior to the launch, an eight-year-old boy had been placed on board the spaceship with Cooke by mistake. During the programme, the studio was \"invaded\" by a fictional militant pro-paedophile activism organisation called \"Milit-pede\", and the programme appeared to suffer a short technical disturbance. When it returned, presenter Chris Morris confronted a spokesman, Gerard Chote (played by Simon Pegg), who had been placed in a pillory, asking if he wanted sex with Morris's six-year-old son (actually a child actor). Hesitantly, the spokesman refused, apologetically explaining \"I don't fancy him\".\r\nThe episode won a Broadcast magazine award in 2002.\r\nOxide Ghosts: The Brass Eye Tapes (2017)\r\nIn 2017, series director Michael Cumming released a 60-minute film of unbroadcast material from the making of Brass Eye between 1995 and 1997. The film is intended to mark the 20th anniversary of the series's original broadcast and includes scenes previously edited from the series due to time constraints or legal difficulties. It also includes extended or alternative versions of scenes that made the final cut, together with humorous outtakes of several scenes. Cumming also narrates the film and details his first meeting with Chris Morris and the difficulties involved in making the series. Comedy website Chortle described the film as \"a thoughtful, curiously touching time capsule which pays fulsome tribute to, and certainly never cheapens, the spirit of the original show\".\r\nThe film premiered at the Pilot Light TV festival in May 2017 and toured to perform at selected UK cinemas throughout 2017. Each performance was followed by a Q&A with the director. It toured again in 2022. Cumming has said that the film will only be shown at such public events and can't ever be released commercially, for rights and legal reasons.\r\nEpisodes\r\nSeason 1 (1997)\r\nSpecial (2001)\r\nControversies\r\nMyra Hindley\r\nThe screening of the 1997 series was postponed for nearly six months as it made comic reference to convicted child murderer Myra Hindley, who was back in the news at the time after her portrait was vandalised in the Royal Academy exhibition Sensation. In a particularly infamous portrayal, Hindley was the topic of a farcical song by a fictitious indie band called Blouse (whose appearance and style closely resembled that of Pulp). The lyrics to part of the song read: \"Every time I see your picture, Myra/I have to phone my latest girlfriend up and fire her/And find a prostitute who looks like you and hire her/Oh, me oh Myra.\" The \"leader singer\" of Blouse, Purves Grundy (who resembles Pulp's Jarvis Cocker), is then shown commenting on the song; \"Myra is a very complex woman, you know, and this song is about her hair. I don't think there's a single reference in the song to her brain, which I think maybe, had a slight problem. I do think someone's gone and bought this record just because of the fuss that's been made about it, I think they should throw it away. And then they should go and buy another copy, because they liked the song.\"\r\nMichael Grade\r\nMichael Grade, then chief executive of Channel 4, repeatedly intervened to demand edits to episodes of Brass Eye. The final episode included a single-frame subliminal message reading \"Grade is a cunt\".\r\n\"Paedogeddon!\"\r\nAround 3,000 complaints were received concerning \"Paedogeddon!\", making it reportedly the most objected-to episode in British television history at the time, and politicians spoke out against Morris. Minister for Child Protection Beverley Hughes described the show as \"unspeakably sick\" based on clips of the episode, and Home Secretary David Blunkett was described by a spokesman as \"dismayed\", although he may have been relying on a description of the episode. Tessa Jowell, after watching, asked the Independent Television Commission to change its procedures so it could rule more swiftly on similar programmes.\r\nThere was also a tabloid campaign against Morris, who refused to discuss the issue. The Daily Star decried Morris and the show, and the Daily Mail ran a headline describing Brass Eye as \"Unspeakably Sick\" (quoting Beverley Hughes). The Observer accused both papers of hypocrisy; it noted that the Star article was positioned adjacent to an article about the developing bust of 15-year-old singer Charlotte Church, and that the Mail's coverage was preceded by \"close-ups\" of the \"bikini princesses\" Beatrice and Eugenie, who were 12 and 11 at the time.\r\nColumnist for The Guardian Ros Coward wrote at the end of July 2001: \"What's so dishonest about Channel 4's defence of Brass Eye as a satire of media forms is the implication that they (and the liberal left in general) have a better truth than the tabloids. They don't. ...t suggests concern about sex abuse is exaggerated and that victims' shame and humiliation doesn't matter. That's why there were so many complaints.\"\r\nHome media\r\nA DVD released in 2001 reinstated most of the material cut from the original, although a few items were removed, most notably the subliminal messages directed at Michael Grade and an interview with Graham Bright MP in the \"Drugs\" episode. A disclaimer was also added to the \"Drugs\" episode at the request of David Amess.",
    "html": "<p>Brass Eye is a British satirical television series parodying current affairs news programming. A series of six episodes aired on Channel 4 in 1997, and a further episode in 2001. The series was created and presented by Chris Morris, written by Morris, David Quantick, Peter Baynham, Jane Bussmann, Arthur Mathews, Graham Linehan and Charlie Brooker and directed by Michael Cumming.</p><br/><h3>Overview</h3><p>Originally planned as a spin-off from The Day Today (1994), the pilot (then called Torque tv™) was passed on by the BBC. Channel 4 commissioned a new pilot, which would be called Brass Eye. The name mixes together the titles of two popular current affairs shows, (Brass Tacks and Public Eye).</p><p>The series satirised media portrayal of social ills, in particular sensationalism, unsubstantiated establishmentarian theory masquerading as fact, and creation of moral panics, and is a sequel to Morris's earlier spoof news programmes On the Hour (1991–92) and The Day Today (1994). The series stars Morris's The Day Today colleague Doon Mackichan, along with Gina McKee, Mark Heap, Amelia Bullmore, Simon Pegg, Julia Davis, Claire Skinner, John Guerrasio, Hugh Dennis, and Kevin Eldon.</p><h4>Original series (1997)</h4><p>The second episode, \"Drugs\", has been described by Professor Michael Gossop as illustrative of the ease with which anti-drug hysteria can be evoked in the United Kingdom. In the opening scene of this episode, a voiceover tells viewers that there are so many drugs on the streets of Britain that \"not even the dealers know them all\". An undercover reporter (Morris) asks a purportedly real-life drug dealer in London for various fictitious drugs, including \"Triple Sod\", \"Yellow Bentines\" and \"Clarky Cat\", leaving the dealer puzzled and increasingly irritated until he asks the reporter to leave him alone. He also explains that possession of drugs without physical contact and the exchange of drugs through a mandrill are perfectly legal in English law.</p><p>One drug mentioned was a fictitious drug called \"Cake\", described as being from Czechoslovakia, despite the country no longer existing when the episode was screened. The drug purportedly affected an area of the brain called \"Shatner's Bassoon\" (altering the user's perception of time), while also giving them a bloated neck due to \"massive water retention\", a \"Czech neck\", and was frequently referred to as \"a made-up drug\" during the show. Other celebrities such as Sir Bernard Ingham, Noel Edmonds, and Rolf Harris were shown holding the bright-yellow cake-sized pill as they talked, with Bernard Manning telling viewers a fictitious story about how one girl regurgitated her own pelvis, and recounts that \"One young kiddy on Cake cried all the water out of his body. Just imagine how his mother felt. It's a fucking disgrace\".</p><p>David Amess, the Conservative Member of Parliament for Basildon, was fooled into filming an elaborate video warning against the dangers of this drug, and went as far as to ask a question about \"Cake\" in the UK Parliament, alongside real substances khat and gamma-hydroxybutyric acid. In response, the Home Office minister incorrectly identified the fictitious drug \"Cake\" as a pseudonym for the hallucinogenic drug methylenedioxybenzylamphetamine.</p><p>Morris posed as a talk show host who took a starkly discriminatory attitude in favour of those with \"Good AIDS\" (e.g. from a contaminated blood transfusion) over those with \"Bad AIDS\" (caught through sexual activity or drug abuse).</p><h4>\"Paedogeddon!\" special (2001)</h4><p>A special one-off edition of the show aired four years after the series had ended. Originally scheduled to broadcast on 5 July 2001, it was delayed as Channel 4 were unhappy with the timing in connection to the disappearances of 15-year-old Danielle Jones in June and 11-year-old Bunmi Shagaya in early July. It eventually aired on Thursday 26 July 2001, and was repeated on Friday 27 July 2001.</p><p>It tackled paedophilia and the moral panic in parts of the British media following the murder of Sarah Payne, focusing on the name-and-shame campaign conducted by the News of the World in its wake. This included an incident in 2000 in which a paediatrician in Newport had the word \"PAEDO\" daubed in yellow paint on her home. News of the World's then Editor Rebekah Brooks would years later discuss this campaign at the Leveson Inquiry.</p><p>To illustrate the media's knee-jerk reaction to the subject, various celebrities were duped into presenting fatuous and often ridiculous pieces to camera in the name of a campaign against paedophiles. Gary Lineker and Phil Collins endorsed a spoof charity, Nonce Sense, (pronounced \"nonsense\"—\"nonce\" being British slang for people convicted or suspected of molestation or sexual crimes), with Collins saying, \"I'm talking Nonce Sense!\" Tomorrow's World presenter Philippa Forrester and ITN reporter Nicholas Owen were shown explaining the details of fictional \"Hidden Online Entrapment Control System\", or HOECS (pronounced \"hoax\") computer games, which online paedophiles were using to abuse children via the internet. Capital Radio DJ Neil \"Doctor\" Fox told viewers that \"paedophiles have more genes in common with crabs than they do with you and me\", adding \"Now that is scientific fact—there's no real evidence for it—but it is scientific fact\". At one point, bogus CCTV footage was shown of a paedophile attempting to seduce children by stalking the streets while disguised as a school.</p><p>Lineker described paedophile text slang, stating that \"P2PBSH\" translates to \"pipe-to-pipe bushman; code for two paedophiles having sex with each other while watching children from a shrub\" and \"BALTIMORA\" translates to \"I'm running at them now with my trousers down\". Labour MP Syd Rapson related that paedophiles were using \"an area of internet the size of Ireland\". Richard Blackwood stated that internet paedophiles could make computer keyboards emit noxious fumes to subdue children, subsequently sniffing a keyboard and claiming that he could smell the fumes, which made him feel \"suggestible\". Blackwood also warned watching parents that exposure to the fumes would make their children \"smell like hammers\". Other notable figures appearing as themselves were Sebastian Coe, Michael Hames, Andy McNab, Kate Thornton, Barbara Follett MP and Gerald Howarth MP. Morris reported that convicted child murderer Sidney Cooke had been sent into space to keep him away from children. Prior to the launch, an eight-year-old boy had been placed on board the spaceship with Cooke by mistake. During the programme, the studio was \"invaded\" by a fictional militant pro-paedophile activism organisation called \"Milit-pede\", and the programme appeared to suffer a short technical disturbance. When it returned, presenter Chris Morris confronted a spokesman, Gerard Chote (played by Simon Pegg), who had been placed in a pillory, asking if he wanted sex with Morris's six-year-old son (actually a child actor). Hesitantly, the spokesman refused, apologetically explaining \"I don't fancy him\".</p><p>The episode won a Broadcast magazine award in 2002.</p><h4>Oxide Ghosts: The Brass Eye Tapes (2017)</h4><p>In 2017, series director Michael Cumming released a 60-minute film of unbroadcast material from the making of Brass Eye between 1995 and 1997. The film is intended to mark the 20th anniversary of the series's original broadcast and includes scenes previously edited from the series due to time constraints or legal difficulties. It also includes extended or alternative versions of scenes that made the final cut, together with humorous outtakes of several scenes. Cumming also narrates the film and details his first meeting with Chris Morris and the difficulties involved in making the series. Comedy website Chortle described the film as \"a thoughtful, curiously touching time capsule which pays fulsome tribute to, and certainly never cheapens, the spirit of the original show\".</p><p>The film premiered at the Pilot Light TV festival in May 2017 and toured to perform at selected UK cinemas throughout 2017. Each performance was followed by a Q&A with the director. It toured again in 2022. Cumming has said that the film will only be shown at such public events and can't ever be released commercially, for rights and legal reasons.</p><br/><h3>Episodes</h3><h4>Season 1 (1997)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#f4a943;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#f4a943;width:22%\">Title</th><th scope=\"col\" style=\"background:#f4a943;width:20%\">Directed by</th><th scope=\"col\" style=\"background:#f4a943;width:20%\">Written by</th><th scope=\"col\" style=\"background:#f4a943;width:18%\">Original air date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Animals\"</td><td style=\"text-align:center\"><span>Michael Cumming</span></td><td style=\"text-align:center\"><span>Christopher Morris</span></td><td style=\"text-align:center\">29 January 1997</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #f4a943\">The proliferation of cruel anti-cow <span>graffiti</span>, with text specifically designed to undermine the animals' confidence, and a spate of arranged fights between large men and <span>weasels</span>, indicate a deep malaise at the heart of society. Chris Morris presents a mix of surprising celebrity interviews and startling sketches on the issue of animal cruelty, focusing on Karla the elephant, who has unfortunately trapped her trunk up her anus.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Drugs\"</td><td style=\"text-align:center\"><span>Michael Cumming</span></td><td style=\"text-align:center\">Christopher Morris</td><td style=\"text-align:center\">5 February 1997</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #f4a943\">'Cake', a deadly new killer drug from Prague, is about to take Britain by storm. Our only hope for saving the nation's youth from the horrors of `Czech Neck' is an intensive awareness campaign, featuring the influential voices of Bernard Manning and Noel Edmonds.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Science\"</td><td style=\"text-align:center\"><span>Michael Cumming</span></td><td style=\"text-align:center\">Christopher Morris</td><td style=\"text-align:center\">12 February 1997</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #f4a943\">Chris Morris shakes his head in despair as more hoodwinked celebrities pass on their fairly loose grasp of bizarre science stories and experiments, including a campaign against 'heavy electricity'.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Sex\"</td><td style=\"text-align:center\"><span>Michael Cumming</span></td><td style=\"text-align:center\">Christopher Morris</td><td style=\"text-align:center\">19 February 1997</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #f4a943\">Chris Morris casts a satirical eye over the subject of sex and its relationship to society. Helpful contributors include Peter Stringfellow and David Sullivan.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Crime\"</td><td style=\"text-align:center\"><span>Michael Cumming</span></td><td style=\"text-align:center\">Christopher Morris</td><td style=\"text-align:center\">26 February 1997</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #f4a943\">Chris Morris turns his laser eye to the subject of crime, including shocking revelations of how <span>elephants</span> are being used to disperse rioters, and Vanessa Feltz's message to murderers.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Decline\"</td><td style=\"text-align:center\"><span>Michael Cumming</span></td><td style=\"text-align:center\">Christopher Morris</td><td style=\"text-align:center\">5 March 1997</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #f4a943\">Chris Morris examines the issue of moral decline in Britain. Religion also falls under the spotlight in this episode, which features Terry Waite discussing how Britain has been poisoned by the gospel.</td></tr></tbody></table><h4>Special (2001)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#f4a943;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#f4a943;width:22%\">Title</th><th scope=\"col\" style=\"background:#f4a943;width:20%\">Directed by</th><th scope=\"col\" style=\"background:#f4a943;width:20%\">Written by</th><th scope=\"col\" style=\"background:#f4a943;width:18%\">Original air date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Paedogeddon!</span>\"</td><td style=\"text-align:center\"><span>Tristram Shapeero</span></td><td style=\"text-align:center\">Christopher Morris, Shane Allen &amp; <span>Peter Baynham</span></td><td style=\"text-align:center\">26 July 2001</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #f4a943\">In this episode, celebrities were this time duped into endorsing an anti-paedophile charity by denouncing a program in which paedophiles could view children through a webcam and, wearing special gloves allowing them to molest any part of the child they so wished by simply touching their monitor.</td></tr></tbody></table><br/><h3>Controversies</h3><h4>Myra Hindley</h4><p>The screening of the 1997 series was postponed for nearly six months as it made comic reference to convicted child murderer Myra Hindley, who was back in the news at the time after her portrait was vandalised in the Royal Academy exhibition Sensation. In a particularly infamous portrayal, Hindley was the topic of a farcical song by a fictitious indie band called Blouse (whose appearance and style closely resembled that of Pulp). The lyrics to part of the song read: \"Every time I see your picture, Myra/I have to phone my latest girlfriend up and fire her/And find a prostitute who looks like you and hire her/Oh, me oh Myra.\" The \"leader singer\" of Blouse, Purves Grundy (who resembles Pulp's Jarvis Cocker), is then shown commenting on the song; \"Myra is a very complex woman, you know, and this song is about her hair. I don't think there's a single reference in the song to her brain, which I think maybe, had a slight problem. I do think someone's gone and bought this record just because of the fuss that's been made about it, I think they should throw it away. And then they should go and buy another copy, because they liked the song.\"</p><h4>Michael Grade</h4><p>Michael Grade, then chief executive of Channel 4, repeatedly intervened to demand edits to episodes of Brass Eye. The final episode included a single-frame subliminal message reading \"Grade is a cunt\".</p><h4>\"Paedogeddon!\"</h4><p>Around 3,000 complaints were received concerning \"Paedogeddon!\", making it reportedly the most objected-to episode in British television history at the time, and politicians spoke out against Morris. Minister for Child Protection Beverley Hughes described the show as \"unspeakably sick\" based on clips of the episode, and Home Secretary David Blunkett was described by a spokesman as \"dismayed\", although he may have been relying on a description of the episode. Tessa Jowell, after watching, asked the Independent Television Commission to change its procedures so it could rule more swiftly on similar programmes.</p><p>There was also a tabloid campaign against Morris, who refused to discuss the issue. The Daily Star decried Morris and the show, and the Daily Mail ran a headline describing Brass Eye as \"Unspeakably Sick\" (quoting Beverley Hughes). The Observer accused both papers of hypocrisy; it noted that the Star article was positioned adjacent to an article about the developing bust of 15-year-old singer Charlotte Church, and that the Mail's coverage was preceded by \"close-ups\" of the \"bikini princesses\" Beatrice and Eugenie, who were 12 and 11 at the time.</p><p>Columnist for The Guardian Ros Coward wrote at the end of July 2001: \"What's so dishonest about Channel 4's defence of Brass Eye as a satire of media forms is the implication that they (and the liberal left in general) have a better truth than the tabloids. They don't. ...t suggests concern about sex abuse is exaggerated and that victims' shame and humiliation doesn't matter. That's why there were so many complaints.\"</p><br/><h3>Home media</h3><p>A DVD released in 2001 reinstated most of the material cut from the original, although a few items were removed, most notably the subliminal messages directed at Michael Grade and an interview with Graham Bright MP in the \"Drugs\" episode. A disclaimer was also added to the \"Drugs\" episode at the request of David Amess.</p><br/>"
  },
  "errorMessage": ""
}