{
  "imDbId": "tt0417349",
  "title": "North & South",
  "fullTitle": "North & South (TV Series 2004–2004)",
  "type": "TVSeries",
  "year": "2004",
  "items": [
    {
      "username": "jhsteel",
      "userUrl": "https://www.imdb.com/user/ur1599986",
      "reviewLink": "https://www.imdb.com/review/rw0979703",
      "warningSpoilers": false,
      "date": "14 December 2004",
      "rate": "9",
      "helpful": "88 out of 93 found this helpful.",
      "title": "Social relevance for today",
      "content": "Elizabeth Gaskell may have invented the concept of the North/South divide in British society - some commentators think so. The adaptation of her novel makes it clear that although the North is viewed as a scary place for young Margaret Hale as she is forced to move there, she eventually falls in love with the working people she meets and with a mill owner, John Thornton, played movingly by Richard Armitage. I hope that people will find the social message of Gaskell's story relevant for today even though many viewers will be caught up in the central love story. The story deals with the infancy of the trade union movement and for those of us who had ancestors in the cotton industry, is very important in its portrayal of the dangerous working conditions. Reading the book is well worth the effort because it provides more insight in to the motivations of the characters and explains why they eventually grow to love each other. This is a very enjoyable TV drama and is worth repeating - hopefully the BBC will do so!"
    },
    {
      "username": "eastbergholt2002",
      "userUrl": "https://www.imdb.com/user/ur4729038",
      "reviewLink": "https://www.imdb.com/review/rw1311994",
      "warningSpoilers": false,
      "date": "11 March 2006",
      "rate": "9",
      "helpful": "22 out of 22 found this helpful.",
      "title": "Very Enjoyable",
      "content": "I bought the DVD version for my wife; she liked the book and enjoyed the BBC version of Wives & Daughters. I've probably seen far too many BBC costume dramas, but we were both gripped immediately and watched the whole thing in one sitting - all four hours. The story is set mainly in England's industrial North West during the 1850s, a time when even the rich seemed on the verge of destitution.The hero is John Thornton (Richard Armitage) a self-made mill owner, who initially appears to be an aloof and brutal tyrant (Mr. Darcy with a Northern accent). The heroine is Margaret Hale (Daniela Denby-Ashe) a clergyman's daughter from Hampshire who finds it difficult to fit into northern society. Hale's family don't have a lot of money and seem out of place. She befriends the family of a union leader and causes controversy by speaking her mind about working conditions in the mills. The story is based on a novel by Mrs. Gaskell, and the central characters go through some hardships and misunderstandings before they reach the predictable happy ending. The BBC is very good at this sort of thing. The story was well told with excellent acting, especially from Armitage, Sinead Cusack and Tim Piggott Smith. The characters were articulate and the plot was both credible and absorbing. Overall, it was an enjoyable series."
    },
    {
      "username": "eliza_gaskell",
      "userUrl": "https://www.imdb.com/user/ur20353936",
      "reviewLink": "https://www.imdb.com/review/rw2366360",
      "warningSpoilers": false,
      "date": "8 January 2011",
      "rate": "10",
      "helpful": "35 out of 37 found this helpful.",
      "title": "A diamond in the rough",
      "content": "It's been a while since the BBC has given a outstanding period drama. I've seen North and South when it was first aired in Australia on the ABC TV, where there was very little promotion about it. And what a surprise it was. I brought it immediately once it was available on DVD in Australia. I've just finished watching it (for the hundredth time) and is still stands the test of time. How on Earth did the BBC managed to get a near perfect cast for this production is simply miraculous and the lead actors were virtually unknown at the time! Elizabeth Gaskell works may not be well known, however Mrs Gaskell is to be given credit. She was one of the first to write how exactly the common man, at the time, spoke with imperfect English. She witnessed the decay and filth, breathed the smoke of industry and saw the poverty of the workers, when she lived in Manchester with her preacher husband; North and South, the novel, depicts all this.This adaptation of Mrs Gaskell's North and South is faultless and the acting is sublime.Some lines and scenes are from the book, while others parts are adapted to suit the small screen and modern audiences. For example, Margaret in the book never went to the mill, where as she does in the TV mini series. Nevertheless it does follow the book closely, far closer than Mrs Gaskell's other novel turned into a mini series Cansford (2007).Daniela Denby-Ashe is absolutely ideal as the beautiful, privileged and head strong Margaret Hale who is uprooted from her beloved Helstone to the industrial town of Milton by her father Mr Hale. It is in Milton where Margaret's middle class ideals are challenged and she slowly grows as a person of real character; along this journey she slows admires and eventually falls in love with the local mill owner John Thornton (a self made man who has successfully, raised his family and himself out of poverty, whom she considers to be socially inferior) . This challenging role allows Ms Denby-Ashe to stretch her acting abilities, develop her character and her portrayal as Margaret is simply stunning. There are scenes, combined with great lighting and the Victorian costume, where Daniela is gorgeously beautiful. What a contrast to see her in this, then the dumbing character of Janey in My Family. Richard Armitage is John Thornton! He breathed life in to this character and gave him dimensions. Mr Armitage portrays him as man with many facets: flawed, ruthless, angry, intelligent but also with a honest and frank countenance. Cannot think of any other English actor to portray John Thornton as Richard Armitage has. Not many actors can pull off expressions that can convey a range of emotions with a look and not uttering a single word. His screen presence is charismatic and riveting, but well balanced, as to not overwhelm Ms Denby-Ashe presence on the small screen. Simply put, the man has TALENT! which puts to shames his contemporaries thespians in Hollywood. And the chemistry between the two leading actors makes watching the end worthwhile. (Puritans would gasp in horror, but if you read the book, you'll know what I mean, when I state, although I loved the book, I prefer this modern updated ending). But lets not forget the supporting cast.Sinead Cusack, a delight to watch as Mrs Hannah Thornton. To witness Richard Armitage and Sinead, having similar characteristics and as well as mannerisms, even looks, you'd be lead to believe they are related. And Mrs Thornton's love for her son John, is beautifully enacted, in the scene before and after the proposal. Great to see Tim Piggot-Smith as Mr Hale (a weak character) in a role that does not stereo cast him as villain. Leslie Manville as Mrs Maria Hale, another weak character, is virtually unrecognizable. Brendan Coyle does justice to the character of Nicholas Higgins; notice the twinkle in his eye when he reveals some truths to Thornton. Anna Maxwell Martin as Bessie Higgins, Pauline Quirke as Dixon, Jo Joyner as self absorbed Fanny Thornton and Brian Protheroe (Mr Bell) all have their moments in the spotlight. Finally, Rupert Evans, surprising to see him cast as Frederick Hale, and he does look a bit like Daniela Denby-Ashe.Sandy Welch script is placed in the careful hands of director Brian Percival who manages to film N&S beautifully. Edinburgh as Milton in the 1800 gives a wonderful feel, for the the industrialization of England, the cotton mills and the Union movement. Locations and set design are a treat, which give the feel of the Victorian era. The rigid social structure is highlighted not only in the actors accents, speech and manner of dress but also where they live. Just look at the difference between the household of the Higgins, Hales and Thornton not to mention London, where Edith lives. The costumes give depth and assist the actors with their character; delightful to see Daniela in a wide brim hat than a bonnet. Richard Armitage look devilishly handsome with or without a cravat.Lastly music by Martin Phipps, this man can compose and it shone in N&S. The score plays beautifully to important moments in the story. Margaret and John's simple piano tune, subtly overlaid, when there is an emotional development in their relationship or when they are both internalizing their feels for each other; to the swelling music when something dramatic has happened, all fits in well with the overall production. North & South is proof that you don't need state of the art special effects, million dollar budgets and overpaid actors with star power or sex scenes. A simple story can touch a thousand souls...for it connects to the emotional human side and you feel for the characters as they travel on their journey, and North & South has all that."
    },
    {
      "username": "wynne",
      "userUrl": "https://www.imdb.com/user/ur0031227",
      "reviewLink": "https://www.imdb.com/review/rw1235381",
      "warningSpoilers": false,
      "date": "11 December 2005",
      "rate": "10",
      "helpful": "64 out of 67 found this helpful.",
      "title": "simply excellent",
      "content": "Excellent rendition of Elizabeth Gaskells book.The production is authentic - set in an impressive, historic working mill - with Edinburgh filling in for Manchester (Milton). The camera work is fluid and modern, and the story is told easily, not stilted, like some period dramas.The acting is superb - the lead characters John and Hannah Thornton, Margaret Hale, and union man Nicholas Higgins are so natural that you forget that you are watching a movie, and get simply enthralled in their story. The supporting characters are also strong making this an unexpected gem of a movie.Some of the dialog is taken directly from the book; some scenes are new but feel authentic. Overall I think that the story is very well told - the story of owner vs. worker in the industrial revolution - as well as an unexpected romance between social classes."
    },
    {
      "username": "cooperhmc",
      "userUrl": "https://www.imdb.com/user/ur2171729",
      "reviewLink": "https://www.imdb.com/review/rw1510858",
      "warningSpoilers": true,
      "date": "30 October 2006",
      "rate": "10",
      "helpful": "38 out of 40 found this helpful.",
      "title": "Superb",
      "content": "I am a English woman by birth - I have lived in NZ for five years and I absolutely love it here. However, the one big criticism I have is it takes SOOOOOO long to get the great British dramas here. This wonderful adaptation of a book that I lovingly studied at University, has yet to be aired here on terrestrial television and, knowing the standard of TV we get here, I doubt it will air...the best I can hope for is the SKY Channel UK TV. No sign of it yet.... Still, I saw the DVD in my local library and hired it for a dollar for the week ( thats 33p to you UK dwellers - not bad huh?!) And so that is how I come to be writing these comments.It was the best dollar I have ever spent! I thought it very brave subject matter for the BBC to attempt as Mrs Gaskell does not enjoy the fame that Austen or the Bronte sisters names carry. In fact, to most, if you mentioned \" North and South\" before this wonderful production aired in the UK, they would probably think you were talking about a 1980's American Civil War drama with Kirstie Alley and Patrick Swayze!!! I have read a lot of the comments on here and there seems to be a general consensus that Richard Armitage rocks! I won't disagree. As a part time actor myself, I am critical when I watch dramas - If I see an actor playing the part and not the actual character, I lose belief. Perhaps it helped that I had not seen him before but, somehow, I feel that, even if I had, I would still have been totally ,mesmerised by his performance. Never has a character ever drawn me in so completely - not even when I read the book. In fact, I recall not liking him much at all when I first read it. However, Armitage played the role beautifully. As the episodes unfolded, we saw the layers start to peel away and, beneath the harsh exterior, a sensitive and painfully lonely man appear. Armitage was not merely acting the part - he BECAME John Thornton. He has a truly special quality that you don't often see in actors and he could say more in a look than ever any words needed. The scene where Margaret rides off in the carriage in the snow, leaving Milton, leaving Thornton watching her leave, yearning for her to show him a sign and look back, was one of the most beautifully shot scenes I have ever seen on the small screen. I have lost touch with the BAFTAS these past few years but that was a BAFTA worthy performance in that one scene if ever I saw one. Onto the other actors. Dramas like these are ensemble pieces and succeed because of the power of the combined performances. I frowned when I saw Daniela Denby Ash for the first time in this production. Perhaps because we get a nightly dose of \"My Family\" here in NZ and I had the spoiled, bombastic, \"Janey Harper\" image in my head. However, I was pleasantly surprised at the restraint in her performance. It is so easy to be all heaving bosoms and fluttering eyes in these period dramas but she played the strong willed Margaret Hale to perfection and the chemistry between her and Armitage on screen was electrifying.The amazing Sinead Cusack. I didn't like her accent at first I will admit, I thought it overdone but, the power of her performance as the protective mother soon made this pale into insignificance and I thought she played the role to perfection.The wonderful Tim Piggott Smith. He is always good value and he conveyed all the goodness and gentleness of Mr Hale that I remembered from the book (and ironic that 30 years before, he played Frederick!). The scene where he is talking about one of his pupils to his newly deceased wife had tears in my eyes. As did the scene where he greeted his long lost son Frederick.I LOVED Pauline Quirke as Dixon. She is a wonderful actress who I feel is really beginning to flourish and show just what a strong performer she is. She was utterly believable and her relationship with Mrs Hale was touching and evocative.Finally, I would like to mention the wonderful Brendan Coyle - an actor who,in my opinion, has not enjoyed the recognition that he deserves. He totally captured the dignity of the working class man trying to improve life for his family and fellow workers and the despair when things spiral out of his control - the death of his beloved Bessie, the breaking of the strike by the desperate Boucher and the way that, despite all the suffering and the heartache, he sees beyond the barriers that Thornton throws up around him and puts out the hand of friendship and support. The scene where Thornton goes to Nicholas's house to ask him to come and work for him was wonderful. So touching to see two very proud men make such concessions. Beautifully played.Finally, yeah, I know it was poetic license, but the scene at the rail station was the perfect climax to the piece. I had tingles down my spine just watching it ( and a few tears). If only life were that romantic! And I am sure there was not a red blooded woman watching that didn't wish a man would look at her with half the longing that Thornton looked at Margaret nor kiss her with half the passion that he kissed her with. Nobody does drama like the \" Beeb \" and, to me, this production rates above \" Pride and Prejudice\" and I would have Mr Thornton over Mr Darcy any day!!"
    },
    {
      "username": "minerva-11",
      "userUrl": "https://www.imdb.com/user/ur0392052",
      "reviewLink": "https://www.imdb.com/review/rw1045909",
      "warningSpoilers": false,
      "date": "24 March 2005",
      "rate": "10",
      "helpful": "64 out of 70 found this helpful.",
      "title": "a great adaptation",
      "content": "With \"North and South\" the BBC has continued its fine tradition of producing great adaptations. Indeed \"North and South\" is one of the very best the BBC has done, capturing the nuances of the novel perfectly and bringing out the latent eroticism of the book. The only quibble is the way the screenwriter has changed the ending from that of the novel. Although this will irk some, I thought the new ending was in keeping with the story as a whole. The acting throughout is superb, especially from Richard Armitage as the brooding Mr Thornton - he captures exactly the character's pride, brutality, warmth and passion. I think Richard Armitage would be a very good James Bond."
    },
    {
      "username": "didi-5",
      "userUrl": "https://www.imdb.com/user/ur0137908",
      "reviewLink": "https://www.imdb.com/review/rw1939274",
      "warningSpoilers": true,
      "date": "1 September 2008",
      "rate": "8",
      "helpful": "8 out of 8 found this helpful.",
      "title": "top notch Gaskell in the industrial north",
      "content": "Although 'North and South' has a plot which could be dismissed as pure Catherine Cookson - rich clergyman's daughter with family in reduced circumstances move from leafy Hampshire to smoky Milton (Manchester) where she makes friends with factory folk and has a love-hate relationship with the local squire (sorry, mill owner and magistrate) before she comes into money from father's old schoolfriend (who has a yen to marry her) and she saves the squire from bankruptcy by offering him a loan but marrying him instead - it really is done so well that you don't notice the implausibilities and creaks in storyline as you're watching.With a cast who are firing on all cylinders - Daniela Denby-Ashe (Margaret), Lesley Manville (Margaret's mother), Tim Pigott-Smith (Margaret's father), Pauline Quirke (their servant Dixon), Richard Armitage (the mill-owner), Sinead Cusack (his mother), Brendan Coyle (a union man and mill-worker), Anna Maxwel-Martin (mill-worker's consumptive daughter), Brian Protheroe (friend of Margaret's father), and William Houston (strike-breaker) - 'North and South' can never be accused of being boring. It looks as if money has been spent on it as well, which makes all the difference."
    },
    {
      "username": "parthenos69",
      "userUrl": "https://www.imdb.com/user/ur5942334",
      "reviewLink": "https://www.imdb.com/review/rw1131126",
      "warningSpoilers": false,
      "date": "20 July 2005",
      "rate": "10",
      "helpful": "151 out of 158 found this helpful.",
      "title": "Unexpected Treat",
      "content": "North and South took me completely by surprise when it was aired on BBC America. I was flipping through channels and thought I was going to be tuning into the American version based on the John Jakes novels. But Elizabeth Gaskell's work on which the film is based is far more than a mere period romance. This is social commentary and a love story, the struggle of workers and masters/managers as well as the misunderstanding of the intellectuals that forms a triangle in the film that is still alive today. The lead characters all take on a social conscience that grows with their love for each other to an understanding of the different worlds that lived together in this time of radical change. But the true success of the film lies in the actors abilities to show the true emotion and change that takes place around them and in them during the course of the tale. It is unfortunate that the BBCA chose to cut out so much of the film and hopefully the DVD will be available soon for US viewers to force others into watching. A true diamond being lost in the rough. Do yourselves a favor and sit back and enjoy the excellent acting and story, then sit back and watch it again and take note of all the layers of social history being shown. Or just to watch Richard Armitage ;), sooooo good!"
    },
    {
      "username": "Erick-12",
      "userUrl": "https://www.imdb.com/user/ur0291048",
      "reviewLink": "https://www.imdb.com/review/rw1819088",
      "warningSpoilers": false,
      "date": "13 February 2008",
      "rate": "8",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Romanticism vs Victorianism: South vs North decoded",
      "content": "Very nicely filmed, somehow both visually stylish and accurate on period detail. Based on the novel of the same title by Gaskell, a work that is crucial for understanding  in an ideologically deflected way  the transition from Romanticism (the country cottage, poetry, equality, etc) to early Victorianism (industrial power, science, Darwinian adaptation, bourgeois reform, etc.) that Gaskell seems to endorse through the transformation of the heroine, and her choice of husband. Myth in action here, as in the sense of resolving this contradiction in imaginative fiction. Alas, the contradictions between Romantic values and Victorian values remains with us even into the 21st century. This perhaps explains why the BBC television production of _North and South_ was so watchable for so many viewers."
    },
    {
      "username": "LouE15",
      "userUrl": "https://www.imdb.com/user/ur11719161",
      "reviewLink": "https://www.imdb.com/review/rw1570685",
      "warningSpoilers": false,
      "date": "12 January 2007",
      "rate": "9",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Great novel transposed to highly enjoyable and moving mini-series",
      "content": "While Jane Austen preferred her \"little bit of ivory\", and Charlotte Brontë her wild open moorland and \"bonny beck\", Brontë's great friend (and biographer) Elizabeth Gaskell combined both traditions, and yet contributed a something that was her own: an intense social consciousness based on actual experience. The themes of her great work \"North and South\" (an exploration of the emerging industrial North of the mid-nineteenth century through the eyes of the beautiful, stately Southerner, Margaret Hale) reverberate keenly today. England still has its 'north-south' divide; class and snobbery still prevail; unions still fight for the rights of workers.The BBC's adaptation did make me gasp at times in the slightly shocking liberties it takes with the text  but it's missing the point to dwell too fiercely on this. I was glued to my TV as it appeared each week. It's great stuff, an intense love story and a fascinating glimpse into the industrial North. Heroine Margaret Hale's bruising contact with mill-owner John Thornton is wonderfully played out with great intensity by Daniela Denby-Ashe and Richard Armitage (mmm more please !) and I enjoy it for its own sake, in much the same way that the BBC's 90's \"Pride and Prejudice\" adaptation is hugely enjoyable as a thing quite apart from its source material. (Yes, I'm thinking of that frankly ludicrous 'wet shirt' scene.) Sinead Cusack's Mrs Thornton is absolutely outstanding but both Denby-Ashe and particularly Armitage deserve no less praise for their work. Incidentally, for those a little mystified by the somewhat harsh repositioning of Thornton in the early part of this adaptation as a beater-up of poor men, the helpful DVD commentary does explain that to modern readers, the Thornton of the book doesn't really do anything 'wrong' to deserve Margaret's wholesale disapproval: for the show his actions had to be a little more decided.Gaskell wrote \"North and South\" with the title \"Margaret\" in mind, and I can't help thinking that it's the truer title of this adaptation. It's her story. \"North and South\" has a great deal going for it, over and above its stars: beautiful background music; amazing sets  in particular the very dramatic cotton mill reconstruction - and utterly fulfils the BBC's brief to both entertain and to educate. I agree with the reviewer from Australia: if you like this, watch the BBC's 1995 drama \"Persuasion\" with Amanda Root and Ciaran Hinds for perhaps the finest adaptation of a classic novel I've ever seen."
    },
    {
      "username": "sarah1602",
      "userUrl": "https://www.imdb.com/user/ur4364964",
      "reviewLink": "https://www.imdb.com/review/rw0974366",
      "warningSpoilers": false,
      "date": "8 December 2004",
      "rate": "10",
      "helpful": "130 out of 138 found this helpful.",
      "title": "Brilliant - great Sunday evening entertainment!!",
      "content": "Just what you need for a cold winter Sunday night! It's nice to have something to really get into, but the 4 weeks it was on went way too fast! The sets, costumes and acting were excellent, especially Richard Armitage's performance as mill owner John Thornton. He's got a brilliant deep, brooding sort of look about him, but with a softer, kind side too that is gradually revealed as the story goes on. The way Richard Armitage portrayed these two sides of Thornton's character was amazing. And as well as being a great actor, he's also very, very good looking! Nice smile (though we don't see it very often - so it's lucky he looks good when being moody/troubled!!)and a lovely voice. (sounds a bit like Sean Bean as a matter of fact!) Oh I'm going to miss this series! But honestly, not just because of Mr Thornton; it really was a gripping story and a great drama. The music was brilliant too, really capturing the mood and feel of the dark, industrial setting."
    },
    {
      "username": "quilttn",
      "userUrl": "https://www.imdb.com/user/ur6444136",
      "reviewLink": "https://www.imdb.com/review/rw1154131",
      "warningSpoilers": false,
      "date": "20 August 2005",
      "rate": "10",
      "helpful": "199 out of 207 found this helpful.",
      "title": "Gorgeous adaptation",
      "content": "I'm a history teacher so I'm very critical of adaptations, especially those that sentimentalize the past in any way. This is a superb rendering of the spirit of the industrial age and the many facets of class struggle within it. It's also a richly romantic love story. The acting by all the cast is uniformly excellent but Richard Armitage as Thornton is a stand-out. The BBC is well-known for their meticulous attention to detail with locations and costumes. The working 19C mills used in the film are like watching a Jacob Riis photograph springing to life. The cinematography is gorgeous and the music is outstanding. This is the best historic fiction on screen I've ever seen."
    },
    {
      "username": "theeyeshaveit469",
      "userUrl": "https://www.imdb.com/user/ur8324651",
      "reviewLink": "https://www.imdb.com/review/rw1234598",
      "warningSpoilers": false,
      "date": "9 December 2005",
      "rate": "",
      "helpful": "17 out of 18 found this helpful.",
      "title": "What would I compare it to?",
      "content": "North and South is my favorite book because I like the basic story and I really love the characters, and this feeling carried over to the series. Even though the BBC Wives and Daughters series was excellent and stuck more strictly to the book than North and South - I still enjoyed North and South more because of the reasons I love the book. I also thought the acting of the whole cast was as good as anything I have seen. North and South is often compared with Pride and Prejudice and while there is a good reason for that, I actually feel it has as much in common with a Dickens tale. The book was actually first published by Dickens in his weekly paper/magazine and was viewed favorably by him. If I was to try and describe the tone of the piece I would describe it as a cross between a slightly less complicated Dickens tale and Jane Austen. I never thought I would find a series I like better than Pride and Prejudice but I have. While it came to a resolved ending as most drama series do, whether tragic or happy, - there were several relationships in this that I wanted to follow further and I was wishing it would continue."
    },
    {
      "username": "johnbol",
      "userUrl": "https://www.imdb.com/user/ur3137342",
      "reviewLink": "https://www.imdb.com/review/rw1091524",
      "warningSpoilers": false,
      "date": "30 May 2005",
      "rate": "10",
      "helpful": "18 out of 21 found this helpful.",
      "title": "Still relevant today",
      "content": "This very good adaption tells a story set in Victorian England but it's issues are still relevant today and all over the world. First of all there are the misunderstandings between the new and old citizens . The new comers are from the south and the city is in the north. Nowadays we have new comers from India ( we in Holland have them from Morocco and Turkey)and we all have problems with communication between the two groups. Secondly there are the deplorable working conditions in the factories and we see how many of their owners hardly care for the people. First they were the slaves ( well... almost ) of the rich - as farmers or servants, then they became the slaves of the factory owners ( and if we are not carefuller we will now become the slaves of the 24 hour economy). This all is told in the form of a love story and that works very well to bring those issues to the attention to people who would not be interested had it been told in a too grim a manner. Our admiration must go to the writer, Elizabeth Gaskell. To those who liked The Jane Austen books / movies and who might think that this one will be too dark for them, i would like to say : give it a try. I'ts very well acted and you'll get your love story."
    },
    {
      "username": "yorkiegirl16",
      "userUrl": "https://www.imdb.com/user/ur4354288",
      "reviewLink": "https://www.imdb.com/review/rw0973005",
      "warningSpoilers": false,
      "date": "6 December 2004",
      "rate": "10",
      "helpful": "56 out of 66 found this helpful.",
      "title": "Brilliant adaptation",
      "content": "I had never read this book, but enjoy watching period dramas. I'm going to read the book now. I got into this in the first episode and I was gripped all the way through. I was rooting for Margaret and John to get together as it just had got to happen. Great portrayals by Sinead Cusack as John Thornton's mother and Jo Joyner as sister Fanny, she was funny. Brendan Coyle was great as Nicholas Higgins, showing us the worker's side of the story and what the unions were trying to do. Very believable acting from Richard Armitage as John Thornton and Daniela Denby-Ashe was lovely as Margaret. Thornton reminds me of similar sort of characters - Mr Rochester, Darcy. We need men like that."
    },
    {
      "username": "MaryK-2",
      "userUrl": "https://www.imdb.com/user/ur0257427",
      "reviewLink": "https://www.imdb.com/review/rw1283296",
      "warningSpoilers": false,
      "date": "4 February 2006",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "stellar performances and story",
      "content": "This is one of the best, if not the best period mini-series to come out of Britain in recent years. Being an avid Pride and Prejudice (and Colin Firth fan), this is better. Seeing the previews, I initially thought it was stuffy and just another period piece.....boy, was I wrong. I decided to give it another chance, rented the DVD and watched it in peace. It is amazing...acting, scenery, story, etc. It is simply mesmerizing. I read the book after watching the series and personally liked the series better. It was tighter and had more of Mr. Thornton than the book...and OH! can Richard Armitage convey more emotions in one look than in a hundred pages. Go rent it...better yet buy it. You will not be disappointed."
    },
    {
      "username": "Laight",
      "userUrl": "https://www.imdb.com/user/ur0350076",
      "reviewLink": "https://www.imdb.com/review/rw7831848",
      "warningSpoilers": false,
      "date": "3 February 2022",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "The standard for all adaptations",
      "content": "There isn't all that much of a plot. There isn't much action. There's not even much drama. But what there is: a perfectly filmed love story with an extraordinary cast, all of whom are pitch perfect; camera work that sets the bar for all historical dramas; direction that is sharp and smart; and a script that's intelligent and insightful. It's impossible to suggest how this show could have been better except, as some people have pointed out, to have had more episodes. (The show also introduced Richard Armitage to the world in what oddly turned out to be his best role ever.)"
    },
    {
      "username": "wisewebwoman",
      "userUrl": "https://www.imdb.com/user/ur0509769",
      "reviewLink": "https://www.imdb.com/review/rw1247817",
      "warningSpoilers": true,
      "date": "26 December 2005",
      "rate": "8",
      "helpful": "12 out of 16 found this helpful.",
      "title": "Engrossing ,well done four-parter",
      "content": "Manchester -called Milton - in the series is depicted authentically in this gripping four part BBC series. Edinburgh stands in for exterior scenes.The cast is flawless and to single out one of them for extra praise would seem totally unfair.I intend to read the book as I find the story absolutely spell-binding. It had me from beginning to end, and that was the only spot of trouble I ran into. The end. Otherwise I would have given this a 10/10 rating.The scene in the railroad station at the end tested my credibility metre. For one, the extremely sudden turn-around of the Margaret character was poorly written and I can't quite believe this would have occurred in the novel. For two, the anachronistic kissing, though agreeable, seemed completely out of place. I bought it with Darcy and Elizabeth in the wedding scene in P&P but here I found it jarring enough to remove me from the story. This was Victorian England. This was a public railway station. These were not working class people. And he had just been to her old home and taken a rose from there to give her, not knowing at that point she would ever be in his life again and for that matter not knowing how much these roses had ever meant to her? In spite of that, it is not to be missed for the 95% of time it nails the era and the way the cast portrays the characters, all excellent and well deserving of any awards they may receive for this.8/10."
    },
    {
      "username": "bufferuskers",
      "userUrl": "https://www.imdb.com/user/ur5488055",
      "reviewLink": "https://www.imdb.com/review/rw1135617",
      "warningSpoilers": false,
      "date": "26 July 2005",
      "rate": "",
      "helpful": "190 out of 208 found this helpful.",
      "title": "Hollywood NEEDS Richard Armitage",
      "content": "I hope there are high profile producers and directors who will seek out a DVD of North and South to see the outstanding performance of Richard Armitage. His charisma and talent are FAR, FAR BEYOND anything hyped up in Hollywood in recent years (he makes Jude Law, just to take one example, look like a grade school amateur).This amazing performance should not be missed. I wish I had the means and knowledge to send copies of the DVD to all of the big independent producers, the studios, and directors.This guy has \"it\" - talent, stature, intelligence, charisma. Anyone serious about acting should not miss Richard Armitage's performance."
    },
    {
      "username": "Doylenf",
      "userUrl": "https://www.imdb.com/user/ur1048771",
      "reviewLink": "https://www.imdb.com/review/rw2432766",
      "warningSpoilers": false,
      "date": "23 May 2011",
      "rate": "7",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Excellent acting and production values enhance Gaskell's novel brought to the screen...",
      "content": "I've always admired the way Victorian England is used so effectively in British TV series and nowhere is this more evident than in NORTH AND SOUTH, the story of relationships between different classes in British society during the 1850s.The story itself bears a strong resemblance to Charlotte Bronte's work, SHIRLEY, a novel that dealt largely with strikes and mill owners. Since Elizabeth Gaskell was a good friend of Charlotte Bronte, it's no wonder that her story deals with some of the same customs and values as Bronte's work.RICHARD ARMITAGE, whose very image conjurs up remembrance of Laurence Olivier's Heathcliff in \"Wuthering Heights,\" has a glowering presence and uses it to portray the hard-working mill owner who has to bear down on his workers when it looks as though his cotton mill is about to face a strike. He makes an unfavorable impression on the heroine of the story, played assuredly by Daniela Denby-Ashe, who has come north with her family to relocate in a climate and atmosphere not particularly to her liking.The story delves into the conflicts in many relationships, but keeps the central focus on the intense attraction between the two main characters despite their differences. SINEAD CUSACK as the man's shrewdly possessive mother gives a sharp characterization and TIM PIGOTT-SMITH as the girl's father and BRENDAN COYLE as a rough mill worker are excellent in colorful supporting roles. The entire cast gets into the spirit of the drama and contribute to the uniformly fine quality of the acting.For romantics who pine over Victorian romance, surely this is one of the best of its kind with production values in costumes and settings that cannot be bettered. A viewer is certain to want to see more of Gaskell's work brought to the screen after the successful transition of this full-blooded character study."
    },
    {
      "username": "history_girl",
      "userUrl": "https://www.imdb.com/user/ur2602995",
      "reviewLink": "https://www.imdb.com/review/rw1154701",
      "warningSpoilers": false,
      "date": "21 August 2005",
      "rate": "10",
      "helpful": "19 out of 23 found this helpful.",
      "title": "Moving and accurate",
      "content": "This is my favourite mini-series from the BBC yet. As a direct descendant of Lancashire cotton workers in the area this movie is based, it helped to me to connect what my ancestors lived like.The casting on this mini-series was perfect, not one role had been cast wrong.Daniella was engaging and convincing as Margaret Hale, who moves from the South to the industrial North when her father gives up his post as a minister.Richard though is just superb as John Thornton. He is very convincing and for once we see a good actor, with talents (and in my books very good looking), without having the traditional 'pretty boy' look.Basically Margaret comes to learn that while things are different in the North, it doesn't make the South any better. She finds that there is a stronger sense of family unity and bonding and she begins to make friends with people below her status, because plain and simple - they're good people.This is a must watch. Congratulations to the BBC on a fine movie, which is even better than the book it was based on."
    },
    {
      "username": "camillahopkin",
      "userUrl": "https://www.imdb.com/user/ur4488786",
      "reviewLink": "https://www.imdb.com/review/rw0989345",
      "warningSpoilers": false,
      "date": "1 January 2005",
      "rate": "",
      "helpful": "65 out of 71 found this helpful.",
      "title": "Great Stuff!",
      "content": "I thought this production was great - I highly recommend it to anyone especially if they enjoyed Pride and Prejudice - It took you back to another era and was thoroughly entertaining. The actors were great and any red blooded woman would have had their pulses sent raising with Richard Armitage's performance! I also thought the sets and locations were fabulous - such details especially the 'snow' scene in the factory at the very beginning- spell binding!. So all in all even though certain details of Victorian conduct etc were thrown out of the window this production was brilliant!! I can't wait for the DVD to come out... It was so great I immediately read the book"
    },
    {
      "username": "court99",
      "userUrl": "https://www.imdb.com/user/ur14369875",
      "reviewLink": "https://www.imdb.com/review/rw1746678",
      "warningSpoilers": true,
      "date": "11 October 2007",
      "rate": "8",
      "helpful": "7 out of 7 found this helpful.",
      "title": "A classic tale brought to life with passion and energy",
      "content": "*Contains Spoilers*This is a wonderful adaptation of Elizabeth Gaskells industrial novel. Seeing the smoky industrial atmosphere leap from the pages and into life was a true treat. The casting was good, Richard Armitage being a perfect and broodingly handsome choice for John Thornton. Daniela Denby-Ashe was also a good decision for Margaret Hale, capturing that queenly yet innocent quality which the book strongly emphasises. For some aspects of the series the producers used a creative licence. For instance, there is no description of John Thornton beating his workers in the book, however, beating workers was a common practise for industries of this time period, so it therefore a distinct possibility that John Thornton, had he been real, would have indeed beaten his workers. In the book Margaret Hale does not enter the factory at all, I am however glad they used the factory shots of the cotton mill as they were some of the most haunting and beautiful scenes in the series. The only alteration from the story line for which I have misgivings, is the ending. Romantic? Yes. Realistic? No! A Mr. Thornton and Miss Hale kissing in such a public situation - a train station no less, would have been considered in those times as outright scandalous! I can understand the conveniance to the story as well as symbolism for having them meet in the trainstation and even the need to provide overall audience satisfaction with a kiss, however, I think it should have been more tastefully and realistically executed, perhaps them kissing for the first time once they had hopped on the train (this still would have been scandalous, but not as bad).Despite this rather large flaw (as it is the ending) overall the series is enjoyable and true to the themes of the book. I highly recommend it to fellow hopeless romantics and anyone else looking for quality entertainment."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2412424",
      "warningSpoilers": false,
      "date": "12 April 2011",
      "rate": "10",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Stunning and not only as an adaptation but on its own terms too",
      "content": "Elizabeth Gaskell's North & South is a masterpiece and a beautiful and affecting love story. This four-part mini-series succeeds not only as an adaptation and very faithful but also on its own terms. The story here is still the beautiful, affecting and timeless story I fell in love with. And the dialogue is wonderfully written, every bit as eloquent, sophisticated and literate as that in the book.On its own terms, North & South succeeds amazingly. The pace is spot on with few rushed or draggy spots and no skimming over of pivotal scenes, and the length is just right. Production-values-wise, North & South is flawless. The scenery is breathtaking without being too clean, the costumes are beautifully tailored and the photography is suitably elegant. The music is equally very good, with enough elegant and haunting motifs/themes to make it memorable.The direction is always very assured, and the acting is pretty much outstanding with the characters written so well you do care for them and their situations. Daniela Denby-Ashe is a very poignant Margaret, and there are outstanding supporting turns from Tim Piggott-Smith, Lesley Manville and Sinead Cusack. What made the mini-series for me was the superlative performance of Richard Amitage, who is very handsome and charismatic, has great delivery of his lines AND manages to convey all sides of his complex character brilliantly.Overall, a stunning mini-series. 10/10 Bethany Cox"
    },
    {
      "username": "Lee-107",
      "userUrl": "https://www.imdb.com/user/ur0332248",
      "reviewLink": "https://www.imdb.com/review/rw2277459",
      "warningSpoilers": true,
      "date": "11 July 2010",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Exquisite!",
      "content": "I am a self-confessed anglophile and having done my Masters in English Literature, I try and see as many adaptations of British novels as possible. For me it's like re-living my college and university days when we used to eat, breathe, sleep and dream about the authors, poets and playwrights we were studying! And though we studied about Elizabeth Gaskell, her works sadly didn't make the cut as far as our syllabus was concerned. So to sort of remedy that egregious mistake, I have been lapping up all the adaptations of her work and will soon read all the books as well! I know I should have gone the other way around and read the books first... but well... the temptations of watching BBC adaptations were too much to resist! So I started with 'Cranford' and then 'Wives and Daughters' and I just finished watching 'North and South'. And all three are absolutely brilliant! 'Cranford' is an embarrassment of riches! With its stellar British cast, it is a treat to watch and is altogether funny, witty and disarmingly heartwarming. 'Wives and Daughters' has a very identifiable story and is brilliant in its attempt at exploring how women think and do the things they do. Michael Gambon, Francesca Annis and Justine Waddell make watching W&S a memorable experience.'North and South' is unlike either of the previous works mentioned. It is much more profound I thought – going by the BBC adaptation at least – in its exploration of the human condition. It has shades of the works of George Eliot in its richness of characterization; of Dickens in its social realism and of Jane Austen in its unraveling of dormant passions. To be honest, I didn't think 'North & South was not without its faults. I get that Margaret Hale was the central character but at times I felt that the story was too one-sided. Everyone who ever spoke to John Thornton invariably ended up talking about Margaret which I thought was a bit unreal. And then there were the stock elements – now so overused – to make the hero seethe in jealousy: the mention of another eligible bachelor (Henry Lennox) in Margaret's life; the sight of her embracing another man! Gasp! The train station scene was the most predictable I felt. When the scene started with Margaret and Frederick bidding their goodbyes, I just thought to myself, \"And who should witness this lovey-dovey farewell but Thornton!\" and then the next instant he was there indeed glowering at them in righteous jealousy! And yes, Thornton's proposal and Margaret's prompt rejection of it has 'Pride and Prejudice' written all over it but literature is rife with heroines turning down marriage proposals because of their prejudices and/or natures – Alcott's Jo March and L M. Montgomery's Anne Shirley being two more similar famous heartbreakers! But I digress Because in spite of everything, this BBC adaptation with Richard Armitage and Daniela Denby-Ashe is simply put – heart-achingly beautiful! The acting, the cinematography, the writing were all top notch. In some shots Daniela Denby-Ashe was so beautifully lit, it was as if the camera was kissing her. Her character Margaret Hale is an incurable do-gooder, sometimes to the extent of being annoying but Daniela brings grace and class to it. But I have to admit that I think Richard Armitage shoulders this adaptation almost single-handedly from the beginning to the end and I cannot imagine anyone else playing the role. I even wonder if this adaptation would have succeeded had some other actor played Richard's character. As the intelligent brooding and conflicted mill-owner John Thornton, Richard Armitage's performance is nothing short of hypnotic. You root for him throughout and in the end, when Margaret professes her love for him by kissing his hand, you can't help but get misty-eyed! This is the first performance of Richard's that I watched and given his devilishly handsome good looks, brooding persona and incredible acting chops, the fact that he isn't more popular and hasn't made it big in Hollywood is a surprise indeed. Sinead Cusack, Tim Piggot-Smith and Brendan Coyle are excellent in supporting roles. I'd like to make special mention of the music given by Martin Phipps. The violin tune composed by him at the start of each part and surfacing in between is absolutely beautiful and complements the story perfectly. I don't want to get into the details of the story of 'North & South' since many over here already have. 'North & South' is another example of BBC doing what they do best – adapt literary classics faithfully and make you wish you lived in an era peopled with the likes of John Thornton, Will Ladislaw and Fitzwilliam Darcy!"
    }
  ],
  "errorMessage": ""
}