{
  "imDbId": "tt0417349",
  "title": "North & South",
  "fullTitle": "North & South (TV Series 2004–2004)",
  "type": "TVSeries",
  "year": "2004",
  "episodes": [
    {
      "id": "tt1326040",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "Episode #1.1",
      "image": "https://m.media-amazon.com/images/M/MV5BOWQ0OTdlYjMtMGExZi00NWUyLThkMTMtNGExMDFjOTA4NzJiXkEyXkFqcGdeQXVyMTgxOTIzNzk@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "14 Nov. 2004",
      "plot": "Margaret Hale, a 19-year-old lively young girl, and her parents leave the south, when her father Richard resigns as the clergy in Helstone on a matter of conscience. The family moves to Milton in the north of England where Mr. Hale starts working as a private tutor. Margaret and her mother find it difficult to adapt to the North. While Margaret tries to deal with her new home and thereby befriends Bessy Higgins and her father Nicholas, poor local mill workers, she becomes aware of the social inequalities. On seeing John Thornton, a cotton-mill owner, badly treating ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "462"
    },
    {
      "id": "tt1326041",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "Episode #1.2",
      "image": "https://m.media-amazon.com/images/M/MV5BN2YzZTAyM2UtNDRhMS00MDU1LWJjMjAtNDY2YTFlZjQyZTkxXkEyXkFqcGdeQXVyMTgxOTIzNzk@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "21 Nov. 2004",
      "plot": "Maria Hale's health declines and her daughter Margaret decides to contact her brother Frederick - who had to leave England years earlier due to a wrongful court decision. The mill workers in Milton go on strike. In order to get his orders done in time, Thornton hires Irish workers. The angry strikers hear of this and in an attempt to threaten Thornton they hurt Margaret. Overwhelmed by Margaret's openly apparent readiness to save him from the strikers, Thornton decides to propose to her.",
      "imDbRating": "8.2",
      "imDbRatingCount": "416"
    },
    {
      "id": "tt1326042",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "Episode #1.3",
      "image": "https://m.media-amazon.com/images/M/MV5BNjNiMzliYzctZWVmNS00OGY5LTllN2EtNzI5MzYyM2RkNTRjXkEyXkFqcGdeQXVyMTgxOTIzNzk@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "28 Nov. 2004",
      "plot": "Deeply hurt at the refusal of his marriage proposal, Thornton and Margaret's relationship becomes more tense and difficult. Just in time, Frederick comes home to visit his dying mother. Shortly after Margaret's friend Bessy Higgins dies, her mother also dies. Thornton mistakes Frederick for Margaret's lover when he sees them saying goodbye late at night at the train station As Margaret realizes that she might have been mistaken in her harsh and hasty criticism of Thornton, she has to sadly observe his opinion of her altering.",
      "imDbRating": "8.1",
      "imDbRatingCount": "391"
    },
    {
      "id": "tt1326043",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "Episode #1.4",
      "image": "https://m.media-amazon.com/images/M/MV5BNTg4Y2FkNGEtODQ4ZS00Y2FmLWE2ZjQtYzRlMjRjZmZkZmYwXkEyXkFqcGdeQXVyMTgxOTIzNzk@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "5 Dec. 2004",
      "plot": "Frederick safely reaches Spain. After her father's death, Margaret leaves Milton to live with her aunt in London. Thornton learns that Frederick is Margaret's brother. With the money that she inherited from Mr. Bell, her godfather, she decides to help Mr. Thornton's mill from closing.",
      "imDbRating": "8.6",
      "imDbRatingCount": "438"
    }
  ],
  "errorMessage": ""
}