{
  "imDbId": "tt0417349",
  "title": "North & South",
  "fullTitle": "North & South (TV Series 2004–2004)",
  "type": "TVSeries",
  "year": "2004",
  "language": "en",
  "titleInLanguage": "North &amp; South (TV serial)",
  "url": "https://en.wikipedia.org/wiki/North_%26_South_(TV_serial)",
  "plotShort": {
    "plainText": "North & South is a British television historical drama programme, produced by the BBC and originally broadcast in four episodes on BBC One in November and December 2004. It follows the story of Margaret Hale (Daniela Denby-Ashe), a young woman from southern England who has to move to the North after her father decides to leave the clergy. The family struggles to adjust itself to the industrial town's customs, especially after meeting the Thorntons, a proud family of cotton mill owners who at first seem to despise their social inferiors. The story explores the issues of class and gender, as Margaret's sympathy for the town mill workers clashes with her growing attraction to John Thornton (Richard Armitage).\r\nThe serial is based on the 1855 Victorian novel North and South by Elizabeth Gaskell and takes place in the years surrounding the Great Exhibition of 1851. It was adapted for television by Sandy Welch and directed by Brian Percival.",
    "html": "<p>North & South is a British television historical drama programme, produced by the BBC and originally broadcast in four episodes on BBC One in November and December 2004. It follows the story of Margaret Hale (Daniela Denby-Ashe), a young woman from southern England who has to move to the North after her father decides to leave the clergy. The family struggles to adjust itself to the industrial town's customs, especially after meeting the Thorntons, a proud family of cotton mill owners who at first seem to despise their social inferiors. The story explores the issues of class and gender, as Margaret's sympathy for the town mill workers clashes with her growing attraction to John Thornton (Richard Armitage).</p><p>The serial is based on the 1855 Victorian novel North and South by Elizabeth Gaskell and takes place in the years surrounding the Great Exhibition of 1851. It was adapted for television by Sandy Welch and directed by Brian Percival.</p>"
  },
  "plotFull": {
    "plainText": "North & South is a British television historical drama programme, produced by the BBC and originally broadcast in four episodes on BBC One in November and December 2004. It follows the story of Margaret Hale (Daniela Denby-Ashe), a young woman from southern England who has to move to the North after her father decides to leave the clergy. The family struggles to adjust itself to the industrial town's customs, especially after meeting the Thorntons, a proud family of cotton mill owners who at first seem to despise their social inferiors. The story explores the issues of class and gender, as Margaret's sympathy for the town mill workers clashes with her growing attraction to John Thornton (Richard Armitage).\r\nThe serial is based on the 1855 Victorian novel North and South by Elizabeth Gaskell and takes place in the years surrounding the Great Exhibition of 1851. It was adapted for television by Sandy Welch and directed by Brian Percival.\r\nPlot\r\nMargaret Hale (Daniela Denby-Ashe) and her parents Maria (Lesley Manville) and Richard (Tim Pigott-Smith) live in the idyllic town in Helstone in Hampshire. At the wedding of her cousin, Edith, Margaret is approached by Edith's new brother-in-law, Henry Lennox (John Light). Lennox visits Helstone a while later and proposes marriage to Margaret; she refuses him.\r\nMargaret's father, a clergyman, has long harbored doubts about the doctrines of the Church of England and resigns his position rather than attest to orthodox beliefs as his bishop requires. To avoid gossip, the family move to the (fictional) industrial town of Milton, Darkshire, in the north of England. Thanks to his friend, Mr. Bell (Brian Protheroe), Mr. Hale is able to find a house. Giving lessons as a private tutor provides him a modest income. One of his pupils is local mill-owner John Thornton (Richard Armitage), who gets off to a bad start with Margaret when she witnesses him beating a worker whom he has caught smoking in the mill, which endangers all the workers. Gradually, Margaret gets used to Thornton, but his mother Hannah (Sinéad Cusack) and sister Fanny (Jo Joyner) disapprove of her, believing her haughty and alien to the customs of the North. In the meantime, Margaret attempts to do charitable work among the mill workers and comes into contact with Nicholas Higgins (Brendan Coyle) and his daughter, Bessy (Anna Maxwell Martin), who suffers from byssinosis from exposure to the cotton fibres in the mills. When Bessy became ill at Hamper's Mill, her father moved her to Marlborough Mills, Thornton's mill, because the working environment is better there. In a meeting with fellow mill owners, Thornton says he had a wheel for ventilation installed in all of the rooms of his factory in order to maintain a healthier workforce, despite the fact that it costs a great deal of money. The other industrialists had refused to install a wheel because of the expense.\r\nMargaret's mother is falling ill. Mrs. Hale desires to see her son, Frederick (Rupert Evans), before she dies. Frederick, a naval officer, was involved in a mutiny and he cannot return to England without risking his life. However, without telling her father, Margaret writes to her brother in Cádiz, Spain, to tell him that their mother is dying. Margaret calls on the Thorntons to borrow a water mattress for her mother and is trapped there while the mill workers riot during a strike. When the angry mob threatens John's safety as he confronts them after Margaret's goading, Margaret defends him from the rioters and is injured by a thrown stone.\r\nMargaret recovers and returns home, telling nobody about what had happened at the Mill, mainly to protect the health of her mother. When Thornton proposes to her the next day, she scorns him, thinking he believes himself superior because of the difference in their financial circumstances. He denies this and tells her that he is in love with her, but she insists that her actions were not personal.\r\nMeanwhile, Bessy Higgins dies and Thornton stops coming for lessons from Mr. Hale. As a distraction for Mrs. Hale and for herself, Margaret visits the Great Exhibition with her Aunt Shaw (Jane Booker), her cousin Edith and Edith's husband. Margaret meets Thornton at the exhibition, where he is discussing the machinery with a group of gentlemen, all of whom are listening with great respect and admiration for his simple good sense. Margaret is embarrassed to meet Thornton so soon after her rejection but defends him when Henry Lennox, who is also attending the exhibition, tries to belittle him for being in trade. As Margaret observes them together, Henry's sophistication and reliance on fashionable wit and sarcasm compares unfavourably with Thornton's honesty.\r\nWhen Margaret returns home, her mother has taken a turn for the worse. Margaret's brother arrives just in time to see his mother, and she dies shortly after. While Frederick is in the house, Thornton comes to visit his friend Mr. Hale, but he cannot be allowed in, in case he sees Fred. Thornton interprets this as Margaret refusing to see him. The family's servant, Miss Dixon (Pauline Quirke), bumps into Leonards, a former member of Frederick's crew in Milton town, who offers to split the reward money for Frederick's capture with her. Dixon refuses, informing the Hales; it is decided that Frederick must leave at once, before he is discovered and arrested. He and Margaret are seen together at the railway station by Thornton, who mistakenly assumes that Frederick is Margaret's lover. Leonards spies on him and Margaret at the station, and in the brief scuffle Fred pushes him down the stairs. It is later revealed that he died in hospital. Margaret denies to the police that she was at the station, in order to protect Fred, but Thornton, who is the magistrate and saw her there, is morally tested, but ultimately calls off the impending inquiry for the sake of Margaret.\r\nThornton gives employment to Higgins who seeks work to care for Boucher's children after his death, and master and hand get along surprisingly well, despite their differences. They come up with a plan to feed the workers cheaply in a communal kitchen, and Thornton comes to a greater understanding with his workers as they share ideas. However, losses faced during the strike have put Thornton's business in trouble, and he is forced to close the mill.\r\nMargaret's father visits Mr. Bell in Oxford, and dies there. With no family to keep her in Milton, Margaret leaves the north to stay with her aunt in London. After a few months living with the Shaws, Margaret visits Helstone with Mr. Bell, and meets the new vicar and his wife. Margaret is disappointed to find Helstone much changed, and realises that she has romanticised and idealised her childhood home, and starts to truly recognise the merits of life in Milton.\r\nAs Margaret's godfather, Mr. Bell makes over his significant fortune to her when he finds out that he has a terminal illness and chooses to move to Argentina for the better climate. Margaret hence becomes the owner of Marlborough Mills and John Thornton's landlord. Margaret visits Milton with Henry Lennox, who is now acting as her financial advisor; she speaks with Mrs. Thornton at Malborough Mills, expressing her realisation of Mr. Thornton's true character. Meanwhile, Thornton, having discovered the truth about Fred being Margaret's brother from Higgins, goes south to see Margaret's home town of Helstone. At a railway station halfway between Milton and Helstone, Margaret and Thornton cross paths on their respective return journeys. She proposes a business deal by which the factory can be reopened; after this the two share a kiss. Margaret bids farewell to Henry, and gets on the train \"home\" to Milton with Thornton.\r\nCast\r\nDaniela Denby-Ashe – Margaret Hale\r\nRichard Armitage – John Thornton\r\nTim Pigott-Smith – Mr Richard Hale\r\nLesley Manville – Mrs Maria Hale\r\nSinéad Cusack – Mrs Hannah Thornton\r\nJo Joyner – Fanny Thornton\r\nBrendan Coyle – Mr Nicholas Higgins\r\nAnna Maxwell Martin – Bessy Higgins\r\nKay Lyon – Mary Higgins\r\nPauline Quirke – Dixon\r\nRupert Evans – Frederick Hale\r\nBrian Protheroe – Mr. Bell\r\nJohn Light – Henry Lennox\r\nEmma Ferguson – Edith Shaw Lennox\r\nJane Booker – Aunt Shaw\r\nWill Houston – John Boucher\r\nCherry Alto - Beky\r\nProduction\r\nOrigins\r\nSandy Welch started adapting Elizabeth Gaskell's 1855 North and South in 2001, making a few changes to emphasise the industrial landscape of the story. Welch's story, for example, begins and ends with the main character Margaret Hale travelling by train, which is not the starting and ending point of the novel (although Gaskell describes the Hales travelling from the South to the North by train). Welch also made the main characters visit the Great Exhibition of 1851. These are changes Welch believed Gaskell would have done \"if she'd had the time\", since Gaskell had complained of being under pressure to complete the novel by her editor Charles Dickens. In the summer of 2003 Kate Bartlett was brought to the project as a producer and a ten-week period of pre-production started at the beginning of February.\r\nCasting\r\nDaniela Denby-Ashe had not originally auditioned for the role of Margaret Hale but for that of Fanny Thornton, and was not sure she would be participating on the project, but the producers had been looking for the right Margaret for a long time and Denby-Ashe's \"directness, energy and charm\" as well as the chemistry she had with would-be co-star Richard Armitage proved decisive. Armitage himself had been the first actor to read for the role of John Thornton and even though his performance had impressed producer Kate Bartlett and casting director Jill Trevellick, they still had to see many other possible Thorntons. Three weeks after casting had begun, Trevellick decided to recapitulate the first auditions, realising that Armitage was \"perfect\".\r\nFilming\r\nFilming took place from the end of April 2004 until July 2004. Gaskell's fictional town of Milton, Darkshire, was loosely based on Manchester, but the producers decided to shoot many of the town scenes in Edinburgh, which maintains more of its visual and architectural heritage from the industrial Victorian era. Keighley in West Yorkshire became one of the main locations, the cotton mill's exteriors were filmed at Dalton Mill. The scenes inside the mill were shot at Helmshore Textile Museum in Rossendale and Queen Street Mill on the outskirts of Burnley, Lancashire. London was another main location, all the interior scenes were shot at the Ealing Studios in west London and the Great Exhibition scene was shot at Alexandra Palace in North London. Other locations were Selkirk, a town in the Scottish Borders, Burnley in Lancashire, and the Bluebell Railway in Sussex, where the final and the beginning scenes were shot. Additional railway sequences were filmed in Yorkshire, using carriages provided by the Vintage Carriages Trust.\r\nAs a costume drama, North & South required substantial work from the art department. In 2005 the serial's production designer Simon Elliot received a British Academy Television Award nomination for Best Production Design.\r\nMusic\r\nMartin Phipps composed the score for North & South. The short piano tune is played throughout the whole series in different rhythms. The music is especially loud and clear whenever there is a turning point in the relationship between Margaret and Thornton.\r\nReception\r\nAs the BBC had low expectations for the series, it was not well publicised and went almost unnoticed by critics. Audiences, however, were more receptive; hours after the first episode aired in November 2004, the message board of the programme's website crashed because of the number of visitors the site was receiving, forcing host bbc.co.uk to shut it down. This sudden interest on the serial was attributed to Richard Armitage, a relatively unknown actor, whose portrayal of the emotionally restrained John Thornton drew parallels with Colin Firth's portrayal of Fitzwilliam Darcy on the BBC's 1995 mini-series Pride and Prejudice, and the reception he later received. Armitage himself claims that the series was a success because of the \"industrial landscape and the attention to the working classes and the way they develop\". The reaction to the series was a surprise to the BBC, who then decided to release the DVD on 11 April 2005.\r\nNorth & South was voted \"Best Drama\" in the BBC drama website's annual poll in 2004. Richard Armitage was voted \"Most Desirable Drama Star\" and \"Best Actor\", Daniela Denby-Ashe was voted \"Best Actress\" and three different scenes were voted as the year's \"Favourite Moments\", with the final scene winning the number one spot.",
    "html": "<p>North & South is a British television historical drama programme, produced by the BBC and originally broadcast in four episodes on BBC One in November and December 2004. It follows the story of Margaret Hale (Daniela Denby-Ashe), a young woman from southern England who has to move to the North after her father decides to leave the clergy. The family struggles to adjust itself to the industrial town's customs, especially after meeting the Thorntons, a proud family of cotton mill owners who at first seem to despise their social inferiors. The story explores the issues of class and gender, as Margaret's sympathy for the town mill workers clashes with her growing attraction to John Thornton (Richard Armitage).</p><p>The serial is based on the 1855 Victorian novel North and South by Elizabeth Gaskell and takes place in the years surrounding the Great Exhibition of 1851. It was adapted for television by Sandy Welch and directed by Brian Percival.</p><br/><h3>Plot</h3><p>Margaret Hale (Daniela Denby-Ashe) and her parents Maria (Lesley Manville) and Richard (Tim Pigott-Smith) live in the idyllic town in Helstone in Hampshire. At the wedding of her cousin, Edith, Margaret is approached by Edith's new brother-in-law, Henry Lennox (John Light). Lennox visits Helstone a while later and proposes marriage to Margaret; she refuses him.</p><p>Margaret's father, a clergyman, has long harbored doubts about the doctrines of the Church of England and resigns his position rather than attest to orthodox beliefs as his bishop requires. To avoid gossip, the family move to the (fictional) industrial town of Milton, Darkshire, in the north of England. Thanks to his friend, Mr. Bell (Brian Protheroe), Mr. Hale is able to find a house. Giving lessons as a private tutor provides him a modest income. One of his pupils is local mill-owner John Thornton (Richard Armitage), who gets off to a bad start with Margaret when she witnesses him beating a worker whom he has caught smoking in the mill, which endangers all the workers. Gradually, Margaret gets used to Thornton, but his mother Hannah (Sinéad Cusack) and sister Fanny (Jo Joyner) disapprove of her, believing her haughty and alien to the customs of the North. In the meantime, Margaret attempts to do charitable work among the mill workers and comes into contact with Nicholas Higgins (Brendan Coyle) and his daughter, Bessy (Anna Maxwell Martin), who suffers from byssinosis from exposure to the cotton fibres in the mills. When Bessy became ill at Hamper's Mill, her father moved her to Marlborough Mills, Thornton's mill, because the working environment is better there. In a meeting with fellow mill owners, Thornton says he had a wheel for ventilation installed in all of the rooms of his factory in order to maintain a healthier workforce, despite the fact that it costs a great deal of money. The other industrialists had refused to install a wheel because of the expense.</p><p>Margaret's mother is falling ill. Mrs. Hale desires to see her son, Frederick (Rupert Evans), before she dies. Frederick, a naval officer, was involved in a mutiny and he cannot return to England without risking his life. However, without telling her father, Margaret writes to her brother in Cádiz, Spain, to tell him that their mother is dying. Margaret calls on the Thorntons to borrow a water mattress for her mother and is trapped there while the mill workers riot during a strike. When the angry mob threatens John's safety as he confronts them after Margaret's goading, Margaret defends him from the rioters and is injured by a thrown stone.</p><p>Margaret recovers and returns home, telling nobody about what had happened at the Mill, mainly to protect the health of her mother. When Thornton proposes to her the next day, she scorns him, thinking he believes himself superior because of the difference in their financial circumstances. He denies this and tells her that he is in love with her, but she insists that her actions were not personal.</p><p>Meanwhile, Bessy Higgins dies and Thornton stops coming for lessons from Mr. Hale. As a distraction for Mrs. Hale and for herself, Margaret visits the Great Exhibition with her Aunt Shaw (Jane Booker), her cousin Edith and Edith's husband. Margaret meets Thornton at the exhibition, where he is discussing the machinery with a group of gentlemen, all of whom are listening with great respect and admiration for his simple good sense. Margaret is embarrassed to meet Thornton so soon after her rejection but defends him when Henry Lennox, who is also attending the exhibition, tries to belittle him for being in trade. As Margaret observes them together, Henry's sophistication and reliance on fashionable wit and sarcasm compares unfavourably with Thornton's honesty.</p><p>When Margaret returns home, her mother has taken a turn for the worse. Margaret's brother arrives just in time to see his mother, and she dies shortly after. While Frederick is in the house, Thornton comes to visit his friend Mr. Hale, but he cannot be allowed in, in case he sees Fred. Thornton interprets this as Margaret refusing to see him. The family's servant, Miss Dixon (Pauline Quirke), bumps into Leonards, a former member of Frederick's crew in Milton town, who offers to split the reward money for Frederick's capture with her. Dixon refuses, informing the Hales; it is decided that Frederick must leave at once, before he is discovered and arrested. He and Margaret are seen together at the railway station by Thornton, who mistakenly assumes that Frederick is Margaret's lover. Leonards spies on him and Margaret at the station, and in the brief scuffle Fred pushes him down the stairs. It is later revealed that he died in hospital. Margaret denies to the police that she was at the station, in order to protect Fred, but Thornton, who is the magistrate and saw her there, is morally tested, but ultimately calls off the impending inquiry for the sake of Margaret.</p><p>Thornton gives employment to Higgins who seeks work to care for Boucher's children after his death, and master and hand get along surprisingly well, despite their differences. They come up with a plan to feed the workers cheaply in a communal kitchen, and Thornton comes to a greater understanding with his workers as they share ideas. However, losses faced during the strike have put Thornton's business in trouble, and he is forced to close the mill.</p><p>Margaret's father visits Mr. Bell in Oxford, and dies there. With no family to keep her in Milton, Margaret leaves the north to stay with her aunt in London. After a few months living with the Shaws, Margaret visits Helstone with Mr. Bell, and meets the new vicar and his wife. Margaret is disappointed to find Helstone much changed, and realises that she has romanticised and idealised her childhood home, and starts to truly recognise the merits of life in Milton.</p><p>As Margaret's godfather, Mr. Bell makes over his significant fortune to her when he finds out that he has a terminal illness and chooses to move to Argentina for the better climate. Margaret hence becomes the owner of Marlborough Mills and John Thornton's landlord. Margaret visits Milton with Henry Lennox, who is now acting as her financial advisor; she speaks with Mrs. Thornton at Malborough Mills, expressing her realisation of Mr. Thornton's true character. Meanwhile, Thornton, having discovered the truth about Fred being Margaret's brother from Higgins, goes south to see Margaret's home town of Helstone. At a railway station halfway between Milton and Helstone, Margaret and Thornton cross paths on their respective return journeys. She proposes a business deal by which the factory can be reopened; after this the two share a kiss. Margaret bids farewell to Henry, and gets on the train \"home\" to Milton with Thornton.</p><br/><h3>Cast</h3><ul><li>Daniela Denby-Ashe – Margaret Hale</li><li>Richard Armitage – John Thornton</li><li>Tim Pigott-Smith – Mr Richard Hale</li><li>Lesley Manville – Mrs Maria Hale</li><li>Sinéad Cusack – Mrs Hannah Thornton</li><li>Jo Joyner – Fanny Thornton</li><li>Brendan Coyle – Mr Nicholas Higgins</li><li>Anna Maxwell Martin – Bessy Higgins</li><li>Kay Lyon – Mary Higgins</li><li>Pauline Quirke – Dixon</li><li>Rupert Evans – Frederick Hale</li><li>Brian Protheroe – Mr. Bell</li><li>John Light – Henry Lennox</li><li>Emma Ferguson – Edith Shaw Lennox</li><li>Jane Booker – Aunt Shaw</li><li>Will Houston – John Boucher</li><li>Cherry Alto - Beky</li></ul><br/><h3>Production</h3><h4>Origins</h4><p>Sandy Welch started adapting Elizabeth Gaskell's 1855 North and South in 2001, making a few changes to emphasise the industrial landscape of the story. Welch's story, for example, begins and ends with the main character Margaret Hale travelling by train, which is not the starting and ending point of the novel (although Gaskell describes the Hales travelling from the South to the North by train). Welch also made the main characters visit the Great Exhibition of 1851. These are changes Welch believed Gaskell would have done \"if she'd had the time\", since Gaskell had complained of being under pressure to complete the novel by her editor Charles Dickens. In the summer of 2003 Kate Bartlett was brought to the project as a producer and a ten-week period of pre-production started at the beginning of February.</p><h4>Casting</h4><p>Daniela Denby-Ashe had not originally auditioned for the role of Margaret Hale but for that of Fanny Thornton, and was not sure she would be participating on the project, but the producers had been looking for the right Margaret for a long time and Denby-Ashe's \"directness, energy and charm\" as well as the chemistry she had with would-be co-star Richard Armitage proved decisive. Armitage himself had been the first actor to read for the role of John Thornton and even though his performance had impressed producer Kate Bartlett and casting director Jill Trevellick, they still had to see many other possible Thorntons. Three weeks after casting had begun, Trevellick decided to recapitulate the first auditions, realising that Armitage was \"perfect\".</p><h4>Filming</h4><p>Filming took place from the end of April 2004 until July 2004. Gaskell's fictional town of Milton, Darkshire, was loosely based on Manchester, but the producers decided to shoot many of the town scenes in Edinburgh, which maintains more of its visual and architectural heritage from the industrial Victorian era. Keighley in West Yorkshire became one of the main locations, the cotton mill's exteriors were filmed at Dalton Mill. The scenes inside the mill were shot at Helmshore Textile Museum in Rossendale and Queen Street Mill on the outskirts of Burnley, Lancashire. London was another main location, all the interior scenes were shot at the Ealing Studios in west London and the Great Exhibition scene was shot at Alexandra Palace in North London. Other locations were Selkirk, a town in the Scottish Borders, Burnley in Lancashire, and the Bluebell Railway in Sussex, where the final and the beginning scenes were shot. Additional railway sequences were filmed in Yorkshire, using carriages provided by the Vintage Carriages Trust.</p><p>As a costume drama, North & South required substantial work from the art department. In 2005 the serial's production designer Simon Elliot received a British Academy Television Award nomination for Best Production Design.</p><h4>Music</h4><p>Martin Phipps composed the score for North & South. The short piano tune is played throughout the whole series in different rhythms. The music is especially loud and clear whenever there is a turning point in the relationship between Margaret and Thornton.</p><br/><h3>Reception</h3><p>As the BBC had low expectations for the series, it was not well publicised and went almost unnoticed by critics. Audiences, however, were more receptive; hours after the first episode aired in November 2004, the message board of the programme's website crashed because of the number of visitors the site was receiving, forcing host bbc.co.uk to shut it down. This sudden interest on the serial was attributed to Richard Armitage, a relatively unknown actor, whose portrayal of the emotionally restrained John Thornton drew parallels with Colin Firth's portrayal of Fitzwilliam Darcy on the BBC's 1995 mini-series Pride and Prejudice, and the reception he later received. Armitage himself claims that the series was a success because of the \"industrial landscape and the attention to the working classes and the way they develop\". The reaction to the series was a surprise to the BBC, who then decided to release the DVD on 11 April 2005.</p><p>North & South was voted \"Best Drama\" in the BBC drama website's annual poll in 2004. Richard Armitage was voted \"Most Desirable Drama Star\" and \"Best Actor\", Daniela Denby-Ashe was voted \"Best Actress\" and three different scenes were voted as the year's \"Favourite Moments\", with the final scene winning the number one spot.</p><br/>"
  },
  "errorMessage": ""
}