{
  "imDbId": "tt10850932",
  "title": "Crash Landing on You",
  "fullTitle": "Crash Landing on You (TV Series 2019–2020)",
  "type": "TVSeries",
  "year": "2019",
  "items": [
    {
      "username": "phd_travel",
      "userUrl": "https://www.imdb.com/user/ur22484170",
      "reviewLink": "https://www.imdb.com/review/rw5506155",
      "warningSpoilers": true,
      "date": "24 February 2020",
      "rate": "10",
      "helpful": "107 out of 113 found this helpful.",
      "title": "The romance, the comedy, the drama - a perfect blend",
      "content": "This is simply the most thoroughly enjoyable series I have seen on TV for years in any language. The comedy the romance and the drama are all successfully blended. Love the ongoing comedy about the differences between North and South Korea - all freshly done and spot on. Neither side is spared or treated unfairly. The farewells are heartbreaking and the romantic scenes are unforgettable. Many memorable scenes from the motorcycle rescue to his parents house. And the tightly constructed exciting story amazingly leaves no holes and has no red herrings while making use of the unique divide that exists in the peninsula. The Korean country side is idyllic and and so is the magical beauty of Switzerland.Hyun Bin is ideal as the North Korean soldier - can't think of another actor who could have been better and he has some truly standout heroic rescue and romantic scenes. Son Ye Jin is sweet and pretty and makes her character likeable and sympathetic - not annoying at all. Her range is impressive. The supporting characters are sympathetic especially the scoundrel Gu with a heart and seemingly cold fiance Seo Dan. The cute bunch of N Korean soldiers are all endearing and the evil and greed in the S Korean family members is painfully familiar.Hollywood hasn't been able to come up with anything fictional of this standard. The best series are based on true events and people like Narcos. Hollywood series have been dominated by worthy but depressing subjects like rape, suicide and racial injusticeYou will laugh cry and just be completely captivated. I wonder how they can ever top this."
    },
    {
      "username": "mayaagustini",
      "userUrl": "https://www.imdb.com/user/ur103468838",
      "reviewLink": "https://www.imdb.com/review/rw5419981",
      "warningSpoilers": false,
      "date": "19 January 2020",
      "rate": "10",
      "helpful": "131 out of 137 found this helpful.",
      "title": "Great Romantic series",
      "content": "I don't watch korean series much! just randomly play this series on netflix, but this is exception. the more episode i seen .. i the more i am in love with the story line, characters of each role and many more.Hyu Bin & Sonye Jin you guys are rock! Congrats for making korean series worldwide via Netflix"
    },
    {
      "username": "AJ_McAninch",
      "userUrl": "https://www.imdb.com/user/ur34738421",
      "reviewLink": "https://www.imdb.com/review/rw5420619",
      "warningSpoilers": false,
      "date": "19 January 2020",
      "rate": "10",
      "helpful": "115 out of 123 found this helpful.",
      "title": "Superb Love Story and More",
      "content": "With this KDrama, we have a proven team: terrific writer, director, co-stars, and cast in a delightful love story but also lots of fun with the captain's squad, the village ajummas, a really evil bad guy, and jokes and teasing. These charms are combined with the longing for reunification that handles both North and South Koreans with love and respect. And both leads are at their most beautiful and talented. I swear Hyun Bin has never been better with that quiet, low voice, steady eyes, and sly smile taking every scene but never dominating. And, of course, Son Ye Jin is wondrous: beautiful, brilliant, touching, and hilarious. This series is a treat."
    },
    {
      "username": "AJ_McAninch",
      "userUrl": "https://www.imdb.com/user/ur34738421",
      "reviewLink": "https://www.imdb.com/review/rw5489342",
      "warningSpoilers": false,
      "date": "16 February 2020",
      "rate": "10",
      "helpful": "83 out of 90 found this helpful.",
      "title": "Crash Landing on My Heart.",
      "content": "\"If you give up on waiting, the pain of loss will kill you. That's why I wait.\" -Captain Ri.Most people who have watched the entire series, love CLOY, which is one of KDrama's finest series, for some of the following points:1. The writer, Park Ji-eun, who also gave us \"You Who Came from the Star\" is one of the best, knowing how to balance drama, comedy, themes, and closure while keeping her audience intrigued and in love with her characters. The director, Lee Jeong-hyo, who has worked on many series and movies, kept everything focused and carefully paced so that the series steadily evolved each week.2. The cast is one of the best I've seen with immensely beautiful and talented leads, warm, hilarious village ajummas, and Capt. Ri's delightful squad, dubbed \"the ducklings\"-all of whom became a family for one another and for the viewers.3. Themes varying from the pain of losing family, being abandoned and becoming a street orphan all the way to the belief in a Zen appreciation for patience and waiting, also kindness, protection, sacrifice, and unconditional love. The themes drive the plot, and the cast brought everything to life, making us impatient for each weekend to finally roll around so we can see what happens next to our beloved characters, whether love, laughter, danger and heartbreak, we got on that train with them.4. A great story that keeps the reader interested, a love story whose premise was there from the beginning and revealed brilliantly in the steady epilogues. But also the comedy of the sidekick-and the horror of the bad guy consumed with envy and jealousy that destroys innocence and beauty, making this the classical struggle between good and evil embraced by every generation since time.5. The touching, beautiful OST, which many fans have downloaded. The piano piece \"Song for My Brother\" leaves me in tears every time.6. A wealthy, beautiful but hurt woman who learns to love herself as well as others, who can be hilarious and sassy, yet who finds strength in loving and protecting the most amazing man-Capt. Ri.7. A beautiful man, a pianist who becomes an army officer, a quiet philosopher and tomato plant caretaker with a \"low voice\"-the kindest man I believe I've ever seen in any narrative-who adores the hurt woman, knows who she is, finds her, protects her, and loves her no matter what evil, what danger threatens them. Yes, he sounds too good to be true. . . . .but he's not. The whole world is in love with Capt. Ri because Hyun Bin developed him and made us believe that such a man can exist."
    },
    {
      "username": "seethachymiso",
      "userUrl": "https://www.imdb.com/user/ur101769141",
      "reviewLink": "https://www.imdb.com/review/rw5342809",
      "warningSpoilers": false,
      "date": "22 December 2019",
      "rate": "10",
      "helpful": "76 out of 82 found this helpful.",
      "title": "I hope this is a keeper",
      "content": "Recently, I have been trying so hard to get hooked on another K- drama. All I ask is that they keep the humor fresh and the romance sweet.In two episodes, I am already drawn in. I now hope that some romance occurs, but the future of this drama is yet to be determined.The series follows Ye Ri, a South Korean heiress when she accidentally falls into North Korea after a paragliding accident. All because of a tornado that had flying tractors. I laughed when she pointed that out.I hope Ye Ri has a good character development arc, I would love to see her grow. You bet I will continue to watch this. Sign me up, you got a fan."
    },
    {
      "username": "Giselle1710",
      "userUrl": "https://www.imdb.com/user/ur61568240",
      "reviewLink": "https://www.imdb.com/review/rw5875797",
      "warningSpoilers": false,
      "date": "2 July 2020",
      "rate": "10",
      "helpful": "29 out of 30 found this helpful.",
      "title": "THE ABSOLUTE BEST",
      "content": "How can something be so beautifully written and so amazingly acted at the same time? I have read a lot of other k drama reviews which say the best k drama ever and was disappointed after watching that. But THIS. IS. A. MASTERPIECE. I cried a river watching the last episode and I plan on crying a bit more watching it AGAIN and AGAIN.."
    },
    {
      "username": "vad19894",
      "userUrl": "https://www.imdb.com/user/ur38244363",
      "reviewLink": "https://www.imdb.com/review/rw5716093",
      "warningSpoilers": false,
      "date": "7 May 2020",
      "rate": "10",
      "helpful": "45 out of 49 found this helpful.",
      "title": "Well balanced and memorable",
      "content": "It was a long time that I had not watched K-drama before watching this drama and I must say I made a right decision. This drama packs great scenery: the color and atmosphere are so soothing in Swiss that you wish you could be therelaughs and humor: unpredictable punch lines are not scarcebeautiful love story: you will smile /cry happily and swoon for the couples' cheesy momentsplot full of twists: this drama is not some kind of bland linear story. Its story has depth and meaningmany more: hot actors and actresses, funny supporting characters and lots of moral and life lessons delivered in deep and gentle waysJust watch it and you will have a good time"
    },
    {
      "username": "cherstarkey",
      "userUrl": "https://www.imdb.com/user/ur19305563",
      "reviewLink": "https://www.imdb.com/review/rw5416351",
      "warningSpoilers": true,
      "date": "18 January 2020",
      "rate": "10",
      "helpful": "126 out of 134 found this helpful.",
      "title": "Ridiculously Amazing Love Story!!",
      "content": "What a unique story!! Imagine a rich businesswoman from S Korea goes paragliding in her freetime to de-stress and gets caught in a tornado that blows her into N Korea. She gets rescued by a handsome army guy and his rag-tag troop of subordinates (belovedly nicknamed \"the ducklings\"). The army captain ends up having to rescue her and protect her many times over, and she continuously stymies and befuddles this straight-laced, Joe Friday, \"Just the facts, Ma'am\", pragmatic officer.Americans: Get past the one-inch barriers called subtitles and allow the looooong, dramatic pauses to roll off your shoulders (there aren't as many as other K shows). The characters are so well written that you will love them all. Even the bad guy played by Man-Seok Oh is sooooo good at being bad (not to mention a cutie too). You get all you could ever want in an entertaining show with this one. Give it a whirl!!!"
    },
    {
      "username": "royhectorkabanlit",
      "userUrl": "https://www.imdb.com/user/ur77466787",
      "reviewLink": "https://www.imdb.com/review/rw5519617",
      "warningSpoilers": false,
      "date": "1 March 2020",
      "rate": "10",
      "helpful": "31 out of 35 found this helpful.",
      "title": "Instant Classic, an Absolute Masterpiece",
      "content": "I finally finished it, 16 episodes and more than 20 hours of total running time. I'm not a fan of Korean Telenovelas, but I decided to give this one a try because of all the hype and also I thought that anything related to North Korea should be interesting.And it turned out to be quite an amazing series. In fact the hardest thing I had to do was resist watching the next episode because once you start watching it, it's pretty hard to stop.I think the North Korean setting is what makes this series unique and great, and also what kept me going thru some cheesy scenes (this is, after all, a Soap Opera). The setting bought the viewers to an exotic, new place with strange customs, and at the same time allowed the \"Fish Out of Water\" Plot Device on both sides of Korea (a minor spoiler there).Aside from that the series is also very well made in terms of Script and Plot Twists. It initially starts out as a Romantic Comedy with incredibly witty, you-will-fall-out-of-your-chair-laughing dialogue, and eventually evolves into a Soap Opera Thriller towards the middle of the season with clever Cliffhangers at the end of each Episode.The pacing is fast, there are always a lot of things happening onscreen, and the Cinematography is amazing, especially the scenes in Switzerland which made the place almost look like heaven.My only reservation is that is a bit cheesy at times as I mentioned earlier, and also a bit too wholesome for me, which made it feel a bit too unreal at times. I mean, no-tongue kisses, really?And no sex, despite all those gorgeous people sleeping around in each other's apartments? I think they just wanted the series to be as acceptable for as wide an audience as possible.Despite that, overall I would say that this is no ordinary series, it is much better than much of what I have seen on Netflix so far. I think it is an Instant Classic, a Masterpiece that must be seen. Truly outstanding."
    },
    {
      "username": "taztcc",
      "userUrl": "https://www.imdb.com/user/ur76086450",
      "reviewLink": "https://www.imdb.com/review/rw5398922",
      "warningSpoilers": false,
      "date": "11 January 2020",
      "rate": "10",
      "helpful": "106 out of 113 found this helpful.",
      "title": "I love Hyun Bin",
      "content": "Anywhere from \"Memories of the Alhambra\" to extreme like \"Rampant\" , \"Crash Landing on You\" is by far more captivating. Anywhere from little hints to Looks of shuttle love gets me on the edge of my seat, but it's his emotions that make it so heartbreaking. He really brings so much emotional acting to the scenes and I should have known watching memories of the Alhambra. But, this has definitely got me hooked. Everyone wants a knight and shining armor with an edge. Korean dramas are much more on spot compared to many and I have to say the writers went where the love and mystery meet...where no one can go. Thank you and I hope to continue watching many more!"
    },
    {
      "username": "cinnahh",
      "userUrl": "https://www.imdb.com/user/ur99705413",
      "reviewLink": "https://www.imdb.com/review/rw5549362",
      "warningSpoilers": false,
      "date": "14 March 2020",
      "rate": "10",
      "helpful": "78 out of 85 found this helpful.",
      "title": "Currently watching it a second time and here's why ...",
      "content": "For a KD to portray and pull off the North Korean culture and dialect deserves an award in itself. So many dramas fail to capture the depiction of North Korea in the positive sense of things, but this KD does everything in its power to show both the good and bad side of the country including the value of belonging in a community. The character development of both leads and supporting cast was also incredible to watch given no one outshone one another, and each character (whether their part was big or small) had an equal opportunity to tell their life story. Moreover, to unite the two Koreas by plotting a developing romance between two people with completely opposite lives and mantra was a genius idea. The energy and undeniable chemistry you felt from the screen b/w the two leads is honestly unmatched, and the fact that I cried in almost every episode goes to show how big of an impact most of the scenes had on me to feel the way I did."
    },
    {
      "username": "calliopekaz",
      "userUrl": "https://www.imdb.com/user/ur104416474",
      "reviewLink": "https://www.imdb.com/review/rw5537773",
      "warningSpoilers": false,
      "date": "9 March 2020",
      "rate": "10",
      "helpful": "367 out of 383 found this helpful.",
      "title": "IT CHANGED MY LIFE",
      "content": "I've never, ever watched a Korean show and this show just shook me to the core! The plot is out-of-this-world, truly original, and the acting is amazing!!!! I felt every feeling, I laughed, I cries and I can't get enough of it! It's way better than any Hollywood production. Just do yourself a favour and watch it!!!!"
    },
    {
      "username": "nishera",
      "userUrl": "https://www.imdb.com/user/ur100253666",
      "reviewLink": "https://www.imdb.com/review/rw5499651",
      "warningSpoilers": false,
      "date": "21 February 2020",
      "rate": "9",
      "helpful": "20 out of 22 found this helpful.",
      "title": "A Fated \"Love-Across-Borders\" Story",
      "content": "If you have been frustrated by all the recent K-dramas that have been marketed as \"romance\" films just because they include some romantic content, I am pleased to report that this one is the genuine article. Yes, the plot is peppered with lots of suspense, action & comedy as well, but those elements always remain peripheral to the unfolding love story.Aside from being technically polished, this show also boasts a great (if understated) script and cast who were respectively endearing or despicable (depending on their roles). I also loved the layered backstories, deep friendships and various inter-dynamics among the characters. Plus, despite some bittersweet moments, the unconventional ending was happy and hopeful.And although this IS a romance film, I just have to say: THE COMEDY!!! Unlike many K-dramas which might get a chuckle from me with slapstick moments or exaggerated expressions, the humor in this show comes from hilarious culture-related misunderstandings, misinterpretations, shocks and awkwardness that left me in stitches. I nearly woke my kids up a few times because I couldn't stop laughing! And that gaming scene with the \"Memories of the Alhambra\" Easter egg nearly killed me. :DOf course there were some weak points. In particular, I thought many of the hand-to-hand combat scenes seemed a bit unrealistic and looked too rehearsed. There were also a number of scenes that were overly melodramatic, poorly executed or just outright impossible (the tandem paragliding scene, for example). But considering that this show is obviously meant to be a departure from reality, I can't really count these issues as faults. No film can do everything perfectly, right?In summary, if you like K-drama, are looking for a romance story that will make you laugh out loud, cry a little, and you don't mind having to continually suspend your disbelief, you should give this one a try. Highly recommended!ROMANCE RATING: 8.5/10 I thought Hyun Bin & Son YeJin had believable chemistry and they shared 5+ kiss scenes (very generous by K-drama standards!) The more serious kisses were also quite long, and fell somewhere between PG-13 & NC-17 for passion level. To be totally honest, I felt both Hyun Bin & Son YeJin's performances in this film were a bit too understated for my personal taste, but they still delivered when it came to the romantic parts, so it's all good! :)"
    },
    {
      "username": "AppleEye2U",
      "userUrl": "https://www.imdb.com/user/ur9376878",
      "reviewLink": "https://www.imdb.com/review/rw5488874",
      "warningSpoilers": false,
      "date": "16 February 2020",
      "rate": "9",
      "helpful": "30 out of 34 found this helpful.",
      "title": "Solid Gold Classic",
      "content": "What can I say about Crash Landing on You that hasn't been said already? For starters this drama belongs to the Premier Division of k drama IMO, in line with Secret Garden, You Who Came From the Stars, Legend of the Blue Sea. Not entirely coincidental these dramas were aided by respectively the same actor, Hyun Bin, and the same screen writer, Park Ji Eun. The question remains: what's so good about it? I think it is the right mix of story, actors & music.The StoryCrash Landing on You combines many proven genres that capture a worldwide audience from the start: action, romance, comedy, drama, tragedy, business, rags & riches. Moreover it is meticulously written according to the golden rules of screen writing: 1. Use the time of your audience in such a way that they will not feel their time was wasted 2. Give people at least one character to root for 3. Every character should want something, even if it is only a glass of water 4. Every minute must either reveal more of a character or advance the action 5. Start as close to the end as possible 6. Be a sadist. No matter how sweet your characters, make awful things happen to them to show what they are made of 7. Don't try to please the whole world, this only weakens your storyline 8. Give your audience as much information as possible in order to stay hooked. The storytelling is also rock solid: boy meets girl - they get into trouble - things go from bad to worse - there is a closure but at the same time it keeps us from knowing if new developments are good or bad, hoping for a sequel.The ActorsEven well written stories are made or broken by the cast. In this case the acting of each and everyone was on point. I can't imagine any other actor playing the lead than Hyun Bin (the stern and sturdy North Korean army officer Ri Jung Hyuk) and Son Ye Jin (the sophisticated South Korean chaebol heiress Yoon Se Ri). Also the supporting cast did a great job, with honorable mentions for Yang Kyung Won (sergeant Pyo Chi Su who speaks North Korean to a T according to North Korean defector Kang Nara) and Bang Eun Jin playing the emotionally scarred mother of Se Ri.The MusicSo, we've got our story and the right actors, but the soundtrack is the cherry on top. No surprise this soundtrack leads the Top 10 of most downloaded OST's of ALL TIME at the moment I'm writing this review.RewatchSometimes I can forget a story as soon as the clue has been reached, but I think I will definitely rewatch this drama. There are many layers in the episodes that deserve a re-run.VerdictOverall, if you haven't seen this already, go watch it, and get in line with others who are longing for The Sequel."
    },
    {
      "username": "belindaamrein",
      "userUrl": "https://www.imdb.com/user/ur67353905",
      "reviewLink": "https://www.imdb.com/review/rw5517361",
      "warningSpoilers": false,
      "date": "29 February 2020",
      "rate": "10",
      "helpful": "64 out of 69 found this helpful.",
      "title": "Will touch the deepest part of your soul!",
      "content": "\"Even if it breaks my heart because it's a dream that can't come true, I'd like to sincerely dream of the future.\"I finished this Drama an hour ago and I am still just sitting here, not knowing what to do,...or to write, for that matter. I am floored. My heart aches. I am happy and sad and amazed and grateful to have been able to watch this masterpiece. I honestly don't know where to begin. My heart is so full.\"Crash Landing On You\" is a master class in screenwriting. The pacing, the revelations through flashbacks and unlinear storytelling, the perfect balance between tragedy, romance and humor,...and God, the characters!How is it possible to make each and every character of such a big ensemble so complex, relatable and loveable? I was so attached to every single character, that at some point I basically cried through entire episodes, because even when there were happy scenes, I kept thinking that things would probably not stay like that for all my poor babies. At any given time, while watching CLOY, I just had to think of the whole South Korea - North Korea predicament that they are all in and the tears started flowing.The scenes between Jung Hyuk and Se Ri are so raw and real that I often cried, as well. They say crying doesn't necessarily mean you're sad, it just means you are overwhelmed with emotion - no matter which emotion. And that's exactly how I felt. I was so overwhelmed that I cried when it was sad, romantic and funny.I cried buckets and buckets of tears but I also laughed so hard that my stomach was sore the next day. There are so many funny moments in both, North and South Korea, but I think my favorite was Se Ri's department store opening. I almost died laughing.As an aspiring screenwriter and filmmaker, I am deeply humbled by the masterful stroytelling and breathtaking cinematography. There are so many gorgeous settings, such as all the snow scenes, the night of the train break-down and all the scenes in Switzerland.I am Swiss and I've never seen Switzerland portrayed so beautifully. It made me fall in love with my own country, again. It was strange to see the tram I take every week in a K-Drama. It was strange to see the place I spent vacations as a child. It was strange to see the sights I walk past every day, and have them shown in a new light, looking at them through the eyes of these characters to whom Switzerland represents happiness and their own little paradise. Somehow, seeing some of these incredibly emotional scenes against the Swiss backdrop, made them even more emotional for me.I can't mention the Switzerland scenes without mentioning how perfect the OST is, especially \"The Song For My Brother\", \"Flower\", \"Sunset, \"Here I Am Again\", \"The Hill of Yearning\" and \"Photo of My Mind\", which are the perfect musical expression of the Drama's atmosphere and emotions.Last but not least, the acting is brilliant! I've loved Hyun Bin ever since \"A Millionaire's First Love\", and his on-screen chemistry with Son Ye Jin is out of this world. I am also very happy to have been introduced to Kim Jung Hyun, Lee Shin Young and Seo Ji Hye through this Drama.This drama touched the deepest parts of my soul and will forever stay with me!"
    },
    {
      "username": "droche-49966",
      "userUrl": "https://www.imdb.com/user/ur90699355",
      "reviewLink": "https://www.imdb.com/review/rw5460499",
      "warningSpoilers": false,
      "date": "5 February 2020",
      "rate": "10",
      "helpful": "16 out of 17 found this helpful.",
      "title": "I'm in love",
      "content": "Fabulous love story. Yes it has all of the cliches of a K-drama with a woman and man, first disliking each other than falling in love, an evil and dysfunctional. Chaebol family, a jealous girlfriend but it is set in a most uncliched location, North Korea. Lots of action, laughter, intrigue and thrills. Hyun Bin is to die for as the intelligent, handsome, upright North Korean soldier. Son Ye Jin is the whip smart, beautiful chaebol daughter. Watching them come together is a joy to watch."
    },
    {
      "username": "spasek",
      "userUrl": "https://www.imdb.com/user/ur6025018",
      "reviewLink": "https://www.imdb.com/review/rw5834055",
      "warningSpoilers": true,
      "date": "18 June 2020",
      "rate": "10",
      "helpful": "19 out of 22 found this helpful.",
      "title": "The Joy of Love is in the Journey in this Epic Series!",
      "content": "I watched \"Descendants of the Sun\" and wondered if I'd see another series that could match it. Then, I watched \"Mr. Sunshine,\" and thought, \"there's no way I'll ever see another series like this.\" Imagine the joy of being wrong twice! Along comes, \"Crash Landing on You,\" which may end up being my favorite of all of them. It's a toss-up between this and Mr. Sunshine. In short, this is one of the best series I've ever seen, and for me, the Korean Dramas I've watched have not disappointed at all as most are character and plot driven. In fact, overall, I've seen better quality shows out of Korea and Japan in the last several years than I have with American shows.The writing, and especially, the editing is some of the best I've ever seen. The plot is intricately weaved, not using some of the typical cliches and devices as some shows do when trying to get the two main characters together. In this case, we're given the beautiful wise lesson on screen: happiness is in the journey. Not the destination.Seri is a woman who owns her own company and is part of an extremely rich family. Her world, despite the money and success, is cold and empty. She sits alone in a massive penthouse. She has all of the luxuries that one could ask for. However, she has a family, especially her half-siblings, who are about as cut-throat as anyone could imagine. She doesn't realize what is missing in her life until a storm, while para-gliding, blows her across the border into North Korea.Ri Jeong-Hyeok is a North Korean captain who comes across Seri. At first, he and his unit of men aren't sure who Seri is and why she's there. Ri Jeong-Hyeok was a master pianist before joining the military, and intent on solving the mystery of his older brother's death. At first, he seems very straight-forward and unassuming, while underneath is a man full of life, passion, and love.The first set of episodes of Seri trying to adapt to life in a North Korean village are especially hilarious. Imagine a pampered woman suddenly having to go without electricity? How to take a bath...how to cook, etc. As a former Peace Corps volunteer, I know full well what this adaptation feels like!Perhaps for the first time in her life, Seri not only finds a connection with Ri Jeong-Hyeok, but also with the village women and also with the members of Ri Jeong-Hyeok's unit. It's ironic that she had to cross the border to find a group of people who were more like family for her than her real family back home!The best plots are ones that aren't forced or contrived, and this one doesn't use either one. We are taken effortlessly from North Korea into South Korea as Seri and Ri Jeong-Hyeok find themselves at the center of two sinister plots, each one contrived by people on either side (North and South Korea).Of course, the biggest question is: despite the situations they must survive and unravel, can they spend a life together? Is it feasible for two people, from the only divided country in the world, be able to have a relationship? North Korea might as well be the darkside of the moon, as communications between the people of the two countries is non-existent. Finding the answer to this question is the beauty of the journey of this series.The entire cast is simply terrific. They meticulously and effortlessly give us endearing characters who are absolutely hilarious at times and heartfelt at others. All are also able to deftly convey a range of emotions, especially the two leads in Hyun Bin and Ye-Jin Soon whose chemistry is much of what makes this series so incredible.The editing is some of the best I've ever seen in a movie or series as we are given scenes in one episode, only to realize that we were only given a partial look at the whole. Each time, we are given a joyful surprise and many, \"Ah-ha\" moments when we realize what really happened!Apparently North Korean defectors served as consultants on this series to try and make life in North Korea depicted as accurately as possible.Some might feel that the ending isn't the most ideal, but that's why I like it. It's realistic. They end up making the absolute most of the time that they have. These contrived, formulaic \"happy endings\" simply do not reflect life or relationships themselves.I have been watching movies and television series for over 45 years, and frankly, this series absolutely blew me away. It captured my imagination and my heart as I see a veritable \"Romeo and Juliet\" struggling to find ways to connect, love, and protect each other. They are such a short distance away from each other across the border, but as I stated before, the distance might as well be from the earth to the moon. I love stories about relationships, where the two people have to find a way to overcome the obstacles and pitfalls laid out before them. Two people with enough love and determination will always find a way. And that is why the joy of watching this series is in the journey and not the destination! And this journey was simply sweet, magical, and joyful. What more could you ask for in a great series?"
    },
    {
      "username": "sarahelizabethparker",
      "userUrl": "https://www.imdb.com/user/ur102958659",
      "reviewLink": "https://www.imdb.com/review/rw5746348",
      "warningSpoilers": false,
      "date": "17 May 2020",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "Forget best Kdrama...this may be the best DRAMA",
      "content": "Where do I even begin? This series was perfect from start to finish. I was hooked during the first scene. I watched it all in just a few days and I have never cried more in life. Every single character was compelling with their own unique personalities and characteristics.I'm a huge fan of kdramas, but I'm convinced any casual lover of TV would LOVE this show. It's not too cheesy like some Kdramas and it was VERY well produced with a beautiful score and cinematography.I have to give them props for the realism of the portrayal of North Korea. The North Korean characters felt like normal, everyday people and weren't vilified or ostracized just based on their nationality.I don't want to spoil too much of it, but I will say that at first I was bit upset about the ending but it was so well executed that it's grown on me and I'm satisfied with it.I DO want to talk about the elephant in the room-the main leads' acting. Oh my lord, they are PHENOMENAL actors. Hyun Bin and Son Ye-jin are some of the best actors I've ever seen-topping most western actors easily. Son Ye-jin's crying is so convincing and doesn't across as faked or forced. And you can really feel how much Jeong-hyeok loves Se-ri thanks to Hyun Bin's portrayal. Now that I've finished the series I'm gonna make sure to watch EVERYTHING else these actors are in.I give this series an 11 out of 10 stars. It's now in my top 5 favorite TV shows of all time.Don't let the run time of the episodes or the different language throw you off from watching this. It's worth it!!!!Meanwhile, I may end up watching this again..."
    },
    {
      "username": "Booboboo",
      "userUrl": "https://www.imdb.com/user/ur23420760",
      "reviewLink": "https://www.imdb.com/review/rw5595715",
      "warningSpoilers": false,
      "date": "31 March 2020",
      "rate": "8",
      "helpful": "18 out of 20 found this helpful.",
      "title": "You will fall in love with the two main characters - laughter and tears for hours to find here",
      "content": "This is a dramedy with absurd premisses. Very different from almost everything else we have seen, even though we watch our share of Korean movies and shows. The story is good and you'd be tempted to binge. But what makes this show shine are the great actors - we have laughed so much, cried so much, it is a rare gem.A bit of the acting is too much, as should be expected, and a few characters are quite one-dimensional. But it all comes together exceptionally well. Strong recommendation, especially good to escape the covid-19 crisis and all; immerse in this and fall in love with both main actors and their supporting cast."
    },
    {
      "username": "wheatley-20230",
      "userUrl": "https://www.imdb.com/user/ur87946145",
      "reviewLink": "https://www.imdb.com/review/rw6530206",
      "warningSpoilers": false,
      "date": "26 January 2021",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "The Power of Story Telling",
      "content": "I have been won over to Korean drama by Mr Sunshine and then by this very moving romantic comedy thriller. I would rank these two series as the best thing I have seen on television in years.Crash Landing on You builds up such an emotional head of steam, driven by the predicament in which the leads find themselves and great central performances. Son Ye-Jin and Hyun Bin are both perfect. The final episode is simply sublime.If only western dramas could rediscover the power of story telling and forget the mandatory inclusion of gratuitous sex and bad language."
    },
    {
      "username": "MovieQween-33622",
      "userUrl": "https://www.imdb.com/user/ur89370109",
      "reviewLink": "https://www.imdb.com/review/rw6481684",
      "warningSpoilers": false,
      "date": "15 January 2021",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "One of the best romance/comedy/dramas ever!!!",
      "content": "Yes this production really is THAT good! I can't even call it a series because it's more like an amazing group of consecutive films. My mom and I binged this in 3-4 days, missing lots of sleep because we could not stop watching. We HAD to keep going, it wasn't even a choice. I'll have to admit, this was my first Korean romance series! We needed a break from the tense political news & wanted to watch something we could escape to. After the first episode, I was not sure what to think as it was a bit slow. But after that first episode, things pick up and completely submerse you. It's everything all wrapped up into one: romance, drama, thriller, suspense, comedy. The acting is so amazing!!!! I'm in awe of this wonderful production. I laughed in the beginning & middle, while I cried and gasped in the last half. Watch all the way until the end, you'll love it! It's an intense journey of love, family, cultural difference, friendship and community. I'm praying and PRAYING for a season two!!"
    },
    {
      "username": "cutesilver",
      "userUrl": "https://www.imdb.com/user/ur113643045",
      "reviewLink": "https://www.imdb.com/review/rw5481619",
      "warningSpoilers": false,
      "date": "13 February 2020",
      "rate": "10",
      "helpful": "226 out of 238 found this helpful.",
      "title": "AMAZING!!!!",
      "content": "I made an IMBD account just to write a review for this show. This is my favorite K-drama!!! The story line and the actors and everything about this show is brilliant. I was hooked 5 minutes into episode1!! There's never a boring moment. Love the mix of comedy and action and romance. I also like that each episode is well over an hour long. Easily rated 10/10!!!"
    },
    {
      "username": "natassa-athens",
      "userUrl": "https://www.imdb.com/user/ur114284217",
      "reviewLink": "https://www.imdb.com/review/rw5522588",
      "warningSpoilers": false,
      "date": "2 March 2020",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "One of the greater Love Stories ever!",
      "content": "Breathless during the whole series! Probably one of the greatest Love Stories I've ever seen in my life! So powerful, so innocent, so highly emotional! Full of the differences between the two different states, which made it so engaging! I am in love with this series! The two actors were both so beautiful and great in acting, having high chemistry between them. Probably one of the best couples I've seen in TV series! I am also in love with Hyun Bin! :)"
    },
    {
      "username": "ayanatasha",
      "userUrl": "https://www.imdb.com/user/ur113589950",
      "reviewLink": "https://www.imdb.com/review/rw5478278",
      "warningSpoilers": false,
      "date": "12 February 2020",
      "rate": "10",
      "helpful": "146 out of 153 found this helpful.",
      "title": "Their chemistry is not a joke!",
      "content": "Another korean drama that give me the vibe that hard to gain from other dramas. The chemistry, the plot, the cast, the place, the way they act, sooooo gooooooddddd!!! I really love this dramaa. This drama is freaking good. It has the feeling that hard to move on... And also become lot of peoples' favourite. I just don't want this drama to end...will be really missing them, all of the cast."
    },
    {
      "username": "sayamasjad",
      "userUrl": "https://www.imdb.com/user/ur71871748",
      "reviewLink": "https://www.imdb.com/review/rw7299327",
      "warningSpoilers": false,
      "date": "2 September 2021",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Watching the show brings you the joy of being alive",
      "content": "If you're looking for a drama with a different storyline and a different atmosphere it would be a perfect choice. There is always a beautiful smile on my face each time I watch an episode. It's an entertaining combination of fluff, romance, drama, and political/police procedural. It shows the humanity in all echelons of society, from poor to rich, from communist to capitalists, from military to playboy. The chemistry is incredible, the emotions are real, and the casting is perfect. Watching the show brings you the joy of being alive."
    }
  ],
  "errorMessage": ""
}