{
  "imDbId": "tt10850932",
  "title": "Crash Landing on You",
  "fullTitle": "Crash Landing on You (TV Series 2019–2020)",
  "type": "TVSeries",
  "year": "2019",
  "language": "en",
  "titleInLanguage": "Crash Landing on You",
  "url": "https://en.wikipedia.org/wiki/Crash_Landing_on_You",
  "plotShort": {
    "plainText": "Crash Landing on You (Korean: 사랑의 불시착) is a 2019–2020 South Korean television series written by Park Ji-eun, directed by Lee Jeong-hyo and starring Hyun Bin, Son Ye-jin, Seo Ji-hye, and Kim Jung-hyun. It is about a successful South Korean businesswoman and chaebol heiress who, while paragliding near Seoul, South Korea, is swept up in a sudden storm, crash-lands in the North Korean portion of the Demilitarized Zone (DMZ), and meets an army captain and son of the Director of the GPB in the Korean People's Army who decides he will help her hide. Over time, they fall in love, despite the divide and dispute between their respective countries.\r\nThe series aired on tvN in South Korea and on Netflix worldwide from December 14, 2019, to February 16, 2020. It is the highest-rated tvN drama and the fourth highest-rated South Korean TV drama in cable television history.",
    "html": "<p>Crash Landing on You (Korean: 사랑의 불시착) is a 2019–2020 South Korean television series written by Park Ji-eun, directed by Lee Jeong-hyo and starring Hyun Bin, Son Ye-jin, Seo Ji-hye, and Kim Jung-hyun. It is about a successful South Korean businesswoman and chaebol heiress who, while paragliding near Seoul, South Korea, is swept up in a sudden storm, crash-lands in the North Korean portion of the Demilitarized Zone (DMZ), and meets an army captain and son of the Director of the GPB in the Korean People's Army who decides he will help her hide. Over time, they fall in love, despite the divide and dispute between their respective countries.</p><p>The series aired on tvN in South Korea and on Netflix worldwide from December 14, 2019, to February 16, 2020. It is the highest-rated tvN drama and the fourth highest-rated South Korean TV drama in cable television history.</p>"
  },
  "plotFull": {
    "plainText": "Crash Landing on You (Korean: 사랑의 불시착) is a 2019–2020 South Korean television series written by Park Ji-eun, directed by Lee Jeong-hyo and starring Hyun Bin, Son Ye-jin, Seo Ji-hye, and Kim Jung-hyun. It is about a successful South Korean businesswoman and chaebol heiress who, while paragliding near Seoul, South Korea, is swept up in a sudden storm, crash-lands in the North Korean portion of the Demilitarized Zone (DMZ), and meets an army captain and son of the Director of the GPB in the Korean People's Army who decides he will help her hide. Over time, they fall in love, despite the divide and dispute between their respective countries.\r\nThe series aired on tvN in South Korea and on Netflix worldwide from December 14, 2019, to February 16, 2020. It is the highest-rated tvN drama and the fourth highest-rated South Korean TV drama in cable television history.\r\nSynopsis\r\nYoon Se-ri (Son Ye-jin) is a South Korean successful entrepreneur and a chaebol heiress. One day, while paragliding in Seoul, a tornado blows her off course. As a result, she crash-lands into the North Korean portion of the DMZ. Ri Jeong-hyeok (Hyun Bin) is a member of the North Korean elite and a captain in the Korean People's Army. As he is patrolling, he meets Se-ri and saves her. Having decided to help her go back to the South, he hides her from other North Koreans, especially Cho Cheol-gang (Oh Man-seok) who is out to expose him. As they spend time together, they fall in love.\r\nPlot\r\nCrash Landing on You tells the story of two star-crossed lovers, Yoon Se-ri (Son Ye-jin), a South Korean chaebol heiress to Queen's Group, and Ri Jeong-hyeok (Hyun Bin), a member of the North Korean elite and a captain in Korean People's Army.\r\nOne day, while Yoon Se-ri is paragliding in Seoul, South Korea, a sudden tornado knocks her out and blows her off course. She awakens to find that her paraglider has crashed into a tree in a forest in the North Korean portion of the DMZ, an area forbidden for South Koreans. She then meets Ri Jeong-hyeok, who eventually gives her shelter and develops plans to secretly help her return to South Korea. Over time, they fall in love, despite the divide and dispute between their respective countries.\r\nBack in South Korea, Yoon Se-ri's family suppresses the news of her disappearance out of fear that it will depress the stock price of the chaebol. Just before Se-ri went missing, her retiring father informed his family that he intended to announce her as his successor based on her abilities as a businesswoman, as shown by her successfully building her own company, instead of her half-brothers, Se-jun and Se-hyung, who struggled managing the chaebol's subsidiaries. The brothers are supported by their equally-ambitious wives, Do Hye-ji (Hwang Woo-seul-hye) and Go Sang-ah (Yoon Ji-min), respectively. In Se-ri's absence, Se-hyung outmaneuvers his siblings through unscrupulous means to win the succession battle to lead the family firm, while Sang-ah attempts to take over Se-ri's company.\r\nSe-ri and Jeong-hyeok's story is intertwined with that of Seo Dan (Seo Ji-hye) and Gu Seung-jun (Kim Jung-hyun). Dan is the sophisticated daughter of a wealthy North Korean department store owner. She has been studying the cello in Russia for several years but returns to marry Jeong-hyeok, to whom she is engaged through an arranged marriage even though they have only met a few times. As she returns to Pyongyang, she crosses paths more than once with Gu Seung-jun, who had fled to North Korea (under the protection of corrupt North Korean officers) in order to escape from the pursuit of Se-hyung, under whose incompetent watch he had embezzled large amounts of money.\r\nThe first half of the story follows Jeong-hyeok's attempts to hide Se-ri and help her get back to South Korea. They are impeded by Cho Cheol-gang (Oh Man-seok), a corrupt and ruthless officer from the State Security Department, who had previously arranged for the murder of Jeong-hyeok's older brother, an officer who tried to expose him for his traitorous deeds against the North Korean regime. Jeong-hyeok's attachment to Se-ri distresses not only Dan, his fiancée, but also his father, who is a high-ranking political figure, as the discovery of Jeong-hyeok harboring a South Korean citizen could be used by rival officials to ruin their family's reputation.\r\nIn the second half of the story, Se-ri is able to return to South Korea and resume leadership of her company, surprising her family and others who had thought she was dead. While Cheol-gang is initially convicted and sentenced to life imprisonment for his crimes, he escapes custody through aide from his loyal soldiers and criminal network whereby he infiltrates South Korea to go after Se-ri. Despite opposition from his father who nevertheless reluctantly gives his support, Jeong-hyeok first arrives in South Korea discreetly before his soldiers are clandestinely sent to Seoul by Jeong-hyeok’s father to assist Jeong-hyeok in his aim to protect Se-ri from Cheol-gang's vengeance. Meanwhile, in North Korea, despite Seo Dan and Seung-jun's initial encounters being random and unpleasant, she shelters him when the corrupt officers betray him to Se-hyung's gangsters, and they eventually fall in love.\r\nCast\r\nMain\r\nHyun Bin as Ri Jeong-hyeokLee Chun-moo as young Jeong-hyeok Kim Seung-chan as teenage Jeong-hyeok\r\nLee Chun-moo as young Jeong-hyeok\r\nKim Seung-chan as teenage Jeong-hyeok\r\nSon Ye-jin as Yoon Se-riKim Tae-yeon as young Se-ri\r\nKim Tae-yeon as young Se-ri\r\nSeo Ji-hye as Seo DanPark Seo-yeon as young Dan\r\nPark Seo-yeon as young Dan\r\nKim Jung-hyun as Gu Seung-jun / Alberto Gu\r\nRecurring\r\nNorth Korean soldiers in Company Five\r\nYang Kyung-won as Pyo Chi-su, an acerbic Sergeant Major in Company Five, who enjoys drinking \"medicine\" on and off the job and antagonizing Se-ri because of his paranoia against South Koreans. Despite his grumpy attitude towards Se-ri, he eventually grows to care about her.\r\nYoo Su-bin as Kim Ju-meok, a jovial Corporal in Company Five, who uses his fascination with Korean dramas to explain South Korean culture to his team. He is frequently called out for watching K-dramas instead of working.\r\nTang Jun-sang as Geum Eun-dong, an innocent Lance-Corporal in Company Five, who is the sole provider of his family and the youngest member of the unit. He has over 9 years of military service left to complete and misses his mother dearly.\r\nLee Shin-young as Park Kwang-beom, a quiet Staff Sergeant in Company Five, oblivious of his model-worthy good looks.\r\nPeople around Se-ri\r\nNam Kyung-eup as Yoon Jeung-pyeong, Se-ri's father, South Korean Chaebol and Chairman of Queen's Group. After serving time for financial malfeasance, he looks to name one of his children heir to his chairmanship.\r\nBang Eun-jin as Han Jeong-yeon, Se-ri's stepmother. She struggles to reconcile her resentment towards Se-ri as a product of her husband's infidelity, with Se-ri's sincere love and affection towards her.\r\nChoi Dae-hoon as Yoon Se-jun, Se-ri's immature and hot-headed eldest half-brother, who sides with Se-ri against Sae-hyung.\r\nHwang Woo-seul-hye as Do Hye-ji, Se-jun's materialistic but supportive wife.\r\nPark Hyung-soo as Yoon Se-hyung, Se-ri's unflappable second older half-brother, whose greed and naiveté allowed Seung-jun to embezzle funds from Queen's Group.\r\nYoon Ji-min as Go Sang-ah, Se-hyung's intelligent and ruthlessly-ambitious wife who covets Se-ri's company.\r\nGo Kyu-pil as Hong Chang-sik, Se-ri's over-stressed team manager who, along with Su-chan, tries to find Se-ri's whereabouts after her disappearance.\r\nIm Chul-soo as Park Su-chan, Se-ri's insurance agent, who becomes obsessed with proving that Se-ri survived the paragliding accident.\r\nPeople around Jeong-hyeok\r\nJun Gook-hwan as Ri Chung-ryeol, Jeong-hyeok's father, Director of the General Political Bureau and vice-marshal of Korean People's Army.\r\nJung Ae-ri as Kim Yun-hui, Jeong-hyeok's mother, and a former actress. Like her husband, she still grieves Mu-hyeok's death.\r\nHa Seok-jin as Ri Mu-hyeok, Jeong Hyeok's deceased older brother and an Army Captain, who was killed in a staged accident for threatening to expose Cho Cheol-gang.\r\nPeople around Dan\r\nJang Hye-jin as Ko Myeong-eun, Dan's ambitious mother who is also a successful North Korean department store owner. She is eager to see her daughter get married to Ri Jeong-hyeok and enjoys a playful, occasionally violent relationship with her brother, Ko Myeong-seok. She has a tendency of inserting English words into her speech to appear more sophisticated.\r\nPark Myung-hoon as Ko Myeong-seok, Dan's cheerful maternal uncle who is also a powerful Major-General in the State Security Department.\r\nPeople in North Korean Village\r\nKim Sun-young as Na Wol-suk, the no-nonsense Chief of the People's unit (head of the village) who occasionally gets into arguments with Yoon Se-ri but eventually warms up to her. She has a tendency to drink and say embarrassing things.\r\nKim Jung-nan as Ma Young-ae, the Senior Colonel Kim's wife who strongly influences her husband. The other women in the village fawn over her, and she is easily susceptible to Yoon Se-ri's flattery. She is frustrated by her son's subpar performance in school despite hiring a university student tutor for him.\r\nJang So-yeon as Hyun Myeong-sun, Jung Man-bok's supportive, shy, kind wife. She is the first to show support and bring food for Ma Young-ae when the Senior Colonel is arrested.\r\nCha Chung-hwa as Yang Ok-geum, a hairdresser who wears bright makeup. She is closest with Na Wol-suk.\r\nOh Han-kyul as Jung Woo-pil, Man-bok and Myeong-sun's son\r\nGu Jun-woo as Kim Nam-sik, Senior Colonel Kim and Young-ae's son who gets bad grades\r\nLim Sung-mi as Geum-soon, a market vendor in the marketplace who secretly sells South Korean goods\r\nPeople in North Korean Forces\r\nOh Man-seok as Cho Cheol-gang, a Lieutenant Commander in the North Korean Armed Forces' Security Bureau, who is the principal villain of the story. An orphan, he is corrupt and heads a vast criminal operation that stretches across the Korean peninsula, including harboring fugitives such as Gu Seung-jun while having no qualms turning them over to the highest bidder.\r\nKim Young-min as Jung Man-bok, a North Korean wiretapper coerced by Cheol-gang to facilitate criminal activities, which has made him feel guilty about his work. He is known as \"The Rat\" among members of the village due to his job, resulting in his family being ostracized. Forced to facilitate Ri Mu-hyeok's death despite being the recipient of his kindness, Man-bok hopes to atone for his betrayal by assisting Jeong-hyeok.\r\nKim Young-pil as Kim Ryong-hae, a Senior Colonel who is Jeong-hyeok's superior and Young-ae's husband. He is known to be controlled by his wife. He dislikes Jeong-hyeok but, after learning of his real identity as the son of the Director of the General Political Bureau, he tries his best to please him.\r\nHong Woo-jin as Cheon Su-bok, a corrupt North Korean government official who helps people illegally enter and stay in North Korea.\r\nOthers\r\nYoon Sang-hoon as Manager Oh, an intermediate broker who connects Seung-jun to the North Korean \"keeping business\".\r\nYoo Jung-ho as Chief Kim, Chief of the National Intelligence Service and investigator. He understands the relationship between Ri Jeong-hyeok and Yoon Se-ri and helps to make their parting more bearable.\r\nChristian Lagahit as North Korean Villager\r\nSpecial appearances\r\nJung Kyung-ho as Cha Sang-woo, Se-ri's South Korean ex-boyfriend (Ep. 1, 5 & 7)\r\nPark Sung-woong as a North Korean taxi driver (Ep. 4)\r\nKim Ah-ra as a house villager\r\nYoon Seol-mi as a train salesperson\r\nNa Young-hee as a North Korean wedding dress boutique owner (Ep. 7)\r\nKim Soo-hyun as Won Ryu-hwan / Bang Dong-gu, a North Korean spy from Division 11, disguised as a village idiot (Ep. 10)\r\nKim Sook as a North Korean fortune teller (Ep. 11 & 16)\r\nChoi Ji-woo as herself (Ep. 13), an actress whom Kim Ju-meok idolized from his secret viewing of Korean dramas.\r\nEpisodes\r\nProduction\r\nThe series reunited Son Ye-jin and Hyun Bin after first collaborated in the 2018 film The Negotiation.\r\nDevelopment\r\nThe premise of Crash Landing on You was inspired by a real event involving South Korean actress Jung Yang. In September 2008, Yang and three others had to be rescued after bad fog had caused their leisure boat to drift \"into the maritime boundary between North and South Korea.\" Park Ji-eun, the drama's screenwriter, was introduced to North Korean defector turned film adviser and writer Kwak Moon-wan, who became part of the drama's writing team. Kwak, who studied film directing in Pyongyang and had also been a member of an elite security force protecting the Kims, helped in crafting the drama's plot and in conceptualizing the setting and scenes in the drama portraying North Korean life.\r\nNetflix's investment also helped the show to garner the budget of US$20 million.\r\nFilming\r\nThe production process proved to be \"painstakingly meticulous\", owing both to South Korea's relationship with North Korea (where most of the story's plot ensues), as well as to avoid any unintentional violations of the 1948 National Security Act which forbids public praise or propaganda of North Korea and the Kim Family. The script avoided use of the honorific Chairman to refer to North Korea's leaders, and visible propaganda signs avoid mentioning anything about Kim Il Sung, Kim Jong Il, or Kim Jong Un (while their mandatory portraits were usually either blurred or obscured by the camera angles). In addition, the North Korean lapel pins used by North Korean characters were one third smaller than their actual size. Props manager Joo Dong-man said the crew did not have a \"guidebook on multiple hurdles he had to hop over – skillfully and delicately – to accurately depict the country while dodging criticism\" and, thus, had to be careful \"not to misrepresent the state\". Their research was also guided by North Koreans living in South Korea.\r\nThe first script reading took place on July 31, 2019, in Sangam-dong, Seoul, and filming overseas started at the end of August 2019. North Korean scenes were shot in South Korea and Mongolia. Scenes that took place in Switzerland were shot on location. The village of Iseltwald, one such location, experienced a tourism boom as a result.\r\nOriginal soundtrack\r\nThe following is the official track list of Crash Landing on You (Original Television Soundtrack) album. The tracks with no indicated lyricists and composers are the drama's musical score; the artists indicated for these tracks are the tracks' composers themselves. Singles included on the album were released from December 15, 2019, to February 16, 2020.\r\nChart performance\r\nReception\r\nCommercial performance\r\nWith 1.75 billion online views, Crash Landing on You outperformed the prior leader, Mr. Sunshine, for most viewed drama clips by 200 million views as of February 17, 2020. The success of the drama helped to boost brand items due to product placement. The lead characters portrayed by Hyun Bin and Son Ye-jin ate Gold Olive Chicken, a product which had a 100% sales improvement due to the show. There was also an increase in sales of the Swarovski earrings worn by Son Ye-jin.\r\nInternational response\r\nCrash Landing on You was a huge success in China. The hashtag for the drama's final episode has received over 460 million views on Weibo. The drama's main streaming website, which holds the copyright in China, crashed on the night it aired the final episode due to the sheer number of users.\r\nThe show was also extremely popular in Japan during the period of the COVID-19 pandemic via Netflix. While the Korean Wave is a historically prominent component of media within Japan, Crash Landing on You has been uniquely influential there, in part due to its portrayal of daily life in North Korea. The series was featured on Japanese-Netflix's top 10 for an astonishing 69 consecutive weeks.\r\nIn the Philippines, many viewers noted similarities between the plot line and the political narrative of the country during the COVID-19 pandemic.\r\nIn the United States, Variety named Crash Landing on You one of \"The Best International Shows on Netflix\", and one of the \"Best International TV Series of 2020.\" Time also ranked it as one of the best Korean dramas on Netflix. Elle ranked it number 1 (out of 10) on the October 2020 10 Best K-Dramas To Binge-Watch On Netflix list, and Vogue listed it as one of \"Netflix: 4 Korean dramas to discover this summer.\" Boy Genius Report ranked it #2 of the five \"K-dramas you absolutely must watch on Netflix.\" BuzzFeed listed it as number 3 of the top 27 best K-dramas on Netflix. Forbes noted that it ranked number 1 out of the top 10 on a Netflix's Instagram list of its most romantic series, and Screen Rant ranked it as having the #2 (out of the top 10) \"tear-jerking scenes in K-dramas.\" In addition, Jo Walker of The Guardian's \"Stream Team\" called it \"addictively off-the-wall, heartbreaking and hilarious.\" Adella Suliman and Stella Kim of NBC News also suggested that the drama \"features all the ingredients a viewer could wish for\" and has \"drawn a global audience of millions, many no doubt searching for entertainment as they while away their time in coronavirus-related lockdowns.\" Wadzanai Mhute of The Daily Beast argues that Crash Landing on You, \"was a cultural phenomenon in its native South Korea, and it's gone criminally overlooked in the States, where it's available to stream on Netflix.\" Megan O'Keefe of Decider states that, \"Crash Landing on You is a show unlike anything you've ever seen. It has insane action sequences, glorious montages of wealth porn, unblinking looks at the impoverished lives of everyday North Koreans, and one of the most heart-wrenching love stories in ages. With 16 90-minute-long episodes, it's truly a feast to be savored and the perfect antidote to the winter quarantine blues.\"\r\nAl Jazeera stated that it is a hallyu success.\r\nRepresentation of and reception in South and North Korea\r\nGeneral\r\nAlthough the series is a work of fiction, it has received some positive reviews from North Korean defectors for its depiction of everyday life in North Korea. At the same time, some details, such as the availability of food, relatively warm behavior of the army and the ease with which the characters cross the border have been criticized. Kim Ara, one of the extras who portrayed a North Korean villager, is a writer and actress from North Korea who states that she felt \"like was actually back in a North Korean village.\" Kwak Moon-wan, a North Korean defector, who had served with the Supreme Guard Command (which protects the ruling Kim family) worked as an adviser for the series, providing the writers with details about life in North Korea as well as North Korean governmental agencies that added credibility to the show. He acknowledged some of the criticism, admitting that he has taken liberties with the depiction of North Korea (such as not mentioning food shortages), but rejected the claim that he was glamorizing the regime or drawing a false equivalence, saying that the show also depicted some of the darker aspect of life under the regime, such as the issue of kotjebi (child homelessness) and the frequent power cuts. Some North Korean refugees, such as Chun Hyo-jin, who defected from the border village of Hyesan at the age of nineteen, tend to agree: \"Even if what they say, that it glamorizes North Korea, is true, would they choose to live there? I don't think so\". Even though the drama leaves political matters aside, which are essential to the North Korea issue as she sees it, she says it still is of great significance: \"Its depiction of North Korea is a bit far from reality, but it has made the people interested in North Korea\". The drama's producer Lee Jung-hyo said during a press conference in Seoul in December: \"I know some people are uncomfortable about our subject, North Korea, but we don't portray a wholly authentic North Korea in our drama. Most settings are closer to a fantasy, although some aspects do reflect real North Korean life\".\r\nKang Na-ra, a North Korean defector who advised the show's production team, stated that about 60% of North Korea's depiction in the show is accurate: \"The richer families in North Korea like to show off their wealth by adding lace curtains to their windows. So that was pretty well portrayed\". She also appreciated the detail about kimchi caves: \"Since rural North Korea doesn't get electricity, they don't have refrigerators. They have kimchi caves where they store kimchi, and that was also recreated well\". House checks are also a regular affair. She revealed that she once had to hide inside a furnace at the house of the broker who helped her to escape to avoid detection. In the drama, the heiress had to hide in the kimchi storage area when security forces came knocking one night. As depicted in the drama, North Koreans are allowed to choose only from a fixed list of hair styles - 18 for women and 28 for men. \"There's a punishment for you if you don't comply\" Kang said in an interview with YouTube channel DKDKTV. On the other hand, as she explained in a YouTube video, the characters were able to slip across the border much more easily than in real life: \"I had to pay a broker 10 million won (US$8,400) to swim across the Yalu river while being shot at from behind by soldiers\". Cartoonist Choi Seong-guk, who defected to the South in 2011, also said the drama set is 60% accurate. The portrayal of jangmadang, or local markets where all kinds of goods, including imports from South Korea, are sold is especially real, he told The Sunday Times. However, he felt that the drama \"glamorized the soldiers too much, almost to an uncomfortable extent\". He said North Korean men enter the military when they are 17 and serve for 10 to 13 years. \"During this time, they are...ruthless and harsh, robbing homes and raping women at night\". Still, he hopes the drama will make its way to North Korea and go viral: \"I hope the North Koreans who see this drama will realize how positively the South Koreans think of them and learn to change\".\r\nThere were also critical responses to the themes of the drama in both regions. In January 2020, The Christian Liberal Party (CLP) filed a complaint in South Korea against tvN at the Seoul Metropolitan Police Agency, accusing the network of glamorizing North Korea through this series, in violation of the National Security Law. Then, in March 2020, a few North Korean media outlets criticized unnamed South Korean programs and films that explored relations between North and South Korea. While Crash Landing on You was not directly mentioned by the media outlets, it was perceived to be among the referenced works. Another is the 2019 film, Ashfall, although that film was also not directly cited in the articles.\r\nScholarship\r\nStephen Epstein (Victoria University of Wellington) and Christopher Green (Leiden University) suggest that while Crash Landing on You is formulaic, it also \"is a crucial text for evaluating ongoing change in South Korean popular representations of its neighbour. Indeed, given the concerted use of North Korean backdrops in Crash Landing on You and the size and global extent of its audiences, the show is likely the most noteworthy South Korean popular culture representation of North Korea yet produced.\" Yun Suk-jin, a professor at Chungnam National University concurs, noting that the series \"changed the stereotypes on North Korea and candidly showed that it too is a place where people live.\" Sarah A. Son, Lecturer in Korean Studies at the University of Sheffield also agrees, noting that Crash Landing on You responds to the \"socio-cultural divide\" between the North and the South, which academic scholarship cites as one of the biggest obstacles to future unification. Son argues that \"through the re-framing of stereotypes, albeit with some creative licence, Crash Landing on You arguably humanises the North for its audience in ways that inter-Korean dialogue has not in recent years. Despite its soft-focus romanticisation of the political situation, Crash Landing on You brings the pain of the division to a personal level for a generation of Koreans who, unlike their grandparents, have no memory of what it was like to be a single nation.\"\r\nJoanna Elfving-Hwang, Associate Professor of Korean Studies at the University of Western Australia notes that \"North Korea tends to appear in our imagination as the 'axis of evil', we think of nuclear weapons and human rights abuses...this drama has dared to think about North Korean people differently and represented them as quite human and quite Korean.\" Steve Hung Lok-wai, a Korean Affairs expert from the Chinese University of Hong Kong states that the drama sidestepped larger political issues through a narrative that did not end with the male lead's defection: \"Lots of people questioned whether the male lead, the North Korean soldier, would end up defecting to the South for love, but they were able to sidestep that scenario and gave it a plausible ending where the two would meet in Switzerland\". Thus, he argues, it's \"quite smart because they avoided all the real taboos but made it believable enough where it would make people think about these political problems.\" John Delury, a professor at Yonsei University, praised the series for its decision to draw parallels between powerful families in both the South and the North, and to humanize North Koreans beyond generic stereotypes.\r\nRatings\r\nThe series was a huge rating success in South-Korea. This series aired on tvN, a cable channel/pay TV which normally has a relatively smaller audience compared to free-to-air TV/public broadcasters (KBS, SBS, MBC and EBS). Crash Landing on You is the fourth highest-rated South Korean TV drama in cable television history. Early in its run, Crash Landing on You was the fourth highest rated Korean cable drama. The final episode's ratings made it the second highest rated Korean drama in cable television history at that time, surpassing fellow tvN dramas Reply 1988 and Guardian: The Lonely and Great God, until It finally became the fourth highest rated drama, surpassed by both JTBC drama, The World of the Married and Reborn Rich .\r\nAccolades\r\nIn May 2020 the show's scriptwriter, Park Ji-eun, was named \"Person of the Year\" by South Korea's Unification Ministry, for contributing to \"unification education.\"\r\nMusical adaptation\r\nOn March 29, 2021, it was announced that Crash Landing on You would be adapted into a musical and the production companies Pop Music and T2N Media had completed a global copyright contract with Studio Dragon. The musical was performed at the Shinhan Card Artium, COEX, Gangnam-gu, Seoul from September 16 to November 13, 2022.",
    "html": "<p>Crash Landing on You (Korean: 사랑의 불시착) is a 2019–2020 South Korean television series written by Park Ji-eun, directed by Lee Jeong-hyo and starring Hyun Bin, Son Ye-jin, Seo Ji-hye, and Kim Jung-hyun. It is about a successful South Korean businesswoman and chaebol heiress who, while paragliding near Seoul, South Korea, is swept up in a sudden storm, crash-lands in the North Korean portion of the Demilitarized Zone (DMZ), and meets an army captain and son of the Director of the GPB in the Korean People's Army who decides he will help her hide. Over time, they fall in love, despite the divide and dispute between their respective countries.</p><p>The series aired on tvN in South Korea and on Netflix worldwide from December 14, 2019, to February 16, 2020. It is the highest-rated tvN drama and the fourth highest-rated South Korean TV drama in cable television history.</p><br/><h3>Synopsis</h3><p>Yoon Se-ri (Son Ye-jin) is a South Korean successful entrepreneur and a chaebol heiress. One day, while paragliding in Seoul, a tornado blows her off course. As a result, she crash-lands into the North Korean portion of the DMZ. Ri Jeong-hyeok (Hyun Bin) is a member of the North Korean elite and a captain in the Korean People's Army. As he is patrolling, he meets Se-ri and saves her. Having decided to help her go back to the South, he hides her from other North Koreans, especially Cho Cheol-gang (Oh Man-seok) who is out to expose him. As they spend time together, they fall in love.</p><br/><h3>Plot</h3><p>Crash Landing on You tells the story of two star-crossed lovers, Yoon Se-ri (Son Ye-jin), a South Korean chaebol heiress to Queen's Group, and Ri Jeong-hyeok (Hyun Bin), a member of the North Korean elite and a captain in Korean People's Army.</p><p>One day, while Yoon Se-ri is paragliding in Seoul, South Korea, a sudden tornado knocks her out and blows her off course. She awakens to find that her paraglider has crashed into a tree in a forest in the North Korean portion of the DMZ, an area forbidden for South Koreans. She then meets Ri Jeong-hyeok, who eventually gives her shelter and develops plans to secretly help her return to South Korea. Over time, they fall in love, despite the divide and dispute between their respective countries.</p><p>Back in South Korea, Yoon Se-ri's family suppresses the news of her disappearance out of fear that it will depress the stock price of the chaebol. Just before Se-ri went missing, her retiring father informed his family that he intended to announce her as his successor based on her abilities as a businesswoman, as shown by her successfully building her own company, instead of her half-brothers, Se-jun and Se-hyung, who struggled managing the chaebol's subsidiaries. The brothers are supported by their equally-ambitious wives, Do Hye-ji (Hwang Woo-seul-hye) and Go Sang-ah (Yoon Ji-min), respectively. In Se-ri's absence, Se-hyung outmaneuvers his siblings through unscrupulous means to win the succession battle to lead the family firm, while Sang-ah attempts to take over Se-ri's company.</p><p>Se-ri and Jeong-hyeok's story is intertwined with that of Seo Dan (Seo Ji-hye) and Gu Seung-jun (Kim Jung-hyun). Dan is the sophisticated daughter of a wealthy North Korean department store owner. She has been studying the cello in Russia for several years but returns to marry Jeong-hyeok, to whom she is engaged through an arranged marriage even though they have only met a few times. As she returns to Pyongyang, she crosses paths more than once with Gu Seung-jun, who had fled to North Korea (under the protection of corrupt North Korean officers) in order to escape from the pursuit of Se-hyung, under whose incompetent watch he had embezzled large amounts of money.</p><p>The first half of the story follows Jeong-hyeok's attempts to hide Se-ri and help her get back to South Korea. They are impeded by Cho Cheol-gang (Oh Man-seok), a corrupt and ruthless officer from the State Security Department, who had previously arranged for the murder of Jeong-hyeok's older brother, an officer who tried to expose him for his traitorous deeds against the North Korean regime. Jeong-hyeok's attachment to Se-ri distresses not only Dan, his fiancée, but also his father, who is a high-ranking political figure, as the discovery of Jeong-hyeok harboring a South Korean citizen could be used by rival officials to ruin their family's reputation.</p><p>In the second half of the story, Se-ri is able to return to South Korea and resume leadership of her company, surprising her family and others who had thought she was dead. While Cheol-gang is initially convicted and sentenced to life imprisonment for his crimes, he escapes custody through aide from his loyal soldiers and criminal network whereby he infiltrates South Korea to go after Se-ri. Despite opposition from his father who nevertheless reluctantly gives his support, Jeong-hyeok first arrives in South Korea discreetly before his soldiers are clandestinely sent to Seoul by Jeong-hyeok’s father to assist Jeong-hyeok in his aim to protect Se-ri from Cheol-gang's vengeance. Meanwhile, in North Korea, despite Seo Dan and Seung-jun's initial encounters being random and unpleasant, she shelters him when the corrupt officers betray him to Se-hyung's gangsters, and they eventually fall in love.</p><br/><h3>Cast</h3><h4>Main</h4><ul><li>Hyun Bin as Ri Jeong-hyeokLee Chun-moo as young Jeong-hyeok Kim Seung-chan as teenage Jeong-hyeok</li><li>Lee Chun-moo as young Jeong-hyeok</li><li>Kim Seung-chan as teenage Jeong-hyeok</li></ul><ul><li>Son Ye-jin as Yoon Se-riKim Tae-yeon as young Se-ri</li><li>Kim Tae-yeon as young Se-ri</li></ul><ul><li>Seo Ji-hye as Seo DanPark Seo-yeon as young Dan</li><li>Park Seo-yeon as young Dan</li></ul><ul><li>Kim Jung-hyun as Gu Seung-jun / Alberto Gu</li></ul><h4>Recurring</h4><h4>North Korean soldiers in Company Five</h4><ul><li>Yang Kyung-won as Pyo Chi-su, an acerbic Sergeant Major in Company Five, who enjoys drinking \"medicine\" on and off the job and antagonizing Se-ri because of his paranoia against South Koreans. Despite his grumpy attitude towards Se-ri, he eventually grows to care about her.</li><li>Yoo Su-bin as Kim Ju-meok, a jovial Corporal in Company Five, who uses his fascination with Korean dramas to explain South Korean culture to his team. He is frequently called out for watching K-dramas instead of working.</li><li>Tang Jun-sang as Geum Eun-dong, an innocent Lance-Corporal in Company Five, who is the sole provider of his family and the youngest member of the unit. He has over 9 years of military service left to complete and misses his mother dearly.</li><li>Lee Shin-young as Park Kwang-beom, a quiet Staff Sergeant in Company Five, oblivious of his model-worthy good looks.</li></ul><h4>People around Se-ri</h4><ul><li>Nam Kyung-eup as Yoon Jeung-pyeong, Se-ri's father, South Korean Chaebol and Chairman of Queen's Group. After serving time for financial malfeasance, he looks to name one of his children heir to his chairmanship.</li><li>Bang Eun-jin as Han Jeong-yeon, Se-ri's stepmother. She struggles to reconcile her resentment towards Se-ri as a product of her husband's infidelity, with Se-ri's sincere love and affection towards her.</li><li>Choi Dae-hoon as Yoon Se-jun, Se-ri's immature and hot-headed eldest half-brother, who sides with Se-ri against Sae-hyung.</li><li>Hwang Woo-seul-hye as Do Hye-ji, Se-jun's materialistic but supportive wife.</li><li>Park Hyung-soo as Yoon Se-hyung, Se-ri's unflappable second older half-brother, whose greed and naiveté allowed Seung-jun to embezzle funds from Queen's Group.</li><li>Yoon Ji-min as Go Sang-ah, Se-hyung's intelligent and ruthlessly-ambitious wife who covets Se-ri's company.</li><li>Go Kyu-pil as Hong Chang-sik, Se-ri's over-stressed team manager who, along with Su-chan, tries to find Se-ri's whereabouts after her disappearance.</li><li>Im Chul-soo as Park Su-chan, Se-ri's insurance agent, who becomes obsessed with proving that Se-ri survived the paragliding accident.</li></ul><h4>People around Jeong-hyeok</h4><ul><li>Jun Gook-hwan as Ri Chung-ryeol, Jeong-hyeok's father, Director of the General Political Bureau and vice-marshal of Korean People's Army.</li><li>Jung Ae-ri as Kim Yun-hui, Jeong-hyeok's mother, and a former actress. Like her husband, she still grieves Mu-hyeok's death.</li><li>Ha Seok-jin as Ri Mu-hyeok, Jeong Hyeok's deceased older brother and an Army Captain, who was killed in a staged accident for threatening to expose Cho Cheol-gang.</li></ul><h4>People around Dan</h4><ul><li>Jang Hye-jin as Ko Myeong-eun, Dan's ambitious mother who is also a successful North Korean department store owner. She is eager to see her daughter get married to Ri Jeong-hyeok and enjoys a playful, occasionally violent relationship with her brother, Ko Myeong-seok. She has a tendency of inserting English words into her speech to appear more sophisticated.</li><li>Park Myung-hoon as Ko Myeong-seok, Dan's cheerful maternal uncle who is also a powerful Major-General in the State Security Department.</li></ul><h4>People in North Korean Village</h4><ul><li>Kim Sun-young as Na Wol-suk, the no-nonsense Chief of the People's unit (head of the village) who occasionally gets into arguments with Yoon Se-ri but eventually warms up to her. She has a tendency to drink and say embarrassing things.</li><li>Kim Jung-nan as Ma Young-ae, the Senior Colonel Kim's wife who strongly influences her husband. The other women in the village fawn over her, and she is easily susceptible to Yoon Se-ri's flattery. She is frustrated by her son's subpar performance in school despite hiring a university student tutor for him.</li><li>Jang So-yeon as Hyun Myeong-sun, Jung Man-bok's supportive, shy, kind wife. She is the first to show support and bring food for Ma Young-ae when the Senior Colonel is arrested.</li><li>Cha Chung-hwa as Yang Ok-geum, a hairdresser who wears bright makeup. She is closest with Na Wol-suk.</li><li>Oh Han-kyul as Jung Woo-pil, Man-bok and Myeong-sun's son</li><li>Gu Jun-woo as Kim Nam-sik, Senior Colonel Kim and Young-ae's son who gets bad grades</li><li>Lim Sung-mi as Geum-soon, a market vendor in the marketplace who secretly sells South Korean goods</li></ul><h4>People in North Korean Forces</h4><ul><li>Oh Man-seok as Cho Cheol-gang, a Lieutenant Commander in the North Korean Armed Forces' Security Bureau, who is the principal villain of the story. An orphan, he is corrupt and heads a vast criminal operation that stretches across the Korean peninsula, including harboring fugitives such as Gu Seung-jun while having no qualms turning them over to the highest bidder.</li><li>Kim Young-min as Jung Man-bok, a North Korean wiretapper coerced by Cheol-gang to facilitate criminal activities, which has made him feel guilty about his work. He is known as \"The Rat\" among members of the village due to his job, resulting in his family being ostracized. Forced to facilitate Ri Mu-hyeok's death despite being the recipient of his kindness, Man-bok hopes to atone for his betrayal by assisting Jeong-hyeok.</li><li>Kim Young-pil as Kim Ryong-hae, a Senior Colonel who is Jeong-hyeok's superior and Young-ae's husband. He is known to be controlled by his wife. He dislikes Jeong-hyeok but, after learning of his real identity as the son of the Director of the General Political Bureau, he tries his best to please him.</li><li>Hong Woo-jin as Cheon Su-bok, a corrupt North Korean government official who helps people illegally enter and stay in North Korea.</li></ul><h4>Others</h4><ul><li>Yoon Sang-hoon as Manager Oh, an intermediate broker who connects Seung-jun to the North Korean \"keeping business\".</li><li>Yoo Jung-ho as Chief Kim, Chief of the National Intelligence Service and investigator. He understands the relationship between Ri Jeong-hyeok and Yoon Se-ri and helps to make their parting more bearable.</li><li>Christian Lagahit as North Korean Villager</li></ul><h4>Special appearances</h4><ul><li>Jung Kyung-ho as Cha Sang-woo, Se-ri's South Korean ex-boyfriend (Ep. 1, 5 & 7)</li><li>Park Sung-woong as a North Korean taxi driver (Ep. 4)</li><li>Kim Ah-ra as a house villager</li><li>Yoon Seol-mi as a train salesperson</li><li>Na Young-hee as a North Korean wedding dress boutique owner (Ep. 7)</li><li>Kim Soo-hyun as Won Ryu-hwan / Bang Dong-gu, a North Korean spy from Division 11, disguised as a village idiot (Ep. 10)</li><li>Kim Sook as a North Korean fortune teller (Ep. 11 & 16)</li><li>Choi Ji-woo as herself (Ep. 13), an actress whom Kim Ju-meok idolized from his secret viewing of Korean dramas.</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section's plot summary <b>may be <span>too long or excessively detailed</span>.</b><span class=\"hide-when-compact\"> Please <span class=\"external text\">help improve it</span> by removing unnecessary details and making it more concise.</span>  <span class=\"date-container\"><i>(<span class=\"date\">December 2022</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#8B008B;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#8B008B\">Title</th><th scope=\"col\" style=\"background:#8B008B\">Original release date</th><th scope=\"col\" style=\"background:#8B008B;width:6%\">South Korea viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 1\"</td><td style=\"text-align:center\">December 14, 2019</td><td style=\"text-align:center\">1.508</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #8B008B\"><p>In South Korea, Yoon Se-ri (<span>Son Ye-jin</span>) is the daughter of a wealthy <span>chaebol</span> and manages her own successful fashion line. Her father (Nam Kyung-eup), who was in prison for financial crimes, is released on probation and arranges to have dinner with his family to announce who will succeed his position as chairman of the family company. While it is expected that either the eldest son, Se-jun (Choi Dae-hoon), or the second eldest son, Se-hyung (Park Hyung-soo), would take over the company, the chairman instead chooses Se-ri to be the new chairwoman. Se-ri accepts the offer to the dismay of her mother and her brothers but asks to delay an official announcement so that she can perform final tests for a new product. The next day, while Se-ri is paragliding to test the product, a tornado suddenly forms and she is blown away unconscious.</p><p>Meanwhile, in North Korea, Ri Jeong-hyeok (<span>Hyun Bin</span>) is a captain of a <span>DMZ</span> patrol team in the <span class=\"mw-redirect\">Korean People’s Army</span>. He and his men successfully negotiate with <span class=\"mw-redirect\">ROK Armed Forces</span> in a tense stand-off the transfer of three captured North Korean artifact smugglers. Upon return, a <span class=\"mw-redirect\">State Security Department</span> officer, Cho Cheol-gang (<span>Oh Man-seok</span>), tells Jeong-hyeok to let the smugglers go, but Jeong-hyeok refuses to the chagrin of Cheol-gang. Cheol-gang threatens Jeong-hyeok that he will not be lenient if Jeong-hyeok is ever caught with any wrongdoing. Later, Cheol-gang speaks with the smugglers and learns where they hid their artifacts. He then has them killed in an apparent car accident, as well as a woman who witnesses the murder.</p><p>The following morning, Se-ri wakes up to find herself hanging from a tree. Thinking that she might be in a national park, she cries for help to be discovered by Jeong-hyeok, who points a gun at her. Jeong-hyeok tells her to get down from the tree, which she does but only to awkwardly fall into his arms. Jeong-hyeok informs Se-ri to her bewilderment that she is actually in North Korea. Afraid of being captured for questioning, Se-ri runs away when Jeong-hyeok accidentally steps on a mine. A member of the patrol team, Park Kwang-beom (<span>Lee Shin-young</span>), helps disarm the mine, and the patrol team chases after Se-ri. Se-ri manages to run through a minefield only suffering a minor knee scrape to a North Korean village before Jeong-hyeok finally catches up to her.</p><p>In South Korea, the family keeps Se-ri's disappearance a secret to avoid a drop in the company's stock price. Both Se-jun and Se-hyung have renewed hope to succeed as chairman. Se-hyung's wife, Do Hye-ji (<span>Hwang Woo-seul-hye</span>), tells him he needs to find Gu Seung-jun (<span>Kim Jung-hyun</span>), who swindled them of their money.</p><p>In <span>Shenzhen</span>, Seung-jun is on the run and discusses with a broker where the safest place to hide would be.</p>In a pre-credits scene, it is shown that Jeong-hyeok was listening to Se-ri pleading for help into her walkie-talkie while she was hanging from the tree to his amusement before confronting her.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 2\"</td><td style=\"text-align:center\">December 15, 2019</td><td style=\"text-align:center\">1.773</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #8B008B\">After discussing matters with his DMZ Patrol officers and given the security loopholes and lapses they have committed, all  decide into helping hide Se-ri at Captain Ri's home. Se-ri gets a taste and glimpse of the way of life of Captain Ri and his men. Captain Ri dutifully carries on with his usual work obligations.  Scenes show village women doing everyday chores and the village children going to school. Captain Ri is sensitive to Se-ri's needs and buys personal provisions for Se-ri that she misses from South Korea, even though he must turn to the black market.  On the other hand, Seung-Jun, evading arrest in South Korea, buys refuge in a secluded villa in North Korea through an underground connection.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 3\"</td><td style=\"text-align:center\">December 21, 2019</td><td style=\"text-align:center\">1.894</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #8B008B\"><p>Seri was discovered hiding at Captain Ri's home during an unexpected home inspection. Captain Ri rushed back home from Pyongyang using a VIP car. While Seri was at gun point, Captain Ri arrived in time and presented a bold background story for Seri as a recently-returned agent from Division 11.  A top secret division of North Korean Armed Forces that trains and deploys elite spies to South Korea. Captain Ri, introduced Seri as his fiancée, in an attempt to evade detention. Hospitality was shown to Seri by the village women thereafter. However, his rival, Cho Cheol-gang, was still suspicious and ordered further surveillance.  Parallel scene 1: Seo-dan, Captain Ri's fiancée, returned to North Korea after finishing her studies in Russia. Parallel scene 2:  Captain Ri initiated an investigation about a military car blast incident.</p>Last Scene Episode 3:   Captain Ri accompanied Seri in an attempted boat escape. But got intercepted by maritime patrollers.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 4\"</td><td style=\"text-align:center\">December 22, 2019</td><td style=\"text-align:center\">2.225</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #8B008B\"><p>Captain Ri and Seri boarded a boat as her escape route towards the border but was intercepted by the maritime patrollers. Cunningly evaded the authorities by acting out a hilarious kissing scene copied from a South Korean drama.  However, they were escorted back. Seri was frustrated about the failed escape, confronted Captain Ri about the intimate gestures that happened. Meanwhile,  Cheol-gang confirming that Seri was a village outsider and with doubtful background, planned to capture her off-guard. Captain Ri, alerted by one of his men, found out about this and hurried home. He found a farewell note from Seri, that she had gone to a mountain to paraglide back to South Korea which is a seemingly an impossible plan. Under the pressure from the pursuing men of Cheol-gang, Captain Ri and Seri narrowly escaped  by paragliding down the mountain to safety.   Parallel scenes 1:  The \"rat soldier\" (tasked to eavesdrop) received instructions under the command of Cheol-gang.Parallel scene 2:  Flashback of how the \"rat soldier\" was helped and shown kindness by Captain Ri.Parallel scene 3:  Village women warmly interacted and exchanged ideas on fashion with Seri and was fetched by Captain Ri in a heart warming bike-ride-home scene.</p>Parallel scene 4:  Happy bonding time with Captain Ri and his men with Seri. He prepared drip coffee for her and was thanked by a heart sign. Captain Ri slowly falls for Seri. Last Scene  Episode 4:  Seri got lost in the market. Captain Ri searched for her, holding a scented candle above his head in the midst of the crowd to get her attention.  Another heart warming scene. When relieved to see him from afar, Seri walks slowly towards Captain Ri.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 5\"</td><td style=\"text-align:center\">December 28, 2019</td><td style=\"text-align:center\">2.210</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #8B008B\"><p>The taxi that Soe-Dan hired became stuck in the middle of nowhere and by chance was given a ride by Seung-Jun to Captain Ri's house when the former decided to visit Captain Ri.   Seri and Captain Ri had a leisurely walk towards home when Soe-Dan arrived at the scene and was introduced as his fiancee to Seri. The women from the village got confused as to who the real fiancee is and had a nights drink with Seri to appeased her in the presumption that she was double-timed.  While Soe-Dan was brought home to Pyongyang that night by Captain Ri.  The following day, the jealous Seri comically distanced herself from Captain Ri. Meanwhile, Cheol-gang with the eavesdrop-report from the \"rat soldier\", apprehended and interrogated the men of Captain Ri about Seri. But, they never confessed despite the beatings.  The men gathered at Captain Ri's house, black and blue from the beatings. Gratefully, Seri showed heart sign gesture to the men who helped protect her which made Captain Ri annoyed and jealous for some reasons. Another plan was made and in preparation for that Seri sold her signature watch to buy necessities.  As part of a delegation for Europe, Seri needed a passport that required her picture. The plan prompted Captain Ri and Seri to go to Pyongyang thru a train-ride.Parallel scenes 1: Seri accidentally saw a nice watch at the pawnshop that apparently belongs to the murdered brother of Captain Ri. Parallel scene 2: Seri and Captain Ri had a heart warming \"bonfire and camp-out scene\" when the train made a stop-over on the way to Pyongyang.</p>Parallel scenes 3: Seung-Jun chances upon Seri at the hotel lobby.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 6\"</td><td style=\"text-align:center\">December 29, 2019</td><td style=\"text-align:center\">2.414</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #8B008B\"><p>Unbeknown to Yoon Seri, one of her brothers (2nd from the eldest) cohorted with Seung-Jun to prevent her from coming back to South Korea. Instead of helping her out, after knowing that Seri was alive in North Korea. Meanwhile, Seung-jun meet Seri again with a devious plan in mind. Captain Ri, who had grown fonder of Seri, showed mixed emotions in seeing Seri with another man. Protective of her all the time, he searched her hotel room and found out that it was bugged. Always keeping an eye on her everywhere she goes; more so, when Seung-Jun reacquainted with Seri. Upon their return to the village, Captain Ri and his men planned a send-off picnic (Seri's idea).  On the day of Seri's departure, she bade goodbye to Captain Ri. She was coldly given a handshake instead of Seri's preferred hug. But unbeknown again to Seri, Captain Ri had secretly devised some plans for her protection and security. A  scheduled flight out from North Korea awaited Seri at Pyongyang International Airport. Captain Ri was on a defense stance for Seri and prepared weaponries for whatever assault that may hinder her departure.  En route while in a military jeep, they were ambushed. Captain Ri appeared and maneuvered a tactical move to rescue Seri, and bravely took a bullet for her during an exchange of gunshots.Parallel scene 1: Seri and Captain Ri arguing about the difference between destiny and coincidence.Parallel scene 2: Soe-dan and Seung-Jun agreed to cooperate with each other to resolve their issues on Captain Ri and Seri.  Parallel scene 3: Seri and Captain Ri  experienced their first memorable snow fall while unwinding  in a Cafe.Parellel Scene 4:  Seung-Jun meet with Cheol-gang and reported Seri's presence in North Korea.</p>Episode 6 Last Scene: Captain Ri sends off Seri thru a military vehicle driven by one of his men.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 7\"</td><td style=\"text-align:center\">January 11, 2020</td><td style=\"text-align:center\">2.510</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #8B008B\"><p>Unwilling to leave an injured Captain Ri to die, Yoon Seri drives both Captain Ri and his fellow soldier to hospital. The doctor informs Seri that Captain Ri will need a blood transfusion to survive, and she volunteers.  The whole ordeal makes her miss her flight to freedom. After waking up from surgery, Captain Ri reacts with animosity towards Yoon Seri for not taking her flight, believing she is selfish and unaware of the sacrifices they have made for her to get home safely. His anger turns to gratitude when he finds out about Yoon Seri's act of selflessness. He ventures out into the rain to find Seri and apologise for his outburst. They kiss and make up. Cheol-gang is still tracking Captain Ri, and orders his crew to find out which hospital is treating him.Meanwhile, Ko Myeong-eu and Soe-Dan visit Captain's Ri's village with the intent of buying an apartment. The women of the village do not take Myeong-eu seriously, and tell her that there are no vacant apartments. After acting condescending towards Na Wol-suk (the village Chief), Ma Young-ae steps in and introduces herself as the wife of Captain Ri's boss in an attempt to humble Myeong-Eu. Young-ae initially succeeds in earning the deferrence of Myeong-Eu, and tries to voice her opposition to the idea of the family moving there, but is quickly shut down when Myeong-Eu bribes the women with beauty products from her department store. However, Myeong-Eu is quickly confronted with the realities of the ways working class people outside of Ponyang live. Seri is visibly unhappy the whole time. She meets Seung-jun when she returns to Captain Ri's house to wait for him, unaware of his accident.Back at the hospital, Seri and Captain Ri discuss how to move on after their kiss. His squadron come to visit and embarrass him about getting shot. He and Seri have a heartfelt discussion about how he took a bullet for her.Seung-jun and Soe-Dan have a conversation about her feelings about her upcoming marriage. Seung-Jun points out that she has missed out on many of the enjoyable parts of a new relationship by entering into an arranged marriage, and that is why she feels disconnected and apprehensive. He reveals that he developed feelings for Seri, but only after the idea of an arranged marriage was taken out of the picture. He thinks Seo-Dan's feelings may be hindered by the expectations he was previously under.</p>The next day, Seri contacts Seung-Jun to check if he has told her family about her situation. He says he has been trying to get in touch with Captain Ri to discuss it with her. When she gets off the phone, she witnesses the military entering the hospital to apprehend Captain Ri. Lt Cdr Cho Cheol-gang confronts Captain Ri about checking out the weapons that were used in the confrontation, and orders his arrest. Captain Ri's father intervenes on the arrest, but confronts Captain Ri about the trouble he has caused. Soe-Dan confronts him about his feelings for Seri, and insists they go ahead with the wedding despite them. Seri and Seung-Jun meet. He lies about his contact with her family and insist they are worried about her. Back in Seoul, they publicly announce Seri's death. The announcement spreads through the media and inadventently makes its way back to Soe Dan via a smuggled bridal magazine. She confronts Captain Ri about the dangers of hiding Seri's identity, while Seung-jun has a similar discussion with Seri.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 8\"</td><td style=\"text-align:center\">January 12, 2020</td><td style=\"text-align:center\">3.043</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #8B008B\"><p>Yoon Seri, unaware of Seung-Jun's bad motives, was persuaded to join him in escaping to Europe using fake marriage documents to travel as a couple. This plan was conceived with the help of Soe-Dan whom he secretly meet.  Captain Ri, worried about Yoon Seri's whereabouts, started to check the hospital's CCTV footage. With the influence of his father as a high ranking official in North Korea, he was able to borrow a hospital vehicle and searched for Yoon Seri. He found the secluded villa but faced to fight a tight security. Yoon Seri was worried for his barely healed wound. Yet, she drove him away in between tears. When Captain Ri was out of sight, Yoon Seri decided otherwise and without hesitation stole Seung-jun's car keys and drove to look for Captain Ri in the middle of a snowstorm. Keeping Captain Ri away from Yoon Seri turns out to be much more difficult than Seung-jun had anticipated, as both Yoon Seri and Captain Ri deeply care for each other. In the thick of the night and heavy snow, she found him. Both took shelter in an empty school and they clarified misunderstandings on the sudden marriage plan with Seung-jun.Parallel scene 1:  In alliance with another high military official, Cheol-Gang found out about Captain Ri's activity. Seek more evidence and traced the secluded villa.Parallel scene 2:  Yoon Seri was kidnapped by a group of man while on her way back after pawning the ring given by Seung-Jun and bought the \"nice watch\" for Captain Ri as a gift.Parallel scene 3:  The kidnapping was witnessed by the \"rat soldier's\" son who kept the gift and give it to his father.        </p>Last scene Episode 8:  Resting on his bed after the night's ordeal, Captain Ri received a call from a terrified and crying Yoon Seri informing him that she was kidnapped. In the middle of their conversation gunshots was heard. And the line went off.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 9\"</td><td style=\"text-align:center\">January 18, 2020</td><td style=\"text-align:center\">2.941</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #8B008B\"><p>Cheol-gang catches up with Captain Ri, beat him, had him detained and interrogated. On the other hand Yoon Seri was safely brought by the kidnapers to the \"family home\" of Captain Ri. She was well feed by a servant in an attic, unaware of the fact that it was Captain Ri's home.  When Yoon Seri come face to face with Captain's Ri's  father that seemingly a person of authority, Yoon Seri started  to open up and relate her story. Seri not knowing that he was talking to no less than Captain Ri's father, sincerely speak well about Captain Ri. How he has been kind to her and cared for her and helped her in several attempts to escape.  Eavesdropping and upon hearing her ordeal, Captain Ri's mother transferred Yoon Seri to a comfy room that turned out to be the room of Captain Ri. On the other hand,  Freed from detention with the help of his father, Captain Ri hurriedly went home to seek help from his father. Not knowing that Seri was safely brought there by the alleged kidnappers under the command of his father who happened to be in an influential position in the Political Bureau of North Korea's Armed Forces. Captain Ri was assuaged to see Seri safe. His parents witnessed how the two deeply care for each other. Yoon Seri was ushered inside Captain Ri's room. When Seri saw the piano, she thought of some notes that she memorized and started playing it.  She heard and remembered this while on a serene  boat-ride on a lake at Switzerland.  Captain Ri found out that it was his piano composition for his brother and finished playing the said piece for Yoon Seri.Parallel scene 1: Flashback scenes from Switzerland.     Parallel Scene 2: Cheol-gang made a daring search at the family home of Captain Ri and found nothing.Parallel scene 3: Elsewhere, Captain Ri was forced to build  formidable facts and defenses about himself in order to escape Cheol-gang's clutches and schemes. Another escape was secretly planned with his trusted men for Seri. Given that the  electrically wired fences in the demarcation line were still down, they find their way to a section where Seri could cross to the side of South Korea.</p>Last scene for Episode 9: Trembling in fear as she walked away, Yoon Seri was followed by Captain Ri who bade goodbye with an affectionate last kiss.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 10\"</td><td style=\"text-align:center\">January 19, 2020</td><td style=\"text-align:center\">3.927</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #8B008B\">Back to her old  life in a posh district of Seoul (South Korea), Yoon Seri tried to continue her high-life and well-off lifestyle. She arrived in time to see her own funeral tribute. Walked into a board meeting where votes were about to be cast on the dissolution of her Chairmanship and ownership from her very own company.  Although she has taken care of her business conglomerate again— nothing feels quite the same. She felt certain void and found herself sleepless and crying for very obvious reasons. She truly missed the life she have had lived in North Korea and Captain Ri.  On the other hand, Captain Ri found compelling evidence that would link Cheol-gang in the death of his brother. The \"rat soldier\" confessed of Cheol-gang's scheme to him and stand as a witness. This is in addition to a number of anomalies that was gathered and saved in a memory card by his brother,  hidden inside the watch that Seri had given him as a gift. Cheol-gang escaped to South Korea as his way out from imprisonment and from North Korean authorities. Vented his revenge to pursue Seri's death in exchange of monetary reward from Seri's own brother and ruthless sister-in-law. Cheol-gang also turned his evil pursuit after Seri as part of his revenge to Captain Ri and his family. And to also  use Seri's own brother against her. Analyzing and Knowing that Seri's life could be in great danger and with the knowledge that Cheol-gang was already in South Korea after Yoon Seri, Captain Ri make a resolve to protect her at all cost. He hurdled a dangerous tunnel escape by crawling his way for long arduous hours to South Korea. Meanwhile, Cheol-gang disguised and infiltrated the Security Team of Seri's company. In North Korea, a group of soldiers rounded up Captain Ri's men and was commissioned by no less than Captain Ri's father for a special mission, to bring back  Captain Ri alive to North Korea.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep11\" style=\"text-align:center\">11</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 11\"</td><td style=\"text-align:center\">February 1, 2020</td><td style=\"text-align:center\">3.726</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #8B008B\">Captain Ri looked for Seri in the Gangnam District, where among the millions of people in the city of Seoul, they cross path. Tired and relieved in his search, and to Seri's disbelief, they embraced. Seri gladly accommodated him in return, the stylish Seri way. Lavish shopping galore followed. Introduced him as her new Bodyguard. Unforgettable Heart warming scenes as Captain Ri delved into another side of Seri's world. Including the complicated family feud for power and wealth among his siblings   Back in North Korea, Soe-Dan gives Seung-jun a place to stay after he loses his protection.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep12\" style=\"text-align:center\">12</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 12\"</td><td style=\"text-align:center\">February 2, 2020</td><td style=\"text-align:center\">4.782</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #8B008B\">Captain Ri's father sensing that his only son might be in real danger orchestrated a plan to send a support team thru Captain Ri's allies, his  patrol team. Introduced into a new world on Seoul, the soldiers have a hard time adjusting. Comically portrayed in several hilarious scenes.  Hoping to meet Seri, his men attempted to attend an event hosted by Seri's company. Its a hilarious epic failure when they tried to evade security and while they fled, the youngest soldier left his shoes in a hurry. That leads to the unexpected reunion of Captain Ri and Seri with his men.  While in North Korea, Seung-jun opens up to Soe-Dan over a bowl of rice porridge. Both fall for each other.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep13\" style=\"text-align:center\">13</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 13\"</td><td style=\"text-align:center\">February 8, 2020</td><td style=\"text-align:center\">3.998</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #8B008B\">Se-ri sends the comrades on a shopping spree, and plays hooky from work with Jeong-hyeok. Jung Man-bok encounters a dilemma.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep14\" style=\"text-align:center\">14</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 14\"</td><td style=\"text-align:center\">February 9, 2020</td><td style=\"text-align:center\">5.119</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #8B008B\">While Jeong-hyeok keeps watch over Se-ri, his comrades make themselves useful. Seung-jun can't stop worrying about Dan.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep15\" style=\"text-align:center\">15</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 15\"</td><td style=\"text-align:center\">February 15, 2020</td><td style=\"text-align:center\">4.898</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #8B008B\">South Korean officials try to figure out what's going on, but they're given conflicting stories. Seung-jun flees from his captors.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep16\" style=\"text-align:center\">16</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Episode 16\"</td><td style=\"text-align:center\">February 16, 2020</td><td style=\"text-align:center\">6.337</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #8B008B\"><p>Seung-jun saves Seo Dan from a group of corrupted mobsters who holds her hostage, but is fatally wounded in the process, eventually succumbing to his injuries en route to the hospital after the two exchanges their final words. This leads to her desire of personal revenge to look for the person responsible for his death to deliver her bittersweet justice. The <span>NIS</span> arrest Sang-ah and Sae-hyung for soliciting numerous crimes.</p><p>Se-ri, devastated by Ri Jeong-hyeok's words in his emotional disgust, faints after experiencing a life-threatening resurgence of <span>sepsis</span>, but was eventually recovered. Heartbroken upon learning that Jeong-hyeok had been looking after her and is being escorted out of the country, Seri, despite her medical condition, convinces her mother to drive towards the DMZ to see Jeong-hyeok and his company to give each other tearful goodbyes.</p><p>Before departing, Captain Ri leaves imprints of his presence to look after herself and to better improve her lifestyle, such as stocking up enough food for Seri along with notes on food preparation, his piano renditions on her portable voice recorder and Edelweiss seeds, and his surprise reserved phone messages sent in advance with the aid of the NIS officer.</p>Years later, Seri created a music foundation that sponsors scholarships for piano prodigies all over the world along with a strategic alliance with another music foundation based in Switzerland. Jeong-hyeok, after being discharged from the military and chosen as a pianist for the National Symphony Orchestra, returns to Switzerland and by faith found himself standing in front of Seri who paraglided and landed right in front of him, reuniting once more.</td></tr></tbody></table><br/><h3>Production</h3><p>The series reunited Son Ye-jin and Hyun Bin after first collaborated in the 2018 film The Negotiation.</p><h4>Development</h4><p>The premise of Crash Landing on You was inspired by a real event involving South Korean actress Jung Yang. In September 2008, Yang and three others had to be rescued after bad fog had caused their leisure boat to drift \"into the maritime boundary between North and South Korea.\" Park Ji-eun, the drama's screenwriter, was introduced to North Korean defector turned film adviser and writer Kwak Moon-wan, who became part of the drama's writing team. Kwak, who studied film directing in Pyongyang and had also been a member of an elite security force protecting the Kims, helped in crafting the drama's plot and in conceptualizing the setting and scenes in the drama portraying North Korean life.</p><p>Netflix's investment also helped the show to garner the budget of US$20 million.</p><h4>Filming</h4><p>The production process proved to be \"painstakingly meticulous\", owing both to South Korea's relationship with North Korea (where most of the story's plot ensues), as well as to avoid any unintentional violations of the 1948 National Security Act which forbids public praise or propaganda of North Korea and the Kim Family. The script avoided use of the honorific Chairman to refer to North Korea's leaders, and visible propaganda signs avoid mentioning anything about Kim Il Sung, Kim Jong Il, or Kim Jong Un (while their mandatory portraits were usually either blurred or obscured by the camera angles). In addition, the North Korean lapel pins used by North Korean characters were one third smaller than their actual size. Props manager Joo Dong-man said the crew did not have a \"guidebook on multiple hurdles he had to hop over – skillfully and delicately – to accurately depict the country while dodging criticism\" and, thus, had to be careful \"not to misrepresent the state\". Their research was also guided by North Koreans living in South Korea.</p><p>The first script reading took place on July 31, 2019, in Sangam-dong, Seoul, and filming overseas started at the end of August 2019. North Korean scenes were shot in South Korea and Mongolia. Scenes that took place in Switzerland were shot on location. The village of Iseltwald, one such location, experienced a tourism boom as a result.</p><br/><h3>Original soundtrack</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" class=\"infobox-above summary album\" style=\"font-style: italic; background-color: gainsboro; font-size: 125%;\">Crash Landing on You<br>(Original Television Soundtrack)</th></tr><tr><th colspan=\"2\" class=\"infobox-header description\" style=\"background-color: gainsboro\"><span>Soundtrack album</span> by <div class=\"contributor\" style=\"display:inline\">various artists</div></th></tr><tr><th scope=\"row\" class=\"infobox-label\">Released</th><td class=\"infobox-data published\">February 16, 2020</td></tr><tr><th scope=\"row\" class=\"infobox-label\">Recorded</th><td class=\"infobox-data plainlist\">2019–2020</td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Genre</span></th><td class=\"infobox-data category hlist\"><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li><span>Soundtrack</span></li><li><span>Ballad</span></li><li><span>K-pop</span></li></ul></div></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Length</th><td class=\"infobox-data\"><span class=\"duration\"><span class=\"min\">104</span>:<span class=\"s\">48</span></span></td></tr><tr><th scope=\"row\" class=\"infobox-label\">Language</th><td class=\"infobox-data category\"><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Korean</li><li>English</li></ul></div></td></tr><tr><th scope=\"row\" class=\"infobox-label\"><span>Label</span></th><td class=\"infobox-data hlist\"><span>Stone Music Entertainment</span></td></tr><tr><td colspan=\"2\" class=\"infobox-below\"><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1066479718\"></td></tr><tr><th colspan=\"2\" class=\"infobox-header\" style=\"background: gainsboro\"><span>Singles</span> from <i> Crash Landing on You </i></th></tr><tr><td colspan=\"2\" class=\"infobox-full-data\"><div style=\"text-align:left\"><ol><li><span class=\"item\"><span class=\"fn\">\"But It's Destiny\"</span><br>Released: December 15, 2019</span></li><li><span class=\"item\"><span class=\"fn\">\"Flower\"</span><br>Released: December 22, 2019</span></li><li><span class=\"item\"><span class=\"fn\">\"Sunset\"</span><br>Released: December 29, 2019</span></li><li><span class=\"item\"><span class=\"fn\">\"Here I Am Again\"</span><br>Released: January 12, 2020</span></li><li><span class=\"item\"><span class=\"fn\">\"Someday\"</span><br>Released: January 19, 2020</span></li><li><span class=\"item\"><span class=\"fn\">\"Photo of My Mind\"</span><br>Released: January 25, 2020</span></li><li><span class=\"item\"><span class=\"fn\">\"The Hill of Yearning\"</span><br>Released: January 26, 2020</span></li><li><span class=\"item\"><span class=\"fn\">\"All of My Days\"</span><br>Released: February 1, 2020</span></li><li><span class=\"item\"><span class=\"fn\">\"Like You\"</span><br>Released: February 2, 2020</span></li><li><span class=\"item\"><span class=\"fn\">\"Let Us Go\"</span><br>Released: February 9, 2020</span></li><li><span class=\"item\"><span class=\"fn\">\"<span>Give You My Heart</span>\"</span><br>Released: February 16, 2020</span></li></ol></div></td></tr><tr style=\"display:none\"><td colspan=\"2\"></td></tr></tbody></table><p>The following is the official track list of Crash Landing on You (Original Television Soundtrack) album. The tracks with no indicated lyricists and composers are the drama's musical score; the artists indicated for these tracks are the tracks' composers themselves. Singles included on the album were released from December 15, 2019, to February 16, 2020.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>CD 1</caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:40%\">Title</th><th scope=\"col\" style=\"width:20%\">Lyrics</th><th scope=\"col\" style=\"width:20%\">Music</th><th scope=\"col\" style=\"width:20%\">Artist</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"But It's Destiny\" (<span><span lang=\"ko\">우연인 듯 운명</span></span>)</td><td>Jung Gu-hyun</td><td>Jung Gu-hyun</td><td><span class=\"mw-redirect\">10cm</span></td><td class=\"tracklist-length\">3:51</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"Flower\"</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Jin-ho</li></ul></div></td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Surf Green</li></ul></div></td><td><span>Yoon Mi-rae</span></td><td class=\"tracklist-length\">4:12</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"Sunset\" (<span><span lang=\"ko\">노을</span></span>)</td><td>Park Woo-sang</td><td>Park Woo-sang</td><td><span>Davichi</span></td><td class=\"tracklist-length\">3:36</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Here I Am Again\" (<span><span lang=\"ko\">다시 난, 여기</span></span>)</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Surf Green</li></ul></div></td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Surf Green</li></ul></div></td><td><span>Baek Ye-rin</span></td><td class=\"tracklist-length\">3:54</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Someday\" (<span><span lang=\"ko\">어떤 날엔</span></span>)</td><td>Kim Ho-kyung</td><td>1601</td><td><span>Kim Jae-hwan</span></td><td class=\"tracklist-length\">4:18</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"Sigriswil\" (<i>Crash Landing on You</i> Title Full Version)</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Kim Kyung-hee</li><li>Nam Hye-seung</li></ul></div></td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Kim Kyung-hee</li><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td>Kim Kyung-hee</td><td class=\"tracklist-length\">3:42</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Spring in My Hometown\" (<span><span lang=\"ko\">고향의 봄</span></span>)</td><td> </td><td> </td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td class=\"tracklist-length\">4:47</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"The Wind of the Day\" (<span><span lang=\"ko\">그날의 바람</span></span>)</td><td> </td><td> </td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td class=\"tracklist-length\">4:58</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"The Song for My Brother\" (<span><span lang=\"ko\">형을 위한 노래</span></span>)</td><td> </td><td> </td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td class=\"tracklist-length\">4:21</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"My Companion\" (<span><span lang=\"ko\">나의 동무여</span></span>)</td><td> </td><td> </td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td class=\"tracklist-length\">5:15</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Like a Wild Flower\" (<span><span lang=\"ko\">들꽃처럼</span></span>)</td><td> </td><td> </td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td class=\"tracklist-length\">4:35</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"Time of Jeong-Hyeok for Se-ri\" (<span><span lang=\"ko\">세리를 향한 정혁의 시간</span></span>)</td><td> </td><td> </td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td class=\"tracklist-length\">1:48</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"Moments We Walked Together\" (<span><span lang=\"ko\">함께 걷던 순간</span></span>)</td><td> </td><td> </td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Go Eun-jung</li></ul></div></td><td class=\"tracklist-length\">2:34</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"Seri's Choice\" (<span><span lang=\"ko\">세리스 쵸이스</span></span>)</td><td> </td><td> </td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td class=\"tracklist-length\">1:54</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"5\" scope=\"row\"><span>Total length:</span></th><td>53:40</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>CD 2</caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:40%\">Title</th><th scope=\"col\" style=\"width:20%\">Lyrics</th><th scope=\"col\" style=\"width:20%\">Music</th><th scope=\"col\" style=\"width:20%\">Artist</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"Photo of My Mind\" (<span><span lang=\"ko\">내 마음의 사진</span></span>)</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Kim Kyung-hee</li></ul></div></td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Surf Green</li></ul></div></td><td><span>Song Ga-in</span></td><td class=\"tracklist-length\">4:32</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"The Hill of Yearning\" (<span><span lang=\"ko\">그리움의 언덕</span></span>)</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Kim Kyung-hee</li></ul></div></td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Kim Kyung-hee</li></ul></div></td><td>April 2</td><td class=\"tracklist-length\">3:54</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"All of My Days\" (<span><span lang=\"ko\">나의 모든 날</span></span>)</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>B.a.B</li></ul></div></td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>B.a.B</li></ul></div></td><td><span>Sejeong</span> (<span>Gugudan</span>)</td><td class=\"tracklist-length\">3:58</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Like You\" (<span><span lang=\"ko\">좋다</span></span>)</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Lee Geon</li><li>Choi Eun-hye</li></ul></div></td><td>Lee Geon</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>So Soo-bin</li><li><span>Sohee</span> (<span>Nature</span>)</li></ul></div></td><td class=\"tracklist-length\">3:25</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"Let Us Go\" (<span><span lang=\"ko\">둘만의 세상으로 가</span></span>)</td><td>Dong Woo-seok</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Dong Woo-seok</li><li>Yoo Jung-hyun</li><li>Jayins</li></ul></div></td><td><span>Crush</span></td><td class=\"tracklist-length\">3:41</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"<span>Give You My Heart</span>\" (<span><span lang=\"ko\">마음을 드려요</span></span>)</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Jin-ho</li></ul></div></td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Jin-ho</li></ul></div></td><td><span>IU</span></td><td class=\"tracklist-length\">4:40</td></tr><tr><th id=\"track7\" scope=\"row\">7.</th><td>\"Yeong-ae and Villagers\" (<span><span lang=\"ko\">영애동지와 마을 사람들</span></span>)</td><td> </td><td> </td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td class=\"tracklist-length\">3:14</td></tr><tr><th id=\"track8\" scope=\"row\">8.</th><td>\"Chi-soo and Se-ri\" (<span><span lang=\"ko\">치수와 세리</span></span>)</td><td> </td><td> </td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td class=\"tracklist-length\">3:14</td></tr><tr><th id=\"track9\" scope=\"row\">9.</th><td>\"The Song for My Brother\" (<span><span lang=\"ko\">형을 위한 노래</span></span>; orchestral ver.)</td><td> </td><td> </td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td class=\"tracklist-length\">4:35</td></tr><tr><th id=\"track10\" scope=\"row\">10.</th><td>\"Seo Dan\" (<span><span lang=\"ko\">단이</span></span>)</td><td> </td><td> </td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td class=\"tracklist-length\">0:52</td></tr><tr><th id=\"track11\" scope=\"row\">11.</th><td>\"Same Sky, Different World\" (<span><span lang=\"ko\">같은 하늘, 다른 세상</span></span>)</td><td> </td><td> </td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td class=\"tracklist-length\">3:18</td></tr><tr><th id=\"track12\" scope=\"row\">12.</th><td>\"Picnic\" (<span><span lang=\"ko\">소풍</span></span>)</td><td> </td><td> </td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td class=\"tracklist-length\">3:12</td></tr><tr><th id=\"track13\" scope=\"row\">13.</th><td>\"The Season of Us\" (<span><span lang=\"ko\">너와 나의 그 계절</span></span>)</td><td> </td><td> </td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td class=\"tracklist-length\">3:47</td></tr><tr><th id=\"track14\" scope=\"row\">14.</th><td>\"When That Day Comes\" (<span><span lang=\"ko\">그날이 오면</span></span>)</td><td> </td><td> </td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td class=\"tracklist-length\">4:22</td></tr><tr><th id=\"track15\" scope=\"row\">15.</th><td>\"Sigriswil\" (Opening Title Version)</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Kim Kyung-hee</li><li>Nam Hye-seung</li></ul></div></td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1129693374\"><div class=\"hlist\"><ul><li>Kim Kyung-hee</li><li>Nam Hye-seung</li><li>Park Sang-hee</li></ul></div></td><td>Kim Kyung-hee</td><td class=\"tracklist-length\">0:42</td></tr><tr class=\"tracklist-total-length\"><th colspan=\"5\" scope=\"row\"><span>Total length:</span></th><td>51:08</td></tr></tbody></table><h4>Chart performance</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th rowspan=\"2\" scope=\"col\" style=\"width:24em;\">Title</th><th rowspan=\"2\" scope=\"col\" style=\"width:2em;\">Year</th><th colspan=\"2\" scope=\"col\">Peak<br>positions</th><th rowspan=\"2\" scope=\"col\" style=\"width:5em;\">Remarks</th><th rowspan=\"2\"><abbr title=\"Reference\">Ref.</abbr></th></tr><tr><th scope=\"col\" style=\"width:2.5em;font-size:90%;\"><span class=\"mw-redirect\">KOR<br>Gaon</span></th><th scope=\"col\" style=\"width:2.5em;font-size:90%;\"><span>KOR<br>Hot</span></th></tr><tr><th scope=\"row\">\"But It's Destiny\" <span style=\"font-size:85%;\">(<span class=\"mw-redirect\">10cm</span>)</span></th><td rowspan=\"3\">2019</td><td>108</td><td>72</td><td>Part 1</td><td></td></tr><tr><th scope=\"row\">\"Flower\" <span style=\"font-size:85%;\">(<span>Yoon Mi-rae</span>)</span></th><td>22</td><td>20</td><td>Part 2</td><td></td></tr><tr><th scope=\"row\">\"Sunset\" <span style=\"font-size:85%;\">(<span>Davichi</span>)</span></th><td>47</td><td>32</td><td>Part 3</td><td></td></tr><tr><th scope=\"row\">\"Here I Am Again\" <span style=\"font-size:85%;\">(<span>Baek Ye-rin</span>)</span></th><td rowspan=\"7\">2020</td><td>4</td><td>6</td><td>Part 4</td><td></td></tr><tr><th scope=\"row\">\"Someday\" <span style=\"font-size:85%;\">(<span>Kim Jae-hwan</span>)</span></th><td>18</td><td>17</td><td>Part 5</td><td></td></tr><tr><th scope=\"row\">\"Photo of My Mind\" <span style=\"font-size:85%;\">(<span>Song Ga-in</span>)</span></th><td>35</td><td>31</td><td>Part 6</td><td></td></tr><tr><th scope=\"row\">\"The Hill of Yearning\" <span style=\"font-size:85%;\">(April 2)</span></th><td>187</td><td>—</td><td>Part 7</td><td></td></tr><tr><th scope=\"row\">\"All of My Days\" <span style=\"font-size:85%;\">(<span>Sejeong</span> (<span>Gugudan</span>))</span></th><td>50</td><td>31</td><td>Part 8</td><td></td></tr><tr><th scope=\"row\">\"Let Us Go\" <span style=\"font-size:85%;\">(<span>Crush</span>)</span></th><td>3</td><td>7</td><td>Part 10</td><td></td></tr><tr><th scope=\"row\">\"<span>Give You My Heart</span>\" <span style=\"font-size:85%;\">(<span>IU</span>)</span></th><td>1</td><td>3</td><td>Part 11</td><td></td></tr></tbody></table><br/><h3>Reception</h3><h4>Commercial performance</h4><p>With 1.75 billion online views, Crash Landing on You outperformed the prior leader, Mr. Sunshine, for most viewed drama clips by 200 million views as of February 17, 2020. The success of the drama helped to boost brand items due to product placement. The lead characters portrayed by Hyun Bin and Son Ye-jin ate Gold Olive Chicken, a product which had a 100% sales improvement due to the show. There was also an increase in sales of the Swarovski earrings worn by Son Ye-jin.</p><h4>International response</h4><p>Crash Landing on You was a huge success in China. The hashtag for the drama's final episode has received over 460 million views on Weibo. The drama's main streaming website, which holds the copyright in China, crashed on the night it aired the final episode due to the sheer number of users.</p><p>The show was also extremely popular in Japan during the period of the COVID-19 pandemic via Netflix. While the Korean Wave is a historically prominent component of media within Japan, Crash Landing on You has been uniquely influential there, in part due to its portrayal of daily life in North Korea. The series was featured on Japanese-Netflix's top 10 for an astonishing 69 consecutive weeks.</p><p>In the Philippines, many viewers noted similarities between the plot line and the political narrative of the country during the COVID-19 pandemic.</p><p>In the United States, Variety named Crash Landing on You one of \"The Best International Shows on Netflix\", and one of the \"Best International TV Series of 2020.\" Time also ranked it as one of the best Korean dramas on Netflix. Elle ranked it number 1 (out of 10) on the October 2020 10 Best K-Dramas To Binge-Watch On Netflix list, and Vogue listed it as one of \"Netflix: 4 Korean dramas to discover this summer.\" Boy Genius Report ranked it #2 of the five \"K-dramas you absolutely must watch on Netflix.\" BuzzFeed listed it as number 3 of the top 27 best K-dramas on Netflix. Forbes noted that it ranked number 1 out of the top 10 on a Netflix's Instagram list of its most romantic series, and Screen Rant ranked it as having the #2 (out of the top 10) \"tear-jerking scenes in K-dramas.\" In addition, Jo Walker of The Guardian's \"Stream Team\" called it \"addictively off-the-wall, heartbreaking and hilarious.\" Adella Suliman and Stella Kim of NBC News also suggested that the drama \"features all the ingredients a viewer could wish for\" and has \"drawn a global audience of millions, many no doubt searching for entertainment as they while away their time in coronavirus-related lockdowns.\" Wadzanai Mhute of The Daily Beast argues that Crash Landing on You, \"was a cultural phenomenon in its native South Korea, and it's gone criminally overlooked in the States, where it's available to stream on Netflix.\" Megan O'Keefe of Decider states that, \"Crash Landing on You is a show unlike anything you've ever seen. It has insane action sequences, glorious montages of wealth porn, unblinking looks at the impoverished lives of everyday North Koreans, and one of the most heart-wrenching love stories in ages. With 16 90-minute-long episodes, it's truly a feast to be savored and the perfect antidote to the winter quarantine blues.\"</p><p>Al Jazeera stated that it is a hallyu success.</p><h4>Representation of and reception in South and North Korea</h4><h4>General</h4><p>Although the series is a work of fiction, it has received some positive reviews from North Korean defectors for its depiction of everyday life in North Korea. At the same time, some details, such as the availability of food, relatively warm behavior of the army and the ease with which the characters cross the border have been criticized. Kim Ara, one of the extras who portrayed a North Korean villager, is a writer and actress from North Korea who states that she felt \"like was actually back in a North Korean village.\" Kwak Moon-wan, a North Korean defector, who had served with the Supreme Guard Command (which protects the ruling Kim family) worked as an adviser for the series, providing the writers with details about life in North Korea as well as North Korean governmental agencies that added credibility to the show. He acknowledged some of the criticism, admitting that he has taken liberties with the depiction of North Korea (such as not mentioning food shortages), but rejected the claim that he was glamorizing the regime or drawing a false equivalence, saying that the show also depicted some of the darker aspect of life under the regime, such as the issue of kotjebi (child homelessness) and the frequent power cuts. Some North Korean refugees, such as Chun Hyo-jin, who defected from the border village of Hyesan at the age of nineteen, tend to agree: \"Even if what they say, that it glamorizes North Korea, is true, would they choose to live there? I don't think so\". Even though the drama leaves political matters aside, which are essential to the North Korea issue as she sees it, she says it still is of great significance: \"Its depiction of North Korea is a bit far from reality, but it has made the people interested in North Korea\". The drama's producer Lee Jung-hyo said during a press conference in Seoul in December: \"I know some people are uncomfortable about our subject, North Korea, but we don't portray a wholly authentic North Korea in our drama. Most settings are closer to a fantasy, although some aspects do reflect real North Korean life\".</p><p>Kang Na-ra, a North Korean defector who advised the show's production team, stated that about 60% of North Korea's depiction in the show is accurate: \"The richer families in North Korea like to show off their wealth by adding lace curtains to their windows. So that was pretty well portrayed\". She also appreciated the detail about kimchi caves: \"Since rural North Korea doesn't get electricity, they don't have refrigerators. They have kimchi caves where they store kimchi, and that was also recreated well\". House checks are also a regular affair. She revealed that she once had to hide inside a furnace at the house of the broker who helped her to escape to avoid detection. In the drama, the heiress had to hide in the kimchi storage area when security forces came knocking one night. As depicted in the drama, North Koreans are allowed to choose only from a fixed list of hair styles - 18 for women and 28 for men. \"There's a punishment for you if you don't comply\" Kang said in an interview with YouTube channel DKDKTV. On the other hand, as she explained in a YouTube video, the characters were able to slip across the border much more easily than in real life: \"I had to pay a broker 10 million won (US$8,400) to swim across the Yalu river while being shot at from behind by soldiers\". Cartoonist Choi Seong-guk, who defected to the South in 2011, also said the drama set is 60% accurate. The portrayal of jangmadang, or local markets where all kinds of goods, including imports from South Korea, are sold is especially real, he told The Sunday Times. However, he felt that the drama \"glamorized the soldiers too much, almost to an uncomfortable extent\". He said North Korean men enter the military when they are 17 and serve for 10 to 13 years. \"During this time, they are...ruthless and harsh, robbing homes and raping women at night\". Still, he hopes the drama will make its way to North Korea and go viral: \"I hope the North Koreans who see this drama will realize how positively the South Koreans think of them and learn to change\".</p><p>There were also critical responses to the themes of the drama in both regions. In January 2020, The Christian Liberal Party (CLP) filed a complaint in South Korea against tvN at the Seoul Metropolitan Police Agency, accusing the network of glamorizing North Korea through this series, in violation of the National Security Law. Then, in March 2020, a few North Korean media outlets criticized unnamed South Korean programs and films that explored relations between North and South Korea. While Crash Landing on You was not directly mentioned by the media outlets, it was perceived to be among the referenced works. Another is the 2019 film, Ashfall, although that film was also not directly cited in the articles.</p><h4>Scholarship</h4><p>Stephen Epstein (Victoria University of Wellington) and Christopher Green (Leiden University) suggest that while Crash Landing on You is formulaic, it also \"is a crucial text for evaluating ongoing change in South Korean popular representations of its neighbour. Indeed, given the concerted use of North Korean backdrops in Crash Landing on You and the size and global extent of its audiences, the show is likely the most noteworthy South Korean popular culture representation of North Korea yet produced.\" Yun Suk-jin, a professor at Chungnam National University concurs, noting that the series \"changed the stereotypes on North Korea and candidly showed that it too is a place where people live.\" Sarah A. Son, Lecturer in Korean Studies at the University of Sheffield also agrees, noting that Crash Landing on You responds to the \"socio-cultural divide\" between the North and the South, which academic scholarship cites as one of the biggest obstacles to future unification. Son argues that \"through the re-framing of stereotypes, albeit with some creative licence, Crash Landing on You arguably humanises the North for its audience in ways that inter-Korean dialogue has not in recent years. Despite its soft-focus romanticisation of the political situation, Crash Landing on You brings the pain of the division to a personal level for a generation of Koreans who, unlike their grandparents, have no memory of what it was like to be a single nation.\"</p><p>Joanna Elfving-Hwang, Associate Professor of Korean Studies at the University of Western Australia notes that \"North Korea tends to appear in our imagination as the 'axis of evil', we think of nuclear weapons and human rights abuses...this drama has dared to think about North Korean people differently and represented them as quite human and quite Korean.\" Steve Hung Lok-wai, a Korean Affairs expert from the Chinese University of Hong Kong states that the drama sidestepped larger political issues through a narrative that did not end with the male lead's defection: \"Lots of people questioned whether the male lead, the North Korean soldier, would end up defecting to the South for love, but they were able to sidestep that scenario and gave it a plausible ending where the two would meet in Switzerland\". Thus, he argues, it's \"quite smart because they avoided all the real taboos but made it believable enough where it would make people think about these political problems.\" John Delury, a professor at Yonsei University, praised the series for its decision to draw parallels between powerful families in both the South and the North, and to humanize North Koreans beyond generic stereotypes.</p><h4>Ratings</h4><p>The series was a huge rating success in South-Korea. This series aired on tvN, a cable channel/pay TV which normally has a relatively smaller audience compared to free-to-air TV/public broadcasters (KBS, SBS, MBC and EBS). Crash Landing on You is the fourth highest-rated South Korean TV drama in cable television history. Early in its run, Crash Landing on You was the fourth highest rated Korean cable drama. The final episode's ratings made it the second highest rated Korean drama in cable television history at that time, surpassing fellow tvN dramas Reply 1988 and Guardian: The Lonely and Great God, until It finally became the fourth highest rated drama, surpassed by both JTBC drama, The World of the Married and Reborn Rich .</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\" style=\"text-align: left;\"><div class=\"mbox-text-span\">Graphs are temporarily unavailable due to technical issues.</div></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" rowspan=\"2\" style=\"padding-left:.8em;padding-right:.8em\">Season</th><th colspan=\"16\" style=\"padding-left:.8em;padding-right:.8em\">Episode number</th><th scope=\"col\" rowspan=\"2\" style=\"padding-left:.8em;padding-right:.8em\">Average</th></tr><tr><th scope=\"col\">1</th><th scope=\"col\">2</th><th scope=\"col\">3</th><th scope=\"col\">4</th><th scope=\"col\">5</th><th scope=\"col\">6</th><th scope=\"col\">7</th><th scope=\"col\">8</th><th scope=\"col\">9</th><th scope=\"col\">10</th><th scope=\"col\">11</th><th scope=\"col\">12</th><th scope=\"col\">13</th><th scope=\"col\">14</th><th scope=\"col\">15</th><th scope=\"col\">16</th></tr><tr><th style=\"background-color:#CCCCFF;width:10px\"></th><th scope=\"row\">1</th><td style=\"width:35px\">1.508</td><td style=\"width:35px\">1.773</td><td style=\"width:35px\">1.894</td><td style=\"width:35px\">2.225</td><td style=\"width:35px\">2.210</td><td style=\"width:35px\">2.414</td><td style=\"width:35px\">2.510</td><td style=\"width:35px\">3.043</td><td style=\"width:35px\">2.941</td><td style=\"width:35px\">3.927</td><td style=\"width:35px\">3.726</td><td style=\"width:35px\">4.782</td><td style=\"width:35px\">3.998</td><td style=\"width:35px\">5.119</td><td style=\"width:35px\">4.898</td><td style=\"width:35px\">6.337</td><td>3.331</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Average TV viewership ratings</caption><tbody><tr><th rowspan=\"2\"><abbr title=\"Episode\">Ep.</abbr></th><th rowspan=\"2\">Original broadcast date</th><th colspan=\"2\">Average audience share<br>(Nielsen Korea)</th></tr><tr><th width=\"110\">Nationwide</th><th width=\"110\"><span>Seoul</span></th></tr><tr><th>1</th><td>December 14, 2019</td><td><span style=\"color:blue\"><b>6.074%</b></span> <span style=\"font-size:85%;\">(1st)</span></td><td><span style=\"color:blue\"><b>6.558%</b></span> <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><th>2</th><td>December 15, 2019</td><td>6.845% <span style=\"font-size:85%;\">(1st)</span></td><td>7.841% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><th>3</th><td>December 21, 2019</td><td>7.414% <span style=\"font-size:85%;\">(1st)</span></td><td>7.689% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><th>4</th><td>December 22, 2019</td><td>8.499% <span style=\"font-size:85%;\">(1st)</span></td><td>9.409% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><th>5</th><td>December 28, 2019</td><td>8.730% <span style=\"font-size:85%;\">(1st)</span></td><td>9.794% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><th>6</th><td>December 29, 2019</td><td>9.223% <span style=\"font-size:85%;\">(1st)</span></td><td>9.535% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><th>7</th><td>January 11, 2020</td><td>9.394% <span style=\"font-size:85%;\">(1st)</span></td><td>9.738% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><th>8</th><td>January 12, 2020</td><td>11.349% <span style=\"font-size:85%;\">(1st)</span></td><td>12.031% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><th>9</th><td>January 18, 2020</td><td>11.516% <span style=\"font-size:85%;\">(1st)</span></td><td>12.355% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><th>10</th><td>January 19, 2020</td><td>14.633% <span style=\"font-size:85%;\">(1st)</span></td><td>15.903% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><th>11</th><td>February 1, 2020</td><td>14.238% <span style=\"font-size:85%;\">(1st)</span></td><td>14.648% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><th>12</th><td>February 2, 2020</td><td>15.933% <span style=\"font-size:85%;\">(1st)</span></td><td>16.413% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><th>13</th><td>February 8, 2020</td><td>14.097% <span style=\"font-size:85%;\">(1st)</span></td><td>14.620% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><th>14</th><td>February 9, 2020</td><td>17.705% <span style=\"font-size:85%;\">(1st)</span></td><td>18.612% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><th>15</th><td>February 15, 2020</td><td>17.066% <span style=\"font-size:85%;\">(1st)</span></td><td>17.406% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><th>16</th><td>February 16, 2020</td><td><span style=\"color:red\"><b>21.683%</b></span> <span style=\"font-size:85%;\">(1st)</span></td><td><span style=\"color:red\"><b>23.249%</b></span> <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><th colspan=\"2\">Average</th><th><span style=\"color:green\"><b>12.150%</b></span></th><th><span style=\"color:green\"><b>12.863%</b></span></th></tr><tr><th rowspan=\"3\">Special</th><td>January 4, 2020</td><td>4.810% <span style=\"font-size:85%;\">(1st)</span></td><td>4.253% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><td>January 5, 2020</td><td>3.975% <span style=\"font-size:85%;\">(1st)</span></td><td>3.252% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><td>January 25, 2020</td><td>4.180% <span style=\"font-size:85%;\">(1st)</span></td><td>4.283% <span style=\"font-size:85%;\">(1st)</span></td></tr><tr><td colspan=\"4\" style=\"font-size:85%\"><ul><li>In the table above, the <b><span style=\"color:blue\">blue numbers</span></b> represent the lowest ratings and the <b><span style=\"color:red\">red numbers</span></b> represent the highest ratings.</li><li>This series aired on a cable channel/pay TV which normally has a relatively smaller audience compared to free-to-air TV/public broadcasters (<span>KBS</span>, <span>SBS</span>, <span>MBC</span> and <span>EBS</span>).</li></ul></td></tr></tbody></table><br/><h3>Accolades</h3><p>In May 2020 the show's scriptwriter, Park Ji-eun, was named \"Person of the Year\" by South Korea's Unification Ministry, for contributing to \"unification education.\"</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption></caption><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Recipient</th><th>Result</th><th class=\"unsortable\"><abbr title=\"Reference\">Ref.</abbr></th></tr><tr><td rowspan=\"33\">2020</td><td><span>30th Seoul Music Awards</span></td><td>OST Award</td><td>\"Flower\" (<span>Yoon Mi-rae</span>)</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"11\"><span>56th Baeksang Arts Awards</span></td><td><span class=\"mw-redirect\">Best Drama</span></td><td><i>Crash Landing on You</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"11\"></td></tr><tr><td><span class=\"mw-redirect\">Best Director</span></td><td>Lee Jung-hyo</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Actor</span></td><td><span>Hyun Bin</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Actress</span></td><td><span>Son Ye-jin</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Supporting Actor</span></td><td><span>Yang Kyung-won</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Best Supporting Actress</span></td><td><span>Kim Sun-young</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Seo Ji-hye</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Screenplay</span></td><td><span>Park Ji-eun</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\">Popularity Award</td><td><span>Hyun Bin</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Son Ye-jin</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Bazaar Icon Award</td><td><span>Seo Ji-hye</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\">15th <span>Seoul International Drama Awards</span></td><td>Best Mini-series</td><td rowspan=\"2\"><i>Crash Landing on You</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td>Outstanding Korean Drama</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td>Outstanding Korean Actress</td><td><span>Son Ye-jin</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"2\">Asian Academy Creative Awards</td><td>Best Drama Series (Korea)</td><td rowspan=\"4\"><i>Crash Landing on You</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td>Best Drama Series (Grand Final)</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"3\">Asia Contents Awards</td><td>Best Asian Drama</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\"></td></tr><tr><td>Best Creative</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Writer</td><td><span>Park Ji-eun</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Korea Cable TV Broadcasting Association</td><td>Global Award (VOD Category)</td><td><i>Crash Landing on You</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td>Tokyo Drama Award 2020</td><td>Overseas Drama Special Award</td><td><i>Crash Landing on You</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>2020 Mnet Asian Music Awards</span></td><td><span class=\"mw-redirect\">Best OST</span></td><td>\"Here I Am Again\" (<span class=\"mw-redirect\">Baek Yerin</span>)</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td>3rd Annual <span>Global TV Demand Awards</span></td><td>Most In-Demand Korean Drama Series</td><td><i>Crash Landing on You</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"9\"><span>7th APAN Star Awards</span></td><td><b>Grand Prize (Daesang)</b></td><td><span>Hyun Bin</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"9\"></td></tr><tr><td>Drama of the Year</td><td><i>Crash Landing on You</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Top Excellence Award, Actress in a Miniseries</td><td><span>Son Ye-jin</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Excellence Award, Actress in a Miniseries</td><td><span>Seo Ji-hye</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\">Best Supporting Actor</td><td><span>Kim Jung-hyun</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Yang Kyung-won</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Kim Young-min</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Supporting Actress</td><td><span>Kim Sun-young</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>KT Seezn Star Award</td><td><span>Son Ye-jin</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\">2021</td><td rowspan=\"2\"><span>30th Seoul Music Awards</span></td><td rowspan=\"2\">OST Award</td><td>\"Here I Am Again\" (<span class=\"mw-redirect\">Baek Yerin</span>)</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>\"Give You My Heart\" (<span>IU</span>)</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Korea Communications Commission Broadcasting Awards</td><td><b>Grand Prize (Daesang)</b></td><td><i>Crash Landing on You</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td>Korea Cable TV Broadcasting Association</td><td>PP Special Award (VOD Category)</td><td><i>Crash Landing on You</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr></tbody></table><br/><h3>Musical adaptation</h3><p>On March 29, 2021, it was announced that Crash Landing on You would be adapted into a musical and the production companies Pop Music and T2N Media had completed a global copyright contract with Studio Dragon. The musical was performed at the Shinhan Card Artium, COEX, Gangnam-gu, Seoul from September 16 to November 13, 2022.</p><br/>"
  },
  "errorMessage": ""
}