{
  "imDbId": "tt10332508",
  "title": "Primal",
  "fullTitle": "Primal (TV Series 2019– )",
  "type": "TVSeries",
  "year": "2019",
  "items": [
    {
      "username": "dafoat",
      "userUrl": "https://www.imdb.com/user/ur9010140",
      "reviewLink": "https://www.imdb.com/review/rw5169885",
      "warningSpoilers": false,
      "date": "7 October 2019",
      "rate": "10",
      "helpful": "150 out of 164 found this helpful.",
      "title": "Brutal and Gorgeous",
      "content": "I had the chance to catch a preview screening of the first four episodes of Primal on the big screen in Los Angeles. This is the most stunning piece of animation I've seen in years. It completely immerses you in a rich, fantastic world. The character designs are brilliant. The action is awesome. And it does it all without a single word of spoken dialogue. A triumph of visual storytelling."
    },
    {
      "username": "Rectangular_businessman",
      "userUrl": "https://www.imdb.com/user/ur13538926",
      "reviewLink": "https://www.imdb.com/review/rw7159454",
      "warningSpoilers": false,
      "date": "24 July 2021",
      "rate": "9",
      "helpful": "46 out of 54 found this helpful.",
      "title": "Another great series by Genndy Tartakovsky",
      "content": "This perhaps one of the best series Adult Swim has made in a long time, being another great excellent series by Genndy Tartakovsky, with impressive animation and a great atmosphere.Amazing how the lack of dialogue actually works incredibly well for this series: The rule \"Show, don't tell\" is at full display here, and it has an excellent dramatic effect.It feels more cinematic than many modern dialogue-driven action movies."
    },
    {
      "username": "sscialli",
      "userUrl": "https://www.imdb.com/user/ur55195417",
      "reviewLink": "https://www.imdb.com/review/rw5178204",
      "warningSpoilers": false,
      "date": "11 October 2019",
      "rate": "10",
      "helpful": "52 out of 65 found this helpful.",
      "title": "Excellent non verbal Primal",
      "content": "In the 1970's Marvel Comics ran a series of comics in its own series called Devil Dinosaur, it was about a intelligent verbal primate who saved a dinosaur similar to the one here , only red hence the name, and the minute they bonded was sparked to the memory of the characters in the comic and this screamed in my head the joys from the pages into an awesome animation spectacle which is so richly done! Two species fighting for their lives and each other bound by circumstance created in such a way that entertaining , powerful and richly drawn with rich hues of saturated prime colors. I'm going to be saddened knowing it will end. Since the days of Dexters Lab to Samurai Jack i have enjoyed the creators style, this I hope brings more for us to enjoy on the fringe. Thank You Mr. Tartakovsky for your stellar work."
    },
    {
      "username": "nasdagoodshepherd",
      "userUrl": "https://www.imdb.com/user/ur101705202",
      "reviewLink": "https://www.imdb.com/review/rw5171423",
      "warningSpoilers": false,
      "date": "8 October 2019",
      "rate": "9",
      "helpful": "35 out of 43 found this helpful.",
      "title": "The Darker Version of Samurai Jack",
      "content": "Tonight, I watched the new animated show for Adult Swim, Primal, from show creator, Genndy Tartakovsky who is well known for creating Dexter's Laboratory, Samurai Jack, Star Wars: The Clone Wars 2003, Sym-Bionic Titan and the Hotel Transylvania franchise. It was beyond amazing, the perfect teamwork between Spear (The cavman) and Fang (The Dinosaur) going on adventures to hunt, kill and survive through many deadly prehistoric creatures that can kill anything or anyone. This is one of the best things Genndy Tartakovsky has ever done. Now it can wait for another episode tomorrow night at midnight! And then, I'll also wait for Hotel Transylvania 4. I give Primal a 9.5/10"
    },
    {
      "username": "owen-watts",
      "userUrl": "https://www.imdb.com/user/ur57284019",
      "reviewLink": "https://www.imdb.com/review/rw7388179",
      "warningSpoilers": true,
      "date": "28 September 2021",
      "rate": "9",
      "helpful": "22 out of 27 found this helpful.",
      "title": "Every Frame a Cave Painting",
      "content": "Pure distilled Genndy genius - bringing his unparalleled mastery of 2D animation to this gloriously stripped-back expressionistic prehistoric fantasy epic. There's a drifting central narrative, but much like Samurai Jack it's split into different episodic meditations on genre. You know the fare, epic battles, heart-breaking asides, disturbing encounters, stunning set-pieces. It's a fantastic watch but what makes it really special is the art direction - the use of colour is iconic and stunning, the character design is incredible and the landscapes can be legitimately breath-taking. Sometimes I just paused the show to drink it all in. It's just pure art basically and if you're even remotely interested in animation then get this into your eyes and mind. Cannot wait for more."
    },
    {
      "username": "hassambitw",
      "userUrl": "https://www.imdb.com/user/ur35204638",
      "reviewLink": "https://www.imdb.com/review/rw5178471",
      "warningSpoilers": false,
      "date": "11 October 2019",
      "rate": "8",
      "helpful": "80 out of 89 found this helpful.",
      "title": "Beautiful, Emotional, Raw and Violent",
      "content": "Genndy Tartakovsky's Primal, set in the Mesozoic era, depicts a story of a caveman named Spear, who, under tragic circumstances, is forced to ally with a T-Rex, Fang, in order to survive whatever obstacles it is they come across on their journey.I'm three episodes in so far, and I'm hooked. Not only is it beautifully animated which makes every battle scene stand out and be visceral, but it does so much more to appeal to our internal emotions solely by the expressions on the characters' faces and their movements, without really humanizing anything. It reminds you that in this harsh world, to live is to eat, and to eat is to kill. The art style is gorgeous as well, with its world rich with subtle details to make it feel alive. The score for this hits a balance between something eerie and organic, with a bit of drums added in which adds to the tension during chases and whatnot.This show is a gem. Please go see it and voice your support so we (hopefully) get to see more like this."
    },
    {
      "username": "ssvfolder-1",
      "userUrl": "https://www.imdb.com/user/ur18073308",
      "reviewLink": "https://www.imdb.com/review/rw5513728",
      "warningSpoilers": true,
      "date": "28 February 2020",
      "rate": "9",
      "helpful": "24 out of 31 found this helpful.",
      "title": "Forget \"UP\". This is your true emotion series",
      "content": "Pure rage. That's what you feel watching the first episode of the series. Revenge for the kill of children whether dinosaur or human. To tell a story without saying a word is art. This is it. Every battle feels as it's the last one and characters need to survive. TV series or a move, it needs to be a show and this one delivers big time. Genndy Tartakovsky is an animation genius. From everything that was at the cartoon network to this one. Watch it. Fall in love with it. Please keep on creating."
    },
    {
      "username": "mematron",
      "userUrl": "https://www.imdb.com/user/ur47240177",
      "reviewLink": "https://www.imdb.com/review/rw5169104",
      "warningSpoilers": false,
      "date": "7 October 2019",
      "rate": "10",
      "helpful": "55 out of 64 found this helpful.",
      "title": "The emotion of animation",
      "content": "From the timing to the story and the style; at its core this is a very masterfull story told with beautiful delicate animation. It's not easy telling a story without words but when you can, not do but CAN; well, you get a powerful display of raw, one might even say, PRIMAL essence of character.This is why we make animation. This is why we tell stories. have fun with this show and be prepared for the feels."
    },
    {
      "username": "sdaneshan",
      "userUrl": "https://www.imdb.com/user/ur108507424",
      "reviewLink": "https://www.imdb.com/review/rw5169492",
      "warningSpoilers": false,
      "date": "7 October 2019",
      "rate": "10",
      "helpful": "60 out of 70 found this helpful.",
      "title": "Just Awesome1",
      "content": "One of the best animated episodes iv'e seen in awhile, which story is told through sound and visuals instead of words. Very impressive"
    },
    {
      "username": "carlgarethnorton",
      "userUrl": "https://www.imdb.com/user/ur99466509",
      "reviewLink": "https://www.imdb.com/review/rw6425717",
      "warningSpoilers": false,
      "date": "30 December 2020",
      "rate": "9",
      "helpful": "39 out of 53 found this helpful.",
      "title": "The low ratings are dumb",
      "content": "This is art. The dialogue is the gestures and facial expressions. Its brilliant, you feel like you know what they're thinking and it has comical moments in a savage storyThere is comments that cry about animal abuse which is ludicrous There is comments saying this is for kids Which is ludicrous There is comments saying this is stupid Which is ludicrousWhere have your imaginations gone? I genuinely feel like the negative comments are written by people who just like to be negative and have a superior complex because none of the 1/10s had anything of substance"
    },
    {
      "username": "fciocca",
      "userUrl": "https://www.imdb.com/user/ur62460576",
      "reviewLink": "https://www.imdb.com/review/rw5184569",
      "warningSpoilers": false,
      "date": "13 October 2019",
      "rate": "10",
      "helpful": "15 out of 21 found this helpful.",
      "title": "Visually impressive, excellent storytelling",
      "content": "Primal is a very stunning show, setted in the prehistoric times, it tells about the strong friendship between a caveman and a dinosaur. Both lived a very traumatic experience and the only way to survive is stay and fight together.The story is told through sounds and music, there are no dialogues, no words. The sound design, shots and animations are simply amazing, I was completely stunned: the tension in some scenes, the develop of the friendship between the animal and the human being and the design of other creatures. Everything is well balanced and you can really bound with main characters.Genndy Tartakovsky made another amazing product, and I understand immediately why I fell in love with this serie: when I was a child, I used to be a big fan of Dexter's Laboratory, The Powerpuff Girls and Samurai Jack. Of course I just found out that he was the creator of all these series. It is a small gem. If you want to watch quality stuff, I highly recommend this show."
    },
    {
      "username": "hoboss2806",
      "userUrl": "https://www.imdb.com/user/ur83561478",
      "reviewLink": "https://www.imdb.com/review/rw5174406",
      "warningSpoilers": false,
      "date": "9 October 2019",
      "rate": "10",
      "helpful": "25 out of 34 found this helpful.",
      "title": "It's so worth a watch!!!",
      "content": "I was pleasantly surprised.Actions are louder than words. This can be seen here as well. It's a true piece of art and distributes some good values: loss and its coping mechanisms, bravery, friendship, survival, loyalty.It's a good one. I highly recommend.It's definitely nothing for younger children but aged 7 and up could watch that. Europeans aren't that strict and since it's animated it's kind of okay and has really good values."
    },
    {
      "username": "MoistMovies",
      "userUrl": "https://www.imdb.com/user/ur19484559",
      "reviewLink": "https://www.imdb.com/review/rw6897052",
      "warningSpoilers": false,
      "date": "9 May 2021",
      "rate": "10",
      "helpful": "15 out of 21 found this helpful.",
      "title": "It's hard to put into words how incredibly well made and entertaining Primal is",
      "content": "It's something you have to see for yourself. Even if you think animation is above your tastes since you grew up...Personally, Im not young. And this series is not made for young people.I won't gush over it, which I easily could.But to say this is going under the radar is a gross understatement.This series matches up with some of the best animated series, ever. Including Anime... Very very rarely does the west give the Japanese a run for their money (not including CGI animated films) And there was no need for words. The animation, writing and score did the talking.The orchestral score... Its.. Just go watch it."
    },
    {
      "username": "dsmith1868-1",
      "userUrl": "https://www.imdb.com/user/ur14517227",
      "reviewLink": "https://www.imdb.com/review/rw6994263",
      "warningSpoilers": true,
      "date": "3 June 2021",
      "rate": "9",
      "helpful": "15 out of 20 found this helpful.",
      "title": "Did you not get that this is not Earth?",
      "content": "Yeah. Dinos and humans didn't exist together... here. This is obviously a fantasy setting and not earth. Come on. All these low-raters cause dinos and humans didn't exist at the same time. Duh! Everyone knows that. And who's showing this to \"kids\"? It's an adult fantasy show that takes place on some other world. Watch beyond the first episode, haters! Nothing says or signifies that this is earth. Brutal. Honest. Heartwarming. Great show! Full of raw... everything."
    },
    {
      "username": "jamesrupert2014",
      "userUrl": "https://www.imdb.com/user/ur58781741",
      "reviewLink": "https://www.imdb.com/review/rw5269838",
      "warningSpoilers": false,
      "date": "20 November 2019",
      "rate": "8",
      "helpful": "16 out of 25 found this helpful.",
      "title": "Entertaining and visually arresting (eps. 1-5)",
      "content": "An Ally-oop-ish 'cave man' (Spear) and his tyrannosauroid companion (Fang) struggle to feed and to survive in an imaginary primal world of monsters and (now) extinct species. The show definitely views nature as 'red in tooth' as various creatures, including the heroes' off-spring, get decapitated, bit in two, or messily devoured by a variety of prehistoric carnivores. There is no script beyond grunting, roaring, or screaming but series creator Genndy Tartakovsky manages to bring a lot of personality to his voiceless yet engaging characters (both man and beast). The physics are as unrealistic as the paleo-biology, but viewers willing to suspend their disbelief will be rewarded with entertaining stories and a rich, somewhat surreal, depiction of an alternative primeval Earth."
    },
    {
      "username": "chrisgallo-28335",
      "userUrl": "https://www.imdb.com/user/ur68337655",
      "reviewLink": "https://www.imdb.com/review/rw5182685",
      "warningSpoilers": false,
      "date": "12 October 2019",
      "rate": "10",
      "helpful": "59 out of 72 found this helpful.",
      "title": "I'm speechless",
      "content": "I gave this a 9 until episode 5 now I have it a 10!!!! Just epic"
    },
    {
      "username": "toonyjakes",
      "userUrl": "https://www.imdb.com/user/ur89934683",
      "reviewLink": "https://www.imdb.com/review/rw8482888",
      "warningSpoilers": false,
      "date": "24 August 2022",
      "rate": "10",
      "helpful": "9 out of 12 found this helpful.",
      "title": "An epic must-see",
      "content": "You know a show is great when you can drop into any episode and find yourself enthralled. From the very first scene of Primal I was hooked.The show has no dialogue which honestly is completely genius. The way the animation shows expression through actions and gestures is just great, and it made me feel calm, like a visual meditation. Finally a show that pushes you to watch rather than to listen to a bunch of babbling. I'm urging everyone to watch it, I'm going to show it to my friends that \"dont like cartoons\" so they can see that when done right, animation can almost be more powerful at conveying emotion than film. It hasn't been out long but I think that this show will go down in history and stick in our minds for years to come. Quite nothing like it. Not one bad thing to say at all."
    },
    {
      "username": "dk777",
      "userUrl": "https://www.imdb.com/user/ur80922659",
      "reviewLink": "https://www.imdb.com/review/rw6582745",
      "warningSpoilers": false,
      "date": "10 February 2021",
      "rate": "8",
      "helpful": "10 out of 15 found this helpful.",
      "title": "Spear and Fang",
      "content": "An interesting and fun series with a good story that has great potential. From the very beginning, it is clear that this is a series for adults. There is an abundance of violence, it is quite brutal and bloody, and the very beginning of the story is really sad. The animation is good, as is the directing and the series itself is easy to watch. The episodes are interesting, the story unfolds quickly and sometimes goes in unforeseen directions which is one of the things that makes this series so good. An interesting, unusual and brutal series that is really worth watching."
    },
    {
      "username": "BoxwoodExpress",
      "userUrl": "https://www.imdb.com/user/ur71356826",
      "reviewLink": "https://www.imdb.com/review/rw5238729",
      "warningSpoilers": true,
      "date": "6 November 2019",
      "rate": "10",
      "helpful": "12 out of 18 found this helpful.",
      "title": "A masterpiece of animation",
      "content": "Man, Genndy Tartakovsky is a true animation master. Pretty much everything he touches is a masterpiece, and this show, Primal (2019) is no exception. It borrows a lot from Tartakovsky's most popular show, Samurai Jack. They both don't have that much dialogue, and both have a lot of action, drama, and heart.This show involves a caveman named Spear, whose family gets killed by dinosaur. He meets another dinosaur named Fang. They can't stand each other at first, but as the episodes go on, they start to care deeply for each other and they become true friends. It is one of the most well-crafted friendship stories in animation, and the ending of episode 5. Good Lord, the ending. Poor, poor Spear......One major element of the show is that there is no dialogue, only visuals and music. When something does come out of the characters' mouths, it's only grunts and yells. This helps to establish the show's setting. This show is about dinosaurs, and obviously dinosaurs can't talk, and cavemen weren't advanced enough to talk normally, so the lack of dialogue is justified. It's also a great example of \"show, don't tell\", as the visuals and music convey the tone in ways dialogue never could.There is a lot of blood in the show, so be warned if you're squeamish of blood. Other than that, I think Big Kids™ with a lot of patience should be able to handle it. I definitely recommend it. If you think all modern cartoons are trash, watch this show and your mind will be changed."
    },
    {
      "username": "deloudelouvain",
      "userUrl": "https://www.imdb.com/user/ur58525162",
      "reviewLink": "https://www.imdb.com/review/rw6539379",
      "warningSpoilers": false,
      "date": "29 January 2021",
      "rate": "8",
      "helpful": "11 out of 18 found this helpful.",
      "title": "Raw, brutal, primitive, best animation series of the moment.",
      "content": "For once I really enjoyed an animated production. Primal is raw, nothing too sofisticated, even the drawings are pretty basic but it's all pleasant to watch. Primal is brutal, with almost every episode the necessary slashing and violent killings, which you would expect in a time where surviving is the only thing you're worried about. Primal is primitive, there's no talking except some grunting, and that's exactly what makes this series great. Primal is animation for adults that like something different for once. Great job from Genndy Tartakovsky and the whole animation team."
    },
    {
      "username": "beanslegit",
      "userUrl": "https://www.imdb.com/user/ur127470736",
      "reviewLink": "https://www.imdb.com/review/rw8809551",
      "warningSpoilers": false,
      "date": "18 January 2023",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "The 1/10 Reviews Are Wack",
      "content": "I've read a lot of reviews on here that just complain about the gore, or say \"humans and dinos never existed\"... As if that's an argument. It's not. If your kids are dumb enough to start believing that's a fact just because of this show that's your fault. But anyway!Like fair enough of course not everyone is into hardcore realistic violence, but that doesn't give you the slightest grounds to say the show is 1/10 on that basis alone. It's a non review.That out of the way, I rate this show 10 out of 10. And I mean that. I loved every minute of this show, that does what hollywood can't and without any dialogue. You get to know Spear and Fang over time and see their relationship and trust develop. They are complicated characters too, somehow even though they never speak.Anyways I loved it I was hooked, it's so visceral and yet beautiful. I can say that I'm a huge Tartakovsky fan so I'm biased admittedly."
    },
    {
      "username": "stevebondi",
      "userUrl": "https://www.imdb.com/user/ur23183310",
      "reviewLink": "https://www.imdb.com/review/rw6224503",
      "warningSpoilers": false,
      "date": "1 November 2020",
      "rate": "10",
      "helpful": "10 out of 16 found this helpful.",
      "title": "Another Tartakowsky masterpiece!",
      "content": "Intense colors, intense action, intense sound ... then total silence :-) Tartakowsky is a master of animated action with cool stylized designs. This show is so riveting and enjoyable to watch! 🙂"
    },
    {
      "username": "computer2computer",
      "userUrl": "https://www.imdb.com/user/ur5216888",
      "reviewLink": "https://www.imdb.com/review/rw8548356",
      "warningSpoilers": false,
      "date": "16 September 2022",
      "rate": "10",
      "helpful": "7 out of 11 found this helpful.",
      "title": "I cannot do this animation justice, but I'll try my best here",
      "content": "First of all, I gotta say that I had decided to wait till the end of season 2 before I'd write & post my review, although I basically knew what I wanted to say right after watching the first episode of season 1... I simply wanted to be accurate & fairly critical in my assessment of the show.Well, Primal is like nothing ever made before; it's brutal & savage yet heart-melting & gushes with emotions at the same time, it's crazy yet filled with wisdom at the same time, it's fast & abundant with action without a single doll moment yet suspenseful at the same time, it can be perceived as an animated documentary yet it's also filled with fantasy & imagination at the same time... BOTTOM LINE: I have never (and I literally & sincerely mean \"never\") seen anything more beautiful & powerful than this animation; not a TV series, not a movie, not an anime, nothing!!!I'm a huge fan and I love the usual inspiring magical popular animations like \"Dragon Ball\" and \"Avatar: The Last Airbender\", etc --- but still; this is something else... I cannot find the words to describe how much I adore it and how much I'm fascinated by it; you just have to watch it and judge for yourself.The script is written superbly in a way that will make you empathize & sympathize with the main characters limitlessly, to the degree of swaying you and changing your psyche & preconceived thoughts! It made me hate the Vikings and the ancient Egyptians for their ruthlessness & selfishness, especially regarding their enslaving other peoples (and I'm someone who was addicted to the TV series Vikings!), and it made me love the name Mira and her Lebanese/Phoenician culture, language & roots, and it made me wish I had a dinosaur for a pet/best-friend!And I really have enjoyed getting brain-washed like that! LolJUST WATCH THE DAMN THING (if you still haven't), and thank me later."
    },
    {
      "username": "almighty4",
      "userUrl": "https://www.imdb.com/user/ur1327441",
      "reviewLink": "https://www.imdb.com/review/rw8382030",
      "warningSpoilers": false,
      "date": "29 July 2022",
      "rate": "10",
      "helpful": "9 out of 13 found this helpful.",
      "title": "Absolutely Fantastic!",
      "content": "Please PLEASE! Make more. So good.. Not even done with all the episodes, but I had to stop and beg for more. Superb storytelling without dialogue.. One of the best shows of the last few years."
    },
    {
      "username": "OnjiMooteDaMarle",
      "userUrl": "https://www.imdb.com/user/ur42414764",
      "reviewLink": "https://www.imdb.com/review/rw7246687",
      "warningSpoilers": false,
      "date": "19 August 2021",
      "rate": "8",
      "helpful": "7 out of 13 found this helpful.",
      "title": "True, Raw & Fantastic",
      "content": "Bang on from the very first scene and what a beautiful first scene that is. The animation and the sounds are wonderfully done. Kudos to the team. Love the brutality, the struggles, the bare truths. A wonderful watch. A serious film about a stone age man and his struggle for survival as he bonds with a dinosaur. A film without any dialogues & could be a tad much for kids."
    }
  ],
  "errorMessage": ""
}