{
  "imDbId": "tt1758429",
  "title": "Spartacus: Gods of the Arena",
  "fullTitle": "Spartacus: Gods of the Arena (TV Series 2011–2011)",
  "type": "TVSeries",
  "year": "2011",
  "items": [
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8426117",
      "warningSpoilers": false,
      "date": "11 August 2022",
      "rate": "10",
      "helpful": "40 out of 40 found this helpful.",
      "title": "Absolutely Amazing!",
      "content": "Spartacus: God's of the Arena is the prequel to the other 3 amazing seasons of Spartacus and it's just as great as those 3! Most prequels usually don't live up to the original but this absolutely does as it ties into the original story perfectly! Anything I say won't do the Spartacus Saga justice so I'll just say go watch this incredible series!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8576343",
      "warningSpoilers": false,
      "date": "29 September 2022",
      "rate": "10",
      "helpful": "37 out of 37 found this helpful.",
      "title": "Terrific!!",
      "content": "I don't even know how to describe how much I love Spartacus, both the original and the prequel. I've watched the entire series all the way through at least four or five times because it's just that good. All you have to is read through the reviews to see how beloved this series is. The entire cast is just incredible. I think most people thought when Andy Whitfield tragically died and they had to recast the role of Spartacus that it would drop in quality. It didn't! As good as Whitfield was, Liam McIntyre stepped in and was just as good. Now Spartacus: Gods of the Arena was the prequel before Spartacus. It has most of the cast outside Spartacus himself and the story is fantastic. It will grab your attention from the first episode and hold it throughout the series. If you haven't seen this amazing show yet stop what you're doing right is and go watch it!"
    },
    {
      "username": "samyoung-82648",
      "userUrl": "https://www.imdb.com/user/ur68134398",
      "reviewLink": "https://www.imdb.com/review/rw7886134",
      "warningSpoilers": false,
      "date": "21 February 2022",
      "rate": "8",
      "helpful": "19 out of 20 found this helpful.",
      "title": "Better than Blood and Sand",
      "content": "You can tell this was made after Season 1 of Spartacus: Blood and Sand. The acting is even better, the story writing is tighter and there's far less blood and sex and more focus on story.Lucy Lawless and John Hannah steal this series. Their acting is excellent. I also enjoyed Manu Bennett, although I keep seeing Azog the defiler in his performance. The newest and best performance was also from Jaime Murray who was hard not to love.Whilst this series still had blood and sex, they mostly toned it down and the show was better for it. I also actually enjoyed the fight scenes in this series: I did not enjoy the fights in Blood and Sand.Well done to the creators. It's a shame they didn't get the balance right in Black Sails - which came after this."
    },
    {
      "username": "FeastMode",
      "userUrl": "https://www.imdb.com/user/ur104603847",
      "reviewLink": "https://www.imdb.com/review/rw5065159",
      "warningSpoilers": false,
      "date": "17 August 2019",
      "rate": "8",
      "helpful": "14 out of 15 found this helpful.",
      "title": "best prequel ever?",
      "content": "I was shocked when this prequel season turned out to be amazing. Far from as good as season 1, but very entertaining with lots of connections to the main show, further character development, and some great emotional scenes (about 4 viewings, 5/7/2021)"
    },
    {
      "username": "nicorip22",
      "userUrl": "https://www.imdb.com/user/ur47190847",
      "reviewLink": "https://www.imdb.com/review/rw6234279",
      "warningSpoilers": false,
      "date": "3 November 2020",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "Just excellent",
      "content": "Unfortunately this season they had to do it due to the death of the main actor. I didn't have much faith in this at the time, but it's a very good series. This prequel is at the height of spartacus, excellent fights and a lot of action."
    },
    {
      "username": "guenterfmang",
      "userUrl": "https://www.imdb.com/user/ur85579214",
      "reviewLink": "https://www.imdb.com/review/rw5020781",
      "warningSpoilers": false,
      "date": "26 July 2019",
      "rate": "9",
      "helpful": "17 out of 19 found this helpful.",
      "title": "Blood and Breasts",
      "content": "I really enjoyed this series. It is exciting, sexy and brutal. A series for men ;-)"
    },
    {
      "username": "syrocc2004",
      "userUrl": "https://www.imdb.com/user/ur13713743",
      "reviewLink": "https://www.imdb.com/review/rw2373418",
      "warningSpoilers": false,
      "date": "22 January 2011",
      "rate": "10",
      "helpful": "147 out of 162 found this helpful.",
      "title": "A Brilliant Comeback",
      "content": "I have been waiting for the return of Spartacus: Blood and Sand for quite some time now. Unfortunately, Andy's cancer delayed this for a long time, so Starz gave us Gods of the Arena in stead.All I can say is well done! We are introduced into the same society and atmosphere we were presented in Blood and Sand, but a few years before Spartacus's arrival. Most of the cast from the previous show is back, and the producers did a good job with making them look a bit younger. I will not give out the names, to avoid spoilers, but rest assured, you will not be disappointed by the number of familiar faces.And, most importantly, everything that we've seen in Blood and Sand is here! All the gore, sex, and ruthlessness is back, and boy, I've missed it. Seeing the first episode of the new series, I had a sense of seriousness and ambition throughout the show. There is enough action to keep you entertained, but there are also plenty of sensual scenes and political schemes as well. The cast did a good job, as always, and I did not have the feeling that the actors lost interest since the first season, a thing that happens with lots of shows nowadays. Also, the special effects have gotten a little better, the filming is great too.So, as a bottom line, Starz and it's Spartacus is back, just as strong as the old series, even if Spartacus himself is missing, for now. If you loved the previous show, you will love this too, no doubt, and if you didn't, well, you will start loving it now!"
    },
    {
      "username": "isseyhd",
      "userUrl": "https://www.imdb.com/user/ur129812570",
      "reviewLink": "https://www.imdb.com/review/rw6737204",
      "warningSpoilers": false,
      "date": "24 March 2021",
      "rate": "10",
      "helpful": "15 out of 15 found this helpful.",
      "title": "Your freedom is in your hands!",
      "content": "The harsh history of Rome holds many unsolved mysteries of human destinies. The age of slaves and gladiators offers us a glimpse into the life and mores of a great empire.Today you are the winner, but tomorrow life will trip you up and you are among the slaves. Your life is worthless. You'll be lucky if they buy you out for gladiatorial combat.Time slows down. The first challenge has been thrown at you. Gain recognition from your master in the training camp by defeating your master's gladiator fighters. Get a chance to fight in the arena of the Colosseum. Win the recognition of the crowd and your freedom.The price of freedom is someone's life! The eternal dilemma \"How to preserve humanity, kindness, compassion and love within yourself?\""
    },
    {
      "username": "Jaymuller",
      "userUrl": "https://www.imdb.com/user/ur24573377",
      "reviewLink": "https://www.imdb.com/review/rw2373931",
      "warningSpoilers": false,
      "date": "22 January 2011",
      "rate": "10",
      "helpful": "120 out of 139 found this helpful.",
      "title": "Spartacus: Gods of the Television Industry",
      "content": "By Jupiter's rooster! I'd be willing to wager coin that many a skeptic became a believer upon viewing the premier of \"Spartacus: Gods of the Arena\". From the opening moment to the final credits I could not gaze in another direction. The brilliant writing combined with outstanding performances and great visuals come together to produce what will no doubt become legend. The depiction of a world with honor among slaves and dishonor among their masters is masterful. The portrayal of a world which doesn't require the web or mass media for it's inhabitants to be exposed to every depravity and brutality known to humanity is enthralling. A better adrenaline rush could only be found by those living in such a world. A must see for connoisseurs of sex and violence. Mere mortals could do worse than vowing patronage to \"Spartacus: Gods of the Arena\". Never was a more visceral experience produced by a succession of images on an HD screen combined with surround sound!"
    },
    {
      "username": "ibibrov",
      "userUrl": "https://www.imdb.com/user/ur64593446",
      "reviewLink": "https://www.imdb.com/review/rw5745769",
      "warningSpoilers": false,
      "date": "17 May 2020",
      "rate": "8",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Very pulpy, but Gannicus was badass",
      "content": "Not exactly deep, or smart, but Gannicus was a great character, and made it watchable."
    },
    {
      "username": "dangermous",
      "userUrl": "https://www.imdb.com/user/ur22730281",
      "reviewLink": "https://www.imdb.com/review/rw2382014",
      "warningSpoilers": false,
      "date": "7 February 2011",
      "rate": "10",
      "helpful": "32 out of 42 found this helpful.",
      "title": "better than the first season so far (up to ep 3)",
      "content": "wow. For those who feared this would be a let down without the original lead actor please put such thoughts aside. This prequel seems better than the first season! I'd suggest they have learned some valuable lessons in the first series.The plot is more complex and more gripping than before. The actors play their roles perfectly. I think the direction / camera work has improved slightly as well.The writing / dialogue is outstanding. I was gripped from start to finish. I cant wait for the next episode and to see how this season finishes. I wonder what season 3 will be? is andy better and able to continue? whatever happens I hope it carries on for a long time to come."
    },
    {
      "username": "A_Different_Drummer",
      "userUrl": "https://www.imdb.com/user/ur44112735",
      "reviewLink": "https://www.imdb.com/review/rw3185994",
      "warningSpoilers": false,
      "date": "17 February 2015",
      "rate": "7",
      "helpful": "10 out of 13 found this helpful.",
      "title": "(Superb) - (Star) = Merely Above Average",
      "content": "I wrote a number of individual episode reviews of Blood & Sand. I was frankly blown away, it was not merely some of the best entertainment I had ever seen, it was in a class by itself, a sort of take-no-prisoners approach to TV drama. (Sorry for the bad pun) I spent time with this second season, packaged as a prequel, because of the excellent reviews.I agree ... but I don't.First of all, in my reviews of B&S I did indeed commend the performance of Hannah on multiple occasions. He is superb.But to me this season speaks to the star power of Whitfield. It is generally acknowledged that, if not for his unfortunate circumstances, a career upgrade was in store. He was not merely the star, he was also the draw, the glue, the eyes through the audience learnt to evaluate the story, scene by scene in real time. Every time he approached Hannah and said \"Dominus\" part of the fun was guessing what he really wanted to say,,, That is missing here. The truth hurts. Without Whitfield, you have an above average production. With him, you had a great one."
    },
    {
      "username": "NateS8",
      "userUrl": "https://www.imdb.com/user/ur24823497",
      "reviewLink": "https://www.imdb.com/review/rw2373492",
      "warningSpoilers": false,
      "date": "22 January 2011",
      "rate": "",
      "helpful": "92 out of 108 found this helpful.",
      "title": "Spartacus, without Spartacus?",
      "content": "There were many skeptics leading into this new season (not technically season 2) of \"Spartacus: Gods of the Arena\", many feared it would not be worth watching without Andy Whitfield. For those with concerns, here is some advice: watch it! The major antagonist was lost from the previous season, but the character depth/story of the new leading actor is building AND new depths of past characters from \"Spartacus: Blood and Sand\" are unveiled. The history of how they developed is fascinating. The relationship differences between the two season are significant, thus there is a huge void of curiosity leftover to reveal how they developed to become the personalities they portrayed in season 1.It would be remiss to leave out the absolute, succulent gratuity that peaks our senses! The world is enriched with beautiful people, outstanding wardrobes cast in a time that fascinates most, the Roman Empire. Did I mention that many of these beautiful people are quite revealing? Nudity! It is with taste I might add! Of course, references to porn are made, but no porn has the character depth and sophistication that gives the sexual scenes the passion that is conveyed in this series. The necessity to produce these scenes is important in fostering the time-period's stance of sexual openness. The costume range is great; the rich are adorned with lavish jewelry and a colorful, flowing wardrobe which is artistically chosen, and for the poor, well sometimes they are left with nothing. The gladiators are especially left without much clothing, but the armor they do wear is often demonic, intimidating and everything you would naturally expect to find on a person when they are fighting to the DEATH! The fight scenes are well choreographed and blood is everywhere! The array of weapons to choose from, the differences in fighting styles, the varying levels of fighting skill all make for interesting battles in the arena. Also, bear in mind that the arena is not only for physical fighting, but the political fold is the pressing force behind the fights. Basically, it is more than just a fight, what you see is not entirely what you get. The fight's value is difference for the gladiator, than it is for the crowd, than it is for the owner's of the gladiators; and, these differences are excellently contrasted. The graphics are not top-notch, but it adds a stylistic element to the show. The blood is vibrant and sometimes seems to defy physics--it's great! The acting is intense and the director seems to strive away from being \"natural\" which is good. The intensity is not monochromatic and individual to each characters personality.In a short and sweet summary, this gratuitous mash of beautiful people, fight scenes, political undertones is nothing short of brilliant. Watch it for what it is and you will not be disappointed."
    },
    {
      "username": "kevinjr16",
      "userUrl": "https://www.imdb.com/user/ur9575343",
      "reviewLink": "https://www.imdb.com/review/rw2384721",
      "warningSpoilers": false,
      "date": "13 February 2011",
      "rate": "10",
      "helpful": "37 out of 47 found this helpful.",
      "title": "Wow. Simply Amazing",
      "content": "Wow. I absolutely loved the first season of Spartacus and was so sad to hear of Andy getting cancer. I didn't think the show could continue without him. I was proved wrong by the first ten minutes of Gods of the Arena. The actor portraying Gannicus is instantly likable and I actually like him more than Spartacus. Spartacus is mostly melodramatic while Gannicus is just an egotistical cocky bad ass. By the second episode, the writers do such an excellent job that you actually care deeply for these characters and the horrors they face. Episode 3 went almost too far in the portrayal of the brutality of Rome. I just watched episode 4, and am still reeling at the awesomeness. The writing on this show is completely unrivaled, and they do not ever sacrifice reality for taste. The character development and raw emotion in them is so well portrayed through not only excellent writing, but insanely good acting. I will say that especially this season is not for the faint hearted, but if extreme gore, profanity, nudity, and VERY mature themes are not a problem for you then you simply must watch this show!"
    },
    {
      "username": "pawanpunjabithewriter",
      "userUrl": "https://www.imdb.com/user/ur54077131",
      "reviewLink": "https://www.imdb.com/review/rw7660969",
      "warningSpoilers": false,
      "date": "19 December 2021",
      "rate": "7",
      "helpful": "4 out of 4 found this helpful.",
      "title": "The Rise of Letulus Quintus BATIATUS",
      "content": "Although being the most vicious and malevolent character in the whole series, Quintus Batiatus brings out the best with his stunning, awe-inspiring, bold dialogues and insane temper.In the mini series of Spartacus, to be honest Spartacus Season 2, we see the making of Batiatus as a Lanista. Gods of the Arena falls short if we compare Blood, Loss, Suspense and Avenge with Spartacus: Blood and Sand. It's all Quintus Batiatus show. The making of his wife as a cruel Domina is equally entertaining. Both shadowed the rise of the greatest Gladiator of that time, the legendary Crixus.The making of Doctore and his relationship with the greatest Gladiator of that time, The Spartacus of Gods of the Arena aka Gannicus, is heartfelt.We see all about Batiatus here: his cruelty, lawlessness, reckless crimes, Political ambitions, the love-hate relationship with his father.Had the dialogues not been so magnificent and defying, it would have bored to a good extent in the middle.Give your desire voice, and you shall see it well Satisfied - Quintus Batiatus.All the four seasons of Spartacus have a terrific end, one quite similar to their common dialogue: One not to be forgotten soon!Episode 5 and the climax of each season makes Spartacus stand strong!"
    },
    {
      "username": "reb-warrior",
      "userUrl": "https://www.imdb.com/user/ur24292397",
      "reviewLink": "https://www.imdb.com/review/rw2879470",
      "warningSpoilers": true,
      "date": "1 October 2013",
      "rate": "10",
      "helpful": "7 out of 9 found this helpful.",
      "title": "I ended up liking this mini better than all the Spartacus seasons.",
      "content": "I always did like the Romans better. I found the politics and intrigue of the House far more interesting than the gladiators and the ludus. As in season one, the writing was brilliantly weaved. The main plot is that of Batiatus trying to step out from the shadow of his father to elevate his own name by overcoming his enemies at any cost to ensure the success of the House with his wife's help. His father, friends, slaves, and gladiators get pulled into his and Lucretia's machinations. The back-story to many of the characters we see in season one of Spartacus(Blood and Sand) is told here. You may be surprised to see how different some of the characters were five years earlier.Gannicus is introduced in this mini-series. He ended up being my favorite gladiator out of them all. Lover of wine and women, this guy is just plain fun in a world full gloominess. His personality carries through in the other seasons of Spartacus like a ray of sunshine where everything is so depressing. He's a flawed but basically good person.Batiatus' father treats him like he's incompetent. In some ways Titus is right, and yet it's just not fair the way he treats his son. A younger softer Lucretia isn't really so bad, yet when motivated by something she cares deeply about such as her husband or her dear friend Gaia, her viciousness comes out, though weirdly you kind of get it, but not excuse it. Lucretia and Batiatus truly loved each in other. They'd do anything for each other. Murder is no exception. Twisted, but damn good! These two are my favorites in the entire Spartacus series. I love well written villains.John Hannah and Lucy Lawless commanded the screen with their brilliant portrayals. Lucy Lawless' acting range is impressive. She goes from softness to gradual subtle changes as her character changes into a harder colder person. Kudos to her. Her acting has always been excellent. John Hannah is just as brilliant here as he was in season one. Dustin Clare owned the role of Gannicus. The mini isn't for everyone. Like the series, there is graphic violence(one very disturbing rape scene), sex scenes(straight, gay, and a very hot lesbian scene), and explicit language. It encompasses the same stylized look as the series, and has amazing action. Watch all series as aired by Starz. This is a prequel, not season one. The mini is important to see as events are mentioned in the later seasons. Also the beginning and end gives away the end of Blood and Sand. Watch Blood and Sand first, Gods of the Arena second, Vengeance third, and finally War of the Damned last. I wish there could have been more episodes. I believe there was a missed opportunity for \"The House of Batiatus.\" A TV show based on that would have been wonderful. This little gem of a mini-series came about due to Andy Whitfield's illness. Made to give him time to get better. Sadly, he passed away. I think 'Gods of the Arena' and the rest of the series honored the legacy he left with his brilliant performance in season one.10/10"
    },
    {
      "username": "cell_my_soul",
      "userUrl": "https://www.imdb.com/user/ur22597554",
      "reviewLink": "https://www.imdb.com/review/rw2373932",
      "warningSpoilers": false,
      "date": "22 January 2011",
      "rate": "10",
      "helpful": "70 out of 84 found this helpful.",
      "title": "Excellent!",
      "content": "As all of you probably know this is a prequel to Spartacus: Blood and Sand. I assume it is such because of Andy Whitfield's ongoing battle with cancer. Although harsh sounding as it may be, during the first episode you barely miss him. This is not because of anything other than the fact that it is a prequel and we all hope he will return for future seasons.The episode was well thought out and gives real insight into the beginnings of certain characters from the first season. After waiting for so long (or what seemed like an eternity), I was definitely not disappointed with what looks like is going to be another great season.Definitely do not miss!"
    },
    {
      "username": "horroregg",
      "userUrl": "https://www.imdb.com/user/ur16267685",
      "reviewLink": "https://www.imdb.com/review/rw2388724",
      "warningSpoilers": false,
      "date": "21 February 2011",
      "rate": "9",
      "helpful": "41 out of 54 found this helpful.",
      "title": "Far exceeds expectations",
      "content": "I enjoyed Blood and Sand, but as a guilty pleasure. Outrageous sex and violence, some truly terrible dialogue and dodgy acting from Kiwi accented muscle men. It was fun, but not gripping nor truly addictive.I was happy to sit back and enjoy more of the same, but Gods of the Arena is a major evolution.There's less blood (although still more that any other show, ever) and less sex (likewise) , but far more dastardly pots and intrigue. The dialogue is more Shakespearian and the accents are reigned in. A (small) dose of Deadwood has gone a long way to making this show a cult classic. I hope they keep making these."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw2600295",
      "warningSpoilers": false,
      "date": "21 April 2012",
      "rate": "8",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Bombastic prequel to hit show Spartacus: Blood and Sand",
      "content": "Given that this short, prequel series to SPARTACUS: BLOOD AND SAND was necessitated by star Andy Whitfield's ongoing battle with cancer, I think it does a very good job. In essence, this is a show that sets out the early days of the House of Batiatus that features so prominently in the original series, revealing how the characters played by John Hannah and Lucy Lawless rise to fame.At least half of the cast list is populated by new faces, and most of the fun comes from guessing what's going to happen to them, given that we know they didn't return for the later series. I'll admit that I wasn't too enamoured by Dustin Clare's boastful Gannicus, but the presence of Jaime Murray, Marisa Ramirez and Stephen Lovatt is more than enough to retain the interest. And, of course, there are many old favourites who return, like the characters of Crixus, Oenomaus and Ashur, and we get a chance to see the reasons they turned out like they did in SPARTACUS: BLOOD AND SAND.As in the first season, John Hannah steals the show with his endless plotting and ranting against the gods. He's fantastic here, and I think it's great how the producers were able to get another six episodes of entertainment value out of his character. The action is as stylised and grisly as ever, if not more grisly, and there's enough manipulation, backstabbing, gossip and heartfelt emotion to satisfy any fan of TV drama. Okay, it's not quite as good as BLOOD AND SAND, but that's purely because there are only six episodes to work with here, rather than 13, so they just don't have time to cover as much ground."
    },
    {
      "username": "konrad-40-205915",
      "userUrl": "https://www.imdb.com/user/ur25938797",
      "reviewLink": "https://www.imdb.com/review/rw5956232",
      "warningSpoilers": false,
      "date": "31 July 2020",
      "rate": "9",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Can't get enough of this show.",
      "content": "A very underrated show. Excellent casting that grew into their roles. Great writing and a artistic, gritty, bloody art style that really makes it unique. Very glad I gave it a chance. Sad to see Andy Whitfield die before finishing what I'm sure would have been an epic role he would have grown in, having seen how the story progressed. Took me a while to get used to Liam McIntyre but he made that role his own. Hell, I teared up on his death. A great ending. Slow clap."
    },
    {
      "username": "srinivas_7",
      "userUrl": "https://www.imdb.com/user/ur24919788",
      "reviewLink": "https://www.imdb.com/review/rw2378787",
      "warningSpoilers": false,
      "date": "31 January 2011",
      "rate": "10",
      "helpful": "63 out of 81 found this helpful.",
      "title": "a character worth discussing BATIATUS",
      "content": "guys nobody is recognizing the role of batiatus.....i see no single comment mentioning about him....it is he who played long duration in all the episodes....and with his performance, has brought life to spartacus TV series...he was the one with highest dialogues in the serial, but he never made us feel bored of his role either in blood and sand or gods of the arena....he really showed us a true lanista......i agree that all the actors performed to their best.Anyways its a great entertainer for our period showing us about the lifestyle during the period of gladiators.I really love the politics in this series especially those played by lucretia and batiatus together in both blood and sand and also gods of the arena.....i really bow before the dialogue writer particularly for the phrase 'jupitor's c**k' during the scenes of frustration.."
    },
    {
      "username": "katierobertson-11117",
      "userUrl": "https://www.imdb.com/user/ur69438510",
      "reviewLink": "https://www.imdb.com/review/rw4780441",
      "warningSpoilers": false,
      "date": "14 April 2019",
      "rate": "8",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Historical Blood-Action Drama. Looking back, the best way forward.",
      "content": "Knowing, I was worried about the fate of SPARTACUS. But 'Gods of the Arena' didn't disappoint. We are given further insight into some of our favourite characters with focus on the rise of the Ludas. The quality acting & a story which is delivered at a faster pace enthrals the viewer. It left me wondering - In a room full of villains, is our bad guy just an ambitious man?"
    },
    {
      "username": "mk3825",
      "userUrl": "https://www.imdb.com/user/ur24428942",
      "reviewLink": "https://www.imdb.com/review/rw4906776",
      "warningSpoilers": false,
      "date": "2 June 2019",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Spartacus Rocks",
      "content": "This is a great series. The filming is cool and done in the style of \"300\". It's a shame that the lead actor dies in real life after the first season. He was a great Sparticus, but the actor who replaces him is very good as well. This series has everything I like in a movie; sex, violence, treachery, revenge, and glory. This show also ends well, which has become a concern since Game of Thrones flopped so badly. You will be able to tell from the first episode if you will like this series, or not. I did, and have re-watched at least twice."
    },
    {
      "username": "abdolkarimi1980",
      "userUrl": "https://www.imdb.com/user/ur48308133",
      "reviewLink": "https://www.imdb.com/review/rw6150601",
      "warningSpoilers": false,
      "date": "5 October 2020",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Perfect",
      "content": "One of the best series that must see. Spartacus, the web series revolves around the glory and bravery of a gladiator and tribune of the same name. It portrays the plight of Spartacus under the roman waywardness and his battle to defy his destiny. It has four seasons. The first season displays the life of Spartacus as a free man, his eventual confinement in the stinky life of Ludos as the death of his wife follows. Then it shows his emergence as a gladiator of the arena and successful conspiracy against Batiatis, his master. The second season 'God of the arena' tells the glorious story of Ganicus who was solely capable of defeating the undefeated Theokhalis. The third season 'Vengeance' shows the the rise of Spartacus as a tribune and joing of Ganicus to serve the purpose of Spartacus after which they unitedly defeats Glaber, the sworn enemy of Spartacus. The fourth season 'War of the damned' portrays the final fight of Spartacus against Marcus Caracius and his (Spartacus) fall. Initially Spartacus was a free man who lived peacefully with his wife in a village called Thrace. But in a battle of survival for the romans against the wildings, he along with his other villagers would agree to serve the Roman's cause. But as the romans would win and their leaders would compel Spartacus and his army to get ready for another war, mutiny would break out in which some of the roman soldiers would die and Spartacus and his men would flee. But however destiny had something else saved for him. After the very night he would return to his wife, the romans would discover both of them. Then the Romans would seize a sleeping Saura(his wife) from his bosom who would get condemned to slavery while Spartacus would face a battle of survival in the arena as a retribution to betray the roman cause. However he would survive and would emerge as gladiator in Batiatis's ludos but his wife would be murdered by his master to prevent Spartacus from freedom. The tale then went on chronicling the rise of Spartacus along with Crixus, Omnaeus, Ganicus and their eventual fall in the battle against Carracius. The series precisely and boldly describes an atrocious and remorseless roman empire and the tragedy and helplessness of the poor under its shadow. Moreover, in its aggression, steadiness, display of humiliation of the have-nots the content successfully rouses in audience the thirst for wealthy roman blood. However, in some parts much of violence and nudity spoils the rhythm and flow of the show. These two elements continued to be integral parts of every episode. As far as acting is concerned, Andi Whitfield and Liam Mclutyre both appears to be sharp and deft in the pursuit of Spartacus. Craig Parker also seems very skillful in portraying the fierceness of Glaber. However, Dustin Clare who portrays the character Ganicus,also popularly known as the god of the arena outclasses everyone. In its flamboyance, wisdom and skillfulness the character is made to enthrall every watcher. Even so well Clare played it that in some parts Spartacus's valour seems pale under the vivid spectrum of Ganicus. In short, a nonchalant Ganicus, the man of wine and wish of questionable women, is a poetry in motion for everyone who will watch the show. Among others Simon Merrelles as Carracius, John Hannah's performance as Batiatis are also memorable. Hence, keeping aside the violence and nudity of it, the show is undoubtedly a must watch. So if u are a history-lover, watch Spartacus immediately to witness the historical jolt the man brought to the Roman Empire whose foundation was built on the tragedy and blood of umpteen have-nots."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2989025",
      "warningSpoilers": false,
      "date": "30 March 2014",
      "rate": "8",
      "helpful": "3 out of 4 found this helpful.",
      "title": "Batiatus Fun",
      "content": "This is a prequel to 'Spartacus: Blood and Sand'. With Andy Whitfield sick, the show tries to continue production with the prequel. It struck on a good idea. Anything to bring John Hannah and Lucy Lawless back is a good idea.It's a struggle for dominance between gladiators Gannicus (Dustin Clare) and Crixus (Manu Bennett). Batiatus and Lucretia are as weaselly as ever. It continues the style and substance of the first season. It works just as well as the series. This is very much Batiatus' show at this point. Anybody who saw the first season will love this mini-series."
    }
  ],
  "errorMessage": ""
}