{
  "imDbId": "tt1758429",
  "title": "Spartacus: Gods of the Arena",
  "fullTitle": "Spartacus: Gods of the Arena (TV Series 2011–2011)",
  "type": "TVSeries",
  "year": "2011",
  "language": "en",
  "titleInLanguage": "Spartacus: Gods of the Arena",
  "url": "https://en.wikipedia.org/wiki/Spartacus:_Gods_of_the_Arena",
  "plotShort": {
    "plainText": "Spartacus: Gods of the Arena is a television miniseries broadcast by American cable TV Starz, as a prequel to Spartacus, which premiered January 21, 2011. The series follows the character Gannicus (Dustin Clare), the first gladiator representing Lentulus Batiatus to become Champion of Capua. Cast members and characters reprised from the original series include John Hannah as Batiatus, Lucy Lawless as Lucretia, Peter Mensah as Oenomaus, Nick E. Tarabay as Ashur, Lesley-Ann Brandt as Naevia, Antonio Te Maioha as Barca, and Manu Bennett as Crixus.\r\nThe miniseries aired in Canada on Movie Central and The Movie Network, on Sky1 in the United Kingdom and on FX in Latin America.",
    "html": "<p>Spartacus: Gods of the Arena is a television miniseries broadcast by American cable TV Starz, as a prequel to Spartacus, which premiered January 21, 2011. The series follows the character Gannicus (Dustin Clare), the first gladiator representing Lentulus Batiatus to become Champion of Capua. Cast members and characters reprised from the original series include John Hannah as Batiatus, Lucy Lawless as Lucretia, Peter Mensah as Oenomaus, Nick E. Tarabay as Ashur, Lesley-Ann Brandt as Naevia, Antonio Te Maioha as Barca, and Manu Bennett as Crixus.</p><p>The miniseries aired in Canada on Movie Central and The Movie Network, on Sky1 in the United Kingdom and on FX in Latin America.</p>"
  },
  "plotFull": {
    "plainText": "Spartacus: Gods of the Arena is a television miniseries broadcast by American cable TV Starz, as a prequel to Spartacus, which premiered January 21, 2011. The series follows the character Gannicus (Dustin Clare), the first gladiator representing Lentulus Batiatus to become Champion of Capua. Cast members and characters reprised from the original series include John Hannah as Batiatus, Lucy Lawless as Lucretia, Peter Mensah as Oenomaus, Nick E. Tarabay as Ashur, Lesley-Ann Brandt as Naevia, Antonio Te Maioha as Barca, and Manu Bennett as Crixus.\r\nThe miniseries aired in Canada on Movie Central and The Movie Network, on Sky1 in the United Kingdom and on FX in Latin America.\r\nCast\r\nSlaves\r\nDustin Clare as Gannicus – a Celtic gladiator who is the champion of the Batiatus' ludus.\r\nPeter Mensah as Oenomaus/Doctore – a Numidian gladiator who later becomes the doctore of Batiatus' gladiators.\r\nMarisa Ramirez as Melitta – Lucretia's body slave, the wife of Oenomaus.\r\nManu Bennett as Crixus – a new Gallic gladiatorial recruit.\r\nNick E. Tarabay as Ashur – a new Syrian gladiatorial recruit.\r\nShane Rangi as Dagan – a gladiatorial recruit who speaks only Aramaic, and fellow Syrian to Ashur.\r\nAntonio Te Maioha as Barca – a Carthaginian gladiator.\r\nJosef Brown as Auctus – a gladiator and Barca's lover.\r\nTemuera Morrison as Ulpius/Doctore – Oenomaus' predecessor as the trainer of Batiatus' gladiators.\r\nLesley-Ann Brandt as Naevia – a young house-slave.\r\nJessica Grace Smith as Diona – a house-slave and Naevia's friend who loses her virginity at the whim of Cossutius.\r\nRomans\r\nJohn Hannah as Quintus Lentulus Batiatus – a lanista\r\nLucy Lawless as Lucretia – Batiatus' wife.\r\nJaime Murray as Gaia – a social climber and Lucretia's friend.\r\nCraig Walsh Wrightson as Marcus Decius Solonius – Batiatus' close friend who has aspirations of becoming a lanista himself.\r\nJeffrey Thomas as Titus Lentulus Batiatus – Quintus Batiatus' father and the pater familias of the House of Batiatus.\r\nStephen Lovatt as Tullius – Batiatus' brutal business rival and enemy.\r\nGareth Williams as Vettius – owner of a rival ludus and enemy of Batiatus.\r\nEpisodes\r\nProduction\r\nThe opportunity to produce Gods of the Arena emerged when the second season of Spartacus was halted while lead actor Andy Whitfield battled non-Hodgkin lymphoma. Series creator and executive producer Steven S. DeKnight expanded a single flashback episode for the second season into a six-part mini-series. Production for Gods of the Arena began in New Zealand in August 2010.",
    "html": "<p>Spartacus: Gods of the Arena is a television miniseries broadcast by American cable TV Starz, as a prequel to Spartacus, which premiered January 21, 2011. The series follows the character Gannicus (Dustin Clare), the first gladiator representing Lentulus Batiatus to become Champion of Capua. Cast members and characters reprised from the original series include John Hannah as Batiatus, Lucy Lawless as Lucretia, Peter Mensah as Oenomaus, Nick E. Tarabay as Ashur, Lesley-Ann Brandt as Naevia, Antonio Te Maioha as Barca, and Manu Bennett as Crixus.</p><p>The miniseries aired in Canada on Movie Central and The Movie Network, on Sky1 in the United Kingdom and on FX in Latin America.</p><br/><h3>Cast</h3><p>Slaves</p><ul><li>Dustin Clare as Gannicus – a Celtic gladiator who is the champion of the Batiatus' ludus.</li><li>Peter Mensah as Oenomaus/Doctore – a Numidian gladiator who later becomes the doctore of Batiatus' gladiators.</li><li>Marisa Ramirez as Melitta – Lucretia's body slave, the wife of Oenomaus.</li><li>Manu Bennett as Crixus – a new Gallic gladiatorial recruit.</li><li>Nick E. Tarabay as Ashur – a new Syrian gladiatorial recruit.</li><li>Shane Rangi as Dagan – a gladiatorial recruit who speaks only Aramaic, and fellow Syrian to Ashur.</li><li>Antonio Te Maioha as Barca – a Carthaginian gladiator.</li><li>Josef Brown as Auctus – a gladiator and Barca's lover.</li><li>Temuera Morrison as Ulpius/Doctore – Oenomaus' predecessor as the trainer of Batiatus' gladiators.</li><li>Lesley-Ann Brandt as Naevia – a young house-slave.</li><li>Jessica Grace Smith as Diona – a house-slave and Naevia's friend who loses her virginity at the whim of Cossutius.</li></ul><p>Romans</p><ul><li>John Hannah as Quintus Lentulus Batiatus – a lanista</li><li>Lucy Lawless as Lucretia – Batiatus' wife.</li><li>Jaime Murray as Gaia – a social climber and Lucretia's friend.</li><li>Craig Walsh Wrightson as Marcus Decius Solonius – Batiatus' close friend who has aspirations of becoming a lanista himself.</li><li>Jeffrey Thomas as Titus Lentulus Batiatus – Quintus Batiatus' father and the pater familias of the House of Batiatus.</li><li>Stephen Lovatt as Tullius – Batiatus' brutal business rival and enemy.</li><li>Gareth Williams as Vettius – owner of a rival ludus and enemy of Batiatus.</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#f7b53a;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#f7b53a;width:25%\">Title</th><th scope=\"col\" style=\"background:#f7b53a;width:12%\">Directed by</th><th scope=\"col\" style=\"background:#f7b53a;width:28%\">Written by</th><th scope=\"col\" style=\"background:#f7b53a;width:21%\">Original air date</th><th scope=\"col\" style=\"background:#f7b53a;width:9%\">US viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Past Transgressions\"</td><td style=\"text-align:center\"><span>Jesse Warn</span></td><td style=\"text-align:center\"><span>Steven S. DeKnight</span></td><td style=\"text-align:center\">January 21, 2011</td><td style=\"text-align:center\">1.10</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #f7b53a\">Opening around five years before the arrival of Spartacus, Batiatus finds himself administering his father's <span>ludus</span>, while his father is in <span>Sicily</span> living in semi-retirement. Seeking fame, he (with the support of his old friend Solonius) tries to win favor with a local nobleman, Tullius, by paying 50 dinars for a Gallic slave worth only 10 named Crixus - by noting his potential to be a great fighter. Arriving at the ludus, Crixus soon meets veteran gladiator Oenomaus (who has a slave wife named Melitta), as well as Syrian slave recruits Ashur and Dagan. Meanwhile, Lucretia welcomes the sudden return to Capua of Gaia, a young but recently widowed friend, and \"party girl\" from Rome who is attracted to both the delights of the ludus and of opium. In an attempt to participate in the opening games of the soon to be completed arena, Batiatus selects his most skilled gladiator, Gannicus the Celt, the original champion of the House of Batiatus, for a duel in the marketplace. Unknown to Batiatus, however, is that young Vettius, the owner of a rival ludus, is merely an agent of Tullius -- leading to deadly consequences as he is soon outmaneuvered in his own game. Tullius wishes to purchase Gannicus and when Batiatus refuses the offer, he is savagely beaten.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Missio\"</td><td style=\"text-align:center\"><span>Rick Jacobson</span></td><td style=\"text-align:center\"><span>Maurissa Tancharoen</span> &amp; <span>Jed Whedon</span></td><td style=\"text-align:center\">January 28, 2011</td><td style=\"text-align:center\">1.14</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #f7b53a\">A week has now passed since the murder of his bodyguard and severe beating at the hands of Tullius' men and Batiatus continues to recover. Tullius sends him a message, via Batiatus' good friend Solonius, and offers to double his offer for Gannicus to 400. Batiatus is in no mood to compromise, however, and soon plans his own revenge on Vettius with the aid of the Syrians. Quintillius Varis comes to Capua to select gladiators for his games, but Gaia and Lucretia seemingly bump into him, and offer to have him wait at Batiatus' house -- where Batiatus will seemingly act surprised, but then offer his ludus' services instead. Meanwhile, Doctore is irked when Batiatus criticizes him as his father's man, and names Oenomaus to succeed him. Shamed, he suddenly challenges Oenomaus to a duel, in which Oenomaus eventually kills him and becomes the new Doctore. Meanwhile, inside the ludus, Gannicus (victorious from his bout with Crixus) and Melitta are ordered to have sex for Varis' entertainment, leaving both of them troubled, but with Batiatus succeeding in securing the position of primus for Gannicus in the upcoming games.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Paterfamilias\"</td><td style=\"text-align:center\"><span>Michael Hurst</span></td><td style=\"text-align:center\"><span>Aaron Helbing &amp; Todd Helbing</span></td><td style=\"text-align:center\">February 4, 2011</td><td style=\"text-align:center\">1.26</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #f7b53a\">Batiatus is pleased with himself for having arranged Varis' primus. He and the household are not, however, prepared for the sudden return of the lanista and <span>pater familias</span>, his father, Titus, who treats his son's caretaking skills with disdain. He laughs when he hears that Gannicus will represent the house in the games, and sets out to make amends with Tullius, thereby undermining most of the younger Batiatus' schemes. Titus manages to mend relations with Tullius and follows his terms, to pit his own men against each other in some more honorable afternoon games. While father and son are away, Varis returns to the Batiatus home with a friend, Cossutius, expecting to again experience the pleasures of his previous visit, this time with one of the virgin slave women - Diona. In the arena, Barca's lover Auctus and newcomer Crixus, duel in the arena and the lesser experienced Crixus manages to kill him, thereby earning the mark of the brotherhood. Surprised by his son's newfound gladiator, the father sees some merit in his son's plans and abilities after all, and decides never to leave the ludus again - much to his son's chagrin.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Beneath the Mask\"</td><td style=\"text-align:center\"><span>Brendan Maher</span></td><td style=\"text-align:center\">Seamus Kevin Fahey &amp; Misha Green</td><td style=\"text-align:center\">February 11, 2011</td><td style=\"text-align:center\">1.11</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #f7b53a\">The tensions between the younger and the elder Batiatus continue, particularly in the old arena where the elder continually reminds his son of his place and station. At home, the Roman women are also having difficulty accepting the father's ongoing - and seemingly permanent - presence. When Gaia meets an acquaintance at the market, she introduces him to Lucretia and he immediately comments on the pleasures available at her home. Gaia again sees an opportunity, but the elder Batiatus would never condone such debauchery. His son, however, manages to convince him to leave for <span>Neapolis</span>, ostensibly to purchase new slaves and receive the salt air. Lucretia agrees to proceed, with Solonius as chaperone, and the night seems to go well, until the unexpected arrival of Tullius, who wishes to fight Gannicus - a duel the gladiator is ordered to lose. Recovering from his wounds, Gannicus is, however, able to share an intimate moment with Melitta. During their liaison, Gaia underestimates Tullius and she dies at his hand. The sudden return of the Batiatus' father simply make matters worse yet again, particularly for Lucretia.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Reckoning\"</td><td style=\"text-align:center\"><span>John Fawcett</span></td><td style=\"text-align:center\"><span>Brent Fletcher</span></td><td style=\"text-align:center\">February 18, 2011</td><td style=\"text-align:center\">1.38</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #f7b53a\">In the wake of Gaia's death, Batiatus senior resolves to cleanse the house of her presence. In responding to his father's ultimatum that he choose between his home and his wife, Batiatus attempts to gain time is not appreciated by Lucretia who believes she would have him leave. She also has her own solution to her husband's desire for a son - via a liaison with Gallic virility in the form of Crixus. Meanwhile, Titus announces a tournament to determine the worth of the new men that make up half his stable of gladiators, with the losers to be sent to the mines. Tullius again visits the ludus, still seeking Gannicus while offering preferential matches in the new arena. Meanwhile, Melitta and Gannicus increasingly desire after one another, but Gannicus, sensing despair, deliberately lowers his guard allowing Crixus to win and sealing his sale to Tullius. Titus, weakened and now bedridden by the ongoing poisonings of Lucretia, finds himself at her mercy when the others leave seeking medicine. He is finally silenced by the honeyed-wine given to him by Tullius but poisoned by her - and, perhaps deliberately, so is Melitta. Quintus and Doctore return, and begin to mourn the dead.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Bitter End\"</td><td style=\"text-align:center\">Rick Jacobson</td><td style=\"text-align:center\">Steven S. DeKnight</td><td style=\"text-align:center\">February 25, 2011</td><td style=\"text-align:center\">1.72</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #f7b53a\">Batiatus now seeks vengeance against Tullius for all that has befallen him, including the death of his father. Gannicus pushes Batiatus to complete his sale to Tullius so that he may seek revenge for the House of Batiatus by killing Tullius himself, but Solonius counsels caution and a more sensible, if final, solution. Meanwhile, Naevia replaces Melitta as the personal body-slave to Lucretia, who promises her that no man will ever touch her as happened to Diona. In the end, Tullius and Vettius both fall into the trap - Tullius is bricked into the foundations of the new arena, and at the opening of the new Capua arena, Vettius informs of the sale of his ludus to Solonius and departs for Antioch. Batiatus now has a new rival, his former friend whom he has distanced by his continual rebukes, and one willing to use his own methods against him. The opening games begin with the execution of captured fugitives (including Diona), and after winning the final mass night-battle of the opening ceremony, Gannicus (at Solonius' suggestion) receives his freedom from the magistrate. He soon departs the ludus - but not before entrusting his champion necklace to Crixus.</td></tr></tbody></table><br/><h3>Production</h3><p>The opportunity to produce Gods of the Arena emerged when the second season of Spartacus was halted while lead actor Andy Whitfield battled non-Hodgkin lymphoma. Series creator and executive producer Steven S. DeKnight expanded a single flashback episode for the second season into a six-part mini-series. Production for Gods of the Arena began in New Zealand in August 2010.</p><br/>"
  },
  "errorMessage": ""
}