{
  "imDbId": "tt7278862",
  "title": "My Brilliant Friend",
  "fullTitle": "My Brilliant Friend (TV Series 2018– )",
  "type": "TVSeries",
  "year": "2018",
  "items": [
    {
      "username": "nikthefreak",
      "userUrl": "https://www.imdb.com/user/ur114605415",
      "reviewLink": "https://www.imdb.com/review/rw5950627",
      "warningSpoilers": false,
      "date": "29 July 2020",
      "rate": "10",
      "helpful": "38 out of 40 found this helpful.",
      "title": "Top ten series of all time",
      "content": "There are no words to describe this gem. This series hits you deeply in your heart like no other. So many authentic feelings,i was deeply moved. I've never seen such intensity,duration,acting,adaptation even in the old gems of Roberto Rossellini and Vittorio De sica.A million thanks to the producers,the exceptional director Saverio Costanzo and director Alice Rohrwacher,the two unbelievable little girls/protagonists (i think Ludovica Nasti and Elisa del Genio),the two again unbelievable main protagonists Margherita Mazzucco and Gaia Girace,of course Elena Ferrante, and to all the crew and members of this magnificent accomplishment."
    },
    {
      "username": "shellcleo",
      "userUrl": "https://www.imdb.com/user/ur69437945",
      "reviewLink": "https://www.imdb.com/review/rw4495691",
      "warningSpoilers": false,
      "date": "5 December 2018",
      "rate": "10",
      "helpful": "89 out of 96 found this helpful.",
      "title": "Incredible",
      "content": "From the first episode I was hooked. Definitely one of the best series I have ever watched.Highly recommend it to everyone. Now I am reading the 4 books."
    },
    {
      "username": "Holt344",
      "userUrl": "https://www.imdb.com/user/ur80693802",
      "reviewLink": "https://www.imdb.com/review/rw4506065",
      "warningSpoilers": false,
      "date": "11 December 2018",
      "rate": "10",
      "helpful": "41 out of 46 found this helpful.",
      "title": "Remarkable coming of age story, a true Masterpiece",
      "content": "Remarkable coming of age story, very moving and caring. The two main characters are well written and realistic, could have been real people. Going in completely blind only knowing it's an HBO production, I didn't know what to think and I would compare it to Handmaid's Tale but now I see it's too different in a good way. The writing can't get any better, you cared for the characters after only an episode and after eight well written episodes with only important content we have seen a lot. With it being in Italian, the dialogue feels natural and immersive. Everything, every scene is just gorgeous to look at, masterpiece!"
    },
    {
      "username": "mezzaitaliana-89131",
      "userUrl": "https://www.imdb.com/user/ur71170382",
      "reviewLink": "https://www.imdb.com/review/rw4583087",
      "warningSpoilers": false,
      "date": "14 January 2019",
      "rate": "10",
      "helpful": "68 out of 76 found this helpful.",
      "title": "Bellisima",
      "content": "Breathtaking drama, with remarkable attention to detail. Naples never looked so stunning. The central performances, especially Lenu are so captivating to watch. Loved it!"
    },
    {
      "username": "tmb-79345",
      "userUrl": "https://www.imdb.com/user/ur69101675",
      "reviewLink": "https://www.imdb.com/review/rw5774105",
      "warningSpoilers": false,
      "date": "26 May 2020",
      "rate": "10",
      "helpful": "52 out of 53 found this helpful.",
      "title": "Ignore all bad reviews....this is",
      "content": "A masterpiece. A big thank you to HBO. When I see comments like \"stale\" or \"ugh\" I actually feel sorry for the reviewers who have become so jaded by bad writing, bad acting, car chases and cgi that they missed the beauty of this story."
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw8046334",
      "warningSpoilers": false,
      "date": "9 April 2022",
      "rate": "9",
      "helpful": "15 out of 16 found this helpful.",
      "title": "Magnificent series",
      "content": "Rewatching season 1 cause I'm behind a fair bit and generally don't watch subtitled cinema but this is so worth it. I remember when one of the episodes came out years ago I had a bad experience with an unprofessional doctor cause of horrible stomach pain and went home to watch this that was an interesting occurrence. Anyway I love the girl that plays Elena she's sublime throughout and that the music is by Max Richter he's brilliant! My Brilliant Friend is a lovely Italy based series by genius writer Elena Ferrante, her creations of writing are worth watching. The cinematography is so good and the relationship between the 2 main girls is astounding!"
    },
    {
      "username": "philipposathina",
      "userUrl": "https://www.imdb.com/user/ur29974849",
      "reviewLink": "https://www.imdb.com/review/rw4525172",
      "warningSpoilers": false,
      "date": "21 December 2018",
      "rate": "10",
      "helpful": "37 out of 42 found this helpful.",
      "title": "A masterpiece!",
      "content": "Such a tender and at the same time cruel story! Well, what would you expect when we are talking of one taking place in times of sheer poverty, as the case almost everywhere in Europe was after the W. W.2, in a place famous for its beauties and notorious for its \"peculiarities\": Naples, Italy! And not just Naples, but a poor suburb of the city, populated in general by hardworking and honest, yet backward -very conservative if you prefer- and sometimes very stubborn and tough people. The story line is developed in a most natural, unpretentious way and everything illustrated in it, characters, situations, setting etc looks as honest as in the classical neorealistic italian films of the 50s. And just as the sentimental power of films like De Sica's \"Il ladro di biciclette\" springs from the pure honesty and truth of the bitter story they tell, so in \"L'amica geniale\" is its truth and honesty that make me often cry watching it, and not any cheap or less cheap dramatic scenes trying to evoke emotion. In other words, its enormous emotional power is due to its honesty and truth, to waking up memories of a past common to a huge number of people just by honestly retelling and reminding it, in other words its tremendous emotional power is something you will find \"between the lines\" so to say, and not to any \"melodrama\" if you see what i mean.For me, a man brought up not too far from the place where the story is being developed, not long after the period this story takes place and in a more quiet and peaceful yet in many other ways not too different environment, - and that is a neighborhood in Piraeus, Greece,- my identification with the characters of the story is inevitable, hence the shocks of emotion it makes me feel . After all, the name of the main character is Greco! Helena Greco. Let alone the place itself which \"feels\" by history and name as greek as it gets! Napoli-Neapoli =Newcity!"
    },
    {
      "username": "gettysburgrich",
      "userUrl": "https://www.imdb.com/user/ur44384318",
      "reviewLink": "https://www.imdb.com/review/rw4508616",
      "warningSpoilers": false,
      "date": "13 December 2018",
      "rate": "10",
      "helpful": "32 out of 36 found this helpful.",
      "title": "A very special and unique series not to be missed!!!",
      "content": "Thank you HBO for bringing this series to the USA and going ahead with the second season. Not since the epic Italian classics of the 1960s has life in Italy been brought to the screen with such beauty and characters. All four of the lead girls are fantastic.. As an Italian American it is great to see a slice of life non shoot em up mafia series.. viva hbo please plug it more in your ads. richard"
    },
    {
      "username": "DagRos",
      "userUrl": "https://www.imdb.com/user/ur90308370",
      "reviewLink": "https://www.imdb.com/review/rw5551136",
      "warningSpoilers": false,
      "date": "14 March 2020",
      "rate": "10",
      "helpful": "20 out of 22 found this helpful.",
      "title": "Masterclass one of the best TV series ever",
      "content": "This is one of the best shows I have ever experienced. It takes place in Naples Italy from the early 1950s and onwards following the lives of two best friends Lili and Elena as they progress in their lives. The storyline is gripping and captivating. The characters are so interesting authentic yet complex and nuanced. The rendition of Italy in the 50s and 60s is so fantastic. Attention to all details is absolutely perfect. This is poetry and on a totally different level in comparison to most other good shows today. This series deserves much much more attention. I am so happy that I found this gem. Do yourself a favour and put this show on top of your list. You will be happy you did, I guarantee! I have seen most of the major series so I know what to compare with ( see my other reviews for a reference) Wow what an excellent series this is! Perfection."
    },
    {
      "username": "csm-78119",
      "userUrl": "https://www.imdb.com/user/ur98341434",
      "reviewLink": "https://www.imdb.com/review/rw6199866",
      "warningSpoilers": false,
      "date": "23 October 2020",
      "rate": "9",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Superb Storytelling",
      "content": "One season in this is a magnificent production that paints an incredibly vivid portrait of the lives of two girls from their early childhood in post war Naples to their growth into young women. I find it deeply moving in parts. My own mother grew up as one of three children in a poor family in the north of England during this era and whilst local gangsters were less of an issue!, the abject poverty and complete lack of opportunity for working class people, particularly women, resonates completely. She was the brightest in her class but her only option on leaving school was the local slipper factory. Most people under 40 don't realise how bad it was back then. Very few films or tv series have showcased the importance of education as strikingly as this series does and it's a reminder that we all need at a time when governments across the world are pricing the current generations out of education once again. That this piece works so well is obviously partly due to the brilliant writing but it is brought to life by four stunning performances from the 4 young actresses who play Elena and Lila as children and young women. Margherita Mazzucco just about edges it - she can convey the equivalent of a paragraph of verse via a particular look and a couple of words, but all 4 are exceptional. Dora Romano is also fabulous as the teacher who is desperate to help the girls fulfil their potential and who reminded me of a great teacher that I had who saw some potential in a boy in her class. There isn't really a weak link in the wider cast either. You really get invested in all the characters and yearn for Elena and Lila in particular to escape to a place where they can flourish. The stunning cinematography is also worthy of high praise here. There is a scene where Elena rides a bus through Naples and you really believe you are there in the 1950's and the scenes in Ischia are breathtaking. Finally, it's all accompanied by a fabulous score from Max Richter. In short, this is one of the most promising tv series of recent years and I just hope that it keeps up this great high standard."
    },
    {
      "username": "bobotn-15209",
      "userUrl": "https://www.imdb.com/user/ur66034265",
      "reviewLink": "https://www.imdb.com/review/rw4482502",
      "warningSpoilers": false,
      "date": "27 November 2018",
      "rate": "10",
      "helpful": "62 out of 67 found this helpful.",
      "title": "Mesmerizing!",
      "content": "After watching the first four episodes, I can't stop thinking about this series. Very engaging and entertaining yet beautifully shot. All the actors are believable, especially the children.While the subtitles are in English, the Italian is like music to your ears. The way the town is filmed brings you into the story even more.Now I want to read the book. And probably rewatch the episodes just to keep track of all the names.This is a lovely, thought provoking series. It's very, very good. Bellissimo!!"
    },
    {
      "username": "dakjets",
      "userUrl": "https://www.imdb.com/user/ur61303974",
      "reviewLink": "https://www.imdb.com/review/rw7727547",
      "warningSpoilers": false,
      "date": "6 January 2022",
      "rate": "9",
      "helpful": "17 out of 19 found this helpful.",
      "title": "Very impressive",
      "content": "For someone who prefers movies to series, it takes a lot for me to start watching a TV series over several seasons. Sometimes I give a TV series a try. I started watching My brilliant friend, and now I'm hooked. I am very impressed with this engaging and gripping chronicle. First of all, the story is unique and very dramatic. The casing is perfect, and the script is believable and sometimes takes surprising turns. This makes the series extra exciting to follow. There is a lot to be impressed by here. The era and the environment in which this takes place appear as dark, threatening, but also a narrative as social ties that survive despite many obstacles. HBO, this is very good!"
    },
    {
      "username": "mir21",
      "userUrl": "https://www.imdb.com/user/ur117410199",
      "reviewLink": "https://www.imdb.com/review/rw6049873",
      "warningSpoilers": false,
      "date": "31 August 2020",
      "rate": "10",
      "helpful": "14 out of 14 found this helpful.",
      "title": "Truly Brilliant",
      "content": "This show is both heart-warming and tragic. I recommend everyone to watch it!"
    },
    {
      "username": "alinedsfrost",
      "userUrl": "https://www.imdb.com/user/ur89213968",
      "reviewLink": "https://www.imdb.com/review/rw4470091",
      "warningSpoilers": false,
      "date": "20 November 2018",
      "rate": "10",
      "helpful": "91 out of 99 found this helpful.",
      "title": "perfect",
      "content": "They understood the source material. Acting and mood also impecable"
    },
    {
      "username": "prashant-63677",
      "userUrl": "https://www.imdb.com/user/ur102201985",
      "reviewLink": "https://www.imdb.com/review/rw6656296",
      "warningSpoilers": false,
      "date": "3 March 2021",
      "rate": "8",
      "helpful": "16 out of 18 found this helpful.",
      "title": "Engrossing.",
      "content": "Its not a tv series, its a saga. It will keep you engrossed & each character will become your personal concern. Very well made & source material is of high calibre. Must watch tv series in my opinion."
    },
    {
      "username": "ruthspiteri",
      "userUrl": "https://www.imdb.com/user/ur107877871",
      "reviewLink": "https://www.imdb.com/review/rw6056523",
      "warningSpoilers": false,
      "date": "2 September 2020",
      "rate": "9",
      "helpful": "17 out of 18 found this helpful.",
      "title": "A great series about so much more than friendship.",
      "content": "Don't be put off by the foreign language, it's a must see.For one thing, this series is beautifully shot in the backdrop of the 1950s and the changing decades that follow. Every detail of those eras is done just right.And second, this series is about so much more than friendship. In fact some might hesitate to call it a friendship. Elena Ferrante's writing is interwoven beautifully into the series to portray the secret thoughts about relationships that people don't dare say out loud.It is also about poverty, emancipation of not just women but of everyone. It's about crime, the Camorra mafia. And it portrays the mafia in a very different but real light. And finally, it is about changing times."
    },
    {
      "username": "aj_eva",
      "userUrl": "https://www.imdb.com/user/ur81928595",
      "reviewLink": "https://www.imdb.com/review/rw5715573",
      "warningSpoilers": false,
      "date": "7 May 2020",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "A true work of art",
      "content": "A masterful portrayal of the lives of two young girls growing to adulthood in the South of Italy. Captivating performances from a truly talented cast, brilliant writing and full of heart and heartache. Can not wait for season 3."
    },
    {
      "username": "chrisphelps-08185",
      "userUrl": "https://www.imdb.com/user/ur71038936",
      "reviewLink": "https://www.imdb.com/review/rw5722825",
      "warningSpoilers": false,
      "date": "9 May 2020",
      "rate": "10",
      "helpful": "13 out of 13 found this helpful.",
      "title": "HBO perfection",
      "content": "We know what HBO is capable of. Sopranos still reigns as #1 in TV land. They can't even beat their own benchmark with their other hit shows. Perfect show. Perfect story. Perfect characters. Flawless production value. Not a single moment where you say \"wait what? i dunno about this show\"I won't keep going and talk about the plot or setting or whatever. No need to mention the books. It is a show. Watch it. Another HBO classic. 10 out of 10. it goes to 11"
    },
    {
      "username": "ellipseanostalrius",
      "userUrl": "https://www.imdb.com/user/ur143161729",
      "reviewLink": "https://www.imdb.com/review/rw7929821",
      "warningSpoilers": false,
      "date": "8 March 2022",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "What can I say",
      "content": "I think in every artform that I examine, I'm looking for the artist to tell me a story. Tell me something. Explain it to me. I want to live in a story.My Brilliant Friend is an example of high art. It is what I am always seeking in art and rarely discover to my satisfaction. Freeze any shot and it is a postcard from a time and a place I never knew. Every sequence is furthering a story I want to hear. Tell me about these people, let me see them. Explain to me this time and place.I feel immersed. Buried deep in the lives of these people. I feel I am there. In a way, it's both frightening and exhilarating.Beautiful."
    },
    {
      "username": "ical-rox",
      "userUrl": "https://www.imdb.com/user/ur22870560",
      "reviewLink": "https://www.imdb.com/review/rw4528606",
      "warningSpoilers": false,
      "date": "23 December 2018",
      "rate": "10",
      "helpful": "60 out of 64 found this helpful.",
      "title": "Stunning.",
      "content": "I have just finished season 1 and I loved it. It absolutely has the feel and pathos of neo-realism. All the despair, rage, and violence of post-war Italy is there that Rossellini, Di Seca and Fellini brought to their work. Every aspect of the production, the sets, the casting, the particular method of acting, the direction, gives the sense that it was filmed 60-70 years ago. The difference is that it's focus is on the inner lives of women, although the men play heavily in it as well. Because I love Italian neo-realism, I was enraptured by it. Because the story is about girls and their transformation into women under oppressive and desperate circumstances, I am all in."
    },
    {
      "username": "pinapuna",
      "userUrl": "https://www.imdb.com/user/ur64480266",
      "reviewLink": "https://www.imdb.com/review/rw4541734",
      "warningSpoilers": false,
      "date": "28 December 2018",
      "rate": "10",
      "helpful": "162 out of 168 found this helpful.",
      "title": "Awesome - the best",
      "content": "This was one of the best things I have watched on HBO in a long time. So special - I couldn't get enough and was so sad when it was over. In an age when everyone is making super hero and action movies, this is so refreshing and brilliant. The characters are so well developed and almost haunting. The settings so pure and simple that it is genius. This is real storytelling at it's finest."
    },
    {
      "username": "wg123456789",
      "userUrl": "https://www.imdb.com/user/ur6949593",
      "reviewLink": "https://www.imdb.com/review/rw5713931",
      "warningSpoilers": false,
      "date": "6 May 2020",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "An Italian Masterpiece",
      "content": "A truly stunning series! The acting, the direction, the photography, the sets, the music, even that it was not dubbed into English meant we got to hear that beautiful lyrical Italian language flow and weave the story into our senses."
    },
    {
      "username": "pvbklyn",
      "userUrl": "https://www.imdb.com/user/ur3837125",
      "reviewLink": "https://www.imdb.com/review/rw5444898",
      "warningSpoilers": false,
      "date": "29 January 2020",
      "rate": "10",
      "helpful": "16 out of 18 found this helpful.",
      "title": "Is there a word beyond \"brilliant\" to describe this series?",
      "content": "How on earth did I miss this series when it first came out in 2018? Shame on me. I had never read Elena Ferrante. And now I am pleased to be doing so going forward. I'm getting all her books because I know now that I will be deeply saddened when I finish the series tonight. The story. The setting. I happened to be in Naples in 1965 and what I recall was how impoverished it was then. A main street would be paved while all the adjoining streets were dirt. So I imagine it was worse in the fifties. The casting could not have been better. What beautiful faces. The children. The teens. The acting, the direction, the camera work. It is by far the most stirring filmed work I have seen since the Italian neo-realism post WWII. I've read a number of Italian authors over the years and seen a number of Italian films and they just have this way of going right to the heart of the matter. There is not just sadness and disappointment, corruption and violence but also a joy in being alive and being able to survive for better things. This series gives you its all and it should not be missed."
    },
    {
      "username": "c1ara",
      "userUrl": "https://www.imdb.com/user/ur120591483",
      "reviewLink": "https://www.imdb.com/review/rw8019248",
      "warningSpoilers": false,
      "date": "30 March 2022",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "THIS IS SO GOOD IM CRYING",
      "content": "So I just started watching season three and I don't have time to write a full review now, because it's currently 00:05, but I just have to say that this is the best series in existence! It's so real and painful, but also beautiful. This is the reality of the 1950s, it wasn't just dance and music. It was a hard time, especially for women.I'll finish this later.It's been seven months and I still haven't edited this review, so maybe it's time for that now.'My brilliant friend' is about two friends who are complete opposites. They met when they were only kids and you could already tell that one acts with the heart, while the other acts with the head. When they grow up their lives are also opposites. While Elena gets the chance to go to college and study what her heart desires, Lila immediately gets married and lives a wealthy life. Sadly, her luck is only temporary and she continues to live a life full of obstacles. I feel like Lila and Lenu's luck alternate. When one is happy, the other is not, and when the other is happy, there happens something bad to the first one again. They also grow apart when something new happens in their lives, but they keep finding eachother again and realise they always will. I think everything about this is literally perfect. They handle so many social issues, but above all this is a story of friendship. A friendship that is strong enough to overcome everything.I recommend this to the whole worldwide population. I watched this with my parents and my little brother and we all enjoyed it. No matter your gender or age, you'll definitely love it. 'My brilliant friend' is a brilliant series."
    },
    {
      "username": "susemaher",
      "userUrl": "https://www.imdb.com/user/ur117738697",
      "reviewLink": "https://www.imdb.com/review/rw5901862",
      "warningSpoilers": false,
      "date": "12 July 2020",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Highly affecting",
      "content": "Exquisite on all levels. A Masterful portrayal of two women, both outsiders from an early age to the environment in which they were born. In spite of having very different personalities, both reflected deeply on the mores of their community, rejecting them in their own way within the restraints imposed upon each by family. Themes of Love, infatuation and their consequences were sensitively and realistically conveyed. Other themes such as nature v's nurture, the lack of opportunities for women in the 50's, verbal and physical abuse within family units were balanced by poignantly beautiful moments. All aspects of these girl's lives were woven seamlessly to portray the beauty, sadness, madness and elation that emerged from their having to make different choices ( by virtue of their personalities) to those of their peers during that era. The directing, acting, scenery and recreation of the 50's in Naples was faultless in my eyes. The music score was moving and when accompanied by photographs at the start of each episode, depicting various scenes from the girls lives , it caused my heart to break with nostalgia... for them."
    }
  ],
  "errorMessage": ""
}