{
  "imDbId": "tt0278238",
  "title": "Samurai Jack",
  "fullTitle": "Samurai Jack (TV Series 2001–2017)",
  "type": "TVSeries",
  "year": "2001",
  "items": [
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2261218",
      "warningSpoilers": false,
      "date": "8 June 2010",
      "rate": "10",
      "helpful": "56 out of 60 found this helpful.",
      "title": "Superb!",
      "content": "When I was first introduced to this show, I wasn't expecting to love it. I don't just love it, I adore it! I feared it wouldn't be my thing, but there are many reasons why Samurai Jack is worth seeing. The animation consistently is absolutely outstanding, the whole show is amazing to watch, whether it is the backgrounds, character features, special effects or the colours. The music is wonderful also, a perfect mix of oriental and electronic sounds really add to the authenticity. The story lines are superb and interesting springing from a great idea, and the writing is top notch, funny and intelligent. Likewise with the voice acting, with Phil LaMarr especially impressive in the title role. Overall, just a superb show, easily one of the better shows on Cartoon Network. 10/10 Bethany Cox"
    },
    {
      "username": "pip-7",
      "userUrl": "https://www.imdb.com/user/ur0095638",
      "reviewLink": "https://www.imdb.com/review/rw1002361",
      "warningSpoilers": false,
      "date": "19 January 2005",
      "rate": "10",
      "helpful": "140 out of 146 found this helpful.",
      "title": "A Truly Cinematic Cartoon",
      "content": "A few years prior to this day, I had yet to take a single glimpse on Samurai Jack. For some time, I heard people raving about its outstanding animation techniques, never seen before fighting sequences and humor. Curiosity and anxiety surrounded my mind, wondering if it really reached or even surpassed the standards set by Dexter's Laboratory and The Powerpuff Girls. Incidentally, Genndy Tartakovsky, the creator of this new show, has worked on the previous two before and based on my knowledge, his vision upon the animation industry is pretty unlike anything any other animators have seen before.Not long after its first run, I managed to witness an episode of Samurai Jack on Cartoon Network in my aunt's house. In fact, in my first viewpoint, the show really seemed a bit simplistic, focused more on battles and at some points, a sense of humor to keep the audience's interest. Yes, it bears similarity to other Genndy's older works. However, I'm just talking to one of the episodes shown on the channel. Initially, the similarity ended when I began to watch the rest of the episodes.The plot itself is quite simple: Samurai Jack (his original Japanese name remains a mystery) lives in ancient Japan where his homeland is being ravaged by a mightily powerful but weird-looking, sometimes insipid demon named Aku. Jack used his mystical sword to fight him and eventually he defeats him after a few bouts. But before Jack manages to destroy the demon once and for all, Aku casts a spell that sends Jack into the future, a time when Aku reigns supreme. Now, it is up to Jack to find a way to go back into the past by wandering around the futuristic cities, barren wastelands and ancient ruins inhabited by aliens and other bizarre creatures you haven't seen before and most importantly, meeting allies and friends (like the crazed muscular Scotsman) to give our struggling hero spiritual hope and motivation to reach his destiny (the maturity of Jack can be seen throughout the seasons, as he seems to be more confident and has the right to call himself 'The Legendary Samurai'. Something like that). The character designs and the environments are extremely odd in Genndy's favor but perhaps these are the reasons why Samurai Jack is such an appealing show to watch at. Firstly, unlike the typical Saturday cartoons we usually see, it is almost an ambiguous cartoon with really abstract elements (specially when you watch a peculiar episode for the first time ever). You have absolutely no idea what is going on there: the creatures, the aliens, the bizarre skyscrapers, the contraptions. They are all refreshingly cubic and bizarre and yet have a reason for their existence. Despite its subtle and uneven premise, Samurai Jack is simply a straightforward action show with easily identifiable objects (toon experts will know that for sure) and characters (its basic concept is mostly derived from the Star Wars universe, in which Genndy also directs under the name Clone Wars). At one case, some of the elements of Samurai Jack are derived from Akira Kurosawa's movies, anime (both state-of-the-art or cliché) and on another point, famous American icons and world cultures. Some even serve as a precursor to Craig McCracken's Foster's Home for Imaginary Friends with bits and pieces from Dexter's Lab and PPG. Sure, most of the episodes don't capture the scope of full-length movies but the slowness of its nature allows the audience to accept the fact that it almost feels like a movie, in a shorter form at least. If you ask whether the show's appropriate for kids, well, Samurai Jack is a surprisingly violent cartoon (that's beyond the boundary of Dex and PPG) but that otherwise proves that Genndy's skills to handle a particular context has matured.What really fascinate me are Genndy's abilities to master the essential film-making techniques such as pace, flow, mise-en-scene and mood, smooth animation and most importantly, character appeal such as Samurai Jack himself. Some sequences are even squeezed in to a particular ratio aspect to provide a cinematic point of view as well as to increase the tension of a situation. Creative editing techniques also helps to build anticipation, fasten the pace of the action sequences (mostly beautifully choreographed despite the fact that they are just frames of drawings!) and create decisive matters as Jack faces frequent pandemonium. The artwork of the show is equally impressive albeit a bit kiddy oriented. That essentially leads to one of Genndy's strongest trademarks and principles: simplistic designs tend to have greater impact compared to realistic models (of 2D and 3D) by conveying constant exaggeration, ridiculous laws of physic and common sense and doses of good slapstick humor while maintaining its 'logical sense' without losing direction. The show's crystal clear colors and tones also manage to reflect the overall mood of a particular environment, whether you can feel the serenity of ancient Japan or the unknown danger of the dark and barren wasteland.If it weren't for Genndy, cartoons cannot evolve into newer forms. If Gene Deitch gave birth to 'limited animation' via Gerald McBoing Boing, we all could say that, in my opinion, Genndy Tartakovsky gave birth to 'cinematic limited cartoons' or simply, 'Cinematic Toons'. I know these terms don't sound right to some people but through Samurai Jack, he has created something that proves to be revolutionary since the era of the Renaissance (Batman, DuckTales and Tiny Toons). Since then, Genndy Tartakovsky is now regarded as one of my most favorite 'heroes' of our time!"
    },
    {
      "username": "Figaro-8",
      "userUrl": "https://www.imdb.com/user/ur0674524",
      "reviewLink": "https://www.imdb.com/review/rw0795280",
      "warningSpoilers": false,
      "date": "10 August 2001",
      "rate": "",
      "helpful": "73 out of 79 found this helpful.",
      "title": "A brilliant production on every level.",
      "content": "It seems that Genndy Tartakovsky was only getting warmed up with \"Dexter's Laboratory\" and \"Powerpuff Girls\". With those shows he proved he was a comic genius; with \"Samurai Jack\" he demonstrates that he is a genius, period. Every single aspect of the movie premiere is top-notch. Phil LaMarr is wonderful as Jack. James Venable's score beautifully captures the tone and has just the right mix of traditional Oriental and electronic sounds. I liked the fact that there did not seem to be any unnecessary dialogue (in fact several scenes--most notably the beginning--have almost no dialogue at all). The animation and backgrounds are very stylish and striking, and the filmmakers even allow the art to escape the confines of the square 1.33:1 TV ratio with some split-screen and widescreen shots used to great effect. It is my hope that the series continues to be as good as the premiere is. This will be on you \"must-watch\" list."
    },
    {
      "username": "zleverton",
      "userUrl": "https://www.imdb.com/user/ur3435595",
      "reviewLink": "https://www.imdb.com/review/rw1604587",
      "warningSpoilers": false,
      "date": "21 February 2007",
      "rate": "10",
      "helpful": "63 out of 67 found this helpful.",
      "title": "Long Ago In A Distant Land...",
      "content": "Samurai Jack is the quintessence of cartoon storytelling today. there is no two-ways about it. let me break it down for you: Long ago in a distant land, Aku, the shape-shifting master of darkness, unleashed an unspeakable evil, but a samurai warrior wielding a magic sword stepped fourth to oppose him. before the final blow was struck, Aku opened a portal in time, flinging the samurai into the future, where Aku's evil is law. now the samurai seeks to return to the past, and undo the future that is Aku.the first story involves the samurai landing in the future, he is given a name by some enthusiastic street-urchins (Jack), and finds himself in a rough bar filled with belligerent aliens and talking dogs. these dogs are in desperate peril, and seek jack's help in a very obvious reference to Akira Kurosowa's masterpiece The Seven Samurai.as the series continues, Jack's quest becomes less a focal point of the story, and more a vehicle for various short stories. great storytelling needs but three things: a setting, a protagonist, and a goal. Jack uses this idea to exploit a formula of diversity. anything the animator/writers throw on the wall, generally sticks. the ambiguity of the show allows for a free-form format that has made shows like Cowboy Bebop and Justice League Unlimited fellow masterpieces of the serial animation format. stories range from horror, science fiction and fantasy, to comedy, Wu shu, drama, noir, giant robo and epic action. Jack is a child of a lot of inspiration, things like Star Wars and Akira Kurosowa are obvious influences, but the works of Marvel and DC comics, as well as the work of graphic novelist Frank Miller are all very apparent references. (infact Miller's acclaimed graphic novel Ronin is very similar in plot to Samurai Jack, and there is an entire episode based upon the premise of 300, another Miller book which has also become a Hollywood film.)Jack is, by all means, an action show. in a given show there is maybe 10-15 minutes of action in a 24 minute episode, however in later seasons, the formula of Jack as an action show recedes heavily, and the show becomes more of a sampler-plate of creativeness. the stories are as charming and moving as they are diverse and epic.Samurai Jack is a brilliant show, it's influences are long-spread and it will undoubtedly be remembered as a staple of artistic television."
    },
    {
      "username": "StayinFrosty",
      "userUrl": "https://www.imdb.com/user/ur3189211",
      "reviewLink": "https://www.imdb.com/review/rw0795306",
      "warningSpoilers": false,
      "date": "12 June 2004",
      "rate": "",
      "helpful": "55 out of 58 found this helpful.",
      "title": "Subtly brilliant",
      "content": "One of the things that sets Jack apart from other animated action series is its use of subtlety. Though full of scenes of intense action, there are also long stretches with no dialogue, using imagery to tell the story. The art direction is excellent. Some viewers find the characters have a strange graphic style but it works well in the context of the strange world where Jack finds himself.I especially like the use of different sizes of wide-screen to aid in the story-telling. A full-frame scene will shift to different ratios of widescreen to emphasize images such as a great distance between two characters or to focus on one's eyes. The series also includes subtle humour (note again, subtlety), such as Jack dressing up as a teenager to infiltrate a rave party or accidentally being transformed into a chicken!Phil LaMarr is excellent as usual as Jack and Mako is the perfect voice for Aku. Those who dismiss it as an anime rip-off should consider the difference between \"rip-off\" and \"inspired by\"."
    },
    {
      "username": "trocoin",
      "userUrl": "https://www.imdb.com/user/ur0727063",
      "reviewLink": "https://www.imdb.com/review/rw0795283",
      "warningSpoilers": false,
      "date": "12 August 2001",
      "rate": "",
      "helpful": "109 out of 116 found this helpful.",
      "title": "A Godsend for American Animation",
      "content": "Samurai Jack has something sorely lacking in American animated entertainment - greatness. Not since the Batman series, or perhaps ever, has a American cartoon flaunted such daring visual bravado, intelligent cinematic storytelling, intense action, and a revolutionary spirit so confidently - it's a warmly welcomed shake-up to the monotonous humdrum continuum of TV animation in this country. Genndy Tartakovsky (creator of Dexter's Laboratory) has captured lightning in a bottle with his latest brainchild, and in doing so has demolished the mold for cartoons both present and future. Indeed, calling this show itself a cartoon seems somehow disrespectful and stereotypical. Here, the freedom allowed by the medium brings the story of Jack and his vendetta against a millenial nemesis named Aku in the far future feverishly to life. Every background, set piece, character, and detail are all strikingly imagined, almost shocking in their originality. The minimalist nature of the animation itself gives the program a unique and powerful vitality, and the abstract and sometimes surreal stylization is unlike anything ever seen in cartoons. Tartakovsky avoids the clunky and often lifeless quagmire of more detailed and lifelike approaches to action animation and instead opts for he intensity and impact of a comic book in motion, and the results are both awesome and beautiful.More than anything else, Samurai Jack truly feels like a work of art, like something that is crafted rather than produced. It's a testament to the fact that animation in the U.S. can be cutting edge, revolutionary, and mature. Truth be told, I haven't been excited about a new television program in quite a while. Time will tell, but Samurai Jack seems destined for masterpiece status - not only here in America, but quite possibly worldwide."
    },
    {
      "username": "ahmedgorshy",
      "userUrl": "https://www.imdb.com/user/ur106582401",
      "reviewLink": "https://www.imdb.com/review/rw6122603",
      "warningSpoilers": false,
      "date": "25 September 2020",
      "rate": "10",
      "helpful": "50 out of 62 found this helpful.",
      "title": "Samurai Jack is better than any fake anime you've ever seen.",
      "content": "Samurai Jack is better than any fake anime you've ever seen. This is one of the most underrated series. Anime makers will never be able to reach the level of Samurai Jack in terms of writing, music, calm atmosphere, wako, and other great factors. This is not an exceptional ending. Samurai jack deserves more support"
    },
    {
      "username": "Rectangular_businessman",
      "userUrl": "https://www.imdb.com/user/ur13538926",
      "reviewLink": "https://www.imdb.com/review/rw2281198",
      "warningSpoilers": true,
      "date": "18 July 2010",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "An excellent series",
      "content": "\"Samurai Jack\" was one of the best shows produced by Cartoon Network, filled with action, comedy and adventure. The story was a bit simple, but incredibly well made: Not many times the battle between of good and evil was handled so well as in this show. The character designs were pretty stylish: Every single one of the characters had a unique and fascinating appearance.This show was created by Genndy Tartakovsky, the creator of \"Dexter's Laboratory\", one of my favorite shows of my childhood. This was just so great as well. Too bad that most the recent shows of Cartoon Network aren't so goo as this one was.10/10"
    },
    {
      "username": "coverme6",
      "userUrl": "https://www.imdb.com/user/ur0666685",
      "reviewLink": "https://www.imdb.com/review/rw0795279",
      "warningSpoilers": false,
      "date": "11 August 2001",
      "rate": "",
      "helpful": "38 out of 50 found this helpful.",
      "title": "If Kurasawa directed a cartoon, SAMURAI JACK would be it",
      "content": "Rich in visual design, and with an dark, gritty atmosphere, SAMURAI JACK is a landmark cartoon in the making. It tells the story of a Japanese warrior with the unlikely name of Jack who undergoes some serious training to take on a ruthless wizard named Aku (which means \"evil\" in Japanese). Filled with hard-edged action (but with no grapic violence, since SAMURAI JACK is a product of the Cartoon Network) and a nifty storyboard that switches from feudal Japan to a BLADE RUNNER-like future, SAMURAI JACK is an animated revevaltion waiting to happen."
    },
    {
      "username": "ericstevenson",
      "userUrl": "https://www.imdb.com/user/ur66601046",
      "reviewLink": "https://www.imdb.com/review/rw3662911",
      "warningSpoilers": false,
      "date": "15 March 2017",
      "rate": "10",
      "helpful": "10 out of 12 found this helpful.",
      "title": "Jack's back!",
      "content": "I remember back when this show first premiered over a decade ago and being swept away by how incredible it was. All I needed to see was the first couple of episodes to get hooked to this show. I think the best thing is probably the animation. I noticed and recalled the animators saying that they flat out omitted the usual black lines and simply show the bare colors. It was a pity this show ended before reaching an actual conclusion...that is until now over a decade later! I am simply overjoyed this show is finally back and there's probably no better time, seeing as how we're in a golden age of animation with this decade.Possibly the most fascinating thing about this show is how epic it is but yet how it manages to be fairly minimal. What I mean is that there's tons of great action scenes to spare and a huge scale of fighting, but yet there's only about two or three characters in the entire show! The main character Jack and his archenemy Aku. That's really all you need to know. Episodes always brought something different to the table with fantastic robot and creature designs. I hadn't even heard of the voice actor Mako before this and am sorry that he passed away before this show continued.It really does have a bit of everything. Some of the episodes seem a bit out of place. A couple don't fit much into the continuity and were more like self parodies. In a show that works wonderfully serious, the more light-hearted stuff works surprisingly well. As someone who watched a lot of \"MadTV\", it was weird for me to not recognize Phil LaMarr's voice. It's so wonderfully graceful. This show is basically just a beautiful montage of wonderful action scenes with perfect atmosphere. It may not have the most characters, but works great with what it has. ****"
    },
    {
      "username": "Mara-Jade-Skywalker-23",
      "userUrl": "https://www.imdb.com/user/ur85693409",
      "reviewLink": "https://www.imdb.com/review/rw4962593",
      "warningSpoilers": false,
      "date": "27 June 2019",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "My Favorite Animated Series",
      "content": "Intro: Samurai Jack was not a show I grew up watching. I didn't start it until after the fifth season. However, just because I wasn't a long time fan, doesn't mean I can't watch the show, and love it for that matter. And when I watched it, it became my favorite animated series of all time.The Story: Samurai Jack centers around a samurai named Jack, who is lost in the future. After the demon Aku, sent him there, after the samurai nearly took his life. In the future, Aku rules all, and Jack had to find his way back to the past, and prevent this timeline.Samurai Jack is one of the most creative shows of all time. From it's meshing of so many different genres, such as, science fiction, fantasy, action, adventure, comedy, and animation. To the original take on the fish out of water story. With interesting characters, surprisingly descent comedy, and entertaining stories.The Characters: I enjoy the characters, all of them are interesting and go through changes, and have their own complete stories.Let's start with Jack. Jack: is the hero of the story, lost in a time he isn't fimiliar with. And it's very easy to mess up this kind of character. However, this show makes him both interesting, and likable. Jack is a man willing to save people, that it's a flaw. Like the time there was a time portal, but if he went in, he wouldn't be able to save someone. So, he ended up saving the monk, and loosing his opportunity to go back.Another flaw is that Jack can often let his anger get to him, when under stress. Which adds an element of relatability. Jack, is one of my favorite protagonists of all time.Although I love Jack, Aku's my favorite character. He's both threatening and hilarious. From the great vocal performance by Mako. To the great screen-presence, Aku is just fun to watch.He's the ruthless dictator of Earth. And man, does he pop off the screen his great design, and of course, performance and writing, as I mentioned before.I love Aku. And he's one of my favorite villains of all time.The Animation: The animation of this series, is simply beautiful to look at. Well drawn, wonderfully rendered, and smooth movements: allowing for great action scenes, and stunning visuals. Look at it, and you'll see exactly what I'm talking about.Conclusion: I don't know what I prefer, Samurai Jack, or Death Note. But it's definitely in my top 3, and basically a perfect television show. There's so much I didn't talk about. But to cut it short, this show's worth watching. I've seen every episode at least 5 times, and I don't regret a thing."
    },
    {
      "username": "benjaminburt",
      "userUrl": "https://www.imdb.com/user/ur73643551",
      "reviewLink": "https://www.imdb.com/review/rw3837082",
      "warningSpoilers": false,
      "date": "20 October 2017",
      "rate": "8",
      "helpful": "16 out of 18 found this helpful.",
      "title": "Gets better further in",
      "content": "Samurai Jack is definitely a classic cartoon, but it has some serious flaws that I think many people are just turning a blind eye to. The first two seasons especially have some very egregious problems, specifically with the animation.In the first two seasons, the animation is especially choppy and stilted. The animators decided to go style-over-substance in many of these early episodes, using changing frame rates, slow-mo, and other stylistic choices hoping to mask the long portions of reaction-shots, very choppy and non-fluid motion, and almost uncanny movements (or lack thereof) by the characters. That is to say nothing of the character design. I think many are ascribing the geometric body shapes and odd proportions undeserved artistic merit, not to mention the uninspired designs for a myriad of villains and aliens. Not to say that the show is artistically bankrupt, but sometimes it seems obvious that it's not trying as hard as it could.The episodic structure is a little grating at times, with some continuity ignored. Some of my least favorite episodes are Jack vs. Mad Jack; Jack, the Woolies, and the Critchellites; Jack Learns to Jump Good; and especially Jack vs. the Five Hunters. They all have some problem that I've mentioned here. So, how could I give all these gripes about a show and still rate it an 8 out of 10? In the third season, the animation gets a significant upgrade, and that also improves the action. I think it was some of those early season 3 episodes where I could really catch the vision of what the creators were trying to do with the show. As I said before, the show is far from artistically bankrupt, and some of the show's best episodes are also from those first two seasons: Jack and the Three Blind Archers; Jack and the Scotsman; Aku's Fairy Tales, among others. The show also had some great comedy. Mako's voice acting (which was probably around 60% of all the voice acting in the show) was tremendous, and the soundtrack was truly superb. I think the show really does hold up as a classic, but there are some errors that are overlooked. Also, season 5 is a beast unto itself, very different from its original run, but inheriting its predecessor's quality."
    },
    {
      "username": "justin-fencsak",
      "userUrl": "https://www.imdb.com/user/ur18723110",
      "reviewLink": "https://www.imdb.com/review/rw7435376",
      "warningSpoilers": false,
      "date": "12 October 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "The best work of Gendy's career.",
      "content": "After the success of Dexter's Lab, Gendy decided to create something more daring. Samurai Jack remains his crowning acheievment, which ran 20 years ago and lasted 4 years until a cliffhanger finale in 2004 that would soon be resolved in 2017."
    },
    {
      "username": "hellraiser7",
      "userUrl": "https://www.imdb.com/user/ur24931284",
      "reviewLink": "https://www.imdb.com/review/rw3205177",
      "warningSpoilers": false,
      "date": "19 March 2015",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Making the Cut",
      "content": "Samurai to my are my second favorite type of warrior, their always fascinating from their swordplay to their philosophies and principles they live by; despite the chaos they deal with somehow they like the sword sheved always remand peaceful or find peace though the chaos.This is another one of my favorite animated shows of all time. In a way it almost is like a shonen anime only it's one made in America which makes it really cool. I'm a person that love martial arts as well as pulp fantasy and sci-fi, this show put both those genres in a blender and they make a very tasty drink.The characters are great despite not deep and are really there to serve their functions they do it very well.Jack is an awesome protagonist he's sort of a pulp hero up there with Doc Savage, Buckaroo Banzai and Doctor Who. He's a bad ass, this guy never says a whole lot, in fact in some episode he sometimes says nothing at all. But that's because he's a man of action, this guy can just cut though the odds and any opponent of any size like butter. He has the fastest and swiftest moves I've seen in any animated character that fights, and their not superpowers but Martial arts techniques which makes it all the better, since superpowers I personal feel is a slightly overused concept. And Phil Lamarr one of my favorite voice actors is great, his voice fits like a glove.Aku is a good fun villain, I like that he is clever, psychotic, and he's kinda funny. Even like Jack's number two that he sometimes runs into The Scottsman. His character is fraking hilarious he has some of the best lines in the show. It's true he's not the brightest bulb and he's kinda crazy but his heart is always in the right place if not his head. The back and forth between Jack and him is great and feels like a functional friendship, it's the buddy cop motif of two people working together despite being on the fence in both persona and ideology. The Scottsman always give Jack at times some unintentional grief and Jack we see at times is just rolling his eyes as he know The Scottsman is pracitally leading him on the road to Hell but he goes with him anyway out of respect. The Scottsman though is also a bad ass, from welding his sword, having almost Hercules like strength, and my favorite feature is his use of his machine gun leg which in a way predates the gun leg in the film \"Grindhouse\" in the \"Planet Terror\" segment.However this is a show that is really style over toping substance, and fully concerned about the ongoing action. Which is cool and that is most of the time what I like in action films/genre, where their just simplistic and straight to the point.Each episode is always a new adventure and it's true it's a bit random which is part of the fun. Just like Doctor Who Jack is just traveling to any period in time from the past to even the far future. It also provides a great sense of creative freedom where it literally feels like you can just put this character anywhere and the show could go any direction it wants which is a great feeling.Music is very good and fits the show, I like the theme song and some of the music which is in the use Japanese old style tune and hip hop; and this show was before the anime \"Samurai Chapaloo\" which is cool and another story.The action is excellent, in a way it's sort of a swashbuckling actioneer. As we see Jack wield his sword and he wields it well, the chirography is great some of it based of some real Bushido. I love that the violence isn't milked down to insult the viewers intelligence you do see the actual slices and kills mainly consisting of a colorful variety of evil robots, which is cool it's reminiscent of the comic book series \"Magnus Robot Fighter\". And the pacing is excellent, each episode despite being only about 20-25 minutes long I hardly noticed the time at all which is a great feeling.The art is excellent, it's sort of a Japanese expressionistic art style which fits for this show. At times they blend in a few other art styles sometimes depending on the episode. This helps create a fun but also kinda surreal and expressive atmosphere.Overall this is a great animated show that is worth unsheathing, Samurai Jack makes the cut.Rating: 4 stars"
    },
    {
      "username": "RoninDeVamas",
      "userUrl": "https://www.imdb.com/user/ur3236569",
      "reviewLink": "https://www.imdb.com/review/rw0795305",
      "warningSpoilers": false,
      "date": "25 March 2004",
      "rate": "8",
      "helpful": "47 out of 58 found this helpful.",
      "title": "The Age of the Samurai has returned...",
      "content": "Samurai Jack is the definition of an action cartoon series. It shows a magnificent samurai, dubbed the name Jack, on a journey to return to the past after he is sent to a dark and unwelcome future run by his archnemesis, the dark shape-shifting wizard Aku. Along the way, he helps restore order to the forsaken wasteland run by evil controllers in often incredibly action-packed, or otherwise hilarious, ways (in one episode, Jack is turned into a rooster and is forced to take part in cock fighting--which is actually legal during that time).Genndy Tartakouvsky is an animation genius, coming out with ideas such as Dexter's Laboratory, The Powerpuff Girls, and the micro-series Star Wars: Clone Wars, which has a second season coming up. The artwork for Samurai Jack is beautiful and the battle scenes are well-thought and brilliantly drawn. The adventures that Jack goes through can be sometimes funny, but still are always action packed. The ideas for Jack's adventures are brilliant as well.Overall: solid storyline, brilliant characters, well-thought adventures, beautiful artwork, and even more brilliant action.Rating: 10 out of 10. This series rocks period."
    },
    {
      "username": "briancham1994",
      "userUrl": "https://www.imdb.com/user/ur5788055",
      "reviewLink": "https://www.imdb.com/review/rw5795863",
      "warningSpoilers": false,
      "date": "3 June 2020",
      "rate": "7",
      "helpful": "6 out of 8 found this helpful.",
      "title": "Excellent style",
      "content": "The visual style of the animation is bold and angular which makes everything feel very harsh. This series has a great blend of old samurai fighting, futuristic setting and evil magic. It is both imaginative and thrilling."
    },
    {
      "username": "Startaud",
      "userUrl": "https://www.imdb.com/user/ur124085989",
      "reviewLink": "https://www.imdb.com/review/rw6077563",
      "warningSpoilers": false,
      "date": "9 September 2020",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "The best cartoon ever made.",
      "content": "Samurai Jack is a masterpiece, through and through. Even if I disagree with some of the show's narrative decisions, especially toward the end, none of that detracts from what this show represents. The feelings that this show produces are unreal; both viscerally and emotionally. One minute it shows you an absurdly well-conceived, well-choreographed fight scene, one that's subtle and refined well above the level of your average cartoon, and the next it will make you experience something deeply felt and immerse you Jack's plight. You just end up wanting so badly to see him finally lay the final blow in the show's outstandingly cruel (and wickedly hilarious) villain Aku and return to his time.No piece of western animation has, in my eyes, matched Samurai Jack's sheer level of immersion, entertainment, and emotional appeal, putting it just ahead of Bojack Horseman, Daria, and Futurama in my eyes."
    },
    {
      "username": "DannyD1997",
      "userUrl": "https://www.imdb.com/user/ur57765841",
      "reviewLink": "https://www.imdb.com/review/rw3664350",
      "warningSpoilers": false,
      "date": "17 March 2017",
      "rate": "10",
      "helpful": "11 out of 14 found this helpful.",
      "title": "Best 2000s animated show ever",
      "content": "I REALLY love Samurai Jack. It is among my MOST favorite animated show from the 2000s. I'm a 2000s kid, and I love this show. I know Genndy's other show Dexter's Laboratory didn't become as funny as it used to be when later Loud House creator Chris Savino took over, but it can still be entertaining. However, Samurai Jack is Genndy Tartakovsky's best show ever. Samurai Jack is absolutely flawless!! It used to be one of Cartoon Network's best shows of all time, NOW it's become Adult Swim's BEST show of all time. Yes, because Adult Swim gave Samurai Jack one more season! Samurai Jack DEFINES Cartoon Network AND Adult Swim. The action sequences were awesome, the animation was awesome, the characters were awesome, everything about Samurai Jack was awesome!! I am so glad Adult Swim is giving Samurai Jack a proper conclusion."
    },
    {
      "username": "rajatdahiyax",
      "userUrl": "https://www.imdb.com/user/ur28597523",
      "reviewLink": "https://www.imdb.com/review/rw3136036",
      "warningSpoilers": false,
      "date": "5 December 2014",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "If they could just end it..IT would have been a much greater MASTERPIECE than it is now!!!",
      "content": "Samurai Jack is an American animated television series created by Genndy Tartakovsky for Cartoon Network. The series follows time- displaced samurai warrior \"Jack\" (voiced by Phil LaMarr) in his singular quest to find a method of traveling back in time and defeating the tyrannical demonic wizard Aku (voiced by Mako Iwamatsu). Episode plots range from dark and epic to lighthearted and comic, but often contain little dialogue. Stories instead rely on the series' highly detailed, outline-free, masking-based animation, as well as its cinematic style and pacing. Many battle scenes in the series are reminiscent of samurai films and since Jack's robot enemies bleed out oil or electricity and his monster and alien foes bleed out slime or goo, the action of these films can be exhibited while avoiding censorship for blood and violence.After being sent into the future by evil wizard Aku, young samurai Jack makes a quest to return to the past and undo the destruction caused by the wizard. Along the way Jack enlists allies to defeat some of Aku's henchmen and other villains before getting to the top dog to defeat him and find the portal that can return Jack to his own time. \"Samurai Jack\" was created by Genndy Tartakovsky, who had previously created \"Dexter's Laboratory,\" one of Cartoon Network's first original series.It is one of my favorites animated series till now,with only regret of not knowing its end!!!!!!"
    },
    {
      "username": "colm-hearne365",
      "userUrl": "https://www.imdb.com/user/ur22074254",
      "reviewLink": "https://www.imdb.com/review/rw3648755",
      "warningSpoilers": true,
      "date": "26 February 2017",
      "rate": "9",
      "helpful": "7 out of 8 found this helpful.",
      "title": "The Samurai Called Jack",
      "content": "Samurai Jack is up there with some of my favourite animated series because it's a show with great action, science fiction, fantasy, animation and good vs. evil. It tells the story of an extremely skilled samurai warrior with a magic sword is sent far into the future by the evil shapeshifter, Aku and the samurai, who goes by the name Jack, must travel the world in search for a way back to the past and defeat Aku while being hunted by Aku's bounty hunters and minions and helping those in need. It's not hard to see why Samurai Jack was a success with both critics and audiences and how it won 4 Primetime Emmy Awards. Most of the episodes are brilliant but some of my favourite episodes are \"Ultra Robots\", \"The Beginning\" and \"The Spartans\". And I'm also glad that they decided to bring back Samurai Jack after over a decade and make new episodes and a whole new season and hopefully it will end Jack's journey and maybe we will finally get see Jack return to the past and defeat Aku and we could also find out what Jack's real name is as well."
    },
    {
      "username": "samkoseoglu",
      "userUrl": "https://www.imdb.com/user/ur23542824",
      "reviewLink": "https://www.imdb.com/review/rw3072379",
      "warningSpoilers": false,
      "date": "20 August 2014",
      "rate": "9",
      "helpful": "5 out of 5 found this helpful.",
      "title": "A Simple Drawing Meets With Cinematography, Presented by Tartakovsky",
      "content": "When you watch a movie like Shichinin no Samurai, Spartacus, or one of the contemporary ones, The Lord of the Rings, you get the feeling that is so genuine, so imposing that you sense the change of your heart rate, in the scene of Aragorn's Speech at the Black Gate for instance. Samurai Jack, simply gives you the same emotion, and thrill for every single episode of it.Even in the episodes that the cartoon does not sustain any concerns about giving messages, the show excites you and makes you feel wonder about it. Scenes presenting a minimalist description with all details and the objects used intentionally are so realistic, and more than being realistic, so appropriate, and just. Basic elements like evil and good, justice and injustice, past and future, conventionalism or tradition and modernism or mechanization are presented so inventive, since you expect nothing more than originality from a cartoon, this show is exact and complete. Samurai Jack is also entertaining, as a cartoon should be, containing absurd comedy elements that are situational.If I had a chance to turn a cartoon into movie, that cartoon would definitely be Samurai Jack, yet, maybe the perfection of the show is due to its type and drawings. So, just enjoying the show as it is, is the best chance to have."
    },
    {
      "username": "TheOneThatYouWanted",
      "userUrl": "https://www.imdb.com/user/ur52600820",
      "reviewLink": "https://www.imdb.com/review/rw3696625",
      "warningSpoilers": true,
      "date": "29 April 2017",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Season 5 is next level stuff. Currently the best show on television",
      "content": "Like many, I grew up watching this show off and on back in the days. I still remember it abruptly ending without a conclusion. So when it was announced that the maker was returning with a season 5 with the distinct intention of finally concluding the show, I was on cloud 9. And when episodes of season 5 started rolling out and being awesome as all hell, I was taken to cloud 109. Seriously, season 5 is a freaking masterpiece. I'm surprised more people are not talking about it. Maybe people are put off because they've never seen a Samurai Jack episode before. Whatever, all I know is I'm loving it. Each episode of season 5 feels like 3 episodes in one, in other words they have heavy plot and themes associated with them. Yeah, season 5 is darker but that isn't why it is so good. The production value is out of this world. And the freaking soundtrack. THE FREAKING SOUNDTRACK! I NEED THE FREAKING SOUNDTRACK! But yeah, as crazy as this is going to sound, Samurai Jack is currently the best thing on television. And that is not an over exaggeration. If you didn't know, Samurai Jack is about a Samurai who trained his whole life to kill an evil demon named Aku with a magical sword handed down by his ancestors. Once the Samurai's training was complete and he became an adult, he finally did battle with the evil demon but just before he was able to land the killing blow with his sword, the demon opened a time portal into the future and tossed our hero in to the future. So our hero is sent thousands of years into a future where the evil wizard demon Aku is not only ruler of the world but the universe. It should also be noted that the only way to defeat Aku is with the magic sword, which Jack loses in season five. So yeah, Jack's ultimate goal is to travel back in time to kill Aku and undo the horrific future. Oh, and season five takes place 50 years after season four. A side effect of time travel left Jack unable to age. But yeah, this season can be watched with having seen any of the other seasons. Like I said before, this is currently the best show on television."
    },
    {
      "username": "wwe7961",
      "userUrl": "https://www.imdb.com/user/ur23619158",
      "reviewLink": "https://www.imdb.com/review/rw2295248",
      "warningSpoilers": false,
      "date": "14 August 2010",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "I loved it back in the day, but looking back HOLY SH*T!!",
      "content": "Looking at this show with a more grown up personality I can now truly understand just how freaking awesome this show is. The animation is gorgeous, the story is awesome, this show just kicks ass. Out of all the original premises that Cartoon Network has created for a show this the best. A samurai is sent back in time by a demon named Aku before the samurai kills him so he can face the samurai in a future where he rules the world. The samurai must now find a way to undo the spell so he can get back in time to stop Aku. While he tries to do this he is stuck in a future ruled by Aku, and filled with strange things. If you don't call that a great premise you most likely don't know what a premise is. Also the show gets in a good laugh here and there. The animation is Cartoon Netwrok's best. Really this is very good animation. The music is also great. The music is also Cartoon Network's best. This show isn't in my opinion their best. That title is held by \"Ed, Edd, and Eddy\", but this is without a doubt their coolest show. I definitely can say this another one of Cartoon Network's greats."
    },
    {
      "username": "Johnny-the-Film-Sentinel-2187",
      "userUrl": "https://www.imdb.com/user/ur24085266",
      "reviewLink": "https://www.imdb.com/review/rw4154682",
      "warningSpoilers": false,
      "date": "5 May 2018",
      "rate": "9",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Samurai Jack was a truly remarkable cartoon back in its day. And it still rocks!",
      "content": "Samurai Jack is the greatest thing Genndy Tartakovsky ever created from the ground up. Samurai Jack is what got Genndy the directing job for Star Wars: Clone Wars back in 2003, a similarly excellent cartoon that demonstrates what animation can achieve is something live-action drama only dreams of doing right. The action is over-the-top and is a spot-on adaptation of comic book sequences mixed in with Akira Kurosawa-esque iconography.Wonderful stuff through and through. Fast, funny and downright furious entertainment that refuses to let you get bored by any details. It's a Cartoon Network classic."
    },
    {
      "username": "michaelchikliscares",
      "userUrl": "https://www.imdb.com/user/ur63455024",
      "reviewLink": "https://www.imdb.com/review/rw5233468",
      "warningSpoilers": false,
      "date": "3 November 2019",
      "rate": "8",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Great animated series for CN.",
      "content": "Used to watch it on original live airing, entertaining and the story goes a long like a book novel chapter. Only issue with it why it doesn't get a 10 rating would be a long hiatus for season 5 and some episodes were purely filler voids.Aku was an exellent animated villain for Jack. He has a evil comic relief and can be very evil unapologetic."
    }
  ],
  "errorMessage": ""
}