{
  "imDbId": "tt0310455",
  "title": "Foyle's War",
  "fullTitle": "Foyle's War (TV Series 2002–2015)",
  "type": "TVSeries",
  "year": "2002",
  "items": [
    {
      "username": "ddelamaide",
      "userUrl": "https://www.imdb.com/user/ur0159036",
      "reviewLink": "https://www.imdb.com/review/rw1708270",
      "warningSpoilers": false,
      "date": "8 August 2007",
      "rate": "10",
      "helpful": "121 out of 121 found this helpful.",
      "title": "Father knows best",
      "content": "This is a compelling and oddly comforting drama. There is the setting and the time -- Hastings, on the southern coast of England during World War II. Hastings of course was the site of the last successful invasion of England, in 1066, and that threat seems real in the early days of the war. In the series, it is a provincial town where Deputy Chief Superintendent Foyle tries to solve local crimes of theft and murder, while dealing with wartime problems of black markets, sabotage and espionage. In addition to meddling from police superiors with their own agendas, Foyle must contend with bureaucratic and military interference from London as the war creates situations that lets criminals go free.Then there are the scripts and the actors, not to mention the overall quality of the production -- lucid photography, theme music with echoes of Brideshead Revisited, period clothing, vehicles, etc. The writing is measured, intelligent, no wasted words. Honeysuckle Weeks and Anthony Howell in the supporting roles of Samantha Stewart and Paul Milner are excellent and play off each other well.But the show belongs to Michael Kitchen and you wonder why you've never seen this actor before and when you will see him again. He conveys the competence and integrity you want in your hero, but the real attraction, I think, is that he is the ultimate father figure. He is concerned about people without wearing it on his sleeve; gruff, even curt, but letting us glimpse the tenderness behind it; and he is wise, not only a clever detective but wise in the ways of the human heart. He is a father not only to his son, Andrew, an RAF pilot, but also to Sam and Milner and to any number of characters in the various episodes, including his goddaughter in the last (final?) episode. Invariably, this father knows best. While he conveys a sense of vulnerability, you never have the feeling Foyle has really made a mistake. This is why I think the films are comforting. With all the chaos of war, and darkness of human behavior, Foyle moves through it all, self-possessed, caring, and ultimately, even when circumstances beyond his control keep him from actually incarcerating the wrongdoer, successful in protecting his charges from evil."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw6094134",
      "warningSpoilers": false,
      "date": "14 September 2020",
      "rate": "10",
      "helpful": "21 out of 21 found this helpful.",
      "title": "An outstanding series.",
      "content": "Foyle's War is up there with Morse, Endeavour and Poirot. This incredible series ran for thirteen years, given us crime during and after World War II. There isn't a single below par episode, nor a dip in quality, just a history of brilliant mysteries, solved by Christopher Foyle and Sam.Superbly written, Horowitz truly devised a classic, so many incredible episodes, my absolute favourite being the final one, but the likes of The German Woman and They fought in the fields are superb.The visuals are incredible, terrific sets, costumes and production values. We get stories that make us think what life must have been like during the war, quite brilliant.Did they end it at the right time? I thin when a series is this good you always wish for just one more episode, however it went out on a high.Kitchen in perhaps his most accomplished role is captivating throughout.It's a wonderful series, for my money it's one of the best. 10/10."
    },
    {
      "username": "sacha_brady",
      "userUrl": "https://www.imdb.com/user/ur4917890",
      "reviewLink": "https://www.imdb.com/review/rw1140528",
      "warningSpoilers": false,
      "date": "2 August 2005",
      "rate": "9",
      "helpful": "116 out of 120 found this helpful.",
      "title": "Intelligent, original and brave",
      "content": "Foyle's War tackles a great many of perceived truths of World War 2 head on, attempting to show a view of wartime Britain in a new light. These are dealt with against the backdrop of a murder which the considered, but burdened detective is called to.Michael Kitchen is absolutely superb as Christopher Foyle. He plays him with a subtle mix of determination and humanity; each performance is multi-layered, giving the viewer the opportunity to see something new each time. The support cast is also extremely good, with each character given appropriate depth and screen time.Overall, this is one to get if you like to watch well-crafted, intelligent drama."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2235426",
      "warningSpoilers": false,
      "date": "13 April 2010",
      "rate": "10",
      "helpful": "17 out of 18 found this helpful.",
      "title": "Where would we be without it?",
      "content": "For as long as I can remember, I have been fascinated by detective dramas. Having grown up with Inspector Morse, Touch of Frost, Taggart and Midsommer Murders, as well as the Agatha Christie adaptations with Joan Hickson and David Suchet(I also enjoy New Tricks, no matter how corny some of it is, it is entertaining), I first heard about this series two years ago. Since then, I have been hooked, I admit it was a little hard to get into at first, but I love the acting and how much visual detail goes into the series. The series really does look amazing, set during the 2nd World War, with beautiful costumes, pretty locations and authentic-looking scenery. The scripts are intelligent, sophisticated and absorbing as you would expect from a talented writer like Anthony Horowitz, and I will say I loved the concept, solving crimes amidst the backdrop of the war, not a bad idea now, is it? And of course, the acting is wonderful, with Michael Kitchen superb as Christopher Foyle, subtle, intense determined and most of all human who asks himself questions that only he can answer. Morse was quite a complex detective as well, more complex than he was in the books I'd say, but he was complex in a different sort of way to Foyle. Anthony Howell is also great as Sergeant Milner, as is the beautiful Honeysuckle Weeks as Sam. Also, the stories are intriguing and multi-layered, yes there may be the odd occasion where a plot point mayn't completely make sense first time, but this is only occasionally. Overall, a truly excellent series, where would we be without it? 10/10 Bethany Cox"
    },
    {
      "username": "clotblaster",
      "userUrl": "https://www.imdb.com/user/ur4400045",
      "reviewLink": "https://www.imdb.com/review/rw2093832",
      "warningSpoilers": false,
      "date": "10 July 2009",
      "rate": "10",
      "helpful": "23 out of 23 found this helpful.",
      "title": "Finest television of All Time",
      "content": "There is really nothing with which to compare this episodic series. The pacing, the acting, and the plots blend to create a superb fictional experience. I find very, very little to like in today's movies (No Country for Old Men being an exception) and much more to like on television, which I understand his heresy to some, but Six Feet Under, Doctor Findlay, Morse, Midsomer Murders, The Shield etc. far surpass any movie I've seen in a long time. This show in particular shows what can be done in cinema but not in writing--very, very unique. Seeing Foyle, his driver and his immediate subordinate act their parts really helps make this a fine viewing experience. Kitchen, playing the lead, is a fine actor and performs admirably, but the writing is what makes this show--Horowitz, the writer and creator, never varies from show to show. He controls the unfolding of this show, without the viewer having to worry about different writers muddling the waters. I highly recommend this show and would urge viewers to watch the series sequentially, starting, of course with the first episode."
    },
    {
      "username": "blanche-2",
      "userUrl": "https://www.imdb.com/user/ur0342623",
      "reviewLink": "https://www.imdb.com/review/rw3235176",
      "warningSpoilers": false,
      "date": "9 May 2015",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "A police detective who can't get into government service",
      "content": "What to say about this amazing series that puts the viewer in the middle of England before, during, and after World War II.Michael Kitchen is the widowed Chief Inspector Foyle, an excellent police detective, too old to fight, who wants to get into government service as the country prepares for war. But he's needed at home because yes, even though it's wartime, people are still out murdering.His team includes a man who lost his leg fighting overseas, Milner (Anthony Howell) and his pert young driver, Sam (Honeysuckle Weeks).What is unique about this series is the atmosphere and attention to detail in the dialogue as well as in the production. These are people who deal with coupon books, rations, farms conscripted, boys fighting, debilitating injury, bombings, PTSD, lack of food, wealthy people annoyed by the war who leave the city to avoid bombs, profiteering, gas shortages - it's an amazing look at what England suffered. And what they thought - when and if the Americans entered the war, would they help England, for instance. And then the problems when the war is over, and we know England faced lots of those.It's all the more fascinating because we still tend to glamorize WW II in our country.Foyle's War completely transports you into this world.The murder mysteries are fascinating and solved cleverly by the brilliant Foyle, an acute observer. His is not an easy character to warm up to - in fact, you never really do. He doesn't let loose with his emotions, and even when he does, all that happens is that his speech becomes clipped. He's very reserved, even when watching his only son go off to war, and he's a man of few words. But the pain is on his face when he looks at his wife's grave.Foyle also doesn't hesitate to break the rules. He's loved and respected by his team and those in the station, though.Michael Kitchen isn't good in this role - he's phenomenal, creating a multilayered character ruled by his brain and his respect for the law, but also with a heart he doesn't show.As Sam, Honeysuckle Weeks is delightful, young, fast-talking, loyal, and helpful, and what's great is her life changes throughout the years, as does Milner's. Anthony Howell is wonderful as Milner, also with the British reserve as he tries to cope with his disability and, in the beginning, a wife who can't cope with it at all. His life also changes, and so does he.Truly one of the best series I've ever seen. Don't miss it. The scripts are great, the mysteries are fantastic, and you'll find yourself wrapped up in the English world during very dark days."
    },
    {
      "username": "gaiter88",
      "userUrl": "https://www.imdb.com/user/ur3463833",
      "reviewLink": "https://www.imdb.com/review/rw1481227",
      "warningSpoilers": false,
      "date": "23 September 2006",
      "rate": "10",
      "helpful": "30 out of 30 found this helpful.",
      "title": "A release from the horde of (at best) mediocre murder mysteries that 'grace' our screens!",
      "content": "The most derogatory remark I've ever heard an intelligent people make about this program is that it drags on a bit, but quite frankly that's only because ITV go and stick 25 minutes of adverts into a otherwise perfect fluid 95minute program. I suppose you could argue that the sheer lack of offended and dishearten viewers is testament to its boring nature, but that quite frankly is nonsense as well. You see the thing about this program is that it soothes you, it's relaxing to watch but doesn't insult your intelligence. I could go on for pages and pages about the acting, writing and attention to period detail but I won't bother because by the looks of it many before me have done so already. The two simple and only facts you really need to know about this program are that Kitchen is an underrated genius and that as detective/murder mysteries go this is, and will remain, a timeless masterpiece."
    },
    {
      "username": "cutterccbaxter",
      "userUrl": "https://www.imdb.com/user/ur4214225",
      "reviewLink": "https://www.imdb.com/review/rw1033076",
      "warningSpoilers": false,
      "date": "4 March 2005",
      "rate": "",
      "helpful": "50 out of 56 found this helpful.",
      "title": "Baby You Can Drive My Car",
      "content": "This is a good idea for a mystery series and it is done well. Michael Kitchen gets a lot of acting mileage out of a slight tilt of the head or a raised eyebrow. He's definitely the master of delivering lines in a low key manner. All the episodes I saw were well constructed narratives and the WW II era was recreated very well. I hope this series continues on for it seems like the producers are capable of coming up with more intriguing stories. Credit must be given to the parents of Honeysuckle Weeks for not only producing a talented daughter but giving her such a charming name. It's a nice little touch to have her character drive Foyle around as he does not drive a car."
    },
    {
      "username": "ANeary",
      "userUrl": "https://www.imdb.com/user/ur0852809",
      "reviewLink": "https://www.imdb.com/review/rw0859397",
      "warningSpoilers": false,
      "date": "13 August 2004",
      "rate": "9",
      "helpful": "138 out of 148 found this helpful.",
      "title": "Much more than a detective drama...",
      "content": "Foyle's War follows the life of a detective and his team based in Hastings in the south of England during the Second World War. Although he is obviously called on to investigate crimes, the programme deals with so much more - there is a real feel for what it must have been like to be in Britain when it stood alone against Hitler, when the outcome was not just uncertain, but may well have meant invasion and persecution. The period is therefore much more than a \"backdrop\". For instance, Foyle's son is in the RAF, and his sergeant was seriously wounded in Norway.The scripts are intelligent, the plots engrossing and, with casts drawn from the cream of British actors, the performances are impeccable."
    },
    {
      "username": "french-michaelfrench",
      "userUrl": "https://www.imdb.com/user/ur10437230",
      "reviewLink": "https://www.imdb.com/review/rw1761245",
      "warningSpoilers": true,
      "date": "10 November 2007",
      "rate": "9",
      "helpful": "18 out of 18 found this helpful.",
      "title": "Perfect casting in a splendid series",
      "content": "Michael Kitchen absolutely shines in this fine series; it is about moral dilemmas rather than crime. Kitchen's characterisation of a fearless good man in hard times is magnificent; we know we can trust exactly what he says and even if some of his solutions are a bit deus ex machina we cannot resent it because his moral force absolutely justifies the end. The other actors do a great job of presenting the shades of grey through which he moves. My favourite is still Simon West. Who can resist Kitchen's throwaway response to \"It's not a good time\"? And his magnificently insulting summing up in the French Drop? I know little enough about the Home Front around this period, and that I learnt from Dad's Army! But the muted colours and all the obscure minutiae of a rationed and regulated society provide a feeling that this is how it was, even if it wasn't."
    },
    {
      "username": "llwkr",
      "userUrl": "https://www.imdb.com/user/ur0905942",
      "reviewLink": "https://www.imdb.com/review/rw1770161",
      "warningSpoilers": false,
      "date": "25 November 2007",
      "rate": "10",
      "helpful": "18 out of 18 found this helpful.",
      "title": "a show of substance",
      "content": "Foyle's War is unique in it's blending of history and fiction. I just finished watching a special feature that filmed the stunt preparation for a spitfire crash in \"Enemy Fire\". I am amazed at the thought and detail that go into making these films.This is one of the rare productions that makes you think 'outside the box'. Anthony Horowitz has really perfected his craft in putting together scripts,a cast and a crew that can carry off a challenge like this. The concept of a detective solving crimes during a war is in itself a thought-provoking basis for a series. The challenge of balancing right and wrong is integrally woven into each show, and I find myself thinking about moral dilemmas presented in each episode long after watching.I highly recommend this series for all ages."
    },
    {
      "username": "paristeri",
      "userUrl": "https://www.imdb.com/user/ur3535670",
      "reviewLink": "https://www.imdb.com/review/rw1211269",
      "warningSpoilers": false,
      "date": "7 November 2005",
      "rate": "",
      "helpful": "61 out of 66 found this helpful.",
      "title": "Just watched Season 3-",
      "content": "My sister who lives in Minnesota, told me about this series after she started getting at the library.. I got Season 1 & 2 for her birthday, watched them and pre-ordered Season 3.. Everyone in my family now is watching it-that would be Minn, Washington state, and Florida. My Dad was a B-17 pilot during WWII, both he and my mother really enjoy this story. One really bonds with the characters and the added plus of learning about wartime Britain is fascinating. I highly recommend this series-really good stories and history too. Each DVD seems to have an extra about the actual events that take place in the story. More and more I find I am looking towards the UK, for quality entertainment both in movies and TV..Hope they keep it coming!"
    },
    {
      "username": "wlb",
      "userUrl": "https://www.imdb.com/user/ur0746682",
      "reviewLink": "https://www.imdb.com/review/rw2874126",
      "warningSpoilers": false,
      "date": "22 September 2013",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "One of the Best historical dramas I have seen",
      "content": "I started watching Foyle's War on the advice of a cinimaphile friend - went though all the wartime episodes and am so enamored with it stayed up until 3 in the morning watching a rerun of episode 1 Season 8 on PBS.The series is great on 2 levels - first - the crime dramas in each episode are so well written that the screen writing on that alone would make it (or any series) great.But above that the historical research - from how people acted during the Battle Of Britain - the attitudes of the \"Sitzkrieg\" - that lull between the time war was declared over the Nazis invading Poland and the Air War - When I found out they were filming more episodes - well, that accounts for my staying up from 01:30 - 03:00. Season 8 deals with the beginning of the Cold War.Great stuff."
    },
    {
      "username": "raymond-massart",
      "userUrl": "https://www.imdb.com/user/ur2612772",
      "reviewLink": "https://www.imdb.com/review/rw1437708",
      "warningSpoilers": false,
      "date": "3 August 2006",
      "rate": "8",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Life during World War 2",
      "content": "The main advantage of this series is that it not only gives us a vivid description of life in Britain during World War 2 but also adds all the ingredients that are inherent to good detective stories. The threat of a possible German invasion obviously had an enormous impact on the inhabitants and these aspects are often discarded in many historical accounts of this tragic period. \"Foyle's War\" concentrates on what really went on in the average person's mind and does not avoid revealing the darker side of human nature in general. Themes such as the undeniable sympathy for Hitler and Nazi Germany that existed in certain aristocratic circles, the growing hatred towards refugees and Jews, the plight of young children who were sent to the countryside in order to avoid the bombings in the major cities and were often worse off than had they stayed with their parents, are touchy subjects which are not avoided in a series that certainly aims at painting a truthful picture. Most episodes are very slow paced as if to illustrate how insignificant a crime committed by an individual basically is compared to the imminent danger of the destruction of a whole nation. This atmosphere of gloom and doom often leads the protagonists to reflect profoundly on the meaning of war and life in general which gives the series an extra dimension.The acting is exquisite and contributes largely to the sense of contained despair that many must have experienced at that time in history."
    },
    {
      "username": "=G=",
      "userUrl": "https://www.imdb.com/user/ur0783721",
      "reviewLink": "https://www.imdb.com/review/rw0969984",
      "warningSpoilers": false,
      "date": "29 November 2004",
      "rate": "8",
      "helpful": "31 out of 41 found this helpful.",
      "title": "Think Sherlock circa 1940",
      "content": "\"Foyle's War\" is all about Michael Kitchen as Christopher Foyle, a soft-spoken civilian detective who unravels murder mysteries using his deductive prowess while Britain gears up for WWII. Everything that happens in this very civilized, easy-going TV drama series is inextricably involved with the Brit war effort imparting a sense of the period and the history to the intrigues and drama of the stories. Although some clues are kept from the audience, much of each of the 90 minute mysteries can be deduced along with the protag offering an enjoyable \"play along\" aspect as Foyle slogs toward the inevitable crime busting conclusion. \"Foyle's War\" should be good stuff for those into cozy mystery fun. (B+)"
    },
    {
      "username": "gpeevers",
      "userUrl": "https://www.imdb.com/user/ur3032357",
      "reviewLink": "https://www.imdb.com/review/rw2058817",
      "warningSpoilers": false,
      "date": "28 April 2009",
      "rate": "8",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Fine Period Detective Series",
      "content": "Chief Superintendent Christopher Foyle (Michael Kitchen) is a widowed middle-aged detective stationed on the south coast of England at the outbreak of the Second World War; Foyle has a son Andrew who is a student at Oxford before volunteering with the Royal Air Force.Due to wartime shortages in manpower amongst the Police, Foyle requests a driver and gets a uniformed civilian volunteer named Samantha Stewart (Honeysuckle Weeks). Foyle also recruits a disabled war veteran and former police detective Paul Milner from his hospital bed as his Sergeant.The series serves both as a good period piece drama with some very informative and interesting historical elements combined with some very good detective/mystery story elements.The series puts considerable emphasis on a number of social issues of the time and also paints a very evocative portrait of England during the war. The production values are very impressive especially when you consider this is a period television series with considerable scope and budget limitations.The standouts for me amongst the regular cast are Michael Kitchen who is incredibly effective in underplaying his role while still managing to make Foyle a very sympathetic character, and Honeysuckle Weeks who seems perfectly suited to her character. The interplay between these two characters is certainly a highlight of the series.The series has attracted some very impressive talent which has included such veterans as Edward Fox and Charles Dance as well as up and coming talent like James McAvoy and David Tennant (Doctor Who)."
    },
    {
      "username": "5860backup",
      "userUrl": "https://www.imdb.com/user/ur4339982",
      "reviewLink": "https://www.imdb.com/review/rw0991438",
      "warningSpoilers": false,
      "date": "4 January 2005",
      "rate": "",
      "helpful": "46 out of 50 found this helpful.",
      "title": "Excellent Historical Mystery",
      "content": "I have never been one for the sort of \"crime drama\" which is popular in the US. But I am a big fan of mysteries. In the past few years I have really become involved with historical mysteries and this seems to be one of the best. Notice history comes first - mystery second. Solving the crime though central to the plot of the Foyle's War stories it is not the key. The important part revealing how people \"back then\" felt about and reacted to what was going on. I think Foyle's War does an excellent job. You can feel the tension and weariness about the war. I also liked that though the various characters try to justify their actions because \"there's a war on\" you can tell that internally they know what they are dong is wrong or right. Though Kitchen and cast do an excellent job bringing out these feelings and ideas without words and without over acting, I think we also have to give credit to the Director and the cinematographers."
    },
    {
      "username": "krazylegs88",
      "userUrl": "https://www.imdb.com/user/ur9034150",
      "reviewLink": "https://www.imdb.com/review/rw2027289",
      "warningSpoilers": false,
      "date": "22 February 2009",
      "rate": "10",
      "helpful": "16 out of 16 found this helpful.",
      "title": "One of the best!",
      "content": "My wife and I became obsessed with the British crime series \"Midsomer Murders\". We've seen all the episodes available. Then my wife latched onto \"Foyle's War\" and we've become big, big fans of this series also. We agree with everyone about Michael Kitchen's performances and the historical background against which the story unfolds. Everything about this show looks authentic, feels authentic and sounds authentic. Not having lived through that time we are learning so much about the period. We're beginning to learn more about just exactly what England went through during the war by connecting some of these events in a time line. We are looking forward to the possible three new episodes to be filmed in the spring of '09. And we wouldn't mind if the series went on for longer than the war lasted. We let \"M*A*S*H\" get away with it. This is one series that deserves to be on longer."
    },
    {
      "username": "clanciai",
      "userUrl": "https://www.imdb.com/user/ur10491760",
      "reviewLink": "https://www.imdb.com/review/rw7414433",
      "warningSpoilers": false,
      "date": "6 October 2021",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Life under extreme duress, patiently dealing with one impossible situation st a time",
      "content": "This is one of the best series ever created for TV. It went on for 13 years (2002-2015), and each episode is a completed story, all sustained until the end with human interest, fascinating intrigue and good acting. Christopher Foyle is the superintendent of the police in Hastings during the war and especially during the worst part of the war, which he has nothing to do with but still has to solve impossible mysteries and crimes in its shadow, dealing with all kinds of people deeply affected by the war - his own son is a RAF pilot. The psychology is always impressingly intelligent, the characters are all fascinatingly and profoundly human, the realism is perfect, and you always look forward to the next episode and don't want to miss any. The fathomless humanity of the almost documentary presentations is so engaging that you almost are given the impression that it had to be a war like this to bring out the best in man or at least the very basics of humanity. It is a finished whole, there will be no more episodes, but you can always return to the old ones any number of times - and find yourself rewarded again.."
    },
    {
      "username": "squareeyes",
      "userUrl": "https://www.imdb.com/user/ur2267140",
      "reviewLink": "https://www.imdb.com/review/rw0955267",
      "warningSpoilers": false,
      "date": "1 November 2004",
      "rate": "",
      "helpful": "71 out of 84 found this helpful.",
      "title": "This is very , very good.",
      "content": "I'm constantly amazed by Michael Kitchen's ability to be intense and agonised but still seem laid back to the point of being almost comatose at times . Very well written and directed apart from the odd driving through the countryside scene with Foyle's and Sam's dialogue being obviously overdubbed . Speaking of Sam , I'm not sure if the fragrant Miss Weeks (Honeysuckle , flowers , oh forget it!) is being slightly tongue in cheek with her Dame Anna Neagle/Celia Johnson \" frightfully super \" accent but hey , a woman in a uniform is a woman in a uniform ! She can talk anyway she likes . Always very excellent guest actors like Bill Paterson and John Wood so all in all , a quality show ."
    },
    {
      "username": "trextracey",
      "userUrl": "https://www.imdb.com/user/ur1419311",
      "reviewLink": "https://www.imdb.com/review/rw0955372",
      "warningSpoilers": false,
      "date": "1 November 2004",
      "rate": "",
      "helpful": "50 out of 53 found this helpful.",
      "title": "What an eye-opener",
      "content": "What a great series {so far}. Well done to the cast & all the many others associated/involved with this series. Both my parents were caught up in the war: My Dad was in the RAF, & my mum being nine years younger was evacuated from Portsmouth to an Aunt who lived in the 'country'. I never knew what a 'funk hole' was until watching this series, & when I mentioned it to my Mum, she quite calmly said 'oh yes we all knew about them'. I'm sure others may think that some things are not accurate, but books don't always tell the truth: if ever in doubt ask someone who lived through this time period. Let's hope series three lives up to the other two."
    },
    {
      "username": "keith_g",
      "userUrl": "https://www.imdb.com/user/ur3918284",
      "reviewLink": "https://www.imdb.com/review/rw1927461",
      "warningSpoilers": false,
      "date": "10 August 2008",
      "rate": "9",
      "helpful": "9 out of 9 found this helpful.",
      "title": "The terrors of nightly bombing raids are only matched by the fear and hysteria of the population at the prospect of the seemingly inevitable German invasion...???",
      "content": "Positively the worst and most misleading summary I have yet seen on IMDb! (Unless I have been completely hoodwinked - I was born just after the war!) According to my knowledge gleaned from various sources and what I have been told over the years, there may have been concerns at the individual level, but there was certainly no mass terror or hysteria displayed as a result of bombings or the prospect of an invasion of the UK, during the darkest days of WW2!In fact, one thing that is unfailingly depicted throughout the whole, excellent series of Foyles War is the calm control and sangfroid of the main characters that was typical back then, even if it seems to have disappeared somewhat these days. This was exemplified in the way that Foyle managed to winkle out the truth in the various situations he encountered by means of shrewd observation and reasoned deduction, without any trace of unnecessary drama, raised voices or arm-waving and the series is all the better for it - the modern trend in TV/movies that portrays police work as panicky, fraught and highly-charged emotionally is unrealistic (certainly unBritish) and, thankfully, absent in this excellent series.Anyone who enjoyed tapping into the lost, old-worlde charm of this UK series set during WW2 may well enjoy the equally good (but far funnier) lighthearted but soulful comedy series 'Dad's Army'!"
    },
    {
      "username": "ddbanddtt",
      "userUrl": "https://www.imdb.com/user/ur2727039",
      "reviewLink": "https://www.imdb.com/review/rw1030878",
      "warningSpoilers": false,
      "date": "1 March 2005",
      "rate": "",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Foyles War part of great Brit Drama Tradition",
      "content": "I have seen all of the first three seasons. Historically well researched, Foyles War depicts a Detective Inspector of remarkable ability, insight and character. Foyle, and his two underlings, a driver and a junior detective have a moral compass that is tested in this wartime drama. Set during WWII, before the US entered, and before The Soviet Union became political allies, much that is beautiful can be seen among the deprivation.Foyle cares for his family, but the war threatens to tear all apart. Even the criminals have motivations that are above that of the modern crim. As character studies alone, this sure beats the flawed Kinsey Reports, because this fiction has real people."
    },
    {
      "username": "pabobfin",
      "userUrl": "https://www.imdb.com/user/ur3390886",
      "reviewLink": "https://www.imdb.com/review/rw1287548",
      "warningSpoilers": false,
      "date": "9 February 2006",
      "rate": "",
      "helpful": "12 out of 12 found this helpful.",
      "title": "Excellent Series and I hope for many more episodes!",
      "content": "This series (to date rented from online rental rentflix company) builds credibility in all characters, intricate though typically British murder mystery confrontations, come-uppances to the antagonists who deign to impugn Foyle in the beginning of episodes (with excellent plot lines throughout) and a believable interplay between complex characters. The only question NOT answered to date is WHY Foyle does not drive. Fortunately because he doesn't, he gets to have Sam as a driver. Maybe that is the reason! Would buy this boxed set when it is available, have not seen it yet. The realism achieved by set design, as well as the opportunity to see a real spitfire flying in many scenes makes it a pilot's movie as well. The series musical theme is also hauntingly beautiful. Foyle's quiet calm and non-reactive traits are especially lovable."
    },
    {
      "username": "the_real_berserker2",
      "userUrl": "https://www.imdb.com/user/ur4587224",
      "reviewLink": "https://www.imdb.com/review/rw0999441",
      "warningSpoilers": false,
      "date": "15 January 2005",
      "rate": "",
      "helpful": "110 out of 116 found this helpful.",
      "title": "Excellent Period Piece",
      "content": "These shows do a great job of creating an image of the British Home Front that is very different from the one romanticized in the history books. We get a very real feeling that the British public \"knew\" the war was lost in the darkest hour, yet still kept a stiff upper lip. This tension, combined with wartime secrecy, energizes the drama. The war is like the weather is in other mysteries; criminals often use it as cover for their activities (blackmarket petrol, draft dodging, burglary, blackmail, and the like hidden by blackouts, bombing raids, and official secrets) and it's the job of the police to uncover all of the layers. In doing so, Chief Inspector Foyle asks hard moral questions - even in wartime, when thousands are being killed every day, is murder murder? The \"bigger picture\" is often cited as justification by the criminals, and, through association, this paints the leaders of the war with the same brush. A great show for children - this can spark interest in the period while also teaching moral lessons. Unlike some nihilistic modern fare, Foyle's War strives to show moral clarity through the confusion."
    }
  ],
  "errorMessage": ""
}