{
  "imDbId": "tt9335498",
  "title": "Demon Slayer: Kimetsu no Yaiba",
  "fullTitle": "Demon Slayer: Kimetsu no Yaiba (TV Series 2019– )",
  "type": "TVSeries",
  "year": "2019",
  "items": [
    {
      "username": "kevin_robbins",
      "userUrl": "https://www.imdb.com/user/ur131783850",
      "reviewLink": "https://www.imdb.com/review/rw7032265",
      "warningSpoilers": true,
      "date": "15 June 2021",
      "rate": "9",
      "helpful": "91 out of 104 found this helpful.",
      "title": "I'd strongly recommend this.",
      "content": "Demon Slayer Season 1 (2019) is a series my daughter and I recently watched on Netflix (26 episodes). The storyline focuses on a family that lives on a mountain 🏔 just outside of town where everyone in the family plays a roll for their survival. The sons job is to walk into town, trade for supplies and bring them home for his family. One day he returns home and finds his entire family has been murdered by demons on the mountain. So begins his journey to become a demon slayer...aided by his sister turned demon herself and friends he encounters along the way. The gore in this was better than I anticipated and the creatures are portrayed awesome - Many unique demons with surprisingly cool powers. I loved the evolution of the main characters as well as the friends he meets and their display of powers. The animation is very good. My daughter loved the storyline and can't wait to watch the movie. The only annoying part is the persistent inner monologue, but what anime series doesn't have an abundance of that? I'd score this a 9-9.5/10 and strongly recommend this."
    },
    {
      "username": "drrajeevshukla",
      "userUrl": "https://www.imdb.com/user/ur67848488",
      "reviewLink": "https://www.imdb.com/review/rw7679393",
      "warningSpoilers": false,
      "date": "24 December 2021",
      "rate": "10",
      "helpful": "45 out of 51 found this helpful.",
      "title": "Stunning",
      "content": "Being new to this Anime genre, I am amazed by the artwork, uniqueness of characters & fantastic world. Of course my favourite is Tanjiro - just pure good soul in dark world. Awesomeness."
    },
    {
      "username": "umlaziking",
      "userUrl": "https://www.imdb.com/user/ur110613987",
      "reviewLink": "https://www.imdb.com/review/rw8092932",
      "warningSpoilers": false,
      "date": "26 April 2022",
      "rate": "10",
      "helpful": "58 out of 70 found this helpful.",
      "title": "Really entertaining",
      "content": "I'm an attack on titan fan and even I have to admit that it's a really good show...the animation from ufotable is just absolutely brilliant and beats most anime and all animated shows around the planet. I admit, the storyline of demon slayer isn't anything new, some people say it's an overrated show, some say it's cliche...and that's ok...why???...because every single person is entitled to their own opinion...the criticisms might be true but I will say this...there's a reason why this anime is so popular and there's a reason why so many people not only in Japan but around the world enjoy it. Not every single anime or TV show has to have a plot twist of a story like attack on titan or Vinland saga, as long as its entertaining and enjoyable for everyone to enjoy then really thats all that matters. Demon slayer is a good show and I would highly recommend it to anyone especially people who aren't anime watchers, it's incredible."
    },
    {
      "username": "mindhy_eau",
      "userUrl": "https://www.imdb.com/user/ur67012006",
      "reviewLink": "https://www.imdb.com/review/rw4958218",
      "warningSpoilers": false,
      "date": "25 June 2019",
      "rate": "10",
      "helpful": "124 out of 149 found this helpful.",
      "title": "Breathtaking animation",
      "content": "I love this anime, by reading the manga and comparing the episodes I'm just blown away, the action scenes are so impressive, as well the pace, I'm usually upset when there's a lot of missing stuffs from the mangas, but not this one, so far its been great."
    },
    {
      "username": "ebrailey22",
      "userUrl": "https://www.imdb.com/user/ur52392140",
      "reviewLink": "https://www.imdb.com/review/rw4985086",
      "warningSpoilers": false,
      "date": "9 July 2019",
      "rate": "10",
      "helpful": "82 out of 102 found this helpful.",
      "title": "Really good",
      "content": "Great animation, interesting story, and a lot of brutal scenes later on. Def. Not a slow start but it kinda eases itself into the story and gradually gets better. Really liking the show"
    },
    {
      "username": "molobelalesedi",
      "userUrl": "https://www.imdb.com/user/ur142379856",
      "reviewLink": "https://www.imdb.com/review/rw7529099",
      "warningSpoilers": false,
      "date": "8 November 2021",
      "rate": "10",
      "helpful": "33 out of 39 found this helpful.",
      "title": "A tale of Tragedy and family",
      "content": "This is a masterpiece built in tragedy and the love of family. A brother comes home only to find his family slain by a demon. The sister survives and is tùrned to a demon as well. It is a journey of the brother to find a cure and defend his sister.It is full of sorrow and grief, friendship and also the love of family.I guarentee you will love it.If you are new to anime, this is the best way to get you addicted."
    },
    {
      "username": "jared-25331",
      "userUrl": "https://www.imdb.com/user/ur106224983",
      "reviewLink": "https://www.imdb.com/review/rw6344520",
      "warningSpoilers": false,
      "date": "7 December 2020",
      "rate": "10",
      "helpful": "35 out of 43 found this helpful.",
      "title": "Why a phenomenal anime!",
      "content": "This anime is awesome. The characters are amazing and the storylines are engaging. This is easily one of the best anime's of all time!"
    },
    {
      "username": "WeAreLive",
      "userUrl": "https://www.imdb.com/user/ur79460801",
      "reviewLink": "https://www.imdb.com/review/rw6391834",
      "warningSpoilers": true,
      "date": "23 December 2020",
      "rate": "10",
      "helpful": "68 out of 91 found this helpful.",
      "title": "Best anime of 2019",
      "content": "Tanjiro is on a quest with his demon sister Nezuko after his family gets killed and to stop the Muzan. While doing so he meets an old man who trains him and looks after in order to fo fill his quest. He then meets the cowardly crybaby Zenitsu and a shirtless guy with a boar mask Inosuke he befriends they join the quest he is on.If you haven't seen this anime i definitely recomand you do. It has really good fight scenes and the visuals for it are very well displayed. Also the characters are all well written. Minus the whole Nezuko being a loli meme.But aside from that it's a good anime probably the best i have seen this year alongside a few others.,"
    },
    {
      "username": "shammyshamnine",
      "userUrl": "https://www.imdb.com/user/ur78515680",
      "reviewLink": "https://www.imdb.com/review/rw4895785",
      "warningSpoilers": false,
      "date": "29 May 2019",
      "rate": "10",
      "helpful": "131 out of 168 found this helpful.",
      "title": "Miss it at your own peril",
      "content": "What an anime! Most often times a soundtrack tells how good an anime will be and from the first few scenes I knew I was onto something here. The story and emotions that run through this show is just breathtaking. Anime's are rarely made like this anymore. So glad I found it."
    },
    {
      "username": "ProjectAnomaly",
      "userUrl": "https://www.imdb.com/user/ur105954145",
      "reviewLink": "https://www.imdb.com/review/rw6936708",
      "warningSpoilers": false,
      "date": "18 May 2021",
      "rate": "10",
      "helpful": "54 out of 72 found this helpful.",
      "title": "Demon Slayer",
      "content": "Zenitsu almost lowered the score to a 9, but he's good meme material and the show knows not to focus on his dumbassery too much, so there."
    },
    {
      "username": "Achyut_Prashast_Singh",
      "userUrl": "https://www.imdb.com/user/ur46915265",
      "reviewLink": "https://www.imdb.com/review/rw6561511",
      "warningSpoilers": false,
      "date": "4 February 2021",
      "rate": "10",
      "helpful": "64 out of 87 found this helpful.",
      "title": "I have no words to explain why this is the best anime I've ever seen.",
      "content": "I have seen a lot of action fantasy anime shows, but for some reason, this is the best. I was so into it that I can't pick one just thing as my favorite about this show. The action, the character development, the emotional moments, the score, the animation or be it just the writing in general, Demon Slayer is on a whole different level. I went through a number of emotions watching it, and it felt like I was on one wild ride from episode 1 to 26. The mood keeps varying from time to time, but the tempo never drops and with intriguing characters, it only gets better and better with every episode.Demon Slayer keeps shifting focus to different supporting characters, thus making you feel as if you're yourself a part of the protagonist Tanjiro's journey: one filled with tons of mind-blowing, jaw-dropping action sequences. There were a number of moments where my mind was blown away! Amidst all the violence and tension, the sweet brother-sister relationship of Tanjiro and Nezuko tugs at your heartstrings. While Tanjiro is the usual memorable and relatable \"shonen\" protagonist, other characters are surprisingly also treated very well. Be it the cute Nezuko, the tough yet hilarious Inosuke, or the comic relief yet strongly written Zenitsu, the show is full of characters that will end up growing on you.The animation is literally breathtaking. Several action scenes feel like actually filmed with a camera than drawn by hand, which is stupendous! The score is another major positive, elevating the show's epic scale and tone to unexpected levels. Although it's not a comedy, the funny bits involving the three boys are a major highlight, especially in the last few episodes. Some might find its quickly shifting focus from one set of supporting characters to another a little uneven, but the writing is so strong you don't get time to think anything else, with constant action delivered in every episode.I am normally left blank when I finish watching an anime show, but that's not what happened here. I was instead happy that it was perfectly concluded and it left me excited for the box-office blockbuster sequel film, which I clearly can't wait to watch now. Demon Slayer is the best anime I've seen to date, and something I'd love to watch again and again."
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5561322",
      "warningSpoilers": false,
      "date": "19 March 2020",
      "rate": "",
      "helpful": "114 out of 163 found this helpful.",
      "title": "Kimetsu No Yaiba",
      "content": "Awesome literally awesome. I have seen alot of anime shows but this was one of the best and people attacking this show have a personal grudge to be honest as it broke some records and the fact that its fans are not attacking the critics is a proof on all its own that how toxic they are .... Characters-9 Animation-10 Voice acting-9 Plot-8 Fighting-10 Music-9"
    },
    {
      "username": "seidimeri-60724",
      "userUrl": "https://www.imdb.com/user/ur69448799",
      "reviewLink": "https://www.imdb.com/review/rw4809724",
      "warningSpoilers": false,
      "date": "28 April 2019",
      "rate": "10",
      "helpful": "73 out of 94 found this helpful.",
      "title": "Amazing!!!!!!",
      "content": "Really dont know what to say. I am blown away by this Anime. I began to watch it without any expectations and than Booooom!!! Its amazing, watch it and you'll be convinced too."
    },
    {
      "username": "gingeryzane",
      "userUrl": "https://www.imdb.com/user/ur73228148",
      "reviewLink": "https://www.imdb.com/review/rw5064369",
      "warningSpoilers": false,
      "date": "17 August 2019",
      "rate": "10",
      "helpful": "55 out of 72 found this helpful.",
      "title": "MAKE IT TO EPISODE 19",
      "content": "This show will be a cornerstone for a new generation of anime. Everything about it; the story, the characters, the music, and ESPECIALLY the visuals are on another level. If you don't believe me, make it to episode 19 and you will see the peak of all anime. Most breathtaking episode to date."
    },
    {
      "username": "endranokk",
      "userUrl": "https://www.imdb.com/user/ur73080913",
      "reviewLink": "https://www.imdb.com/review/rw4784546",
      "warningSpoilers": false,
      "date": "16 April 2019",
      "rate": "9",
      "helpful": "160 out of 197 found this helpful.",
      "title": "The show is going to reach its potential",
      "content": "I'm calling for it this show is going to be amazing and for the last 2 episodes have already got me because the animation is just breathtaking and very crisp too. And the storytelling is gotta be good as \"Dororo\". And the studio is from Ufotable, The one that made the Fate series no wonder the animation is so good."
    },
    {
      "username": "GeorgeStrCy89",
      "userUrl": "https://www.imdb.com/user/ur41590066",
      "reviewLink": "https://www.imdb.com/review/rw7796328",
      "warningSpoilers": false,
      "date": "24 January 2022",
      "rate": "10",
      "helpful": "34 out of 44 found this helpful.",
      "title": "Demon Slayer is the new GOAT!",
      "content": "I guess this is what it means taking anime to another level! As if the source material is not great enough already here comes the unreal animation where almost every single episode's quality is breathtaking! What's even more frightening about it is that we are still in the beginning of the whole story! Damn you Demon Slayer, you are a joke, an absolute monster of an anime series!"
    },
    {
      "username": "Lucasanova",
      "userUrl": "https://www.imdb.com/user/ur37346546",
      "reviewLink": "https://www.imdb.com/review/rw4834451",
      "warningSpoilers": false,
      "date": "7 May 2019",
      "rate": "9",
      "helpful": "87 out of 108 found this helpful.",
      "title": "Breathtaking",
      "content": "This show has been given justice, this is a anime that has outdone the manga. Tanjiro our protaganist is unlike many other shonen anime protaganists (one piece: Luffy for example) while Luffy's goal is to become the pirate king, tanjiros goal does not base itself in his growth. It is his will and moral of saving others and furfilling his quest of helping his sister that drives him forward which means that gaining strengh is not the primarily focus which for me adds a new perspective to the show. If you have seen up until episode 19 and you have not rated this show, There really is no convincing you. This show is a masterpiece and you'll be hooked from the first episode!"
    },
    {
      "username": "RealMOJO99",
      "userUrl": "https://www.imdb.com/user/ur103322503",
      "reviewLink": "https://www.imdb.com/review/rw4885015",
      "warningSpoilers": false,
      "date": "24 May 2019",
      "rate": "10",
      "helpful": "202 out of 237 found this helpful.",
      "title": "Breathtaking",
      "content": "I hope that kimetsu no yaiba is a recurring anime and not only lasts for the confirmed 26 episodes. The story and animation are absolutely breathtaking. Very keen to see how it progresses throughout. so far, a really awesome anime."
    },
    {
      "username": "nrb-04501",
      "userUrl": "https://www.imdb.com/user/ur102414347",
      "reviewLink": "https://www.imdb.com/review/rw4894198",
      "warningSpoilers": false,
      "date": "28 May 2019",
      "rate": "10",
      "helpful": "109 out of 143 found this helpful.",
      "title": "You really should watch it",
      "content": "Really i think this anime doesn't have a bad episode, everyone has such a whole soundtracks and things eles , I like it!."
    },
    {
      "username": "CasualFnSViewer",
      "userUrl": "https://www.imdb.com/user/ur102266923",
      "reviewLink": "https://www.imdb.com/review/rw6418613",
      "warningSpoilers": false,
      "date": "29 December 2020",
      "rate": "6",
      "helpful": "26 out of 35 found this helpful.",
      "title": "The success of Demon Slayer's first season was visually present all throughout the series, but was steps away from being truly outstanding all around.",
      "content": "Put simply, the best and most praiseworthy aspects of the series were its design, art style, and animation, while some of the characters and the story writing could've used some polishing.It isn't hard to see why Demon Slayer is very well received, because that is exactly what the series excelled at: its visual design and action sequences. From its very first episode to the last, Demon Slayer never fails in this department, delivering a clean and appealing animation style when it is focused on the main storyline of Tanjiro and Nezuko Kamado's journey.It is when other characters enter as the story progresses that the series starts to show its flaws. For the most part, characters beside Tanjiro and Nezuko have their own charm and are able to fulfill their roles well. However, there are also characters who haven't been fleshed out enough to leave a strong impression before the story moves on to its next part. Even the backstories for these characters seemed half-baked, and are only there for the purpose of giving the viewers some sort of understanding to the characters and a shallow attempt at obtaining sympathy for them. The strong traits displayed by some overbearing characters cannot be downplayed by how irritating their personalities can be, which is probably turned up for comedy even if it isn't at all funny, especially when the mood changes from fun to serious. You'll often find tropes like these in other series in the same vein, just done smoother.There are a lot more anime series out there that have done better at developing a story in the course of fewer episodes than in the first season of Demon Slayer. Parts that are made to be funny at times come out as obnoxious and uninteresting, and the story writing leaves a lot to be desired with several parts condensed in 26 episodes, compromising its build-ups and character depth for the thrill of the hunt.Demon Slayer: Kimetsu no Yaiba has a lot of potential. It has lived up to the hype for the elements it is praised for, namely design and animation, but delivers an underwritten story which could have made this anime series superior to its peers in the adventure and fantasy genres had it been given just as much attention the design and animation got."
    },
    {
      "username": "exoticsoul",
      "userUrl": "https://www.imdb.com/user/ur71924628",
      "reviewLink": "https://www.imdb.com/review/rw5067290",
      "warningSpoilers": false,
      "date": "18 August 2019",
      "rate": "10",
      "helpful": "34 out of 42 found this helpful.",
      "title": "Excellent.",
      "content": "I loved it. Picturisation and execution of the story is mind blowing. A must watch."
    },
    {
      "username": "richardratliff",
      "userUrl": "https://www.imdb.com/user/ur78867282",
      "reviewLink": "https://www.imdb.com/review/rw5007648",
      "warningSpoilers": false,
      "date": "20 July 2019",
      "rate": "10",
      "helpful": "52 out of 72 found this helpful.",
      "title": "The future of animation.",
      "content": "In my opinion, this style of blending 2D and 3D is the future. I believe this animation will be the standard by which we judge this blending in the future.The story line is awesome. The first episode is perfect and mind blowing. My family and I wait all week to watch the next episode. Last but not least, the music and Japanese voice acting are superb.EDIT: To all the naysayers- I was right!"
    },
    {
      "username": "rianv-74983",
      "userUrl": "https://www.imdb.com/user/ur115637905",
      "reviewLink": "https://www.imdb.com/review/rw5594240",
      "warningSpoilers": true,
      "date": "31 March 2020",
      "rate": "10",
      "helpful": "28 out of 35 found this helpful.",
      "title": "An amazing story that helps you fall deeper to Japanese culture and imagination",
      "content": "As an anime lover, I like it personally, because it shows a great story about a poor boy named Tanjiro who lives with his family and lost them because of a demon. The only person who survives the tragedy is his sister Nezuko who turns into a demon. He promised to protect her no matter what and to find the cause of all of these. There he became a demon slayer. Throughout his journey he travels along with his sister and two other slayer named Zenitsu and Inosuke. What I can say about this anime is that it is an amazing piece of art between culture and mythology, and I gave it a 10/10."
    },
    {
      "username": "poximano",
      "userUrl": "https://www.imdb.com/user/ur89950832",
      "reviewLink": "https://www.imdb.com/review/rw5055249",
      "warningSpoilers": false,
      "date": "12 August 2019",
      "rate": "10",
      "helpful": "52 out of 59 found this helpful.",
      "title": "This is an amazing anime",
      "content": "This is the kind Of anime that I was looking and waiting for truly amazing good job I want to add that in the first time you see a new character(I don't want to be precise so as not to ruin your joy with spoilers) You can find them annoying but give them a chance you will love them every time you wath a new episode It's an anime that needs your attention"
    },
    {
      "username": "trieuduong_94",
      "userUrl": "https://www.imdb.com/user/ur47100174",
      "reviewLink": "https://www.imdb.com/review/rw5906161",
      "warningSpoilers": false,
      "date": "14 July 2020",
      "rate": "10",
      "helpful": "30 out of 35 found this helpful.",
      "title": "So good it even have Michael",
      "content": "I like this anime soo much. It have good story, lovable character, beautiful art style. And it even have Michael Jackson in díguise."
    }
  ],
  "errorMessage": ""
}