{
  "imDbId": "tt0187664",
  "title": "Spaced",
  "fullTitle": "Spaced (TV Series 1999–2001)",
  "type": "TVSeries",
  "year": "1999",
  "episodes": [
    {
      "id": "tt0706383",
      "seasonNumber": "2",
      "episodeNumber": "1",
      "title": "Back",
      "image": "https://m.media-amazon.com/images/M/MV5BZDBmYWU0MzQtOGNjZi00NTE2LWExNmQtNjI3ZDUzZGI3YzdmXkEyXkFqcGdeQXVyMjc0ODQ0NzM@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "23 Feb. 2001",
      "plot": "Daisy returns from her holiday in Asia, unaware that there are two suited men on her trail. When the gang heads to the pub, a showdown takes place.",
      "imDbRating": "8.1",
      "imDbRatingCount": "864"
    },
    {
      "id": "tt0706386",
      "seasonNumber": "2",
      "episodeNumber": "2",
      "title": "Change",
      "image": "https://m.media-amazon.com/images/M/MV5BMWE4MDkyNzktMjAyZi00NzgyLTlhYTQtNDVmMjU4NGFhYWQ4XkEyXkFqcGdeQXVyMzk1MjY5Njc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "2 Mar. 2001",
      "plot": "Still struggling with his feelings of disappointment in the wake of Star Wars: Episode I - The Phantom Menace (1999), Tim loses his job at Fantasy Bazaar after being rude to a customer. Meanwhile, Daisy tries to sign on after her return from Asia, and Brian fears that his inspiration has run dry.",
      "imDbRating": "8.2",
      "imDbRatingCount": "829"
    },
    {
      "id": "tt0706395",
      "seasonNumber": "2",
      "episodeNumber": "3",
      "title": "Mettle",
      "image": "https://m.media-amazon.com/images/M/MV5BYmRlN2FjMzctYmE2Ni00YWUxLWEzMjctOTU5YjZjNGQ4NjQ5XkEyXkFqcGdeQXVyMjc0ODQ0NzM@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "9 Mar. 2001",
      "plot": "Tim and Mike create a robot for Robot Wars and are on their way to the quarter finals. Their rival team, a couple of fellow soldiers of Mike's in the Territorial Army, sabotage Tim and Mike's robot. Brian gets invited to do an installation at a local art gallery, and ends up knocking himself out and becoming a figure in his art display. Mike and Tim exact their revenge on their rivals by rebuilding and improving their robot.",
      "imDbRating": "8.4",
      "imDbRatingCount": "847"
    },
    {
      "id": "tt0706393",
      "seasonNumber": "2",
      "episodeNumber": "4",
      "title": "Help",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ5MGE5NzgtNWNjMi00NTgzLTlkNTctMGYyYzExMTM5N2I3XkEyXkFqcGdeQXVyMjc0ODQ0NzM@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "23 Mar. 2001",
      "plot": "Damian Knox, the President of Darkstar Comics, is searching for a new idea, and asks for Tim's portfolio. Anxiously, Tim organizes his portfolio, being careful to remove anything that might prevent him from getting the job. Such as a demeaning drawing he drew of Knox after their last encounter, when Knox laughed Tim out of his office. After Tyres stops by to pick up the package to be delivered, Tim notices that the demeaning drawing of Knox is not where he left it. Trying to help Tim out, Daisy slipped it back into the portfolio, thinking Tim forgot to include it. It ...",
      "imDbRating": "8.6",
      "imDbRatingCount": "840"
    },
    {
      "id": "tt0706392",
      "seasonNumber": "2",
      "episodeNumber": "5",
      "title": "Gone",
      "image": "https://m.media-amazon.com/images/M/MV5BOTQ4YTBhOTMtYzBiNy00MzM4LTg2ZmQtNWI0NTQ5NGI0YzMyXkEyXkFqcGdeQXVyMjc0ODQ0NzM@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "30 Mar. 2001",
      "plot": "Sophie calls off a date with Tim at the last minute, citing that she has to work late. Having experienced the same thing with his last girlfriend who left him for her boss and his best friend, Tim begins to freak out. Daisy convinces Tim to go out on the town with her that night, leaving Brian and Mike to keep an eye on Colin, which they fail at. Tim and Daisy have an exciting night of drinking, escaping from angry college boys looking to get some weed, an irritating conversation with Tim's arch-nemesis, Duane Benzie, and losing their car/house keys.",
      "imDbRating": "8.8",
      "imDbRatingCount": "910"
    },
    {
      "id": "tt0706388",
      "seasonNumber": "2",
      "episodeNumber": "6",
      "title": "Dissolution",
      "image": "https://m.media-amazon.com/images/M/MV5BMmNlMDMxY2UtN2M1OC00NDgxLThhYjYtYjE5MTRjMmI5MWY5XkEyXkFqcGdeQXVyMjc0ODQ0NzM@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "6 Apr. 2001",
      "plot": "Marsha still thinks that Tim and Daisy are a couple, and when she sees Tim kissing and flirting with Sophie, she gets suspicious. Later that night at Daisy's birthday dinner, Marsha tell Daisy that Tim is cheating on her, which Daisy replies with the truth about their relationship. Marsha, humiliated after realizing that she's the only one who didn't know the truth leaves the restaurant and moves out of the flat.",
      "imDbRating": "8.3",
      "imDbRatingCount": "799"
    },
    {
      "id": "tt0706394",
      "seasonNumber": "2",
      "episodeNumber": "7",
      "title": "Leaves",
      "image": "https://m.media-amazon.com/images/M/MV5BZmJmZGUwY2YtOGU5NS00OTFhLWFjNWMtN2VlZDI1N2YwN2Y2XkEyXkFqcGdeQXVyMjc0ODQ0NzM@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "13 Apr. 2001",
      "plot": "Tim, Daisy, Mike, and Brian go into panic mode and try to find Marsha to get her to come back after they find out that she's selling the house. Sophie is offered a job at Marvel Comics in Seattle, and decides to take it. And, with the future of her current living situation looking bleak, Daisy decides to head back home to work at a local newspaper. After executing a \"bloody spectacular\" plan, the guys succeed in getting Marsha to come home. But, Daisy doesn't know that. Tim decides to rush to the train station to get Daisy, while Mike is tasked with taking Sophie to ...",
      "imDbRating": "8.6",
      "imDbRatingCount": "832"
    }
  ],
  "errorMessage": ""
}