{
  "imDbId": "tt2085059",
  "title": "Black Mirror",
  "fullTitle": "Black Mirror (TV Series 2011– )",
  "type": "TVSeries",
  "year": "2011",
  "items": [
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8778499",
      "warningSpoilers": false,
      "date": "4 January 2023",
      "rate": "9",
      "helpful": "49 out of 51 found this helpful.",
      "title": "Mind Blowing!",
      "content": "Black Mirror is one of the most original and best Mini-Series ever created! Each episode tells a different story and while not all, most of them are fascinating. There are a few episodes that are not so good when compared to the others but most of them are fantastic! Each episode stands alone, this show gets compared to The Twilight Zone a lot and while it's a pretty good comparison, I think Black Mirror is actually a lot better. Every episode has an amazing cast and director. Every episode really makes you think afterwards. It's hard to explain how incredible this show is so just go watch it!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8778521",
      "warningSpoilers": false,
      "date": "4 January 2023",
      "rate": "9",
      "helpful": "42 out of 45 found this helpful.",
      "title": "Wow!",
      "content": "I just finished Black Mirror and the first word that comes to mind is...wow! I've never seen anything like it. The stories are all shocking, disturbing and thought provoking. Most of them are about how technology is changing, has changed us, and not always for the better. It's almost like a satire of how media obsessed we have gotten. Each episode really makes you think afterwards and will make you want to talk about what happened. Every episode is like a mini movie, there're stand alone episodes and every episode has an incredible cast filled with A-list actors. While everyone will have their own favorite episodes, every single one of them will make you think and there's not a \"bad\" episode in the entire series."
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw3228237",
      "warningSpoilers": false,
      "date": "28 April 2015",
      "rate": "",
      "helpful": "284 out of 345 found this helpful.",
      "title": "Fascinating mix of bleak sci-fi, drama, satire and black comedy",
      "content": "Amazing British anthology series with a very intriguing concept. The premise: taking contemporary phenomena (ranging from the wild popularity of talent shows on TV to the impact of social media and smartphones on our lives) as a starting point and speculate how such phenomena could/would evolve in the future. Each episode tells a different story with different protagonists and focuses on a different theme. Of course, the series doesn't explore the beneficial aspects or any positive trends - (where would the fun be in that?) - but clearly approaches its topics from a pessimistic, cynical point of view (hence the title). As the show's creator Charlie Brooker ('Dead Set') puts it: \"...They (the different stories) are all about the way we live now – and the way we might be living in 10 minutes' time if we're clumsy.\"The resulting mix of bleak sci-fi, drama, satire and black comedy makes for highly intelligent Television and ranks among the most original and entertaining shows I've ever come across. The writing and directing are excellent and the cast includes such talented thesps as Domhnall Gleeson, Rory Kinnear, Toby Kebbell, Hayley Atwell, Jon Hamm, Jason Flemyng and Rupert Everett - to name but a few. Unique, fascinating and highly recommended. 9 stars out of 10.Favorite Films: http://www.imdb.com/list/ls054200841/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite Low-Budget and B-Movies: http://www.imdb.com/list/ls054808375/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/"
    },
    {
      "username": "kggpgk",
      "userUrl": "https://www.imdb.com/user/ur158521453",
      "reviewLink": "https://www.imdb.com/review/rw8762846",
      "warningSpoilers": false,
      "date": "28 December 2022",
      "rate": "10",
      "helpful": "30 out of 31 found this helpful.",
      "title": "A Game Changer Show",
      "content": "In the new golden age of tv shows, this one is on another level. That's saying something, considering the expectation we have now. Black Mirror is an anthology series that, if you follow dope stuff, has achieved that rare-air status that if there's another season you feel blessed. It's that good imo. Absolutely a 21st Century version of The Twilight Zone. And it keeps coming back, but on nobody's timeline. And A list stars just flock to it?! I don't really love each and every episode. But there are so many episodes of this program that really leave ya shaken. Because us doesn't seem that far removed from a plausible scenario. Check it out. It'll make ya wonder......"
    },
    {
      "username": "Lukasmj",
      "userUrl": "https://www.imdb.com/user/ur158768880",
      "reviewLink": "https://www.imdb.com/review/rw8674555",
      "warningSpoilers": false,
      "date": "14 November 2022",
      "rate": "9",
      "helpful": "29 out of 33 found this helpful.",
      "title": "Finally something new.",
      "content": "\"Black Mirror\" shows the viewer every episode anew dystopian visions of the future.And I think she does it very well!With every episode you ask yourself, \"What would I do in this situation?\" and \"Is it possible that it will come to this at some point?\".Of course, everyone has their favorite episodes.Mine are: Fifteen Million MeritsThe Entire History of YouShut Up and DanceBlack MuseumUnfortunately, I have to say that I really didn't like season 5 and I hope that \"Black Mirror\" will return to its old character in season 6.Nevertheless, highly recommended and refreshing!!!"
    },
    {
      "username": "Strait_Talk",
      "userUrl": "https://www.imdb.com/user/ur104282976",
      "reviewLink": "https://www.imdb.com/review/rw4951820",
      "warningSpoilers": false,
      "date": "22 June 2019",
      "rate": "9",
      "helpful": "715 out of 810 found this helpful.",
      "title": "Message to reviewers..",
      "content": "You're reviewing the whole show here,not individual seasons or episodes. Don't give a low rating just because you didn't like Miley or the 5th series. Keep everything in context and just rate on your overall impression of Black Mirror. Carry on."
    },
    {
      "username": "dszabo-53136",
      "userUrl": "https://www.imdb.com/user/ur142565377",
      "reviewLink": "https://www.imdb.com/review/rw8820299",
      "warningSpoilers": false,
      "date": "23 January 2023",
      "rate": "10",
      "helpful": "23 out of 25 found this helpful.",
      "title": "Masterpiece",
      "content": "Black Mirror is a British science fiction anthology television series created by Charlie Brooker. Each episode of the series presents a standalone story that explores the darker aspects of modern society, particularly the unanticipated consequences of the use of technology in our daily lives. The show explores various themes such as the impact of technology on society, privacy, surveillance, and human nature.The series is known for its dark and disturbing tone, and its ability to take a thought-provoking look at the ways in which technology is shaping our world. The show's episodes are diverse in terms of genre, tone, and style, with some episodes being more comedic and others being more dramatic and suspenseful.The acting in the series is also noteworthy, with a talented ensemble cast that delivers strong performances in each episode. The writing is also exceptional, with well-crafted and thought-provoking storylines that keep the audience engaged and thinking long after the episode has ended.One of the criticisms that could be made about the series is that some episodes are stronger than others, and some may not resonate with all audiences. Additionally, the series can be quite dark and disturbing, which may not be suitable for all viewers.Overall, I would recommend Black Mirror for fans of science fiction, anthology series, and those looking for a thought-provoking and thought-provoking series that explores the darker aspects of modern society and the impact of technology on our lives. The show's diverse episodes, talented ensemble cast, and well-crafted storylines make it a must-watch series. It's a unique and captivating series that keeps the audience thinking long after the episode has ended."
    },
    {
      "username": "ItsJustSlater",
      "userUrl": "https://www.imdb.com/user/ur45204781",
      "reviewLink": "https://www.imdb.com/review/rw8534391",
      "warningSpoilers": false,
      "date": "11 September 2022",
      "rate": "10",
      "helpful": "34 out of 39 found this helpful.",
      "title": "\"Just skip the first episode...\"",
      "content": "When I talk about this show I always tell people to \"Just skip the first episode and watch it at the end.\" Other than that it's a mind blowing, ground breaking, and terrifying series. It shows exactly where humankind is currently heading and has already reached in some instances. A mirror can only show a reflection of what's already there so Black Mirror is an apt title.I've watched all the episodes multiple times and wish like crazy they had continued the show. It was one of the truly rare shows willing to take an unflinching look at humanity and how screwed up it is, and how much worse it's getting. In my experience, those who don't like the show seem to prefer living with their head in the sand while humming loudly to drown out the noise. Ignorance doesn't change the world, seeing it for what it is and then choosing to be better is what can do it."
    },
    {
      "username": "sharoncsalerni-69765",
      "userUrl": "https://www.imdb.com/user/ur131407977",
      "reviewLink": "https://www.imdb.com/review/rw8692206",
      "warningSpoilers": true,
      "date": "24 November 2022",
      "rate": "8",
      "helpful": "21 out of 23 found this helpful.",
      "title": "Really interesting series",
      "content": "I have been watching the first season for the first time (think I'm about to start episode 5-6?) Anyway so far I have really loved the idea of a series that shows the different ways that us humans are being lost to our computer and phone screens 24/7 and the effects that can have on their entire life. The 2nd episode was just so good! This man was able to drive the guy way off course and even out of the city because he was so wrapped up with his phone. It's scary to see home many things like that could actually happen right now. I have definitely enjoyed pretty much every episode I have seen except for the (i think it's the 3rd one) I admit it started out interesting enough with this boss who puts his unruly employees in his simulation games but the fact that they knew who they were was a little stupid.Oh and the one with Miley Cyrus is so good! I love that little robot!!"
    },
    {
      "username": "ftonks",
      "userUrl": "https://www.imdb.com/user/ur112310583",
      "reviewLink": "https://www.imdb.com/review/rw5872158",
      "warningSpoilers": false,
      "date": "1 July 2020",
      "rate": "",
      "helpful": "42 out of 47 found this helpful.",
      "title": "A unique and different tv experience, with an episode for everyone.",
      "content": "Black Mirror is an anthology, meaning it is complied of different sci fi tales to make their seasons. This means the series doesn't really have any synopsis I can say, the only thing I can say is just watch the bloody show already. Every episode is different, some horror, some romance, some drama, and if you don't like the episode then just skip it, it's not like you'll miss anything as the next episode on your binge watch will be the complete opposite of what you just watched. As far as acting goes, it's top notch, stars like Jon Hamm, Daniel Kaluuya also appear on episodes bringing their amazing performances to the table. Every episode has their own cinematography, some bright and colorful, one episode will be black and white, really adding in on the unique feel of the whole thing. I would definitely call this show a masterpiece, but i almost gave it a 9 because of the 5th series. 2 episodes from the fifth series were pretty sh*te. Smithereens was great, so was Andrew Scott's performance. So yes, a masterpiece still, I won't let 2 bad episodes change that especially when compared to the works of art that the previous series had to offer. So ignore season 5 apart from Smithereens, Smithereens had a very important message and was a wonderfully shot and acted tale. Think of it as a mix of mini films. Now there may be some things that you may not find good, but there's always an episode for you. There 's twists, laughs, scares all in hour long episodes and tied up in a neat little bow just for you. And the Christmas Special was stunning, don't forget to watch that. But if that isn't enough, they have their own interactive film, Bandersnatch. An. Interactive. Film. You choose what the main character does, and it is awesome. So please, If you have the time, try watching this, you will not be disappointed. Verdict: With something new every episode, Black mirror really gets to you, and in all the right ways. A+"
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw4073074",
      "warningSpoilers": false,
      "date": "24 February 2018",
      "rate": "10",
      "helpful": "29 out of 38 found this helpful.",
      "title": "An incredible mix of bleak, dark, outstanding dramas.",
      "content": "Black Mirror has been for me one of the highlights in drama over the last decade. Imaginative, dark, bleak, often cynical, but always absorbing, incredible viewing. What I wouldn't give to sit down and talk with Charlie Brooker, to find out where his ideas come from, and what plans he has for the future of the show. The more bleak they are, the more I tend to enjoy them, and the more an episode has that feeling of 'well that could really happen,' the more I love them still. I will admit I feared when the Channel Four arrangement ended, The Americanisation of the show did worry me a lot, but how wrong was I. The show has definitely changed, and improved for my money, episodes like Playtest and Metalhead are downright scary, while episodes like Hang the DJ and San Junipero tug at the heart strings. How on Earth do you pick a favourite episode, so many outstanding contenders, a few of the best include White Christmas and San Junipero, but the variety is so rich everybody will have a different favourite. I can't wait to see more in the future, Please Charlie :-)"
    },
    {
      "username": "janet-42-167472",
      "userUrl": "https://www.imdb.com/user/ur25991269",
      "reviewLink": "https://www.imdb.com/review/rw3170454",
      "warningSpoilers": false,
      "date": "25 January 2015",
      "rate": "10",
      "helpful": "320 out of 420 found this helpful.",
      "title": "Makes me long for more, and sadder that more are not like this.",
      "content": "Brilliant.Absolutely brilliant.This is NOT anti-utopian, it is an actual mirror of a utopian idea gone terribly wrong.I've only watched 3 episodes so far and each one has made me think, made me go back and look again, made me ask myself why this had never occurred to me before.I would call this sci-fi in the richest sense of the genre.... it is not about science, but how science affects human beings. The one thing that never seems to change is us. Technology evolves, mutates, advances and declines, but human beings, our feelings, our courage, fears, and desires remain within us.I love this show. I hope you will love it too. And I hope you will think."
    },
    {
      "username": "sspureurubin",
      "userUrl": "https://www.imdb.com/user/ur104252673",
      "reviewLink": "https://www.imdb.com/review/rw4927872",
      "warningSpoilers": false,
      "date": "11 June 2019",
      "rate": "9",
      "helpful": "116 out of 158 found this helpful.",
      "title": "One of the best TV shows.",
      "content": "-1 because of that Season 5 that I wished I never knew existed."
    },
    {
      "username": "Amyth47",
      "userUrl": "https://www.imdb.com/user/ur45390749",
      "reviewLink": "https://www.imdb.com/review/rw4516257",
      "warningSpoilers": false,
      "date": "16 December 2018",
      "rate": "10",
      "helpful": "38 out of 55 found this helpful.",
      "title": "A Serious, Intelligent Tv Show.",
      "content": "My Rating : 10/10 ♠ MASTERPIECE ♠How can anyone rate Black Mirror less than 10?! It's one of the most fascinating TV shows ever.Favourite Episodes : Be Right Back, San Junipero, Hang the DJ, The Entire History of You, Nosedive and Fifteen Million Merits.Bring on Season 5!"
    },
    {
      "username": "oscarjneklund",
      "userUrl": "https://www.imdb.com/user/ur154260428",
      "reviewLink": "https://www.imdb.com/review/rw8319238",
      "warningSpoilers": false,
      "date": "10 July 2022",
      "rate": "8",
      "helpful": "14 out of 17 found this helpful.",
      "title": "Well made! 👩‍💻",
      "content": "I like this show because of the great creative and innovative ideas that every new episode brings to is. The only thing is that most of the time, the episodes is very depressing and you don't have a good feeling after have watched it."
    },
    {
      "username": "namtab-09460",
      "userUrl": "https://www.imdb.com/user/ur119119913",
      "reviewLink": "https://www.imdb.com/review/rw8579156",
      "warningSpoilers": false,
      "date": "30 September 2022",
      "rate": "",
      "helpful": "20 out of 20 found this helpful.",
      "title": "An Experience",
      "content": "In our world were we are surrounded by BS content it is rare to find original ideas. This series delivers impressively lot of it. No episode is genius, but some of them are absolutely great. One gets disappointed when the next episode does not blow your mind and is simply good.But god. What a pain it is when youve seen enough for the day and try to watch light content instead. You open Youtube, are confronted with 2 stupid ads, skip through a stupid video and end up on stupid YT shorts. All of them had one in common. They TRIED to be original. Maybe this is why they failed.I do not think the producers Black Mirror primarily thought about how to entertain the audience. The inspiration for the episodes comes from problems we phase currently or fear in the future to deal with. We admire Black Mirror because it mirrors our reality (at least the dark parts). Made up content has flaws. Nothing fits. To many contradictions. But a series based on reality - it wont face these plot holes. And this is what makes many of these episodes so great. They are potential realities.Anyways. I think Black Mirror might change the way you think. And if this is the first time you check that kind of genre out - this change might be major."
    },
    {
      "username": "wivavog",
      "userUrl": "https://www.imdb.com/user/ur66690288",
      "reviewLink": "https://www.imdb.com/review/rw8191160",
      "warningSpoilers": true,
      "date": "31 May 2022",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Amazing and destroyed..... Spoiler is just the person in the last ep",
      "content": "One of the best sci fi series. Since the original twilight zone. Def best modern attempt at anything wrote well and executed the same. I cant believe they wasted the last episode on miley Sirus. Wouldnt be surprised if thats why it ended right after. Or why they had her in the last episode. As she is a simple of something terrible on the horizon. 3 seasons british so next to no episodes per. Novel thinking across the pond. To bad its so limited and underfunded. How a show this good fails. Is beyond be. Well money like everything so nevermind. But what a real loss for any fan of sci fi , fiction , ect. Not one thing has replaced it. The future is looking grim across the board. Music terrible all genres. At least most the world adapts to it and supports it. To bad its just embracing the worst in life. Evolution hard a work ( cough..... d.a$$. .....cough). Hopefully wrong. Hopefully people can progress to non violence and creative endeavors such as this one day. Who knows but God."
    },
    {
      "username": "ahmetkozan",
      "userUrl": "https://www.imdb.com/user/ur48829349",
      "reviewLink": "https://www.imdb.com/review/rw4418748",
      "warningSpoilers": false,
      "date": "25 October 2018",
      "rate": "9",
      "helpful": "186 out of 293 found this helpful.",
      "title": "Definitely worth seeing!",
      "content": "This is truly an amazing show. The issues that the show grapples with and illuminates in each episode are timely and significant. To say that this show deals with the dark side of technology and human nature is to make to simple of a comparison. The stories are mostly set in a dystopian world that is dominated or badly influenced by modern technology. What makes \"Black mirror\" so great is the attention to detail and inter/intrapersonal relationships and how the main character would feel and experience its brave new world. Well thought out plots, characters, settings and really good storytelling. It asks some hard questions of what and where we really want technology to take us. Or maybe already have taken us. Definitely worth seeing! Treat yourself and watch this. 9/10"
    },
    {
      "username": "adriansidmalm",
      "userUrl": "https://www.imdb.com/user/ur82926253",
      "reviewLink": "https://www.imdb.com/review/rw8404331",
      "warningSpoilers": false,
      "date": "5 August 2022",
      "rate": "9",
      "helpful": "23 out of 24 found this helpful.",
      "title": "Brilliant",
      "content": "Excellent show untils the last season. Leaves you wondering after each and every episode if the technological future really is worth it or not. Would have been a 10/10 but the last season lowers the score to 9/10."
    },
    {
      "username": "ian-j-hannah",
      "userUrl": "https://www.imdb.com/user/ur57007404",
      "reviewLink": "https://www.imdb.com/review/rw3138443",
      "warningSpoilers": false,
      "date": "9 December 2014",
      "rate": "9",
      "helpful": "251 out of 327 found this helpful.",
      "title": "Utterly disturbing in the best possible way",
      "content": "The double entendre that is Black Mirror's name summarizes the show perfectly. The first interpretation is that the show looks inwards, at the darker aspects of humanity and society. This is done through the theme of technology, hence the second meaning. The black mirror is the screen that rules our lives.Each self-contained episode is brilliantly crafted and produced. The stories are compelling and the acting is phenomenal. This show is not for those looking exclusively for entertainment, as the episodes leave you with a distinctly empty feeling. Although this is obviously the intent, one cannot help but wonder at the creators' bleak outlook on the world. The presence of bestiality in the first episode could very well deter some viewers, but I would remind them that the show is Twilight Zone-esque in structure as well as theme. The episodes may be watched in any order, as they are all completely independent of one another. The second episode in particular is storytelling of the highest form.Black Mirror is disturbing in the best possible way. It unflinchingly explores the issues of society through deeply intimate stories and characters and their interactions with technology. Let me be clear, it will not leave you feeling fulfilled. Watching it was an exhausting experience that shook me deeply. The thought provoking subject matter combine with powerful, desolate stories and excellent performances to create one of the most unique and brilliant shows that I have seen. It not only holds the viewer's attention while it plays, it enthralls your thoughts long after the credits roll."
    },
    {
      "username": "bedrock_2004",
      "userUrl": "https://www.imdb.com/user/ur18002111",
      "reviewLink": "https://www.imdb.com/review/rw8259530",
      "warningSpoilers": false,
      "date": "21 June 2022",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Every episode leaves me flabbergasted!",
      "content": "I'm a huge Black Mirror fan and was extremely honoured to have taken part in one of the episodes. This shows never fails to enlighten and inform us. It's so ahead of it's time and serves as a real lesson to us, even it seems a little weird. Life is getting weird, so we better be prepared for what's ahead. Charlie Brooker is a genius."
    },
    {
      "username": "xpaulinanowak",
      "userUrl": "https://www.imdb.com/user/ur153298031",
      "reviewLink": "https://www.imdb.com/review/rw8711319",
      "warningSpoilers": false,
      "date": "3 December 2022",
      "rate": "9",
      "helpful": "25 out of 26 found this helpful.",
      "title": "one of the best series you will find",
      "content": "Black mirror is one outstanding series that introduces its audience to unique, interesting, problematic and worst of all terrifyingly possible visions of the future. Each episode tells a different story with a set of new characters (as an anthology does), but one main character stays the same - technology. Black mirror isn't annoying with anti-technology messages, it doesn't have the \"oh, technology bad, book good\" mindset, it focuses on many aspects and possibilities that technology may bring in the future, it doesn't judge, instead lets the viewers do the judgement and come to their own conclusions which was a breath of fresh air to be honest. The first and second seasons were a nice introduction to what the creators had in mind and to the message of Black Mirror. Third and fourth seasons can only be described as masterpieces. All four come with thought-provoking plots and unexpected twists. Boredom is nonexistent. Next comes the fifth season aka Black Mirror's downfall. This season brought us three episodes, they weren't necessarily bad they were very much okay but it felt like you were watching a different series entirely. The creators must have lost their initial focus. The episodes weren't filled with gore, technological advancements, ethical dilemmas, they weren't mind boggling as they once were. You didn't stare in terror or fascination. Fifth season lacked the originality and philosophy aspects that made Black Mirror remarkable. The plots were lazy, nothing crazy, each episode had a celebrity starring cause let's show our audience how much we don't care anymore, we want the money. They brought Anthony Mackie (E1), Andrew Scott (E2) and Miley Cyrus (E3) - and this is not meant to criticise the celebrities, they all did a great job -. This was a huge disappointment for me, i adored this series, i told all my friends to watch it and we discussed what we would do in those bizarre situations, my emotional friends weren't able to finish some episodes because they found them that frightening. It was amazing. And to think this series would throw all it's original initiatives for more views broke my little cinema-obsessed heart.Ending this prolonged review. 9 stars. Wish I could give it a 10 but I can't forgive the creators for the 5th season. They became what they once called out. Not only a shame, a tragedy."
    },
    {
      "username": "POIguy",
      "userUrl": "https://www.imdb.com/user/ur109685083",
      "reviewLink": "https://www.imdb.com/review/rw5607467",
      "warningSpoilers": false,
      "date": "4 April 2020",
      "rate": "10",
      "helpful": "9 out of 11 found this helpful.",
      "title": "A harsh warning to the dangers of technology",
      "content": "This is one of the best sci-fi shows out there! Every episode explores how some aspect of technology, while it has good intentions, can be used to ruin lives and make us further away from each other. I just love how the show integrates the tech to fit in with a great story. The stories are really engaging, enjoyable, and thrilling. I love watching how the technology becomes exploited. The show also has really deep themes: death, love, memory, and human bonding. The anthology format really works for this show. So worth it!!!"
    },
    {
      "username": "carteagle",
      "userUrl": "https://www.imdb.com/user/ur28404589",
      "reviewLink": "https://www.imdb.com/review/rw8189253",
      "warningSpoilers": false,
      "date": "30 May 2022",
      "rate": "9",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Really great series overall.",
      "content": "I started watching this show some years ago but stopped at season 1 which is quite bad. But as i am big scfi fan and not much of scfi shows are watchable nowdays i gave Black Mirror another try.And i have to say show is really worth it. Apart from season 1 which as i stated before is quite bad the rest of seasons are really great. Especially season 3 where every episode is a masterpiece, but seriously a masterpiece."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw8010003",
      "warningSpoilers": false,
      "date": "27 March 2022",
      "rate": "9",
      "helpful": "14 out of 20 found this helpful.",
      "title": "best of the genre",
      "content": "This is a British sci-fi anthology television series. It takes classic series like Twilight Zone into the modern world. One of the interesting aspect is that it's a British show. Back then during streaming infancy, the show was an unknown across the pond. One had to hunt for it. It has the ability to shock but it's also British which made it a little like Masterpiece Theatre. It pushes at the envelope of what it means to be TV. It makes you think. It entertains. It's discussion worthy. It is the best of the genre."
    }
  ],
  "errorMessage": ""
}