{
  "imDbId": "tt2085059",
  "title": "Black Mirror",
  "fullTitle": "Black Mirror (TV Series 2011– )",
  "type": "TVSeries",
  "year": "2011",
  "language": "en",
  "titleInLanguage": "Black Mirror",
  "url": "https://en.wikipedia.org/wiki/Black_Mirror",
  "plotShort": {
    "plainText": "Black Mirror is a British anthology television series created by Charlie Brooker. Individual episodes explore a diversity of genres, but most are set in near-future dystopias with sci-fi technology—a type of speculative fiction. The series is based on The Twilight Zone and uses technology to comment on contemporary social issues. Most episodes are written by Brooker with heavy involvement by the executive producer Annabel Jones.\r\nThere are 22 episodes across five series and one special, in addition to the interactive film Black Mirror: Bandersnatch (2018). The first two series aired on the British network Channel 4 in 2011 and 2013, as did the 2014 special \"White Christmas\". The programme then moved to Netflix, where three further series aired in 2016, 2017 and 2019. A sixth series is scheduled to be released on 15 June 2023. Two related webisode series were produced by Netflix, and a companion book to the first four series, Inside Black Mirror, was published in 2018. Soundtracks to many episodes have been released as albums.\r\nThe series has received critical acclaim and is considered by many reviewers to be one of the best television series of the 2010s. The programme won the Primetime Emmy Award for Outstanding Television Movie three times consecutively for \"San Junipero\", \"USS Callister\" and Bandersnatch. However, some critics consider the morality of the series obvious or cite declining quality over time. Black Mirror, along with American Horror Story, has been credited with repopularising the anthology television format, and a number of episodes have been seen by reviewers as prescient.",
    "html": "<p>Black Mirror is a British anthology television series created by Charlie Brooker. Individual episodes explore a diversity of genres, but most are set in near-future dystopias with sci-fi technology—a type of speculative fiction. The series is based on The Twilight Zone and uses technology to comment on contemporary social issues. Most episodes are written by Brooker with heavy involvement by the executive producer Annabel Jones.</p><p>There are 22 episodes across five series and one special, in addition to the interactive film Black Mirror: Bandersnatch (2018). The first two series aired on the British network Channel 4 in 2011 and 2013, as did the 2014 special \"White Christmas\". The programme then moved to Netflix, where three further series aired in 2016, 2017 and 2019. A sixth series is scheduled to be released on 15 June 2023. Two related webisode series were produced by Netflix, and a companion book to the first four series, Inside Black Mirror, was published in 2018. Soundtracks to many episodes have been released as albums.</p><p>The series has received critical acclaim and is considered by many reviewers to be one of the best television series of the 2010s. The programme won the Primetime Emmy Award for Outstanding Television Movie three times consecutively for \"San Junipero\", \"USS Callister\" and Bandersnatch. However, some critics consider the morality of the series obvious or cite declining quality over time. Black Mirror, along with American Horror Story, has been credited with repopularising the anthology television format, and a number of episodes have been seen by reviewers as prescient.</p>"
  },
  "plotFull": {
    "plainText": "Black Mirror is a British anthology television series created by Charlie Brooker. Individual episodes explore a diversity of genres, but most are set in near-future dystopias with sci-fi technology—a type of speculative fiction. The series is based on The Twilight Zone and uses technology to comment on contemporary social issues. Most episodes are written by Brooker with heavy involvement by the executive producer Annabel Jones.\r\nThere are 22 episodes across five series and one special, in addition to the interactive film Black Mirror: Bandersnatch (2018). The first two series aired on the British network Channel 4 in 2011 and 2013, as did the 2014 special \"White Christmas\". The programme then moved to Netflix, where three further series aired in 2016, 2017 and 2019. A sixth series is scheduled to be released on 15 June 2023. Two related webisode series were produced by Netflix, and a companion book to the first four series, Inside Black Mirror, was published in 2018. Soundtracks to many episodes have been released as albums.\r\nThe series has received critical acclaim and is considered by many reviewers to be one of the best television series of the 2010s. The programme won the Primetime Emmy Award for Outstanding Television Movie three times consecutively for \"San Junipero\", \"USS Callister\" and Bandersnatch. However, some critics consider the morality of the series obvious or cite declining quality over time. Black Mirror, along with American Horror Story, has been credited with repopularising the anthology television format, and a number of episodes have been seen by reviewers as prescient.\r\nEpisodes\r\nThe series was originally commissioned by Channel 4 in the United Kingdom and premiered in December 2011. A second series ran during February 2013. In September 2015, Netflix purchased the programme, commissioning a series of 12 episodes later divided into two series of six episodes. The first six episodes were released simultaneously on Netflix worldwide as the overall third series on 21 October 2016. The fourth series of six episodes was released on 29 December 2017. A fifth series consisting of three episodes was released on 5 June 2019. The first four series, as well as the special \"White Christmas\", have been released on DVD. A sixth series was commissioned in 2022 and is due to be released on 15 June 2023.\r\nPremise\r\nGenre and themes\r\nAs Black Mirror is an anthology series, each episode is standalone and can be watched in any order. The programme is an instance of speculative fiction within science fiction: the majority of episodes are set in dystopian near-futures with novel technologies that exaggerate a trait from contemporary culture, often the internet. An example is \"Crocodile\", where the Recaller device used to view a person's memories is the main difference from the modern world. Many such technologies involve altering the human body or consciousness, with little in-universe concern for the morality of these actions. They provide convenience or freedom to the user, but exacerbate problematic personality traits. Adrian Martin of Screen wrote that many episodes depict \"basic human emotions and desires\" that \"intersect with, and get twisted by, a technological system that invariably spins out of control and into catastrophe\". The settings are generally patriarchal and capitalist. Recurring themes throughout Black Mirror include data privacy and surveillance, virtual reality, individualism and consumerism. Many episodes have plot twists.\r\nHowever, individual episodes explore varying genres. Crime fiction episodes include the police procedurals \"Hated in the Nation\" and \"Smithereens\" and the Nordic noir \"Crocodile\". Horror and psychological horror are features of \"Black Museum\" and \"Playtest\", respectively. The first episode, \"The National Anthem\", contains black comedy and political satire. Some episodes employ features of lighter-hearted genres, such as romance in \"San Junipero\" and \"Striking Vipers\", romantic comedy in \"Hang the DJ\", or space opera in \"USS Callister\". Other genres include drama (\"Fifteen Million Merits\"), psychological thriller (Black Mirror: Bandersnatch), post-apocalyptic fiction (\"Metalhead\"), and war film (\"Men Against Fire\").\r\nBlack Mirror can be seen to demonstrate a negative view of unending pursuit of scientific and technological advancement. The majority of episodes end unhappily. However, characters who carefully consider the risks of technology with which they engage are met with happy endings, as in \"San Junipero\". Juliana Lopes of Via Panorâmica argued that the dystopian settings resemble the French Marxist Guy Debord's concept of the spectacle, wherein mass media create alienation and an unattainable utopia for individuals to pursue. For instance, in \"Nosedive\", the protagonist Lacie strives for a utopian life through superficiality and performativity, in a society where social media success contributes to high socioeconomic status. Academics writing in Quarterly Review of Film and Video found that Black Mirror episodes fall into a genre of \"mind-game films\", wherein protagonists are disoriented and narratives are non-linear or fragmented. Films in this genre include Inception (2010) and Eternal Sunshine of the Spotless Mind (2004), and these works often show the unreliability of the state, technology or family.\r\nSome critics believed that episodes produced under Channel 4 had a more British tone or shared aesthetic qualities not found in later series. In contrast, Netflix episodes including \"Nosedive\", \"San Junipero\", \"USS Callister\" and \"Hang the DJ\" evidence pastel aesthetics, use of 1980s or 1990s nostalgia and lighter-hearted tones than Channel 4 episodes. The frequency of happy endings and positive uses of technology increase in later series.\r\nConnections between episodes\r\nLater episodes include Easter egg allusions—small references to other instalments. For example, the fictional news channel UKN recurs between episodes, and the company Fence's Pizza appears in both \"USS Callister\" and \"Crocodile\". A large number of Easter eggs are found in news tickers and social media feeds shown in various episodes. The final episode of the fourth series \"Black Museum\" includes references to every prior episode of the series. The song \"Anyone Who Knows What Love Is (Will Understand)\" (1964) by Irma Thomas appeared in several episodes: \"Fifteen Million Merits\", \"White Christmas\", \"Men Against Fire\", \"Crocodile\" and \"Rachel, Jack and Ashley Too\". Actors rarely re-occur between episodes, but a small number have appeared in unrelated roles. Hannah John-Kamen played the singer Selma in \"Fifteen Million Merits\" and the journalist Sonja in \"Playtest\"; Michaela Coel appeared as an airline check-in agent in \"Nosedive\" and the crew member Shania in \"USS Callister\"; Daniel Lapaine had the role of the minor character Max in \"The Entire History of You\" and the doctor Daniel in \"Black Museum\".\r\nSome writers believe that Black Mirror episodes are set in a shared universe, due to the abundance of Easter eggs, or tonal and thematic connections across the programme as a whole. Fans and journalists have attempted to establish concrete chronologies between episodes. The series creator Charlie Brooker's comments on this topic changed over time. He initially described the programme's setting as an \"artistic universe\" or \"psychologically shared universe\". After the release of the third series, he said that a line in \"Hated in the Nation\" that references the central crime in \"White Bear\" established a \"canonical\" connection between them. Brooker said of \"Black Museum\" that it \"does actually now seem to imply that it is all a shared universe\". However, he described the Easter eggs in 2018 as \"an extra bit of texture for fans\" and not a consideration that limits the design of new episodes.\r\nProduction\r\nConception\r\nThe \"black mirror\" of the title is the one you'll find on every wall, on every desk, in the palm of every hand: the cold, shiny screen of a TV, a monitor, a smartphone.\r\nCharlie Brooker, The Guardian\r\nThe series was created by Brooker, who was previously known as a comedy writer. He wrote video game reviews for PC Zone in the late 1990s and began writing television reviews for The Guardian and making television in the 2000s. Brooker had completed production of Dead Set (2008), a zombie-based drama series, and while working on Newswipe (2009–2010) and other programmes, decided to make an anthology drama series. It was modelled in the style of The Twilight Zone (1959–1964), Tales of the Unexpected (1979–1988) and Hammer House of Horror (1980).\r\nBrooker recognised that Rod Serling had based The Twilight Zone on contemporary issues, often controversial ones such as racism, but placed them in fictional settings to get around television censors at the time. Brooker realised he could commentate similarly on modern issues, specifically focusing on technology, a topic he explored in producing the series How TV Ruined Your Life (2011). He aimed to explore \"the way we might be living in 10 minutes' time\".\r\nBrooker wanted to keep the anthology approach, using new stories, settings, characters, and actors for each episode, as he felt this was a key element of enjoying series like The Twilight Zone. This approach would allow Black Mirror to contrast with current dramas and serials that had a standard recurring cast. According to Brooker, the production team considered giving the series a linking theme or presenter, but ultimately decided not to.\r\nWriting process\r\nMost episodes are credited solely to Brooker. Many originate with him talking to the executive producer Annabel Jones or others about a \"what-if idea\", and considering if it could be the consequence of some new technology. Brooker said that like his previous comedy writing, the premise is a \"worst case scenario compounded\"; the ideas often make him laugh. Episodes generally have only one aspect at a time that requires suspension of disbelief, and characters' actions are designed to feel authentic even if their predicaments are unusual. Brooker avoided reacting to news events or topical subjects, as there was no guarantee of their continued relevance by the release date.\r\nIn the first two series, Brooker would plan less and write the script as he went along, which led to more dropped subplots and several iterations of rewriting \"White Bear\" in particular. He would write with advertisement breaks in mind, as motivation to reach the next break, and so that he could insert some cliffhanger to make the audience return.: 1:21:25 After the first two series, Brooker wrote a full outline preceding each first draft, finding that picturing an ending made the process easier even if the ending later changed. The outline could vary substantially in length, from two to twenty-five pages.: 13:00\r\n\"San Junipero\" was the first episode written for Netflix and came from a conscious decision to experiment with the tone of a Black Mirror episode. Following this, episodes became more tonally diverse. Brooker would send a brief treatment to Netflix and receive feedback before beginning the first draft. He wrote some material while standing up, as the slight discomfort discouraged time-wasting; he said that the first draft, the \"vomit draft\", was always terrible, but had to be written. He tried to picture the finished episode while writing and sometimes ran while listening to music as a source of inspiration. Brooker said that emotional speeches were easier to write, while sequences with multiple parts were harder. Feedback came from Jones and a director or cast member could have a large influence on the script. Additionally, Brooker and Jones were involved in all aspects of production process, observing the filming and participating in the editing room where possible.: 308 They pointed out logical inconsistencies and worked on the details of technological user interfaces. Brooker said that the final edit could allow aspects that were not working to be fixed, or for introduction of overlooked ideas.\r\nThe episode \"The Entire History of You\" was written by Jesse Armstrong.: 50 William Bridges is co-credited on both \"Shut Up and Dance\" and \"USS Callister\" and Brooker's wife Konnie Huq received a co-credit on \"Fifteen Million Merits\".: 31, 161, 225 For these episodes, Brooker did not write in the same room as his colleagues, instead generally working remotely. One person would write the first draft and they would then iterate between feedback and re-writing.: 1:13:30 On \"Nosedive\", Michael Schur wrote the first half of the script and Rashida Jones wrote the second half, based on ideas and a story outline from Brooker.\r\nSeries 1\r\nThe series' inception was in 2010. Brooker and Jones had begun to work together on Charlie Brooker's Screenwipe, a television review programme which aired from 2006 to 2008. The first pitch for Black Mirror, to the head of comedy at Channel 4, was for eight half-hour episodes by different authors. Technology was a lesser focus, and the worlds were larger and more detailed, which Jones said was not possible to execute properly in the short runtime. The series was then commissioned for three-hour-long episodes. The first script was \"Fifteen Million Merits\".: 6–13 The second was \"Inbound\", an episode that was never produced: it was a science fiction adaptation of what was revealed at the end to be a true story about a boy in the Iraq War.: 1:01:00 Concepts from it were later repurposed for \"Men Against Fire\". The following script pitched became \"The National Anthem\", the first episode to air. The third episode is \"The Entire History of You\".: 6–13\r\nThe programme was produced by Brooker's production company Zeppotron, for the Dutch media company Endemol. Joel Collins served as production designer, with his company Painting Practice working on visual effects. In the early stages of Black Mirror, Jones was keen to avoid casting comedy actors, as Brooker was previously a comedy writer, and they wanted the series to not feel like comedy.: 16, 18 The production occurred concurrent to that of A Touch of Cloth, a satirical police procedural series that Brooker wrote for.: 0:23:00 The series aired weekly from 4 December 2011. \"The National Anthem\" features Rory Kinnear as a British prime minister who must have sex with a pig for a kidnapped Princess to be released. In \"Fifteen Million Merits\", Daniel Kaluuya plays Bing and Jessica Brown Findlay plays Abi, two characters in a society where most people must cycle each day to earn currency. \"The Entire History of You\" follows the married couple Liam and Ffion, played by Toby Kebbell and Jodie Whittaker, respectively, as Liam becomes suspicious of Ffion's relationship to a friend.\r\nSeries 2\r\nThe first series was expensive for Channel 4, as the anthology format meant there were no economies of scale, but Black Mirror was commissioned for a second series of three episodes. Brooker described it as \"more epic in scale, but more intimate in scope\": the episodes have more understated technologies. Brooker commented that the second series mirrors the first: the former has topics of (in order) \"warped political satire\", \"dystopian hellscape\", and \"relationship torn apart by technology\", while the latter presents episodes of these forms in reverse. Each episode in the first series had a male protagonist, so Brooker deliberately wrote female protagonists for the first two episodes, \"Be Right Back\" and \"White Bear\".: 59–64\r\nA trailer for the second series was made by Moving Picture Company and featured a dream sequence, a factory and a large dust cloud, but no extracts of series two episodes. The series aired weekly from 11 February 2013. \"Be Right Back\" follows Martha (Hayley Atwell) turning to artificial intelligence for emotional support while grieving over the death of her partner Ash (Domhnall Gleeson). Lenora Crichlow stars as Victoria Skillane, a woman in an apocalypse who has lost her memory, in \"White Bear\". \"The Waldo Moment\" is a political satire starring Daniel Rigby as Jamie Salter, a man who contests a by-election as an animated bear. Black Mirror was first made available in the US from November 2013 via DirecTV, where episodes aired on Audience and were available online.\r\n\"White Christmas\"\r\nAccording to Brooker, the series was still taking its budget from the comedy department of Channel 4, and there was discussion of whether it should fall under the drama department instead. Shane Allen, head of comedy for Channel 4 at the time, stated in 2018 that someone had been taken aback by the budget for Black Mirror, which was well above the standard for a comedy. The new head of comedy did not have an existing relationship with Brooker and Jones.: 101–103\r\nBrooker reported in 2018 that Channel 4 agreed on a third series of four episodes, but requested detailed synopses of the episodes in advance. Brooker came up with an episode \"Angel of the Morning\", which would later become a story in \"White Christmas\". He also conceived of an episode based on the earlier script \"Inbound\" which would have been similar to the later \"Men Against Fire\". Another episode was named \"Crocodile\", which overlapped in parts with the series four episode of the same name. After a lengthy wait, Brooker and Jones were told that the ideas \"weren't very Black Mirror\". Though Channel 4 may have suggested making a one-off special, Jones said that she felt a lack of clarity from them.: 101–103\r\nJones and Brooker worked on other projects for the next year, such as A Touch of Cloth.: 101–105 They set up House of Tomorrow, a division of Endemol under which later Black Mirror content would be produced. After bumping into a Channel 4 staff member, Brooker emailed the channel to ask how to continue with Black Mirror. Channel 4 had the budget for an hour-long Christmas special, but Jones and Brooker pushed for a 90-minute episode. \"White Christmas\" was a portmanteau of three stories, inspired by works such as the 1983 science fiction film Twilight Zone: The Movie. It starred Jon Hamm as Matt and Rafe Spall as Joe throughout. Actors in the individual stories include: Rasmus Hardiker as Harry, Natalia Tena as Jennifer, Oona Chaplin as Greta, Janet Montgomery as Beth, and Ken Drury as Beth's father. The episode aired on 16 December 2014.: 101–105\r\nMove to Netflix\r\nOn the day of the press screening for \"White Christmas\", Brooker and Jones had a meeting with Channel 4 executives, who told them that they wanted to continue the series but due to budget constraints, it would need to be a co-production. The pair had travelled to Los Angeles a few months prior to try to secure co-production funding but were unsuccessful. The channel also suggested that Brooker could write an episode of Electric Dreams (2017–2018), an adaptation of short stories by Philip K. Dick.: 123–124 They also considered a five-episode series with an overarching storyline, at the suggestion of a US network, nicknaming the plan Game of Drones.\r\nOn 1 December 2014, the first two series of the programme were released on Netflix in the United States after they bought exclusive streaming rights, leading to increased audience attention for the programme. In a bidding war between channels, which included the American companies AMC, Syfy and HBO, Netflix led with a commitment of two series of ten episodes each.: 125–126 Brooker and Jones reported in 2018 that although they and Netflix were both keen to have Channel 4 as equal partners, Channel 4 were evasive. They eventually got a meeting without discussion of a co-production with Netflix, where the channel suggested a renewal for three episodes. The channel later offered six episodes if full treatments could be given in advance, but Brooker and Jones were concerned due to past rejection of ideas. They had a limited time to reply to US offers and chose to make a deal with Netflix.: 125–126\r\nIn September 2015, Netflix commissioned 12 episodes of Black Mirror. By this point, the series was available in around 80 territories. In March 2016, it outbid Channel 4 for the rights to distributing the third series in the UK, with a bid of US$40 million. Endemol released a statement saying that Channel 4 had \"had the opportunity to recommission since 2013 and passed on this and subsequent co-production offers put to them. Further efforts were made to try to reach a settlement regarding a UK window for Channel 4, but these were also sadly to no avail\". In a press release, Channel 4 stated that they \"offered to recommission Black Mirror\". This marked the first time that an online streaming service had gained the rights to a series when the original network had wished to renew it.\r\nSeries 3\r\nIn developing the third series' stories, Brooker had looked at previous episodes and recognised that all of the stories were about characters becoming trapped in a situation from which they could not escape. With the third series, Brooker wanted to explore different formats, adding more conventional stories like a romance and a police procedural. The producer Lucy Dyke commented that Netflix expected the series to become \"bigger and better\" and \"more international\", while production designer Joel Collins said that Netflix was happy to support ideas on the same scale or on a larger scale than previous episodes. The first episode that Brooker wrote for the series was \"San Junipero\", and it was an intentional departure from previous episodes as well as a \"deliberate raspberry-blow\" at fans who were concerned at the series' potential Americanisation.: 126–127\r\nThe titles of the six episodes that make up series three were announced in July 2016, along with the release date. A trailer was released in October 2016. The series was released on Netflix worldwide on 21 October 2016. \"Nosedive\" is an episode starring Bryce Dallas Howard as Lacie, a woman pursuing social media popularity in a world where individuals assign ratings to every interaction with each other. \"Playtest\" is a horror story starring Wyatt Russell as Cooper, a playtester for a new virtual reality game. \"Shut Up and Dance\" is about a teenager blackmailed anonymously over the internet, starring Alex Lawther as Kenny and Jerome Flynn as Hector, and written by Brooker and William Bridges. \"San Junipero\" is a science fiction love story starring Gugu Mbatha-Raw as Kelly and Mackenzie Davis as Yorkie. \"Men Against Fire\" is a war story starring Malachi Kirby as Stripe. \"Hated in the Nation\" is a police procedural, with Kelly Macdonald as Karin Parke and Faye Marsay as Blue Coulson exploring the role of robot bees in a series of deaths.: 129–219\r\nSeries 4\r\nBrooker said that the fourth series of six episodes has more variety than the third. He began writing in July 2016 and continued throughout the 2016 United States presidential election, telling Digital Spy that he did not know what demand there would be for \"nothing but bleak nihilism\" and thus included \"more hope\" than in previous series. The first episode made was \"Arkangel\", which was filmed in Canada in November 2016.: 221 The Netflix budget allowed them to set and film \"Crocodile\" in Iceland and make the special effects-intensive episode \"Metalhead\".: 221 Filming concluded in June 2017.\r\nIn May 2017, a Reddit post unofficially announced the names and directors of the six episodes in series 4 of Black Mirror. The first trailer debuted on 25 August 2017 and two promotional photos were released in September. Beginning on 24 November, Netflix published a series of posters and trailers for each episode in the fourth series of the programme, referred to as the \"13 Days of Black Mirror\", concluding on 6 December with the announcement of the release date, 29 December 2017.\r\n\"USS Callister\" is a space epic based around a video game company, starring Jesse Plemons as CTO Robert Daly and Cristin Milioti as the new programmer Nanette Cole. \"Arkangel\" is an episode about a mother implanting an invasive technology in her daughter, starring Rosemarie DeWitt as Marie and Brenna Harding as Sara, and directed by Jodie Foster. \"Crocodile\" is about the consequences of a hit-and-run, starring Andrea Riseborough as Mia. \"Hang the DJ\" is a love story between Amy, played by Georgina Campbell, and Frank, played by Joe Cole, centred around an artificial intelligence that selects people's partners for them. \"Metalhead\" is a black-and-white apocalypse episode starring Maxine Peake as Bella, a woman trying to escape a robotic \"dog\", and directed by David Slade. \"Black Museum\" is an anthology of three stories, one of which was written by the magician Penn Jillette. Focused around a crime museum, the episode stars Douglas Hodge as Rolo Haynes and Letitia Wright as Nish.: 225–309\r\nAccording to Engadget and Gizmodo, as a means of viral marketing Netflix sent private messages to users of the Turkish website Ekşi Sözlük. The messages were sent from the account \"iamwaldo\" and read, \"We know what you're up to. Watch and see what we will do.\" Although the advertising was met with positive reception from some users, others were concerned by distress that the messages may have caused.\r\nBandersnatch\r\nAfter much media speculation sparked by social media reports of filming, a quickly-deleted Twitter announcement by Netflix and foreign film board certifications, Netflix announced on 27 December 2018 that the film Black Mirror: Bandersnatch would be released the following day. Set in 1984, the film follows Stefan, portrayed by Fionn Whitehead, a young programmer who begins to question reality and experience deteriorating mental health as he adapts a sprawling fantasy novel into a video game. Bandersnatch is an interactive film, regularly prompting the viewer to select one of two choices on screen that affect how the storyline continues; there are over one trillion potential paths to view the work and five distinct endings. Other main cast include Will Poulter, Craig Parkinson, Alice Lowe, and Asim Chaudhry.\r\nSeries 5\r\nNetflix announced the fifth series on 5 March 2018. The complexity of Bandersnatch, which was originally part of the fifth series, delayed production, although Netflix still committed to its release in 2019. The first episode, \"Striking Vipers\", had been filmed prior to Bandersnatch. On 15 May 2019, a trailer for the fifth series was released, indicating it would comprise three episodes.\r\nOn 5 June 2019, the series was released. \"Striking Vipers\" sees Danny (Anthony Mackie) and Karl (Yahya Abdul-Mateen II) exploring a virtual relationship despite Danny's marriage to Theo (Nicole Beharie). \"Smithereens\" follows Andrew Scott as Chris through his kidnapping of a social media company intern. \"Rachel, Jack and Ashley Too\" stars the two titular sisters (Angourie Rice and Madison Davenport) co-operating with a doll cloned from the pop star Ashley O (Miley Cyrus).\r\nSeries 6\r\nAround January 2020, Brooker and Jones announced their departure from House of Tomorrow. Variety reported that intellectual property issues were at the centre of this change, with the series' rights held by Endemol. By February 2020, Brooker and Jones had established Broke and Bones, a new production company. Netflix had arranged a long-term contract for series and other production rights with the Broke and Bones company by July 2020, although rights for Black Mirror still remained with Endemol. According to Variety, this left Brooker and Jones unable to produce additional series unless new agreements were put in place. In a May 2020 interview with Radio Times, Brooker questioned whether the public mood would suit a sixth series of Black Mirror and said that he had been working on more comedic projects.\r\nA sixth series was announced by Netflix in May 2022, to consist of more than three episodes. The series will be produced by Broke and Bones, rather than House of Tomorrow. However, House of Tomorrow's new owners Banijay retain ownership of the programme (Banijay bought the Endemol Shine Group in 2020). Zazie Beetz said that her episode was filmed in June 2022. Variety reported that the series was in production as of July 2022. The first teaser trailer was released on 26 April 2023, announcing a June 2023 release date. On 11 May 2023, Entertainment Weekly announced five episode titles: \"Joan is Awful\"; \"Loch Henry\"; \"Beyond the Sea\"; \"Mazey Day\"; and \"Demon 79\".\r\nBrooker said in 2023 that Black Mirror should continually reinvent itself and display standalone stories; he began the series by \"deliberately upending\" his \"core assumptions\" about the programme. Some episodes contain elements he \"previously sworn blind\" he would avoid.\r\nSuggested spin-offs\r\nSeveral sequel episodes or spin-offs have been suggested, though none have been produced. In 2013, Robert Downey Jr. optioned the episode \"The Entire History of You\" to potentially be made into a film by Warner Bros. and his production company Team Downey; in 2018, the episode's writer Jesse Armstrong said that the project was in \"development hell\". In 2016, Brooker said that he had ideas for sequels to both \"White Bear\" and \"Be Right Back\" that were unlikely to be made. He said in 2017 that there were no plans for a sequel episode to \"San Junipero\". Brooker has suggested that some characters in \"Hated in the Nation\" could potentially recur, as could Colin Ritman (Will Poulter), a Bandersnatch character with awareness of alternate timelines and realities. The director of \"USS Callister\", Toby Haynes, expressed interest in 2018 in a spin-off to the episode as a television series.\r\nReception\r\nCritical response\r\nBlack Mirror has been met with critical acclaim. On Rotten Tomatoes, the first series received a 98% rating, the second received an 87% rating and \"White Christmas\" received an 89% rating. Series three received an 86% rating on Rotten Tomatoes and a score of 82 on Metacritic, series four received an 85% rating on Rotten Tomatoes and a score of 72 on Metacritic, Bandersnatch holds a 73% rating on Rotten Tomatoes and a score of 61 on Metacritic, and series five holds a rating of 68% on Rotten Tomatoes and a score of 65 on Metacritic. According to Víctor Cerdán Martínez of Vivat Academia in 2018, Black Mirror was one of China's five most-watched Western television series.\r\nSeries one garnered praise. David Sims of The A.V. Club gave the first episode—\"The National Anthem\"—an A rating, viewing each character decision and plot revelation as natural. Jim Goodwin of Bleeding Cool complimented the acting. Also, the episode received 145 complaints to the television regulatory body Ofcom, the eighth-largest figure for the year. Reviewing \"Fifteen Million Merits\", Ryan Lambie of Den of Geek extolled the romance between Bing and Abi, as well as the production quality, music and acting. Sam Richards of The Telegraph rated it four stars, praising the \"acerbic humour\". Critical reaction to \"The Entire History of You\" was more mixed. Sims believed that Liam's actions escalated too quickly, but found the central premise of memory recording plausible. Richards thought that the memory technology was not necessary to the story, but James Hibberd of Entertainment Weekly said that the episode's execution was \"sophisticated and flawless\".\r\nThe series two opener, \"Be Right Back\", received critical acclaim. Morgan Jeffery of Digital Spy rated it four stars, praising the characters and emotionality, but criticising the ending. Flickering Myth's Luke Owen lauded the acting of Hayley Atwell as Martha and Domhnall Gleeson as Ash, as well as the directing. \"White Bear\" was well-received, with Simon Cocks of Screen Anarchy and Sims praising the plot twist and Tuppence Middleton's role as Jem. However, Lambie criticised the passiveness of the main character, Victoria. \"The Waldo Moment\" was considered the worst Black Mirror episode of the series by a number of reviewers, and criticised for poor writing and characterisation. \"White Christmas\" garnered positive reception, including praise of the acting and the connections between narrative threads by The A.V. Club's Zack Handlen and The Independent's Ellen Jones.\r\nThe third series received positive reception. Benjamin Lee of The Guardian and Emily St. James of Vox rated it four stars. Writing in Vulture, Jen Chaney analysed that it had an increased variety in setting and tone, as well as longer episodes. Chaney found that four episodes are \"very good to great\", while the other two are \"merely decent\". Lee praised \"Nosedive\" and \"San Junipero\" for their cinematography, acting, increased budget and narrative ambition. Richard Lawson of Vanity Fair reviewed the episodes as \"all engrossing in their way\", but thought \"Men Against Fire\" had the weakest premise and production quality. St. James wrote that the series was, as with previous series, equal parts \"brilliant, ... pretty good, and ... kinda stupid\", praising \"San Junipero\" but finding that other episodes should have been shorter and were \"constrained\" in their shared social media theme.\r\nThe production and acting in series four were praised, as were some episodes. Writing in Variety, Sonia Saraiya commented that four of the six episodes explore human consciousness inside technology. She viewed \"Black Museum\" as a demonstration of the series' flaws, with its artificial consciousness technologies, use of violence and storylines that require characters to \"be stupid and/or evil\". However, Saraiya said that the production and acting was \"beautiful\" and praised \"USS Callister\" and \"Metalhead\" for diverging from Black Mirror's \"typical austere futurism\". Sophie Gilbert of The Atlantic identified the same theme and praised \"USS Callister\" and \"Hang the DJ\", but saw the writing as the biggest weakness of the series. Similarly, The Sydney Morning Herald's Brad Newsome praised the series' casting, and highlighted \"USS Callister\" as well-directed and well-acted.\r\nReception to Bandersnatch and series five was more ambivalent. Linda Holmes of NPR praised Bandersnatch's technical design but criticised the narrative and the repetition of scenes. Holmes said that the audience are not given a reason to care about the main character, Stefan. In The Guardian, Lucy Mangan rated the fifth series four stars, finding that the episodes are disparate in content but share \"a new air of calm authority\" that could reflect \"an increasing confidence\" of the producers. Lucy Pavia of the Evening Standard said that the episodes \"still pack a punch\", with \"Rachel, Jack and Ashley Too\" as the highlight. However, Hugh Montgomery of the BBC said that the programme's \"variable quality is more starkly evident than ever\" with \"one good episode to two middling-to-bad ones\". Montgomery praised \"Striking Vipers\" as \"among the finest and most soulful\" episodes. Additionally, Vulture's Kathryn VanArendonk reviewed that though they are well-produced and well-acted, the instalments lack suitable premises.\r\nCritics of Black Mirror often view the show as self-righteous, with obvious morals in each story. Norman Wilner of Now commented that the first three series are \"rigidly formulaic\" in its presentation of a worst-case scenario and a \"sardonic twist\" in each episode, with \"San Junipero\" as the only exception. Chris Taylor argued for Mashable that the show should be viewed as more comedic and non-serious than prophetic, as it employs \"nightmare logic\" and concepts that require suspension of disbelief. In a satirical article for The Toast, Daniel M. Lavery used the phrase \"what if phones, but too much\" to describe a parody episode plot. This became a common refrain for criticism, encapsulating the paranoia, pessimism or predictability of the programme. Some reviewers found that Black Mirror decreased in quality over time. Vulture critics categorised the show as hit-and-miss, and worsening over time. LaToya Ferguson wrote in Paste that later series saw a \"creative downfall\" and increasing Americanisation, with their lengthier episodes, higher-profile actors and more \"polished\" style not compensating for a decline in quality.\r\nEnd-of-decade lists\r\nA number of publications named Black Mirror on their lists of the best television programmes of the 2010s:\r\nDen of Geek included it as one of the 13 \"Best Sci-Fi, Fantasy, and Horror Shows of the 2010s\" and though Vanity Fair did not include it in their top 10, it listed the episode \"White Bear\" as one of 15 \"honourable mentions\". At the end of 2019 and 2020, a number of publications also created lists of the best television shows of the 21st century to date: readers of Digital Spy voted that Black Mirror was 13th-best, The Guardian included it in 23rd place and Deadline Hollywood reported that it was one of the 21 \"most influential\" programmes.\r\nAccolades\r\nIn November 2012, Black Mirror won Best TV Movie/Miniseries at the International Emmy Awards. Bryce Dallas Howard received a Screen Actors Guild Award nomination for her performance in the episode \"Nosedive\". At the 69th Primetime Emmy Awards, Black Mirror received three nominations with two wins, including Outstanding Television Movie for \"San Junipero\". \"USS Callister\" received three Emmy Awards, including Outstanding Television Movie, and four Emmy nominations in 2018. Bandersnatch won two Emmys in 2019, including Outstanding Television Movie, making it the third consecutive win for Black Mirror in that category.\r\nCultural impact\r\nIn fiction\r\nAlong with American Horror Story (2011–), Black Mirror has been credited with repopularising the anthology format, which was rarely used in the 1990s and 2000s. Changing profit incentives from increased streaming television consumption has been attributed to this success. A 2019 reboot of The Twilight Zone, the primary show to inspire Black Mirror, can be seen as an example of this. It was described by the creator Jordan Peele as broader than Black Mirror in that its themes do not have to be technological, and Sophie Gilbert of The Atlantic suggested that it may have avoided darker themes or explorations into human nature to avoid overlap. Other anthology series that were part of this phenomenon include Room 104 (2017–2020) and Solos (2021). Additionally, Adam White of The Independent stated that Black Mirror and Brooker's other works spawned an era of horror and fantasy that explores modern technology. Science-fiction television that critics have compared to Black Mirror includes Humans (2015–2018) and Upload (2020–).\r\nThe anthology Electric Dreams was widely compared to Black Mirror. Reviewers found Electric Dreams to be less violent and more understated than Black Mirror, but contain some similar plots. For instance, the episode \"Real Life\" is a story about virtual reality. The settings are further in the future and more allegorical. Another example is Inside No. 9 (2014–), a British anthology series that critics saw as more comedic than Black Mirror, and known for intricate plot twists. The creators Reece Shearsmith and Steve Pemberton have a larger role in the show than Brooker does in Black Mirror, as they star in most episodes and direct some in addition to writing them. The serialised British dystopia Years and Years (2019) follows a family from 2019 to 2034, and drew many comparisons to Black Mirror in themes and its near-future technology. The Verge's Liz Shannon Miller called it \"Black Mirror, but with a full and beating heart\". Simon Cellan Jones, who directed the first four of six episodes, saw it as less dystopian than Black Mirror, and with less emphasis on technology. The science fiction film Friend of the World (2020) was arranged like a Black Mirror episode. The creator Brian Patrick Butler said he wanted a sequence of stories with escalating tension, to create a \"creepy and thought-provoking experience\".\r\nThere was critical consensus that the anthology series Soulmates (2020–) is inferior to Black Mirror. Its central conceit—that a company can determine its customers' perfect partner—is similar to the series four episode \"Hang the DJ\". Soulmates was created by William Bridges, a writer for two Black Mirror episodes, and Georgina Campbell—who has a starring role in \"Hang the DJ\"—is a main character in one episode. The One, a science-fiction programme with the same premise, was also seen as lesser than Black Mirror by critics. The romantic comedy Made for Love (2021) stars Cristin Milioti of series four episode \"USS Callister\" and its technological premise of a woman whose ex-husband implanted a monitoring device in her body was compared to Black Mirror. Milioti saw both stories as about \"a woman trying to find herself\".\r\nComparisons to reality\r\nBrooker has often been described by commentators as prescient in his scripts for Black Mirror. In 2015, G. Clay Whitaker of The Daily Beast called the show a Magic 8-Ball. The first episode, \"The National Anthem\", features the UK prime minister blackmailed into having sexual intercourse with a pig. Four years later, the Daily Mail published allegations that the then-prime minister David Cameron had placed a \"private part of his anatomy\" into the mouth of a dead pig as an initiation rite at university. Brooker later said that after hearing the news, he \"did genuinely for a moment wonder if reality was a simulation, whether it exists only to trick me\". In \"The Waldo Moment\", a 2013 episode, the animated cartoon Waldo places second in a UK by-election. The US presidency of the media personality Donald Trump (2017–2021) and the Ukrainian presidency of the comedian Volodymyr Zelenskyy (2019–) were compared by journalists to the platform of Waldo. Brooker described Trump as \"an anti-politics candidate who's raucous and defensive\" and \"offers nothing\", like Waldo. Adrian Karatnycky of Politico stated that as with Waldo, Zelenskyy had few clear policy positions prior to his election.\r\nThe 2016 episode \"Nosedive\" presents a society in which citizens rate interactions with each other from one to five stars and receive an overall rating that largely determines their socioeconomic status. This has been compared to China's Social Credit System, where local governments collect data on citizens to assign them an overall score. Example data points include publicly criticising the government, defaulting on a loan or having high-rated friends. Like the system in \"Nosedive\", a low score can limit a person's access to transport. \"Be Right Back\" shows an artificial intelligence technology designed to mimic a deceased loved one. Chatbots with similar functionality and personalisation have been compared to this premise, as has a 2022 announcement that a future Amazon Alexa feature will imitate voices of dead loved ones. \"Shut Up and Dance\" is about a man who is blackmailed after footage of him masturbating is recorded through his webcam. Computer viruses can allow for covert recording through an unsuspecting person's webcam, and similar real-life blackmail has been reported.\r\nMore minor facets of episodes have also been seen as prescient. Ten days after \"Crocodile\" depicted a self-driving pizza delivery truck, Toyota and Pizza Hut presented plans for a driverless pizza delivery vehicle at the 2018 Consumer Electronics Show. \"Fifteen Million Merits\" features a talent show with a virtual animated audience based on Britain's Got Talent. In 2020, due to the COVID-19 pandemic, Britain's Got Talent had a virtual audience, which had an aesthetic resembling that of \"Fifteen Million Merits\". Other real-life technologies have been described as progress towards those seen in Black Mirror, such as the motion capture animation of Waldo in \"The Waldo Moment\", the augmented reality military system from \"Men Against Fire\" and the artificial bees in \"Hated in the Nation\".\r\nSpin-off media\r\nA number of Black Mirror tie-in products have been released. A Nosedive board game based on the episode of the same name was produced by Asmodee. Released on 25 November 2018, the game requires between three and six players and is designed to last for roughly 45 minutes. The fictional game Nohzdyve, which is featured in Bandersnatch and named after the episode \"Nosedive\", was created by Netflix for a ZX Spectrum emulator and released on a Bandersnatch tie-in website. A 2017 museum exhibit at the Barbican Centre, entitled Into the Unknown: A Journey Through Science Fiction, included an installation based on \"Fifteen Million Merits\". A number of mock \"Tucker's Newsagent and Games\" storefronts, designed after the fictional Bandersnatch shop of the same name, were erected in Birmingham and London shortly after the film's release in 2018.\r\nSoundtracks\r\nSoundtracks to 12 of the 23 instalments have been released on online streaming services: \"Be Right Back\", \"White Bear\", \"White Christmas\", \"Nosedive\", \"San Junipero\", \"Men Against Fire\", \"Hated in the Nation\", \"USS Callister\", \"Arkangel\", \"Hang the DJ\", \"Black Museum\" and \"Smithereens\". Brooker also released a 42-track Spotify playlist of songs that were either featured in \"San Junipero\" or planned for inclusion at some stage. The \"Hang the DJ\" soundtrack, credited to Alex Somers and featuring Sigur Rós, was additionally released on vinyl. The song \"On a Roll\" from \"Rachel, Jack and Ashley Too\" is based on the Nine Inch Nails song \"Head Like a Hole\". It was released by the performer, Miley Cyrus, under her character's name Ashley O and went on to chart in multiple countries. The B-side \"Right Where I Belong\" was another Nine Inch Nails adaptation featured in the episode.\r\nWebisodes\r\nA series of webisodes, titled Little Black Mirror (Polish: Czarne Lusterko), was produced for Netflix Polska by Jacek Ambrosiewicz, in collaboration with Polish YouTubers. Released on 19 January 2018, the four shorts vary between eight and twenty-one minutes in length. 69.90 explores \"loneliness and gaming\", according to the creators Huyen Pham and Marcin Nguyen; they discussed 20 different ideas before deciding on a computer simulation which is indistinguishable from real life. The Breakup features Krzysztof Gonciarz and Kasia Mecinski: it used realism and ordinary technology, such as a Panasonic Lumix DC-GH5 that emulates vlog aesthetics. The Sum of Happiness was posted on Martin Stankiewicz's YouTube channel and focuses on a neurological implant and a relationship app, previously explored Black Mirror topics. 1%, filmed by Groupa Filmowa Darwin, and is about a violent piece of obstetrics technology.\r\nA second series of webisodes, initially announced as Little Black Mirror but eventually renamed Stories From Our Future, was directed for Netflix América Latina by American YouTuber Rudy Mancuso. Initially planned for release on Netflix América Latina's YouTube channel, as part of promotion for the programme's fifth series, the original trailer for the project was removed by Netflix. The shorts were released on 10 June 2019 on YouTube channels of those involved. Cure for Loneliness was released on Mancuso's channel; Getting to Know You was released on Lele Pons' channel; The Healthy Alternative was released on Juanpa Zurita's channel. Also featured in the series is Australian actor Maia Mitchell.\r\nLiterature\r\nIn June 2018, the oral history companion book Inside Black Mirror was announced. Brooker, Jones and Jason Arnopp are the credited writers. The book features sections on the 19 episodes in the first four series, each consisting of conversational interviews from cast and crew along with stills and behind-the-scenes images. The book was released in the UK on 1 November 2018 and in the US on 20 November 2018 from Penguin Random House. Starburst rated the book ten out of ten stars, praising its \"wonderfully-comprehensive format\" and summarising it as \"blunt, brittle, often killingly funny and lavishly-illustrated\".\r\nIn June 2017, Brooker announced a series of prose stories based on Black Mirror. The first volume was to be published on 20 February 2018 and scheduled to be edited by Brooker; two further volumes were planned for later in 2018 and in 2019. Planned writers included the science fiction authors Cory Doctorow, Sylvain Neuvel and Catherine Webb, under the pseudonym Claire North. The project was postponed indefinitely in 2018 as Brooker and Jones could not dedicate enough time to it, with Brooker saying \"I'm not sure when or if will appear. Probably not\".\r\nBlack Mirror Labyrinth\r\nIn mid-2019, Thorpe Park Resort in Chertsey, United Kingdom, announced that it was to open a walkthrough maze, the \"Black Mirror Labyrinth\". The maze was scheduled to open in March 2020, but this was delayed because of the COVID-19 pandemic. It opened on 21 May 2021 and is themed around artificial intelligence. The subject's name and a photo taken of them are used to personalise the maze.",
    "html": "<p>Black Mirror is a British anthology television series created by Charlie Brooker. Individual episodes explore a diversity of genres, but most are set in near-future dystopias with sci-fi technology—a type of speculative fiction. The series is based on The Twilight Zone and uses technology to comment on contemporary social issues. Most episodes are written by Brooker with heavy involvement by the executive producer Annabel Jones.</p><p>There are 22 episodes across five series and one special, in addition to the interactive film Black Mirror: Bandersnatch (2018). The first two series aired on the British network Channel 4 in 2011 and 2013, as did the 2014 special \"White Christmas\". The programme then moved to Netflix, where three further series aired in 2016, 2017 and 2019. A sixth series is scheduled to be released on 15 June 2023. Two related webisode series were produced by Netflix, and a companion book to the first four series, Inside Black Mirror, was published in 2018. Soundtracks to many episodes have been released as albums.</p><p>The series has received critical acclaim and is considered by many reviewers to be one of the best television series of the 2010s. The programme won the Primetime Emmy Award for Outstanding Television Movie three times consecutively for \"San Junipero\", \"USS Callister\" and Bandersnatch. However, some critics consider the morality of the series obvious or cite declining quality over time. Black Mirror, along with American Horror Story, has been credited with repopularising the anthology television format, and a number of episodes have been seen by reviewers as prescient.</p><br/><h3>Episodes</h3><p>The series was originally commissioned by Channel 4 in the United Kingdom and premiered in December 2011. A second series ran during February 2013. In September 2015, Netflix purchased the programme, commissioning a series of 12 episodes later divided into two series of six episodes. The first six episodes were released simultaneously on Netflix worldwide as the overall third series on 21 October 2016. The fourth series of six episodes was released on 29 December 2017. A fifth series consisting of three episodes was released on 5 June 2019. The first four series, as well as the special \"White Christmas\", have been released on DVD. A sixth series was commissioned in 2022 and is due to be released on 15 June 2023.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Series</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"3\">Originally released</th></tr><tr><th scope=\"col\">First released</th><th scope=\"col\">Last released</th><th scope=\"col\" style=\"padding:0 8px\">Network</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">3</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">4 December 2011</td><td style=\"padding:0 8px\">18 December 2011</td><td rowspan=\"3\"><span>Channel 4</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">3</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">11 February 2013</td><td style=\"padding:0 8px\">25 February 2013</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"3\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Special</span></span></span></span></th><td colspan=\"2\" style=\"padding:0.2em 0.4em\">16 December 2014</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">21 October 2016</td><td rowspan=\"5\"><span>Netflix</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">29 December 2017</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"3\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Interactive film</span></span></span></span></th><td colspan=\"2\" style=\"padding:0.2em 0.4em\">28 December 2018</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">3</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">5 June 2019</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">5</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">15 June 2023</td></tr></tbody></table><br/><h3>Premise</h3><h4>Genre and themes</h4><p>As Black Mirror is an anthology series, each episode is standalone and can be watched in any order. The programme is an instance of speculative fiction within science fiction: the majority of episodes are set in dystopian near-futures with novel technologies that exaggerate a trait from contemporary culture, often the internet. An example is \"Crocodile\", where the Recaller device used to view a person's memories is the main difference from the modern world. Many such technologies involve altering the human body or consciousness, with little in-universe concern for the morality of these actions. They provide convenience or freedom to the user, but exacerbate problematic personality traits. Adrian Martin of Screen wrote that many episodes depict \"basic human emotions and desires\" that \"intersect with, and get twisted by, a technological system that invariably spins out of control and into catastrophe\". The settings are generally patriarchal and capitalist. Recurring themes throughout Black Mirror include data privacy and surveillance, virtual reality, individualism and consumerism. Many episodes have plot twists.</p><p>However, individual episodes explore varying genres. Crime fiction episodes include the police procedurals \"Hated in the Nation\" and \"Smithereens\" and the Nordic noir \"Crocodile\". Horror and psychological horror are features of \"Black Museum\" and \"Playtest\", respectively. The first episode, \"The National Anthem\", contains black comedy and political satire. Some episodes employ features of lighter-hearted genres, such as romance in \"San Junipero\" and \"Striking Vipers\", romantic comedy in \"Hang the DJ\", or space opera in \"USS Callister\". Other genres include drama (\"Fifteen Million Merits\"), psychological thriller (Black Mirror: Bandersnatch), post-apocalyptic fiction (\"Metalhead\"), and war film (\"Men Against Fire\").</p><p>Black Mirror can be seen to demonstrate a negative view of unending pursuit of scientific and technological advancement. The majority of episodes end unhappily. However, characters who carefully consider the risks of technology with which they engage are met with happy endings, as in \"San Junipero\". Juliana Lopes of Via Panorâmica argued that the dystopian settings resemble the French Marxist Guy Debord's concept of the spectacle, wherein mass media create alienation and an unattainable utopia for individuals to pursue. For instance, in \"Nosedive\", the protagonist Lacie strives for a utopian life through superficiality and performativity, in a society where social media success contributes to high socioeconomic status. Academics writing in Quarterly Review of Film and Video found that Black Mirror episodes fall into a genre of \"mind-game films\", wherein protagonists are disoriented and narratives are non-linear or fragmented. Films in this genre include Inception (2010) and Eternal Sunshine of the Spotless Mind (2004), and these works often show the unreliability of the state, technology or family.</p><p>Some critics believed that episodes produced under Channel 4 had a more British tone or shared aesthetic qualities not found in later series. In contrast, Netflix episodes including \"Nosedive\", \"San Junipero\", \"USS Callister\" and \"Hang the DJ\" evidence pastel aesthetics, use of 1980s or 1990s nostalgia and lighter-hearted tones than Channel 4 episodes. The frequency of happy endings and positive uses of technology increase in later series.</p><h4>Connections between episodes</h4><p>Later episodes include Easter egg allusions—small references to other instalments. For example, the fictional news channel UKN recurs between episodes, and the company Fence's Pizza appears in both \"USS Callister\" and \"Crocodile\". A large number of Easter eggs are found in news tickers and social media feeds shown in various episodes. The final episode of the fourth series \"Black Museum\" includes references to every prior episode of the series. The song \"Anyone Who Knows What Love Is (Will Understand)\" (1964) by Irma Thomas appeared in several episodes: \"Fifteen Million Merits\", \"White Christmas\", \"Men Against Fire\", \"Crocodile\" and \"Rachel, Jack and Ashley Too\". Actors rarely re-occur between episodes, but a small number have appeared in unrelated roles. Hannah John-Kamen played the singer Selma in \"Fifteen Million Merits\" and the journalist Sonja in \"Playtest\"; Michaela Coel appeared as an airline check-in agent in \"Nosedive\" and the crew member Shania in \"USS Callister\"; Daniel Lapaine had the role of the minor character Max in \"The Entire History of You\" and the doctor Daniel in \"Black Museum\".</p><p>Some writers believe that Black Mirror episodes are set in a shared universe, due to the abundance of Easter eggs, or tonal and thematic connections across the programme as a whole. Fans and journalists have attempted to establish concrete chronologies between episodes. The series creator Charlie Brooker's comments on this topic changed over time. He initially described the programme's setting as an \"artistic universe\" or \"psychologically shared universe\". After the release of the third series, he said that a line in \"Hated in the Nation\" that references the central crime in \"White Bear\" established a \"canonical\" connection between them. Brooker said of \"Black Museum\" that it \"does actually now seem to imply that it is all a shared universe\". However, he described the Easter eggs in 2018 as \"an extra bit of texture for fans\" and not a consideration that limits the design of new episodes.</p><br/><h3>Production</h3><h4>Conception</h4><blockquote>The \"black mirror\" of the title is the one you'll find on every wall, on every desk, in the palm of every hand: the cold, shiny screen of a TV, a monitor, a smartphone.</blockquote><p>Charlie Brooker, The Guardian</p><p>The series was created by Brooker, who was previously known as a comedy writer. He wrote video game reviews for PC Zone in the late 1990s and began writing television reviews for The Guardian and making television in the 2000s. Brooker had completed production of Dead Set (2008), a zombie-based drama series, and while working on Newswipe (2009–2010) and other programmes, decided to make an anthology drama series. It was modelled in the style of The Twilight Zone (1959–1964), Tales of the Unexpected (1979–1988) and Hammer House of Horror (1980).</p><p>Brooker recognised that Rod Serling had based The Twilight Zone on contemporary issues, often controversial ones such as racism, but placed them in fictional settings to get around television censors at the time. Brooker realised he could commentate similarly on modern issues, specifically focusing on technology, a topic he explored in producing the series How TV Ruined Your Life (2011). He aimed to explore \"the way we might be living in 10 minutes' time\".</p><p>Brooker wanted to keep the anthology approach, using new stories, settings, characters, and actors for each episode, as he felt this was a key element of enjoying series like The Twilight Zone. This approach would allow Black Mirror to contrast with current dramas and serials that had a standard recurring cast. According to Brooker, the production team considered giving the series a linking theme or presenter, but ultimately decided not to.</p><h4>Writing process</h4><p>Most episodes are credited solely to Brooker. Many originate with him talking to the executive producer Annabel Jones or others about a \"what-if idea\", and considering if it could be the consequence of some new technology. Brooker said that like his previous comedy writing, the premise is a \"worst case scenario compounded\"; the ideas often make him laugh. Episodes generally have only one aspect at a time that requires suspension of disbelief, and characters' actions are designed to feel authentic even if their predicaments are unusual. Brooker avoided reacting to news events or topical subjects, as there was no guarantee of their continued relevance by the release date.</p><p>In the first two series, Brooker would plan less and write the script as he went along, which led to more dropped subplots and several iterations of rewriting \"White Bear\" in particular. He would write with advertisement breaks in mind, as motivation to reach the next break, and so that he could insert some cliffhanger to make the audience return.: 1:21:25 After the first two series, Brooker wrote a full outline preceding each first draft, finding that picturing an ending made the process easier even if the ending later changed. The outline could vary substantially in length, from two to twenty-five pages.: 13:00</p><p>\"San Junipero\" was the first episode written for Netflix and came from a conscious decision to experiment with the tone of a Black Mirror episode. Following this, episodes became more tonally diverse. Brooker would send a brief treatment to Netflix and receive feedback before beginning the first draft. He wrote some material while standing up, as the slight discomfort discouraged time-wasting; he said that the first draft, the \"vomit draft\", was always terrible, but had to be written. He tried to picture the finished episode while writing and sometimes ran while listening to music as a source of inspiration. Brooker said that emotional speeches were easier to write, while sequences with multiple parts were harder. Feedback came from Jones and a director or cast member could have a large influence on the script. Additionally, Brooker and Jones were involved in all aspects of production process, observing the filming and participating in the editing room where possible.: 308 They pointed out logical inconsistencies and worked on the details of technological user interfaces. Brooker said that the final edit could allow aspects that were not working to be fixed, or for introduction of overlooked ideas.</p><p>The episode \"The Entire History of You\" was written by Jesse Armstrong.: 50 William Bridges is co-credited on both \"Shut Up and Dance\" and \"USS Callister\" and Brooker's wife Konnie Huq received a co-credit on \"Fifteen Million Merits\".: 31, 161, 225 For these episodes, Brooker did not write in the same room as his colleagues, instead generally working remotely. One person would write the first draft and they would then iterate between feedback and re-writing.: 1:13:30 On \"Nosedive\", Michael Schur wrote the first half of the script and Rashida Jones wrote the second half, based on ideas and a story outline from Brooker.</p><h4>Series 1</h4><p>The series' inception was in 2010. Brooker and Jones had begun to work together on Charlie Brooker's Screenwipe, a television review programme which aired from 2006 to 2008. The first pitch for Black Mirror, to the head of comedy at Channel 4, was for eight half-hour episodes by different authors. Technology was a lesser focus, and the worlds were larger and more detailed, which Jones said was not possible to execute properly in the short runtime. The series was then commissioned for three-hour-long episodes. The first script was \"Fifteen Million Merits\".: 6–13 The second was \"Inbound\", an episode that was never produced: it was a science fiction adaptation of what was revealed at the end to be a true story about a boy in the Iraq War.: 1:01:00 Concepts from it were later repurposed for \"Men Against Fire\". The following script pitched became \"The National Anthem\", the first episode to air. The third episode is \"The Entire History of You\".: 6–13</p><p>The programme was produced by Brooker's production company Zeppotron, for the Dutch media company Endemol. Joel Collins served as production designer, with his company Painting Practice working on visual effects. In the early stages of Black Mirror, Jones was keen to avoid casting comedy actors, as Brooker was previously a comedy writer, and they wanted the series to not feel like comedy.: 16, 18 The production occurred concurrent to that of A Touch of Cloth, a satirical police procedural series that Brooker wrote for.: 0:23:00 The series aired weekly from 4 December 2011. \"The National Anthem\" features Rory Kinnear as a British prime minister who must have sex with a pig for a kidnapped Princess to be released. In \"Fifteen Million Merits\", Daniel Kaluuya plays Bing and Jessica Brown Findlay plays Abi, two characters in a society where most people must cycle each day to earn currency. \"The Entire History of You\" follows the married couple Liam and Ffion, played by Toby Kebbell and Jodie Whittaker, respectively, as Liam becomes suspicious of Ffion's relationship to a friend.</p><h4>Series 2</h4><p>The first series was expensive for Channel 4, as the anthology format meant there were no economies of scale, but Black Mirror was commissioned for a second series of three episodes. Brooker described it as \"more epic in scale, but more intimate in scope\": the episodes have more understated technologies. Brooker commented that the second series mirrors the first: the former has topics of (in order) \"warped political satire\", \"dystopian hellscape\", and \"relationship torn apart by technology\", while the latter presents episodes of these forms in reverse. Each episode in the first series had a male protagonist, so Brooker deliberately wrote female protagonists for the first two episodes, \"Be Right Back\" and \"White Bear\".: 59–64</p><p>A trailer for the second series was made by Moving Picture Company and featured a dream sequence, a factory and a large dust cloud, but no extracts of series two episodes. The series aired weekly from 11 February 2013. \"Be Right Back\" follows Martha (Hayley Atwell) turning to artificial intelligence for emotional support while grieving over the death of her partner Ash (Domhnall Gleeson). Lenora Crichlow stars as Victoria Skillane, a woman in an apocalypse who has lost her memory, in \"White Bear\". \"The Waldo Moment\" is a political satire starring Daniel Rigby as Jamie Salter, a man who contests a by-election as an animated bear. Black Mirror was first made available in the US from November 2013 via DirecTV, where episodes aired on Audience and were available online.</p><h4>\"White Christmas\"</h4><p>According to Brooker, the series was still taking its budget from the comedy department of Channel 4, and there was discussion of whether it should fall under the drama department instead. Shane Allen, head of comedy for Channel 4 at the time, stated in 2018 that someone had been taken aback by the budget for Black Mirror, which was well above the standard for a comedy. The new head of comedy did not have an existing relationship with Brooker and Jones.: 101–103</p><p>Brooker reported in 2018 that Channel 4 agreed on a third series of four episodes, but requested detailed synopses of the episodes in advance. Brooker came up with an episode \"Angel of the Morning\", which would later become a story in \"White Christmas\". He also conceived of an episode based on the earlier script \"Inbound\" which would have been similar to the later \"Men Against Fire\". Another episode was named \"Crocodile\", which overlapped in parts with the series four episode of the same name. After a lengthy wait, Brooker and Jones were told that the ideas \"weren't very Black Mirror\". Though Channel 4 may have suggested making a one-off special, Jones said that she felt a lack of clarity from them.: 101–103</p><p>Jones and Brooker worked on other projects for the next year, such as A Touch of Cloth.: 101–105 They set up House of Tomorrow, a division of Endemol under which later Black Mirror content would be produced. After bumping into a Channel 4 staff member, Brooker emailed the channel to ask how to continue with Black Mirror. Channel 4 had the budget for an hour-long Christmas special, but Jones and Brooker pushed for a 90-minute episode. \"White Christmas\" was a portmanteau of three stories, inspired by works such as the 1983 science fiction film Twilight Zone: The Movie. It starred Jon Hamm as Matt and Rafe Spall as Joe throughout. Actors in the individual stories include: Rasmus Hardiker as Harry, Natalia Tena as Jennifer, Oona Chaplin as Greta, Janet Montgomery as Beth, and Ken Drury as Beth's father. The episode aired on 16 December 2014.: 101–105</p><h4>Move to Netflix</h4><p>On the day of the press screening for \"White Christmas\", Brooker and Jones had a meeting with Channel 4 executives, who told them that they wanted to continue the series but due to budget constraints, it would need to be a co-production. The pair had travelled to Los Angeles a few months prior to try to secure co-production funding but were unsuccessful. The channel also suggested that Brooker could write an episode of Electric Dreams (2017–2018), an adaptation of short stories by Philip K. Dick.: 123–124 They also considered a five-episode series with an overarching storyline, at the suggestion of a US network, nicknaming the plan Game of Drones.</p><p>On 1 December 2014, the first two series of the programme were released on Netflix in the United States after they bought exclusive streaming rights, leading to increased audience attention for the programme. In a bidding war between channels, which included the American companies AMC, Syfy and HBO, Netflix led with a commitment of two series of ten episodes each.: 125–126 Brooker and Jones reported in 2018 that although they and Netflix were both keen to have Channel 4 as equal partners, Channel 4 were evasive. They eventually got a meeting without discussion of a co-production with Netflix, where the channel suggested a renewal for three episodes. The channel later offered six episodes if full treatments could be given in advance, but Brooker and Jones were concerned due to past rejection of ideas. They had a limited time to reply to US offers and chose to make a deal with Netflix.: 125–126</p><p>In September 2015, Netflix commissioned 12 episodes of Black Mirror. By this point, the series was available in around 80 territories. In March 2016, it outbid Channel 4 for the rights to distributing the third series in the UK, with a bid of US$40 million. Endemol released a statement saying that Channel 4 had \"had the opportunity to recommission since 2013 and passed on this and subsequent co-production offers put to them. Further efforts were made to try to reach a settlement regarding a UK window for Channel 4, but these were also sadly to no avail\". In a press release, Channel 4 stated that they \"offered to recommission Black Mirror\". This marked the first time that an online streaming service had gained the rights to a series when the original network had wished to renew it.</p><h4>Series 3</h4><p>In developing the third series' stories, Brooker had looked at previous episodes and recognised that all of the stories were about characters becoming trapped in a situation from which they could not escape. With the third series, Brooker wanted to explore different formats, adding more conventional stories like a romance and a police procedural. The producer Lucy Dyke commented that Netflix expected the series to become \"bigger and better\" and \"more international\", while production designer Joel Collins said that Netflix was happy to support ideas on the same scale or on a larger scale than previous episodes. The first episode that Brooker wrote for the series was \"San Junipero\", and it was an intentional departure from previous episodes as well as a \"deliberate raspberry-blow\" at fans who were concerned at the series' potential Americanisation.: 126–127</p><p>The titles of the six episodes that make up series three were announced in July 2016, along with the release date. A trailer was released in October 2016. The series was released on Netflix worldwide on 21 October 2016. \"Nosedive\" is an episode starring Bryce Dallas Howard as Lacie, a woman pursuing social media popularity in a world where individuals assign ratings to every interaction with each other. \"Playtest\" is a horror story starring Wyatt Russell as Cooper, a playtester for a new virtual reality game. \"Shut Up and Dance\" is about a teenager blackmailed anonymously over the internet, starring Alex Lawther as Kenny and Jerome Flynn as Hector, and written by Brooker and William Bridges. \"San Junipero\" is a science fiction love story starring Gugu Mbatha-Raw as Kelly and Mackenzie Davis as Yorkie. \"Men Against Fire\" is a war story starring Malachi Kirby as Stripe. \"Hated in the Nation\" is a police procedural, with Kelly Macdonald as Karin Parke and Faye Marsay as Blue Coulson exploring the role of robot bees in a series of deaths.: 129–219</p><h4>Series 4</h4><p>Brooker said that the fourth series of six episodes has more variety than the third. He began writing in July 2016 and continued throughout the 2016 United States presidential election, telling Digital Spy that he did not know what demand there would be for \"nothing but bleak nihilism\" and thus included \"more hope\" than in previous series. The first episode made was \"Arkangel\", which was filmed in Canada in November 2016.: 221 The Netflix budget allowed them to set and film \"Crocodile\" in Iceland and make the special effects-intensive episode \"Metalhead\".: 221 Filming concluded in June 2017.</p><p>In May 2017, a Reddit post unofficially announced the names and directors of the six episodes in series 4 of Black Mirror. The first trailer debuted on 25 August 2017 and two promotional photos were released in September. Beginning on 24 November, Netflix published a series of posters and trailers for each episode in the fourth series of the programme, referred to as the \"13 Days of Black Mirror\", concluding on 6 December with the announcement of the release date, 29 December 2017.</p><p>\"USS Callister\" is a space epic based around a video game company, starring Jesse Plemons as CTO Robert Daly and Cristin Milioti as the new programmer Nanette Cole. \"Arkangel\" is an episode about a mother implanting an invasive technology in her daughter, starring Rosemarie DeWitt as Marie and Brenna Harding as Sara, and directed by Jodie Foster. \"Crocodile\" is about the consequences of a hit-and-run, starring Andrea Riseborough as Mia. \"Hang the DJ\" is a love story between Amy, played by Georgina Campbell, and Frank, played by Joe Cole, centred around an artificial intelligence that selects people's partners for them. \"Metalhead\" is a black-and-white apocalypse episode starring Maxine Peake as Bella, a woman trying to escape a robotic \"dog\", and directed by David Slade. \"Black Museum\" is an anthology of three stories, one of which was written by the magician Penn Jillette. Focused around a crime museum, the episode stars Douglas Hodge as Rolo Haynes and Letitia Wright as Nish.: 225–309</p><p>According to Engadget and Gizmodo, as a means of viral marketing Netflix sent private messages to users of the Turkish website Ekşi Sözlük. The messages were sent from the account \"iamwaldo\" and read, \"We know what you're up to. Watch and see what we will do.\" Although the advertising was met with positive reception from some users, others were concerned by distress that the messages may have caused.</p><h4>Bandersnatch</h4><p>After much media speculation sparked by social media reports of filming, a quickly-deleted Twitter announcement by Netflix and foreign film board certifications, Netflix announced on 27 December 2018 that the film Black Mirror: Bandersnatch would be released the following day. Set in 1984, the film follows Stefan, portrayed by Fionn Whitehead, a young programmer who begins to question reality and experience deteriorating mental health as he adapts a sprawling fantasy novel into a video game. Bandersnatch is an interactive film, regularly prompting the viewer to select one of two choices on screen that affect how the storyline continues; there are over one trillion potential paths to view the work and five distinct endings. Other main cast include Will Poulter, Craig Parkinson, Alice Lowe, and Asim Chaudhry.</p><h4>Series 5</h4><p>Netflix announced the fifth series on 5 March 2018. The complexity of Bandersnatch, which was originally part of the fifth series, delayed production, although Netflix still committed to its release in 2019. The first episode, \"Striking Vipers\", had been filmed prior to Bandersnatch. On 15 May 2019, a trailer for the fifth series was released, indicating it would comprise three episodes.</p><p>On 5 June 2019, the series was released. \"Striking Vipers\" sees Danny (Anthony Mackie) and Karl (Yahya Abdul-Mateen II) exploring a virtual relationship despite Danny's marriage to Theo (Nicole Beharie). \"Smithereens\" follows Andrew Scott as Chris through his kidnapping of a social media company intern. \"Rachel, Jack and Ashley Too\" stars the two titular sisters (Angourie Rice and Madison Davenport) co-operating with a doll cloned from the pop star Ashley O (Miley Cyrus).</p><h4>Series 6</h4><p>Around January 2020, Brooker and Jones announced their departure from House of Tomorrow. Variety reported that intellectual property issues were at the centre of this change, with the series' rights held by Endemol. By February 2020, Brooker and Jones had established Broke and Bones, a new production company. Netflix had arranged a long-term contract for series and other production rights with the Broke and Bones company by July 2020, although rights for Black Mirror still remained with Endemol. According to Variety, this left Brooker and Jones unable to produce additional series unless new agreements were put in place. In a May 2020 interview with Radio Times, Brooker questioned whether the public mood would suit a sixth series of Black Mirror and said that he had been working on more comedic projects.</p><p>A sixth series was announced by Netflix in May 2022, to consist of more than three episodes. The series will be produced by Broke and Bones, rather than House of Tomorrow. However, House of Tomorrow's new owners Banijay retain ownership of the programme (Banijay bought the Endemol Shine Group in 2020). Zazie Beetz said that her episode was filmed in June 2022. Variety reported that the series was in production as of July 2022. The first teaser trailer was released on 26 April 2023, announcing a June 2023 release date. On 11 May 2023, Entertainment Weekly announced five episode titles: \"Joan is Awful\"; \"Loch Henry\"; \"Beyond the Sea\"; \"Mazey Day\"; and \"Demon 79\".</p><p>Brooker said in 2023 that Black Mirror should continually reinvent itself and display standalone stories; he began the series by \"deliberately upending\" his \"core assumptions\" about the programme. Some episodes contain elements he \"previously sworn blind\" he would avoid.</p><h4>Suggested spin-offs</h4><p>Several sequel episodes or spin-offs have been suggested, though none have been produced. In 2013, Robert Downey Jr. optioned the episode \"The Entire History of You\" to potentially be made into a film by Warner Bros. and his production company Team Downey; in 2018, the episode's writer Jesse Armstrong said that the project was in \"development hell\". In 2016, Brooker said that he had ideas for sequels to both \"White Bear\" and \"Be Right Back\" that were unlikely to be made. He said in 2017 that there were no plans for a sequel episode to \"San Junipero\". Brooker has suggested that some characters in \"Hated in the Nation\" could potentially recur, as could Colin Ritman (Will Poulter), a Bandersnatch character with awareness of alternate timelines and realities. The director of \"USS Callister\", Toby Haynes, expressed interest in 2018 in a spin-off to the episode as a television series.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>Black Mirror has been met with critical acclaim. On Rotten Tomatoes, the first series received a 98% rating, the second received an 87% rating and \"White Christmas\" received an 89% rating. Series three received an 86% rating on Rotten Tomatoes and a score of 82 on Metacritic, series four received an 85% rating on Rotten Tomatoes and a score of 72 on Metacritic, Bandersnatch holds a 73% rating on Rotten Tomatoes and a score of 61 on Metacritic, and series five holds a rating of 68% on Rotten Tomatoes and a score of 65 on Metacritic. According to Víctor Cerdán Martínez of Vivat Academia in 2018, Black Mirror was one of China's five most-watched Western television series.</p><p>Series one garnered praise. David Sims of The A.V. Club gave the first episode—\"The National Anthem\"—an A rating, viewing each character decision and plot revelation as natural. Jim Goodwin of Bleeding Cool complimented the acting. Also, the episode received 145 complaints to the television regulatory body Ofcom, the eighth-largest figure for the year. Reviewing \"Fifteen Million Merits\", Ryan Lambie of Den of Geek extolled the romance between Bing and Abi, as well as the production quality, music and acting. Sam Richards of The Telegraph rated it four stars, praising the \"acerbic humour\". Critical reaction to \"The Entire History of You\" was more mixed. Sims believed that Liam's actions escalated too quickly, but found the central premise of memory recording plausible. Richards thought that the memory technology was not necessary to the story, but James Hibberd of Entertainment Weekly said that the episode's execution was \"sophisticated and flawless\".</p><p>The series two opener, \"Be Right Back\", received critical acclaim. Morgan Jeffery of Digital Spy rated it four stars, praising the characters and emotionality, but criticising the ending. Flickering Myth's Luke Owen lauded the acting of Hayley Atwell as Martha and Domhnall Gleeson as Ash, as well as the directing. \"White Bear\" was well-received, with Simon Cocks of Screen Anarchy and Sims praising the plot twist and Tuppence Middleton's role as Jem. However, Lambie criticised the passiveness of the main character, Victoria. \"The Waldo Moment\" was considered the worst Black Mirror episode of the series by a number of reviewers, and criticised for poor writing and characterisation. \"White Christmas\" garnered positive reception, including praise of the acting and the connections between narrative threads by The A.V. Club's Zack Handlen and The Independent's Ellen Jones.</p><p>The third series received positive reception. Benjamin Lee of The Guardian and Emily St. James of Vox rated it four stars. Writing in Vulture, Jen Chaney analysed that it had an increased variety in setting and tone, as well as longer episodes. Chaney found that four episodes are \"very good to great\", while the other two are \"merely decent\". Lee praised \"Nosedive\" and \"San Junipero\" for their cinematography, acting, increased budget and narrative ambition. Richard Lawson of Vanity Fair reviewed the episodes as \"all engrossing in their way\", but thought \"Men Against Fire\" had the weakest premise and production quality. St. James wrote that the series was, as with previous series, equal parts \"brilliant, ... pretty good, and ... kinda stupid\", praising \"San Junipero\" but finding that other episodes should have been shorter and were \"constrained\" in their shared social media theme.</p><p>The production and acting in series four were praised, as were some episodes. Writing in Variety, Sonia Saraiya commented that four of the six episodes explore human consciousness inside technology. She viewed \"Black Museum\" as a demonstration of the series' flaws, with its artificial consciousness technologies, use of violence and storylines that require characters to \"be stupid and/or evil\". However, Saraiya said that the production and acting was \"beautiful\" and praised \"USS Callister\" and \"Metalhead\" for diverging from Black Mirror's \"typical austere futurism\". Sophie Gilbert of The Atlantic identified the same theme and praised \"USS Callister\" and \"Hang the DJ\", but saw the writing as the biggest weakness of the series. Similarly, The Sydney Morning Herald's Brad Newsome praised the series' casting, and highlighted \"USS Callister\" as well-directed and well-acted.</p><p>Reception to Bandersnatch and series five was more ambivalent. Linda Holmes of NPR praised Bandersnatch's technical design but criticised the narrative and the repetition of scenes. Holmes said that the audience are not given a reason to care about the main character, Stefan. In The Guardian, Lucy Mangan rated the fifth series four stars, finding that the episodes are disparate in content but share \"a new air of calm authority\" that could reflect \"an increasing confidence\" of the producers. Lucy Pavia of the Evening Standard said that the episodes \"still pack a punch\", with \"Rachel, Jack and Ashley Too\" as the highlight. However, Hugh Montgomery of the BBC said that the programme's \"variable quality is more starkly evident than ever\" with \"one good episode to two middling-to-bad ones\". Montgomery praised \"Striking Vipers\" as \"among the finest and most soulful\" episodes. Additionally, Vulture's Kathryn VanArendonk reviewed that though they are well-produced and well-acted, the instalments lack suitable premises.</p><p>Critics of Black Mirror often view the show as self-righteous, with obvious morals in each story. Norman Wilner of Now commented that the first three series are \"rigidly formulaic\" in its presentation of a worst-case scenario and a \"sardonic twist\" in each episode, with \"San Junipero\" as the only exception. Chris Taylor argued for Mashable that the show should be viewed as more comedic and non-serious than prophetic, as it employs \"nightmare logic\" and concepts that require suspension of disbelief. In a satirical article for The Toast, Daniel M. Lavery used the phrase \"what if phones, but too much\" to describe a parody episode plot. This became a common refrain for criticism, encapsulating the paranoia, pessimism or predictability of the programme. Some reviewers found that Black Mirror decreased in quality over time. Vulture critics categorised the show as hit-and-miss, and worsening over time. LaToya Ferguson wrote in Paste that later series saw a \"creative downfall\" and increasing Americanisation, with their lengthier episodes, higher-profile actors and more \"polished\" style not compensating for a decline in quality.</p><h4>End-of-decade lists</h4><p>A number of publications named Black Mirror on their lists of the best television programmes of the 2010s:</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td style=\"width: 50%;text-align: left; vertical-align: top;\"><ul><li>5th – <i><span>NME</span></i></li><li>6th – <i><span>Esquire</span></i></li><li>7th – <i><span>The Independent</span></i></li><li>15th – Darren Franich of <i><span>Entertainment Weekly</span></i></li></ul></td><td style=\"width: 50%;text-align: left; vertical-align: top;\"><ul><li>25th – <i><span class=\"mw-redirect\">Consequence of Sound</span></i></li><li>57th – <i><span>The A.V. Club</span></i></li><li>80th – <i><span>Paste</span></i></li><li>Top 100 (unranked) – <i><span>IGN</span></i></li></ul><p> </p></td></tr></tbody></table><p>Den of Geek included it as one of the 13 \"Best Sci-Fi, Fantasy, and Horror Shows of the 2010s\" and though Vanity Fair did not include it in their top 10, it listed the episode \"White Bear\" as one of 15 \"honourable mentions\". At the end of 2019 and 2020, a number of publications also created lists of the best television shows of the 21st century to date: readers of Digital Spy voted that Black Mirror was 13th-best, The Guardian included it in 23rd place and Deadline Hollywood reported that it was one of the 21 \"most influential\" programmes.</p><h4>Accolades</h4><p>In November 2012, Black Mirror won Best TV Movie/Miniseries at the International Emmy Awards. Bryce Dallas Howard received a Screen Actors Guild Award nomination for her performance in the episode \"Nosedive\". At the 69th Primetime Emmy Awards, Black Mirror received three nominations with two wins, including Outstanding Television Movie for \"San Junipero\". \"USS Callister\" received three Emmy Awards, including Outstanding Television Movie, and four Emmy nominations in 2018. Bandersnatch won two Emmys in 2019, including Outstanding Television Movie, making it the third consecutive win for Black Mirror in that category.</p><br/><h3>Cultural impact</h3><h4>In fiction</h4><p>Along with American Horror Story (2011–), Black Mirror has been credited with repopularising the anthology format, which was rarely used in the 1990s and 2000s. Changing profit incentives from increased streaming television consumption has been attributed to this success. A 2019 reboot of The Twilight Zone, the primary show to inspire Black Mirror, can be seen as an example of this. It was described by the creator Jordan Peele as broader than Black Mirror in that its themes do not have to be technological, and Sophie Gilbert of The Atlantic suggested that it may have avoided darker themes or explorations into human nature to avoid overlap. Other anthology series that were part of this phenomenon include Room 104 (2017–2020) and Solos (2021). Additionally, Adam White of The Independent stated that Black Mirror and Brooker's other works spawned an era of horror and fantasy that explores modern technology. Science-fiction television that critics have compared to Black Mirror includes Humans (2015–2018) and Upload (2020–).</p><p>The anthology Electric Dreams was widely compared to Black Mirror. Reviewers found Electric Dreams to be less violent and more understated than Black Mirror, but contain some similar plots. For instance, the episode \"Real Life\" is a story about virtual reality. The settings are further in the future and more allegorical. Another example is Inside No. 9 (2014–), a British anthology series that critics saw as more comedic than Black Mirror, and known for intricate plot twists. The creators Reece Shearsmith and Steve Pemberton have a larger role in the show than Brooker does in Black Mirror, as they star in most episodes and direct some in addition to writing them. The serialised British dystopia Years and Years (2019) follows a family from 2019 to 2034, and drew many comparisons to Black Mirror in themes and its near-future technology. The Verge's Liz Shannon Miller called it \"Black Mirror, but with a full and beating heart\". Simon Cellan Jones, who directed the first four of six episodes, saw it as less dystopian than Black Mirror, and with less emphasis on technology. The science fiction film Friend of the World (2020) was arranged like a Black Mirror episode. The creator Brian Patrick Butler said he wanted a sequence of stories with escalating tension, to create a \"creepy and thought-provoking experience\".</p><p>There was critical consensus that the anthology series Soulmates (2020–) is inferior to Black Mirror. Its central conceit—that a company can determine its customers' perfect partner—is similar to the series four episode \"Hang the DJ\". Soulmates was created by William Bridges, a writer for two Black Mirror episodes, and Georgina Campbell—who has a starring role in \"Hang the DJ\"—is a main character in one episode. The One, a science-fiction programme with the same premise, was also seen as lesser than Black Mirror by critics. The romantic comedy Made for Love (2021) stars Cristin Milioti of series four episode \"USS Callister\" and its technological premise of a woman whose ex-husband implanted a monitoring device in her body was compared to Black Mirror. Milioti saw both stories as about \"a woman trying to find herself\".</p><h4>Comparisons to reality</h4><p>Brooker has often been described by commentators as prescient in his scripts for Black Mirror. In 2015, G. Clay Whitaker of The Daily Beast called the show a Magic 8-Ball. The first episode, \"The National Anthem\", features the UK prime minister blackmailed into having sexual intercourse with a pig. Four years later, the Daily Mail published allegations that the then-prime minister David Cameron had placed a \"private part of his anatomy\" into the mouth of a dead pig as an initiation rite at university. Brooker later said that after hearing the news, he \"did genuinely for a moment wonder if reality was a simulation, whether it exists only to trick me\". In \"The Waldo Moment\", a 2013 episode, the animated cartoon Waldo places second in a UK by-election. The US presidency of the media personality Donald Trump (2017–2021) and the Ukrainian presidency of the comedian Volodymyr Zelenskyy (2019–) were compared by journalists to the platform of Waldo. Brooker described Trump as \"an anti-politics candidate who's raucous and defensive\" and \"offers nothing\", like Waldo. Adrian Karatnycky of Politico stated that as with Waldo, Zelenskyy had few clear policy positions prior to his election.</p><p>The 2016 episode \"Nosedive\" presents a society in which citizens rate interactions with each other from one to five stars and receive an overall rating that largely determines their socioeconomic status. This has been compared to China's Social Credit System, where local governments collect data on citizens to assign them an overall score. Example data points include publicly criticising the government, defaulting on a loan or having high-rated friends. Like the system in \"Nosedive\", a low score can limit a person's access to transport. \"Be Right Back\" shows an artificial intelligence technology designed to mimic a deceased loved one. Chatbots with similar functionality and personalisation have been compared to this premise, as has a 2022 announcement that a future Amazon Alexa feature will imitate voices of dead loved ones. \"Shut Up and Dance\" is about a man who is blackmailed after footage of him masturbating is recorded through his webcam. Computer viruses can allow for covert recording through an unsuspecting person's webcam, and similar real-life blackmail has been reported.</p><p>More minor facets of episodes have also been seen as prescient. Ten days after \"Crocodile\" depicted a self-driving pizza delivery truck, Toyota and Pizza Hut presented plans for a driverless pizza delivery vehicle at the 2018 Consumer Electronics Show. \"Fifteen Million Merits\" features a talent show with a virtual animated audience based on Britain's Got Talent. In 2020, due to the COVID-19 pandemic, Britain's Got Talent had a virtual audience, which had an aesthetic resembling that of \"Fifteen Million Merits\". Other real-life technologies have been described as progress towards those seen in Black Mirror, such as the motion capture animation of Waldo in \"The Waldo Moment\", the augmented reality military system from \"Men Against Fire\" and the artificial bees in \"Hated in the Nation\".</p><br/><h3>Spin-off media</h3><p>A number of Black Mirror tie-in products have been released. A Nosedive board game based on the episode of the same name was produced by Asmodee. Released on 25 November 2018, the game requires between three and six players and is designed to last for roughly 45 minutes. The fictional game Nohzdyve, which is featured in Bandersnatch and named after the episode \"Nosedive\", was created by Netflix for a ZX Spectrum emulator and released on a Bandersnatch tie-in website. A 2017 museum exhibit at the Barbican Centre, entitled Into the Unknown: A Journey Through Science Fiction, included an installation based on \"Fifteen Million Merits\". A number of mock \"Tucker's Newsagent and Games\" storefronts, designed after the fictional Bandersnatch shop of the same name, were erected in Birmingham and London shortly after the film's release in 2018.</p><h4>Soundtracks</h4><p>Soundtracks to 12 of the 23 instalments have been released on online streaming services: \"Be Right Back\", \"White Bear\", \"White Christmas\", \"Nosedive\", \"San Junipero\", \"Men Against Fire\", \"Hated in the Nation\", \"USS Callister\", \"Arkangel\", \"Hang the DJ\", \"Black Museum\" and \"Smithereens\". Brooker also released a 42-track Spotify playlist of songs that were either featured in \"San Junipero\" or planned for inclusion at some stage. The \"Hang the DJ\" soundtrack, credited to Alex Somers and featuring Sigur Rós, was additionally released on vinyl. The song \"On a Roll\" from \"Rachel, Jack and Ashley Too\" is based on the Nine Inch Nails song \"Head Like a Hole\". It was released by the performer, Miley Cyrus, under her character's name Ashley O and went on to chart in multiple countries. The B-side \"Right Where I Belong\" was another Nine Inch Nails adaptation featured in the episode.</p><h4>Webisodes</h4><p>A series of webisodes, titled Little Black Mirror (Polish: Czarne Lusterko), was produced for Netflix Polska by Jacek Ambrosiewicz, in collaboration with Polish YouTubers. Released on 19 January 2018, the four shorts vary between eight and twenty-one minutes in length. 69.90 explores \"loneliness and gaming\", according to the creators Huyen Pham and Marcin Nguyen; they discussed 20 different ideas before deciding on a computer simulation which is indistinguishable from real life. The Breakup features Krzysztof Gonciarz and Kasia Mecinski: it used realism and ordinary technology, such as a Panasonic Lumix DC-GH5 that emulates vlog aesthetics. The Sum of Happiness was posted on Martin Stankiewicz's YouTube channel and focuses on a neurological implant and a relationship app, previously explored Black Mirror topics. 1%, filmed by Groupa Filmowa Darwin, and is about a violent piece of obstetrics technology.</p><p>A second series of webisodes, initially announced as Little Black Mirror but eventually renamed Stories From Our Future, was directed for Netflix América Latina by American YouTuber Rudy Mancuso. Initially planned for release on Netflix América Latina's YouTube channel, as part of promotion for the programme's fifth series, the original trailer for the project was removed by Netflix. The shorts were released on 10 June 2019 on YouTube channels of those involved. Cure for Loneliness was released on Mancuso's channel; Getting to Know You was released on Lele Pons' channel; The Healthy Alternative was released on Juanpa Zurita's channel. Also featured in the series is Australian actor Maia Mitchell.</p><h4>Literature</h4><p>In June 2018, the oral history companion book Inside Black Mirror was announced. Brooker, Jones and Jason Arnopp are the credited writers. The book features sections on the 19 episodes in the first four series, each consisting of conversational interviews from cast and crew along with stills and behind-the-scenes images. The book was released in the UK on 1 November 2018 and in the US on 20 November 2018 from Penguin Random House. Starburst rated the book ten out of ten stars, praising its \"wonderfully-comprehensive format\" and summarising it as \"blunt, brittle, often killingly funny and lavishly-illustrated\".</p><p>In June 2017, Brooker announced a series of prose stories based on Black Mirror. The first volume was to be published on 20 February 2018 and scheduled to be edited by Brooker; two further volumes were planned for later in 2018 and in 2019. Planned writers included the science fiction authors Cory Doctorow, Sylvain Neuvel and Catherine Webb, under the pseudonym Claire North. The project was postponed indefinitely in 2018 as Brooker and Jones could not dedicate enough time to it, with Brooker saying \"I'm not sure when or if will appear. Probably not\".</p><h4>Black Mirror Labyrinth</h4><p>In mid-2019, Thorpe Park Resort in Chertsey, United Kingdom, announced that it was to open a walkthrough maze, the \"Black Mirror Labyrinth\". The maze was scheduled to open in March 2020, but this was delayed because of the COVID-19 pandemic. It opened on 21 May 2021 and is themed around artificial intelligence. The subject's name and a photo taken of them are used to personalise the maze.</p><br/>"
  },
  "errorMessage": ""
}