{
  "imDbId": "tt0290988",
  "title": "Trailer Park Boys",
  "fullTitle": "Trailer Park Boys (TV Series 2001–2018)",
  "type": "TVSeries",
  "year": "2001",
  "items": [
    {
      "username": "vincent-27",
      "userUrl": "https://www.imdb.com/user/ur0258791",
      "reviewLink": "https://www.imdb.com/review/rw0827176",
      "warningSpoilers": false,
      "date": "6 August 2004",
      "rate": "",
      "helpful": "141 out of 166 found this helpful.",
      "title": "understated brilliance, continuing the great Canadian comedy tradition",
      "content": "Like most people when I first saw this show I thought it was just another mindless low budget comedy series aimed at the dim-witted pot smokers among us. Then I watched it more and became mesmerized by the underlying brilliance, everything was not as it seemed, from the beautifully languid intro music, to the ingenious documentary style of filming. Much like SCTV, it uses the low budget quality of the show, and turns that into a bonus. THe shaky hand-held camera, the occasional boom mic shot all blend perfectly with the mostly improvised dialogue. There's something uniquely Canadian about this, making the best out of the fewest resources, and it demonstrates the greatness of the show that it does not need huge production values to make you laugh your ass off. And laugh you will as you watch the main characters, Ricky, Julian and Bubbles stumble their way through life. We have all met people like this, much like in the movie \"Fubar\", people who are completely ignorant and emotionally underdeveloped, yet very much content with their position in life. Both Fubar and TPB, the key is not to make fun of these people in a condescending way, look equally at their naive stupidity but also at their loyalty and innocence and genuineness.The 80's had SCTV, the 90's Kids in the Hall, for Canada, the 00's belong to the Trailer Park boys."
    },
    {
      "username": "Amthermandes",
      "userUrl": "https://www.imdb.com/user/ur9755277",
      "reviewLink": "https://www.imdb.com/review/rw7872809",
      "warningSpoilers": false,
      "date": "17 February 2022",
      "rate": "10",
      "helpful": "37 out of 47 found this helpful.",
      "title": "There is a special sort of charm about this show. Know what I'm sayin'?",
      "content": "I've been an avid fan of the show for about a decade now. There's an odd charm, a bit of an attraction to the simplicity of the way of life that the characters in the show live, that is oddly alluring. Talk about a fictional, worry-free escape in the world of television, this is the epitome of such a deviation from the real world.The show follows three main characters: Ricky, who is the completely emotionally-fueled, irrational one of the lot, who constantly puts himself AND OTHERS into horrible and illegal situations, only to shrug it off as \"no big deal\" (one of the show's many running jokes), and tries to pass the blame onto someone else. And then there's Julian, who is often seen as the \"brains\" of the trailer park, but really he's mostly in it for himself, and while his heart in usually in the right place, and it's known he cares about his friends, he often forgets the latter and makes decisions only to benefit himself. He also is never seen without a rum & coke in his hand. And finally, there's Bubbles. A special lad, with an adorable affection for kitties, he's usually the voice of reason between the three, even though he may come off as more \"special\" than his friends. He's the more sympathetic of the trio, and an avid Rush fan. Sometimes, due to the crazy antics of his friends and the lovable psychos of the trailer park, he's often put into unfortunate situations.And one HAS to give love to the man who plays Jim Lahey, who is the drunk and vengeful supervisor of the trailer park, always looking to get even with \"the boys.\" And a special nod goes to J-Roc, one of TV's most hilariously pathetic characters, whose quotes will live on forever,\"'naw what I'm sayyin' booiii?\" Seriously, every scene with this character is absolute gold.The show is absolutely hilarious. The characters are so ridiculous, their ways of life and their mannerisms are so preposterous you can't help but love them. If you can get past all the crude language, that is. And of that, there is a LOT. But the whole show is riddled with brilliant comedy, memorable quotes, and a charming flow.I absolutely LOVE this show. Especially the first half dozen seasons, before they were picked up by Netflix. I hate repeating myself, but there is such an uncanny CHARM to this show, it's completely irresistible."
    },
    {
      "username": "thor4923",
      "userUrl": "https://www.imdb.com/user/ur12507220",
      "reviewLink": "https://www.imdb.com/review/rw1491303",
      "warningSpoilers": false,
      "date": "7 October 2006",
      "rate": "9",
      "helpful": "261 out of 283 found this helpful.",
      "title": "Knock Knock...F%@k Off.",
      "content": "While I respect the opinions of those who criticized the show (not surprisingly the comments rated \"least useful\"), it appears that their views are so concrete that they just don't get it.This brilliant series is not intended to reflect the \"reality\" of trailer park life in Nova Scotia, but is instead a wonderful artistic compilation of many extreme, bizarre, and mundane experiences that are interesting on an entertaining and (feigned) voyeuristic basis. There are operas, soap operas, space operas, and now \"park operas\". Consider how difficult it must be to act improv style not only on the set, but to act \"in character\" during all media interviews and public engagements, as is the expectation. Not many actors would have the commitment or stamina to carry this through for the benefit of the production image. Mike Smith, who plays the character Bubbles, apparently can only wear the thick glasses for 15 minutes at a time without extreme fatigue.Let's consider the acting quality and skill. Would Deniro or Pacino make this a better series? No! The charm is in the rough edges, the improv, the humility, and the belief that these are low rung thugs. It is totally believable and a credit to the acting and direction.How is Canada or Nova Scotia being insulted if we recognize that this series is a parody and that we should not take it so seriously. According to the on-line polls I have viewed for TPB of the episodes to date, the average rating has been 9 out of 10. Most of those voting were from Canada followed by participants from the US, the UK, Australia, and New Zealand. We should be proud that we have had an impact on others, especially on those outside of our country. If given a chance, you will see how the brilliance shines through the layers of carefully placed sh#@. It is meant to look amateurish!"
    },
    {
      "username": "vampyrecowboy",
      "userUrl": "https://www.imdb.com/user/ur1307882",
      "reviewLink": "https://www.imdb.com/review/rw0827174",
      "warningSpoilers": false,
      "date": "26 April 2004",
      "rate": "",
      "helpful": "92 out of 133 found this helpful.",
      "title": "This is FRUCKING hilarious.",
      "content": "I've seen this show only a few times and it is absolutely hilarious. The first time I saw it I was insulted, but after seeing it because i couldn't pick up anything else on the tv, I really enjoyed it.I would like to see more spin offs from a show like this. This is Melrose Place or 90210 on Welfare and it freakingly hilarious.The cast is very classic characters. The dialogue is cheesey and trite, but it all fits in perfectly.The entire production is cheap, but made to be purposely done that way...and it comes off great. There are few comedies that are not Hollywood formula and this is one.I can only state that for Canadian programming, this is far better than any \"road To Avonlea\" type programming.Lately Canadian television series have become very edgy and have defined characters with unique definition...and it's about time.It's time that comedy has gotten away from the \"FRIENDS\" and \"FRASIER\" type lame ass comedy writing and became creative like this show.I look for more series episodes and possibly a feature movie too.I've had the opportunity to live in a trailer park for several months in Florida, Arizona, Utah, New Mexico and British Columbia...I can easily relate to some of the characters that I have met in this series to real life people.Fantastic view of a very unique position of life.Awesome job."
    },
    {
      "username": "Muscle-3",
      "userUrl": "https://www.imdb.com/user/ur0401919",
      "reviewLink": "https://www.imdb.com/review/rw0827177",
      "warningSpoilers": false,
      "date": "14 September 2004",
      "rate": "",
      "helpful": "86 out of 114 found this helpful.",
      "title": "Best Show Ever!",
      "content": "You either love this show or hate it. I don't know how you could possible hate it - it's full of site gags and great one-liners! I reiterate - I don't understand how someone could hate it.In the show Jim Lahey has some of the best lines ever! \"We're about to head into a sh** typhon Randy, you better haul in the sails before they get covered in sh**\" -- Jim LaheyThe only thing that is unfortunate about this show is that they only produce 8 eps per season (except for Season 5 which has 10 episodes).This show is better than sliced bread and I can watch the episodes over and over again!People complain about Canadian shows sucking -- TPB was picked up in the US!! It must be worthwhile! Keep up the great work TPB!Zack"
    },
    {
      "username": "wonderland_ahead",
      "userUrl": "https://www.imdb.com/user/ur1829920",
      "reviewLink": "https://www.imdb.com/review/rw0827171",
      "warningSpoilers": false,
      "date": "21 January 2004",
      "rate": "",
      "helpful": "82 out of 107 found this helpful.",
      "title": "It grows on you",
      "content": "When I first left a review of this show I was fairly unimpressed with it. However, since then I've forced myself to watched the entire Seasons 1-3 and I have to say it: man, was I wrong.It grows on you. If you can get over the bad acting and the political incorrectness you'll find one hell of a show. As another reviewer said it's not an accurate reflection of life in a Nova Scotia trailer park: more like if you took the weirdest members of every trailer park in NS and put them together to dumb it up.Some of the funnier aspects I've found have been Ricky's constant mispronunciations (there are at least then in every episode), Mr Lahey's constant sh*t analogies, and, of course, Bubbles, who makes even the bad episodes worth watching.If you give it a chance you won't have a single favourite episode; more like a collection of favorite moments pulled from each ep. Whether it's J-Roc's identity crisis (\"I hate to admit it ... I'm white\"), Bubbles' dragging a drunken Ricky home in the back of his go-cart, or the visit from the hysterically creepy Bible Pimp, there'll be at least something that makes you giggle whenever you think of it.All that said, BBC America can look forward to a few letters of mixed reactions, and Comedy Central can start kicking themselves for not being the first to snatch it up."
    },
    {
      "username": "walkererinlea",
      "userUrl": "https://www.imdb.com/user/ur68053144",
      "reviewLink": "https://www.imdb.com/review/rw5779645",
      "warningSpoilers": false,
      "date": "28 May 2020",
      "rate": "10",
      "helpful": "117 out of 129 found this helpful.",
      "title": "Julian's drink",
      "content": "Makes me laugh out loud every episode. Every day I think about the episode he climbs out of the car flip with a full drink"
    },
    {
      "username": "mm-39",
      "userUrl": "https://www.imdb.com/user/ur0453228",
      "reviewLink": "https://www.imdb.com/review/rw0827169",
      "warningSpoilers": false,
      "date": "22 July 2003",
      "rate": "7",
      "helpful": "20 out of 34 found this helpful.",
      "title": "Cult favorite",
      "content": "This show will be a cult favorite, like another Canadian classic SCTV. One day it will be showing on US cable and watch out this show will explode. Like the hosers on SCTV, this show pokes fun at Canadians in a backwards way. Nice to see people laugh at themselves. What makes this show funny, is some of these characters must result from real life experiences. Everyone either has a relative, friend, co-worker, like Ricky, Bubbles, Corry, Trevor, and J Rock. J Rock the 29 year old, ridiculous looking White rapper wannabe, who lives with his mom. Ricky, the trailer park idiot,(Will Farrel of the show) who provides 90% of the material, while living in a car missing a right door; and Corry with his pal Trevor the 2 slow witted wannnabes who end up holding the bag. Living in East Kildonan this reminds me of my youth and shows how believable casting, and writing overcomes a lower budget. What's next a show about Postal Workers."
    },
    {
      "username": "kellyheiser",
      "userUrl": "https://www.imdb.com/user/ur15146948",
      "reviewLink": "https://www.imdb.com/review/rw1644673",
      "warningSpoilers": false,
      "date": "27 April 2007",
      "rate": "10",
      "helpful": "66 out of 82 found this helpful.",
      "title": "Incredible, brilliant show",
      "content": "Completely original, brilliantly written, beautifully acted, perpetually shocking and always quotable, TPB is simply one of the top 5 shows of all time. How many shows have had so, so many memorable, hilarious lines? Only the Simpsons, Larry Sanders, Sopranos quickly come to mind. The subject matter is refreshing and daring, it certainly could never escape heavy censorship in the US. Every line is funny, the dialogue is almost \"clockwork orange\" like. All the characters are excellent, the ensemble works so well together, I love seeing all of them, with their various looks changing season to season. Ricky may the best character overall, but they all have essential roles they have all mastered. I will admit that seasons 4 and 5 are slipping just the slightest bit from the dizzying heights of season 3, but it is still better than 99% of anything else. The Christmas Special \"Prequel\" from a couple of years ago was pure gold. It answered many questions, especially about Randy, and was brilliant. We finally got to see some winter scenes. Hopefully the movie will have some scenes in winter. The Alex Lifeson episode from season 3 should be in the TV Hall of Fame as one of the greatest 23 minutes ever shown. Thank you Canada!!! I am trying to spread the word down here in California."
    },
    {
      "username": "cstover-28468",
      "userUrl": "https://www.imdb.com/user/ur86924865",
      "reviewLink": "https://www.imdb.com/review/rw6729851",
      "warningSpoilers": false,
      "date": "22 March 2021",
      "rate": "7",
      "helpful": "17 out of 27 found this helpful.",
      "title": "Original seasons good/Netflix seasons not so good",
      "content": "As my title says, the original 7 seasons that aired on Showcase in Canada from 2001 to 2007 were great. Yes, I even loved season 7, which it seems most other fans of the show don't really like this season, but I do and honestly, compared to the Netflix seasons, you'll appreciate season 7 a lot more. Also, the original TPB The Movie released in 2006 and was pretty good. The show seemed to have ended with season 7 in '07, but of course, fans wanted more of the boys and due to popular demand, a TV movie was released titled Say Goodnight to the Bad Guys, which was pretty great in my opinion. Then another movie titled Countdown to Liquor Day was released the following year in 2009, which was, just Ok, in my opinion, of course. Finally, a 4th movie was released titled Don't Legalize It, which got mixed reviews but I really enjoyed it. Along with this came the announcement that Netflix was bringing the series back and that same year in September of 2014, Netflix released season 8 of Trailer Park Boys. And..., well, honestly, I didn't hate this season. I actually kind of liked it. Though, Mike Clattenburg's (the creator, head writer, and director of pretty much the entire show/movies up until this) absence from the show was very apparent. It was waaaay more over-the-top than it had ever been before, which was definitely a bad thing...ya know....in my opinion. But it wasn't terrible. However, we then come to season 9 released on Netflix on March 27th 2015 and...dear god, season 9 was just...it was so bad. It was so, so bad. I hated it so much. I found myself cringing so often and maybe let out a slight chuckle here and there. I know as shows go on, characters always tend to become caricatures of themselves, but this was ridiculous. In prior seasons, Ricky was at least capable of speaking at a normal volume sometimes. In this season, he pretty much screams every single word he says. The whole season is just bad. And season 10 is even worse. Not much to say other than it's just god-awful. It feels like it's trying so so hard to be over-the-top and give shock-humor but it's just bad in every way. Seasons 11 and 12 were definitely a huge step up from the previous 2 before it but still nothing great. Seasons 1-7 were peak TPB for me and I'm sure most fans of the show would probably agree."
    },
    {
      "username": "TheKubes",
      "userUrl": "https://www.imdb.com/user/ur1475514",
      "reviewLink": "https://www.imdb.com/review/rw0827161",
      "warningSpoilers": false,
      "date": "17 June 2003",
      "rate": "10",
      "helpful": "105 out of 140 found this helpful.",
      "title": "A Riot",
      "content": "This show is THE funniest damn show ever produced in Canada. What a bunch of dumbasses these characters are! You must see this show. It is the funniest thing. Just a bunch of small town folks living in a trailer park trying to make it. Truly amazing!"
    },
    {
      "username": "rphanley",
      "userUrl": "https://www.imdb.com/user/ur113728531",
      "reviewLink": "https://www.imdb.com/review/rw7633655",
      "warningSpoilers": false,
      "date": "11 December 2021",
      "rate": "9",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Great show through the first 7 seasons.",
      "content": "Great comedy from Canada. The cast of characters is great and hilarious. Lots of funny moments and seasons. The show was funny but kind of tanked once Netflix brought it back. The movies are pretty good too."
    },
    {
      "username": "dustynminx",
      "userUrl": "https://www.imdb.com/user/ur108219542",
      "reviewLink": "https://www.imdb.com/review/rw5640072",
      "warningSpoilers": false,
      "date": "14 April 2020",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "NO MATTER HOW BAD LIFE IS THIS SHOW FIXS IT!!!",
      "content": "I advise every human being on earth to watch this show, idc how bad your day has been or what's going on in your life this show will brighten your day and I promise you that you will Laugh and Smile while your watching the Amazing cast, John Dunsworth(Mr.Lahay) is hands down one of my personal favorite actors but this man is a Genius and plays a Drunk person Amazingly and he will be missed o so very much! Bottom Line this show will brighten your day I PROMISE!!!!"
    },
    {
      "username": "brooksrob1",
      "userUrl": "https://www.imdb.com/user/ur33279366",
      "reviewLink": "https://www.imdb.com/review/rw3365343",
      "warningSpoilers": false,
      "date": "2 December 2015",
      "rate": "10",
      "helpful": "4 out of 6 found this helpful.",
      "title": "No wonder so many people get tattoos of these characters...:)",
      "content": "Just started binge watching all 9 seasons...I watched 6 seasons in the last few days...That being said; WHAT A GREAT SHOW! The characters are so endearing! Bubbles is VERY easy to like...The episode with Rushs' Alex Liefson is a masterpiece! Julian and his drink is hilarious...Watching him interact with SO many crazy characters and Always controlling his drink; It's like an extension of his right hand...Ricky? What can you say...He must be a savant to play how dumb he acts...It's just bizarre event after bizarre event...Ricky blaming everybody and everything and taking credit (unjustly) for anything good that happens...The bottle kids are Hilarious! One of my favorite running jokes... Give it a few episodes, if you don't like it, Ricky will come over and explain it to you..."
    },
    {
      "username": "13Funbags",
      "userUrl": "https://www.imdb.com/user/ur68345682",
      "reviewLink": "https://www.imdb.com/review/rw4726964",
      "warningSpoilers": false,
      "date": "17 March 2019",
      "rate": "8",
      "helpful": "15 out of 37 found this helpful.",
      "title": "Was great for a few seasons.",
      "content": "This show was hilarious for about 4 seasons then it slowly got worse. They made a huge mistake bringing it back after season 7. The last few seasons made me wish I had never heard of this show."
    },
    {
      "username": "coadymn",
      "userUrl": "https://www.imdb.com/user/ur1827635",
      "reviewLink": "https://www.imdb.com/review/rw0827157",
      "warningSpoilers": false,
      "date": "2 April 2003",
      "rate": "",
      "helpful": "38 out of 57 found this helpful.",
      "title": "Unique and hillarious.",
      "content": "The Trailer Park Boys is a unique and funny television series from Halifax. It is filmed almost like a documentary which features the stories of two friends who are in and out of jail. While trying to keep their drug business running they have to deal with the park supervisor. Bubbles, a friend of the two main characters will have your sides splitting. I highly recommend this show if you don't mind some vulgarity with your comedy. You've never seen anything like it."
    },
    {
      "username": "The_Light_Triton",
      "userUrl": "https://www.imdb.com/user/ur5175792",
      "reviewLink": "https://www.imdb.com/review/rw1473913",
      "warningSpoilers": false,
      "date": "13 September 2006",
      "rate": "10",
      "helpful": "9 out of 21 found this helpful.",
      "title": "Haven't seen this? where the !@#$ have you been?",
      "content": "Trailer Park boys is probably the funniest Show on Showcase. Probably the Funniest show in Canada. probably over all of north America.Anyways, Trailer park boys is supposed to be a documentary (or a mockumentary) that follows the lives of 3 losers who've lived in a run down trailer park all their lives. They only have 2 jobs in life; grow pot and smoke some. But the drunk, Ex-cop, and cop-wannabe trailer park supervisor is always being a pain in the ass, always trying to stop them, like calling the cops, with his shirtless, pop-belly assistant, randy.Trailer park boys is Funny, but coarse beyond your wildest dreams. the characters say the F-word over a hundred times every episode. Even bubbles, the little coke-bottle glasses grocery buggy repairman who seems so innocent, has a dirty mouth. F-word after F-word.However, this show is hilarious. watch it and see what you think."
    },
    {
      "username": "PCT1970",
      "userUrl": "https://www.imdb.com/user/ur99519886",
      "reviewLink": "https://www.imdb.com/review/rw4853142",
      "warningSpoilers": false,
      "date": "14 May 2019",
      "rate": "9",
      "helpful": "7 out of 15 found this helpful.",
      "title": "Trailor Park I'd Love To Reside In",
      "content": "This viewer started watching this show after it had aired for nearly seven seasons. Better late than never. I watched the first episode of the first season and was immediately hooked. I binged twelve seasons in two weeks. Clattenburg has created a sublime mockumentary. This series has excellent direction, writing, cinematography, soundtrack, setting and acting. All of the actors involved deliver magnificent comedic performances. In particular Smith, Wells, Tremblay, Roach, Rolfe, Bowles, Torrens and the late Dunsworth are hysterical. Some of the aforementioned also contribute to the writing and directing of the series. To summarize twelve seasons as concise as possible, the plot revolves around two recently released inmates, Julian and Ricky, who return home to Sunnyvale Trailer Park in Nova Scotia. They are immediately shocked by the changes at the park, however they haven't changed at all. They meet up with Bubbles who completes the threesome and is sort of an anchor of sensibility. However Bubble's love for kitty cats, his curiosity and good nature always allow for him to be manipulated by Julian and Ricky. Julian and Ricky's arch nemesis is trailer park supervisor Lahey who is almost always inebriated and his assistant Randy. Randy has an allergy to shirts and a penchant for cheeseburgers which is chucklesome in and of itself. Julian and Ricky continuously hatch outlandish, zany, bizarre and quirky schemes to get rich quick with Bubbles most of the time observing and sometimes offering to be the brains behind the operations. These schemes are not always legal but I must admit they are clever. While this is going on Lahey and Randy constantly try to enforce park regulations threatening to rid the park of the boys and the feelings mutual. Sometimes the boys enlist the help of the inept Cory and Jacob who are witless, daft and goofy, but are such loveable characters. There is also wanna be rapper J-Roc who is exceptionally funny and Ricky's girlfriend Lucy who also delivers genuine hilarity. There are many subplots throughout the twelve seasons which keeps the series fresh. The plot is uproarious, side-splitting, rib-tickling, vulgar, boisterous, vivacious, raunchy and bombastic. This is one of the most memorable, addictive, superlative and near virtuoso series in it's genre. Season 13 just started but as this viewer streams nearly 99% of content viewed, I will wait with copious anticipation and confidence that the fun filled joy ride will continue. This viewer has already seen the two movies and live shows so in the meantime I'll watch the new animated, \"Trailer Park Boys\" series that dropped yesterday to tide me over or maybe I'll just revisit the series from episode one again. That's how enjoyable this series is if you embrace this kind of exuberant humor."
    },
    {
      "username": "Imme-van-Gorp",
      "userUrl": "https://www.imdb.com/user/ur76725747",
      "reviewLink": "https://www.imdb.com/review/rw8838166",
      "warningSpoilers": false,
      "date": "30 January 2023",
      "rate": "3",
      "helpful": "9 out of 20 found this helpful.",
      "title": "I just don't get it.",
      "content": "Season One: 3/10Themes: Trailer Park, Comedy, Ex-Cons, Drugs, Petty Crime, Friendship, Stupidity & Canadian.Review: I really do not understand the appeal of this show. It's about a bunch of complete idiots, doing nothing but scream at each other, swear like there's no tomorrow, fire off guns as if it's their new favourite toy, and be drunk all the damn time. It just wasn't funny and I didn't laugh even once. The characters were extremely annoying to the point of me rolling my eyes at them every episode. The plot itself is also super uninteresting; it's the same thing over and over again, and besides being repetitive, it was very boring in and of itself. I'm definitely not a fan. Perhaps I'm missing something here, but I just don't see what would be entertaining about this series. It was just silly and ridiculous."
    },
    {
      "username": "zaforius",
      "userUrl": "https://www.imdb.com/user/ur18837437",
      "reviewLink": "https://www.imdb.com/review/rw3002083",
      "warningSpoilers": false,
      "date": "21 April 2014",
      "rate": "10",
      "helpful": "14 out of 19 found this helpful.",
      "title": "The noblest form of comedy i've ever enjoyed.",
      "content": "At first, it seems like the trailer park boys is a typical cult comedy you should watch if you want to watch something while high, but as the show keeps going you realize that this show is a masterpiece of classical comedy. Made to satirize the everyday life of the lowest of the classes and the problems that run with them, manages to make you laugh, tell the truth and promote human feelings in the most genuine way. Take a look at every character at the show and you realize just how funny everyday life really is. Jules, the responsible guy who never lets his glass of liquor off his hand, Bubbles, the benevolent little cat guy that everyone loves, and lives by fixing stolen carts and Ricky, the full-mouthed little a-hole friend that everyone has, never stops smoking even with nicotine patches on him.The show is full of many other interesting characters that have their own brand attitude that makes this show so funny and well made. The exaggeration is the main protagonist here, abuse, swearing, dope, gunfights all in a perfect mix of comedy exaggeration. The show wins you by making you love the characters and their exaggerating attitude the outlaw lifestyle and their constants attempts to make a living.If you love honest comedy, you are going to f-kin love this show. Thumbs up for Canada."
    },
    {
      "username": "haburashi",
      "userUrl": "https://www.imdb.com/user/ur11161301",
      "reviewLink": "https://www.imdb.com/review/rw1558552",
      "warningSpoilers": true,
      "date": "30 December 2006",
      "rate": "10",
      "helpful": "24 out of 38 found this helpful.",
      "title": "A comedy groundbreaker",
      "content": "Who are the guys living in that Trailer Park in the title? Angry, skinny, drunk homosexual baldy running the town with his hairy fat Starsky-boyfriend who has a phobia of t-shirts, world's best professional weed grower taking shots in the leg every now and trying to finish elementary school for the millionth time, jug pissing old man taking support money from the government by acting disabled, poor Bubbles with two criminals as his only friends wanting to establish his own kindergarten for cats: Kittyland, a hip hop teen who never watches at the mirror because he wants to think he is black and so many other caricatured characters, that if I could continue the list and it would just get weirder and weirder.Generally everyone and everything is so absurd I can't watch the show for one minute without bursting to laughter. Where normal people would go to the work in the morning, Trailer Park Boys spend the time camouflaging 200 pounds of hash into a driveway. There's gunshots in \"my neighbor just parked at my spot\"-situations and people eating drugs instead of bacon in the morning. Their lives are so upside down it's hilarious.Very rarely a new comedy that does something original instead of just copying an earlier success appears, I dare to say for myself that Trailer Park Boys is definitely the best comedy show ever to air. I could go on about actors being fantastic or characters being perfectly written, but it ain't the point in the series. The point is more like a world that you see when you go asleep and have a dream where the craziest and funniest and stupidest people live in one small trailer park and make you laugh for the whole show."
    },
    {
      "username": "k_grant",
      "userUrl": "https://www.imdb.com/user/ur1807206",
      "reviewLink": "https://www.imdb.com/review/rw0827147",
      "warningSpoilers": false,
      "date": "4 July 2002",
      "rate": "",
      "helpful": "43 out of 69 found this helpful.",
      "title": "all hail TRAILER PARK BOYS!",
      "content": "All hail TRAILER PARK BOYS, the funniest show on television. This show is an absolute must-watch. The plot of the show has already been summed-up by the other comments on the board, so I'll only say: WATCH THIS SHOW! It's hysterical. EVERYONE MUST WATCH 'TRAILER PARK BOYS'!!!"
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw8848396",
      "warningSpoilers": false,
      "date": "3 February 2023",
      "rate": "10",
      "helpful": "2 out of 3 found this helpful.",
      "title": "Masterful comedy",
      "content": "The entire cast is genius especially Ricky, J-Roc, Julian and Bobbles! I stopped watching the series a few years ago cause I don't laugh enough I need to laugh more and this show is so satisfying regardless it stays entertaining. Brilliant how the credit sequence is incredibly ambient and the rest is chaotic hilarious fun. Some of the most legendary comedy ever, very satisfying entertainment and massive amount of profanity throughout which makes everything more fun! Pretty sure this began Elliot Pages career when they were different I respect it though. Bobbles is a masterful character, sad that Mr. Jim Layhe passed away some years ago he was wonderful in this. Trailer Park Boys is one of the best series ever."
    },
    {
      "username": "stopcallingmeshirley",
      "userUrl": "https://www.imdb.com/user/ur10153368",
      "reviewLink": "https://www.imdb.com/review/rw2670238",
      "warningSpoilers": true,
      "date": "7 September 2012",
      "rate": "",
      "helpful": "4 out of 5 found this helpful.",
      "title": "I feel obligated to review The Boys....",
      "content": "...because of how much true laughter they've given me.Trailer Park Boys showed up on my 'You Might Like' list on Netflix. I watched the first episode and was a little bored. The second episode, same thing. I set it to the side for awhile, then came back a few months later to give it a shot again. Episode 3 hit and I finally saw the light. Everything came together and I laughed hysterically.I suppose this is true with any television series. You have to give it a couple episodes to set up the characters and find it's stride before giving it a fair assessment.Fast-forward to now. I have two more episodes left before I complete the series. I've already told my wife that after I complete the series and movies, I plan to re-watch the entire series again (something I've never done before for a TV show). I've 'liked' their official Facebook page, I've joined their unofficial message board, and I'm waiting for them to come out to the West Coast so I can buy tickets for their live show. Did I mention that I got my dad hooked too? The reason for my devotion to TPB, the reason I've taken my own free time to write a review of the show, is because they are brilliant. Brilliantly written, brilliantly acted, and brilliantly directed. And I don't use that word lightly.TPB does NOT pander to the lowest common denominator as might be assumed. There are things going on, little comedic subtleties, that crack me up. The way Jim Leahy stares at a drink. The way Ricky beams when thinking about getting his 'grade 10'. Randy referring to Barbara Leahy as 'Barb' in that thick accent of his. I hear it's a 'Nova Scotia' accent. I don't know what it is, but it's hilarious.You may be surprised at what you won't find in TPB: No wife-beating. No rednecks. No gang-bangers. You also won't find excessive use of Canadian slang or references. This isn't a knock on Canadians, in fact given the brilliance of TPB, I'd have to say that I love Canadians. But here in the US, our jokes about Canada are along the lines of 'how a-boot we play some hockey eh'? That is NOT what TPB delivers. I do notice that Ricky makes a big deal about eating pepperoni...I don't know if that's a Canadian thing or not, but it's hysterical nonetheless.There have been a couple episodes that were off the mark, yet still delivered memorable comedy. The style and approach has changed somewhat in the last few seasons and I haven't found myself laughing quite as much, but to quote the character Ray, \"That's The Way She Goes\".Slight character spoiler follows:Let me give you some background on Ray. He is Ricky's dad, and he also lives in the Trailer Park. Ray is a former trucker and an alcoholic who uses a wheelchair to get around. However, Ray doesn't need the wheelchair. He only uses it as a prop for investigators, because Ray lives on disability for a non-existent back injury that ended his trucking career. Ray does his best to dispense advice to Ricky, his son, and sometimes they get drunk together...at Ray's request.The thing is, when you watch Ray, listen to Ray, and see him interact with Ricky, you start to like him. He's obviously a broken man, surviving on fraudulent disability and cheap liquor, but in some strange way you're pulling for him. That's because as poorly equipped as Ray is to deal with life, he's still doing what he can to help his son Ricky.Ray is only one character in the hilarious universe that is Trailer Park Boys. Another reviewer mentioned this show 'changing his life'. I won't go that far, but I will say that this show has been an unforgettable experience for me. I have NEVER watched a show with such rich characters as those found in Trailer Park Boys.Ricky and Bubbles are profanity machines. Jim Leahy is a RAGING alcoholic. Julian and Ricky grow 'dope' for sale, and sometimes go to prison. Yet when all is said and done, humanity is witnessed in all players.If I've done my part to intrigue you, then take the time to watch episodes 1-4 (22 min each). Eps 1-2 should be considered character setup. Don't start with the movies, and if you've seen the movies, don't let them reflect on the series (I've heard they aren't very good, though for me at this point it's irrelevant). If you still aren't feeling it after episode 4, then at least you can say you gave it a fair shot. But if you make it to episode 4 and get hooked, welcome to the Park! And watch out for Leahy, he's a drunk ******* bastard!"
    },
    {
      "username": "alvinseech",
      "userUrl": "https://www.imdb.com/user/ur97387650",
      "reviewLink": "https://www.imdb.com/review/rw4624686",
      "warningSpoilers": false,
      "date": "3 February 2019",
      "rate": "9",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Great Show... Just Gets Better.",
      "content": "When I first discovered TPB, I really felt I discovered a new type of cult following. You know that moment when you saw Peep Show or The Thick of It for the first time? It felt like that. Fresh, laugh out loud comedy.It's also great how the boys manage to get you on their side even though you know most of what they're doing is downright criminal. The sociology of this program is great as it paints a picture of very petty Trailor Park criminals who are also just people trying find their way in the world and establish peace in the park - despite some crazy antics, they really are good people who you root for.I found it got progressively funny throughout seasons. At first, I turned off S8/E1 because it seemed a little polished and scripted but I went back to it after years and found it really did grip me much more than the previous series - the polishing was absolutely spot on. The stories got deeper and the new characters actually grew on me. What a great show."
    }
  ],
  "errorMessage": ""
}