{
  "imDbId": "tt0290988",
  "title": "Trailer Park Boys",
  "fullTitle": "Trailer Park Boys (TV Series 2001–2018)",
  "type": "TVSeries",
  "year": "2001",
  "language": "en",
  "titleInLanguage": "Trailer Park Boys",
  "url": "https://en.wikipedia.org/wiki/Trailer_Park_Boys",
  "plotShort": {
    "plainText": "Trailer Park Boys is a Canadian mockumentary sitcom television series created by Mike Clattenburg that began airing in 2001 as a continuation of his 1999 film bearing the same name. The show follows the misadventures of a group of trailer park residents, including two lead characters in and out of prison, living in the fictional \"Sunnyvale Trailer Park\" in Dartmouth, Nova Scotia. The series premiered on Showcase on April 20, 2001, and originally ran for seven seasons before concluding with a one-hour special on December 7, 2008. The series spawned three films: The Movie, released on October 6, 2006; Countdown to Liquor Day, released on September 25, 2009; and Don't Legalize It, released on April 18, 2014.\r\nIn 2013, Robb Wells, John Paul Tremblay, and Mike Smith, the actors who respectively portrayed Ricky, Julian, and Bubbles, purchased the rights to the show from the original producers and created their own internet streaming network, Swearnet. Starting in March 2014, Swearnet co-produced new episodes of the show with the American streaming service Netflix, and the eighth season premiered on September 5, 2014. Several specials and mini-series were made in the years that followed. An animated spinoff series premiered on March 31, 2019. In October 2019, filming began on a spinoff series, Trailer Park Boys: Jail, which premiered on Swearnet on January 1, 2021.",
    "html": "<p>Trailer Park Boys is a Canadian mockumentary sitcom television series created by Mike Clattenburg that began airing in 2001 as a continuation of his 1999 film bearing the same name. The show follows the misadventures of a group of trailer park residents, including two lead characters in and out of prison, living in the fictional \"Sunnyvale Trailer Park\" in Dartmouth, Nova Scotia. The series premiered on Showcase on April 20, 2001, and originally ran for seven seasons before concluding with a one-hour special on December 7, 2008. The series spawned three films: The Movie, released on October 6, 2006; Countdown to Liquor Day, released on September 25, 2009; and Don't Legalize It, released on April 18, 2014.</p><p>In 2013, Robb Wells, John Paul Tremblay, and Mike Smith, the actors who respectively portrayed Ricky, Julian, and Bubbles, purchased the rights to the show from the original producers and created their own internet streaming network, Swearnet. Starting in March 2014, Swearnet co-produced new episodes of the show with the American streaming service Netflix, and the eighth season premiered on September 5, 2014. Several specials and mini-series were made in the years that followed. An animated spinoff series premiered on March 31, 2019. In October 2019, filming began on a spinoff series, Trailer Park Boys: Jail, which premiered on Swearnet on January 1, 2021.</p>"
  },
  "plotFull": {
    "plainText": "Trailer Park Boys is a Canadian mockumentary sitcom television series created by Mike Clattenburg that began airing in 2001 as a continuation of his 1999 film bearing the same name. The show follows the misadventures of a group of trailer park residents, including two lead characters in and out of prison, living in the fictional \"Sunnyvale Trailer Park\" in Dartmouth, Nova Scotia. The series premiered on Showcase on April 20, 2001, and originally ran for seven seasons before concluding with a one-hour special on December 7, 2008. The series spawned three films: The Movie, released on October 6, 2006; Countdown to Liquor Day, released on September 25, 2009; and Don't Legalize It, released on April 18, 2014.\r\nIn 2013, Robb Wells, John Paul Tremblay, and Mike Smith, the actors who respectively portrayed Ricky, Julian, and Bubbles, purchased the rights to the show from the original producers and created their own internet streaming network, Swearnet. Starting in March 2014, Swearnet co-produced new episodes of the show with the American streaming service Netflix, and the eighth season premiered on September 5, 2014. Several specials and mini-series were made in the years that followed. An animated spinoff series premiered on March 31, 2019. In October 2019, filming began on a spinoff series, Trailer Park Boys: Jail, which premiered on Swearnet on January 1, 2021.\r\nHistory\r\nIn 1998, director Mike Clattenburg wrote and directed a short film titled One Last Shot, which was shot in black-and-white. The film followed the exploits of two friends, Rob (Robb Wells) and Gary William or GW (John Paul Tremblay), although it is not based in the same setting as Trailer Park Boys. It was the first time Robb, John Paul and John Dunsworth worked together. In the 1999 feature film Trailer Park Boys, the character Julian states to the camera that he wanted his life to be documented after receiving a telephone psychic's prediction that he would die soon. He hoped that the film would deter others from the life of crime he had chosen.\r\nThe feature film was shown at the Atlantic Film Festival in 1999, and it caught the attention of producer Barrie Dunn, who saw the potential for a television series. Clattenburg and Dunn, along with Wells and Tremblay, worked on a proposal for a 13-episode season of the show and traveled to Toronto to pitch the show to The Comedy Network. After being turned down, they suddenly decided to pitch the show to Showcase before returning home to Nova Scotia.\r\nThey found that the network was receptive and sent them back with a commitment to a first season, with the provision that a second experienced producer (which ended up being Michael Volpe) be brought on board to assist the team. The first six 30-minute episodes were then written and filmed. Some modifications were made to the characters and storyline for the series, and more humor was added to the series in comparison to the film.\r\nThe biggest change from film to series was the addition of Mike Smith's \"Bubbles\" character, who was originally developed for the earlier short film The Cart Boy, a film that Smith, Wells, Tremblay, and Clattenburg worked on together in 1995. Smith's character soon grew from a recurring character to one of the show's primary protagonists (although in the earlier film, \"Bubbles\" was the name of Smith's character's cat). Trailer Park Boys resided with Showcase for its first seven seasons. Beginning with the eighth season, the series was released through Netflix.\r\nEarly seasons were shot in various trailer parks in Nova Scotia, but the crew was not welcome to film again due to complaints from residents. These included Woodbine Home Park, an unnamed collection of trailers in central Dartmouth next to the Tufts Cove Generating Station, Timberlea Mini Home Park and Greenridge Mobile Home Park. Seasons 5 to 7 were filmed at a custom built set near Bissett Lake in Cole Harbour. For this location, trailers were placed around an existing 2 floor building which also served as the set of the jail. When the series returned from hiatus beginning with Season 8, it was shot at Bible Hill Estates Trailer Park in Truro, Nova Scotia, with every subsequent episode being filmed at that location. After the 12th season, they ceased filming at the location and removed all sets and props from Bible Hill Estates, which still exists as an operating land lease community.\r\nOn September 1, 2014, Netflix announced that season 8 of Trailer Park Boys would be available on September 5. Season 9 of Trailer Park Boys was made available on March 27, 2015. On June 1, 2015, Swearnet officially announced that the production of Season 10 was underway. On March 28, 2016, Netflix released season 10 of the Trailer Park Boys. It consists of 10 episodes and includes appearances from several well-known stars such as Snoop Dogg, Jimmy Kimmel, Doug Benson and Tom Arnold. Two episodes were directed by Bobby Farrelly. On April 2, 2016, and on April 20, 2016, Lucy DeCoutere and Jonathan Torrens announced they were leaving the show. On May 30, 2016, filming and production began for Season 11 of Trailer Park Boys. On July 5, 2016, filming for Season 11 was completed and editing began. On February 22, it was announced that Season 11 would air March 31, 2017. On March 31, 2017, Season 11 aired. On June 19, 2017, it was announced that filming of the twelfth season was officially underway. On October 16, 2017, John Dunsworth died at the age of 71, with Season 12 marking his final appearance on the show. Season 12, the final season produced as part of the Netflix deal was made available on March 30, 2018.\r\nOn March 31, 2019, Trailer Park Boys: The Animated Series premiered on Netflix. Smith later revealed in October that filming for another season titled Trailer Park Boys: Jail had begun. A second Christmas special, featuring never-before-seen footage of John Dunsworth prior to his death, premiered on Christmas Day, 2020. On January 1, 2021, Trailer Park Boys: Jail premiered on Swearnet.\r\nPremise\r\nSetting and characters\r\nEpisodes revolve around Sunnyvale Trailer Park residents Ricky, Julian, and Bubbles trying to make money through petty crimes while avoiding the police. Their schemes are complicated by the interference of the park's vindictive alcoholic supervisor Jim Lahey and his assistant and romantic partner, Randy. Ricky and Julian's incompetence is rivaled by Lahey's drunken ineptitude. Throughout the series, Ricky, Julian, and Bubbles end up in and out of jail, with most of their schemes collapsing into failure. Later seasons adopted a cyclical formula: each season finale featured the boys' schemes succeeding, and their future looking optimistic, while the next season's premiere would show them explaining how everything had gone wrong in the interim. Fans learned to expect that seasons would somehow end with some or all of the main characters going to jail.\r\nEach character has his or her own trademark mannerism or trait. Julian often takes a leadership role and devises schemes, all while holding a Cuba Libre on the rocks in his hand. Ricky believes himself to be dumb, and his speech is often laced with malapropisms that fans call \"Rickyisms\"; he lives in a dilapidated 1975 Chrysler New Yorker (nicknamed \"the Shitmobile\"), and grows marijuana. Bubbles wears spectacles that magnify his eyes to a hyperbolic extent, drives a go-kart, and lives in a shed with many cats; he is the least likely to face any repercussions for the trio's illegal activities. Alcoholic trailer park supervisor and ex-cop Jim Lahey usually attempts to derail the Boys' schemes, and nearly always shoehorns the word \"shit\" into his cautionary metaphors that fans call \"Shitisms.\" Randy is Lahey's assistant and lover; he never wears a shirt unless he absolutely has to and is often taunted for his large gut and addiction to cheeseburgers.\r\nThere are also a number of minor characters. Ricky's legal, but not biological father Ray, who uses a wheelchair, is a former trucker and self-declared Calvinist who is secretly committing disability fraud, in addition to being an alcoholic and gambling addict. Barbara is the trailer park owner and Lahey's ex-wife. Cory and Trevor are hapless best friends who assist and idolize Ricky and Julian, often unaware that they will serve as scapegoats when Ricky and Julian's plans inevitably go awry; Jacob later replaces Trevor after his disappearance from Sunnyvale. Lucy is the mother of Ricky's daughter Trinity, while Sarah, a friend, moved in with Lucy after Ricky's first imprisonment. J-Roc is a white aspiring rapper who genuinely thinks he is black; he is rarely seen without his friend Tyrone, who actually is black.\r\nProduction\r\nFormat\r\nThe series is shot in a mockumentary style (including the use of long takes), featuring handheld camera work. Characters often speak directly to crew members, who occasionally become involved in the plot. In one episode, a crewman is shot; in another, one is tased by Jim Lahey. The show is loosely scripted, with much of the dialogue ad-libbed from basic plot points. These aspects are intended to evoke a sense of realism. The trio have stated that many of the show's most popular moments were not in the script. To support the \"lore\" that the show is nonfiction, many of the actors (particularly Robb Wells, John Paul Tremblay, Mike Smith, John Dunsworth and Patrick Roach) often make public appearances in character.\r\nEpisodes\r\nFilms and specials\r\nTrailer Park Boys\r\nThe initial Trailer Park Boys movie was shown in 1999. It was directed, produced, and written by Mike Clattenburg. The film was shot in black-and-white, and it followed the criminal exploits of Robb Wells as Ricky LaFleur and John Paul Tremblay as Julian. The plot centered on Julian as he wished to document his life of crime after a psychic reading over the phone predicted his death. The movie was initially shown on the Showcase network prior to the TV show's airing. It featured various other cast members who would later appear in the TV series: Lucy DeCoutere as Ricky's fiancé Lucy, Jeanna Harrison-Steinhart as Ricky and Lucy's daughter Trinity, Sam Tarasco as Ricky and Julian's associate Sam, and Cory Bowles and Michael Jackson as two dim-witted friends Cory and Trevor respectively. A few other cast members who later appeared in the TV show also portrayed different characters in the film, such as Patrick Roach as the alcoholic dog owner Patrick (instead of the TV show's character Randy) and Mike Smith as the location sound recordist (instead of the TV show's character Bubbles). A short clip of the film's climax was shown during the pilot episode of season 1 which connected the film to the TV show.\r\nTrailer Park Boys: The Movie\r\nA movie based on the television series (and the second film in the franchise to be produced overall), titled Trailer Park Boys: The Movie (also known as The Big Dirty) was released on October 6, 2006, and distributed by Alliance Atlantis. Ivan Reitman produced the movie, Mike Clattenburg directed it, and Clattenburg and Robb Wells co-wrote it. It was nominated for a Genie Award for Best Motion Picture, but did not win.\r\nCountdown to Liquor Day\r\nThe second film based on the series, Trailer Park Boys: Countdown to Liquor Day, was released in Canada on September 25, 2009. The movie serves as a continuation to the show's original seven season run.\r\nDon't Legalize It\r\nIn May 2012, Mike Clattenburg announced on his Twitter page that a third film was in development. Principal photography was scheduled to begin in October 2012, but was pushed back to March 2013; filming began on March 17, 2013. On April 20, 2013, the production moved to Ottawa, Ontario, Canada, where filming took place at Parliament Hill during the 4/20 weekend. Entertainment One announced that the third and final film, titled Trailer Park Boys 3: Don't Legalize It, would be released in Canada on April 18, 2014.\r\nThe plot centers on Ricky's concerns that if the Canadian government legalized and controlled marijuana sale, it would put his grow-op out of business.\r\nLive in Fuckin' Dublin\r\nA new 80-minute special titled Trailer Park Boys: Live In Fuckin' Dublin debuted on June 1, 2014, exclusively on Netflix. Footage from the trio's May 9, 2013, performance at the Olympia Theatre in Dublin, Ireland, the Ricky, Julian and Bubbles Community Service Variety Show, was collected for a concert film. The live show contains an introduction and epilogue shot in the format of a Trailer Park Boys episode, with the premise that the boys are arrested in Dublin and forced to serve community service by staging a puppet show discouraging drug and alcohol use. Some elements from the television series return in Live in Fuckin' Dublin, such as Alex Lifeson's (from the band Rush) feud with Ricky, Ricky's inadvertently gluing objects to his nose, and Conky's many resurrections. The film was released on June 1, 2014. The season 8 episode \"Community Service and a Boner Made with Love\" contains a similar premise.\r\nDrunk, High & Unemployed Live from Austin Texas\r\nA new live special titled Trailer Park Boys: Drunk, High & Unemployed Live from Austin, Texas debuted in 2016, exclusively on Netflix.\r\nDVD releases\r\nEntertainment One (formerly Alliance Home Entertainment) has released all twelve seasons of Trailer Park Boys on DVD in Region 1. The Say Goodnight to The Bad Guys special was also released on Blu-ray.\r\nOther media\r\nComics\r\nOn February 17, 2021, it was announced that the Trailer Park Boys Incorporated have collaborated with Devil's Due Publishing to make a comic book adaptation of the series which will only consist of one-shots and miniseries\r\nReception\r\nThe show became very successful in many countries. The show's lead trio formerly toured with Our Lady Peace, with whom Bubbles sings his trademark song \"Liquor and Whores\". On January 13, 2017, Trailer Park Boys and Bubbles finally released \"Liquor & Whores\" as an EDM track produced by Canadian Multi-Platinum producer, Marc Mysterio on Sony Music. The Trailer Park Boys have also appeared in music videos with The Tragically Hip, while Bubbles has appeared with George Canyon and Snow, and they have been presenters at numerous award shows – always in character. Several famous artists appear on the show, such as Alex Lifeson from Rush in \"Closer to the Heart,\" singer Rita MacNeil in the season four finale \"Working Man,\" Brian Vollmer from Helix, Sebastian Bach from Skid Row, and the late singer-songwriter Denny Doherty of The Mamas and the Papas in the season seven finale \"A Shitriver Runs Through It\".\r\nThe show was a great success for the cable network Showcase, where it was the network's highest-rated Canadian original series. Internationally it aired in Australia on The Comedy Channel, the United Kingdom and Spain on Paramount Comedy, the Republic of Ireland on 3e, Iceland on SkjárEinn, New Zealand on TV 2, Israel on Xtra Hot, the Netherlands, Germany and Poland on respective local versions of Comedy Central for these three European countries, Denmark on DR2, Portugal on SIC Radical, Finland on Nelonen and Bulgaria on Nova Television. BBC America once aired a censored version of the series in the United States. On February 5, 2009, satellite provider DirecTV began airing the series in the country on its channel The 101 Network uncensored at the rate of two episodes per week. DirecTV aired the entire seven-season run of Trailer Park Boys, plus both specials. All episodes aired on DirecTV are in 16:9 widescreen format (although not in High Definition resolution), as opposed to the standard definition 4:3 aspect DVD releases of the first five seasons. It is also available on Netflix (depending on the country where the service is accessed).",
    "html": "<p>Trailer Park Boys is a Canadian mockumentary sitcom television series created by Mike Clattenburg that began airing in 2001 as a continuation of his 1999 film bearing the same name. The show follows the misadventures of a group of trailer park residents, including two lead characters in and out of prison, living in the fictional \"Sunnyvale Trailer Park\" in Dartmouth, Nova Scotia. The series premiered on Showcase on April 20, 2001, and originally ran for seven seasons before concluding with a one-hour special on December 7, 2008. The series spawned three films: The Movie, released on October 6, 2006; Countdown to Liquor Day, released on September 25, 2009; and Don't Legalize It, released on April 18, 2014.</p><p>In 2013, Robb Wells, John Paul Tremblay, and Mike Smith, the actors who respectively portrayed Ricky, Julian, and Bubbles, purchased the rights to the show from the original producers and created their own internet streaming network, Swearnet. Starting in March 2014, Swearnet co-produced new episodes of the show with the American streaming service Netflix, and the eighth season premiered on September 5, 2014. Several specials and mini-series were made in the years that followed. An animated spinoff series premiered on March 31, 2019. In October 2019, filming began on a spinoff series, Trailer Park Boys: Jail, which premiered on Swearnet on January 1, 2021.</p><br/><h3>History</h3><p>In 1998, director Mike Clattenburg wrote and directed a short film titled One Last Shot, which was shot in black-and-white. The film followed the exploits of two friends, Rob (Robb Wells) and Gary William or GW (John Paul Tremblay), although it is not based in the same setting as Trailer Park Boys. It was the first time Robb, John Paul and John Dunsworth worked together. In the 1999 feature film Trailer Park Boys, the character Julian states to the camera that he wanted his life to be documented after receiving a telephone psychic's prediction that he would die soon. He hoped that the film would deter others from the life of crime he had chosen.</p><p>The feature film was shown at the Atlantic Film Festival in 1999, and it caught the attention of producer Barrie Dunn, who saw the potential for a television series. Clattenburg and Dunn, along with Wells and Tremblay, worked on a proposal for a 13-episode season of the show and traveled to Toronto to pitch the show to The Comedy Network. After being turned down, they suddenly decided to pitch the show to Showcase before returning home to Nova Scotia.</p><p>They found that the network was receptive and sent them back with a commitment to a first season, with the provision that a second experienced producer (which ended up being Michael Volpe) be brought on board to assist the team. The first six 30-minute episodes were then written and filmed. Some modifications were made to the characters and storyline for the series, and more humor was added to the series in comparison to the film.</p><p>The biggest change from film to series was the addition of Mike Smith's \"Bubbles\" character, who was originally developed for the earlier short film The Cart Boy, a film that Smith, Wells, Tremblay, and Clattenburg worked on together in 1995. Smith's character soon grew from a recurring character to one of the show's primary protagonists (although in the earlier film, \"Bubbles\" was the name of Smith's character's cat). Trailer Park Boys resided with Showcase for its first seven seasons. Beginning with the eighth season, the series was released through Netflix.</p><p>Early seasons were shot in various trailer parks in Nova Scotia, but the crew was not welcome to film again due to complaints from residents. These included Woodbine Home Park, an unnamed collection of trailers in central Dartmouth next to the Tufts Cove Generating Station, Timberlea Mini Home Park and Greenridge Mobile Home Park. Seasons 5 to 7 were filmed at a custom built set near Bissett Lake in Cole Harbour. For this location, trailers were placed around an existing 2 floor building which also served as the set of the jail. When the series returned from hiatus beginning with Season 8, it was shot at Bible Hill Estates Trailer Park in Truro, Nova Scotia, with every subsequent episode being filmed at that location. After the 12th season, they ceased filming at the location and removed all sets and props from Bible Hill Estates, which still exists as an operating land lease community.</p><p>On September 1, 2014, Netflix announced that season 8 of Trailer Park Boys would be available on September 5. Season 9 of Trailer Park Boys was made available on March 27, 2015. On June 1, 2015, Swearnet officially announced that the production of Season 10 was underway. On March 28, 2016, Netflix released season 10 of the Trailer Park Boys. It consists of 10 episodes and includes appearances from several well-known stars such as Snoop Dogg, Jimmy Kimmel, Doug Benson and Tom Arnold. Two episodes were directed by Bobby Farrelly. On April 2, 2016, and on April 20, 2016, Lucy DeCoutere and Jonathan Torrens announced they were leaving the show. On May 30, 2016, filming and production began for Season 11 of Trailer Park Boys. On July 5, 2016, filming for Season 11 was completed and editing began. On February 22, it was announced that Season 11 would air March 31, 2017. On March 31, 2017, Season 11 aired. On June 19, 2017, it was announced that filming of the twelfth season was officially underway. On October 16, 2017, John Dunsworth died at the age of 71, with Season 12 marking his final appearance on the show. Season 12, the final season produced as part of the Netflix deal was made available on March 30, 2018.</p><p>On March 31, 2019, Trailer Park Boys: The Animated Series premiered on Netflix. Smith later revealed in October that filming for another season titled Trailer Park Boys: Jail had begun. A second Christmas special, featuring never-before-seen footage of John Dunsworth prior to his death, premiered on Christmas Day, 2020. On January 1, 2021, Trailer Park Boys: Jail premiered on Swearnet.</p><br/><h3>Premise</h3><h4>Setting and characters</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>does not <span>cite</span> any <span>sources</span></b>.<span class=\"hide-when-compact\"> Please help <span class=\"external text\">improve this section</span> by <span>adding citations to reliable sources</span>. Unsourced material may be challenged and <span>removed</span>.</span>  <span class=\"date-container\"><i>(<span class=\"date\">April 2021</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><p>Episodes revolve around Sunnyvale Trailer Park residents Ricky, Julian, and Bubbles trying to make money through petty crimes while avoiding the police. Their schemes are complicated by the interference of the park's vindictive alcoholic supervisor Jim Lahey and his assistant and romantic partner, Randy. Ricky and Julian's incompetence is rivaled by Lahey's drunken ineptitude. Throughout the series, Ricky, Julian, and Bubbles end up in and out of jail, with most of their schemes collapsing into failure. Later seasons adopted a cyclical formula: each season finale featured the boys' schemes succeeding, and their future looking optimistic, while the next season's premiere would show them explaining how everything had gone wrong in the interim. Fans learned to expect that seasons would somehow end with some or all of the main characters going to jail.</p><p>Each character has his or her own trademark mannerism or trait. Julian often takes a leadership role and devises schemes, all while holding a Cuba Libre on the rocks in his hand. Ricky believes himself to be dumb, and his speech is often laced with malapropisms that fans call \"Rickyisms\"; he lives in a dilapidated 1975 Chrysler New Yorker (nicknamed \"the Shitmobile\"), and grows marijuana. Bubbles wears spectacles that magnify his eyes to a hyperbolic extent, drives a go-kart, and lives in a shed with many cats; he is the least likely to face any repercussions for the trio's illegal activities. Alcoholic trailer park supervisor and ex-cop Jim Lahey usually attempts to derail the Boys' schemes, and nearly always shoehorns the word \"shit\" into his cautionary metaphors that fans call \"Shitisms.\" Randy is Lahey's assistant and lover; he never wears a shirt unless he absolutely has to and is often taunted for his large gut and addiction to cheeseburgers.</p><p>There are also a number of minor characters. Ricky's legal, but not biological father Ray, who uses a wheelchair, is a former trucker and self-declared Calvinist who is secretly committing disability fraud, in addition to being an alcoholic and gambling addict. Barbara is the trailer park owner and Lahey's ex-wife. Cory and Trevor are hapless best friends who assist and idolize Ricky and Julian, often unaware that they will serve as scapegoats when Ricky and Julian's plans inevitably go awry; Jacob later replaces Trevor after his disappearance from Sunnyvale. Lucy is the mother of Ricky's daughter Trinity, while Sarah, a friend, moved in with Lucy after Ricky's first imprisonment. J-Roc is a white aspiring rapper who genuinely thinks he is black; he is rarely seen without his friend Tyrone, who actually is black.</p><br/><h3>Production</h3><h4>Format</h4><p>The series is shot in a mockumentary style (including the use of long takes), featuring handheld camera work. Characters often speak directly to crew members, who occasionally become involved in the plot. In one episode, a crewman is shot; in another, one is tased by Jim Lahey. The show is loosely scripted, with much of the dialogue ad-libbed from basic plot points. These aspects are intended to evoke a sense of realism. The trio have stated that many of the show's most popular moments were not in the script. To support the \"lore\" that the show is nonfiction, many of the actors (particularly Robb Wells, John Paul Tremblay, Mike Smith, John Dunsworth and Patrick Roach) often make public appearances in character.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"3\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th><th scope=\"col\" style=\"padding:0 8px\">Network</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 22, 2001</td><td style=\"padding:0 8px\">May 27, 2001</td><td rowspan=\"7\"><span>Showcase</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 23, 2002</td><td style=\"padding:0 8px\">August 4, 2002</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 20, 2003</td><td style=\"padding:0 8px\">June 8, 2003</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 11, 2004</td><td style=\"padding:0 8px\">May 30, 2004</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 17, 2005</td><td style=\"padding:0 8px\">June 19, 2005</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 16, 2006</td><td style=\"padding:0 8px\">May 21, 2006</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>7</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 8, 2007</td><td style=\"padding:0 8px\">June 10, 2007</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>8</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">September 5, 2014</td><td rowspan=\"5\"><span>Netflix</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>9</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">March 27, 2015</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>10</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">March 25, 2016</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>11</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">March 31, 2017</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>12</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">March 30, 2018</td></tr></tbody></table><br/><h3>Films and specials</h3><h4>Trailer Park Boys</h4><p>The initial Trailer Park Boys movie was shown in 1999. It was directed, produced, and written by Mike Clattenburg. The film was shot in black-and-white, and it followed the criminal exploits of Robb Wells as Ricky LaFleur and John Paul Tremblay as Julian. The plot centered on Julian as he wished to document his life of crime after a psychic reading over the phone predicted his death. The movie was initially shown on the Showcase network prior to the TV show's airing. It featured various other cast members who would later appear in the TV series: Lucy DeCoutere as Ricky's fiancé Lucy, Jeanna Harrison-Steinhart as Ricky and Lucy's daughter Trinity, Sam Tarasco as Ricky and Julian's associate Sam, and Cory Bowles and Michael Jackson as two dim-witted friends Cory and Trevor respectively. A few other cast members who later appeared in the TV show also portrayed different characters in the film, such as Patrick Roach as the alcoholic dog owner Patrick (instead of the TV show's character Randy) and Mike Smith as the location sound recordist (instead of the TV show's character Bubbles). A short clip of the film's climax was shown during the pilot episode of season 1 which connected the film to the TV show.</p><h4>Trailer Park Boys: The Movie</h4><p>A movie based on the television series (and the second film in the franchise to be produced overall), titled Trailer Park Boys: The Movie (also known as The Big Dirty) was released on October 6, 2006, and distributed by Alliance Atlantis. Ivan Reitman produced the movie, Mike Clattenburg directed it, and Clattenburg and Robb Wells co-wrote it. It was nominated for a Genie Award for Best Motion Picture, but did not win.</p><h4>Countdown to Liquor Day</h4><p>The second film based on the series, Trailer Park Boys: Countdown to Liquor Day, was released in Canada on September 25, 2009. The movie serves as a continuation to the show's original seven season run.</p><h4>Don't Legalize It</h4><p>In May 2012, Mike Clattenburg announced on his Twitter page that a third film was in development. Principal photography was scheduled to begin in October 2012, but was pushed back to March 2013; filming began on March 17, 2013. On April 20, 2013, the production moved to Ottawa, Ontario, Canada, where filming took place at Parliament Hill during the 4/20 weekend. Entertainment One announced that the third and final film, titled Trailer Park Boys 3: Don't Legalize It, would be released in Canada on April 18, 2014.</p><p>The plot centers on Ricky's concerns that if the Canadian government legalized and controlled marijuana sale, it would put his grow-op out of business.</p><h4>Live in Fuckin' Dublin</h4><p>A new 80-minute special titled Trailer Park Boys: Live In Fuckin' Dublin debuted on June 1, 2014, exclusively on Netflix. Footage from the trio's May 9, 2013, performance at the Olympia Theatre in Dublin, Ireland, the Ricky, Julian and Bubbles Community Service Variety Show, was collected for a concert film. The live show contains an introduction and epilogue shot in the format of a Trailer Park Boys episode, with the premise that the boys are arrested in Dublin and forced to serve community service by staging a puppet show discouraging drug and alcohol use. Some elements from the television series return in Live in Fuckin' Dublin, such as Alex Lifeson's (from the band Rush) feud with Ricky, Ricky's inadvertently gluing objects to his nose, and Conky's many resurrections. The film was released on June 1, 2014. The season 8 episode \"Community Service and a Boner Made with Love\" contains a similar premise.</p><h4>Drunk, High & Unemployed Live from Austin Texas</h4><p>A new live special titled Trailer Park Boys: Drunk, High & Unemployed Live from Austin, Texas debuted in 2016, exclusively on Netflix.</p><h4>DVD releases</h4><p>Entertainment One (formerly Alliance Home Entertainment) has released all twelve seasons of Trailer Park Boys on DVD in Region 1. The Say Goodnight to The Bad Guys special was also released on Blu-ray.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>DVD Name</th><th>Episodes</th><th>Release date</th></tr><tr><td>The Complete First and Second Seasons</td><td>13</td><td>May 27, 2003</td></tr><tr><td>The Complete Third Season</td><td>8</td><td>April 6, 2004</td></tr><tr><td>The Complete Fourth Season</td><td>8</td><td>April 12, 2005</td></tr><tr><td>Christmas Special</td><td>1</td><td>November 15, 2005</td></tr><tr><td>The Complete Fifth Season</td><td>10</td><td>May 9, 2006</td></tr><tr><td>The Complete Sixth Season</td><td>6</td><td>May 8, 2007</td></tr><tr><td>The Complete Seventh Season</td><td>10</td><td>May 6, 2008</td></tr><tr><td>Say Goodnight to the Bad Guys</td><td>1</td><td>December 7, 2008</td></tr><tr><td>The Complete Eighth Season</td><td>10</td><td>December 9, 2014</td></tr><tr><td>The Complete Ninth Season</td><td>10</td><td>June 2, 2015</td></tr><tr><td>The Complete Tenth Season</td><td>10</td><td>October 4, 2016</td></tr><tr><td>The Complete Eleventh Season</td><td>10</td><td>April 3, 2018</td></tr><tr><td>The Complete Twelfth Season</td><td>10</td><td>April 2, 2019</td></tr><tr><td>The Complete Series</td><td>55</td><td>June 16, 2009</td></tr><tr><td>The Complete Collection</td><td>55</td><td>October 11, 2011</td></tr><tr><td>Dressed All Over <span style=\"font-size:85%;\">(The Complete Collection)</span></td><td>55 eps., 2 specials and 2 films</td><td>November 5, 2013</td></tr></tbody></table><br/><h3>Other media</h3><h4>Comics</h4><p>On February 17, 2021, it was announced that the Trailer Park Boys Incorporated have collaborated with Devil's Due Publishing to make a comic book adaptation of the series which will only consist of one-shots and miniseries</p><br/><h3>Reception</h3><p>The show became very successful in many countries. The show's lead trio formerly toured with Our Lady Peace, with whom Bubbles sings his trademark song \"Liquor and Whores\". On January 13, 2017, Trailer Park Boys and Bubbles finally released \"Liquor & Whores\" as an EDM track produced by Canadian Multi-Platinum producer, Marc Mysterio on Sony Music. The Trailer Park Boys have also appeared in music videos with The Tragically Hip, while Bubbles has appeared with George Canyon and Snow, and they have been presenters at numerous award shows – always in character. Several famous artists appear on the show, such as Alex Lifeson from Rush in \"Closer to the Heart,\" singer Rita MacNeil in the season four finale \"Working Man,\" Brian Vollmer from Helix, Sebastian Bach from Skid Row, and the late singer-songwriter Denny Doherty of The Mamas and the Papas in the season seven finale \"A Shitriver Runs Through It\".</p><p>The show was a great success for the cable network Showcase, where it was the network's highest-rated Canadian original series. Internationally it aired in Australia on The Comedy Channel, the United Kingdom and Spain on Paramount Comedy, the Republic of Ireland on 3e, Iceland on SkjárEinn, New Zealand on TV 2, Israel on Xtra Hot, the Netherlands, Germany and Poland on respective local versions of Comedy Central for these three European countries, Denmark on DR2, Portugal on SIC Radical, Finland on Nelonen and Bulgaria on Nova Television. BBC America once aired a censored version of the series in the United States. On February 5, 2009, satellite provider DirecTV began airing the series in the country on its channel The 101 Network uncensored at the rate of two episodes per week. DirecTV aired the entire seven-season run of Trailer Park Boys, plus both specials. All episodes aired on DirecTV are in 16:9 widescreen format (although not in High Definition resolution), as opposed to the standard definition 4:3 aspect DVD releases of the first five seasons. It is also available on Netflix (depending on the country where the service is accessed).</p><br/>"
  },
  "errorMessage": ""
}