{
  "imDbId": "tt2442560",
  "title": "Peaky Blinders",
  "fullTitle": "Peaky Blinders (TV Series 2013–2022)",
  "type": "TVSeries",
  "year": "2013",
  "items": [
    {
      "username": "Amthermandes",
      "userUrl": "https://www.imdb.com/user/ur9755277",
      "reviewLink": "https://www.imdb.com/review/rw8611274",
      "warningSpoilers": false,
      "date": "15 October 2022",
      "rate": "9",
      "helpful": "59 out of 61 found this helpful.",
      "title": "There's something special about this show. There's a reason it's so well received.",
      "content": "Peaky Blinders is a tale that is extremely loosely based on an actual English gang in the 19th century. It's a story about anti-heroes, characters who you'd despise in real life, but who also generate feelings of sympathy from the audience. It's such a well made show, very engaging, and there's just something so special about it that makes it irresistible. I even tried to lose interest at one point, but found myself longing for more, I had to continue. And Cillian Murphy just kills it. He has proven he is lead-character worthy.Do yourself a favor and give this show a chance. It's well deserving of that. It's full of great acting, interesting plot developments, and fantastic camerawork. Be warned, you might find yourself a bit obsessed with it as well."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw7214381",
      "warningSpoilers": false,
      "date": "10 August 2021",
      "rate": "10",
      "helpful": "42 out of 43 found this helpful.",
      "title": "Brilliant!",
      "content": "Peaky Blinders is not only one of the most underrated TV shows of all-time but it's also one of the greatest shows of all-time! It's even better than all the hype and love it gets as more and more people are watching it and loving it! It's quickly becoming one of the better shows ever created! If you want to see how loved this show really is all you have to do is read through some of the reviews or look at the ratings. It's one of the rare shows where every season is just as great as the others! If you haven't seen this amazing show yet then do yourself a favor & go watch it immediately!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8793523",
      "warningSpoilers": false,
      "date": "11 January 2023",
      "rate": "10",
      "helpful": "62 out of 66 found this helpful.",
      "title": "Absolutely Amazing!",
      "content": "Peaky Blinders is without a doubt one of my favorite tv shows of all-time. I wanted to watch this after seeing the trailers and then I heard so many people talking about how great this show was, everyone I know who saw it loved it so it raised my expectations even more. When a show is that hyped it rarely lives up to it. Well, this show not only met those expectations but surpassed them in every way possible. The acting and writing is what makes this show so special but the attention to detail they put into every aspect of this show is amazing. This series will hook you from the very first episode and hold on throughout the series. Give yourself enough time to watch this because you're going to want to binge it as quickly as you can."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw4609813",
      "warningSpoilers": false,
      "date": "27 January 2019",
      "rate": "10",
      "helpful": "172 out of 195 found this helpful.",
      "title": "Superb",
      "content": "(Review updated after Season 6).Birmingham, England, 1919. In the aftermath of WW1, the Shelby family are making a name for themselves as bookmakers, racketeers and gangsters. Nominally the head of the family is the oldest brother, Arthur, but the real brains, ambition and drive in the organisation lies with Tommy, the second oldest. He will carve out an empire for himself that will stretch beyond Birmingham. This with the aid of his family and his gang, the Peaky Blinders.Superb drama, created and written by Steven Knight. Gritty, realistic, intriguing and highly entertaining. Some great machinations, subterfuges, plots and counter-plots plus a good amount of action and human drama. Think The Sopranos set in the UK in 1919.Some very clever storylines and plot developments. They sometimes threaten to become implausible and random (especially as the series goes on) but have a way of fitting together and all making sense at the end.Great work by the main performers: Cillian Murphy, Helen McCrory, Paul Anderson, Sophie Rundle and Joe Cole. The secondary/guest performances include some big names: Sam Neill, Tom Hardy, Aiden Gillen, Adrien Brody, Noah Taylor. Tom Hardy is the pick of the bunch, as Alfie Solomons.Great soundtrack too. Though set in the early-20th century, the music is mostly rock, and it works. Despite being anachronistic, the music works, giving the series an edgy feel. It starts with the theme track - Nick Cave's excellent 'Red Right Hand', a song that seems to fit Tommy Shelby perfectly. It continues with the scene-specific music and includes some great tracks. For example, in one episode alone you have Radiohead's 'Climbing Up The Walls', Joy Division's 'Atmosphere' and Black Sabbath's 'War Pigs'.In addition, the show went out on a high, while it was still quality viewing. By Season 5 cracks were starting to appear: the plot in Season 5 was a bit loose and unfocused and ends rather clumsily, compared to previous seasons. Still great, but not as good as previous seasons and a sign that it had run its course.The worry then was that Steven Knight would just phone it in for a few seasons to milk more money out of it and just end up ruining the legacy of the show. However, Season 6 is a great finale: focused, short and sharp, wrapping things up in style."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8817352",
      "warningSpoilers": false,
      "date": "22 January 2023",
      "rate": "10",
      "helpful": "58 out of 64 found this helpful.",
      "title": "Brilliant!",
      "content": "Peaky Blinders is not only one of the most underrated TV shows of all-time but it's also one of the greatest shows of all-time! It's even better than all the hype and love it gets as more and more people are watching it and loving it! It's quickly becoming one of the better shows ever created! If you want to see how loved this show really is all you have to do is read through some of the reviews or look at the ratings. It's one of the rare shows where every season is just as great as the others! If you haven't seen this amazing show yet then do yourself a favor and go watch this show immediately!"
    },
    {
      "username": "cseabhi",
      "userUrl": "https://www.imdb.com/user/ur58232116",
      "reviewLink": "https://www.imdb.com/review/rw5766072",
      "warningSpoilers": false,
      "date": "24 May 2020",
      "rate": "8",
      "helpful": "45 out of 50 found this helpful.",
      "title": "Cillian Murphy as Thomas Shelby was treat to watch",
      "content": "One of the very well made british drama I have seen in TV Series. Compelling story telling with some really great acting lead by Cillian Murphy and the series that excels in all the other department...acting, direction, story, screenplay and the cinematography."
    },
    {
      "username": "Lukasmj",
      "userUrl": "https://www.imdb.com/user/ur158768880",
      "reviewLink": "https://www.imdb.com/review/rw8675164",
      "warningSpoilers": false,
      "date": "14 November 2022",
      "rate": "10",
      "helpful": "30 out of 33 found this helpful.",
      "title": "Beautiful production design, phenomenal Actors and great writing.",
      "content": "\"Peaky Blinders\" is one of my absolute favorite series!Cillian Murphy in the leading role is terrific and all the other characters are cast perfectly across the board.The series' story of a gang leader who desperately wants to make it legal is outstanding and is told so well that you just can't switch off.The title song sticks in your head like nothing else, the production design looks beautiful.However, season 6 didn't really have that familiar flair anymore. The season was still very good to watch, but unfortunately it didn't excite me.Also, I think it's a shame that Joe Cole left the show at some point because he was my favorite actor next to Cillian Murphy.Nonetheless, \"Peaky Blinders\" is undoubtedly worth the time invested!"
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw5813771",
      "warningSpoilers": true,
      "date": "10 June 2020",
      "rate": "10",
      "helpful": "97 out of 120 found this helpful.",
      "title": "\"I think what it is, you're bad men, but you're our bad men.\" - Ep. #1.6 - Former Garrison owner Harry to Tommy Shelby",
      "content": "I'm late to the party here as I have been for anything appearing on network or cable TV since 'Seinfeld' went off the air. But it's gratifying in one way, as I've been able to watch the (so far) complete five seasons of \"Peaky Blinders\" over the course of a few weeks without losing a sense of continuity. I have to say, this is one of the best series I've seen, on a par with shows like HBO's \"Deadwood\" and \"Carnivale\", though this one comes courtesy of Netflix and the BBC. The acting is impeccable, with a strong cast led by Cillian Murphy as the notorious Tommy Shelby, leader of the Peaky 'effing' Blinders, as the characters manage to remind us in just about every episode. Without knowing what the title refers to, it becomes clear in a fourth season episode I think, when Finn Shelby (Harry Kirton) earns his brotherly status in the organization by using the razor blade in the peak of his cap to register his initiation murder for the gang. The machinations of the Shelby's are sometimes difficult to follow if you're not attentive, as their alliances and enemies have a way of criss-crossing from one side to another, but suffice it to say, the gypsy blood in the Shelby's generally manage a way to insure their triumph over perceived adversaries. The series is set in 1920's Birmingham, England, with the period detail strikingly imaginative and real. With not a weak actor in the ensemble, it's hard to pick a favorite among the killers and assassins who populate the story lines, but for whatever reason, I happen to take a shine to Harry Kirton as Shelby sidekick Johnny Dogs, who has just the right blend of malice and humor to appear as a well regarded henchman. It will be interesting to see where the story goes next with the start up of Season Six whenever it comes to pass. You can just about bet that there will be more than one instance that result in 'the bleak midwinter'."
    },
    {
      "username": "deloudelouvain",
      "userUrl": "https://www.imdb.com/user/ur58525162",
      "reviewLink": "https://www.imdb.com/review/rw3187661",
      "warningSpoilers": false,
      "date": "20 February 2015",
      "rate": "10",
      "helpful": "95 out of 118 found this helpful.",
      "title": "Perfect!",
      "content": "This must be the best show that the BBC ever made. I absolutely love everything about this show. It is so refreshing compared to other new shows. The actors are all top notch. The constant battle between Cillian Murphy and Sam Neill is an absolute delight to watch. Helen McCrory as aunt Polly is another stunning performance. Annabelle Wallis is also very good. In fact every actor of this series is good. I can not fault anyone. The storyline with the dark industrial atmosphere form Birmingham post World War One all adds up to be one of the shows you can't dislike. The costumes and the surroundings are all perfect. It's like you took a time machine back to the beginning of the 20th century. Well done BBC, can't wait for the next season!"
    },
    {
      "username": "ahmetkozan",
      "userUrl": "https://www.imdb.com/user/ur48829349",
      "reviewLink": "https://www.imdb.com/review/rw4569627",
      "warningSpoilers": false,
      "date": "8 January 2019",
      "rate": "9",
      "helpful": "321 out of 400 found this helpful.",
      "title": "The Peaky Blinders Rises!",
      "content": "In Peaky Blinders we follow a family after the First World War that is always looking for power and money. But a policeman arriving at the city is looking to stop this family, but it's not easy. It will also be noticeable the segregated fight of ghettos like Italians, gypsies, local gangsters and Jews. Peaky Blinders is an excellent gangster drama full of rich, interesting and diverse characters. The fact that Peaky Blinders is a crime series can give the impression that characters are macho men. But this is not true. The series also incorporates many powerful female characters. It has an excellent cast and script. Thomas is a character who uses his strategic intelligence and applies violence to his own ends without hesitation. The film music is the highlight of the series along with Cillian Murphy and Tom Hardy. The director does resort to a modern soundtrack that reflects the fiction.It is estimated that one episode of the series is worth 1 million and 1.5 million euros. This means a rich, detailed and beautiful work of art. Constantly supporting the narrative structure visually, Peaky Blinders often touches upon the working conditions of the working class in Birmingham. Peaky Blinders, with a color scale that chooses to contrast between pale blues and greens, and contrasts with the shades of red, makes the strongest manifestation of emotions in the midst of this unknown, while attributing a distinct obscurity to Birmingham's misty air. Also, the visual effects used from time to time are quite clever. The visual effects used are also quite compatible with the historical theme of the series.Peaky Blinders makes each episode a separate action and drama. It's a breathtaking series where you can see the rise of Peaky Blinders. 9/10"
    },
    {
      "username": "yahaira-729-694701",
      "userUrl": "https://www.imdb.com/user/ur44796529",
      "reviewLink": "https://www.imdb.com/review/rw8503845",
      "warningSpoilers": true,
      "date": "1 September 2022",
      "rate": "9",
      "helpful": "20 out of 22 found this helpful.",
      "title": "Great show",
      "content": "I started watching this a few years ago and I gladly finally finished it and I decided. It started with death, violence and self destructive rage through but ended with redemption the symbolism at the end shows the protagonist as the resurrected From a very dark struggle the gypsies find fame and fortune with the fictitious Thomas Shelby played by Cillian Murphy, heading the clan. The characters are intriguing personalities full of rage and fury against the minority wealthy ruling class. The core of the clan being the strongest force in society to make revolutionary changes in a socirty slanted towards fascism as it is revalent in todays world."
    },
    {
      "username": "deepfrieddodo",
      "userUrl": "https://www.imdb.com/user/ur123203865",
      "reviewLink": "https://www.imdb.com/review/rw8523407",
      "warningSpoilers": false,
      "date": "7 September 2022",
      "rate": "9",
      "helpful": "23 out of 26 found this helpful.",
      "title": "Great Gritty British Drama",
      "content": "Superb British series using a historical source to create flourishing fictional criminal drama interwoven with factual events. Excellent storytelling with a compelling plot that evolves between each series. Perhaps it can go over the top at times, but by and large the advancements within the Birmingham criminal underworld are incremental, allowing poor gypsies to reach the top of the class hierarchy. The plot is engaging throughout, as the anti-heroes you cannot help but support involve themselves in gambling, smuggling and politics.Murphy is a fantastic lead, with the perfect accent to guide the series across arcs. The wider family are also brilliantly performed, creating the brotherly but dysfunctional bonds. Actors who dip in and out, such as Hardy, Neill and Brody, add detailed character and depth to plots and relationships. However, this isn't always the case in the latter series when brash American characters start to take the spotlight.Visually perfect, portraying the grit of an industrial British city post-First World War, with scenery and costuming matching the atmosphere created with historical accuracy. The soundtrack is one of the best of any series, seamlessly fitting modern music into the century-old setting."
    },
    {
      "username": "afura-78800",
      "userUrl": "https://www.imdb.com/user/ur132323361",
      "reviewLink": "https://www.imdb.com/review/rw8830864",
      "warningSpoilers": false,
      "date": "27 January 2023",
      "rate": "7",
      "helpful": "25 out of 28 found this helpful.",
      "title": "The peaky bloody Blinders",
      "content": "The first time I have seen peaky blinders was on youtube, there was a nice trailer with Tom Hardy and Cillian Murphy. I like both actors and the accents in the show sounded cool, so I thought I will give the show a try and watched it to the end on Netflix.Season 2 and 4 are my two favorite seasons of the series. If you like gangster or mafia stuff then this series is definitely something for you, but keep in mind the series is brutal and there is a lot of gore.Now the bad thing and why I only gave a 7, the issue for me with the series was that there were too many scenes were just nothing happened and people were just talking and talking, I got a bit bored sometimes. But this doesn't mean it was a bad show though I still enjoyed it, the story is pretty solid and cool and I loved Tommy's plans.Here is a funny fact about the series, Cillian Murphy who played Tommy Shelby smoked about 3000 herbal cigarettes in total during the first and second season."
    },
    {
      "username": "lakings97",
      "userUrl": "https://www.imdb.com/user/ur9679268",
      "reviewLink": "https://www.imdb.com/review/rw8597531",
      "warningSpoilers": false,
      "date": "8 October 2022",
      "rate": "9",
      "helpful": "27 out of 31 found this helpful.",
      "title": "Another Mafia Series",
      "content": "Peaky Blinders, the sixth and final season on Netflix is set during the late 30's to early 40's when fascism was growing in England right before WWII. The story follows mafia family The Shelbys lead by Tommy Shelby played by Cillian Murphy and his brother Arthur played by Paul Anderson. This season the family starts dealing opium to America with the help of Michael Shelby's wife and her infamous uncle. The story fast forwards four years and we find Tommy sober and becomes the eyes and ears for Winston Churchill to eliminate the fascist group. Great series, wonderful cast, sometimes hard to understand the gypsy Irish language but overall I loved it. There seems to be rumors that a prequel spinoff is in the works. Definitely add this to your library."
    },
    {
      "username": "abinewton07",
      "userUrl": "https://www.imdb.com/user/ur38454566",
      "reviewLink": "https://www.imdb.com/review/rw8765991",
      "warningSpoilers": false,
      "date": "29 December 2022",
      "rate": "10",
      "helpful": "36 out of 40 found this helpful.",
      "title": "I will never ever forget this show",
      "content": "I finally got round to watching this show about 10 years after it came out, and my god did it live up to the hype.There is some characters that stick with you that are just legendary throughout time, and Thomas Shelby is one of them.Absolutely fantastic storylines, every character and actor was phenomenal, it was raw, emotional, funny at times..Another actor i've discovered through this show who i also won't forget is Paul Anderson who played Arthur Shelby. Watching him and Cillian Murphy together felt special and like nothing you would see again. It felt genuine, like this wasn't acting.One of the best shows i've ever seen. Don't miss it."
    },
    {
      "username": "kostasbour-39639",
      "userUrl": "https://www.imdb.com/user/ur76828985",
      "reviewLink": "https://www.imdb.com/review/rw7190806",
      "warningSpoilers": false,
      "date": "3 August 2021",
      "rate": "9",
      "helpful": "63 out of 69 found this helpful.",
      "title": "Outstanding",
      "content": "I have never seen so much beautiful series in my entire life, the actors are amazing, scenario is outstanding, the \"guest actors\" (Tom hardy) are amazing. I don't know what to say anymore, the series is a huge diamond. Cilliian Murphy and Paul Anderson, also aunt poly belongs to my heart. Must watch series."
    },
    {
      "username": "Alistair_Glass",
      "userUrl": "https://www.imdb.com/user/ur155071348",
      "reviewLink": "https://www.imdb.com/review/rw8666776",
      "warningSpoilers": false,
      "date": "10 November 2022",
      "rate": "9",
      "helpful": "26 out of 29 found this helpful.",
      "title": "Impossible to comprehend",
      "content": "Peaky Blinder, wow.If you're thinking about watching this you should, as you follow the Peaky Blinders (mainly Thomas Shelby the main character) through the story you can see how progressively he continues to become richer and more politically influential whilst loosing family and sanity as he goes along. At many point he decides that he shan't continue on, but he always falls into similar cycles, loosing friends family and all things dear to him.Apart from the wonderful plot and intriguing characters the show also gives a valuable insight into 1930s British culture and politics, tackling drugs, alcohol, science, religion, spirits, gang culture, bribed police officials and several other controversial and interesting topics. Needless to say this is a wonderful series when it comes to the writing side and the actors follow up with an extraordinary act.The cinematography is also stunning with the final series taking it to a whole new level with certain scenes being exceptionally cinematic and well lit. The costumes and sets where equally beautiful.Quite honestly I could go on about how extraordinary this show is but in reality if you're into great shows whilst not minding gore and nudity this show is a definite must watch."
    },
    {
      "username": "stefmuts",
      "userUrl": "https://www.imdb.com/user/ur106614654",
      "reviewLink": "https://www.imdb.com/review/rw8539435",
      "warningSpoilers": false,
      "date": "12 September 2022",
      "rate": "8",
      "helpful": "24 out of 27 found this helpful.",
      "title": "Great show great music",
      "content": "I really loved the first few seasons but lost some interest after season 4, tried again afew weeks ago and this time watched it all. The acting is great, characters are interesting, great music that goes well with the scenes and the storyline is great up till season 4, after that it's getting a bit less. The final season is not as final as it seems te be at one point ( maybe what seemd to be should have been ...) the plan was not a 7th season but a movie, Im not too sure about that, but a 7th season would also not be a good idea (my opinion) Overall a great series (but maybe just stop after s4)"
    },
    {
      "username": "Moviebility",
      "userUrl": "https://www.imdb.com/user/ur62206325",
      "reviewLink": "https://www.imdb.com/review/rw8618234",
      "warningSpoilers": false,
      "date": "17 October 2022",
      "rate": "10",
      "helpful": "23 out of 26 found this helpful.",
      "title": "Highly Recommended!",
      "content": "I don't usually go for series that are overrated because most of the time they're not that entertaining before I could even finish one episode. This one is different though and for its genre it piques my interest and I found myself looking forward to what's going to happen next. The story is well written and characters were portrayed perfectly. It can be quite gory but at the same time I'm for how the events are well organized; it just doesn't give you the feeling that they wrote it in a rush. Every episode gives you mixed emotions -one episode makes you happy and then the next thing you know you're frustrated. Kudos to its writers I'm looking forward to watch more like Peaky Blinders in the future."
    },
    {
      "username": "Gatsby81",
      "userUrl": "https://www.imdb.com/user/ur106787589",
      "reviewLink": "https://www.imdb.com/review/rw7223125",
      "warningSpoilers": false,
      "date": "13 August 2021",
      "rate": "10",
      "helpful": "40 out of 49 found this helpful.",
      "title": "Awesome, outstanding show",
      "content": "It is been all said. This is must watch. Story telling is amazing the acting is outstanding."
    },
    {
      "username": "BeneCumb",
      "userUrl": "https://www.imdb.com/user/ur32764997",
      "reviewLink": "https://www.imdb.com/review/rw3490750",
      "warningSpoilers": false,
      "date": "20 June 2016",
      "rate": "9",
      "helpful": "36 out of 48 found this helpful.",
      "title": "Stylish gangster drama with realistically captured atmosphere",
      "content": "/refers to Seasons 1-3/In general, I am not particularly fond of series depicting criminal gangs, as there is too much swearing and violence, wrong values are promoted via lifestyle glorification, etc. But as I have always liked Cillian Murphy, I decided to dedicate dozens of hours to watch this series in succession.The first episode was largely not too promising - the mood was too depressive, with WWI reminiscences, and it seemed that Murphy and Sam Neill would strongly dominate over other actors... But then it all changed and I grew steadily accustomed to the environment, location and period I am not very familiar with. Acting became a talented team work, and minor characters obtained their time and place to show their demand to be included into this sophisticated course of events. The rich cried too, and the famous died too - so one could not easily guess what would happen next. Additional points from me for the selection of music/songs, providing a deepening atmosphere to this not-so-bright life in the industrial town of Birmingham.Apparently, the biggest value of this series is realistic depiction of both the venue and characters; even the gangsters are no numb bullies, but persons capable of versatile strong feelings and deeds. And each action has its reasons - as well as consequences.So I am looking forward to new seasons already - Season 4 was strong again.PS Season 5 has apparently the most compact dialogs, Season 6 is a nice round-up - and with a nice twist in the end... The pace is somewhat slower and Murphy spends more time on screen alone, but still - a very strong series."
    },
    {
      "username": "Imme-van-Gorp",
      "userUrl": "https://www.imdb.com/user/ur76725747",
      "reviewLink": "https://www.imdb.com/review/rw8157447",
      "warningSpoilers": false,
      "date": "19 May 2022",
      "rate": "9",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Amazing cinematography, acting and writing. The plotline and characters are truly very interesting.",
      "content": "Season One: 9/10Themes: Crime, Drama, Family, Post-War, Gangs, 19th Century, Romance, Suspense, Action & Historical.Top three characters: 1) Polly Gray, 2) Thomas Shelby, and 3) Arthur Shelby."
    },
    {
      "username": "barrattwest",
      "userUrl": "https://www.imdb.com/user/ur79244398",
      "reviewLink": "https://www.imdb.com/review/rw8822758",
      "warningSpoilers": false,
      "date": "24 January 2023",
      "rate": "9",
      "helpful": "33 out of 35 found this helpful.",
      "title": "Moody and magnificent!",
      "content": "Brilliant! Really powerful, great characters, compelling stories. Excellent for a binge watch.Acting is first class, cinematography is amazing and creates a dark mood to go with the dark stories. Whether it's totally authentic to the period or not is a mute point, as it's a fiction. It feels like it could be and that's what counts.Some of the violence is a bit shocking but adds to the grittiness of the show.I'm about to watch series six and can't wait!Can't agree with or understand people rating this poorly. Perhaps it's cool to be be controversial? The music and occasional slow-mo add to the tension, rather than detracting from it.Watch it and judge for yourself, certainly look at how many 9/10 ratings not the occasional 3 /4."
    },
    {
      "username": "bshaef",
      "userUrl": "https://www.imdb.com/user/ur25217752",
      "reviewLink": "https://www.imdb.com/review/rw4011794",
      "warningSpoilers": false,
      "date": "23 December 2017",
      "rate": "9",
      "helpful": "20 out of 25 found this helpful.",
      "title": "Just Finished Season 4",
      "content": "It started off good and continued good through the middle but the end was weak. I hope the writers put more pizzazz in season 5. Looking forward to a few more installments of this series. I think the people responsible for the scenery and costumes deserve an A+. Also would be interesting to know how they make the sky look so gray and drab which I'm sure it did in real life."
    },
    {
      "username": "MsCateArcher",
      "userUrl": "https://www.imdb.com/user/ur18054106",
      "reviewLink": "https://www.imdb.com/review/rw2871716",
      "warningSpoilers": false,
      "date": "18 September 2013",
      "rate": "9",
      "helpful": "283 out of 380 found this helpful.",
      "title": "It is good.",
      "content": "I was not expecting it to be this good,I really enjoyed all 4 episodes. The story is interesting,the acting is brilliant and the cinematography is just beautiful!I am eagerly waiting for the next episodes.When I compare Peaky Blinders to other popular TV shows that use sex,brutality and violence to shock the audiences and get high ratings(which they actually do)this sincere work is like needlework;fine,classy and detailed.The makers of this drama have not chosen the easy way,they have set off to make a first class period drama,that dares to be different.Cillian Murphy is at his best,I will even go as far as to say that this is one of the best performances I have seen of him.Sam Neil and Helen McCrory must be praised,all casting is perfect.Peaky Blinders sets high standards for other television dramas to follow."
    }
  ],
  "errorMessage": ""
}