{
  "imDbId": "tt2098220",
  "title": "Hunter x Hunter",
  "fullTitle": "Hunter x Hunter (TV Series 2011–2014)",
  "type": "TVSeries",
  "year": "2011",
  "items": [
    {
      "username": "blackmamba99971",
      "userUrl": "https://www.imdb.com/user/ur18437585",
      "reviewLink": "https://www.imdb.com/review/rw6967595",
      "warningSpoilers": true,
      "date": "26 May 2021",
      "rate": "10",
      "helpful": "56 out of 65 found this helpful.",
      "title": "A fantastic achievement",
      "content": "Hunter x Hunter. A marvelous story about a young boy who vowed to become a Hunter just like his father. Tasked with learning skills on both the mental and physical levels, Gon Freeces travels the world in hopes of finding his father who abandoned him at a young age.After meeting Killua Zoldyk who is an assassin in his own right joins Gon on his quest. They soon become best friends and discover new adventures which leads them to mysterious places, along with even more risky roads of dangerous people along the way. Hunter x Hunter captivates the viewer in every episode.Emotions run high during the arc stories especially during the Chimera ant arc. Episode 135 being the most potent of them all for some tense scenes that pulls on the human condition.The music is top notch through out. Action is above normal expectations, as well as learning about the mystic ideals of Nen, which is the interpretation of Chi that resides in any human being. I thoroughly enjoyed this series from the first episode to the last where Gon finally meets his father Ging Freeces.Beyond the obvious plot, I loved every character as well. From Netero, Knov, Morel, Mito and the entire Zoldyk family who are about as psychotic as the bush family line. The apple doesn't fall far from the tree as they say. Between fights of bravery, despair, joy, sadness and anger, anyone who watches this series can relate to each character on some level.Whether they are a fighter or simply a worker. Hunter x Hunter will continue to blaze a trail for those who dare to dream and hope for a brighter future. A word of warning concerning episode 135. Keep a box of tissues handy. You will need it. It was considered to be one of the finest episodes of the entire series."
    },
    {
      "username": "tonymars-63087",
      "userUrl": "https://www.imdb.com/user/ur106735135",
      "reviewLink": "https://www.imdb.com/review/rw7263768",
      "warningSpoilers": false,
      "date": "23 August 2021",
      "rate": "10",
      "helpful": "53 out of 62 found this helpful.",
      "title": "Screw this anime for making me cry",
      "content": "I said what I said. Wish there were more episodes. Loved every second of it."
    },
    {
      "username": "invisibleunicornninja",
      "userUrl": "https://www.imdb.com/user/ur85371862",
      "reviewLink": "https://www.imdb.com/review/rw4696675",
      "warningSpoilers": false,
      "date": "3 March 2019",
      "rate": "10",
      "helpful": "84 out of 104 found this helpful.",
      "title": "Pretty great.",
      "content": "I would highly recommend that everyone watch this show. I don't want to say anything to spoil it, and I'm sure that countless others have already provided more in-depth reasons why you should watch it, but still, watch it.I will warn you though, while the beginning of the show makes it seem like its going to be somewhat kid-friendly, trust me when I say that this is not the case."
    },
    {
      "username": "KenToo",
      "userUrl": "https://www.imdb.com/user/ur4042918",
      "reviewLink": "https://www.imdb.com/review/rw3101410",
      "warningSpoilers": false,
      "date": "9 October 2014",
      "rate": "10",
      "helpful": "166 out of 204 found this helpful.",
      "title": "The best anime I've ever seen by far!",
      "content": "FYI, I'm a lawyer in my 40s, not some kid, and basically ran out of anything on TV that I could stand, as it was all so formulaic and tired and low-brain. Well, I noticed some anime seemed focused on adults (not the sex stuff, but violence and intelligent plots and stuff), so I tried own -- Sword Art Online. It really opened my eyes to these hidden treasures -- the stories blend fantasy elements with action and interesting characters. Really the main thing I noticed was being surprised by plot twists. Whereas an American TV series or movie you can pretty much guess where it's going to go, this took turns and twists that really impressed me with the intelligence of the show. I mean, Lost took a lot of twists, but they were sort of random/contrived, and my final analysis was the writers were just making it up as they went along to avoid answering any hard questions, very stupid and contrived. Sword Art avoided that.Anyway, after finishing that anime, I tried several more, and while some were good and still better than traditional American shows, none had the intelligent plotting of Sword Art Online -- till I found Hunter X Hunter, which just totally kicked it up a notch in both fantasy elements, interesting characters, intelligent plot twists you won't see coming, and the like. With some bad guys being sort of serial murderer/pedophiles, it's not for kids, but well done...even those pervy bad guys sometimes redeem themselves, at least for a short time.How the main characters got more powerful as the series progressed, to be able to best stronger and stronger foes (usually) was well thought out, too, and not overly simplistic. The only downside was that by the fifth (?) story arc involving mutant ant people, I felt it had gotten a bit formulaic and I was not buying into how the world was responding to this threat, and felt the series might have jumped the shark, so to speak. However, I stuck it out and halfway through the arc I really started to enjoy it and the plot kept taking interesting twists. I'm not ashamed to say that I cried at least once because there were such bittersweet moments created.I don't think I ever enjoyed a movie or TV series more than Hunter X Hunter, and with over 150 episodes, that's a LOT of great TV."
    },
    {
      "username": "g-luismiguel14",
      "userUrl": "https://www.imdb.com/user/ur32913553",
      "reviewLink": "https://www.imdb.com/review/rw2700448",
      "warningSpoilers": false,
      "date": "6 November 2012",
      "rate": "10",
      "helpful": "341 out of 379 found this helpful.",
      "title": "Beyond Shonen",
      "content": "If you are looking for the kind of Anime that will leave you sitting at the edge of your seat Hunter x Hunter (2011) is the right one for you.The story might seem a little childish at first but as soon as the plot develops the (very) dark nature of the story becomes obvious. The characters are unique and incredibly well developed, with the show not being afraid of testing them psychologically in a way that not many animes are willing to. The fights are intense both physically and psychologically and as the Anime progresses they tend to become more violent and over the edge.The soundtrack is beautiful. From the intense/epic classic orchestras to the guitar riffs, everything seems to fall into place. Even the show's \"intros\" and \"outros\" are very consistent and worth listening to.All in all, this is the kind of Anime that a true fan of this Japanese art will not want to miss."
    },
    {
      "username": "POIguy",
      "userUrl": "https://www.imdb.com/user/ur109685083",
      "reviewLink": "https://www.imdb.com/review/rw6877328",
      "warningSpoilers": false,
      "date": "3 May 2021",
      "rate": "10",
      "helpful": "31 out of 38 found this helpful.",
      "title": "I really liked it",
      "content": "Hunter x Hunter starts off a bit childish, but over the course of its 6 arcs it develops into an action packed story about friendship, brotherhood, the human condition, and loss. Without going into spoilers I can't say much, but this show gets pretty deep and has amazing fight scenes. There's many interesting characters to keep the plot moving."
    },
    {
      "username": "serbian_007",
      "userUrl": "https://www.imdb.com/user/ur30724381",
      "reviewLink": "https://www.imdb.com/review/rw3152805",
      "warningSpoilers": false,
      "date": "31 December 2014",
      "rate": "10",
      "helpful": "96 out of 125 found this helpful.",
      "title": "You MUST Watch This Anime Before you Die. Better than the Best. You are Missing Out.",
      "content": "If you haven't watched this anime, your life is INCOMPLETE. An epic out of this world adventure between three friends whose friendship never dies. I have never had more fun, never laughed more, and never felt more emotion than after watching Hunter x Hunter. Every anime series I have ever seen pales in comparison. Hunter x Hunter is better than Full Metal Alchemist Brotherhood, better than Death Note, better than Naruto, better than One Piece, better than Steins;Gate, better than Attack on Titan, better than Code Geass. My eyes have been opened after watching this series: Hunter x Hunter cannot be rivalled. If Full Metal Alchemist Brotherhood is a 10, Hunter x Hunter is a 15, no joke. Hunter x Hunter (2011) has better script, better characters, better acting, better scenery, better pacing, and better story than every anime I have listed above. It's a journey; it's an epic adventure; it's a coming of age; it's out of this world. It's a shame a lot of people don't know about it just because it doesn't have an English dub; it's a shame it only has a few thousand votes on IMDb. If only everyone knew what they were missing. I wish that I had seen the original series growing up; how different might my childhood have been; I grew up with Dragon Ball Z, Pokemon, and similar shows. My first time watching near the end of 2014, and Hunter x Hunter is now my favourite anime of all time, no question about it. The main characters of Hunter x Hunter (2011) will stick with me for the rest of my life. I have never laughed more than with Leorio. I have never cried more than with Killua and Gon who show the real value of friendship. The lessons I have learned from this show about friendship, love, and family have impacted me greatly.Thank you Hunter x Hunter. After binge watching every episode within one week because I couldn't stop myself at the bliss, I have been reborn. Best Anime of all time, without a doubt. I have nothing more to say, except that you MUST watch this anime before you die. YOU MUST. YOU MUST. YOU MUST."
    },
    {
      "username": "ahmedmedht",
      "userUrl": "https://www.imdb.com/user/ur95438795",
      "reviewLink": "https://www.imdb.com/review/rw8169088",
      "warningSpoilers": false,
      "date": "23 May 2022",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "How To Watch Hunter X Hunter In The Right Order",
      "content": "Hunter Exam arc (Episodes 1-26)Heavens Arena arc (Episodes 27-38)Phantom Troupe arc (Episodes 39-58)Hunter X Hunter: Phantom Rouge (Movie 1)Greed Island arc (Episodes 58-75)Hunter X Hunter: The Last Mission (Movie 2)Chimera Ant arc (Episodes 76-136)The Election arc (Episodes 136-148)The movies are standalone and can be watched after the end of the ANIME."
    },
    {
      "username": "randy-26556",
      "userUrl": "https://www.imdb.com/user/ur102732419",
      "reviewLink": "https://www.imdb.com/review/rw4840674",
      "warningSpoilers": false,
      "date": "10 May 2019",
      "rate": "10",
      "helpful": "27 out of 35 found this helpful.",
      "title": "Perfect anime",
      "content": "This anime has to to be one of the best of all time. Everything in the show is perfect, the fight scenes are amazing and epic. I hope there will be more anime that is good as Hunter x hunter and fun to watch like this. 👍👍👍👍👍👍👍👍👍👍👍👍👍"
    },
    {
      "username": "Alexandrspyr",
      "userUrl": "https://www.imdb.com/user/ur29817376",
      "reviewLink": "https://www.imdb.com/review/rw2883386",
      "warningSpoilers": false,
      "date": "8 October 2013",
      "rate": "10",
      "helpful": "97 out of 130 found this helpful.",
      "title": "This Is My Favorite Anime And I've Seen A Lot Of Them(one piece,naruto,bleach,fairy tail).",
      "content": "7.6?Why so underrated?This rating doesn't do justice to this show,it needs more recognition. Lets set it right. I have seen both versions of Hunter x Hunter and I liked the 1999 version better so there will be inevitably some slight comparisons in this review to the 2011 one.Story: Togashi Yoshihiro is a very talented mangaka who managed to create a world of great imagination where he can take you from dark realistic settings to a virtual reality cheerful world.The story progresses in arc format with each arc being connected nicely together, of course there is the main story where the protagonist a small boy named Gon embarks on a journey to search for his father a \"Hunter\" where lots of difficult challenges and adventures awaits him.Apart for the first few episodes the pace was really good and I never got bored but it still was 10 times better then the old version where the beginning was slow and kind of awful.In the first arc you get to know the world of HxH and it's protagonists, it may take for a while to draw you in so stick with it because it will get epic.What sets it apart of any other anime at least of this genre if not all anime it's the disruption of a linear plot progress.Plot twists in some episodes are just insane.At some points I literally was in shock and kept thinking about what happened for many days or weeks after the episode. You will never expect for some things to happen.I found the complexity and simplicity of the story in perfect equivalence, it's simple in it's general view but individual elements can be quite complex(eg. a system of a country, fighting system, analytical thinking of an antagonist etc). In short it was an intelligent story with perfect mix of mystery,tension,comedy and action. Don't make the mistake I did when I labeled it as childish when i had seen only 10 episodes, give it a try and you will discover a mature and deep story with the psychological factor being present all over the place. Story:9/10 (I would rate it a 10 but I can't because of the weak beginning). Art: Animation is amazing in this series, the best of the best.And as it progresses it gets even better especially in the fight scenes where the effects are awesome and enhance the experience.The bright colors is one of the major things that made me personally like 1999 version better, because dark colors used in the old one created a dark atmosphere which suited better for this anime(it felt more epic and created more tension). That doesn't mean I hate the new version though.The designs of each character are unique and suits their personalities quite well which as an effect makes them memorable (one antagonist became one of my favorite antagonist ever!!!). Art:10/10Sound: There was only one thing I hated about the sound and that was the opening song(I always skipped it), the end song though was quite enjoyable. As for the soundtracks I can say they were epic especially in moments of tension or mystery. I didn't quite like the happy go lucky background soundtrack but that was only at the beginning, I actually appreciated it more cause it made the moments of tension feel 10 times more epic!!! Voice actors are all good except for the one of Kurapica who's voice I didn't like but I may be influenced by the old version. The voices for the 2 main protagonists are especially well picked up.Although I prefer the 99 version sound and voices better I will stay objective and rate the sound a 9. Sound:9/10 Characters:Most of my favorite characters are from this show and as you can guess characters in this show are amazing, there is no one who is underdeveloped or one dimensional. Lots of hours have been spent in developing each of them making them unique and memorable in their own skin, some will be mysterious and threatening like no other you've seen,some others intelligent and patient another might be compassionate and vulnerable.What is truly amazing though as I mentioned before is the presence of the psychological factor. Which means that no one will act always the same in different situations just to follow their stereotype as the situation changes.What I mean is that your expectations for some characters being one thing will be diminished into being the complete opposite. That's why the plot twists are amazing and logically and emotionally feel correct. Characters:10/10Overall:Hunter x Hunter 2011 is the best anime than any other at this genre I've seen.It blends together and balances exceptionally well themes like drama, mystery, comedy and action.I enjoyed this series so much that I am actually thinking about rewatching the old version first and at some point the 2011 again. I hope you will give it a try because I honestly believe you will enjoy it very much.I recommend this series to everyone and it doesn't matter what genres you like more, just trust me and give this series a go but stick with it cause it's kinda slow at the beginning. Overall:10/10*This is my first review so forgive me for any mistakes*"
    },
    {
      "username": "YASEEN7",
      "userUrl": "https://www.imdb.com/user/ur113539551",
      "reviewLink": "https://www.imdb.com/review/rw7166430",
      "warningSpoilers": false,
      "date": "26 July 2021",
      "rate": "9",
      "helpful": "13 out of 15 found this helpful.",
      "title": "FREAKING LOVE THIS ANIME",
      "content": "HunterXHunter is definitely one of the best animes out there. Personally, its no 1 on my list. No matter how many animes I watch, nothing compares to HunterXHunter. The characters have been so beautifully written and mindfully built by Yoshihiro Togashi (Bless this man) that you can't help but trip and fall painfully in love with them.The main protagonists (Gon,Killua,Leorio and Kurapika) all have their own unique backgrounds and quirky personalities which is super fun to watch in itself but when you put them all in the same equation, their chemistry is just overwhelmingly adorable that it makes you wanna cry happy tears.Let's talk action! Being a shounen anime HunterXHunter has its own proud share of epic battles and power displays, it seriously gives you goosebumps.What about bad guys,you ask?I would like to say special attention has been given by Togashi to put some life and spice into the antagonists/anti-heros in the series. They aren't just powerful and mean,but have extremely intriguing personalities. They body slam you into loving them as well.All in all, HunterXHunter is a well balanced anime. There is friendship,fluff,fights and fan service. What else can a weeb ask for. .Highly recommended!!"
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6367880",
      "warningSpoilers": false,
      "date": "15 December 2020",
      "rate": "9",
      "helpful": "31 out of 44 found this helpful.",
      "title": "Hunter x Hunter",
      "content": "One of the best anime that I saw in the action and fighting scenes in the anime is great, especially in Chimera Ant arc. The fights were very great, the anime characters were excellent, especially Chrollo Lucilfer and Netero. They were the best two characters in the anime. I also liked that Gon does not win in most battles I hope the anime will continue, but the writer does not want to write"
    },
    {
      "username": "the-fearless-america",
      "userUrl": "https://www.imdb.com/user/ur56393956",
      "reviewLink": "https://www.imdb.com/review/rw7453158",
      "warningSpoilers": true,
      "date": "17 October 2021",
      "rate": "10",
      "helpful": "22 out of 29 found this helpful.",
      "title": "Hunter x hunter is my top 1 anime of all time",
      "content": "This remake from 1999 classic hxh also really good. It brings me nostalgic from my childhood but with better animation. Hxh 1999 series is a little bit horror and the characters also more darker, but two of the series is amazing.Since my childhood, this is the anime that set my standard of all anime after. The story, character development, plot twist and especially strategy of the fight scene, is wayyy on another level. I'm very impressed since then and i'm addicted to this series. Honestly, the author is on another level to create a storyline that day. Then, i read all the manga but sad to hear that the author always hiatus, even tough i think this manga and anime will be a massive follower magnet if it was normally continued.I think this is the best anime japan ever made, and this is in my top 1 best anime of all time. I hope the author get well soon because so many hxh fanatics waiting from their childhood until now, after pandemic era, or maybe until their age get old, just to wait this anime to continue. Plase continue this manga or continue just to make it finish the story at last. Don't let hxh fanatics gets old and die while waiting this masterpiece to continue."
    },
    {
      "username": "persa_97",
      "userUrl": "https://www.imdb.com/user/ur43399911",
      "reviewLink": "https://www.imdb.com/review/rw2797287",
      "warningSpoilers": false,
      "date": "14 May 2013",
      "rate": "10",
      "helpful": "97 out of 126 found this helpful.",
      "title": "An incredible work that now continues",
      "content": "This is a really fun and entertaining Anime that's all about one kid called Gon who is looking for his dad and the paths his dad laid out for him are truly incredible.He gets stronger at such a strong rate but the series always shows that there are way stronger opponents so he always has someone to fight in the way that his father laid out.This series shows a lot of fighting to get stronger but it also show that some people are meant to do incredible things. It's also a series that make you laugh really easily with all kinds of spontaneous and stupid humor that i love.The old one was as great, the only differences are that in this one Killua looks even younger and the last one ended at one moment where something happened that could have ended the series but in this one they continue from that moment.Watch this series, I beg you, and you won't ever regret it!"
    },
    {
      "username": "bmayank-98491",
      "userUrl": "https://www.imdb.com/user/ur105856169",
      "reviewLink": "https://www.imdb.com/review/rw7622440",
      "warningSpoilers": false,
      "date": "6 December 2021",
      "rate": "10",
      "helpful": "15 out of 20 found this helpful.",
      "title": "Wow what a journey !!!!!!",
      "content": "Honestly this was a great show. One of the best anime's I've ever seen. I loved all the characters and the story was very enticing, it made me want to keep watching to see what would happen next. My favorite characters were Gon, Killua, hisoka and the insect king. The story with the insect king was so sad, it made me want to cry towards the end of the story. This is one of those shows you have to watch!I said what I said. Wish there were more episodes. Loved every second of it.I recommend everyone to watch!!!!!!!!!True 'MASTERPRICE'"
    },
    {
      "username": "abhi07",
      "userUrl": "https://www.imdb.com/user/ur26897187",
      "reviewLink": "https://www.imdb.com/review/rw2978680",
      "warningSpoilers": true,
      "date": "13 March 2014",
      "rate": "10",
      "helpful": "57 out of 79 found this helpful.",
      "title": "a breathtaking experience a true piece of art.......",
      "content": "I want to share a lot about Hunter x Hunter i want to go on and on but i am not a professional reviewer or writer but i will try my best.I agree with others who reviewed Hunter X Hunter , that it has a childish like beginning . When i start watching it i did not plan to watch it further because of the above reason but i give Hunter X Hunter a chance and watched few episode and i was amazed by the story and the characters it got me hooked really.I am a anime lover and watched almost every famous title out there for example: One piece, Naruto, Bleach and much more. The story of Hunter X Hunter is about a twelve year old boy named Gon Freecss who has been told that his parent were killed in car accident but in reality they are alive and later he found out about his father by his father's old acquaintance that his father is alive and he is famous hunter. The show has many incredible fight sequence, The characters in the anime are super, since they all have their own ability and unique appearance. You will sit at the edge of your seat when the fights commence, and as the episodes progress our heroes face new difficulties, while still keeping the crazy humor,The genre itself is a ACTION,THRILLER & this has everything someone who enjoys anime series could ever ask for. I recommend this series to everyone and it doesn't matter what genres you like more, just trust me and give this series a go but stick with it cause it's kinda slow at the beginning. Overall:10/10Meaning of Hunter in series as below The Hunters Association is responsible for the testing and licensing of \"Hunters\" a person that has proved themselves through rigorous examination to be an elite member of humanity. With the passing of the examination, a Hunter is rewarded with a license to go almost anywhere in the world or do almost anything. Typically, Hunters devote themselves to tracking down priceless items, mystical places, and the unseen wonders of the world."
    },
    {
      "username": "Adele666",
      "userUrl": "https://www.imdb.com/user/ur104081577",
      "reviewLink": "https://www.imdb.com/review/rw5755966",
      "warningSpoilers": true,
      "date": "20 May 2020",
      "rate": "9",
      "helpful": "15 out of 21 found this helpful.",
      "title": "X Hunter X Hunter X is X Great X",
      "content": "Hunter X Hunter is about a 12 Year Old called Gon who wants to become his father, who had left him to become a Hunter.It is based on the manga made by Yoshihiro Togashi and is animated by Madhouse.Hunter X Hunter is a great anime. It has very good dialogue and the dialogue rarely gets boring. The fight scenes are very excellent too. The vast world that they live in is great and I love it. The animation is awesome.Main Characters:Gon : he is the protagonist. He is very likeable and his character development is good. He is constantly getting stronger and he is helping all his friends get stronger as well.Killua : He is Gon's best friend. He is very laid back and calm. He has a problematic family, whom he disagrees with a lot.Kurapika : He is a quiet person and he is hellbent on defeating the Phantom Troupe. He is missing during some of the arcs.Leorio ; He is the comic relief. He is very funny and has a big heart.Hunter X Hunter has a lot of other good characters. The villains in Hunter X Hunter are more complex than in other anime. They have good motives and their motives can change. Gon's and the main characters acquaintances help move the plot forward but they don't get as much character development, as the villains. They are really good characters that can relate to the main characters.Ranking the Arcs:1. Chimera Ant: The was a lot of great enemies and there was the most danger in this arc. Meruem was amazing in this arc and all the royal guards. They made this arc a lot better. That is why it is my favourite.2. Yorknew City: This arc is focused around Kurapika and The Phantom Troupe. The Phantom Troupe do some great escapades.3. Hunter Exam: It introduces the characters very well. The tasks the people doing the Hunter exams are interesting.4. Greed Island: It is very fun. It has weak antagonists and it has a lot of training in it.5. Zoldyck Family : We learn more about Killua's family and how strong they are.6. Heavens Arena: It has some boring antagonists and is mostly Gon and Killua learning about Nen. Some of the battles are good.7. 13th Hunter Chairman Election : It is boring and the best part was when Leorio punched Gon's father. I watched the Sub and the voice acting was good."
    },
    {
      "username": "evilsweetpotato",
      "userUrl": "https://www.imdb.com/user/ur24050161",
      "reviewLink": "https://www.imdb.com/review/rw2630052",
      "warningSpoilers": false,
      "date": "19 June 2012",
      "rate": "10",
      "helpful": "175 out of 206 found this helpful.",
      "title": "Amazing work",
      "content": "Hunter X Hunter 2011 is an amazing work.I have read the Manga and watched the anime (1999), and it is certified to the origin.The animation is at the highest quality there is, giving the opportunity to truly enjoy this series. In HD-widescreen, you can really feel the action and connect to the story and the characters.I am following the new release weekly, and every new episode I am astonished by the high quality of the sound, picture and story which are exactly how they should be.Hunter X Hunter story is rich, interesting and authentic, and the writers of this new series did a great job transferring and transmitting it.Another great feature in the new series is the background adjustment to our time - Phones, computers and more electronic devices that were rare and undeveloped in the Manga can now be found and used anywhere, without damaging the story. I believe it even adds to the experience.This is a must-see show, to any fan of this genre (Especially to whom had seen and/or read Hunter X Hunter), though I would really recommend this series to anyone."
    },
    {
      "username": "harissiddiqui00",
      "userUrl": "https://www.imdb.com/user/ur37675716",
      "reviewLink": "https://www.imdb.com/review/rw2703138",
      "warningSpoilers": false,
      "date": "11 November 2012",
      "rate": "10",
      "helpful": "167 out of 201 found this helpful.",
      "title": "Epic!!!!!",
      "content": "this is everything someone who enjoys animes could ever ask for. let me explain: epic battles that aren't stretched for 5 episodes. the story plot is so twisted but yet there are no flaws or loop holes. the explanations make sense and are fun to listen to. there is a balance between the intense gory moments and the light hearted jokish moments. the characters are liakable, even the villains. its just the perfect anime. and don't listen to those people who say that this version is rubbish compared to the 1999 version. its ten times better. the show might start of a little childish but its picks up the pace in no time. i recommend this to anyone i meet...literally. its just that damn good"
    },
    {
      "username": "A_Llama_Drama",
      "userUrl": "https://www.imdb.com/user/ur5190526",
      "reviewLink": "https://www.imdb.com/review/rw3147295",
      "warningSpoilers": true,
      "date": "24 December 2014",
      "rate": "10",
      "helpful": "18 out of 29 found this helpful.",
      "title": "A great series, more than your average cartoon",
      "content": "First off, a disclosure. I am no anime expert. My interest in anime is fairly new and it's very superficial so perhaps I am not the best person to review this title. However, having watched all available episodes on Netflix and then begging friends for the final 48 episodes I feel moved to give my opinions as to why I will quite likely re-watch it, and recommend it unequivocally.Hunter begins simply by introducing you to it's main protagonist and his companions as they undergo a tough series of challenges to gain their Hunter license. In the World of Hunter x Hunter, bizarre creatures exist and, apparently so just magic. Gon Freecss is a 12 year old boy who has grown up around nature. Having learned that his father is not at all dead and had abandoned him to live a life as a Hunter, Gon sets out to learn why his dad cares more about his job by becoming a Hunter himself. In the process of finding this out, he also hopes to gain the skills and intel necessary to find his dad, Ging.Essentially, what separates this show from other cartoons is the narrative and incredible use of characters and histories. It is a fully realised World and the characters are all flesh and blood and believable. Although it starts slow and Gon may be a hard character to get behind (seemingly never being bested by anyone and terminally optimistic), the show eventually shows its teeth and begins chomping at the naivety of its young cast. Themes of bad overcoming good, child exploitation, drug cartels and the socio-economic effects of nations run by weapons and drugs and dictatorships (with some thinly veiled attacks on North Korea and the USA's dropping of atomic bombs on Japan thrown into the mix), not to mention hinted at themes of paedophilia and statutory rape, the show gradually reveals an ugly side of the World to young Gon and Killua. The show is also never short on gore with some truly disturbing moments (the aftermath of a character's torture in the 4th arc, the Bomber's Little Flower ability in the 5th arc and a lot of the penultimate arc are quite horrific).Gon and Killua eventually make for a great couple of companions in which to visit this World. Gon, naive and simple, and Killua who is much too wise beyond his years offer contrasting views on the good and bad within other humans. Their friendship strengthens believably throughout the series and the underlying homosexual tones are sweet and never overblown or gratuitous. As Gon becomes more spiteful towards the World (or aware of the fact that being nice won't always win out), Killua seeks to become kinder and connected to other people. As the series draws to a close, both of them are much stronger and mature with Killua capable of companionship and Gon capable of making hard decisions.The other stand out characters are Kurapika and Hisoka. Kurapika, whilst being in probably less episodes than any of the other main cast is given an entire arc when he comes face to face with those who murdered his family, \"The Phantom Troupe.\" Consisting of some of the most strongest, deadliest thieves and villains in this World, Kurapika is forced close to heartlessness and devastation to bring about his revenge. What's fascinating about Kurapika is his yin and yang - for the most part he is by far the most stable and sensible of the cast and yet there are flashes of the rage and blind fury that propels him. In the arc we see him become so committed to his cause that he is confronted with the choice to sacrifice Gon in order to win or be satisfied with waiting til another opportunity presents itself. Hisoka, on the other hand, is chaos incarnate. He lives for no one but himself. This makes him a great ally but also, for majority of the show, a constant pain in the foot for Gon and every other human alive. He has no qualms about killing people and although he is sexually attracted to Gon and Killua, if the situation called for it, he'd kill them.The animation, especially within the fights, is outstanding. As the show's more complex details are brought to light (the case of magic or aura), the animation in fights becomes even more breathtaking. The climactic fight between Kurapika and a member of the Phantom Troupe is insane. The use of colour and sound help push the fight into territory I've never seen before in standard cartoons or even live action. Other stand out moments include Gyro's tale, the fight between Gon and Hisoka and whenever Killua uses his Godspeed.The other beautiful aspect of the show is the music. Expertly used and heightening many moments, it changes the show from just a cartoon to a serious and deserving series. The songs that are used to close the episodes are thought out and a lot of important moments are amplified (the death of Ponzu has a seriously creepy riff playing underneath before the moment and then after, most of the Phantom Troupe's maniacal damage is even scarier due to the choral music and Killua finding Gon inches from death's door in the final moments of the Chimera Ant arc is made even more heartbreaking by the lamento for piano).All in all, I'd recommend Hunter X Hunter to anyone who enjoys action and drama. It contains all the right ingredients to be compelling viewing, subverting expectations and shocking at times whilst being tender and honest at others. Not to mention some incredibly directed and animated fighting. And, let's be honest, it's what you're watching for, isn't it?"
    },
    {
      "username": "AtypicalAdventurer",
      "userUrl": "https://www.imdb.com/user/ur54526161",
      "reviewLink": "https://www.imdb.com/review/rw3315998",
      "warningSpoilers": false,
      "date": "13 September 2015",
      "rate": "10",
      "helpful": "30 out of 48 found this helpful.",
      "title": "This is the best anime I have ever seen.",
      "content": "I do not think I will ever find an anime that is better than this one. EVERYTHING about it is perfect. The story, the fantasy, the themes, the feelings, the soundtrack, the characters... Oh, the characters. I swear- - The two main characters? I care about them more than half the people I know in real life. I've watched quite a lot of anime, and a lot of them had a few qualities about them that were outstanding. One Piece has a great sense of adventure, Cowboy Bebop has an incredible moving story to tell, Death Note had a great perspective on morals... Hunter x Hunter HAS IT ALL!!Do yourself a favor. Watch this anime. But don't go complaining to me once you finish it and realize that everything else pales in comparison."
    },
    {
      "username": "Leshom",
      "userUrl": "https://www.imdb.com/user/ur46915061",
      "reviewLink": "https://www.imdb.com/review/rw2939945",
      "warningSpoilers": false,
      "date": "12 January 2014",
      "rate": "10",
      "helpful": "179 out of 221 found this helpful.",
      "title": "so underrated in my opinion",
      "content": "oh my god this anime is a whole new thing , it is better than one piece naruto and all the long animes , but i gotta admit it starts slow and it kinda feel childish but once you keep going the story takes another level of epicness , in my opinion this anime is ONE OF THE BEST !!! , if you did not watch it yet , go DAMN WATCH IT RIGHT NOW !!! , just to sum up everything , Hunter X Hunter 2011 = Epic and yet i can't believe that this anime is so underrated and only some people are watching it, people are watching one piece and other popular animes and not watching Hunter X Hunter 2011 HUH, thats really sad =(P.S: when i watched this anime in the beginning i thought it is childish but DAMN just give it your shot !"
    },
    {
      "username": "Monarch_1",
      "userUrl": "https://www.imdb.com/user/ur87801081",
      "reviewLink": "https://www.imdb.com/review/rw7258786",
      "warningSpoilers": false,
      "date": "22 August 2021",
      "rate": "6",
      "helpful": "30 out of 49 found this helpful.",
      "title": "Yes, I hated the Chimera ant arc",
      "content": "I get it why it is top rated anime. It draws real life parallels to Nuclear weapons, human greed, global warming and many others. But the thing is the audience watch a series is to get entertained. If the series is thought provoking and talks about real life issues in addition to be entertaining, it does make them memorable. But such things shouldn't come at the cost of entertainment and storytelling. This is the exact problem, the chimera ant arc is suffering from. It talks big whilst being utterly boring. Since the chimera ant arc makes up for almost half of the anime series, it becomes a con for the series too.My other problems with the arc are1. Total deviation from established motives and followups to the goals of the protagonists.2. The creator shows a big middle finger if you cared about protagonists. He leaves out 2 protagonists like they don't exist and makes other two protagonists as side characters in their own series.3. Too much focus on secondary and rudimentary characters.4. The ants' designs are ridiculous and silly. I mean these supposedly ants are humanoid animals born with helmet, tees, ear piercings and what not.5. The complete devolution of a protagonist due to the loss of a character whom he had known for like few weeks is unbelievable.6. I have few words for the narrator, \" Jeez, just calm down\".This arc killed this series for me when I was binge watching the series up until this arc. The phantom troupe arc was the highest point of the series imo from which it never truly recovers. Hey, atleast the chairman election arc ends the series in a decent note."
    },
    {
      "username": "BadgerStorm4345",
      "userUrl": "https://www.imdb.com/user/ur113370202",
      "reviewLink": "https://www.imdb.com/review/rw6108838",
      "warningSpoilers": false,
      "date": "19 September 2020",
      "rate": "8",
      "helpful": "15 out of 25 found this helpful.",
      "title": "The King of Shonen Anime",
      "content": "Hunter x Hunter is the best Shonen anime of all time. Although one other anime that is considered Shonen may be better in my opinion, its not strictly classified as Shonen. Hunter x Hunter has some of the best characters in anime. Meruem, Killua, Kurapika, Hisoka, Chrollo, Neferpitou, Gon and Netero are all incredibly well written characters. The philosophy of this show, which I won't spoil, is some of the best in anime. With amazing fights that are never too common, the show makes pay offs feel earned and satisfying. The tone of the show can shift drastically depending on the arc, with the Yorknew City and Chimera Ant Arcs being incredibly dark but also the two best arcs of the show. The Music and voice acting is incredible and amplified emotion way past most other anime. Hunter x Hunter is my second favorite anime of all time and easily is a Masterpiece."
    },
    {
      "username": "darklydreamingrahu",
      "userUrl": "https://www.imdb.com/user/ur22836025",
      "reviewLink": "https://www.imdb.com/review/rw6394154",
      "warningSpoilers": false,
      "date": "24 December 2020",
      "rate": "10",
      "helpful": "15 out of 24 found this helpful.",
      "title": "Earns its spot on IMDB's top 50",
      "content": "Hunter x Hunter is a classic show.Like Avatar and Death Note, Hunter x Hunter ascends beyond the traditional limitations of animation and cements itself as a legendary tv show in the process.Though it is more \"anime\" than the previously mentioned shows, Hunter x Hunter succeeds in presenting an engaging and thrilling story with world class character building.The fact that the creators managed to achieve the level of verisimilitude that they have with the show's admittedly outlandish setting defies logic.It's a wonderful mash up of fantasy and science fiction.Do yourself a favor and watch this classic tv show.9.8/10."
    }
  ],
  "errorMessage": ""
}