{
  "imDbId": "tt1299368",
  "title": "Southland",
  "fullTitle": "Southland (TV Series 2009–2013)",
  "type": "TVSeries",
  "year": "2009",
  "items": [
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw6465179",
      "warningSpoilers": false,
      "date": "11 January 2021",
      "rate": "9",
      "helpful": "46 out of 48 found this helpful.",
      "title": "Ridiculously Underrated!",
      "content": "Southland is absolutely one of the best cop dramas to ever be made! There are thousands of cop shows out there to choose from but this is among the best and most original I've ever seen. The cast is excellent and make it a very believable show. It really is one of the more underrated shows in television history!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8576330",
      "warningSpoilers": false,
      "date": "29 September 2022",
      "rate": "9",
      "helpful": "28 out of 29 found this helpful.",
      "title": "One of the best cop dramas ever!",
      "content": "Southland is one of the best and most underrated police series to ever be put on television! Everyone knows that there are thousands of cop shows out there to choose from but this is among the best and most original I've ever seen. It's a surprisingly fresh take on the cop show genre. Every episode is compelling and will hold your interest. Just read through the reviews to see what people really think of it. The cast is excellent and make it a very believable show. It's just such a gritty and realistic show about cops. It's a shame that it ended when it did because it should of went on for a few more seasons. With all the crap shows they revive these days I'd love to see them bring this show back."
    },
    {
      "username": "douglasmcbroom",
      "userUrl": "https://www.imdb.com/user/ur127033612",
      "reviewLink": "https://www.imdb.com/review/rw7396131",
      "warningSpoilers": false,
      "date": "1 October 2021",
      "rate": "9",
      "helpful": "16 out of 17 found this helpful.",
      "title": "Look sharp. Act sharp. Be sharp.",
      "content": "I think Southland deserves to be considered amongst the great series: The Sopranos, The Wire, Breaking Bad, Deadwood, Better Call Saul, Rome, Dexter, Oz, Lilyhammer, Boardwalk Empire, Game of Thrones, Ray Donovan and Peaky Blinders. It is also, arguably, the most underrated. It should never have been on NBC, which NBC realized, and then it went to cable at TNT. It flourished creatively, in its 4 seasons there, but never found it's audience. If this show had been on HBO, I think more people would have found it and sung its praises. Even Emmy didn't see what an incredible cast the show had and what brilliant writing it employed. Also, unlike so many long-running series, it's final Season 5 was its best. It was not supposed to be its final Season, TNT decided to cancel it, which only goes to show the unfulfilled promise that lay ahead.There was not a single bad performance with any cast regulars, but Michael Cudlitz and Regina King stand out, closely followed by Shawn Hattoy and Ben McKenzie. C. Thomas Howell blows it out of the water in a supporting role and Lucy Liu and Gerald McRaney nail it in guest spots. The scenes with Cudlitz and McRaney, S5 E7, Heroes, is the stuff that should be taught in acting classes and should have garnered both Emmy nominations.Best Season: 5 Best Episodes: Season 5, E7, 8, 9 and 10."
    },
    {
      "username": "fleck05IMDB",
      "userUrl": "https://www.imdb.com/user/ur36590018",
      "reviewLink": "https://www.imdb.com/review/rw6374640",
      "warningSpoilers": false,
      "date": "17 December 2020",
      "rate": "10",
      "helpful": "21 out of 23 found this helpful.",
      "title": "Wish It Would Have Had A Few More Years",
      "content": "Obviously a tv show will have some dramatic elements, but overall this was one of the most accurate cop shows made at that time. I have retired and I suspect the job isn't as enjoyable as it was in the 80's through early 2000's, but the creators got this show right. The themes, the attitudes, personalities and overall feeling of the job are very well done. Southland and Bosch do a great job of getting the details right when it comes to police stories."
    },
    {
      "username": "mattcording",
      "userUrl": "https://www.imdb.com/user/ur83628394",
      "reviewLink": "https://www.imdb.com/review/rw8587883",
      "warningSpoilers": false,
      "date": "4 October 2022",
      "rate": "10",
      "helpful": "17 out of 18 found this helpful.",
      "title": "Excellent cop series",
      "content": "A fantastic series, great scripts good acting and excellent casting, one of those series you wish you could have gone on for many more years and there's rarely other series to take its place. Storylines were always excellent characters, very human sub plots, and not always ending the way you might think. Some very funny in jokes an it has to be said sometimes characters that will drive you mad, but always entertaining. If anything it should have possibly have been more adult in its content, several times things were blurred out of vision, if we are adult enough to watch such a program we should be able to choose for ourselves if it's too much. This only happens rarely but I found it to be a tad annoying."
    },
    {
      "username": "rich-fouts",
      "userUrl": "https://www.imdb.com/user/ur51907450",
      "reviewLink": "https://www.imdb.com/review/rw7891324",
      "warningSpoilers": false,
      "date": "23 February 2022",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Well-crafted police drama",
      "content": "Superb casting, competent acting, excellent direction. A cut above the rest. Gritty and real. Great shooting around the Los Angeles area and good writing make this one of those addictive shows that I like to watch and ponder."
    },
    {
      "username": "ipmqfpj",
      "userUrl": "https://www.imdb.com/user/ur126256345",
      "reviewLink": "https://www.imdb.com/review/rw8031457",
      "warningSpoilers": true,
      "date": "3 April 2022",
      "rate": "10",
      "helpful": "17 out of 18 found this helpful.",
      "title": "Late to the party",
      "content": "This show is amazing and I don't why this show isn't still on tv. What a gem of a show seriously. One minute I'll cry in the next minute shark the next minute it's so intense that I just stop doing everything breathing even 2022 in the show came out in 2009 and it's amazing and Regina King is a straight up savage she's a rockstar and she's fantastic actress in this and every other thing she's ever been on she's royalty and she is above and beyond a great actress. Use a special talent that Regina King."
    },
    {
      "username": "lucasarts-88947",
      "userUrl": "https://www.imdb.com/user/ur70208476",
      "reviewLink": "https://www.imdb.com/review/rw8644682",
      "warningSpoilers": false,
      "date": "30 October 2022",
      "rate": "9",
      "helpful": "15 out of 16 found this helpful.",
      "title": "Brilliant gritty drama",
      "content": "I wasn't sure if I wanted to watch another drama about police in LA after catching up with the Rookie but I like Ben McKenzie so I gave it a watch. This is so much more gritty and feels more real life with the bleeps. I like the fact you follow lots of different characters across the show and some storyline cross over episodes. It shows the struggles of the individual characters with life on and off the jobs as well as the supporting characters. It is definitely with a watch and you won't be disappointed. It's just ashame there wasn't more episodes in a series and/or more seriez to watch. Brilliant."
    },
    {
      "username": "nufc_geordie",
      "userUrl": "https://www.imdb.com/user/ur134560925",
      "reviewLink": "https://www.imdb.com/review/rw8636081",
      "warningSpoilers": false,
      "date": "25 October 2022",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Characters!",
      "content": "I came across this by accident. I was at a friends house and saw Lucy Liu in LAPD uniform with the obligatory mirrored sunglasses on TV and I had to know what show it was.I watched season 1 and wasn't too impressed, but then the character development kicked in and I was hooked. This is a show about the LAPD but more than that its a journey with these characters and its a hell of a journey.Regina King and Michael Cudlitz are brilliant but the whole cast is outstanding. The dialog and storytelling are so cleverly done, it doesn't spoon feed you like some cop shows. At the end of season 5 I just wanted more.... so I watched it all again. Excellent!"
    },
    {
      "username": "Mr-Fusion",
      "userUrl": "https://www.imdb.com/user/ur1994077",
      "reviewLink": "https://www.imdb.com/review/rw2816838",
      "warningSpoilers": true,
      "date": "20 June 2013",
      "rate": "10",
      "helpful": "10 out of 12 found this helpful.",
      "title": "Head and shoulders above the rest",
      "content": "Only time will tell how high the replay value is for this show, but watching from start to finish (though I don't recommend binge watching) proved an exhilarating and emotional stretch of series watching to rival the very best. It takes a lot to roll credits and leave me wanting more. \"Southland\" did that consistently (like a ravenous wolf I consumed this series). The documentary camera work, while adding a \"really there\" authenticity, also offered inventive angles and really ratcheted the tension at every turn. I couldn't get into \"The Shield\" partly because of the shaky-cam, but it really is well-done here. And \"Southland\" was almost always on-location (not to mention the wide array of inside-the- patrol-car shots), so the feeling of really being there was genuine. No wonder this show was so expensive. But it was the writing that kept me coming back for more. Events occur naturally on this show; even the rare use of the stock \"toxicology report confirms ...\" trope to keep the narrative going didn't feel forced (it's a contrivance on a great many cop shows). And these were characters I genuinely gave a damn about; there mistakes, weaknesses and the struggle to maintain humanity at the end of the day. Which was certainly helped by the stellar ensemble cast. Everyone here is terrific, particularly Regina King and Michael Cudlitz; episode after episode, these two deliver performances that get under your skin, and they are nothing short of captivating to watch. Cudlitz made Officer John Cooper one of the great characters of the genre - equal parts frustrating and fascinating. Give that man an Emmy. The cancellation of \"Southland\" is truly heartbreaking, as the season ended with all sorts of insanity coming to a head (and a bitter cliffhanger with no closure). But what we've gotten is some seriously riveting, impressive and haunting television, the likes of which I don't think I'll see again in the near future. Just an unbelievably high-quality show. Outstanding. 10/10"
    },
    {
      "username": "vertigo-afterglow",
      "userUrl": "https://www.imdb.com/user/ur17472864",
      "reviewLink": "https://www.imdb.com/review/rw2053797",
      "warningSpoilers": false,
      "date": "17 April 2009",
      "rate": "9",
      "helpful": "87 out of 98 found this helpful.",
      "title": "Top-Notch",
      "content": "I've been on IMDb for quite sometime now, but have yet to feel compelled to write a comment. I suppose my biggest concern is that one of my favorite shows (i.e. Freaks & Geeks, The Class, Undeclared, etc.) will again meet its' demise if not for full and utter fan support.Right out of the gate, this show grabs you with not necessarily likable characters, but real characters. It makes no excuses for the way people act or the situations life inevitably holds for us on a daily basis. It is not over-dramatized, watered-down or needlessly careful. It's appeal is rather than being presented as a miniseries, it is shot more in the tradition of a motion picture or cable series (not unlike The Wire -- best show EVER) where measures are taken after the shoot to make it prime time friendly without being corny or sappy.Though it's too early in the game to give this a 10, I can say that if you haven't checked this out yet, do yourself a favor -- you won't be disappointed."
    },
    {
      "username": "dnolan714",
      "userUrl": "https://www.imdb.com/user/ur49972601",
      "reviewLink": "https://www.imdb.com/review/rw8446307",
      "warningSpoilers": false,
      "date": "14 August 2022",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "The Most Realistic Cop Show !",
      "content": "I'm a retired cop of 30 years of service. Southland is the most realistic cop show I've ever seen. Some NBC executives opined that the show was too dark for prime time. Maybe so, it's not for kids or folks that cringe at what's really going on in the streets. Although the show was cancelled in 2013 can you imagine the format with todays life out there ? I'd like to see other great networks pick up the show and carry on with a revised series. I'd like to see the original actors because they were an awesome ensemble of professionals. Michael Cudlitz, Ben McKensie, Shawn Hatosy and the awesome Regina King, C. Thomas Howell, etc. These are top notch actors and the story writers were excellent. Whoever the technical advisors were, they trained the actors very well and it showed in their actions. I noticed some probably retired LAPD guys in cameo roles. Again, it's a rough life out on the streets and if people want to really see the truth, this is the show. So come on IMDB, LETS GIVE IT ANOTHER SHOT !"
    },
    {
      "username": "ryan-hedrick",
      "userUrl": "https://www.imdb.com/user/ur21220229",
      "reviewLink": "https://www.imdb.com/review/rw2073753",
      "warningSpoilers": false,
      "date": "30 May 2009",
      "rate": "9",
      "helpful": "84 out of 94 found this helpful.",
      "title": "Simply the most accurate depiction of policing in television",
      "content": "To start I have to say that the pilot episode was amazing and the show only got better until the season finale.I have been policing for some time now and have yet to find a show that depicts policing as accurate as Southland. Sure there are some scenes in this series that are a bit over dramatized, as in any show; however, the attitudes, behaviours and problems officers face are very real.Many of the messages Cst. COOPER says to his \"rookie\" Cst. SHERMAN are very valid in policing today and are often utilized. SHERMAN's responses to things that he has to see and experience are spot on.The fact that many of the terms used in Southland are not sugar coated, as in other TV series, blows my mind and is what keeps me watching. I see far too much in other series where the characters actually seem awkward as their language doesn't reflect what their behaviour is showing or the producers want to appease the censors and use softer language.Having two separate views of cases may distract some people, but this is exactly what it is like in reality. There are detectives in the same division as the front line officers and although they may work together on some incidents, often go about their day on different paths.The finale is and what will make me a dedicated viewer because of how close it hits to home. As an officer you tend not to try and get involved in your neighbours business, this is a reality in today's world where anything can happen if you choose to do so.All in all amazing acting, real characters, real settings and scenarios. I recommended this show to all my co-workers and anyone else interested in television shows depicting policing as it really is.9/10 (Only reason I didn't give a 10 is because I don't believe anything is ever perfect)."
    },
    {
      "username": "darktower67",
      "userUrl": "https://www.imdb.com/user/ur2973560",
      "reviewLink": "https://www.imdb.com/review/rw2071877",
      "warningSpoilers": false,
      "date": "26 May 2009",
      "rate": "8",
      "helpful": "131 out of 147 found this helpful.",
      "title": "This has been a long time coming....",
      "content": "Over the past twenty years we have seen an absolute invasion of cop shows and crime dramas on the small screen. Some have been highly acclaimed, like \"NYPD Blue\", and others have been long running, like \"Law and Order\". But all those shows developed notoriety based on strong characters and overly developed drama, a combination that seemed to be a necessary formula for prime time. The end result was entertainment at the cost of realism and integrity, as show plots became as convoluted as the characters. Think \"The Shield\", except that show had a very narrow focus. Now there's \"Southland\", and after the first few episodes it becomes immediately apparent that it is a show that will not be well received because it is vastly different than what has appeared before. Simply put, it will not live up to mass market expectations of what should constitute a crime drama. This is unfortunate. \"Southland\" offers a different perspective. It is simplistic without sacrificing depth, an effect achieved by cutting out unnecessary interactions and plot developments. The scope of coverage is revolutionary as well, with the portrayal of several different divisions--patrol, homicide, organized crime. The characters are developed and highlighted by both their strengths and flaws, making their statements through the performance of their duty without becoming preachy or pathetic. They are not all perfect and selfless, but instead are presented as basically moral and slightly jaded. It is not a testament as a whole of the LAPD, therefore it does not require the presentation of issues that are unnecessary to the purpose of the show--racism, sexism, corruption. The continuity is beneficial, and unusual enough to be revolutionary. The acting is solid. The greatest surprise is Regina King, who appears as a socially struggling homicide detective, a drastic change from the often overbearing or domineering African-American female roles she has been stuck in. Her portrayal of a heartfelt but complex detective is spot on. C. Thomas Howell delivers an absurdly believable rendition of an alcoholic, barrel-driven patrolman. Michael Cudlitz and Ben McKenzie are the most intriguing, as they are the rookie/veteran partnership who have common integrity and incredibly different backgrounds, yet manage to work together without the clichéd buddy-buddy relationship. And the subject matter? Raw, gritty, realistic, without fanciful or violent action scenes. From the mundane, to the absurd, to the disturbing. The difficulties of police work are highlighted, and obstacles are not always overcome. It has been many years since a television show has delivered a straightforward, pulse-pounding episode, as evidenced by number seven, \"Derailed\". If you dislike crime dramas or cop shows, you obviously won't like Southland. For the rest, it will probably be a toss-up. Stop looking at what the show doesn't present, and focus instead on what it does offer, and you will discover how exceptional it is."
    },
    {
      "username": "deloudelouvain",
      "userUrl": "https://www.imdb.com/user/ur58525162",
      "reviewLink": "https://www.imdb.com/review/rw3184761",
      "warningSpoilers": false,
      "date": "16 February 2015",
      "rate": "9",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Love it!",
      "content": "We get so many cop shows these days that it becomes difficult to watch them all and so you will have to pick one out of the lot. Well to me Southland is by far the best cop series of them all. It feels all so real to me, every story grips you. It's like you are cruising through the streets of Los Angeles yourself trying to catch the bad guys. The characters are all top notch in this show. Cooper, Bryant, Adams and Sherman all have their own different personality that gives this show the necessary boost. I watched the complete five seasons of this series in less then two weeks. That's how good I thought it was. Too bad it's all over."
    },
    {
      "username": "he88",
      "userUrl": "https://www.imdb.com/user/ur3892110",
      "reviewLink": "https://www.imdb.com/review/rw7502596",
      "warningSpoilers": true,
      "date": "2 November 2021",
      "rate": "9",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Not Just Another Cop Show",
      "content": "I've watched all five seasons over a couple weeks at maybe four episodes a night. I really like this show because it really makes the primary players seem like they're 3D instead of just one sided. After a while you almost think you know them because they've done such a good job showing them dealing with life both on and off the job. The difference with how this show handles things is they never become a soap opera. Most other shows do.What I didn't like was the camera work. Trying to give it that \"Cops\" feel like a camera crew is following them often just made for bad shaky camera work. That and the way they didn't keep story lines in line. Like how Lidia dated a guy and he dumped her after they hooked up just once I think. Then she went through a couple of deceive partners, hooked up with a cop who she discovered was her female partners son. That and she ended ended up with another new partner. All this must have been a year or two since she hooked up with the first guy. Suddenly he's a family man who is the father her child too. It just didnt make sense.Otherwise it's a really good series. It's too bad it quit when it did. The way it left things there is easily one more season to tie things up, but I doubt that will ever happen."
    },
    {
      "username": "brett-76260",
      "userUrl": "https://www.imdb.com/user/ur71629917",
      "reviewLink": "https://www.imdb.com/review/rw7773884",
      "warningSpoilers": false,
      "date": "19 January 2022",
      "rate": "9",
      "helpful": "10 out of 13 found this helpful.",
      "title": "Why cancel a great show?",
      "content": "This was a fantastic show. I mean if had it all. Action, dialog, cliff hangers, surprises and everything else in between. Probably one of the better cop shows I've seen. Easily binge with no question about it. Leave it to Hollywood to cancel a brilliant show with tons and tons of fans. They cancel this but leave crap shows on. Makes no sense to me. Anyway even though it only has about 40 episodes, it's definitely worth watching and will give you a few weeks of binge enjoyment. Great show."
    },
    {
      "username": "jjnoahjames",
      "userUrl": "https://www.imdb.com/user/ur12165280",
      "reviewLink": "https://www.imdb.com/review/rw2183136",
      "warningSpoilers": false,
      "date": "30 December 2009",
      "rate": "10",
      "helpful": "28 out of 39 found this helpful.",
      "title": "Awesome",
      "content": "To me this is one of the best new shows. After Lost ends I think I will be looking forward to this the most along with 24. I love V but fear for it to get worst, I've seen almost every Law and Order SVU and I'm getting sick of it, and Flash Forward is good but not as good as this. This show has a \"fresh\" feel which makes it stands out. There is nothing like it. The first season was amazing. I'm not sure why I like it exactly but one of the reasons is that it takes CSI style cop drama and takes it a step further. Some times the subject matter and the way it is shot make it seem almost too realistic. It almost has a horror movie effect on me. I grip the edge of my seat."
    },
    {
      "username": "leonard-b-smith",
      "userUrl": "https://www.imdb.com/user/ur55759531",
      "reviewLink": "https://www.imdb.com/review/rw8635218",
      "warningSpoilers": false,
      "date": "25 October 2022",
      "rate": "8",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Original, Gritty, Entertaining",
      "content": "I often cringe at the manner in which many of the criminal justice shows depict cops. I understand it's about entertainment, and it's not meant to be a documentary. As a former cop, I understand the working environment, the unique relationships formed with other officers, the dark humor, and the stress associated with the job.I find that SoutLAnd paints one of the most realistic portrayals of the life of street policing that I seen on TV, since the days of Hill Street Blues. There are subtleties in the show that may get lost on viewers who are not be familiar with patrol duties.This is a dramatic series and so there are a few liberties being taken, but those are easily overlooked in favor of an excellent drama. The characters are all relatable, and their struggles quite real."
    },
    {
      "username": "luckymike-44410",
      "userUrl": "https://www.imdb.com/user/ur110554010",
      "reviewLink": "https://www.imdb.com/review/rw8306265",
      "warningSpoilers": false,
      "date": "6 July 2022",
      "rate": "10",
      "helpful": "13 out of 15 found this helpful.",
      "title": "One of the Best Cop Shows Since NYPD Blue",
      "content": "The best way to describe this show is the word \"RAW\". Much like an earlier cop drama NYPD Blue, it puts it all out there and shows law enforcement as real people who are doing impossible work while dealing with their own lives. Bravo and thank you to the writers and actors who make it seem so real.An excellent show that was dropped for some unknown reason. TV execs seems to can good shows instead of developing them and promote crapola."
    },
    {
      "username": "LeonardOsborneKael",
      "userUrl": "https://www.imdb.com/user/ur13583332",
      "reviewLink": "https://www.imdb.com/review/rw2051951",
      "warningSpoilers": false,
      "date": "13 April 2009",
      "rate": "7",
      "helpful": "27 out of 37 found this helpful.",
      "title": "Very well-acted, superbly crafted, suspenseful drama with a point of view",
      "content": "At first this looked to be a kind of watered-down version of \"The Shield\" but the first-rate production work and the quality of the acting kept me interested. As the characters interacted and events unfolded I detected an intention to present a realistic -- if condensed -- version of life on the streets for LAPD. More importantly, I could sense that, unlike so many of today's TV dramas, this program seems to have something to say. Generally speaking, only TV producers Dick Wolf and David E. Kelley can be counted on to deliver on that score -- at least for the first ten years or so! For me, the jury is still out on \"Southland\". So far, so good ... Just watched the second episode -- better than the first -- solid! This really IS turning out to be a cop version of \"ER\" ... grounded in realistic detail ... focused on the minute by minute challenges of realistically portrayed characters. This one could be a keeper!"
    },
    {
      "username": "zenmateisshite",
      "userUrl": "https://www.imdb.com/user/ur68103986",
      "reviewLink": "https://www.imdb.com/review/rw6991116",
      "warningSpoilers": false,
      "date": "1 June 2021",
      "rate": "8",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Why don't these good shows last?",
      "content": "Just finished watching the last episode of season one. Astounding!Good TV shows like this don't seem to last for long. OZ, Homicide, 3rd Watch, Law & Order UK, Southland.Why? We need more. Please.Update after nearly finishing all episodes: Now I understand why it was cancelled - they ran out of content.The main recurring theme is partnership, trust, or lack thereof when some cops make mistakes either intentionally or not. It became tedious by the 4th season.The other theme is LA crime, and that got tedious quite quickly also because most of these thugs are: mid 20s, petty or gang crime, pregnant girl/wife, ruinign their child's life. It never evolves to other types of crime like corruption or premeditated murder, or whatever. Basically it is too dull to get the attention and when its not (like that police station shoot out) they don't give it enough story (ended up to be just a random guy. Wait, what?! You wasted a good story bois).It was good while it lasted. Auf Wiedersehen."
    },
    {
      "username": "goutham-jacksparrow",
      "userUrl": "https://www.imdb.com/user/ur23363851",
      "reviewLink": "https://www.imdb.com/review/rw8386763",
      "warningSpoilers": false,
      "date": "31 July 2022",
      "rate": "9",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Better than the wire",
      "content": "So few shows earn the right not to be skipped during an episode. This series had me glued to the screen all the way through. Its a shame that it got cancelled."
    },
    {
      "username": "spundog",
      "userUrl": "https://www.imdb.com/user/ur19491560",
      "reviewLink": "https://www.imdb.com/review/rw2110836",
      "warningSpoilers": false,
      "date": "13 August 2009",
      "rate": "9",
      "helpful": "33 out of 43 found this helpful.",
      "title": "strong show with uber-talented regina king.",
      "content": "i am impressed with this show. most of all i'm impressed with regina king. she is a standout talent in whatever role she takes on, and to say she is believable in this role is an understatement. not once do i stop believing i am actually watching a detective in the LAPD who is totally emotionally invested in her work. with her eyes she can convey more emotion than most actors can with the finest dialog Hollywood has to offer. ben mckenzie as \"ben\" is believable in this role. he seems to find roles that suit him well (stoic, troubled, mysterious, ready to throw down) and although he isn't quite a great actor he has great moments. michael cudlitz as his partner plays the role of the bully veteran patrolman to a T. anyone who hangs around with enough big city cops has met someone just like this guy (if not a dozen). his performance is a treat. with the heavy use of hand-held cameras and the documentary style of filming, at times it all combines to give the feel of a live-action reality show, and i can see why some onlookers were reportedly duped into thinking ben mckenzie had traded professions for real. there are some flaws in the show, and some of the story lines involving lesser characters seem contrived and unconvincing at times. but with a few adjustments and a whole lot more of miss regina king this show could find a place of its own amongst a crowded field of cop shows."
    },
    {
      "username": "walkingcrow-12422",
      "userUrl": "https://www.imdb.com/user/ur155111405",
      "reviewLink": "https://www.imdb.com/review/rw8382655",
      "warningSpoilers": false,
      "date": "29 July 2022",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Wow, I was riveted. Watched all seasons in a joyous binge.",
      "content": "This show is gritty and paced perfectly. Characters are spot on. If you like cop shows, this is not to be missed. The first show I watched in a long time where I was just waiting for free time to continue the series. Reminiscent of cop novels I read long ago, but updated to modern LA."
    }
  ],
  "errorMessage": ""
}