{
  "imDbId": "tt1299368",
  "title": "Southland",
  "fullTitle": "Southland (TV Series 2009–2013)",
  "type": "TVSeries",
  "year": "2009",
  "episodes": [
    {
      "id": "tt1503508",
      "seasonNumber": "2",
      "episodeNumber": "1",
      "title": "Phase Three",
      "image": "https://m.media-amazon.com/images/M/MV5BMjI1MDI4NTA0MF5BMl5BanBnXkFtZTgwMzcwODU2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "13 Apr. 2011",
      "plot": "Ben Sherman is about to complete Phase 2 of his rookie year. During Phase 3, he will be allowed to patrol solo. Detective Adams and Officer Brown are assigned new partners. Rene Cordero, Adams's new partner, is obsessed with receiving glory and press coverage. Their first case involves the search for an elderly man who left his home accompanied by an unknown black man. Brown's new partner, \"Slug\" Ferguson, quickly demonstrates how he earned that nickname when he starts a riot during a traffic stop. Meanwhile, Detectives Moretta and Bryant investigate a \"Sonora ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "299"
    },
    {
      "id": "tt1533520",
      "seasonNumber": "2",
      "episodeNumber": "2",
      "title": "Butch & Sundance",
      "image": "https://m.media-amazon.com/images/M/MV5BOTkxODMzOTc2OF5BMl5BanBnXkFtZTgwMTY4MjU2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "9 Mar. 2010",
      "plot": "Ben suspects his mentor Cooper is getting addicted to painkillers, but can't do anything about it. They find Dr. Rich Ryerson badly wounded outside his looted fine home, where his wife and daughters were bloodily slaughtered. Detective Rene Cordero braves Lydia's prejudiced contrariness to find out about the killer and his boss trough a rehab clinic. Detective Sammy Bryant has joined partner Nate Moretta in his ex-partner's drug task force, mainly for stake-outs, which reveal Nate's daughter is hooked up with a Trinney Day gang suspect. Ben is not amused when his ...",
      "imDbRating": "7.9",
      "imDbRatingCount": "270"
    },
    {
      "id": "tt1533521",
      "seasonNumber": "2",
      "episodeNumber": "3",
      "title": "U-Boat",
      "image": "https://m.media-amazon.com/images/M/MV5BMjMxMjMxMTU5MF5BMl5BanBnXkFtZTgwNTc3MjU2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "16 Mar. 2010",
      "plot": "Ben Sherman finally gets to drive his own patrol car when mentor Cooper acts instead as partner for a female colleague, whose shocking incompetence he demonstrates and scolds mercilessly. Ben is shocked but powerless when he sees a bully father 'punish' his gentle son for being a 'sissy victim' of street rabble by imposing front garden chores in female underwear. Ben smartly questions a Korean couple and their young son Matthew whose sister is missing and learns enough to find her. Cordero told Lydia not to be allover recovering Russell, but she only believes it when ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "289"
    },
    {
      "id": "tt1524844",
      "seasonNumber": "2",
      "episodeNumber": "4",
      "title": "The Runner",
      "image": "https://m.media-amazon.com/images/M/MV5BMzY3NDMxNzk5NV5BMl5BanBnXkFtZTgwODMwNDY2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "23 Mar. 2010",
      "plot": "Ben graciously volunteers to accompany Cooper on a visit in rehab to Dewey and afterward to the funeral of John's former partner, who got addicted to alcohol. Lydia Adams's prejudices and mean attitude are all over the place when she and her new partner must investigate the death near her parents' home of a student and college athlete from a dead-end Afro-American ghetto. She had an affair with a football star, but also turned to drugs from street dealers, wasted her studies, got pregnant and has a disastrous rapport with her ambitious parents and elder sister. A ...",
      "imDbRating": "7.9",
      "imDbRatingCount": "288"
    },
    {
      "id": "tt1531553",
      "seasonNumber": "2",
      "episodeNumber": "5",
      "title": "What Makes Sammy Run?",
      "image": "https://m.media-amazon.com/images/M/MV5BMjAwMjc5NjMxN15BMl5BanBnXkFtZTgwNzE2MzU2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "30 Mar. 2010",
      "plot": "While detective Sammy Bryant's wife, whose pregnancy proves bogus, works herself into ever more trouble with a skater and marijuana, his detaching to the major drug crime team is canceled by boss Daniel 'Sal' Salinger. Sammy concentrates on acting as big brother for fatherless, smart Latino street kid Juanito, whose cynicism sadly proves justified. Ben and Cooper discover, by searching a rowing couple's home routinely, a drug trade cash fortune, associating them with Nate Moretta's triumph.",
      "imDbRating": "8.5",
      "imDbRatingCount": "281"
    },
    {
      "id": "tt1531854",
      "seasonNumber": "2",
      "episodeNumber": "6",
      "title": "Maximum Deployment",
      "image": "https://m.media-amazon.com/images/M/MV5BNzg0Nzg2Mzc0M15BMl5BanBnXkFtZTgwNjY0MzU2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "6 Apr. 2010",
      "plot": "Because of the press's obsession with a police-uniformed 'serial rapist', uniformed (car) patrols are maximized, an equally costly and inefficient method as Ben and Cooper realize, bait does the truck. Detective Russell Clarke is finally back, does great questioning a young boy, the only witness of his grandparents' bloody murder, presumably by drug-addicted relatives, but still can't stay concentrated. Cooper's painkiller problem gets further out of hand and know to several colleagues. Sal's airhead daughter blackmails him to go to a party, thus gets in real danger, ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "266"
    }
  ],
  "errorMessage": ""
}