{
  "imDbId": "tt1299368",
  "title": "Southland",
  "fullTitle": "Southland (TV Series 2009–2013)",
  "type": "TVSeries",
  "year": "2009",
  "episodes": [
    {
      "id": "tt1645573",
      "seasonNumber": "3",
      "episodeNumber": "1",
      "title": "Let It Snow",
      "image": "https://m.media-amazon.com/images/M/MV5BMjQwMzY3NTY0NV5BMl5BanBnXkFtZTgwMzEyODU2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "4 Jan. 2011",
      "plot": "Rushing to a bank robbery, Ben perfectly follows arrest procedure only to see a fugitive commit suicide. Sammy and Nate investigate the murder of a street gang member who was recently acquitted of rape, probably ignoring she's the daughter of gang baron Luis Reyes. Russell is amused to see Lidia suffers the same selfish rudeness from her new, domineering partner as he, but gracefully, put up with from her.",
      "imDbRating": "8.0",
      "imDbRatingCount": "275"
    },
    {
      "id": "tt1645575",
      "seasonNumber": "3",
      "episodeNumber": "2",
      "title": "Punching Water",
      "image": "https://m.media-amazon.com/images/M/MV5BMjI3OTYzNjIzNV5BMl5BanBnXkFtZTgwMDQ0ODU2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "11 Jan. 2011",
      "plot": "The murder of a Latino gang member seems another rivalry victim, but Nate and Sammy learn from a local, soon shot himself, that he was the Romeo of a black gang's near-irresistible Juliette, starting a murder wave requiring full precinct mobilization. Ben's colleagues make fun of him for. Dewey is finally back on patrol, driving already depressed first Cooper nearly crazy.",
      "imDbRating": "8.0",
      "imDbRatingCount": "255"
    },
    {
      "id": "tt1645576",
      "seasonNumber": "3",
      "episodeNumber": "3",
      "title": "Discretion",
      "image": "https://m.media-amazon.com/images/M/MV5BMTY4MDI3MzM4NV5BMl5BanBnXkFtZTgwNDQ0ODU2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "18 Jan. 2011",
      "plot": "Ben learns the importance of discretion the hard way. Twice. Nate and Sammy try to track down a missing witness. Lydia and Josie butt heads over a weird case involving a chainsaw.",
      "imDbRating": "8.0",
      "imDbRatingCount": "249"
    },
    {
      "id": "tt1645577",
      "seasonNumber": "3",
      "episodeNumber": "4",
      "title": "Code 4",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQyMTU4MTEyMV5BMl5BanBnXkFtZTgwMzQ0ODU2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "25 Jan. 2011",
      "plot": "Ben is still confused after his mother's incident and Cooper can't resist exposing his 'rookie failures', yet he manages to star arresting a dazed man by reciting a karate mantra. Sammy is still so frustrated by his unfair divorce that Nate can't rely on him, while Mrs. Morietta feels he's overstaying his welcome, so he'll end up accepting an invitation from fellow ex-husband Sal. They investigate the shooting of Manuel 'Manny' Garces while he's buying a birthday cake for son Rafael. The only decent witness is unwilling to talk. Their likely suspect, small drug dealer...",
      "imDbRating": "8.8",
      "imDbRatingCount": "346"
    },
    {
      "id": "tt1645578",
      "seasonNumber": "3",
      "episodeNumber": "5",
      "title": "The Winds",
      "image": "https://m.media-amazon.com/images/M/MV5BNjY4ODA5NjI3OV5BMl5BanBnXkFtZTgwNjQ0ODU2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "1 Feb. 2011",
      "plot": "Ben is in Cooper's bad books and keeps silent when his mentor sides with a child-beating mother and arrests a man from driving under influence from prescription painkillers, while Cooper is dependent on illegal pills. Businesman Peter Wellington's spoiled wife Katherine files a complaint as latest victim of a serial rapist but is uncooperative and dubiously identifies Latino gardener Sergio Moreno, a family father, who panics and makes a tragic run. Cooper testifies against his father being released after 20 years as model prisoner, who even earned a college degree.",
      "imDbRating": "8.2",
      "imDbRatingCount": "247"
    },
    {
      "id": "tt1645579",
      "seasonNumber": "3",
      "episodeNumber": "6",
      "title": "Cop or Not",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc1NDU2Mjc4OV5BMl5BanBnXkFtZTgwNTQ0ODU2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "8 Feb. 2011",
      "plot": "Sammy is now practically adopted as substitute-father by Nate's angelic son Pete, but can't stand his chatterbox patrol partner and dangerously provokes the tough scum from the slum where even Nate's informants turned on them. Ben is stoic about being posted in Hollywood, confident the news will glue even criminals to the tube, after hip-hop and movie star Billy Stearn is arrested live on TV for the bloody slashing in their villa of his wife, who however had an affair with the bodyguard, a former Royal Marine. Detective Russell Clarke is back, on the chief's team, ...",
      "imDbRating": "7.6",
      "imDbRatingCount": "232"
    },
    {
      "id": "tt1645580",
      "seasonNumber": "3",
      "episodeNumber": "7",
      "title": "Sideways",
      "image": "https://m.media-amazon.com/images/M/MV5BMTkxMDE3NTE3NF5BMl5BanBnXkFtZTgwODQ0ODU2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "15 Feb. 2011",
      "plot": "Sammy overdoes his man of the house role at Nate's home. Identifying the killer proves traumatic. Ben and Cooper are frustrated by rules tying cops' hands to make the public's expectations come true. Dewey champions weird anecdotes telling. Russel accepts, although inexperienced, pleading his ex-partner Lydia's case, while she complicates it by refusing to stay home while suspended and even waits for the new team at a murder site.",
      "imDbRating": "8.2",
      "imDbRatingCount": "232"
    },
    {
      "id": "tt1645581",
      "seasonNumber": "3",
      "episodeNumber": "8",
      "title": "Fixing a Hole",
      "image": "https://m.media-amazon.com/images/M/MV5BMjE1OTAzMDEyM15BMl5BanBnXkFtZTgwNzQ0ODU2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "22 Feb. 2011",
      "plot": "Lydia and Josie babysit a witness before she appears in court. John and Ben attend a school bus holdup, and discover a kid who appears to be in need of help. Sammy tries to help his dead partner's wife, and find his killer.",
      "imDbRating": "8.1",
      "imDbRatingCount": "237"
    },
    {
      "id": "tt1645582",
      "seasonNumber": "3",
      "episodeNumber": "9",
      "title": "Failure Drill",
      "image": "https://m.media-amazon.com/images/M/MV5BMTg1MTI4NjUyNF5BMl5BanBnXkFtZTgwMDU0ODU2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "1 Mar. 2011",
      "plot": "Back pain and excessive painkillers render Cooper insufferable even for Ben and a danger to the public, as is an ancient driver. Sammy is back on the job and forced to color-coordinate a nursery if he wants to see his unborn child. Mr. Estrada is arrested prime murder suspect without proof but his dying wife's last words, but they were bitterly divorced and his firstborn martin swears father's innocence, mainly fearing separate foster care for him and two kid siblings.",
      "imDbRating": "8.3",
      "imDbRatingCount": "233"
    },
    {
      "id": "tt1645574",
      "seasonNumber": "3",
      "episodeNumber": "10",
      "title": "Graduation Day",
      "image": "https://m.media-amazon.com/images/M/MV5BMTczNzk5NTE0OF5BMl5BanBnXkFtZTgwMjQ0ODU2MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "8 Mar. 2011",
      "plot": "On Ben's rookie class's graduation day, Cooper's back-pain and pills addiction not only cause a miserable mood but completely exclude vital backup, so Ben finally forces his ex-tutor to check into rehab. Sammy's son is finally born and Nate's presumed killer 'leprechaun' dies in his arms after a street shooting. He decides to quit desk work and start chaperoning graduated rookies, like Ben. Dewey can't help sparing a blatantly criminal crack whore. Rodrigo is found out being Lydia's lover, making his mother question their partnership.",
      "imDbRating": "8.6",
      "imDbRatingCount": "249"
    }
  ],
  "errorMessage": ""
}