{
  "imDbId": "tt13991232",
  "title": "1883",
  "fullTitle": "1883 (TV Series 2021–2022)",
  "type": "TVSeries",
  "year": "2021",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8819092",
      "warningSpoilers": false,
      "date": "22 January 2023",
      "rate": "9",
      "helpful": "68 out of 73 found this helpful.",
      "title": "Terrific!",
      "content": "I have to say that I really enjoyed 1883 even more than I thought I wound. This is the prequel to Yellowstone as it shows the Dutton family as they travel from Texas to Montana looking for a better life. It's created by Taylor Sheridan (Yellowstone, Mayor of Kingstown, etc.). Sheridan has turned in one great show after another and this one is no different. It's a very gritty and violent show that showed off the realness of the Wild West. The writing and acting is what makes this show so special. It's too bad that this is only a mini-series and there aren't more seasons coming because I would love to see more from this show."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8802103",
      "warningSpoilers": false,
      "date": "15 January 2023",
      "rate": "9",
      "helpful": "77 out of 85 found this helpful.",
      "title": "Loved It!",
      "content": "As a big Yellowstone fan I was really looking forward to 1883 and I was not disappointed! Taylor Sheridan has created another hit show! The cast was even better than I thought. I was a little worried about Tim McGraw and Faith Hill but they were both terrific. Sam Elliot was as great as always and Isabel May is a star in the making. For the people complaining about the language and violence...it's a show for adults so relax. I love everything about this show, the acting, writing, directing, production, cinematography, etc are all excellent!! If you're a fan of Yellowstone or even a western fan in general then this is a must watch!"
    },
    {
      "username": "A_Different_Drummer",
      "userUrl": "https://www.imdb.com/user/ur44112735",
      "reviewLink": "https://www.imdb.com/review/rw7660842",
      "warningSpoilers": false,
      "date": "19 December 2021",
      "rate": "9",
      "helpful": "925 out of 1,105 found this helpful.",
      "title": "Review by the numbers",
      "content": "1. In the UK, unlike in the US, it always been common to have single creators known for their ability to generate consistent hi-quality dramas. Steven Moffat comes to mind. He has been creating hits since the 1980s. In the US, the nearest thing we have to a creator of that same quality is Taylor Sheridan. Check out his IMDb bio. Props to him. He has earned it.2. The incredible success of Yellowstone is not merely about Costner and Sheridan, it could also be considered \"The Revenge of the Studio System.\" Unlike the typical Netflix offering, Yellowstone is old school Hollywood all the way. And it shows. And so is 1883.3. Sam Elliot is 77 years old and has been playing the same basic character -- perfectly -- for decades. In the UK they would have knighted him by now. Seriously.Bottom line -- at every level, 1883 represents the best that America has to offer. It is in the DNA. So just enjoy it.((Designated \"IMDb Top Reviewer.\" Please check out my list \"167+ Nearly-Perfect Movies (with the occasional Anime or TV miniseries) you can/should see again and again (1932 to the present))"
    },
    {
      "username": "southdavid",
      "userUrl": "https://www.imdb.com/user/ur0715971",
      "reviewLink": "https://www.imdb.com/review/rw8617331",
      "warningSpoilers": false,
      "date": "17 October 2022",
      "rate": "8",
      "helpful": "77 out of 89 found this helpful.",
      "title": "Frontier Psychiatry.",
      "content": "I haven't seen anything of \"Yellowstone\" yet, but I thought that, as that is set in present day, I'd probably be able to watch a prequel series set over a hundred years earlier without much fear of mixing the context. I do like Taylor Sheridan's work, particularly \"Hell or High Water\" so when this appeared near the top of my Paramount Plus service, I felt confident giving it a go. It's an excellent limited series, full of wonderful performances and does make me interesting in watching the main series.Elsa Dutton (Isabel May) joins her family in a perilous Journey towards the free and fertile land of Oregon. Her father, James (Tim McGraw) agrees to take the journey with two lawmen, Shea Brennan (Sam Elliott) and Thomas (LaMonica Garrett) who are commissioned to act as guide, security and teacher to a group of German pioneers, who are also looking for a better life, but are dangerously unprepared for the perils they will face. Always a rebellious child, Elsa takes to the freedom of the plains with abandon, but the costs of such freedoms are high.Performances are great in this. Tim McGraw I've not seen in much before but he's really good in this, in what looks like the deepest performance he's been asked to do. His real-life wife, Faith Hill, plays his wife in this and she too is excellent. Isabel May is the star though; the story is told though her eyes and she gets to give the poetic voice over that is another run through. Admittedly, Sam Elliott has played wise old cowboy before, but it's an iconic trope and it's welcome whenever he's on screen. There are cameos from Rita Wilson, Billy Bob Thornton and even Tom Hanks, who is probably on screen for less than two minutes.Admittedly, this isn't particularly original. The dangers of the Oregon Trail have been recounted in various mediums for years. So, the story of Snakes, Storms, Dysentery, Native Americans and Outlaws probably doesn't have many surprises for you. What it does have is all pervasive quality. Both in terms of historical recreation and cinematography - though I suspect in some places you simply point the camera in the right direction and the mountains do the rest.I enjoyed this and burned through it in less than a week. I may need to start \"Yellowstone\" sooner rather than later."
    },
    {
      "username": "TxMike",
      "userUrl": "https://www.imdb.com/user/ur0438066",
      "reviewLink": "https://www.imdb.com/review/rw8639616",
      "warningSpoilers": false,
      "date": "27 October 2022",
      "rate": "",
      "helpful": "65 out of 75 found this helpful.",
      "title": "'You can't believe in Heaven then be sad when people go there.'",
      "content": "This recently became available, all ten episodes, on a set of four DVDs. I found the set at my public library. There is a scene in the first episode, as a large group of people and wagons are gathering, for their trek to the North and West. They are gathering on the Trinity River outside Fort Worth, Texas, and one person is offering condolences for the husband's death. She responds, \"You can't believe in Heaven then be sad when people go there.\" I had never heard it put that way before.As the end credits on each episode states, the stories were \"inspired\" by events of the 1880s as people from Eastern areas began to move out west. Many wanted to go to specific places, like Oregon or Washington. But some just wanted to go someplace new and figured they'd know it when they see it. As was the Dutton family from the woods of Tennessee. The stories portrayed had input from historians and are largely authentic to the time and the travels to settle the West.I didn't see \"Yellowstone\" season four but the DVD extras talk about flashbacks that were the inspiration for \"1883\", intended to be the origin story of how the Dutton clan ended up settling where they did in Montana.The 1880s as portrayed here are rough and dangerous. Steal a wallet and you might be hanged and shot. If you are found with small pox you are banished and you might as well find a nice river bank and lie down and wait to die. Traveling was dangerous, bands of thieves or aggressive Native tribes might steal your horses, kill you and scalp you and your family. Yet they persisted. Many perished along the way, some made it.It is overall a big investment in time to watch all ten episodes but I did it over a week and found it to be a totally captivating and worthwhile show. A few extras on the 4-disc DVD set show a number of interesting \"making of\" features."
    },
    {
      "username": "estelle58",
      "userUrl": "https://www.imdb.com/user/ur51201549",
      "reviewLink": "https://www.imdb.com/review/rw8806610",
      "warningSpoilers": false,
      "date": "17 January 2023",
      "rate": "10",
      "helpful": "51 out of 61 found this helpful.",
      "title": "The Road West",
      "content": "It is hard to put into words the ingenuity of this fabulous series.The attention to every detail in order to keep this series as authentic as possible is phenomenal.It is difficult to not fall in love with the gem of the screen, Elsa Dutton. For sure, everyone is superbly cast, but Isabel May who plays Elsa does an absolutely sublime job of portraying this strong willed, extremely ambitious, hopelessly romantic teenager. The storyline is seen through her eyes in an audible diary. And my, does this actress have a beautiful voice for narration.After I finished this, I wanted more so I watched the Road West, (right under where you find episodes on the left of your screen). You get to hear from the actors and the amazing Taylor Sheridan regarding this truly endearing work of art."
    },
    {
      "username": "fraser-simons",
      "userUrl": "https://www.imdb.com/user/ur37365377",
      "reviewLink": "https://www.imdb.com/review/rw8607323",
      "warningSpoilers": false,
      "date": "13 October 2022",
      "rate": "10",
      "helpful": "58 out of 75 found this helpful.",
      "title": "A masterpiece.",
      "content": "Sheridan has been on my auto watch list for a while. Sicario and Wind River, to some degree Yellowstone, have all been exceptional. This, however, is pretty flawless. This feels like Lonesome Dove (the novel, never saw the adaptations) only with a female narrator that leans on some nature writing that feels like Annie Dillard. The combination is entrancing.Sheridan has really outdone himself with this script. But the actors also are just flawless. Who would have thought Tim McGraw and Faith Hill could put out performances like this. It has the air of a production where everything knew they were making something exceptional and gave a signature effort toward it. The cinematography, small, side parts, the directing, the costuming, set design, locations-it is all perfect. This is a masterpiece and is going up there as an all time favourite TV show."
    },
    {
      "username": "jaimemedina-36288",
      "userUrl": "https://www.imdb.com/user/ur78124884",
      "reviewLink": "https://www.imdb.com/review/rw7690212",
      "warningSpoilers": false,
      "date": "27 December 2021",
      "rate": "10",
      "helpful": "183 out of 262 found this helpful.",
      "title": "Absolutely beautiful",
      "content": "There's not much more to say other than that 1883 is quite simply some of the best television that has ever been produced. From the writing, to the cast, to the cinematography, every minute is a joy to watch."
    },
    {
      "username": "boggie4758",
      "userUrl": "https://www.imdb.com/user/ur17261880",
      "reviewLink": "https://www.imdb.com/review/rw7662149",
      "warningSpoilers": false,
      "date": "19 December 2021",
      "rate": "9",
      "helpful": "169 out of 248 found this helpful.",
      "title": "Epic",
      "content": "I usually wait until the 4th episode before I write a review or rate a series. I don't need to do so with this series. Such a sprawling story, rich, gritty, sad, hardship. A epic story that has all the elements that make a series great. I love a good western..this is a great western....some one said it was a Lonesome Dove feel to it and I agree..what made Lonesome Dove great was the excellent story telling and this one has the same elements to it..great writing and fine acting. I love the daughter's voice tell the story it adds a depth to the story. This will be one of my favorites just like Yellowstone is. I was worried how this series would be because Yellowstone is so good..but, this series it top notch.."
    },
    {
      "username": "Klaaatu",
      "userUrl": "https://www.imdb.com/user/ur0011834",
      "reviewLink": "https://www.imdb.com/review/rw8785455",
      "warningSpoilers": false,
      "date": "7 January 2023",
      "rate": "10",
      "helpful": "32 out of 40 found this helpful.",
      "title": "One of the best works ever on TV",
      "content": "This series has to be one of the best television series ever made for tv.Besides how accurate it seems in relation to the struggle of the pioneers founding the country, or the love between family and how to survive a wild frontier, it demonstrates how perseverance and dreams can propel a person to do things seemingly impossible.The writing and direction in this series has to be some of the best I've seen in a very long time.My only hope is that it gets recognized for this in the upcoming awards seasons and that there is a second season... however unlikely that might be, considering they already have the 1923 series as a sequel."
    },
    {
      "username": "namritjoshi",
      "userUrl": "https://www.imdb.com/user/ur83142595",
      "reviewLink": "https://www.imdb.com/review/rw8565481",
      "warningSpoilers": true,
      "date": "24 September 2022",
      "rate": "10",
      "helpful": "46 out of 58 found this helpful.",
      "title": "E10 Touched my soul - Father & Daughter.",
      "content": "This is one of the best in this genre and the one that made me cry full if emotions in a long long time! The way last 2 episodes shaped wasnt as expected considering the ruthlessness of the journey the series showcased. The series begins with a harsh journey and ends with love, what exactly is heaven and happiness in ones life. When the captain says - she outlived us all in last 6 months, it tells us thats its all about the journey and how much makes the most out of it. Am in shock that this did not received any acting emmy nominations. TimMcgraw and sam elliot were easy nominations atleast if we are not talking about the win!"
    },
    {
      "username": "lambiepie-2",
      "userUrl": "https://www.imdb.com/user/ur0874373",
      "reviewLink": "https://www.imdb.com/review/rw7766510",
      "warningSpoilers": true,
      "date": "16 January 2022",
      "rate": "9",
      "helpful": "108 out of 162 found this helpful.",
      "title": "A TV Western One Could Get Into",
      "content": "I have not watched Yellowstone. My interest in Westerns was limited from Gunsmoke and the Riffleman as a toddler because my Dad was a western tv fanatic. For my interests in Westerns, movies like The Unforgiven, Tombstone, Good Bad, and the Ugly, Hang 'em High, etc., and my 'guilty pleasure' episode of the old Twilight Zone episodes called 'The Grave.' I wasn't a fan of the tv 'soap opera' Westerns. However, this has caught my interest.I watched the first one thinking I wouldn't get further than the first 10 minutes, but as it went on, I got interested. This is an 'origin' story, but for me, without seeing the series, it was an origin of, I became curious as a stand alone.It is slow going in the first episode (pilot) but picks up the saga of the trials of people moving west. It is brutal, violent, fraught with diseases - the whole ball of wax and some as the episodes progress. I want to know if they will make it with all they will face. The wild, untamed west is the beginning of settlements crossing America.The actors and their situations in this have my attention so far. The family in focus with actors Tim McGraw and Faith Hill do well. With their on the brink of womanhood, daughter played by Isabel May, she is interesting enough and provides the narration. It doesn't bother me as much as it bothers others (I think it exists because she may be an 'origin' character in Yellowstone). Still, I will guess that narration will calm down or disappear entirely as the series progresses.The law/leaders to take folks (homesteaders, German immigrants, etc.) from one part of America to the next. Actor Sam Elliott (whom I am a fan of) and LaMonica Garrett (who I'm not familiar with) are attractive for me so far enough to see where this will carry. Sam's character, for example, has the most heartbreaking opening scene, but how he rebounds is an exciting journey that interested me. (And I do like the cameos of other actors!)With 5 episodes so far, I am interested in all these folks and their journey in 1883. Who knows, it may lead me to take a peek into the Yellowstone series - eventually."
    },
    {
      "username": "boonarga",
      "userUrl": "https://www.imdb.com/user/ur1247643",
      "reviewLink": "https://www.imdb.com/review/rw8799446",
      "warningSpoilers": false,
      "date": "14 January 2023",
      "rate": "10",
      "helpful": "41 out of 49 found this helpful.",
      "title": "Just brilliant",
      "content": "I just watched all of Yellowstone in a week and then started this series. Even after the first episode I was enthralled. It is even better than Yellowstone.The actors are all perfect. The narration is perfect. The settings are perfect. I just can't find a fault in it anywhere.It does a great job of showing just how untamed the country was back then and why the natives fought so hard to keep it. Such a travesty the way the governments treated them.I'll certainly be looking for more content from Taylor Sheridan. But first must finish this and then watch 1923. Excited for what's to come.This is one of the best series I've ever seen."
    },
    {
      "username": "nobletraveler",
      "userUrl": "https://www.imdb.com/user/ur7805583",
      "reviewLink": "https://www.imdb.com/review/rw8788972",
      "warningSpoilers": false,
      "date": "9 January 2023",
      "rate": "10",
      "helpful": "34 out of 42 found this helpful.",
      "title": "Amazing - Deep - Amazing",
      "content": "Haven't seen Yellowstone yet. But started with this Mini-Series. I was emotionally blown away. It grabbed me and held me all night binge watching. This needs to be awarded Best Mini-Series at the Emmys for 2023. It also should give Isabel May Best Actress, Sam Elliott Best Actor, Faith Hill Best Supporting Actress, Tim McGraw or LaMonica Garrett as best Supporting Actor. The whole cast should be awarded Best Ensemble. The Writing should win as well as Direction. This Mini-Series was really nothing sort of a 10 - Total Perfection and realism. Very corse language, but that was how real life was back then. Violent? Yes. Gut Wrenching in parts? Yes, but again the trails going out west was not a joy ride, but an extreme challenge - I highly recommend this show and will continue on with 1923 and Yellowstone. To the Television Academy - Take notice for 2023. 1883 should do a sweep if you really do honor \"Performances\" instead of being \"politically correct\"."
    },
    {
      "username": "mstaffordca",
      "userUrl": "https://www.imdb.com/user/ur74656473",
      "reviewLink": "https://www.imdb.com/review/rw7660874",
      "warningSpoilers": false,
      "date": "19 December 2021",
      "rate": "10",
      "helpful": "148 out of 219 found this helpful.",
      "title": "So good I was heartbroken when the first episode ended!",
      "content": "Just amazing! This group behind Yellowstone and 1883 are just so amazing I can't thank you all enough for putting out a series that we can really dig into and enjoy! I was so enthralled I never wanted it to end. I only wish I could binge the whole season RIGHT NOW. Please keep making series like these. Emotional, heartfelt, relatable, and with so much depth and character! Spectacular acting! I could go on and on! Just WOW thank you. These are the people who should be winning the awards for best series, best script/writing, best acting etc. Etc. A huge thank you."
    },
    {
      "username": "tshape",
      "userUrl": "https://www.imdb.com/user/ur109304035",
      "reviewLink": "https://www.imdb.com/review/rw8631145",
      "warningSpoilers": false,
      "date": "23 October 2022",
      "rate": "10",
      "helpful": "42 out of 54 found this helpful.",
      "title": "Tragically beautiful.",
      "content": "Loved it. The story, casting, acting, filming & scenery were top notch. Very well done & I think it has something for everybody. There was a lot of sadness, but thankfully, the beauty & hope outweighed it all.It was unfortunate to see the end play out to many of the characters, but it was integral to the storyline. I'm no historian, but I'm guessing 1883 is a good representation of early American immigrant life. It also shows just how fortunate we are today with the expertise of modern medicine.I've read clues about a 2nd season, but even without one, this story is complete & ties in perfectly with Yellowstone."
    },
    {
      "username": "aboalhyjaa",
      "userUrl": "https://www.imdb.com/user/ur69239269",
      "reviewLink": "https://www.imdb.com/review/rw7665571",
      "warningSpoilers": true,
      "date": "20 December 2021",
      "rate": "8",
      "helpful": "79 out of 127 found this helpful.",
      "title": "Wild wild west",
      "content": "2 episodes in, and I think i love it.When i first see that they will air 2 episodes in the same first day i wondered why or is it a commercial thing. But after watching the first I understand why, its just not enough to get emotionally attached but when watching the second episode you'll be so attached you're gonna want all the season to be aired in one day.Its true its a slow burn, but not slow show itself. And definitely not a boring scene with the west theme, you will be both happy and thrilled with all the amazing cast in this show. But dont get so close because you'll never know how long it is for them to die!."
    },
    {
      "username": "nancyhotz",
      "userUrl": "https://www.imdb.com/user/ur7665050",
      "reviewLink": "https://www.imdb.com/review/rw7921386",
      "warningSpoilers": true,
      "date": "5 March 2022",
      "rate": "6",
      "helpful": "127 out of 193 found this helpful.",
      "title": "Good start, then...",
      "content": "It really started strong, but then developed into nothing more than the young narrator's story, which became tiresome. Her character became annoying and much better potential storylines were not developed. Too bad."
    },
    {
      "username": "terrylarosa",
      "userUrl": "https://www.imdb.com/user/ur113058436",
      "reviewLink": "https://www.imdb.com/review/rw7663847",
      "warningSpoilers": true,
      "date": "20 December 2021",
      "rate": "10",
      "helpful": "139 out of 229 found this helpful.",
      "title": "Finally a good Western",
      "content": "Been a while since Hell on Wheels. Most of the actors are perfectly cast: especially McGraw and the quintessential movie cowboy: Sam Elliot. Outstanding also is the daughter. Great action, vistas and authenticity. Plus no twirling horses. We did have a despicable Beth like character but that's not an issue anymore. The people stating this show is just about killing people must have read the Sesame Street version of the old West and should stick to watching that so they're not left a quivering mess as to how it once was just a scant century plus ago. Incidentally I don't own a gun nor wish to. Now that Sheridan has apparently thrown in the towel with the now almost unwatchable Yellowstone we can sit back and watch a good old fashioned shoot em up Western."
    },
    {
      "username": "jeffpsy",
      "userUrl": "https://www.imdb.com/user/ur57729378",
      "reviewLink": "https://www.imdb.com/review/rw8838076",
      "warningSpoilers": false,
      "date": "30 January 2023",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Achingly beautiful",
      "content": "I've never rated anything a 10 before, but \"1883\", from start to finish, is the most moving, deeply human, achingly beautiful TV drama that I've seen. The 10 episode series follows a wagon train of pioneers as they travel from Fort Worth, Texas, seeking to reach their ultimate goal of Oregon. It paints a picture of America-post Civil War-that features the deep scars wrought by the war, the uniquely American impulse to start over and build a new life, America's ambivalent relationship with immigrants, a strong black man struggling to find his place in a post-Reconstruction world, women's first halting steps toward emancipation, and of course our deeply troubled relationship with the indigenous community. And it does so with three-dimensional characters and great performances. I would never have expected such stellar acting from Tim McGraw and Faith Hill. Isabel May is stunning in the lead role as Elsa Dutton, and the whole thing is anchored by the gravitas of Sam Elliott. Some of the most touching scenes occur when Elliott's character (Shea) offers support and wisdom to Elsa. When she later thanks him for that support, you suddenly see his worn, grizzled face light up.And I must mention Taylor Sheridan, whose screenplay struck all the right notes. The sharpness of the dialogue and the poetry of the narration were transcendent.Needless to say, I was blown away by this drama. It engaged me, delighted me, and broke my heart all at once. I was never able to get interested in the show Yellowstone itself, but the prequel \"1883\" is a must-see."
    },
    {
      "username": "MovieLuver365",
      "userUrl": "https://www.imdb.com/user/ur67662482",
      "reviewLink": "https://www.imdb.com/review/rw8587100",
      "warningSpoilers": false,
      "date": "4 October 2022",
      "rate": "10",
      "helpful": "29 out of 37 found this helpful.",
      "title": "10 for the writing. 10+ for everything else too!",
      "content": "Faith Hill hit the nail on the head when she said the writing is excellent! As a girl 13-16 I, too, grew up in Ft Worth, played on the banks of the Trinity, breathed in the beauty, wildness, and spirit of Texas, but could never quite describe it to others since I moved away. Especially in Episodes 5 & 6, Taylor Sheridan has done just that, perfectly! In all my life watching westerns, living with real cowboys, and loving my family's heritage in the west, I have never seen a woman's (or her mother's) story told so perfectly. But then, Mr. Sheridan did a wonderful job of telling a much more tragic tale on \"Wind River\", as well. An Academy Award for writing? I think it might be a good idea! Yellowstone was on my \"wish list\", now it is a \"must see\". Just wonder if,I should hold out for 1932 and watch the whole thing in chronological order. Thank you for creating this, but mostly for writing it so well.*I wanted to add that your tribute to Native Americans and Black men, and their role in the \"West\" was accurate, and part of what I appreciated so much about the movie. You see, I know it was accurate because I was born in TULSA and raised in TEXAS and that is what we were TAUGHT. Everyone else thinks WE think it was Hollywood's version. Only Hollywood (and now the rest of the world) thinks that. Thank you for telling the TRUE story and history regarding all people's contributions, tribulations and trials to our great nation and our \"taming\" of the West."
    },
    {
      "username": "siam-11962",
      "userUrl": "https://www.imdb.com/user/ur111660546",
      "reviewLink": "https://www.imdb.com/review/rw8784918",
      "warningSpoilers": false,
      "date": "7 January 2023",
      "rate": "9",
      "helpful": "19 out of 21 found this helpful.",
      "title": "Fantastic show",
      "content": "Wow- this tv show was really good!First - the acting was fantastic! Sam Elliot is great but also Tim McGraw and Faith Hill surprised me with their excellent performances; But Isabel May playing Elsa was even more fantasticThis show truly shows the hardship of the time back in the 1880's and the difficulties endured by so many of the immigrants venturing to the west; it is so realistic and beautiful at the same time and the cherry are all the beautiful views and scenery of the ling road they go throughIts hard to find flaws in this fantastic show, and... it's touching- i actually had tears, twice.. What it! It is just great."
    },
    {
      "username": "BruceWayne3",
      "userUrl": "https://www.imdb.com/user/ur83588937",
      "reviewLink": "https://www.imdb.com/review/rw8112330",
      "warningSpoilers": false,
      "date": "3 May 2022",
      "rate": "6",
      "helpful": "119 out of 204 found this helpful.",
      "title": "8.8? Get the f outta here",
      "content": "This show had a ton of potentialBut wasted waaaaay too much time telling a love story about a little girlHonestlyNo one cares about thatIt was boringThe premise of a family traveling across the Wild West is super interesting, there's so many other ways they could of went, this direction just ends up falling flat."
    },
    {
      "username": "anthonyjlangford",
      "userUrl": "https://www.imdb.com/user/ur3548961",
      "reviewLink": "https://www.imdb.com/review/rw7973989",
      "warningSpoilers": false,
      "date": "16 March 2022",
      "rate": "6",
      "helpful": "135 out of 231 found this helpful.",
      "title": "Strong start but loses it's way",
      "content": "Very strong opening. Excellent two to three episodes. Good production value with an important and rare story. Finally, something fresh. The immigrant experience.How disappointing to be wrong.It soon loses it's way. By mid-season, it's clear we're party to the old Bait n Switch. Unfortunately, it heads into fantasy and becomes yet another modern identity lecture. Strong independent women, awesome flawless minorities, 'pithweak' evil white men.Even the excellent Sam Elliot gets relocated to the back seat.This is just fantasy. Such a awful shame as there really was great potential for many story threads and a valuable insight into the type of history that is overlooked now in favor of the usual 'victim' diatribes. What lack of insight. What incredible shortsightedness.I had rated this and the early two episodes a 9. I was really enjoying it. By mid way, I had to change the rating to a 7. At best. The focus, on just a few characters, who are more at home in the 21st century than the 19th. Give us reality. Not modern polemics. The cinematography is the only redeeming feature.I won't watch the last 3 episodes. I refuse to be party to more of Hollywood's false moralizing narrative. A valuable opportunity squandered. A rejection of history. A juvenile soap opera."
    },
    {
      "username": "rzahrai",
      "userUrl": "https://www.imdb.com/user/ur33454947",
      "reviewLink": "https://www.imdb.com/review/rw8674166",
      "warningSpoilers": false,
      "date": "14 November 2022",
      "rate": "10",
      "helpful": "30 out of 39 found this helpful.",
      "title": "The beauty of film making is this.",
      "content": "For about a year, my wife and I avoided watching this because we thought that Yellowstone had set the bar - and it was going to be impossible to reach it. We also thought that this may be too violent. Two episodes in, and 1883 is nothing but sheer brilliance and beauty in the art of traditional filmmaking: the score, the scenery, the themes, the acting, and the poetic narration is something to reveal in admiration over. I'm enjoying every minute of every scene because of its character development, richness in motif, and pure artistry. In someways, I'm enjoying this more than Yellowstone, purely because of its maturation in the art form.Film making has been contaminated by the constant addiction to adrenaline, hooks, and cheap thrills. This is none of that - this is pure, meaningful, deep themed brilliance in poetic commentary on human relationships, fear and hope, love and tribulation. If you want to appreciate film in the form in which it can ascend to, this is for you. If you want something thrilling and constantly suspenseful, with hooks at the end of each episode, then maybe give it a miss. This isn't candy; this is aged wine."
    }
  ],
  "errorMessage": ""
}