{
  "imDbId": "tt13991232",
  "title": "1883",
  "fullTitle": "1883 (TV Series 2021–2022)",
  "type": "TVSeries",
  "year": "2021",
  "language": "en",
  "titleInLanguage": "1883 (TV series)",
  "url": "https://en.wikipedia.org/wiki/1883_(TV_series)",
  "plotShort": {
    "plainText": "1883 is an American Western drama television miniseries created by Taylor Sheridan that premiered on December 19, 2021, on Paramount+. The series stars Tim McGraw, Faith Hill, Sam Elliott, Isabel May, LaMonica Garrett, Marc Rissmann, Audie Rick, Eric Nelsen, and James Landry Hébert. The story is chronologically the first of several prequels to Sheridan's Yellowstone and details how the Duttons came to own the land that would become the Yellowstone Ranch. It is the second installment produced in the Yellowstone franchise. The series consists of ten episodes and concluded on February 27, 2022.",
    "html": "<p>1883 is an American Western drama television miniseries created by Taylor Sheridan that premiered on December 19, 2021, on Paramount+. The series stars Tim McGraw, Faith Hill, Sam Elliott, Isabel May, LaMonica Garrett, Marc Rissmann, Audie Rick, Eric Nelsen, and James Landry Hébert. The story is chronologically the first of several prequels to Sheridan's Yellowstone and details how the Duttons came to own the land that would become the Yellowstone Ranch. It is the second installment produced in the Yellowstone franchise. The series consists of ten episodes and concluded on February 27, 2022.</p>"
  },
  "plotFull": {
    "plainText": "1883 is an American Western drama television miniseries created by Taylor Sheridan that premiered on December 19, 2021, on Paramount+. The series stars Tim McGraw, Faith Hill, Sam Elliott, Isabel May, LaMonica Garrett, Marc Rissmann, Audie Rick, Eric Nelsen, and James Landry Hébert. The story is chronologically the first of several prequels to Sheridan's Yellowstone and details how the Duttons came to own the land that would become the Yellowstone Ranch. It is the second installment produced in the Yellowstone franchise. The series consists of ten episodes and concluded on February 27, 2022.\r\nPremise\r\nThe series follows the post-Civil war generation of the Dutton family as they leave Tennessee, journey to Fort Worth, Texas, and join a wagon train undertaking the arduous journey west to Oregon, before settling in Montana to establish what would eventually become the Yellowstone Ranch.\r\nCast and characters\r\nMain\r\nSam Elliott as Shea Brennan, an employee of the Pinkerton Agency leading the expedition. Brennan is a former captain who served in the Union Army during the American Civil War. His wife Helen and daughter both die of smallpox right before the start of the expedition. While mourning their deaths, he cremated them by setting fire to their house and contemplated suicide, but was interrupted by the arrival of Thomas. Brennan acts as the rugged and commanding leader of the wagon train, frequently reminding members of the danger and tragedy that they will face along the way.\r\nTim McGraw as James Dillard Dutton. From Tennessee, he was a captain in the Confederate States Army during the Civil War and was wounded during the Battle of Antietam and captured. He was held in a Union prisoner-of-war camp for three years. A skilled leader and combatant, he joins the wagon train with his family after meeting Brennan and Thomas in Fort Worth, Texas.\r\nFaith Hill as Margaret Dutton, John Dutton III's great-grandmother and the matriarch of the family. She travels via train from Tennessee with her children, sister-in-law, Claire, and niece, Mary Abel, to Fort Worth to begin a new journey with her husband, James.\r\nIsabel May as Elsa Dutton, James and Margaret Dutton's resourceful 17-year-old daughter. Much of the story is told in her voice as an inner narrative. Young, undisciplined and innocent, she looks forward to the expedition as a great adventure. Elsa becomes hardened during the difficult journey west, also becoming enamored with a cowboy and later a Comanche warrior; much to the dismay of her parents. However, she also becomes a skilled survivalist and cowgirl.\r\nLaMonica Garrett as Thomas, a Pinkerton agent and veteran U.S. Army sergeant from a Buffalo Soldier regiment. He teams up with Shea Brennan to help guide the group. His arrival helps dissuade Shea from suicide. Thomas is a skilled frontiersman, and later begins a relationship with Noemi, the Romani widow.\r\nMarc Rissmann as Josef, a German immigrant who is married to Risa and worked as a carpenter before travelling to America. He aids the expedition serving as an interpreter for his group and as a liaison between the Americans and immigrants.\r\nAudie Rick as John Dutton Sr., John Dutton III's grandfather, as a young boy. He is the younger child of James and Margaret and is five years old at the beginning of the journey.\r\nEric Nelsen as Ennis, a young cowboy who is paid to escort the group and tend to their cattle. He develops a relationship with Elsa.\r\nJames Landry Hébert as Wade, the lead cowboy.\r\nNoah Le Gros as Colton, an experienced cowboy who joins the group at the Texas-side of the Red River.\r\nRecurring\r\nAlex Fine as Grady, an experienced cowboy and the leader of a crew of six drovers, who agrees to help an inexperienced crew round up longhorns for their long journey.\r\nGratiela Brancusi as Noemi, a Romani widow who recently lost her husband and has to raise two young boys on her own. She becomes dependent on and romantically interested in Thomas, seeing him as the man who will replace her late husband as a caretaker.\r\nAnna Fiamora as Risa, a young immigrant woman who is married to Josef and joins the traveling camp to move west.\r\nAmanda Jaros as Alina, a weary but hopeful immigrant woman who speaks little English but has much resolve.\r\nMartin Sensmeier as Sam, a skilled Comanche warrior loyal to Quanah Parker, who later takes Elsa as his wife.\r\nJames Jordan as Cookie, a foul-mouthed wagon train cook whose poor decision leads to the group's confrontation with a band of vengeful Lakota.\r\nGuest stars\r\nBilly Bob Thornton as Marshal Jim Courtright.\r\nTom Hanks as General George Meade. In a flashback to the Battle of Antietam, he consoles James Dutton after many of his fellow soldiers are killed, before the latter gets taken captive. Hanks' wife, Rita Wilson, plays Carolyn the storekeeper.\r\nGraham Greene as Spotted Eagle, a Crow elder who tries to help Elsa and who also points James to Paradise Valley, the final destination for the Dutton family.\r\nDawn Olivieri as Claire Dutton, James Dutton's widowed sister who joins him and his family on a trip to find a new home. She is intense and stern in manner, like her daughter. She dies by suicide after losing her only surviving child, Mary Abel. She had six children before, all of whom died young.\r\nEmma Malouff as Mary Abel Dutton, Claire's daughter. A prim and proper young woman, she shows disdain and no sympathy for her cousin Elsa for her less traditional values. During an attack by unwelcome intruders, Mary Abel is caught in the crossfire and dies from a bullet wound.\r\nRita Wilson as Carolyn, a kindly storekeeper at Doan's Crossing, at the border of Texas and Oklahoma. She befriends Margaret when the latter visits her store and they drink whiskey together. Wilson's husband, Tom Hanks, plays General Meade.\r\nTaylor Sheridan as Charles \"Charlie\" Goodnight, a rancher who hunts cattle thieves.\r\nEpisodes\r\nCrossovers and sequels\r\nParamount has communicated several iterations of their plans for more episodes. In the end, none of these resulted in more episodes of 1883.\r\nThe show was initially presented as a limited series. In February 2022, Paramount announced that \"additional episodes\" would follow the first season. It was later announced that in place of a second season, the series would be succeeded by the sequel show 1932, later renamed 1923. Sheridan considers 1883 to be \"a 10-hour movie with an ending\", equivalent to a limited series.\r\nIn May 2022, Paramount revealed that the previously announced Sheridan-helmed series Bass Reeves would be a spinoff series to 1883, called 1883: The Bass Reeves Story. This longer title was later dropped.\r\nYellowstone crossovers\r\nTo introduce the new series 1883 to Yellowstone viewers, Tim McGraw and Faith Hill appeared as James and Margaret Dutton in flashback scenes during the fourth season of Yellowstone to show what life was like on the Dutton ranch in 1893, ten years after the Dutton family arrival in Montana. In the first episode, \"Half the Money\", James Dutton and his preteen sons John and Spencer, portrayed respectively by actors Jack Michael Doke and Charlie Stover, encountered starving Native Americans who had left the local reservation to bury their father on their former land that had since become a part of the Dutton Ranch. In the eighth episode No Kindness for the Coward, Margaret Dutton and her sons John and Spencer are sitting at the dinner table in their ranch homestead waiting for her husband and their father to return from a dangerous manhunt of horse thieves who plague their territory. These Yellowstone episodes aired prior to release of 1883 on Paramount+.\r\n1923 crossovers\r\nA month before the premiere of 1923 in December 2022, Paramount+ released a trailer in which Elsa, voiced by Isabel May, served as the narrator. May also narrated the first episode and informed the audience about the intervening 30 years in the saga of the Duttons between 1893 (the time of flashback scenes on Yellowstone) and the start of series of 1923. Actor LaMonica Garrett served as host in the Paramount+ behind the scenes documentary 1923: Inside The Series.\r\nProduction\r\nDevelopment\r\nIn February 2021, Taylor Sheridan signed a five-year deal with ViacomCBS and MTV Entertainment Group following the success of Yellowstone. Under the deal, he would create new series for both studios. One of these was a prequel to Yellowstone, set to be broadcast on Paramount+, initially called Y: 1883. Sheridan said that he struggled with writer's block after selling the concept to Paramount+, but he managed to overcome it. While working on another series, Mayor of Kingstown, Sheridan noticed Isabel May auditioning for a role on that show. Focusing on the perspective of \"what would happen if someone like May left polite society behind\" Sheridan completed the 1883 pilot script in a week.\r\nCasting\r\nSheridan went on to make Paramount hire May, a relative unknown, before he was even finished writing the script, because \"it won't work if we don't get her.\" As he explained in a December 2022 interview; \"When you find talents like Isabel, you just want to work with them again, and again, and again, and again.\"\r\nOn August 4, 2021, it was announced that Tim McGraw, Faith Hill and Sam Elliott had joined the cast. A further announcement on August 21 confirmed Isabel May and announced that LaMonica Garrett had joined the cast. On September 10, December 6, and December 10, respectively, it was confirmed that Billy Bob Thornton, Graham Greene, and Tom Hanks had joined as guest stars.\r\nFilming\r\nFilming on the series started in August 2021 in Texas and concluded in Montana in January 2022.\r\nScenes that took place in urban centers were filmed in Dallas, Texas, Fort Worth, Texas and Granbury, Texas. Also, a new, permanent, Western town with 26 structures was built at the Yellowstone Film Ranch. Rural scenes were filmed at a variety of locations, primarily in Texas. The Dutton Ranch scenes were filmed at the real Chief Joseph Ranch in Darby, Montana; the massive home is also used for the series \"Yellowstone\".\r\nMany of the actors expressed discomfort at the cold temperatures while filming in Montana. Star Faith Hill deemed filming as \"the most physically and mentally challenging thing we have ever done.\" Star Sam Elliott also expressed that filming his scenes was difficult, but \"we're getting it onscreen, and in the end that's what matters. This is really going to be something special.\"\r\nIsabel May discussed Taylor Sheridan's quest for \"authenticity\" concerning no cosmetics nor shaving of underarm hair. In Town & Country, May emphasized, \"Taylor said from the very beginning, 'I want everything to be authentic.' I mean, women didn't start shaving until the 1920s. He really wanted that to be an aspect of the show, and so I was more than happy to oblige.\"\r\nMusic\r\nThe series's score was composed by Brian Tyler and Breton Vivian, both of whom worked on Yellowstone.\r\nRelease\r\nOn November 8, 2021, a first-look trailer for the series was released; a full trailer was released on December 3. The series made its TV premiere on December 25, 2021, on CMT. The first episode was run on Paramount Network, who ordered the show before they moved it to streaming on affiliated platform Paramount+ during its development, as part of promoting the show, like they did with Mayor of Kingstown. The series was released on Blu-ray and DVD under the title 1883: A Yellowstone Origin Story on August 30, 2022.\r\nReception\r\nReview aggregator Rotten Tomatoes reported an approval rating of 89% based on 27 reviews with an average score of 7.5/10. The website's critics consensus reads, \"1883 can feel too overdetermined to be a properly rough-hewn Western, but viewers will want to saddle up for Sam Elliott's commanding star turn.\" Metacritic gave the series a weighted average score of 69 out of 100 based on 12 critic reviews, indicating \"generally favorable reviews\".\r\nAccolades",
    "html": "<p>1883 is an American Western drama television miniseries created by Taylor Sheridan that premiered on December 19, 2021, on Paramount+. The series stars Tim McGraw, Faith Hill, Sam Elliott, Isabel May, LaMonica Garrett, Marc Rissmann, Audie Rick, Eric Nelsen, and James Landry Hébert. The story is chronologically the first of several prequels to Sheridan's Yellowstone and details how the Duttons came to own the land that would become the Yellowstone Ranch. It is the second installment produced in the Yellowstone franchise. The series consists of ten episodes and concluded on February 27, 2022.</p><br/><h3>Premise</h3><p>The series follows the post-Civil war generation of the Dutton family as they leave Tennessee, journey to Fort Worth, Texas, and join a wagon train undertaking the arduous journey west to Oregon, before settling in Montana to establish what would eventually become the Yellowstone Ranch.</p><br/><h3>Cast and characters</h3><h4>Main</h4><ul><li>Sam Elliott as Shea Brennan, an employee of the Pinkerton Agency leading the expedition. Brennan is a former captain who served in the Union Army during the American Civil War. His wife Helen and daughter both die of smallpox right before the start of the expedition. While mourning their deaths, he cremated them by setting fire to their house and contemplated suicide, but was interrupted by the arrival of Thomas. Brennan acts as the rugged and commanding leader of the wagon train, frequently reminding members of the danger and tragedy that they will face along the way.</li><li>Tim McGraw as James Dillard Dutton. From Tennessee, he was a captain in the Confederate States Army during the Civil War and was wounded during the Battle of Antietam and captured. He was held in a Union prisoner-of-war camp for three years. A skilled leader and combatant, he joins the wagon train with his family after meeting Brennan and Thomas in Fort Worth, Texas.</li><li>Faith Hill as Margaret Dutton, John Dutton III's great-grandmother and the matriarch of the family. She travels via train from Tennessee with her children, sister-in-law, Claire, and niece, Mary Abel, to Fort Worth to begin a new journey with her husband, James.</li><li>Isabel May as Elsa Dutton, James and Margaret Dutton's resourceful 17-year-old daughter. Much of the story is told in her voice as an inner narrative. Young, undisciplined and innocent, she looks forward to the expedition as a great adventure. Elsa becomes hardened during the difficult journey west, also becoming enamored with a cowboy and later a Comanche warrior; much to the dismay of her parents. However, she also becomes a skilled survivalist and cowgirl.</li><li>LaMonica Garrett as Thomas, a Pinkerton agent and veteran U.S. Army sergeant from a Buffalo Soldier regiment. He teams up with Shea Brennan to help guide the group. His arrival helps dissuade Shea from suicide. Thomas is a skilled frontiersman, and later begins a relationship with Noemi, the Romani widow.</li><li>Marc Rissmann as Josef, a German immigrant who is married to Risa and worked as a carpenter before travelling to America. He aids the expedition serving as an interpreter for his group and as a liaison between the Americans and immigrants.</li><li>Audie Rick as John Dutton Sr., John Dutton III's grandfather, as a young boy. He is the younger child of James and Margaret and is five years old at the beginning of the journey.</li><li>Eric Nelsen as Ennis, a young cowboy who is paid to escort the group and tend to their cattle. He develops a relationship with Elsa.</li><li>James Landry Hébert as Wade, the lead cowboy.</li><li>Noah Le Gros as Colton, an experienced cowboy who joins the group at the Texas-side of the Red River.</li></ul><h4>Recurring</h4><ul><li>Alex Fine as Grady, an experienced cowboy and the leader of a crew of six drovers, who agrees to help an inexperienced crew round up longhorns for their long journey.</li><li>Gratiela Brancusi as Noemi, a Romani widow who recently lost her husband and has to raise two young boys on her own. She becomes dependent on and romantically interested in Thomas, seeing him as the man who will replace her late husband as a caretaker.</li><li>Anna Fiamora as Risa, a young immigrant woman who is married to Josef and joins the traveling camp to move west.</li><li>Amanda Jaros as Alina, a weary but hopeful immigrant woman who speaks little English but has much resolve.</li><li>Martin Sensmeier as Sam, a skilled Comanche warrior loyal to Quanah Parker, who later takes Elsa as his wife.</li><li>James Jordan as Cookie, a foul-mouthed wagon train cook whose poor decision leads to the group's confrontation with a band of vengeful Lakota.</li></ul><h4>Guest stars</h4><ul><li>Billy Bob Thornton as Marshal Jim Courtright.</li><li>Tom Hanks as General George Meade. In a flashback to the Battle of Antietam, he consoles James Dutton after many of his fellow soldiers are killed, before the latter gets taken captive. Hanks' wife, Rita Wilson, plays Carolyn the storekeeper.</li><li>Graham Greene as Spotted Eagle, a Crow elder who tries to help Elsa and who also points James to Paradise Valley, the final destination for the Dutton family.</li><li>Dawn Olivieri as Claire Dutton, James Dutton's widowed sister who joins him and his family on a trip to find a new home. She is intense and stern in manner, like her daughter. She dies by suicide after losing her only surviving child, Mary Abel. She had six children before, all of whom died young.</li><li>Emma Malouff as Mary Abel Dutton, Claire's daughter. A prim and proper young woman, she shows disdain and no sympathy for her cousin Elsa for her less traditional values. During an attack by unwelcome intruders, Mary Abel is caught in the crossfire and dies from a bullet wound.</li><li>Rita Wilson as Carolyn, a kindly storekeeper at Doan's Crossing, at the border of Texas and Oklahoma. She befriends Margaret when the latter visits her store and they drink whiskey together. Wilson's husband, Tom Hanks, plays General Meade.</li><li>Taylor Sheridan as Charles \"Charlie\" Goodnight, a rancher who hunts cattle thieves.</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#363728;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#363728\">Title</th><th scope=\"col\" style=\"background:#363728\">Directed by</th><th scope=\"col\" style=\"background:#363728\">Written by</th><th scope=\"col\" style=\"background:#363728\">Original release date <span style=\"background-color:white;padding:1px;display:inline-block;line-height:50%\"></span></th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"1883\"</td><td style=\"text-align:center\"><span>Taylor Sheridan</span></td><td style=\"text-align:center\">Taylor Sheridan</td><td style=\"text-align:center\">December 19, 2021</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #363728\">In a <span>flashforward</span>, Elsa Dutton watches in late 1883 as a group of <span>pioneers</span> are slaughtered by a band of <span>Native Americans</span> on the <span>Great Plains</span>. She kills one, before being surrounded. Months earlier, former <span>Union Army</span> captain Shea Brennan cremates his wife and daughter after they die of <span>smallpox</span>. His partner Thomas arrives and prevents him from committing suicide when he informs him of a <span>Pinkerton</span> job in <span>Fort Worth, Texas</span>. Shea and Thomas depart for Fort Worth and observe James Dutton kill thieves who attempt to rob his <span>covered wagon</span>. Meanwhile, James' family (his wife, Margaret; 17-year-old daughter, Elsa; 5-year-old son, John; his sister, Claire; and Claire's teenage daughter, Mary Abel) travels to Fort Worth from <span>Tennessee</span> via train. James continues to encounter antagonistic criminals in town, while Shea and Thomas meet with a group of inexperienced <span>German</span> and <span>Slavic</span> immigrants who pay them for an escort to <span>Oregon</span>. After the Duttons arrive, the family stays at a hotel, and a drunken man enters Elsa's room and attempts to rape her before being killed by James. Realizing a partnership would be advantageous, Shea convinces James to accompany the <span>wagon train</span> to Oregon.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Behind Us, a Cliff\"</td><td style=\"text-align:center\"><span>Ben Richardson</span></td><td style=\"text-align:center\">Taylor Sheridan</td><td style=\"text-align:center\">December 19, 2021</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #363728\">In a <span>flashback</span> to 1862, James is comforted by General <span>George Meade</span> following the <span>Confederate</span> loss at the <span>Battle of Antietam</span>. In the present, Shea, James, and Thomas prepare for the journey west. Shea hires two <span>cowboys</span>, Wade and Ennis, to help catch and escort <span>feral cattle</span>. As the wagon train departs, tensions rise between the Americans and the immigrants, as interpreter Josef struggles to keep his group in line with Shea's perceived harsh decisions. A group of riders approach the wagon train, resulting in a confrontation caused by Claire throwing rocks at the leader. A shootout ensues, leaving Mary Abel and some immigrants dead. Shea, Thomas, James, and Josef team up with <span>Jim Courtright</span> to track down the killers to a crowded saloon. Claire commits suicide and the group continues west.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"River\"</td><td style=\"text-align:center\">Christina Alexandra Voros</td><td style=\"text-align:center\">Taylor Sheridan</td><td style=\"text-align:center\">December 26, 2021</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #363728\">The inexperienced immigrants find themselves at the nature's mercy; namely <span>dysentery</span> and fatal <span>rattlesnake</span> bites. Approaching the <span>Brazos River</span>, Shea and James disagree on how to best cross; Shea opts for caution while James wants to cross quickly. Shea learns two of the immigrants have been stealing food and forces them out of the group. Shea rebuffs the advances of a newly-widowed <span>Romani</span> woman named Noemi. Elsa begins assisting the cowboys with the cattle and begins a flirtatious relationship with Ennis. A frustrated immigrant challenges and fails to overcome Shea. James takes John hunting and gives Ennis permission to <span>court</span> Elsa.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Crossing\"</td><td style=\"text-align:center\">Christina Alexandra Voros</td><td style=\"text-align:center\">Taylor Sheridan</td><td style=\"text-align:center\">January 9, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #363728\">Elsa embraces the <span class=\"mw-redirect\">cowgirl</span> lifestyle and becomes smitten with Ennis. Thomas offers Noemi help and protection, but refuses her offer of marriage. James and his family opt to cross the river during the night and attempt to help the immigrants cross the following day. However, the crossing proves fatal for several of the immigrants who lack swimming experience. Once across, the group continues west.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Fangs of Freedom\"</td><td style=\"text-align:center\">Christina Alexandra Voros</td><td style=\"text-align:center\">Taylor Sheridan</td><td style=\"text-align:center\">January 16, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #363728\">With supplies short after a food wagon is lost in the river crossing, Josef reveals that a thief is hoarding the settlers' remaining stores. Shea, Thomas and James confront the thieves, take back the supplies, and banish them from the group. Wade informs Shea and Thomas that bandits are active in the region. Elsa and Ennis grow closer and the pair have sex, which Margaret witnesses from afar. Elsa receives harsh words from her mother about her decisions, and James confronts Ennis, who proclaims his love for Elsa. Meanwhile, a group of bandits ambush and kills the banished settlers, and the remaining settler group prepare for a fight. In the ensuing battle, Elsa is saved by Ennis, who in turn is shot and dies. Elsa kills Ennis' shooter.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Boring the Devil\"</td><td style=\"text-align:center\">Ben Richardson</td><td style=\"text-align:center\">Taylor Sheridan</td><td style=\"text-align:center\">January 30, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #363728\">Shea attempts to sympathize with the mourning Elsa. The group stop at <span class=\"mw-redirect\">Doan's Crossing</span>, on the border of <span>Indian Territory</span>. There, Shea employs Colton, a cowboy to replace Ennis, and Cookie, a camp cook. Thomas buys a mirror for Noemi, who professes that she loves him and his gift means he loves her back. Elsa confronts a pair of <span class=\"mw-redirect\">catcalling</span> men and turns her gun on them, causing a standoff which James defuses. Margaret gets drunk with Carolyn, a local shopkeeper, and argues with James about how the journey is changing Elsa.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Lightning Yellow Hair\"</td><td style=\"text-align:center\">Christina Alexandra Voros</td><td style=\"text-align:center\">Taylor Sheridan</td><td style=\"text-align:center\">February 6, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #363728\">In <span>Comancheria</span>, the settlers pay a tax to the <span>Comanche</span> to cross their land. One of the Comanche introduces himself to Elsa as Sam, a name he took from the man who killed his wife. The two race their horses; Elsa wins and Sam nicknames her \"Lightning With The Yellow Hair\". A storm approaches and <span>tornadoes</span> threaten the group; Sam and Elsa take shelter together and embrace. The tornado devastates the group's wagons and scatters their livestock. The cattle are spotted with a group of <span>rustlers</span>, so Shea, Thomas, James and Elsa confront them. Separated from her father, Elsa is attacked by the rustlers until Sam and his partner save her. The rustlers are killed with assistance from <span>cattleman</span> <span>Charles Goodnight</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Weep of Surrender\"</td><td style=\"text-align:center\">Ben Richardson</td><td style=\"text-align:center\">Taylor Sheridan</td><td style=\"text-align:center\">February 13, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #363728\">With most of the settlers' wagons destroyed and their supplies dangerously low, Shea recommends they cut short their journey and find land to settle near <span class=\"mw-redirect\">Denver, Colorado</span>. James insists to Shea that he will continue on to Oregon, and openly challenges Shea's leadership, inviting the remaining settlers to follow him onto the <span>Oregon Trail</span>. Meanwhile, Elsa bonds with Sam; she kills a <span>bison</span> and is introduced to Comanche culture. They declare their love for each other, and decide to marry. Though Margaret expresses her growing concern for her daughter, Elsa remains defiant. She announces she will escort her family to Oregon, then ride back to Comanche territory to be with Sam. The betrothed pair part as the wagon train continues west.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Racing Clouds\"</td><td style=\"text-align:center\">Ben Richardson</td><td style=\"text-align:center\">Taylor Sheridan</td><td style=\"text-align:center\">February 20, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #363728\">In <span>Lakota</span> territory, the dwindling group is beset by further tragedy when Josef is bitten by a rattlesnake and his wife is thrown from her horse, leaving her comatose and eventually proves fatal. Shea, Thomas and James come across a group of murdered Lakota women and children. Realizing they will be blamed for the massacre and hunted by Lakota warriors, they attempt to track and capture the culprits, while the remainder of the group are told to stay and explain the situation to any returning Lakota. However, at Cookie's insistence, many of the settlers choose instead to flee to a nearby U.S. Army fort, leaving Elsa and Margaret behind. Shea, Thomas and James find and kill the culprits, members of the <span>Wyoming Stock Growers Association</span>. The scattered settlers are attacked and many are killed by the Lakota. Elsa shoots a Lakota warrior, who in turn fires an arrow into her torso. After Elsa defuses the fight by speaking a few words taught to her by Sam, the Lakota leave. Colton is forced to kill a crazed, partially-<span class=\"mw-redirect\">scalped</span> arrow-impaled Alina. Elsa receives rudimentary treatment for her wound. James quietly tells Margaret that Elsa is going to die.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"This Is Not Your Heaven\"</td><td style=\"text-align:center\">Ben Richardson</td><td style=\"text-align:center\">Taylor Sheridan</td><td style=\"text-align:center\">February 27, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #363728\">The wagon train arrives at <span>Fort Caspar</span> in the <span>Wyoming Territory</span> to find it in possession of <span class=\"mw-redirect\">Joseph Maull Carey</span>, the leader of the Wyoming Stock Growers Association. There is no surgeon to help Elsa, though a doctor confirms her wound is life-threatening and advises taking her to <span class=\"mw-redirect\">Fort Laramie</span>. Meanwhile, Josef's leg turns <span class=\"mw-redirect\">gangrenous</span> and it is <span class=\"mw-redirect\">amputated</span> by James, Shea and Thomas. Later, Elsa is treated by a local <span>Crow</span> tribe. Elsa realizes she is going to die, and asks to choose her burial spot. The Crow leader recommends <span>a valley called 'Paradise'</span> in the <span>Montana Territory</span> for the Duttons to settle, but promises that his people will reclaim the land in seven generations. Forced to leave his wife and son behind to find the spot before Elsa succumbs to her wound, James and Elsa ride to Paradise. Beneath a tree, Elsa dies in her father's arms. A year later, Shea arrives at the Pacific Ocean; his promise to his late-wife fulfilled, he shoots himself on the beach. Josef, alone and on crutches, begins building his home; Thomas and Noemi arrive in Oregon where they find a location near a river to build their home.</td></tr></tbody></table><br/><h3>Crossovers and sequels</h3><p>Paramount has communicated several iterations of their plans for more episodes. In the end, none of these resulted in more episodes of 1883.</p><p>The show was initially presented as a limited series. In February 2022, Paramount announced that \"additional episodes\" would follow the first season. It was later announced that in place of a second season, the series would be succeeded by the sequel show 1932, later renamed 1923. Sheridan considers 1883 to be \"a 10-hour movie with an ending\", equivalent to a limited series.</p><p>In May 2022, Paramount revealed that the previously announced Sheridan-helmed series Bass Reeves would be a spinoff series to 1883, called 1883: The Bass Reeves Story. This longer title was later dropped.</p><h4>Yellowstone crossovers</h4><p>To introduce the new series 1883 to Yellowstone viewers, Tim McGraw and Faith Hill appeared as James and Margaret Dutton in flashback scenes during the fourth season of Yellowstone to show what life was like on the Dutton ranch in 1893, ten years after the Dutton family arrival in Montana. In the first episode, \"Half the Money\", James Dutton and his preteen sons John and Spencer, portrayed respectively by actors Jack Michael Doke and Charlie Stover, encountered starving Native Americans who had left the local reservation to bury their father on their former land that had since become a part of the Dutton Ranch. In the eighth episode No Kindness for the Coward, Margaret Dutton and her sons John and Spencer are sitting at the dinner table in their ranch homestead waiting for her husband and their father to return from a dangerous manhunt of horse thieves who plague their territory. These Yellowstone episodes aired prior to release of 1883 on Paramount+.</p><h4>1923 crossovers</h4><p>A month before the premiere of 1923 in December 2022, Paramount+ released a trailer in which Elsa, voiced by Isabel May, served as the narrator. May also narrated the first episode and informed the audience about the intervening 30 years in the saga of the Duttons between 1893 (the time of flashback scenes on Yellowstone) and the start of series of 1923. Actor LaMonica Garrett served as host in the Paramount+ behind the scenes documentary 1923: Inside The Series.</p><br/><h3>Production</h3><h4>Development</h4><p>In February 2021, Taylor Sheridan signed a five-year deal with ViacomCBS and MTV Entertainment Group following the success of Yellowstone. Under the deal, he would create new series for both studios. One of these was a prequel to Yellowstone, set to be broadcast on Paramount+, initially called Y: 1883. Sheridan said that he struggled with writer's block after selling the concept to Paramount+, but he managed to overcome it. While working on another series, Mayor of Kingstown, Sheridan noticed Isabel May auditioning for a role on that show. Focusing on the perspective of \"what would happen if someone like May left polite society behind\" Sheridan completed the 1883 pilot script in a week.</p><h4>Casting</h4><p>Sheridan went on to make Paramount hire May, a relative unknown, before he was even finished writing the script, because \"it won't work if we don't get her.\" As he explained in a December 2022 interview; \"When you find talents like Isabel, you just want to work with them again, and again, and again, and again.\"</p><p>On August 4, 2021, it was announced that Tim McGraw, Faith Hill and Sam Elliott had joined the cast. A further announcement on August 21 confirmed Isabel May and announced that LaMonica Garrett had joined the cast. On September 10, December 6, and December 10, respectively, it was confirmed that Billy Bob Thornton, Graham Greene, and Tom Hanks had joined as guest stars.</p><h4>Filming</h4><p>Filming on the series started in August 2021 in Texas and concluded in Montana in January 2022.</p><p>Scenes that took place in urban centers were filmed in Dallas, Texas, Fort Worth, Texas and Granbury, Texas. Also, a new, permanent, Western town with 26 structures was built at the Yellowstone Film Ranch. Rural scenes were filmed at a variety of locations, primarily in Texas. The Dutton Ranch scenes were filmed at the real Chief Joseph Ranch in Darby, Montana; the massive home is also used for the series \"Yellowstone\".</p><p>Many of the actors expressed discomfort at the cold temperatures while filming in Montana. Star Faith Hill deemed filming as \"the most physically and mentally challenging thing we have ever done.\" Star Sam Elliott also expressed that filming his scenes was difficult, but \"we're getting it onscreen, and in the end that's what matters. This is really going to be something special.\"</p><p>Isabel May discussed Taylor Sheridan's quest for \"authenticity\" concerning no cosmetics nor shaving of underarm hair. In Town & Country, May emphasized, \"Taylor said from the very beginning, 'I want everything to be authentic.' I mean, women didn't start shaving until the 1920s. He really wanted that to be an aspect of the show, and so I was more than happy to oblige.\"</p><h4>Music</h4><p>The series's score was composed by Brian Tyler and Breton Vivian, both of whom worked on Yellowstone.</p><br/><h3>Release</h3><p>On November 8, 2021, a first-look trailer for the series was released; a full trailer was released on December 3. The series made its TV premiere on December 25, 2021, on CMT. The first episode was run on Paramount Network, who ordered the show before they moved it to streaming on affiliated platform Paramount+ during its development, as part of promoting the show, like they did with Mayor of Kingstown. The series was released on Blu-ray and DVD under the title 1883: A Yellowstone Origin Story on August 30, 2022.</p><br/><h3>Reception</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>needs expansion</b>. You can help by <span class=\"external text\">adding to it</span>.  <span class=\"date-container\"><i>(<span class=\"date\">June 2022</span>)</i></span></div></td></tr></tbody></table><p>Review aggregator Rotten Tomatoes reported an approval rating of 89% based on 27 reviews with an average score of 7.5/10. The website's critics consensus reads, \"1883 can feel too overdetermined to be a properly rough-hewn Western, but viewers will want to saddle up for Sam Elliott's commanding star turn.\" Metacritic gave the series a weighted average score of 69 out of 100 based on 12 critic reviews, indicating \"generally favorable reviews\".</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Year</th><th scope=\"col\">Award</th><th scope=\"col\">Category</th><th scope=\"col\">Nominee(s)</th><th scope=\"col\">Result</th><th scope=\"col\" class=\"unsortable\"><abbr title=\"Reference(s)\">Ref.</abbr></th></tr><tr><td rowspan=\"3\"><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">2022</div></td><td rowspan=\"3\"><span>Primetime Emmy Awards</span></td><td rowspan=\"2\"><span>Outstanding Cinematography for a Limited or Anthology Series or Movie</span></td><td>Ben Richardson <span style=\"font-size:85%;\">(for \"1883\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\" rowspan=\"3\"></td></tr><tr><td>Christina Alexandra Voros <span style=\"font-size:85%;\">(for \"Lightning Yellow Hair\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Music Composition for a Limited or Anthology Series, Movie or Special (Original Dramatic Score)</span></td><td><span>Brian Tyler</span> and Breton Vivian <span style=\"font-size:85%;\">(for \"1883\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>2023</td><td><span>Screen Actors Guild Awards</span></td><td><span>Outstanding Performance by a Male Actor in a Miniseries or Television Movie</span></td><td><span>Sam Elliott</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}