{
  "imDbId": "tt9432978",
  "title": "Kota Factory",
  "fullTitle": "Kota Factory (TV Series 2019–2021)",
  "type": "TVSeries",
  "year": "2019",
  "items": [
    {
      "username": "saatvikshah",
      "userUrl": "https://www.imdb.com/user/ur64513156",
      "reviewLink": "https://www.imdb.com/review/rw4832817",
      "warningSpoilers": false,
      "date": "6 May 2019",
      "rate": "10",
      "helpful": "79 out of 86 found this helpful.",
      "title": "They never disappoint, do they?",
      "content": "I know i might be exaggerating a bit or i might I be over-reacting a bit .. But this is getting out of hand.. How the hell are these TVF writers not getting proper recognition for their work... This is simply outstanding work from them.. Series after series they are producing gems which we as human beings can only just applaud to.. Starting from pitchers, permanent roommates,tripling, yeh meri Family, immature and then KOTA FACTORY.. I know everyone is telling that tvf is trying to give stiff competition to amazon & netflix but i think it's vice versa.. Amazon & netflix are trying to give stiff competition to tvf....They may not have the resources to show mammoth battles or big fat Indian weddings but they certainly have the writing prowess to make you cry, laugh,be sad, happy,nostalgic all at the same time."
    },
    {
      "username": "samyaksambuddha",
      "userUrl": "https://www.imdb.com/user/ur85477871",
      "reviewLink": "https://www.imdb.com/review/rw4951437",
      "warningSpoilers": false,
      "date": "22 June 2019",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Bollywood needs to learn from this",
      "content": "Unique idea of black and white cinematography along with brilliant direction deserves nothing less than 10 stars. This is more than struggles faced in the quest for success. This is something that everyone watch and different things can be learned from it. With a well aligned story this series offers us entertainment as well as education. Wonderful actors like Jitendra add wonders to the already well written script. Bollywood and senile directors like Karan Johar, Ekta Kapoor come and watch this offer us something better."
    },
    {
      "username": "mrroohaan",
      "userUrl": "https://www.imdb.com/user/ur59324857",
      "reviewLink": "https://www.imdb.com/review/rw4786510",
      "warningSpoilers": false,
      "date": "17 April 2019",
      "rate": "10",
      "helpful": "36 out of 43 found this helpful.",
      "title": "Phenomenal",
      "content": "Some series are much more than just times and stories they are about lives. It is that. Untold stories told with such rawness makes it more than anything tvf has ever produced. Script, acting , direction, cinematography, music everything just adds to the flavour of Kota. Brilliant. Touched my heart. Thank you making it."
    },
    {
      "username": "sudeepchatterjee",
      "userUrl": "https://www.imdb.com/user/ur65301891",
      "reviewLink": "https://www.imdb.com/review/rw4818019",
      "warningSpoilers": false,
      "date": "30 April 2019",
      "rate": "10",
      "helpful": "36 out of 47 found this helpful.",
      "title": "Authentic, Well made and Heart Touching",
      "content": "TVF has been doing the work which needed to be done by mainstream film industry. Content creation is not just a business, it involves love for the filmmaking medium and passion for storytelling. I am happy that real and impactful subjects are coming in web. Kota factory is well made, well acted and primarily tells the story of students who are stuck for two years in Kota's coaching town in hope to crack IIT exams. This rat race for engineering has ruined lives of thousands of students and this madness still is on. Hopefully people can connect to this amazing show and we can watch mainstream movies from TVF soon."
    },
    {
      "username": "kundannegi",
      "userUrl": "https://www.imdb.com/user/ur85895914",
      "reviewLink": "https://www.imdb.com/review/rw4785029",
      "warningSpoilers": false,
      "date": "16 April 2019",
      "rate": "10",
      "helpful": "97 out of 107 found this helpful.",
      "title": "TVF ALWAYS SERVES YOU MORE THAN YOUR EXPECTATION...",
      "content": "Every single minute of the premiere episode was well directed and each member of tvf team., Thank you guys for making such wonderful series ."
    },
    {
      "username": "talktoashish",
      "userUrl": "https://www.imdb.com/user/ur9433544",
      "reviewLink": "https://www.imdb.com/review/rw7406721",
      "warningSpoilers": false,
      "date": "3 October 2021",
      "rate": "7",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Watch first season",
      "content": "Season 1 - 8/10 Season 2 - 5/10Pretty much what others have said. Enjoy first season. Skip second."
    },
    {
      "username": "vineetmall",
      "userUrl": "https://www.imdb.com/user/ur79116277",
      "reviewLink": "https://www.imdb.com/review/rw4785876",
      "warningSpoilers": false,
      "date": "17 April 2019",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Fun with Reality of Kota",
      "content": "TVF guys are presenting a harsh truth about Kota with fun N comedy !! Thanks you TVF for this."
    },
    {
      "username": "luckyrocks610",
      "userUrl": "https://www.imdb.com/user/ur51702318",
      "reviewLink": "https://www.imdb.com/review/rw4791686",
      "warningSpoilers": false,
      "date": "20 April 2019",
      "rate": "10",
      "helpful": "12 out of 16 found this helpful.",
      "title": "Surreal TVF, Back again.",
      "content": "This show hits you at the right spot, even though i never allowed myself to be consumed by these coaching notions, I always felt bad for these Average low confidence socially isolated classmates who came as a failure from Kota."
    },
    {
      "username": "garvit-juet",
      "userUrl": "https://www.imdb.com/user/ur32369009",
      "reviewLink": "https://www.imdb.com/review/rw4785468",
      "warningSpoilers": false,
      "date": "16 April 2019",
      "rate": "10",
      "helpful": "55 out of 64 found this helpful.",
      "title": "Amazing.The Best Series from TVF yet.",
      "content": "Whenever anybody would blame about the lack of quality content in India (I include myself too), they are given subtle reminders in the form of some of the most amazing shows. The irony to the same and complain about content, however, is the fact that there is a barrage of shows and films that either go unnoticed or just don't click with many viewers.TVF (The Viral Fever) is one of the flag-bearers of making the digital scenario the massive juggernaut it is today. Responsible for Pitchers and Permanent Roommates, the channel has now presented another show in the form of Kota Factory."
    },
    {
      "username": "nabeelrockstar",
      "userUrl": "https://www.imdb.com/user/ur81855076",
      "reviewLink": "https://www.imdb.com/review/rw4786348",
      "warningSpoilers": false,
      "date": "17 April 2019",
      "rate": "10",
      "helpful": "19 out of 24 found this helpful.",
      "title": "TVF's best since Pitchers",
      "content": "Everything about this show is great. Whether it be acting, screenplay, direction or dialogues. It uses brilliant and striking black and white cinematography to express the loneliness, darkness a student has to go through in claustrophobic kota. Kudos to TVF for this great show. This is a must see."
    },
    {
      "username": "cs_rahul_kumar",
      "userUrl": "https://www.imdb.com/user/ur104563194",
      "reviewLink": "https://www.imdb.com/review/rw7384342",
      "warningSpoilers": false,
      "date": "27 September 2021",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Jeetendra Kumar And Mayur More Shine In This Must-Watch Sequel About IITians' Challenges !!!",
      "content": "The second instalment picks up from where its debut season had left off, with Vaibhav Pandey (Mayur More) switching from Prodigy Coaching Class to Maheshwari Coaching Class, as the latter is a better institution when it comes to IIT coaching. The story revolves around Vaibhav's, his friends', and classmates' mental anguish as they prepare for the IIT entrance exams. Will they give up or will they triumph in the most important struggle of their lives ?Created by Saurabh Khanna and Arunabh Kumar and written by Abhishek Yadav, 'Kota Factory' is set in the ultra-competitive student ecosystem of Rajasthan's Kota, a place where vulnerability and trauma abound for students preparing for the Indian Institute of Technology (IIT). This sequel, too, is one-of-a-kind, thanks to its spot-on humour and relatable existential struggle experienced by the protagonist.The first season of 'Kota Factory' follows Vaibhav Pandey, a teenager who enrolls in a coaching institute that prepares students for the IIT entrance exam. His friends and competitors, Balmukund aka Meena (Ranjan Raj) and Uday (Alam Khan), gradually assist him in adjusting to this high level of academic pressure. However, near the end of the season, Vaibhav clears Maheshwari's admission entrance exam and is torn between his heart and mind about whether or not to enroll in the best coaching center in town, which has a high success rate. The second season, on the other hand, picks up right where the first had left off, chronicling the protagonist's trials and tribulations, particularly after he has to adjust to a new learning culture in Maheshwari after leaving his friends and love interest Vartika (Revathi Pillai) behind. Will he be able to persist in the face of such adversity, or will he succumb to the pressure? That is the question that the creators are attempting to answer.Directed by Raghav Subbu, this five-part 'black and white' series highlights the issues that IIT-JEE aspirants face in their day-to-day lives. It gets viewers emotionally invested in the students' journey and the guidance of their one and only physics teacher, Jeetu Bhaiya (Jeetendra Kumar), who serves as a modern-day Dronacharya for them. The narrative eloquently depicts a wide range of emotions, including optimism, angst, love, companionship, and even doubting one's own life choices-whether they truly want to follow the course that appears to be carved out for them, or if they can forge their own path. Briefly, the narrative does emphasise the importance of family support as well as the difficulties faced by youngsters who are unable to cope with the competitive pressure. However, the creators should have paid a little more attention to the delicate aspect of students contemplating quitting in order to give the plot a larger perspective.Overall, the series stands out by providing high-octane emotional scenarios that are complemented by a well-crafted background score. Additionally, meaningful songs like Amit Trivedi's 'Main Lad Lunga' provide depth to the character's emotional agony. Without being too dark to watch, the close-up shots convey a sense of the claustrophobic environment as seen through the eyes of students.Similar to the previous season, Jitendra Kumar plays a pivotal role in the show. As teacher, mentor and supervisor, Jeetu Bhaiya is the only one who understands the students' problems and encourages them to confront them. Even his motivational talks, such as \"don't dream, always aim; since dreams are imagined and aims are to be achieved,\" leave an impression.Mayur More plays Vaibhav to perfection. His character is primarily shown overcoming the challenges of fierce competition, which is exacerbated by his own shortcomings. Mayur shares great on-screen chemistry with his friends Meena and Uday, who are played by Ranjan Raj and Alam Khan, respectively. While everyone's performances are consistent, Raj's character, Meena, steals the show once again, especially when he is dealing with his adolescent hormones. His innocent one-liners infuse the show with the required humour.Ahsaas Channa, as the medical student Shivangi Ranawat, has a significant role in this season, assisting and serving as a support system for the group of students. Vartika, played by Revathi Pillai, has a minor role, but her on-screen chemistry with Vaibhav is endearing enough for audiences to remember.Like its predecessor, this season of 'Kota Factory' perfectly captures the students' vulnerability while also highlighting the burgeoning coaching industry, which views its students' victories as a marketing campaign for their institutes. Overall, the production is highly motivating, with a compelling story and outstanding performances that make this satire a must-watch."
    },
    {
      "username": "nairtejas",
      "userUrl": "https://www.imdb.com/user/ur34967775",
      "reviewLink": "https://www.imdb.com/review/rw5930273",
      "warningSpoilers": false,
      "date": "24 July 2020",
      "rate": "7",
      "helpful": "8 out of 11 found this helpful.",
      "title": "An Excellent Social Drama / 7 Stars",
      "content": "An excellent take on the competitive world of post-school education and coaching in India, Kota Factory nails every single aspect of being a 10th passout looking to enter an IIT. But what makes the 5-episode mini series a worthwhile watch is not the description of the life of such a student but the the freshness and partial didactic approach that aims to educate the viewer about the real goal. A must-watch for both students and parents. TN.(Watched for free on YouTube.)"
    },
    {
      "username": "Puroo",
      "userUrl": "https://www.imdb.com/user/ur120321993",
      "reviewLink": "https://www.imdb.com/review/rw7113524",
      "warningSpoilers": false,
      "date": "11 July 2021",
      "rate": "8",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Parents could be wrong, but their intention can never be wrong",
      "content": "I was in the middle of binge-watching all the web series on TVF Play when this came (I prefer calling shows like this web series and the ones on Netflix and Prime TV-shows). I was trying my best to finish Pitchers so that I could move on to this. I had seen too many memes and saw all my friends sharing the stories on WhatsApp about them watching the last episode. So finally when I got the chance to watch this, I did it immediately. Kota Factory is probably the best web series that TVF has made so far, and that's saying something provided Yeh Meri Family also exists.Kota Factory is a story set in Kota, where a number of students come every year to study for JEE Advanced. Everyone comes over there only with the hopes that they are going to become an IITian one day. As someone who also wanted to visit this city during my 11th class, I can very well understand what it feels like to be there. In the scene where Vaibhav is caught cheating from a book and Jeetu Bhaiya scolds him, I actually felt it right through my heart. I got an AIR 173 and got to DTU, so you can understand how much I had to struggle to get where I am, and hearing the things he said reminded me of my own days at the coaching centre.There are so many things that feel really relatable in this web series. The way Vaibhav adjusts to the PG life, the entire character of Meena, the teachers at the coaching centre and how they try to look as enthusiastic as possible to keep the students engaged; it's all just like how we get to see people in 11th and 12th class. My school was one of the biggest schools of India, so students from all over the country used to come to study with us. When I look at Meena and Uday, it reminds me of them; the two kinds of students that used to be there.The only problem I had with this series is how it was made in black and white. There's no problem with making a black and white show, but in this series they just slapped a greyscale filter on this. There was no contrast, the camera quality was very bad and the certain areas that need to be given special application for greyscale effect was not done at all (if you've watched Logan: Noir or Zack Snyder's Justice League: Justice is Gray you'll know exactly what I'm talking about).Kota Factory is a social commentary that belongs to something I like to call the 'era-defining entertainment', something that people from the future can watch to understand what life was like in our times, and the fact that we actually wanted to change them. I use this term to define films and shows like Toilet: Ek Prem Katha, Zootopia, Watchmen etc. I really appreciate the fact that TVF Play is a free streaming service, so this masterpiece will be available to everyone without having to spend money."
    },
    {
      "username": "madhukar30",
      "userUrl": "https://www.imdb.com/user/ur18449099",
      "reviewLink": "https://www.imdb.com/review/rw5912839",
      "warningSpoilers": false,
      "date": "17 July 2020",
      "rate": "6",
      "helpful": "8 out of 11 found this helpful.",
      "title": "A peek into the geek world",
      "content": "Every year in India 700,000 of students prepare and compete for 5000 odd Spots at the prestigious IIT colleges. Kota factory on TVFplay is a show about a handful of students preparing for the premier entrance exams for those spots through the coaching centre's based in Kota, Rajasthan.Kota factory uncovers most of the problems faced by these students right from the politics behind admissions, placement of batches, living conditions, study materials, quality of teachers, internal politics of the coaching centres, Marketing techniques, teaching methods, freedom, campus fleecing, friendships, student lifestyle and tons of other problems faced by these poor kids.Acting of Jitendra Kumar as jeethu Bhaiya a swashbuckling teacher was outstanding. Most of student's acting were natural and good. The show is shot in black & white, which adds a contour on the dull lives of the students. Direction, editing and cinematography were decent and Songs were top notch. Shooting in the real location has really helped the outlook of the show. A chemistry rant by the lead, Vibhav in episode 3 was simply outstanding.The web series is a much watch for all the Lakhs of students and ex-students who studied in the hundreds of coaching centres in Kota and elsewhere. But it must be duly noted that all work and no play will make students dull and sorry to say that the students of Kota look dull. In my opinion, for a perusal of a better life, a lot of the parents don't hesitate to destroy their kid's lives. The failure and rejection would be too much for the young kids to handle. I wish the makers had brought this up too instead of marketing the Unacademy app in the series."
    },
    {
      "username": "mesingh",
      "userUrl": "https://www.imdb.com/user/ur94125965",
      "reviewLink": "https://www.imdb.com/review/rw4832794",
      "warningSpoilers": false,
      "date": "6 May 2019",
      "rate": "10",
      "helpful": "45 out of 52 found this helpful.",
      "title": "A black and white gem which shines the brightest",
      "content": "It's not hard to make a tv series especially on a topic that you have lived... It's like making or writing your own stories so it was not hard for tvf guys because they have lived the life themselves. But, it is not a web series like other. It is a study of the situation and not simply presenting the situation. How we feel, why we feel it, how does it impact our behaviour voluntarily or involuntary. Everything has a meaning including the black and white scheme of the series... Which describes a rather colourless and one dimensional life of a student who has been living with blinders. The while series is a study of all this behaviour.Thank you from bottom of my heart..."
    },
    {
      "username": "aayushsatwat",
      "userUrl": "https://www.imdb.com/user/ur67882396",
      "reviewLink": "https://www.imdb.com/review/rw4789967",
      "warningSpoilers": false,
      "date": "19 April 2019",
      "rate": "10",
      "helpful": "45 out of 54 found this helpful.",
      "title": "REEL feels like REAL.",
      "content": "Portrayal of reality at its best. Great script, acting and specially that b/w theme, although b/w but depicting the true atmosphere and backdrop of Kota. Striking hard from the first episode, looking forward for more."
    },
    {
      "username": "behappypragya",
      "userUrl": "https://www.imdb.com/user/ur125707399",
      "reviewLink": "https://www.imdb.com/review/rw7382592",
      "warningSpoilers": false,
      "date": "26 September 2021",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Awesome Jitu bhaiya",
      "content": "Just the best web series love all the cast specially is my favourite Jeetu I have seen all his series and this one is best but ending was heartbreaking what happened next with Jeetu that his student has committed suicide we want season 3 asap it was amazing music heart touching story Ahsaas a k a Shivangi was just straight forward Meena Meenal Vaibhav Revathi all nice job done.Meena toh jaan hai TVF (The Viral Fever) is one of the flag-bearers of making the digital scenario the massive juggernaut it is today. Responsible for Pitchers , bachelors, flames, aspirants ,cubicles and panchayat the channel has now presented another show in the form of Kota Factory."
    },
    {
      "username": "yashy1109",
      "userUrl": "https://www.imdb.com/user/ur82330968",
      "reviewLink": "https://www.imdb.com/review/rw7378205",
      "warningSpoilers": false,
      "date": "25 September 2021",
      "rate": "9",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Second Season Nahhh!!!!",
      "content": "First season was great but the second one finds its hard to even be called a GOOD.The second season was just the result of Netflix buying the show. Being an IIT Aspirant myself I find it very relatable but the second season did not work for me."
    },
    {
      "username": "aryansachdeva",
      "userUrl": "https://www.imdb.com/user/ur98233660",
      "reviewLink": "https://www.imdb.com/review/rw4785182",
      "warningSpoilers": false,
      "date": "16 April 2019",
      "rate": "10",
      "helpful": "49 out of 58 found this helpful.",
      "title": "Awesome",
      "content": "Excellent acting, beautifully written..describing reality and truth.."
    },
    {
      "username": "saurabhtaurus100592",
      "userUrl": "https://www.imdb.com/user/ur45701010",
      "reviewLink": "https://www.imdb.com/review/rw4787019",
      "warningSpoilers": false,
      "date": "17 April 2019",
      "rate": "10",
      "helpful": "36 out of 44 found this helpful.",
      "title": "11/10 For This Brilliant Web Series..",
      "content": "Tvf Tvf TvfBeauty again.Direction-Acting-Music-TopicEverything falling right in placeJeetu Bhaiya , Meena toh jaan hain.."
    },
    {
      "username": "thevipinsingh",
      "userUrl": "https://www.imdb.com/user/ur71089203",
      "reviewLink": "https://www.imdb.com/review/rw7376372",
      "warningSpoilers": false,
      "date": "24 September 2021",
      "rate": "9",
      "helpful": "4 out of 5 found this helpful.",
      "title": "The best TVF production ever",
      "content": "Although I like most of TVF originals but Kota Factory is my favourite ever.S1 impressed me quite much but it's S2 that shattered my expectations and made me fall for this creative series.The production quality of S2 was better S1 probably because of Netflix involvement however the sound editing, cinematography, and the direction is what make it a masterpiece.The tone of S2 was darker than its previous season. And it sets even a high bar for S3."
    },
    {
      "username": "prathameshpatole",
      "userUrl": "https://www.imdb.com/user/ur101684001",
      "reviewLink": "https://www.imdb.com/review/rw4786390",
      "warningSpoilers": false,
      "date": "17 April 2019",
      "rate": "10",
      "helpful": "16 out of 22 found this helpful.",
      "title": "Inspirational vibes all over from first episode.",
      "content": "Jeetu rocks as always. Apart from acting of main character, everything is awesome. Reality is shown in best possible way and TVF knows how to play its cards right. May be my personal favourite, I can tell by watching the first episode, after pitchers."
    },
    {
      "username": "Greyrat17",
      "userUrl": "https://www.imdb.com/user/ur138407971",
      "reviewLink": "https://www.imdb.com/review/rw7382411",
      "warningSpoilers": false,
      "date": "26 September 2021",
      "rate": "9",
      "helpful": "7 out of 9 found this helpful.",
      "title": "S1 is great, but S2 is on a whole other level",
      "content": "The first season was mostly about showing students how about balance school life while teaching you life lessons, and it does that very well.But Season 2 takes all of that and improves in every way - the direction, story, characters, the change in tone and the dialogue."
    },
    {
      "username": "ssscvrce",
      "userUrl": "https://www.imdb.com/user/ur132475847",
      "reviewLink": "https://www.imdb.com/review/rw7379503",
      "warningSpoilers": false,
      "date": "25 September 2021",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Blessed!",
      "content": "Thankyou the entire team! Requires no review! Just feeling blessed!"
    },
    {
      "username": "vaibhavbohra",
      "userUrl": "https://www.imdb.com/user/ur101806143",
      "reviewLink": "https://www.imdb.com/review/rw4786881",
      "warningSpoilers": false,
      "date": "17 April 2019",
      "rate": "10",
      "helpful": "10 out of 12 found this helpful.",
      "title": "A brilliant piece",
      "content": "This show encapsulates the entirety of the student struggle and the zeal of being praised upon. We live in a system that only rewards students who are good at regurgitate unoriginal information. These intricate stuff would cascade into being a complete introverted isolated individual. Love the cinematography and the writing!"
    }
  ],
  "errorMessage": ""
}