{
  "imDbId": "tt1190634",
  "title": "The Boys",
  "fullTitle": "The Boys (TV Series 2019– )",
  "type": "TVSeries",
  "year": "2019",
  "language": "en",
  "titleInLanguage": "The Boys (TV series)",
  "url": "https://en.wikipedia.org/wiki/The_Boys_(TV_series)",
  "plotShort": {
    "plainText": "The Boys is an American superhero television series developed by Eric Kripke for Amazon Prime Video. Based on the comic book of the same name by Garth Ennis and Darick Robertson, it follows the eponymous team of vigilantes as they combat superpowered individuals who abuse their abilities. The series features an ensemble cast that includes Karl Urban, Jack Quaid, Antony Starr, Erin Moriarty, Dominique McElligott, Jessie T. Usher, Chace Crawford, Laz Alonso, Tomer Capone, Karen Fukuhara, and Nathan Mitchell.\r\nOriginally intended to be a feature-length film, the comic book series adaptation began its development in 2008 with Adam McKay set to direct the film. Due to creative differences between the crew and the studios that picked up the film, the project was left in development hell. The development for the project was revived in 2016 by Cinemax, which announced that it would be reworked as a television series. Kripke was recruited to be the showrunner of the series, while Seth Rogen and Evan Goldberg would be the executive producers. Amazon Prime Video obtained the rights for the series in November 2017, with production starting in May 2018 in Toronto.\r\nThe Boys premiered its first season of eight episodes on July 26, 2019. A second season premiered on September 4, 2020, with the third season following on June 3, 2022. In June 2022, the series was renewed for a fourth season. As part of a shared universe, a spin-off web series, Seven on 7, premiered in July 2021, an animated anthology series, Diabolical, premiered in March 2022, and a second live-action television series, Gen V, was ordered in September 2020. The series has received positive reviews and praise for its writing, storyline, humor, and performances of the cast. The series was nominated for six Emmy Awards, including Outstanding Drama Series in 2021.",
    "html": "<p>The Boys is an American superhero television series developed by Eric Kripke for Amazon Prime Video. Based on the comic book of the same name by Garth Ennis and Darick Robertson, it follows the eponymous team of vigilantes as they combat superpowered individuals who abuse their abilities. The series features an ensemble cast that includes Karl Urban, Jack Quaid, Antony Starr, Erin Moriarty, Dominique McElligott, Jessie T. Usher, Chace Crawford, Laz Alonso, Tomer Capone, Karen Fukuhara, and Nathan Mitchell.</p><p>Originally intended to be a feature-length film, the comic book series adaptation began its development in 2008 with Adam McKay set to direct the film. Due to creative differences between the crew and the studios that picked up the film, the project was left in development hell. The development for the project was revived in 2016 by Cinemax, which announced that it would be reworked as a television series. Kripke was recruited to be the showrunner of the series, while Seth Rogen and Evan Goldberg would be the executive producers. Amazon Prime Video obtained the rights for the series in November 2017, with production starting in May 2018 in Toronto.</p><p>The Boys premiered its first season of eight episodes on July 26, 2019. A second season premiered on September 4, 2020, with the third season following on June 3, 2022. In June 2022, the series was renewed for a fourth season. As part of a shared universe, a spin-off web series, Seven on 7, premiered in July 2021, an animated anthology series, Diabolical, premiered in March 2022, and a second live-action television series, Gen V, was ordered in September 2020. The series has received positive reviews and praise for its writing, storyline, humor, and performances of the cast. The series was nominated for six Emmy Awards, including Outstanding Drama Series in 2021.</p>"
  },
  "plotFull": {
    "plainText": "The Boys is an American superhero television series developed by Eric Kripke for Amazon Prime Video. Based on the comic book of the same name by Garth Ennis and Darick Robertson, it follows the eponymous team of vigilantes as they combat superpowered individuals who abuse their abilities. The series features an ensemble cast that includes Karl Urban, Jack Quaid, Antony Starr, Erin Moriarty, Dominique McElligott, Jessie T. Usher, Chace Crawford, Laz Alonso, Tomer Capone, Karen Fukuhara, and Nathan Mitchell.\r\nOriginally intended to be a feature-length film, the comic book series adaptation began its development in 2008 with Adam McKay set to direct the film. Due to creative differences between the crew and the studios that picked up the film, the project was left in development hell. The development for the project was revived in 2016 by Cinemax, which announced that it would be reworked as a television series. Kripke was recruited to be the showrunner of the series, while Seth Rogen and Evan Goldberg would be the executive producers. Amazon Prime Video obtained the rights for the series in November 2017, with production starting in May 2018 in Toronto.\r\nThe Boys premiered its first season of eight episodes on July 26, 2019. A second season premiered on September 4, 2020, with the third season following on June 3, 2022. In June 2022, the series was renewed for a fourth season. As part of a shared universe, a spin-off web series, Seven on 7, premiered in July 2021, an animated anthology series, Diabolical, premiered in March 2022, and a second live-action television series, Gen V, was ordered in September 2020. The series has received positive reviews and praise for its writing, storyline, humor, and performances of the cast. The series was nominated for six Emmy Awards, including Outstanding Drama Series in 2021.\r\nPremise\r\nThe Boys is set in a universe where superpowered individuals are recognized as heroes by the general public and work for a powerful corporation known as Vought International that markets and monetizes them. Outside their heroic personas, most are corrupt and self-serving. The series primarily focuses on two groups: the Seven, Vought's premier superhero team, and the Boys, vigilantes looking to bring down Vought and its corrupt superheroes.\r\nThe Boys are led by Billy Butcher, who despises all superpowered individuals, and the Seven are led by the egotistical and unstable Homelander. At the start of the series, the Boys are joined by Hughie Campbell after a superhero accidentally kills his girlfriend, and the Seven are joined by Annie January, a young and hopeful heroine forced to face the truth about those she admires. Other members of the Seven include the disillusioned Queen Maeve, drug-addicted A-Train, insecure Deep, mysterious Black Noir, and white supremacist Stormfront. The Boys are rounded out by tactical planner Mother's \"MM\" Milk, weapons specialist Frenchie, and superpowered test subject Kimiko. Overseeing the Seven is Vought executive Madelyn Stillwell, who is later succeeded by publicist Ashley Barrett. Other superpowered individuals include Victoria Neuman, a congresswoman who publicly opposes Vought while secretly assisting the corporation, and Soldier Boy, Vought's original premier superhero.\r\nCast and characters\r\nKarl Urban as Billy Butcher – The leader of the Boys and a former SAS operative who distrusts all superpowered individuals. He has a particular hatred towards Homelander, who he believes is responsible for the disappearance of his wife. Luca Villacis and Josh Zaharia portray younger versions of the character.\r\nJack Quaid as Hughie Campbell – A civilian tech specialist who joins the Boys after his girlfriend Robin is killed by A-Train.\r\nAntony Starr as John / Homelander – The extremely powerful leader of the Seven. Beneath his public image as a noble hero, he is egotistical, megalomaniacal, and cares little about the well-being of those he professes to protect.\r\nErin Moriarty as Annie January / Starlight – A superhero with light-based powers and a member of the Seven. One of the few heroes who values protecting society, she questions her loyalty to the Seven after learning of their true character. Maya Misaljevic portrays the young Starlight.\r\nDominique McElligott as Margaret Shaw / Queen Maeve (seasons 1–3) – A veteran member of the Seven with superhuman strength and durability. Once desiring to protect innocent lives, she has become disillusioned and suffers from burnout.\r\nJessie T. Usher as Reggie Franklin / A-Train – A speedster member of the Seven. He is determined to maintain his status as the fastest speedster in the world, which results in him becoming addicted to Compound V.\r\nLaz Alonso as Marvin T. \"Mother's\" Milk / M.M. – A member of the Boys who is responsible for organizing and planning their operations. Formerly a medic in the United States Marine Corps, he joined the Boys after Soldier Boy caused his grandfather's death and his attorney father worked himself to death attempting to bring Vought down. Elias Leon Leacock portrays the young M.M.\r\nChace Crawford as Kevin Moskowitz / the Deep – A member of the Seven who possesses the ability to communicate with aquatic life and breathe underwater. He is looked down upon by the other members of the Seven due to his status as the group's token aquatic hero. Patton Oswalt voices the Deep's gills.\r\nTomer Capone as Serge / Frenchie – A member of the Boys and an international arms trafficker skilled in munitions, ordnance, infiltration, and chemistry. Coerced into joining the group to protect his criminal friends, he seeks redemption for his past crimes by fighting against Vought.\r\nKaren Fukuhara as Kimiko Miyashiro / the Female – A mute member of the Boys with super strength and regenerative healing. Involuntarily injected with Compound V as part of a scheme to create superpowered terrorists, she joins the Boys after they rescue her.\r\nNathan Mitchell as Earving / Black Noir – A mysterious member of the Seven who possesses superhuman strength and agility. Formerly a member of Payback, he was badly disfigured during his team's mutiny against Soldier Boy, rendering him mute and forcing him to conceal his physical appearance behind a dark costume. Fritzy-Klevans Destine portrays the young Black Noir in the third season. Although the character is killed by Homelander in the third season, Mitchell will return in the fourth season as a new Black Noir.\r\nElisabeth Shue as Madelyn Stillwell (season 1; guest season 2) – A charismatic, scheming vice president at Vought International responsible for managing the superheroes.\r\nColby Minifie as Ashley Barrett (season 2–present; recurring season 1) – A publicist for Vought International who later becomes its president.\r\nAya Cash as Klara Risinger / Liberty / Stormfront (season 2; guest season 3) – The first successful Compound V subject and member of the Seven with plasma-based abilities. Once a member of the Nazi Party, she holds bigoted views towards minorities and the non-superpowered.\r\nClaudia Doumit as Victoria Neuman / Nadia (season 3–present; recurring season 2) – A congresswoman who publicly opposes Vought, but is secretly a superpowered assassin with the ability to psychically cause spontaneous combustion. Elisa Paszt portrays the young Nadia.\r\nJensen Ackles as Ben / Soldier Boy (season 3) – The original premier superhero and leader of Payback. Thought to have been killed during the Cold War, he was secretly betrayed by his team and captured by the Soviets in order for Vought to replace him with Homelander, his biological son.\r\nEpisodes\r\nSeason 1 (2019)\r\nSeason 2 (2020)\r\nSeason 3 (2022)\r\nSeason 4\r\nProduction\r\nDevelopment\r\nBetween 2008 and 2016, a film adaptation of The Boys had been in various stages of development at both Columbia Pictures and Paramount Pictures. Adam McKay expressed interest in directing, and Matt Manfredi and Phil Hay were in charge of the screenplay. McKay expressed interest in casting Russell Crowe as Billy Butcher and Simon Pegg as Hughie, as well as shooting the film in 3D. On April 6, 2016, it was announced that Cinemax was developing a television series adaptation of the comic book. The production was being developed by Eric Kripke, Evan Goldberg, and Seth Rogen. Kripke was set to write the series while Goldberg and Rogen were set to direct. Executive producers were reported to include Kripke, Goldberg, Rogen, Neal H. Moritz, Pavun Shetty, Ori Marmur, James Weaver, Ken Levin, and Jason Netter. Garth Ennis and Darick Robertson were set as co-executive producers. Production companies involved with the series included Point Grey Pictures, Original Film, and Sony Pictures Television.\r\nOn November 8, 2017, it was announced that Amazon had given the production a series order for a first season which consisted of eight episodes. The series had reportedly been in development at Amazon for a number of months preceding the series order announcement. It was also reported that the previously announced creative team was still attached to the series. Kripke wanted to retain a sense of reality to the show, and keep the writers disciplined, so he decided \"Anything that comes out of this drug is viable, and anything that doesn't we're not allowed to do\". He did not want to fall into the overused convention of killing off female characters to motivate the heroes and also saw an opportunity to surprise readers of the comics by changing the story of Butcher's wife Becky. On April 30, 2018, it was announced that Dan Trachtenberg would direct the series' first episode. He replaced Seth Rogen and Evan Goldberg, who dropped out due to scheduling conflicts.\r\nAhead of the series premiere, on July 19, 2019, at the 2019 San Diego Comic-Con, it was announced that Amazon had renewed the series for a second season, which premiered on September 4, 2020, and that it would consist of eight episodes, like the previous season. Kripke was already starting to write the scripts just before the series premiere revealing that it took \"a lot of tiptoeing around expectations for the hit's sophomore outing\". The eight scripts for the second season were completed by November 2019.\r\nOn July 23, 2020, Amazon announced that the series was being renewed for a third season at the aftershow hosted by Aisha Tyler for the 2020 San Diego Comic-Con@Home. The third season began filming in early 2021 with a then-unknown release date. On October 30, 2020, Kripke revealed that the third season would adapt the miniseries comic book Herogasm, which is centered around superhero orgy festivals. It would be adapted for the season's sixth episode, which would be named \"Herogasm\" after the miniseries. Kripke stated that \"Herogasm\" had \"the craziest dailies he ever seen\" and \"that people not ready to watch it\". However, the part of the comic book story in which Soldier Boy is depicted as a superhero who has yearly sex with Homelander in an attempt to gain membership in the Seven will not be used, and instead, Soldier Boy was depicted as the \"Homelander before Homelander\", a superhero from World War II brought out of retirement. Kripke also revealed that instead of portraying Soldier Boy as innocent like he is depicted in the comics, he would be worse than Homelander.\r\nOn June 10, 2022, Amazon renewed the series for a fourth season.\r\nCasting\r\nOn December 18, 2017, it was announced that Erin Moriarty had been cast in the lead role of Annie January / Starlight. On January 17, 2018, it was reported that Antony Starr, Dominique McElligott, Chace Crawford, Jessie Usher, and Nathan Mitchell had joined the main cast. In March 2018, it was announced that Laz Alonso, Jack Quaid, and Karen Fukuhara had been cast in series regular roles. On April 5, 2018, it was reported that Karl Urban had been cast in the series' lead role of Billy Butcher. On May 16, 2018, it was announced that Elisabeth Shue had been cast in the series regular role of Madelyn Stillwell. On June 25, 2018, it was reported that Tomer Kapon had joined the main cast in the role of Frenchie. On August 30, 2018, it was announced that Jennifer Esposito had been cast in the recurring role of CIA Agent Susan Raynor. On October 5, 2018, it was announced during the annual New York Comic Con that Simon Pegg had been cast in the role of Hughie's father. According to the artist Robertson, Hughie was drawn in the comics to resemble Pegg after he saw Pegg in the sitcom Spaced, but Pegg thought he was too old to play the role of Hughie in the TV series.\r\nOn September 5, 2019, Goran Višnjić and Claudia Doumit were cast in recurring roles for the second season. A month later, Patton Oswalt was announced in an unspecified role. Aya Cash was confirmed to be portraying superhero Stormfront in March 2020 following contract negotiations that began when the second season was announced. On August 10, 2020, it was reported that Shawn Ashmore was cast as Lamplighter for the second season. A week later, Jensen Ackles joined the cast for the third season as Soldier Boy. On October 30, 2020, Claudia Doumit and Colby Minifie were promoted to series regulars for the third season. On March 26, 2021, Katia Winter joined the cast in the recurring role of Little Nina for the third season. On June 23, 2021, Miles Gaston Villanueva, Sean Patrick Flanery, and Nick Wechsler were cast as Supersonic, Gunpowder, and Blue Hawk, respectively, for the third season in undisclosed capacities. Two days later, Laurie Holden joined the cast as Crimson Countess in a recurring role for the third season. On October 5, 2021, Frances Turner, Kristin Booth, and Jack Doolan joined the cast as Monique and twins Tessa and Tommy, a.k.a. the TNT Twins, in recurring roles for the third season. On July 8, 2022, it was announced Nathan Mitchell (who portrayed the masked Black Noir in the first three seasons), despite his character's death in the third season, would continue to portray a new replacement Black Noir in a main capacity in fourth season of the series. On August 1, 2022, it was reported that Cameron Crovetti had been promoted as a series regular while Valorie Curry and Susan Heyward were cast as new series regulars for the fourth season. Later that month, Jeffrey Dean Morgan was cast in an undisclosed role. On December 1, 2022, Rosemarie DeWitt, Rob Benedict, and Elliot Knight joined the cast in undisclosed capacities for the fourth season.\r\nFilming\r\nAlthough situated in New York City like in the comics, it was confirmed the series would be filmed in Toronto, Canada. In November 2017, it was announced that the filming for the series was slated to begin filming in 2018 with the hopes of releasing it on 2019. Though the series was mainly shot in Toronto, it was confirmed that additional filming would also be taking place across the Golden Horseshoe area, including Mississauga and Hamilton.\r\nPrincipal photography for the first season took place from May 22 to September 25, 2018 in Toronto. The crew filmed at the Roy Thomson Hall in order to get the shots of the exterior of the Seven Tower, which was digitally created through CGI. The building's structure was digitally altered and extended to become the Seven Tower. For the interior of the tower, including some of the rooms and the modern lobby where the fictional company celebrates the corporate parties, the interior of Roy Thomson Hall was used. For Times Square, the crew filmed in Yonge–Dundas Square in Toronto and proceeded to digitally alter it. A-Train's race with Shockwave was filmed at Tim Hortons Field stadium located at Hamilton, Ontario. Lower Bay Station was used for the subway scenes. The crew also filmed at several places of interest through the city such as the Sherbourne Common and the Cathedral Church of St. James. Another shooting location was at the Parkwood Estate in Oshawa, Ontario as the mansion of Dr. Jonah Vogelbaum.\r\nThe filming for the second season took place from June 17 to November 13, 2019. For Translucent's funeral ceremony, the crew filmed at the Meridian Arts Centre which is located at the North York district in Toronto. The crew filmed at the Wet 'n' Wild Toronto Waterpark for the scene where the Deep is arrested, with some CGI modifications in order to recreate the series' fictional Splash Zone Sandusky park. For the scenes of the church of the Collective, filming took place at the Scottish Rite Club in Hamilton, Ontario. To create the Sage Grove psychiatric hospital, the crew filmed at the Southwest Centre for Forensic Mental Health Care complex which is located in the city of St. Thomas in Ontario. While filming for the second season a scene was planned to be shot at the Mel Lastman Square, however they were relocated by the Toronto City Council as the location was close to the place where the Toronto van attack occurred on April 23, 2018.\r\nThe filming for the third season took place from February 24 to September 10, 2021. The filming for the season was not affected by the COVID-19 pandemic, though several precautions were implemented to ensure the safety of the cast and crew. The new locations included for the season were Metro Toronto Convention Centre as Vought headquarters, Saint George Manor as the host studio of the fictional reality show American Hero, and Canada's Wonderland Medieval Faire section as Vought Land theme park.\r\nThe fourth season commenced filming on August 23, 2022. Pegg concluded filming his scenes on January 18, 2023. Filming on the finale began on February 12, with Starr concluding filming his scenes on April 4. Filming for the fourth season wrapped on April 12, 2023.\r\nMusic\r\nScore albums have been released for each season of the series by Madison Gate Records. Christopher Lennertz served as composer of the show's score. During an interview at the 2019 Comic-Con, he stated that his work for The Boys was the \"craziest thing\" he has ever done, after collaborating with Seth Rogen for Sausage Party. For the second season's soundtrack, Erin Moriarty provides her own vocals for the song \"Never Truly Vanish\", which was nominated for an Emmy. The music video for \"Never Truly Vanish\" was released on YouTube on June 4, 2021. Jessie T. Usher also performed an original song for the second season's soundtrack and on September 1, 2021, the music video for \"Faster\" was released on YouTube. The third season's soundtrack included two songs performed by Miles Gaston Villanueva, \"You've Got a License to Drive (Me Crazy)\" and \"Rock My Kiss\", while Laurie Holden performed \"America's Son\" which were released on June 3, 2022. On June 17, 2022, another video was released for a song performed by Holden, \"Chimps Don't Cry\".\r\nPolitics\r\nThe seasons explore issues like white nationalism, white supremacy, systemic racism, and xenophobia, with Kripke seeing an opportunity to introduce Stormfront, a racist superhero who believes in Nazism. Kripke revealed that unlike the comics where Stormfront is male, the character would be gender swapped for the series with the intention of creating \"Homelander’s worst nightmare that would be a strong woman who wasn't afraid of him and proceeded to steal his spotlight.\" The show contains political satire, and many consider the show to be a critique of conservatism and far-right politics. The show has also made references to corporate corruption, police brutality, sexual harassment, and homophobia. Various analogies have been made to current social and political movements such as Black Lives Matter, the MeToo movement, and comparing Homelander to Donald Trump. Some of the showrunners have said that these analogies are intentional and made to cast a political message.\r\nRelease\r\nOn September 26, 2018, the official poster for the series was released. On October 5, 2018, in tandem with the series' panel at the annual New York Comic Con, a teaser trailer for the series was released. On January 24, 2019, another teaser trailer was released via Seth Rogen's official Twitter account. The series premiered on July 26, 2019, after another teaser was released. Ahead of the premiere, Amazon renewed The Boys for a second season, which premiered on September 4, 2020. On July 22, Slipknot released a new single called \"Solway Firth\" with an accompanying music video which featured clips and audio from the show. On June 26, 2020, it was announced that season two would debut on September 4, 2020, with the first 3 episodes available immediately and the rest debuting on a weekly basis. The second season's official trailer was released on August 4, 2020. On January 6, 2022, it was reported that the third season would premiere on June 3, 2022, with the first 3 episodes available immediately and the rest debuting on a weekly basis until the season finale on July 8.\r\nA companion short film titled Butcher, set between the first and second season, was released on September 10, 2020, with Karl Urban reprising his role as Billy Butcher. Characters from The Boys also appeared in an episode of Death Battle! sponsored by Amazon Prime Video, which was released on September 17, 2020.\r\nHome media\r\nThe first two seasons were released on Blu-ray in a six-disc box set by Sony Pictures Home Entertainment on May 17, 2022. The Butcher short film was included as well as deleted scenes and blooper reels.\r\nReception\r\nCritical reception\r\nOn Rotten Tomatoes, the first season holds an approval rating of 85% based on 105 reviews, with an average rating of 7.6/10. The website's critical consensus reads, \"Though viewers' mileage may vary, The Boys' violent delights and willingness to engage in heavy, relevant themes are sure to please those looking for a new group of antiheroes to root for.\" On Metacritic, it has a weighted average score of 74 out of 100, based on reviews from 19 critics, indicating \"generally favorable reviews\".\r\nOn Rotten Tomatoes, the second season holds an approval rating of 97% based on 105 reviews, with an average rating of 8.1/10. The website's critical consensus reads, \"The Boys comes out swinging in a superb second season that digs deeper into its complicated characters and ups the action ante without pulling any of its socially critical punches.\" On Metacritic, the season has a weighted average score of 80 out of 100, based on 15 critics, indicating \"generally favorable reviews\".\r\nOn Rotten Tomatoes, the third season has a \"Certified Fresh\" approval rating of 98% based on 146 reviews, with an average rating of 8.05/10. The website's critical consensus states, \"Managing to up the ante on what was already one of television's most audacious satires, The Boys' third season is both bracingly visceral and wickedly smart.\" On Metacritic, the season has a weighted average score of 77 out of 100, based on 20 critics, indicating \"generally favorable reviews\".\r\nAudience viewership\r\nIn October 2019, Nielsen announced it had begun tracking viewership of Amazon Prime programs. It said The Boys had attracted 8 million total viewers in its first 10 days of release, making it one of the most successful original programs on Amazon Prime. For the second season, the first three episodes drew a 7.2 percent share of streams relative to the top 100 most-watched TV shows on Reelgood within its opening weekend, beating the third season of Stranger Things (5.8 percent) and The Mandalorian (4.4 percent). The show's audience increased 89 percent compared to the first season. Nielsen ratings revealed that 891 million minutes of the show has been watched, placing it number three on the Nielsen list, just behind Cobra Kai (2.17 billion minutes) and Lucifer (1.42 billion minutes). It became the first non-Netflix show to appear on the Nielsen Top 10 Streaming Shows list.\r\nAccolades\r\nPETA awarded the third-season episode \"Barbary Coast\" its \"Tech, Not Terror\" award for using a CGI octopus.\r\nFranchise\r\nSpin-offs\r\nThe Boys Presents: Diabolical\r\nOn December 5, 2021, at the Brazil Comic-Con, Prime Video announced that The Boys Presents: Diabolical, an animated anthology series, had been given an eight-episode series order. On January 18, 2022, it was announced that the series would premiere on March 4, 2022.\r\nGen V\r\nOn September 24, 2020, it was announced that a spin-off centered on a superhero college had been fast-tracked into development upon the ratings success of the series' second season. Described as being \"part college show, part Hunger Games\", the spin-off is to be set \"... at America's only college exclusively for young adult superheroes (and run by Vought International)\" and is described as \"an irreverent, R-rated series that explores the lives of hormonal, competitive Supes as they put their physical, sexual, and moral boundaries to the test, competing for the best contracts in the best cities\". On October 2, 2020, Kripke stated the series would focus on the G-Men team that had been mentioned in the first season, a parody of the X-Men. On September 27, 2021, the untitled spin-off was given a series order by Amazon Studios. Filming of the series, titled Gen V, beginning at the University of Toronto in May 2022 and the Claireville Conservation Area, Brampton in July, intended for an October wrap.\r\nOther media\r\nVought News Network\r\nAhead of the premiere of the third season, the series had released video segments in the form of in-universe news reports from the Vought News Network channel on YouTube, titled Seven on 7 with Cameron Coleman. Each of the seven segments contains seven stories that tease events in upcoming episodes and introduce new cast members, and acts as a bridge between Season 2 and 3. Matthew Edison, who plays news anchor Cameron Coleman, also appears in the third season of the series.\r\nSupe Porn\r\nOn October 3, 2020, Eric Kripke said that the in-universe pornographic superhero film scenes briefly glimpsed in the second season The Boys episode \"Butcher, Baker, Candlestick Maker\" had been produced in full, expressing interest in releasing them under the name Supe Porn to the website of the same name, registered to Sony Pictures, as well as supposedly requesting Seth Rogen, Evan Goldberg, Antony Starr and the other followers of his Twitter page to join him in petitioning Prime Video and Amazon Studios to allow the potential web series to be uploaded. Later on, a fictional sex toy online store was added to the website, with a collection of products such as The StarMight Plug and Translucent's Glass Dildo. At the bottom of the website there is a message saying that its contents are for entertainment purpose only and not actually for sale.",
    "html": "<p>The Boys is an American superhero television series developed by Eric Kripke for Amazon Prime Video. Based on the comic book of the same name by Garth Ennis and Darick Robertson, it follows the eponymous team of vigilantes as they combat superpowered individuals who abuse their abilities. The series features an ensemble cast that includes Karl Urban, Jack Quaid, Antony Starr, Erin Moriarty, Dominique McElligott, Jessie T. Usher, Chace Crawford, Laz Alonso, Tomer Capone, Karen Fukuhara, and Nathan Mitchell.</p><p>Originally intended to be a feature-length film, the comic book series adaptation began its development in 2008 with Adam McKay set to direct the film. Due to creative differences between the crew and the studios that picked up the film, the project was left in development hell. The development for the project was revived in 2016 by Cinemax, which announced that it would be reworked as a television series. Kripke was recruited to be the showrunner of the series, while Seth Rogen and Evan Goldberg would be the executive producers. Amazon Prime Video obtained the rights for the series in November 2017, with production starting in May 2018 in Toronto.</p><p>The Boys premiered its first season of eight episodes on July 26, 2019. A second season premiered on September 4, 2020, with the third season following on June 3, 2022. In June 2022, the series was renewed for a fourth season. As part of a shared universe, a spin-off web series, Seven on 7, premiered in July 2021, an animated anthology series, Diabolical, premiered in March 2022, and a second live-action television series, Gen V, was ordered in September 2020. The series has received positive reviews and praise for its writing, storyline, humor, and performances of the cast. The series was nominated for six Emmy Awards, including Outstanding Drama Series in 2021.</p><br/><h3>Premise</h3><p>The Boys is set in a universe where superpowered individuals are recognized as heroes by the general public and work for a powerful corporation known as Vought International that markets and monetizes them. Outside their heroic personas, most are corrupt and self-serving. The series primarily focuses on two groups: the Seven, Vought's premier superhero team, and the Boys, vigilantes looking to bring down Vought and its corrupt superheroes.</p><p>The Boys are led by Billy Butcher, who despises all superpowered individuals, and the Seven are led by the egotistical and unstable Homelander. At the start of the series, the Boys are joined by Hughie Campbell after a superhero accidentally kills his girlfriend, and the Seven are joined by Annie January, a young and hopeful heroine forced to face the truth about those she admires. Other members of the Seven include the disillusioned Queen Maeve, drug-addicted A-Train, insecure Deep, mysterious Black Noir, and white supremacist Stormfront. The Boys are rounded out by tactical planner Mother's \"MM\" Milk, weapons specialist Frenchie, and superpowered test subject Kimiko. Overseeing the Seven is Vought executive Madelyn Stillwell, who is later succeeded by publicist Ashley Barrett. Other superpowered individuals include Victoria Neuman, a congresswoman who publicly opposes Vought while secretly assisting the corporation, and Soldier Boy, Vought's original premier superhero.</p><br/><h3>Cast and characters</h3><ul><li>Karl Urban as Billy Butcher – The leader of the Boys and a former SAS operative who distrusts all superpowered individuals. He has a particular hatred towards Homelander, who he believes is responsible for the disappearance of his wife. Luca Villacis and Josh Zaharia portray younger versions of the character.</li><li>Jack Quaid as Hughie Campbell – A civilian tech specialist who joins the Boys after his girlfriend Robin is killed by A-Train.</li><li>Antony Starr as John / Homelander – The extremely powerful leader of the Seven. Beneath his public image as a noble hero, he is egotistical, megalomaniacal, and cares little about the well-being of those he professes to protect.</li><li>Erin Moriarty as Annie January / Starlight – A superhero with light-based powers and a member of the Seven. One of the few heroes who values protecting society, she questions her loyalty to the Seven after learning of their true character. Maya Misaljevic portrays the young Starlight.</li><li>Dominique McElligott as Margaret Shaw / Queen Maeve (seasons 1–3) – A veteran member of the Seven with superhuman strength and durability. Once desiring to protect innocent lives, she has become disillusioned and suffers from burnout.</li><li>Jessie T. Usher as Reggie Franklin / A-Train – A speedster member of the Seven. He is determined to maintain his status as the fastest speedster in the world, which results in him becoming addicted to Compound V.</li><li>Laz Alonso as Marvin T. \"Mother's\" Milk / M.M. – A member of the Boys who is responsible for organizing and planning their operations. Formerly a medic in the United States Marine Corps, he joined the Boys after Soldier Boy caused his grandfather's death and his attorney father worked himself to death attempting to bring Vought down. Elias Leon Leacock portrays the young M.M.</li><li>Chace Crawford as Kevin Moskowitz / the Deep – A member of the Seven who possesses the ability to communicate with aquatic life and breathe underwater. He is looked down upon by the other members of the Seven due to his status as the group's token aquatic hero. Patton Oswalt voices the Deep's gills.</li><li>Tomer Capone as Serge / Frenchie – A member of the Boys and an international arms trafficker skilled in munitions, ordnance, infiltration, and chemistry. Coerced into joining the group to protect his criminal friends, he seeks redemption for his past crimes by fighting against Vought.</li><li>Karen Fukuhara as Kimiko Miyashiro / the Female – A mute member of the Boys with super strength and regenerative healing. Involuntarily injected with Compound V as part of a scheme to create superpowered terrorists, she joins the Boys after they rescue her.</li><li>Nathan Mitchell as Earving / Black Noir – A mysterious member of the Seven who possesses superhuman strength and agility. Formerly a member of Payback, he was badly disfigured during his team's mutiny against Soldier Boy, rendering him mute and forcing him to conceal his physical appearance behind a dark costume. Fritzy-Klevans Destine portrays the young Black Noir in the third season. Although the character is killed by Homelander in the third season, Mitchell will return in the fourth season as a new Black Noir.</li><li>Elisabeth Shue as Madelyn Stillwell (season 1; guest season 2) – A charismatic, scheming vice president at Vought International responsible for managing the superheroes.</li><li>Colby Minifie as Ashley Barrett (season 2–present; recurring season 1) – A publicist for Vought International who later becomes its president.</li><li>Aya Cash as Klara Risinger / Liberty / Stormfront (season 2; guest season 3) – The first successful Compound V subject and member of the Seven with plasma-based abilities. Once a member of the Nazi Party, she holds bigoted views towards minorities and the non-superpowered.</li><li>Claudia Doumit as Victoria Neuman / Nadia (season 3–present; recurring season 2) – A congresswoman who publicly opposes Vought, but is secretly a superpowered assassin with the ability to psychically cause spontaneous combustion. Elisa Paszt portrays the young Nadia.</li><li>Jensen Ackles as Ben / Soldier Boy (season 3) – The original premier superhero and leader of Payback. Thought to have been killed during the Cold War, he was secretly betrayed by his team and captured by the Soviets in order for Vought to replace him with Homelander, his biological son.</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally released</th></tr><tr><th scope=\"col\">First released</th><th scope=\"col\">Last released</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">July 26, 2019</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 4, 2020</td><td style=\"padding:0 8px\">October 9, 2020</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 3, 2022</td><td style=\"padding:0 8px\">July 8, 2022</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">8</td><td data-sort-value=\"\" class=\"table-na\" colspan=\"1\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center; ;padding:0.2em 0.4em\">TBA</td><td data-sort-value=\"\" class=\"table-na\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center; ;padding:0 8px\">TBA</td></tr></tbody></table><h4>Season 1 (2019)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#380000;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#380000;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#380000;width:32%\">Title</th><th scope=\"col\" style=\"background:#380000;width:13%\">Directed by</th><th scope=\"col\" style=\"background:#380000;width:27%\">Written by</th><th scope=\"col\" style=\"background:#380000;width:18%\">Original release date</th></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Name of the Game\"</td><td style=\"text-align:center\"><span>Dan Trachtenberg</span></td><td style=\"text-align:center\"><span>Eric Kripke</span></td><td style=\"text-align:center\">July 26, 2019</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Cherry\"</td><td style=\"text-align:center\"><span>Matt Shakman</span></td><td style=\"text-align:center\">Eric Kripke</td><td style=\"text-align:center\">July 26, 2019</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Get Some\"</td><td style=\"text-align:center\"><span>Phil Sgriccia</span></td><td style=\"text-align:center\"><span>George Mastras</span></td><td style=\"text-align:center\">July 26, 2019</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Female of the Species\"</td><td style=\"text-align:center\"><span>Fred Toye</span></td><td style=\"text-align:center\">Craig Rosenberg</td><td style=\"text-align:center\">July 26, 2019</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Good for the Soul\"</td><td style=\"text-align:center\"><span>Stefan Schwartz</span></td><td style=\"text-align:center\"><span>Anne Cofell Saunders</span></td><td style=\"text-align:center\">July 26, 2019</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Innocents\"</td><td style=\"text-align:center\"><span>Jennifer Phang</span></td><td style=\"text-align:center\">Rebecca Sonnenshine</td><td style=\"text-align:center\">July 26, 2019</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Self-Preservation Society\"</td><td style=\"text-align:center\"><span>Dan Attias</span></td><td style=\"text-align:center\">Craig Rosenberg and Ellie Monahan</td><td style=\"text-align:center\">July 26, 2019</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"You Found Me\"</td><td style=\"text-align:center\">Eric Kripke</td><td style=\"text-align:center\">Anne Cofell Saunders and Rebecca Sonnenshine</td><td style=\"text-align:center\">July 26, 2019</td></tr></tbody></table><h4>Season 2 (2020)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#9A0607;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#9A0607;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#9A0607;width:32%\">Title</th><th scope=\"col\" style=\"background:#9A0607;width:13%\">Directed by</th><th scope=\"col\" style=\"background:#9A0607;width:27%\">Written by</th><th scope=\"col\" style=\"background:#9A0607;width:18%\">Original release date</th></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Big Ride\"</td><td style=\"text-align:center\"><span>Phil Sgriccia</span></td><td style=\"text-align:center\"><span>Eric Kripke</span></td><td style=\"text-align:center\">September 4, 2020</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Proper Preparation and Planning\"</td><td style=\"text-align:center\"><span>Liz Friedlander</span></td><td style=\"text-align:center\">Rebecca Sonnenshine</td><td style=\"text-align:center\">September 4, 2020</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep11\" style=\"text-align:center\">11</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Over the Hill with the Swords of a Thousand Men\"</td><td style=\"text-align:center\"><span>Steve Boyum</span></td><td style=\"text-align:center\">Craig Rosenberg</td><td style=\"text-align:center\">September 4, 2020</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep12\" style=\"text-align:center\">12</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Nothing Like It in the World\"</td><td style=\"text-align:center\"><span class=\"mw-redirect\">Fred Toye</span></td><td style=\"text-align:center\">Michael Saltzman</td><td style=\"text-align:center\">September 11, 2020</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep13\" style=\"text-align:center\">13</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"We Gotta Go Now\"</td><td style=\"text-align:center\">Batan Silva</td><td style=\"text-align:center\">Ellie Monahan</td><td style=\"text-align:center\">September 18, 2020</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep14\" style=\"text-align:center\">14</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Bloody Doors Off\"</td><td style=\"text-align:center\">Sarah Boyd</td><td style=\"text-align:center\">Anslem Richardson</td><td style=\"text-align:center\">September 25, 2020</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep15\" style=\"text-align:center\">15</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Butcher, Baker, Candlestick Maker\"</td><td style=\"text-align:center\"><span>Stefan Schwartz</span></td><td style=\"text-align:center\">Craig Rosenberg</td><td style=\"text-align:center\">October 2, 2020</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep16\" style=\"text-align:center\">16</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"What I Know\"</td><td style=\"text-align:center\"><span>Alex Graves</span></td><td style=\"text-align:center\">Rebecca Sonnenshine</td><td style=\"text-align:center\">October 9, 2020</td></tr></tbody></table><h4>Season 3 (2022)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#FEC724;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#FEC724;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#FEC724;width:32%\">Title</th><th scope=\"col\" style=\"background:#FEC724;width:13%\">Directed by</th><th scope=\"col\" style=\"background:#FEC724;width:27%\">Written by</th><th scope=\"col\" style=\"background:#FEC724;width:18%\">Original release date</th></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep17\" style=\"text-align:center\">17</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Payback\"</td><td style=\"text-align:center\"><span>Phil Sgriccia</span></td><td style=\"text-align:center\">Craig Rosenberg</td><td style=\"text-align:center\">June 3, 2022</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep18\" style=\"text-align:center\">18</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Only Man In The Sky\"</td><td style=\"text-align:center\">Phil Sgriccia</td><td style=\"text-align:center\">David Reed</td><td style=\"text-align:center\">June 3, 2022</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep19\" style=\"text-align:center\">19</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Barbary Coast\"</td><td style=\"text-align:center\">Julian Holmes</td><td style=\"text-align:center\">Anslem Richardson &amp; Geoff Aull</td><td style=\"text-align:center\">June 3, 2022</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep20\" style=\"text-align:center\">20</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Glorious Five-Year Plan\"</td><td style=\"text-align:center\">Julian Holmes</td><td style=\"text-align:center\">Meredith Glynn</td><td style=\"text-align:center\">June 10, 2022</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep21\" style=\"text-align:center\">21</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Last Time to Look on This World of Lies\"</td><td style=\"text-align:center\"><span>Nelson Cragg</span></td><td style=\"text-align:center\">Ellie Monahan</td><td style=\"text-align:center\">June 17, 2022</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep22\" style=\"text-align:center\">22</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Herogasm\"</td><td style=\"text-align:center\">Nelson Cragg</td><td style=\"text-align:center\">Jessica Chou</td><td style=\"text-align:center\">June 24, 2022</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep23\" style=\"text-align:center\">23</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Here Comes a Candle to Light You to Bed\"</td><td style=\"text-align:center\">Sarah Boyd</td><td style=\"text-align:center\">Paul Grellong</td><td style=\"text-align:center\">July 1, 2022</td></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep24\" style=\"text-align:center\">24</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Instant White-Hot Wild\"</td><td style=\"text-align:center\">Sarah Boyd</td><td style=\"text-align:center\">Logan Ritchey &amp; David Reed</td><td style=\"text-align:center\">July 8, 2022</td></tr></tbody></table><h4>Season 4</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#2C612C;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#2C612C;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#2C612C;width:32%\">Title</th><th scope=\"col\" style=\"background:#2C612C;width:13%\">Directed by</th><th scope=\"col\" style=\"background:#2C612C;width:27%\">Written by</th><th scope=\"col\" style=\"background:#2C612C;width:18%\">Original release date</th></tr><tr style=\"text-align:center;background:inherit\"><th scope=\"row\" rowspan=\"1\" id=\"ep25\" style=\"text-align:center\">25</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Department of Dirty Tricks\"</td><td style=\"text-align:center\"><span class=\"mw-redirect\">Phil Sgriccia</span></td><td style=\"text-align:center\">David Reed</td><td style=\"text-align:center\"><small style=\"color: #2C2C2C\" title=\"To be announced\">TBA</small></td></tr></tbody></table><br/><h3>Production</h3><h4>Development</h4><p>Between 2008 and 2016, a film adaptation of The Boys had been in various stages of development at both Columbia Pictures and Paramount Pictures. Adam McKay expressed interest in directing, and Matt Manfredi and Phil Hay were in charge of the screenplay. McKay expressed interest in casting Russell Crowe as Billy Butcher and Simon Pegg as Hughie, as well as shooting the film in 3D. On April 6, 2016, it was announced that Cinemax was developing a television series adaptation of the comic book. The production was being developed by Eric Kripke, Evan Goldberg, and Seth Rogen. Kripke was set to write the series while Goldberg and Rogen were set to direct. Executive producers were reported to include Kripke, Goldberg, Rogen, Neal H. Moritz, Pavun Shetty, Ori Marmur, James Weaver, Ken Levin, and Jason Netter. Garth Ennis and Darick Robertson were set as co-executive producers. Production companies involved with the series included Point Grey Pictures, Original Film, and Sony Pictures Television.</p><p>On November 8, 2017, it was announced that Amazon had given the production a series order for a first season which consisted of eight episodes. The series had reportedly been in development at Amazon for a number of months preceding the series order announcement. It was also reported that the previously announced creative team was still attached to the series. Kripke wanted to retain a sense of reality to the show, and keep the writers disciplined, so he decided \"Anything that comes out of this drug is viable, and anything that doesn't we're not allowed to do\". He did not want to fall into the overused convention of killing off female characters to motivate the heroes and also saw an opportunity to surprise readers of the comics by changing the story of Butcher's wife Becky. On April 30, 2018, it was announced that Dan Trachtenberg would direct the series' first episode. He replaced Seth Rogen and Evan Goldberg, who dropped out due to scheduling conflicts.</p><p>Ahead of the series premiere, on July 19, 2019, at the 2019 San Diego Comic-Con, it was announced that Amazon had renewed the series for a second season, which premiered on September 4, 2020, and that it would consist of eight episodes, like the previous season. Kripke was already starting to write the scripts just before the series premiere revealing that it took \"a lot of tiptoeing around expectations for the hit's sophomore outing\". The eight scripts for the second season were completed by November 2019.</p><p>On July 23, 2020, Amazon announced that the series was being renewed for a third season at the aftershow hosted by Aisha Tyler for the 2020 San Diego Comic-Con@Home. The third season began filming in early 2021 with a then-unknown release date. On October 30, 2020, Kripke revealed that the third season would adapt the miniseries comic book Herogasm, which is centered around superhero orgy festivals. It would be adapted for the season's sixth episode, which would be named \"Herogasm\" after the miniseries. Kripke stated that \"Herogasm\" had \"the craziest dailies he ever seen\" and \"that people not ready to watch it\". However, the part of the comic book story in which Soldier Boy is depicted as a superhero who has yearly sex with Homelander in an attempt to gain membership in the Seven will not be used, and instead, Soldier Boy was depicted as the \"Homelander before Homelander\", a superhero from World War II brought out of retirement. Kripke also revealed that instead of portraying Soldier Boy as innocent like he is depicted in the comics, he would be worse than Homelander.</p><p>On June 10, 2022, Amazon renewed the series for a fourth season.</p><h4>Casting</h4><p>On December 18, 2017, it was announced that Erin Moriarty had been cast in the lead role of Annie January / Starlight. On January 17, 2018, it was reported that Antony Starr, Dominique McElligott, Chace Crawford, Jessie Usher, and Nathan Mitchell had joined the main cast. In March 2018, it was announced that Laz Alonso, Jack Quaid, and Karen Fukuhara had been cast in series regular roles. On April 5, 2018, it was reported that Karl Urban had been cast in the series' lead role of Billy Butcher. On May 16, 2018, it was announced that Elisabeth Shue had been cast in the series regular role of Madelyn Stillwell. On June 25, 2018, it was reported that Tomer Kapon had joined the main cast in the role of Frenchie. On August 30, 2018, it was announced that Jennifer Esposito had been cast in the recurring role of CIA Agent Susan Raynor. On October 5, 2018, it was announced during the annual New York Comic Con that Simon Pegg had been cast in the role of Hughie's father. According to the artist Robertson, Hughie was drawn in the comics to resemble Pegg after he saw Pegg in the sitcom Spaced, but Pegg thought he was too old to play the role of Hughie in the TV series.</p><p>On September 5, 2019, Goran Višnjić and Claudia Doumit were cast in recurring roles for the second season. A month later, Patton Oswalt was announced in an unspecified role. Aya Cash was confirmed to be portraying superhero Stormfront in March 2020 following contract negotiations that began when the second season was announced. On August 10, 2020, it was reported that Shawn Ashmore was cast as Lamplighter for the second season. A week later, Jensen Ackles joined the cast for the third season as Soldier Boy. On October 30, 2020, Claudia Doumit and Colby Minifie were promoted to series regulars for the third season. On March 26, 2021, Katia Winter joined the cast in the recurring role of Little Nina for the third season. On June 23, 2021, Miles Gaston Villanueva, Sean Patrick Flanery, and Nick Wechsler were cast as Supersonic, Gunpowder, and Blue Hawk, respectively, for the third season in undisclosed capacities. Two days later, Laurie Holden joined the cast as Crimson Countess in a recurring role for the third season. On October 5, 2021, Frances Turner, Kristin Booth, and Jack Doolan joined the cast as Monique and twins Tessa and Tommy, a.k.a. the TNT Twins, in recurring roles for the third season. On July 8, 2022, it was announced Nathan Mitchell (who portrayed the masked Black Noir in the first three seasons), despite his character's death in the third season, would continue to portray a new replacement Black Noir in a main capacity in fourth season of the series. On August 1, 2022, it was reported that Cameron Crovetti had been promoted as a series regular while Valorie Curry and Susan Heyward were cast as new series regulars for the fourth season. Later that month, Jeffrey Dean Morgan was cast in an undisclosed role. On December 1, 2022, Rosemarie DeWitt, Rob Benedict, and Elliot Knight joined the cast in undisclosed capacities for the fourth season.</p><h4>Filming</h4><p>Although situated in New York City like in the comics, it was confirmed the series would be filmed in Toronto, Canada. In November 2017, it was announced that the filming for the series was slated to begin filming in 2018 with the hopes of releasing it on 2019. Though the series was mainly shot in Toronto, it was confirmed that additional filming would also be taking place across the Golden Horseshoe area, including Mississauga and Hamilton.</p><p>Principal photography for the first season took place from May 22 to September 25, 2018 in Toronto. The crew filmed at the Roy Thomson Hall in order to get the shots of the exterior of the Seven Tower, which was digitally created through CGI. The building's structure was digitally altered and extended to become the Seven Tower. For the interior of the tower, including some of the rooms and the modern lobby where the fictional company celebrates the corporate parties, the interior of Roy Thomson Hall was used. For Times Square, the crew filmed in Yonge–Dundas Square in Toronto and proceeded to digitally alter it. A-Train's race with Shockwave was filmed at Tim Hortons Field stadium located at Hamilton, Ontario. Lower Bay Station was used for the subway scenes. The crew also filmed at several places of interest through the city such as the Sherbourne Common and the Cathedral Church of St. James. Another shooting location was at the Parkwood Estate in Oshawa, Ontario as the mansion of Dr. Jonah Vogelbaum.</p><p>The filming for the second season took place from June 17 to November 13, 2019. For Translucent's funeral ceremony, the crew filmed at the Meridian Arts Centre which is located at the North York district in Toronto. The crew filmed at the Wet 'n' Wild Toronto Waterpark for the scene where the Deep is arrested, with some CGI modifications in order to recreate the series' fictional Splash Zone Sandusky park. For the scenes of the church of the Collective, filming took place at the Scottish Rite Club in Hamilton, Ontario. To create the Sage Grove psychiatric hospital, the crew filmed at the Southwest Centre for Forensic Mental Health Care complex which is located in the city of St. Thomas in Ontario. While filming for the second season a scene was planned to be shot at the Mel Lastman Square, however they were relocated by the Toronto City Council as the location was close to the place where the Toronto van attack occurred on April 23, 2018.</p><p>The filming for the third season took place from February 24 to September 10, 2021. The filming for the season was not affected by the COVID-19 pandemic, though several precautions were implemented to ensure the safety of the cast and crew. The new locations included for the season were Metro Toronto Convention Centre as Vought headquarters, Saint George Manor as the host studio of the fictional reality show American Hero, and Canada's Wonderland Medieval Faire section as Vought Land theme park.</p><p>The fourth season commenced filming on August 23, 2022. Pegg concluded filming his scenes on January 18, 2023. Filming on the finale began on February 12, with Starr concluding filming his scenes on April 4. Filming for the fourth season wrapped on April 12, 2023.</p><h4>Music</h4><p>Score albums have been released for each season of the series by Madison Gate Records. Christopher Lennertz served as composer of the show's score. During an interview at the 2019 Comic-Con, he stated that his work for The Boys was the \"craziest thing\" he has ever done, after collaborating with Seth Rogen for Sausage Party. For the second season's soundtrack, Erin Moriarty provides her own vocals for the song \"Never Truly Vanish\", which was nominated for an Emmy. The music video for \"Never Truly Vanish\" was released on YouTube on June 4, 2021. Jessie T. Usher also performed an original song for the second season's soundtrack and on September 1, 2021, the music video for \"Faster\" was released on YouTube. The third season's soundtrack included two songs performed by Miles Gaston Villanueva, \"You've Got a License to Drive (Me Crazy)\" and \"Rock My Kiss\", while Laurie Holden performed \"America's Son\" which were released on June 3, 2022. On June 17, 2022, another video was released for a song performed by Holden, \"Chimps Don't Cry\".</p><h4>Politics</h4><p>The seasons explore issues like white nationalism, white supremacy, systemic racism, and xenophobia, with Kripke seeing an opportunity to introduce Stormfront, a racist superhero who believes in Nazism. Kripke revealed that unlike the comics where Stormfront is male, the character would be gender swapped for the series with the intention of creating \"Homelander’s worst nightmare that would be a strong woman who wasn't afraid of him and proceeded to steal his spotlight.\" The show contains political satire, and many consider the show to be a critique of conservatism and far-right politics. The show has also made references to corporate corruption, police brutality, sexual harassment, and homophobia. Various analogies have been made to current social and political movements such as Black Lives Matter, the MeToo movement, and comparing Homelander to Donald Trump. Some of the showrunners have said that these analogies are intentional and made to cast a political message.</p><br/><h3>Release</h3><p>On September 26, 2018, the official poster for the series was released. On October 5, 2018, in tandem with the series' panel at the annual New York Comic Con, a teaser trailer for the series was released. On January 24, 2019, another teaser trailer was released via Seth Rogen's official Twitter account. The series premiered on July 26, 2019, after another teaser was released. Ahead of the premiere, Amazon renewed The Boys for a second season, which premiered on September 4, 2020. On July 22, Slipknot released a new single called \"Solway Firth\" with an accompanying music video which featured clips and audio from the show. On June 26, 2020, it was announced that season two would debut on September 4, 2020, with the first 3 episodes available immediately and the rest debuting on a weekly basis. The second season's official trailer was released on August 4, 2020. On January 6, 2022, it was reported that the third season would premiere on June 3, 2022, with the first 3 episodes available immediately and the rest debuting on a weekly basis until the season finale on July 8.</p><p>A companion short film titled Butcher, set between the first and second season, was released on September 10, 2020, with Karl Urban reprising his role as Billy Butcher. Characters from The Boys also appeared in an episode of Death Battle! sponsored by Amazon Prime Video, which was released on September 17, 2020.</p><h4>Home media</h4><p>The first two seasons were released on Blu-ray in a six-disc box set by Sony Pictures Home Entertainment on May 17, 2022. The Butcher short film was included as well as deleted scenes and blooper reels.</p><br/><h3>Reception</h3><h4>Critical reception</h4><p>On Rotten Tomatoes, the first season holds an approval rating of 85% based on 105 reviews, with an average rating of 7.6/10. The website's critical consensus reads, \"Though viewers' mileage may vary, The Boys' violent delights and willingness to engage in heavy, relevant themes are sure to please those looking for a new group of antiheroes to root for.\" On Metacritic, it has a weighted average score of 74 out of 100, based on reviews from 19 critics, indicating \"generally favorable reviews\".</p><p>On Rotten Tomatoes, the second season holds an approval rating of 97% based on 105 reviews, with an average rating of 8.1/10. The website's critical consensus reads, \"The Boys comes out swinging in a superb second season that digs deeper into its complicated characters and ups the action ante without pulling any of its socially critical punches.\" On Metacritic, the season has a weighted average score of 80 out of 100, based on 15 critics, indicating \"generally favorable reviews\".</p><p>On Rotten Tomatoes, the third season has a \"Certified Fresh\" approval rating of 98% based on 146 reviews, with an average rating of 8.05/10. The website's critical consensus states, \"Managing to up the ante on what was already one of television's most audacious satires, The Boys' third season is both bracingly visceral and wickedly smart.\" On Metacritic, the season has a weighted average score of 77 out of 100, based on 20 critics, indicating \"generally favorable reviews\".</p><h4>Audience viewership</h4><p>In October 2019, Nielsen announced it had begun tracking viewership of Amazon Prime programs. It said The Boys had attracted 8 million total viewers in its first 10 days of release, making it one of the most successful original programs on Amazon Prime. For the second season, the first three episodes drew a 7.2 percent share of streams relative to the top 100 most-watched TV shows on Reelgood within its opening weekend, beating the third season of Stranger Things (5.8 percent) and The Mandalorian (4.4 percent). The show's audience increased 89 percent compared to the first season. Nielsen ratings revealed that 891 million minutes of the show has been watched, placing it number three on the Nielsen list, just behind Cobra Kai (2.17 billion minutes) and Lucifer (1.42 billion minutes). It became the first non-Netflix show to appear on the Nielsen Top 10 Streaming Shows list.</p><h4>Accolades</h4><p>PETA awarded the third-season episode \"Barbary Coast\" its \"Tech, Not Terror\" award for using a CGI octopus.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th><th class=\"unsortable\"><abbr title=\"Reference\">Ref.</abbr></th></tr><tr><td style=\"text-align: center;\">2020</td><td><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Sound Editing for a Comedy or Drama Series (One-Hour)</span></td><td data-sort-value=\"Barnett, Wade, David Barbee\">Wade Barnett, David Barbee, Mason Kopeikin, Brian Dunlop, Ryan Briley, Chris Newlin, Christopher Brooks, Joseph T. Sabella and Jesi Ruppel <small>(for \"The Name of the Game\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align: center;\"></td></tr><tr><td style=\"text-align: center;\" rowspan=\"24\">2021</td><td><span>British Fantasy Award</span></td><td>Best Film/Television Production</td><td><i>The Boys</i>: \"What I Know\" (season 2, episode 8)</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align: center;\"></td></tr><tr><td rowspan=\"5\"><span>Critics' Choice Super Awards</span></td><td rowspan=\"2\">Best Actor in a Superhero Series</td><td data-sort-value=\"Starr, Anthony\"><span>Antony Starr</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"5\" style=\"text-align: center;\"></td></tr><tr><td data-sort-value=\"Urban, Karl\"><span>Karl Urban</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Actress in a Superhero Series</td><td data-sort-value=\"Cash, Aya\"><span>Aya Cash</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Superhero Series</td><td data-sort-value=\"Boys, The\"><i>The Boys</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Villain in a Series</td><td data-sort-value=\"Starr, Anthony\">Antony Starr</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\"><span>Hollywood Critics Association TV Awards</span></td><td>Best Actor in a Streaming Series, Drama</td><td data-sort-value=\"Urban, Karl\">Karl Urban</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\" style=\"text-align:center;\"></td></tr><tr><td>Best Actress in a Streaming Series, Drama</td><td data-sort-value=\"Cash, Aya\">Aya Cash</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Streaming Series, Drama</td><td data-sort-value=\"Boys, The\"><i>The Boys</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Supporting Actor in a Streaming Series, Drama</td><td data-sort-value=\"Esposito, Giancarlo\"><span>Giancarlo Esposito</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Motion Picture Sound Editors Awards</span></td><td><span class=\"mw-redirect\">Outstanding Achievement in Sound Editing – Music Score and Musical for Episodic Long Form Broadcast Media</span></td><td data-sort-value=\"Brooks, Christopher\">Christopher Brooks <small>(for \"Nothing Like It in the World\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align: center;\"></td></tr><tr><td rowspan=\"4\"><span>MTV Movie &amp; TV Awards</span></td><td><span>Best Fight</span></td><td data-sort-value=\"Starlight, Queen Maeve, Kimiko vs. Stormfront\">\"Starlight, Queen Maeve, Kimiko vs. Stormfront\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\" style=\"text-align: center;\"></td></tr><tr><td><span>Best Hero</span></td><td data-sort-value=\"Quaid, Jack\"><span>Jack Quaid</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Show</span></td><td data-sort-value=\"Boys, The\"><i>The Boys</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Villain</span></td><td data-sort-value=\"Cash, Aya\">Aya Cash</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Original Music and Lyrics</span></td><td data-sort-value=\"Never Truly Vanish\">\"Never Truly Vanish\" – <span>Christopher Lennertz</span> and Michael Saltzman <span style=\"font-size:85%;\">(for \"The Big Ride\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"5\" style=\"text-align:center;\"></td></tr><tr><td><span>Outstanding Sound Mixing for a Comedy or Drama Series (One-Hour)</span></td><td data-sort-value=\"Fehrman, Alexandra, Rich Weingart\">Alexandra Fehrman, Rich Weingart and Thomas Hayek <span style=\"font-size:85%;\">(for \"What I Know\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Special Visual Effects in a Season or a Movie</span></td><td data-sort-value=\"Fleet, Stephan, Shalena Oxley-Butler\">Stephan Fleet, Shalena Oxley-Butler, Kat Greene, Rian McNamara, Tony Kenny, Steve Moncur, Julian Hutchens, Anthony Paterson and Keith Sellers</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Primetime Emmy Awards</span></td><td><span>Outstanding Drama Series</span></td><td data-sort-value=\"Kripke, Eric, Seth Rogen, Evan Goldberg\"><span>Eric Kripke</span>, <span>Seth Rogen</span>, <span>Evan Goldberg</span>, James Weaver, <span>Neal H. Moritz</span>, Pavun Shetty, Craig Rosenberg, <span class=\"mw-redirect\">Phil Sgriccia</span>, Rebecca Sonnenshine, Ken F. Levin, Jason Netter, <span>Garth Ennis</span>, <span>Darick Robertson</span>, Michael Saltzman, Michaela Starr, Gabriel Garcia and Hartley Gorenstein</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Writing for a Drama Series</span></td><td data-sort-value=\"Sonnenshine, Rebecca\">Rebecca Sonnenshine <span style=\"font-size:85%;\">(for \"What I Know\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Saturn Awards</span></td><td><span>Best Performance by a Younger Actor in a Television Series</span></td><td data-sort-value=\"Moriarty, Erin\"><span>Erin Moriarty</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td><span>Best Superhero Television Series</span></td><td data-sort-value=\"Boys, The\"><i>The Boys</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Screen Actors Guild Awards</span></td><td><span>Outstanding Performance by a Stunt Ensemble in a Comedy or Drama Series</span></td><td data-sort-value=\"Boys, The\"><i>The Boys</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align: center;\"></td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Television: Dramatic Series</span></td><td data-sort-value=\"Kripke, Eric, Ellie Monahan\">Eric Kripke, Ellie Monahan, Anslem Richardson, Craig Rosenberg, Michael Saltzman and Rebecca Sonnenshine</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align: center;\"></td></tr><tr><td style=\"text-align: center;\" rowspan=\"5\">2022</td><td><span>People's Choice Awards</span></td><td>The Bingeworthy Show of 2022</td><td><i>The Boys</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align: center;\"></td></tr><tr><td rowspan=\"4\"><span>Saturn Awards</span></td><td><span>Best Streaming Action/Adventure Television Series</span></td><td><i>The Boys</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"4\" style=\"text-align: center;\"></td></tr><tr><td><span class=\"mw-redirect\">Best Actor in a Streaming Television Series</span></td><td>Antony Starr</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Actress in a Streaming Television Series</span></td><td>Erin Moriarty</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Guest-Starring Performance in a Streaming Television Series</span></td><td><span>Jensen Ackles</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td style=\"text-align: center;\" rowspan=\"8\">2023</td><td><span>Critics' Choice Awards</span></td><td><span>Best Actor in a Drama Series</span></td><td>Antony Starr</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align: center;\"></td></tr><tr><td rowspan=\"4\"><span>Critics' Choice Super Awards</span></td><td>Best Superhero Series, Limited Series or Made-for-TV Movie</td><td><i>The Boys</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"4\" style=\"text-align: center;\"></td></tr><tr><td>Best Actor in a Superhero Series, Limited Series or Made-for-TV Movie</td><td>Antony Starr</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Actress in a Superhero Series, Limited Series or Made-for-TV Movie</td><td>Erin Moriarty</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Villain in a Series, Limited Series or Made-for-TV Movie</td><td>Antony Starr</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Satellite Awards</span></td><td><span>Best Genre Series</span></td><td><i>The Boys</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Screen Actors Guild Awards</span></td><td><span>Outstanding Performance by a Stunt Ensemble in a Television Series</span></td><td><i>The Boys</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Visual Effects Society Awards</span></td><td><span>Outstanding Visual Effects in a Photoreal Episode</span></td><td>Stephan Fleet, Shalena Oxley-Butler, Tristan Zerafa, Anthony Paterson, Hudson Kenny <span style=\"font-size:85%;\">(for \"Payback\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr></tbody></table><br/><h3>Franchise</h3><h4>Spin-offs</h4><h4>The Boys Presents: Diabolical</h4><p>On December 5, 2021, at the Brazil Comic-Con, Prime Video announced that The Boys Presents: Diabolical, an animated anthology series, had been given an eight-episode series order. On January 18, 2022, it was announced that the series would premiere on March 4, 2022.</p><h4>Gen V</h4><p>On September 24, 2020, it was announced that a spin-off centered on a superhero college had been fast-tracked into development upon the ratings success of the series' second season. Described as being \"part college show, part Hunger Games\", the spin-off is to be set \"... at America's only college exclusively for young adult superheroes (and run by Vought International)\" and is described as \"an irreverent, R-rated series that explores the lives of hormonal, competitive Supes as they put their physical, sexual, and moral boundaries to the test, competing for the best contracts in the best cities\". On October 2, 2020, Kripke stated the series would focus on the G-Men team that had been mentioned in the first season, a parody of the X-Men. On September 27, 2021, the untitled spin-off was given a series order by Amazon Studios. Filming of the series, titled Gen V, beginning at the University of Toronto in May 2022 and the Claireville Conservation Area, Brampton in July, intended for an October wrap.</p><h4>Other media</h4><h4>Vought News Network</h4><p>Ahead of the premiere of the third season, the series had released video segments in the form of in-universe news reports from the Vought News Network channel on YouTube, titled Seven on 7 with Cameron Coleman. Each of the seven segments contains seven stories that tease events in upcoming episodes and introduce new cast members, and acts as a bridge between Season 2 and 3. Matthew Edison, who plays news anchor Cameron Coleman, also appears in the third season of the series.</p><h4>Supe Porn</h4><p>On October 3, 2020, Eric Kripke said that the in-universe pornographic superhero film scenes briefly glimpsed in the second season The Boys episode \"Butcher, Baker, Candlestick Maker\" had been produced in full, expressing interest in releasing them under the name Supe Porn to the website of the same name, registered to Sony Pictures, as well as supposedly requesting Seth Rogen, Evan Goldberg, Antony Starr and the other followers of his Twitter page to join him in petitioning Prime Video and Amazon Studios to allow the potential web series to be uploaded. Later on, a fictional sex toy online store was added to the website, with a collection of products such as The StarMight Plug and Translucent's Glass Dildo. At the bottom of the website there is a message saying that its contents are for entertainment purpose only and not actually for sale.</p><br/>"
  },
  "errorMessage": ""
}