{
  "imDbId": "tt11280740",
  "title": "Severance",
  "fullTitle": "Severance (TV Series 2022– )",
  "type": "TVSeries",
  "year": "2022",
  "items": [
    {
      "username": "doomedmac",
      "userUrl": "https://www.imdb.com/user/ur111092901",
      "reviewLink": "https://www.imdb.com/review/rw8043079",
      "warningSpoilers": false,
      "date": "8 April 2022",
      "rate": "9",
      "helpful": "715 out of 781 found this helpful.",
      "title": "This is brilliant",
      "content": "I can't remember the last time I was so invested in a TV show. I was hooked from the first episode, and constantly impressed with the directing, visuals, acting, and plot developments. It's like a cross between Black Mirror and 1984, but it might be better than both of those works of art. This is truly something special and I COULD NOT be more excited for season 2."
    },
    {
      "username": "bosporan",
      "userUrl": "https://www.imdb.com/user/ur65745671",
      "reviewLink": "https://www.imdb.com/review/rw8003774",
      "warningSpoilers": true,
      "date": "25 March 2022",
      "rate": "10",
      "helpful": "455 out of 521 found this helpful.",
      "title": "Seminal TV, potentially a ground-breaking classic",
      "content": "Severance is a study of the philosophy and ethics of self. A dry lecture? Nothing could be further from the truth, this is a tightly-written, entertaining work of TV with these weighty concepts shown through story with little or no jarring exposition dumps.Visual cues such as the 'innie' 60's monotone dress code and the bland featureless white environment together with the monotonous meaningless work deny hope and support conformity. Garish reward events apply Pavlov conditioning, the punishments and close supervision create an environment of fear and uncertainty providing easy control.The gradual awakening of the 'inmates' and the ensuing disobedience, rebellion and subsequent violence is the core of this very human story. All this in a backdrop of consequential slow-reveal of an ever more complex situation and underlying uncertainty regarding the goals and motivation of the de facto prison guards.Addendum: Just watched the season one finale - it is simply superb, a fitting end to a fine series and creating massive potential for season 2. Just upgraded from 9* to 10* - very rare for me!"
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw8000965",
      "warningSpoilers": false,
      "date": "24 March 2022",
      "rate": "10",
      "helpful": "639 out of 744 found this helpful.",
      "title": "To me it's a masterpiece",
      "content": "If you think about it in a deeper sense the Severance corporation is a metaphor of for how trapped workers are in their job, that's my theory. I love it all I'm surprised a few hated it something about waiting for something that's ridiculous or they know the nothing, seems to be a buildup and a lot to learn about the series regardless the show is magnificent! The thriller aspect is glorious and I'm a couple episodes in. When the show first released it had a 7.2 and jumped to 8.2 that's well deserved!"
    },
    {
      "username": "jack_o_hasanov_imdb",
      "userUrl": "https://www.imdb.com/user/ur55640799",
      "reviewLink": "https://www.imdb.com/review/rw8085041",
      "warningSpoilers": false,
      "date": "23 April 2022",
      "rate": "10",
      "helpful": "245 out of 282 found this helpful.",
      "title": "Very Original",
      "content": "I loved this Apple + series very much. First of all, the subject is very original and high quality. The acting is just perfect. The script is great, the music is great. The episodes progress slowly, but they are always exciting, and the season finale was simply great. I can't find anything else to say. I'm waiting the other seasons..."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8793476",
      "warningSpoilers": false,
      "date": "11 January 2023",
      "rate": "9",
      "helpful": "80 out of 88 found this helpful.",
      "title": "Brilliant!",
      "content": "I had no idea what to expect when I first starting watching Severance. It not only lives up to all the hype but surpasses it. As you can see from the reviews and ratings here, people loved this show and I'm no different. I have to warn you though that's it's addicting once you start watching this and you'll want to binge it as quickly as possible. It's just such a thoughtful, original show that will have you guessing throughout the show. Along with the acting and writing the visuals are just great here. I literally can't find one negative thing to say about this incredible show. You'll have a blast watching this."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8455094",
      "warningSpoilers": false,
      "date": "16 August 2022",
      "rate": "9",
      "helpful": "82 out of 93 found this helpful.",
      "title": "As good as everyone says it is!",
      "content": "Severance is every bit as good as everyone says it is. All you have to do is read through the reviews and look the rating to see how much people think of this series. It's on every \"best shows of 2022\" list out there for a reason and will absolutely be nominated for a ton of awards! Adam Scott leads an amazing cast who all do a fantastic job. It's just such an original show that will keep you wanting more. The first episode may start a little slow for some but stick with it because I promise that you won't regret it. If you stay with it I guarantee it will become one of your favorite shows of the year. I'm so glad they already decided to pick it up for future seasons!"
    },
    {
      "username": "DukeEman",
      "userUrl": "https://www.imdb.com/user/ur0179443",
      "reviewLink": "https://www.imdb.com/review/rw7879739",
      "warningSpoilers": false,
      "date": "19 February 2022",
      "rate": "9",
      "helpful": "313 out of 375 found this helpful.",
      "title": "Waiting for Mark...",
      "content": "How I would love to go home after work and not remember a damn thing! If that was the case, work attendance would be at an all time high. With no stress or anxiousness about work, you'll just show up, because that's what you are paid to do. But that's the pros, as for the cons...Without giving away too much, the first 2 episodes achieve putting the viewer into the mind frame of the characters who take on the bizarre act of Severance for a large secretive corporation. The viewer is then given enough interest and mystery to latch onto with a drip-feed of vital information in this beauty of a slow-burner. Overall it is an Orwellian-Kafkaesque mind teaser with a hint of Beckett's Godot dialogue. The perfect ingredient for a modern trippy journey into the unknown corporate dystopian..."
    },
    {
      "username": "MogwaiMovieReviews",
      "userUrl": "https://www.imdb.com/user/ur60689236",
      "reviewLink": "https://www.imdb.com/review/rw8552491",
      "warningSpoilers": false,
      "date": "18 September 2022",
      "rate": "8",
      "helpful": "47 out of 52 found this helpful.",
      "title": "George Orwell's \"The Office\"",
      "content": "The office workers for a mysterious and somewhat creepy company have all had their minds split into two, with their 'work' lives and 'home' lives having no knowledge of each other.-------------------------Just finished watching the first season of this, and it's been a real find. Nothing life-changing or even completely original, but a very, very good show, well-written, directed and acted the whole way through, with Tramell Tillman and Patricia Arquette coming out tops at stealing most scenes they're in, but Christopher Walken and John Torturro are splendid, too. Every character is intriguing and believable, and the revelations of the parts we get to see of their other lives all make sense and successfully propel the story along in ways that never feel manipulative or cheating.If I were to try describe the experience of watching it to someone I would probably say it's a bit of a knock-off of various Charlie Kaufmann films - particularly Being John Malkovich and Eternal Sunshine Of The Spotless Mind - pitched somewhere in the vicinity of The Truman Show or Westworld, if Westworld was any good and still liked the human race.If there's any downsides, I would say it probably could have done a little more with the human ramifications of the process, showing us in greater detail what the severed characters were feeling and how the world appeared to them in this confused and diminished state. And I also think they could have told the story a little faster: I don't have great hopes that the quality will remain this high into further seasons, and I would have rather they made it a complete, standalone miniseries instead. Having said that, I'll be definitely be counting the months till it returns."
    },
    {
      "username": "MoistMovies",
      "userUrl": "https://www.imdb.com/user/ur19484559",
      "reviewLink": "https://www.imdb.com/review/rw7882919",
      "warningSpoilers": false,
      "date": "20 February 2022",
      "rate": "10",
      "helpful": "295 out of 356 found this helpful.",
      "title": "This could be the start of something great. **Update, from 8 to 10 by ep 9. Next big hit show if sanity still prevails these days.",
      "content": "Edit* Episode 9 S1 is one of the greatest TV eps I've seen from a serialised show, still telling the story but it shines so much brighter. Ben Stiller directed it personally. And deserves awards and recognition for it.Only two episodes are out. So I'm going to keep this very short for now and update with a full review at the end of the series.All I'll spoil, because I went into the plot blind before watching. Only going by the actors/director, stiller is still one of few unique film makers in hollyweird that can pull in great actors and decent budgets. This is series unlike anything airing and has great potential to be considered one of the greats of offbeat irreverent dark comedy series ever. Can't wait for the world building.Just give this one a chance, so far it's not political or effected by the real world. It's a universe unto itself. And I love it so far."
    },
    {
      "username": "skintone-38600",
      "userUrl": "https://www.imdb.com/user/ur68081993",
      "reviewLink": "https://www.imdb.com/review/rw8763610",
      "warningSpoilers": false,
      "date": "28 December 2022",
      "rate": "10",
      "helpful": "24 out of 25 found this helpful.",
      "title": "Unique, an absolute masterpiece",
      "content": "Wow, what an incredible creation is this show.It comes as a complete surprise to be totally drawn in and captured by this magnificent piece of TV work.At the start, much of the appeal comes from the weird feel and mystery about what the hell is going on here.Then, with each episode, the suspense picks up and you are drawn in even further.The other important aspect that makes this show so special is the amazing acting performance by Adam Scott. I was spell bound by his performance. It is unusually subtle and understated,but every facial expression, every word he utters is somehow spell binding.The other actors are all excellent as well, and this is always for me the crucial aspect of whether a show will be watchable or not.This show is unique and brilliant and really is essential viewing."
    },
    {
      "username": "mkayseryan",
      "userUrl": "https://www.imdb.com/user/ur108099712",
      "reviewLink": "https://www.imdb.com/review/rw7875673",
      "warningSpoilers": false,
      "date": "18 February 2022",
      "rate": "9",
      "helpful": "352 out of 426 found this helpful.",
      "title": "Impressive",
      "content": "I expected a comedy because of who the lead is , the first minute in you can just feel this show has immense quality behind it there has to be a team that actually cares about what they put on the screen. The first 3-4 minutes gives you a scary idea of the world of the show and I loved it. The direction is simple but the tone , writing score and atmosphere is perfectly done ."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw8055394",
      "warningSpoilers": false,
      "date": "13 April 2022",
      "rate": "9",
      "helpful": "153 out of 186 found this helpful.",
      "title": "separating your mind means separating the you you are",
      "content": "\"Severance\" is one of the most disturbing shows that you'll ever see. The sad thing is that so many corporations do this sort of thing to people, turning them into mere cogs in the machine.Definitely see it."
    },
    {
      "username": "grahamvandyke",
      "userUrl": "https://www.imdb.com/user/ur26642588",
      "reviewLink": "https://www.imdb.com/review/rw8729293",
      "warningSpoilers": false,
      "date": "11 December 2022",
      "rate": "10",
      "helpful": "24 out of 25 found this helpful.",
      "title": "This. Is. Incredible.",
      "content": "There really aren't enough positive things to say about this potential masterpiece of art. I want to go on record as saying if the show manages to keep this quality up for it's entire run length, this will be the first show I have watched since Breaking Bad to be as close to perfection as possible.Admittedly, things start off slow and drag slightly with the first episode. Fear not though, because Severance picks up with an increasing amount of drama and mystery, climaxing perfectly with a season finale that balances that fine line of leaving you wanted more, while quenching your appetite to remain satisfied until Season 2.Every metric you can measure and judge a TV show on is on display with absolute mastery. The casting, acting, script, direction, cinematography, lighting, set decoration.. everything is perfect.Actually I noticed a running theme for this review I've written is the word \"perfect\". So I'll leave you all with that, and watch the damn show already."
    },
    {
      "username": "julieshotmail",
      "userUrl": "https://www.imdb.com/user/ur110936802",
      "reviewLink": "https://www.imdb.com/review/rw8042347",
      "warningSpoilers": false,
      "date": "8 April 2022",
      "rate": "10",
      "helpful": "119 out of 147 found this helpful.",
      "title": "Season 1 and it's an instant classic",
      "content": "Following \"Severance\" for the past two months as each weekly episode drops reminds you of just how wonderful it is to witness things as they unfold for the first time. Well-cast, brilliantly-directed and edited, with one of the most spellbinding opening sequences in recent TV history, \"Severance\" is the perfect blend of Sci-fi, human interest, mystery, dystopia, and dark comedic undertones. \"Black Mirror\" is the only comparison that comes to mind but that show falls under the anthology category, therefore \"Severance\" is quite unlike any TV series you've ever seen before. As the mystery unfolds, you can't help but think about the layers upon layers of possibilities and various implications. While the early episodes may appear ho-hum, buzzing slowly, they are actually intricately developing each textured character if you pay close attention, positioning you for a satisfying payoff. Every actor stands out in their own right, from the trusty lead Adam Scott to veterans Patricia Arquette, John Torturo, Christopher Walken to Tramell Tillman as Milchick, my surprise favorite. This show is complex, and so for those who have not seen this yet and want to be entertained (Defiant Jazz!) and mentally stimulated at the same time, I recommend not waiting much longer to start S1E1!"
    },
    {
      "username": "tm-sheehan",
      "userUrl": "https://www.imdb.com/user/ur25552762",
      "reviewLink": "https://www.imdb.com/review/rw8001156",
      "warningSpoilers": true,
      "date": "24 March 2022",
      "rate": "9",
      "helpful": "149 out of 189 found this helpful.",
      "title": "Metropolis meets 1984 Intrigue Suspense and Talent",
      "content": "My Review - Severance Streaming on Apple TV+ My Rating 9/10I usually don't review a series before the first season finishes but the first 5 episodes Severance has impressed me so much that if the quality of the final 4 instalment is as good as the first 5 perhaps my rating will be a TEN.Ben Stiller has directed 6 episodes of this critically acclaimed first series he said I read the screenplay to the pilot episode at least five years before the show premiered, calling it \"the longest thing I've ever worked on .\" His Production Company Red Hour Productions, was impressed and took up this futuristic story which doesn't look to far away set in a huge Corporate workplace that looks more like a minimalist factory. I would describe the series a little like the famous Fritz Lang's Classic Science Fiction movie of 1927 Metropolis meets George Orwell's \"1984\".The series looks great with minimalist sets or work stations with a very cold colour palette to help create the menacing environment . Filmed at the old Bell Labs building in Holmdel, New Jersey. The water tower out front was supposedly shaped like a transistor.In January 2017, Ben Stiller invited Adam Scott to star as Mark the promoted Team Leader of four employees at a sinister biotech corporation, Lumon Industries. Lumon uses a \"severance\" medical procedure to separate the non-work memories of some of their employees from their work memories .Mark, gradually uncovers the web of conspiracy from both sides of the division.Every character in this series I find interesting and the development of the story so far mesmerising it will eventually span 19 episodes so a long way to go.A few standout characters Mark of course a recently widowed nice guy who like all the employees of Lumon is very efficient because at work personal problems are forgotten as that part of their memory has been voluntarily severed.However when work finishes they have no memory recall of their work life.In fact no one working at Lumen really seems to know what they are working at because it's all coded but all are told it's vitally important.John Turturro as Irving and Christopher Walken as Burt develop an interesting and intimate work relationship working in different divisions they are not supposed to mix or form any sort of intimacy with other employees .Britt Lower as Helly a young new recruit tries to resign but no one seems to leave voluntarily at Lumon her workmate Dylan played by Zach Cherry is the joker of the work team and doesn't really get why his workmates are experiencing anxiety and just wants a quite life.The standout performance of this series for me so far is Patricia Arquette as Harmony Cobel for viewers of The Handmaid's Tale Harmony Cobel makes Aunt Lydia Clements look like Mary Poppins . Harmony is the most chilling character I've seen in a long while she is Big Brother,sorry Big Sister and spends her work days monitoring every workers performance and behaviour. Harmony is expressionless and unemotional assigning her henchman and spy Milchick to (Tramel Tillman ) to escort and administer disciplinary therapy to workers who step out of line.Patricia Arquette's character Harmony also spies on Mark in disguise a friendly old dear living next door I'm certain she's channeling the Evil Queen in Snow White . Mark of course so far has no idea who this seemingly sweet she really is as his work memory is severed from his personal life I can see an Emmy award in the future for her chilling role in Severance.I'll add to my review of course as series 1 of Severance concludes but I had to recommend it as this Apple TV Production I think is a stand out series ."
    },
    {
      "username": "MongoLloyd",
      "userUrl": "https://www.imdb.com/user/ur11298748",
      "reviewLink": "https://www.imdb.com/review/rw7990208",
      "warningSpoilers": false,
      "date": "20 March 2022",
      "rate": "10",
      "helpful": "163 out of 203 found this helpful.",
      "title": "Just what the doctor ordered.",
      "content": "I was ready to completely give up on episodic shows and then this happened, an actual diamond of a show among formulaic, recycled, regurgitated, pandering piffle. The production design and cinematography is inspiring and the cast is excellent. Narratively speaking, it's about as engaging and compelling as anything I'd consider a \"best\" example of any screened entertainment I've ever seen. Which means, it'll probably not be renewed for a 2nd season because it's just too original and interesting for American audiences."
    },
    {
      "username": "Joshumms",
      "userUrl": "https://www.imdb.com/user/ur103353076",
      "reviewLink": "https://www.imdb.com/review/rw7877489",
      "warningSpoilers": false,
      "date": "18 February 2022",
      "rate": "8",
      "helpful": "185 out of 235 found this helpful.",
      "title": "Offbeat and interesting!",
      "content": "Very interesting show, it's always unsettling and you never feel like what's going on is normal. There's always so many things that you are questioning and it keeps you engaged and interested. There's some dark, offbeat humor mixed in as well. Great acting and music and an offbeat unsettling style, very excited for the rest of the series."
    },
    {
      "username": "groundzero-273-397110",
      "userUrl": "https://www.imdb.com/user/ur30812911",
      "reviewLink": "https://www.imdb.com/review/rw8752331",
      "warningSpoilers": true,
      "date": "23 December 2022",
      "rate": "10",
      "helpful": "17 out of 18 found this helpful.",
      "title": "For now, this show is a 10/10 for me and I hope it stays that way after season 2.",
      "content": "This show was so good, one of the best I have seen this year for sure! The whole idea is very original, and the story development is so good and exciting. I just wanted to play the next episode right away after the previous one finished.Severance is very well-written. The whole mystery about this secretive company and the atmosphere inside the workplace is so well done. And what is the purpose of the employees job? What are they actually doing on those computers?The characters are perfectly cast in my opinion, and the acting was fantastic as well. I was so excited to see more from the characters private-self, and I did not see the twists coming that was revealed in the end of the season. For example, that Helly's innie was the complete opposite of her outie. Inside the workplace, she wants to kill herself, which she even tries to do, and her outie is actually a descendant of Kier and a high-level executive in the company. Just crazy and phenomenal. The last episode was so intense, can't wait for season 2!For now, this show is a 10/10 for me and I hope it stays that way after season 2. I have made 999 ratings on this site, and I'm glad that this show, a show that I give 10/10, will be my #1000."
    },
    {
      "username": "leesimon-26357",
      "userUrl": "https://www.imdb.com/user/ur126737391",
      "reviewLink": "https://www.imdb.com/review/rw8594429",
      "warningSpoilers": false,
      "date": "7 October 2022",
      "rate": "10",
      "helpful": "25 out of 29 found this helpful.",
      "title": "Beautiful, thrilling and mysterious. Must see!",
      "content": "After a single viewing, this has already become one of my all-time favorite series. I highly recommend it to anyone that enjoys \"workplace corporate conglomerate mystery\" types of series.The set designs and costumes are so well done and add to the value of the viewing experience overall. It looks beautiful, and it is very evident that a lot of work has gone into the visual aspect of this series.The mystery aspect of it is very reminiscent of Devs, from a few years back. It is best to go into viewing this with no information or spoilers.The acting was great, and the story develops at a great speed.I'm bewildered by the low reviews for this series, because I don't know if I could love it more. I expect that I will re-watch the first season at least 5 more times before the second season comes out, and I can't wait."
    },
    {
      "username": "cliffmerayah",
      "userUrl": "https://www.imdb.com/user/ur83432316",
      "reviewLink": "https://www.imdb.com/review/rw8576785",
      "warningSpoilers": false,
      "date": "29 September 2022",
      "rate": "9",
      "helpful": "58 out of 63 found this helpful.",
      "title": "On another level!",
      "content": "I can't even describe the show. It's unlike anything I have ever seen.Remember that feeling you had after watching The Truman Show or The Sixth Sense for the very first time? The feeling that you had experienced something unique? It's the exact same sensation Severance gave me. It's odd, it's smart, it's fresh and I loved every single minute of it. It's the best writing and acting I have seen in years.Every episode makes you hungry for the next one, and the next one, and... well, you get the point. All I can say is, stop scrolling through these reviews and go watch it, because you're in for a treat."
    },
    {
      "username": "gareth-75442",
      "userUrl": "https://www.imdb.com/user/ur109188739",
      "reviewLink": "https://www.imdb.com/review/rw8044922",
      "warningSpoilers": true,
      "date": "9 April 2022",
      "rate": "10",
      "helpful": "100 out of 133 found this helpful.",
      "title": "Amazing, riveting, incredible,mysterious, best show for years",
      "content": "Severance is incredible, yes it's a slow burn from episode one but each episode keeps you enthralled with the excellent characters and tidbits of reveals thru to the season finale, never have I been so gripped to the edge of my seat with any show as I was with episode 9, literally shouting at the screen \"show him a photo\".Excellently written and superbly acted by the entire cast, bring on season two, as Irving exclaimed \"let's burn this place to the ground\".Can't wait!!"
    },
    {
      "username": "aboalhyjaa",
      "userUrl": "https://www.imdb.com/user/ur69239269",
      "reviewLink": "https://www.imdb.com/review/rw7937530",
      "warningSpoilers": false,
      "date": "11 March 2022",
      "rate": "9",
      "helpful": "138 out of 190 found this helpful.",
      "title": "1984 big brother",
      "content": "4 episode in and just wow, every character and every scene just screams 1984. In a good way, because thats one of the best novels to ever be.Its true, some of the scenes are uncomfortable to see, but we should see! Because this acting is a somewhat reflection to our lives and our jobs with capitalism dominating everything and destroying every meaning of live and make humans a semi robot who separates their lives from their work!The concept of the show is kinda freaky, will you as a fully-brained human, willingly sentence a part of yourself for slavery for 8 hours a day?. To you it doesn't feel a thing like a small nap and you still have 2/3 of the day to live. But for that part of you it seems infinite, always working! The literal definition of slavery!"
    },
    {
      "username": "lucaschriskowalski",
      "userUrl": "https://www.imdb.com/user/ur129447059",
      "reviewLink": "https://www.imdb.com/review/rw7886105",
      "warningSpoilers": false,
      "date": "21 February 2022",
      "rate": "9",
      "helpful": "106 out of 140 found this helpful.",
      "title": "I want more",
      "content": "Smashed the first two episodes and look forward to more. Looks amazing and feels claustrophobic, there is a real visual separation between the work and home self. Dialogue is witty and sharp, the fact that Ben Stiller directed this blows my mind. Great TV to kick off 2022."
    },
    {
      "username": "Littleman95",
      "userUrl": "https://www.imdb.com/user/ur122397455",
      "reviewLink": "https://www.imdb.com/review/rw8043298",
      "warningSpoilers": false,
      "date": "8 April 2022",
      "rate": "9",
      "helpful": "75 out of 101 found this helpful.",
      "title": "Do Not Drop It, And You'll Be Rewarded",
      "content": "As for Season 1:Plot: after a very weird and quite stretched beginning (around three episodes or four, if I don't remember wrong), things will start being more and more clear and that's what everyone will have to wait before actually enjoy this show.By the way, the story itself is very good. Everyone who likes mystery/thriller should enjoy this.Actors & Actress and Acting: well, also this topic here is one that, the more you go through the show, the more you'll appreciate.Conclusion: do you like mystery/thriller? You'll have to watch this (not try, because the first episodes are the big obstacle you have to jump over before getting into the actual show, so try not to drop it).I have nothing else to say. Just watch it."
    },
    {
      "username": "pauliewalnuts-49356",
      "userUrl": "https://www.imdb.com/user/ur69565551",
      "reviewLink": "https://www.imdb.com/review/rw8739551",
      "warningSpoilers": false,
      "date": "16 December 2022",
      "rate": "10",
      "helpful": "13 out of 14 found this helpful.",
      "title": "Genuinely magnificent",
      "content": "I happened to get a free trial for Apple TV and decided to give it a go having heard nothing about it.I proceeded to smash the entire series in one hit and am now absolutely gutted I have to wait for the next instalment!This is a seminal tv programme that comes along once in a blue moon,something different,something that makes you think.On the surface it seems great ,a work you and a private you,but the more this series went on you realise that both versions have no real control over their lives and are living in hell.There are so many metaphors and thinking points I couldn't even begin to list them It is beautifully shot,the acting magnificent,the score absolutely haunting.There is so much to talk about with this series but no one I know has watched it yet!!!A truly brilliant series...just wow!"
    }
  ],
  "errorMessage": ""
}