{
  "imDbId": "tt11280740",
  "title": "Severance",
  "fullTitle": "Severance (TV Series 2022– )",
  "type": "TVSeries",
  "year": "2022",
  "language": "en",
  "titleInLanguage": "Severance (TV series)",
  "url": "https://en.wikipedia.org/wiki/Severance_(TV_series)",
  "plotShort": {
    "plainText": "Severance is an American science fiction psychological thriller television series created by Dan Erickson and directed by Ben Stiller and Aoife McArdle. It stars Adam Scott, Zach Cherry, Britt Lower, Tramell Tillman, Jen Tullock, Dichen Lachman, Michael Chernus, John Turturro, Christopher Walken, and Patricia Arquette. The plot follows Mark (Scott), an employee of Lumon Industries who agrees to a \"severance\" program in which his non-work memories are separated from his work memories.\r\nThe series premiered on Apple TV+ on February 18, 2022. It received acclaim from critics and audiences, who praised its cinematography, direction, production design, musical score, story, and performances (especially Scott). The series received 14 nominations at the 74th Primetime Emmy Awards including Outstanding Drama Series and acting nods for Scott, Turturro, Walken, and Arquette (winning for Main Title Design and score). In April 2022, the series was renewed for a second season.",
    "html": "<p>Severance is an American science fiction psychological thriller television series created by Dan Erickson and directed by Ben Stiller and Aoife McArdle. It stars Adam Scott, Zach Cherry, Britt Lower, Tramell Tillman, Jen Tullock, Dichen Lachman, Michael Chernus, John Turturro, Christopher Walken, and Patricia Arquette. The plot follows Mark (Scott), an employee of Lumon Industries who agrees to a \"severance\" program in which his non-work memories are separated from his work memories.</p><p>The series premiered on Apple TV+ on February 18, 2022. It received acclaim from critics and audiences, who praised its cinematography, direction, production design, musical score, story, and performances (especially Scott). The series received 14 nominations at the 74th Primetime Emmy Awards including Outstanding Drama Series and acting nods for Scott, Turturro, Walken, and Arquette (winning for Main Title Design and score). In April 2022, the series was renewed for a second season.</p>"
  },
  "plotFull": {
    "plainText": "Severance is an American science fiction psychological thriller television series created by Dan Erickson and directed by Ben Stiller and Aoife McArdle. It stars Adam Scott, Zach Cherry, Britt Lower, Tramell Tillman, Jen Tullock, Dichen Lachman, Michael Chernus, John Turturro, Christopher Walken, and Patricia Arquette. The plot follows Mark (Scott), an employee of Lumon Industries who agrees to a \"severance\" program in which his non-work memories are separated from his work memories.\r\nThe series premiered on Apple TV+ on February 18, 2022. It received acclaim from critics and audiences, who praised its cinematography, direction, production design, musical score, story, and performances (especially Scott). The series received 14 nominations at the 74th Primetime Emmy Awards including Outstanding Drama Series and acting nods for Scott, Turturro, Walken, and Arquette (winning for Main Title Design and score). In April 2022, the series was renewed for a second season.\r\nPremise\r\nA biotechnology corporation, Lumon Industries, uses a mindwipe medical procedure called \"severance\" to separate the consciousness of their employees between their lives at work and outside of it. Due to their increasingly divergent life experiences, the consciousnesses of the employees in the work place (dubbed \"innies\") gradually split from their consciousnesses outside of it (dubbed \"outies\"), to the point that they become distinct personalities with their own agendas. One severed employee, Mark (Adam Scott), gradually uncovers a web of conspiracy at Lumon, and the mysterious project the employees are unknowingly working on.\r\nCast and characters\r\nMain\r\nAdam Scott as Mark S., a worker for Lumon Industries in the Macrodata Refinement division who is part of the \"severance\" program, whose \"outie\", Mark Scout, is grieving the death of his wife Gemma.\r\nZach Cherry as Dylan G., Mark's severed co-worker who particularly enjoys company perks.\r\nBritt Lower as Helly R., a new employee who replaces Petey, much to her chagrin.\r\nTramell Tillman as Seth Milchick, the supervisor on the severed floor.\r\nJen Tullock as Devon Hale, Mark's pregnant sister, who later gives birth to baby Eleanor.\r\nDichen Lachman as Ms. Casey, the wellness counselor on the severed floor.\r\nMichael Chernus as Ricken Hale, Devon's husband and Mark's brother-in-law, a self-help author, whose book is left on the severed floor by Milchick.\r\nJohn Turturro as Irving Bailiff, Mark's severed co-worker who is a stickler for company policy and is drawn to Burt.\r\nChristopher Walken as Burt Goodman, the severed chief of the Optics and Design division who is drawn to Irving.\r\nPatricia Arquette as Harmony Cobel, Mark's unsevered boss, who outside of work goes undercover as Mrs. Selvig, Mark's next-door neighbor.\r\nRecurring\r\nYul Vazquez as Peter \"Petey\" Kilmer, an unsevered Lumon worker and Mark's best friend who was fired under mysterious circumstances.\r\nMichael Cumpsty as Doug Graner, the head of security on Lumon's severed floor.\r\nNikki M. James as Alexa, Devon's midwife.\r\nSydney Cole Alexander as Natalie, Lumon's PR representative and liaison for its board of trustees.\r\nNora Dale as Gabby Arteta, a new mother married to Senator Angelo Arteta. She underwent severance to avoid the pain of childbirth.\r\nClaudia Robinson as Felicia, Optics employee at Lumon.\r\nMark Kenneth Smaltz as Judd, security guard at Lumon.\r\nGuest\r\nMarc Geller as Kier Eagan, the founder of Lumon Industries, who is worshipped with cult-like devotion within the company. Despite his death, he is represented through sculptures, paintings, and recordings.\r\nCassidy Layton as June, Petey's daughter.\r\nJoanne Kelly as Nina, Petey's ex-wife.\r\nEthan Flower as Angelo Arteta, a Lumon-backed state senator who supports legalizing the Severance procedure and is married to Gabby Arteta, with whom he has three children.\r\nKaren Aldridge as Reghabi, a former Lumon surgeon who reintegrated Petey.\r\nMichael Siberry as Jame Eagan, the current CEO of Lumon Industries.\r\nBen Stiller has an uncredited voice cameo as an animated version of Kier Eagan.\r\nEpisodes\r\nProduction\r\nBackground\r\nWhile studying English at Western Washington University, Erickson became interested in the theater department, writing short plays and other creative works. Soon after, Erickson attended New York University, where he got a master's degree in television writing. In 2016, his screenplay for the pilot of Severance appeared on Blood List's survey results of the best unproduced genre screenplays. Erickson had worked in an office job before writing the show, stating in an interview, \"The initial ideas came to me while I was working a really bad office job and going through a somewhat depressive state.\" Erickson said his job was so mind-numbing that he wished he could \"skip the eight hours of the workday, to disassociate and just get it over with\", which became the premise of the show. Erickson is close with his siblings, stating they were inspirations for some of the characters on the show.\r\nDevelopment\r\nBen Stiller first read the screenplay to the pilot episode at least five years before the show premiered, calling it \"the longest thing I've ever worked on.\" The script was submitted by Dan Erickson as a writing sample to Stiller's production company Red Hour Productions, and passed to Stiller by development executive Jackie Cohn. Stiller said he enjoyed the story's contributions to the workplace comedy. In January 2017, Stiller invited Adam Scott to star. In November 2019, Apple TV+ gave Severance a series order, with Stiller directing and Scott cast in the leading role. Stiller was only attached to direct the pilot but he decided to direct several more episodes as the series entered development.\r\nOn April 6, 2022, Apple renewed the series for a second season.\r\nFilming\r\nThe COVID-19 pandemic postponed the initial production start of March 2020. Principal photography for the first season started in New York City under the working title Tumwater on November 8, 2020, the day after the U.S. presidential election. The opening scene of the show was shot on January 6, 2021. The series filmed for a few days in Nyack in February and in Kingston and Beacon in March. In April, filming moved to central New Jersey, mainly in the Bell Labs Holmdel Complex which stood in for Lumon HQ. Filming was scheduled to conclude on June 23, 2021.\r\nProduction designer Jeremy Hindle blended corporate looks from the 1960s, 1970s, and 1980s for the show's distinctive look, and cited modernist architect Eero Saarinen as influential for the building design. Erickson said the mix of cars and technologies from different eras was meant to \"give a slight sense of disorientation\" and make Lumon \"feel unmoored from time and space\". Stiller said the prop master reconstructed old computers so the actors could actually do the work presented on the show in order to get adjusted to the office setting. These computers lacked an escape key, as a metaphor for the lack of control the Innies have while in Lumon's offices.\r\nThe second season will also shoot in New York and New Jersey, and began filming on October 3, 2022, in New York City, and was set to wrap on May 12, 2023. However, on May 8, 2023, production of the season was shut down due to the ongoing writers strike.\r\nCasting\r\nIn January 2020, Patricia Arquette, Britt Lower, Jen Tullock, and Zach Cherry were added to the cast. Tramell Tillman joined in February 2020, and John Turturro and Christopher Walken were added in November 2020. Dichen Lachman was cast in December 2020. Turturro said he recommended Walken for the role of Burt because he had known him for \"a long time and I don't have to really act like we're friends.\"\r\nOn October 31, 2022, Gwendoline Christie, Bob Balaban, Merritt Wever, Alia Shawkat, Robby Benson, Stefano Carannante, Ólafur Darri Ólafsson and John Noble were announced to have joined the cast for season two.\r\nInfluences\r\nRelatively recent media that influenced Severance include the online urban legend known as The Backrooms, the computer game The Stanley Parable, films including Office Space, Brazil, The Truman Show, and Eternal Sunshine of the Spotless Mind, and the Dilbert comic strips. Older influences include the existential hell in the Jean-Paul Sartre play No Exit and the totalitarian dystopia in the George Orwell novel Nineteen Eighty-Four. Aesthetically, the series was influenced by the films Brazil, Dark City, Playtime, and other films by Terry Gilliam.\r\nReception\r\nCritical response\r\nSeverance was met with critical acclaim upon its release. On the review aggregator website Rotten Tomatoes, 97% of 107 critics' reviews are positive, with an average rating of 8.5/10. The website's consensus reads: \"Audacious, mysterious, and bringing fresh insight into the perils of corporate drudgery, Severance is the complete package.\" Metacritic, which uses a weighted average, assigned a score of 83 out of 100 based on 36 critics, indicating \"universal acclaim\".\r\nThe series received a rating of 5 out of 5 stars from Lucy Mangan of The Guardian and Rachael Sigee of I, 4 out of 5 stars from Huw Fullerton of Radio Times, John Nugent of Empire, Alan Sepinwall of Rolling Stone and Anita Singh of The Telegraph, and 3.5 out of 4 stars from Patrick Ryan of USA Today. In her review, Mangan praised Stiller's direction, the writing, and the performances of the cast (particularly that of Arquette, Turturro, Walken and Tillman). Sigee also praised the performances, especially Scott's, Arquette's, Turturro's and Walken's, and wrote, \"Severance moves slowly but surely, allowing time to absorb both the impressive world-building and stunning visuals, its breathtaking cinematography and design. With an exceptional cast, this is an original, weird, thought-provoking and beautifully crafted story that asks just how much of ourselves we should give over to our jobs.\" Fullerton also praised Scott's performance and called the series \"an impressive creation.\" Nugent praised the direction, performances of Scott, Arquette, Turturro and Walken, and chemistry between the latter two. Sepinwall also praised Stiller's direction and the cast's performances (most notably that of Scott, Turturro, Walken, Lower and Tillman), in addition to the production design, tone, and season finale.\r\nGrading the series with an \"A\", Carly Lane of Collider stated that \"the most engrossing element of Severance is the many mysteries it presents, wrapped up in silent overarching questions of philosophy, morality, and free will versus choice, and as the series demonstrates, some of those questions aren't so easily solved, but some issues aren't as black-and-white as initially presented either.\" Also grading it with an \"A\", Ben Travers of IndieWire said, \"Whether you invest in the allegory, character arcs, or both, 'Severance' hits its marks. Erickson and his writing staff deserve a ton of credit. The season plays out cleanly and efficiently; episodes range from nearly 60 minutes to a crisp 40; cliffhangers abound, but they’re earned. This is serialized storytelling that knows how to make the most of its episodic format.\" Stephen Robinson of The A.V. Club gave it an \"A-\" grade and praised Stiller's direction and the cast, with the performances of Lower, Scott, Tillman, Turturro, Walken, Tullock and Cherry being singled out. From Entertainment Weekly, Kristen Baldwin graded it with a \"B+\" and highlighted the performances of Scott, Lower and Tillman, saying that \"Scott is a superb fit for Severance's central everyman, Lower brings an effective vulnerability to the acerbic Helly, and Tramell Tillman is an absolute force of charisma as Milchick.\"\r\nGiving the series an \"amazing\" score of 9 out of 10, Samantha Nelson of IGN wrote in her verdict, \"Severance uses a clever premise and excellent cast to set up an intriguing mystery that leaves plenty of room for the characters to evolve.\" Writing for Paste, Shane Ryan gave it an 8.1 out of 10 and praised the performances of Scott, Arquette and Tillman as well as Stiller and McArdle's direction. Kyle Mullin of Under the Radar gave it an 8 out of 10 and said, \"Severance's writer/creator Dan Erickson is another newcomer who pens scenes with veteran-level aplomb. Every scene is a Golden Age of TV gem in its own right. But Severance's dramatic heart resides at the workplace, where it also becomes a white-knuckle thriller. This is where director Ben Stiller especially shines, training his lens and setting the scenes. He certainly brings the best out of his cast.\"\r\nThe American Film Institute named it one of the ten best television programs of the year.\r\nCritics' top ten list\r\nAccolades\r\nThe first season was recognized with The ReFrame Stamp for hiring people of underrepresented gender identities, and of color.\r\nMarketing\r\nThe second season was teased during the Apple Event that took place on September 7, 2022, which featured Helly (Britt Lower).",
    "html": "<p>Severance is an American science fiction psychological thriller television series created by Dan Erickson and directed by Ben Stiller and Aoife McArdle. It stars Adam Scott, Zach Cherry, Britt Lower, Tramell Tillman, Jen Tullock, Dichen Lachman, Michael Chernus, John Turturro, Christopher Walken, and Patricia Arquette. The plot follows Mark (Scott), an employee of Lumon Industries who agrees to a \"severance\" program in which his non-work memories are separated from his work memories.</p><p>The series premiered on Apple TV+ on February 18, 2022. It received acclaim from critics and audiences, who praised its cinematography, direction, production design, musical score, story, and performances (especially Scott). The series received 14 nominations at the 74th Primetime Emmy Awards including Outstanding Drama Series and acting nods for Scott, Turturro, Walken, and Arquette (winning for Main Title Design and score). In April 2022, the series was renewed for a second season.</p><br/><h3>Premise</h3><p>A biotechnology corporation, Lumon Industries, uses a mindwipe medical procedure called \"severance\" to separate the consciousness of their employees between their lives at work and outside of it. Due to their increasingly divergent life experiences, the consciousnesses of the employees in the work place (dubbed \"innies\") gradually split from their consciousnesses outside of it (dubbed \"outies\"), to the point that they become distinct personalities with their own agendas. One severed employee, Mark (Adam Scott), gradually uncovers a web of conspiracy at Lumon, and the mysterious project the employees are unknowingly working on.</p><br/><h3>Cast and characters</h3><h4>Main</h4><ul><li>Adam Scott as Mark S., a worker for Lumon Industries in the Macrodata Refinement division who is part of the \"severance\" program, whose \"outie\", Mark Scout, is grieving the death of his wife Gemma.</li><li>Zach Cherry as Dylan G., Mark's severed co-worker who particularly enjoys company perks.</li><li>Britt Lower as Helly R., a new employee who replaces Petey, much to her chagrin.</li><li>Tramell Tillman as Seth Milchick, the supervisor on the severed floor.</li><li>Jen Tullock as Devon Hale, Mark's pregnant sister, who later gives birth to baby Eleanor.</li><li>Dichen Lachman as Ms. Casey, the wellness counselor on the severed floor.</li><li>Michael Chernus as Ricken Hale, Devon's husband and Mark's brother-in-law, a self-help author, whose book is left on the severed floor by Milchick.</li><li>John Turturro as Irving Bailiff, Mark's severed co-worker who is a stickler for company policy and is drawn to Burt.</li><li>Christopher Walken as Burt Goodman, the severed chief of the Optics and Design division who is drawn to Irving.</li><li>Patricia Arquette as Harmony Cobel, Mark's unsevered boss, who outside of work goes undercover as Mrs. Selvig, Mark's next-door neighbor.</li></ul><h4>Recurring</h4><ul><li>Yul Vazquez as Peter \"Petey\" Kilmer, an unsevered Lumon worker and Mark's best friend who was fired under mysterious circumstances.</li><li>Michael Cumpsty as Doug Graner, the head of security on Lumon's severed floor.</li><li>Nikki M. James as Alexa, Devon's midwife.</li><li>Sydney Cole Alexander as Natalie, Lumon's PR representative and liaison for its board of trustees.</li><li>Nora Dale as Gabby Arteta, a new mother married to Senator Angelo Arteta. She underwent severance to avoid the pain of childbirth.</li><li>Claudia Robinson as Felicia, Optics employee at Lumon.</li><li>Mark Kenneth Smaltz as Judd, security guard at Lumon.</li></ul><h4>Guest</h4><ul><li>Marc Geller as Kier Eagan, the founder of Lumon Industries, who is worshipped with cult-like devotion within the company. Despite his death, he is represented through sculptures, paintings, and recordings.</li><li>Cassidy Layton as June, Petey's daughter.</li><li>Joanne Kelly as Nina, Petey's ex-wife.</li><li>Ethan Flower as Angelo Arteta, a Lumon-backed state senator who supports legalizing the Severance procedure and is married to Gabby Arteta, with whom he has three children.</li><li>Karen Aldridge as Reghabi, a former Lumon surgeon who reintegrated Petey.</li><li>Michael Siberry as Jame Eagan, the current CEO of Lumon Industries.</li></ul><p>Ben Stiller has an uncredited voice cameo as an animated version of Kier Eagan.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#000000;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#000000\">Title</th><th scope=\"col\" style=\"background:#000000\">Directed by</th><th scope=\"col\" style=\"background:#000000\">Written by</th><th scope=\"col\" style=\"background:#000000\">Original release date <span style=\"background-color:white;padding:1px;display:inline-block;line-height:50%\"></span></th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Good News About Hell\"</td><td style=\"text-align:center\"><span>Ben Stiller</span></td><td style=\"text-align:center\"><span>Dan Erickson</span></td><td style=\"text-align:center\">February 18, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #000000\">A woman wakes up in a conference room with no memory of who or where she is. After being given a survey and learning she is Helly, a new hire at Lumon Industries, she is allowed to leave but finds she is unable to do so. She then sees a video explaining that she has undergone the \"severance\" procedure, which split her memories to create a version of herself that will only exist inside the workplace. Mark Scout, who works alongside Helly in Lumon's Macrodata Refinement (MDR) division, discovers he is being promoted to department head in light of coworker Petey's sudden departure. The \"outside\" version of Mark, a former professor grieving his wife's death and living in the Lumon-subsidized town of Kier, encounters a man claiming to be Petey who gives him a letter with cryptic instructions. Mark returns home and interacts with his neighbor Mrs. Selvig, unaware that she is his boss, senior manager Harmony Cobel.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Half Loop\"</td><td style=\"text-align:center\">Ben Stiller</td><td style=\"text-align:center\">Dan Erickson</td><td style=\"text-align:center\">February 18, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #000000\">The previous day, Helly undergoes the severance procedure as a new employee, <span>implanting a microchip</span> inside her brain. At the office, the severed Helly is introduced to her new coworkers, Dylan and Irving, and is instructed that her job is to sort encrypted numbers into digital bins as part of \"macrodata refinement\". During a welcome party headed by floor manager Milchick, Helly becomes uncomfortable and attempts to escape by writing her outside self (or \"outie\") a note of resignation, but the elevator shuts down. Mark claims this is due to Lumon's built-in \"code detectors\" which prevent unauthorized communication between selves. Mark claims responsibility and is put into the \"break room\" as punishment. Later, Irving hallucinates a black liquid covering his desk and is administered a \"wellness check\", where counselor Ms. Casey recites various facts about Irving's outie, with Irving forced to react neutrally. At the wellness center, Irving also meets Burt, the head of the two-person Optics and Design department. Outside, Mark once again meets with Petey, who explains that he has \"reintegration sickness\" from reversing his severance. Petey tells Mark of the break room and plays a recording of himself repeatedly reading out a stringent apology, with Milchick forcing him to repeat the lines. Mark gives Petey shelter in his house. As he is taking a shower, Petey suffers hallucinations and collapses.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"In Perpetuity\"</td><td style=\"text-align:center\">Ben Stiller</td><td style=\"text-align:center\"><span>Andrew Colville</span></td><td style=\"text-align:center\">February 25, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #000000\">Petey tells Mark that mysterious benefactors helped him undergo the reintegration procedure. While Mark is at work, his sister Devon and brother-in-law Ricken deliver a book authored by the latter to his doorstep, which Mrs. Selvig steals and takes to Lumon to check for hidden messages. As she searches Mark's house, Petey recognizes her as Cobel and flees the house, suffering more hallucinations and eventually collapsing at a convenience store. At the office, Helly learns her resignation request sent to her \"outie\" has been denied. Mark thwarts her various attempts to smuggle other messages to her outie. To help Helly understand why she is working at Lumon, Irving suggests they show her the office's Perpetuity Wing, which documents the history of Lumon's founder, Kier Eagan, and his succeeding dynasty. After attempting another escape, Helly is brought to the break room, where Milchick forces her to repeatedly recite an apologetic passage. After his shift, Mark follows ambulance traffic to the convenience store and witnesses Petey being carried away by paramedics after his breathing stops. Mark rushes home to remove evidence of Petey's stay, but is interrupted when Petey's abandoned cellphone rings.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The You You Are\"</td><td style=\"text-align:center\"><span>Aoife McArdle</span></td><td style=\"text-align:center\">Kari Drake</td><td style=\"text-align:center\">March 4, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #000000\">Mark misses the call on Petey's phone and stashes it, noticing several missed calls from the same blocked number. The next day, Irving visits Optics &amp; Design, where he grows closer to Burt and discovers Ricken's book left behind by Milchick during Helly's attempted escape. Mark decides to keep the book despite promising to give it to management. Helly returns from the break room after being forced to read her apology over a thousand times; she finds a paper cutter and threatens Cobel with self-mutilation unless she is granted a recorded resignation request. However, her outie sends back a recording firmly denying the request. Later that night, Mark receives a news notification reporting that Petey died from an \"unknown ailment\"; Petey's phone rings shortly after. Cobel attends the funeral as Mrs. Selvig and extracts Petey's severance chip prior to his cremation. She then has Ms. Casey perform a \"special\" wellness check on Mark, which she watches remotely. Casey has Mark sculpt his emotional state out of clay; Mark sculpts a tree, which his outie visited in remembrance of his late wife Gemma after the funeral. Irving discovers that O&amp;D actually has at least seven employees, working in a massive unlabelled back room. Dylan finds Ricken's book hidden in Mark's files. Helly smuggles out an extension cord and hangs herself in an elevator shaft.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The Grim Barbarity of Optics and Design\"</td><td style=\"text-align:center\">Aoife McArdle</td><td style=\"text-align:center\">Anna Ouyang Moench</td><td style=\"text-align:center\">March 11, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #000000\">Helly is injured by her suicide attempt, but ultimately survives; she returns to work three days later. Mark continues to read Ricken's book, which carries strong anti-establishment sentiments. Outside work, Devon gives birth. When Helly returns, Cobel orders Ms. Casey to watch her closely, but Mark sneaks Helly out of MDR and reveals he has been recreating Petey's map. Helly agrees to help Mark with recreating the map after they discover a previously unknown department in which a single employee feeds baby goats. Burt admits to Irving and Dylan that he lied about the size of O&amp;D due to MDR being seen as untrustworthy; they realize Lumon is pitting the departments against one another. Burt takes the two to O&amp;D's back room and introduces them to his employees.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Hide and Seek\"</td><td style=\"text-align:center\">Aoife McArdle</td><td style=\"text-align:center\">Amanda Overton</td><td style=\"text-align:center\">March 18, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #000000\">Lumon security chief Doug Graner calls Cobel to inform her he has identified ex-employee Reghabi as the one responsible for Petey's reintegration. Irving and Burt admit their feelings to one another, but the former admits he is not ready to commit to a relationship. After learning Ms. Casey was sent to the break room for failing to watch him and Helly, Mark has Irving introduce MDR to O&amp;D, where he calls for the departments to work together to uncover Lumon's secrets. However, Milchick finds them and sends Mark to the break room. Milchick later briefly awakens Dylan's innie inside his outie's home to locate a card Dylan stole from O&amp;D, leading Dylan's innie to discover he has a son. Devon meets Gabby, a woman she met at the birthing lodge, but Gabby does not recognize her; Devon later learns Gabby's husband Angelo Arteta is a Lumon-backed <span>state senator</span> who supports legalizing severance. Cobel, as Mrs. Selvig, gets close to Devon and Ricken by acting as their lactation consultant. Mark goes on a date with Alexa, Devon's <span>midwife</span>, to a concert by Petey's daughter's punk-rock band, and sings along to an anti-Lumon protest song. Later, Mark finally answers Petey's phone and is contacted by Reghabi to meet in person at a nearby university. Cobel orders a keycard-locked door to be installed at the entrance to MDR.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Defiant Jazz\"</td><td style=\"text-align:center\">Ben Stiller</td><td style=\"text-align:center\">Helen Leigh</td><td style=\"text-align:center\">March 25, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #000000\">While Mark is meeting with Reghabi, Graner enters the building – following a tip from campus security – and tells Mark he works with him. Reghabi kills Graner and gives Mark his access card, telling him to bring it to his innie. Devon tells Cobel (posing as Mrs. Selvig) that she suspects Gabby severed her memories to avoid the pains of childbirth. Milchick engages in a \"Music Dance Experience\" with the department as a prize for Helly; Dylan refuses to participate and eventually attacks Milchick, enraged that he cannot know any more information about his child. Milchick leaves to report the incident to Cobel; Dylan, meanwhile, tells the department of Lumon's ability to wake them up outside the severed floor, known as an \"overtime contingency\". Mark and Helly scheme to find the security office; inside, they find Lumon strictly monitors all of its employees, and that the overtime contingency is activated using two levers. Dylan offers to stay behind after hours to wake Mark and Helly up on the outside. Irving departs to O&amp;D, worried about Burt's safety. Upon arrival, he discovers that Burt is retiring, and openly berates the non-severed Milchick for exploiting the severed employees. After work, Alexa visits a drunken Mark, who scares her off after ripping up a photo of Gemma. After she leaves, Mark reassembles the photo, revealing it to be of Ms. Casey.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"What's for Dinner?\"</td><td style=\"text-align:center\">Ben Stiller</td><td style=\"text-align:center\"><span>Chris Black</span></td><td style=\"text-align:center\">April 1, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #000000\">Irving's outie is shown to be living alone in an apartment, where he spends much of his time painting identical images of a dark corridor. Helly reaches 100% on her data refinement file, thereby meeting MDR's quota for the quarter. Cobel schedules Mark for a final wellness session with Ms. Casey, and appears disappointed when Mark and Ms. Casey fail to remember each other as husband and wife. She then orders Ms. Casey sent back down to the \"testing floor\", whose entrance is shown to be the same corridor in Irving's paintings. While MDR celebrates quota, Cobel is suspended by the board for withholding knowledge of Helly's suicide attempt and her extracurricular activities as \"Mrs. Selvig\". The MDR team prepares for Dylan to remotely awaken them on the outside; Helly kisses Mark before departing. Mark's outie attends Ricken's book-reading party and tells Cobel (as Mrs. Selvig) that he plans to quit Lumon; Cobel, herself feeling betrayed by the company, encourages him to do so. Dylan receives a \"waffle party\" as a reward for meeting quota, in which he dons a Kier Eagan head and sits within a replica of Kier's bedroom in the Perpetuity Wing while ritualistic and seductive dances are performed in front of him. Dylan leaves midway to access the security office and activates the overtime contingency to awaken Mark, Irving, and Helly's innies in the outside world.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"The We We Are\"</td><td style=\"text-align:center\">Ben Stiller</td><td style=\"text-align:center\">Dan Erickson</td><td style=\"text-align:center\">April 8, 2022</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #000000\">Mark's innie awakens in Devon's home and finds himself hugging Cobel. While excusing himself to find Devon, he calls Cobel by name, alerting her that the overtime contingency has been activated. Cobel calls Milchick and has him check the security office. Mark privately reveals to Devon that he is in innie form; Devon tells him of Gemma's death, and learns that \"Mrs. Selvig\" is Mark's boss. Mark encourages Devon to report Lumon's misdeeds to the press as Lumon likely controls the police. Irving wakes up in his apartment, discovering his outie's paintings and background in the U.S. Navy, and finds a map and employee directory in the closet which he uses to locate Burt. Helly wakes up at a Lumon gala where she learns that her outie is Helena Eagan – daughter of Lumon CEO Jame Eagan – who underwent severance to build public support for legalizing the procedure. Cobel races to the gala and attempts to stop Helly from making a scheduled speech. Milchick reaches the security office and cuts his way through the makeshift restraints Dylan has placed on the door. Helly gets onstage and tells the crowd of the innies' subjugation and torment. Irving arrives at Burt's house only to find he is already in a relationship. Mark finds a photo confirming Ms. Casey to be Gemma. He rushes to tell Devon, but is only able to say \"She's alive!\" before Milchick tackles Dylan, deactivating the overtime contingency and reverting the three to their outie state.</td></tr></tbody></table><br/><h3>Production</h3><h4>Background</h4><p>While studying English at Western Washington University, Erickson became interested in the theater department, writing short plays and other creative works. Soon after, Erickson attended New York University, where he got a master's degree in television writing. In 2016, his screenplay for the pilot of Severance appeared on Blood List's survey results of the best unproduced genre screenplays. Erickson had worked in an office job before writing the show, stating in an interview, \"The initial ideas came to me while I was working a really bad office job and going through a somewhat depressive state.\" Erickson said his job was so mind-numbing that he wished he could \"skip the eight hours of the workday, to disassociate and just get it over with\", which became the premise of the show. Erickson is close with his siblings, stating they were inspirations for some of the characters on the show.</p><h4>Development</h4><p>Ben Stiller first read the screenplay to the pilot episode at least five years before the show premiered, calling it \"the longest thing I've ever worked on.\" The script was submitted by Dan Erickson as a writing sample to Stiller's production company Red Hour Productions, and passed to Stiller by development executive Jackie Cohn. Stiller said he enjoyed the story's contributions to the workplace comedy. In January 2017, Stiller invited Adam Scott to star. In November 2019, Apple TV+ gave Severance a series order, with Stiller directing and Scott cast in the leading role. Stiller was only attached to direct the pilot but he decided to direct several more episodes as the series entered development.</p><p>On April 6, 2022, Apple renewed the series for a second season.</p><h4>Filming</h4><p>The COVID-19 pandemic postponed the initial production start of March 2020. Principal photography for the first season started in New York City under the working title Tumwater on November 8, 2020, the day after the U.S. presidential election. The opening scene of the show was shot on January 6, 2021. The series filmed for a few days in Nyack in February and in Kingston and Beacon in March. In April, filming moved to central New Jersey, mainly in the Bell Labs Holmdel Complex which stood in for Lumon HQ. Filming was scheduled to conclude on June 23, 2021.</p><p>Production designer Jeremy Hindle blended corporate looks from the 1960s, 1970s, and 1980s for the show's distinctive look, and cited modernist architect Eero Saarinen as influential for the building design. Erickson said the mix of cars and technologies from different eras was meant to \"give a slight sense of disorientation\" and make Lumon \"feel unmoored from time and space\". Stiller said the prop master reconstructed old computers so the actors could actually do the work presented on the show in order to get adjusted to the office setting. These computers lacked an escape key, as a metaphor for the lack of control the Innies have while in Lumon's offices.</p><p>The second season will also shoot in New York and New Jersey, and began filming on October 3, 2022, in New York City, and was set to wrap on May 12, 2023. However, on May 8, 2023, production of the season was shut down due to the ongoing writers strike.</p><h4>Casting</h4><p>In January 2020, Patricia Arquette, Britt Lower, Jen Tullock, and Zach Cherry were added to the cast. Tramell Tillman joined in February 2020, and John Turturro and Christopher Walken were added in November 2020. Dichen Lachman was cast in December 2020. Turturro said he recommended Walken for the role of Burt because he had known him for \"a long time and I don't have to really act like we're friends.\"</p><p>On October 31, 2022, Gwendoline Christie, Bob Balaban, Merritt Wever, Alia Shawkat, Robby Benson, Stefano Carannante, Ólafur Darri Ólafsson and John Noble were announced to have joined the cast for season two.</p><h4>Influences</h4><p>Relatively recent media that influenced Severance include the online urban legend known as The Backrooms, the computer game The Stanley Parable, films including Office Space, Brazil, The Truman Show, and Eternal Sunshine of the Spotless Mind, and the Dilbert comic strips. Older influences include the existential hell in the Jean-Paul Sartre play No Exit and the totalitarian dystopia in the George Orwell novel Nineteen Eighty-Four. Aesthetically, the series was influenced by the films Brazil, Dark City, Playtime, and other films by Terry Gilliam.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>Severance was met with critical acclaim upon its release. On the review aggregator website Rotten Tomatoes, 97% of 107 critics' reviews are positive, with an average rating of 8.5/10. The website's consensus reads: \"Audacious, mysterious, and bringing fresh insight into the perils of corporate drudgery, Severance is the complete package.\" Metacritic, which uses a weighted average, assigned a score of 83 out of 100 based on 36 critics, indicating \"universal acclaim\".</p><p>The series received a rating of 5 out of 5 stars from Lucy Mangan of The Guardian and Rachael Sigee of I, 4 out of 5 stars from Huw Fullerton of Radio Times, John Nugent of Empire, Alan Sepinwall of Rolling Stone and Anita Singh of The Telegraph, and 3.5 out of 4 stars from Patrick Ryan of USA Today. In her review, Mangan praised Stiller's direction, the writing, and the performances of the cast (particularly that of Arquette, Turturro, Walken and Tillman). Sigee also praised the performances, especially Scott's, Arquette's, Turturro's and Walken's, and wrote, \"Severance moves slowly but surely, allowing time to absorb both the impressive world-building and stunning visuals, its breathtaking cinematography and design. With an exceptional cast, this is an original, weird, thought-provoking and beautifully crafted story that asks just how much of ourselves we should give over to our jobs.\" Fullerton also praised Scott's performance and called the series \"an impressive creation.\" Nugent praised the direction, performances of Scott, Arquette, Turturro and Walken, and chemistry between the latter two. Sepinwall also praised Stiller's direction and the cast's performances (most notably that of Scott, Turturro, Walken, Lower and Tillman), in addition to the production design, tone, and season finale.</p><p>Grading the series with an \"A\", Carly Lane of Collider stated that \"the most engrossing element of Severance is the many mysteries it presents, wrapped up in silent overarching questions of philosophy, morality, and free will versus choice, and as the series demonstrates, some of those questions aren't so easily solved, but some issues aren't as black-and-white as initially presented either.\" Also grading it with an \"A\", Ben Travers of IndieWire said, \"Whether you invest in the allegory, character arcs, or both, 'Severance' hits its marks. Erickson and his writing staff deserve a ton of credit. The season plays out cleanly and efficiently; episodes range from nearly 60 minutes to a crisp 40; cliffhangers abound, but they’re earned. This is serialized storytelling that knows how to make the most of its episodic format.\" Stephen Robinson of The A.V. Club gave it an \"A-\" grade and praised Stiller's direction and the cast, with the performances of Lower, Scott, Tillman, Turturro, Walken, Tullock and Cherry being singled out. From Entertainment Weekly, Kristen Baldwin graded it with a \"B+\" and highlighted the performances of Scott, Lower and Tillman, saying that \"Scott is a superb fit for Severance's central everyman, Lower brings an effective vulnerability to the acerbic Helly, and Tramell Tillman is an absolute force of charisma as Milchick.\"</p><p>Giving the series an \"amazing\" score of 9 out of 10, Samantha Nelson of IGN wrote in her verdict, \"Severance uses a clever premise and excellent cast to set up an intriguing mystery that leaves plenty of room for the characters to evolve.\" Writing for Paste, Shane Ryan gave it an 8.1 out of 10 and praised the performances of Scott, Arquette and Tillman as well as Stiller and McArdle's direction. Kyle Mullin of Under the Radar gave it an 8 out of 10 and said, \"Severance's writer/creator Dan Erickson is another newcomer who pens scenes with veteran-level aplomb. Every scene is a Golden Age of TV gem in its own right. But Severance's dramatic heart resides at the workplace, where it also becomes a white-knuckle thriller. This is where director Ben Stiller especially shines, training his lens and setting the scenes. He certainly brings the best out of his cast.\"</p><p>The American Film Institute named it one of the ten best television programs of the year.</p><h4>Critics' top ten list</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td style=\"text-align: left; vertical-align: top;\"><table class=\"collapsible collapsed\"><tbody><tr><th style=\"width:22em; background:#C4C3D0; text-align:center\">2022</th></tr><tr><td colspan=\"\"><ul><li>No. 1 <i><span class=\"mw-redirect\">Decider</span></i></li><li>No. 1 <i><span>Little White Lies</span></i></li><li>No. 1 <i><span class=\"mw-redirect\">Vulture</span></i> <small>(Jen Chaney)</small></li><li>No. 2 <i><span>The A.V. Club</span></i></li><li>No. 2 <i><span>Empire</span></i></li><li>No. 2 <i><span>Exclaim!</span></i></li><li>No. 2 <i><span>IndieWire</span></i> <small>(Ben Travers)</small></li><li>No. 2 <i><span class=\"mw-redirect\">ScreenCrush</span></i></li><li>No. 2 <i><span>TV Guide</span></i></li><li>No. 2 <i><span class=\"mw-redirect\">TV Insider</span></i></li><li>No. 3 <i><span>Consequence</span></i></li><li>No. 3 <i><span>Entertainment.ie</span></i></li><li>No. 3 <i><span>Polygon</span></i></li><li>No. 3 <i><span>Time</span></i></li><li>No. 4 <i><span>The Boston Globe</span></i></li><li>No. 4 <i><span class=\"mw-redirect\">The Mary Sue</span></i></li><li>No. 4 <i><span>People</span></i></li><li>No. 4 <i><span>Uproxx</span></i></li><li>No. 4 <i>Vulture</i> <small>(Roxana Hadadi)</small></li><li>No. 5 <i><span>Adweek</span></i></li><li>No. 5 <i><span>BuddyTV</span></i></li><li>No. 5 <i><span>Rolling Stone</span></i></li><li>No. 5 <i>Vulture</i> <small>(Kathryn VanArendonk)</small></li><li>No. 6 <i><span>TVLine</span></i></li><li>No. 6 <i><span>NME</span></i></li><li>No. 7 <i>The Playlist</i></li><li>No. 9 <i><span>Entertainment Weekly</span></i> <small>(Kristen Baldwin)</small></li><li>No. 9 <i><span>The Hollywood Reporter</span></i> <small>(Angie Han)</small></li><li>No. 9 <i>Primetimer</i></li><li>No. 9 <i><span>The Ringer</span></i></li><li>No. 10 <i><span>Slant</span></i></li><li> – <i><span>CBC Arts</span></i></li><li> – <i><span>The Economist</span></i></li><li> – <i><span>IndieWire</span></i> <small>(Proma Khosla – <i>new shows only</i>)</small></li><li> – <i><span>Lifehacker</span></i></li><li> – <i><span>Los Angeles Times</span></i> <small>(Lorraine Ali)</small></li><li> – <i><span>Nerdist</span></i></li><li> – <i><span>The New York Times</span></i> <small>(<span>James Poniewozik</span>)</small></li></ul></td></tr></tbody></table><p> </p></td></tr></tbody></table><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><style data-mw-deduplicate=\"TemplateStyles:r1152813436\">.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);clip-path:polygon(0px 0px,0px 0px,0px 0px);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px;white-space:nowrap}</style><span class=\"sr-only\">Accolades received by Severance</span></caption><tbody><tr><th scope=\"col\">Award</th><th scope=\"col\">Year</th><th scope=\"col\">Category</th><th scope=\"col\" style=\"width:35%;\">Recipient(s)</th><th scope=\"col\">Result</th><th scope=\"col\" class=\"unsortable\"><abbr title=\"Reference(s)\">Ref.</abbr></th></tr><tr><th scope=\"row\"><span class=\"mw-redirect\">AACTA International Awards</span></th><td style=\"text-align:center\"><span>2023</span></td><td>Best Drama Series</td><td><i>Severance</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><th scope=\"row\"><span>American Film Institute Awards</span></th><td style=\"text-align:center\">2022</td><td>Top 10 Programs of the Year</td><td><i>Severance</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><th scope=\"row\"><span class=\"mw-redirect\">Art Directors Guild Awards</span></th><td style=\"text-align:center\"><span>2023</span></td><td><span>Excellence in Production Design for a One-Hour Contemporary Single-Camera Series</span></td><td>Jeremy Hindle <span style=\"font-size:85%;\">(for \"Good News About Hell\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><th scope=\"row\"><span class=\"mw-redirect\">Artios Awards</span></th><td style=\"text-align:center\"><span>2023</span></td><td>Outstanding Achievement in Casting – Television Pilot and First Season Drama Series</td><td>Rachel Tenner, Bess Fifer, Rick Messina</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><th scope=\"row\"><span>Cinema Audio Society Awards</span></th><td style=\"text-align:center\"><span>2023</span></td><td><span>Outstanding Achievement in Sound Mixing for Television Series – One Hour</span></td><td>Bryan Dembinski, Bob Chefalas, Chris Fogel, George A. Lara <span style=\"font-size:85%;\">(for \"The We We Are\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><th scope=\"rowgroup\" rowspan=\"2\"><span>Critics' Choice Awards</span></th><td style=\"text-align:center\" rowspan=\"2\"><span>2023</span></td><td><span>Best Drama Series</span></td><td><i>Severance</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td><span>Best Actor in a Drama Series</span></td><td><span>Adam Scott</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"rowgroup\" rowspan=\"2\"><span>Critics' Choice Super Awards</span></th><td style=\"text-align:center\" rowspan=\"2\"><span>2023</span></td><td>Best Actor in a Science Fiction/Fantasy Series, Limited Series or Made-for-TV Movie</td><td>Adam Scott</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\"></td></tr><tr><td><span>Best Actress in a Science Fiction/Fantasy Series, Limited Series or Made-for-TV Movie</span></td><td>Patricia Arquette</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"rowgroup\" rowspan=\"2\"><span>Directors Guild of America Awards</span></th><td style=\"text-align:center\" rowspan=\"2\"><span>2023</span></td><td rowspan=\"2\"><span>Outstanding Directorial Achievement in Dramatic Series</span></td><td><span>Aoife McArdle</span> <small>(for \"Hide and Seek\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td><span>Ben Stiller</span> <small>(for \"The We We Are\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"rowgroup\" rowspan=\"2\"><span>Dorian Awards</span></th><td style=\"text-align:center\" rowspan=\"2\">2022</td><td>Best TV Drama</td><td><i>Severance</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>Most Visually Striking Show</td><td><i>Severance</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"rowgroup\" rowspan=\"3\"><span>Golden Globe Awards</span></th><td style=\"text-align:center\" rowspan=\"3\"><span>2023</span></td><td><span>Best Television Series – Drama</span></td><td><i>Severance</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\"></td></tr><tr><td><span>Best Actor in a Television Series – Drama</span></td><td>Adam Scott</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor in a Television Series – Comedy/Musical or Drama</span></td><td>John Turturro</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"rowgroup\" rowspan=\"2\"><span class=\"mw-redirect\">Golden Reel Awards</span></th><td style=\"text-align:center;\" rowspan=\"2\"><span>2023</span></td><td><span>Outstanding Achievement in Sound Editing – Broadcast Long Form Dialogue and ADR</span></td><td>Jacob Ribicoff, David Briggs, Gregg Swiatlowski <span style=\"font-size:85%;\">(for \"The We We Are\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td><span>Outstanding Achievement in Music Editing – Broadcast Long Form</span></td><td>Missy Cohen, Sam Zeines, Felipe Pacheco <span style=\"font-size:85%;\">(for \"The We We Are\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"rowgroup\" rowspan=\"2\"><span class=\"mw-redirect\">Gotham Independent Film Awards</span></th><td style=\"text-align:center\" rowspan=\"2\"><span>2022</span></td><td><span>Breakthrough Series – Long Form</span></td><td><i>Severance</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td><span>Outstanding Performance in a New Series</span></td><td><span>Britt Lower</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"rowgroup\" rowspan=\"12\"><span class=\"mw-redirect\">Hollywood Critics Association TV Awards</span></th><td style=\"text-align:center\" rowspan=\"12\"><span>2022</span></td><td>Best Streaming Series, Drama</td><td><i>Severance</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"12\"></td></tr><tr><td>Best Actor in a Streaming Series, Drama</td><td>Adam Scott</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Actress in a Streaming Series, Drama</td><td>Britt Lower</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\">Best Supporting Actor in a Streaming Series, Drama</td><td><span>Zach Cherry</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Tramell Tillman</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>John Turturro</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Christopher Walken</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\">Best Supporting Actress in a Streaming Series, Drama</td><td><span>Patricia Arquette</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Dichen Lachman</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\">Best Directing in a Streaming Series, Drama</td><td>Aoife McArdle <span style=\"font-size:85%;\">(for \"The You You Are\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Ben Stiller <span style=\"font-size:85%;\">(for \"The We We Are\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Writing in a Streaming Series, Drama</td><td><span>Dan Erickson</span> <span style=\"font-size:85%;\">(for \"The We We Are\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><th scope=\"row\"><span>Hollywood Music in Media Awards</span></th><td style=\"text-align:center\"><span>2022</span></td><td>Original Score — TV Show/Limited Series</td><td><span>Theodore Shapiro</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><th scope=\"rowgroup\"><span>Irish Film &amp; Television Awards</span></th><td align=\"center\"><span>2023</span></td><td>Director – Television Drama</td><td><span>Aoife McArdle</span></td><td style=\"background: #FFD; vertical-align: middle; text-align: center;\" class=\"partial table-partial\">Pending</td><td></td></tr><tr><th scope=\"rowgroup\" rowspan=\"3\"><span>Independent Spirit Awards</span></th><td style=\"text-align:center;\" rowspan=\"3\"><span>2023</span></td><td><span>Best New Scripted Series</span></td><td><i>Severance</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\"></td></tr><tr><td>Best Lead Performance in a New Scripted Series</td><td>Adam Scott</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Supporting Performance in a New Scripted Series</td><td>Tramell Tillman</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"rowgroup\"><span>People's Choice Awards</span></th><td style=\"text-align:center\"><span>2022</span></td><td>The Bingeworthy Show of 2022</td><td><i>Severance</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><th scope=\"rowgroup\" rowspan=\"7\"><span class=\"mw-redirect\">Primetime Creative Arts Emmy Awards</span></th><td style=\"text-align:center\" rowspan=\"7\"><span>2022</span></td><td><span>Outstanding Casting for a Drama Series</span></td><td>Rachel Tenner and Bess Fifer</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"7\"></td></tr><tr><td><span>Outstanding Main Title Design</span></td><td>Oliver Latta and Teddy Blanks</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Music Composition for a Series (Original Dramatic Score)</span></td><td><span>Theodore Shapiro</span> <span style=\"font-size:85%;\">(for \"The We We Are\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Original Main Title Theme Music</span></td><td>Theodore Shapiro</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Production Design for a Narrative Contemporary Program (One Hour or More)</span></td><td>Jeremy Hindle, Nick Francone, Angelica Borrero-Fortier, <br> and Andrew Baseman <span style=\"font-size:85%;\">(for \"Good News About Hell\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Outstanding Single-Camera Picture Editing for a Drama Series</span></td><td>Erica Freed Marker and Geoffrey Richman <span style=\"font-size:85%;\">(for \"In Perpetuity\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Geoffrey Richman <span style=\"font-size:85%;\">(for \"The We We Are\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"rowgroup\" rowspan=\"7\"><span>Primetime Emmy Awards</span></th><td style=\"text-align:center\" rowspan=\"7\"><span>2022</span></td><td><span>Outstanding Drama Series</span></td><td>Ben Stiller, Nicholas Weinstock, Jackie Cohn, Mark Friedman, Dan Erickson, <span>Andrew Colville</span>, <span>Chris Black</span>, John Cameron, Jill Footlick, Kari Drake, Adam Scott, Patricia Arquette, Aoife McArdle, Amanda Overton, and Gerry Robert Bryne</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"7\"></td></tr><tr><td><span>Outstanding Lead Actor in a Drama Series</span></td><td>Adam Scott <span style=\"font-size:85%;\">(for \"Good News About Hell\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Outstanding Supporting Actor in a Drama Series</span></td><td>John Turturro <span style=\"font-size:85%;\">(for \"Defiant Jazz\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Christopher Walken <span style=\"font-size:85%;\">(for \"The Grim Barbarity of Optics and Design\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Supporting Actress in a Drama Series</span></td><td>Patricia Arquette <span style=\"font-size:85%;\">(for \"What's for Dinner?\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Directing for a Drama Series</span></td><td>Ben Stiller <span style=\"font-size:85%;\">(for \"The We We Are\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Writing for a Drama Series</span></td><td>Dan Erickson <span style=\"font-size:85%;\">(for \"The We We Are\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"row\"><span>Producers Guild of America Awards</span></th><td style=\"text-align:center\"><span>2023</span></td><td><span>Outstanding Producer of Episodic Television, Drama</span></td><td><i>Severance</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><th scope=\"rowgroup\" rowspan=\"2\"><span>Satellite Awards</span></th><td style=\"text-align:center\" rowspan=\"2\"><span>2023</span></td><td><span>Best Drama Series</span></td><td><i>Severance</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td><span>Best Actor in a Drama / Genre Series</span></td><td>Adam Scott</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"rowgroup\" rowspan=\"6\"><span>Saturn Awards</span></th><td style=\"text-align:center\" rowspan=\"6\"><span>2022</span></td><td><span class=\"mw-redirect\">Best Streaming Horror/Thriller Television Series</span></td><td><i>Severance</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"6\"><br></td></tr><tr><td><span class=\"mw-redirect\">Best Actor in a Streaming Television Series</span></td><td>Adam Scott</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Actress in a Streaming Television Series</span></td><td>Britt Lower</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Best Supporting Actor in a Streaming Television Series</span></td><td>Zach Cherry</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>John Turturro</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Best Supporting Actress in a Streaming Television Series</span></td><td>Patricia Arquette</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"row\" rowspan=\"2\"><span>Screen Actors Guild Awards</span></th><td style=\"text-align:center\" rowspan=\"2\"><span>2023</span></td><td><span>Outstanding Performance by a Male Actor in a Drama Series</span></td><td>Adam Scott</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td><span>Outstanding Performance by an Ensemble in a Drama Series</span></td><td>Patricia Arquette, <span>Michael Chernus</span>, Zach Cherry, <span>Michael Cumpsty</span>, Dichen Lachman, Britt Lower, Adam Scott, Tramell Tillman, <span>Jen Tullock</span>, John Turturro, Christopher Walken</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"rowgroup\"><span>Set Decorators Society of America Awards</span></th><td style=\"text-align:center\"><span>2022</span></td><td>Best Achievement in Décor/Design of a One Hour Contemporary Series</td><td><span data-sort-value=\"Baseman, Andrew\"><span class=\"vcard\"><span class=\"fn\">Andrew Baseman</span></span></span> and Jeremy Hindle</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><th scope=\"row\"><span class=\"mw-redirect\">Society of Composers &amp; Lyricists Awards</span></th><td>2023</td><td>Outstanding Score for Television</td><td>Theodore Shapiro</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><th scope=\"rowgroup\" rowspan=\"4\"><span>Television Critics Association Awards</span></th><td style=\"text-align:center\" rowspan=\"4\"><span>2022</span></td><td><span>Program of the Year</span></td><td rowspan=\"3\"><i>Severance</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\"></td></tr><tr><td><span>Outstanding Achievement in Drama</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding New Program</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Individual Achievement in Drama</span></td><td>Adam Scott</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><th scope=\"rowgroup\"><span class=\"mw-redirect\">Visual Effects Society Awards</span></th><td style=\"text-align:center\"><span>2023</span></td><td><span>Outstanding Supporting Visual Effects in a Photoreal Episode</span></td><td>Vadim Turchin, Nicole Melius, David Piombino, David Rouxel <span style=\"font-size:85%;\">(for \"Pilot\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><th scope=\"rowgroup\"><span>Webby Awards</span></th><td style=\"text-align:center\">2022</td><td>Best Actor</td><td>Adam Scott</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><th scope=\"row\" rowspan=\"3\"><span>Writers Guild of America Awards</span></th><td style=\"text-align:center\" rowspan=\"3\"><span>2023</span></td><td><span>Drama Series</span></td><td rowspan=\"2\">Chris Black, Andrew Colville, Kari Drake, Dan Erickson, Mark Friedman, Helen Leigh, Anna Moench, Amanda Overton</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"3\"></td></tr><tr><td><span>New Series</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Episodic Drama</span></td><td>Dan Erickson (for \"The We We Are\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><p>The first season was recognized with The ReFrame Stamp for hiring people of underrepresented gender identities, and of color.</p><br/><h3>Marketing</h3><p>The second season was teased during the Apple Event that took place on September 7, 2022, which featured Helly (Britt Lower).</p><br/>"
  },
  "errorMessage": ""
}