{
  "imDbId": "tt0863046",
  "title": "Flight of the Conchords",
  "fullTitle": "Flight of the Conchords (TV Series 2007–2009)",
  "type": "TVSeries",
  "year": "2007",
  "items": [
    {
      "username": "ChaCha44",
      "userUrl": "https://www.imdb.com/user/ur2105817",
      "reviewLink": "https://www.imdb.com/review/rw1715447",
      "warningSpoilers": false,
      "date": "15 August 2007",
      "rate": "10",
      "helpful": "102 out of 122 found this helpful.",
      "title": "How can you not love this show?",
      "content": "What more can you ask for? It's funny, it's silly, it has characters that you love and musical numbers that really work. The simple storyline of two New Zealand musicians trying to make it in the Big Apple puts to shame other comedies that try so hard whereas Flight of the Conchords just seems so effortless. Murray their manager who is trying to treat the whole \"band\" experience\" as though they were much larger in scope than just the three of them with almost non existent gigs is hilarious. Their one fan, Mel, is a wide-eyed, curly haired, stalker who conveniently runs into the guys everywhere. Never has stalking been this much fun. Not since Da Ali G. show has an HBO comedy been this enjoyable. Long life to the Flight of the Conchords. A hit if I've ever seen one. I LOVE YOU BRET (Brit)!"
    },
    {
      "username": "AhearnePaul",
      "userUrl": "https://www.imdb.com/user/ur13338468",
      "reviewLink": "https://www.imdb.com/review/rw1807719",
      "warningSpoilers": false,
      "date": "26 January 2008",
      "rate": "10",
      "helpful": "62 out of 68 found this helpful.",
      "title": "Good one Dave. Ohhh, you're a legend Dave.",
      "content": "I guess the general rule is that in any 1st season of a comedy there are going to be highs and lows. However this could be the exception to the rule. It was brilliant from start to finish. Anyone lucky enough to listen to the Conchords radio series in the UK or to have seen their HBO one night stand slot will not be disappointed. The humor is subtle and at times could be likened to the UK version of the office with Rhys Darby in the David Brent role (band manager Murray). Bret and Jermain satisfy audiences with their witty repertoire of songs and inane banter, all while the world around them seems to make less and less sense. Superb. A must see."
    },
    {
      "username": "golightly13",
      "userUrl": "https://www.imdb.com/user/ur11663700",
      "reviewLink": "https://www.imdb.com/review/rw1685724",
      "warningSpoilers": false,
      "date": "29 June 2007",
      "rate": "10",
      "helpful": "192 out of 210 found this helpful.",
      "title": "Witty Genius in a World of Over the Top Comedy",
      "content": "To me, this show is bliss. I watched both of the first two episodes aired and am already in love. The genius lies in the delivery. The seriousness of which Bret and Jermaine approach the situation adds a certain amount of wit to every comment made. Pay close attention and the slightest musical references are made, such as Fleetwood Mac's \"love square\". It is the subtlety of the comedy that makes this show stand out above the rest.And as for the musical moments, I think I can speak for if not everyone, then mostly everyone when i say that my inner most thoughts are always in song.kudos Bret and Jermaine for creating a unique clever show that i'll look forward to every week."
    },
    {
      "username": "h2o_ns",
      "userUrl": "https://www.imdb.com/user/ur4161789",
      "reviewLink": "https://www.imdb.com/review/rw1800415",
      "warningSpoilers": false,
      "date": "15 January 2008",
      "rate": "10",
      "helpful": "62 out of 72 found this helpful.",
      "title": "Simply Brilliant.",
      "content": "Words truly can't express the way I feel about Flight of the Conchords. My younger brother showed me a clip of their song \"Business Time\" performed live and ever since I've been hooked. The show itself is truly hilarious, but what really makes it a true 10/10 is the music. With songs like Business Time, Robots, Beautiful Girl, Bowie, Leggy Blonde and many more this show will make you cry tears of joy. Not only are the duo of the band brilliant but they also have comedians Rhys Darby as their hilariously pathetic band manager Murray and Arj Barker as their friend and local pawn shop guy to teach them how things work in America.If you simply go over to Youtube and search for Flight of the Conchords you're bound to find an ample source of entertainment but trust me, watch the series as well; it is simply brilliant."
    },
    {
      "username": "Lasse Andersen",
      "userUrl": "https://www.imdb.com/user/ur0611567",
      "reviewLink": "https://www.imdb.com/review/rw1690086",
      "warningSpoilers": false,
      "date": "3 July 2007",
      "rate": "10",
      "helpful": "130 out of 158 found this helpful.",
      "title": "This show truly put Entourage to shame.",
      "content": "Sunday night has been and still is HBO's night to shine, with great drama presented by the made in America Sopranos and its mafia tale(now its the surfer noir John From Cincinatti) and humor presented by Entourage. The Sopranos ended with a blackout and confusion and the fun that once was in Entourage is missing in its fourth season.This show is about a band called the Flight of the Conchords its a typical fish out water scenario presented in a very unique and quirky way, the show might reminds somebody of the short lived Tenacious D (Jack Black) series that also aired on HBO, because of the band element but this show is much more low-key and is extremely funny, the New Zealand accent just killes me! And the performances in this show are great especially by the bands terrible manager hilarious. This is definitely one of the funniest things on TV right now, together with the Office and 30 Rock. If you have a twisted kind of humor (ala arrested development) you will love this show..."
    },
    {
      "username": "pricegd2",
      "userUrl": "https://www.imdb.com/user/ur16479467",
      "reviewLink": "https://www.imdb.com/review/rw1719762",
      "warningSpoilers": false,
      "date": "21 August 2007",
      "rate": "10",
      "helpful": "66 out of 75 found this helpful.",
      "title": "The greatest comedy duo on HBO right now",
      "content": "This show has all the elements of a great comedy. The supporting cast is consistently hilarious; just view episode 10 and listen to Murray's commentary on rock and roll and threesomes. Mel is another gem of a character who has a husband but lives and breaths the FOTC band. Arj always has some sort of admonition and advice for these unsuspecting guys and it makes for a hilarious misconstrued view. I love how the writers take an idea and spin it in the other direction, such as the episode where the woman objectifies the man. I consistently laugh at what wild and crazy situation these guys will get into next. I hope they continue this show another season! oneG"
    },
    {
      "username": "blindredemption",
      "userUrl": "https://www.imdb.com/user/ur15188684",
      "reviewLink": "https://www.imdb.com/review/rw1952023",
      "warningSpoilers": false,
      "date": "26 September 2008",
      "rate": "9",
      "helpful": "12 out of 16 found this helpful.",
      "title": "Not for Everyone",
      "content": "But it certainly is for me. Flight of the Conchords is all about the quick & subtle comedy & hardly gets in your face (aside from the musical interludes of extreme greatness).Bret & Jermaine are two struggling musicians living in New York, they deal with some ordinary situations in odd ways, as well as dealing with odd situations with awkward delight. They have a band manager Murray, who is usually a scene stealer & is not without his own personal problems, which just adds to the hilarity of the whole show.Now the comedy isn't for everyone, it's something you either love, or just don't care for. I Care for it quite a bit, it's one of the shows I actually WANT to watch."
    },
    {
      "username": "jessmacdowell",
      "userUrl": "https://www.imdb.com/user/ur20153101",
      "reviewLink": "https://www.imdb.com/review/rw8091984",
      "warningSpoilers": false,
      "date": "26 April 2022",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Fantastic!",
      "content": "Light hearted fun ! So good disappointed they stopped after just 2 season. I would have watched it for much longer instead of starting it over every week."
    },
    {
      "username": "dunmore_ego",
      "userUrl": "https://www.imdb.com/user/ur2446936",
      "reviewLink": "https://www.imdb.com/review/rw2162834",
      "warningSpoilers": true,
      "date": "23 November 2009",
      "rate": "8",
      "helpful": "8 out of 12 found this helpful.",
      "title": "Ripping Musical Yarns from slightly to the right of Down Unda.",
      "content": "FLIGHT OF THE CONCHORDS is Tenacious D without the raunch - but just as much a spank in the groin. That is, it will leave you breathless from laughing so hard (and you may have cracked a nut).Jemaine Clement (guitar/bass/vocals, Jagger-cool in his handsome ugliness) and Bret McKenzie (guitar/vocals, deadpan, unperturbed, who would look 12 years old without his beard), the novelty two-man band from New Zealand (funny accents and all) parlay their comedic stage act into a quirky New York situation comedy that perfectly captures their onstage minimalistic, unassuming quasi-style.Within the context of their search for acceptance, purpose (and gigs) in a New York City apathetic to their presence, all their classic musical routines are cutely inserted: Boom Boom, The Humans Are Dead, Business Time, Rhymenoceros and Hiphopopotamus - even Albi the Racist Dragon. For fans of the band, it is quite amazing to see how they've found nice little slots for all these funny songs, most of which are re-worked with full band backing.CONCHORDS music is folk, rock, electric, acoustic, hip-hop, anything that correlates with the topic of the episode, stylistically ranging from Hall and Oates, to The Monkees, to Pet Shop Boys, Bowie and beyond. And Episode 6 (\"Bowie\") shows off their genius in melding Bowie's many styles into a brilliant musical parody, with Jemaine appearing to Bret in dreams as David Bowie from different eras. Bret: \"You look like Jemaine.\" Jemaine replies in that airy, offhanded manner of The Thin White Duke: \"No, I'm David Bowie from the Ashes To Ashes video.\" For two characters who are so inept at everything (finding jobs, chasing girls, paying the rent), their virtuosity as comedic musicians is unmatched (well, maybe by Tenacious D in a different kind of way).Their useless yet anal \"band manager\" Murray (Rhys Darby) works in the New Zealand Consulate and manages the band part-time (during office hours) with an iron fist for taking roll call. At their three-man meetings, he prefaces news of no upcoming gigs by first announcing the title of the next item on the agenda: \"Gigs: no.\" Kristen Schaal is Mel, their obsessive Number One Fan (actually, their only fan, on the verge of orgasm every time she is near them, or stalking them); Arj Barker is Dave, their friend from the pawn shop, who offers sage advice on women and life, both of which he knows nothing about; Rachel Blanchard is the beautiful, yet California-shallow Sally; Sutton Foster is Coco, Brett's occasional girlfriend, considered \"Yoko\" by Jemaine.Watch for Lenny Venito as a soft-hearted thug (Episode 3, \"Mugged\"); Aziz Ansari as an Indian fruit vendor prejudiced against New Zealanders - until he discovers he really hates Australians (Episode 7, \"Drive By\"); Daryl Hall as the World Music Jam host (Episode 10, \"New Fans\"); Demetri Martin and Todd Barry as a nemesis two-man parody duo (Episode 12, \"The Third Conchord\").No one trailer can do justice to the diversity and hilarity of the FLIGHT OF THE CONCHORDS series. All twelve episodes of Season One are indescribably different, yet incredibly consistent in tone and humor.The plots of their nominal \"adventures\" are nothing we haven't seen before in other musical comedies (a member leaving the band, the band splitting over a woman, one member moving out of the apartment, a new band member causing a rift between the original band members, etc.) but CONCHORDS presents these tried-and-worn plots in their own inimitable, groin-spanking way.Watch with a cushion covering your jewels. And stop touching those monkeys.--Review by Poffy The Cucumber (for Poffy's Movie Mania)."
    },
    {
      "username": "carn72386",
      "userUrl": "https://www.imdb.com/user/ur14181109",
      "reviewLink": "https://www.imdb.com/review/rw1806506",
      "warningSpoilers": false,
      "date": "24 January 2008",
      "rate": "8",
      "helpful": "31 out of 41 found this helpful.",
      "title": "excellent musicians, funny show with potential, worth checking out.",
      "content": "These guys really impressed me. They are excellent song writers, styling themselves after David Bowie, REM, and various genres they explored, and succeed in writing a legitimate, structured songs. They have a knack for creating a catchy song, and make it silly without compensating their shtick, or going overboard. They really take themselves seriously as musicians. And thats only 1/3 of reasons to check this show out.2/3 of reasons to see this is that the humor is very subtle, and sharp. Not particularly \"American\" humor, fans of British humor will appreciate the offbeat energy and situations. Rhys Darby is also very funny as the clueless, and loyal manager and friends of the duo. The premise of the show is simple: an up-and-coming folk duo work to develop a fan base in the U.S., starting with New-York. The juxtaposition between the duo's New Zealand calm, playful attitudes and their American acquaintances' brazen \"American\" demeanors.3/3 of the reasons is the lesser of the bunch, but adds a quaint dimension which I appreciate, is the show's potential. Some may notice that this show has quite a lot going for it, and could be something special if it realizes its potential for an interesting take on the struggle of a band's success."
    },
    {
      "username": "paul2001sw-1",
      "userUrl": "https://www.imdb.com/user/ur2082018",
      "reviewLink": "https://www.imdb.com/review/rw1781937",
      "warningSpoilers": false,
      "date": "17 December 2007",
      "rate": "9",
      "helpful": "10 out of 18 found this helpful.",
      "title": "This is Flight of the Conchords",
      "content": "'Flight of the Conchords' tells the story of a couple of musicians from New Zealand trying to make it in a band in New York. They're not very good, they have no girlfriends, one fan and an incompetent manager (Rhys Darby, who steals most of the scenes he's in), and everybody just loves their English accents. The series' twelve episodes follow their failures. So what's so great? Partly its the absolutely deadpan way in which the undynamic duo's misadventures are depicted; but mainly its the songs, which are brilliantly bad, pastiches of real musical styles but hilariously funny (although the songs feature mainly in \"music videos\" or in scenes which blend the characters' imaginations with real life; on the rare occasions the band actually gets a gig, their act consists of an anaemic chant of \"we like to rock the party\" over a badly strummed guitar - there is a reason for the band's lack of success!). In some ways, this is 'Spinal Tap', but with more musical variety; and the funniest program of the year."
    },
    {
      "username": "dustandghosts",
      "userUrl": "https://www.imdb.com/user/ur17401190",
      "reviewLink": "https://www.imdb.com/review/rw1762236",
      "warningSpoilers": false,
      "date": "12 November 2007",
      "rate": "9",
      "helpful": "43 out of 55 found this helpful.",
      "title": "Good! Very Nice!",
      "content": "Smart writing! Not for the commercial masses. Well written and acted out characters. Original music throughout the program which is creative and innovative. Throughout the show the main actors perform out songs related to the episode that brings an unique style of directing. I really enjoyed Flight of the Conchords and looking forward to Season 2. The Band Meeting scenes are one the things that I enjoy about the show. Like I said though, not for the masses but a show that is very overlooked and very much not appreciated. A different brand of comedy and a very original series. Looking forward to buying the DVD of Season 1. Going in the collection!"
    },
    {
      "username": "deloudelouvain",
      "userUrl": "https://www.imdb.com/user/ur58525162",
      "reviewLink": "https://www.imdb.com/review/rw3183131",
      "warningSpoilers": false,
      "date": "14 February 2015",
      "rate": "10",
      "helpful": "8 out of 14 found this helpful.",
      "title": "Magnificent!",
      "content": "Why oh why did they stop after two seasons? This show is absolutely fabulous. Normally I hate about every movie or series where they start to sing in but this show is the exception. The musicians are brilliant, the variety of genres, the lyrics are so funny you can't get enough of it. I started singing their songs after every episode. And then that same kind of repetitive humor through the whole show. I thought it was one of the funniest show I saw the last years. Jemaine and Bret are hilarious, Murray their manager that comes up with the stupidest ideas, and Mel their number one fan and also only fan... It's all a cocktail for a brilliant show. Too sad that this show ended. A proof that New-Zealand can deliver when it's about comedy..."
    },
    {
      "username": "smitty_cregger52",
      "userUrl": "https://www.imdb.com/user/ur5247487",
      "reviewLink": "https://www.imdb.com/review/rw1690129",
      "warningSpoilers": false,
      "date": "9 July 2007",
      "rate": "8",
      "helpful": "74 out of 119 found this helpful.",
      "title": "Not Serious, Not Controversial, but Really Funny!",
      "content": "This show stars two characters Bret, and Jermaine who have traveled from New Zealand to New York City in order to make their band \"Flight of the Conchords\" the next big thing. They are managed by a fellow New Zealander Murray, who really works for the NZ consulate in the US, but runs the band on the side, constantly failing to get them \"gigs\". Through interactions with Americans who almost always confuse them with Brits, an obsessed fan who is constantly stalking them, a buddy with a paintball gun, and a girlfriend who likes guys who are in a band, this show has some seriously funny moments. This show is full of humor that might make you think a little bit, but at the same time, you're hit with an occasional comment that makes you laugh, not laugh out loud, but you're just like haha, that was pretty funny. If you're a fan of Laugh out loud comedy where the jokes don't make you think a little bit, then stay away. This show isn't complex by any means, but it attempts to give you a subtle humor that some run away from. This show isn't the greatest thing to ever hit television, but if you're looking for a solid 30 minutes of entertainment, then tune in. I give it a very above average 8 out of 10, because it never fails to make you laugh, but at the same time, it's not the greatest show ever made."
    },
    {
      "username": "marieinkpen",
      "userUrl": "https://www.imdb.com/user/ur20476592",
      "reviewLink": "https://www.imdb.com/review/rw3292434",
      "warningSpoilers": true,
      "date": "7 August 2015",
      "rate": "10",
      "helpful": "8 out of 11 found this helpful.",
      "title": "Absolutely Perfect",
      "content": "I think this is the funniest sit-com I have ever watched. It makes me laugh out loud more than anything else I have ever seen. Why is a rambling conversation about buying a cup, or Simon and Garfunkel tribute acts, so funny? The writing is perfect and the acting is perfect. I do not know how these guys keep a straight face - not just Jemaine, Bret, and Murray, but the understated support cast too. The idea of a musical sit-com sounds horrendous - but not only are the songs very very funny but they are actually good songs too. Production quality very high. Consistently ingenious, pure joy. It also makes me want to go to New Zealand."
    },
    {
      "username": "theknownames",
      "userUrl": "https://www.imdb.com/user/ur12161715",
      "reviewLink": "https://www.imdb.com/review/rw6389392",
      "warningSpoilers": false,
      "date": "22 December 2020",
      "rate": "9",
      "helpful": "4 out of 7 found this helpful.",
      "title": "Awww",
      "content": "I love this show it makes me happy and generates lightness and fun . These guys are so talented and the show manages to showcase their wares as well as being a sweet fun comedy"
    },
    {
      "username": "owen-watts",
      "userUrl": "https://www.imdb.com/user/ur57284019",
      "reviewLink": "https://www.imdb.com/review/rw6585606",
      "warningSpoilers": false,
      "date": "11 February 2021",
      "rate": "7",
      "helpful": "3 out of 5 found this helpful.",
      "title": "Inner City Pressure",
      "content": "The Conchords series was a huge phenomenon that I entirely missed when it was originally on TV - their sound attracted earnest hipsters and it wasn't at all my bag - over the years though I've softened to them and now the astronomic hype has died down the understated alternate reality of the series seems to work even better through that retro lens. A world where these two charming and benign Kiwis aren't particularly liked by anyone and live in squalor in New York, drifting through strange sad narratives and roping their idiosyncratic songs into the mix in surreal asides. It all feels very low key and they play themselves with a heavy deadpan that puts the majority of the comedic weight on the manic Kirsten Schaal and the arrestingly silly Rhys Darby.The first series is the considerably stronger of the two, building on a wealth of stand-up, album material and even a mockumentary style British radio series (where a rudimentary version of Schaal's character is played stand-up Jimmy Carr would you believe) it has a lot more of a solid narrative foundation than the meandering second and the songs are a lot better. Throughout both though their idiosyncratic and innocuous charm prevails and you can easily see why it launched the mainstream careers of Bobin, Taika et al. It's still not exactly my bag, but it's a pleasant and diverting show nonetheless."
    },
    {
      "username": "ivymissing",
      "userUrl": "https://www.imdb.com/user/ur93484732",
      "reviewLink": "https://www.imdb.com/review/rw4378025",
      "warningSpoilers": false,
      "date": "5 October 2018",
      "rate": "10",
      "helpful": "5 out of 9 found this helpful.",
      "title": "BRING THIS SHOW BACK!",
      "content": "So funny, so well-written and the songs are so catchy. I loved these guys' style of humour - very much at their own expense and downright absurd. You feel better about yourself when things aren't going well when you watch this show!"
    },
    {
      "username": "Scars_Remain",
      "userUrl": "https://www.imdb.com/user/ur13026966",
      "reviewLink": "https://www.imdb.com/review/rw1942008",
      "warningSpoilers": false,
      "date": "6 September 2008",
      "rate": "10",
      "helpful": "4 out of 9 found this helpful.",
      "title": "Clever and Hilarious",
      "content": "This is one of the best shows I've ever seen and it truly is one of the funniest. Jemaine and Bret are one of the best comedy duos since Laurel and Hardy. The humor is dry and perfect. SEASON 1: I can't compare this season to any others because it's been the only so far but it is a wonderful kick off to the series. The characters are hilarious. My favorite episodes are \"Mugged,\" \"Bowie,\" \"The Actor,\" and \"The Third Conchord,\" but they are all hilarious and you need to see the entire season.I will add a review of season two when it comes out in 2009. Until then, check out this season and be prepared to laugh your head off. I know I did."
    },
    {
      "username": "tinytots2",
      "userUrl": "https://www.imdb.com/user/ur144605672",
      "reviewLink": "https://www.imdb.com/review/rw8031760",
      "warningSpoilers": false,
      "date": "3 April 2022",
      "rate": "5",
      "helpful": "4 out of 8 found this helpful.",
      "title": "A rags-to-rags musical adventure",
      "content": "Flight of the Conchords presents the experiences of Bret and Jemaine, a duo from New Zealand who're struggling to gain popularity as a folk band while residing illegally in New York. In this endeavour, they are aided by their manager Murray Hewitt, pestered by their only fan Mel, and advised by their friend Dave. The show combines deadpan humour with musical numbers as it depicts the protagonists' efforts to make ends meet, succeed at their musical ambitions and triumph in their romantic trysts.While I could recognize the comedic creativity in the script and a few jokes had me chuckling, this was a show that largely fell flat for me. Mostly due to my own subjective biases and predilections with cringe comedy and musicals being my least favourite subgenres. As a result, I frequently felt aggravated by the deadbeat characters and found myself routinely skipping past the songs. Bret and Jemaine's interpersonal interactions and social ineptness tended to irritate more than amuse, and Mel's creepy stalking behaviour didn't endear the show to me much either. Despite his incompetence, the character of Murray was a saving grace as I enjoyed the actor's offhand delivery of his witty lines.In contrast to these negative opinions of mine, I realize that the show is very well-regarded. For those who like musicals and awkward comedy, they will probably appreciate it a lot more."
    },
    {
      "username": "garymathe-76173",
      "userUrl": "https://www.imdb.com/user/ur97648704",
      "reviewLink": "https://www.imdb.com/review/rw4729666",
      "warningSpoilers": false,
      "date": "18 March 2019",
      "rate": "9",
      "helpful": "4 out of 8 found this helpful.",
      "title": "Deadpan genius with great music",
      "content": "Tenacious D, just better. Great songs with absurd humor, delivered with a straight face and kiwi accents. Two absolute geniuses playing loveable idiots. Must have on DVD."
    },
    {
      "username": "bklyn-87053",
      "userUrl": "https://www.imdb.com/user/ur70842786",
      "reviewLink": "https://www.imdb.com/review/rw8016945",
      "warningSpoilers": false,
      "date": "30 March 2022",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "My favorite",
      "content": "This is my go to show for feeling good , it's absolutely hysterical not a bad episode, I don't know how they actually said the lines in this show with a straight face and I absolutely love the music and listen to the music on my iPhone.everytime it's more amazing."
    },
    {
      "username": "canndyman",
      "userUrl": "https://www.imdb.com/user/ur27484473",
      "reviewLink": "https://www.imdb.com/review/rw3097658",
      "warningSpoilers": false,
      "date": "3 October 2014",
      "rate": "2",
      "helpful": "11 out of 46 found this helpful.",
      "title": "Flying Without Wings...",
      "content": "What a huge disappointment this turned out to be, after all the hype & the glowing reviews from some quarters - I'm really at a loss to see what all the fuss is about. The first episode was very weak, but I thought I'd give it one more chance.... but there was no improvement with episode 2 either.It's not especially funny, it's not particularly clever, & it's just terribly dull. I admit that Bret & Jemanine are good at knocking out the odd witty, spoofy & ironic folky tune about the vagaries of life, but you get the feeling here that that's as far as it goes. One or two songs, stretched & padded out with other material across 25 minutes with no real plot to speak of doesn't really make for classic comedy, & leaves the viewer feeling rather short-changed. I'm just amazed this show ever got commissioned into a series! Another problem is that you don't particularly feel any sympathy with the characters themselves - I found myself not really caring what happened to them, bad or good, & not making any emotional connection to them. To be fair, I think the genesis of a good idea is lurking here, but it needed a great deal more development, & would have benefited hugely from a top-notch script editor - one who could perhaps have crafted their paper-thin comic noodlings into some kind of cohesive plot & made it more palatable.Please don't buy this without at least viewing some excerpts on YouTube first (as another reviewer has also recommended) - at least then you won't potentially waste your money like I did (my copy will be going to the local charity shop). There are so many excellent comedy shows out there - sadly though, this isn't one of them."
    },
    {
      "username": "DanceInTheGutter",
      "userUrl": "https://www.imdb.com/user/ur19186220",
      "reviewLink": "https://www.imdb.com/review/rw1865506",
      "warningSpoilers": false,
      "date": "28 April 2008",
      "rate": "10",
      "helpful": "5 out of 9 found this helpful.",
      "title": "Relaxed and witty, this show is bound to stay stuck in your head for days...",
      "content": "I love them because they don't try to be something they're not.This is one of the few shows I actually enjoy watching, and one of the only shows I've actually laughed out loud to until I cried. Their timing is perfect, their songs are catchy and hilarious, and they aren't afraid to be awkward or show their true colors.Probably best watched with friends to laugh along with (the CD is also lots of fun to sing along with in the car with friends), this show is always amusing and holds the attention of even the most fickle viewers (me being one of them).An instant 'cult' phenomenon, but maybe on its way to wider audiences."
    },
    {
      "username": "harryandsally",
      "userUrl": "https://www.imdb.com/user/ur2961528",
      "reviewLink": "https://www.imdb.com/review/rw1755298",
      "warningSpoilers": true,
      "date": "22 October 2007",
      "rate": "10",
      "helpful": "7 out of 14 found this helpful.",
      "title": "i miss it",
      "content": "the subtle humor of this show is just so great. i also love the music. yes, our innermost thoughts are expressed in song, like when Jermaine writes a song for Brett and gets all graphic about his love for him and then Brett says he went a little over the top and Jermaine says \"that wasn't in there.\" Also the dream Brett has where Jermaine is David Bowie. and how Murray always has to take roll at each meeting, including calling his own name. \"Murray? Present.\" I think the key to the humor also is that they are so naive to the world of the US and they are learning every day. Oh, and when Jermaine tries to cheer Brett up by doing the talking stove. \"You love the talking stove, Britt!\" Hilarious. I thought I had a pretty strange sense of humor, but now I am sure of it! I actually didn't catch the show when it was on but I watched all the episodes on demand and now I am in withdrawal! Come back guys!"
    }
  ],
  "errorMessage": ""
}