{
  "imDbId": "tt0863046",
  "title": "Flight of the Conchords",
  "fullTitle": "Flight of the Conchords (TV Series 2007–2009)",
  "type": "TVSeries",
  "year": "2007",
  "language": "en",
  "titleInLanguage": "Flight of the Conchords (TV series)",
  "url": "https://en.wikipedia.org/wiki/Flight_of_the_Conchords_(TV_series)",
  "plotShort": {
    "plainText": "Flight of the Conchords is an American sitcom that was first shown on HBO on June 17, 2007. The show follows the adventures of Flight of the Conchords, a two-man band from New Zealand, as its members seek fame and success in New York City. The show stars the real-life duo of Jemaine Clement and Bret McKenzie, who play fictionalised versions of themselves. A second season was announced on August 17, 2007 and shown from January 18, 2009. On December 11, 2009, HBO canceled the series after two seasons, and the duo announced that the series was not going to be returning for a third season.\r\nThroughout its run, Flight of the Conchords received positive critical reviews, with its second season scoring 80/100 on Metacritic. The show received 10 Emmy Award nominations, including \"Outstanding Comedy Series\" and \"Outstanding Lead Actor in a Comedy Series\" for Jemaine Clement, both in 2009.",
    "html": "<p>Flight of the Conchords is an American sitcom that was first shown on HBO on June 17, 2007. The show follows the adventures of Flight of the Conchords, a two-man band from New Zealand, as its members seek fame and success in New York City. The show stars the real-life duo of Jemaine Clement and Bret McKenzie, who play fictionalised versions of themselves. A second season was announced on August 17, 2007 and shown from January 18, 2009. On December 11, 2009, HBO canceled the series after two seasons, and the duo announced that the series was not going to be returning for a third season.</p><p>Throughout its run, Flight of the Conchords received positive critical reviews, with its second season scoring 80/100 on Metacritic. The show received 10 Emmy Award nominations, including \"Outstanding Comedy Series\" and \"Outstanding Lead Actor in a Comedy Series\" for Jemaine Clement, both in 2009.</p>"
  },
  "plotFull": {
    "plainText": "Flight of the Conchords is an American sitcom that was first shown on HBO on June 17, 2007. The show follows the adventures of Flight of the Conchords, a two-man band from New Zealand, as its members seek fame and success in New York City. The show stars the real-life duo of Jemaine Clement and Bret McKenzie, who play fictionalised versions of themselves. A second season was announced on August 17, 2007 and shown from January 18, 2009. On December 11, 2009, HBO canceled the series after two seasons, and the duo announced that the series was not going to be returning for a third season.\r\nThroughout its run, Flight of the Conchords received positive critical reviews, with its second season scoring 80/100 on Metacritic. The show received 10 Emmy Award nominations, including \"Outstanding Comedy Series\" and \"Outstanding Lead Actor in a Comedy Series\" for Jemaine Clement, both in 2009.\r\nPlot\r\nThe series centers on the day-to-day lives and loves of two shepherds-turned-musicians, Jemaine and Bret (Jemaine Clement and Bret McKenzie, playing fictionalized versions of themselves), who have uprooted themselves from their native New Zealand to try to make it big as a folk duo in New York City. The two have frequent appointments with their officious and ineffectual band manager, Murray Hewitt (Rhys Darby), a Deputy Cultural Attaché at the New Zealand Consulate. Jemaine and Bret constantly fend off the amorous attentions of Mel (Kristen Schaal), a married woman who is their sole fan and stalker. Their friend Dave Mohumbhai (Arj Barker) works at a pawn shop and gives them advice on dealing with American women and culture. Other recurring characters include landlord Eugene (Eugene Mirman), love interests Coco (Sutton Foster) and Sally (Rachel Blanchard), Mel's husband Doug (David Costabile), and Murray's consulate subordinate Greg (Frank Wood).\r\nJemaine or Bret break into song in each episode. The songs are built into the narrative structure of the show in several different ways. Some songs form part of the plot of the show. In these instances, Bret or Jemaine sing to another character. Other songs serve as the internal monologue of one of the two. Typically, at least once per show, a song is shot in the form of a music video. Some songs use a combination of the styles. For example, in the first episode, \"Sally\", the song \"Most Beautiful Girl in the Room\" is a mix of Jemaine's thoughts and his spoken invitations to Sally to get a kebab and to go back to his place. The music video for \"Business Time\" (from \"Sally Returns\") depicts a daydream that Jemaine is having. As the series evolved, other main characters also had their own musical interludes, depicted in a similar manner to Jemaine and Bret's own songs.\r\nThe enthusiastic manner in which the characters express themselves through song contrasts with the otherwise low-key tone of the show. Thus, when the characters cannot speak about their feelings, the songs serve as inner monologues.\r\nEpisodes\r\nSeason 1 (2007)\r\nSeason 2 (2009)\r\nHistory\r\nThe show was created by Clement, McKenzie and James Bobin, and was based on the successful improvised 2005 BBC Radio 2 radio series of the same name. Bobin served as the show's main writer and director. The first episode of the series aired on HBO on June 17, 2007. The series received 100,000 views for the first-season premiere scored on Myspace.\r\nOn August 17, 2007, HBO announced a second season for Flight of the Conchords, originally set to premiere in 2008, but which was postponed to January 2009. Prior to the announcement, Jemaine Clement stated in an interview with The New Zealand Herald, \" is interested in doing another series but we have to think about it. It's not a definite offer but they have talked about us starting writing, but we've got other things we want to do as well\". McKenzie stated that the second season took longer to produce because the band had used most of their material in the first season. In an interview with The Star Ledger, he said \"We'd need some time to develop new material. It's like the second album syndrome. It might take a lot longer\". Shortly after the renewal announcement, Clement stated in an interview that the second season would likely consist of fewer than twelve episodes \"so they could concentrate on \"quality not quantity'\".\r\nMcKenzie and Clement returned to their hometown of Wellington to write for the second season, although the writing process was delayed by the 2007–2008 Writers Strike. Filming for the 10-episode second series began in September 2008.\r\nThe second season of the show premiered on January 18, 2009 on HBO. It gathered 250,000 streams in its first 10 days on FunnyOrDie.com. Unlike the first season, the second season was filmed and broadcast in High Definition.\r\nIn Australia, the second season of the show first aired on June 8, 2009 on SBS. SBS also made the episodes available for streaming (from within Australia only). The DVD of the second season was released in Australia on July 29, 2009.\r\nOn December 11, 2009, McKenzie and Clement announced that the show would not return for a third season. Clement had previously stated that writing the show took up a great deal of time. During a 2016 interview, McKenzie said they had decided to end the show because it had \"basically stopped being fun. It really wasn't a decision about money. It was definitely a decision about enjoying our lives.”\r\nCast\r\nMain characters\r\nJemaine Clemaine (Jemaine Clement) is one member of Flight of the Conchords who sings and plays bass, and is Bret's flatmate and best friend. He is socially awkward, rarely smiles or laughs, and typically overthinks even the most mundane situations.\r\nBret McKegney (Bret McKenzie) is the other member of Flight of the Conchords who sings and plays guitar, and is Jemaine's roommate. He often wears dated-looking animal T-shirts. He is mellow and more in touch with his feelings than Jemaine.\r\nMurray Hewitt (Rhys Darby) is the Conchords' manager. His day job is Deputy Cultural Attaché at the New Zealand consulate in New York City. He has few friends and is separated from his never-seen wife, Shelley, who left him for a man she met online. While he is passionate about the band and aspires to be a successful manager, he lacks basic knowledge of the music industry and thus consistently fails in his efforts to promote the Conchords. He is also thin-skinned and prone to outbursts of agitation, usually in a high-pitched voice, but he is consistently dedicated to Bret and Jemaine.\r\nMel (Kristen Schaal) is the Conchords' lone fan and frequently stalks them in pursuit of a romantic liaison, despite the fact that she is married. She is a Junior Professor of Psychology at a nearby university. Mel has been through legal trouble for stalking.\r\nDevjeet \"Dave\" Mohumbhai (Arj Barker) is a friend of Bret and Jemaine. He works at his father's pawn shop, Mohumbhai & Son, and dispenses off-kilter advice about women and life in America. He lives with his parents, though he claims they are his crazy roommates who just think they are his parents. Bret and Jemaine overestimate Dave's worldliness and often seek his advice on topics ranging from relationships to racial tensions.\r\nRecurring characters\r\nGreg (Frank Wood) is Murray's subordinate at the consulate. Murray often uses Greg as a scapegoat, in the face of which Greg remains stoically unflappable.\r\nEugene (Eugene Mirman) is Bret and Jemaine's landlord, who often inserts himself into conversations of which he is not a part. He is often seen involved performing maintenance in the building and in Bret and Jemaine's apartment. He has admitted to breaking into the apartment at night and kissing Jemaine while he sleeps. Eugene appears in several musical sequences, displaying proficiency in such instruments as saxophone and steel drum.\r\nDoug (David Costabile) is Mel's husband. He was once Senior Professor of Psychology at a nearby university, but lost his job for starting a relationship with Mel while she was a student there, and is now unemployed. Doug and his family had a restraining order against Mel at one point before he married her, and he also struggled with addiction at some point in the past. He plays the harp, which Mel deems “unmanly.”\r\nCoco (Sutton Foster) is Bret's girlfriend for part of the first season. Bret and Coco meet while working as part-time sign holders. When she learns that Bret still has feelings for Sally, Coco ends her relationship with him. Coco is the subject of the songs \"Boom\" and \"If You're Into It\".\r\nSally (Rachel Blanchard) is Bret's ex-girlfriend who dated him before the events of the series, and later dates Jemaine. She eventually accepts a marriage proposal from a rich Australian. Sally is the subject of the songs \"The Most Beautiful Girl (In the Room),\" \"Not Crying,\" and \"Business Time\".\r\nJohn (Lenny Venito) is a mugger and all-around ne'er-do-well. He mugs Bret and Jemaine, but later befriends Jemaine while they share a jail cell. Later on, he and Jemaine stage a mugging of Bret in an attempt to make Bret look cool in front of a girl. John once killed a monkey, an act of which he is deeply ashamed.\r\nBryan (Brian Sergent) is the laid-back, uncouth Prime Minister of New Zealand. Bryan shows little interest in the affairs of his country, instead preferring to occupy himself with pointless capers in the United States. He introduces himself by saying \"Hi, I'm Bryan, the Prime Minister of New Zealand\". He is fond of beer and sleeping, and is easily influenced by recently-watched films, such as Cars and The Matrix.\r\nCameo\r\nSinjay (Aziz Ansari), a man who sells fruit outside of Bret and Jemaine's apartment, but refuses to sell fruit to them because he is \"racist\" against New Zealanders and later starts a \"race war\" with them after Bret confronts him. The three come to friendly terms after it is revealed that his animosity was due to confusing the two for Australians. Episode: \"Drive By\"\r\nGypsy Kings Fan (Taika Waititi), a man who reserves the new Gipsy Kings cassette in a recorded New Zeeland commercial. Episode: \"Drive By\"\r\nIsabella (Judah Friedlander), a man who tries to pawn a cake to Dave. Episode: \"Sally\"\r\nDavid Armstrong (John Hodgman), the manager of a greeting card company with which the Conchords sign a recording contract. Episode: \"Bowie\"\r\nFruit Stand Patron (Kevin Allison), a man who is served before Jemaine and Bret, although he was behind them in line, due to the fruit vendor's bigotry. Episode: \"Drive By\"\r\nClub Owner (Kate Pierson), who turns the band away from a scheduled gig due to their reputation for causing damage. Episode: \"What Goes on Tour\"\r\nClub MC (Daryl Hall), the MC of the Tuesday World Music Jam at which the Conchords play. He introduces them as \"Flute of the Commodores\" and ushers them quickly off stage several bars into \"Rock the Party\". Episode: \"New Fans\"\r\nMartin Clark (Greg Proops), the head of an agency that hires Bret and Jemaine to write a jingle for a new \"women-only\" toothpaste. Episode: \"A Good Opportunity\"\r\nObnoxious Australian (Adam Garcia), a deputy to the Australian ambassador to the United States who makes fun of Murray and Jemaine. Episode: \"The Tough Brets\"\r\nTod (Todd Barry), a bongos player who joins the Conchords but then break off and starts an alternate band that ends up being far more popular.\r\nDemetri (Demetri Martin), a keytar player who teams up with Todd to form \"The Original Flight of the Conchords\" and \"Crazy Dogggz.\"\r\nKeitha (Sarah Wynter), an Australian woman with whom Jemaine starts a relationship. When both parties' respective friends disapprove of the relationship, they make plans to elope and move to New Jersey, but Keitha robs the Conchords' apartment while Jemaine is waiting for her. Episode: \"Unnatural Love\"\r\nBouncer (Randy Jones), who leads an all-male conga line in a nightclub. Episode: \"Unnatural Love\"\r\nElton John impersonator (Patton Oswalt), whom Bret and Jemaine meet while impersonating Simon & Garfunkel. Episode: \"Prime Minister\"\r\nArt Garfunkel (himself), who saves Jemaine from a woman (Mary Lynn Rajskub) who makes him dress up like Art Garfunkel and have sex with her, an act known as \"Garfunkeling.\" Episode: \"Prime Minister\"\r\nPaula (Lucy Lawless), a New Zealand tourism official and old friend of Bryan, the Prime Minister, who is in love with her. Episode: \"New Zealand Town\"\r\nBen (Will Forte), a dry cleaner and semi-professional actor hired by Bret and Jemaine to impersonate a record executive. Episode: \"The Actor\"\r\nBarbara, later revealed to be named Brahbrah (Kristen Wiig), a woman with a \"lazy eye\" who is looking for her missing epileptic dog Charlie. Bret and Jemaine are both attracted to her and compete to win her affections, often going to extreme lengths to do so. She is the subject of the song \"We're Both in Love with a Sexy Lady.\" Episode: \"Love Is a Weapon of Choice\"\r\nFelicia (June Diane Raphael) and Lisa (Eliza Coupe), two women working at a French bakery whom Jemaine and Bret begin dating, respectively. Episode: \"Girlfriends\"\r\nJim (Jim Gaffigan), Murray's friend, introduced to Bret and Jemaine as part of Murray's plan to elevate Bret and Jemaine on his friendship graph. Episode: \"Murray Takes It to the Next Level\"\r\nThe unnamed Australian Ambassador to the United States (Alan Dale) antagonizes the main characters on more than one occasion.\r\nReception\r\nCritical reception\r\nFlight of the Conchords received generally positive reviews from critics. Season 1 has a 68/100 rating based on 15 reviews on Metacritic, and season 2 has an 80/100 rating, based on 10 reviews. Detroit Free Press spoke positive of the series, describing it as \"TV's most original and irresistible new comic concoction,\" and San Francisco Chronicle wrote that it \"may well be the funniest thing you've seen in ages.\"\r\nIn 2019, Flight of the Conchords was ranked 65th on The Guardian's list of the 100 best TV shows of the 21st century.\r\nAwards\r\nAt the 12th Satellite Awards, the show was nominated for Best Television Series – Musical or Comedy.\r\nThe duo of Clement and McKenzie was awarded with the status of 2007 Wellingtonians of the Year after their international success blossomed that year.\r\nThe show received four Emmy Award nominations in 2008. \"Sally Returns\" was nominated for \"Outstanding Directing for a Limited or Anthology Series or Movie\", \"Yoko\" was nominated for \"Outstanding Writing for a Comedy Series\" and two songs, \"Most Beautiful Girl (In the Room)\" and \"Inner City Pressure\", were nominated for \"Outstanding Original Music and Lyrics\".\r\nAt the 60th Writers Guild of America Awards in 2007, the show was nominated for three awards – Best Television: Comedy Series, Best Television: Episodic Comedy Series (for \"Sally Returns\") and for Best Television: New Series. At the 2007 Television Critics Association Awards, the show received 2 nominations – Outstanding Achievement in Comedy and Outstanding New Program of the Year.\r\nAt the 61st Primetime Emmy Awards, the show was nominated for six awards – Outstanding Comedy Series, Outstanding Directing for a Limited or Anthology Series or Movie (for the episode \"The Tough Brets\"), Outstanding Lead Actor in a Drama Series (Jemaine Clement), Outstanding Original Music and Lyrics (for the song \"Carol Brown\"), Outstanding Sound Mixing for a Limited or Anthology Series or Movie, and Outstanding Writing for a Comedy Series (for the episode \"Prime Minister\").",
    "html": "<p>Flight of the Conchords is an American sitcom that was first shown on HBO on June 17, 2007. The show follows the adventures of Flight of the Conchords, a two-man band from New Zealand, as its members seek fame and success in New York City. The show stars the real-life duo of Jemaine Clement and Bret McKenzie, who play fictionalised versions of themselves. A second season was announced on August 17, 2007 and shown from January 18, 2009. On December 11, 2009, HBO canceled the series after two seasons, and the duo announced that the series was not going to be returning for a third season.</p><p>Throughout its run, Flight of the Conchords received positive critical reviews, with its second season scoring 80/100 on Metacritic. The show received 10 Emmy Award nominations, including \"Outstanding Comedy Series\" and \"Outstanding Lead Actor in a Comedy Series\" for Jemaine Clement, both in 2009.</p><br/><h3>Plot</h3><p>The series centers on the day-to-day lives and loves of two shepherds-turned-musicians, Jemaine and Bret (Jemaine Clement and Bret McKenzie, playing fictionalized versions of themselves), who have uprooted themselves from their native New Zealand to try to make it big as a folk duo in New York City. The two have frequent appointments with their officious and ineffectual band manager, Murray Hewitt (Rhys Darby), a Deputy Cultural Attaché at the New Zealand Consulate. Jemaine and Bret constantly fend off the amorous attentions of Mel (Kristen Schaal), a married woman who is their sole fan and stalker. Their friend Dave Mohumbhai (Arj Barker) works at a pawn shop and gives them advice on dealing with American women and culture. Other recurring characters include landlord Eugene (Eugene Mirman), love interests Coco (Sutton Foster) and Sally (Rachel Blanchard), Mel's husband Doug (David Costabile), and Murray's consulate subordinate Greg (Frank Wood).</p><p>Jemaine or Bret break into song in each episode. The songs are built into the narrative structure of the show in several different ways. Some songs form part of the plot of the show. In these instances, Bret or Jemaine sing to another character. Other songs serve as the internal monologue of one of the two. Typically, at least once per show, a song is shot in the form of a music video. Some songs use a combination of the styles. For example, in the first episode, \"Sally\", the song \"Most Beautiful Girl in the Room\" is a mix of Jemaine's thoughts and his spoken invitations to Sally to get a kebab and to go back to his place. The music video for \"Business Time\" (from \"Sally Returns\") depicts a daydream that Jemaine is having. As the series evolved, other main characters also had their own musical interludes, depicted in a similar manner to Jemaine and Bret's own songs.</p><p>The enthusiastic manner in which the characters express themselves through song contrasts with the otherwise low-key tone of the show. Thus, when the characters cannot speak about their feelings, the songs serve as inner monologues.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">12</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 17, 2007</td><td style=\"padding:0 8px\">September 2, 2007</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 18, 2009</td><td style=\"padding:0 8px\">March 22, 2009</td></tr></tbody></table><h4>Season 1 (2007)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#b0e0e6;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#b0e0e6;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#b0e0e6\">Title</th><th scope=\"col\" style=\"background:#b0e0e6\">Directed by</th><th scope=\"col\" style=\"background:#b0e0e6\">Written by</th><th scope=\"col\" style=\"background:#b0e0e6\">Original air date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Sally</span>\"</td><td style=\"text-align:center\"><span>James Bobin</span></td><td style=\"text-align:center\">James Bobin &amp; <span>Jemaine Clement</span> &amp; <span>Bret McKenzie</span></td><td style=\"text-align:center\">June 17, 2007</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B0E0E6\"><p>Bret and Jemaine go to a party at Dave's place where Jemaine sees, and falls for, a beautiful girl named Sally, Bret's ex. Jemaine's growing relationship leaves Bret feeling neglected and Murray helps the band film a music video. Cameo: <span>Judah Friedlander</span>.</p>Songs featured: \"The Most Beautiful Girl (In the Room),\" \"Not Crying,\" \"Robots\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Bret Gives Up the Dream</span>\"</td><td style=\"text-align:center\">James Bobin</td><td style=\"text-align:center\">James Bobin &amp; Jemaine Clement &amp; Bret McKenzie</td><td style=\"text-align:center\">June 24, 2007</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B0E0E6\"><p>The band's poor financial state leads Bret to get a job as a human billboard to help make ends meet. However, it interferes with the band's gig at a travel expo, so Murray and Jemaine replace Bret with a cassette tape in hopes of outdoing the flashier Australian display. Bret is attracted to a girl, Coco (<span>Sutton Foster</span>), at his new job.</p>Songs featured: \"Inner City Pressure,\" \"Boom,\" \"Rock the Party\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Mugged</span>\"</td><td style=\"text-align:center\">James Bobin</td><td style=\"text-align:center\">James Bobin &amp; Jemaine Clement &amp; Bret McKenzie</td><td style=\"text-align:center\">July 1, 2007</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B0E0E6\"><p>Bret loses Jemaine's trust after Bret abandons him when they get mugged. To regain it, Bret tries to retrieve Jemaine's stolen \"camera phone\" (a phone with a camera taped to it) from their muggers, who are experiencing their own trust issues.</p>Songs featured: \"Hiphopopotamus vs. Rhymenoceros,\" \"Think About It\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Yoko</span>\"</td><td style=\"text-align:center\"><span>Troy Miller</span></td><td style=\"text-align:center\">James Bobin &amp; Jemaine Clement &amp; Bret McKenzie</td><td style=\"text-align:center\">July 8, 2007</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B0E0E6\"><p>Bret begins dating Coco (<span>Sutton Foster</span>), but Jemaine won't stop tagging along on the dates. When Bret asks him to stop, Jemaine concludes that Coco  is trying to break up the band.</p>Songs featured: \"If You're Into It,\" \"Pencils in the Wind\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Sally Returns</span>\"</td><td style=\"text-align:center\">James Bobin</td><td style=\"text-align:center\">James Bobin &amp; Jemaine Clement &amp; Bret McKenzie</td><td style=\"text-align:center\">July 15, 2007</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B0E0E6\"><p>After Jemaine reconnects with Sally, Bret decides that he wants to pursue her as well. However, when they both show up at her birthday party to woo her with their homemade presents, they are in for a shock.</p>Songs featured: \"Business Time,\" \"Song for Sally\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Bowie</span>\"</td><td style=\"text-align:center\">Troy Miller</td><td style=\"text-align:center\">James Bobin &amp; Jemaine Clement &amp; Bret McKenzie</td><td style=\"text-align:center\">July 22, 2007</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B0E0E6\"><p>After a photo session, Bret develops body image issues and gets some advice in a series of dreams featuring his idol, <span>David Bowie</span> (played by Jemaine). Jemaine plots to cheer him up and Murray tries to get one of the band's tunes used for a musical greeting card.</p>Songs featured: \"Bret, You've Got It Going On,\" \"Bowie\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Drive By</span>\"</td><td style=\"text-align:center\">Taika Waititi</td><td style=\"text-align:center\"><span>Taika Waititi</span></td><td style=\"text-align:center\">July 29, 2007</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B0E0E6\"><p>Bret and Jemaine are shocked by the prejudiced actions of Sanjay (<span>Aziz Ansari</span>), a fruit vendor who refuses to sell to them because of their nationality. Dave recommends a strong response and teaches them how to \"flip the bird\". Murray is smitten with the new tech support lady at the consulate. Cameo: <span>Taika Waititi</span>.</p>Songs featured: \"Albi the Racist Dragon,\" \"Mutha'uckas,\" \"Leggy Blonde\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Girlfriends</span>\"</td><td style=\"text-align:center\">James Bobin</td><td style=\"text-align:center\"><span>Eric Kaplan</span></td><td style=\"text-align:center\">August 5, 2007</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B0E0E6\"><p>Bret and Jemaine pick up two women who work in a croissant shop (<span>Eliza Coupe</span>, <span>June Diane Raphael</span>) and have very different dating experiences. Murray negotiates a record deal for the band.</p>Songs featured: \"Foux Du Fa Fa,\" \"A Kiss Is Not A Contract\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>What Goes on Tour</span>\"</td><td style=\"text-align:center\">Paul Simms</td><td style=\"text-align:center\"><span>Paul Simms</span></td><td style=\"text-align:center\">August 12, 2007</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B0E0E6\"><p>Murray organizes a warm-up tour in preparation for a big gig in Central Park. However, the boys' carelessness and an encounter with a women's water-polo team threatens to ruin the tour and strain their relationship with the well-intentioned Murray.</p>Songs featured: \"Mermaid,\" \"Rock the Party\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>New Fans</span>\"</td><td style=\"text-align:center\">Taika Waititi</td><td style=\"text-align:center\"><span>Duncan Sarkies</span></td><td style=\"text-align:center\">August 19, 2007</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B0E0E6\"><p>A performance at a local \"World Music Jam\" results in the Conchords gaining two new fans, Summer and Rain, but Mel is suspicious of the newcomers and their motives. Murray encourages the band to adopt a more \"rock star\" attitude to enhance their image.</p>Songs featured: \"Ladies of the World,\" \"The Prince of Parties,\" \"Rock the Party\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep11\" style=\"text-align:center\">11</th><td style=\"text-align:center\">11</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span class=\"mw-redirect\">The Actor</span>\"</td><td style=\"text-align:center\"><span>Michael Patrick Jann</span></td><td style=\"text-align:center\"><span>Damon Beesley</span> &amp; <span>Iain Morris</span></td><td style=\"text-align:center\">August 26, 2007</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B0E0E6\"><p>Bret and Jemaine ask Ben (<span>Will Forte</span>), a \"semi-professional\" actor / dry cleaner, to cheer Murray up after a gig does not go well, but the actor gets caught up in the role and offers the band a record deal. Murray pays for the \"signing\" party, while the actor stars in the movie <i>Dry Cleaner</i> with <span>John Turturro</span>.</p>Songs featured: \"Cheer Up, Murray,\" \"Frodo\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep12\" style=\"text-align:center\">12</th><td style=\"text-align:center\">12</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>The Third Conchord</span>\"</td><td style=\"text-align:center\">James Bobin</td><td style=\"text-align:center\">James Bobin &amp; Jemaine Clement &amp; Bret McKenzie</td><td style=\"text-align:center\">September 2, 2007</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #B0E0E6\"><p>Murray hires Todd (<span>Todd Barry</span>) as a bongo player for the band, without consulting Bret and Jemaine. Incensed, Bret and Jemaine intend to fire Todd, but Todd convinces Jemaine and Murray to fire Bret instead. Bret responds by forming his own competing band with keytar player Demetri (<span>Demetri Martin</span>). Eventually, Todd and Demetri decide to form their own duo, with Murray agreeing to manage them.</p>Songs featured: \"Bret's Angry Dance,\" \"Doggy Bounce\"</td></tr></tbody></table><h4>Season 2 (2009)</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#87CEEB;width:5%\"><abbr title=\"Number\">No.</abbr><br>overall</th><th scope=\"col\" style=\"background:#87CEEB;width:5%\"><abbr title=\"Number\">No.</abbr> in<br>season</th><th scope=\"col\" style=\"background:#87CEEB\">Title</th><th scope=\"col\" style=\"background:#87CEEB\">Directed by</th><th scope=\"col\" style=\"background:#87CEEB\">Written by</th><th scope=\"col\" style=\"background:#87CEEB\">Original air date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep13\" style=\"text-align:center\">13</th><td style=\"text-align:center\">1</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>A Good Opportunity</span>\"</td><td style=\"text-align:center\"><span>James Bobin</span></td><td style=\"text-align:center\">James Bobin &amp; <span>Jemaine Clement</span> &amp; <span>Bret McKenzie</span></td><td style=\"text-align:center\">January 18, 2009</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #87CEEB\"><p>Bret and Jemaine fire Murray for neglecting them in favour of the Crazy Dogggz and almost immediately they receive an offer to write a jingle for a commercial. Meanwhile, Murray's fortunes reverse after he discovers that the Crazy Dogggz's big hit is a rip-off of a 1990s Polish song.</p>Songs featured: \"Rejected,\" \"Femident Toothpaste,\" \"Angels\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep14\" style=\"text-align:center\">14</th><td style=\"text-align:center\">2</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>The New Cup</span>\"</td><td style=\"text-align:center\">James Bobin</td><td style=\"text-align:center\"><span>Duncan Sarkies</span></td><td style=\"text-align:center\">January 25, 2009</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #87CEEB\"><p>Bret and Jemaine's fortunes unravel after Bret buys a new tea cup. With emergency band funds unavailable, Jemaine takes desperate measures in hopes of supplementing their income.</p>Songs featured: \"Sugalumps,\" \"You Don't Have to Be a Prostitute\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep15\" style=\"text-align:center\">15</th><td style=\"text-align:center\">3</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>The Tough Brets</span>\"</td><td style=\"text-align:center\">James Bobin</td><td style=\"text-align:center\">James Bobin &amp; Jemaine Clement &amp; Bret McKenzie</td><td style=\"text-align:center\">February 1, 2009</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #87CEEB\"><p>After disparaging rappers in a song, Bret starts a gang when he fears for his safety; Murray endures a series of degrading encounters with members of the Australian consulate.</p>Songs featured: \"Hurt Feelings,\" \"Hurt Feelings (Reprise),\" \"Stay Cool\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep16\" style=\"text-align:center\">16</th><td style=\"text-align:center\">4</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Murray Takes It to the Next Level</span>\"</td><td style=\"text-align:center\"><span>Troy Miller</span></td><td style=\"text-align:center\">James Bobin &amp; Jemaine Clement &amp; Bret McKenzie</td><td style=\"text-align:center\">February 8, 2009</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #87CEEB\"><p>Murray tries to elevate Bret and Jemaine on his friendship graph, bringing his inquisitive best friend Jim (<span>Jim Gaffigan</span>) in on the plan; Mel demands an apology from Bret for inappropriate dream behavior.</p>Songs featured: \"Dreams,\" \"Friends\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep17\" style=\"text-align:center\">17</th><td style=\"text-align:center\">5</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Unnatural Love</span>\"</td><td style=\"text-align:center\"><span>Michel Gondry</span></td><td style=\"text-align:center\"><span>Iain Morris</span> &amp; <span>Damon Beesley</span></td><td style=\"text-align:center\">February 15, 2009</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #87CEEB\"><p>After a one-night stand, Jemaine is horrified to discover he has accidentally slept with an Australian. Bret and Murray are also dismayed, but Jemaine can't resist continuing to date her.</p>Songs featured: \"Too Many Dicks On The Dance Floor,\" \"Carol Brown\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep18\" style=\"text-align:center\">18</th><td style=\"text-align:center\">6</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Love Is a Weapon of Choice</span>\"</td><td style=\"text-align:center\">James Bobin</td><td style=\"text-align:center\"><span>Paul Simms</span></td><td style=\"text-align:center\">February 22, 2009</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #87CEEB\"><p>Bret and Jemaine both fall for Brahbrah (<span>Kristen Wiig</span>), a lazy-eyed woman whose missing dog has epilepsy, leading to a duel, a canine benefit and a couple of new tunes.</p>Songs featured: \"We're Both in Love with a Sexy Lady,\" \"Love Is a Weapon of Choice,\" \"Epileptic Dogs\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep19\" style=\"text-align:center\">19</th><td style=\"text-align:center\">7</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Prime Minister</span>\"</td><td style=\"text-align:center\">James Bobin</td><td style=\"text-align:center\">James Bobin &amp; Jemaine Clement &amp; Bret McKenzie</td><td style=\"text-align:center\">March 1, 2009</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #87CEEB\"><p>Foiled by the White House, Murray arranges a presidential meeting for the visiting Prime Minister of New Zealand; a tribute gig ends with Jemaine getting a date with Karen (<span>Mary Lynn Rajskub</span>), an <span>Art Garfunkel</span> fanatic. Guest starring Art Garfunkel as himself and <span>Patton Oswalt</span> as an Elton John impersonator.</p>Songs featured: \"Demon Woman,\" \"Oh, Dance, Baby\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep20\" style=\"text-align:center\">20</th><td style=\"text-align:center\">8</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>New Zealand Town</span>\"</td><td style=\"text-align:center\"><span>Taika Waititi</span></td><td style=\"text-align:center\">Taika Waititi</td><td style=\"text-align:center\">March 8, 2009</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #87CEEB\"><p>Trying to look cool for a gig at the Grand Opening of New York's one-block New Zealand enclave, the Conchords end up getting hooked on hair gel. Guest starring <span>Lucy Lawless</span> as Paula.</p>Song featured: \"Fashion Is Danger\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep21\" style=\"text-align:center\">21</th><td style=\"text-align:center\">9</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Wingmen</span>\"</td><td style=\"text-align:center\">James Bobin</td><td style=\"text-align:center\">James Bobin &amp; Jemaine Clement &amp; Bret McKenzie</td><td style=\"text-align:center\">March 15, 2009</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #87CEEB\"><p>Bret enlists Jemaine and Dave to help him try to land a girlfriend; Murray regrets making Greg his scapegoat.</p>Songs featured: \"Rambling Through the Avenues of Time,\" \"I Told You I Was Freaky\"</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep22\" style=\"text-align:center\">22</th><td style=\"text-align:center\">10</td><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"<span>Evicted</span>\"</td><td style=\"text-align:center\">Taika Waititi</td><td style=\"text-align:center\">James Bobin &amp; Jemaine Clement &amp; Bret McKenzie</td><td style=\"text-align:center\">March 22, 2009</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"7\" style=\"border-bottom:solid 3px #87CEEB\"><p>Unable to pay off their back rent, Bret and Jemaine move in with Mel and Doug; Murray looks to cash in on a stage play about the Conchords' travails. Ultimately, Bret and Jemaine are deported to New Zealand, where they resume their pre-music careers as shepherds.</p>Songs featured: \"Everyday Sounds Musical Montage,\" \"Petrov, Yelyena, and Me,\" \"Flight of the Conchords: The Broadway Musical\"</td></tr></tbody></table><br/><h3>History</h3><p>The show was created by Clement, McKenzie and James Bobin, and was based on the successful improvised 2005 BBC Radio 2 radio series of the same name. Bobin served as the show's main writer and director. The first episode of the series aired on HBO on June 17, 2007. The series received 100,000 views for the first-season premiere scored on Myspace.</p><p>On August 17, 2007, HBO announced a second season for Flight of the Conchords, originally set to premiere in 2008, but which was postponed to January 2009. Prior to the announcement, Jemaine Clement stated in an interview with The New Zealand Herald, \" is interested in doing another series but we have to think about it. It's not a definite offer but they have talked about us starting writing, but we've got other things we want to do as well\". McKenzie stated that the second season took longer to produce because the band had used most of their material in the first season. In an interview with The Star Ledger, he said \"We'd need some time to develop new material. It's like the second album syndrome. It might take a lot longer\". Shortly after the renewal announcement, Clement stated in an interview that the second season would likely consist of fewer than twelve episodes \"so they could concentrate on \"quality not quantity'\".</p><p>McKenzie and Clement returned to their hometown of Wellington to write for the second season, although the writing process was delayed by the 2007–2008 Writers Strike. Filming for the 10-episode second series began in September 2008.</p><p>The second season of the show premiered on January 18, 2009 on HBO. It gathered 250,000 streams in its first 10 days on FunnyOrDie.com. Unlike the first season, the second season was filmed and broadcast in High Definition.</p><p>In Australia, the second season of the show first aired on June 8, 2009 on SBS. SBS also made the episodes available for streaming (from within Australia only). The DVD of the second season was released in Australia on July 29, 2009.</p><p>On December 11, 2009, McKenzie and Clement announced that the show would not return for a third season. Clement had previously stated that writing the show took up a great deal of time. During a 2016 interview, McKenzie said they had decided to end the show because it had \"basically stopped being fun. It really wasn't a decision about money. It was definitely a decision about enjoying our lives.”</p><br/><h3>Cast</h3><h4>Main characters</h4><ul><li>Jemaine Clemaine (Jemaine Clement) is one member of Flight of the Conchords who sings and plays bass, and is Bret's flatmate and best friend. He is socially awkward, rarely smiles or laughs, and typically overthinks even the most mundane situations.</li><li>Bret McKegney (Bret McKenzie) is the other member of Flight of the Conchords who sings and plays guitar, and is Jemaine's roommate. He often wears dated-looking animal T-shirts. He is mellow and more in touch with his feelings than Jemaine.</li><li>Murray Hewitt (Rhys Darby) is the Conchords' manager. His day job is Deputy Cultural Attaché at the New Zealand consulate in New York City. He has few friends and is separated from his never-seen wife, Shelley, who left him for a man she met online. While he is passionate about the band and aspires to be a successful manager, he lacks basic knowledge of the music industry and thus consistently fails in his efforts to promote the Conchords. He is also thin-skinned and prone to outbursts of agitation, usually in a high-pitched voice, but he is consistently dedicated to Bret and Jemaine.</li><li>Mel (Kristen Schaal) is the Conchords' lone fan and frequently stalks them in pursuit of a romantic liaison, despite the fact that she is married. She is a Junior Professor of Psychology at a nearby university. Mel has been through legal trouble for stalking.</li><li>Devjeet \"Dave\" Mohumbhai (Arj Barker) is a friend of Bret and Jemaine. He works at his father's pawn shop, Mohumbhai & Son, and dispenses off-kilter advice about women and life in America. He lives with his parents, though he claims they are his crazy roommates who just think they are his parents. Bret and Jemaine overestimate Dave's worldliness and often seek his advice on topics ranging from relationships to racial tensions.</li></ul><h4>Recurring characters</h4><ul><li>Greg (Frank Wood) is Murray's subordinate at the consulate. Murray often uses Greg as a scapegoat, in the face of which Greg remains stoically unflappable.</li><li>Eugene (Eugene Mirman) is Bret and Jemaine's landlord, who often inserts himself into conversations of which he is not a part. He is often seen involved performing maintenance in the building and in Bret and Jemaine's apartment. He has admitted to breaking into the apartment at night and kissing Jemaine while he sleeps. Eugene appears in several musical sequences, displaying proficiency in such instruments as saxophone and steel drum.</li><li>Doug (David Costabile) is Mel's husband. He was once Senior Professor of Psychology at a nearby university, but lost his job for starting a relationship with Mel while she was a student there, and is now unemployed. Doug and his family had a restraining order against Mel at one point before he married her, and he also struggled with addiction at some point in the past. He plays the harp, which Mel deems “unmanly.”</li><li>Coco (Sutton Foster) is Bret's girlfriend for part of the first season. Bret and Coco meet while working as part-time sign holders. When she learns that Bret still has feelings for Sally, Coco ends her relationship with him. Coco is the subject of the songs \"Boom\" and \"If You're Into It\".</li><li>Sally (Rachel Blanchard) is Bret's ex-girlfriend who dated him before the events of the series, and later dates Jemaine. She eventually accepts a marriage proposal from a rich Australian. Sally is the subject of the songs \"The Most Beautiful Girl (In the Room),\" \"Not Crying,\" and \"Business Time\".</li><li>John (Lenny Venito) is a mugger and all-around ne'er-do-well. He mugs Bret and Jemaine, but later befriends Jemaine while they share a jail cell. Later on, he and Jemaine stage a mugging of Bret in an attempt to make Bret look cool in front of a girl. John once killed a monkey, an act of which he is deeply ashamed.</li><li>Bryan (Brian Sergent) is the laid-back, uncouth Prime Minister of New Zealand. Bryan shows little interest in the affairs of his country, instead preferring to occupy himself with pointless capers in the United States. He introduces himself by saying \"Hi, I'm Bryan, the Prime Minister of New Zealand\". He is fond of beer and sleeping, and is easily influenced by recently-watched films, such as Cars and The Matrix.</li></ul><h4>Cameo</h4><ul><li>Sinjay (Aziz Ansari), a man who sells fruit outside of Bret and Jemaine's apartment, but refuses to sell fruit to them because he is \"racist\" against New Zealanders and later starts a \"race war\" with them after Bret confronts him. The three come to friendly terms after it is revealed that his animosity was due to confusing the two for Australians. Episode: \"Drive By\"</li><li>Gypsy Kings Fan (Taika Waititi), a man who reserves the new Gipsy Kings cassette in a recorded New Zeeland commercial. Episode: \"Drive By\"</li><li>Isabella (Judah Friedlander), a man who tries to pawn a cake to Dave. Episode: \"Sally\"</li><li>David Armstrong (John Hodgman), the manager of a greeting card company with which the Conchords sign a recording contract. Episode: \"Bowie\"</li><li>Fruit Stand Patron (Kevin Allison), a man who is served before Jemaine and Bret, although he was behind them in line, due to the fruit vendor's bigotry. Episode: \"Drive By\"</li><li>Club Owner (Kate Pierson), who turns the band away from a scheduled gig due to their reputation for causing damage. Episode: \"What Goes on Tour\"</li><li>Club MC (Daryl Hall), the MC of the Tuesday World Music Jam at which the Conchords play. He introduces them as \"Flute of the Commodores\" and ushers them quickly off stage several bars into \"Rock the Party\". Episode: \"New Fans\"</li><li>Martin Clark (Greg Proops), the head of an agency that hires Bret and Jemaine to write a jingle for a new \"women-only\" toothpaste. Episode: \"A Good Opportunity\"</li><li>Obnoxious Australian (Adam Garcia), a deputy to the Australian ambassador to the United States who makes fun of Murray and Jemaine. Episode: \"The Tough Brets\"</li><li>Tod (Todd Barry), a bongos player who joins the Conchords but then break off and starts an alternate band that ends up being far more popular.</li><li>Demetri (Demetri Martin), a keytar player who teams up with Todd to form \"The Original Flight of the Conchords\" and \"Crazy Dogggz.\"</li><li>Keitha (Sarah Wynter), an Australian woman with whom Jemaine starts a relationship. When both parties' respective friends disapprove of the relationship, they make plans to elope and move to New Jersey, but Keitha robs the Conchords' apartment while Jemaine is waiting for her. Episode: \"Unnatural Love\"</li><li>Bouncer (Randy Jones), who leads an all-male conga line in a nightclub. Episode: \"Unnatural Love\"</li><li>Elton John impersonator (Patton Oswalt), whom Bret and Jemaine meet while impersonating Simon & Garfunkel. Episode: \"Prime Minister\"</li><li>Art Garfunkel (himself), who saves Jemaine from a woman (Mary Lynn Rajskub) who makes him dress up like Art Garfunkel and have sex with her, an act known as \"Garfunkeling.\" Episode: \"Prime Minister\"</li><li>Paula (Lucy Lawless), a New Zealand tourism official and old friend of Bryan, the Prime Minister, who is in love with her. Episode: \"New Zealand Town\"</li><li>Ben (Will Forte), a dry cleaner and semi-professional actor hired by Bret and Jemaine to impersonate a record executive. Episode: \"The Actor\"</li><li>Barbara, later revealed to be named Brahbrah (Kristen Wiig), a woman with a \"lazy eye\" who is looking for her missing epileptic dog Charlie. Bret and Jemaine are both attracted to her and compete to win her affections, often going to extreme lengths to do so. She is the subject of the song \"We're Both in Love with a Sexy Lady.\" Episode: \"Love Is a Weapon of Choice\"</li><li>Felicia (June Diane Raphael) and Lisa (Eliza Coupe), two women working at a French bakery whom Jemaine and Bret begin dating, respectively. Episode: \"Girlfriends\"</li><li>Jim (Jim Gaffigan), Murray's friend, introduced to Bret and Jemaine as part of Murray's plan to elevate Bret and Jemaine on his friendship graph. Episode: \"Murray Takes It to the Next Level\"</li><li>The unnamed Australian Ambassador to the United States (Alan Dale) antagonizes the main characters on more than one occasion.</li></ul><br/><h3>Reception</h3><h4>Critical reception</h4><p>Flight of the Conchords received generally positive reviews from critics. Season 1 has a 68/100 rating based on 15 reviews on Metacritic, and season 2 has an 80/100 rating, based on 10 reviews. Detroit Free Press spoke positive of the series, describing it as \"TV's most original and irresistible new comic concoction,\" and San Francisco Chronicle wrote that it \"may well be the funniest thing you've seen in ages.\"</p><p>In 2019, Flight of the Conchords was ranked 65th on The Guardian's list of the 100 best TV shows of the 21st century.</p><h4>Awards</h4><p>At the 12th Satellite Awards, the show was nominated for Best Television Series – Musical or Comedy.</p><p>The duo of Clement and McKenzie was awarded with the status of 2007 Wellingtonians of the Year after their international success blossomed that year.</p><p>The show received four Emmy Award nominations in 2008. \"Sally Returns\" was nominated for \"Outstanding Directing for a Limited or Anthology Series or Movie\", \"Yoko\" was nominated for \"Outstanding Writing for a Comedy Series\" and two songs, \"Most Beautiful Girl (In the Room)\" and \"Inner City Pressure\", were nominated for \"Outstanding Original Music and Lyrics\".</p><p>At the 60th Writers Guild of America Awards in 2007, the show was nominated for three awards – Best Television: Comedy Series, Best Television: Episodic Comedy Series (for \"Sally Returns\") and for Best Television: New Series. At the 2007 Television Critics Association Awards, the show received 2 nominations – Outstanding Achievement in Comedy and Outstanding New Program of the Year.</p><p>At the 61st Primetime Emmy Awards, the show was nominated for six awards – Outstanding Comedy Series, Outstanding Directing for a Limited or Anthology Series or Movie (for the episode \"The Tough Brets\"), Outstanding Lead Actor in a Drama Series (Jemaine Clement), Outstanding Original Music and Lyrics (for the song \"Carol Brown\"), Outstanding Sound Mixing for a Limited or Anthology Series or Movie, and Outstanding Writing for a Comedy Series (for the episode \"Prime Minister\").</p><br/>"
  },
  "errorMessage": ""
}