{
  "imDbId": "tt1124373",
  "title": "Sons of Anarchy",
  "fullTitle": "Sons of Anarchy (TV Series 2008–2014)",
  "type": "TVSeries",
  "year": "2008",
  "items": [
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8786999",
      "warningSpoilers": false,
      "date": "8 January 2023",
      "rate": "10",
      "helpful": "49 out of 51 found this helpful.",
      "title": "One of my favorite shows ever!",
      "content": "Sons of Anarchy is absolutely, without a doubt one of my favorite shows of all-time. It's one of the few shows that I love so much that I've watched it all the way through several times and probably will again in the near future. The cast is absolutely incredible, led by the underrated Charlie Hunnam as Jax Teller. It also has so many other career performances by actors like Ron Perlman, Katy Segal, Tommy Flanagan, Ryan Hurst, Kim Coates and many more. If you haven't seen this yet I'm warning you now to give yourself enough time because you're going to want to binge it as fast as you can. Love, love, love this show!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8771209",
      "warningSpoilers": false,
      "date": "1 January 2023",
      "rate": "10",
      "helpful": "41 out of 43 found this helpful.",
      "title": "Absolutely love this show!",
      "content": "Sons of Anarchy is easily one of my two or three favorite shows I've ever seen. I really can't say enough about this amazing show that hasn't already been said, all you have to do is read through the reviews to see how loved this show really is. I know that people say this all the time about a ton of different shows but Sons of Anarchy is absolutely one of the best shows ever created! Every season is just as amazing as the others, which everyone knows is really rare for a tv show but which Sons of Anarchy definitely pulls off. Do yourself a favor and just go watch it! I promise it will not only meet your expectations but pass them."
    },
    {
      "username": "gillmurphydogg",
      "userUrl": "https://www.imdb.com/user/ur160563229",
      "reviewLink": "https://www.imdb.com/review/rw8836865",
      "warningSpoilers": false,
      "date": "30 January 2023",
      "rate": "8",
      "helpful": "30 out of 31 found this helpful.",
      "title": "Enjoyable with some flaws",
      "content": "I loved this series barring a couple of issues. It's a Hamlet-style biker gang series where we see the protagonist on a quest for redemption and self discovery. He comes up against some pretty formidable foes both in and out of his gang and has to grapple with honour and loyalty. I just feel like the writing let's him down at times. You'll see Jax do some heinous things that just feel out of character and might lose you for a bit. But overall Charlie Hunnam does a fantastic job of reeling you back in with his charm.Additionally, the soundtrack is absolutely awesome. I don't normally like country music but Noah Gundersen, one of the key contributors, makes some fantastic songs that will have you in tears. Definitely watch this if you haven't already."
    },
    {
      "username": "Lukasmj",
      "userUrl": "https://www.imdb.com/user/ur158768880",
      "reviewLink": "https://www.imdb.com/review/rw8676684",
      "warningSpoilers": false,
      "date": "15 November 2022",
      "rate": "10",
      "helpful": "32 out of 34 found this helpful.",
      "title": "Amazing Story, with nice Actors.",
      "content": "Jackson 'Jax' Teller is the vice president of a motorcycle gang involved in illegal business dealings. His stepfather Clay, the president, doesn't want to change that either, but Jax has concerns.\"Sons of Anarchy\" is one of my favorite series.To see the Sons in their everyday life, to accompany them through successes and big failures and to see the characters develop over time is just fun.Also, Charlie Hunnam is brilliant in his role as Jax Teller.The series brings out all sorts of emotions.So if you're looking for a series that you can watch a little longer and, in my opinion, has a similar potential for addiction as \"Breaking Bad\" or \"Prison Break\", \"Sons of Anarchy\" is more than well served."
    },
    {
      "username": "arabnikita",
      "userUrl": "https://www.imdb.com/user/ur24884343",
      "reviewLink": "https://www.imdb.com/review/rw7486578",
      "warningSpoilers": false,
      "date": "27 October 2021",
      "rate": "10",
      "helpful": "46 out of 51 found this helpful.",
      "title": "Once you watch it, you won't be able to stop recommending it",
      "content": "Sons of Anarchy (2008-2014)It took me 4 months to watch the first 4 episodes of this show. Everytime I tried, I just couldn't get into it until something clicked and all of a sudden, I found myself experiencing an absolutely marvelous TV Series. Every subsequent season impressed me more and more with it's detailed level of storytelling and complex characters that go through monumental growth over the course of the journey. The show that often came to my mind was Breaking Bad so hopefully you understand the quality that I am talking about.Sons of Anarchy is about a biker club in a small town called Charming. The bikers spend their time going about their regular lives which happen to be intertwined with all sorts of criminal activities and more often than not, these activities lead to brutal circumstances, which warrants a warning for the faint hearted. At first, they deal with small problems such as rival gangs but everytime they seem to resolve one conflict, 3 more emerge in it's place and the cycle continues in each season.When I looked at the poster, I wondered why are members of the same club fighting? Soon enough, I realized that while external threats bring their share of troubles, the amount of internal intrigues create far more tension. The level of scheming along with the amount of shocking moments provides plenty of thrilling content that never fails to surprise. Every character brings something unique to the table and as soon as you begin to connect with them, you will come to deeply love some and hate the others.At first glance, a biker show might seem like it is centred around men but the women play a huge part in the story as they weave their own webs much like Cersei in Game of Thrones. What makes this series effective and keeps the ride interesting is the great writing, the realistic dialogue and the raw emotions. I thought that a biker show would never interest me but I ended up experiencing an unforgettable journey full of passion, intrigue and heartbreak that has earned a place among my favorite TV shows.P. S. A separate mention must go out to the exceptional music that not only fit the atmosphere but found a way into my heart."
    },
    {
      "username": "ansharora-12638",
      "userUrl": "https://www.imdb.com/user/ur68630637",
      "reviewLink": "https://www.imdb.com/review/rw5717349",
      "warningSpoilers": false,
      "date": "8 May 2020",
      "rate": "10",
      "helpful": "125 out of 144 found this helpful.",
      "title": "A good show to be remembered for years.",
      "content": "Only a few shows get stuck in your mind for quite some time after you finish watching them. Only few shows. For me Sons of Anarchy is one of them. This is not just another show about a ruthless lawless biker gang, but it is a show about ruthless moral filled biker gangs who are well aware of the rights and wrongs of society and human nature. Never disrespected women and always took care of their own. Kurt Sutter is a specialist in that kind of genre, ever since from The Shield. By the way, another brilliant show co-written by SOA's creator.The music is beautiful and some of the songs are just great, along with the casting, every piece fits. Yaa we know that at the end everything always favored our title gang but that's why the series finale was written like that. No spoilers. Give this show a chance and try to stick with it till the end before giving a rating. Don't know why people judge a show by giving rating after seeing only few episodes or seasons.Action+music+brotherhood+entertainment+drama. A good package."
    },
    {
      "username": "tp-Isle",
      "userUrl": "https://www.imdb.com/user/ur22808490",
      "reviewLink": "https://www.imdb.com/review/rw8749810",
      "warningSpoilers": false,
      "date": "22 December 2022",
      "rate": "10",
      "helpful": "30 out of 30 found this helpful.",
      "title": "Deep Country.",
      "content": "Charming, a quiet California town with four gangs trying to keep it that way, but as they say with peace long lasting get ready for war. The motorcycle club SAMCRO sits right in the middle with Clay Morrow as president and surrogate son Jax teller as second in command and war is what insues.Kurt Sutter bought up within the shadows of a New Jersey prison has written an incredible, smart, griitty focus on the fringe cutture of Bikers that is Sons of Anarchy.As much it is crme show it is also a story of the grind that comes from being within with Gemma Teller the matriach of the club holding all the men together with the horror that comes with in it...and there is horror.Sons of Anarchy was released by the Linson Brothers 'Yellowstone' in 2008 and was immediately scheduled to continue. The reason being..It aloud the viewer to venture in and get out safely . More than the Soprano's with their connection to the street,we delve into a crime family.to see what it takes to manage an American outlaw motorcycle club.the show has and still is a massive success with long lasting and new fans impeccably supporting Kurt's prose.One of the greatest shows ever written and you will never get the sound of a beautiful Harley engine out of your mind again. A journey from the street and compelling and wonderful television."
    },
    {
      "username": "Lebowskidoo",
      "userUrl": "https://www.imdb.com/user/ur37568851",
      "reviewLink": "https://www.imdb.com/review/rw8174563",
      "warningSpoilers": true,
      "date": "25 May 2022",
      "rate": "10",
      "helpful": "23 out of 25 found this helpful.",
      "title": "Hamlet on Wheels",
      "content": "Sons of Anarchy sets off like a Shakespearean tragedy set in modern times, but then goes even beyond that concept. It takes a hold of its own unique idea for a TV show and then proceeds to go to some dark and dangerous places, unexpectedly. Got to respect a show not afraid to shock and surprise its viewers.The Sopranos was such a beloved show for me, and it wasn't until now that I found something similar and worthy of the comparison. These people are criminals, thieves and murderers. And yet, you get to know them and care about them and what's going to happen to them. It's just great writing on top of an engine that propels this show forward at a pace you're not always ready for. Been awhile since TV has made me gasp out loud, but Sons of Anarchy managed to do that for me, several times.Charlie Hunnam as Jax Teller is the heart and soul of this story, and his is a tragic trajectory of sorrow. Some of what happens to him is a result of his being born into this life and some is of his own bad decisions. His desire to get out and start over with his family eventually morphs him into the thing he was always trying to avoid becoming. You see it coming and it's heartbreaking.Shout outs to some of my other favorites: Katey Sagal, Ron Perlman. Theo Rossi. Ally Walker, Dayton Callie and Kim Coates. All gave career best performances. The whole cast is nothing but top notch.Truly an excellent binge series and highly recommended."
    },
    {
      "username": "oscarjneklund",
      "userUrl": "https://www.imdb.com/user/ur154260428",
      "reviewLink": "https://www.imdb.com/review/rw8312069",
      "warningSpoilers": false,
      "date": "8 July 2022",
      "rate": "9",
      "helpful": "22 out of 25 found this helpful.",
      "title": "Great show! 📜",
      "content": "Wonderful Tv-series with a lot of action and some pieces of comedy. Great actors, my personal favourite, Ron Perlman. A bit raw and brutal bikers, but that's what we all want, right? 🇺🇲"
    },
    {
      "username": "FinalFrontier96",
      "userUrl": "https://www.imdb.com/user/ur26242384",
      "reviewLink": "https://www.imdb.com/review/rw7852195",
      "warningSpoilers": false,
      "date": "10 February 2022",
      "rate": "10",
      "helpful": "16 out of 17 found this helpful.",
      "title": "Awesome series.",
      "content": "I strongly recommend it. Amazing acting amazing series. This is one of the best series i ever watch after The Walking Dead. If you want to watch it just do it."
    },
    {
      "username": "martincoad1986",
      "userUrl": "https://www.imdb.com/user/ur12350648",
      "reviewLink": "https://www.imdb.com/review/rw8192722",
      "warningSpoilers": false,
      "date": "31 May 2022",
      "rate": "8",
      "helpful": "24 out of 27 found this helpful.",
      "title": "Very good show overall",
      "content": "I was told to watch this show for some time by friends but I kept putting it off as I have no interest in bikes or biker gangs but it's very enjoyable despite not caring about those things.Season 3 was by far the weakest in my eyes and felt like a bit of hard work to get through but all seasons before and after are high quality. Also, unlike some other shows, it felt like SOA knew when to end and didn't drag itself on too many seasons at the cost of quality.Overall, a very good show, maybe not at the very top tier but definitely the level below and worth watching."
    },
    {
      "username": "ecg-prime",
      "userUrl": "https://www.imdb.com/user/ur82302853",
      "reviewLink": "https://www.imdb.com/review/rw8487962",
      "warningSpoilers": false,
      "date": "26 August 2022",
      "rate": "10",
      "helpful": "27 out of 30 found this helpful.",
      "title": "The Fiction is Truth",
      "content": "Brothers always protect the Family based on principle, unless not engaged. Think twice look both ways. People engaged are much smarter than you may think."
    },
    {
      "username": "Systreco",
      "userUrl": "https://www.imdb.com/user/ur20203454",
      "reviewLink": "https://www.imdb.com/review/rw2070085",
      "warningSpoilers": false,
      "date": "22 May 2009",
      "rate": "10",
      "helpful": "231 out of 314 found this helpful.",
      "title": "Superb My Son!",
      "content": "OK, I saw Sons Of Anarchy by mistake a few weeks back (I recorded the wrong program) I Had heard of it but never really fancied it! Bikers and all that, not my thing! I had major doubts about Charlie Hunnam, I have only ever seen him in one thing before and that was a movie called Green Street (Hooligans) where he played an East End Londoner (West Ham) football fan-cum-hooligan! He is from Newcastle and his accent in Green Street was terrible but he must have had some voice coaching because in SOA he accent (usa) is spot on, all but the odd word! I watched the first episode and thought it was awesome! But then again, how many first episodes are awesome, only to be followed by a totally average rest-of-season? But I am so happy to say that I was wrong! I am up to episode 10 and each one is better than the last! It's not your average knuckle head biker show! It follows the trials and tribulations of each and every cast member! I really can't recommend Sons Of Anarchy enough! 10/10"
    },
    {
      "username": "caleb_mcd",
      "userUrl": "https://www.imdb.com/user/ur139863770",
      "reviewLink": "https://www.imdb.com/review/rw7525885",
      "warningSpoilers": false,
      "date": "8 November 2021",
      "rate": "9",
      "helpful": "23 out of 28 found this helpful.",
      "title": "Great Badass Show!",
      "content": "What a great show! The writing is top notch with a great combination of crime drama and dark comedy. Realistic, well rounded characters pull you in that much deeper. Intense action and suspenseful drama keep you on edge of your seat throughout the entire series. The only downfall is I've heard from multiple sources that it doesn't have an accurate depiction of what life in a motorcycle gang is truly like. I'm my opinion it really doesn't have to be spot on accurate though because it is just for entertainment and it does a great job of that."
    },
    {
      "username": "Web_Of_Doom",
      "userUrl": "https://www.imdb.com/user/ur119169565",
      "reviewLink": "https://www.imdb.com/review/rw8652939",
      "warningSpoilers": false,
      "date": "3 November 2022",
      "rate": "8",
      "helpful": "26 out of 34 found this helpful.",
      "title": "A really good show up to season 6, but season 7 ruins it.",
      "content": "Sons of Anarchy was a really good show & must watch TV especially in the first 5 seasons & season 6 was on the decline but still was overall quite good.For some reason the change of the staff writer to Gladys Rodriguez ( who helped write the scripts in season 7 ) made the show go from being believable to totally ridiculous & the character arcs made no logical sense at all as this final season was a total bore fest & left me as a viewer feeling really let down.There was so many good ways to end the show & this last season was not it.Now Kurt Sutter was still listed as the main writer for season 7 which makes you wonder what happened, as did he lose interest in the show, or knowing it was the last season did he want to put way too much into it & got it so wrong.Unfortunately Gladys Rodriguez was the variable that wasn't able to save the final season, though ultimately Kurt Sutter was in charge so takes the blame.Hopefully Kurt Sutter has learned from his mistakes with this season 7 fail.Overall though the first 5 seasons are must watch & if the last 2 seasons had been better this would have been a true 10 out of 10 show it was for a while.Season 1 = 10 out of 10 Season 2 = 10 out of 10 Season 3 = 10 out of 10 Season 4 = 10 out of 10 Season 5 = 10 out of 10 Season 6 = 8 out of 10 ( the story starts to become a bit too convenient ) Season 7 = 1 out of 10 ( the writing becomes lazy & makes little sense )Total score ends up being 59 out of 70 so 84.3% score dragging a 10 out of 10 show ( after 5 seasons ) down from a 10 ( 100% ) rating to a disappointing score of only 8 ( 84% ) stars, as the last season is so bad it would probably be best not to watch season 7 at all & just use your own imagination as a fan.The shield was a great show & needed 3 more seasons but they kept the quality of writing high, where Sons of Anarchy needed 3 more seasons so they just dumped everyone into 1 final season 7 & forgot about the writing & ended up ruining the legacy of the show & any real shot Mayans MC had.It is no surprise to me Gladys Rodriguez was not asked to write for Mayans MC, though to be fair the very successful Sons of Anarchy staff writers ( from season 1 to 5 ) were not involved also in that project that suffered because of the really dreadful final season 7 as that turned off viewers from this genre.The most important part of any show is the writing, as everything else has to evolve from that as great actors still need great scripts to make a great show."
    },
    {
      "username": "rboyerjr",
      "userUrl": "https://www.imdb.com/user/ur79997045",
      "reviewLink": "https://www.imdb.com/review/rw8006187",
      "warningSpoilers": false,
      "date": "26 March 2022",
      "rate": "10",
      "helpful": "21 out of 24 found this helpful.",
      "title": "Wow!!",
      "content": "To me, this is the best tv show with The Sopranos in the history of television. I have never felt so many emotions watching tv before. You love and hate every character, which makes it perfect. Thank you!"
    },
    {
      "username": "chalomug",
      "userUrl": "https://www.imdb.com/user/ur29943533",
      "reviewLink": "https://www.imdb.com/review/rw8333650",
      "warningSpoilers": false,
      "date": "14 July 2022",
      "rate": "9",
      "helpful": "23 out of 27 found this helpful.",
      "title": "An emotional roller coaster of chaos and mayhem",
      "content": "The show is about Jax, a member of a motorcycle club which doubles up as a garage and an organized criminal gang. We can all tell that Jax is a good guy or is trying to be good. It's however a tough balancing act between his.loving real family and his other 'family'. In the course of finding this balance a lot of chaos and mayhem happens that could ultimately change the man himself! Watched the whole series throughout this year and thoroughly enjoyed to the very end."
    },
    {
      "username": "vito7",
      "userUrl": "https://www.imdb.com/user/ur15740891",
      "reviewLink": "https://www.imdb.com/review/rw1973327",
      "warningSpoilers": true,
      "date": "9 November 2008",
      "rate": "8",
      "helpful": "184 out of 250 found this helpful.",
      "title": "Excellent, Excellent, Excellent",
      "content": "FX has done it again. Another excellent show that we sit on the edge of our seats during, and wait impatiently for all week. If the common opinion that shows improve the longer they run rings true for this one, then I predict a perfect rating by season 3 and it will be in the running for all time great. The timing couldn't be more perfect with the great \"The Shield\" coming to a timely close. Sons of Anarchy takes on a classic Hamlet premise with a dead dad under potentially shady circumstances, a wavering prince, (or in this case vice president of the biker club), wondering what the right path for him is. Should he take the more philosophical path of his deceased predecessor or the hard core gangster approach of his mothers current husband and president of the S. O. A. biker club. The first season is only half over and my wife and I are already dreading the wait for season two. A special kudos for Katey Sagal, I didn't expect her to be able to shed the memory of Peggy Bundy of \"Married With Children\" but she has been able to create a strong Queen of the club character that is easy to love and hate all at once. Find the time for this one, It's like a white trash Sopranos with a story line that actually goes places."
    },
    {
      "username": "xmarc97",
      "userUrl": "https://www.imdb.com/user/ur70456606",
      "reviewLink": "https://www.imdb.com/review/rw8458830",
      "warningSpoilers": false,
      "date": "17 August 2022",
      "rate": "10",
      "helpful": "23 out of 26 found this helpful.",
      "title": "unreal",
      "content": "I watched this for the first time in about either 2015 or 16 and it took me about a year to get thru it as i kept going to it then stopping then going back to it so everything was kinda out of place and i wasn't really fussed for it then a couple weeks ago i seen a few tiktoks of the show and thought to myself \"maybe i was too harsh on sons, al give it another go\" and my god it was the right decision i couldn't put it down from start to finish i watched it at every opportunity what an amazing show love it."
    },
    {
      "username": "xander-t96",
      "userUrl": "https://www.imdb.com/user/ur52228215",
      "reviewLink": "https://www.imdb.com/review/rw7613659",
      "warningSpoilers": false,
      "date": "4 December 2021",
      "rate": "10",
      "helpful": "18 out of 20 found this helpful.",
      "title": "Ignore Bad Reviews",
      "content": "Seriously I don't what people on here are smoking to give this a bad rating. Sure it's not perfect (especially season 6 which does drag a little) but damn is it good! The main draw to the show is the characters and the perfect casting. Season 1-4 are outstanding, I would give them all 10 stars. Seasons 5 and 7 are very elite, like a 9.5. Season 6 I would have to say is 7-8stars but still worth watching to see the last season with correct context. Charlie Hunnam as Jax Teller is not only super badass but highly believable. Ron Perlman is also incredible, as he is in everything.Just for a sense of what I consider to be top tier TV shows I'm going to write down some of my top shows (all time) in no particular order: Succession, Game of Thrones (seasons 1-4), Ozark, Breaking Bad, The Boys, Bates Motel, and Chernobyl. I would rate SOA probably 1 tier below these shows but it's still excellent excellent entertainment.I was honestly shocked at all of the bad reviews. I get this kind of series isn't going to be for everyone but rating it 1 star is just objectively wrong."
    },
    {
      "username": "pharmdabdullahaldandan",
      "userUrl": "https://www.imdb.com/user/ur155509021",
      "reviewLink": "https://www.imdb.com/review/rw8418536",
      "warningSpoilers": false,
      "date": "9 August 2022",
      "rate": "10",
      "helpful": "28 out of 30 found this helpful.",
      "title": "Top 10 TV shows you must watch",
      "content": "This is flawless form the 1st episode till the end and everything makes sense. There's closure in every side of the story. I finished the entire show within a 1 month without feeling the time passing by. Moreover, in Sons of Anarchy, there isn't any non necessary action or that hero character who knows everything and never miss. It's the exact opposite, you see the change and development of each character in every season without feeling bored that because of the show structure and multiple characters that simply complete each other. Totally worth the time."
    },
    {
      "username": "leeann-71928",
      "userUrl": "https://www.imdb.com/user/ur65918080",
      "reviewLink": "https://www.imdb.com/review/rw7344591",
      "warningSpoilers": true,
      "date": "14 September 2021",
      "rate": "10",
      "helpful": "18 out of 22 found this helpful.",
      "title": "Ron Pearlman is a rockstar!",
      "content": "It is a crime that Ron Pearlman who plays Clay Marrow did not win any awards for his role in this show, because he is such a badass and plays this role perfectly he ends up being a bad guy but he does it so well and so cool that it's hard to hate him. Absolutely loved his character!"
    },
    {
      "username": "Abo_Anas88",
      "userUrl": "https://www.imdb.com/user/ur152150891",
      "reviewLink": "https://www.imdb.com/review/rw8717356",
      "warningSpoilers": false,
      "date": "5 December 2022",
      "rate": "9",
      "helpful": "29 out of 30 found this helpful.",
      "title": "Nice ending",
      "content": "Suspenseful, thrilling show that's over and left me with feelings for the many characters gifted with. It left me with beautiful memories. What is special about this show is that it lets you live with them in their world and the difficulties they go through. It has a continuous style from the first season to the last in the same style. You expect events with a beautiful character. Really well done work. There are no exaggerations in the evaluation of this work. In fact, a show with the same idea cannot compete with it Also the music that he gives you is insanely good. I will never forget this show, I really loved it I am here to write an emotional review of this show."
    },
    {
      "username": "jtaveras64",
      "userUrl": "https://www.imdb.com/user/ur50833453",
      "reviewLink": "https://www.imdb.com/review/rw3603075",
      "warningSpoilers": true,
      "date": "20 December 2016",
      "rate": "8",
      "helpful": "40 out of 56 found this helpful.",
      "title": "Excellent, poetic, dark, soulful, brutal !",
      "content": "Sons is a show that should be up in the ranks with The Sopranos and Breaking Bad, that being said given I hail this show as a true classic I can focus on the aspects of it that are disappointing as well, like all great shows, nothing is ever perfect. Season 1 of SOA was a good show, it established what the series will bring forth, season 2 was downright PERFECT! An excellent season with multiple story lines that could have produced more stories to come but did not. Season 3 was downright dragging and poorly written filled with characters you will never see again in a plot in Ireland that wasted the entire season. However, towards the end the season somewhat redeems itself. By season 4 the show goes back to being great, establishing the main rivalries, cementing its main villain and giving the characters the drive to move to its ultimate finale. Season 5 shows a violent leader in charge heading the SAMCRO gang, it has a slower pace than the rest of the previous seasons, but still good. The focus is on the main relationships and its effects of betrayal. Somehow, this season makes it hard to understand why the show is not getting closer to its end, it felt a bit dragged and somewhat unnecessary. However, it's the quintessential season that establishes the main character as the true VILLAIN! And the addition of new characters was excellently casted. Season 6 is definitely more brutal. It felt dragged and long with episodes over extended, but it it's the season that stages the beginning of the end. Season 6 seems like it could have been mixed with season 5... to create a more superior whole and complete season. One interesting element of the season is that WOMEN are the true power players of the season, GEMA VS TARA VS WENDY. The main thorn in SAMCROS thumb is a female DA, and yes there's also a trans character. Margaret should have been given a stronger role, but it was still good. Season 7 Probably my least favorite season after season 3. It was dragged and extended and had too many new characters, that we are not really invested in. Too much violence on these un-invested characters that make the action scenes lacking in payoff. By now you want Jax to die, and there's no one left to root for, with the exception of maybe Gema/Juice. The final episodes were powerful, tying up the main characters journeys (the ones who made it to the end) in dramatic and emotional fashion. There is something very deep and memorable about how thing tie up in the end for everyone. Its closing shot is poetic, metaphoric and downright beautiful. It ends as all strong shows with a strong lead do (Sopranos, Breaking Bad) with a tragic ending worthy of discussion. Ultimately what the story is, is about a man being controlled by the two main women in his life, by his need to bring the club back to the \"good old days\" as it being led down a destructive path of violence, law enforcement corruption, drugs, prostitution, revenge and lies. Its about a mans identity and his self fulfilling prophecy to play out his fathers vision as stated in the manifesto that drives the story. Its about loyalty, power, control and fate. If you were paying attention, you won't be surprised for it was expected."
    },
    {
      "username": "ebabsy-60853",
      "userUrl": "https://www.imdb.com/user/ur105584055",
      "reviewLink": "https://www.imdb.com/review/rw7341148",
      "warningSpoilers": false,
      "date": "13 September 2021",
      "rate": "9",
      "helpful": "17 out of 20 found this helpful.",
      "title": "You Have To Give It Your Full Attention",
      "content": "I have to start off by saying I loved this show. It watched on Netflix after missing the original run, and by the end I was glad. I laughed, I cried, I genuinely sucked in my breath and shouted \"No!\" when something happened. The cast was pitch perfect, particularly Katey Sagal in a role I will love to the end of my days and will be the reason I rewatch.But..... I had to start again from the beginning five episodes in as I got lost. The show throws you in with gravelly accents and gruff soft voices, and terminology like \"kuttes\" and \"Patch Over\" you have to just figure out without full explanation until the end of the episode, by which point some people may have got confused, frustrated and turned it off. It's not a show you can chuck on in the background while you work. You need all eyes (and possibly the subtitles) on this.But I promise you, it is worth the ride."
    }
  ],
  "errorMessage": ""
}