{
  "imDbId": "tt1124373",
  "title": "Sons of Anarchy",
  "fullTitle": "Sons of Anarchy (TV Series 2008–2014)",
  "type": "TVSeries",
  "year": "2008",
  "language": "en",
  "titleInLanguage": "Sons of Anarchy",
  "url": "https://en.wikipedia.org/wiki/Sons_of_Anarchy",
  "plotShort": {
    "plainText": "Sons of Anarchy is an American action crime drama television series created by Kurt Sutter for FX. Originally aired from September 3, 2008, to December 9, 2014, Sons of Anarchy follows the lives of a close-knit outlaw motorcycle club operating in Charming, a fictional town in California's Central Valley. Charlie Hunnam stars as Jackson \"Jax\" Teller, who is initially the vice president and subsequently the president of the club. After discovering a manifesto written by his late father, John, who previously led the club, he begins to question himself, his relationships, and the club. Themes throughout the show include love, brotherhood, loyalty, betrayal and redemption. It explored vigilantism, government corruption and racism. The show's plot depicted an outlaw motorcycle club as an analogy for human transformation. David Labrava, a real-life member of the Oakland chapter of Hells Angels, served as a technical adviser, and also played the recurring character Happy Lowman, the club's assassin.\r\nSons of Anarchy had the third season attract an average of 4.9 million weekly viewers, becoming FX's highest-rated series at the time and surpassing its other hits The Shield, Nip/Tuck and Rescue Me. The season 4 and 5 premieres were the two highest-rated telecasts in FX's history. The sixth season aired from September 10, 2013, through December 10, 2013. The seventh season of the series premiered on September 9, 2014. On November 3, 2014, FX announced that the seventh season would be its last. The series finale aired on December 9, 2014.\r\nIn November 2016, FX announced the development of a spin-off series, Mayans M.C., centering around the title Latino club. The spin-off's first season premiered on September 4, 2018.",
    "html": "<p>Sons of Anarchy is an American action crime drama television series created by Kurt Sutter for FX. Originally aired from September 3, 2008, to December 9, 2014, Sons of Anarchy follows the lives of a close-knit outlaw motorcycle club operating in Charming, a fictional town in California's Central Valley. Charlie Hunnam stars as Jackson \"Jax\" Teller, who is initially the vice president and subsequently the president of the club. After discovering a manifesto written by his late father, John, who previously led the club, he begins to question himself, his relationships, and the club. Themes throughout the show include love, brotherhood, loyalty, betrayal and redemption. It explored vigilantism, government corruption and racism. The show's plot depicted an outlaw motorcycle club as an analogy for human transformation. David Labrava, a real-life member of the Oakland chapter of Hells Angels, served as a technical adviser, and also played the recurring character Happy Lowman, the club's assassin.</p><p>Sons of Anarchy had the third season attract an average of 4.9 million weekly viewers, becoming FX's highest-rated series at the time and surpassing its other hits The Shield, Nip/Tuck and Rescue Me. The season 4 and 5 premieres were the two highest-rated telecasts in FX's history. The sixth season aired from September 10, 2013, through December 10, 2013. The seventh season of the series premiered on September 9, 2014. On November 3, 2014, FX announced that the seventh season would be its last. The series finale aired on December 9, 2014.</p><p>In November 2016, FX announced the development of a spin-off series, Mayans M.C., centering around the title Latino club. The spin-off's first season premiered on September 4, 2018.</p>"
  },
  "plotFull": {
    "plainText": "Sons of Anarchy is an American action crime drama television series created by Kurt Sutter for FX. Originally aired from September 3, 2008, to December 9, 2014, Sons of Anarchy follows the lives of a close-knit outlaw motorcycle club operating in Charming, a fictional town in California's Central Valley. Charlie Hunnam stars as Jackson \"Jax\" Teller, who is initially the vice president and subsequently the president of the club. After discovering a manifesto written by his late father, John, who previously led the club, he begins to question himself, his relationships, and the club. Themes throughout the show include love, brotherhood, loyalty, betrayal and redemption. It explored vigilantism, government corruption and racism. The show's plot depicted an outlaw motorcycle club as an analogy for human transformation. David Labrava, a real-life member of the Oakland chapter of Hells Angels, served as a technical adviser, and also played the recurring character Happy Lowman, the club's assassin.\r\nSons of Anarchy had the third season attract an average of 4.9 million weekly viewers, becoming FX's highest-rated series at the time and surpassing its other hits The Shield, Nip/Tuck and Rescue Me. The season 4 and 5 premieres were the two highest-rated telecasts in FX's history. The sixth season aired from September 10, 2013, through December 10, 2013. The seventh season of the series premiered on September 9, 2014. On November 3, 2014, FX announced that the seventh season would be its last. The series finale aired on December 9, 2014.\r\nIn November 2016, FX announced the development of a spin-off series, Mayans M.C., centering around the title Latino club. The spin-off's first season premiered on September 4, 2018.\r\nSeries overview\r\nEach season involved parallel plot lines that intertwine and overlap, centering on both the personal and family life of Jackson \"Jax\" Teller (Charlie Hunnam) and on SAMCRO (Sons of Anarchy Motorcycle Club, Redwood Original), the \"Mother Chapter\" of the organization based in Charming, California. SAMCRO is involved with gun-running in the western United States, and deals with rival gangs, politicians and the authorities. As vice president and later president of SAMCRO, Jax struggles to manage the club and the legacy of its founder, his late father John Teller. He is frequently at odds with his stepfather, Clay Morrow, who has taken over the club since John's death, and is also now married to Jax's mother and John's widow, Gemma Teller Morrow. Jax also grapples with his relationships with his high school sweetheart, Tara Knowles, and his childhood best friend, Opie Winston.\r\nSAMCRO takes its inspiration from the Hells Angels Motorcycle Club; the series includes special guest appearances by David Labrava (Happy), Chuck Zito (Frankie Diamonds), Rusty Coones (Quinn), and Sonny Barger (Lenny \"The Pimp\" Janowitz) who are real Hells Angels members.\r\nSeason 1 (2008)\r\nThe series begins with the destruction of a warehouse the club uses to store and assemble guns, which is their main source of income, by a rival club right before the overdose of Jax's heroin addicted ex-wife Wendy. An emergency C-section is performed, and their son Abel is delivered ten weeks prematurely. Jax finds his father's memoirs when he visits a storage unit to collect some old baby clothes. John Teller, Jax's father, was one of the founders of SAMCRO, and the book describes his trials with and hopes for the club. Jax's mother, Gemma Teller-Morrow, is now married to the president of SAMCRO, Clay Morrow. Jax's best friend Opie has just been released from prison for serving time for a club-related crime. The first season deals with Jax trying to reconcile things happening to the club with what he reads in his father's memoirs, Opie trying to take a lesser role in the club, and local and federal law enforcement trying to shut down SAMCRO.\r\nSeason 2 (2009)\r\nWhite separatists called the League of American Nationalists (LOAN) arrive in Charming. LOAN's leader Ethan Zobelle and Zobelle's enforcer, A.J. Weston, seek to drive the Sons of Anarchy from Charming. To send a message to SAMCRO, Zobelle orchestrates to have Gemma kidnapped and gang raped by Weston and two others. Due to the improper handling of an internal problem, the rift between Clay and Jax continues to widen as Jax challenges most of Clay's decisions and comes to a head when a lone car bomb nearly kills another member of SAMCRO. The second season sees SAMCRO battling LOAN for control of Charming, Jax and Clay veering further apart in their individual visions for the club, and evading the ever-present threat of the ATF.\r\nSeason 3 (2010)\r\nGemma has been hiding in Rogue River, Oregon, with Tig at the home of Gemma's father, Nate (Hal Holbrook), who suffers from dementia. Gemma struggles when she takes Nate to his new assisted living home, and he pleads to be taken back to his house. She returns to Charming to reunite with her grandson, unaware he has been kidnapped. The return of A.T.F. agent Stahl twists the facts about the murder of Donna, Stahl attempts to make a deal with Jax behind the club's back. Father Kellan Ashby's sister, Maureen, contacts Gemma at Ashby's request and tells her Abel is safe in Belfast. Upon learning of her grandson's abduction, Gemma suffers a cardiac arrhythmia and collapses in the Teller-Morrow lot. After the club returns from Northern Ireland and brings home Abel, agent Stahl double crosses Jax and tells the club about the side deal Jax made with her, unaware that Jax and the club had it planned all along knowing Stahl would back out of the deal. Jax, Clay, Bobby, Tig, Juice and Happy are hauled away to jail. While Opie, Chibs, and the Prospects are all en route following Stahl. Opie kills Stahl to avenge the death of his wife, Donna.\r\nSeason 4 (2011)\r\nThe imprisoned SAMCRO members leave the penitentiary after their 14-month stay and are met by Lieutenant Eli Roosevelt of the San Joaquin Sheriff's Department, the new law enforcement presence in Charming. They also discover that Sheriff Hale's brother has become the mayor. US Attorney Lincoln Potter seeks Lieutenant Roosevelt's help to build a RICO case against SAMCRO.\r\nSeason 5 (2012)\r\nIn retaliation for the death of Veronica Pope (Laroy's girlfriend, who was also the daughter of powerful Oakland kingpin Damon Pope), the Niners attack SAMCRO and ambush a cargo shipment. With the death of Piney Winston and the growing conflict between the Niners and SAMCRO, along with several home invasions targeting people linked to the club, Jax is forced to meet with Damon Pope, to deal with a new threat unlike anything SAMCRO has ever faced.\r\nSeason 6 (2013)\r\nFollowing the arrest of Tara and Clay, Jax struggles to hold SAMCRO together while Tara is imprisoned. Toric approaches both Tara and Clay and offers them deals in exchange for giving up SAMCRO; both initially refuse, but Clay later relents when confronted with being thrown into the prison's general population and assuredly being killed by inmates paid off by Damon Pope's men as a retaliation for Pope's murder. Juice returns to Charming after helping Bobby relocate after stepping down as VP, which angers Chibs, who doesn't believe Juice has been punished enough for talking to cops and later beats him. With the death of Clay, Gemma and Nero's romance becomes stronger. Tara is murdered and the tables get turned for the club.\r\nSeason 7 (2014)\r\nJax struggles with his recent loss and turns himself in to the authorities. While in jail, Jax makes decisions that radically alter the direction of the club and uses it to exact revenge for the death of his wife. With Bobby's death in the ensuing war, the hate and lies are fuelled, created by Gemma and Juice, who are on the run and hiding from the club. After Jax learns the truth, he works to make things right with all parties involved. The series ends with Jax making the ultimate sacrifice to complete his part of the story of SAMCRO and fulfill his father's vision.\r\nCast and characters\r\nSons of Anarchy is the story of the Teller-Morrow family of Charming, California, as well as the other members of Sons of Anarchy Motorcycle Club, Redwood Original (SAMCRO), their families, various Charming townspeople, allied and rival gangs, associates, and law agencies that undermine or support SAMCRO's legal and illegal enterprises.\r\nThe series begins with SAMCRO being led by club president Clay Morrow, his stepson Jax Teller as vice president, Tig Trager as Sergeant-At-Arms, Bobby Munson as Secretary/Treasurer, and Juice Ortiz as their intelligence officer. Other members rounding out the club were Chibs Telford, formerly of SAM-Belfast, Opie Winston, the son of First 9 member and SAMCRO advisor Piney Winston, and Half-Sack Epps, the charter's prospect. They often cross paths with Deputy Sheriff Hale, a classmate of Jax's who grew up on the other side of the law, and his boss, Sheriff Unser, who is on the club's payroll. Jax, a new father, deals with his ex-wife Wendy Case and is reunited with his high school sweetheart, Tara Knowles, while Opie tries to return to a life of normalcy for his long-suffering wife Donna Winston.\r\nMain\r\nCharlie Hunnam as Jackson 'Jax' Teller\r\nKatey Sagal as Gemma Teller Morrow\r\nMark Boone Junior as Robert 'Bobby Elvis' Munson\r\nKim Coates as Alexander \"Tig\" Trager\r\nTommy Flanagan as Filip 'Chibs' Telford\r\nJohnny Lewis as Kip 'Half-Sack' Epps (seasons 1–2)\r\nMaggie Siff as Dr. Tara Knowles (seasons 1–6)\r\nRon Perlman as Clarence 'Clay' Morrow (seasons 1–6)\r\nRyan Hurst as Harry 'Opie' Winston (seasons 2–5; recurring season 1)\r\nWilliam Lucking as Piermont 'Piney' Winston (seasons 2–4; recurring season 1)\r\nTheo Rossi as Juan-Carlos 'Juice' Ortiz (seasons 2–7; recurring season 1)\r\nDayton Callie as Wayne Unser (seasons 3–7; recurring seasons 1–2)\r\nJimmy Smits as Neron 'Nero' Padilla (seasons 6–7; recurring season 5)\r\nDrea de Matteo as Wendy Case (season 7; recurring seasons 1, 5–6; special guest season 4)\r\nDavid Labrava as Happy Lowman (season 7; recurring seasons 1–6)\r\nNiko Nicotera as George 'Rat Boy' Skogstorm (season 7; recurring seasons 4–6)\r\nRecurring\r\nEmilio Rivera as Marcus Álvarez, the president of the Mayans, the Latino Motorcycle Club that rivals the Sons\r\nTory Kittles as Laroy Wayne (seasons 1–4), the leader of the Niners, the local black gang to whom the Sons deal guns\r\nTaylor Sheridan as Deputy Chief David Hale (seasons 1–3), Unser's second-in-command, who begins as a no-nonsense cop who grew up with Jax, Tara, Opie, and Donna\r\nJamie McShane as Cameron Hayes (seasons 1–3), a member of the True IRA who serves as gun liaison with the Sons\r\nDendrie Taylor as Luann Delaney (seasons 1–2), the producer at Caracara, the local porn studio, and wife of SAMCRO member Otto\r\nGlenn Plummer as Deputy Sheriff Vic Trammel (seasons 1–2), a San Joaquin sheriff deputy who is on the Sons' payroll\r\nJulie Ariola as Mary Winston (seasons 1–2), Piney's estranged wife and Opie's mother\r\nTaryn Manning as Rita 'Cherry' Zambell (seasons 1 & 3), a hang-around with the Devils Tribe, she falls for SAMCRO prospect Half-Sack and leaves Nevada to be with him in Charming\r\nSprague Grayden as Donna Winston (season 1), Opie's wife\r\nJay Karnes as Agent Joshua Kohn (season 1), a Chicago-based ATF agent who previously dated Tara, and come to Charming to find her\r\nKeir O'Donnell as Lowell Harland, Jr. (season 1), a drug-addicted mechanic at Teller-Morrow\r\nAlly Walker as Agent June Stahl (seasons 1–3), an ATF agent who comes to Charming to investigate SAMCRO, and later the True IRA and Aryan Brotherhood\r\nJeff Wincott as Jimmy Cacuzza (guest seasons 1, 5–6)\r\nMitch Pileggi as Ernest Darby (seasons 1–2; special guest season 3; guest season 6), a Neo-Nazi who leads the Nords, a local heroin-dealing gang\r\nMichael Ornstein as Chucky Marstein (seasons 2–7; guest season 1), an accountant who falls under the protection and employ of SAMCRO\r\nAdam Arkin as Ethan Zobelle (season 2), a leader in the Aryan nationalist organization who comes to Charming\r\nKenneth Choi as Henry Lin (seasons 2–3 & 5–6; guest season 1; special guest season 7), the leader of the Lin Triad, a Chinese drug cartel\r\nKurt Sutter as Otto 'Big Otto' Delaney (seasons 2–6 'uncredited'; guest season 1 'uncredited'), a member of SAMCRO who is in federal prison, and husband of Luann\r\nPatrick St. Esprit as Elliott Oswald (seasons 2–4; guest seasons 1 & 6), a local businessman whose connections the Sons use\r\nMarcos de la Cruz as Estevez (seasons 2–3; guest season 1), a DOJ agent who works with Stahl\r\nWinter Ave Zoli as Lyla Winston (seasons 2–7), one of the Caracara girls who falls in love with Opie\r\nMcNally Sagal as Margaret Murphy (seasons 2–6), the chief administrator at St Thomas, who becomes a close confidant of Tara's\r\nKristen Renton as Ima Tite (seasons 2–6), a Caracara girl\r\nKenny Johnson as Herman Kozik (seasons 2–4), a member of the Tacoma chapter of the Sons, who has a rough personal history with Tig\r\nTitus Welliver as Jimmy 'Jimmy O' O'Phelan (seasons 2–3), a leader in the True IRA who is now married to Chibs' ex-wife\r\nBellina Logan as Fiona Larkin (seasons 2–3), Chibs' ex-wife\r\nHenry Rollins as A.J. Weston (season 2), a member of the Aryan Brotherhood who comes to Charming as Zobelle's muscle\r\nCallard Harris as Edmond Hayes (season 2), Cameron's son\r\nSarah Jones as Polly Zobelle (season 2), Zobelle's daughter\r\nJeff Kober as Jacob Hale Jr. (seasons 3–6; guest season 2), Deputy Hale's older brother and a local political bigwig\r\nChristopher Douglas Reed as Philip 'Filthy Phil' Russell (seasons 3–6), a SAMCRO prospect\r\nRobin Weigert as Ally Lowen (seasons 3–6), a lawyer who takes SAMCRO on as a client\r\nMichael Beach as Taddarius Orwell 'T.O.' Cross (seasons 3 & 7; guest season 5), the president of the Grim Bastards Motorcycle Club\r\nHal Holbrook as Nate Madock (season 3; guest season 7), Gemma's father, who suffers from dementia\r\nJose Pablo Cantillo as Hector Salazar (season 3), the president of the Calaveras Motorcycle Club\r\nJames Cosmo as Father Kellen Ashby (season 3), an advisor to the True IRA\r\nZoe Boyle as Trinity Ashby (season 3), daughter of Maureen and niece of Father Ashby\r\nAndrew McPhee as Keith McGee (season 3), the president of the Belfast charter of the Sons, SAMBEL, and the current partner of Maureen Ashby\r\nArie Verveen as Liam O'Neill (season 3), the vice president of SAMBEL\r\nPamela J. Gray as Agent Amy Tyler (season 3), an ATF agent\r\nMarcello Thedford as Lander Jackson (season 3), the vice president of the Grim Bastards\r\nJoel Tobeck as Donny (season 3), a member of the True IRA\r\nDarin Heames as Seamus Ryan (season 3), a member of SAMBEL\r\nQ'orianka Kilcher as Kerrianne Larkin-Telford (season 3), Chibs and Fiona's daughter, and Jimmy O's stepdaughter\r\nMonique Gabriela Curnen as Amelia Dominguez (season 3), the caretaker of Gemma's father Nate\r\nMichael Fairman as 'Lumpy' Feldstein (season 3), a boxing club owner in Charming\r\nBob McCracken as Brendan Roarke (seasons 4 & 6–7; guest season 3), a member of the True IRA council\r\nFrank Potter as Eric Miles (season 4; co-star season 3), a SAMCRO prospect\r\nWalter Wong as Chris 'V-Lin' Von Lin (seasons 4–6), a SAMCRO prospect\r\nDanny Trejo as Romero 'Romeo' Parada (season 4; special guest season 5), a high-ranking member of the Galindo Cartel, who is also a C.I.A. agent\r\nTimothy V. Murphy as Galen O'Shay (seasons 4–6), a leader within the True IRA\r\nMerle Dandridge as Rita Roosevelt (seasons 4–5), the wife of San Joaquin Sheriff Eli Roosevelt\r\nBenito Martinez as Luis Torres (season 4; special guest season 5), a member of the Galindo Cartel\r\nDavid Rees Snell as Agent Grad Nicholas (season 4), an ATF agent\r\nBilly Brown as August Marks (seasons 5–7), an Oakland drug kingpin and crime boss who works with Damon Pope\r\nReynaldo Gallegos as 'Fiasco' (seasons 5–7)\r\nHarold Perrineau as Damon Pope (season 5), an Oakland gangster who oversees the Niners\r\nChuck Zito as Frankie Diamonds (season 5), a former Sons Nomad who transfers to SAMCRO\r\nChris Browning as 'Go-Go' (season 5), a Sons Nomad\r\nKurt Yaeger as Greg 'The Peg' (season 5), a Sons Nomad\r\nWanda De Jesus as Carla (season 5), the half-sister of Nero Padilla\r\nWalton Goggins as Venus Van Dam (born Vincent Noone) (seasons 5–7), a transgender prostitute who befriends SAMCRO and becomes Tig's main romantic interest\r\nLaMonica Garrett as Deputy Sheriff Cane (seasons 6–7; co-star seasons 4–5),\r\nRusty Coones as Rane Quinn (seasons 6–7; co-star season 5), a member of SAMCRO\r\nKim Dickens as Colette Jane (seasons 6–7), an escort agency owner\r\nDouglas Bennett as Orlin West (seasons 6–7), a member of the Reno chapter of the Sons\r\nJacob Vargas as Allesandro 'Domingo' Montez (seasons 6–7), a member of the Reno chapter of the Sons\r\nScott Anderson as Connor Malone (seasons 6–7), a member of the True IRA\r\nSteve Howey as Hopper (season 6), a member of the Reno chapter of the Sons\r\nMichael Shamus Wiles as 'Jury' White (season 7; guest seasons 1 & 6), originally the president Devil's Tribe Motorcycle Club in Indian Hills, which was patched over to be the Sons of Anarchy Indian Hills chapter\r\nMarya Delver as Officer Candy Eglee (season 7; co-star seasons 1–3 & 6), a Charming PD officer who also grew up with Jax, Tara, Opie, and Hale\r\nMo McRae as Tyler Yost (season 7; guest seasons 5–6), the new boss of the Niners\r\nHayley McFarland as Brooke Putner (season 7; guest season 6), the daughter of a woman also killed in the same auto accident as John Teller\r\nMarilyn Manson as Ron Tully (season 7), a shot caller in the Aryan Brotherhood who is incarcerated with Juice\r\nMalcolm-Jamal Warner as 'Sticky' (season 7), the Vice President of the Grim Bastards\r\nIvo Nandi as Oscar 'El Oso' Ramos (season 7), the president of the Stockton charter of the Mayans\r\nRon Yuan as Ryu Tom (season 7), a member of the Lin Triad\r\nBrad Carter as Leland Gruen (season 7), a member of the Aryan Brotherhood\r\nApril Grace as Loutreesha Haddem (season 7), the mother of Grant McQueen\r\nArjay Smith as Grant McQueen (season 7), the stepson of a pastor indebted to Damon Pope\r\nMatthew St. Patrick as Moses Cartwright (season 7), a bodyman for August Marks\r\nCourtney Love as Ms. Harrison (season 7), Abel Teller's Pre-K teacher\r\nTony Curran as Gaines (season 7), a member of the Indian Hills charter\r\nAnnabeth Gish as Lieutenant Althea Jarry (season 7), a police lieutenant who comes to Charming\r\nElements\r\nConcept\r\nThe Sons of Anarchy (SOA) is an outlaw motorcycle club with many charters in the United States as well as overseas. The show focused on the original and founding (\"mother\") charter, Sons of Anarchy Motorcycle Club, Redwood Original, often referred to by the acronym SAMCRO, Sam Crow, or simply \"Redwood\". SAMCRO is located in San Joaquin County, California, in the fictional town of Charming, which appears to be near Stockton. Its nickname is reflected in the original title for the show, Forever Sam Crow. SAMCRO attempts to control and protect Charming through close community relationships, bribery, and violent intimidation. They are vehement about keeping \"hard\" drugs and drug dealers out of Charming; they also attempt to keep the peace between the various racially-divided gangs located in nearby cities.\r\nFounders\r\nHigh school friends John Teller and Piermont \"Piney\" Winston co-founded SAMCRO in 1967 upon returning from the Vietnam War. After the birth of John's sons with his wife, Gemma, they settle in her hometown of Charming. Six of the \"Redwood Original 9\" or \"First 9\" members were Vietnam veterans, with only Lenny Janowitz, the club's third member and original Sergeant-at-Arms, alive at the end of the series. The other First 9 included Chico Villanueva, Otto Moran, Wally Grazer, Thomas Whitney, Clay Morrow, and Keith McGee.\r\nAttire\r\nClub members wear denim or leather vests known as cuts with a three-piece patch on the back that includes the club's name, logo, and territorial location. The SOA logo is a traditional Grim Reaper holding a crystal ball with the anarchist circle-A symbol, and wielding the Reaper's traditional scythe, the handle of which has been replaced by the M16 rifle. Only full members can wear the \"full patch\", and many of them also have it tattooed on their backs or aspects of it on their arms. Other smaller patches, called flashes, have specific meanings, such as \"Men of Mayhem\", which is worn by club members who have spilled blood on the club's behalf; \"First 9\", worn by the original nine members; and rank flashes for the club officers.\r\nWhenever conducting club business, the members always wear their cuts; one notable exception to this is during the course of season 4, when a number of SAMCRO members are on parole and must cover their cuts in public to avoid identifying as members.\r\nFemale characters—such as Tara, Ima, and Lyla—are seen wearing t-shirts that sport the name Sons of Anarchy or SAMCRO, but nobody outside of the club wears cuts or is seen wearing clothing with the symbol or Reaper image.\r\nSome of the show's clothing was created by LA company Victorious 22.\r\nMotorcycles\r\nSAMCRO rides customized Harley-Davidson Dyna motorcycles. Each rider customizes his own bike to his individual style; however, they all paint their bikes black and most sport T-bar style handlebars. A member's bike usually sports graphics such as the Sons of Anarchy letters, the club's Grim Reaper logo, or the circled \"A\" club logo. In later seasons, several members switch to more touring-oriented models. During the final season, Jax refurbishes and rides his father's 1946 Harley-Davidson Customized EL Knucklehead.\r\nActivities and affiliates\r\nSome members have day jobs in local industries; most work at the Teller-Morrow garage as mechanics and assist at the club's other business ventures, such as running security or accounting at the porn studios. They primarily make money by illegally importing firearms and selling them to various gangs, and making protection runs for local businesses by defending valuable truck shipments against hijacking. During Season 4 they start to mule cocaine for the Galindo cartel in exchange for cash and protection. Throughout the series, they also manage porn studios and an escort business in an attempt to earn legitimately.\r\nSAMCRO keeps meth traffickers and drug dealers out of Charming, which puts them at odds with the meth-distributing white supremacist Nordics (Nords), headed by Ernest Darby. This earns them respect and admiration from the townspeople, who believe the Sons do more to protect their town than its own police. SAMCRO also has to deal with a rival, Oakland-based motorcycle club Mayans led by Marcus Alvarez. Other groups in SAMCRO's orbit include the Oakland–based Chinese mafia Lin Triad, led by Henry Lin; the Italian American Cacuzza crime family; the Russian mob led by Viktor Putlova; the Real IRA (aka RIRA) of Northern Ireland, which supplies them with illegal Russian-made guns; the \"One-Niners\", an African American street gang to whom SAMCRO sell weapons; and various affiliates in the state prison system, where many members of the club have been incarcerated at one time or another.\r\nProperties\r\nIn the series premiere, the Mayans torch the facility the SAMCRO used for storing and assembling guns, forcing the club to buy land for and build another facility. The Clubhouse is located on the \"compound\" that includes the Teller-Morrow mechanic shop. The Clubhouse itself includes a living area with multiple apartments, a fully operational bar, a pool table, a kitchen; a workout room; and the \"Chapel\", the SAMCRO meeting room with an elaborate redwood conference table that has the club logo carved into the top, where the members meet to discuss club business and vote on major decisions. The club owns a secluded cabin in the woods that is often Piney's retreat, and various warehouses outside of town. The club also rented an old soda fountain/candy shop that is used as the clubhouse in seasons 6 and 7 after the Teller-Morrow shop and original clubhouse were destroyed in an explosion. They also owned the warehouses out of which they ran their porn studios Cara Cara and Red Woody, and Diosa and Diosa Norte, the club's two escort agencies.\r\nShakespearean influence\r\nSons of Anarchy has been called \"Hamlet on Harleys\". Similar to Hamlet, Jax's father was usurped by his father's SAMCRO \"brother\", who then married Jax's mother. There were also intermittent hints at an Oedipal complex between Jax and Gemma, reflecting 20th-century interpretations of the relationship between Hamlet and his mother Queen Gertrude. Jax's murder of the innocent Jury in season 7 mirrors Hamlet's murder of the innocent Polonius in that it ultimately leads to his downfall.\r\nSutter has said of the Shakespeare element, \"I don't want to overplay that but it's there. It was Jax's father who started the club, so he's the ghost in the action. You wonder what he would have made of the way it turned out. It's not a version of Hamlet but it's definitely influenced by it.\" Ron Perlman believed they were \"going to stick to the structure of Hamlet all the way to the end (of the series).\"\r\nNumerous episode titles refer to Hamlet including:\r\nSeason 1, Episode 9, \"Hell Followed\". This refers to Act 1, Scene 4 of Hamlet in which Hamlet follows his father's ghost, unsure of whether he comes from hell.\r\nSeason 4, Episode 12, \"Burnt and Purged Away\". This quote is taken from Act I, Scene 5 of Hamlet, in which the ghost of Hamlet's father explains to Hamlet that he is doomed to suffer in Purgatory until he has paid for all of his sins.\r\nSeason 4, Episodes 13–14, \"To Be, Act 1\" and \"To Be, Act 2\". These refer to the famous To be, or not to be soliloquy.\r\nSeason 5, Episode 11, \"To Thine Own Self\". This quote references Polonius's advice to his son Laertes.\r\nSeason 7, Episode 9, \"What a Piece of Work Is Man\". This refers to Hamlet's What a piece of work is a man speech in Act II, Scene 2.\r\nSeason 7, Episode 11, \"Suits of Woe\". This is from Act 1, Scene 2, \"I have that within which passeth show, these but the trappings and the suits of woe.\"\r\nIn the Season 1 premiere, Gemma is shown cleaning Jax's house, and he notes that she is always cleaning. This behavior, combined with her ambitions and (sometimes murderous) machinations, have prompted some reviewers and commentators to liken her to Lady Macbeth.\r\nSAMCRO hierarchy\r\nProduction\r\nCrew\r\nThe series was created by Kurt Sutter. Sutter was also the showrunner, the series' most prolific writer, and a regular director; he directed each season finale. Sutter had previously worked as an executive producer for the FX series The Shield. The Sons of Anarchy's other executive producers are father and son team Art Linson and John Linson; Jim Parriott served as an executive producer and writer for the first season only.\r\nParis Barclay joined Sons of Anarchy as an executive producer in the fourth season, after directing episodes in the first and second season. In addition to serving as Executive Producer in the fourth, fifth, and sixth seasons, Barclay directed three episodes each season, including the season 4 and 5 premieres, the top two highest-rated telecasts in the history of FX.\r\nJack LoGiudice served as a consulting producer and regular writer for the first season. He became co-executive producer for the second season, then left the series to work on The Walking Dead.\r\nDave Erickson also worked as a consulting producer for the first and second seasons, and then took over as co-executive producer for the third season. The series' other regular writers are supervising producer Chris Collins and co-producer Regina Corrado. Shawn Rutherford joined as consulting producer for seasons 6 and 7.\r\nSutter drew regular directors from The Shield including Stephen Kay, Gwyneth Horder-Payton, Guy Ferland, and Billy Gierhart.\r\nFilming\r\nAlthough Sons of Anarchy is set in Northern California's Central Valley (with some scenes in the Bay Area), it was filmed primarily at Occidental Studios Stage 5A in North Hollywood. Main sets located there included the clubhouse, St. Thomas Hospital, and Jax's house. The production rooms at the studio used by the writing staff doubled as the Charming police station. External scenes were often filmed nearby in Sun Valley, Acton, California, and Tujunga. Interior and exterior scenes set in Northern Ireland during season 3 were also filmed at Occidental Studios and surrounding areas. A second unit shot footage in Northern Ireland used in the third season.\r\nEpisodes\r\nReception\r\nCritical reception\r\nSons of Anarchy received very favorable reviews over the course of its run, with many singling out Katey Sagal's performance. On the review aggregator website Metacritic, the first season scored 68/100, the second season scored 86/100, the third season scored 84/100, the fourth season scored 81/100, the fifth season scored 72/100, the sixth season scored 74/100 and the final season scored 68/100.\r\nIn 2013, a collection of essays on the series was published.\r\nSeason one\r\nThe first season received positive reviews from industry critics. It scored a 68 on Metacritic, indicating \"generally favorable reviews\". Matthew Gilbert of The Boston Globe said the first season had \"real potential\". The New York Times' Gina Bellafante spoke highly of the cast's acting ability, particularly Sagal's portrayal of Gemma. Brian Lowry of Variety gave a mixed review, admiring Sutter's creation of the club and the town of Charming but observing the early episodes lacked direction.\r\nSeason two\r\nThe second season saw a substantial increase in positive reviews. Writing for Chicago Tribune, Maureen Ryan called the second season \"engrossing\". She elaborated that \"the pacing is better the plotting is tighter\" and commends Sagal and Perlman for their performances. Variety's Stuart Levine stated that the new season was \"compelling\"; he also complimented the acting skill of Perlman, Sagal, Hunnam and Siff. James Poniewozik of TIME called Sagal's performance \"devastatingly powerful\" and named the series on his list of Top 10 Shows of 2009. In Alan Sepinwall's 2016 book titled TV (The Book), which he co-wrote with Matt Zoller Seitz, he included the second season of Sons of Anarchy in the section \"A Certain Regard\" where he praised how \"fter working out a few kinks in the first season, Sutter nailed everything in season 2\".\r\nSeason three\r\nSome critics felt the third season was dragged down by the previous season's cliffhanger. James Poniewozik of TIME called the season three premiere \"breathtaking\" and praised Sagal's performance with Holbrook. He later stated that Abel's disappearance helped return the show to its central problem: Jax's allegiance to the club. Entertainment Weekly's Ken Tucker agreed that Holbrook and Sagal's scenes were \"beautiful\". He also commented that the series handled themes of loyalty and family especially well. Maureen Ryan commented that the third season divided critics and fans alike, suggesting the expanded Belfast cast made it harder for the audience to invest in the characters' journeys. Ryan later questioned the credibility of Hector Salazar's story, noting that he was inferior to other villainous characters such as Stahl, Zobelle and Weston. However, she praised Ally Walker's performance, comparing her character to The Shield's Vic Mackey. Critic Alan Sepinwall said the season was \"interesting but uneven\", noting that the plot gained traction in later episodes. Tim Goodman of The Hollywood Reporter said \"Sutter should be applauded for shaking things up\", calling the slower pace a \"creative necessity\".\r\nSeason four\r\nAlan Sepinwall stated that the fourth season risked predictability by returning to a successful formula of storytelling, but he nonetheless preferred those episodes to those of season three. Maureen Ryan reviewed the fourth season positively. She praised the addition of Lincoln Potter (played by Ray McKinnon), comparing the character's quality to that of Breaking Bad's antagonist, Gustavo Fring. The A.V. Club called the fourth season more \"focused\" and \"operatic\". A.V. Club reviewer Zack Handlen was fond of the season but felt disappointed with the finale, saying it featured a \"lousy case of dictated convenience, of an arbitrary and unbelievable reveal used to shift characters around to where the writers want them to be for next season, as opposed to where they might land organically.\" However, the review did praise Charlie Hunnam's performance in the finale. TIME said the fourth season was the strongest since season two, but the show needed to end sooner rather than later. TIME also agreed that the finale's contrivances were sometimes too visible, stating \"it's the principle: you can only turn up alive at your own funeral so many times before it starts to lose its impact.\"\r\nSeason five\r\nSeason five received favorable reviews and has a rating of 72 on Metacritic. Ken Tucker of Entertainment Weekly praised the series by calling it a \"richly detailed portrait of self-righteous villainy\".\r\nSeason six\r\nSeason six received generally favorable reviews and scored a 74 out of 100 on Metacritic.\r\nSeason seven\r\nSeason seven received \"generally favorable reviews\" and scored a 68 out of 100 on Metacritic based on reviews from 6 critics.\r\nRatings\r\nThe seventh season's premiere on September 9, 2014, received the highest ratings in the series' history. The episode was watched by 6.20 million viewers.\r\nAccolades\r\nMusic\r\nSoundtracks\r\nThree EP soundtracks have been released by 20th Century Fox Records, on iTunes, featuring songs from each series. The first five-song EP, entitled Sons of Anarchy: North Country – EP, was released on September 8, 2009, and featured the full version of the Emmy Award nominated theme song \"This Life\". A second five-song EP, entitled Sons of Anarchy: Shelter – EP, was released on November 24, 2009, while a third six-song EP, entitled Sons of Anarchy: The King is Gone - EP, was released on November 23, 2010.\r\nIn November 2011, selected highlights from the EPs and new tracks were released in Songs of Anarchy: Music from Sons of Anarchy Seasons 1–4, followed up by Sons of Anarchy: Songs of Anarchy Vol. 2 released in November 2012, Sons of Anarchy: Songs of Anarchy Vol. 3 released in December 2013, and Sons of Anarchy: Songs of Anarchy Vol. 4 released in February 2015.\r\nKatey Sagal, who played Gemma Teller Morrow on the show, recorded two songs for the soundtracks.\r\nOther media\r\nComic book\r\nIn 2013, Boom! Studios began publishing a Sons of Anarchy comic book. As of September 2015, 25 issues have been published. Issue 25 is the final issue. A new comic book prequel, Sons of Anarchy: Redwood Original, was released on August 3, 2016.\r\nThe comic series were published as Legacy Edition Collections as well: Sons of Anarchy Legacy Edition Book One, Sons of Anarchy Legacy Edition Book Two, Sons of Anarchy Legacy Edition Book Three.\r\nNovel series\r\nSons of Anarchy: Bratva, the first in a planned series of SOA novels to be written by Christopher Golden, was published in 2014.\r\nPotential prequel\r\nA prequel series, detailing the origin of the club, is planned. Sutter stated in an August 2014 interview that the prequel would focus on the \"First 9\" members of the club and be set around the time of the Vietnam War. He added that the prequel would likely consist of a miniseries or \"maybe 10 episodes or two 8 episodes seasons\". At the conclusion of the prequel, Sutter plans to release John Teller's manuscript, titled The Life and Death of SAMCRO. However, the prequel is in limbo after some problems between Sutter and Disney arose. Sutter was quoted saying that the possibility of making the First 9 \"doesn't look that hopeful\" since he was fired from FX and the studio owns Sons of Anarchy.\r\nSons of Anarchy: The Prospect\r\nSons of Anarchy: The Prospect was an episodic adventure video game developed by Silverback Games and published by Orpheus Interactive. The game was originally slated to have ten episodes and to be released on Microsoft Windows, OS X, iOS, and Android. The first episode was released on February 1, 2015, for iOS only, and was met with mixed reviews. It has not seen an update since, and, although a season pass is being offered, no further episode was ever released. On April 7, 2016, refunds were issued to everyone who purchased the game or the season pass, and the game had been removed from the App Store.\r\nDespite the apparent cancellation and refunds, the game's publisher has not officially said anything about the development state of the nine unreleased episodes. Silverback Games has distanced themselves from the project, claiming to be \"just a consultant\" and having no knowledge of the state of the game or of Orpheus Interactive.\r\nSpin-off\r\nAs of May 11, 2016, a spin-off series was in the works titled Mayans M.C.. The pilot began shooting in March 2017, directed by Sutter from a script he co-wrote with Elgin James.\r\nMayans M.C. takes place two and a half years after the events of Sons of Anarchy and is set hundreds of miles away in the fictional California border town of Santo Padre. The series focuses on the struggles of Ezekiel \"EZ\" Reyes (portrayed by J. D. Pardo), a prospect in Mayans Motorcycle Club charter based on the U.S.-Mexico border who eventually works his way up to president of the chapter. EZ is the gifted son of a proud Mexican family, whose American dream was snuffed out by cartel violence. On February 13, 2017, Edward James Olmos was attached to star as EZ's father Felipe Reyes, the family's once strong Mexican patriarch. Several aspects from Sons of Anarchy are included in the show, including the Sons of Anarchy themselves, as well as the Galindo Cartel, who plays a larger role in the series. The series features appearances from characters from Sons of Anarchy, including Marcus Álvarez (Emilio Rivera), Happy Lowman (David Labrava), an uncredited appearance in the pilot from Katey Sagal portraying Gemma Teller, Lincoln Potter (Ray McKinnon), among a few others.\r\nOn January 5, 2018, FX picked up the series with an order of 10 episodes, which premiered on September 4, 2018. On October 1, 2018, it was announced that FX had renewed the series for a second season.\r\nSeason 4 premiered on April 19, 2022. Season 5 was confirmed and renewed by FX in July 2022.\r\nBroadcast\r\nSons of Anarchy premiered in Australia, on the Showcase in 2009. In New Zealand, it appeared on TV3 on October 20, 2010, and, it has been announced, it is moving to the Box. In the UK, the show premiered on Bravo in 2009, but the channel only showed the first 2 series before it closed in 2011. It aired in its entirety on Spike in 2015. In the Republic of Ireland, the show aired on RTÉ Two from 2009. In Canada, it premiered on Super Channel on October 20, 2008. In India, season 6 began airing on Star World Premiere on September 26, 2013.\r\nIn 2018, Universo announced an October 29, 2018, premiere of Sons of Anarchy season 3 in Spanish. The show was made available on Netflix in 2011, but all seasons were removed from Netflix on December 1, 2018.\r\nAs of 2021, the show is available to watch in some countries on Disney+'s Star section and available on Hulu.\r\nThe show also reran on AT&T's now defunct Audience Network.",
    "html": "<p>Sons of Anarchy is an American action crime drama television series created by Kurt Sutter for FX. Originally aired from September 3, 2008, to December 9, 2014, Sons of Anarchy follows the lives of a close-knit outlaw motorcycle club operating in Charming, a fictional town in California's Central Valley. Charlie Hunnam stars as Jackson \"Jax\" Teller, who is initially the vice president and subsequently the president of the club. After discovering a manifesto written by his late father, John, who previously led the club, he begins to question himself, his relationships, and the club. Themes throughout the show include love, brotherhood, loyalty, betrayal and redemption. It explored vigilantism, government corruption and racism. The show's plot depicted an outlaw motorcycle club as an analogy for human transformation. David Labrava, a real-life member of the Oakland chapter of Hells Angels, served as a technical adviser, and also played the recurring character Happy Lowman, the club's assassin.</p><p>Sons of Anarchy had the third season attract an average of 4.9 million weekly viewers, becoming FX's highest-rated series at the time and surpassing its other hits The Shield, Nip/Tuck and Rescue Me. The season 4 and 5 premieres were the two highest-rated telecasts in FX's history. The sixth season aired from September 10, 2013, through December 10, 2013. The seventh season of the series premiered on September 9, 2014. On November 3, 2014, FX announced that the seventh season would be its last. The series finale aired on December 9, 2014.</p><p>In November 2016, FX announced the development of a spin-off series, Mayans M.C., centering around the title Latino club. The spin-off's first season premiered on September 4, 2018.</p><br/><h3>Series overview</h3><p>Each season involved parallel plot lines that intertwine and overlap, centering on both the personal and family life of Jackson \"Jax\" Teller (Charlie Hunnam) and on SAMCRO (Sons of Anarchy Motorcycle Club, Redwood Original), the \"Mother Chapter\" of the organization based in Charming, California. SAMCRO is involved with gun-running in the western United States, and deals with rival gangs, politicians and the authorities. As vice president and later president of SAMCRO, Jax struggles to manage the club and the legacy of its founder, his late father John Teller. He is frequently at odds with his stepfather, Clay Morrow, who has taken over the club since John's death, and is also now married to Jax's mother and John's widow, Gemma Teller Morrow. Jax also grapples with his relationships with his high school sweetheart, Tara Knowles, and his childhood best friend, Opie Winston.</p><p>SAMCRO takes its inspiration from the Hells Angels Motorcycle Club; the series includes special guest appearances by David Labrava (Happy), Chuck Zito (Frankie Diamonds), Rusty Coones (Quinn), and Sonny Barger (Lenny \"The Pimp\" Janowitz) who are real Hells Angels members.</p><h4>Season 1 (2008)</h4><p>The series begins with the destruction of a warehouse the club uses to store and assemble guns, which is their main source of income, by a rival club right before the overdose of Jax's heroin addicted ex-wife Wendy. An emergency C-section is performed, and their son Abel is delivered ten weeks prematurely. Jax finds his father's memoirs when he visits a storage unit to collect some old baby clothes. John Teller, Jax's father, was one of the founders of SAMCRO, and the book describes his trials with and hopes for the club. Jax's mother, Gemma Teller-Morrow, is now married to the president of SAMCRO, Clay Morrow. Jax's best friend Opie has just been released from prison for serving time for a club-related crime. The first season deals with Jax trying to reconcile things happening to the club with what he reads in his father's memoirs, Opie trying to take a lesser role in the club, and local and federal law enforcement trying to shut down SAMCRO.</p><h4>Season 2 (2009)</h4><p>White separatists called the League of American Nationalists (LOAN) arrive in Charming. LOAN's leader Ethan Zobelle and Zobelle's enforcer, A.J. Weston, seek to drive the Sons of Anarchy from Charming. To send a message to SAMCRO, Zobelle orchestrates to have Gemma kidnapped and gang raped by Weston and two others. Due to the improper handling of an internal problem, the rift between Clay and Jax continues to widen as Jax challenges most of Clay's decisions and comes to a head when a lone car bomb nearly kills another member of SAMCRO. The second season sees SAMCRO battling LOAN for control of Charming, Jax and Clay veering further apart in their individual visions for the club, and evading the ever-present threat of the ATF.</p><h4>Season 3 (2010)</h4><p>Gemma has been hiding in Rogue River, Oregon, with Tig at the home of Gemma's father, Nate (Hal Holbrook), who suffers from dementia. Gemma struggles when she takes Nate to his new assisted living home, and he pleads to be taken back to his house. She returns to Charming to reunite with her grandson, unaware he has been kidnapped. The return of A.T.F. agent Stahl twists the facts about the murder of Donna, Stahl attempts to make a deal with Jax behind the club's back. Father Kellan Ashby's sister, Maureen, contacts Gemma at Ashby's request and tells her Abel is safe in Belfast. Upon learning of her grandson's abduction, Gemma suffers a cardiac arrhythmia and collapses in the Teller-Morrow lot. After the club returns from Northern Ireland and brings home Abel, agent Stahl double crosses Jax and tells the club about the side deal Jax made with her, unaware that Jax and the club had it planned all along knowing Stahl would back out of the deal. Jax, Clay, Bobby, Tig, Juice and Happy are hauled away to jail. While Opie, Chibs, and the Prospects are all en route following Stahl. Opie kills Stahl to avenge the death of his wife, Donna.</p><h4>Season 4 (2011)</h4><p>The imprisoned SAMCRO members leave the penitentiary after their 14-month stay and are met by Lieutenant Eli Roosevelt of the San Joaquin Sheriff's Department, the new law enforcement presence in Charming. They also discover that Sheriff Hale's brother has become the mayor. US Attorney Lincoln Potter seeks Lieutenant Roosevelt's help to build a RICO case against SAMCRO.</p><h4>Season 5 (2012)</h4><p>In retaliation for the death of Veronica Pope (Laroy's girlfriend, who was also the daughter of powerful Oakland kingpin Damon Pope), the Niners attack SAMCRO and ambush a cargo shipment. With the death of Piney Winston and the growing conflict between the Niners and SAMCRO, along with several home invasions targeting people linked to the club, Jax is forced to meet with Damon Pope, to deal with a new threat unlike anything SAMCRO has ever faced.</p><h4>Season 6 (2013)</h4><p>Following the arrest of Tara and Clay, Jax struggles to hold SAMCRO together while Tara is imprisoned. Toric approaches both Tara and Clay and offers them deals in exchange for giving up SAMCRO; both initially refuse, but Clay later relents when confronted with being thrown into the prison's general population and assuredly being killed by inmates paid off by Damon Pope's men as a retaliation for Pope's murder. Juice returns to Charming after helping Bobby relocate after stepping down as VP, which angers Chibs, who doesn't believe Juice has been punished enough for talking to cops and later beats him. With the death of Clay, Gemma and Nero's romance becomes stronger. Tara is murdered and the tables get turned for the club.</p><h4>Season 7 (2014)</h4><p>Jax struggles with his recent loss and turns himself in to the authorities. While in jail, Jax makes decisions that radically alter the direction of the club and uses it to exact revenge for the death of his wife. With Bobby's death in the ensuing war, the hate and lies are fuelled, created by Gemma and Juice, who are on the run and hiding from the club. After Jax learns the truth, he works to make things right with all parties involved. The series ends with Jax making the ultimate sacrifice to complete his part of the story of SAMCRO and fulfill his father's vision.</p><br/><h3>Cast and characters</h3><p>Sons of Anarchy is the story of the Teller-Morrow family of Charming, California, as well as the other members of Sons of Anarchy Motorcycle Club, Redwood Original (SAMCRO), their families, various Charming townspeople, allied and rival gangs, associates, and law agencies that undermine or support SAMCRO's legal and illegal enterprises.</p><p>The series begins with SAMCRO being led by club president Clay Morrow, his stepson Jax Teller as vice president, Tig Trager as Sergeant-At-Arms, Bobby Munson as Secretary/Treasurer, and Juice Ortiz as their intelligence officer. Other members rounding out the club were Chibs Telford, formerly of SAM-Belfast, Opie Winston, the son of First 9 member and SAMCRO advisor Piney Winston, and Half-Sack Epps, the charter's prospect. They often cross paths with Deputy Sheriff Hale, a classmate of Jax's who grew up on the other side of the law, and his boss, Sheriff Unser, who is on the club's payroll. Jax, a new father, deals with his ex-wife Wendy Case and is reunited with his high school sweetheart, Tara Knowles, while Opie tries to return to a life of normalcy for his long-suffering wife Donna Winston.</p><h4>Main</h4><ul><li>Charlie Hunnam as Jackson 'Jax' Teller</li><li>Katey Sagal as Gemma Teller Morrow</li><li>Mark Boone Junior as Robert 'Bobby Elvis' Munson</li><li>Kim Coates as Alexander \"Tig\" Trager</li><li>Tommy Flanagan as Filip 'Chibs' Telford</li><li>Johnny Lewis as Kip 'Half-Sack' Epps (seasons 1–2)</li><li>Maggie Siff as Dr. Tara Knowles (seasons 1–6)</li><li>Ron Perlman as Clarence 'Clay' Morrow (seasons 1–6)</li><li>Ryan Hurst as Harry 'Opie' Winston (seasons 2–5; recurring season 1)</li><li>William Lucking as Piermont 'Piney' Winston (seasons 2–4; recurring season 1)</li><li>Theo Rossi as Juan-Carlos 'Juice' Ortiz (seasons 2–7; recurring season 1)</li><li>Dayton Callie as Wayne Unser (seasons 3–7; recurring seasons 1–2)</li><li>Jimmy Smits as Neron 'Nero' Padilla (seasons 6–7; recurring season 5)</li><li>Drea de Matteo as Wendy Case (season 7; recurring seasons 1, 5–6; special guest season 4)</li><li>David Labrava as Happy Lowman (season 7; recurring seasons 1–6)</li><li>Niko Nicotera as George 'Rat Boy' Skogstorm (season 7; recurring seasons 4–6)</li></ul><h4>Recurring</h4><ul><li>Emilio Rivera as Marcus Álvarez, the president of the Mayans, the Latino Motorcycle Club that rivals the Sons</li><li>Tory Kittles as Laroy Wayne (seasons 1–4), the leader of the Niners, the local black gang to whom the Sons deal guns</li><li>Taylor Sheridan as Deputy Chief David Hale (seasons 1–3), Unser's second-in-command, who begins as a no-nonsense cop who grew up with Jax, Tara, Opie, and Donna</li><li>Jamie McShane as Cameron Hayes (seasons 1–3), a member of the True IRA who serves as gun liaison with the Sons</li><li>Dendrie Taylor as Luann Delaney (seasons 1–2), the producer at Caracara, the local porn studio, and wife of SAMCRO member Otto</li><li>Glenn Plummer as Deputy Sheriff Vic Trammel (seasons 1–2), a San Joaquin sheriff deputy who is on the Sons' payroll</li><li>Julie Ariola as Mary Winston (seasons 1–2), Piney's estranged wife and Opie's mother</li><li>Taryn Manning as Rita 'Cherry' Zambell (seasons 1 & 3), a hang-around with the Devils Tribe, she falls for SAMCRO prospect Half-Sack and leaves Nevada to be with him in Charming</li><li>Sprague Grayden as Donna Winston (season 1), Opie's wife</li><li>Jay Karnes as Agent Joshua Kohn (season 1), a Chicago-based ATF agent who previously dated Tara, and come to Charming to find her</li><li>Keir O'Donnell as Lowell Harland, Jr. (season 1), a drug-addicted mechanic at Teller-Morrow</li><li>Ally Walker as Agent June Stahl (seasons 1–3), an ATF agent who comes to Charming to investigate SAMCRO, and later the True IRA and Aryan Brotherhood</li><li>Jeff Wincott as Jimmy Cacuzza (guest seasons 1, 5–6)</li><li>Mitch Pileggi as Ernest Darby (seasons 1–2; special guest season 3; guest season 6), a Neo-Nazi who leads the Nords, a local heroin-dealing gang</li><li>Michael Ornstein as Chucky Marstein (seasons 2–7; guest season 1), an accountant who falls under the protection and employ of SAMCRO</li><li>Adam Arkin as Ethan Zobelle (season 2), a leader in the Aryan nationalist organization who comes to Charming</li><li>Kenneth Choi as Henry Lin (seasons 2–3 & 5–6; guest season 1; special guest season 7), the leader of the Lin Triad, a Chinese drug cartel</li><li>Kurt Sutter as Otto 'Big Otto' Delaney (seasons 2–6 'uncredited'; guest season 1 'uncredited'), a member of SAMCRO who is in federal prison, and husband of Luann</li><li>Patrick St. Esprit as Elliott Oswald (seasons 2–4; guest seasons 1 & 6), a local businessman whose connections the Sons use</li><li>Marcos de la Cruz as Estevez (seasons 2–3; guest season 1), a DOJ agent who works with Stahl</li><li>Winter Ave Zoli as Lyla Winston (seasons 2–7), one of the Caracara girls who falls in love with Opie</li><li>McNally Sagal as Margaret Murphy (seasons 2–6), the chief administrator at St Thomas, who becomes a close confidant of Tara's</li><li>Kristen Renton as Ima Tite (seasons 2–6), a Caracara girl</li><li>Kenny Johnson as Herman Kozik (seasons 2–4), a member of the Tacoma chapter of the Sons, who has a rough personal history with Tig</li><li>Titus Welliver as Jimmy 'Jimmy O' O'Phelan (seasons 2–3), a leader in the True IRA who is now married to Chibs' ex-wife</li><li>Bellina Logan as Fiona Larkin (seasons 2–3), Chibs' ex-wife</li><li>Henry Rollins as A.J. Weston (season 2), a member of the Aryan Brotherhood who comes to Charming as Zobelle's muscle</li><li>Callard Harris as Edmond Hayes (season 2), Cameron's son</li><li>Sarah Jones as Polly Zobelle (season 2), Zobelle's daughter</li><li>Jeff Kober as Jacob Hale Jr. (seasons 3–6; guest season 2), Deputy Hale's older brother and a local political bigwig</li><li>Christopher Douglas Reed as Philip 'Filthy Phil' Russell (seasons 3–6), a SAMCRO prospect</li><li>Robin Weigert as Ally Lowen (seasons 3–6), a lawyer who takes SAMCRO on as a client</li><li>Michael Beach as Taddarius Orwell 'T.O.' Cross (seasons 3 & 7; guest season 5), the president of the Grim Bastards Motorcycle Club</li><li>Hal Holbrook as Nate Madock (season 3; guest season 7), Gemma's father, who suffers from dementia</li><li>Jose Pablo Cantillo as Hector Salazar (season 3), the president of the Calaveras Motorcycle Club</li><li>James Cosmo as Father Kellen Ashby (season 3), an advisor to the True IRA</li><li>Zoe Boyle as Trinity Ashby (season 3), daughter of Maureen and niece of Father Ashby</li><li>Andrew McPhee as Keith McGee (season 3), the president of the Belfast charter of the Sons, SAMBEL, and the current partner of Maureen Ashby</li><li>Arie Verveen as Liam O'Neill (season 3), the vice president of SAMBEL</li><li>Pamela J. Gray as Agent Amy Tyler (season 3), an ATF agent</li><li>Marcello Thedford as Lander Jackson (season 3), the vice president of the Grim Bastards</li><li>Joel Tobeck as Donny (season 3), a member of the True IRA</li><li>Darin Heames as Seamus Ryan (season 3), a member of SAMBEL</li><li>Q'orianka Kilcher as Kerrianne Larkin-Telford (season 3), Chibs and Fiona's daughter, and Jimmy O's stepdaughter</li><li>Monique Gabriela Curnen as Amelia Dominguez (season 3), the caretaker of Gemma's father Nate</li><li>Michael Fairman as 'Lumpy' Feldstein (season 3), a boxing club owner in Charming</li><li>Bob McCracken as Brendan Roarke (seasons 4 & 6–7; guest season 3), a member of the True IRA council</li><li>Frank Potter as Eric Miles (season 4; co-star season 3), a SAMCRO prospect</li><li>Walter Wong as Chris 'V-Lin' Von Lin (seasons 4–6), a SAMCRO prospect</li><li>Danny Trejo as Romero 'Romeo' Parada (season 4; special guest season 5), a high-ranking member of the Galindo Cartel, who is also a C.I.A. agent</li><li>Timothy V. Murphy as Galen O'Shay (seasons 4–6), a leader within the True IRA</li><li>Merle Dandridge as Rita Roosevelt (seasons 4–5), the wife of San Joaquin Sheriff Eli Roosevelt</li><li>Benito Martinez as Luis Torres (season 4; special guest season 5), a member of the Galindo Cartel</li><li>David Rees Snell as Agent Grad Nicholas (season 4), an ATF agent</li><li>Billy Brown as August Marks (seasons 5–7), an Oakland drug kingpin and crime boss who works with Damon Pope</li><li>Reynaldo Gallegos as 'Fiasco' (seasons 5–7)</li><li>Harold Perrineau as Damon Pope (season 5), an Oakland gangster who oversees the Niners</li><li>Chuck Zito as Frankie Diamonds (season 5), a former Sons Nomad who transfers to SAMCRO</li><li>Chris Browning as 'Go-Go' (season 5), a Sons Nomad</li><li>Kurt Yaeger as Greg 'The Peg' (season 5), a Sons Nomad</li><li>Wanda De Jesus as Carla (season 5), the half-sister of Nero Padilla</li><li>Walton Goggins as Venus Van Dam (born Vincent Noone) (seasons 5–7), a transgender prostitute who befriends SAMCRO and becomes Tig's main romantic interest</li><li>LaMonica Garrett as Deputy Sheriff Cane (seasons 6–7; co-star seasons 4–5),</li><li>Rusty Coones as Rane Quinn (seasons 6–7; co-star season 5), a member of SAMCRO</li><li>Kim Dickens as Colette Jane (seasons 6–7), an escort agency owner</li><li>Douglas Bennett as Orlin West (seasons 6–7), a member of the Reno chapter of the Sons</li><li>Jacob Vargas as Allesandro 'Domingo' Montez (seasons 6–7), a member of the Reno chapter of the Sons</li><li>Scott Anderson as Connor Malone (seasons 6–7), a member of the True IRA</li><li>Steve Howey as Hopper (season 6), a member of the Reno chapter of the Sons</li><li>Michael Shamus Wiles as 'Jury' White (season 7; guest seasons 1 & 6), originally the president Devil's Tribe Motorcycle Club in Indian Hills, which was patched over to be the Sons of Anarchy Indian Hills chapter</li><li>Marya Delver as Officer Candy Eglee (season 7; co-star seasons 1–3 & 6), a Charming PD officer who also grew up with Jax, Tara, Opie, and Hale</li><li>Mo McRae as Tyler Yost (season 7; guest seasons 5–6), the new boss of the Niners</li><li>Hayley McFarland as Brooke Putner (season 7; guest season 6), the daughter of a woman also killed in the same auto accident as John Teller</li><li>Marilyn Manson as Ron Tully (season 7), a shot caller in the Aryan Brotherhood who is incarcerated with Juice</li><li>Malcolm-Jamal Warner as 'Sticky' (season 7), the Vice President of the Grim Bastards</li><li>Ivo Nandi as Oscar 'El Oso' Ramos (season 7), the president of the Stockton charter of the Mayans</li><li>Ron Yuan as Ryu Tom (season 7), a member of the Lin Triad</li><li>Brad Carter as Leland Gruen (season 7), a member of the Aryan Brotherhood</li><li>April Grace as Loutreesha Haddem (season 7), the mother of Grant McQueen</li><li>Arjay Smith as Grant McQueen (season 7), the stepson of a pastor indebted to Damon Pope</li><li>Matthew St. Patrick as Moses Cartwright (season 7), a bodyman for August Marks</li><li>Courtney Love as Ms. Harrison (season 7), Abel Teller's Pre-K teacher</li><li>Tony Curran as Gaines (season 7), a member of the Indian Hills charter</li><li>Annabeth Gish as Lieutenant Althea Jarry (season 7), a police lieutenant who comes to Charming</li></ul><br/><h3>Elements</h3><h4>Concept</h4><p>The Sons of Anarchy (SOA) is an outlaw motorcycle club with many charters in the United States as well as overseas. The show focused on the original and founding (\"mother\") charter, Sons of Anarchy Motorcycle Club, Redwood Original, often referred to by the acronym SAMCRO, Sam Crow, or simply \"Redwood\". SAMCRO is located in San Joaquin County, California, in the fictional town of Charming, which appears to be near Stockton. Its nickname is reflected in the original title for the show, Forever Sam Crow. SAMCRO attempts to control and protect Charming through close community relationships, bribery, and violent intimidation. They are vehement about keeping \"hard\" drugs and drug dealers out of Charming; they also attempt to keep the peace between the various racially-divided gangs located in nearby cities.</p><h4>Founders</h4><p>High school friends John Teller and Piermont \"Piney\" Winston co-founded SAMCRO in 1967 upon returning from the Vietnam War. After the birth of John's sons with his wife, Gemma, they settle in her hometown of Charming. Six of the \"Redwood Original 9\" or \"First 9\" members were Vietnam veterans, with only Lenny Janowitz, the club's third member and original Sergeant-at-Arms, alive at the end of the series. The other First 9 included Chico Villanueva, Otto Moran, Wally Grazer, Thomas Whitney, Clay Morrow, and Keith McGee.</p><h4>Attire</h4><p>Club members wear denim or leather vests known as cuts with a three-piece patch on the back that includes the club's name, logo, and territorial location. The SOA logo is a traditional Grim Reaper holding a crystal ball with the anarchist circle-A symbol, and wielding the Reaper's traditional scythe, the handle of which has been replaced by the M16 rifle. Only full members can wear the \"full patch\", and many of them also have it tattooed on their backs or aspects of it on their arms. Other smaller patches, called flashes, have specific meanings, such as \"Men of Mayhem\", which is worn by club members who have spilled blood on the club's behalf; \"First 9\", worn by the original nine members; and rank flashes for the club officers.</p><p>Whenever conducting club business, the members always wear their cuts; one notable exception to this is during the course of season 4, when a number of SAMCRO members are on parole and must cover their cuts in public to avoid identifying as members.</p><p>Female characters—such as Tara, Ima, and Lyla—are seen wearing t-shirts that sport the name Sons of Anarchy or SAMCRO, but nobody outside of the club wears cuts or is seen wearing clothing with the symbol or Reaper image.</p><p>Some of the show's clothing was created by LA company Victorious 22.</p><h4>Motorcycles</h4><p>SAMCRO rides customized Harley-Davidson Dyna motorcycles. Each rider customizes his own bike to his individual style; however, they all paint their bikes black and most sport T-bar style handlebars. A member's bike usually sports graphics such as the Sons of Anarchy letters, the club's Grim Reaper logo, or the circled \"A\" club logo. In later seasons, several members switch to more touring-oriented models. During the final season, Jax refurbishes and rides his father's 1946 Harley-Davidson Customized EL Knucklehead.</p><h4>Activities and affiliates</h4><p>Some members have day jobs in local industries; most work at the Teller-Morrow garage as mechanics and assist at the club's other business ventures, such as running security or accounting at the porn studios. They primarily make money by illegally importing firearms and selling them to various gangs, and making protection runs for local businesses by defending valuable truck shipments against hijacking. During Season 4 they start to mule cocaine for the Galindo cartel in exchange for cash and protection. Throughout the series, they also manage porn studios and an escort business in an attempt to earn legitimately.</p><p>SAMCRO keeps meth traffickers and drug dealers out of Charming, which puts them at odds with the meth-distributing white supremacist Nordics (Nords), headed by Ernest Darby. This earns them respect and admiration from the townspeople, who believe the Sons do more to protect their town than its own police. SAMCRO also has to deal with a rival, Oakland-based motorcycle club Mayans led by Marcus Alvarez. Other groups in SAMCRO's orbit include the Oakland–based Chinese mafia Lin Triad, led by Henry Lin; the Italian American Cacuzza crime family; the Russian mob led by Viktor Putlova; the Real IRA (aka RIRA) of Northern Ireland, which supplies them with illegal Russian-made guns; the \"One-Niners\", an African American street gang to whom SAMCRO sell weapons; and various affiliates in the state prison system, where many members of the club have been incarcerated at one time or another.</p><h4>Properties</h4><p>In the series premiere, the Mayans torch the facility the SAMCRO used for storing and assembling guns, forcing the club to buy land for and build another facility. The Clubhouse is located on the \"compound\" that includes the Teller-Morrow mechanic shop. The Clubhouse itself includes a living area with multiple apartments, a fully operational bar, a pool table, a kitchen; a workout room; and the \"Chapel\", the SAMCRO meeting room with an elaborate redwood conference table that has the club logo carved into the top, where the members meet to discuss club business and vote on major decisions. The club owns a secluded cabin in the woods that is often Piney's retreat, and various warehouses outside of town. The club also rented an old soda fountain/candy shop that is used as the clubhouse in seasons 6 and 7 after the Teller-Morrow shop and original clubhouse were destroyed in an explosion. They also owned the warehouses out of which they ran their porn studios Cara Cara and Red Woody, and Diosa and Diosa Norte, the club's two escort agencies.</p><h4>Shakespearean influence</h4><p>Sons of Anarchy has been called \"Hamlet on Harleys\". Similar to Hamlet, Jax's father was usurped by his father's SAMCRO \"brother\", who then married Jax's mother. There were also intermittent hints at an Oedipal complex between Jax and Gemma, reflecting 20th-century interpretations of the relationship between Hamlet and his mother Queen Gertrude. Jax's murder of the innocent Jury in season 7 mirrors Hamlet's murder of the innocent Polonius in that it ultimately leads to his downfall.</p><p>Sutter has said of the Shakespeare element, \"I don't want to overplay that but it's there. It was Jax's father who started the club, so he's the ghost in the action. You wonder what he would have made of the way it turned out. It's not a version of Hamlet but it's definitely influenced by it.\" Ron Perlman believed they were \"going to stick to the structure of Hamlet all the way to the end (of the series).\"</p><p>Numerous episode titles refer to Hamlet including:</p><ul><li>Season 1, Episode 9, \"Hell Followed\". This refers to Act 1, Scene 4 of Hamlet in which Hamlet follows his father's ghost, unsure of whether he comes from hell.</li><li>Season 4, Episode 12, \"Burnt and Purged Away\". This quote is taken from Act I, Scene 5 of Hamlet, in which the ghost of Hamlet's father explains to Hamlet that he is doomed to suffer in Purgatory until he has paid for all of his sins.</li><li>Season 4, Episodes 13–14, \"To Be, Act 1\" and \"To Be, Act 2\". These refer to the famous To be, or not to be soliloquy.</li><li>Season 5, Episode 11, \"To Thine Own Self\". This quote references Polonius's advice to his son Laertes.</li><li>Season 7, Episode 9, \"What a Piece of Work Is Man\". This refers to Hamlet's What a piece of work is a man speech in Act II, Scene 2.</li><li>Season 7, Episode 11, \"Suits of Woe\". This is from Act 1, Scene 2, \"I have that within which passeth show, these but the trappings and the suits of woe.\"</li></ul><p>In the Season 1 premiere, Gemma is shown cleaning Jax's house, and he notes that she is always cleaning. This behavior, combined with her ambitions and (sometimes murderous) machinations, have prompted some reviewers and commentators to liken her to Lady Macbeth.</p><h4>SAMCRO hierarchy</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"background:#eee;\"><td></td><td valign=\"top\">Season 1</td><td valign=\"top\">Season 2</td><td valign=\"top\">Season 3</td><td valign=\"top\">Season 4</td><td valign=\"top\">Season 5</td><td valign=\"top\">Season 6</td><td valign=\"top\">Season 7</td><td valign=\"top\"><span>Mayans M.C.</span> timeline</td></tr><tr><td style=\"text-align:center; vertical-align:top;\"><i>President</i></td><td colspan=\"4\" style=\"text-align:center; vertical-align:top;\"><i>Clarence \"Clay\" Morrow</i></td><td colspan=\"3\" style=\"text-align:center; vertical-align:top;\"><i>Jackson \"Jax\" Teller</i></td><td style=\"text-align:center; vertical-align:top;\"><i>Filip \"Chibs\" Telford</i></td></tr><tr style=\"text-align:center; vertical-align:top;\"><td><i>Vice President</i></td><td colspan=\"4\"><i>Jackson \"Jax\" Teller</i></td><td><i>Bobby \"Elvis\" Munson</i></td><td colspan=\"2\"><i>Filip \"Chibs\" Telford</i></td><td><i>Alex \"Tig\" Trager</i></td></tr><tr><td style=\"text-align:center; vertical-align:top;\"><i>Sergeant at Arms</i></td><td colspan=\"4\" style=\"text-align:center; vertical-align:top;\"><i>Alex \"Tig\" Trager</i></td><td style=\"text-align:center; vertical-align:top;\"><i>Filip \"Chibs\" Telford</i></td><td colspan=\"3\" style=\"text-align:center; vertical-align:top;\"><i>Happy Lowman</i></td></tr></tbody></table><br/><h3>Production</h3><h4>Crew</h4><p>The series was created by Kurt Sutter. Sutter was also the showrunner, the series' most prolific writer, and a regular director; he directed each season finale. Sutter had previously worked as an executive producer for the FX series The Shield. The Sons of Anarchy's other executive producers are father and son team Art Linson and John Linson; Jim Parriott served as an executive producer and writer for the first season only.</p><p>Paris Barclay joined Sons of Anarchy as an executive producer in the fourth season, after directing episodes in the first and second season. In addition to serving as Executive Producer in the fourth, fifth, and sixth seasons, Barclay directed three episodes each season, including the season 4 and 5 premieres, the top two highest-rated telecasts in the history of FX.</p><p>Jack LoGiudice served as a consulting producer and regular writer for the first season. He became co-executive producer for the second season, then left the series to work on The Walking Dead.</p><p>Dave Erickson also worked as a consulting producer for the first and second seasons, and then took over as co-executive producer for the third season. The series' other regular writers are supervising producer Chris Collins and co-producer Regina Corrado. Shawn Rutherford joined as consulting producer for seasons 6 and 7.</p><p>Sutter drew regular directors from The Shield including Stephen Kay, Gwyneth Horder-Payton, Guy Ferland, and Billy Gierhart.</p><h4>Filming</h4><p>Although Sons of Anarchy is set in Northern California's Central Valley (with some scenes in the Bay Area), it was filmed primarily at Occidental Studios Stage 5A in North Hollywood. Main sets located there included the clubhouse, St. Thomas Hospital, and Jax's house. The production rooms at the studio used by the writing staff doubled as the Charming police station. External scenes were often filmed nearby in Sun Valley, Acton, California, and Tujunga. Interior and exterior scenes set in Northern Ireland during season 3 were also filmed at Occidental Studios and surrounding areas. A second unit shot footage in Northern Ireland used in the third season.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th><th scope=\"col\" rowspan=\"2\" style=\"padding:0 8px\">Viewers<br>(in millions)</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 3, 2008</td><td style=\"padding:0 8px\">November 26, 2008</td><td>2.21</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 8, 2009</td><td style=\"padding:0 8px\">December 1, 2009</td><td>3.67</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 7, 2010</td><td style=\"padding:0 8px\">November 30, 2010</td><td>3.22</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">14</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 6, 2011</td><td style=\"padding:0 8px\">December 6, 2011</td><td>5.45</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 11, 2012</td><td style=\"padding:0 8px\">December 4, 2012</td><td>4.37</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 10, 2013</td><td style=\"padding:0 8px\">December 10, 2013</td><td>7.48</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>7</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 9, 2014</td><td style=\"padding:0 8px\">December 9, 2014</td><td>4.60</td></tr></tbody></table><br/><h3>Reception</h3><h4>Critical reception</h4><p>Sons of Anarchy received very favorable reviews over the course of its run, with many singling out Katey Sagal's performance. On the review aggregator website Metacritic, the first season scored 68/100, the second season scored 86/100, the third season scored 84/100, the fourth season scored 81/100, the fifth season scored 72/100, the sixth season scored 74/100 and the final season scored 68/100.</p><p>In 2013, a collection of essays on the series was published.</p><h4>Season one</h4><p>The first season received positive reviews from industry critics. It scored a 68 on Metacritic, indicating \"generally favorable reviews\". Matthew Gilbert of The Boston Globe said the first season had \"real potential\". The New York Times' Gina Bellafante spoke highly of the cast's acting ability, particularly Sagal's portrayal of Gemma. Brian Lowry of Variety gave a mixed review, admiring Sutter's creation of the club and the town of Charming but observing the early episodes lacked direction.</p><h4>Season two</h4><p>The second season saw a substantial increase in positive reviews. Writing for Chicago Tribune, Maureen Ryan called the second season \"engrossing\". She elaborated that \"the pacing is better the plotting is tighter\" and commends Sagal and Perlman for their performances. Variety's Stuart Levine stated that the new season was \"compelling\"; he also complimented the acting skill of Perlman, Sagal, Hunnam and Siff. James Poniewozik of TIME called Sagal's performance \"devastatingly powerful\" and named the series on his list of Top 10 Shows of 2009. In Alan Sepinwall's 2016 book titled TV (The Book), which he co-wrote with Matt Zoller Seitz, he included the second season of Sons of Anarchy in the section \"A Certain Regard\" where he praised how \"fter working out a few kinks in the first season, Sutter nailed everything in season 2\".</p><h4>Season three</h4><p>Some critics felt the third season was dragged down by the previous season's cliffhanger. James Poniewozik of TIME called the season three premiere \"breathtaking\" and praised Sagal's performance with Holbrook. He later stated that Abel's disappearance helped return the show to its central problem: Jax's allegiance to the club. Entertainment Weekly's Ken Tucker agreed that Holbrook and Sagal's scenes were \"beautiful\". He also commented that the series handled themes of loyalty and family especially well. Maureen Ryan commented that the third season divided critics and fans alike, suggesting the expanded Belfast cast made it harder for the audience to invest in the characters' journeys. Ryan later questioned the credibility of Hector Salazar's story, noting that he was inferior to other villainous characters such as Stahl, Zobelle and Weston. However, she praised Ally Walker's performance, comparing her character to The Shield's Vic Mackey. Critic Alan Sepinwall said the season was \"interesting but uneven\", noting that the plot gained traction in later episodes. Tim Goodman of The Hollywood Reporter said \"Sutter should be applauded for shaking things up\", calling the slower pace a \"creative necessity\".</p><h4>Season four</h4><p>Alan Sepinwall stated that the fourth season risked predictability by returning to a successful formula of storytelling, but he nonetheless preferred those episodes to those of season three. Maureen Ryan reviewed the fourth season positively. She praised the addition of Lincoln Potter (played by Ray McKinnon), comparing the character's quality to that of Breaking Bad's antagonist, Gustavo Fring. The A.V. Club called the fourth season more \"focused\" and \"operatic\". A.V. Club reviewer Zack Handlen was fond of the season but felt disappointed with the finale, saying it featured a \"lousy case of dictated convenience, of an arbitrary and unbelievable reveal used to shift characters around to where the writers want them to be for next season, as opposed to where they might land organically.\" However, the review did praise Charlie Hunnam's performance in the finale. TIME said the fourth season was the strongest since season two, but the show needed to end sooner rather than later. TIME also agreed that the finale's contrivances were sometimes too visible, stating \"it's the principle: you can only turn up alive at your own funeral so many times before it starts to lose its impact.\"</p><h4>Season five</h4><p>Season five received favorable reviews and has a rating of 72 on Metacritic. Ken Tucker of Entertainment Weekly praised the series by calling it a \"richly detailed portrait of self-righteous villainy\".</p><h4>Season six</h4><p>Season six received generally favorable reviews and scored a 74 out of 100 on Metacritic.</p><h4>Season seven</h4><p>Season seven received \"generally favorable reviews\" and scored a 68 out of 100 on Metacritic based on reviews from 6 critics.</p><h4>Ratings</h4><p>The seventh season's premiere on September 9, 2014, received the highest ratings in the series' history. The episode was watched by 6.20 million viewers.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th rowspan=\"2\">Season</th><th rowspan=\"2\">Timeslot (<span>ET</span>)</th><th rowspan=\"2\">Episodes</th><th colspan=\"2\">Premiered</th><th colspan=\"2\">Ended</th><th rowspan=\"2\">Average viewers<br>(in millions)</th></tr><tr style=\"font-size:smaller;\"><td>Date</td><th style=\"width:7%; line-height:100%;\">Premiere viewers<br>(in millions)</th><td>Date</td><th style=\"width:10%; line-height:100%;\">Finale viewers<br>(in millions)</th></tr><tr><td><b><span>Season 1</span></b></td><td>Wednesday 10:00 pm</td><td>13</td><td>September 3, 2008</td><td></td><td>November 26, 2008</td><td>2.21</td><td>2.2</td></tr><tr><td><b><span>Season 2</span></b></td><td rowspan=\"6\">Tuesday 10:00 pm</td><td>13</td><td>September 8, 2009</td><td>4.29</td><td>December 1, 2009</td><td>4.33</td><td></td></tr><tr><td><b><span>Season 3</span></b></td><td>13</td><td>September 7, 2010</td><td>4.13</td><td>November 30, 2010</td><td>3.6</td><td>3.23</td></tr><tr><td><b><span>Season 4</span></b></td><td>14</td><td>September 6, 2011</td><td>4.94</td><td>December 6, 2011</td><td>4.24</td><td></td></tr><tr><td><b><span>Season 5</span></b></td><td>13</td><td>September 11, 2012</td><td>5.37</td><td>December 4, 2012</td><td>4.66</td><td>4.40</td></tr><tr><td><b><span>Season 6</span></b></td><td>13</td><td>September 10, 2013</td><td>5.87</td><td>December 10, 2013</td><td>5.17</td><td>4.60</td></tr><tr><td><b><span>Season 7</span></b></td><td>13</td><td>September 9, 2014</td><td>6.20</td><td>December 9, 2014</td><td>6.40</td><td>4.45</td></tr></tbody></table><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption></caption><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Recipient(s)</th><th>Result</th><th>Ref.</th></tr><tr><td>2009</td><td><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Original Main Title Theme Music</span></td><td>Bob Thiele Jr., Dave Kushner, Curtis Stigers, Kurt Sutter</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"3\">2010</td><td rowspan=\"2\"><span>TCA Awards</span></td><td><span>Outstanding Achievement in Drama</span></td><td><i>Sons of Anarchy</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td><span>Individual Achievement in Drama</span></td><td rowspan=\"2\"><span>Katey Sagal</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Satellite Awards</span></td><td><span>Best Actress – Television Series (Drama)</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"3\">2011</td><td><span>Best Supporting Actor – Series, Miniseries or Television Film</span></td><td><span>Ryan Hurst</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Golden Globe Awards</span></td><td><span class=\"mw-redirect\">Golden Globe Award for Best Actress – Television Series (Drama)</span></td><td rowspan=\"2\"><span>Katey Sagal</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td>Online Film &amp; Television Association Awards</td><td>Best Actress in a Drama Series</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td>2013</td><td><span class=\"mw-redirect\">ASCAP Film and Television Music Awards</span></td><td>Top Television Series</td><td>Dave Kushner, Curtis Stigers, Kurt Sutter, Bob Thiele Jr.</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"3\">2014</td><td><span>Golden Reel Awards</span></td><td>Best Sound Editing - Long Form Sound Effects and Foley in Television</td><td>Erich Gann, Bob Costanza, Mike Dickeson, Billy B. Bell, Tim Chilton, Jill Schachne, Kevin Meltcher</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Original Music and Lyrics</span></td><td>Bob Thiele Jr., Noah Gundersen, Kurt Sutter <small>(for \"A Mother's Work\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Hollywood Music in Media Awards</span></td><td>Outstanding Music Supervision - Television</td><td>Michelle Silverman, Bob Thiele Jr.</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"7\">2015</td><td rowspan=\"2\"><span>Critics' Choice Television Awards</span></td><td><span>Best Actor in a Drama Series</span></td><td><span>Charlie Hunnam</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td><span>Best Guest Performer in a Drama Series</span></td><td><span>Walton Goggins</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Hollywood Makeup Artist and Hair Stylist Guild Awards</span></td><td>Best Contemporary Makeup - Television and New Media Series</td><td>Tracey Anderson, Michelle Garbin, Sabine Roller</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td>Best Special Makeup Effects - Television and New Media Series</td><td>Tracey Anderson, Carlton Coleman, Margie Kaklamanos</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>Primetime Creative Arts Emmy Awards</span></td><td><span>Outstanding Original Music and Lyrics</span></td><td><span>Bob Thiele</span>, <span>Kurt Sutter</span> &amp; <span>The White Buffalo</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\" style=\"text-align:center;\"></td></tr><tr><td>Outstanding Stunt Coordination for a Drama Series, Limited Series or Movie</td><td>Eric Norris</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Makeup for a Single-Camera Series (Non-Prosthetic)</td><td>Tracey Anderson, Michelle Garbin, Sabine Roller, Tami Lane</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><br/><h3>Music</h3><h4>Soundtracks</h4><p>Three EP soundtracks have been released by 20th Century Fox Records, on iTunes, featuring songs from each series. The first five-song EP, entitled Sons of Anarchy: North Country – EP, was released on September 8, 2009, and featured the full version of the Emmy Award nominated theme song \"This Life\". A second five-song EP, entitled Sons of Anarchy: Shelter – EP, was released on November 24, 2009, while a third six-song EP, entitled Sons of Anarchy: The King is Gone - EP, was released on November 23, 2010.</p><p>In November 2011, selected highlights from the EPs and new tracks were released in Songs of Anarchy: Music from Sons of Anarchy Seasons 1–4, followed up by Sons of Anarchy: Songs of Anarchy Vol. 2 released in November 2012, Sons of Anarchy: Songs of Anarchy Vol. 3 released in December 2013, and Sons of Anarchy: Songs of Anarchy Vol. 4 released in February 2015.</p><p>Katey Sagal, who played Gemma Teller Morrow on the show, recorded two songs for the soundtracks.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>Sons of Anarchy: North Country – EP</i></caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:40%\">Title</th><th scope=\"col\" style=\"width:30%\">Writer(s)</th><th scope=\"col\" style=\"width:30%\">Artist</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"<span>This Life</span>\"</td><td><span>Curtis Stigers</span>, <span>Dave Kushner</span>, <span>Bob Thiele Jr.</span>, <span>Kurt Sutter</span></td><td>Curtis Stigers &amp; <span>The Forest Rangers</span></td><td class=\"tracklist-length\">2:22</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"<span>Slip Kid</span>\"</td><td><span>Pete Townshend</span></td><td><span>Anvil</span> and <span>Franky Perez</span></td><td class=\"tracklist-length\">3:49</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"<span>John the Revelator</span>\"</td><td>Traditional</td><td><span>Curtis Stigers</span> &amp; <span>The Forest Rangers</span></td><td class=\"tracklist-length\">5:34</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"<span>Forever Young</span>\"</td><td><span>Bob Dylan</span></td><td><span>Audra Mae</span> &amp; <span>The Forest Rangers</span></td><td class=\"tracklist-length\">3:13</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"<span>Girl from the North Country</span>\"</td><td>Dylan</td><td><span>Lions</span></td><td class=\"tracklist-length\">4:11</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>Sons of Anarchy: Shelter – EP</i></caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:40%\">Title</th><th scope=\"col\" style=\"width:30%\">Writer(s)</th><th scope=\"col\" style=\"width:30%\">Artist</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"<span>Ruby Tuesday</span>\"</td><td><span class=\"mw-redirect\">Jagger/Richards</span></td><td><span>Katey Sagal</span></td><td class=\"tracklist-length\">3:23</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"<span class=\"mw-redirect\">Fortunate Son</span>\"</td><td><span>John Fogerty</span></td><td><span>Lyle Workman</span> &amp; <span>The Forest Rangers</span></td><td class=\"tracklist-length\">3:26</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"<span>Someday Never Comes</span>\"</td><td>Fogerty</td><td>Billy Valentine &amp; <span>The Forest Rangers</span></td><td class=\"tracklist-length\">4:06</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"Burn This Town\"</td><td>Matt Drenik</td><td><span>Battleme</span></td><td class=\"tracklist-length\">3:13</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"<span>Gimme Shelter</span>\"</td><td>Jagger/Richards</td><td><span>Paul Brady</span> &amp; <span>The Forest Rangers</span></td><td class=\"tracklist-length\">4:53</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>Sons of Anarchy: The King is Gone - EP</i></caption><tbody><tr><th class=\"tracklist-number-header\" scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"width:40%\">Title</th><th scope=\"col\" style=\"width:30%\">Writer(s)</th><th scope=\"col\" style=\"width:30%\">Artist</th><th class=\"tracklist-length-header\" scope=\"col\">Length</th></tr><tr><th id=\"track1\" scope=\"row\">1.</th><td>\"<span>No Milk Today</span>\"</td><td><span>Graham Gouldman</span></td><td>Joshua James &amp; <span>The Forest Rangers</span></td><td class=\"tracklist-length\">4:01</td></tr><tr><th id=\"track2\" scope=\"row\">2.</th><td>\"<span>Bird on the Wire</span>\"</td><td><span>Leonard Cohen</span></td><td><span>Katey Sagal</span> &amp; <span>The Forest Rangers</span></td><td class=\"tracklist-length\">5:05</td></tr><tr><th id=\"track3\" scope=\"row\">3.</th><td>\"<span>Travelin' Band</span>\"</td><td>Fogerty</td><td><span>Curtis Stigers</span> &amp; <span>The Forest Rangers</span></td><td class=\"tracklist-length\">2:18</td></tr><tr><th id=\"track4\" scope=\"row\">4.</th><td>\"<span>Miles Away</span>\"</td><td>Paul Taylor</td><td><span>The Forest Rangers</span> feat. <span>Battleme</span> &amp; <span>Slash</span></td><td class=\"tracklist-length\">4:49</td></tr><tr><th id=\"track5\" scope=\"row\">5.</th><td>\"<span>Hey Hey, My My</span>\"</td><td><span>Neil Young</span>, Jeff Blackburn</td><td><span>Battleme</span></td><td class=\"tracklist-length\">2:52</td></tr><tr><th id=\"track6\" scope=\"row\">6.</th><td>\"This Life\" (Celtic Remix)</td><td>Stigers, Kushner, Thiele Jr., Sutter</td><td><span>Curtis Stigers</span> &amp; <span>The Forest Rangers</span></td><td class=\"tracklist-length\">0:39</td></tr></tbody></table><br/><h3>Other media</h3><h4>Comic book</h4><p>In 2013, Boom! Studios began publishing a Sons of Anarchy comic book. As of September 2015, 25 issues have been published. Issue 25 is the final issue. A new comic book prequel, Sons of Anarchy: Redwood Original, was released on August 3, 2016.</p><p>The comic series were published as Legacy Edition Collections as well: Sons of Anarchy Legacy Edition Book One, Sons of Anarchy Legacy Edition Book Two, Sons of Anarchy Legacy Edition Book Three.</p><h4>Novel series</h4><p>Sons of Anarchy: Bratva, the first in a planned series of SOA novels to be written by Christopher Golden, was published in 2014.</p><h4>Potential prequel</h4><p>A prequel series, detailing the origin of the club, is planned. Sutter stated in an August 2014 interview that the prequel would focus on the \"First 9\" members of the club and be set around the time of the Vietnam War. He added that the prequel would likely consist of a miniseries or \"maybe 10 episodes or two 8 episodes seasons\". At the conclusion of the prequel, Sutter plans to release John Teller's manuscript, titled The Life and Death of SAMCRO. However, the prequel is in limbo after some problems between Sutter and Disney arose. Sutter was quoted saying that the possibility of making the First 9 \"doesn't look that hopeful\" since he was fired from FX and the studio owns Sons of Anarchy.</p><h4>Sons of Anarchy: The Prospect</h4><p>Sons of Anarchy: The Prospect was an episodic adventure video game developed by Silverback Games and published by Orpheus Interactive. The game was originally slated to have ten episodes and to be released on Microsoft Windows, OS X, iOS, and Android. The first episode was released on February 1, 2015, for iOS only, and was met with mixed reviews. It has not seen an update since, and, although a season pass is being offered, no further episode was ever released. On April 7, 2016, refunds were issued to everyone who purchased the game or the season pass, and the game had been removed from the App Store.</p><p>Despite the apparent cancellation and refunds, the game's publisher has not officially said anything about the development state of the nine unreleased episodes. Silverback Games has distanced themselves from the project, claiming to be \"just a consultant\" and having no knowledge of the state of the game or of Orpheus Interactive.</p><h4>Spin-off</h4><p>As of May 11, 2016, a spin-off series was in the works titled Mayans M.C.. The pilot began shooting in March 2017, directed by Sutter from a script he co-wrote with Elgin James.</p><p>Mayans M.C. takes place two and a half years after the events of Sons of Anarchy and is set hundreds of miles away in the fictional California border town of Santo Padre. The series focuses on the struggles of Ezekiel \"EZ\" Reyes (portrayed by J. D. Pardo), a prospect in Mayans Motorcycle Club charter based on the U.S.-Mexico border who eventually works his way up to president of the chapter. EZ is the gifted son of a proud Mexican family, whose American dream was snuffed out by cartel violence. On February 13, 2017, Edward James Olmos was attached to star as EZ's father Felipe Reyes, the family's once strong Mexican patriarch. Several aspects from Sons of Anarchy are included in the show, including the Sons of Anarchy themselves, as well as the Galindo Cartel, who plays a larger role in the series. The series features appearances from characters from Sons of Anarchy, including Marcus Álvarez (Emilio Rivera), Happy Lowman (David Labrava), an uncredited appearance in the pilot from Katey Sagal portraying Gemma Teller, Lincoln Potter (Ray McKinnon), among a few others.</p><p>On January 5, 2018, FX picked up the series with an order of 10 episodes, which premiered on September 4, 2018. On October 1, 2018, it was announced that FX had renewed the series for a second season.</p><p>Season 4 premiered on April 19, 2022. Season 5 was confirmed and renewed by FX in July 2022.</p><br/><h3>Broadcast</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>needs additional citations for <span>verification</span></b>.<span class=\"hide-when-compact\"> Please help <span class=\"external text\">improve this article</span> by <span>adding citations to reliable sources</span> in this section. Unsourced material may be challenged and removed.</span>  <span class=\"date-container\"><i>(<span class=\"date\">September 2017</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><p>Sons of Anarchy premiered in Australia, on the Showcase in 2009. In New Zealand, it appeared on TV3 on October 20, 2010, and, it has been announced, it is moving to the Box. In the UK, the show premiered on Bravo in 2009, but the channel only showed the first 2 series before it closed in 2011. It aired in its entirety on Spike in 2015. In the Republic of Ireland, the show aired on RTÉ Two from 2009. In Canada, it premiered on Super Channel on October 20, 2008. In India, season 6 began airing on Star World Premiere on September 26, 2013.</p><p>In 2018, Universo announced an October 29, 2018, premiere of Sons of Anarchy season 3 in Spanish. The show was made available on Netflix in 2011, but all seasons were removed from Netflix on December 1, 2018.</p><p>As of 2021, the show is available to watch in some countries on Disney+'s Star section and available on Hulu.</p><p>The show also reran on AT&T's now defunct Audience Network.</p><br/>"
  },
  "errorMessage": ""
}