{
  "imDbId": "tt8111088",
  "title": "The Mandalorian",
  "fullTitle": "The Mandalorian (TV Series 2019– )",
  "type": "TVSeries",
  "year": "2019",
  "items": [
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw9025355",
      "warningSpoilers": false,
      "date": "30 April 2023",
      "rate": "9",
      "helpful": "52 out of 55 found this helpful.",
      "title": "Best thing SW since the original trilogy",
      "content": "I finally watched The Mandalorian after putting it off for so long and I absolutely loved it! I don't consider myself to be a huge Star Wars superfan like some of these other fans out there but I am a regular fan that really enjoys watching the movies. I even didn't mind the latest trilogy, Rogue One and Solo more than most but The Mandalorian is without a doubt the best thing Star Wars related since the original trilogy! Jon Favreau is mostly known as an actor but he's also such an underrated Director, he's done some amazing movies (Iron Man, Iron Man 2, Elf, Swingers, Made, Cowboys & Aliens, The Jungle Book, etc.). I've really enjoyed it and can't wait for more to come."
    },
    {
      "username": "quiqueperezsoler",
      "userUrl": "https://www.imdb.com/user/ur80500138",
      "reviewLink": "https://www.imdb.com/review/rw6226477",
      "warningSpoilers": false,
      "date": "1 November 2020",
      "rate": "9",
      "helpful": "623 out of 721 found this helpful.",
      "title": "This is the RIGHT way. The subtle difference between \"reproducing\" Star Wars and \"recapturing\" Star Wars. Why The Mandalorian gets Star Wars right",
      "content": "It's one thing to bring back elements, characters, settings and stories, and to flash them in front of the audience to cash in on the nostalgia and/or recognisable memorabilia but without using it to further the plot and other to do exactly the opposite. It was about time that Star Wars directives understood that it is too unique a product to be lend to corporate filmmakers. Star Wars needs to be understood and its uniqueness has to be acknowledged in order to make the new stories feel like they belong. This may sound too obvious but if you ever wondered why the new SW movies are so controversial this may be the reason.Like with \"Spider-Man: Into the Spider-verse (2018)\" and their comicbook-industry experts participation, the creators behind The Mandalorian were experts of the industry, connoisseurs of the Star Wars Universe and even long time fans. So they were able to not only recapture the aesthetic of the grimy, battered Star Wars but also build upon it taking the most \"subtle\" things into account. Things like the predominancy of puppets and practical effects over CGI, settings you can feel and touch over green screens and the abundancy of not only known elements previously seen in Star Wars, but a whole batch of new creatures, designs and overall plot elements that felt like they belong to this universe and had always been there.Exceeding expectations are not only the visual aspects but the narrative too. It might be too late for some story elements now, but it is of great importance that from now on you try to watch the unraveling of the story unspoiled. I was lucky to have seen the premiere of the show before the \"memefication\" of a certain \"element\" that went viral and became one of the biggest highlights of the show. But for me I saw the reveal of this element unspoiled and I was pleasantly shocked, a memory I'll always carry with me. The ability of these creators to generate such shock value and deep moments it's often baffling to me. This is proof that the creators behind the narrative are fully aware of the complexities of the universe they are tampering with and like an experienced surgeon, they are able to tweak, traverse and call back any Star Wars element as they please and with astonishing results.It seems to be obvious that series creator Jon Favreau turns to gold everything he touches, from his influence in the MCU with the first Iron Man (2008) movie (still regarded today as a favorite among the infinite Marvel movies) to the remarkable and commercially successful live-action Jungle Book and Lion King Disney movies. He seems to understand how to treat a franchise not by exploiting the nostalgia aspects but rather use them to fuel new stories and \"revive\" the experience. Not to mention the contributors to this amazing show hype up the expectations and the quality of the show, from beloved names like Taika Watiti to legendary Star Wars showrunner Dave Filoni. The show today is in the most capable hands possible and away from the corporate meddling of Kathleen Kennedy.Despite everything it does right, I have found some things that distanced me from it. It is merely one small and almost inevitable aspect I don't think a huge lore such as Star Wars can escape from. Something that makes the world-building so real: the subtle callbacks and references found on names and other elements. This is an aspect that non-Star Wars Lore fans (in which I have to identify myself as even though I have read and know some of the deeper lore) will not like or get as they are cast aside for not picking up or straight up know these references. If people don't know what a Gungan is they won't get the \"you are as ugly as a Gungan\" joke, for instance. But as for the rest, the story can be followed and understood because it feels self-contained and you don't need to know much about the SW status quo at the time other than (in simplified terms) an Empire ruled over the galaxy and now it's over, in this world there are mercenaries that adhere to a code among themselves, there's a magical energy flowing through all of us called The Force, there's a group of Force-wielding knights that fight with light swords, and that's about it. Anything else you need to know it is presented in the story or explained through exposition, which in a huge universe that is Star Wars it is a must in order to be able to tell a story worthy of SW. As for the show itself, these are some of the most predominant reasons why The Mandalorian gets Star Wars right (reasons I believe stand out among many others the show has) -- WARNING: MILD MILD SPOILERS AHEAD OF SEASON 1:The treatment of the Force -- long gone were the days when the Force had nothing new to teach us. It seemed we have seen it all and had witness it being reduced to a \"superpower\" the Jedis use to move objects. But perhaps the biggest aspect that seemed to bring controversy is the treatment of the force as this quantifiable and immutable force presented in the Prequels. However, the most successful Star Wars stories have not treated it as such, despite the fact that this new addition was provided by its own creator, George Lucas; in fact, the most successful Star Wars stories have expanded on the capabilities of the force still considering it a mystifying and intangible energy that lives in all of us and the binds the universe together. The Mandalorian takes place post Empire, which means the force has started to be known across the galaxy thanks to the Legend of Luke Skywalker, auguring the return of the Jedi Knights. Therefore, treating the force used by the so-called \"baby yoda\" as a powerful and non-understanding power but in fact recognised by some who have heard of it is a genius move as it makes it magical and uncharted still, a long lost ethereal power that exists beyond our comprehension. The force should be something we don't fully understand yet nor people in universe will fully understand either. By allowing the force to be pure and uncharted, there's room for more creative uses of it that when done right can provide of elevated moments. This are shown especially on episodes 7 and 8 of season 1 where by using terms like \"a group of sorcerers called Jedi\", \"I have heard of this power\" and \"i have seen him move things with its mind\" makes the force more mystified and bewildering.The puppets -- say whatever you want about the incredible alien, prop and set designs of other Star Wars main stream media (TV shows, video games, movies with some really good exceptions of course) but I am one to believe that generally the main reason why none of the later Star Wars media released after the OT were really embraced by everyone as part of the universe is because the \"feel\" of the world we were seeing was not the same. Star Wars stood out from sci-fi like Star Trek and other more \"clean and smooth\" worlds by building a grimy, run-down and almost post-apocalyptic set and prop design with a huge contrast of advanced technology. So when The Mandalorian brought it back, not only by imitating the set and character designs and such but by expanding upon those by using new imagery and creating new alien species that fit with that new world, it was a display of world-understanding beyond any new incorporations Abrams, Johnson and even good ol' George Lucas had ever brought post-OT. By bringing back puppets and practical effects and make up it shows and it gives you the satisfaction of knowing in 30 years it will still hold up because they are physical things, tangible by the actors and even though \"baby yoda\" moves and when grabbed looks like a sack of potatoes, you don't mind because you know it exists, it is there, you can hold it. I'll take your fully-functioning puppet over the best CGI because truth is, in some years, the CGI will have improved so much you'll start to see the cracks when looking back.Cinematic Special Effects for a TV show -- this may be known for those who keep up with Star Wars news or watch the Mandalorian documentaries in Disney+, but the innovative tech used for the background and other special effects is almost revolutionary and provides a high quality that resembles that of a cinematic film. Needless to say, the special effects, real-model sets design and other props allows the universe to exist and be tangible instead of rendering a scene that with tim we'll notice it doesn't really existEND OF SPOILERY STUFF --IN CONCLUSION, The Mandalorian is a worthy sequel to the OT, maintaining the same aesthetic, themes and recognisable elements but providing new and incredible ideas that amount to the incredible universe that is Star Wars. If they are able to keep it up it'll become one of the best SW media to come in its history. Disney Star Wars seems to know what it's doing now after stumbling a couple of time and I commend them for it. SW isn't an easy franchise to expand and continue despite the amount of stories that are left to be told. You know the saying \"Nobody hates Star Wars more than Star Wars fans\". But I praise the work done by everyone involved...... This is the way."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw9025388",
      "warningSpoilers": false,
      "date": "30 April 2023",
      "rate": "9",
      "helpful": "49 out of 53 found this helpful.",
      "title": "Lives up to all the hype!",
      "content": "The Mandalorian is every bit as good as everyone says it is. It's easily the best thing Star Wars has done since the original trilogy. Every episode of every season has been good so far. Jon Favreau definitely hit a home run with this. The Mandalorian is about a lone gunfighter who makes his way through the galaxy after the fall of the empire. He then comes across a baby Yoda who he pretty much adopts and brings along through all these adventures. This is the show every Star Wars fan has been waiting for. It just goes to show that they can still make good content when they want. Every episode is action packed. It will hook you from the beginning and you'll want to binge it a fast as possible. It's a must watch for any Star Wars fan."
    },
    {
      "username": "poseyfan",
      "userUrl": "https://www.imdb.com/user/ur83316413",
      "reviewLink": "https://www.imdb.com/review/rw9009395",
      "warningSpoilers": false,
      "date": "22 April 2023",
      "rate": "7",
      "helpful": "61 out of 67 found this helpful.",
      "title": "Seasons 1 and 2 are good Star Wars. Season 3 fell victim to the writing plague that befell Kenobi and BOBF.",
      "content": "Here's my updated review after the conclusion of season 3.Season 3 was mediocre in my opinion. I think my outlook on Star Wars projects has changed since I watched Andor. Ost things have paled in comparison to the magnificence of that show.Seasons 1 and 2 weren't perfect by any stretch of the imagination, but they were still very entertaining. The latter was entertaining as well, but I probably won't ever watch the episodes again because they aren't too groundbreaking.Season 1 was a mostly down to earth weekly bounty hunter show. It was a solid start.Season 2 had some cool cameos that mostly worked for the progression. It was great.Season 3 saw a great fall in quality. It was disjointed and flawed. Not terrible, but disappointing.If there is a season 4 I hope it can give us a compelling finish. M."
    },
    {
      "username": "ThomDerd",
      "userUrl": "https://www.imdb.com/user/ur73053202",
      "reviewLink": "https://www.imdb.com/review/rw6383255",
      "warningSpoilers": false,
      "date": "20 December 2020",
      "rate": "10",
      "helpful": "311 out of 368 found this helpful.",
      "title": "Excellent! And I m not even a star wars fan...",
      "content": "Jon Favreau did a fantastic job here. Beautiful and well crafted series that binds nicely in the star wars story and gives more depth to it. 10/10 Highly recommended."
    },
    {
      "username": "DarthWalker-34381",
      "userUrl": "https://www.imdb.com/user/ur62118896",
      "reviewLink": "https://www.imdb.com/review/rw9027486",
      "warningSpoilers": false,
      "date": "1 May 2023",
      "rate": "9",
      "helpful": "29 out of 33 found this helpful.",
      "title": "The Mandalorian",
      "content": "\"The Mandalorian\" is a commendable sci-fi series, but it's not quite a Jedi (or a perfect 10) yet. As a heads-up to new viewers, some of the show's stand-alone episodes can feel uneventful and lack the same impact as the overarching story arc. That said, I do believe that most of these episodes help to develop our lead hero, albeit subtly. Additionally, some of the supporting characters are not given enough depth, leaving viewers wanting more from their narrative. Despite these criticisms, the show's exceptional production quality and skillful Western sci-fi storytelling create a captivating experience. Notable performances by Pedro Pascal, Katee Sackhoff, and Emily Swallow, are some of the strongest aspects of the series, adding layers and interest. And of course, the lighter moments provided by Grogu, along with many of the droids and aliens, all contribute to the show's mass appeal.Bottom line: The central characters, impressive visual effects, and meticulous attention to detail all help make this show fantastic. While I suspect that only die-hard Star Wars fans would stick with this show, I find it entertaining and will keep coming back for more. This is the way!"
    },
    {
      "username": "Her-Excellency",
      "userUrl": "https://www.imdb.com/user/ur67432377",
      "reviewLink": "https://www.imdb.com/review/rw5273749",
      "warningSpoilers": false,
      "date": "22 November 2019",
      "rate": "10",
      "helpful": "385 out of 522 found this helpful.",
      "title": "Cowboy in a Galaxy Far, Far Away = Pure Magic",
      "content": "The Mandalorian (so far) has everything anyone could ask for. It is SO well-crafted, I have yet to see one flaw in it.Pedro Pascal (is it really him under that mask 100% of the time?) is fantastic as the imperturbable, or so it would seem, outer-space tough guy bounty hunter with a soft, heart-of-gold, and a helmet that into the third episode, still does not budge. We know it's coming though, don't we, and waiting, is a small fraction of the fun. At least it is for me.While it is somewhat on the side of slow-paced vs. fast-paced, in my opinion that just adds to the appeal. You can savor the onscreen antics, action and dialogue, while knowing more is coming. Actually, you find it kind of exquisite in its pacing. I literally dare you to look away. Not because you think you'll miss anything, but because even at its steady pace, you won't want to. Speaking of which, the visuals are quite impressive. The entire thing IS a Lucas Star Wars landscape. At no time can anyone see a 1-minute clip of The Manadalorian without knowing immediately that it belongs to the Star Wars universe. The twist, is that thrown into this universe now, is this strong proverbial cowboy of few words, who carries a big stick.I'm a fan, and can hardly wait for more episodes."
    },
    {
      "username": "jonahe123",
      "userUrl": "https://www.imdb.com/user/ur34306940",
      "reviewLink": "https://www.imdb.com/review/rw5252671",
      "warningSpoilers": false,
      "date": "12 November 2019",
      "rate": "10",
      "helpful": "1,737 out of 2,037 found this helpful.",
      "title": "The vibe is finally right",
      "content": "This is the Star Wars atmosphere and feeling I've been waiting for. No dumb humor, cool characters, and a story I can take seriously. I'm a big fan of what they've done with this series so far and current Star Wars filmmakers need to take notes. The cinematography is amazing. You can tell they use practicality as much as possible and CGI is used only for the obvious like spaceships and creatures etc. It's a truly remarkable balance of old and new."
    },
    {
      "username": "vincentvino",
      "userUrl": "https://www.imdb.com/user/ur17974339",
      "reviewLink": "https://www.imdb.com/review/rw6353496",
      "warningSpoilers": false,
      "date": "10 December 2020",
      "rate": "9",
      "helpful": "607 out of 711 found this helpful.",
      "title": "Best Star Wars since the original trilogy.",
      "content": "Jon Favreau should be in charge of all future Star Wars projects. It's exactly how it should be. I will not give 10 stars because nothing is perfect but this is very very close. Hats off!"
    },
    {
      "username": "paul_haakonsen",
      "userUrl": "https://www.imdb.com/user/ur22654354",
      "reviewLink": "https://www.imdb.com/review/rw5431275",
      "warningSpoilers": false,
      "date": "23 January 2020",
      "rate": "10",
      "helpful": "86 out of 116 found this helpful.",
      "title": "Simply phenomenal...",
      "content": "Right, well yeah, I grew up on \"Star Wars\" and have been loving it ever since \"Star Wars Episode 4: A New Hope\", and I am still loving it today. So when \"The Mandalorian\" was announced, I was thrilled.And now having sat through the entire first season, I must say that I am impressed and I am entertained, and I am enjoying this tremendously. Creator Jon Favreau is definitely on to something here with this series; something that is as close to the original trilogy as it can be. And man, this is phenomenal.The storyline is interesting and has a good variety to it, so there is something for everybody, ranging from classic \"Star Wars\" action in terms of duels, gunfights, space combat, and such - you know what I mean here.And \"The Mandalorian\" offers a nice insight into the term of being a Mandalorian, as they have been fairly poorly portrayed for the average public and casual viewers, anyone not well-traversed in the universe of \"Star Wars\". I mean, this show made one of my friends come up and say to me, 'I thought Mandalorians were evil, but it is a way of living, a mentality, a creed'.The special effects in this TV series is good, but as if there ever were any doubts with Lucasfilm and Disney being behind the project. And it has that classic \"Star Wars\" feel to it, but with an added multiple layers. They managed to make it a tad more gritty and also have that classic Western feel to it. And it works marvelously in favor of the series.As for the main character, the Mandalorian, aka Dyn Jarren, well he is interesting, and there are some really nice qualities and touches to the character, and I must say that Pedro Pascal portrays the helmet main character quite well. While he is the main character, there is no doubt about the fact that the child - as the public dubbed 'baby Yoda' - has stolen the show. And what is not to like? He is so awesome, cute and he wields The Force. I liked the child from the very first time we saw him on the screen, and with each episode my liking has just grown and grown.\"The Mandalorian\" plays on all the right buttons for a fan of the \"Star Wars\" universe, especially when they brought stormtroopers, scout troopers, death troopers and the TIE fighter into the series. That just felt right; it felt like coming home.Now, the series is not carried by Pedro Pascal alone, there are some nice acting performances by the likes of Carl Weathers, Werner Herzog, Gina Carano and Nick Nolte, to mention the most prominent of performers. They have a great cast, and people perform quite well, bringing the characters to life in this rich and vibrant universe.The props and costumes are spot on, and there are so many amazing details in every episode. This helped bring the \"Star Wars\" universe out on the screen in such a great way.I have seen every episode three or four times; the first time around for the storyline, then going back to watch it for the details. Plus, I must admit that the show is entertaining enough to support multiple viewings.This is certain winner for the \"Star Wars\" universe, and it was a much needed addition to the franchise. I am rating it a solid ten out of ten stars."
    },
    {
      "username": "MarkoutTV",
      "userUrl": "https://www.imdb.com/user/ur35476777",
      "reviewLink": "https://www.imdb.com/review/rw5252041",
      "warningSpoilers": false,
      "date": "12 November 2019",
      "rate": "9",
      "helpful": "602 out of 810 found this helpful.",
      "title": "So far so good",
      "content": "I like that they gave the Mandalorian some personality, some good vistas and action setpieces, solid comedy, fun little additions to the Star Wars canon (bounty droids are officially awesome) and a general sense of adventure that I dig. It's all very small and big at the same time. All good stuff and I hope they can keep it up.I especially appreciate the fact they employed the services of Carl Weathers"
    },
    {
      "username": "xraymediapnv",
      "userUrl": "https://www.imdb.com/user/ur165209337",
      "reviewLink": "https://www.imdb.com/review/rw9040120",
      "warningSpoilers": true,
      "date": "7 May 2023",
      "rate": "9",
      "helpful": "28 out of 30 found this helpful.",
      "title": "The Mandalorian- A Star Wars show for all types of fans",
      "content": "I think the Mandalorian series has brought a lot to the Star Wars Universe. Jon Favreau and Dave Filoni have listened to fans and have payed homage to both the canon universe and fans love of the extended universe. I think the latest season of this show has definitely brought things full circle, bringing in elements and characters from the Clone Wars and Rebels, while also making sure to make it understandable to viewers who have yet to see the other shows. There are Easter eggs throughout the show, that entice all levels of true Star Wars Fans. The effects in the show are really good for the most part. The LED screen setup used to shoot the show has allowed the creators to take us into vast worlds and light the scene as if the characters were actually there. There are scenes, such as those showing the characters flying through Coruscant in season three, where you can see the limitations of using this technology versus on-set filming, such as seen in Andor. Overall, I think this show has a strong story, and is helping to fill in the holes of the story that the sequel trilogy (episode 5, 6, and 7) created. The pacing of the show feels better in season three as well, not making it feel as fast paced as some parts of the first two seasons felt."
    },
    {
      "username": "bololsyahputra",
      "userUrl": "https://www.imdb.com/user/ur155172858",
      "reviewLink": "https://www.imdb.com/review/rw9062828",
      "warningSpoilers": false,
      "date": "18 May 2023",
      "rate": "8",
      "helpful": "23 out of 25 found this helpful.",
      "title": "Went from good to excellent ended up with mediocre",
      "content": "In the first season and second season we all know what is Mando doing, what is he doing in a planet and what is his goal. It makes the episodes look much sense. But sadly it isnt the case on the third season. The goal change and some of the story not clear.The characters are ok, Mando isn't a perfect but not bad either, Grogu is entertaining, another characters are just fine, no one either really good or down bad.The fighting scene is kind of weird and lame, just to say im not a fans of Star wars live action \"fighting scene\".Overall this series is good and recommended to watch, as i say the characters are good, the story is really good in the first and second season, goes to confusing in the third one, the fighting/action scene is kinda bad and if you searching for some moral value, you got into the wrong place."
    },
    {
      "username": "marshalllangdon",
      "userUrl": "https://www.imdb.com/user/ur163997524",
      "reviewLink": "https://www.imdb.com/review/rw9024440",
      "warningSpoilers": false,
      "date": "30 April 2023",
      "rate": "9",
      "helpful": "24 out of 26 found this helpful.",
      "title": "The best Star Wars show",
      "content": "The Mandalorian is one of the best pieces of Star Wars media to come out in recent times, and is straight up an amazing show in its own right, let alone a Star Wars show.While I will admit that I found Season 3 to be a lot weaker than 1 & 2, overall the show is still an enjoyable, fun and exciting entry into the Star Wars saga.Season 1 gives us everything that we love about Star Wars. It introduces us to memorable characters, beautiful and intriguing locations, stunning visual effects and fun action sequences. It also expands the Star Wars lore, and really shows just how vast the galaxy far, far away can be.Season 2 ups the scale, and continues the journey started in the previous season, only with some familiar faces that die-hard franchise fans will recognize from other Star Wars media, but are introduced in a way that makes them interesting for a newcomer as well. And the finale is one of the most incredible and emotional experiences ever released on TV, Star Wars or not.Season 3 drops in quality for me, but still has the charm and adventure that we've come to expect from the series. It's reliance on viewers familiarity with other shows may come at the expense of the more casual viewer however. Also, make sure to watch The Book of Boba Fett before diving into season 3. Or at least the last 3 episodes.Anyway, The Mandalorian has proved that it can entertain and excite us as much as the original trilogy did back in the day. It's expansion of the Star Wars galaxy makes it a fun ride for anyone who enjoys a good action, adventure series, with some sci-fi and fantasy elements to it.9/10 - Amazing."
    },
    {
      "username": "deloudelouvain",
      "userUrl": "https://www.imdb.com/user/ur58525162",
      "reviewLink": "https://www.imdb.com/review/rw5622071",
      "warningSpoilers": false,
      "date": "9 April 2020",
      "rate": "9",
      "helpful": "55 out of 77 found this helpful.",
      "title": "The best of the whole Star Wars saga if you ask me.",
      "content": "After so many years of postponing I finally decided to watch all the Star Wars movies and so also this series. Since there are different ways to watch it I'm going for the chronological order and not the release date order, that just makes more sense to me. Maybe I watched a couple movies when I was young, I probably did, but I don't remember anything about it so to me it's all new and maybe one day I will understand the whole hype about the Star Wars saga. After watching The Phantom Menace, Attack Of The Clones, Revenge Of The Sith, Solo: A Star Wars Story, Rogue One, A New Hope, The Empire Strikes Back and Return Of The Jedi it's now time for The Mandalorian. It's supposed to be happening between Return Of The Jedi and The Force Awakens so it's only logical I watch it now. I do hope there will be much more seasons though as I just loved this show. Pedro Pascal is perfect as The Mandalorian. Each episode is quite short but very enjoyable to watch, certainly if you just watched all the other movies just before. It's a nice continuation of this saga. You can write whatever you want about the early movies in this saga, but the modern ones just beat them in everything, quality, acting, and technology, as so does this series. I binge watched the first season in 24 hours that's how good I thought it was. Next will be The Force Awakens but to be honest I can't wait to watch other seasons from The Mandalorian as it's for me the best thing in the whole Star Wars saga thus far."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw7473846",
      "warningSpoilers": true,
      "date": "23 October 2021",
      "rate": "10",
      "helpful": "59 out of 84 found this helpful.",
      "title": "\"So what happens if you take that thing off?\" - Cara Dune to The Mandalorian - Ep. #1.4",
      "content": "This was a well executed return to the origins of the Star Wars saga beginning with 'A New Hope'. I was thrilled to see characters and locales that reminded me of Alderaan and Tatooine, along with the space vessels that were a throwback to the ones in the first Star Wars trilogy. I don't recall the term 'Mandalorian' ever being mentioned in connection with the New Republic or the Empire before; if so then I missed it. The back story we get here of the Mandalorian (Pedro Pascal) and his Creed gives rise to a credible tale of how he came into possession of The Kid, and how his mission becomes one to reunite Grogu with a Jedi Master. One thing I was always fascinated by in the Star Wars lexicon was the names given to particular characters and how well they fit their personalities. Here, in addition to Mando, we have Greef Karga (Carl Weathers), Cara Dune (Gina Carano), Fennec Shand (Ming-Na Wen), Peli Motto (Amy Sedaris), and Moff Gideon (Giancarlo Esposito) among others. One of my favorites with only a one episode appearance was The Marshall, Cobb Vanth, portrayed by Timothy Oliphant. As the second season entered it's latter half, it was exciting to hear the name of Boba Fett (Temuera Morrison) once again, while seeing him team with Mando. The icing on the cake of course is the reuniting of baby Yoda Grugo with Luke Skywalker (Mark Hamill), who will train him in the ways of the Jedi. I thought this was just a very cool series for old time Star Wars fans like myself who weren't all that thrilled with the prequels and sequels. I guess if there's a good way to describe it, it would be 'This is the Way'."
    },
    {
      "username": "timurtaimur",
      "userUrl": "https://www.imdb.com/user/ur126349800",
      "reviewLink": "https://www.imdb.com/review/rw9028538",
      "warningSpoilers": false,
      "date": "2 May 2023",
      "rate": "8",
      "helpful": "18 out of 21 found this helpful.",
      "title": "First two seasons were great. The third was hit and miss",
      "content": "This is a phenomenal sci-if western at a push with some incredible Star Wars action and keeping in tune with the universe.Pedro Pascal is an excellent choice and the action, stories and direction are first rate. One thing I love about this show is that the producers are happy to retain animatronics, puppetry and practical effects with minimal CGI.I thought the casting for the non helmet wearing mandalorians was poor. They all came across like amateur dramatics and the extras in the show (which are equally as important for atmosphere), were poorly cast. The first and second seasons are amazing but the third was a lacklustre effort with jumping storylines and sometimes appearances that didn't need to happen.I hope they cast their extras better and the story gets the treatment the first two seasons got."
    },
    {
      "username": "nerdgasms",
      "userUrl": "https://www.imdb.com/user/ur52498144",
      "reviewLink": "https://www.imdb.com/review/rw5274941",
      "warningSpoilers": false,
      "date": "23 November 2019",
      "rate": "10",
      "helpful": "328 out of 472 found this helpful.",
      "title": "This is the way",
      "content": "I'm a huge Star Wars fan but I have to admit, all hope was beginning to be lost. I was excited for The Mandalorian but had my bar set very low. But my God man this is amazing! I can't believe it's this good! The OG Star Wars vibes are crazy! It's like they took the original Star Wars and buffed it with modern day big budget CGI without making it a crappy blockbuster. The story is actually incredible so far and every episode is better than the last. I was gonna just watch these online but I've gotta support Disney+ for finally allowing something good to come out of them owning Star Wars. Thanks Jon Favreau, this is the way."
    },
    {
      "username": "Kysugo",
      "userUrl": "https://www.imdb.com/user/ur150850362",
      "reviewLink": "https://www.imdb.com/review/rw9029895",
      "warningSpoilers": true,
      "date": "3 May 2023",
      "rate": "9",
      "helpful": "16 out of 18 found this helpful.",
      "title": "Amazing start but then Season 3 had some problems",
      "content": "So far the things that bother me about Mandalorian Season 3 is the fact that they made Din narrate everything that's going on and everything that he's doing. It's like dude, we know what's going on, the writing is sufficiently good enough. Honestly, I think they did that for the little kids watching the show. And the other thing that bothered me was how campy and \"Disney\" it would get a times. Again, this is also done for the kids. It is Disney after all. The problem with these \"Disney\" moments is that it pulls me out of the immersion. Like with the curly haired mechanic chick and the glowing ice popsicles.The cool things so far have been the hyperspace whales that Grogu saw and the arachnodroid creature that lived in the subterranean area of Mandalore. Bo Katan is awesome. The way she wielded the dark saber like it was a lightweight katana was impressive. So far Bo is the highlight of this season. The actress who plays Bo did a fantastic job and she's definitely got it going on. She brings her to life and makes her an interesting and human character. That's crazy how the creature that lived in the mine waters of Mandalore had the same features as the Mandalorian insignia. That's where the idea for the symbol came from, The Mythosaur!The space ship aerial dog fights are incredible. They did such a good job with how realistic they look and feel. I do have to say, the CGI and special effects look spectacular in this show. They're really not holding back with investing money in the way everything looks. It definitely helps with the immersion. Seeing Coruscant fully realized with today's CGI literally took my breath away. I loved the Ahmad Best, Jar Jar actor, cameo in this season. He's basically the one responsible for saving Grogu's life. He's pretty awesome when he started dual wielding the lightsabers. Ok, I felt bad for the three baby pterodactyls when their mother died, but how did they fit those things on the ship?! Like what?! That was pretty silly, but it was a kind gesture. The episode when the Mandalorians fight off the pirates that were destroying Navarro was frickin sick. The way they dropped in from above the city out of Bo's ship was amazing. They did such a good job at making Mandalorians look cool. It makes me want to be one.Now for the biggest problem with this season so far. Seeing Lizzo is pretty cool and all, but it really took me out of the immersion and the Star Wars world. Idk why they think it's a good idea to insert random celebrities in shows. They did it in GOT and now they're doing it here. Jack Black was great, he fits into the universe since he's a pretty well-known nerd. But I felt like everything else surrounding the episode like Lizzo's character and the whole vibrant planet felt really off. The Christopher Lloyd cameo was great as well, even though the poor man looks like he should be in bed. I had a feeling this episode smelled like it was done by Bryce Dallas Howard. Only she could get all these big stars to appear together in an episode. I did like the commentary on society being overly dependable on droids and Lloyd's character being the one who can pull the plug on the droids. The problem with this episode is that it feels like such a huge departure from the journey that we were on. Like it's very jarring, and quite lame honestly. The droid bar was a cool idea, I'll give it that. But the whole thing felt like a parody episode, like a bad joke. I also found it annoying how they chose to use this episode as a sort of socio-political platform for their ideals. They should've known better than to do that.Other than that train wreck of an episode, I really like the direction where the show is going. Even though Mando seems like a side character, now that it's the Bo Katan show, I still really like all the things they're presenting."
    },
    {
      "username": "vanja-pletikosic",
      "userUrl": "https://www.imdb.com/user/ur23265961",
      "reviewLink": "https://www.imdb.com/review/rw5260340",
      "warningSpoilers": false,
      "date": "16 November 2019",
      "rate": "10",
      "helpful": "955 out of 1,195 found this helpful.",
      "title": "The Mandalorian - Now THIS is Star Wars",
      "content": "This show is such a refreshing breeze of great quality Star Wars. Hopefully with Episode 9, this horrible era of Star Wars will end, and we will finally get what we all wanted the whole time - great stories set in the Star Wars universe. Stories like this, that make sense. Stories that hook us and make us want more, make us relate to the characters on the screen, just by showing their weaknesses along with their strengths. The Mandalorian has faced more adversity in these two episodes than Rey has in two three hour movies. Definitely my favorite character of the Disney Star Wars era, and he has only said a few lines. Brilliant directing, brilliant script, brilliant execution of everything. I can't wait to see where the story goes.John Favreau you have my gratitude and respect!"
    },
    {
      "username": "cjbarrett",
      "userUrl": "https://www.imdb.com/user/ur1161263",
      "reviewLink": "https://www.imdb.com/review/rw9055602",
      "warningSpoilers": false,
      "date": "14 May 2023",
      "rate": "8",
      "helpful": "15 out of 17 found this helpful.",
      "title": "Season 3 marketing ploy",
      "content": "We enjoyed seasons 1 and 2. Unfortunately season 3 seems to exist as the Mandalorian version of Star Wars, Return of the Jedi, the Ewok merchandise money grab. Basically it's a vehicle to market Baby Yoda merch. The writing and direction play as afterthoughts. The narrative is now just a jumble of pointless opportunities for the green puppet to do cute things. The first two seasons had that delightful space western feel. This feels like the longest Super Bowl ad ever made. A collection of quality actors who always bring their A-game, the production just abandoned them in favor of a padded out, pointless exercise in greed."
    },
    {
      "username": "neoclone07",
      "userUrl": "https://www.imdb.com/user/ur24908137",
      "reviewLink": "https://www.imdb.com/review/rw6216879",
      "warningSpoilers": false,
      "date": "29 October 2020",
      "rate": "9",
      "helpful": "116 out of 165 found this helpful.",
      "title": "If you're a SW fan, you must watch",
      "content": "There's not much to say here... it's a great show, with solid acting, great cast, a script that dives into SW lore, superb fx (both pratical and digital) which leads to a real SW atmosphere (which lacks in the last movie trilogy). I'm a long time SW fan and you can say that the new trilogy brought new stuff into the franchise, blablabla... but no, the trilogy is a pain in the ass to watch indeed. So, instead, watch The Mandalorian, it's way much better in so many ways."
    },
    {
      "username": "yooniverse",
      "userUrl": "https://www.imdb.com/user/ur33079525",
      "reviewLink": "https://www.imdb.com/review/rw8974626",
      "warningSpoilers": false,
      "date": "6 April 2023",
      "rate": "3",
      "helpful": "98 out of 149 found this helpful.",
      "title": "All good things must come to an end",
      "content": "If you lived under a rock and didn't know Star Wars and The Mandalorian were Disney property, Chapter 22 (S3 E6) dispels all doubt. What started as a surprise hit has devolved into the beginning of its demise. I have spoken.Season 3 has squandered the hard earned capital of The Mandalorian. The signs were there, as the sci-fi spaghetti western gave way to Disney woke politics, as well as the writing that desperately had to expand the show's universe to drag in the rest of the reminant Empire and the New Republic all at once to compensate for running out of ideas. They took their literary helmets off and abandoned the Creed. This is NOT the way.Katee Sackhoff is a terrible actress. We are way too fond of her due to our nostalgia for Battlestar Galactica. You're hanging your hat on her acting? Another life for the sci-fi darling. Having written the Dark Saber into Din Djarin's hands to advance his character development, the only way out of it was to resort to a pathetic deus ex machina plot device.Oh, I'm sure they'll drag Moff Gideon back. And a few more side trips to Plaisir for comic relief episodes. And when that doesn't work, a whole slew of cameos from the long list of former guest stars.Soon, the show will have to be renamed \"The Mandalorians: Descendants\". They already have a princess, so they just need some more entitled young nobles.Good luck with that. The last of us will surely turn off the lights on the way out."
    },
    {
      "username": "brentscott",
      "userUrl": "https://www.imdb.com/user/ur61254985",
      "reviewLink": "https://www.imdb.com/review/rw5273815",
      "warningSpoilers": false,
      "date": "22 November 2019",
      "rate": "10",
      "helpful": "726 out of 945 found this helpful.",
      "title": "Kathleen Kennedy,JJ Abrams and Rian Johnson take notice. This is how you do Star Wars",
      "content": "This is Star Wars. It feels like Star Wars. It Looks Like Star Wars. Why is this such a tough concept for the geniuses associated with the films to get? No subversion's needed, no forced 8 yr old humor, no political agenda. Just make it look and feel like the original Star Wars trilogy and fans will be happy, its literally that simple."
    },
    {
      "username": "Skipfishh",
      "userUrl": "https://www.imdb.com/user/ur22068602",
      "reviewLink": "https://www.imdb.com/review/rw9011497",
      "warningSpoilers": false,
      "date": "23 April 2023",
      "rate": "4",
      "helpful": "35 out of 48 found this helpful.",
      "title": "Seasons 1 and 2 are weak but watchable, and season 3 sucks",
      "content": "Ok, we know that a good part of the plot of the entire Star Wars saga has a very juvenile tendency, there are few exceptions, such as \"Rogue One\" and the spectacular \"Andor\", among rare others. So, I watched \"The Madalorian\" not expecting something very elaborate in terms of an adult script, but at times the show's childishness borders on complete silliness and a total void of brain activity for the viewer.In the first two seasons, the series still has some quality moments, as in the episode that pays a beautiful tribute to the movie \"Seven Samurai\" in season 1, as well as the first episode of season 2, which is also very interesting.Everything that was done in live action in the Star Wars universe I watched, all the movies and series, some movies I watched more than 3 times, I just didn't make a point of watching practically none of the animations because it already runs away from what attracts me, so, even though I found the first two seasons of \"The Mandalorian\" quite irregular, I forced myself to watch the third, so as not to leave any holes in my universe.And the third season borders on the ridiculous.Not to say that it's complete crap, save for the very good CGI effects and the mentions of the presence of the Empire's back, which will make a small connection with the final trilogy of films of the saga. Otherwise, nothing is saved in this season.There's no story, there's no plot, there's nothing, just a festival of silly episodes of action without any foundation, absurdly stupid dialogues, even for children, and a Mandalorian hero who becomes a supporting character next to a Bo-Katan Kryze who is practically the main character, who appears more time without a mask than with one, reminding Ben Affleck's ham Batman, who always wanted to be showing his hammy face on screen without a mask, leaving the masked hero in the background. It would even be acceptable to make her the most important character of the season, but then at least they would hire a good actress on the same level as Pedro Pascal, because the one who played the role (Katee Sackhoff) is very weak and helps to demolish once and for all a season that was already so bad in so many aspects.Want to watch top-notch Star Wars content? The films \"Star Wars\" (1977), \"The Empire Strikes Back\" (1980) and \"Rogue one\" (2016), as well as the series \"Andor\" (2022) are a full plate.Season 1 - rating 5 out of 10.Season 2 - rating 5 out of 10.Season 3 - rating 2 out of 10."
    }
  ],
  "errorMessage": ""
}