{
  "imDbId": "tt0092455",
  "title": "Star Trek: The Next Generation",
  "fullTitle": "Star Trek: The Next Generation (TV Series 1987–1994)",
  "type": "TVSeries",
  "year": "1987",
  "items": [
    {
      "username": "chrisbrown6453",
      "userUrl": "https://www.imdb.com/user/ur0625436",
      "reviewLink": "https://www.imdb.com/review/rw0240403",
      "warningSpoilers": false,
      "date": "9 September 2000",
      "rate": "",
      "helpful": "151 out of 177 found this helpful.",
      "title": "Whether you liked the original Trek or not, 'The Next Generation is a true Trek across space.",
      "content": "Being a child of the late 20th century, I never had the chance to grow up' with the original Captain Kirk and gang; However, lucky me I had Captain Picard to idolize. While Captain James Tiberius Kirk was the trigger happy, love crazed gigolo, Captain Jean-Luc Picard was (and still is) the gentle, sensitive diplomat. Realizing that you cannot simply compare Kirk's crew to Picard's crew, you must evaluate The Next Generation on it's own merits.It's a show that had very well written stories, and each week there was a different hero from the no named ensign, to the captain himself. Several of the stories developed into true sagas and much of the plots involved many of the original cast. Bringing Spock into The Next Generation was a true piece of art.You must keep in mind that the budget for The Next Generation was a great deal larger than that of the original show. With that in mind, the special effects were superb, not only for a television show, but for movies as well. The Next Generation brought some very cool gadgets into our lives including tricorders, androids, and, of course, the most dreamed about invention the Holodeck! What a great thing that would be!While I would never doubt that the original Star Trek series is a classic, after all, they did name a Space Shuttle after the Enterprise, The Next Generation brought the 21st century into our homes each and every Saturday night, and helped us to believe that we can `Boldly go where no man have gone before!'"
    },
    {
      "username": "whotobe",
      "userUrl": "https://www.imdb.com/user/ur0157708",
      "reviewLink": "https://www.imdb.com/review/rw0240474",
      "warningSpoilers": false,
      "date": "8 December 2002",
      "rate": "",
      "helpful": "97 out of 106 found this helpful.",
      "title": "A wonderful series",
      "content": "This is an interesting, thought provoking, and most of all entertaining series. Gene Roddenberry not only gave us a \"Wagon Train to the Stars,\" but he gave us interesting stories reflecting the great values our society holds as truths. I know that \"some\" episodes were not that good, but that can be said of any series that has a long history. For the most part this program exceeds the mark of excellence in writing and entertainment. The delivery of the writing by Patrick Stewart, Brent Spiner et. al. truly brought the Star Trek future to life. The casting of this program is wonderful!I would hope that anyone with the desire for interesting intelligent science fiction would find this program enjoyable. If a person today is ONLY seeking an action packed thrill ride, then perhaps they may not find the value in Star Trek. But I have loved the program from the first day I watched Captain Kirk in \"The Man Trap\" from 1966. Since then I have watched the development of Trek with an open mind. I believe that ST-TNG to be the best incarnation of all Trek programs, to date. In this day and age of terrorism, and threats of war, it would be nice if we could apply more of the philosophies from the possible future of this series. Maybe if more people watched this program the world would be a nicer place!?!"
    },
    {
      "username": "Bogmeister",
      "userUrl": "https://www.imdb.com/user/ur6207631",
      "reviewLink": "https://www.imdb.com/review/rw1169270",
      "warningSpoilers": false,
      "date": "10 September 2005",
      "rate": "9",
      "helpful": "126 out of 153 found this helpful.",
      "title": "Trek in the 24th Century...",
      "content": "When the TNG series premiered in 1987, it wasn't greeted well by many of the old-time Trek fans, including myself. It didn't help matters that one of the earliest episodes, \"The Naked Now\" was a superficial retread of the classic \"The Naked Time\" from '66. The new episode should have served as a way of spotlighting several of the new crew, but all it did was show them all in heat. I wasn't too impressed. What did work was keeping the central theme of exploration (something lost in the offshoots, DS9 & Voyager). The new Enterprise was twice as large as the original, with about a thousand personnel aboard. Capt. Picard (Stewart) was a more cerebral, diplomatic version of the ultimate explorer we had known as Capt. Kirk. Again, Picard wasn't too impressive in the first two awkward seasons, as some may mistake his caution for weakness. The Kirk-like first officer Riker (Frakes) was controlled by Picard, so the entire crew of Enterprise-D came across as a bit too civilized, too complacent for their own good. It's interesting that this complacency was fractured by the most memorable episode of the first two years, \"Q Who?\" which introduced The Borg. All of a sudden, exploration was not a routine venture.Other memorable episodes of the first 2 years: the double-length pilot, introducing Q; \"Conspiracy\"-an early invasion thriller; \"Where No One Has Gone Before\"-an ultimate attempt to define the exploring theme; \"The Big Goodbye\"-the first lengthy exploration of the new holodeck concept; \"Datalore\"-intro of Data's evil twin; \"Skin of Evil\"-death of Tasha Yar; \"11001001\"-perhaps the best holodeck story; and \"The Measure of a Man\"-placing an android on trial. Except for \"Q Who\" the 2nd year was even more of a letdown from the first. Space started to percolate in the 3rd season. I liked \"The Survivors\"-introducing an entity resembling Q in a depressed mood, and \"Deja Q\" with both Q & Guinan squaring off, as well as other alien beings. A remaining drawback was the 'techno-babble' hindering many scripts, an aspect which made them less exciting than the stories of the original series. As Roddenberry himself believed, when characters spoke this way, it did not come across as naturalistic, except maybe when it was Data (Spiner), the android. The engineer La Forge (Burton), for example, was usually saddled with long, dull explanatory dialog for the audience.In the 3rd year, truly innovative concepts such as the far-out parallel-universe adventure \"Yesterday's Enterprise\" began to take hold, topped by the season-ender \"The Best of Both Worlds,part 1\" in which The Borg returned in their first try at assimilating Earth. After this and the 2nd part, the TNG show was off and running, at full warp speed. There are too many great episodes from the next 4 seasons to list here, but I tended to appreciate the wild, cosmic concept stories best: \"Parallels\"(s7); \"Cause and Effect\"(s5); \"Timescape\"(s6); \"Tapestry\"(s6); and the scary \"Frame of Mind\", \"Schisms\" and \"Genesis.\" There's also the mind-blowing \"Inner Light\"(s5), \"Conundrum\" and \"Ship in a Bottle\"(s6), \"Second Chances.\" The intense 2-parter \"Chain of Command\" was almost like a film, and the great return of Scotty in \"Relics\" was very entertaining, though it showed you can't go home again. The show also continued to tackle uneasy social issues, as in \"The Host\", \"The Outcast\", \"First Contact\" and \"The Drumhead\" as well as political:\"Darmok\", \"Rightful Heir\", \"Face of the Enemy\" and \"The Pegasus.\" The series ended on a strong note, \"All Good Things...\" a double-length spectacular with nearly the budget of a feature film. But it wasn't really the end. A few months later, an actual feature film was released \"Star Trek Generations\"(94). It's rather ironic that the TNG films couldn't match the innovation and creativity of the last 4 seasons of the series. \"Star Trek Insurrection\"(98) for example, is a lesser effort than any of the episodes mentioned above."
    },
    {
      "username": "colonel_green",
      "userUrl": "https://www.imdb.com/user/ur3109921",
      "reviewLink": "https://www.imdb.com/review/rw0240502",
      "warningSpoilers": false,
      "date": "9 August 2004",
      "rate": "10",
      "helpful": "88 out of 103 found this helpful.",
      "title": "To boldly go where no one has gone before.",
      "content": "Nearly twenty years after the original Star Trek was cancelled by NBC, Gene Roddenberry and Paramount sought to capitalize on the enormous success of TOS in syndication and on the big screen. Roddenberry decided to make the new series with few connections to the original, so that it could stand on its own. Many fans didn't like the idea of new characters, but Roddenberry pressed ahead, and Star Trek: The Next Generation was born. British stage actor Patrick Stewart assumed the role of Frenchman Captain Jean-Luc Picard, bringing gravitas, phenomenal acting skills, and an English accent that would become the boon of many jokes; Jonathon Frakes became William T. Riker, the Kirk-esque \"Number One\" with a love for the ladies and jazz; Brent Spiner was cast as Data, the android who envied human emotion; Gates McFadden was Dr. Beverly Crusher, the CMO with a complicated past with Captain Picard; Wil Wheaton was her irritating son Wesley, who would long annoy the fans; Michael Dorn brought a distinct presence to the recurring role of Klingon officer Worf, so much that he was promoted to regular. Marina Sirtis looked good as Deanna Troi, the psychiatrist who had once been involved with Riker; LeVar Burton was cast as Geordi LaForge, the blind Conn Officer; finally, Denise Crosby was Security Chief Tasha Yar. Also in the pilot was an unnamed conn officer played by Colm Meaney, who would later become Transporter Chief Miles O'Brien.The first two seasons were of average quality, but they did a good job of setting up the characters and expanding the Trek universe. The series gathered its own following, although it continued to exist in the shadow of TOS. Q became an ongoing presence, appearing twice more after the pilot. His third appearance had him introducing the crew to the Borg, the fearsome cyborgs who would become Trek's most famous villains. Denise Crosby left TNG near the end of the first year, saying that her character wasn't being given enough to do. The producers also removed Gates McFadden's Dr. Crusher, introducing Dr. Kate Pulaski (Diana Muldaur) to induce more conflict. The fans did not take to Pulaski, so McFadden was brought back for the start of Season Three. That season was when TNG really came into its own, ending with the reappearance of the Borg. The Borg abducted Captain Picard, and turned him into one of them; Riker, now in command, gave the order to destroy the Borg Cube, while Picard was still onboard. That was the greatest cliffhanger in TV history, and TNG received a great deal of media attention as a result. Droves of new viewers tuned in for the fourth season premiere, which many perceived as a bit of a letdown after all the hype; but the viewers stayed, and TNG soared in the ratings, producing more and more quality episodes. While it did lose a bit of steam in its final year, it finished with an incredible series finale, All Good Things..., and then launched a movie franchise of its own.TNG Top Ten Episodes: Conundrum; The Next Phase; Data's Day; The Best of Both World Parts I & II; Redemption Parts I & II; Reunion; The Defector; Face of the Enemy; The Pegasus; Elementary, My Dear Data;"
    },
    {
      "username": "Li-1",
      "userUrl": "https://www.imdb.com/user/ur1830094",
      "reviewLink": "https://www.imdb.com/review/rw0240481",
      "warningSpoilers": false,
      "date": "26 February 2003",
      "rate": "",
      "helpful": "129 out of 164 found this helpful.",
      "title": "Perhaps the best sci-fi TV series of all-time.",
      "content": "The occasional campiness of the 1960's Star Trek series was not at all evident in Star Trek: The Next Generation, arguably the best science fiction television series to ever be aired. It's funny TNG wound up so brilliant, considering the first two seasons were a bit iffy in terms of quality. The show ended up the ultimate representation of Star Trek, with an immensely engaging crew with a great sense of camaraderie, intelligent and intriguing stories, and special effects that were excellent by television standards.With the exception of Wil Wheaton, the cast was uniformly superb. Patrick Stewart had a lot to live up to as a successor to William Shatner's Kirk. With his magnetic presence and wonderful acting chops, he's crafted a very different individual from Kirk, and probably my favorite Trek character, period. Jonathan Frakes made for a likeable, intriguing Commander Riker, who's occasional rowdiness reminded me a bit of good old Kirk. Brent Spiner is simply terrific as the android, Data, who aspires to be more human. I can't imagine anyone else in the role, which is probably the highest praise you could give to an acting performance. Michael Dorn excelled as the tough Klingon Worf, Levar Burton was immensely likeable as chief engineer Laforge, and rounding out the cast were the series' two sexy and smart women, Marina Sirtis as Counselor Troi and Gates Mcfadden as Dr. Crusher (the latter of whom looks even more beautiful now than she did in her first season on TNG).The series has had a barrage of standout episodes, whether it was with suspenseful ventures into the unknown (the first appearance of the Borg) to the ultimate cliffhanger in The Best of Both Worlds, The Next Generation was an exercise in masterful storytelling and vivid characterization. Since then, three shows have spawned from Trek lore: Deep Space Nine, Voyager, and Enterprise. I have only seen one episode of Enterprise (and clearly, it didn't make much of an impression on me), but I had sporadically watched DS9 and Voyager, enough to know neither of them were overall quite as compelling as TNG (the only aspect they definitely had over TNG were in the sets and visual effects). For me, that's rather odd, since I often have a preference for a TV series that follows through a central storyline, as both DS9 and Voyager have, but it simply goes to show how each stand-alone episode of TNG made an impression."
    },
    {
      "username": "The_Other_Snowman",
      "userUrl": "https://www.imdb.com/user/ur4963708",
      "reviewLink": "https://www.imdb.com/review/rw1984914",
      "warningSpoilers": false,
      "date": "3 December 2008",
      "rate": "10",
      "helpful": "34 out of 40 found this helpful.",
      "title": "The Best Trek Has to Offer",
      "content": "In an early episode, Captain Picard delivers a line from Hamlet: \"What a piece of work is a man! How noble in reason, how infinite in faculty! In form and moving how express and admirable! In action how like an Angel! in apprehension how like a god!\" But he delivers it with conviction instead of irony, and by doing so creates the thesis of the entire franchise.Star Trek was never meant to be a realistic depiction of what the future will be like; rather, it's an optimistic argument for what the future could be like. Our heroes on the new Starship Enterprise are noble and rational, and the writing is more concerned with ethics than with punch-ups. Fans of Captain Kirk's red-blooded man of action might be disappointed, but then this is a more mature version of Star Trek. As we mature, we realize there are better ways to solve our problems than with violence. Patrick Stewart's Shakespearean captain is a renaissance man, capable of using the right words and unexpected actions to overcome obstacles, and he needs neither a hairpiece nor a fight scene to prove his character.The show's other standout star is the android Data, Spock's opposite yet kindred spirit. Where Spock repressed his emotions and was disdainful of illogical humans, Data is curious about our foibles and aspires to be more like us. That implies that being human is not a curse, but something wonderful and virtuous.There are no space wars in The Next Generation, and for a good reason: creator Gene Roddenberry hoped that by the 24th century war would be a thing of the past. The interpersonal conflicts and domestic dramas of other shows are here replaced by adventure and exploration. Human nature doesn't have to be absolute: people can change, and humanity can grow and evolve. Star Trek: The Next Generation is seven seasons of optimistic, outward-looking space adventure for people who believe that the human race doesn't need to be defined by the villains it faces, but by its own innate spirit."
    },
    {
      "username": "jed-estes",
      "userUrl": "https://www.imdb.com/user/ur11376179",
      "reviewLink": "https://www.imdb.com/review/rw1462348",
      "warningSpoilers": true,
      "date": "30 August 2006",
      "rate": "10",
      "helpful": "21 out of 25 found this helpful.",
      "title": "This Is Star Trek!",
      "content": "The original series was one of greatness but this show took the series too all new heights never dreamed of in the 1960's. Patrick Stewart as Captain Picard is stunning and eloquent. Every thing he says you feel he means. While Kirk in the old series was quick to kill, Picard is more laid back and reserves blood shed for only the more extreme cases (like the Borg). This difference is mainly from the times of which the series were created. Kirk's show had the stigma of the Cold War and Communism to fuel it's story line and reflect on the time it was created which was the time of much great fear and revolution in the world especially even in the U.S with racial tensions which that show dealt with in a good manner. Now flash forward to the late 1980's when America and Russia are quickly coming out of the Cold War. This was a time ripe Captian Picard and his resiliency for humanity. Picard remains calm and collected in his shows and always beats the enemy with wit, not might, like Kirk. The Next Generation is also cool because it had a stellar supporting cast. Michael Dorn as Worf is classic and to date he has more appearances in Trek than anyone else. Johnathan Frakes as Number one is cool too, he's not quite the foil to Picard that Spock was to Kirk, but it work. The foil to Picard that equals Spock's levels is that of the character Data, played to perfection by Brent Spiner. Data is what gives this show it's heart and it would not have been what it is without him. I never did really care for the females in this cast Miriana Sirtria and Gates Mcfadden. It's not because their not good actresses, I just feel they were never given the opportunity to grow. Levar Burton as Geordy La Forge is great. He is what mainly drew me to Trek, because I had liked him from his Reading Rainbow days. And to round it all out there is Wil Wheaton. Wil was a fine actor. I like him best in Stand By Me, but he does good in this show. I wish he had stayed through the entire run. But alas it was not so. Watch this show it is great."
    },
    {
      "username": "rh86",
      "userUrl": "https://www.imdb.com/user/ur6781466",
      "reviewLink": "https://www.imdb.com/review/rw1597506",
      "warningSpoilers": false,
      "date": "12 February 2007",
      "rate": "8",
      "helpful": "70 out of 89 found this helpful.",
      "title": "The Best Star Trek series",
      "content": "Following the success of the Star Trek movies in the mid 1980s, the producers decided to put ST back on the small screen with a shiny new Enterprise a new crew and a whole host of new species worlds and enemies. The first season and the majority of the second season are a bit shaky but from the third season it picks up massively. Patrick Stewart is now the captain, a more cerebral, diplomatic captain and played wonderfully. This series introduced far more relationships between the crew (Troi and Riker, Worf and his son, Crusher and Picard) which play out beautifully over the course of the series. The Special effects considering their now nearly 15-20 years old still look good and the Enterprise D is a true flagship vessel.There's so many good episodes it's kind of hard to pick out anymore than the main standouts most people have mentioned already, Yesterday's Enterprise, The Best of Both Worlds, The Inner Light are probably the most popular but everything, certainly post seasons one and two provides good solid sci fi."
    },
    {
      "username": "Big Movie Fan",
      "userUrl": "https://www.imdb.com/user/ur1486405",
      "reviewLink": "https://www.imdb.com/review/rw0240450",
      "warningSpoilers": false,
      "date": "2 May 2002",
      "rate": "",
      "helpful": "63 out of 92 found this helpful.",
      "title": "SIMILAR TO THE ORIGINAL SERIES BUT FRESH IN IT'S OWN WAY",
      "content": "Star Trek:The Next Generation was a brilliant series. In a way it was similar to the original but it was also fresh as well.Firstly, there were similarity's. Data was similar to Spock and Riker could be considered similar to Captain Kirk. But the similarity's ended there. Everything else was fresh and original.Picard was fresh-he was very diplomatic and understanding and a good negotiator. He was a good captain but preferred to stay on the ship and send Away Team's down to dangerous planets.Worf was a Klingon which made for interesting stories. Worf may have been a StarFleet officer but he never forgot his Klingon heritage.Data was similar to Spock but Data wanted to be human and he provided several laughs throughout the entire series.Dr. Crusher was the ships doctor and I don't think anyone could say she was similar to Bones from the original series.The stories were great throughout the series. It would be hard to rate individual episodes but the pilot episode and the last two-parter episodes were just awesome.The Next Generation was truly an awesome series which did well considering it had a tough act to follow in Star Trek The Original Series."
    },
    {
      "username": "ecomcon-2",
      "userUrl": "https://www.imdb.com/user/ur0333009",
      "reviewLink": "https://www.imdb.com/review/rw0240370",
      "warningSpoilers": false,
      "date": "2 June 1999",
      "rate": "",
      "helpful": "22 out of 25 found this helpful.",
      "title": "Okay, okay, everyone, just relax",
      "content": "It's depressing to read a comment from one ST fan bashing another. Can we all agree on one thing: that the universe of Star Trek changed (perhaps in a modest way) not only the way people viewed sci-fi but also how they envision the future?Each of the four series is excellent in their respect ways:(1) ST-TOS for starting it all and for revealing Roddenbury's creative genius. TOS has influenced American culture in many subtle ways (\"beam be up, Scotty\"). Sure, some of the old episodes were weak (\"brain, what is brain?\") but compare those to the many excellent, thought-provoking episodes. TOS stands on its own (much like the original \"Star Wars\") and all other ST series are compared against it.(2) ST-TNG resurrected the series with fresh characters and technologies (can you forget the always malfunctioning holodeck?). Patrick Stewart was a bold choice to play the captain and the supporting cast was excellent. While the first two seasons were weak, the series was going full steam by the third year. The story lines overlapped episodes (which many of you deride as soap opera-ish, but I loved it) providing a sense of character development. While I love all the ST's, TNG is my favorite.(3) ST-DS9 overlapped and continued where TNG left off. A darker vision, it also maintained the continuous story line technique. Like its predecessor, it was weak in the beginning but soon came into its own. While I will miss DS9, I feel that seven seasons is enough; any longer and you will weaken the production values.(4) ST-V departs from the other three series (where the players start from Earth and move outwards), Voyager has an original twist: start far away and revolve the show around the characters getting home (moving inwards). And while there's a certain \"Melrose Place in Outer Space\" feel to it, Voyager is a fine show (I can't quite get myself to call it \"excellent\" yet). Starting in June ST-V has a new, critical mission: it will now carry the ST franchise alone.In summary, I believe that each show has brought its own unique contribution to creating/continuing the ST phenomenon. They are all great creative efforts and each should be admired.I say down with \"the Force\" and up with \"live long and prosper.\" Make it so, Number One. Engage."
    },
    {
      "username": "patwalt",
      "userUrl": "https://www.imdb.com/user/ur1267436",
      "reviewLink": "https://www.imdb.com/review/rw0240490",
      "warningSpoilers": false,
      "date": "2 January 2004",
      "rate": "",
      "helpful": "230 out of 263 found this helpful.",
      "title": "Greatest Sci-Fi series of its time",
      "content": "People that watch science fiction seem to forget that Star Trek: The Next Generation was filmed from 1987 to 1994, and that it accomplished the breakthrough technical wizardry we now see in other sci-fi movies and television shows.It was Star Trek: The Next Generation (STTNG) that accomplished the \"orange screen\", reducing by 2/3 the cost of shooting space sequences. It was STTNG that finally allowed for a very advanced and yet BELIEVABLE \"evolved\" human behavior involved in space travel.I admired Captain Jean-Luc Picard for his reserved Brit style, and the tension between him and Dr. Beverly Crusher. Who did not like watching Lieutenant Commander Data and Lieutenant Geordi LaForge spar over human behavior? What about the short brilliant life of Lieutenant Natasha Yar? Who didn't tune in to see that? Commander William Riker was amazing to watch, as he grew a beard and a conscience -- while still being able to keep up with the great Lieutenant Worf, the only Klingon (as yet) in Star Fleet!?Those of you out there trying still to wage the Star Wars - Star Trek battle for supremacy -- grow up! They are both inspiring stories in different universes."
    },
    {
      "username": "bkoganbing",
      "userUrl": "https://www.imdb.com/user/ur2483625",
      "reviewLink": "https://www.imdb.com/review/rw2207716",
      "warningSpoilers": false,
      "date": "15 February 2010",
      "rate": "10",
      "helpful": "17 out of 25 found this helpful.",
      "title": "The Future's Greatest Generation",
      "content": "Even now it's hard for me to believe that Star Trek: The Next Generation only ran for seven seasons. Watching the reruns on the Sci-Fi Channel the future world we saw is as alive for me as it was first seeing it back in the day when it was initially broadcast.Gene Roddenberry had a boundless faith in the ability of man to overcome his animal nature and make a better world. I've always felt that was the real secret of the success of the first Star Trek series, that it came out at a nasty time in our history and showed us a better world if we're willing to make it so.The initial series with William Shatner and Leonard Nimoy introduced us to worlds and cultures beyond our's. But it really was only an introduction. TNG took us deep into the politics and culture of various alien races throughout the galaxy. We learned a whole lot about Klingons and Romulans, their thought processes, their culture, their politics and shifting alliances with each other and with such new alien races like the Ferengi and the Cardassians.Jean-Luc Picard as played by Patrick Stewart was an extraordinary man, a really fine representative of civilization on earth. As captain of the Enterprise I felt he was called on more than William Shatner to be a diplomat as well as a warrior. We got to see a little bit more of Star Fleet and the traditions of that future service with Picard and the rest of the crew.As befit a future where races are actually trying to live together we had a great crew on the Enterprise. It consisted of a Klingon security officer in Michael Dorn, a Betazoid telepath as ship's counselor in Marina Sirtis, and even an Android lieutenant commander in Brent Spiner. When Data was off kilter for any reason, with his capabilities he could be dangerous foe.My favorite on the show was young Wil Wheaton as Wesley Crusher, son of ship's doctor Beverly Crusher played by Gates McFadden. A young friend who is now gone envied so much the make believe world that Wesley inhabited. His own life was not so hot, but when he watched TNG he believed in a boundless future and would have given anything to have been having the adventures young Mr. Crusher was having. By the way when the series ended and Wil Wheaton's character was given a resolution of sorts, I thought for sure he was going to come back either in a future Star Trek film or one of the succeeding series. Make It so.TNG's stories and characters since we have several hundred years to see what we make of our future and see what the universe holds offers exciting possibilities. As far as optimism, this show boldly went where no one has gone before."
    },
    {
      "username": "snoopy-35734",
      "userUrl": "https://www.imdb.com/user/ur153816382",
      "reviewLink": "https://www.imdb.com/review/rw8247343",
      "warningSpoilers": false,
      "date": "17 June 2022",
      "rate": "9",
      "helpful": "12 out of 13 found this helpful.",
      "title": "My God this series is great!",
      "content": "I love this series so much. I like the characters, how they interact with each other and just the plot alone. This is pure genius. Going on adventures with the crew and having a bit of humor along the way. The acting is supreme and the soundtrack is nice too. I ❤ this series very much and can only recommend it !"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3756496",
      "warningSpoilers": false,
      "date": "17 July 2017",
      "rate": "9",
      "helpful": "9 out of 12 found this helpful.",
      "title": "A new generation well worth exploring",
      "content": "The original 'Star Trek' series had its flaws but was a ground-breaking and ahead of its time show with many things that made it hugely impressive. Expectations were high for 'The New Generation', with big shoes to fill but also worries as to how it would fare in correlation with the original show.Good news is that 'The Next Generation' is a very worthy follow up, that will please fans of the original series and also stand very well on its own two feet. There are improvements here as well as a couple of weaknesses. It is agreed that Season 1 is iffy and sees the show struggling to settle, it was Season 3 when the show properly hit its stride. Even for a character meant to be annoying, Wil Wheaton is very annoying.Production values however are a major improvement in 'The Next Generation' over the original series. The sets give more of a sense of awe and the special effects are slicker and more expansive. It is stylishly and beautifully shot too. The music has a lot of energy and atmosphere.Writing is every bit as great as that of the original show. It is entertaining, intelligent, thought-provoking and rich in humanity. The stories, when the show hit its stride, are every bit as high in imagination and just as suspenseful, intriguing and fun. Not quite as ground-breaking as the original series but just as influential and with many of that show's strong points, and actually with a lesser amount of contrived and lacking-in-logic episodes.Character interaction and development, in what is essentially a character-driven show, is one of 'The Next Generation's' best points and where the show particularly excels. Worf and Riker's relationship is particularly interesting, and Picard is just as memorable as Spock. Which is not an easy feat considering Spock's iconic status in the 'Star Trek' universe.Acting is every bit as fine, with the role of Picard containing some of the best acting Patrick Stewart has ever given and he has always been a highly dependable actor. Likewise with Brent Spiner, and Jonathan Frakes proves to be just as good an actor as he is a director. Michael Dorn is also strong. Only Wheaton is lacking here, but there is no acting here that reaches overacting depths like William Shatner in the original series.In summary, well worth exploring and just as good as the original series. 9/10 Bethany Cox"
    },
    {
      "username": "ringedseals",
      "userUrl": "https://www.imdb.com/user/ur87628496",
      "reviewLink": "https://www.imdb.com/review/rw5393708",
      "warningSpoilers": false,
      "date": "9 January 2020",
      "rate": "10",
      "helpful": "14 out of 17 found this helpful.",
      "title": "Best series EVER!!!!",
      "content": "I love TNG so much. All the characters are superb and Captain Picard is the best Captain ever. My favourite episode is always have been The Inner Light. 10/10."
    },
    {
      "username": "riddion",
      "userUrl": "https://www.imdb.com/user/ur0127031",
      "reviewLink": "https://www.imdb.com/review/rw0939475",
      "warningSpoilers": false,
      "date": "30 September 2004",
      "rate": "9",
      "helpful": "42 out of 57 found this helpful.",
      "title": "What a great show",
      "content": "I have been hooked on this show ever since I rented a couple of episodes on video over 10 years ago. The series was shown on Norwegian Television, but they stopped it at the end of the forth season. I then bought the whole series, one season after another on DVD. I watched all the episodes, and I realized how great this show is. Over the course of the series, the characters deepen and it gets to be more and more interesting. There is the mishap of the second season, but although it was the worst season, it did have some very good episodes, like 'The Measure of a Man' and 'Q Who?'. I have seen this show now five times from start to finish (and I think that will be seeing much more), but I have found that the episodes which are much action oriented, like the double episode 'Chain of Command', was quite boring. I love episodes like 'Darmok', 'The Inner Light', 'Disaster', 'The Nth Degree', 'First Contact' and 'Who Watches The Watchers?' where the crew meet new races or find themselves in a situation that they are not used to.This is a series that can be appealing to people who like to see action in their science fiction and people who like to see, meet and know new races in their science fiction. This was a fantastic show."
    },
    {
      "username": "CinefanR",
      "userUrl": "https://www.imdb.com/user/ur23772122",
      "reviewLink": "https://www.imdb.com/review/rw2644422",
      "warningSpoilers": false,
      "date": "18 July 2012",
      "rate": "10",
      "helpful": "15 out of 20 found this helpful.",
      "title": "Captain Picard was (and is) one of my role-models",
      "content": "I read somewhere that Patrick Steward is proud of the educational role Star Trek – The Next Generation had over young viewers. I'm glad he enjoyed his work just as much as we did, because it had indeed quite an influence on me as a child. I practically grew up with the Enterprise crew, and Captain Picard was one of my role-models. Even now, revisiting the series restores my belief that the world will get better. After all these years, TNG is still so much fun, even more so. In a media landscape full of violence of all kinds, Star Trek – The Next Generation is something to treasure. It's that unique 'feel-good' vibe, the funny make-ups, wild scenarios and holodeck escapism, that make it a magic, timeless adventure. An ode to diversity, exploration, friendship and growth, TNG is the evidence that true values can be affirmed in a manner that is both educational and great fun. Gene Rodenberry had an admirable vision of the future...The series stayed faithful to the characters until the end, and it's a miracle that it didn't \"jump the shark\", which seems to be the fate of all successful series, for some reason. STNG just got better and better with each season until its final episode, thanks to Patrick Stewart's growing involvement in the production, script and character development. Rarely do we see a truly gifted actor with such dedication to his craft.Among all characters, Captain Picard shines with his tremendous commanding presence, wisdom and moral stature. Patrick Stewart's talent, professionalism and commitment to the role are that one thing holding everything together. My favorite episodes include \"Chain of Command\" with the memorable Ronny Cox as a non-villainous antagonist, \"The Big Good Bye\" and \"The Measure of a Man\". There are many, countless others that are just as good, in fact I love them ALL."
    },
    {
      "username": "SpiritWolf77",
      "userUrl": "https://www.imdb.com/user/ur1248160",
      "reviewLink": "https://www.imdb.com/review/rw0240476",
      "warningSpoilers": false,
      "date": "3 January 2003",
      "rate": "",
      "helpful": "56 out of 69 found this helpful.",
      "title": "One of the few TV shows I'll actually watch",
      "content": "I was originally a loyal and dedicated fan of the original series...when I'd seen all the episodes and all the movies, and needed something more to watch, I went and rented Generations...since it did still have some of the original cast. I was dissapointed by how little. I completely rejected the idea of a new cast...no one could ever replace the classics...but I went ahead and watched the rest of the movies...and then decided to watch a few episodes of TNG. Now about a year later I have seen almost every TNG episode, own seasons 6 & 7 o DVD, and own all the TNG movies with the exception of Nemesis. In my opinion, the people who said you couldn't redo Star Trek were quite mistaken. I love the way the characters interact, everyone on the show seems to have such a bond...on and off the screen. The show also deals with a great amount of philosophical ideas and moral issues. The character of Data is a perfect example of that. is he self aware? Or is he just an emotionless machine? I've always leaned towards the former...Brent Spiner does a wonderful job of giving a slight little hint of emotion that really makes you feel for the character and makes you doubt that he's nothing more than just a machine, and makes you question, just what is sentience? These are the kind of wonderful themes this show deals with. I'm not a big fan of TV in general...and there's very little on that will actually grasp my attention. But every night at 8:00 I sit down to watch TNG reruns. It's most definitely my favorite TV show out there."
    },
    {
      "username": "Tweetienator",
      "userUrl": "https://www.imdb.com/user/ur64264987",
      "reviewLink": "https://www.imdb.com/review/rw7372655",
      "warningSpoilers": false,
      "date": "23 September 2021",
      "rate": "8",
      "helpful": "7 out of 9 found this helpful.",
      "title": "Aged Well",
      "content": "I confess: the adventures of Picard and his crew were always my least favorite of the classic Star Trek shows. I always preferred Kirk and Spock, DSN and Voyager. Anyway, lately I watched again a couple of seasons and must admit - I like Next Generation now more than back in the late 80s and early 90s. We just get all the stuff we like: fine characters and interesting stories, lots of suspense, some action and a strong world building. I suspect that all those bad shows and movies added to the Star Trek universe (with the exception of Enterprise) of recent years are somewhat responsible for this new awakened love. Compared to Discovery and Picard, Next Generation is Citizen Kane or Metropolis."
    },
    {
      "username": "jasonemartin-75927",
      "userUrl": "https://www.imdb.com/user/ur150564957",
      "reviewLink": "https://www.imdb.com/review/rw7940966",
      "warningSpoilers": false,
      "date": "11 March 2022",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "The Finest Star Trek Show Ever",
      "content": "This Star Trek show is so good you will want to watch it again in the future, and each time you watch it you will be left thinking deep thoughts about the nature of consciousness, life and death, the excitement and deep plots and mysteries of the story, etc.This is about as close to a perfect Star Trek experience as you can get. Great show to start someone on to introduce them to Star Trek!"
    },
    {
      "username": "mirkoacquaviva",
      "userUrl": "https://www.imdb.com/user/ur18773982",
      "reviewLink": "https://www.imdb.com/review/rw5445928",
      "warningSpoilers": false,
      "date": "30 January 2020",
      "rate": "9",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Science fiction at his finest",
      "content": "I've watched this in 2019 and at the beginning i was sceptical because it felt so dated and cheesy but man i'm glad i've endured season 1 because what i got was really smart and well written science fiction and not the explosion action filled one we get nowdays. This show is about the ethical and moral dilemma of future civilization exploring space. While some episode are clearly filler they are still really watchable thanks to the amazing cast of characters you end up caring about, even secondary ones i really didn't like i ended up caring and rooting for them. The good episodes on the other hand are really some of the best television i've ever seen, they put the crew in really thought provoking situations with most of the time a satisfying ending. I really reccomend this show to anyone that is even a little bit interested in science fiction and if you are scared by the colossal lenght of this show since it's basically a collection of adventures the enterprise goes through you can also watch the best rated episodes even though i reccomend watching the whole show."
    },
    {
      "username": "crazysounds",
      "userUrl": "https://www.imdb.com/user/ur113668620",
      "reviewLink": "https://www.imdb.com/review/rw5621755",
      "warningSpoilers": false,
      "date": "9 April 2020",
      "rate": "10",
      "helpful": "9 out of 11 found this helpful.",
      "title": "What a marvel of the art of cinema",
      "content": "Star Trek TNG is a masterpiece!TNG tells the story of how great humanity can be. It inspires you to do good, say good, be good, and think good. It teaches you humility, acceptance and the joy and wonders of science.If everyone watched this show, the world would be free of all the chaos.Watch it with your family and change the world for the better!"
    },
    {
      "username": "stathisart",
      "userUrl": "https://www.imdb.com/user/ur6508708",
      "reviewLink": "https://www.imdb.com/review/rw2137695",
      "warningSpoilers": false,
      "date": "7 October 2009",
      "rate": "10",
      "helpful": "25 out of 29 found this helpful.",
      "title": "marvelous!",
      "content": "This series is a true marvel! I don't recall seeing any other series so diverse in its thematology, so rich in ideas. Patrick Stewart really adds a lot of depth to his role, throughout the series there are references to drama, literature, science that make some episodes a true journey through beautiful ideas. Also, the plot is sometimes very good, despite the scientific discrepancies one often encounters, or the effects that might at some points appear outdated. This is science fiction that aims to elucidate the eternal human questions, not just give a dramatized prospect of human evolution. Data is a unique character, his interaction with the captain (and the rest of the crew) is uniquely enjoyable, often giving insights into the evolution of human ethics, as for example in an episode where Captain Piccard is called to support the view that Data is a conscious life form and thus has the right to decide for his own fate; that he cannot be considered as property, even though he is a human construct. You really never know where the next episode will take you...from MacBeth to Cyrano, or from Data's love affair to the first contact with the crystaline entity, or Sherlock Holmes mysteries. Truly, I have never seen any other series with such a broad range of ideas and references. I wish to thank all those who made it possible, and Patrick Stewart for adding such a dramatic depth to his role. Truly, in no other case has an actor in TV done such a great job at combining so diverse elements in a single character, and with so superb acting...Patrick Stewart really carries you away with his acting, it is epic to say the least. I remember him in so many roles, never did he disappoint me.Its a magnificent work of art, one that stretches across many marvels of the human intellect to create its beautiful and educating (in the Greek sense, as actors become teachers of life through their dilemmas and adventures) drama."
    },
    {
      "username": "dr_foreman",
      "userUrl": "https://www.imdb.com/user/ur1052098",
      "reviewLink": "https://www.imdb.com/review/rw0240505",
      "warningSpoilers": false,
      "date": "9 September 2004",
      "rate": "",
      "helpful": "21 out of 38 found this helpful.",
      "title": "to blandly go where Shatner went before",
      "content": "At least, that's how Mad Magazine put it...\"Star Trek: the Next Generation\" has not aged well for me. I have nostalgic appreciation for the show - this was the Star Trek series of my youth, after all - but in hindsight it's really rather dry and uninspired. For a while, its reputation shot past the original series, but around five years ago I noticed that most fans' respect swung back to Shatner and company. When SFX magazine ranked the top 50 sci-fi shows of all time in 1999, TNG didn't even crack the top ten, while the original series was #2.Why's that, you ask? Maybe because the chemistry on this show is so poor. Scotty and Chekov weren't the best characters - they're just likable stereotypes, I suppose - but even they shine when compared to faceless non-entities like Worf, Crusher, and Geordi. Frankly, I can't tell you a thing about these characters, even though I watched them for years. Picard's aura of pompous authority makes him a distant and inaccessible character, and Riker seems to exist purely to get into fights and crack cutesy jokes. In fact, nothing about this show irritates me more than the cutesy jokes; I hate it when they cut to a shot of Riker or Geordi smiling coyly after Data has just dropped a faux paus.The production values have dated poorly, too. I always thought the uniforms lacked color and formality (compare them to the beautiful costumes used from Wrath of Khan to the Undiscovered Country). The bridge looks, frankly, like a living room. The special effects are good, but you only get a few per episode, and even then they're often recycled. I was shocked to see many re-used shots in the \"classic\" Best of Both Worlds. What's the matter, boys, didn't you have enough money to film a new shot of Borg getting blasted and falling over?Speaking of the Borg, they don't hold up either. I was surprised to see that they kill NO ONE on screen in Best of Both Worlds. They stomp around and talk big, but the show's production style is so stilted and sanitized that they're never allowed to do anything remotely violent. The \"Doctor Who\" villains that they shamelessly plagiarize may have looked corny, but at least they delivered on their threats and occasionally zapped a few extras. And yes, the Borg are definitely rip-offs; even their catchphrases are lifted. (\"You will be assimilated\" is not so very different from the Cyberman threat \"you will be like us\" and the classic Dalek line \"you will be exterminated.\" And, what do you know, the emotionless cyborg Cybermen have described human pleasures as \"irrelevant\"!)Tedious stuff, man. When I showed the Shatner movies to my roommate recently, she remarked that Kirk, Spock, and McCoy share a genuine bond of friendship that's much warmer than anything she'd seen on The Next Generation. Warmth...that's what's missing here. And action. And a lead actor who actually gets into the material would help, too. Not really one of science fiction's finest hours."
    },
    {
      "username": "Mr-Fusion",
      "userUrl": "https://www.imdb.com/user/ur1994077",
      "reviewLink": "https://www.imdb.com/review/rw3638734",
      "warningSpoilers": false,
      "date": "12 February 2017",
      "rate": "10",
      "helpful": "5 out of 7 found this helpful.",
      "title": "For me, this is what defined Star Trek",
      "content": "Y'know, when it all comes down to it, I really loved that ship. The Enterprise-D (with its neutral dentist's office decor) really fit with the tone and the characters on \"The Next Generation\", and it was totally a character.TNG really kept the spirit of exploration alive, and even though Captain Picard isn't swashbuckling or quick with a fist, he really did lead his crew on these strange voyages. It doesn't hurt that Patrick Stewart is a top-shelf actor, but he was also apart of an ensemble cast, and I really did (do) like seeing them from one episode to the next.This is like any TV show with certain seasons better than others; but when the show finally found its voice, it *really* got going. Just one fine episode after another. It's hard to believe the leeway this received as a series, given our current cutthroat ratings climate.I credit this with really planting the seeds in me as a Trekkie. Over the years, I've come to appreciate The Original Series, as well as the movies, but it all started here.It's an amazing show.10/10"
    }
  ],
  "errorMessage": ""
}