{
  "imDbId": "tt0092455",
  "title": "Star Trek: The Next Generation",
  "fullTitle": "Star Trek: The Next Generation (TV Series 1987–1994)",
  "type": "TVSeries",
  "year": "1987",
  "language": "en",
  "titleInLanguage": "Star Trek: The Next Generation",
  "url": "https://en.wikipedia.org/wiki/Star_Trek:_The_Next_Generation",
  "plotShort": {
    "plainText": "Star Trek: The Next Generation (TNG) is an American science fiction television series created by Gene Roddenberry. It originally aired from September 28, 1987, to May 23, 1994, in syndication, spanning 178 episodes over seven seasons. The third series in the Star Trek franchise, it was inspired by Star Trek: The Original Series. Set in the latter third of the 24th century, when Earth is part of the United Federation of Planets, it follows the adventures of a Starfleet starship, the USS Enterprise (NCC-1701-D), in its exploration of the Alpha quadrant in the Milky Way galaxy.\r\nIn the 1980s, Roddenberry—who was responsible for the original Star Trek, Star Trek: The Animated Series (1973–1974), and the first of a series of films—was tasked by Paramount Pictures with creating a new series in the franchise. He decided to set it a century after the events of his original series. The Next Generation featured a new crew: Patrick Stewart as Captain Jean-Luc Picard, Jonathan Frakes as William Riker, Brent Spiner as Data, Michael Dorn as Worf, LeVar Burton as Geordi La Forge, Marina Sirtis as Deanna Troi, Gates McFadden as Dr. Beverly Crusher, Denise Crosby as Tasha Yar, Wil Wheaton as Wesley Crusher, and a new Enterprise.\r\nRoddenberry, Maurice Hurley, Rick Berman, Michael Piller, and Jeri Taylor served as executive producers at various times throughout its production. The series was broadcast in first-run syndication with dates and times varying among individual television stations. Stewart's voice-over introduction during each episode's opening credits stated the starship's purpose:\r\nSpace: the final frontier. These are the voyages of the starship Enterprise. Its continuing mission: to explore strange new worlds, to seek out new life and new civilizations, to boldly go where no one has gone before.\r\nThe show was very popular, reaching almost 12 million viewers in its 5th season, with the series finale in 1994 watched by over 30 million viewers. Due to its success, Paramount commissioned Rick Berman and Michael Piller to create a fourth series in the franchise, Star Trek: Deep Space Nine, which launched in 1993. The characters from The Next Generation returned in four films: Star Trek Generations (1994), Star Trek: First Contact (1996), Star Trek: Insurrection (1998), and Star Trek: Nemesis (2002), and in the television series Star Trek: Picard (2020–2023). The series is also the setting of numerous novels, comic books, and video games. It received many accolades, including 19 Emmy Awards, two Hugo Awards, five Saturn Awards, and a Peabody Award.",
    "html": "<p>Star Trek: The Next Generation (TNG) is an American science fiction television series created by Gene Roddenberry. It originally aired from September 28, 1987, to May 23, 1994, in syndication, spanning 178 episodes over seven seasons. The third series in the Star Trek franchise, it was inspired by Star Trek: The Original Series. Set in the latter third of the 24th century, when Earth is part of the United Federation of Planets, it follows the adventures of a Starfleet starship, the USS Enterprise (NCC-1701-D), in its exploration of the Alpha quadrant in the Milky Way galaxy.</p><p>In the 1980s, Roddenberry—who was responsible for the original Star Trek, Star Trek: The Animated Series (1973–1974), and the first of a series of films—was tasked by Paramount Pictures with creating a new series in the franchise. He decided to set it a century after the events of his original series. The Next Generation featured a new crew: Patrick Stewart as Captain Jean-Luc Picard, Jonathan Frakes as William Riker, Brent Spiner as Data, Michael Dorn as Worf, LeVar Burton as Geordi La Forge, Marina Sirtis as Deanna Troi, Gates McFadden as Dr. Beverly Crusher, Denise Crosby as Tasha Yar, Wil Wheaton as Wesley Crusher, and a new Enterprise.</p><p>Roddenberry, Maurice Hurley, Rick Berman, Michael Piller, and Jeri Taylor served as executive producers at various times throughout its production. The series was broadcast in first-run syndication with dates and times varying among individual television stations. Stewart's voice-over introduction during each episode's opening credits stated the starship's purpose:</p><blockquote>Space: the final frontier. These are the voyages of the starship Enterprise. Its continuing mission: to explore strange new worlds, to seek out new life and new civilizations, to boldly go where no one has gone before.</blockquote><p>The show was very popular, reaching almost 12 million viewers in its 5th season, with the series finale in 1994 watched by over 30 million viewers. Due to its success, Paramount commissioned Rick Berman and Michael Piller to create a fourth series in the franchise, Star Trek: Deep Space Nine, which launched in 1993. The characters from The Next Generation returned in four films: Star Trek Generations (1994), Star Trek: First Contact (1996), Star Trek: Insurrection (1998), and Star Trek: Nemesis (2002), and in the television series Star Trek: Picard (2020–2023). The series is also the setting of numerous novels, comic books, and video games. It received many accolades, including 19 Emmy Awards, two Hugo Awards, five Saturn Awards, and a Peabody Award.</p>"
  },
  "plotFull": {
    "plainText": "Star Trek: The Next Generation (TNG) is an American science fiction television series created by Gene Roddenberry. It originally aired from September 28, 1987, to May 23, 1994, in syndication, spanning 178 episodes over seven seasons. The third series in the Star Trek franchise, it was inspired by Star Trek: The Original Series. Set in the latter third of the 24th century, when Earth is part of the United Federation of Planets, it follows the adventures of a Starfleet starship, the USS Enterprise (NCC-1701-D), in its exploration of the Alpha quadrant in the Milky Way galaxy.\r\nIn the 1980s, Roddenberry—who was responsible for the original Star Trek, Star Trek: The Animated Series (1973–1974), and the first of a series of films—was tasked by Paramount Pictures with creating a new series in the franchise. He decided to set it a century after the events of his original series. The Next Generation featured a new crew: Patrick Stewart as Captain Jean-Luc Picard, Jonathan Frakes as William Riker, Brent Spiner as Data, Michael Dorn as Worf, LeVar Burton as Geordi La Forge, Marina Sirtis as Deanna Troi, Gates McFadden as Dr. Beverly Crusher, Denise Crosby as Tasha Yar, Wil Wheaton as Wesley Crusher, and a new Enterprise.\r\nRoddenberry, Maurice Hurley, Rick Berman, Michael Piller, and Jeri Taylor served as executive producers at various times throughout its production. The series was broadcast in first-run syndication with dates and times varying among individual television stations. Stewart's voice-over introduction during each episode's opening credits stated the starship's purpose:\r\nSpace: the final frontier. These are the voyages of the starship Enterprise. Its continuing mission: to explore strange new worlds, to seek out new life and new civilizations, to boldly go where no one has gone before.\r\nThe show was very popular, reaching almost 12 million viewers in its 5th season, with the series finale in 1994 watched by over 30 million viewers. Due to its success, Paramount commissioned Rick Berman and Michael Piller to create a fourth series in the franchise, Star Trek: Deep Space Nine, which launched in 1993. The characters from The Next Generation returned in four films: Star Trek Generations (1994), Star Trek: First Contact (1996), Star Trek: Insurrection (1998), and Star Trek: Nemesis (2002), and in the television series Star Trek: Picard (2020–2023). The series is also the setting of numerous novels, comic books, and video games. It received many accolades, including 19 Emmy Awards, two Hugo Awards, five Saturn Awards, and a Peabody Award.\r\nProduction\r\nThe Star Trek franchise originated in the 1960s, with the Star Trek television show which ran from 1966 to 1969. Star Trek: The Next Generation would mark the return of Star Trek to live-action broadcast television.\r\nBackground\r\nDue to the original series' popularity in syndication, Paramount Pictures began to consider making a Star Trek film as early as 1972. However, with 1977's release of Star Wars, Paramount decided not to compete in the science fiction movie category and shifted their efforts to a new Star Trek television series. The Original Series actors were approached to reprise their roles; sketches, models, sets and props were created for Star Trek: Phase II until Paramount changed its mind again and decided to create feature films starring the Original Series cast.\r\nBy 1986, 20 years after the original Star Trek's debut on NBC, the franchise's longevity amazed Paramount Pictures executives. Chairman Frank Mancuso Sr. observed that \"The shelf life in this business is usually three days. To flourish for 20 years...\" He and others described Trek as the studio's \"crown jewel\", a \"priceless asset\" that \"must not be squandered\". The series was the most popular syndicated television program 17 years after cancellation, and the Harve Bennett-produced, Original Series-era Star Trek films did well at the box office. William Shatner and Leonard Nimoy's salary demands for the film Star Trek IV: The Voyage Home (1986) caused the studio to plan for a new Star Trek television series. Paramount executives worried that a new series could hurt the demand for the films, but decided that it would increase their appeal on videocassette and cable, and that a series with unknown actors would be more profitable than paying the films' actors' large salaries. Roddenberry initially declined to be involved, but came on board as creator after being unhappy with early conceptual work. Star Trek: The Next Generation was announced on October 10, 1986, and its cast in May 1987.\r\nParamount executive Rick Berman was assigned to the series at Roddenberry's request. Roddenberry hired a number of Star Trek veterans, including Bob Justman, D. C. Fontana, Eddie Milkis and David Gerrold. Early proposals for the series included one in which some of the original series cast might appear as \"elder statesmen\", and Roddenberry speculated as late as October 1986 that the new series might not even use a spaceship, as \"people might travel by some means\" 100 years after the USS Enterprise. A more lasting change was his new belief that workplace interpersonal conflict would no longer exist in the future; thus, the new series did not have parallels to the frequent \"crusty banter\" between Kirk, Spock, and Leonard McCoy. According to series actor Patrick Stewart, Berman was more receptive than Roddenberry to the series addressing political issues.\r\nThe series' music theme combined the fanfare from the original series theme by Alexander Courage with Jerry Goldsmith's theme for Star Trek: The Motion Picture (1979). Some early episodes' plots derived from outlines created for Star Trek: Phase II. Additionally, some sets used in the Original Series-era films were redressed for The Next Generation, and in turn used for subsequent Original Series films. Part of the transporter room set in TNG was used in the original Star Trek's transporter set.\r\nSyndication and profitability\r\nDespite Star Trek's proven success, NBC and ABC only offered to consider pilot scripts for the new series, and CBS offered to air a miniseries that could become a series if it did well. Paramount executives were offended that the Big Three television networks treated their most appealing and valuable property like any other series. Fox wanted the show to help launch the new network, but wanted it by March 1987, and would only commit to 13 episodes instead of a full season. The unsuccessful negotiations convinced the studio that it could only protect Star Trek with full control.\r\nParamount increased and accelerated the show's profitability by choosing to instead broadcast it in first-run syndication: 123–124 on independent stations (whose numbers had more than tripled since 1980) and Big Three network affiliates. The studio offered the show to local stations for free as barter syndication. The stations sold five minutes of commercial time to local advertisers and Paramount sold the remaining seven minutes to national advertisers. Stations had to commit to purchasing reruns in the future, and only those that aired the new show could purchase the popular reruns of the Original Series.: 222\r\nThe studio's strategy succeeded. Most of the 150 stations airing reruns of the original Star Trek wanted to prevent a competitor from airing the new show; ultimately, 210 stations covering 90% of the United States became part of Paramount's informal nationwide network for TNG. In early October 1987, more than 50 network affiliates pre-empted their own shows for the series pilot, \"Encounter at Farpoint\". One station predicted that \"Star Trek promises to be one of the most successful programs of the season, network or syndicated\". Special effects were by Industrial Light and Magic, a Division of Lucasfilm. The new show indeed performed well; the pilot's ratings were higher than those of many network programs, and ratings remained comparable to network shows by the end of the first season, despite the handicap of each station airing the show on a different day and time, often outside prime time. By the end of the first season, Paramount reportedly received $1 million for advertising per episode, more than the roughly $800,000 fee that networks typically paid for a one-hour show; by 1992, when the budget for each episode had risen to almost $2 million, the studio earned $90 million from advertising annually from first-run episodes, with each 30-second commercial selling for $115,000 to $150,000. The show had a 40% return on investment for Paramount, with $30 to $60 million in annual upfront net profit for first-run episodes and another $70 million for stripping rights for each of the about 100 episodes then available, so they did not need overseas sales to be successful.\r\nSeasons\r\nStar Trek: The Next Generation ran for 178 episodes, over seven seasons, from the fall of 1987 annually to the spring of 1994. At the end of that season, the cast switched over to production of the Star Trek film Generations which was released before the end of 1994.\r\nSeason 1 (1987–1988)\r\nThe Next Generation was shot on 35 mm film and the budget for each episode was $1.3 million, among the highest for a one-hour television drama. While the staff enjoyed the creative freedom gained by independence from a broadcast network's Standards and Practices department, the first season was marked by a \"revolving door\" of writers, with Gerrold, Fontana and others quitting after disputes with Roddenberry.: 222 Roddenberry \"virtually rewrote\" the first 15 episodes because of his \"dogmatic\" intention to depict human interaction \"without drawing on the baser motives of greed, lust, and power\". Writers found the show's \"bible\" constricting and ridiculous and could not deal with Roddenberry's ego and treatment of them. It stated, for example, that \"regular characters all share a feeling of being part of a band of brothers and sisters. As in the original Star Trek, we invite the audience to share the same feeling of affection for our characters.\" David Gerrold claimed that at one point, Roddenberry's lawyer came aboard and started taking apart six months of work, including the removal of a gay couple that Roddenberry had promised would be included in the series, which made Gerrold decide to leave the show.\r\nMark Bourne of The DVD Journal wrote of season one: \"A typical episode relied on trite plot points, clumsy allegories, dry and stilted dialogue, or characterization that was taking too long to feel relaxed and natural.\" Other targets of criticism included poor special effects and plots being resolved by the deus ex machina of Wesley Crusher saving the ship. Patrick Stewart's acting won praise, and critics noted that characters were given greater potential for development than those of the original series. Actors and producers were unsure whether Trekkies loyal to the original show would accept the new one but one critic stated as early as October 1987 that The Next Generation, not the movies or the original show, \"is the real Star Trek now\".\r\nWhile the events of most episodes of season one were self-contained, many developments important to the show occurred during the season. The recurring nemesis Q was introduced in the pilot, the alien Ferengi had their sentinel showing in \"The Last Outpost\", the holodeck was introduced and the romantic backstory between William Riker and Deanna Troi was investigated. \"The Naked Now\", one of the few episodes that depicted Roddenberry's fascination (as seen in the show's bible) with sex in the future, became a cast favorite.\r\nLater episodes in the season set the stage for serial plots. The episode \"Datalore\" introduced Data's evil twin brother Lore, who made several more appearances. \"Coming of Age\" deals with Wesley Crusher's efforts to get into Starfleet Academy while also hinting at the threat to Starfleet later faced in \"Conspiracy\". \"Heart of Glory\" explored Worf's character, Klingon culture and the uneasy truce between the Federation and the Klingon Empire, three themes that played major roles in later episodes. Tasha Yar left the show in \"Skin of Evil\", becoming the first regular Star Trek character to die permanently (although the character was seen again in two later episodes) in either series or film. The season finale, \"The Neutral Zone\", established the presence of two of TNG's most enduring villains: the Romulans, making their first appearance since the Original Series, and through foreshadowing, the Borg.\r\nThe premiere became the first television episode to be nominated for a Hugo Award since 1972. Six of the season's episodes were each nominated for an Emmy Award. \"11001001\" won for Outstanding Sound Editing for a Series, \"The Big Goodbye\" won for Outstanding Costume Design for a Series, and \"Conspiracy\" won for Outstanding Achievement in Makeup for a Series. \"The Big Goodbye\" also won a Peabody Award, the first syndicated program and only Star Trek episode to do so.\r\nThe top two episodes for Nielsen ratings were \"Encounter at Farpoint\" with 15.7, and \"Justice\" with 12.7. The season ran from 1987 to 1988.\r\nSeason 2 (1988–1989)\r\nThe series underwent significant changes during its second season. Beverly Crusher was replaced as Chief Medical Officer by Katherine Pulaski, played by Diana Muldaur, who had been a guest star in \"Return to Tomorrow\" and \"Is There in Truth No Beauty?\", two episodes from the original Star Trek series. The ship's recreational area, Ten-Forward, and its mysterious bartender/advisor, Guinan, played by Whoopi Goldberg, appeared for the first time. Owing to the 1988 Writers Guild of America strike, the number of episodes produced was cut from 26 to 22, and the start of the season was delayed. Because of the strike, the opening episode, \"The Child\", was based on a script originally written for Star Trek: Phase II, while the season finale, \"Shades of Gray\", was a clip show.\r\nNevertheless, season two as a whole was widely regarded as significantly better than season one. Benefiting from Paramount's commitment to a multiyear run and free from network interference due to syndication, Roddenberry found writers who could work within his guidelines and create drama from the cast's interaction with the rest of the universe. The plots became more sophisticated and began to mix drama with comic relief. Its focus on character development received special praise. Co-executive producer Maurice Hurley has stated that his primary goal for the season was to plan and execute season-long story arcs and character arcs. Hurley wrote the acclaimed episode \"Q Who\", which featured the first on-screen appearance of the Borg. Season two focused on developing the character Data, and two episodes from the season, \"Elementary, Dear Data\" and \"The Measure of a Man\", featured him prominently. Miles O'Brien also became a more prominent character during the second season, while Geordi La Forge took the position of Chief Engineer. Klingon issues continued to be explored in episodes such as \"A Matter of Honor\" and \"The Emissary\", which introduced Worf's former lover K'Ehleyr. Five second-season episodes were nominated for six Emmy Awards, and \"Q Who\" won for Outstanding Sound Editing for a Series and Outstanding Sound Mixing for a Drama Series. The season ran from 1988 to 1989.\r\nSeason 2 marked the addition of the \"Ten Forward\" set at Paramount, located at Stage 8 at the studios. The set was designed by Herman Zimmerman, and in the show was a place for the crew to relax, hang out together, and eat or have drinks. Inside, it featured a bar looking out on large windows, and outside it featured a star field, or with use of green-screen special effects, other scenes.\r\nSeason 3 (1989–1990)\r\nBefore the production of the third season in the summer of 1989, some personnel changes were made. Head writer Maurice Hurley was let go and Michael Piller took over for the rest of the series. Creator and executive producer Gene Roddenberry took less of an active role due to his declining health. Roddenberry gave Piller and Berman the executive producer jobs, and they remained in that position for the rest of the series' run, with Berman overseeing the production as a whole and Piller being in charge of the creative direction of the show and the writing room. McFadden returned to the cast as Doctor Crusher, replacing Muldaur, who had remained a guest star throughout the second season. An additional change was the inclusion of the fanfare that was added to the opening credits of the second season, to the end of the closing credits. Ronald D. Moore joined the show after submitting a spec script that became \"The Bonding\". He became the franchise's \"Klingon guru\", meaning that he wrote most TNG episodes dealing with the Klingon Empire (though he wrote some Romulan stories, as well, such as \"The Defector\"). Writer/producer Ira Steven Behr also joined the show in its third season. Though his tenure with TNG lasted only one year, he later went on to be a writer and showrunner of spin-off series Star Trek: Deep Space Nine. Six third-season episodes were nominated for eight Emmys. \"Yesterday's Enterprise\" won for Outstanding Sound Editing for a Series and \"Sins of the Father\" won for Best Art Direction for a Series. After a chiropractor warned that the cast members risked permanent skeletal injury, new two-piece wool uniforms replaced the first two seasons' extremely tight spandex uniforms. The season finale, the critically acclaimed episode \"The Best of Both Worlds\", was the first season-ending cliffhanger, a tradition that continued throughout the remainder of the series. The season ran from 1989 to 1990.\r\nThe Season 3 finale and bridge to Season 4, \"The Best of Both Worlds\" went on to be one of the most acclaimed Star Trek episodes noted by TV Guide's \"100 Most Memorable Moments in TV History\", ranking 70th out of 100 in March 2001. It has routinely been ranked among the top of all Star Trek franchise episodes.\r\nSeason 4 (1990–1991)\r\nBrannon Braga and Jeri Taylor joined the show in its fourth season. The fourth season surpassed the Original Series in series length with the production of TNG's 80th episode, \"Legacy\". A new alien race, the Cardassians, made their first appearance in \"The Wounded\". They later were heavily featured in Star Trek: Deep Space Nine. The season finale, \"Redemption\", was the 100th episode, and the cast and crew (including creator Gene Roddenberry) celebrated the historic milestone on the bridge set. Footage of this was seen in the Star Trek 25th-anniversary special hosted by William Shatner and Leonard Nimoy, which aired later in the year. Seven fourth-season episodes were nominated for eight Emmys. \"The Best of Both Worlds, Part II\" won for both Outstanding Sound Editing in a Series and Outstanding Sound Mixing for a Series. Character Wesley Crusher leaves the series in season four to go to Starfleet Academy. \"Family\" is the only TNG episode where Data does not appear on-screen. The season ran from 1990 to 1991.\r\nSeason 5 (1991–1992)\r\nThe fifth season's seventh episode, \"Unification\", opened with a dedication to Star Trek creator Gene Roddenberry (though the prior episode, \"The Game\", aired four days after his death). Roddenberry, though he had recently died, continued to be credited as executive producer for the rest of the season. The cast and crew learned of his death during the production of \"Hero Worship\", a later season-five episode. Seven fifth-season episodes were nominated for eight Emmys. \"Cost of Living\" won for Outstanding Individual Achievement in Costume Design for a Series and Outstanding Individual Achievement in Makeup for a Series, and \"A Matter of Time\" and \"Conundrum\" tied for Outstanding Individual Achievement in Special Visual Effects. In addition, \"The Inner Light\" became the first television episode since the 1968 original series Star Trek episode \"The City on the Edge of Forever\" to win a Hugo Award for Best Dramatic Presentation. Season five had the introduction of a jacket for Picard, worn periodically throughout the rest of the show's run. The observation lounge set was altered with the removal of the gold model starships across the interior wall and the addition of lighting beneath the windows. Recurring character Ensign Ro Laren was introduced in the fifth season. The season ran from 1991 to 1992.\r\nSeason 6 (1992–1993)\r\nWith the creation of Star Trek: Deep Space Nine, Rick Berman and Michael Piller's time were split between The Next Generation and the new show. Three sixth-season episodes were nominated for Emmys. \"Time's Arrow, Part II\" won for both Outstanding Individual Achievement in Costume Design for a Series and Outstanding Individual Achievement in Hairstyling for a Series, and \"A Fistful of Datas\" won for Outstanding Individual Achievement in Sound Mixing for a Drama Series. The highest Nielsen-rated episode of Season 6 was \"Relics\", with a rating of 13.9. The episode featured Original Series character Scotty played by James Doohan. Additionally, NASA astronaut Mae Jemison played Lt. Palmer in \"Second Chances\". The season 6 finale cliffhanger includes a cameo by Stephen Hawking (Part I of \"Descent\"). The season ran from 1992 to 1993.\r\nSeason 7 (1993–1994)\r\nThe seventh season was The Next Generation's last, running from 1993 to 1994. The penultimate episode, \"Preemptive Strike\", concluded the plot line for the recurring character Ensign Ro Laren and introduced themes that continued in Star Trek: Deep Space Nine and Star Trek: Voyager. The Next Generation series finale, \"All Good Things...\", was a double-length episode (separated into two parts for reruns) that aired the week of May 19, 1994, revisiting the events of the pilot and providing a bookend to the series. Toronto's SkyDome played host to a massive event for the series finale. Thousands of people packed the stadium to watch the final episode on the stadium's JumboTron. Five seventh-season episodes were nominated for nine Emmys, and the series as a whole was the first syndicated television series nominated for Outstanding Drama Series. To this day, The Next Generation is the only syndicated drama to be nominated in this category. \"All Good Things...\" won for Outstanding Individual Achievement in Special Visual Effects, and \"Genesis\" won for Outstanding Individual Achievement in Sound Mixing for a Drama Series. \"All Good Things...\" also won the second of the series' two Hugo Awards. \"All Good Things...\" also achieved the highest Nielsen rating for all of Season 7, with a rating of 17.4.\r\nLegacy\r\nAlthough the cast members were contracted for eight seasons, Paramount ended The Next Generation after seven, which disappointed and puzzled some of the actors, and was an unusual decision for a successful television show. Paramount then made films using the cast, which it believed would be less successful if the show were still on television. An eighth season also would likely have reduced the show's profitability due to higher cast salaries and a lower price per episode when sold as strip programming.\r\nThe show's strong ratings continued to the end; the 1994 series finale was ranked number two among all shows that week, between hits Home Improvement and Seinfeld, and was watched by over 30 million viewers. TNG was the most-watched Star Trek show, with a peak audience of 11.5 million during its fifth season prior to the launch of DS9. Between 1988 and 1992 it picked up half a million to a million additional viewers per year.\r\nAdjusted Nielsen ratings for Star Trek TV shows:\r\nFall 1987 – Spring 1988: 8.55 Million TNG S1\r\nFall 1988 – Spring 1989: 9.14 Million TNG S2\r\nFall 1989 – Spring 1990: 9.77 Million TNG S3\r\nFall 1990 – Spring 1991: 10.58 Million TNG S4\r\nFall 1991 – Spring 1992: 11.50 Million TNG S5\r\nFall 1992 – Spring 1993: 10.83 Million TNG S6 (DS9 S1 Debuted in Spring 1993)\r\nFall 1993 – Spring 1994: 9.78 Million TNG S7 + DS9 S2\r\nFall 1994 – Spring 1995: 7.05 Million DS9 S3 + VOY S1\r\nFall 1995 – Spring 1996: 6.42 Million DS9 S4 + VOY S2\r\nFall 1996 – Spring 1997: 5.03 Million DS9 S5 + VOY S3\r\nFall 1997 – Spring 1998: 4.53 Million DS9 S6 + VOY S4\r\nFall 1998 – Spring 1999: 4.00 Million DS9 S7 + VOY S5 (Voyager ended after two more seasons)\r\nScience fiction authors noted how Star Trek: The Next Generation influenced their careers.\r\nEpisodes\r\nStar Trek: The Next Generation aired for seven seasons beginning on September 28, 1987 and ending on May 23, 1994.\r\nThe series begins with the crew of the Enterprise-D put on trial by an omnipotent being known as Q, who became a recurring character. The god-like entity threatens the extinction of humanity for being a race of savages, forcing them to solve a mystery at nearby Farpoint Station to prove their worthiness to be spared. After successfully solving the mystery and avoiding disaster, the crew departs on its mission to explore strange new worlds.\r\nSubsequent stories focus on the discovery of new life and sociological and political relationships with alien cultures, as well as exploring the human condition. Several new species are introduced as recurring antagonists, including the Ferengi, the Cardassians, and the Borg. Throughout their adventures, Picard and his crew are often forced to face and live with the consequences of difficult choices.\r\nThe series ended in its seventh season with a two-part episode \"All Good Things...\", which brought the events of the series full circle to the original confrontation with Q. An interstellar anomaly that threatens all life in the universe forces Picard to leap from his present, past, and future to combat the threat. Picard was successfully able to show to Q that humanity could think outside of the confines of perception and theorize on new possibilities while still being prepared to sacrifice themselves for the sake of the greater good. The series ended with the crew of the Enterprise portrayed as feeling more like a family and paved the way for four consecutive motion pictures that continued the theme and mission of the series.\r\nCast\r\nMain\r\nPatrick Stewart as Captain Jean-Luc Picard is the commanding officer of the USS Enterprise-D. Stewart also played the character in the pilot episode of Deep Space Nine, all four TNG theater films, and in the eponymously titled latest series Star Trek: Picard.\r\nJonathan Frakes as Commander William T. Riker is the ship's first officer. The Riker character was influenced by concepts for first officer Willard Decker in the Star Trek: Phase II television series. Decker's romantic history with helmsman Ilia was mirrored in The Next Generation in the relationship between Riker and Deanna Troi. Riker also appears in an episode each of Star Trek: Voyager and Star Trek: Enterprise, and later reprised the role in Star Trek: Picard and in the animated Star Trek: Lower Decks. In addition to William Riker, Frakes played William's transporter-created double, Thomas, in one episode each of The Next Generation and Star Trek: Deep Space Nine.\r\nLeVar Burton as Lieutenant (JG)/Lieutenant/Lieutenant Commander Geordi La Forge was initially the ship's helmsman, but the character became chief engineer beginning in the second season. Burton also played the character in an episode of Voyager and the third season of Star Trek: Picard.\r\nDenise Crosby as Lieutenant Tasha Yar (season 1; guest: seasons 3 & 7) is the chief of security and tactical officer. Crosby left the series near the end of the first season, and the Yar character was killed. Yar returns in alternate timelines in the award-winning episode \"Yesterday's Enterprise\" and the series finale, \"All Good Things...\". Crosby also played Commander Sela, Yar's half-Romulan daughter.\r\nMichael Dorn as Lieutenant (JG)/Lieutenant Worf is a Klingon. Worf initially appears as a junior officer fulfilling several roles on the bridge. When Denise Crosby left near the end of the first season, the Worf character succeeded Lieutenant Yar as the ship's chief of security and tactical officer. Dorn reprised the role as a regular in seasons four through seven of Star Trek: Deep Space Nine and the third season of Star Trek: Picard. He also played another Klingon, Worf's grandfather and namesake, in Star Trek VI: The Undiscovered Country. With 284 on-screen appearances, Dorn has the most appearances of any actor in the Star Trek franchise.\r\nGates McFadden as Doctor Beverly Crusher (Seasons 1 & 3–7) is the Enterprise's chief medical officer. As a fully certified bridge officer, Dr. Crusher had the ability to command the Enterprise if circumstances required her to do so. She also, on occasion, commanded night-watch shifts on the ship's main bridge to stay on top of starship operations. McFadden was fired after the first season, but was rehired for the third season and remained for the remainder of the series. Her absence in the second season was explained by her transfer to Starfleet Medical. She returned to the role for the third season of Star Trek: Picard.\r\nMarina Sirtis as Lieutenant Commander/Commander Deanna Troi is the half-human, half-Betazoid ship's counselor. Starting in the season seven episode \"Thine Own Self\", Counselor Troi, having taken and completed the bridge-officer's test, is later promoted to the rank of commander, which allowed her to take command of the ship, and also perform bridge duties other than those of a ship's counselor. The character's relationship with first officer Riker was a carry-over from character ideas developed for Phase II. Troi also appeared in later episodes of Voyager, in the finale of Enterprise, and in the first and third seasons of Star Trek: Picard.\r\nBrent Spiner as Lieutenant Commander Data; an android who serves as second officer and operations officer. Data's \"outsider's\" perspective on humanity served a similar narrative purpose as Spock's in the original Star Trek. Spiner also played his \"brother\", Lore, and his creator, Noonien Soong. In Enterprise, Spiner played Noonien's ancestor, Arik, and contributed a brief voiceover (heard over the Enterprise-D's intercom) in the Enterprise finale. In Star Trek: Picard., Spiner reprised the roles of Data and Lore and portrayed the new roles of Altan Inigo Soong and Adam Soong.\r\nWil Wheaton as Beverly Crusher's son Wesley (Seasons 1–4; guest: seasons 5 & 7). He becomes an acting ensign, and later receives a field commission to ensign, before attending Starfleet Academy. After being a regular for the first four seasons, Wheaton appeared occasionally as Wesley Crusher for the remainder of the series. Wheaton reprised the role in Star Trek: Nemesis and Star Trek: Picard.\r\nRecurring\r\nMajel Barrett as Lwaxana Troi, Federation ambassador and Deanna Troi's mother; also the voice of the ship's computer.\r\nBrian Bonsall as Alexander Rozhenko, Worf's son.\r\nRosalind Chao as Keiko O'Brien, botanist until her transfer to Deep Space Nine in 2369.\r\nDenise Crosby as Sela, Romulan commander and Tasha Yar's daughter.\r\nJohn de Lancie as Q, a member of the Q-Continuum who frequently visits the USS Enterprise-D.\r\nJonathan Del Arco as Hugh, a Borg drone who was disconnected from the collective by Geordi La Forge and Beverly Crusher.\r\nMichelle Forbes as Ro Laren, conn officer until her defection to the Maquis in 2370.\r\nDiana Muldaur as Doctor Katherine Pulaski (Season 2) was created to replace Dr. Crusher for the show's second season. Muldaur, who previously appeared in two episodes of the original Star Trek, never received billing in the opening credits; instead, she was listed as a special guest star during the first act.\r\nWhoopi Goldberg as Guinan, bartender hostess on the USS Enterprise-D.\r\nAshley Judd as Robin Lefler, engineering officer on the USS Enterprise-D.\r\nAndreas Katsulas as Tomalak, a Romulan commander who has several encounters with the USS Enterprise-D.\r\nBarbara March as Lursa, Klingon officer from the House of Duras and B'Etor's sister.\r\nColm Meaney as Miles O'Brien, conn officer and later transporter chief until his transfer to Deep Space Nine in 2369.\r\nEric Menyuk as The Traveler, a member of a species from Tau Alpha C who mentors Wesley Crusher\r\nLycia Naff as Sonya Gomez, engineering officer on the USS Enterprise-D.\r\nNatalia Nogulich as Alynna Nechayev, flag officer in charge of Cardassian affairs.\r\nRobert O'Reilly as Gowron, leader of the Klingon Empire.\r\nSuzie Plakson as K'Ehleyr, Federation ambassador, mate to Worf and Alexander Rozhenko's mother until her death in 2367.\r\nDwight Schultz as Reginald Barclay, engineering officer until his transfer to Starfleet Communications in 2374.\r\nCarel Struycken as Mr. Homn, Lwaxana Troi's attendant.\r\nTony Todd as Kurn, Klingon officer and Worf's brother.\r\nGwynyth Walsh as B'Etor, Klingon officer from the House of Duras and Lursa's sister.\r\nPatti Yasutake as Alyssa Ogawa, medical officer and head nurse.\r\nKen Thorley as Mot, barber on the USS Enterprise-D.\r\nDaniel Davis as Professor Moriarty as a holodeck character who becomes self-aware.\r\nFor a more complete list, see Appearances\r\nStory arcs and themes\r\nStar Trek had a number of story arcs within the larger story, and oftentimes different episodes contributed to two or more different story or character arcs. Some are epitomized by the aliens the characters interact with, for example, TNG introduced the Borg and the Cardassians. The Klingons and Romulans had been introduced in The Original Series (1966–1969); however, the Klingons were somewhat rebooted with a \"turtle-head\" look, although a retcon was given to explain this in an Enterprise episode. Other story arcs focus on certain peripheral characters such as Q, Ro Laren or characters projected on the Holodeck.\r\nCertain episodes go deeper into the Klingon alien saga, which are famous for having an actual Klingon language made for them in the Star Trek universe. The Klingon stories usually involve Worf, but not all Worf-centric shows are focused on Klingons. The Duras sisters, a Klingon duo named Lursa and B'Etor, were introduced on TNG in the 1991 episode \"Redemption\". They later appeared in the film Generations.\r\nOne of the science fiction technologies featured in Star Trek: The Next Generation was an artificial reality machine called the \"Holodeck\", and several award-winning episodes featured plots centering on the peculiarities of this device. Some episodes focused on malfunctions in the holodeck, and in one case how a crew member became addicted to the environment created by the technology. The dangers of technology that allows illusion is one of ongoing themes of Star Trek going back to the 1st pilot, \"The Cage\" where aliens' power of illusion to create an artificial reality is explored. One of the plots is whether a character will confront a reality or retreat to a world of fantasy.\r\nSeveral episodes in the show also deal with the concept of time, including narrative structures around time travel, temporal loops, parallel universes, alternate universes, and more. In some episodes, the character Q is responsible for the shifts in time.\r\nReception\r\nThe Next Generation's average of 20 million viewers often exceeded both existing syndication successes such as Wheel of Fortune and network hits including Cheers and L.A. Law. Benefiting in part from many stations' decision to air each new episode twice in a week, it consistently ranked in the top ten among hour-long dramas, and networks could not prevent affiliates from preempting their shows with The Next Generation or other dramas that imitated its syndication strategy.: 124 Star Trek: The Next Generation received 18 Emmy Awards and, in its seventh season, became the first and only syndicated television show to be nominated for the Emmy for Best Dramatic Series. It was nominated for three Hugo Awards and won two. The first-season episode \"The Big Goodbye\" also won the Peabody Award for excellence in television programming.\r\nIn 1997, the episode \"The Best of Both Worlds, Part I\" was ranked No. 70 on TV Guide's 100 Greatest Episodes of All Time. In 2002, Star Trek: The Next Generation was ranked #46 on TV Guide's 50 Greatest TV Shows of All Time list, and in 2008, was ranked No. 37 on Empire's list of the 50 greatest television shows.\r\nOn October 7, 2006, one of the three original filming models of the USS Enterprise-D used on the show sold at a Christie's auction for US$576,000, making it the highest-selling item at the event. The buyer of the model was Microsoft co-founder Paul Allen, owner of the Museum of Pop Culture in Seattle. The model is on display within the Science Fiction Museum.\r\nIn 2012, Entertainment Weekly listed the show at No. 7 in the \"25 Best Cult TV Shows from the Past 25 Years\", saying, \"The original Star Trek was cult TV before cult TV was even a thing, but its younger, sleeker offspring brought, yes, a new generation into the Trekker fold, and reignited the promise of sci-fi on television.\" Although TNG did develop a cult following, it was noted for its prime-time general audience viewership also.\r\nThe flute from \"The Inner Light\" was valued at a maximum of US$1,000 when it went to auction in late 2006, but was sold for over $40,000; in this case the auctioneers admitted they had underestimated the appeal of the prop. In the days leading up to the auction, Denise Okuda, former Star Trek scenic artist and video supervisor, as well as co-writer of the auction catalog, said: \"That's the item people say they really have to have, because it's so iconic to a much-beloved episode.\"\r\nDS9's \"The Emissary\", which came out half-way through season 6 of TNG achieved a Nielsen rating of 18.8. Star Trek's ratings went into a steady decline starting with Season 6 of TNG, and the second to last episode of DS9 achieved a Nielsen rating of 3.9.\r\nIn 2017, Vulture ranked Star Trek: The Next Generation the second best live-action Star Trek television show.\r\nIn 2019, Popular Mechanics ranked Star Trek: The Next Generation the third best science fiction television show ever.\r\nIn 2021, Empire magazine ranked it the 17th greatest television show ever. They point out it was hard to follow in the reputation of the original series, but the series found its footing and paved the way for more spin-offs.\r\nInternational broadcasts\r\nThe Next Generation was first broadcast on UK terrestrial TV on BBC2 with the first episode shown on 26 September 1990. The sequence remained the same as the US releases for the first four episodes, but after this they were somewhat shuffled about.\r\nGames\r\nVideo games based on The Next Generation TV series, movies, and characters include:\r\nStar Trek: The Next Generation (1993) (NES / Game Boy)\r\nStar Trek: The Next Generation: Future's Past (1993), for the SNES Star Trek: The Next Generation: Echoes from the Past (1993) a port of Future's Past for the Sega Genesis\r\nStar Trek: The Next Generation: Echoes from the Past (1993) a port of Future's Past for the Sega Genesis\r\nStar Trek Generations: Beyond the Nexus (1994), for Nintendo Game Boy or Sega Game Gear\r\nStar Trek: The Next Generation – A Final Unity (1995), for MS-DOS or Macintosh. A Final Unity sold 500,000 copies by 1996 and was noted in the U.K. PC Gamer Magazine for how it \"translates the atmosphere and 'feel' of The Next Generation almost perfectly\".\r\nStar Trek: Borg (1996), includes live action segments directed by James L. Conway and acting by John de Lancie as Q\r\nStar Trek: Klingon (1996), for PC and Mac\r\nStar Trek Generations (1997), for PC\r\nStar Trek: The Next Generation: Klingon Honor Guard (1998), for Mac and PC\r\nStar Trek: The Game Show (1998), for PC and Mac\r\nStar Trek: The Next Generation: Birth of the Federation (1999), for PC\r\nStar Trek: Hidden Evil (1999), for PC\r\nStar Trek Invasion (2000), for the PlayStation\r\nStar Trek Armada (2000), for Microsoft Windows 98\r\nStar Trek: Armada II (2001)\r\nStar Trek: Bridge Commander (2002)\r\nStar Trek: Legacy (2006) (PC, Xbox 360)\r\nStar Trek: Conquest (2007) (Wii, PlayStation 2)\r\nThe Enterprise and its setting is also in other Trekiverse games like Star Trek: Armada (2000). For example, in Star Trek: Armada voice actors from The Next Generation returned to their characters in the game including Patrick Stewart reprising the roles of Jean-Luc Picard and Locutus, Michael Dorn voiced Worf, Denise Crosby reprised Sela, and J. G. Hertzler voiced Chancellor Martok. Several other voice actors who had been previously unaffiliated with Star Trek also voiced characters in the game, among them was Richard Penn.\r\nStar Trek: Armada II was set in the Star Trek: The Next Generation era of the Star Trek universe.\r\nStar Trek: Hidden Evil (1999) included voice acting by Brent Spiner as Data and Patrick Stewart as Picard, and was a follow-up to the ninth Star Trek film Star Trek: Insurrection.\r\nBoard Games:\r\nStar Trek: The Next Generation Interactive VCR Board Game This game is played with television with VCR player, and also a game board.\r\nThis game is played with television with VCR player, and also a game board.\r\nStar Trek: The Next Generation, a 1993 board game\r\nStar Trek: Five-Year Mission (also included TOS)\r\nPinball:\r\nStar Trek: The Next Generation (pinball)\r\n(includes other series)\r\nFilms\r\nFour films feature the characters of the series: Star Trek Generations (1994), Star Trek: First Contact (1996), Star Trek: Insurrection (1998), and Star Trek: Nemesis (2002).\r\nAn ancestor of Worf, also played by Dorn, appeared in Star Trek VI: The Undiscovered Country.\r\nI think it was kind of an honor they had my character be sort of the link between the two series. It was wonderful to be working with the other cast (from the original Star Trek series). It was kind of a fantasy because who would have thought when I was watching the original show that I'd be working in the movie? Beyond that, it's like professionalism takes over and you just kind of do the best you can and not make yourself look bad.— Dorn on his role in The Undiscovered Country\r\nHome media\r\nStar Trek harnessed the emergence of home video technologies that rose to prominence in the 1980s as new revenue and promotion avenue. Star Trek: The Next Generation had release in part or in full on VHS, Betamax, LaserDisc, DVD, and Blu-ray media.\r\nVHS\r\nAll episodes of Star Trek: The Next Generation were made available on VHS cassettes, starting in 1991. The entire series was gradually released on VHS over the next few years during the remainder of the show's run and after the show had ended.\r\nThe VHS for TNG were available on mail-order, with usually two episodes per cassette.\r\nBeta\r\nSome episodes had releases on the tape videocassette format Betamax. Releases of all Betamax publications including those of the Star Trek: The Next Generation was halted in the early 1990s.\r\nLaserDisc\r\nParamount published all episodes on the LaserDisc format from October 1991 using an extended release schedule that concluded in May 1999. Each disc featured two episodes with Closed Captions, Digital Audio, and CX encoding. Also published were four themed \"collections\", or boxed sets, of related episodes. These included The Borg Collective, The Q Continuum, Worf: Return to Grace, and The Captains Collection.\r\nFor example, the \"Q Continuum\" collection of LaserDisc featured 4 episodes. The collection was released on July 30, 1997 and was published by Paramount Home Video; it retailed for US$99.98. The set included the 2-part \"Encounter at Farpoint\", \"Hide & Q\", \"Q Who?\", and \"Deja Q\" on 12 inch optical discs in NTSC format with a total runtime of 230 minutes, with stereo sound. The collection came in a Tri-Fold jacket that also included a letter from actor Jon De Lancie (Q).\r\nThere was a production error with episode 166, \"Sub Rosa\", where a faulty master tape was used that was missing 4½ minutes of footage. Though a new master copy of the episode was obtained, no corrected pressing of this disc was issued.\r\nStar Trek: The Next Generation was also released on LaserDisc in the non-US markets Japan and Europe. In Japan, all episodes were released in a series of 14 boxed sets (two boxed sets per season), and as with the US releases were in the NTSC format and ordered by production code. The European laserdiscs were released in the PAL format and included the ten two-part telemovies as well as a disc featuring the episodes Yesterday's Enterprise and Cause And Effect. The pilot episode, Encounter At Farpoint, was also included in a boxed set called Star Trek: The Pilots featuring the pilot episodes from Star Trek: The Original Series, Star Trek: The Next Generation, Star Trek: Deep Space Nine, and Star Trek: Voyager.\r\nDVD\r\nThe first season of the series was released on DVD in March 2002. Throughout the year the next six seasons were released at various times on DVD, with the seventh season being released in December 2002. To commemorate the 20th anniversary of the series, CBS Home Entertainment and Paramount Home Entertainment released Star Trek: The Next Generation – The Complete Series on October 2, 2007. The DVD box set contains 49 discs. Between March 2006 and September 2008, \"Fan Collective\" editions were released containing select episodes of The Next Generation (and The Original Series, Deep Space Nine, and Voyager) based on various themes. The individual episodes were chosen by fans voting on StarTrek.com. In total, six \"Fan Collectives\" were produced, along with a boxed set containing the first five collectives. In April 2013 all seven seasons of Star Trek: The Next Generation were re-released in new packaging featuring a silhouette of a different cast member on each box. However, the discs contained the identical content that was previously released in 2002. Another full DVD set was released in 2020 but it also contains the same content from the previous 2002 release.\r\nBlu-ray\r\nCBS announced on September 28, 2011, in celebration of the series' twenty-fifth anniversary, that Star Trek: The Next Generation would be completely remastered in 1080p high definition from the original 35mm film negatives. The original show was edited and post-processed in standard definition for broadcast, as were all the show's visual effects (e.g. all exterior shots of the Enterprise, phaser fire, or beaming fade-ins and -outs). For the remaster almost 25,000 reels of original film stock were rescanned and reedited, and all visual effects were digitally recomposed from original large-format negatives and newly created CGI shots. The release was accompanied by 7.1 DTS Master Audio. Michael Okuda believes this is the largest film restoration project ever attempted. The process of making high-definition versions of the series was an extraordinarily labor-intensive ordeal that cost Paramount Pictures over $12 million. The project was a financial failure and resulted in Paramount deciding very firmly against giving Deep Space Nine and Voyager the same treatment.\r\nAn initial disc featuring the episodes \"Encounter at Farpoint\", \"Sins of the Father\", and \"The Inner Light\" was released on January 31, 2012 under the label \"The Next Level\". The six-disc first season set was released on July 24, 2012. The remaining seasons were released periodically thereafter, culminating in the release of the seventh season on December 2, 2014. Season 1 sold 95,000 units in its launch week in 2012. The Blu-ray sets include many special features and videos, such as a 1988 episode of Reading Rainbow where LeVar Burton (who plays Geordi on TNG) documents the making of a Star Trek: The Next Generation episode.\r\nThe entire re-mastered series is available on Blu-ray as individual seasons, and as a 41-disc box set titled The Full Journey. Eventually, all remastered episodes became available for television syndication and digital distribution.\r\nStandalone episodes\r\nWhen TNG was remastered in high definition, several episodes were released as stand-alone single show Blu-ray products. \"The Best of Both Worlds\" is split between two seasons, whereas the standalone product includes parts 1 and 2. \"The Best of Both Worlds\" single was released in April 2013 coinciding with the release of Season 3. Other singles of TNG HD include the two part shows \"Redemption\", \"Unification\", \"Chain of Command\", and \"All Good Things…\".\r\n\"The Measure of a Man\" HD extended cut\r\n\"The Measure of a Man\" was released in HD in 2012 with an extended cut. The extended version includes an extra 13 minutes of footage as well as recreated special effects. It was released as part of the Season 2 collection set.\r\nStreaming and syndication\r\nStar Trek: The Next Generation is available on various streaming video services, including Amazon Prime Video, Apple iTunes, and Paramount+, under various qualities and terms. The Netflix version included some additional special effect improvements. One service stated that by 2017 the most re-watched episodes of Star Trek:The Next Generation among the most re-watched Star Trek franchise shows in their offerings, were \"The Best of Both Worlds, Part I\", \"The Best of Both Worlds, Part II\", \"Q Who\", and \"Clues\". Streaming offerings were noted for binge watching, including Star Trek: The Next Generation 178 episodes among the overall 726 episodes and 12 movies that had been released prior to Star Trek: Discovery in late 2017.\r\nAs of the late 2010s, Star Trek: The Next Generation is syndicated to air in the United States on the cable network BBC America and the broadcast channel network Heroes & Icons.\r\nStar Trek : The Next Generation episodes have been featured in TV specials and marathons. For example, for Saint Patrick's Day BBC America planned a marathon with the episodes including \"The Best of Both Worlds\", \"Time's Arrow\", \"Chain of Command\", \"Tapestry\", and the series finale, \"All Good Things...\". On the launch of Paramount+ streaming service, on March 4, 2021, a free Star Trek marathon was presented, featuring the pilots of the various Star Trek television series, including TNG. The marathon started at 7 am PT/10 am ET and streamed on the YouTube internet video platform and ran all day.\r\nSpin-offs and the franchise\r\nStar Trek: The Next Generation spawned different media set in its universe, which was primarily the 2370s but set in the same universe as first Star Trek TV shows of the 1960s. This included the aforementioned films, computer games, board games, theme parks, etc. In the 2010s there were rumors of a Captain Worf spin-off, the Klingon bridge officer that debuted on TNG and was also featured in the TNG spin-off show Deep Space Nine.\r\nA documentary called Journey's End: The Saga of Star Trek – The Next Generation was released in 1994. Directed by Donald R. Beck, it featured the cast of the show and explored the last season and the then upcoming film Generations.\r\nNovels\r\nStar Trek: The Next Generation-era novels (examples):\r\n\"These Are the Voyages...\" (2005)\r\nIn 2005, the last episode of Star Trek: Enterprise called \"These Are the Voyages...\" (S4E22) featured a holodeck simulation on the USS Enterprise (NCC-1701-D) from Star Trek: The Next Generation during the events of the episode \"The Pegasus\" and the return of Commander William Riker (Jonathan Frakes) and Counselor Deanna Troi (Marina Sirtis). It was written by Berman and Braga, who noted \"... this was a very cool episode because it has a great concept driving it\".\r\nStar Trek: Enterprise was the TV show launched following the conclusion of Star Trek: Voyager and was set 100 years before TOS and 200 years before TNG, in addition to including some soft reboot elements with an all new cast. Some episodes connected to TNG directly including guest stars by Brent Spiner and connections to the events in TNG's fictional universe. The three-episode story arc consisting of \"Borderland\", \"Cold Station 12\", and \"The Augments\", with a Soong ancestor portrayed by The Next Generation regular Brent Spiner provides some backstory to Data's origins. Also, the Enterprise episode \"Affliction\" helps explain the smooth-headed Klingons that sometimes appeared, a retcon that helped explain this varying presentation between TOS, TNG, and the films.\r\nStar Trek would not return to television as a show for over 12 years, until the debut of Star Trek: Discovery initially on CBS but thereafter exclusively available on the Internet service CBS All Access (Netflix internationally) at that time. The film franchise was rebooted in 2009, essentially a grafted on fork off of the timeline known in Star Trek: The Next Generation. That movie contains an event from the TNG timeline, which is the destruction of Romulus and the flight of Spock's special ship to the time fork. In the Star Trek franchise, witnessing the events of time shenanigans is a common plot device.\r\nThe return of Picard\r\nOn August 4, 2018, Patrick Stewart stated on social media that he would return to the role of Jean-Luc Picard in a project with CBS All Access.\r\nStewart wrote, \"I will always be very proud to have been a part of Star Trek: The Next Generation, but when we wrapped that final movie in the spring of 2002, I truly felt my time with Star Trek had run its natural course. It is, therefore, an unexpected but delightful surprise to find myself excited and invigorated to be returning to Jean-Luc Picard and to explore new dimensions within him. Seeking out new life for him, when I thought that life was over.\r\n\"During these past years, it has been humbling to hear stories about how The Next Generation brought people comfort, saw them through difficult periods in their lives or how the example of Jean-Luc inspired so many to follow in his footsteps, pursuing science, exploration and leadership. I feel I'm ready to return to him for the same reason – to research and experience what comforting and reforming light he might shine on these often very dark times. I look forward to working with our brilliant creative team as we endeavor to bring a fresh, unexpected and pertinent story to life once more.\"\r\nIn January 2019, the producer said that the Picard series will answer questions about what happened to Captain Picard in the 20 years after Star Trek: Nemesis.\r\nContext\r\nThis infographic shows the first-run production timeline of various Star Trek franchise shows and films, including Star Trek: The Next Generation.",
    "html": "<p>Star Trek: The Next Generation (TNG) is an American science fiction television series created by Gene Roddenberry. It originally aired from September 28, 1987, to May 23, 1994, in syndication, spanning 178 episodes over seven seasons. The third series in the Star Trek franchise, it was inspired by Star Trek: The Original Series. Set in the latter third of the 24th century, when Earth is part of the United Federation of Planets, it follows the adventures of a Starfleet starship, the USS Enterprise (NCC-1701-D), in its exploration of the Alpha quadrant in the Milky Way galaxy.</p><p>In the 1980s, Roddenberry—who was responsible for the original Star Trek, Star Trek: The Animated Series (1973–1974), and the first of a series of films—was tasked by Paramount Pictures with creating a new series in the franchise. He decided to set it a century after the events of his original series. The Next Generation featured a new crew: Patrick Stewart as Captain Jean-Luc Picard, Jonathan Frakes as William Riker, Brent Spiner as Data, Michael Dorn as Worf, LeVar Burton as Geordi La Forge, Marina Sirtis as Deanna Troi, Gates McFadden as Dr. Beverly Crusher, Denise Crosby as Tasha Yar, Wil Wheaton as Wesley Crusher, and a new Enterprise.</p><p>Roddenberry, Maurice Hurley, Rick Berman, Michael Piller, and Jeri Taylor served as executive producers at various times throughout its production. The series was broadcast in first-run syndication with dates and times varying among individual television stations. Stewart's voice-over introduction during each episode's opening credits stated the starship's purpose:</p><blockquote>Space: the final frontier. These are the voyages of the starship Enterprise. Its continuing mission: to explore strange new worlds, to seek out new life and new civilizations, to boldly go where no one has gone before.</blockquote><p>The show was very popular, reaching almost 12 million viewers in its 5th season, with the series finale in 1994 watched by over 30 million viewers. Due to its success, Paramount commissioned Rick Berman and Michael Piller to create a fourth series in the franchise, Star Trek: Deep Space Nine, which launched in 1993. The characters from The Next Generation returned in four films: Star Trek Generations (1994), Star Trek: First Contact (1996), Star Trek: Insurrection (1998), and Star Trek: Nemesis (2002), and in the television series Star Trek: Picard (2020–2023). The series is also the setting of numerous novels, comic books, and video games. It received many accolades, including 19 Emmy Awards, two Hugo Awards, five Saturn Awards, and a Peabody Award.</p><br/><h3>Production</h3><p>The Star Trek franchise originated in the 1960s, with the Star Trek television show which ran from 1966 to 1969. Star Trek: The Next Generation would mark the return of Star Trek to live-action broadcast television.</p><h4>Background</h4><p>Due to the original series' popularity in syndication, Paramount Pictures began to consider making a Star Trek film as early as 1972. However, with 1977's release of Star Wars, Paramount decided not to compete in the science fiction movie category and shifted their efforts to a new Star Trek television series. The Original Series actors were approached to reprise their roles; sketches, models, sets and props were created for Star Trek: Phase II until Paramount changed its mind again and decided to create feature films starring the Original Series cast.</p><p>By 1986, 20 years after the original Star Trek's debut on NBC, the franchise's longevity amazed Paramount Pictures executives. Chairman Frank Mancuso Sr. observed that \"The shelf life in this business is usually three days. To flourish for 20 years...\" He and others described Trek as the studio's \"crown jewel\", a \"priceless asset\" that \"must not be squandered\". The series was the most popular syndicated television program 17 years after cancellation, and the Harve Bennett-produced, Original Series-era Star Trek films did well at the box office. William Shatner and Leonard Nimoy's salary demands for the film Star Trek IV: The Voyage Home (1986) caused the studio to plan for a new Star Trek television series. Paramount executives worried that a new series could hurt the demand for the films, but decided that it would increase their appeal on videocassette and cable, and that a series with unknown actors would be more profitable than paying the films' actors' large salaries. Roddenberry initially declined to be involved, but came on board as creator after being unhappy with early conceptual work. Star Trek: The Next Generation was announced on October 10, 1986, and its cast in May 1987.</p><p>Paramount executive Rick Berman was assigned to the series at Roddenberry's request. Roddenberry hired a number of Star Trek veterans, including Bob Justman, D. C. Fontana, Eddie Milkis and David Gerrold. Early proposals for the series included one in which some of the original series cast might appear as \"elder statesmen\", and Roddenberry speculated as late as October 1986 that the new series might not even use a spaceship, as \"people might travel by some means\" 100 years after the USS Enterprise. A more lasting change was his new belief that workplace interpersonal conflict would no longer exist in the future; thus, the new series did not have parallels to the frequent \"crusty banter\" between Kirk, Spock, and Leonard McCoy. According to series actor Patrick Stewart, Berman was more receptive than Roddenberry to the series addressing political issues.</p><p>The series' music theme combined the fanfare from the original series theme by Alexander Courage with Jerry Goldsmith's theme for Star Trek: The Motion Picture (1979). Some early episodes' plots derived from outlines created for Star Trek: Phase II. Additionally, some sets used in the Original Series-era films were redressed for The Next Generation, and in turn used for subsequent Original Series films. Part of the transporter room set in TNG was used in the original Star Trek's transporter set.</p><h4>Syndication and profitability</h4><p>Despite Star Trek's proven success, NBC and ABC only offered to consider pilot scripts for the new series, and CBS offered to air a miniseries that could become a series if it did well. Paramount executives were offended that the Big Three television networks treated their most appealing and valuable property like any other series. Fox wanted the show to help launch the new network, but wanted it by March 1987, and would only commit to 13 episodes instead of a full season. The unsuccessful negotiations convinced the studio that it could only protect Star Trek with full control.</p><p>Paramount increased and accelerated the show's profitability by choosing to instead broadcast it in first-run syndication: 123–124 on independent stations (whose numbers had more than tripled since 1980) and Big Three network affiliates. The studio offered the show to local stations for free as barter syndication. The stations sold five minutes of commercial time to local advertisers and Paramount sold the remaining seven minutes to national advertisers. Stations had to commit to purchasing reruns in the future, and only those that aired the new show could purchase the popular reruns of the Original Series.: 222</p><p>The studio's strategy succeeded. Most of the 150 stations airing reruns of the original Star Trek wanted to prevent a competitor from airing the new show; ultimately, 210 stations covering 90% of the United States became part of Paramount's informal nationwide network for TNG. In early October 1987, more than 50 network affiliates pre-empted their own shows for the series pilot, \"Encounter at Farpoint\". One station predicted that \"Star Trek promises to be one of the most successful programs of the season, network or syndicated\". Special effects were by Industrial Light and Magic, a Division of Lucasfilm. The new show indeed performed well; the pilot's ratings were higher than those of many network programs, and ratings remained comparable to network shows by the end of the first season, despite the handicap of each station airing the show on a different day and time, often outside prime time. By the end of the first season, Paramount reportedly received $1 million for advertising per episode, more than the roughly $800,000 fee that networks typically paid for a one-hour show; by 1992, when the budget for each episode had risen to almost $2 million, the studio earned $90 million from advertising annually from first-run episodes, with each 30-second commercial selling for $115,000 to $150,000. The show had a 40% return on investment for Paramount, with $30 to $60 million in annual upfront net profit for first-run episodes and another $70 million for stripping rights for each of the about 100 episodes then available, so they did not need overseas sales to be successful.</p><br/><h3>Seasons</h3><p>Star Trek: The Next Generation ran for 178 episodes, over seven seasons, from the fall of 1987 annually to the spring of 1994. At the end of that season, the cast switched over to production of the Star Trek film Generations which was released before the end of 1994.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 28, 1987</td><td style=\"padding:0 8px\">May 16, 1988</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">22</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">November 21, 1988</td><td style=\"padding:0 8px\">July 17, 1989</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 25, 1989</td><td style=\"padding:0 8px\">June 18, 1990</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 24, 1990</td><td style=\"padding:0 8px\">June 17, 1991</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 23, 1991</td><td style=\"padding:0 8px\">June 15, 1992</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 21, 1992</td><td style=\"padding:0 8px\">June 21, 1993</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>7</span></span></span></span></th><td colspan=\"2\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 20, 1993</td><td style=\"padding:0 8px\">May 23, 1994</td></tr></tbody></table><h4>Season 1 (1987–1988)</h4><p>The Next Generation was shot on 35 mm film and the budget for each episode was $1.3 million, among the highest for a one-hour television drama. While the staff enjoyed the creative freedom gained by independence from a broadcast network's Standards and Practices department, the first season was marked by a \"revolving door\" of writers, with Gerrold, Fontana and others quitting after disputes with Roddenberry.: 222 Roddenberry \"virtually rewrote\" the first 15 episodes because of his \"dogmatic\" intention to depict human interaction \"without drawing on the baser motives of greed, lust, and power\". Writers found the show's \"bible\" constricting and ridiculous and could not deal with Roddenberry's ego and treatment of them. It stated, for example, that \"regular characters all share a feeling of being part of a band of brothers and sisters. As in the original Star Trek, we invite the audience to share the same feeling of affection for our characters.\" David Gerrold claimed that at one point, Roddenberry's lawyer came aboard and started taking apart six months of work, including the removal of a gay couple that Roddenberry had promised would be included in the series, which made Gerrold decide to leave the show.</p><p>Mark Bourne of The DVD Journal wrote of season one: \"A typical episode relied on trite plot points, clumsy allegories, dry and stilted dialogue, or characterization that was taking too long to feel relaxed and natural.\" Other targets of criticism included poor special effects and plots being resolved by the deus ex machina of Wesley Crusher saving the ship. Patrick Stewart's acting won praise, and critics noted that characters were given greater potential for development than those of the original series. Actors and producers were unsure whether Trekkies loyal to the original show would accept the new one but one critic stated as early as October 1987 that The Next Generation, not the movies or the original show, \"is the real Star Trek now\".</p><p>While the events of most episodes of season one were self-contained, many developments important to the show occurred during the season. The recurring nemesis Q was introduced in the pilot, the alien Ferengi had their sentinel showing in \"The Last Outpost\", the holodeck was introduced and the romantic backstory between William Riker and Deanna Troi was investigated. \"The Naked Now\", one of the few episodes that depicted Roddenberry's fascination (as seen in the show's bible) with sex in the future, became a cast favorite.</p><p>Later episodes in the season set the stage for serial plots. The episode \"Datalore\" introduced Data's evil twin brother Lore, who made several more appearances. \"Coming of Age\" deals with Wesley Crusher's efforts to get into Starfleet Academy while also hinting at the threat to Starfleet later faced in \"Conspiracy\". \"Heart of Glory\" explored Worf's character, Klingon culture and the uneasy truce between the Federation and the Klingon Empire, three themes that played major roles in later episodes. Tasha Yar left the show in \"Skin of Evil\", becoming the first regular Star Trek character to die permanently (although the character was seen again in two later episodes) in either series or film. The season finale, \"The Neutral Zone\", established the presence of two of TNG's most enduring villains: the Romulans, making their first appearance since the Original Series, and through foreshadowing, the Borg.</p><p>The premiere became the first television episode to be nominated for a Hugo Award since 1972. Six of the season's episodes were each nominated for an Emmy Award. \"11001001\" won for Outstanding Sound Editing for a Series, \"The Big Goodbye\" won for Outstanding Costume Design for a Series, and \"Conspiracy\" won for Outstanding Achievement in Makeup for a Series. \"The Big Goodbye\" also won a Peabody Award, the first syndicated program and only Star Trek episode to do so.</p><p>The top two episodes for Nielsen ratings were \"Encounter at Farpoint\" with 15.7, and \"Justice\" with 12.7. The season ran from 1987 to 1988.</p><h4>Season 2 (1988–1989)</h4><p>The series underwent significant changes during its second season. Beverly Crusher was replaced as Chief Medical Officer by Katherine Pulaski, played by Diana Muldaur, who had been a guest star in \"Return to Tomorrow\" and \"Is There in Truth No Beauty?\", two episodes from the original Star Trek series. The ship's recreational area, Ten-Forward, and its mysterious bartender/advisor, Guinan, played by Whoopi Goldberg, appeared for the first time. Owing to the 1988 Writers Guild of America strike, the number of episodes produced was cut from 26 to 22, and the start of the season was delayed. Because of the strike, the opening episode, \"The Child\", was based on a script originally written for Star Trek: Phase II, while the season finale, \"Shades of Gray\", was a clip show.</p><p>Nevertheless, season two as a whole was widely regarded as significantly better than season one. Benefiting from Paramount's commitment to a multiyear run and free from network interference due to syndication, Roddenberry found writers who could work within his guidelines and create drama from the cast's interaction with the rest of the universe. The plots became more sophisticated and began to mix drama with comic relief. Its focus on character development received special praise. Co-executive producer Maurice Hurley has stated that his primary goal for the season was to plan and execute season-long story arcs and character arcs. Hurley wrote the acclaimed episode \"Q Who\", which featured the first on-screen appearance of the Borg. Season two focused on developing the character Data, and two episodes from the season, \"Elementary, Dear Data\" and \"The Measure of a Man\", featured him prominently. Miles O'Brien also became a more prominent character during the second season, while Geordi La Forge took the position of Chief Engineer. Klingon issues continued to be explored in episodes such as \"A Matter of Honor\" and \"The Emissary\", which introduced Worf's former lover K'Ehleyr. Five second-season episodes were nominated for six Emmy Awards, and \"Q Who\" won for Outstanding Sound Editing for a Series and Outstanding Sound Mixing for a Drama Series. The season ran from 1988 to 1989.</p><p>Season 2 marked the addition of the \"Ten Forward\" set at Paramount, located at Stage 8 at the studios. The set was designed by Herman Zimmerman, and in the show was a place for the crew to relax, hang out together, and eat or have drinks. Inside, it featured a bar looking out on large windows, and outside it featured a star field, or with use of green-screen special effects, other scenes.</p><h4>Season 3 (1989–1990)</h4><p>Before the production of the third season in the summer of 1989, some personnel changes were made. Head writer Maurice Hurley was let go and Michael Piller took over for the rest of the series. Creator and executive producer Gene Roddenberry took less of an active role due to his declining health. Roddenberry gave Piller and Berman the executive producer jobs, and they remained in that position for the rest of the series' run, with Berman overseeing the production as a whole and Piller being in charge of the creative direction of the show and the writing room. McFadden returned to the cast as Doctor Crusher, replacing Muldaur, who had remained a guest star throughout the second season. An additional change was the inclusion of the fanfare that was added to the opening credits of the second season, to the end of the closing credits. Ronald D. Moore joined the show after submitting a spec script that became \"The Bonding\". He became the franchise's \"Klingon guru\", meaning that he wrote most TNG episodes dealing with the Klingon Empire (though he wrote some Romulan stories, as well, such as \"The Defector\"). Writer/producer Ira Steven Behr also joined the show in its third season. Though his tenure with TNG lasted only one year, he later went on to be a writer and showrunner of spin-off series Star Trek: Deep Space Nine. Six third-season episodes were nominated for eight Emmys. \"Yesterday's Enterprise\" won for Outstanding Sound Editing for a Series and \"Sins of the Father\" won for Best Art Direction for a Series. After a chiropractor warned that the cast members risked permanent skeletal injury, new two-piece wool uniforms replaced the first two seasons' extremely tight spandex uniforms. The season finale, the critically acclaimed episode \"The Best of Both Worlds\", was the first season-ending cliffhanger, a tradition that continued throughout the remainder of the series. The season ran from 1989 to 1990.</p><p>The Season 3 finale and bridge to Season 4, \"The Best of Both Worlds\" went on to be one of the most acclaimed Star Trek episodes noted by TV Guide's \"100 Most Memorable Moments in TV History\", ranking 70th out of 100 in March 2001. It has routinely been ranked among the top of all Star Trek franchise episodes.</p><h4>Season 4 (1990–1991)</h4><p>Brannon Braga and Jeri Taylor joined the show in its fourth season. The fourth season surpassed the Original Series in series length with the production of TNG's 80th episode, \"Legacy\". A new alien race, the Cardassians, made their first appearance in \"The Wounded\". They later were heavily featured in Star Trek: Deep Space Nine. The season finale, \"Redemption\", was the 100th episode, and the cast and crew (including creator Gene Roddenberry) celebrated the historic milestone on the bridge set. Footage of this was seen in the Star Trek 25th-anniversary special hosted by William Shatner and Leonard Nimoy, which aired later in the year. Seven fourth-season episodes were nominated for eight Emmys. \"The Best of Both Worlds, Part II\" won for both Outstanding Sound Editing in a Series and Outstanding Sound Mixing for a Series. Character Wesley Crusher leaves the series in season four to go to Starfleet Academy. \"Family\" is the only TNG episode where Data does not appear on-screen. The season ran from 1990 to 1991.</p><h4>Season 5 (1991–1992)</h4><p>The fifth season's seventh episode, \"Unification\", opened with a dedication to Star Trek creator Gene Roddenberry (though the prior episode, \"The Game\", aired four days after his death). Roddenberry, though he had recently died, continued to be credited as executive producer for the rest of the season. The cast and crew learned of his death during the production of \"Hero Worship\", a later season-five episode. Seven fifth-season episodes were nominated for eight Emmys. \"Cost of Living\" won for Outstanding Individual Achievement in Costume Design for a Series and Outstanding Individual Achievement in Makeup for a Series, and \"A Matter of Time\" and \"Conundrum\" tied for Outstanding Individual Achievement in Special Visual Effects. In addition, \"The Inner Light\" became the first television episode since the 1968 original series Star Trek episode \"The City on the Edge of Forever\" to win a Hugo Award for Best Dramatic Presentation. Season five had the introduction of a jacket for Picard, worn periodically throughout the rest of the show's run. The observation lounge set was altered with the removal of the gold model starships across the interior wall and the addition of lighting beneath the windows. Recurring character Ensign Ro Laren was introduced in the fifth season. The season ran from 1991 to 1992.</p><h4>Season 6 (1992–1993)</h4><p>With the creation of Star Trek: Deep Space Nine, Rick Berman and Michael Piller's time were split between The Next Generation and the new show. Three sixth-season episodes were nominated for Emmys. \"Time's Arrow, Part II\" won for both Outstanding Individual Achievement in Costume Design for a Series and Outstanding Individual Achievement in Hairstyling for a Series, and \"A Fistful of Datas\" won for Outstanding Individual Achievement in Sound Mixing for a Drama Series. The highest Nielsen-rated episode of Season 6 was \"Relics\", with a rating of 13.9. The episode featured Original Series character Scotty played by James Doohan. Additionally, NASA astronaut Mae Jemison played Lt. Palmer in \"Second Chances\". The season 6 finale cliffhanger includes a cameo by Stephen Hawking (Part I of \"Descent\"). The season ran from 1992 to 1993.</p><h4>Season 7 (1993–1994)</h4><p>The seventh season was The Next Generation's last, running from 1993 to 1994. The penultimate episode, \"Preemptive Strike\", concluded the plot line for the recurring character Ensign Ro Laren and introduced themes that continued in Star Trek: Deep Space Nine and Star Trek: Voyager. The Next Generation series finale, \"All Good Things...\", was a double-length episode (separated into two parts for reruns) that aired the week of May 19, 1994, revisiting the events of the pilot and providing a bookend to the series. Toronto's SkyDome played host to a massive event for the series finale. Thousands of people packed the stadium to watch the final episode on the stadium's JumboTron. Five seventh-season episodes were nominated for nine Emmys, and the series as a whole was the first syndicated television series nominated for Outstanding Drama Series. To this day, The Next Generation is the only syndicated drama to be nominated in this category. \"All Good Things...\" won for Outstanding Individual Achievement in Special Visual Effects, and \"Genesis\" won for Outstanding Individual Achievement in Sound Mixing for a Drama Series. \"All Good Things...\" also won the second of the series' two Hugo Awards. \"All Good Things...\" also achieved the highest Nielsen rating for all of Season 7, with a rating of 17.4.</p><h4>Legacy</h4><p>Although the cast members were contracted for eight seasons, Paramount ended The Next Generation after seven, which disappointed and puzzled some of the actors, and was an unusual decision for a successful television show. Paramount then made films using the cast, which it believed would be less successful if the show were still on television. An eighth season also would likely have reduced the show's profitability due to higher cast salaries and a lower price per episode when sold as strip programming.</p><p>The show's strong ratings continued to the end; the 1994 series finale was ranked number two among all shows that week, between hits Home Improvement and Seinfeld, and was watched by over 30 million viewers. TNG was the most-watched Star Trek show, with a peak audience of 11.5 million during its fifth season prior to the launch of DS9. Between 1988 and 1992 it picked up half a million to a million additional viewers per year.</p><p>Adjusted Nielsen ratings for Star Trek TV shows:</p><ul><li>Fall 1987 – Spring 1988: 8.55 Million TNG S1</li><li>Fall 1988 – Spring 1989: 9.14 Million TNG S2</li><li>Fall 1989 – Spring 1990: 9.77 Million TNG S3</li><li>Fall 1990 – Spring 1991: 10.58 Million TNG S4</li><li>Fall 1991 – Spring 1992: 11.50 Million TNG S5</li><li>Fall 1992 – Spring 1993: 10.83 Million TNG S6 (DS9 S1 Debuted in Spring 1993)</li><li>Fall 1993 – Spring 1994: 9.78 Million TNG S7 + DS9 S2</li><li>Fall 1994 – Spring 1995: 7.05 Million DS9 S3 + VOY S1</li><li>Fall 1995 – Spring 1996: 6.42 Million DS9 S4 + VOY S2</li><li>Fall 1996 – Spring 1997: 5.03 Million DS9 S5 + VOY S3</li><li>Fall 1997 – Spring 1998: 4.53 Million DS9 S6 + VOY S4</li><li>Fall 1998 – Spring 1999: 4.00 Million DS9 S7 + VOY S5 (Voyager ended after two more seasons)</li></ul><p>Science fiction authors noted how Star Trek: The Next Generation influenced their careers.</p><br/><h3>Episodes</h3><p>Star Trek: The Next Generation aired for seven seasons beginning on September 28, 1987 and ending on May 23, 1994.</p><p>The series begins with the crew of the Enterprise-D put on trial by an omnipotent being known as Q, who became a recurring character. The god-like entity threatens the extinction of humanity for being a race of savages, forcing them to solve a mystery at nearby Farpoint Station to prove their worthiness to be spared. After successfully solving the mystery and avoiding disaster, the crew departs on its mission to explore strange new worlds.</p><p>Subsequent stories focus on the discovery of new life and sociological and political relationships with alien cultures, as well as exploring the human condition. Several new species are introduced as recurring antagonists, including the Ferengi, the Cardassians, and the Borg. Throughout their adventures, Picard and his crew are often forced to face and live with the consequences of difficult choices.</p><p>The series ended in its seventh season with a two-part episode \"All Good Things...\", which brought the events of the series full circle to the original confrontation with Q. An interstellar anomaly that threatens all life in the universe forces Picard to leap from his present, past, and future to combat the threat. Picard was successfully able to show to Q that humanity could think outside of the confines of perception and theorize on new possibilities while still being prepared to sacrifice themselves for the sake of the greater good. The series ended with the crew of the Enterprise portrayed as feeling more like a family and paved the way for four consecutive motion pictures that continued the theme and mission of the series.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Episodes by season (1–4)</caption><tbody><tr><th style=\"background: #610E1E; color: white;\">Season 1</th><th style=\"background: #C38E40; color: white;\">Season 2</th><th style=\"background: #486103; color: white;\">Season 3</th><th style=\"background: #33A98D; color: white;\">Season 4</th></tr><tr><td><div><ol><li>\"<span>Encounter at Farpoint</span>\" (Two-part episode)</li></ol></div><div><ol start=\"3\"><li>\"<span>The Naked Now</span>\"</li><li>\"<span>Code of Honor</span>\"</li><li>\"<span>The Last Outpost</span>\"</li><li>\"<span>Where No One Has Gone Before</span>\"</li><li>\"<span>Lonely Among Us</span>\"</li><li>\"<span>Justice</span>\"</li><li>\"<span>The Battle</span>\"</li><li>\"<span>Hide and Q</span>\"</li><li>\"<span>Haven</span>\"</li><li>\"<span>The Big Goodbye</span>\" (Peabody Award Winner)</li><li>\"<span>Datalore</span>\"</li><li>\"<span>Angel One</span>\"</li><li>\"<span>11001001</span>\"</li><li>\"<span>Too Short a Season</span>\"</li><li>\"<span>When the Bough Breaks</span>\"</li><li>\"<span>Home Soil</span>\"</li><li>\"<span>Coming of Age</span>\"</li><li>\"<span>Heart of Glory</span>\"</li><li>\"<span>The Arsenal of Freedom</span>\"</li><li>\"<span>Symbiosis</span>\"</li><li>\"<span>Skin of Evil</span>\"</li><li>\"<span>We'll Always Have Paris</span>\"</li><li>\"<span>Conspiracy</span>\"</li><li>\"<span>The Neutral Zone</span>\"</li></ol></div></td><td><div><ol><li>\"<span>The Child</span>\"</li><li>\"<span>Where Silence Has Lease</span>\"</li><li>\"<span>Elementary, Dear Data</span>\"</li><li>\"<span>The Outrageous Okona</span>\"</li><li>\"<span>Loud as a Whisper</span>\"</li><li>\"<span>The Schizoid man</span>\"</li><li>\"<span>Unnatural Selection</span>\"</li><li>\"<span>A Matter of Honor</span>\"</li><li>\"<span>The Measure of a Man</span>\"</li><li>\"<span>The Dauphin</span>\"</li><li>\"<span>Contagion</span>\"</li><li>\"<span>The Royale</span>\"</li><li>\"<span>Time Squared</span>\"</li><li>\"<span>The Icarus Factor</span>\"</li><li>\"<span>Pen Pals</span>\"</li><li>\"<span>Q Who</span>\"</li><li>\"<span>Samaritan Snare</span>\"</li><li>\"<span>Up the Long Ladder</span>\"</li><li>\"<span>Manhunt</span>\"</li><li>\"<span>The Emissary</span>\"</li><li>\"<span>Peak Performance</span>\"</li><li>\"<span>Shades of Gray</span>\"</li></ol></div></td><td><div><ol><li>\"<span>Evolution</span>\"</li><li>\"<span>The Ensigns of Command</span>\"</li><li>\"<span>The Survivors</span>\"</li><li>\"<span>Who Watches the Watchers</span>\"</li><li>\"<span>The Bonding</span>\"</li><li>\"<span>Booby Trap</span>\"</li><li>\"<span>The Enemy</span>\"</li><li>\"<span>The Price</span>\"</li><li>\"<span>The Vengeance Factor</span>\"</li><li>\"<span>The Defector</span>\"</li><li>\"<span>The Hunted</span>\"</li><li>\"<span>The High Ground</span>\"</li><li>\"<span>Deja Q</span>\"</li><li>\"<span>A Matter of Perspective</span>\"</li><li>\"<span>Yesterday's Enterprise</span>\"</li><li>\"<span>The Offspring</span>\"</li><li>\"<span>Sins of the Father</span>\"</li><li>\"<span>Allegiance</span>\"</li><li>\"<span>Captain's Holiday</span>\"</li><li>\"<span>Tin Man</span>\"</li><li>\"<span>Hollow Pursuits</span>\"</li><li>\"<span>The Most Toys</span>\"</li><li>\"<span>Sarek</span>\"</li><li>\"<span>Ménage à Troi</span>\"</li><li>\"<span>Transfigurations</span>\"</li><li>\"<span>The Best of Both Worlds</span>\" (Part 1)</li></ol></div></td><td><div><ol><li>\"<span>The Best of Both Worlds</span>\" (Part 2)</li><li>\"<span>Family</span>\"</li><li>\"<span>Brothers</span>\"</li><li>\"<span>Suddenly Human</span>\"</li><li>\"<span>Remember Me</span>\"</li><li>\"<span>Legacy</span>\"</li><li>\"<span>Reunion</span>\"</li><li>\"<span>Future Imperfect</span>\"</li><li>\"<span>Final Mission</span>\"</li><li>\"<span>The Loss</span>\"</li><li>\"<span>Data's Day</span>\"</li><li>\"<span>The Wounded</span>\"</li><li>\"<span>Devil's Due</span>\"</li><li>\"<span>Clues</span>\"</li><li>\"<span>First Contact</span>\"</li><li>\"<span>Galaxy's Child</span>\"</li><li>\"<span>Night Terrors</span>\"</li><li>\"<span>Identity Crisis</span>\"</li><li>\"<span>The Nth Degree</span>\"</li><li>\"<span>Qpid</span>\"</li><li>\"<span>The Drumhead</span>\"</li><li>\"<span>Half a Life</span>\"</li><li>\"<span>The Host</span>\"</li><li>\"<span>The Mind's Eye</span>\"</li><li>\"<span class=\"mw-redirect\">In Theory</span>\"</li><li>\"<span>Redemption</span>\" (Part 1)</li></ol></div></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Episodes by season (5–7)</caption><tbody><tr><th style=\"background: #045980; color: white;\">Season 5</th><th style=\"background: #484C83; color: white;\">Season 6</th><th style=\"background: #66467D; color: white;\">Season 7</th></tr><tr><td><div><ol><li>\"<span>Redemption</span> (Part 2)</li><li>\"<span>Darmok</span>\"</li><li>\"<span>Ensign Ro</span>\"</li><li>\"<span>Silicon Avatar</span>\"</li><li>\"<span>Disaster</span>\"</li><li>\"<span>The Game</span>\"</li><li>\"<span>Unification</span>\" (Two-part episode)</li></ol></div><div><ol start=\"9\"><li>\"<span>A Matter of Time</span>\"</li><li>\"<span>New Ground</span>\"</li><li>\"<span>Hero Worship</span>\"</li><li>\"<span>Violations</span>\"</li><li>\"<span>The Masterpiece Society</span>\"</li><li>\"<span>Conundrum</span>\"</li><li>\"<span>Power Play</span>\"</li><li>\"<span>Ethics</span>\"</li><li>\"<span>The Outcast</span>\"</li><li>\"<span>Cause and Effect</span>\"</li><li>\"<span>The First Duty</span>\"</li><li>\"<span>Cost of Living</span>\"</li><li>\"<span>The Perfect Mate</span>\"</li><li>\"<span>Imaginary Friend</span>\"</li><li>\"<span>I, Borg</span>\"</li><li>\"<span>The Next Phase</span>\"</li><li>\"<span>The Inner Light</span>\"</li><li>\"<span>Time's Arrow</span>\" (Part 1)</li></ol></div></td><td><div><ol><li>\"<span>Time's Arrow</span>\" (Part 2)</li><li>\"<span>Realm of Fear</span>\"</li><li>\"<span>Man of the People</span>\"</li><li>\"<span>Relics</span>\"</li><li>\"<span>Schisms</span>\"</li><li>\"<span>True Q</span>\"</li><li>\"<span>Rascals</span>\"</li><li>\"<span>A Fistful of Datas</span>\"</li><li>\"<span>The Quality of Life</span>\"</li><li>\"<span>Chain of Command</span>\" (Two-part episode)</li></ol></div><div><ol start=\"12\"><li>\"<span>Ship in a Bottle</span>\"</li><li>\"<span>Aquiel</span>\"</li><li>\"<span>Face of the Enemy</span>\"</li><li>\"<span>Tapestry</span>\"</li><li>\"<span>Birthright</span>\" (Two-part episode)</li></ol></div><div><ol start=\"18\"><li>\"<span>Starship Mine</span>\"</li><li>\"<span>Lessons</span>\"</li><li>\"<span>The Chase</span>\"</li><li>\"<span>Frame of Mind</span>\"</li><li>\"<span>Suspicions</span>\"</li><li>\"<span>Rightful Heir</span>\"</li><li>\"<span>Second Chances</span>\"</li><li>\"<span>Timescape</span>\"</li><li>\"<span>Descent</span>\" (Part 1)</li></ol></div></td><td><div><ol><li>\"<span>Descent</span>\" (Part 2)</li><li>\"<span>Liaisons</span>\"</li><li>\"<span>Interface</span>\"</li><li>\"<span>Gambit</span>\" (Two-part episode)</li></ol></div><div><ol start=\"6\"><li>\"<span>Phantasms</span>\"</li><li>\"<span>Dark Page</span>\"</li><li>\"<span>Attached</span>\"</li><li>\"<span>Force of Nature</span>\"</li><li>\"<span>Inheritance</span>\"</li><li>\"<span>Parallels</span>\"</li><li>\"<span>The Pegasus</span>\"</li><li>\"<span>Homeward</span>\"</li><li>\"<span>Sub Rosa</span>\"</li><li>\"<span>Lower Decks</span>\"</li><li>\"<span>Thine Own Self</span>\"</li><li>\"<span>Masks</span>\"</li><li>\"<span>Eye of the Beholder</span>\"</li><li>\"<span>Genesis</span>\"</li><li>\"<span>Journey's End</span>\"</li><li>\"<span>Firstborn</span>\"</li><li>\"<span>Bloodlines</span>\"</li><li>\"<span>Emergence</span>\"</li><li>\"<span>Preemptive Strike</span>\"</li><li>\"<span>All Good Things...</span>\" (Two-part episode)</li></ol></div></td></tr></tbody></table><br/><h3>Cast</h3><h4>Main</h4><ul><li>Patrick Stewart as Captain Jean-Luc Picard is the commanding officer of the USS Enterprise-D. Stewart also played the character in the pilot episode of Deep Space Nine, all four TNG theater films, and in the eponymously titled latest series Star Trek: Picard.</li><li>Jonathan Frakes as Commander William T. Riker is the ship's first officer. The Riker character was influenced by concepts for first officer Willard Decker in the Star Trek: Phase II television series. Decker's romantic history with helmsman Ilia was mirrored in The Next Generation in the relationship between Riker and Deanna Troi. Riker also appears in an episode each of Star Trek: Voyager and Star Trek: Enterprise, and later reprised the role in Star Trek: Picard and in the animated Star Trek: Lower Decks. In addition to William Riker, Frakes played William's transporter-created double, Thomas, in one episode each of The Next Generation and Star Trek: Deep Space Nine.</li><li>LeVar Burton as Lieutenant (JG)/Lieutenant/Lieutenant Commander Geordi La Forge was initially the ship's helmsman, but the character became chief engineer beginning in the second season. Burton also played the character in an episode of Voyager and the third season of Star Trek: Picard.</li><li>Denise Crosby as Lieutenant Tasha Yar (season 1; guest: seasons 3 & 7) is the chief of security and tactical officer. Crosby left the series near the end of the first season, and the Yar character was killed. Yar returns in alternate timelines in the award-winning episode \"Yesterday's Enterprise\" and the series finale, \"All Good Things...\". Crosby also played Commander Sela, Yar's half-Romulan daughter.</li><li>Michael Dorn as Lieutenant (JG)/Lieutenant Worf is a Klingon. Worf initially appears as a junior officer fulfilling several roles on the bridge. When Denise Crosby left near the end of the first season, the Worf character succeeded Lieutenant Yar as the ship's chief of security and tactical officer. Dorn reprised the role as a regular in seasons four through seven of Star Trek: Deep Space Nine and the third season of Star Trek: Picard. He also played another Klingon, Worf's grandfather and namesake, in Star Trek VI: The Undiscovered Country. With 284 on-screen appearances, Dorn has the most appearances of any actor in the Star Trek franchise.</li><li>Gates McFadden as Doctor Beverly Crusher (Seasons 1 & 3–7) is the Enterprise's chief medical officer. As a fully certified bridge officer, Dr. Crusher had the ability to command the Enterprise if circumstances required her to do so. She also, on occasion, commanded night-watch shifts on the ship's main bridge to stay on top of starship operations. McFadden was fired after the first season, but was rehired for the third season and remained for the remainder of the series. Her absence in the second season was explained by her transfer to Starfleet Medical. She returned to the role for the third season of Star Trek: Picard.</li><li>Marina Sirtis as Lieutenant Commander/Commander Deanna Troi is the half-human, half-Betazoid ship's counselor. Starting in the season seven episode \"Thine Own Self\", Counselor Troi, having taken and completed the bridge-officer's test, is later promoted to the rank of commander, which allowed her to take command of the ship, and also perform bridge duties other than those of a ship's counselor. The character's relationship with first officer Riker was a carry-over from character ideas developed for Phase II. Troi also appeared in later episodes of Voyager, in the finale of Enterprise, and in the first and third seasons of Star Trek: Picard.</li><li>Brent Spiner as Lieutenant Commander Data; an android who serves as second officer and operations officer. Data's \"outsider's\" perspective on humanity served a similar narrative purpose as Spock's in the original Star Trek. Spiner also played his \"brother\", Lore, and his creator, Noonien Soong. In Enterprise, Spiner played Noonien's ancestor, Arik, and contributed a brief voiceover (heard over the Enterprise-D's intercom) in the Enterprise finale. In Star Trek: Picard., Spiner reprised the roles of Data and Lore and portrayed the new roles of Altan Inigo Soong and Adam Soong.</li><li>Wil Wheaton as Beverly Crusher's son Wesley (Seasons 1–4; guest: seasons 5 & 7). He becomes an acting ensign, and later receives a field commission to ensign, before attending Starfleet Academy. After being a regular for the first four seasons, Wheaton appeared occasionally as Wesley Crusher for the remainder of the series. Wheaton reprised the role in Star Trek: Nemesis and Star Trek: Picard.</li></ul><h4>Recurring</h4><ul><li>Majel Barrett as Lwaxana Troi, Federation ambassador and Deanna Troi's mother; also the voice of the ship's computer.</li><li>Brian Bonsall as Alexander Rozhenko, Worf's son.</li><li>Rosalind Chao as Keiko O'Brien, botanist until her transfer to Deep Space Nine in 2369.</li><li>Denise Crosby as Sela, Romulan commander and Tasha Yar's daughter.</li><li>John de Lancie as Q, a member of the Q-Continuum who frequently visits the USS Enterprise-D.</li><li>Jonathan Del Arco as Hugh, a Borg drone who was disconnected from the collective by Geordi La Forge and Beverly Crusher.</li><li>Michelle Forbes as Ro Laren, conn officer until her defection to the Maquis in 2370.</li><li>Diana Muldaur as Doctor Katherine Pulaski (Season 2) was created to replace Dr. Crusher for the show's second season. Muldaur, who previously appeared in two episodes of the original Star Trek, never received billing in the opening credits; instead, she was listed as a special guest star during the first act.</li><li>Whoopi Goldberg as Guinan, bartender hostess on the USS Enterprise-D.</li><li>Ashley Judd as Robin Lefler, engineering officer on the USS Enterprise-D.</li><li>Andreas Katsulas as Tomalak, a Romulan commander who has several encounters with the USS Enterprise-D.</li><li>Barbara March as Lursa, Klingon officer from the House of Duras and B'Etor's sister.</li><li>Colm Meaney as Miles O'Brien, conn officer and later transporter chief until his transfer to Deep Space Nine in 2369.</li><li>Eric Menyuk as The Traveler, a member of a species from Tau Alpha C who mentors Wesley Crusher</li><li>Lycia Naff as Sonya Gomez, engineering officer on the USS Enterprise-D.</li><li>Natalia Nogulich as Alynna Nechayev, flag officer in charge of Cardassian affairs.</li><li>Robert O'Reilly as Gowron, leader of the Klingon Empire.</li><li>Suzie Plakson as K'Ehleyr, Federation ambassador, mate to Worf and Alexander Rozhenko's mother until her death in 2367.</li><li>Dwight Schultz as Reginald Barclay, engineering officer until his transfer to Starfleet Communications in 2374.</li><li>Carel Struycken as Mr. Homn, Lwaxana Troi's attendant.</li><li>Tony Todd as Kurn, Klingon officer and Worf's brother.</li><li>Gwynyth Walsh as B'Etor, Klingon officer from the House of Duras and Lursa's sister.</li><li>Patti Yasutake as Alyssa Ogawa, medical officer and head nurse.</li><li>Ken Thorley as Mot, barber on the USS Enterprise-D.</li><li>Daniel Davis as Professor Moriarty as a holodeck character who becomes self-aware.</li></ul><p>For a more complete list, see Appearances</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>Enterprise</i>-D Characters Season 1–7 (examples)</caption><tbody><tr><th>Character</th><th>Season 1</th><th>Season 2</th><th>Season 3</th><th>Season 4</th><th>Season 5</th><th>Season 6</th><th>Season 7</th></tr><tr><td>Captain Picard</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td></tr><tr><td>William T. Riker</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td></tr><tr><td>Data</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td></tr><tr><td>Worf</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td></tr><tr><td>Deanna Troi</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td></tr><tr><td>Geordi La Forge</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td></tr><tr><td>Beverly Crusher</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#FFC7C7;vertical-align:middle;text-align:center;\" class=\"table-no\">No</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td></tr><tr><td>Katherine Pulaski</td><td style=\"background:#FFC7C7;vertical-align:middle;text-align:center;\" class=\"table-no\">No</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#FFC7C7;vertical-align:middle;text-align:center;\" class=\"table-no\">No</td><td style=\"background:#FFC7C7;vertical-align:middle;text-align:center;\" class=\"table-no\">No</td><td style=\"background:#FFC7C7;vertical-align:middle;text-align:center;\" class=\"table-no\">No</td><td style=\"background:#FFC7C7;vertical-align:middle;text-align:center;\" class=\"table-no\">No</td><td style=\"background:#FFC7C7;vertical-align:middle;text-align:center;\" class=\"table-no\">No</td></tr><tr><td>Wesley Crusher</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background: #FF8; vertical-align: middle; text-align: center;\" class=\"table-maybe\">2 ep.</td><td style=\"background:#FFC7C7;vertical-align:middle;text-align:center;\" class=\"table-no\">No</td><td style=\"background: #FF8; vertical-align: middle; text-align: center;\" class=\"table-maybe\">2 ep.</td></tr><tr><td>Tasha Yar</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#FFC7C7;vertical-align:middle;text-align:center;\" class=\"table-no\">No</td><td style=\"background: #FF8; vertical-align: middle; text-align: center;\" class=\"table-maybe\">1 ep.</td><td style=\"background:#FFC7C7;vertical-align:middle;text-align:center;\" class=\"table-no\">No</td><td style=\"background:#FFC7C7;vertical-align:middle;text-align:center;\" class=\"table-no\">No</td><td style=\"background:#FFC7C7;vertical-align:middle;text-align:center;\" class=\"table-no\">No</td><td style=\"background: #FF8; vertical-align: middle; text-align: center;\" class=\"table-maybe\">1 ep.</td></tr><tr><td>Guinan</td><td style=\"background:#FFC7C7;vertical-align:middle;text-align:center;\" class=\"table-no\">No</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#9EFF9E;vertical-align:middle;text-align:center;\" class=\"table-yes\">Yes</td><td style=\"background:#FFC7C7;vertical-align:middle;text-align:center;\" class=\"table-no\">No</td></tr></tbody></table><br/><h3>Story arcs and themes</h3><p>Star Trek had a number of story arcs within the larger story, and oftentimes different episodes contributed to two or more different story or character arcs. Some are epitomized by the aliens the characters interact with, for example, TNG introduced the Borg and the Cardassians. The Klingons and Romulans had been introduced in The Original Series (1966–1969); however, the Klingons were somewhat rebooted with a \"turtle-head\" look, although a retcon was given to explain this in an Enterprise episode. Other story arcs focus on certain peripheral characters such as Q, Ro Laren or characters projected on the Holodeck.</p><p>Certain episodes go deeper into the Klingon alien saga, which are famous for having an actual Klingon language made for them in the Star Trek universe. The Klingon stories usually involve Worf, but not all Worf-centric shows are focused on Klingons. The Duras sisters, a Klingon duo named Lursa and B'Etor, were introduced on TNG in the 1991 episode \"Redemption\". They later appeared in the film Generations.</p><p>One of the science fiction technologies featured in Star Trek: The Next Generation was an artificial reality machine called the \"Holodeck\", and several award-winning episodes featured plots centering on the peculiarities of this device. Some episodes focused on malfunctions in the holodeck, and in one case how a crew member became addicted to the environment created by the technology. The dangers of technology that allows illusion is one of ongoing themes of Star Trek going back to the 1st pilot, \"The Cage\" where aliens' power of illusion to create an artificial reality is explored. One of the plots is whether a character will confront a reality or retreat to a world of fantasy.</p><p>Several episodes in the show also deal with the concept of time, including narrative structures around time travel, temporal loops, parallel universes, alternate universes, and more. In some episodes, the character Q is responsible for the shifts in time.</p><br/><h3>Reception</h3><p>The Next Generation's average of 20 million viewers often exceeded both existing syndication successes such as Wheel of Fortune and network hits including Cheers and L.A. Law. Benefiting in part from many stations' decision to air each new episode twice in a week, it consistently ranked in the top ten among hour-long dramas, and networks could not prevent affiliates from preempting their shows with The Next Generation or other dramas that imitated its syndication strategy.: 124 Star Trek: The Next Generation received 18 Emmy Awards and, in its seventh season, became the first and only syndicated television show to be nominated for the Emmy for Best Dramatic Series. It was nominated for three Hugo Awards and won two. The first-season episode \"The Big Goodbye\" also won the Peabody Award for excellence in television programming.</p><p>In 1997, the episode \"The Best of Both Worlds, Part I\" was ranked No. 70 on TV Guide's 100 Greatest Episodes of All Time. In 2002, Star Trek: The Next Generation was ranked #46 on TV Guide's 50 Greatest TV Shows of All Time list, and in 2008, was ranked No. 37 on Empire's list of the 50 greatest television shows.</p><p>On October 7, 2006, one of the three original filming models of the USS Enterprise-D used on the show sold at a Christie's auction for US$576,000, making it the highest-selling item at the event. The buyer of the model was Microsoft co-founder Paul Allen, owner of the Museum of Pop Culture in Seattle. The model is on display within the Science Fiction Museum.</p><p>In 2012, Entertainment Weekly listed the show at No. 7 in the \"25 Best Cult TV Shows from the Past 25 Years\", saying, \"The original Star Trek was cult TV before cult TV was even a thing, but its younger, sleeker offspring brought, yes, a new generation into the Trekker fold, and reignited the promise of sci-fi on television.\" Although TNG did develop a cult following, it was noted for its prime-time general audience viewership also.</p><p>The flute from \"The Inner Light\" was valued at a maximum of US$1,000 when it went to auction in late 2006, but was sold for over $40,000; in this case the auctioneers admitted they had underestimated the appeal of the prop. In the days leading up to the auction, Denise Okuda, former Star Trek scenic artist and video supervisor, as well as co-writer of the auction catalog, said: \"That's the item people say they really have to have, because it's so iconic to a much-beloved episode.\"</p><p>DS9's \"The Emissary\", which came out half-way through season 6 of TNG achieved a Nielsen rating of 18.8. Star Trek's ratings went into a steady decline starting with Season 6 of TNG, and the second to last episode of DS9 achieved a Nielsen rating of 3.9.</p><p>In 2017, Vulture ranked Star Trek: The Next Generation the second best live-action Star Trek television show.</p><p>In 2019, Popular Mechanics ranked Star Trek: The Next Generation the third best science fiction television show ever.</p><p>In 2021, Empire magazine ranked it the 17th greatest television show ever. They point out it was hard to follow in the reputation of the original series, but the series found its footing and paved the way for more spin-offs.</p><br/><h3>International broadcasts</h3><p>The Next Generation was first broadcast on UK terrestrial TV on BBC2 with the first episode shown on 26 September 1990. The sequence remained the same as the US releases for the first four episodes, but after this they were somewhat shuffled about.</p><br/><h3>Games</h3><p>Video games based on The Next Generation TV series, movies, and characters include:</p><ul><li>Star Trek: The Next Generation (1993) (NES / Game Boy)</li><li>Star Trek: The Next Generation: Future's Past (1993), for the SNES Star Trek: The Next Generation: Echoes from the Past (1993) a port of Future's Past for the Sega Genesis</li><li>Star Trek: The Next Generation: Echoes from the Past (1993) a port of Future's Past for the Sega Genesis</li><li>Star Trek Generations: Beyond the Nexus (1994), for Nintendo Game Boy or Sega Game Gear</li><li>Star Trek: The Next Generation – A Final Unity (1995), for MS-DOS or Macintosh. A Final Unity sold 500,000 copies by 1996 and was noted in the U.K. PC Gamer Magazine for how it \"translates the atmosphere and 'feel' of The Next Generation almost perfectly\".</li><li>Star Trek: Borg (1996), includes live action segments directed by James L. Conway and acting by John de Lancie as Q</li><li>Star Trek: Klingon (1996), for PC and Mac</li><li>Star Trek Generations (1997), for PC</li><li>Star Trek: The Next Generation: Klingon Honor Guard (1998), for Mac and PC</li><li>Star Trek: The Game Show (1998), for PC and Mac</li><li>Star Trek: The Next Generation: Birth of the Federation (1999), for PC</li><li>Star Trek: Hidden Evil (1999), for PC</li><li>Star Trek Invasion (2000), for the PlayStation</li><li>Star Trek Armada (2000), for Microsoft Windows 98</li><li>Star Trek: Armada II (2001)</li><li>Star Trek: Bridge Commander (2002)</li><li>Star Trek: Legacy (2006) (PC, Xbox 360)</li><li>Star Trek: Conquest (2007) (Wii, PlayStation 2)</li></ul><p>The Enterprise and its setting is also in other Trekiverse games like Star Trek: Armada (2000). For example, in Star Trek: Armada voice actors from The Next Generation returned to their characters in the game including Patrick Stewart reprising the roles of Jean-Luc Picard and Locutus, Michael Dorn voiced Worf, Denise Crosby reprised Sela, and J. G. Hertzler voiced Chancellor Martok. Several other voice actors who had been previously unaffiliated with Star Trek also voiced characters in the game, among them was Richard Penn.</p><p>Star Trek: Armada II was set in the Star Trek: The Next Generation era of the Star Trek universe.</p><p>Star Trek: Hidden Evil (1999) included voice acting by Brent Spiner as Data and Patrick Stewart as Picard, and was a follow-up to the ninth Star Trek film Star Trek: Insurrection.</p><p>Board Games:</p><ul><li>Star Trek: The Next Generation Interactive VCR Board Game This game is played with television with VCR player, and also a game board.</li><li>This game is played with television with VCR player, and also a game board.</li><li>Star Trek: The Next Generation, a 1993 board game</li><li>Star Trek: Five-Year Mission (also included TOS)</li></ul><p>Pinball:</p><ul><li>Star Trek: The Next Generation (pinball)</li></ul><p>(includes other series)</p><br/><h3>Films</h3><p>Four films feature the characters of the series: Star Trek Generations (1994), Star Trek: First Contact (1996), Star Trek: Insurrection (1998), and Star Trek: Nemesis (2002).</p><p>An ancestor of Worf, also played by Dorn, appeared in Star Trek VI: The Undiscovered Country.</p><blockquote>I think it was kind of an honor they had my character be sort of the link between the two series. It was wonderful to be working with the other cast (from the original Star Trek series). It was kind of a fantasy because who would have thought when I was watching the original show that I'd be working in the movie? Beyond that, it's like professionalism takes over and you just kind of do the best you can and not make yourself look bad.— Dorn on his role in The Undiscovered Country</blockquote><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Film</th><th>U.S. release date</th><th>Director(s)</th><th>Screenwriter(s)</th><th>Story by</th><th width=\"18%\">Producer(s)</th></tr><tr><th scope=\"row\" style=\"text-align:left\"><i><span>Star Trek Generations</span></i></th><td style=\"text-align:left;\">November 18, 1994</td><td><span>David Carson</span></td><td><span>Ronald D. Moore</span> and <span>Brannon Braga</span></td><td rowspan=\"2\"><span>Rick Berman</span>, Brannon Braga and Ronald D. Moore</td><td>Rick Berman</td></tr><tr><th scope=\"row\" style=\"text-align:left\"><i><span>Star Trek: First Contact</span></i></th><td style=\"text-align:left;\">November 22, 1996</td><td rowspan=\"2\"><span>Jonathan Frakes</span></td><td>Brannon Braga and Ronald D. Moore</td><td>Rick Berman, <span>Marty Hornstein</span> and <span>Peter Lauritson</span></td></tr><tr><th scope=\"row\" style=\"text-align:left;\"><i><span>Star Trek: Insurrection</span></i></th><td style=\"text-align:left;\">December 11, 1998</td><td><span>Michael Piller</span></td><td>Rick Berman and Michael Piller</td><td rowspan=\"2\">Rick Berman</td></tr><tr><th scope=\"row\" style=\"text-align:left\"><i><span>Star Trek: Nemesis</span></i></th><td style=\"text-align:left;\">December 13, 2002</td><td><span>Stuart Baird</span></td><td><span>John Logan</span></td><td>John Logan, Rick Berman and <span>Brent Spiner</span></td></tr></tbody></table><br/><h3>Home media</h3><p>Star Trek harnessed the emergence of home video technologies that rose to prominence in the 1980s as new revenue and promotion avenue. Star Trek: The Next Generation had release in part or in full on VHS, Betamax, LaserDisc, DVD, and Blu-ray media.</p><h4>VHS</h4><p>All episodes of Star Trek: The Next Generation were made available on VHS cassettes, starting in 1991. The entire series was gradually released on VHS over the next few years during the remainder of the show's run and after the show had ended.</p><p>The VHS for TNG were available on mail-order, with usually two episodes per cassette.</p><h4>Beta</h4><p>Some episodes had releases on the tape videocassette format Betamax. Releases of all Betamax publications including those of the Star Trek: The Next Generation was halted in the early 1990s.</p><h4>LaserDisc</h4><p>Paramount published all episodes on the LaserDisc format from October 1991 using an extended release schedule that concluded in May 1999. Each disc featured two episodes with Closed Captions, Digital Audio, and CX encoding. Also published were four themed \"collections\", or boxed sets, of related episodes. These included The Borg Collective, The Q Continuum, Worf: Return to Grace, and The Captains Collection.</p><p>For example, the \"Q Continuum\" collection of LaserDisc featured 4 episodes. The collection was released on July 30, 1997 and was published by Paramount Home Video; it retailed for US$99.98. The set included the 2-part \"Encounter at Farpoint\", \"Hide & Q\", \"Q Who?\", and \"Deja Q\" on 12 inch optical discs in NTSC format with a total runtime of 230 minutes, with stereo sound. The collection came in a Tri-Fold jacket that also included a letter from actor Jon De Lancie (Q).</p><p>There was a production error with episode 166, \"Sub Rosa\", where a faulty master tape was used that was missing 4½ minutes of footage. Though a new master copy of the episode was obtained, no corrected pressing of this disc was issued.</p><p>Star Trek: The Next Generation was also released on LaserDisc in the non-US markets Japan and Europe. In Japan, all episodes were released in a series of 14 boxed sets (two boxed sets per season), and as with the US releases were in the NTSC format and ordered by production code. The European laserdiscs were released in the PAL format and included the ten two-part telemovies as well as a disc featuring the episodes Yesterday's Enterprise and Cause And Effect. The pilot episode, Encounter At Farpoint, was also included in a boxed set called Star Trek: The Pilots featuring the pilot episodes from Star Trek: The Original Series, Star Trek: The Next Generation, Star Trek: Deep Space Nine, and Star Trek: Voyager.</p><h4>DVD</h4><p>The first season of the series was released on DVD in March 2002. Throughout the year the next six seasons were released at various times on DVD, with the seventh season being released in December 2002. To commemorate the 20th anniversary of the series, CBS Home Entertainment and Paramount Home Entertainment released Star Trek: The Next Generation – The Complete Series on October 2, 2007. The DVD box set contains 49 discs. Between March 2006 and September 2008, \"Fan Collective\" editions were released containing select episodes of The Next Generation (and The Original Series, Deep Space Nine, and Voyager) based on various themes. The individual episodes were chosen by fans voting on StarTrek.com. In total, six \"Fan Collectives\" were produced, along with a boxed set containing the first five collectives. In April 2013 all seven seasons of Star Trek: The Next Generation were re-released in new packaging featuring a silhouette of a different cast member on each box. However, the discs contained the identical content that was previously released in 2002. Another full DVD set was released in 2020 but it also contains the same content from the previous 2002 release.</p><h4>Blu-ray</h4><p>CBS announced on September 28, 2011, in celebration of the series' twenty-fifth anniversary, that Star Trek: The Next Generation would be completely remastered in 1080p high definition from the original 35mm film negatives. The original show was edited and post-processed in standard definition for broadcast, as were all the show's visual effects (e.g. all exterior shots of the Enterprise, phaser fire, or beaming fade-ins and -outs). For the remaster almost 25,000 reels of original film stock were rescanned and reedited, and all visual effects were digitally recomposed from original large-format negatives and newly created CGI shots. The release was accompanied by 7.1 DTS Master Audio. Michael Okuda believes this is the largest film restoration project ever attempted. The process of making high-definition versions of the series was an extraordinarily labor-intensive ordeal that cost Paramount Pictures over $12 million. The project was a financial failure and resulted in Paramount deciding very firmly against giving Deep Space Nine and Voyager the same treatment.</p><p>An initial disc featuring the episodes \"Encounter at Farpoint\", \"Sins of the Father\", and \"The Inner Light\" was released on January 31, 2012 under the label \"The Next Level\". The six-disc first season set was released on July 24, 2012. The remaining seasons were released periodically thereafter, culminating in the release of the seventh season on December 2, 2014. Season 1 sold 95,000 units in its launch week in 2012. The Blu-ray sets include many special features and videos, such as a 1988 episode of Reading Rainbow where LeVar Burton (who plays Geordi on TNG) documents the making of a Star Trek: The Next Generation episode.</p><p>The entire re-mastered series is available on Blu-ray as individual seasons, and as a 41-disc box set titled The Full Journey. Eventually, all remastered episodes became available for television syndication and digital distribution.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Season</th><th>Release date</th><th>Special features</th></tr><tr><td style=\"background: #610E1E; color: white;\">Season 1</td><td>July 24, 2012</td><td>Documentaries \"Energized!\" (about the VFX remastering) and \"Stardate Revisited\" (Origin)</td></tr><tr><td style=\"background: #C38E40; color: white;\">Season 2</td><td>December 4, 2012</td><td>Extended version of \"<span>The Measure of a Man</span>\", Reunification: reunion interview with entire <i>TNG</i> cast.</td></tr><tr><td style=\"background: #486103; color: white;\">Season 3</td><td>April 30, 2013</td><td>Inside the Writer's Room, Resistance is Futile: Assimilating <i>TNG</i>, A Tribute to Michael Piller</td></tr><tr><td style=\"background: #33A98D; color: white;\">Season 4</td><td>July 30, 2013</td><td>In Conversation: The <i>Star Trek</i> Art Department, Relativity: The Family Saga of <i>Star Trek TNG</i>, Deleted scenes</td></tr><tr><td style=\"background: #045980; color: white;\">Season 5</td><td>November 19, 2013</td><td>In Conversation: The Music of <i>TNG</i>, Requiem: A Remembrance of <i>TNG</i>, Deleted scenes</td></tr><tr><td style=\"background: #484C83; color: white;\">Season 6</td><td>June 24, 2014</td><td>Beyond the Five Year Mission- The Evolution of <i>Star Trek: The Next Generation</i>, Deleted scenes</td></tr><tr><td style=\"background: #66467D; color: white;\">Season 7</td><td>December 2, 2014</td><td>The Sky's the Limit – The Eclipse of <i>Star Trek: The Next Generation</i>, In Conversation: Lensing <i>Star Trek: The Next Generation</i>, deleted scenes</td></tr></tbody></table><h4>Standalone episodes</h4><p>When TNG was remastered in high definition, several episodes were released as stand-alone single show Blu-ray products. \"The Best of Both Worlds\" is split between two seasons, whereas the standalone product includes parts 1 and 2. \"The Best of Both Worlds\" single was released in April 2013 coinciding with the release of Season 3. Other singles of TNG HD include the two part shows \"Redemption\", \"Unification\", \"Chain of Command\", and \"All Good Things…\".</p><h4>\"The Measure of a Man\" HD extended cut</h4><p>\"The Measure of a Man\" was released in HD in 2012 with an extended cut. The extended version includes an extra 13 minutes of footage as well as recreated special effects. It was released as part of the Season 2 collection set.</p><br/><h3>Streaming and syndication</h3><p>Star Trek: The Next Generation is available on various streaming video services, including Amazon Prime Video, Apple iTunes, and Paramount+, under various qualities and terms. The Netflix version included some additional special effect improvements. One service stated that by 2017 the most re-watched episodes of Star Trek:The Next Generation among the most re-watched Star Trek franchise shows in their offerings, were \"The Best of Both Worlds, Part I\", \"The Best of Both Worlds, Part II\", \"Q Who\", and \"Clues\". Streaming offerings were noted for binge watching, including Star Trek: The Next Generation 178 episodes among the overall 726 episodes and 12 movies that had been released prior to Star Trek: Discovery in late 2017.</p><p>As of the late 2010s, Star Trek: The Next Generation is syndicated to air in the United States on the cable network BBC America and the broadcast channel network Heroes & Icons.</p><p>Star Trek : The Next Generation episodes have been featured in TV specials and marathons. For example, for Saint Patrick's Day BBC America planned a marathon with the episodes including \"The Best of Both Worlds\", \"Time's Arrow\", \"Chain of Command\", \"Tapestry\", and the series finale, \"All Good Things...\". On the launch of Paramount+ streaming service, on March 4, 2021, a free Star Trek marathon was presented, featuring the pilots of the various Star Trek television series, including TNG. The marathon started at 7 am PT/10 am ET and streamed on the YouTube internet video platform and ran all day.</p><br/><h3>Spin-offs and the franchise</h3><p>Star Trek: The Next Generation spawned different media set in its universe, which was primarily the 2370s but set in the same universe as first Star Trek TV shows of the 1960s. This included the aforementioned films, computer games, board games, theme parks, etc. In the 2010s there were rumors of a Captain Worf spin-off, the Klingon bridge officer that debuted on TNG and was also featured in the TNG spin-off show Deep Space Nine.</p><p>A documentary called Journey's End: The Saga of Star Trek – The Next Generation was released in 1994. Directed by Donald R. Beck, it featured the cast of the show and explored the last season and the then upcoming film Generations.</p><h4>Novels</h4><p>Star Trek: The Next Generation-era novels (examples):</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td style=\"width: 50%;text-align: left; vertical-align: top;\"><p><b>Series</b></p><ul><li><i><span>Star Trek: The Q Continuum</span></i> by <span>Greg Cox</span><ul><li><i>Q-Space</i></li><li><i>Q-Zone</i></li><li><i>Q-Strike</i></li></ul></li><li><i><span>Star Trek: The Lost Era</span></i> edited by Mario Palmieri<ul><li><i>The Sundered</i> by Michael A. Martin</li><li><i>Serpents Among the Ruins</i> by <span>David R. George III</span></li><li><i>The Art of the Impossible</i> by <span>Keith DeCandido</span></li><li><i>Well of Souls</i> by <span>Ilsa J. Bick</span></li><li><i>Deny Thy Father</i> by <span>Jeff Mariotte</span></li><li><i>Catalyst of Sorrows</i> by <span>Margaret Wander Bonanno</span></li><li><i>One Constant Star</i> by David R. George III</li></ul></li><li><i><span>Star Trek: Typhon Pact</span></i><ul><li><i>Zero Sum Game</i> by David Mack</li><li><i>Seize the Fire</i> by Michael A. Martin</li><li><i>Rough Beasts of Empire</i> by David R. George III</li><li><i>Paths of Disharmony</i> by <span>Dayton Ward</span></li><li><i>The Struggle Within</i> by <span>Christopher L. Bennett</span></li><li><i>Plagues of Night</i> by David R. George III</li><li><i>Raise the Dawn</i> by David R. George III</li><li><i>Brinksmanship</i> by <span>Una McCormack</span></li></ul></li><li><i><span>Star Trek: A Time to...</span></i><ul><li><i>A Time to Be Born</i> by John Vornholt</li><li><i>A Time to Die</i> by John Vornholt</li><li><i>A Time to Sow</i> by David Ward and <span>Kevin Dilmore</span></li><li><i>A Time to Harvest</i> by David Ward and Kevin Dilmore</li><li><i>A Time to Love</i> by <span>Robert Greenberger</span></li><li><i>A Time to Hate</i> by Robert Greenberger</li><li><i>A Time to Kill</i> by David Mack</li><li><i>A Time to Heal</i> by David Mack</li><li><i>A Time for War, a Time for Peace</i> by Keith DeCandido</li></ul></li><li><i><span>Star Trek: Titan</span></i><ul><li><i>Taking Wing</i> by Michael A. Martin and Andy Mangels</li><li><i>The Red King</i> by Michael A. Martin and Andy Mangels</li><li><i>Orion's Hounds</i> by Christopher L. Bennett</li><li><i>Sword of Damocles</i> by <span>Geoffrey Thorne</span></li><li><i>Over a Torrent Sea</i> by Christopher L. Bennett</li><li><i>Synthesis</i> by <span>James Swallow</span></li><li><i>Fallen Gods</i> by Michael A. Martin</li><li><i>Absent Enemies</i> by <span>John Jackson Miller</span></li><li><i>Sight Unseen</i> by James Swallow</li><li><i>Fortune of War</i> by David Mack</li></ul></li></ul></td><td style=\"width: 50%;text-align: left; vertical-align: top;\"><p><b>One-offs</b></p><ul><li><span><i>Balance of Power</i></span> by <span>Dafydd ab Hugh</span></li><li><i>The Children of Hamlin</i> by <span>Carmen Carter</span></li><li><span><i>Dark Mirror</i></span> by <span>Diane Duane</span></li><li><i><span>Death in Winter</span></i> by <span>Michael Jan Friedman</span></li><li><i><span>The Devil's Heart</span></i> by Carmen Carter</li><li><i><span>I, Q</span></i> by <span>John de Lancie</span> and <span>Peter David</span></li><li><i><span>Immortal Coil</span></i> by Jeffrey Lang</li><li><i><span>Imzadi</span></i> by Peter David</li><li><i><span>The Peacekeepers</span></i> by <span>Gene DeWeese</span></li><li><span><i>Planet X</i></span> by Michael Jan Friedman</li><li><i><span>Q-in-Law</span></i> by Peter David</li><li><span><i>Rogue</i></span> by <span>Andy Mangels</span> and Michael A. Martin</li><li><i><span>Rogue Saucer</span></i> by <span>John Vornholt</span></li><li><i><span>Star Trek: Stargazer</span></i> by Michael Jan Friedman</li><li><i><span>Strike Zone</span></i> by Peter David</li><li><span><i>Survivors</i></span> by <span>Jean Lorrah</span></li><li><span><i>Vendetta</i></span> by Peter David</li></ul></td><td style=\"text-align: left; vertical-align: top;\"><p> </p></td></tr></tbody></table><h4>\"These Are the Voyages...\" (2005)</h4><p>In 2005, the last episode of Star Trek: Enterprise called \"These Are the Voyages...\" (S4E22) featured a holodeck simulation on the USS Enterprise (NCC-1701-D) from Star Trek: The Next Generation during the events of the episode \"The Pegasus\" and the return of Commander William Riker (Jonathan Frakes) and Counselor Deanna Troi (Marina Sirtis). It was written by Berman and Braga, who noted \"... this was a very cool episode because it has a great concept driving it\".</p><p>Star Trek: Enterprise was the TV show launched following the conclusion of Star Trek: Voyager and was set 100 years before TOS and 200 years before TNG, in addition to including some soft reboot elements with an all new cast. Some episodes connected to TNG directly including guest stars by Brent Spiner and connections to the events in TNG's fictional universe. The three-episode story arc consisting of \"Borderland\", \"Cold Station 12\", and \"The Augments\", with a Soong ancestor portrayed by The Next Generation regular Brent Spiner provides some backstory to Data's origins. Also, the Enterprise episode \"Affliction\" helps explain the smooth-headed Klingons that sometimes appeared, a retcon that helped explain this varying presentation between TOS, TNG, and the films.</p><p>Star Trek would not return to television as a show for over 12 years, until the debut of Star Trek: Discovery initially on CBS but thereafter exclusively available on the Internet service CBS All Access (Netflix internationally) at that time. The film franchise was rebooted in 2009, essentially a grafted on fork off of the timeline known in Star Trek: The Next Generation. That movie contains an event from the TNG timeline, which is the destruction of Romulus and the flight of Spock's special ship to the time fork. In the Star Trek franchise, witnessing the events of time shenanigans is a common plot device.</p><h4>The return of Picard</h4><p>On August 4, 2018, Patrick Stewart stated on social media that he would return to the role of Jean-Luc Picard in a project with CBS All Access.</p><p>Stewart wrote, \"I will always be very proud to have been a part of Star Trek: The Next Generation, but when we wrapped that final movie in the spring of 2002, I truly felt my time with Star Trek had run its natural course. It is, therefore, an unexpected but delightful surprise to find myself excited and invigorated to be returning to Jean-Luc Picard and to explore new dimensions within him. Seeking out new life for him, when I thought that life was over.</p><p>\"During these past years, it has been humbling to hear stories about how The Next Generation brought people comfort, saw them through difficult periods in their lives or how the example of Jean-Luc inspired so many to follow in his footsteps, pursuing science, exploration and leadership. I feel I'm ready to return to him for the same reason – to research and experience what comforting and reforming light he might shine on these often very dark times. I look forward to working with our brilliant creative team as we endeavor to bring a fresh, unexpected and pertinent story to life once more.\"</p><p>In January 2019, the producer said that the Picard series will answer questions about what happened to Captain Picard in the 20 years after Star Trek: Nemesis.</p><h4>Context</h4><p>This infographic shows the first-run production timeline of various Star Trek franchise shows and films, including Star Trek: The Next Generation.</p><br/>"
  },
  "errorMessage": ""
}