{
  "imDbId": "tt0348914",
  "title": "Deadwood",
  "fullTitle": "Deadwood (TV Series 2004–2006)",
  "type": "TVSeries",
  "year": "2004",
  "items": [
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw3066170",
      "warningSpoilers": false,
      "date": "11 August 2014",
      "rate": "9",
      "helpful": "144 out of 159 found this helpful.",
      "title": "The old west brought back to life",
      "content": "If you want to experience the – real – old west first hand, look no further; you'll find it in 'Deadwood'. There has never been a show or a film that came as close to showing what life must have been like in those lawless young towns that got built nearly over night wherever gold was found. A magnet for all kind of fortune seekers (gold diggers, whores, outlaws – but also settlers who were just hoping to build a better life), the town of Deadwood was notorious even by the standards of the time. In the show, this \"cesspool of vice\" is brought back to life with great attention to historical detail. You'll find no romanticised view of pioneers who lived and died by \"the code of honour\", but real people whose moral standards are – in most cases – murky at best. And the world they inhabit is a rough, dirty, violent place where only the fiercest – and the most cunning – survive. As far as the historical characters depicted in the show are concerned, the writers naturally had to take some liberties (after all, nobody knows exactly who said or did what at the time), but the depiction of the era and the historical background are very accurate. Yet this is not a history lesson; it's an immensely entertaining western-show blessed with some of the best writers and actors working in television and film today – and especially the cast of 'Deadwood' really can't get enough praise: there is not a single performance here that isn't excellent. Of course, the one who steals the show is Ian McShane. His Al Swearengen is one of the most morally complex and fun-to-watch characters I've ever seen (and he misses absolutely no opportunity to show you just what the first five letters in \"SWEAR-engen\" stand for). The power-struggles in Deadwood he is involved in – and since he wants to maintain his position at the top of the food-chain he's involved in all of them – are equalled in complexity and entertainment value only by those in top-notch shows like 'Game of Thrones', 'House of Cards' or 'Breaking Bad'. And the lengths Al is willing to go to achieve his goals secure him a place in the top ten of \"all-time great bad-asses\".So my verdict: While certainly not for the easily offended or those who prefer a \"sanitized version\" of the old west, 'Deadwood' offers a fascinating look at a time we mostly know from myths and legends and gives us a chance to revisit those and see them from a different angle. Great, intelligent and informative entertainment. 9 stars out of 10.Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/"
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw6303905",
      "warningSpoilers": false,
      "date": "23 November 2020",
      "rate": "9",
      "helpful": "49 out of 55 found this helpful.",
      "title": "Truly is a special show!",
      "content": "Deadwood truly is a special show! It is more than just a great western show, it's just a flat out great show in general! Everything about it is top notch. It's so good they even had to come back and make a movie over 15 years after it aired! Deadwood is on just about every \"best show ever\" list that you can find for a reason...because it is!"
    },
    {
      "username": "numenorsniper-66396",
      "userUrl": "https://www.imdb.com/user/ur96397291",
      "reviewLink": "https://www.imdb.com/review/rw5991676",
      "warningSpoilers": false,
      "date": "14 August 2020",
      "rate": "10",
      "helpful": "30 out of 33 found this helpful.",
      "title": "A perfect series",
      "content": "Perfect is a word that should pretty much never be used. Yet, this series Deadwood is indeed perfect (in my opinion of course).The long-awaited movie sadly doesn't meet the original series' tenacity or energy, As perfect as the series is, it too sadly fell prey to being cancelled before its time. Anyone who's watched it in full will know what I'm talking about, but anyone yet to watch it, I won't spoil it for you.I watched Deadwood when it was originally airing back in 2004, when I was 15, and often found it hard to understand everything they were saying lol, due to it's Shakespearean eloquence that for many native English speakers requires English subtitles. I revisited the series in 2014 when friends of a friend starting talking about it, and so that late friend of mine (God rest his soul) and I re-watched it all on his projector screen, and we couldn't stop laughing and cussing and using the term \"cocksucka!\" in every other sentence of our every day conversations, haha!I'm re-watching the first episode as I type out this review, and my god is it truly awesome."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8574440",
      "warningSpoilers": false,
      "date": "28 September 2022",
      "rate": "9",
      "helpful": "38 out of 44 found this helpful.",
      "title": "One of the most underrated shows!",
      "content": "When you look up most underrated shows of all-time I guarantee you that you'll find Deadwood near the top of every list you find. This is truly a special show! Deadwood takes place in a fictional mining town in the U. S. post Civil War years. It's a lawless town that attracts people that like it doesn't have organized law and people looking to strike it rich after a huge gold strike. It is more than just a great western show, it's just a flat out great show in general! Everything about it is top notch. It's so good they even had to come back and make a movie over 15 years after it aired! Deadwood is not only on every most \"underrated show ever\" list that you'll find but you'll also find it on just about every \"best show ever\" list too. If you're a fan of westerns and looking for a great show to binge then give this a try."
    },
    {
      "username": "garynorton",
      "userUrl": "https://www.imdb.com/user/ur2053593",
      "reviewLink": "https://www.imdb.com/review/rw1479230",
      "warningSpoilers": false,
      "date": "20 September 2006",
      "rate": "10",
      "helpful": "59 out of 66 found this helpful.",
      "title": "A Hell of a place to make your fortune...",
      "content": "This stands out for me as one of the best series I have ever seen hit the small screen. The attention to detail,story and character is second to none. Deadwood is brought to life by the good, the bad and the very ugly- with some of the most wonderfully theatrically profane, but ultra-realistic dialogue of any western. True, you could question some of the dialogue for exactly how accurate it is to the time it is set- but it sounds absolutely convincing in the world they have managed to build. Lets face it- not too many Westerns even bothered all that much in the first place! The 3 series have impeccable standards of production, weaving some of the real historical events of the time into a fictional Old West testament. The degradation, ill manners, costumes, dirt, mud and profanities are all present and accounted for.Aside from the \"real\" characters we know of from Deadwood (Wild Bill Hickok, Calamity Jane and even the Sheriff Bullock), we have some of the most unsavoury villains of the time as well.The various stories, historical events and personal issues of the characters interweave with no discernible template or pattern to formalise the show. The only thing that is certain in the old West is that where the desire for excess, fortune and greed are combined, human nature will see to the rest.Stand out performances are plentiful in this series- but Ian McShane is incredible, a true tour-de-force, a foul-mouthed, back-stabbing bad ass villain- who manages to humanise a repellent character in Al Swearengen.As the series wore on, the writers broadened his character and nature a little more so it was unavoidable but to side with him- even agree with his nastiest ideas.This was not a compromise or sell-out of the principally dark natured and notoriously ill-tempered brothel owner! \"Sparks\" of humanity seem to have warmed his character, particularly from his confrontations with the flint-like moral code & core of Sheriff Bullock (Timothy Olyphant). However, even Bullocks is prone to questionable actions, as he wrestles with his own conscience to resolve things in a \"civil\" way, or resort to a pistol-whipping to get the job done.If you have never seen this- look out for repeats or go buy the box sets and enjoy the best Western experience ever made. My only regret is that its all over after 3 series (apart from a couple of 2 hour specials they plan to make to round it off.) Short but ever so sweet!!"
    },
    {
      "username": "nick-1896",
      "userUrl": "https://www.imdb.com/user/ur15851783",
      "reviewLink": "https://www.imdb.com/review/rw1684217",
      "warningSpoilers": false,
      "date": "1 July 2007",
      "rate": "10",
      "helpful": "123 out of 143 found this helpful.",
      "title": "TV doesn't get any better than this",
      "content": "Absolutely superb. I don't think I've ever given anything a 10/10 before, but for a TV show, Deadwood is excellent - and given the crap we're generally subjected to on the box, absolutely outstanding. The sets, the research, the directing, the characters, the acting - all shine. And without wanting to sound gushy, the script is close to Shakespearian in its prosaic yet pragmatic tone. The juxtaposition of the grit and dirt and blood of the real 'Wild West' with formal Victorian language is genius. Even the opening credits are beautiful. It may not be everyone's cup of tea (the language and content can be a little 'strong' although entirely appropriate and in context) but anyone who's a fan of quality entertainment, shouldn't go past it."
    },
    {
      "username": "mattoid-45605",
      "userUrl": "https://www.imdb.com/user/ur68878008",
      "reviewLink": "https://www.imdb.com/review/rw4900963",
      "warningSpoilers": false,
      "date": "31 May 2019",
      "rate": "10",
      "helpful": "23 out of 26 found this helpful.",
      "title": "Television's finest hour",
      "content": "Hands down the best show ever written! Sopranos, Breaking Bad, The Wire are fantastic, well written shows as well but Deadwood beats them all hands down. The Deadwood movie premieres tomorrow night. I'm sure it won't disappoint."
    },
    {
      "username": "latinfineart",
      "userUrl": "https://www.imdb.com/user/ur48961864",
      "reviewLink": "https://www.imdb.com/review/rw8293008",
      "warningSpoilers": false,
      "date": "2 July 2022",
      "rate": "10",
      "helpful": "22 out of 26 found this helpful.",
      "title": "As good as it gets",
      "content": "I have always described this show as Shakespeare in Tombstone. The writing is absolutely brilliant. There are more quotable lines, than in any other show in the past 20 years. And this is likely the best western TV series, ever. The cast is awe inspiring, the direction is outstanding, the characters are well drawn, and the show is standing up to the test to time, as I have recently started re-watching the entire series. Amazing work."
    },
    {
      "username": "JoeyCeee",
      "userUrl": "https://www.imdb.com/user/ur53721325",
      "reviewLink": "https://www.imdb.com/review/rw8574685",
      "warningSpoilers": true,
      "date": "29 September 2022",
      "rate": "9",
      "helpful": "24 out of 27 found this helpful.",
      "title": "Watching Deadwood for the 10th time.",
      "content": "Still amazes me how good of a show it is.Season 3 gets better with each watching. After Ellsworth gets killed even Tolliver is pissed off at Hearst's senseless violence and takes it out on his girls.When Mrs Ellsworth thanks Al for his protection, his reaction of stunned silence is amazing. Al probably never got thanks like that before.Its a shame they couldn't wrap up the show with a Season 4 but we get what we get. Some great character arcs (Joanie Stubbs, Trixie) are what make the show that much better. The secondary characters get a chance to shine too. Even E. B. has his moments.Look forward to watching it again next year."
    },
    {
      "username": "travola-35109",
      "userUrl": "https://www.imdb.com/user/ur134112709",
      "reviewLink": "https://www.imdb.com/review/rw8678881",
      "warningSpoilers": false,
      "date": "17 November 2022",
      "rate": "10",
      "helpful": "25 out of 28 found this helpful.",
      "title": "Unappreciated",
      "content": "One of the best shows ever made and arguably the best western ever made. Top notch acting with perfect casting even the simplest storylines and conversations are captivating in this show. It's incredibly witty and even hilarious at times especially characters E. B., Dan, and Richardson who have some genuinely laugh out loud moments. The realism of everyday life in the old west is interesting to watch as well and they used modern cursing and language to bring it to life for the modern crowd. I'm glad they ruled out using old time language and insults because that would have taken away from fierceness and comedy the show brings in certain moments.I could go on and on about this show but you just need to watch it and experience it to really truly love it. Any person who says they love westerns has to watch this because it doesn't get much better and anyone who isn't really into westerns give this a go because it play extremely well for lovers of good television drama. Enjoy!!"
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw1428297",
      "warningSpoilers": true,
      "date": "23 July 2006",
      "rate": "10",
      "helpful": "28 out of 36 found this helpful.",
      "title": "\"A hell of a place to make your fortune\"",
      "content": "First off, the Western is my favorite film genre, however \"Deadwood\" transcends that genre so completely that it seems like a new one altogether. If you can, try to get your hands on the Season I DVD set with the special features disc. I was surprised to learn that many of the main and supporting characters beyond Wild Bill and Calamity were in fact also based on real life people. Al Swearengen ran an operation that took in between four and six thousand dollars a night, while other notables with a true history include Doc Cochran and the Reverend Henry Smith. Though the story playing out in the series is often a product of creator David Milch's 'imaginative reality', that in no way lessens it's impact as a narrative of the Dakotas and it's overly rich history of villainy, debauchery and profanity.Deadwood itself grew from a small mining camp to ten thousand inhabitants in a dizzying matter of three months in 1873. Word of a substantial ore find literally led to the phrase 'there's gold in them thar hills', creating an endless stream of immigrants to the Badlands. The territory itself was relegated to the Sioux Indians, and the U.S. Government was supposed to keep settlers out. But as everyone knows, money talks.With a series so rich in characters and story lines, it's hard to pick a favorite. Backed against the wall I'd have to pick Brad Dourif's portrayal as Doc Cochran as my own choice, but that's today. Individual episodes offer stunning performances by William Sanderson as E.B. Farnum and Robin Weigert as Calamity Jane. Of course, series stars Timothy Olyphant and Ian McShane have rewritten the rule book for Western heroes and villains with their portrayals. It's too bad Keith Carradine couldn't hang around more than four episodes as Wild Bill Hickok, but he drew those darn aces and eights in Deadwood.Not for the squeamish or faint of heart, \"Deadwood\" remains true to the gritty origins in the mud, blood, manure and urine of it's namesake. Prepare to be shocked, terrified and at times even amused, but most of all, watch \"Deadwood\" to experience one of the most unique television events ever created."
    },
    {
      "username": "angelorwez",
      "userUrl": "https://www.imdb.com/user/ur150272282",
      "reviewLink": "https://www.imdb.com/review/rw8680099",
      "warningSpoilers": false,
      "date": "17 November 2022",
      "rate": "10",
      "helpful": "24 out of 30 found this helpful.",
      "title": "fabulous",
      "content": "Immediately you start watching this you know you've struck gold...the pacing is perfect...am not a big fan of westerns but this one here might just be the most perfect one...the mood the aura is perfect...the acting is great...every character's demeanour is on point...even the comedy hits all the right spots...it pulls you into this world and gets you invested in the characters...character development is gradual and happens naturally...the plot breathes on its own and does seem like its heading somewhere...very very nicely done...Al's character is priceless!!...very well acted...matter of fact superbly i should say...he carries the comedy almost entirely...all by himself...he's ruthless and believable at it...he's vile sinister and just very well written...he's soo much of everything and yet still doesn't come off as over-done...fantastic writing right there...the preacher character is also very very well acted...superb portrayal...any dialogue scene that he's in is just purely sublime...fantastic!Reminds me of the last kingdom the way each character is fitted into the story so effortlessly so seamlessly...even the side characters just slot in like they've always been there...fantastic writing...the intricate plot just reminds you game of thrones...this was already perfection before game of thrones and breaking bad ever happened...every piece of the story is masterfully weaved into the plot it just blows your mind..."
    },
    {
      "username": "stevebondi",
      "userUrl": "https://www.imdb.com/user/ur23183310",
      "reviewLink": "https://www.imdb.com/review/rw7877991",
      "warningSpoilers": false,
      "date": "19 February 2022",
      "rate": "9",
      "helpful": "15 out of 18 found this helpful.",
      "title": "Realistic, gritty, high-production western! :-)",
      "content": "All the characters are awesome with great western dialog and sleaziness! :-) Timothy Olyphant perfected the old-town sheriff standard in this millenium, and Ian McShane perfected the old-town villain with multiple dimensions!"
    },
    {
      "username": "wavecat13",
      "userUrl": "https://www.imdb.com/user/ur3811523",
      "reviewLink": "https://www.imdb.com/review/rw8099694",
      "warningSpoilers": false,
      "date": "29 April 2022",
      "rate": "9",
      "helpful": "17 out of 21 found this helpful.",
      "title": "The westward expansion, as rough and gritty as it gets",
      "content": "The story meanders some, but I have that complaint about a lot of those long series. It is a gritty look at the \"Wild West\", which is here presented as a very rough place where civilized society had to struggle to get a toehold."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw3129935",
      "warningSpoilers": false,
      "date": "24 November 2014",
      "rate": "9",
      "helpful": "15 out of 20 found this helpful.",
      "title": "Even when you get so little, you'll be yearning for more",
      "content": "Three seasons do not seem to be a short term for a TV show. Look at other shows like Firefly who didn't even get that much time on air. But as with some of the other shows, after this is over, you'll be wanting more. And it is obvious that there was more planned, but it is very doubtful if this ever sees the light of day (maybe in a comic book/graphic novel incarnation).Having said all that, one of the greatest things about this show is its dialog. It is written wonderfully, unless you have an issue with swearing of course. And the way the characters express themselves is something to cherish. One of the most amazing screen characters is Mr. Al Swearengen (or Swengen or something similar as one other fellow calls him too). This might be a role of a lifetime for Ian McShane who is simply mesmerizing, whatever your feelings are towards the character.The pacing might seem (and actually is) a bit slow for some, but if you stick around, you'll be treated. And it's not the ending most people would want, but as I stated earlier, there was more to come. So this Western, with a touch of Aristocracy peppered with a lot of swearing and some odd shooting here and there, is fine dish indeed"
    },
    {
      "username": "smokehill retrievers",
      "userUrl": "https://www.imdb.com/user/ur1380602",
      "reviewLink": "https://www.imdb.com/review/rw0911640",
      "warningSpoilers": false,
      "date": "28 March 2004",
      "rate": "",
      "helpful": "191 out of 294 found this helpful.",
      "title": "Rough, gritty, realistic portrayal of Western history",
      "content": "Judging by other comments, the realistic portrayal of the crude language and immorality may be a bit too much for those used to tame, glossy horse operas where the Good are very, very good and the Bad are very, very bad.As for the language being \"over the top,\" anyone who's spent time in an Army unit or aboard ship in wartime knows this is EXACTLY the kind of language young men under stress use, and probably even worse back in the late eighteenth century when most of them were uneducated, illiterate and had a projected life span of around 30. If they were lucky.Most people familiar with authentic Western history will recognize this as a very accurate portrayal of Deadwood, or any other frontier boom town, with all its ugliness and warts. Like it or not, it's history. I think they did a superlative job so far (first two episodes).It also looks like it's going to be the most accurate version of Bill Hickock's death -- which was far more than just the simple barroom murder usually portrayed -- ever put on film.The number of truly spectacular actors here is simply staggering. Ian McShane's riveting performance is no surprise for \"Lovejoy\" fans; he was long overdue for something equal to his talent. Who else stands out? Damn near everyone. Calamity Jane, Tolliver, Farnum, the Doc ... there aren't enough \"supporting actor\" awards from any source that could do justice to such a large, stand-out cast. For those of us who despair of the putrid crap in the theaters, peopled by actors who should be doing dinner theater in Dubuque, well... now we have hope. And DEADWOOD truly puts the lie to the propaganda about public broadcasting being necessary to provide \"quality programming that commercial television just can't or won't do.\" In the entire history of public radio and TV they have NEVER reached this level of excellence even once -- yet cable (once referred to disparagingly as 'pay TV') pulls it off on a shoestring budget. Score one for capitalism."
    },
    {
      "username": "dafoat",
      "userUrl": "https://www.imdb.com/user/ur9010140",
      "reviewLink": "https://www.imdb.com/review/rw4193281",
      "warningSpoilers": false,
      "date": "7 June 2018",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "My All Time Favorite",
      "content": "Deadwood is my favorite television drama of all time. I can't think of another show with such depth, complexity and humanity. Throughout its original run I was consistently surprised and impressed. I return to the series every few years, and my fondness for it just grows. Every performance on this show is a revelation. It has the most consistently talented ensemble cast I've ever seen. My only regret is that it was cancelled before it came to a proper resolution."
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw5528939",
      "warningSpoilers": false,
      "date": "5 March 2020",
      "rate": "9",
      "helpful": "14 out of 19 found this helpful.",
      "title": "Better than I expected",
      "content": "So damn good especially to me who's barely a western fan Deadwood is exquisite! The type of show that gets better as it goes on, I admit it I had to give Deadwood a few chances. Awesome cast, sound design, cinematography throughout and well written! Deserves the praise it got, murky and immersive which is a glorious benefit to me."
    },
    {
      "username": "Primrose1",
      "userUrl": "https://www.imdb.com/user/ur119401758",
      "reviewLink": "https://www.imdb.com/review/rw7701240",
      "warningSpoilers": false,
      "date": "29 December 2021",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Utterly Peerless!",
      "content": "I just rewatched DEADWOOD and it's just as astonishingly great as I remembered.There are so many standout performances it is hardly right to mention any but Raymond McKinnon as the Reverend broke my heart anew. Ian McShane bore NO relation to Lovejoy and was delicious as the devious Al (don't call me Al) Swearengen with some great lines of pitch-black humour.This series introduced me to various actors I've subsequently followed to other roles and it took a great eye to cast them all so perfectly this time around.I can't recommend this programme too highly (so long as 'bad language' doesn't overly offend your sensibilities!"
    },
    {
      "username": "killgore86",
      "userUrl": "https://www.imdb.com/user/ur0711106",
      "reviewLink": "https://www.imdb.com/review/rw0911696",
      "warningSpoilers": false,
      "date": "23 September 2004",
      "rate": "10",
      "helpful": "395 out of 495 found this helpful.",
      "title": "They finally got the western right!",
      "content": "Don't get me wrong, there have been great westerns to come before Deadwood, but none of them really got it right. There is just a reality that some people aren't willing to deal that after 50 years of our history being whitewashed through film and TV, we're finally starting to see the truth. David Milch has done his research and discovered the wonderfully bizarre contradiction of languages used in the old west. Watching the cast of Deadwood converse with a combination of old world English laced with profanity straight from the gutter is incredible and feels right for the first time. Where do people think our language came from? People always want to think that they were the first to do something, when things like profanity, substance abuse and prostitution have been around since before man walked erect.Along with the incredible dialog and storytelling, David Milch has introduced possibly the greatest character to ever come to TV or film...Al Swearengen. Ian McShane plays Al with the same intense conviction and truth that the character himself lives by. In Al's world things are black and white and never apologizes for a second for living his life by a strict code of morals of his own making. I don't think we've ever seen a character go from crying after a mercy killing to watching a murder he orchestrated stone faced. This is indeed a special show that is continuing to pave the way for the facts of our history to finally be told with truth...Instead of the whitewashing we've seen our whole lives to make us feel better about ourselves."
    },
    {
      "username": "AnneOBrienRice",
      "userUrl": "https://www.imdb.com/user/ur3576082",
      "reviewLink": "https://www.imdb.com/review/rw0911680",
      "warningSpoilers": false,
      "date": "15 June 2004",
      "rate": "",
      "helpful": "224 out of 307 found this helpful.",
      "title": "Very simply magnificent",
      "content": "Ian McShane as the evil Al has established himself as one of the greatest actors of the moment and of the time. He's up there with Pacino, DeNiro and Keitel. The magnificent writing and directing of Deadwood support him completely in mesmerizing the audience. This is for my money the finest work being done on television today. The show has a sure moral compass and a daring to take the violence to the level of Shakespeare or the Greek Tragedy while maintaining verisimilitude with brilliant dialogue and perfect art and set direction, as well as a flawless supporting cast each of whom engages us immediately and convincingly no matter how intimate or distant the focus might be. I can't get enough of this show. I want to see it all in reruns, to cherish it later on DVD. Each episode is fresh and surprising and at times astonishing. But Ian McShane steals the show, no question of it. His face is profoundly expressive and his lines are so marvelous that some of them surely must be ad lib. The guy's a scoundrel but my heart's breaking for him. The Season Finale was the single greatest television drama I've ever seen. We have here a villain who isn't morally bankrupt. And thank heaven, we have a show runner and a writer who isn't morally bankrupt either. Bravo!! I've run out of superlatives. Please, more. And more. And more."
    },
    {
      "username": "njfilmsyndicate",
      "userUrl": "https://www.imdb.com/user/ur150745603",
      "reviewLink": "https://www.imdb.com/review/rw8008349",
      "warningSpoilers": false,
      "date": "26 March 2022",
      "rate": "10",
      "helpful": "17 out of 20 found this helpful.",
      "title": "Hands down my favorite show of all time",
      "content": "This in my opinion is the greatest show ever created. I know that's a bold statement but when you combine the linguistic poetry of David Milch with acting greats like Ian McShane, Powers Boothe, Gerald McRaney, Brian Cox and others the result is magic. I enjoyed the 2019 movie that wrapped the show up but nothing would been better than spending another full season or two in the Deadwood camp. If you enjoy compelling stories and great acting Deadwood is the show you need to check out."
    },
    {
      "username": "halnass1",
      "userUrl": "https://www.imdb.com/user/ur40069143",
      "reviewLink": "https://www.imdb.com/review/rw7645138",
      "warningSpoilers": false,
      "date": "14 December 2021",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "The best Western series I've ever seen!",
      "content": "I don't really watch Westerns. And the movie Tombstone is one of my all-time favorite movies. Deadwood is as good as Tombstone if not better. It's like watching tombstone as a series."
    },
    {
      "username": "zetes",
      "userUrl": "https://www.imdb.com/user/ur0391152",
      "reviewLink": "https://www.imdb.com/review/rw2765310",
      "warningSpoilers": false,
      "date": "10 March 2013",
      "rate": "",
      "helpful": "10 out of 14 found this helpful.",
      "title": "Excellent",
      "content": "Chronicling the Black Hills settlement of Deadwood in the post Civil War era, this HBO series is one of the most ambitious Westerns ever created for television. Its most notable element is its ornate dialogue, a stylized dialogue created by David Milch that ranks as probably the most sophisticated ever written for television. Hell, it's so thick and beautifully composed it's downright Shakespearian, you know, except for the abundant curse words, which are an art unto themselves (IMDb's trivia section claims that the F word is used a total of 2,980 times in the show's mere 36 episodes!). The dialogue is kind of a double edge sword, I would say, because it's sometimes so complex the series becomes a tad difficult to follow. I'd say a second run through might make some of the plot a bit more clear. The other major flaw is that the series was cancelled after three seasons, and it kind of ends on a cliffhanger. There was a plan to continue the series with a couple of movies, but it never came about, which is more than a little disappointing. The series boasts some fantastic acting, most notably from Ian McShane. McShane really owns the series, but other great performances come from Robin Weigert, Jeffrey Jones, Dayton Callie, Kim Dickens, Powers Booth and pretty much everyone. I was a tad disappointed that I didn't like Timothy Olyphant (ostensibly the star of the series) and John Hawkes more than I did, because those two guys are favorites of mine. Both are great, but wouldn't rank in my top 10 performers in the series."
    },
    {
      "username": "Theo Robertson",
      "userUrl": "https://www.imdb.com/user/ur1532177",
      "reviewLink": "https://www.imdb.com/review/rw1158235",
      "warningSpoilers": false,
      "date": "25 August 2005",
      "rate": "",
      "helpful": "27 out of 46 found this helpful.",
      "title": "Thankfully It's By HBO",
      "content": "My dad handed me a DVD set of DEADWOOD \" Have you heard of this ? \" he asked \" Aye . It stars Ian McShane and is produced by Home Box Office , the company that makes shows like Oz and Sex In The City \" \" Take it home with you . It's a brutal series . You might like it \" So I took it home and watched the first episode and like several people have said beforehand watching it on DVD instead of TV transmission is something of a blessing because the opening episode is heavy going as it introduces the characters . Thankfully by the end of the second episode I was hooked as I began to understand the conflict between characters and recognised where the plot strands were heading DEADWOOD is like I said produced by HBO the cable company which allows \" adult content \" in their shows and to be honest if it was made by a mainstream American TV company I wouldn't have watched the show because we'd be watching one of those dire PG western series something like THE LITTLE HOUSE ON THE PRAIRIE with better cinematography . The selling point of the show is that it's brutal adult drama set in the wild west and if you enjoyed Roy Rogers , John Wayne and Gary Cooper strutting their stuff in those old monochrome movies it doesn't necessarily mean you'll enjoy this same as if you enjoyed THE SHAWSHANK REDEMPTION doesn't mean you'll enjoy OZ .And speaking of HBO's classic prison drama if DEADWOOD resembles anything it resembles OZ the way the characters interact as they try to get one over on each other . When watching OZ I used to rub my hands in sadistic glee whenever the likes of Adebisi , Schillinger and O'Reilly were on screen because you just knew something nasty was going to happen . It's the same here when AL Swearengen makes an appearance like the scene where he asks his cleaner if she's cleaned up properly: \" Did you get get the blood off the floor ? \" \" I scrubbed real hard \" \" I didn't f--kin' ask you if you scrubbed real hard I asked you if you got the f--kin' blood off the floor ? \" Inspects blood stain \" Get me the f--kin' bucket and brush . If I want something f--kin' done in this town I have to f--kin' do it myself \" Did I mention this scene shows Al at his most merciful and compasionate ? The way Swearengen is written is and played really makes this series stand out though I do confess my favourite plot strand of the first series was the one that revolved around a couple of teenage con artists who met a sticky end at the fists of Cy Tolliver .Despite being compelling DEADWOOD is an acquired taste . No doubt history students will point out that while Swearengen , Seth Bullock , Sol Star , Calamity Jane etc existed other major characters like Alma Garret and Doc Cochran didn't so many of the plot strands and situations of the show are pure invention on the part of the writers and producers but did anyone market DEADWOOD as being 100% accurate ? One slight problem I did have was that one of the subplots featuring a child survivor of a massacre , a young girl called Sofia Metz , remains unresolved at the end of the first series . But apart from that DEADWOOD is a very well produced show with very good performances and I look forward to my Dad purchasing the second series on DVD"
    }
  ],
  "errorMessage": ""
}