{
  "imDbId": "tt0348914",
  "title": "Deadwood",
  "fullTitle": "Deadwood (TV Series 2004–2006)",
  "type": "TVSeries",
  "year": "2004",
  "episodes": [
    {
      "id": "tt0556296",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "Deadwood",
      "image": "https://m.media-amazon.com/images/M/MV5BYWE2NDE0NWEtMjUzMS00NGE1LTgzOGMtYjQyMzA3YjI2MTkyXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "21 Mar. 2004",
      "plot": "After executing his last act of justice as a Montana marshal, Seth Bullock relocates to a gold-mining camp known as Deadwood in Dakota Territory, where he and partner Sol Star look to start a hardware business. Bullock soon crosses paths with another new arrival - legendary gunfighter Wild Bill Hickok - and clashes with the formidable boss of the Gem Saloon and occasional deal broker, Al Swearengen.",
      "imDbRating": "8.2",
      "imDbRatingCount": "2914"
    },
    {
      "id": "tt0556297",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "Deep Water",
      "image": "https://m.media-amazon.com/images/M/MV5BNWQ0NWJiN2UtNDU1MS00Y2IzLThhNzMtOTg1MGZkZWM5Yzg2XkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "28 Mar. 2004",
      "plot": "As suspicions arise that \"road agents\" may have been the true perpetrators of a massacre, Swearengen takes a special interest in the health of its sole survivor, a young girl ministered to by the unlikely team of Doc Cochran and Calamity Jane. Meanwhile, Bullock and Star attempt to buy property from Swearengen, who suspects an alliance between Wild Bill and the hardware fellows.",
      "imDbRating": "8.2",
      "imDbRatingCount": "2231"
    },
    {
      "id": "tt0556306",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "Reconnoitering the Rim",
      "image": "https://m.media-amazon.com/images/M/MV5BZDU3OGQ2YTQtMWJkZS00MWNhLWI0MmUtNjVmZWQwZmUyZWFjXkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "4 Apr. 2004",
      "plot": "Competition arrives for Swearengen in the form of the Bella Union, a new gambling outfit from Chicago operated by savvy Cy Tolliver, Madame Joanie Stubbs and gaming guru Eddie Sawyer. Hickok puts up precious collateral in a poker game with McCall; Bullock and Sol strike a deal with Swearengen on a lot for their hardware store. Garret threatens Swearengen before investigating his gold claim.",
      "imDbRating": "8.1",
      "imDbRatingCount": "2080"
    },
    {
      "id": "tt0556299",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "Here Was a Man",
      "image": "https://m.media-amazon.com/images/M/MV5BNDMxMTM5NzAtNmMwNS00NjA3LWI2YmUtOTY1ODYyNjg3NjIxXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "11 Apr. 2004",
      "plot": "Swearengen directs Farnum to buy back the Garret claim. Garret's wife, Alma, prevails on Calamity Jane and Wild Bill for help with the claim issue. Hickok's respect for Bullock grows and, as a result, he commissions Bullock to do a review of the Garret claim. An ailing colleague, Andy Cramed, rejoins the Bella Union, and Wild Bill's run of luck at poker ends abruptly.",
      "imDbRating": "8.8",
      "imDbRatingCount": "2171"
    },
    {
      "id": "tt0556312",
      "seasonNumber": "1",
      "episodeNumber": "5",
      "title": "The Trial of Jack McCall",
      "image": "https://m.media-amazon.com/images/M/MV5BZjFhZDUzNmItMTcyOC00YTg3LWI3NjYtZjQ1MzNlZjBiOWJkXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "18 Apr. 2004",
      "plot": "Swearengen transforms the Gem into a courtroom as Deadwood is forced to make its own laws to try a cowardly murderer. With Calamity Jane off on a bender, Trixie is enlisted by Swearengen to help Alma with the orphaned child and to keep her pliable to his purposes. Fearing Andy's illness might threaten his business, Cy banishes him to the woods, where he is discovered by Jane.",
      "imDbRating": "8.0",
      "imDbRatingCount": "1938"
    },
    {
      "id": "tt0556304",
      "seasonNumber": "1",
      "episodeNumber": "6",
      "title": "Plague",
      "image": "https://m.media-amazon.com/images/M/MV5BZmUzZmQ1NTktOTJjZC00MmFlLTg5YWItYWRiNTM1OTc2NzY2XkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "25 Apr. 2004",
      "plot": "Bullock encounters native resistance in his quest to bring a murderer to justice. Swearengen presses Farnum to keep tabs on Alma and Trixie. After an outbreak of smallpox hits Deadwood, the camp fathers pool their resources to track down the vaccine, and Doc enlists Jane as a nurse. Swearengen proudly collaborates on an article in the Deadwood Pioneer meant to minimize the threat of the outbreak.",
      "imDbRating": "8.1",
      "imDbRatingCount": "1859"
    },
    {
      "id": "tt0556292",
      "seasonNumber": "1",
      "episodeNumber": "7",
      "title": "Bullock Returns to the Camp",
      "image": "https://m.media-amazon.com/images/M/MV5BMmM5MDIwZTUtMThlYi00NzZjLWFmNTgtZGI0ZmIwYjRhODhlXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "2 May 2004",
      "plot": "After tracking down a murderer, Bullock returns to Deadwood a changed man as well as a marked one. Dan and Joanie both take a special interest when teenagers Miles and Flora Anderson arrive in camp in search of their father. Calamity Jane earns her moniker in the Pest Tent, while Swearengen sees through Trixie's subterfuge. Alma remains cold to Farnum's inappropriately advanced bid on her claim.",
      "imDbRating": "7.9",
      "imDbRatingCount": "1957"
    },
    {
      "id": "tt0556310",
      "seasonNumber": "1",
      "episodeNumber": "8",
      "title": "Suffer the Little Children",
      "image": "https://m.media-amazon.com/images/M/MV5BYjZiYWQ0NzMtMWNmNi00MDE0LTg2MTQtYzMwN2MzM2JkOThkXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "9 May 2004",
      "plot": "Deadwood breathes easier when some riders arrive in town with the smallpox vaccine, and word of a possible treaty with the Sioux. The results of Bullock's analysis of her gold claim move Alma to reassess her plans and sets up a confrontation between Bullock and Swearengen. When Flora tries to quit, Cy teaches Joanie a deadly lesson at the expense of a couple of con artists.",
      "imDbRating": "8.2",
      "imDbRatingCount": "1992"
    },
    {
      "id": "tt0556303",
      "seasonNumber": "1",
      "episodeNumber": "9",
      "title": "No Other Sons or Daughters",
      "image": "https://m.media-amazon.com/images/M/MV5BZGE3MTk0YzAtZWIzZC00NmNlLWI2MzUtOTg4N2FlN2M3ZGIxXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "16 May 2004",
      "plot": "With annexation of Deadwood looming, Swearengen calls a meeting to set up an informal government. Bullock and Alma compare notes on Ellsworth and each other, and Farnum gets a special-delivery letter from Hickok and a special new post. Joanie finally prepares to make a go on her own, with Cy's avowed blessings, and after a long binge, Calamity Jane decides to ride out of town.",
      "imDbRating": "8.0",
      "imDbRatingCount": "1719"
    },
    {
      "id": "tt0556301",
      "seasonNumber": "1",
      "episodeNumber": "10",
      "title": "Mister Wu",
      "image": "https://m.media-amazon.com/images/M/MV5BYTI3ZjM4OTUtODQ3Yi00ZTA5LTk2NmQtNzNlNzY1MmRkNzkxXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "23 May 2004",
      "plot": "An opium theft leaves Swearengen trying to find a common language with his supplier, and navigating murky waters to deal with the mess. Meanwhile, Silas Adams, bagman for the magistrate from Yankton, arrives with bad news for Swearengen. Bullock regrets having raised his hand at the government meeting. An unwelcome and ailing Reverend Smith gravitates to the Gem and its new piano.",
      "imDbRating": "8.6",
      "imDbRatingCount": "1846"
    },
    {
      "id": "tt0556300",
      "seasonNumber": "1",
      "episodeNumber": "11",
      "title": "Jewel's Boot Is Made for Walking",
      "image": "https://m.media-amazon.com/images/M/MV5BN2FmZTcyZmQtNjBkMy00OWY1LTk5ZWEtZTZiNTM0ZTIxYThjXkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "6 Jun. 2004",
      "plot": "Alma's father, Otis Russell, arrives from New York to \"help\" with her claim. Swearengen strikes a bargain with Adams to rid him of some legal baggage involving the arriving magistrate. Jewel journeys to Doc's cabin for help with her leg. Eddie resumes work at the Bella Union, while Bullock is angered by the choice of the corrupt Con Stapleton as the new sheriff.",
      "imDbRating": "8.3",
      "imDbRatingCount": "1742"
    },
    {
      "id": "tt0556308",
      "seasonNumber": "1",
      "episodeNumber": "12",
      "title": "Sold Under Sin",
      "image": "https://m.media-amazon.com/images/M/MV5BZjcyMDA1NTMtZmZjYi00OGRlLThmZGUtZWE1ZDA4YTBmZmUzXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "13 Jun. 2004",
      "plot": "General Crook rolls into Deadwood with his troops, known as \"Custer's avengers,\" and the Yankton magistrate, Clagett, prompting a parade and business solicitations from E.B. Farnum and Cy Tolliver. Al Swearengen delivers a tortured soul from suffering, and Bullock reacts decisively to Russell's intentions regarding Alma. Stapleton's new commission as sheriff proves short-lived, and Bullock and Alma have a late-night meeting.",
      "imDbRating": "9.1",
      "imDbRatingCount": "2100"
    }
  ],
  "errorMessage": ""
}