{
  "imDbId": "tt0348914",
  "title": "Deadwood",
  "fullTitle": "Deadwood (TV Series 2004–2006)",
  "type": "TVSeries",
  "year": "2004",
  "language": "en",
  "titleInLanguage": "Deadwood (TV series)",
  "url": "https://en.wikipedia.org/wiki/Deadwood_(TV_series)",
  "plotShort": {
    "plainText": "Deadwood is an American Western television series that aired on the premium cable network HBO from March 21, 2004, to August 27, 2006, spanning three seasons and 36 episodes. The series is set in the 1870s in Deadwood, South Dakota, before and after the area's annexation by the Dakota Territory, and charts Deadwood's growth from camp to town. The show was created, produced, and largely written by David Milch. Deadwood features a large ensemble cast headed by Timothy Olyphant and Ian McShane, playing the real-life Deadwood residents Seth Bullock and Al Swearengen, respectively. Many other historical figures appear as characters, including George Crook, Wyatt Earp, E. B. Farnum, George Hearst, Wild Bill Hickok, Calamity Jane, Sol Star, A. W. Merrick, Jack McCall, and Charlie Utter. The plot lines involving these characters include historical truths as well as substantial fictional elements. Milch used actual diaries and newspapers from 1870s Deadwood residents as reference points for characters, events, and the look and feel of the show.\r\nDeadwood received critical acclaim, particularly for Milch's writing and McShane's performance, and is regarded as one of the greatest television shows of all time. It also won eight Emmy Awards (in 28 nominations) and one Golden Globe. TV Guide ranked it #8 on its 2013 list of 60 shows that were \"Cancelled Too Soon\". The show was produced by Red Board Productions and Roscoe Productions in association with HBO and Paramount Network Television.\r\nAfter several years of discussion and pre-production, Deadwood: The Movie began filming in October 2018. The film is set ten years after the end of the third season and premiered on HBO on May 31, 2019.",
    "html": "<p>Deadwood is an American Western television series that aired on the premium cable network HBO from March 21, 2004, to August 27, 2006, spanning three seasons and 36 episodes. The series is set in the 1870s in Deadwood, South Dakota, before and after the area's annexation by the Dakota Territory, and charts Deadwood's growth from camp to town. The show was created, produced, and largely written by David Milch. Deadwood features a large ensemble cast headed by Timothy Olyphant and Ian McShane, playing the real-life Deadwood residents Seth Bullock and Al Swearengen, respectively. Many other historical figures appear as characters, including George Crook, Wyatt Earp, E. B. Farnum, George Hearst, Wild Bill Hickok, Calamity Jane, Sol Star, A. W. Merrick, Jack McCall, and Charlie Utter. The plot lines involving these characters include historical truths as well as substantial fictional elements. Milch used actual diaries and newspapers from 1870s Deadwood residents as reference points for characters, events, and the look and feel of the show.</p><p>Deadwood received critical acclaim, particularly for Milch's writing and McShane's performance, and is regarded as one of the greatest television shows of all time. It also won eight Emmy Awards (in 28 nominations) and one Golden Globe. TV Guide ranked it #8 on its 2013 list of 60 shows that were \"Cancelled Too Soon\". The show was produced by Red Board Productions and Roscoe Productions in association with HBO and Paramount Network Television.</p><p>After several years of discussion and pre-production, Deadwood: The Movie began filming in October 2018. The film is set ten years after the end of the third season and premiered on HBO on May 31, 2019.</p>"
  },
  "plotFull": {
    "plainText": "Deadwood is an American Western television series that aired on the premium cable network HBO from March 21, 2004, to August 27, 2006, spanning three seasons and 36 episodes. The series is set in the 1870s in Deadwood, South Dakota, before and after the area's annexation by the Dakota Territory, and charts Deadwood's growth from camp to town. The show was created, produced, and largely written by David Milch. Deadwood features a large ensemble cast headed by Timothy Olyphant and Ian McShane, playing the real-life Deadwood residents Seth Bullock and Al Swearengen, respectively. Many other historical figures appear as characters, including George Crook, Wyatt Earp, E. B. Farnum, George Hearst, Wild Bill Hickok, Calamity Jane, Sol Star, A. W. Merrick, Jack McCall, and Charlie Utter. The plot lines involving these characters include historical truths as well as substantial fictional elements. Milch used actual diaries and newspapers from 1870s Deadwood residents as reference points for characters, events, and the look and feel of the show.\r\nDeadwood received critical acclaim, particularly for Milch's writing and McShane's performance, and is regarded as one of the greatest television shows of all time. It also won eight Emmy Awards (in 28 nominations) and one Golden Globe. TV Guide ranked it #8 on its 2013 list of 60 shows that were \"Cancelled Too Soon\". The show was produced by Red Board Productions and Roscoe Productions in association with HBO and Paramount Network Television.\r\nAfter several years of discussion and pre-production, Deadwood: The Movie began filming in October 2018. The film is set ten years after the end of the third season and premiered on HBO on May 31, 2019.\r\nCast\r\nProduction\r\nThe first book that the show's creator, David Milch, purchased as research for the series was Deadwood: The Golden Years by Watson Parker, a historian who specialized in the history of the Black Hills. Milch and his colleagues later bought many of Parker's books and papers as references for Deadwood.\r\nWriting\r\nThemes\r\nMilch has pointed out repeatedly in interviews that the intent of the show was to study the way that civilization comes together from chaos by organizing itself around symbols (in Deadwood the main symbol is gold). Initially, he intended to study this within Roman civilization (the central symbol was to be the religious cross), but HBO's Rome series was already in development and Milch was asked by the network if he could stage the story in another place. Although the series touches on a variety of issues including race, prostitution, misogyny, violence, politics, and immigration, most of the major story lines are grounded in the issue of bringing order from chaos.\r\nUse of profanity\r\nFrom its debut, Deadwood drew attention for its extensive profanity. The historical accuracy and dramatic intent of its use of obscenities has been the subject of controversy and discussion. The word \"fuck\" is said 43 times in the first hour of the show. It has been reported that the series had a total count of 2,980 \"fucks\" and an average of 1.56 utterances of \"fuck\" per minute of footage.\r\nPlot\r\nSeason 1 (2004)\r\nThe first season takes place in 1876, six months after the founding of the camp, soon after Custer's Last Stand. Seth Bullock leaves his job as a marshal in Montana to establish a hardware business in the gold-mining camp of Deadwood, along with his friend and business partner, Sol Star. Wild Bill Hickok, the infamous gunslinger of the west, is on a separate journey to Deadwood, accompanied by Charlie Utter and Calamity Jane. Al Swearengen is the owner of The Gem, a local saloon and brothel. Other notable residents include Dr. Amos Cochran; A. W. Merrick, owner and editor of the local newspaper \"The Pioneer\"; and E. B. Farnum, proprietor of The Grand Central Hotel.\r\nBullock encounters a man of an unknown name, who claims that Indians had killed an immigrant family along the road, and he and Hickok along with others ride out to investigate. Swearengen at his saloon offers bounties for Indian scalps, in apparent revenge for the murders, and discounts on booze and women. Bullock and Hickok investigate and find the wagon turned over and all but one of the immigrant family killed. Before sunrise they confront the unknown man and point to holes in his story, saying the raid appeared to be a setup by whites. When he draws his weapon both men draw in defense, and Hickok's bullet kills him. Swearengen wakes to hear of these new events as told by E.B. Farnum, and is particularly unhappy hearing that one of the immigrant party survived, suspecting that his road agents may have been responsible for the raid.\r\nBrom Garret, a wealthy businessman from New York City, lives at The Grand Central Hotel with his wife, Alma, who nurses a secret laudanum habit. Aware that Garret is interested in prospecting, Swearengen and Farnum deceive him into purchasing a gold claim in a confidence game. Newly arrived Cy Tolliver and his entourage purchase an abandoned hotel across from The Gem and begin renovations, then open the Bella Union Saloon, a luxurious gambling house and brothel. Brom Garret soon learns that his gold claim is worthless and demands Swearengen reimburse his money. Swearengen orders Dan Dority to kill Garret and \"make it look like an accident.\" Dority throws Garret off a cliff, only to discover that the claim is actually a rich one after all. Newly widowed Alma Garret asks Wild Bill Hickok for guidance regarding the gold claim and Swearengen's renewed interest. Hickok asks Bullock to advise Garret; Bullock agrees. Bullock suggests that Garret hire Whitney Ellsworth, a trustworthy and experienced prospector. Alma Garret takes custody of young Sofia Metz, whose family was murdered on the way back to Minnesota.\r\nDuring a poker game, Wild Bill Hickok is murdered by Jack McCall in Tom Nuttall's #10 Saloon. When McCall is put on trial, Swearengen leans on the acting magistrate, suggesting that McCall must be acquitted to avoid scrutiny from Washington, D.C. The judge cuts the trial short and the jury acquits McCall, who leaves town immediately after the verdict. Bullock pursues McCall, determined to bring him to justice. Bullock and Charlie Utter later find McCall hiding at a boarding house and take him to Yankton for trial.\r\nSmallpox spreads in Deadwood, creating an urgent need for vaccines. The afflicted are segregated from the main camp in plague tents. Calamity Jane aids Doctor Cochran in caring for the sick.\r\nThe senior members of the community form a municipal government to prepare for future annexation, as well as to bribe the territorial legislature, thereby ensuring the security of existing titles, claims and properties. Swearengen bribes local magistrate Clagett to quash a murder warrant.\r\nAlma's father Otis Russell arrives with plans to secure Alma's new-found wealth in order to pay off his endless debts and fulfill his own greed. The U.S. army arrives in Deadwood and a parade is organized. Bullock confronts a self-confident Otis Russell in The Bella Union. When Russell threatens the safety of his own daughter should Bullock stand in the way of his acquiring the gold claim, Seth unceremoniously beats him and orders Russell to leave the camp.\r\nThe increasingly addled Reverend Smith, dying from an apparent brain tumor, is smothered to death by Al Swearengen in a mercy killing. Tolliver attempts to bribe General Crook to leave a garrison in Deadwood but is indignantly refused. When Magistrate Clagett attempts to extort Swearengen further over the murder warrant, Swearengen responds by enlisting Clagett's \"toll collector,\" Silas Adams, to murder Clagett. Silas performs the deed and allies himself with Swearengen, becoming his agent. As Sheriff Con Stapleton has been compromised by Cy Tolliver, Bullock volunteers to become the new sheriff as the cavalry rides out of town.\r\nSeason 2 (2005)\r\nSeason two begins in 1877, seven months after the events of season 1, and the camp has become somewhat more orderly and civilized.\r\nWhen Swearengen publicly disparages Bullock's abilities as sheriff, intimating that Bullock's focus is not on his job due to his affair with Alma Garret, Bullock removes his gun and badge and Swearengen and Bullock fight, accidentally falling over the Gem balcony. Al is about to slit Bullock's throat in the muddy street, but stops after looking up to see Bullock's wife Martha and her son William arriving in camp. Bullock tells Alma they must either leave camp or stop seeing one another. Garret agrees that it is better to end the relationship and remain in town. Calamity Jane resurfaces and manages to support Bullock and Utter in persuading Swearengen to return Bullock's gun and badge. A truce is made. Garret discovers she is pregnant by Bullock and confides in Trixie, who persuades Ellsworth to make a marriage proposal to Garret and influences Garret to accept the proposal in order to save her the humiliation of unwed motherhood.\r\nSwearengen collapses in his office with the door locked. His concerned associates assume that he wants to be left alone, but as the day passes their alarm grows and they finally break into the office. Dr. Cochran diagnoses Al with kidney stones and performs a draining procedure. Swearengen eventually passes the stones but has a small stroke in the process.\r\nJoanie Stubbs opens her own brothel, The Chez Amis, with her newly arrived partner Maddie. Francis Wolcott, a geologist working for George Hearst, arrives in Deadwood and soon makes his presence felt at the Chez Amis. Wolcott has paid for the transportation of most of the prostitutes, in order to cater to his selective tastes. Cy Tolliver learns of Wolcott's sexual proclivities and baits him, resulting in Wolcott murdering Carrie and Doris, two of Joanie Stubb's prostitutes. When Maddie attempts to extort money from Wolcott, he kills her too. Cy Tolliver has the bodies removed and pardons Wolcott. Joanie sends the remaining girls away so that they will be safe from Wolcott. Joanie confides in Charlie Utter regarding the murders, extracting a promise that he never repeats the information.\r\nAlma fires Miss Isringhausen, Sofia's tutor. Isringhausen turns to Silas Adams under the pretext of fear for her life at the hands of the Widow Garret, and they embark upon a relationship. Isringhausen convinces Adams to allow her to meet with Swearengen. At the meeting, she admits to being an agent of the Pinkertons under the employ of Brom Garret's family, who instructed Isringhausen to frame Alma for soliciting Swearengen to murder her husband. Swearengen agrees to play along, but later reveals to Garret that he intends to blackmail Isringhausen due to his hatred for the Pinkerton agency.\r\nSamuel Fields, \"The Nigger General,\" returns to camp. He tries to enlist Hostetler in his schemes. Bullock is forced to rescue him from an angry mob headed by Steve, a virulently racist drunk. Later, Hostetler catches a drunken Steve in the livery stable masturbating on Bullock's horse in revenge. Fields and Hostetler manage to coerce Steve into signing a written confession of bestiality. The admission will be publicized should Steve make any trouble for either of the livery workers in the future.\r\nHugo Jarry, a Yankton commissioner, tries to persuade Swearengen and Tolliver that Deadwood should become part of Dakota territory rather than Montana. He ends up siding with Swearengen.\r\nAlma Garret enlists the help of Sol Star to establish a bank in the camp.\r\nWolcott's agent Lee burns the bodies of captive Chinese prostitutes who have died from malnourishment while under his control. Mr. Wu is enraged and requests Swearengen's help to stop Lee. Because Lee is employed by Wolcott, who is in turn employed by George Hearst, Swearengen refuses any help until after negotiations over the town's future have been resolved. Mr. Wu escapes Swearengen's house arrest at The Gem, but Johnny Burns stops him from exacting his revenge on Lee or being killed himself.\r\nWilliam Bullock is trampled by a horse that escapes during a failed gelding and dies several hours after. His funeral is attended by many of Deadwood's citizens and the service is conducted by former card sharp Andy Cramed, who has returned to Deadwood an ordained minister.\r\nGeorge Hearst arrives in Deadwood and when he learns of the murders committed by Wolcott, confronts and fires him. Hearst purchases the Grand Central hotel from E. B. Farnum. The shamed Wolcott hangs himself. Tolliver claims to be in possession of a letter of confession in which Wolcott states that Hearst was aware of his murderous ways, yet continued his employment. Tolliver blackmails Hearst for 5% of every gold claim he has acquired in Deadwood.\r\nAl Swearengen negotiates with George Hearst on behalf of Mr. Wu, and they agree that Wu can regain his status if his people prove to be better workers than those of the \"San Francisco cocksucker\" Lee. Mr. Wu and Swearengen's henchmen plan vengeance in Deadwood's Chinatown. The operation is successful and Wu slits the throat of his rival.\r\nAlma Garret and Ellsworth marry at a ceremony conducted by Andy Cramed at the Grand Central hotel. After much dealing and double-dealing on the part of Swearengen and Silas Adams, the official papers confirming Deadwood's annexation into Yankton territory are signed by Bullock and Swearengen with Hugo Jarry present. Andy Cramed stabs Tolliver outside the Bella Union.\r\nSeason 3 (2006)\r\nSeason three begins six weeks after the events of season 2. Government and law, as well as the interests of powerful commercial entities, begin to enter the town as Deadwood prepares itself for entry into Dakota Territory.\r\nHearst has several of his own Cornish miners murdered when they attempt to unionize. Elections are announced: Star and Farnum run for Mayor, while Bullock and barman Harry Manning compete for Sheriff. Angered that Hearst had someone killed in the Gem, Al cancels the election debates in an attempt to reassert his position in the camp. To teach Al a lesson and force him to help Hearst buy Alma's claim, Hearst has his lead henchman Captain Turner restrain Al, then chops off one of his fingers.\r\nOver Ellsworth's strong objections, Alma meets with Hearst to discuss buying her claim. Hearst becomes furious when she offers him a merely non-controlling interest and behaves menacingly towards Alma, but then allows her to leave without following through on his implied threat of rape.\r\nTolliver slowly recovers after being stabbed and gets back on his feet. Hearst knows Cy is lying about having a letter from Wolcott but decides to employ Cy to help deal with the members of the camp. Traveling actor Jack Langrishe arrives in Deadwood with his theatre troupe. He is an old friend of Swearengen's and eventually buys the former Chez Amis (now a school house) from Joannie Stubbs on condition that he build a new school for the camp's children. Alma undergoes a D & C by Doc Cochran when her pregnancy threatens her health.\r\nHostetler and Samuel Fields return to the camp to find that Steve has taken over the livery. Bullock mediates between them, eventually getting Hostetler to agree to sell the Livery to Steve. Steve's ranting, racial slurs and impugning of Hostetler's honor finally drive the latter over the edge and he shoots himself.\r\nAnother miner is killed. Already angry from the Hostetler/Steve ordeal, Bullock arrests Hearst, drags him by the ear through the public thoroughfare and puts him in jail overnight.\r\nAlma is once again using dope. Leon confesses to Cy that he is Alma's supplier. Cy relays this news to Hearst but Hearst is still angry from his encounter with Bullock and believes that if Tolliver had told him this useful news beforehand he might not have provoked the sheriff. A furious Tolliver tells Leon to do nothing, but Leon, afraid of being implicated in Alma's murder, has already cut her off. Suspecting that Alma's return to drugs is due to her unhappiness at being married to a man she doesn't love, Ellsworth moves out of their house. They later agree to separate and Alma is able to stop taking the laudanum.\r\nHearst brings a large force of Pinkertons to the camp and encourages them to stir up trouble. Swearengen holds a meeting to decide what to do about Hearst. The town leaders are unable to decide on any direct action, other than to publish a letter from Bullock to the wife of one of the murdered miners that subtly highlights Hearst's callousness. Hearst has Merrick beaten for publishing it.\r\nAlma is shot at in the street. Swearengen takes her into the Gem and orders Dan to kidnap and restrain Ellsworth. Al guesses, correctly, that Hearst ordered the shooting, in an attempt to provoke then kill Ellsworth when he comes to Alma's aid. Hearst sends his second, the same man that beat Merrick and possibly also shot at Alma, to negotiate with Swearengen; Al kills him after extracting information. The town unites to protect Alma as she returns to work at the bank. Hearst has Ellsworth assassinated in his tent at Alma's mine. Trixie shoots Hearst in revenge for Ellsworth's death but fails to kill him. Fearing for her and Sofia's lives and unwilling to make the camp responsible for her protection, Alma sells her claim to Hearst to avoid further bloodshed.\r\nBullock receives discouraging news about the county election returns in his race for sheriff against Harry Manning, all the while knowing Hearst may have manipulated the results using Federal soldiers brought in to vote for his handpicked candidate elsewhere in the county.\r\nHearst demands that the whore who shot him be executed. Swearengen and Wu gather a militia in case a war breaks out. Al murders the prostitute Jen, despite Johnny's objections, in the hope of passing her corpse off as Trixie and placating Hearst. The ruse works and Hearst leaves Deadwood, giving over control of \"all his other-than-mining interests\" to Tolliver. Tolliver points a gun at Hearst from his balcony and wants to shoot him but instead watches as Bullock sees a smirking Hearst out of the camp. Enraged that Hearst is cutting him off, Tolliver takes his frustrations out on Leon by stabbing him in the femoral artery. Johnny and Al speak briefly of Jen's death, before Al returns to scrubbing her bloodstain.\r\nDeadwood: The Movie (2019)\r\nIn 1889, past and present residents of Deadwood are reunited to celebrate South Dakota's impending entrance into the Union as the 40th state.\r\nFilm continuation\r\nFollowing the cancellation of the series, it was reported on June 7, 2006 that HBO and creator David Milch had agreed to make two two-hour television films in place of a fourth season, after Milch declined a short-order of six episodes. This was because in the show's original format, each season portrayed two weeks in the life of Deadwood, with each episode representing one day. The final two-hour format would release these time restraints and allow for a broader narrative to finish off the series. In an interview on January 13, 2007, Milch stated that he still intended to finish the two films, if possible. On July 12, 2007, HBO executives admitted that producing the telefilms would be difficult and put the chances of their ever being made at \"50–50.\"\r\nIn an interview on October 1, 2007, actor Ian McShane claimed that the show's sets were due to be dismantled, and the movies would not be made; however, he was referring to the show-related set pieces, i.e., front added to the buildings, props, etc., the set as itself, \"Melody Ranch\", being unchanged at least as of 2010. Actors Jim Beaver and W. Earl Brown commented a day later that they considered the series to be over. In the March 17, 2009, episode of The Daily Show with Jon Stewart, McShane repeated that \"Deadwood is dead.\" In a January 14, 2011, interview in Esquire, Milch said: \"I don't know that the last word has been said on the subject ... I still nourish the hope that we're going to get to do a little more work in that area.\" In a March 21, 2012, interview, Milch was asked if the movies would ever be produced and replied, \"No, I don’t think so. We got really close about a year ago. Never say never, but it doesn’t look that way.\"\r\nOn August 12, 2015, it was reported that talks between HBO and Milch had resumed regarding a Deadwood film. In January 2016, HBO gave Milch the green-light to write a script for the film. On August 1, 2016, Casey Bloys, HBO's new head of programming, stated that Milch was writing the script for a Deadwood movie. On April 19, 2017, McShane announced that Milch submitted a script for a two-hour Deadwood movie to HBO, saying: \" two-hour movie script has been delivered to HBO. If they don't deliver, blame them.\" McShane said that he hoped to discuss the film with Milch further, and said of the original cast returning that \"we'd all love to do it ... It would be nice to see all of the old gang again.\" On November 12, 2017, TVLine reported that the Deadwood movie was set to begin production in fall 2018, although HBO had not officially green-lit the project.\r\nIn an interview with the Los Angeles Times on July 20, 2018, Robin Weigert said that a Deadwood film would likely be filmed in the fall of 2018: \"It’s safe enough to say is happening this fall.\" She explained: \"There’s a set being built and tax incentives to get it done. A lot of have signed on. There’s a 90% chance it’ll finally happen.\" Five days later, on July 25, HBO confirmed that a Deadwood movie had been greenlit and that Dan Minahan, who directed four episodes in the series' original run, would direct the film, with production set to begin in October 2018. According to research requested by the producers, the film is likely to be set in 1889, approximately 10 years after the end of season 3. On August 21, 2018, W. Earl Brown gave his thoughts on the final draft of the script saying, \"in the course of those two hours, my emotions ricocheted in every fucking direction: exhilaration to melancholy; hoots of joy to screams of despair. The Maestro has topped himself. The structure is essentially the same as the first version I read a year and a half ago, but the complexities of the relationships, the emotional peaks and depths, are all sharpened to a razor fine edge. It’s gut wrenching.\"\r\nBrown also confirmed that, \"Everyone from the main cast who still draws air, with the exception of Silas Adams (Titus Welliver)\", would return. Some members of the original series' cast, including Powers Boothe, Ricky Jay, and Ralph Richeson, died between the conclusion of the series’ first run and production of the film continuation. Boothe's small role in an early version of the script was written out, and the characters played by Jay and Richeson were not recast. Welliver was unable to appear in the film due to scheduling conflicts, as he was filming his Amazon Prime series Bosch. Garret Dillahunt and Larry Cedar, who played characters who were killed in the original series, returned as background characters; Dillahunt plays a drunk who throws something at Hearst, yelling: \"Hope you die in the street, like my dad did!\"\r\nProduction on the film began on October 5, 2018, according to Brown. On November 5, 2018, HBO announced that the film had begun production, confirming the returns of several cast members. The film premiered on HBO on May 31, 2019, and received critical acclaim.\r\nCritical reception\r\nDeadwood received almost universal praise from critics over the course of its three-year run. On Metacritic, the first season has an 80 out of 100 score sampled from 26 critics, indicating \"generally favorable reviews\". The second season scored 93 out of 100 based on 15 critics, and third season scored 85 out of 100 based on 20 critics, both indicating \"universal acclaim\", with only one mixed review of the third season coming from Newsday's Verne Gay.\r\nOn Rotten Tomatoes, the first season has an approval rating of 85% based on 39 reviews, with an average score of 8.19/10. The site's critical consensus reads, \"Deadwood's absorbing first season presents a vivid, un-sanitized depiction of a frontier town that stakes its claim alongside other classic entries in the Western genre.\" The second season has an approval rating of 96% based on 25 reviews, with an average score of 9.5/10. The critical consensus reads, \"Amid the grit and lawlessness, season two of Deadwood offers a richly textured portrait of an Old West community buoyed by its talented ensemble cast.\" The third season has an approval rating of 95% based on 38 reviews, with an average score of 8.89/10. The critical consensus reads, \"Deadwood's final season ends with a frustrating lack of closure, but that ambiguous final note doesn't detract from an outstanding series that ranks among the best the genre has to offer.\"\r\nThe praise generally centered on the strength of the writing and Milch's unique style of dialogue. Time Out New York's Andrew Johnston listed Deadwood in his top ten TV shows for both 2005 and 2006, commenting: \"If history is written by the victors, Deadwood is all about giving the losers their due. In the first season, magnificent bastard Al Swearengen (Ian McShane) came off as a villain; this year, his inevitably doomed campaign to save the lawless town from annexation by the United States and exploitation by robber barons served as a brilliant allegory for the evolution of American capitalism.\" Film critic Matt Zoller Seitz considers Deadwood to be \"the greatest TV show ever\" and he wrote a 2022 book detailing the making of the series titled The Deadwood Bible: A Lie Agreed Upon.\r\nAwards\r\nMusic\r\nOpening credits\r\nThe Deadwood title music is a piece by David Schwartz.\r\nAccording to his website, David Schwartz lists the following instruments as having been used:\r\nFiddle, Cavaquinho, Weissenborn, Guitar, Harmonium, Duduk, and Kitchen Pots\r\nClosing credits\r\nThe closing credits music is listed below:\r\nSeason 1\r\nSeason 2\r\nSeason 3\r\nDeadwood: The Movie\r\n\"Hog of the Forsaken\" – Michael Hurley",
    "html": "<p>Deadwood is an American Western television series that aired on the premium cable network HBO from March 21, 2004, to August 27, 2006, spanning three seasons and 36 episodes. The series is set in the 1870s in Deadwood, South Dakota, before and after the area's annexation by the Dakota Territory, and charts Deadwood's growth from camp to town. The show was created, produced, and largely written by David Milch. Deadwood features a large ensemble cast headed by Timothy Olyphant and Ian McShane, playing the real-life Deadwood residents Seth Bullock and Al Swearengen, respectively. Many other historical figures appear as characters, including George Crook, Wyatt Earp, E. B. Farnum, George Hearst, Wild Bill Hickok, Calamity Jane, Sol Star, A. W. Merrick, Jack McCall, and Charlie Utter. The plot lines involving these characters include historical truths as well as substantial fictional elements. Milch used actual diaries and newspapers from 1870s Deadwood residents as reference points for characters, events, and the look and feel of the show.</p><p>Deadwood received critical acclaim, particularly for Milch's writing and McShane's performance, and is regarded as one of the greatest television shows of all time. It also won eight Emmy Awards (in 28 nominations) and one Golden Globe. TV Guide ranked it #8 on its 2013 list of 60 shows that were \"Cancelled Too Soon\". The show was produced by Red Board Productions and Roscoe Productions in association with HBO and Paramount Network Television.</p><p>After several years of discussion and pre-production, Deadwood: The Movie began filming in October 2018. The film is set ten years after the end of the third season and premiered on HBO on May 31, 2019.</p><br/><h3>Cast</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th style=\"align: center; background: lavender;\" colspan=\"4\"><b>Main cast</b></th></tr><tr><th style=\"align: center; background: #D4F2CE;\">Actor</th><th style=\"align: center; background: #D4F2CE;\">Character</th><th style=\"align: center; background: #D4F2CE;\">Based on</th><th style=\"align: center; background: #D4F2CE;\">Profession</th></tr><tr><td><span>Timothy Olyphant</span></td><td>Seth Bullock</td><td><span>Seth Bullock</span></td><td>Sheriff/co-owner of Star &amp; Bullock Hardware</td></tr><tr><td><span>Ian McShane</span></td><td>Al Swearengen</td><td><span>Al Swearengen</span></td><td>Owner of <span>The Gem Saloon</span></td></tr><tr><td><span>Molly Parker</span></td><td>Alma Garret</td><td></td><td>Widow of claim seeker, later married to Ellsworth</td></tr><tr><td><span>Jim Beaver</span></td><td>Whitney Ellsworth</td><td></td><td>Prospector/husband to Alma Garret</td></tr><tr><td><span>Brad Dourif</span></td><td>Dr. Amos \"Doc\" Cochran</td><td>Composite of several Deadwood physicians, including Lyman F. Babcock and F.S. Howe</td><td>Physician</td></tr><tr><td><span>John Hawkes</span></td><td>Sol Star</td><td><span>Sol Star</span></td><td>Co-owner of Star &amp; Bullock Hardware</td></tr><tr><td><span>Paula Malcomson</span></td><td>Trixie</td><td>Based on a number of \"Tricksies\" who were prostitutes at The Gem</td><td>Prostitute</td></tr><tr><td><span>Leon Rippy</span></td><td>Tom Nuttall</td><td>Billy Nuttall</td><td>Owner of <span>Nuttall's #10 Saloon</span></td></tr><tr><td><span>William Sanderson</span></td><td>E. B. Farnum</td><td><span>E. B. Farnum</span></td><td>Owner of The Grand Central Hotel</td></tr><tr><td><span>Robin Weigert</span></td><td>Calamity Jane</td><td><span>Calamity Jane</span></td><td>Friend of Hickok/scout</td></tr><tr><td><span>W. Earl Brown</span></td><td>Dan Dority</td><td>Dan Doherty</td><td>Gem Saloon worker</td></tr><tr><td><span>Dayton Callie</span></td><td>Charlie Utter</td><td><span>Charlie Utter</span></td><td>Friend of Hickok/deputy to Sheriff Bullock</td></tr><tr><td><span>Keith Carradine</span></td><td>Wild Bill Hickok</td><td><span>Wild Bill Hickok</span></td><td>Famed gunslinger</td></tr><tr><td><span>Powers Boothe</span></td><td>Cy Tolliver</td><td>Tom Miller</td><td>Owner of <span>The Bella Union</span></td></tr><tr><td><span>Kim Dickens</span></td><td>Joanie Stubbs</td><td>Loosely based on <span>Dora DuFran</span></td><td>Former hostess of The Bella Union/owner of The Chez Amis</td></tr><tr><td><span>Anna Gunn</span></td><td>Martha Bullock</td><td><span>Martha Bullock</span></td><td>Wife of Seth, mother of William</td></tr><tr><td><span>Jeffrey Jones</span></td><td>A. W. Merrick</td><td><span>A. W. Merrick</span></td><td>Editor of <i>The Deadwood Pioneer</i></td></tr><tr><td><span>Sean Bridgers</span></td><td>Johnny Burns</td><td>Johnny Burns</td><td>Gem Saloon worker</td></tr><tr><td><span>Titus Welliver</span></td><td>Silas Adams</td><td></td><td>Emissary of Magistrate Clagett turned crony of Al Swearengen</td></tr><tr><td>Bree Seanna Wall</td><td>Sofia Metz</td><td></td><td>Adopted daughter of Alma; sole survivor of an attack on her family</td></tr><tr><td>Josh Eriksson</td><td>William Bullock</td><td>Loosely based on Douglas Kislingbury</td><td>Stepson of Seth; biological son of Robert and Martha Bullock</td></tr><tr><td><span>Garret Dillahunt</span></td><td>Francis Wolcott</td><td>L. D. Kellogg</td><td>Geologist for George Hearst</td></tr><tr><td><span>Brent Sexton</span></td><td>Harry Manning</td><td>John Manning</td><td>Barman at Nuttall's #10 Saloon</td></tr><tr><th style=\"align: center; background: lavender;\" colspan=\"4\"><b>Supporting cast</b></th></tr><tr><th style=\"align: center; background: #D4F2CE;\">Actor</th><th style=\"align: center; background: #D4F2CE;\">Character</th><th style=\"align: center; background: #D4F2CE;\">Based on</th><th style=\"align: center; background: #D4F2CE;\">Profession</th></tr><tr><td><span>Geri Jewell</span></td><td>Jewel Caulfield</td><td></td><td>Disabled cleaning woman at the Gem</td></tr><tr><td><span>Franklyn Ajaye</span></td><td>Samuel Fields</td><td><span>Samuel Fields</span></td><td>Self-proclaimed \"Nigger General\"</td></tr><tr><td><span>Keone Young</span></td><td>Mr. Wu</td><td></td><td>Boss of the Chinese population; owns a pig pen and laundry</td></tr><tr><td><span>Peter Jason</span></td><td>Con Stapleton</td><td>Con Stapleton</td><td>Worker for Cy Tolliver</td></tr><tr><td><span>Cleo King</span></td><td>Aunt Lou</td><td>Lucretia Marchbanks</td><td>Hearst's personal cook</td></tr><tr><td><span>Gerald McRaney</span></td><td>George Hearst</td><td><span>George Hearst</span></td><td>California businessman and prospector</td></tr><tr><th style=\"align: center; background: lavender;\" colspan=\"4\"><b>Recurring cast</b></th></tr><tr><th style=\"align: center; background: #D4F2CE;\">Actor</th><th style=\"align: center; background: #D4F2CE;\">Character</th><th style=\"align: center; background: #D4F2CE;\">Based on</th><th style=\"align: center; background: #D4F2CE;\">Profession</th></tr><tr><td><span>Timothy Omundson</span></td><td>Brom Garrett</td><td></td><td>Alma's husband and claim seeker</td></tr><tr><td><span>Garret Dillahunt</span></td><td>Jack McCall</td><td><span>Jack McCall</span></td><td>Murderer of Wild Bill Hickok</td></tr><tr><td><span>Ray McKinnon</span></td><td>Reverend Smith</td><td><span>Henry Weston Smith</span></td><td>Minister of Deadwood</td></tr><tr><td><span>Ricky Jay</span></td><td>Eddie Sawyer</td><td></td><td><span class=\"mw-redirect\">Card shark</span> employed at The Bella Union</td></tr><tr><td><span>Larry Cedar</span></td><td>Leon</td><td></td><td>Worker for Cy Tolliver</td></tr><tr><td><span>Zach Grenier</span></td><td>Andy Cramed</td><td>Andy Cramed</td><td>Gambler who brought <span>smallpox</span> to Deadwood, later minister</td></tr><tr><td><span>Ralph Richeson</span></td><td>Pete Richardson</td><td></td><td>Cook at the Grand Central</td></tr><tr><td><span>Alice Krige</span></td><td>Maddie</td><td></td><td>Madam of the Chez Amis</td></tr><tr><td><span>Sarah Paulson</span></td><td>Miss Isringhausen</td><td></td><td>Tutor to Sofia/<span class=\"mw-redirect\">Pinkerton</span> agent</td></tr><tr><td><span>Monty \"Hawkeye\" Henson</span></td><td>Hawkeye</td><td></td><td>Assistant to Silas Adams</td></tr><tr><td><span>Stephen Tobolowsky</span></td><td>Commissioner Jarry</td><td>Hugh McCaffrey</td><td>Commissioner for <span>Lawrence County</span>, Dakota Territory</td></tr><tr><td><span class=\"mw-redirect\">Pasha Lychnikoff</span></td><td>Blazanov</td><td></td><td>Operator of Deadwood's telegraph service</td></tr><tr><td><span>Richard Gant</span></td><td>Hostetler</td><td></td><td>Livery owner</td></tr><tr><td><span>Michael Harney</span></td><td>Steve Fields</td><td></td><td>Takes over livery stable when Hostetler leaves camp</td></tr><tr><td><span>Allan Graf</span></td><td>Captain Joe Turner</td><td></td><td>Enforcer for Hearst</td></tr><tr><td><span>Brian Cox</span></td><td>Jack Langrishe</td><td><span>Jack Langrishe</span></td><td>Stage promoter</td></tr><tr><td>Jennifer Lutheran</td><td>Jen</td><td></td><td>Gem prostitute and special friend of Johnny Burns</td></tr><tr><th style=\"align: center; background: lavender;\" colspan=\"4\"><b>Guest cast</b></th></tr><tr><th style=\"align: center; background: #D4F2CE;\">Actor</th><th style=\"align: center; background: #D4F2CE;\">Character</th><th style=\"align: center; background: #D4F2CE;\">Based on</th><th style=\"align: center; background: #D4F2CE;\">Profession</th></tr><tr><td><span>Gale Harold</span></td><td>Wyatt Earp</td><td><span>Wyatt Earp</span></td><td>Legendary Western lawman</td></tr><tr><td><span>Austin Nichols</span></td><td>Morgan Earp</td><td><span>Morgan Earp</span></td><td>Legendary Western lawman</td></tr><tr><td><span>Omar Gooding</span></td><td>Odell</td><td></td><td>Son of Aunt Lou</td></tr></tbody></table><br/><h3>Production</h3><p>The first book that the show's creator, David Milch, purchased as research for the series was Deadwood: The Golden Years by Watson Parker, a historian who specialized in the history of the Black Hills. Milch and his colleagues later bought many of Parker's books and papers as references for Deadwood.</p><h4>Writing</h4><h4>Themes</h4><p>Milch has pointed out repeatedly in interviews that the intent of the show was to study the way that civilization comes together from chaos by organizing itself around symbols (in Deadwood the main symbol is gold). Initially, he intended to study this within Roman civilization (the central symbol was to be the religious cross), but HBO's Rome series was already in development and Milch was asked by the network if he could stage the story in another place. Although the series touches on a variety of issues including race, prostitution, misogyny, violence, politics, and immigration, most of the major story lines are grounded in the issue of bringing order from chaos.</p><h4>Use of profanity</h4><p>From its debut, Deadwood drew attention for its extensive profanity. The historical accuracy and dramatic intent of its use of obscenities has been the subject of controversy and discussion. The word \"fuck\" is said 43 times in the first hour of the show. It has been reported that the series had a total count of 2,980 \"fucks\" and an average of 1.56 utterances of \"fuck\" per minute of footage.</p><br/><h3>Plot</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">12</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 21, 2004</td><td style=\"padding:0 8px\">June 13, 2004</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">12</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 6, 2005</td><td style=\"padding:0 8px\">May 22, 2005</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">12</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 11, 2006</td><td style=\"padding:0 8px\">August 27, 2006</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"3\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Film</span></span></span></span></th><td colspan=\"2\" style=\"padding:0.2em 0.4em\">May 31, 2019</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This article's plot summary <b>may be <span>too long or excessively detailed</span>.</b><span class=\"hide-when-compact\"> Please <span class=\"external text\">help improve it</span> by removing unnecessary details and making it more concise.</span>  <span class=\"date-container\"><i>(<span class=\"date\">June 2019</span>)</i></span><span class=\"hide-when-compact\"><i> (<small><span>Learn how and when to remove this template message</span></small>)</i></span></div></td></tr></tbody></table><h4>Season 1 (2004)</h4><p>The first season takes place in 1876, six months after the founding of the camp, soon after Custer's Last Stand. Seth Bullock leaves his job as a marshal in Montana to establish a hardware business in the gold-mining camp of Deadwood, along with his friend and business partner, Sol Star. Wild Bill Hickok, the infamous gunslinger of the west, is on a separate journey to Deadwood, accompanied by Charlie Utter and Calamity Jane. Al Swearengen is the owner of The Gem, a local saloon and brothel. Other notable residents include Dr. Amos Cochran; A. W. Merrick, owner and editor of the local newspaper \"The Pioneer\"; and E. B. Farnum, proprietor of The Grand Central Hotel.</p><p>Bullock encounters a man of an unknown name, who claims that Indians had killed an immigrant family along the road, and he and Hickok along with others ride out to investigate. Swearengen at his saloon offers bounties for Indian scalps, in apparent revenge for the murders, and discounts on booze and women. Bullock and Hickok investigate and find the wagon turned over and all but one of the immigrant family killed. Before sunrise they confront the unknown man and point to holes in his story, saying the raid appeared to be a setup by whites. When he draws his weapon both men draw in defense, and Hickok's bullet kills him. Swearengen wakes to hear of these new events as told by E.B. Farnum, and is particularly unhappy hearing that one of the immigrant party survived, suspecting that his road agents may have been responsible for the raid.</p><p>Brom Garret, a wealthy businessman from New York City, lives at The Grand Central Hotel with his wife, Alma, who nurses a secret laudanum habit. Aware that Garret is interested in prospecting, Swearengen and Farnum deceive him into purchasing a gold claim in a confidence game. Newly arrived Cy Tolliver and his entourage purchase an abandoned hotel across from The Gem and begin renovations, then open the Bella Union Saloon, a luxurious gambling house and brothel. Brom Garret soon learns that his gold claim is worthless and demands Swearengen reimburse his money. Swearengen orders Dan Dority to kill Garret and \"make it look like an accident.\" Dority throws Garret off a cliff, only to discover that the claim is actually a rich one after all. Newly widowed Alma Garret asks Wild Bill Hickok for guidance regarding the gold claim and Swearengen's renewed interest. Hickok asks Bullock to advise Garret; Bullock agrees. Bullock suggests that Garret hire Whitney Ellsworth, a trustworthy and experienced prospector. Alma Garret takes custody of young Sofia Metz, whose family was murdered on the way back to Minnesota.</p><p>During a poker game, Wild Bill Hickok is murdered by Jack McCall in Tom Nuttall's #10 Saloon. When McCall is put on trial, Swearengen leans on the acting magistrate, suggesting that McCall must be acquitted to avoid scrutiny from Washington, D.C. The judge cuts the trial short and the jury acquits McCall, who leaves town immediately after the verdict. Bullock pursues McCall, determined to bring him to justice. Bullock and Charlie Utter later find McCall hiding at a boarding house and take him to Yankton for trial.</p><p>Smallpox spreads in Deadwood, creating an urgent need for vaccines. The afflicted are segregated from the main camp in plague tents. Calamity Jane aids Doctor Cochran in caring for the sick.</p><p>The senior members of the community form a municipal government to prepare for future annexation, as well as to bribe the territorial legislature, thereby ensuring the security of existing titles, claims and properties. Swearengen bribes local magistrate Clagett to quash a murder warrant.</p><p>Alma's father Otis Russell arrives with plans to secure Alma's new-found wealth in order to pay off his endless debts and fulfill his own greed. The U.S. army arrives in Deadwood and a parade is organized. Bullock confronts a self-confident Otis Russell in The Bella Union. When Russell threatens the safety of his own daughter should Bullock stand in the way of his acquiring the gold claim, Seth unceremoniously beats him and orders Russell to leave the camp.</p><p>The increasingly addled Reverend Smith, dying from an apparent brain tumor, is smothered to death by Al Swearengen in a mercy killing. Tolliver attempts to bribe General Crook to leave a garrison in Deadwood but is indignantly refused. When Magistrate Clagett attempts to extort Swearengen further over the murder warrant, Swearengen responds by enlisting Clagett's \"toll collector,\" Silas Adams, to murder Clagett. Silas performs the deed and allies himself with Swearengen, becoming his agent. As Sheriff Con Stapleton has been compromised by Cy Tolliver, Bullock volunteers to become the new sheriff as the cavalry rides out of town.</p><h4>Season 2 (2005)</h4><p>Season two begins in 1877, seven months after the events of season 1, and the camp has become somewhat more orderly and civilized.</p><p>When Swearengen publicly disparages Bullock's abilities as sheriff, intimating that Bullock's focus is not on his job due to his affair with Alma Garret, Bullock removes his gun and badge and Swearengen and Bullock fight, accidentally falling over the Gem balcony. Al is about to slit Bullock's throat in the muddy street, but stops after looking up to see Bullock's wife Martha and her son William arriving in camp. Bullock tells Alma they must either leave camp or stop seeing one another. Garret agrees that it is better to end the relationship and remain in town. Calamity Jane resurfaces and manages to support Bullock and Utter in persuading Swearengen to return Bullock's gun and badge. A truce is made. Garret discovers she is pregnant by Bullock and confides in Trixie, who persuades Ellsworth to make a marriage proposal to Garret and influences Garret to accept the proposal in order to save her the humiliation of unwed motherhood.</p><p>Swearengen collapses in his office with the door locked. His concerned associates assume that he wants to be left alone, but as the day passes their alarm grows and they finally break into the office. Dr. Cochran diagnoses Al with kidney stones and performs a draining procedure. Swearengen eventually passes the stones but has a small stroke in the process.</p><p>Joanie Stubbs opens her own brothel, The Chez Amis, with her newly arrived partner Maddie. Francis Wolcott, a geologist working for George Hearst, arrives in Deadwood and soon makes his presence felt at the Chez Amis. Wolcott has paid for the transportation of most of the prostitutes, in order to cater to his selective tastes. Cy Tolliver learns of Wolcott's sexual proclivities and baits him, resulting in Wolcott murdering Carrie and Doris, two of Joanie Stubb's prostitutes. When Maddie attempts to extort money from Wolcott, he kills her too. Cy Tolliver has the bodies removed and pardons Wolcott. Joanie sends the remaining girls away so that they will be safe from Wolcott. Joanie confides in Charlie Utter regarding the murders, extracting a promise that he never repeats the information.</p><p>Alma fires Miss Isringhausen, Sofia's tutor. Isringhausen turns to Silas Adams under the pretext of fear for her life at the hands of the Widow Garret, and they embark upon a relationship. Isringhausen convinces Adams to allow her to meet with Swearengen. At the meeting, she admits to being an agent of the Pinkertons under the employ of Brom Garret's family, who instructed Isringhausen to frame Alma for soliciting Swearengen to murder her husband. Swearengen agrees to play along, but later reveals to Garret that he intends to blackmail Isringhausen due to his hatred for the Pinkerton agency.</p><p>Samuel Fields, \"The Nigger General,\" returns to camp. He tries to enlist Hostetler in his schemes. Bullock is forced to rescue him from an angry mob headed by Steve, a virulently racist drunk. Later, Hostetler catches a drunken Steve in the livery stable masturbating on Bullock's horse in revenge. Fields and Hostetler manage to coerce Steve into signing a written confession of bestiality. The admission will be publicized should Steve make any trouble for either of the livery workers in the future.</p><p>Hugo Jarry, a Yankton commissioner, tries to persuade Swearengen and Tolliver that Deadwood should become part of Dakota territory rather than Montana. He ends up siding with Swearengen.</p><p>Alma Garret enlists the help of Sol Star to establish a bank in the camp.</p><p>Wolcott's agent Lee burns the bodies of captive Chinese prostitutes who have died from malnourishment while under his control. Mr. Wu is enraged and requests Swearengen's help to stop Lee. Because Lee is employed by Wolcott, who is in turn employed by George Hearst, Swearengen refuses any help until after negotiations over the town's future have been resolved. Mr. Wu escapes Swearengen's house arrest at The Gem, but Johnny Burns stops him from exacting his revenge on Lee or being killed himself.</p><p>William Bullock is trampled by a horse that escapes during a failed gelding and dies several hours after. His funeral is attended by many of Deadwood's citizens and the service is conducted by former card sharp Andy Cramed, who has returned to Deadwood an ordained minister.</p><p>George Hearst arrives in Deadwood and when he learns of the murders committed by Wolcott, confronts and fires him. Hearst purchases the Grand Central hotel from E. B. Farnum. The shamed Wolcott hangs himself. Tolliver claims to be in possession of a letter of confession in which Wolcott states that Hearst was aware of his murderous ways, yet continued his employment. Tolliver blackmails Hearst for 5% of every gold claim he has acquired in Deadwood.</p><p>Al Swearengen negotiates with George Hearst on behalf of Mr. Wu, and they agree that Wu can regain his status if his people prove to be better workers than those of the \"San Francisco cocksucker\" Lee. Mr. Wu and Swearengen's henchmen plan vengeance in Deadwood's Chinatown. The operation is successful and Wu slits the throat of his rival.</p><p>Alma Garret and Ellsworth marry at a ceremony conducted by Andy Cramed at the Grand Central hotel. After much dealing and double-dealing on the part of Swearengen and Silas Adams, the official papers confirming Deadwood's annexation into Yankton territory are signed by Bullock and Swearengen with Hugo Jarry present. Andy Cramed stabs Tolliver outside the Bella Union.</p><h4>Season 3 (2006)</h4><p>Season three begins six weeks after the events of season 2. Government and law, as well as the interests of powerful commercial entities, begin to enter the town as Deadwood prepares itself for entry into Dakota Territory.</p><p>Hearst has several of his own Cornish miners murdered when they attempt to unionize. Elections are announced: Star and Farnum run for Mayor, while Bullock and barman Harry Manning compete for Sheriff. Angered that Hearst had someone killed in the Gem, Al cancels the election debates in an attempt to reassert his position in the camp. To teach Al a lesson and force him to help Hearst buy Alma's claim, Hearst has his lead henchman Captain Turner restrain Al, then chops off one of his fingers.</p><p>Over Ellsworth's strong objections, Alma meets with Hearst to discuss buying her claim. Hearst becomes furious when she offers him a merely non-controlling interest and behaves menacingly towards Alma, but then allows her to leave without following through on his implied threat of rape.</p><p>Tolliver slowly recovers after being stabbed and gets back on his feet. Hearst knows Cy is lying about having a letter from Wolcott but decides to employ Cy to help deal with the members of the camp. Traveling actor Jack Langrishe arrives in Deadwood with his theatre troupe. He is an old friend of Swearengen's and eventually buys the former Chez Amis (now a school house) from Joannie Stubbs on condition that he build a new school for the camp's children. Alma undergoes a D & C by Doc Cochran when her pregnancy threatens her health.</p><p>Hostetler and Samuel Fields return to the camp to find that Steve has taken over the livery. Bullock mediates between them, eventually getting Hostetler to agree to sell the Livery to Steve. Steve's ranting, racial slurs and impugning of Hostetler's honor finally drive the latter over the edge and he shoots himself.</p><p>Another miner is killed. Already angry from the Hostetler/Steve ordeal, Bullock arrests Hearst, drags him by the ear through the public thoroughfare and puts him in jail overnight.</p><p>Alma is once again using dope. Leon confesses to Cy that he is Alma's supplier. Cy relays this news to Hearst but Hearst is still angry from his encounter with Bullock and believes that if Tolliver had told him this useful news beforehand he might not have provoked the sheriff. A furious Tolliver tells Leon to do nothing, but Leon, afraid of being implicated in Alma's murder, has already cut her off. Suspecting that Alma's return to drugs is due to her unhappiness at being married to a man she doesn't love, Ellsworth moves out of their house. They later agree to separate and Alma is able to stop taking the laudanum.</p><p>Hearst brings a large force of Pinkertons to the camp and encourages them to stir up trouble. Swearengen holds a meeting to decide what to do about Hearst. The town leaders are unable to decide on any direct action, other than to publish a letter from Bullock to the wife of one of the murdered miners that subtly highlights Hearst's callousness. Hearst has Merrick beaten for publishing it.</p><p>Alma is shot at in the street. Swearengen takes her into the Gem and orders Dan to kidnap and restrain Ellsworth. Al guesses, correctly, that Hearst ordered the shooting, in an attempt to provoke then kill Ellsworth when he comes to Alma's aid. Hearst sends his second, the same man that beat Merrick and possibly also shot at Alma, to negotiate with Swearengen; Al kills him after extracting information. The town unites to protect Alma as she returns to work at the bank. Hearst has Ellsworth assassinated in his tent at Alma's mine. Trixie shoots Hearst in revenge for Ellsworth's death but fails to kill him. Fearing for her and Sofia's lives and unwilling to make the camp responsible for her protection, Alma sells her claim to Hearst to avoid further bloodshed.</p><p>Bullock receives discouraging news about the county election returns in his race for sheriff against Harry Manning, all the while knowing Hearst may have manipulated the results using Federal soldiers brought in to vote for his handpicked candidate elsewhere in the county.</p><p>Hearst demands that the whore who shot him be executed. Swearengen and Wu gather a militia in case a war breaks out. Al murders the prostitute Jen, despite Johnny's objections, in the hope of passing her corpse off as Trixie and placating Hearst. The ruse works and Hearst leaves Deadwood, giving over control of \"all his other-than-mining interests\" to Tolliver. Tolliver points a gun at Hearst from his balcony and wants to shoot him but instead watches as Bullock sees a smirking Hearst out of the camp. Enraged that Hearst is cutting him off, Tolliver takes his frustrations out on Leon by stabbing him in the femoral artery. Johnny and Al speak briefly of Jen's death, before Al returns to scrubbing her bloodstain.</p><h4>Deadwood: The Movie (2019)</h4><p>In 1889, past and present residents of Deadwood are reunited to celebrate South Dakota's impending entrance into the Union as the 40th state.</p><br/><h3>Film continuation</h3><p>Following the cancellation of the series, it was reported on June 7, 2006 that HBO and creator David Milch had agreed to make two two-hour television films in place of a fourth season, after Milch declined a short-order of six episodes. This was because in the show's original format, each season portrayed two weeks in the life of Deadwood, with each episode representing one day. The final two-hour format would release these time restraints and allow for a broader narrative to finish off the series. In an interview on January 13, 2007, Milch stated that he still intended to finish the two films, if possible. On July 12, 2007, HBO executives admitted that producing the telefilms would be difficult and put the chances of their ever being made at \"50–50.\"</p><p>In an interview on October 1, 2007, actor Ian McShane claimed that the show's sets were due to be dismantled, and the movies would not be made; however, he was referring to the show-related set pieces, i.e., front added to the buildings, props, etc., the set as itself, \"Melody Ranch\", being unchanged at least as of 2010. Actors Jim Beaver and W. Earl Brown commented a day later that they considered the series to be over. In the March 17, 2009, episode of The Daily Show with Jon Stewart, McShane repeated that \"Deadwood is dead.\" In a January 14, 2011, interview in Esquire, Milch said: \"I don't know that the last word has been said on the subject ... I still nourish the hope that we're going to get to do a little more work in that area.\" In a March 21, 2012, interview, Milch was asked if the movies would ever be produced and replied, \"No, I don’t think so. We got really close about a year ago. Never say never, but it doesn’t look that way.\"</p><p>On August 12, 2015, it was reported that talks between HBO and Milch had resumed regarding a Deadwood film. In January 2016, HBO gave Milch the green-light to write a script for the film. On August 1, 2016, Casey Bloys, HBO's new head of programming, stated that Milch was writing the script for a Deadwood movie. On April 19, 2017, McShane announced that Milch submitted a script for a two-hour Deadwood movie to HBO, saying: \" two-hour movie script has been delivered to HBO. If they don't deliver, blame them.\" McShane said that he hoped to discuss the film with Milch further, and said of the original cast returning that \"we'd all love to do it ... It would be nice to see all of the old gang again.\" On November 12, 2017, TVLine reported that the Deadwood movie was set to begin production in fall 2018, although HBO had not officially green-lit the project.</p><p>In an interview with the Los Angeles Times on July 20, 2018, Robin Weigert said that a Deadwood film would likely be filmed in the fall of 2018: \"It’s safe enough to say is happening this fall.\" She explained: \"There’s a set being built and tax incentives to get it done. A lot of have signed on. There’s a 90% chance it’ll finally happen.\" Five days later, on July 25, HBO confirmed that a Deadwood movie had been greenlit and that Dan Minahan, who directed four episodes in the series' original run, would direct the film, with production set to begin in October 2018. According to research requested by the producers, the film is likely to be set in 1889, approximately 10 years after the end of season 3. On August 21, 2018, W. Earl Brown gave his thoughts on the final draft of the script saying, \"in the course of those two hours, my emotions ricocheted in every fucking direction: exhilaration to melancholy; hoots of joy to screams of despair. The Maestro has topped himself. The structure is essentially the same as the first version I read a year and a half ago, but the complexities of the relationships, the emotional peaks and depths, are all sharpened to a razor fine edge. It’s gut wrenching.\"</p><p>Brown also confirmed that, \"Everyone from the main cast who still draws air, with the exception of Silas Adams (Titus Welliver)\", would return. Some members of the original series' cast, including Powers Boothe, Ricky Jay, and Ralph Richeson, died between the conclusion of the series’ first run and production of the film continuation. Boothe's small role in an early version of the script was written out, and the characters played by Jay and Richeson were not recast. Welliver was unable to appear in the film due to scheduling conflicts, as he was filming his Amazon Prime series Bosch. Garret Dillahunt and Larry Cedar, who played characters who were killed in the original series, returned as background characters; Dillahunt plays a drunk who throws something at Hearst, yelling: \"Hope you die in the street, like my dad did!\"</p><p>Production on the film began on October 5, 2018, according to Brown. On November 5, 2018, HBO announced that the film had begun production, confirming the returns of several cast members. The film premiered on HBO on May 31, 2019, and received critical acclaim.</p><br/><h3>Critical reception</h3><p>Deadwood received almost universal praise from critics over the course of its three-year run. On Metacritic, the first season has an 80 out of 100 score sampled from 26 critics, indicating \"generally favorable reviews\". The second season scored 93 out of 100 based on 15 critics, and third season scored 85 out of 100 based on 20 critics, both indicating \"universal acclaim\", with only one mixed review of the third season coming from Newsday's Verne Gay.</p><p>On Rotten Tomatoes, the first season has an approval rating of 85% based on 39 reviews, with an average score of 8.19/10. The site's critical consensus reads, \"Deadwood's absorbing first season presents a vivid, un-sanitized depiction of a frontier town that stakes its claim alongside other classic entries in the Western genre.\" The second season has an approval rating of 96% based on 25 reviews, with an average score of 9.5/10. The critical consensus reads, \"Amid the grit and lawlessness, season two of Deadwood offers a richly textured portrait of an Old West community buoyed by its talented ensemble cast.\" The third season has an approval rating of 95% based on 38 reviews, with an average score of 8.89/10. The critical consensus reads, \"Deadwood's final season ends with a frustrating lack of closure, but that ambiguous final note doesn't detract from an outstanding series that ranks among the best the genre has to offer.\"</p><p>The praise generally centered on the strength of the writing and Milch's unique style of dialogue. Time Out New York's Andrew Johnston listed Deadwood in his top ten TV shows for both 2005 and 2006, commenting: \"If history is written by the victors, Deadwood is all about giving the losers their due. In the first season, magnificent bastard Al Swearengen (Ian McShane) came off as a villain; this year, his inevitably doomed campaign to save the lawless town from annexation by the United States and exploitation by robber barons served as a brilliant allegory for the evolution of American capitalism.\" Film critic Matt Zoller Seitz considers Deadwood to be \"the greatest TV show ever\" and he wrote a 2022 book detailing the making of the series titled The Deadwood Bible: A Lie Agreed Upon.</p><br/><h3>Awards</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Awards and accolades for <i>Deadwood</i></caption><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th></tr><tr><td rowspan=\"15\">2004</td><td rowspan=\"11\"><span>Primetime Emmy Awards</span></td><td><span>Outstanding Writing for a Drama Series</span></td><td><span>David Milch</span> (for \"Deadwood\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Supporting Actress in a Drama Series</span></td><td><span>Robin Weigert</span> (for \"Deep Water\" and \"No Other Sons or Daughters\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Supporting Actor in a Drama Series</span></td><td><span>Brad Dourif</span> (for \"Deep Water\" and \"No Other Sons or Daughters\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Directing for a Drama Series</span></td><td><span class=\"mw-redirect\">Walter Hill</span> (for \"Deadwood\")</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Sound Editing for a Series</td><td>\"Deadwood\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Makeup for a Series (non-prosthetic)</td><td>\"Here Was a Man\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Main Title Theme Music</td><td><span>David Schwartz</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Hairstyling for a Series</td><td>\"Plague\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Costumes for a Series</td><td>\"Mister Wu\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Casting for a Drama Series</td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Art Direction for a Single-Camera Series</td><td>\"Deep Water\"/\"The Trial of Jack McCall\"/\"Bullock Returns to the Camp\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Peabody Awards</span></td><td>Area of Excellence</td><td><i>Deadwood</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"6\"><span>TCA Awards</span></td><td><span>Individual Achievement in Drama</span></td><td><span>Ian McShane</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding New Program</span></td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Achievement in Drama</span></td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"17\">2005</td><td><span>Individual Achievement in Drama</span></td><td>Ian McShane</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Program of the Year</span></td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Achievement in Drama</span></td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Golden Globe Award</span></td><td><span>Best Actor in a Television Drama Series</span></td><td>Ian McShane</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Drama Series</span></td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"1\"><span class=\"mw-redirect\">DGA Award</span></td><td><span>Outstanding Directing – Drama Series</span></td><td>Walter Hill (for \"Deadwood\")</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"11\"><span>Primetime Emmy Awards</span></td><td><span>Outstanding Drama Series</span></td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Lead Actor in a Drama Series</span></td><td><span>Ian McShane</span> (for \"The Whores Can Come\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Directing for a Drama Series</span></td><td><span>Gregg Fienberg</span> (for \"Complications\")</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Single-Camera Picture Editing for a Drama Series</td><td>\"A Lie Agreed Upon\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Single-Camera Sound Mixing for a Series</td><td>\"A Lie Agreed Upon\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Makeup for a Series (non-prosthetic)</td><td>\"A Lie Agreed Upon\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Hairstyling for a Series</td><td>\"Boy-the-Earth-Talks-to\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Costumes for a Series</td><td>\"Boy-the-Earth-Talks-to\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Cinematography for a Single-Camera Series</td><td>\"Complications\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Casting for a Drama Series</td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Art Direction for a Single-Camera Series</td><td>\"Requiem for a Gleet\"/\"Complications\"/\"Childish Things\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\">2006</td><td><span>AFI Awards</span></td><td>AFI TV Award</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Screen Actors Guild Awards</span></td><td><span>Outstanding Performance by a Male Actor in a Drama Series</span></td><td>Ian McShane</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Writers Guild of America Award</span></td><td><span>Best Dramatic Series</span></td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"9\">2007</td><td></td><td>AFI TV Award</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"6\"><span>Primetime Emmy Awards</span></td><td>Outstanding Sound Mixing for a Comedy or Drama Series</td><td>\"A Two-Headed Beast\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Makeup for a Series (non-prosthetic)</td><td>\"I Am Not the Fine Man You Take Me For\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Hairstyling for a Series</td><td>\"A Constant Throb\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Costume for a Series</td><td>\"Amateur Night\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Cinematography for a Single-Camera Series</td><td>\"The Catbird Seat\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Art Direction for a Single-Camera Series</td><td>\"Tell Your God to Ready for Blood\"/\"True Colors\"/\"Amateur Night\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Writers Guild of America Award</span></td><td><span>Best Dramatic Series</span></td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Screen Actors Guild Awards</span></td><td><span>Outstanding Performance by an Ensemble in a Drama Series</span></td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>2019</td><td><span>TCA Awards</span></td><td><span>Heritage Award</span></td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><br/><h3>Music</h3><h4>Opening credits</h4><p>The Deadwood title music is a piece by David Schwartz.</p><p>According to his website, David Schwartz lists the following instruments as having been used:</p><p>Fiddle, Cavaquinho, Weissenborn, Guitar, Harmonium, Duduk, and Kitchen Pots</p><h4>Closing credits</h4><p>The closing credits music is listed below:</p><h4>Season 1</h4><h4>Season 2</h4><h4>Season 3</h4><h4>Deadwood: The Movie</h4><ul><li>\"Hog of the Forsaken\" – Michael Hurley</li></ul><br/>"
  },
  "errorMessage": ""
}