{
  "imDbId": "tt1606375",
  "title": "Downton Abbey",
  "fullTitle": "Downton Abbey (TV Series 2010–2015)",
  "type": "TVSeries",
  "year": "2010",
  "items": [
    {
      "username": "brett-76260",
      "userUrl": "https://www.imdb.com/user/ur71629917",
      "reviewLink": "https://www.imdb.com/review/rw5100914",
      "warningSpoilers": false,
      "date": "5 September 2019",
      "rate": "10",
      "helpful": "324 out of 334 found this helpful.",
      "title": "Just a fantastic show..",
      "content": "First off i am definitely not the demographics this show was trying to capture. I am a United States Marine and I really don't think the writers had a guy like me in mind. All I can say is I'm so glad I took the time to watch this show. I absolutely loved it and have now watched the series twice. Its not action packed or anything like that. It is all about the writing and the characters. Just brilliant from start to finish and is a show the entire family can watch together. Maggie Smith if you ever read these comments just know you played my favorite character out of any series I've ever watched. You made this show absolutely perfect! If you are debating on whether or not to give this show a try take it from me, you wont want the show to ever end..."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2335698",
      "warningSpoilers": false,
      "date": "7 November 2010",
      "rate": "10",
      "helpful": "212 out of 255 found this helpful.",
      "title": "Beautifully produced, and for me one of the better programmes airing this year",
      "content": "I have to say I loved Downton Abbey, and thought it was one of the better programmes airing this year along with Luther, Sherlock and the stunning Channel 4 drama Mo. Downton Abbey was beautifully produced, well cast and interesting, when it was first advertised it looked as though ITV had a hit and from the first episode I think Downton Abbey lived up to that expectation.I for one loved how elegant Downton Abbey was. The photography was beautiful and skillful, while the scenery was breathtaking and the costumes were exquisite. The scoring was also very good, often very hypnotic and beautiful. The direction was controlled, the episodes were well paced and for me the characters were believable my favourites being Violet and Robert.The writing in general was another strength. It was witty in a subtle way, is often funny and could be heart warming and poignant too, the best coming from Violet and Mrs Hughes I felt. The only bit of dialogue that rang false, and this is such a minor criticism, is Robert's \"Downton is my third parent and my fourth child\" which came across as somewhat cheesy. And the stories were well written and as believable as the characters, not to mention pretty original.And of course the acting was excellent. Maggie Smith was perfect as Violet. She plays this sort of character well, and she had such good timing and dialogue. Plus I love her in costume. Hugh Bonneville was dashing, and I cannot get over how beautiful Michelle Dockery was here. Jessica Brown-Findlay was also fine as another of my favourite characters Lady Sybil, and Phyllis Logan was always good value though I would love to see more of her if and when the series returns.In conclusion, Downton Abbey was a wonderful series thanks to the great cast and production values especially and I cannot wait to see more. 10/10 Bethany Cox"
    },
    {
      "username": "Doylenf",
      "userUrl": "https://www.imdb.com/user/ur1048771",
      "reviewLink": "https://www.imdb.com/review/rw2530850",
      "warningSpoilers": false,
      "date": "11 December 2011",
      "rate": "9",
      "helpful": "85 out of 104 found this helpful.",
      "title": "Brilliant, stylish, clever entertainment with witty script...",
      "content": "DOWNTON ABBEY is the kind of \"Masterpiece Theatre\" material that the British do with such finesse that one can only sit back and marvel at the sets, costumes, music, and above all, the performances that are all on an extraordinarily high level.The moment the first series ended, I wanted to see more--so no doubt I'll be ordering my copy of Season 2. Central among the gifted performers are Maggie Smith (as the Dowager Countess Violet), Hugh Bonneville as the Earl of Grantham, and Elizabeth McGovern as Cora, his American wife. But all of the lesser roles are played to perfection with special mention for Brendan Coyle as John Bates, Joanne Froggatt as Ana, Michelle Dockery and Laura Carmichael.Complicit in schemes involving wicked behavior are two of the downstairs help played brilliantly by Siobhan Finneran and Rob-James Collier as Thomas, both of whom cast a shadow over the household.The plot has dialog that is always witty and good for a quick chuckle or a gasp of disapproval and the character motivations are all played out in a convincing manner true to each person involved.Very compelling to view the fluid story unfold with its many sub-plots and shadings of the class warfare that existed in the U.K. then and now.Absolutely one of the most rewarding and richly satisfying shows from Great Britain that have come along in recent years. The color photography amid location settings create the proper atmosphere for the entire story which takes place just before WWI among a wealthy titled household undergoing some major changes inside the castle walls."
    },
    {
      "username": "ApolloBoy109",
      "userUrl": "https://www.imdb.com/user/ur0379909",
      "reviewLink": "https://www.imdb.com/review/rw2391072",
      "warningSpoilers": false,
      "date": "26 February 2011",
      "rate": "9",
      "helpful": "91 out of 118 found this helpful.",
      "title": "Beautiful tale just before the world went to hell",
      "content": "At 19 minutes in I was hooked.I remember when Lady Marjorie Bellamy of Upstairs, Downstairs died on the Titanic and the impact it had on my family. We felt this because of the investment we had made in the series.This is a series where one can become just as addicted.The lives and loves of the Grantham and the Crawly family are well-written and performed beautifully. The castle and the grounds a pleasure to look at, as are the costumes of the time.As Elizabeth McGovern and I are equal in age, and I have grown up watching her on the silver screen, hers was a warming and dignified touchstone for me personally.The cast couldn't be better suited for their roles, not one can be called a weak link.Maggie Smith has a presences all her own, making each of her projects shine.I am on episode four and can't wait for the remainder.Once again our cousins across the pond show us \"how good drama\" can be."
    },
    {
      "username": "jlpicard1701E",
      "userUrl": "https://www.imdb.com/user/ur1789737",
      "reviewLink": "https://www.imdb.com/review/rw2524323",
      "warningSpoilers": false,
      "date": "26 November 2011",
      "rate": "10",
      "helpful": "98 out of 119 found this helpful.",
      "title": "Outstanding series, leaves you to want for more...",
      "content": "I remember the '70s and another Series which was cut more or less in the same parameters as this one, and that was \"Usptairs, Downstairs\".This too was a masterpiece of a social study, of the times at the turn between the 19th and early 20th Century.The only difference was that it was set in a City based household, while \"Downton Abbey\" is set in the very elegant English countryside.Both series display the best of British Theatre and Cinema, in terms of production teams, actors, technicians and general staff.It is absolutely to be considered high quality movie-making, even though meant for the home screen.Everyone, but everyone, in this series, knows his business and does portray his own character with honesty and truth.There is no dull moment, due to a skillful editing of scenes that are almost put together like in an elegant dance sequence.It is a very intelligent show that explores every facet of Society as it was structured (so far, in season 1 and 2), before, during and right after World War I, and as people behaved and felt back on the Homefront, being so detached, yet totally involved with the destinies of those men sent abroad to fight.It is no melodrama in the classic sense of the word. It is an honest depiction of what people \"downstairs and upstairs\" went through during those years. The conventions, the rigid rules, the traditions, all changing just in a ten year period and being uprooted and twisted by the new winds of war.There is something for everybody here. You want a thrilling story? Check! You've got it. You want love and romance? Check! You've got it. You want a social drama? Check! You've got it. You want a war drama? Check! You've got it too.It's a very human story of all characters on board of this static ship that is \"Downton Abbey\". As firm as the Rock of Gibraltar one might say. And yet, not so static after all... Lots is happening here, and this, day by day.Just think of the nightmare to have a sudden dinner invitation. The kitchen is in uproar, serving hands are missing, the masters are nervous, and everything seems to be doomed from the beginning, but then, somehow, everything comes together beautifully, like by magic... Magic? Let's say blood and a lot of sweat...I started this saying that it was addictive, and indeed it is. AFter an episode is over you immediately want to jump back in and watch the next to see how it goes on.I only have Seasons 1 and 2 on DVD and I am already asking for the 3rd Season to appear, just to know what happens next.I simply can't wait... I hope it pops up soon."
    },
    {
      "username": "botimarci",
      "userUrl": "https://www.imdb.com/user/ur24539104",
      "reviewLink": "https://www.imdb.com/review/rw7366353",
      "warningSpoilers": false,
      "date": "21 September 2021",
      "rate": "10",
      "helpful": "17 out of 17 found this helpful.",
      "title": "Maggie Smith is a wonderful actress",
      "content": "I can't hold this back. I enjoyed every moment Maggie Smith was on scene. I was a bit sceptical in the beginning, but her performance is simply stellar. I laughed out loud alone at home watching her unique moments in the show. This is simply not comparable to anything I saw before in any other shows or movies. She is a treasure."
    },
    {
      "username": "filipemanuelneto",
      "userUrl": "https://www.imdb.com/user/ur53053227",
      "reviewLink": "https://www.imdb.com/review/rw5096212",
      "warningSpoilers": false,
      "date": "2 September 2019",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "It will be dificult to do better than this.",
      "content": "What can i say? Since I saw the first season I've been an unconditional fan of Downton Abbey. I think it's one of the most historically accurate and refined series of recent years.Over the course of six seasons, we have been following the life and adventures of the Crawley family, which has lived in Downton Abbey for generations. We also follow the lives of house servants, with all their quarrels, ambitions to rise in life, and leave behind service in the big house. And it is rare to find a series with as much respect and appreciation for historical rigor as it has shown over the six seasons. An enormous effort has been made to make real the historical period in which everything happens, which does not exceed fifteen years (1912-1926). A short time span between the six to seven years the show aired, which allowed the cast's natural aging to dispense with make-up gimmicks to forge the characters' aging.The script, created and written by Julian Fellowes, is interesting and covers well hot topics from that historical period: the sinking of the Titanic, the First World War, the political turn of Russia, the rise of Nazism, the emancipation of women, the loss of influence of aristocratic families etc. We can really see how all this has changed society, political life, mentality. We felt transported to that time to see how this noble family had a way of life threatened with extinction by the rapid advancement of time. Serious themes, in fact, but lightly approached and with room for moments of perfectly British humor, in charge of strong characters like Violet, who is against everything modern, and Mrs. Pattmore, always with a sharp tongue. There are no villains here ... despite some classic antagonists appearing in certain seasons (such as Bates's ex-wife) the one who comes closest to a villain is first footman Thomas Barrow, although last season be a true redemption for the character. In addition to it, we have some situations where generally good or neutral characters antagonize each other. This is the case of the Crawley sisters, where rivalry and mutual grudge prevail, while blood ties unite them, or Violet and Isobel, who cherish mutual love and hatred.The cast is excellent and congratulations. Maggie Smith, a veteran, never disappoints us by impersonating the perfect Victorian lady. Hugh Bonneville was perfect in the role of Robert. Laura Carmichael and Michelle Dockery are amazing in the roles of the Crawley sisters. Jim Carter is the perfect butler and makes a great pair with Phyllis Logan. A word of appreciation, too, for Elizabeth McGovern, Jessica Findlay, Brendan Coyle, Joanne Froggatt, Robert James-Collier, Sophie McShera, Lesley Nicol, Penelope Wilton, Kevin Doyle, Siobhan Finneran, Dan Stevens, Lily James, Jeremy Swift, Sue Johnston and Zoe Boyle.With sleek production and smooth photography, magnificent scenery (Highclere Castle's choice was very wise and made the house an additional character to the plot, which proves that I am right when advocating location shooting rather than abusive use of the green screen Downton Abbey is a true time machine. Grand, magnificent, it is certainly one of the best period television series of this decade."
    },
    {
      "username": "skillswordfish",
      "userUrl": "https://www.imdb.com/user/ur7758555",
      "reviewLink": "https://www.imdb.com/review/rw2524243",
      "warningSpoilers": false,
      "date": "26 November 2011",
      "rate": "10",
      "helpful": "157 out of 180 found this helpful.",
      "title": "Rare treasure!",
      "content": "I'll agree that the British know how to do period drama better than anyone (certainly better than us Americans) and this is no exception. You'll be captivated immediately and hours will go by before you realize you've spent an entire afternoon in front of your television set. The relationships built between all characters of this show are what tie it up in a nice, fluffy (although not always pretty) bow. Brilliantly written and set in lush, vibrant surroundings with detailed costuming, this drama series should set the bar for others. No busy dialog or wasted scenes, just good, solid craftsmanship in every episode of this poignant family story. You'll do well to invest in seasons 1 and 2. Looking forward to the arrival of season 3!"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3066229",
      "warningSpoilers": false,
      "date": "11 August 2014",
      "rate": "9",
      "helpful": "15 out of 20 found this helpful.",
      "title": "Addictive soap opera",
      "content": "The show starts in April 1912 with the news of the sinking of the Titanic. Robert Crawley, Earl of Grantham (Hugh Bonneville) has no son and the heir is on board. The new heir is distant cousin Matthew Crawley (Dan Stevens) who is a small Manchester lawyer. The easiest solution is to push oldest daughter Mary (Michelle Dockery) onto the new heir. Sibling rivalry can be cruel on plain middle daughter Edith (Laura Carmichael). The youngest Sybil (Jessica Brown Findlay) is sweet and independent. The staff working downstairs is led by Mr. Carson (Jim Carter). Mr. Bates (Brendan Coyle) suffers a leg injury from the Second Boer War and is hired by Robert Crawley. Thomas (Rob James-Collier) and Miss O'Brien (Siobhan Finneran) the villains of the downstairs world. The upstairs and downstairs worlds of Downton Abbey is changed over the years.This is an addictive soap opera wrapped in a costume drama. That's the genius of this show. The episodes move along quickly in intervals of months. It's about big dramas and delicious personalities. All of it anchored by great relationships whether it's Mary and Matthew or Bates and Anna. At this point, I hope the show ends properly and doesn't lose its way. It does tend to hit on the big historical points a lot. The big loss at the end of season 3 does concern me a little but that's the way of modern TV."
    },
    {
      "username": "tieman64",
      "userUrl": "https://www.imdb.com/user/ur4130201",
      "reviewLink": "https://www.imdb.com/review/rw2729409",
      "warningSpoilers": true,
      "date": "1 January 2013",
      "rate": "",
      "helpful": "134 out of 222 found this helpful.",
      "title": "Season 1: A Tory Wet Dream",
      "content": "\"At the risk of sounding sentimental, I believe the monarchy stands for a fairness that we like to think represents us. I hope 'Downton Abbey' has a similar decency about it.\" - Julian Fellowes \"Downton Abbey's\" written by Julian Fellowes, a Tory peer, Baron, monarchist and husband-to-royalty, so right away you know it has a clear agenda. Restorative nostalgia to the max, and released to coincide with a fresh round of British austerity measures, the television series sees a family of early 20th century aristocrats living in a palatial estate and tended to by a sprightly band of servants. Sounds interesting? Forget Renoir's \"The Rules of the Game\", Altman's \"Gosford Park\", and the past 500 years of human history and social theory. No. In \"Downton Abbey\", the class system exists for the benefits of those at the bottom, and proves as bothersome to those unfortunate few at the top as it does those lower down the social hierarchy.Fellowes serves up the platonic ideal of an English aristocrat. Good, selfless and caring, our Lords and Ladys bend over backwards to serve their servants, graciously offering them jobs, assistance, compassion, awards and so forth. They are benign despots, all-powerful, their authority final, but more sage and caring than any elected politician could ever be. The rich, in other words, are socially responsible father figures. They are invested in their households, in their communities, and provide a far reaching social benefit; without the rich to mercifully protect them, the poor would be forced out into the cold to fend for themselves. Indeed, Fellowes frequently has his rich folk sacrifice their bodies, their status and their wealth for the servant class (joining war efforts, taking on limping servants etc). The message - rife with false binaries - isn't only that servants should be content with their roles, but that one, regardless of class, cannot and should not avoid servitude. Even the rich are servants to their fellowman.Significantly, the series' villains are all either homosexuals, socialists or members of the servant class. In the second series, villains become figures of new wealth; modern capitalists who don't respect the supposedly loving, symbiotic relationships of late aristocracy. As the series focuses on an individual household rather than systems, the nobility and selflessness of Fellowes' aristocrats justify the system in which they spin. It's a very classically conservative notion of history (in actuality, servants couldn't look at, let alone speak to their masters), a proudly hierarchical world in which all social conflicts and tensions are resolved without any restructuring of class relations. Stratification is posited as being natural, optimal and only the deviant or repellent are incapable of adapting or finding accommodation within it. No talk, of course, of where our Earls and Lords acquired their wealth, land enclosures, the lives of the impoverished outside the mansions or how the system's social relations hinge on an in-build bondage ingrained within \"economics\" (ie money) itself. Elsewhere the series brings up occasional Big Issues (war, feminism, Ireland etc), but only to engage in the smug, back-patting afforded by hindsight. This is a benign, liberal aristocracy, for an age of \"caring\" capitalists.All \"Abbey's\" arguments in favour for the class system were once put forth by George Fitzhugh, an American social theorist who published racial and slavery based sociological theories in the antebellum era. Fitzhugh essentially argued that Negro slaves needed \"strong white daddies to look after them\". That slavery \"protects the Negro\", \"ensured that blacks would be economically secure and morally civilised\" and that the evils of modern capitalism, which was gradually replacing slavery, would expose poor blacks to persecution and suffering. The new rich, Fitzhugh argued, were promoting a form of competition which would harm blacks. Afterall, the slave belongs to its owner, and owners take care of their capital, take care of what they own, provide them with food and shelter, unlike those pesky capitalists who merely rent labour. Fitzhugh even went so far as to defend slavery because \"capitalists are anti Negro racists, whilst slavery is not racist\".Fellowes is doing the same. Or rather, the arguments are always the same, no matter the social reconfiguration taking place. Hence, slavery is good because slave owners take care of their slaves, aristocracy is good because the aristocracy takes care of their servants, and capitalism is good because employees take care of their labourers. What each argument does, regardless of historical time period, is posit the lower classes as dependent on power without questioning how and why this power is structured, created and propagated in the first place.In the early 1980s, Immanuel Wallerstein, a renowned social scientist, outlined 12 characteristics which he believed were \"unique\" to modern world systems. His aim was to show that modern capitalism, in the affluent 80s, was a kind of \"step up\" from both the aristocracy of \"Downton's\" era and the feudalism of the distant past. By 1989, though, Wallerstein had completely reversed his position. All the presumably unique characteristics of the \"modern world system\" were also true of the medieval and ancient world systems. He could find no substantial distinctions that would satisfy his categorisations. The point isn't only that there were no clean transition from feudalism to aristocracy to capitalism as such, but that power proves capable of propagating itself.But why would a series which glorifies the class system, posits class hierarchies as inherently benevolent and idealises master/servant bonds, be suddenly so very popular? Why would a series about inherited privilege, ineluctable servitude, be popular in an era of Occupy, Austerity, Bank Bailouts and massive corporate tax dodging? Perhaps because \"Downton\" presents a Utopian version of the past for the purposes of painting, and thereby bolstering, a contemporary system capable of weathering any upheaval or shock. Or perhaps it's simply a severe form of Stockholm Syndrome.4/10 - See \"Remains of the Day\", \"Eyes Wide Shut\" and \"Never Let Me Go\". Worth no viewings."
    },
    {
      "username": "fudge_factory",
      "userUrl": "https://www.imdb.com/user/ur18969147",
      "reviewLink": "https://www.imdb.com/review/rw2365007",
      "warningSpoilers": false,
      "date": "6 January 2011",
      "rate": "10",
      "helpful": "142 out of 185 found this helpful.",
      "title": "lovely!",
      "content": "OK so I'll admit, Downton isn't a academic study of social change, nor is it entirely original ( let's be honest) - but it doesn't pretend to be! Does that make it any less of a excellent drama? No! Does That decrease the clever, witty and delicious writing? No! Does it cloud the ( at many moments) wonderful acting? No! Admittedly it isn't hard core drama - but it was lovely, it made me feel warm, it let me get all cross and annoyed (in a nice way), it got me exited - and soothed.Honestly what more can you ask for??Maggie Smith is excellent as the snooty Dowageress, Brendan Cole does Mr Bates very well - and Joanne Froggat (who I only manage to catch on tele occasionally sadly) who was equally lovely.It was all just lovely!"
    },
    {
      "username": "Dr_Coulardeau",
      "userUrl": "https://www.imdb.com/user/ur3836774",
      "reviewLink": "https://www.imdb.com/review/rw2962391",
      "warningSpoilers": true,
      "date": "17 February 2014",
      "rate": "10",
      "helpful": "14 out of 20 found this helpful.",
      "title": "Only British TV can reach that level of TV art",
      "content": "The first thing to be said about this series is that it is British from the very first scene to the very last by the vast range of actors and actresses as for age and the extreme quality of these actors, most of them having parallel careers in theaters, television and the cinema. They are thus able to act with a vast variety of stances and tones and at the same time with a great expressivity on their faces or with their body language. Within that great versatility and mental or dramatic agility there is not one single age that is privileged and the older generation is just as good and as present as the youngest one and the age range, apart from the few children, goes from the late teens and early twenties to the seventies. This is exceptional and no American series will ever be able to do that. A TV actor might turn up in the cinema but then he will never go back to TV, and both will hardly be able to work on a stage. The case of \"Harry Potter,\" or Daniel Radcliffe if you prefer, is typically British who can play on the stage or act in a film. That mobility is not American, and American television sure misses something there, just as much as it misses the use of older actors and actresses, as well as very young ones, leveling the cast within a twenty to thirty years age bracket.The second element that makes this series beautifully and exceptionally British is the fact it is situated before, during and after the First World War in England and everything is there to tell you, you are in England. The Mansion in which the action takes place, the official Downton Abbey, which is of course not the real name, the village next to it, the array of vehicles and cars, the steam engine and the train, even the London of that time, all is reconstructed the way it was or used to be. Only England can have that Tudor architecture. It is in no way similar to anything anywhere else in the world and if there is something looking like it in the USA, it is nothing but a copy, hence a fake, or maybe, like the old London Bridge, a rejected ruin that was bought over here and brought and rebuilt over there, in a piece of desert even. The third element is the society it depicts. There is the upstairs of the aristocrats, lords, ladies, duchesses, earls and so on that is so English in its vanity, social exclusiveness, social segregation, social racism even. And there is the downstairs of the servants, the copy cat hierarchy of the service from the butler at the top to the housekeeper at the top too, then to the valets and the footmen on one side, and to the maids and kitchen hands on the other side, and with some hierarchy within each echelon of this social descending ladder. To be in the service was a great honor and privilege and one could spend one's whole life in it and climbing the rungs of that ladder one at a time over the decades. But this series is exceptional because it goes far beyond that simple capture of social stratification.The main lady, the wife of the Earl has an American mother, and brother (not very much present in the series), and this American line is always the source of some humor more than anything else, though of course it is also the source of a lot of money and opportunities.The chauffeur of the estate is Irish, a republican socialist what's more, and he falls in love with one of the three daughters and she would have eloped if her father had not accepted to change his mind. This daughter will die in childbirth and the Irish socialist ex-chauffeur who is thus the father of a little girl who is a blood relative of the family is accepted in this circle but as the one who is going to take over the management of the estate, hence a full time job, and yet he does not feel at home really. But he finds a real position because of what he is doing: saving the English aristocracy from being bankrupt and run over by the capitalists, by becoming capitalists themselves, with the help of a new generation of non-aristocrats who break all kinds of rules just because they can since they are not aristocrats.The heir of the estate is a non aristocrat (he inherits the estate but not the title) but his fate is tragic though he provides the family with a very much desired male heir. His wife, the oldest daughter, is a very strange character though she might be able to change and evolve with the world, especially after the war because England has to change fast if they want to avoid some social upheaval.The general picture here is fascinating.In the same way what is happening downstairs is fascinating with love and hatred, with spying and plotting, of all sorts, even a rape here and there to pepper and salt the scene, a few violent crimes too, well disguised if possible. Not to speak of a possible divorce that is not brought to its fulfillment because the woman dies in the mean time. Bleak and dark, and yet some women in that set of servants are outstandingly honest and humane. This world is a world of its own and that too is interesting. All together this series is a lot more fascinating than I have said because of these numerous and varied levels of social norms and taboos that are broken or challenged by a set of extremely good actors and actresses that make the show a real gem of television production. Dr Jacques COULARDEAU"
    },
    {
      "username": "gradyharp",
      "userUrl": "https://www.imdb.com/user/ur3223254",
      "reviewLink": "https://www.imdb.com/review/rw2367225",
      "warningSpoilers": true,
      "date": "10 January 2011",
      "rate": "10",
      "helpful": "29 out of 47 found this helpful.",
      "title": "Mesmerizing Examination of Class Distinction",
      "content": "DOWNTON ABBEY is one of the things the British do best. This seven part series has it all - crisp dialogue, stunning settings/scenery/costumes, an all-encompassing view of class distinction not only between the upper class or gentry versus the middle class (who often have as much money but come into via labor versus inheritance) but also among the servant class, and a cast of many of the finest British actors before the public. Julian Fellowes is in fine form here as the writer, taking on a story about 1912 England and the microcosm of Downton Abbey, a mansion and grounds run by the elegant Robert Crawley, Earl of Grantham (Hugh Bonneville), his mother Violet, the Dowager Countess of Grantham (Dame Maggie Smith at her best), and Cora Crawley Countess of Grantham (Elizabeth McGovern0 - the moneyed American whom Robert married in order to retain the Abbey and their daughters, Ladies Mary (Michelle Dockery), Edith (Laura Carmichael) and Sybil (Jessica Brown Findlay). Much of the story revolves around the problem of inheritance (entailment) as the heirs apparent to the Abbey are victims of the Titanic disaster that opens the story. The Abbey must be passed on to a monied heir and the hunt is on. As with other Masterpiece Theater pieces this story examines the 'upstairs/downstairs' bifurcation of the Abbey and the cast of characters 'below' is as fine as the gentrified owners: Mr Carson (Jim Carter) is the head voice, followed by Mrs. Hughes (Phyllis Logan), the cook Mrs. Patmore (Lesley Nicol), the footman Thomas (Rob James-Collier) who just happens to have had an affair with the visiting Duke who could have been the new heir, and the new valet John Bates (Brendan Coyle) - a man the staff doesn't tolerate because of his use of a cane due to a war injury, etc etc etc. They are all fascinating people with their own set of prejudices not unlike those of their masters. The story progresses along the lines of finding a new heir for the Abbey, a problem that involves everyone in the household, and it is this strange playing out of English class distinction that makes the series so engrossing. Another classic form the Masterpiece Theater. Grady Harp"
    },
    {
      "username": "jasonbyers-32158",
      "userUrl": "https://www.imdb.com/user/ur94106788",
      "reviewLink": "https://www.imdb.com/review/rw4667107",
      "warningSpoilers": false,
      "date": "17 February 2019",
      "rate": "10",
      "helpful": "16 out of 17 found this helpful.",
      "title": "Outstanding Drama Series",
      "content": "I absolutely loved all six seasons. Was sad to see it end. Would love to see a 7th season or at the very least a movie."
    },
    {
      "username": "robapacl",
      "userUrl": "https://www.imdb.com/user/ur22488269",
      "reviewLink": "https://www.imdb.com/review/rw2370651",
      "warningSpoilers": false,
      "date": "16 January 2011",
      "rate": "10",
      "helpful": "149 out of 181 found this helpful.",
      "title": "Completely captivating",
      "content": "I was hooked after the first five minutes and come heaven, hell or high water, I was going to see Downton Abbey twice, the second time to pick up the points which I knew would be too fast, and possibly convoluted, to follow the first time round. I have watched Masterpiece since the inaugural with Alistair Cooke, and I can't remember anything as engaging and entertaining as this. As a cousin of an English family with deep affection for the monarchy and respect for the aristocracy, my perspective is an odd mix of Democratic ideals, old-time Republican values and curiosity about and appreciation of the social structure which prevailed so long in England. Downton Abbey appears to present a very balanced depiction of the social, political, economic and historical forces which drove the lives and fortunes of the classes and produced strange and almost incomprehensible behavior to comply with an unwritten, all-pervasive code. I am completely fascinated by the events and reactions and what would appear to be almost puppet-like behavior on occasion. I pray for a sequel."
    },
    {
      "username": "TxMike",
      "userUrl": "https://www.imdb.com/user/ur0438066",
      "reviewLink": "https://www.imdb.com/review/rw2752527",
      "warningSpoilers": true,
      "date": "12 February 2013",
      "rate": "",
      "helpful": "11 out of 16 found this helpful.",
      "title": "Begins in 1912 as the Titanic is sinking.",
      "content": "This British TV series has gotten lots of attention here in the USA for the past season or two, I've only heard vague things about it, including some buzz that it had won some awards. So today, being a slow day in Southern Texas, cool and rainy, I looked into it and lo, I beheld that Netflix has the first season, 7 episodes, available for streaming on demand. So I took the plunge. I watched the first episode, approximately 65 minutes, and immediately watched the second, approximately 45 minutes.As the first episode opens we are shown that it is 1912, in the beautiful English country. I didn't attach too much to the date, other than it was just over 100 years ago, until a telegram came in, everyone seemed very concerned, and some began to ask of survivors. Then it hit me ... the sinking of the Titanic. That event is used as the catalyst for the series of stories that make up this English family soap opera.The immediate and great impact is that the two heirs of the estate featured here were among those lost at sea in the sinking of the ship. Since the gentleman of the estate had three daughters but no son, by British law the estate at his passing would go to the nearest of kin male, which happens to be a member of the working class, a lawyer and 3rd cousin once removed, someone the family doesn't even know.Of course there is much more to learn about the story, as I am only two episodes in, but already I can see why the series has such a following. The writing and acting are first-rate and the stories interesting. Thre are lots of interaction issues between the service staff down below and the family members above. In many ways I was reminded of the excellent movie \"Gosford Park.\" Anyway I believe I am hooked, I don't believe I can ignore the rest of the episodes.In May 2013 I watched season 2 on DVD, and it was almost impossible to NOT watch the whole thing in one sitting. Really captivating, its main subject is WW1 and turning Downton Abbey into a recovery center for wounded soldiers. The series employs a historical adviser so it is reasonable to assume the stories, while fiction, are authentic.Over 3 days in July 2013 I watched the whole 3rd season on DVD, set in the 1920s. The more I watch it the more I enjoy it.The main setting for the series is Highclere Castle which is to the west of London, not far from the M4 and Newbury."
    },
    {
      "username": "onepotato2",
      "userUrl": "https://www.imdb.com/user/ur1231696",
      "reviewLink": "https://www.imdb.com/review/rw2456492",
      "warningSpoilers": true,
      "date": "10 July 2011",
      "rate": "2",
      "helpful": "96 out of 190 found this helpful.",
      "title": "Soapy dishwater",
      "content": "If you thought Gosford Park needed to be a shallow, episodic TV series, you might enjoy this. Even Maggie Smith (and her character) has been borrowed wholesale to ease your transfer. And what luck, the theme music is a thinly veiled knock-off of the title music from The Piano. But Gosford Park wrestled with matters of substance, and showcased some striking film technique.This show is teeming with \"decent\" characters (translation: progressive) none of whom could have existed historically, and none of whom can inject the show with any surprises. The show shoots the bolt in the first two episodes where Lord Grantham defends and acts as co-equals with two different servants. Hooray for time-traveling with anachronistic values. The show never rises above soap opera by larding itself down with drippy conflicts, and boatloads of shallow female matters. The elevated estrogen level torpedoes any real intrigue.The drama in this is just so much sniveling."
    },
    {
      "username": "Catharina_Sweden",
      "userUrl": "https://www.imdb.com/user/ur21696533",
      "reviewLink": "https://www.imdb.com/review/rw3386894",
      "warningSpoilers": true,
      "date": "3 January 2016",
      "rate": "7",
      "helpful": "24 out of 39 found this helpful.",
      "title": "Competent and educating but (almost) never exciting",
      "content": "I am not as over the top about this series as the rest of the world seems to be. There is no doubt that it is a very competent work with high production values and an enormous budget. But I never felt any \"love\" for any of the characters, and I never felt that desire that you can feel when a work of fiction is really, really good, to be part of it and live in that world there with them.I think both the best and the worst thing with this series was its realism. For instance, the class differences are not so exaggerated as in many works of fictions that deal with castles, lords, nobility etc.. Which is a good thing if it is a correct period piece you want - but you never feel that magic and admiration that you feel for, for instance, Mr Rochester brooding in his Thornfield Hall... There is no romance here, and no mystery.Also, some story lines took up too much time, for instance the elderly ladies' intriguing about the charitable hospital positions, and the Mr Marston-his son-his farm-Daisy intrigue. I found both of these stories very tedious. Also, I think it was a mistake to make a long-drawn out detective story about the Mr Bates-and-his-wife's death-thing. It felt out of place and as a cheap attempt to introduce something spectacular that would rise the audience' interest when it was waning.For me this series was more education than anything else. For as such it is very good, because it captures the period perfectly: the social changes, the women from the higher classes starting to work a little outside home, the young people moving to towns to find work in factories, shops, restaurants etc. instead of working as hired farmhands or servants at private estates. I have had some relatives, now long gone, who were born in the beginning of the 20th century. This was their world when they were children and young people, and I feel that this series has made me understand their way of reasoning better! I also much appreciate the great attention to detail in clothes, hair-styles, furniture, ornaments, cars, music, dancing, and other things. You really feel yourself transported to this time period!"
    },
    {
      "username": "grendelkhan",
      "userUrl": "https://www.imdb.com/user/ur1997252",
      "reviewLink": "https://www.imdb.com/review/rw2692845",
      "warningSpoilers": true,
      "date": "22 October 2012",
      "rate": "9",
      "helpful": "13 out of 20 found this helpful.",
      "title": "A wonderful series that should never be taken at face value.",
      "content": "I will admit upfront I was more than a bit dismissive about Downton Abbey upfront. It sounded like another attempt at recreating Upstairs, Downstairs. I knew of the pedigree of Julian Fellowes, having watched and enjoyed Gosford Park. The acting and writing were first rate there, but I found much of it to be overly romantic about a system designed solely to benefit the privileged. In Gosford Park, that world is the setting for a mystery,; here, it's a soap opera (ok, drama). Doesn't sound appealing to a firmly middle class American revolutionary,does it? And yet, it is.Fellowes is a cagey writer. Just when I want to take him to task for romanticizing an oppressive system of privilege, he goes and has characters do just that. Meanwhile, he makes these characters real people, both in the privileged world and the subservient. They have virtues and their shortcomings. They love and hate and scheme; yet, they have real emotions. Even the nastiest, most self-interested character has moments that help you understand what lies at the heart of their outlook and their plans.The cast are all first rate and I noticed many familiar faces; but, I must single out Maggie Smith and Penelope Whilton. They are a treat to watch as they spar. Smith has always been a force, but I have enjoyed Whilton more and more, ever since I first encountered her in Cry Freedom.The rest of the cast are equally up to the task and play all sides. Even when we learn to hate Thomas and O'Brien for their plots and schemes, they let their guard down and give you a peak at the insecurities that drive them. The two actors get a lot of meat to work with and don't waste an ounce of it.The time period is very revealing, as we see how this social system began to crumble, with the war and the cries for change. The family sees its youngest daughter become an activist and a nurse, wanting to be a positive force for change, even at the loss of her privileged life. We see young men go off to war and the horrors it inflicts upon them. We see the losses of the families left behind and how their world has been turned upside down, for good or ill. We see the casualties of war, as they try to rebuild their lives, but things are never as they were. We also see a romance that twists and turns, thrust together and pulled apart. We get to see the neglected ones shine through, the faithful rewarded and hurt. In short, we see life, even if it is tweaked for dramatic purposes.No, this isn't just another romanticized period drama. It's a bit more than that. Not quite a historical record, not just a character study. It's what the best of literature and drama should be; a commentary on life via a slight distortion of it. It uses a different world (whether place or time) to allow us to see our world without our blinders that help us get through the day to day. I certainly want to see the show continue, but hope they have the good sense to wrap it up when it is logically time to do so. There is always pressure to keep a successful series going, well after all of the stories have been told. Let's hope the curtain comes down when it should; just not quite yet."
    },
    {
      "username": "elliotjeory",
      "userUrl": "https://www.imdb.com/user/ur69864183",
      "reviewLink": "https://www.imdb.com/review/rw5204164",
      "warningSpoilers": false,
      "date": "21 October 2019",
      "rate": "10",
      "helpful": "6 out of 8 found this helpful.",
      "title": "Outstanding British television",
      "content": "I didn't watch Downton abbey until years after it finished. I never thought I would like it but I was hooked after the first episode. It's a beautiful show, the buildings the clothes, everything from that era is brilliant. The storylines are excellent and each character has their own story to develop which makes it very interesting viewing and I would love for them to make another season."
    },
    {
      "username": "santurcedc",
      "userUrl": "https://www.imdb.com/user/ur118161469",
      "reviewLink": "https://www.imdb.com/review/rw5755724",
      "warningSpoilers": false,
      "date": "20 May 2020",
      "rate": "10",
      "helpful": "7 out of 9 found this helpful.",
      "title": "I Am Loving The Series Downton Abbey",
      "content": "I heard so much about Downton Abbey over the years and I never watched this series until recently. All episodes are currently playing on Amazon Prime Videos. My favorite characters are Thomas Barron and Violet Crawley, Dowager Countess of Grantham. However, racism existed in England in the 1920's. A black man looking or dancing with a white woman would end up like Emmett Till. Gary Carr is not an American black actor. They should have cast a more attractive light skin black actor like Matthew Law for the part of Jack Ross. Overall, the series is outstanding. I love the British actress, Maggie Smith."
    },
    {
      "username": "reynolds-dale",
      "userUrl": "https://www.imdb.com/user/ur16547396",
      "reviewLink": "https://www.imdb.com/review/rw2367309",
      "warningSpoilers": false,
      "date": "10 January 2011",
      "rate": "10",
      "helpful": "66 out of 85 found this helpful.",
      "title": "A satisfying social drama presaging the changes upcoming in pre-WWI Britain.",
      "content": "Julian Fellowes' intelligent (and sophisticated) take on pre-World War I society of aristocrats and worker-bees is smart-writing on the changes we will see over the next 25 years, encompassing two major wars and a great depression. The writing and the casting make this many steps above \"soap opera\" as the themes of social mobility and aristocratic incompetence are sharply etched.All of it pleased me, from the smallest character to the dozen or so leads, lead off by the always-brilliant Maggie Smith. This is to be enjoyed for both its eye-candy (Downton Abbey) and its themes of rich- and-poor dilemmas. Gorgeously shot with accurate art-direction. Wonderful all the way around."
    },
    {
      "username": "zendatrim",
      "userUrl": "https://www.imdb.com/user/ur60068164",
      "reviewLink": "https://www.imdb.com/review/rw3777888",
      "warningSpoilers": true,
      "date": "10 August 2017",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "A rare magnificent jewel of outstanding quality",
      "content": "If i could vote 11 i would, this was one of the better period dramas i have ever watched. I found it on amazon as my friends kept telling me to watch it, they even cried when it finished I thought oh dear how sad people would get so upset over drama on t.v.Well errrrr, i was sucked in the first few minutes, my house deteriorated around me, as i sat and binged watched, thanked goodness i have a cleaner. I had to watch it, i was hooked and needed my fix of the family and all their friends and yes enemies. I loved some of them, hated some of them, and the ones i hated at the beginning i loved at the end, as their stories were told. I even got interested in history, and read up more of the battles of WWI and about the Spanish Flu, and had not realised that more people died with the flu between 40 and 50 million in fact then the war itself. The producers had done their research, as this flu did kill people very rapidly and most who died were younger it didn't seem to affect older people. I loved the intrigue, The Bates and their dramas, the scene with Anna was very risqué, and i read that the phone lines were jammed that night after her attack. I can see why as the drama was go good you felt you were living it, walking the halls of downton abbey, listening and evesdropping on the families, wanting to cheer at the good stuff and boo at the bad stuff, cry at deaths, and be sad and wring a hankie with tears. I wont say what it was all about there is enough out there to explain, just to say this, you MUST watch it, any other drama is just a poor quality copy of this. Its finished now i have watched it all, and feel like i have lost a family. I really do hope they have a reunion they should do. The Finale was brilliant and lots of things were settled, but i would love to see how they all get on. It also made me realise that snobbery and prejudice was just as rife downstairs as upstairs which was surprising but on reflection yes i can see that happening. I shall so miss the Dowager and Isobel, and the one liners from the dowager so aptly made just at the right time, comedy genius, Maggie Smith the actress simply devine. I actually feel lost now, and might start to watch it all over again, oh dear do you think I need help lol."
    },
    {
      "username": "MissSimonetta",
      "userUrl": "https://www.imdb.com/user/ur28071275",
      "reviewLink": "https://www.imdb.com/review/rw3035005",
      "warningSpoilers": true,
      "date": "16 June 2014",
      "rate": "5",
      "helpful": "9 out of 14 found this helpful.",
      "title": "Entertaining enough",
      "content": "There are Downton devotees and there are people who think it's a second-rate soap opera praising the oppressive class system of days of old. I'm in the middle ground: I like the show, but I cannot for the life of me comprehend the 8.8 rating it has on this website.I can certainly see the appeal: the production values are marvelous, from the costumes to the old-fashioned cars. The show's story is mostly the stuff of melodrama: scandals, sex, war, and family issues all on the grand scale. The character's, while not always likable, are an interesting bunch of people. I will admit though, sometimes the writing is weak and soap opera-ish (ex. Edith's wedding). Some of the characters are flat too.I don't think this show will be considered a classic in the long run, but it is solid entertainment."
    },
    {
      "username": "bertbollen",
      "userUrl": "https://www.imdb.com/user/ur26312541",
      "reviewLink": "https://www.imdb.com/review/rw5759926",
      "warningSpoilers": false,
      "date": "22 May 2020",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "I think",
      "content": "I have fallen in love with lady Violet Crawley. She was truly thé leading actress in this marvellous Serie."
    }
  ],
  "errorMessage": ""
}