{
  "imDbId": "tt0421291",
  "title": "Avrupa Yakasi",
  "fullTitle": "Avrupa Yakasi (TV Series 2004–2009)",
  "type": "TVSeries",
  "year": "2004",
  "items": [
    {
      "username": "Zeppaa",
      "userUrl": "https://www.imdb.com/user/ur4480792",
      "reviewLink": "https://www.imdb.com/review/rw1179869",
      "warningSpoilers": false,
      "date": "25 September 2005",
      "rate": "",
      "helpful": "53 out of 59 found this helpful.",
      "title": "Traditional ambitions in modern life",
      "content": "\"Avrupa Yakasi\" means \"European Side\", which refers to the common usage of west side of Istanbul, since the big metropolis is divided into two by the Istanbul Strait, while eastern part is called \"Anatolian Side\".However in this funny sitcom by ATV, \"Avrupa Yakasi\" is the name of a Fashion & Style Magazine, which the main characters work for. The office of the magazine and almost all of the characters live in \"Nisantasi\", located in the European side of Istanbul. It is an important detail for this TV series, because \"Nisantasi\" is presented as the home town of \"high society\" in Istanbul.Since the story is about the high society or the \"White Turks\", who are educated and successful in their career, but also funny and romantic, sometimes feels like the characters are taken from similar American productions like \"Sex and the City\", \"Ally McBeal\" etc.Maybe for balancing these characters with Turkish reality or because of Istanbul, which is a melting pot, a city of great contrast, we have some completely contrary characters somehow found them in \"Nisantasi\". This opposition creates ridiculous atmosphere and many possibilities for funny rivalry between sides.Since the story is usually established on the colorful life of high society that we can describe them as \"European Side\"; watchers also surprised and amused by the opposite characters that can be described as the \"Anatolian Side\", sometimes because of their naive and unexpected behaviors, and sometimes because of very smart but short term solutions that they found to problems.\"Avrupa Yakasi\" is one of the most successful TV series of last year. Almost every character has created own fans. However \"Gulse Birsel\" who is the leading actress and also the writer of the script, and \"Ata Demirer\" who is a former comedian, made \"Avrupa Yakasi\" a phenomenon and created the major difference among other Turkish sitcoms."
    },
    {
      "username": "vahapsumer",
      "userUrl": "https://www.imdb.com/user/ur12677574",
      "reviewLink": "https://www.imdb.com/review/rw1501754",
      "warningSpoilers": false,
      "date": "20 October 2006",
      "rate": "10",
      "helpful": "32 out of 36 found this helpful.",
      "title": "aAAAvVVrUUpAaaaaaa YAAkaaasiiiiiii..... gotta love this show!",
      "content": "Avrupa Yakasi DVD's are going to be added to my collection when they are available. For a well made sitcom with exclusive cast; hats down ladies and gentlemen. This show will be a classic like Seinfeld someday in this country and I will be proud of to tell my grandkids \"Oh yeah I remember the darn show airing on for the first time; peaaaaaah you kids don't even know who Teoman or Sebnem Ferah is. Am I getting that old? ahmmm, anyways. \"Being born pessimist, it is my honor to talk about some things i don't like in the show, going by the tradition I haven't been able to diminish since my high school years I quit smoking but can't quit pessimism.. Wanting to tell you how much of an art work this show really is, here is the the worm in the shiny red apple. I don't appreciate the quality of the job done by the people who are holding the darn microphones. Anyone who watches the show regularly and has seen each episode more than once like myself would agree that there are lots of parts the microphone coming down from the ceiling level (somebody holding it and that somebody's hands getting tired, very unprofessional and kills the scenes for me). You ask yourself isn't there a person watching the edited production before running it on TV. Maybe even before that the cameraman and the director who watches what is being taped could see this happening over and over again but magically no.. It is me seeing it in the middle of many shows. This happens almost on a regular basis. Well not too much complain though, now here is a fact I appreciate...actually facts... the goodies... Ironically right after the sentences above, I will say that I love the attention to detail created by the same people in this show. I would like to give credit to all who had something to do with the production. I like hearing the trendy words and conversations not to mention creating such words like \"oha falan olmak\", \"soldan soldan gelmek\" etc... I will give you a vivid example of those details I am talking about. On episode #98, audience finally gets to see what Burhan Altintop's apartment looks like. What an amazing moment in the history of the show. I would like to describe that moment as; adding another instrument to the sound of a peace performed by an orchestra you are listening live. It is a similar experience that gets better and better. Every time you see an object appearing at his living room it is another missing piece of the puzzle such as \"the Altintop-face Mona Lisa\", the candle-shape red lights etc Engin Günaydin, known as Burhan, is or at least will be soon \"the next generation of Kemal Sunal\". After taking total control of the show from the very first episode he appeared on, his surreal mimics reflecting the absurd and spontaneous way of \"Engin Gunaydin branded and patented\" comedy (I hear he has a stand-up show now) it was very exciting to watch the episode opening the door to his apartment after everything he has done and said on the show. I haven't seen a comedy done so simple and so addictive in Turkey is my one sentence description of the show. Using special \"laughter ball affects\" by adding already out there ingredients together: City living through the eyes of real city people, small town people who live in the city, handpicked cast and some commercial secrets the writer puts together in the show. The last two ingredients weren't so out there and thanks to them the story of our everyday life could become a comedy. This show had an advantage of having Gazanfer Özcan to start with. Despite the fact that later on the show Ata Demirer (Volkan), Bülent Polat (Sesu), and Evrim Akin (Selin) were gone, it still is a hit and a lot of the credit goes to Gülse Birsel (writer/one of the main characters). This show is not a miracle that happened in one day with no or little money. But when you look at the competition, can't find something even to compare with. Deserves a lot of respect even If it costs a fortune because well they made it. Getting closer to the 100th episode, something a few shows reached in the history of Turkish TV, I love the Avrupa Yakasi and try my best not to think that there is going to be an end to it like every other great thing has an end too. Thanks everybody creating such a wonderful TV series. Once again I would like to see the DVD's soon with lots of extras. Yasasin Avrupa Yakasi! I would like to write more about the show but you are getting bored a bit and I can feel it. OK just a little more. This one goes to the people who can't stand the show.I understand you thinking shows like this one or a character like Burhan is nothing more than a worthless peace of brain-killer \"thing\" called comedy by people who made it and defined as entertainment by the ones who watch it. Thank you for reading what I had to say about aAAAvVVrUUpAaaaaaa YAAkaaasiiiiiii"
    },
    {
      "username": "gunaycimen",
      "userUrl": "https://www.imdb.com/user/ur12574660",
      "reviewLink": "https://www.imdb.com/review/rw1508833",
      "warningSpoilers": false,
      "date": "29 October 2006",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "new season is much better than expected",
      "content": "I am a Turk, who is living abroad for some time. Frankly speaking, I have not been in expectation of Turkish film industry to make such a great comedy. You can say that this another sit-com, which Turkish industry is producing 2 new productions/week. Still, with the topics they are touching, and with the support of the actors/actresses who have theater education background, the overall performance is just 'great'.In addition, although the main character has stopped working for some reason (!) the new season is like a bomb, with the support of the newcomer characters.I would definitely keep all the series in my archive."
    },
    {
      "username": "selmab",
      "userUrl": "https://www.imdb.com/user/ur5301792",
      "reviewLink": "https://www.imdb.com/review/rw1228704",
      "warningSpoilers": false,
      "date": "1 December 2005",
      "rate": "",
      "helpful": "21 out of 26 found this helpful.",
      "title": "Just love it!",
      "content": "I make sure and watch this regularly. Enjoy it tremendously. I have just purchased all of season one off the net. The characters remind me of some people I actually know. I grew up in Sisli-Nisantasi area, know a lot of people from there some of them still live there. All the actors are remarkably good. I am very impressed by the writer, who is also one of the main characters in the show. Of course the appearance of Gazanfer Ozcan who is a longtime theater actor fills the show with his presence. Humeyra whom I have known as a singer is simply wonderful in her part. I have been living in Canada since 1968, have only been back for visits 4 times since, so needless to say this program is a visit home at a different time then I have left home, however some things never change."
    },
    {
      "username": "nedimuzel",
      "userUrl": "https://www.imdb.com/user/ur14211558",
      "reviewLink": "https://www.imdb.com/review/rw1608289",
      "warningSpoilers": true,
      "date": "27 February 2007",
      "rate": "10",
      "helpful": "4 out of 6 found this helpful.",
      "title": "one of the best series in turkey",
      "content": "what there can be better series in turkey, that is the best sitcom in turkey. almost all players are the professional and the cases in the series is so fantastic...Alta demurer was so good player in the series but he had to leave from this series, but not instead of him there is maybe better maybe almost better players i see in the movie with new characters.Gaffur(Peker alkaline) and Burhan alternator(Engin Gunaydin), they have so action colors in the series and also on the people...they really make me smile,,,,the series is now 3 years old, in the begin of this series , that has normal numbers people to watch it, but now at the time of the series almost everybody is next to TV"
    },
    {
      "username": "ali1arslan",
      "userUrl": "https://www.imdb.com/user/ur109975076",
      "reviewLink": "https://www.imdb.com/review/rw8466953",
      "warningSpoilers": false,
      "date": "19 August 2022",
      "rate": "1",
      "helpful": "0 out of 23 found this helpful.",
      "title": "Example for TV series how to show prostitution legal...",
      "content": "It is not about Asia or Europe, it is all about some kind of well dressed and elite masked terrorists and how they trick people, so dark mafia-lover and very very ill production...When you first watch it, you smile or laugh out louder but after a few years you realise that it is trash & tragic..."
    }
  ],
  "errorMessage": ""
}