{
  "imDbId": "tt0421291",
  "title": "Avrupa Yakasi",
  "fullTitle": "Avrupa Yakasi (TV Series 2004–2009)",
  "type": "TVSeries",
  "year": "2004",
  "language": "en",
  "titleInLanguage": "Avrupa Yakası",
  "url": "https://en.wikipedia.org/wiki/Avrupa_Yakas%C4%B1",
  "plotShort": {
    "plainText": "Avrupa Yakası (European Side) is a Turkish sitcom, produced by Sinan Çetin and written by Gülse Birsel. The series was shot at Plato Film studios and its first episode was broadcast on ATV on 11 February 2004.\r\nAlthough the cast of Avrupa Yakası changed throughout different seasons, Gülse Birsel, Gazanfer Özcan, Levent Üzümcü, Şenay Gürler, Hale Caneroğlu, Yavuz Seçkin, Veysel Diker and Yıldırım Öcek were the permanent actors who portrayed members of the Sütçüoğlu family and the employees of the fictional Avrupa Yakası magazine, located in Nişantaşı. At the end of the first five seasons of the series, the company had a turnover of ₺40 million and it produced 4 million dollars for Sinan Çetin, the producer of the series.",
    "html": "<p>Avrupa Yakası (European Side) is a Turkish sitcom, produced by Sinan Çetin and written by Gülse Birsel. The series was shot at Plato Film studios and its first episode was broadcast on ATV on 11 February 2004.</p><p>Although the cast of Avrupa Yakası changed throughout different seasons, Gülse Birsel, Gazanfer Özcan, Levent Üzümcü, Şenay Gürler, Hale Caneroğlu, Yavuz Seçkin, Veysel Diker and Yıldırım Öcek were the permanent actors who portrayed members of the Sütçüoğlu family and the employees of the fictional Avrupa Yakası magazine, located in Nişantaşı. At the end of the first five seasons of the series, the company had a turnover of ₺40 million and it produced 4 million dollars for Sinan Çetin, the producer of the series.</p>"
  },
  "plotFull": {
    "plainText": "Avrupa Yakası (European Side) is a Turkish sitcom, produced by Sinan Çetin and written by Gülse Birsel. The series was shot at Plato Film studios and its first episode was broadcast on ATV on 11 February 2004.\r\nAlthough the cast of Avrupa Yakası changed throughout different seasons, Gülse Birsel, Gazanfer Özcan, Levent Üzümcü, Şenay Gürler, Hale Caneroğlu, Yavuz Seçkin, Veysel Diker and Yıldırım Öcek were the permanent actors who portrayed members of the Sütçüoğlu family and the employees of the fictional Avrupa Yakası magazine, located in Nişantaşı. At the end of the first five seasons of the series, the company had a turnover of ₺40 million and it produced 4 million dollars for Sinan Çetin, the producer of the series.\r\nPlot\r\nAslı (Gülse Birsel) works as an editor at a fashion magazine called Avrupa Yakası. Her family owns a restaurant and Aslı's brother, Volkan (Ata Demirer) runs the restaurant. The episodes mostly consist of funny events and incidents between Aslı, Volkan, Aslı's colleagues, Volkan's friends, and Aslı's parents.\r\nCast\r\nMost of the main characters on Avrupa Yakası are members of the Sütçüoğlu family. Scenarist Gülse Birsel portrayed the character of \"Aslı\", while Gazanfer Özcan was cast as Aslı's father, Hümeyra as her mother, and Ata Demirer as her brother Volkan. At the beginning of season 3, Ata Demirer made it known to scenarist Gülse Birsel and producer Sinan Çetin that he wanted to leave the series and so he did by the end of the season. He later returned to the series in season 6. Out of the main cast, Hümeyra left the main cast after season 5's finale. The other characters leaving at the Sütçüoğlu residence were portrayed by Hasibe Eren and Tolga Çevik who joined the cast in season 4. Tolga Çevik continued to remain in the main cast throughout seasons 4 and 5, but later as his program Komedi Dükkanı began to air TRT 1 he left the series. Following Gazanfer Özcan's death on 17 February 2009, Müşfik Kenter and Gönül Ülkü joined the cast as parents to Hasibe Eren's character Makbule.\r\nThe characters in the Avrupa Yakası magazine office, which is one of the places in the series and the namesake of the show, were portrayed by both young actors as well as the experienced actors. The magazine's boss was portrayed by Yıldırım Öcek. Its initial general manager and later one of its photographers who was also Aslı's previous husband was played by Levent Üzümcü. Şenay Gürler appeared as the magazine's editor and Hale Caneroğlu took the role of its designer. Sarp Apak played the role of the magazine's cook, while Engin Günaydın portrayed its managing director and Binnur Kaya appeared as the daughter of the magazine's financial partner. For the first three seasons, Bülent Polat played the role of the cook and Evrim Akın appeared as the boss's daughter. Both of them left the series at the end of season 3. Evrim Akın later announced that she had left the series because she was fed up with it. Sarp Apak joined the cast in season 4, followed by Binnur Kaya in season 5. Among those who left the series at the end of season 5 was Vural Çelik, who had the role of Yaprak's husband and the magazine's shareholder Kubilay and his poor brother Gülenay.\r\nThe main characters at the Sütçüoğlu Dairy Bar were portrayed by Veysel Diker and Yavuz Seçkin. Timur Acar and Ömür Arpacı later joined them in the following seasons.\r\nCharacters in the doorman's family in Sütçüoğlu apartment building, who started to be seen in the series from the 4th season, were portrayed by Peker Açıkalın, Bihter Özdemir, Ececan Gümeci, Celal Belgil and Şensel Uykal. Following Peker Açıkalın's decision to leave the series, Gürgen Öz joined the cast as Cesur. In the following episodes as Gürgen Öz felt that he could not have the performance that he had desired in the series, he left the cast after shooting the episode for the New Year.\r\nHakan Yılmaz, who had initially made guest appearances in the series, later became one of the regulars. Rutkay Aziz and Suna Keskin appeared as the parents of the character Cem in the series. After the end of season 5, Rutkay Aziz was cast in the TV series Gurbet Kuşları and left the series, though his named continued to appear in the main title of season 6 and he eventually returned to the series.\r\nProduction\r\nThe script of the series was written by Gülse Birsel. She had previously prepared the program g.a.g. for the same channel, which made fun of the commercials broadcast on TV. After finding the story that would be the subject of the series, Birsel finished the scenario by writing four to five pages an hour in about four days. Birsel later stated that \"while writing the characters, it felt as if sometimes they were whispering their own jokes into my ears, creating their own stories\".\r\nMusic\r\nThe music of the program was created by Cenk Durmazel and Cenk Sarkuş. The song which was the main title of the series was voiced by the most of the cast. Caneroğlu later performed the song in various places.\r\nCost\r\nAs a result of the research conducted by Saklambaç in 2008, the cost of Avrupa Yakası was estimated to be ₺400 thousand. The series was the second highest-budgeted television production after Valley of the Wolves. Avrupa Yakası made a turnover of ₺40 million at the end of the first five seasons. Producer Sinan Cetin earned 4 million dollars from the series. The program, which was affected by the economic crisis in 2008, was published once every two weeks during January 2009.\r\nLength\r\nWhile the series had a 90-minute duration over the first 169 episodes, the economic crisis in 2008 which affected the world, affected the Turkish media as well. After TRT 1 shortened the display time for Doludizgin Yıllar, several other series including Avrupa Yakası were cut short. In her interviews, screenwriter Gülse Birsel stated that she wanted the length of the episodes to be shortened. After holding meetings with ATV and Plato Film, it was decided that Avrupa Yakası should be aired as three 73-minute episodes and one 85-minute episode every month.\r\nEffects\r\nEffect on social life\r\nThe striped flannelette pajamas that were worn by the character of Gaffur, the son of the doorman family played by Peker Açıkalın, became among the fashionable items at the time. The pajamas, which were produced originally many years prior to the show by Sümerbank but had not been much bought recently, became popular again with the program and were put on display on the mannequins in a number of markets. At the time, the media reported that in a number of cities (including Batman) the pajamas had been sold out and instead were being offered in the black market. The sales eventually stopped as Gaffur's storyline came to an end. Additionally, under the influence of the character and his appearance in the pajamas, Gaffur Nasılım Spor was founded in Şırnak and a rock group called Gaffur was initiated in Beyoğlu. A group of young people in İdil district of Şırnak founded the \"Gaffur Nasılım Spor\" and participated in a football tournament organized by the district governor of İdil.\r\nPrime Minister Family and Social Research Institute published a quarterly magazine featuring an article called \"Current Risks to the Family Institution\", which discussed the negative impact on the Turkish family structure, and Hasibe Eren's character Makbule Kıral was named as one of these negative factors. The reason was explained as Makbule's divorce from İzzet and sharing her uncle's house with her former boyfriend Burhan. It was claimed that Makbule and other characters of the series were creating undesirable behavior patterns, affecting the audience by putting the social life in risk. The article's author, Dr. Ünal Şentürk, also included that the reason for Aslı and Cem's divorce was also not clear and their sharing of a house post-divorce was also an unacceptable and risky behavior. The screenwriter Gülse Birsel addressed these issues in a statement:\r\nThe character Makbule was slandered, her honor was broken. She is an active, honorable girl, who follows customs. Also, she lives in the house next to that of her fiance Sayın Altıntop, not in the same house as his.\r\nOn 3 July 2005, during the discussions for passing the \"Law on Establishment of Probation and Assistance Centers\", the character Burhan (portrayed by Engin Günaydın) was mentioned by Minister of Justice Mehmet Ali Şahin during the discussions.\r\nThe Diyanet-Sen General Organization Secretariat reacted to the names on Avrupa Yakası and other TV series. He claimed that names such as Burhan, Taceddin, and Gaffur had religious basis while the characters who bear the names are bad, impure and stupid and that could cause damage to the moral feelings of the nation\r\nEffect on actors\r\nAs a result of the performances of the actors who portrayed the characters on Avrupa Yakası, they appeared in many commercials and feature films. After the series started, 8 actors from the cast started appearing in commercials. Levent Üzümcü (Garanti Bank), Gülse Birsel (Turkcell, TTNET), Ata Demirer (Vestel), Evrim Akın (Bellona), Hümeyra (Taç curtain), Bülent Polat (Blue House), Yavuz Seçkin (Aras Cargo), and Veysel Diker (Kompen) were the actors who play in a number of advertisements. Later, Şenay Gürler and Gazanfer Özcan also became members of the cast who got role in the commercials. Engin Günaydın, who joined the series in its third season and gain popularity with his portrayal, was cast in a commercial for Garanti Bank, while Gülse Birsel appeared in a commercial for Whirlpool, and Sarp Apak in an advertisement for Turkcell. Hasibe Eren portrayed a fictional character called Şekure in a commercial for Akpet, while Binnur Kaya appeared as Dilber Hala in an advertisement for D-Smart.\r\nActors such as Sarp Apak and Bülent Polat gained immense popularity and were cast in feature films. Meanwhile, the series' scenarist and one of the actors, Gülse Birsel, who had published a number of books in the past, including Gayet Ciddiyim in 2003, Hâlâ Ciddiyim in 2004 and Yolculuk Nereye Hemşerim in 2005, claimed that she could not write a new book at the time because she had to prepare the scenario for the episodes which were scheduled to last for 90 minutes and also deal with RTÜK's rule of including a 20-minute commercial during the broadcast of each episode.\r\nRelease\r\nHakan Algül directed the first season of the series, which was a completely domestic production. The first season ended on 23 June 2004 with 19 episodes in total. Jale Atabey directed the 39 episodes of the second season which began to air on 8 September 2004 and ended on 15 June 2005. Engin Günaydın joined the main cast in the role of the managing director on the third season, which was first broadcast on 14 September 2005 and finished with the 93rd episode on 21 June 2006. Peker Açıkalın, Tolga Çevik, Hasibe Eren and Sarp Apak joined the main cast in season 4, which started on 13 September 2006 and ended with a finale featuring Serdar Ortaç on 27 June 2007. On 19 September 2007 the fifth season started, and it ended on 4 June 2008. During the broadcast of season 4, it was reported that the series would be concluded with 100 episodes, but it was later decided that it should continue. The series sixth season started on 24 September 2008. Scenarist Gülse Birsel later announced that the series would end in June 2009. It ended on Wednesday, 24 June 2009, with 190 episodes in total.\r\nAwards\r\nDVD\r\nThe first season of the series was released on DVD, containing the first 19 episodes. The DVD was released on 7 March 2005, consisting of the episodes, behind-the-scene videos and special interviews with the actors. There are also two episodes on the VCDs. A special banner was prepared for the prevention of pirate sales of the DVDs and VCDs of Avrupa Yakası, which was launched in partnership with Plato Film, Palermo and ATV.\r\nDevelopment\r\nCensorship\r\nAvrupa Yakası was exposed to various censors. Particularly, the show was forced to follow the strict rules set by RTÜK. In the 6th season, Ata Demirer's character, Volkan, wore a t-shirt inspired by the \"Hotmail\" website, which had the word \"Hotmale\" on it. ATV was later ordered by the supreme council to censor the t-shirt. The word \"hotmale\" was the name of a popular Internet site known for its content for gays, and it was equivalent to \"horny\" or \"sexy\" in Turkish. Ata Demirer later said that he did not know that the word was the name of a gay porn site. RTÜK's censorship appeared again in the 166th episode of the series with checkering of a section of Sabah newspaper held by Tahsin Bey. It was later found out that the section featured an advertisement. Before the broadcast of episode 169, a message of warning by RTÜK appeared on the screen, addressing the use of unsuitable words in the previous episode of the series. The episode was then beeped approximately 80 times during its broadcast time. According to the information given, 'maniac', 'fool', 'jerk', and 'idiot' were the words that had been censored out.\r\nChange in actors\r\nAvrupa Yakası lost many of its original actors until its 6th and final season and in different periods many of the actors in the main cast were changed. Vural Çelik joined the series in its second season and became the first actor to join the original main cast. In its third season, Engin Günaydın and Levent Üzümcü joined the cast and in the following episodes Rutkay Aziz and Suna Keskin also became the series' regulars. By the end of the season, Ata Demirer, Evrim Akın and Bülent Polat left the series. In the following seasons, Peker Açıkalın, Tolga Çevik, Hasibe Eren, Sarp Apak, Binnur Kaya, Timur Acar, Ömür Arpacı, Hakan Yılmaz, and Gürgen Öz became among the actors who were cast in main roles; meanwhile actors such as Hümeyra and Vural Çelik left the series. Following Gazanfer Özcan's death, Müşfik Kenter and Gönül Ülkü became the last two actors who joined the main cast.",
    "html": "<p>Avrupa Yakası (European Side) is a Turkish sitcom, produced by Sinan Çetin and written by Gülse Birsel. The series was shot at Plato Film studios and its first episode was broadcast on ATV on 11 February 2004.</p><p>Although the cast of Avrupa Yakası changed throughout different seasons, Gülse Birsel, Gazanfer Özcan, Levent Üzümcü, Şenay Gürler, Hale Caneroğlu, Yavuz Seçkin, Veysel Diker and Yıldırım Öcek were the permanent actors who portrayed members of the Sütçüoğlu family and the employees of the fictional Avrupa Yakası magazine, located in Nişantaşı. At the end of the first five seasons of the series, the company had a turnover of ₺40 million and it produced 4 million dollars for Sinan Çetin, the producer of the series.</p><br/><h3>Plot</h3><p>Aslı (Gülse Birsel) works as an editor at a fashion magazine called Avrupa Yakası. Her family owns a restaurant and Aslı's brother, Volkan (Ata Demirer) runs the restaurant. The episodes mostly consist of funny events and incidents between Aslı, Volkan, Aslı's colleagues, Volkan's friends, and Aslı's parents.</p><br/><h3>Cast</h3><p>Most of the main characters on Avrupa Yakası are members of the Sütçüoğlu family. Scenarist Gülse Birsel portrayed the character of \"Aslı\", while Gazanfer Özcan was cast as Aslı's father, Hümeyra as her mother, and Ata Demirer as her brother Volkan. At the beginning of season 3, Ata Demirer made it known to scenarist Gülse Birsel and producer Sinan Çetin that he wanted to leave the series and so he did by the end of the season. He later returned to the series in season 6. Out of the main cast, Hümeyra left the main cast after season 5's finale. The other characters leaving at the Sütçüoğlu residence were portrayed by Hasibe Eren and Tolga Çevik who joined the cast in season 4. Tolga Çevik continued to remain in the main cast throughout seasons 4 and 5, but later as his program Komedi Dükkanı began to air TRT 1 he left the series. Following Gazanfer Özcan's death on 17 February 2009, Müşfik Kenter and Gönül Ülkü joined the cast as parents to Hasibe Eren's character Makbule.</p><p>The characters in the Avrupa Yakası magazine office, which is one of the places in the series and the namesake of the show, were portrayed by both young actors as well as the experienced actors. The magazine's boss was portrayed by Yıldırım Öcek. Its initial general manager and later one of its photographers who was also Aslı's previous husband was played by Levent Üzümcü. Şenay Gürler appeared as the magazine's editor and Hale Caneroğlu took the role of its designer. Sarp Apak played the role of the magazine's cook, while Engin Günaydın portrayed its managing director and Binnur Kaya appeared as the daughter of the magazine's financial partner. For the first three seasons, Bülent Polat played the role of the cook and Evrim Akın appeared as the boss's daughter. Both of them left the series at the end of season 3. Evrim Akın later announced that she had left the series because she was fed up with it. Sarp Apak joined the cast in season 4, followed by Binnur Kaya in season 5. Among those who left the series at the end of season 5 was Vural Çelik, who had the role of Yaprak's husband and the magazine's shareholder Kubilay and his poor brother Gülenay.</p><p>The main characters at the Sütçüoğlu Dairy Bar were portrayed by Veysel Diker and Yavuz Seçkin. Timur Acar and Ömür Arpacı later joined them in the following seasons.</p><p>Characters in the doorman's family in Sütçüoğlu apartment building, who started to be seen in the series from the 4th season, were portrayed by Peker Açıkalın, Bihter Özdemir, Ececan Gümeci, Celal Belgil and Şensel Uykal. Following Peker Açıkalın's decision to leave the series, Gürgen Öz joined the cast as Cesur. In the following episodes as Gürgen Öz felt that he could not have the performance that he had desired in the series, he left the cast after shooting the episode for the New Year.</p><p>Hakan Yılmaz, who had initially made guest appearances in the series, later became one of the regulars. Rutkay Aziz and Suna Keskin appeared as the parents of the character Cem in the series. After the end of season 5, Rutkay Aziz was cast in the TV series Gurbet Kuşları and left the series, though his named continued to appear in the main title of season 6 and he eventually returned to the series.</p><br/><h3>Production</h3><p>The script of the series was written by Gülse Birsel. She had previously prepared the program g.a.g. for the same channel, which made fun of the commercials broadcast on TV. After finding the story that would be the subject of the series, Birsel finished the scenario by writing four to five pages an hour in about four days. Birsel later stated that \"while writing the characters, it felt as if sometimes they were whispering their own jokes into my ears, creating their own stories\".</p><h4>Music</h4><p>The music of the program was created by Cenk Durmazel and Cenk Sarkuş. The song which was the main title of the series was voiced by the most of the cast. Caneroğlu later performed the song in various places.</p><h4>Cost</h4><p>As a result of the research conducted by Saklambaç in 2008, the cost of Avrupa Yakası was estimated to be ₺400 thousand. The series was the second highest-budgeted television production after Valley of the Wolves. Avrupa Yakası made a turnover of ₺40 million at the end of the first five seasons. Producer Sinan Cetin earned 4 million dollars from the series. The program, which was affected by the economic crisis in 2008, was published once every two weeks during January 2009.</p><h4>Length</h4><p>While the series had a 90-minute duration over the first 169 episodes, the economic crisis in 2008 which affected the world, affected the Turkish media as well. After TRT 1 shortened the display time for Doludizgin Yıllar, several other series including Avrupa Yakası were cut short. In her interviews, screenwriter Gülse Birsel stated that she wanted the length of the episodes to be shortened. After holding meetings with ATV and Plato Film, it was decided that Avrupa Yakası should be aired as three 73-minute episodes and one 85-minute episode every month.</p><br/><h3>Effects</h3><h4>Effect on social life</h4><p>The striped flannelette pajamas that were worn by the character of Gaffur, the son of the doorman family played by Peker Açıkalın, became among the fashionable items at the time. The pajamas, which were produced originally many years prior to the show by Sümerbank but had not been much bought recently, became popular again with the program and were put on display on the mannequins in a number of markets. At the time, the media reported that in a number of cities (including Batman) the pajamas had been sold out and instead were being offered in the black market. The sales eventually stopped as Gaffur's storyline came to an end. Additionally, under the influence of the character and his appearance in the pajamas, Gaffur Nasılım Spor was founded in Şırnak and a rock group called Gaffur was initiated in Beyoğlu. A group of young people in İdil district of Şırnak founded the \"Gaffur Nasılım Spor\" and participated in a football tournament organized by the district governor of İdil.</p><p>Prime Minister Family and Social Research Institute published a quarterly magazine featuring an article called \"Current Risks to the Family Institution\", which discussed the negative impact on the Turkish family structure, and Hasibe Eren's character Makbule Kıral was named as one of these negative factors. The reason was explained as Makbule's divorce from İzzet and sharing her uncle's house with her former boyfriend Burhan. It was claimed that Makbule and other characters of the series were creating undesirable behavior patterns, affecting the audience by putting the social life in risk. The article's author, Dr. Ünal Şentürk, also included that the reason for Aslı and Cem's divorce was also not clear and their sharing of a house post-divorce was also an unacceptable and risky behavior. The screenwriter Gülse Birsel addressed these issues in a statement:</p><blockquote>The character Makbule was slandered, her honor was broken. She is an active, honorable girl, who follows customs. Also, she lives in the house next to that of her fiance Sayın Altıntop, not in the same house as his.</blockquote><p>On 3 July 2005, during the discussions for passing the \"Law on Establishment of Probation and Assistance Centers\", the character Burhan (portrayed by Engin Günaydın) was mentioned by Minister of Justice Mehmet Ali Şahin during the discussions.</p><p>The Diyanet-Sen General Organization Secretariat reacted to the names on Avrupa Yakası and other TV series. He claimed that names such as Burhan, Taceddin, and Gaffur had religious basis while the characters who bear the names are bad, impure and stupid and that could cause damage to the moral feelings of the nation</p><h4>Effect on actors</h4><p>As a result of the performances of the actors who portrayed the characters on Avrupa Yakası, they appeared in many commercials and feature films. After the series started, 8 actors from the cast started appearing in commercials. Levent Üzümcü (Garanti Bank), Gülse Birsel (Turkcell, TTNET), Ata Demirer (Vestel), Evrim Akın (Bellona), Hümeyra (Taç curtain), Bülent Polat (Blue House), Yavuz Seçkin (Aras Cargo), and Veysel Diker (Kompen) were the actors who play in a number of advertisements. Later, Şenay Gürler and Gazanfer Özcan also became members of the cast who got role in the commercials. Engin Günaydın, who joined the series in its third season and gain popularity with his portrayal, was cast in a commercial for Garanti Bank, while Gülse Birsel appeared in a commercial for Whirlpool, and Sarp Apak in an advertisement for Turkcell. Hasibe Eren portrayed a fictional character called Şekure in a commercial for Akpet, while Binnur Kaya appeared as Dilber Hala in an advertisement for D-Smart.</p><p>Actors such as Sarp Apak and Bülent Polat gained immense popularity and were cast in feature films. Meanwhile, the series' scenarist and one of the actors, Gülse Birsel, who had published a number of books in the past, including Gayet Ciddiyim in 2003, Hâlâ Ciddiyim in 2004 and Yolculuk Nereye Hemşerim in 2005, claimed that she could not write a new book at the time because she had to prepare the scenario for the episodes which were scheduled to last for 90 minutes and also deal with RTÜK's rule of including a 20-minute commercial during the broadcast of each episode.</p><br/><h3>Release</h3><p>Hakan Algül directed the first season of the series, which was a completely domestic production. The first season ended on 23 June 2004 with 19 episodes in total. Jale Atabey directed the 39 episodes of the second season which began to air on 8 September 2004 and ended on 15 June 2005. Engin Günaydın joined the main cast in the role of the managing director on the third season, which was first broadcast on 14 September 2005 and finished with the 93rd episode on 21 June 2006. Peker Açıkalın, Tolga Çevik, Hasibe Eren and Sarp Apak joined the main cast in season 4, which started on 13 September 2006 and ended with a finale featuring Serdar Ortaç on 27 June 2007. On 19 September 2007 the fifth season started, and it ended on 4 June 2008. During the broadcast of season 4, it was reported that the series would be concluded with 100 episodes, but it was later decided that it should continue. The series sixth season started on 24 September 2008. Scenarist Gülse Birsel later announced that the series would end in June 2009. It ended on Wednesday, 24 June 2009, with 190 episodes in total.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr bgcolor=\"#efefef\"><th>Season</th><th>Running date &amp; time</th><th>Season start</th><th>Season final</th><th>Running episode numbers</th><th>Episode interval</th><th>Season year</th><th>TV channel</th></tr><tr><td>Season 1</td><td>Wednesday 20.00</td><td>11 February 2004</td><td>23 June 2004</td><td>19</td><td>1–19</td><td>2004</td><td><span class=\"mw-redirect\">ATV</span></td></tr><tr><td>Season 2</td><td>Wednesday 20.00</td><td>8 September 2004</td><td>15 June 2005</td><td>39</td><td>20–58</td><td>2004–2005</td><td><span class=\"mw-redirect\">ATV</span></td></tr><tr><td>Season 3</td><td>Wednesday 20.00</td><td>14 September 2005</td><td>21 June 2006</td><td>35</td><td>59–93</td><td>2005–2006</td><td><span class=\"mw-redirect\">ATV</span></td></tr><tr><td>Season 4</td><td>Wednesday 20.00</td><td>13 September 2006</td><td>27 June 2007</td><td>37</td><td>94–130</td><td>2006–2007</td><td><span class=\"mw-redirect\">ATV</span></td></tr><tr><td>Season 5</td><td>Wednesday 20.00</td><td>19 September 2007</td><td>4 June 2008</td><td>32</td><td>131–162</td><td>2007–2008</td><td><span class=\"mw-redirect\">ATV</span></td></tr><tr><td>Season 6</td><td>Wednesday 20.00</td><td>24 September 2008</td><td>24 June 2009</td><td>28</td><td>163–190 (Final)</td><td>2008–2009</td><td><span class=\"mw-redirect\">ATV</span></td></tr></tbody></table><br/><h3>Awards</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td style=\"width: 50%;text-align: left; vertical-align: top;\"><ul><li>Radio and Television Journalists Association (RTGD) Awards<ul><li>Actress of the Year: <span>Binnur Kaya</span></li></ul></li><li>Bonus Card International Comedy Film Festival<ul><li>Comedy Honorary Award: <span>Gazanfer Özcan</span></li></ul></li><li>35th Golden Butterfly Awards (2008)<ul><li>Best Actress (Comedy): <span>Binnur Kaya</span></li><li>Best Actor (Comedy): <span>Tolga Çevik</span></li></ul></li><li>Galatasaray University \"The Bests of the Year\" (2008) Awards:<ul><li>Best TV Series: Avrupa Yakası</li><li>Best Cinema and TV Actress of the Year: Binnur Kaya</li></ul></li><li>34th Golden Butterfly Awards (2007)<ul><li>Best TV Series (Comedy): <i>Avrupa Yakası</i></li><li>Best Actress (Comedy): Hasibe Eren<i> </i></li><li>Best Actor (Comedy): <span>Peker Açıkalın</span><i></i></li></ul></li></ul><p><br></p></td><td style=\"width: 50%;text-align: left; vertical-align: top;\"><ul><li>33rd Golden Butterfly Awards (2006)<ul><li>Best TV Series (Comedy): <i>Avrupa Yakası</i></li><li>Best Comedy Actress: Gülse Birsel</li><li>Best Comedy Actor: Engin Günaydın</li></ul></li><li>32nd Golden Butterfly Awards (2005)<ul><li>Best Comedy Series: <i>Avrupa Yakası</i></li><li>Best Comedy Actress: Gülse Birsel</li><li>Best Comedy Actor: Ata Demirer</li></ul></li><li>1. Beyaz İnci Television Awards (2005):<ul><li>Best TV Series (Comedy), <i>Avrupa Yakası</i></li><li>Best Actor (Comedy), <span>Ata Demirer</span></li><li>Best Supporting Actor (Comedy), <span>Gazanfer Özcan</span></li><li>Best Supporting Actress (Comedy), <span>Hümeyra</span></li></ul></li><li>Jetix-Kido Child Awards (2005):<ul><li>Best TV Series: <i>Avrupa Yakası</i></li><li>Best Actress: <span>Gülse Birsel</span></li><li>Best Actor: <span>Ata Demirer</span></li></ul></li></ul><p> </p></td></tr></tbody></table><br/><h3>DVD</h3><p>The first season of the series was released on DVD, containing the first 19 episodes. The DVD was released on 7 March 2005, consisting of the episodes, behind-the-scene videos and special interviews with the actors. There are also two episodes on the VCDs. A special banner was prepared for the prevention of pirate sales of the DVDs and VCDs of Avrupa Yakası, which was launched in partnership with Plato Film, Palermo and ATV.</p><br/><h3>Development</h3><h4>Censorship</h4><p>Avrupa Yakası was exposed to various censors. Particularly, the show was forced to follow the strict rules set by RTÜK. In the 6th season, Ata Demirer's character, Volkan, wore a t-shirt inspired by the \"Hotmail\" website, which had the word \"Hotmale\" on it. ATV was later ordered by the supreme council to censor the t-shirt. The word \"hotmale\" was the name of a popular Internet site known for its content for gays, and it was equivalent to \"horny\" or \"sexy\" in Turkish. Ata Demirer later said that he did not know that the word was the name of a gay porn site. RTÜK's censorship appeared again in the 166th episode of the series with checkering of a section of Sabah newspaper held by Tahsin Bey. It was later found out that the section featured an advertisement. Before the broadcast of episode 169, a message of warning by RTÜK appeared on the screen, addressing the use of unsuitable words in the previous episode of the series. The episode was then beeped approximately 80 times during its broadcast time. According to the information given, 'maniac', 'fool', 'jerk', and 'idiot' were the words that had been censored out.</p><h4>Change in actors</h4><p>Avrupa Yakası lost many of its original actors until its 6th and final season and in different periods many of the actors in the main cast were changed. Vural Çelik joined the series in its second season and became the first actor to join the original main cast. In its third season, Engin Günaydın and Levent Üzümcü joined the cast and in the following episodes Rutkay Aziz and Suna Keskin also became the series' regulars. By the end of the season, Ata Demirer, Evrim Akın and Bülent Polat left the series. In the following seasons, Peker Açıkalın, Tolga Çevik, Hasibe Eren, Sarp Apak, Binnur Kaya, Timur Acar, Ömür Arpacı, Hakan Yılmaz, and Gürgen Öz became among the actors who were cast in main roles; meanwhile actors such as Hümeyra and Vural Çelik left the series. Following Gazanfer Özcan's death, Müşfik Kenter and Gönül Ülkü became the last two actors who joined the main cast.</p><br/>"
  },
  "errorMessage": ""
}