{
  "imDbId": "tt1486217",
  "title": "Archer",
  "fullTitle": "Archer (TV Series 2009–2023)",
  "type": "TVSeries",
  "year": "2009",
  "language": "en",
  "titleInLanguage": "Archer (2009 TV series)",
  "url": "https://en.wikipedia.org/wiki/Archer_(2009_TV_series)",
  "plotShort": {
    "plainText": "Archer is an American adult animated sitcom created by Adam Reed for FX which premiered on September 17, 2009. The show follows the exploits of a dysfunctional intelligence agency, centered on Sterling Archer (voiced by H. Jon Benjamin) and seven of his colleagues: his mother and boss Malory Archer (Jessica Walter), Lana Kane (Aisha Tyler), Cyril Figgis (Chris Parnell), Cheryl Tunt (Judy Greer), Pam Poovey (Amber Nash), Ray Gillette (Adam Reed) and Dr. Algernop Krieger (Lucky Yates). The show is set in an anachronistic, Cold War–esque universe and parodies espionage, culture and society, and the human condition. Archer is distinguished by artistic reinvention in contemporary episodes, foregoing the standard setup of a workplace sitcom for self-contained anthologies. It returned to its spy parody roots after the tenth season.\r\nReed conceived Archer shortly after the cancellation of his Adult Swim comedy Frisky Dingo. His experience vacationing in Spain with the influence of media franchises such as the James Bond series shaped his vision of the show. Some of the hallmarks include humor with many pop-culture references, rapid-fire dialogue, and meta-comedy. Archer is produced in a limited animation style that draws visually from mid-twentieth-century comic art. Actors record their lines individually, and the show regularly employs a recurring cast for supporting roles. Archer moved to FX's sibling network FXX in 2017, and the thirteenth season premiered on August 24, 2022. The fourteenth season, which will also be its final season, will premiere on August 30, 2023.\r\nArcher has received positive reviews from critics and won awards, including four Primetime Emmy Awards and four Critics Choice Awards. It has also received 15 Annie Award nominations, among others, for outstanding achievement in animation, writing, direction, and voice acting. Various forms of licensed media have been spawned or proposed as a result of the show's sustained success.",
    "html": "<p>Archer is an American adult animated sitcom created by Adam Reed for FX which premiered on September 17, 2009. The show follows the exploits of a dysfunctional intelligence agency, centered on Sterling Archer (voiced by H. Jon Benjamin) and seven of his colleagues: his mother and boss Malory Archer (Jessica Walter), Lana Kane (Aisha Tyler), Cyril Figgis (Chris Parnell), Cheryl Tunt (Judy Greer), Pam Poovey (Amber Nash), Ray Gillette (Adam Reed) and Dr. Algernop Krieger (Lucky Yates). The show is set in an anachronistic, Cold War–esque universe and parodies espionage, culture and society, and the human condition. Archer is distinguished by artistic reinvention in contemporary episodes, foregoing the standard setup of a workplace sitcom for self-contained anthologies. It returned to its spy parody roots after the tenth season.</p><p>Reed conceived Archer shortly after the cancellation of his Adult Swim comedy Frisky Dingo. His experience vacationing in Spain with the influence of media franchises such as the James Bond series shaped his vision of the show. Some of the hallmarks include humor with many pop-culture references, rapid-fire dialogue, and meta-comedy. Archer is produced in a limited animation style that draws visually from mid-twentieth-century comic art. Actors record their lines individually, and the show regularly employs a recurring cast for supporting roles. Archer moved to FX's sibling network FXX in 2017, and the thirteenth season premiered on August 24, 2022. The fourteenth season, which will also be its final season, will premiere on August 30, 2023.</p><p>Archer has received positive reviews from critics and won awards, including four Primetime Emmy Awards and four Critics Choice Awards. It has also received 15 Annie Award nominations, among others, for outstanding achievement in animation, writing, direction, and voice acting. Various forms of licensed media have been spawned or proposed as a result of the show's sustained success.</p>"
  },
  "plotFull": {
    "plainText": "Archer is an American adult animated sitcom created by Adam Reed for FX which premiered on September 17, 2009. The show follows the exploits of a dysfunctional intelligence agency, centered on Sterling Archer (voiced by H. Jon Benjamin) and seven of his colleagues: his mother and boss Malory Archer (Jessica Walter), Lana Kane (Aisha Tyler), Cyril Figgis (Chris Parnell), Cheryl Tunt (Judy Greer), Pam Poovey (Amber Nash), Ray Gillette (Adam Reed) and Dr. Algernop Krieger (Lucky Yates). The show is set in an anachronistic, Cold War–esque universe and parodies espionage, culture and society, and the human condition. Archer is distinguished by artistic reinvention in contemporary episodes, foregoing the standard setup of a workplace sitcom for self-contained anthologies. It returned to its spy parody roots after the tenth season.\r\nReed conceived Archer shortly after the cancellation of his Adult Swim comedy Frisky Dingo. His experience vacationing in Spain with the influence of media franchises such as the James Bond series shaped his vision of the show. Some of the hallmarks include humor with many pop-culture references, rapid-fire dialogue, and meta-comedy. Archer is produced in a limited animation style that draws visually from mid-twentieth-century comic art. Actors record their lines individually, and the show regularly employs a recurring cast for supporting roles. Archer moved to FX's sibling network FXX in 2017, and the thirteenth season premiered on August 24, 2022. The fourteenth season, which will also be its final season, will premiere on August 30, 2023.\r\nArcher has received positive reviews from critics and won awards, including four Primetime Emmy Awards and four Critics Choice Awards. It has also received 15 Annie Award nominations, among others, for outstanding achievement in animation, writing, direction, and voice acting. Various forms of licensed media have been spawned or proposed as a result of the show's sustained success.\r\nCharacters and settings\r\nArcher follows the exploits of eight dysfunctional secret agents and supporting staff of the International Secret Intelligence Service (ISIS), a fictional New York–based intelligence agency. The group consists of Sterling Archer, the show's narcissistic, womanizing protagonist; Malory Archer, a retired agent, now ISIS director, and Sterling's snarky, emotionally distant mother; Lana Kane, Sterling's love interest and mother of his daughter, and by far the most professional field agent at ISIS; Ray Gillette, the agency's openly gay bomb specialist; Pam Poovey, the head of the agency's human resources department who is often ridiculed by her peers; Cyril Figgis, a mild-mannered accountant-turned-agent; Cheryl Tunt, Malory's delusional, psychotic personal assistant; and Dr. Algernop Krieger, a bizarre, morally bankrupt scientist with little regard for the well-being of his test subjects.\r\nThe show features an array of supporting characters, several of whom gained expanded roles in subsequent episodes. Major supporting roles in Archer include Slater, an arms dealer and agent for the CIA; Katya Kazanova, head of the KGB and Sterling's former love interest; and Barry Dylan, Sterling's nemesis who, after seeking redemption, becomes his friend.\r\nEvents in Archer's early seasons transpire in an anachronistic, Cold War–esque universe. By proxy, the real time history is frequently referenced, though the comedy's timeline is intentionally vague. This method allowed producers the discretion to source elements they felt best fit the in-canon universe. In the show's more contemporary episodes, Archer eschews its spy comedy roots to advance Sterling's character arc. Each season has a unique mythology of events that highlights the group's incompetence, where they are forced to undertake a series of strange tasks in highly unusual circumstances. The main storyline climaxes when Sterling falls into a coma. From seasons eight to ten, Archer is reimagined in three self-contained universes, coinciding with a deeper exploration of Sterling's psyche.\r\nSeasons\r\nSyndication and streaming\r\nThe cable television network Comedy Central previously owned exclusive US broadcast syndication rights for Archer. Comedy Central began airing the series on their network on March 2, 2015, in one-hour program time slots. In Canada, the show is syndicated nationally on Adult Swim (previously Teletoon's Teletoon at Night block from 2010 to 2019), and new episodes are aired in tandem with the American broadcast. Endemol Shine International distributes Archer internationally.\r\nIn 2014, Amazon Prime Video and Hulu purchased online streaming rights to Archer as part of multiyear licensing agreements with 20th Television. Beginning in 2018, Hulu retains exclusive streaming rights to the show in the US via a new licensing agreement with 20th Century Fox.\r\nProduction\r\nDevelopment\r\nBefore the creation of Archer, Adam Reed worked on animated comedies with executive producer and longtime collaborator Matt Thompson. The pair later became renowned for their work on a number of Adult Swim television projects, chiefly Sealab 2021 and their follow-up Frisky Dingo, which aired for several years. After the cancellation of Frisky Dingo in 2008, Reed took a vacation to Spain to brainstorm ideas for a new project. His experience traversing the Vía de la Plata, and people-watching in Plaza Mayor in nearby Salamanca, enabled him to conceptualize his vision of Archer. Reed recalled in an interview, \"So I sat on the Plaza Mayor for three days—drinking either coffee or beer or gin, depending on the time of day—surrounded by these Spanish women who seemed both unaware and completely aware of their beauty. Occasionally they would glance over—and catch me gaping at them—and just smile at me like, 'I know, right?' And for three days, I couldn't even splutter 'Buenos dias' to any of them—not once. And thus was Sterling Archer born—he would've absolutely sauntered over to a table full of those women and sat down and ordered an entire case of cava or whatever.\" Nevertheless, he believed developing a sitcom with the theme of global espionage was inevitable given his proclivity for adventure-driven comedy. The James Bond franchise, OSS 117: Cairo, Nest of Spies (2006), and The Pink Panther franchise were Reed's inspiration as the series, then under the working title Duchess, began taking definite form.\r\nBy August 18, 2009, following Reed's pitch to FX, the network commissioned six episodes for Archer. FX initially commissioned the project as a companion series for their situational comedy It's Always Sunny in Philadelphia, but the network ultimately delayed Archer's premiere to the following January because of the demanding production schedule, and The League became Philadelphia's companion show instead. Despite this, the pilot, \"Mole Hunt\", aired as a test screening on September 17, 2009, following the season five premiere of Philadelphia. The pilot was not featured in program listings or otherwise promoted by FX; rather the network merely informed select television critics of the broadcast.\r\nFX moved Archer to FXX's broadcast lineup in 2017 as part of an aggressive strategy to increase the network's output of animated programming. FX had planned the move before the show's seventh season, in conjunction with the debut of Cassius and Clay, but momentarily dropped their endeavor after Clay's abrupt cancellation. FXX renewed Archer for a twelfth season, which premiered on August 25, 2021. On September 28, 2021, FXX renewed the series for a thirteenth season, which premiered on August 24, 2022. The 14th and final season of Archer is scheduled to premiere on August 30, 2023.\r\nWriting\r\nScriptwriting an episode consumes three weeks of the production schedule. As the comedy's main writer, Reed typically creates the first draft during pre-production, which he submits to his team of producers and art directors. From there, they analyze the script for each character, cast guest stars, and create basic concept designs, before Reed develops a final script to submit to FXX. The extent of Reed's oversight diminished when FXX expanded Thompson and executive producer Casey Willis' creative responsibilities for new episodes. Starting in season 11, Reed no longer writes the episodes. A typical Archer episode goes through 2 pages of dialogue per minute, doubling a typical sitcom.\r\nEarly Archer episodes are framed with the standard setup of a workplace comedy, defined by raunchy, reference-heavy humor, rapid-fire dialogue, and interaction-based drama. They parody spy film and routinely mock clichés of the genre. By the end of the fourth season, however, Reed questioned the longevity of the comedy's spy premise and began contemplating a new direction for Archer, impelled by the then-growing associations of ISIS with the identically initialled jihadist group. Late season episodes experiment with the standard format of an anthology, each with self-contained mythologies of arcs, settings, humor, and personas. Reed said, \"Once we started making them, and having a good time making them, 'what are some other things we can do now that the boundaries have sort of been passed?'\"\r\nCultural references on Archer cover a wide spectrum of society and the human condition, in film, literature and music for example. Some, chiefly references to literature, are obscure, and the audience often may not notice them in a single viewing. Reed cites his time as a university English major as the primary forebear for the show's literary references. Archer also develops a unique self-referentiality through character-based jokes, catchphrases, and running gags that evolve over multiple episodes. For example, Sterling or another character may yell \"phrasing\" in response to any sexually suggestive remark. Neil Genzlinger of The New York Times argues that Archer uses \"a caustic brand of humor that isn't for everybody but that has brought the show a dedicated fan base.\"\r\nAnimation\r\nArcher's animation style mirrors the aesthetic of Mad Men and mid-twentieth century comic art in the style of Jack Kirby and Steve Ditko, among others. Line work is pronounced by thick, bold outlines, in contrast to the very fine, thin line work characteristic of prime time comedies such as The Simpsons and Family Guy. Production of the comedy involves a workforce of 150 specialized artists from Reed and Thompson's Atlanta-based company Floyd County Productions, quadruple the workforce that oversaw its freshman season.\r\nArcher's production process uses Adobe software—Photoshop, Illustrator, and After Effects—as well as visual effects programs such as Toon Boom Harmony and Cinema 4D for compositing and animation. This begins with storyboarding, typically after a script has been approved, and lasts around 11–13 weeks per episode. Four episodes are produced in tandem at any given session, generally in staggered phases. In the initial stages of animation, art director Chad Hurd and producer Neal Holman storyboard set pieces with a team of artists based on specifications in the script. After a series of design revisions and reviews, these skeletal designs are then rendered as 3D models in Autodesk 3ds Max, employing a variety of animation and special effects techniques. The illustration team takes various screenshots of the 3D models once they have been completed, and the resulting images are enhanced by specialized artists in After Effects.\r\nThe characters are composed in Illustrator using referential material, among them photos of models and actors in costume. Because Archer is produced using limited animation, characters are rendered as digital puppets, and not hand-drawn on paper and digitally composited for traditional cel animation. Costumes may or may not be reproduced depending on their animatability; too much detail can hurt a character's animatability. These body pieces are then separated into basic components and layers, much like an action figure, and rigged in After Effects. Consequently, one given pose can turn into a range of others, which, according to producer Bryan Fordney, creates \"the illusion of more animation on screen than what is actually present.\" A similar technique is used in the animation of a character's face—head illustrations are divided into basic components that can be turned \"off\" and \"on\" in sequence, lending the appearance of facial movement and expression.\r\nOnce compositing begins, compositors enhance the visual palette of artwork from three or four departments until it \"looks like it was made by a single artist.\" For elaborate scenes like action sequences, artists develop several composites, which are then superimposed on stock footage using special effects.\r\nTitle sequence and music\r\nHolman cited Catch Me If You Can (2002), The Incredibles (2004), Kiss Kiss Bang Bang (2005), and the work of Saul Bass as strong stylistic influences in the creation of Archer's title sequence. When he was developing the original sequence, the rough draft version consisted of style frames with roiling flame silhouettes of the characters coalesced on a charred, black background. The crew initially struggled to develop an opening theme they believed was compatible with the premise of Archer, but once the show's eponymous theme song had been completed, Holman felt his idea was too melodramatic and went in a different direction. He created the finalized version of the sequence from several segments, each reviewed by the producers, because of the demanding production schedule. The standard opening of Archer has gone through six iterations—a replacement of shots at the start of the show's sixth season, and brand new sequences for its fifth, seventh, eighth, ninth and tenth seasons.\r\nArcher did not employ a composer to develop a soundtrack in its first four seasons, but instead used a compilation of needle drop stock music. By season five, musician JG Thirlwell was hired as the composer for the comedy's jazz-influenced score, brought to the producers' attention for his work on The Venture Bros.\r\nVoice actors\r\nArcher has a principal cast of seven actors: H. Jon Benjamin, Jessica Walter, Aisha Tyler, Judy Greer, Amber Nash, Chris Parnell and Lucky Yates. Benjamin voices the show's titular character, Walter voiced Malory until her death in 2021, Tyler plays Lana Kane, Greer portrays Cheryl Tunt, Nash plays Pam Poovey, Parnell voices Cyril Figgis, and Yates portrays Dr. Algernop Krieger. Additionally, series creator Adam Reed plays Ray Gillette. Reed was expected to play the titular role in the original pilot, but was re-cast because producers felt his voice-over did not service the character's dialogue well. When Benjamin received the offer, he was surprised since he did not believe his voice was suitable for the part. At one point, Benjamin used a British accent for the character, but Reed insisted he use his normal speaking voice.\r\nWalter was the first significant casting choice on Archer. Producers contracted her shortly after they sent out character descriptions to talent agencies, and they promoted her involvement to recruit actors for the project. Greer agreed to Archer because of her wish to break into voice acting, although she initially believed the series was too provocative for network TV. Nash did not audition for her part; rather, the actress was approached by Reed and Thompson, whom she had previously collaborated with in Frisky Dingo, while she was recording DVD extras for their program. Yates was brought onto Archer at Nash's request, after Krieger was given a more prominent speaking role.\r\nIn addition to the main cast, episodes often feature guest voices from a range of professions. Major supporting roles in Archer are played by George Coe (until his death in 2015), Jeffrey Tambor, Christian Slater, Jon Hamm, Allison Tolman, Dave Willis, Ona Grauer, Keegan-Michael Key, Bryan Cranston, J.K. Simmons, and Simon Pegg, among others. Some stars appear as themselves, or portray fictionalized caricatures of themselves, such as Slater, Kenny Loggins, and the late Anthony Bourdain and Burt Reynolds.\r\nArcher cast members record their lines individually rather than at group recording sessions to accommodate their work schedules. The producers therefore do not host table reads or rehearsals. Reed or another producer may be present at a session, or direct actors over the phone in the event they are not together. Recording sessions can take place anywhere, but are typically held at studios in Atlanta, Los Angeles, and New York, depending on the actor's home base.\r\nReception\r\nReviews\r\nArcher has been well received by the media. A number of TV critics have complimented the work of the voice actors, often singling out Benjamin for further praise: Tim Goodman from The Hollywood Reporter, for example, viewed Benjamin's acting as the bedrock of Archer, \"mixing rants, mumbling, whining and a stop-and-start delivery style that is note-perfect for comedy.\" Other reviewers cited the writing, the crude sensibility, and characterization among the show's most satisfying attributes: the main characters have been described as \"exceedingly well-defined.\" Chris Barton of the Los Angeles Times called Archer \"the smartest, strangest animated show on TV this side of Rick and Morty,\" and Entertainment Weekly journalist Ken Tucker praised the series for its \"solid plotting, vividly distinct characters, and some of the most unexpected punchlines and sight-gags in prime time.\"\r\nArcher's artistic reinvention is a principal topic of discussion among critics. Some journalists felt these arcs provide the show greater creative license to explore deeper within itself. While the comedy received positive feedback for staying true to form \"in the service of something much grimier and at once totally fresh\" in early seasons, later Archer episodes have been subjected to criticism as the tone and emphasis of the show evolves. By the eighth and ninth seasons, some critics believed that despite having greater visual appeal, Archer too often sacrifices narrative continuity and humor through increasingly predictable and uninspired writing.\r\nThe series has been included on a number of best of lists. TV Guide ranked Archer among the 60 greatest TV cartoons of all time, and the show placed within the top ten on Entertainment Weekly's 25 Greatest Animated TV Series. Similarly, The New Yorker, in a non-ranked rundown of 2014's most noteworthy programs, called Archer \"good counter-programming for every horrible thing in the news.\"\r\nAccolades\r\nRelated media\r\nVideo games\r\nIn September 2022, Archer characters would end up being playable characters in a card-based crossover game Animation Throwdown: The Quest for Cards, along with characters from Family Guy, Futurama, American Dad!, Bob's Burgers and King of the Hill.\r\nCompanion books\r\nSeveral companion books have been published by HarperCollins' imprint It Books:\r\nHow to Archer: The Ultimate Guide to Espionage and Style and Women and Also Cocktails Ever Written (January 2012, ISBN 9780062066312), the fictional how-to guide of the daily life of Sterling Archer.\r\nArcher and Bob's Burgers: The Untold History of Television (August 2015, ISBN 1443444219) by Kathleen Olmstead, with information about the actors and production crew, the show's conception, and episode analyses.\r\nThe Art of Archer (December 2016, ISBN 0062484133) by Neal Holman, with a foreword by Christian Slater. The book contains commentary on Archer's creative development, concept art, cast interviews, script excerpts, and the original pitch for the series.\r\nTour\r\nArcher's success spurred a nationwide tour, Archer Live!, wherein actors reimagined scenes from the show's repertoire. The initial leg commenced with shows in Los Angeles, San Francisco, Philadelphia, and New York. Sporadic dates were later added to the itinerary. Live readings may also be held at promotional events such as the San Diego Comic-Con International.\r\nAlbum\r\nFX released Cherlene (Songs from the Series Archer), a compilation of country music, on March 3, 2014, through digital media. The album features a cover of \"Danger Zone\", with guest vocals by Kenny Loggins, as well as three original tracks composed by Aaron Lee Tasjan. Kevn Kinney, frontman of Drivin N Cryin, led music production of Cherlene. Kinney had met Adam Reed a decade earlier, and was hired after a lunch meeting with the writer and Matt Thompson in Atlanta. In preparation for his services, Kinney viewed Archer's first three seasons to familiarize himself with Cheryl Tunt—the eponymous character of Cherlene. The album was recorded at Griffin Mastering, Inc. with a group that included Tasjan, David Franklin, and Drivin N Cryin member Dave V. Johnson on instrumentation. Jessy Lynn Martens provided Cheryl's singing voice, chosen because of her subdued Southern accent and likeness to Judy Greer's voice. Cherlene received positive reviews and peaked at number 68 on iTunes' best-selling albums chart.\r\nProposed film\r\nIn June 2016, Thompson and Willis discussed the possibility of a feature-length Archer film with The Daily Beast. According to Thompson, this discussion happens \"once every two years\" among Reed and the producers, although work on the project would likely not begin until after the show ends. They cited Jon Hamm as their ideal choice of actor to portray Sterling if it is commissioned as a live-action adaptation.\r\nOther appearances\r\n\"Fugue and Riffs\", Archer's season four premiere, is a crossover episode with the Fox series Bob's Burgers, which also stars H. Jon Benjamin as the title character. It features a cameo of the Belcher family and Sterling, in a fugue state, assuming an identity identical to the main protagonist of Bob's Burgers. John Roberts reprises his role as Linda for the appearance. Reed devised the idea of a Bob's Burgers crossover because he was a fan of the series. According to H. Jon Benjamin, \"He asked me to ask Loren Bouchard, so I was the middle man. It went really smoothly. It was around a 15–20 second phone call—then they turned it over to hundreds of thousands of lawyers.\" Archer also partook in a brief, high octane comedy skit for the late-night talk show Conan.\r\nThe characters of Archer have appeared in other media as part of broad marketing campaigns for the show. Sports Illustrated Swimsuit Issue featured Lana, Cheryl, and Pam in a spread for their March 2016 issue to promote the seventh season, while a 2014 Esquire advertisement showcases Sterling in ready-to-wear from Ermenegildo Zegna and Saint Laurent. Similarly, to promote Kingsman: The Golden Circle (2017), Fox released an animated short film featuring Sterling's encounter with Eggsy Unwin.\r\nSeason 6 and 7 each featured an intricate online \"scavenger hunt\" triggered by the creators using URLs and other clues hidden in the episodes, with both seasons winning the Primetime Emmy Award for Outstanding Interactive Program for this side project. Season 8 was accompanied by an augmented reality mobile phone app featuring a separate case for the user to solve using clues embedded in the episodes and only accessible by viewing through the phone's camera, which won two Clio Awards.\r\nHome media",
    "html": "<p>Archer is an American adult animated sitcom created by Adam Reed for FX which premiered on September 17, 2009. The show follows the exploits of a dysfunctional intelligence agency, centered on Sterling Archer (voiced by H. Jon Benjamin) and seven of his colleagues: his mother and boss Malory Archer (Jessica Walter), Lana Kane (Aisha Tyler), Cyril Figgis (Chris Parnell), Cheryl Tunt (Judy Greer), Pam Poovey (Amber Nash), Ray Gillette (Adam Reed) and Dr. Algernop Krieger (Lucky Yates). The show is set in an anachronistic, Cold War–esque universe and parodies espionage, culture and society, and the human condition. Archer is distinguished by artistic reinvention in contemporary episodes, foregoing the standard setup of a workplace sitcom for self-contained anthologies. It returned to its spy parody roots after the tenth season.</p><p>Reed conceived Archer shortly after the cancellation of his Adult Swim comedy Frisky Dingo. His experience vacationing in Spain with the influence of media franchises such as the James Bond series shaped his vision of the show. Some of the hallmarks include humor with many pop-culture references, rapid-fire dialogue, and meta-comedy. Archer is produced in a limited animation style that draws visually from mid-twentieth-century comic art. Actors record their lines individually, and the show regularly employs a recurring cast for supporting roles. Archer moved to FX's sibling network FXX in 2017, and the thirteenth season premiered on August 24, 2022. The fourteenth season, which will also be its final season, will premiere on August 30, 2023.</p><p>Archer has received positive reviews from critics and won awards, including four Primetime Emmy Awards and four Critics Choice Awards. It has also received 15 Annie Award nominations, among others, for outstanding achievement in animation, writing, direction, and voice acting. Various forms of licensed media have been spawned or proposed as a result of the show's sustained success.</p><br/><h3>Characters and settings</h3><p>Archer follows the exploits of eight dysfunctional secret agents and supporting staff of the International Secret Intelligence Service (ISIS), a fictional New York–based intelligence agency. The group consists of Sterling Archer, the show's narcissistic, womanizing protagonist; Malory Archer, a retired agent, now ISIS director, and Sterling's snarky, emotionally distant mother; Lana Kane, Sterling's love interest and mother of his daughter, and by far the most professional field agent at ISIS; Ray Gillette, the agency's openly gay bomb specialist; Pam Poovey, the head of the agency's human resources department who is often ridiculed by her peers; Cyril Figgis, a mild-mannered accountant-turned-agent; Cheryl Tunt, Malory's delusional, psychotic personal assistant; and Dr. Algernop Krieger, a bizarre, morally bankrupt scientist with little regard for the well-being of his test subjects.</p><p>The show features an array of supporting characters, several of whom gained expanded roles in subsequent episodes. Major supporting roles in Archer include Slater, an arms dealer and agent for the CIA; Katya Kazanova, head of the KGB and Sterling's former love interest; and Barry Dylan, Sterling's nemesis who, after seeking redemption, becomes his friend.</p><p>Events in Archer's early seasons transpire in an anachronistic, Cold War–esque universe. By proxy, the real time history is frequently referenced, though the comedy's timeline is intentionally vague. This method allowed producers the discretion to source elements they felt best fit the in-canon universe. In the show's more contemporary episodes, Archer eschews its spy comedy roots to advance Sterling's character arc. Each season has a unique mythology of events that highlights the group's incompetence, where they are forced to undertake a series of strange tasks in highly unusual circumstances. The main storyline climaxes when Sterling falls into a coma. From seasons eight to ten, Archer is reimagined in three self-contained universes, coinciding with a deeper exploration of Sterling's psyche.</p><br/><h3>Seasons</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"3\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th><th scope=\"col\" style=\"padding:0 8px\">Network</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 17, 2009</td><td style=\"padding:0 8px\">March 18, 2010</td><td rowspan=\"7\"><span>FX</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 27, 2011</td><td style=\"padding:0 8px\">April 21, 2011</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 15, 2011</td><td style=\"padding:0 8px\">March 22, 2012</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 17, 2013</td><td style=\"padding:0 8px\">April 11, 2013</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 13, 2014</td><td style=\"padding:0 8px\">April 21, 2014</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 8, 2015</td><td style=\"padding:0 8px\">April 2, 2015</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>7</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 31, 2016</td><td style=\"padding:0 8px\">June 2, 2016</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>8</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 5, 2017</td><td style=\"padding:0 8px\">May 24, 2017</td><td rowspan=\"7\"><span>FXX</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>9</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 25, 2018</td><td style=\"padding:0 8px\">June 13, 2018</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>10</span></span></span></span></th><td colspan=\"2\">9</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">May 29, 2019</td><td style=\"padding:0 8px\">July 31, 2019</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>11</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 16, 2020</td><td style=\"padding:0 8px\">October 28, 2020</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>12</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">August 25, 2021</td><td style=\"padding:0 8px\">October 6, 2021</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>13</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">August 24, 2022</td><td style=\"padding:0 8px\">October 12, 2022</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>14</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">August 30, 2023</td><td style=\"padding:0 8px\">October 18, 2023</td></tr></tbody></table><h4>Syndication and streaming</h4><p>The cable television network Comedy Central previously owned exclusive US broadcast syndication rights for Archer. Comedy Central began airing the series on their network on March 2, 2015, in one-hour program time slots. In Canada, the show is syndicated nationally on Adult Swim (previously Teletoon's Teletoon at Night block from 2010 to 2019), and new episodes are aired in tandem with the American broadcast. Endemol Shine International distributes Archer internationally.</p><p>In 2014, Amazon Prime Video and Hulu purchased online streaming rights to Archer as part of multiyear licensing agreements with 20th Television. Beginning in 2018, Hulu retains exclusive streaming rights to the show in the US via a new licensing agreement with 20th Century Fox.</p><br/><h3>Production</h3><h4>Development</h4><p>Before the creation of Archer, Adam Reed worked on animated comedies with executive producer and longtime collaborator Matt Thompson. The pair later became renowned for their work on a number of Adult Swim television projects, chiefly Sealab 2021 and their follow-up Frisky Dingo, which aired for several years. After the cancellation of Frisky Dingo in 2008, Reed took a vacation to Spain to brainstorm ideas for a new project. His experience traversing the Vía de la Plata, and people-watching in Plaza Mayor in nearby Salamanca, enabled him to conceptualize his vision of Archer. Reed recalled in an interview, \"So I sat on the Plaza Mayor for three days—drinking either coffee or beer or gin, depending on the time of day—surrounded by these Spanish women who seemed both unaware and completely aware of their beauty. Occasionally they would glance over—and catch me gaping at them—and just smile at me like, 'I know, right?' And for three days, I couldn't even splutter 'Buenos dias' to any of them—not once. And thus was Sterling Archer born—he would've absolutely sauntered over to a table full of those women and sat down and ordered an entire case of cava or whatever.\" Nevertheless, he believed developing a sitcom with the theme of global espionage was inevitable given his proclivity for adventure-driven comedy. The James Bond franchise, OSS 117: Cairo, Nest of Spies (2006), and The Pink Panther franchise were Reed's inspiration as the series, then under the working title Duchess, began taking definite form.</p><p>By August 18, 2009, following Reed's pitch to FX, the network commissioned six episodes for Archer. FX initially commissioned the project as a companion series for their situational comedy It's Always Sunny in Philadelphia, but the network ultimately delayed Archer's premiere to the following January because of the demanding production schedule, and The League became Philadelphia's companion show instead. Despite this, the pilot, \"Mole Hunt\", aired as a test screening on September 17, 2009, following the season five premiere of Philadelphia. The pilot was not featured in program listings or otherwise promoted by FX; rather the network merely informed select television critics of the broadcast.</p><p>FX moved Archer to FXX's broadcast lineup in 2017 as part of an aggressive strategy to increase the network's output of animated programming. FX had planned the move before the show's seventh season, in conjunction with the debut of Cassius and Clay, but momentarily dropped their endeavor after Clay's abrupt cancellation. FXX renewed Archer for a twelfth season, which premiered on August 25, 2021. On September 28, 2021, FXX renewed the series for a thirteenth season, which premiered on August 24, 2022. The 14th and final season of Archer is scheduled to premiere on August 30, 2023.</p><h4>Writing</h4><p>Scriptwriting an episode consumes three weeks of the production schedule. As the comedy's main writer, Reed typically creates the first draft during pre-production, which he submits to his team of producers and art directors. From there, they analyze the script for each character, cast guest stars, and create basic concept designs, before Reed develops a final script to submit to FXX. The extent of Reed's oversight diminished when FXX expanded Thompson and executive producer Casey Willis' creative responsibilities for new episodes. Starting in season 11, Reed no longer writes the episodes. A typical Archer episode goes through 2 pages of dialogue per minute, doubling a typical sitcom.</p><p>Early Archer episodes are framed with the standard setup of a workplace comedy, defined by raunchy, reference-heavy humor, rapid-fire dialogue, and interaction-based drama. They parody spy film and routinely mock clichés of the genre. By the end of the fourth season, however, Reed questioned the longevity of the comedy's spy premise and began contemplating a new direction for Archer, impelled by the then-growing associations of ISIS with the identically initialled jihadist group. Late season episodes experiment with the standard format of an anthology, each with self-contained mythologies of arcs, settings, humor, and personas. Reed said, \"Once we started making them, and having a good time making them, 'what are some other things we can do now that the boundaries have sort of been passed?'\"</p><p>Cultural references on Archer cover a wide spectrum of society and the human condition, in film, literature and music for example. Some, chiefly references to literature, are obscure, and the audience often may not notice them in a single viewing. Reed cites his time as a university English major as the primary forebear for the show's literary references. Archer also develops a unique self-referentiality through character-based jokes, catchphrases, and running gags that evolve over multiple episodes. For example, Sterling or another character may yell \"phrasing\" in response to any sexually suggestive remark. Neil Genzlinger of The New York Times argues that Archer uses \"a caustic brand of humor that isn't for everybody but that has brought the show a dedicated fan base.\"</p><h4>Animation</h4><p>Archer's animation style mirrors the aesthetic of Mad Men and mid-twentieth century comic art in the style of Jack Kirby and Steve Ditko, among others. Line work is pronounced by thick, bold outlines, in contrast to the very fine, thin line work characteristic of prime time comedies such as The Simpsons and Family Guy. Production of the comedy involves a workforce of 150 specialized artists from Reed and Thompson's Atlanta-based company Floyd County Productions, quadruple the workforce that oversaw its freshman season.</p><p>Archer's production process uses Adobe software—Photoshop, Illustrator, and After Effects—as well as visual effects programs such as Toon Boom Harmony and Cinema 4D for compositing and animation. This begins with storyboarding, typically after a script has been approved, and lasts around 11–13 weeks per episode. Four episodes are produced in tandem at any given session, generally in staggered phases. In the initial stages of animation, art director Chad Hurd and producer Neal Holman storyboard set pieces with a team of artists based on specifications in the script. After a series of design revisions and reviews, these skeletal designs are then rendered as 3D models in Autodesk 3ds Max, employing a variety of animation and special effects techniques. The illustration team takes various screenshots of the 3D models once they have been completed, and the resulting images are enhanced by specialized artists in After Effects.</p><p>The characters are composed in Illustrator using referential material, among them photos of models and actors in costume. Because Archer is produced using limited animation, characters are rendered as digital puppets, and not hand-drawn on paper and digitally composited for traditional cel animation. Costumes may or may not be reproduced depending on their animatability; too much detail can hurt a character's animatability. These body pieces are then separated into basic components and layers, much like an action figure, and rigged in After Effects. Consequently, one given pose can turn into a range of others, which, according to producer Bryan Fordney, creates \"the illusion of more animation on screen than what is actually present.\" A similar technique is used in the animation of a character's face—head illustrations are divided into basic components that can be turned \"off\" and \"on\" in sequence, lending the appearance of facial movement and expression.</p><p>Once compositing begins, compositors enhance the visual palette of artwork from three or four departments until it \"looks like it was made by a single artist.\" For elaborate scenes like action sequences, artists develop several composites, which are then superimposed on stock footage using special effects.</p><h4>Title sequence and music</h4><p>Holman cited Catch Me If You Can (2002), The Incredibles (2004), Kiss Kiss Bang Bang (2005), and the work of Saul Bass as strong stylistic influences in the creation of Archer's title sequence. When he was developing the original sequence, the rough draft version consisted of style frames with roiling flame silhouettes of the characters coalesced on a charred, black background. The crew initially struggled to develop an opening theme they believed was compatible with the premise of Archer, but once the show's eponymous theme song had been completed, Holman felt his idea was too melodramatic and went in a different direction. He created the finalized version of the sequence from several segments, each reviewed by the producers, because of the demanding production schedule. The standard opening of Archer has gone through six iterations—a replacement of shots at the start of the show's sixth season, and brand new sequences for its fifth, seventh, eighth, ninth and tenth seasons.</p><p>Archer did not employ a composer to develop a soundtrack in its first four seasons, but instead used a compilation of needle drop stock music. By season five, musician JG Thirlwell was hired as the composer for the comedy's jazz-influenced score, brought to the producers' attention for his work on The Venture Bros.</p><h4>Voice actors</h4><p>Archer has a principal cast of seven actors: H. Jon Benjamin, Jessica Walter, Aisha Tyler, Judy Greer, Amber Nash, Chris Parnell and Lucky Yates. Benjamin voices the show's titular character, Walter voiced Malory until her death in 2021, Tyler plays Lana Kane, Greer portrays Cheryl Tunt, Nash plays Pam Poovey, Parnell voices Cyril Figgis, and Yates portrays Dr. Algernop Krieger. Additionally, series creator Adam Reed plays Ray Gillette. Reed was expected to play the titular role in the original pilot, but was re-cast because producers felt his voice-over did not service the character's dialogue well. When Benjamin received the offer, he was surprised since he did not believe his voice was suitable for the part. At one point, Benjamin used a British accent for the character, but Reed insisted he use his normal speaking voice.</p><p>Walter was the first significant casting choice on Archer. Producers contracted her shortly after they sent out character descriptions to talent agencies, and they promoted her involvement to recruit actors for the project. Greer agreed to Archer because of her wish to break into voice acting, although she initially believed the series was too provocative for network TV. Nash did not audition for her part; rather, the actress was approached by Reed and Thompson, whom she had previously collaborated with in Frisky Dingo, while she was recording DVD extras for their program. Yates was brought onto Archer at Nash's request, after Krieger was given a more prominent speaking role.</p><p>In addition to the main cast, episodes often feature guest voices from a range of professions. Major supporting roles in Archer are played by George Coe (until his death in 2015), Jeffrey Tambor, Christian Slater, Jon Hamm, Allison Tolman, Dave Willis, Ona Grauer, Keegan-Michael Key, Bryan Cranston, J.K. Simmons, and Simon Pegg, among others. Some stars appear as themselves, or portray fictionalized caricatures of themselves, such as Slater, Kenny Loggins, and the late Anthony Bourdain and Burt Reynolds.</p><p>Archer cast members record their lines individually rather than at group recording sessions to accommodate their work schedules. The producers therefore do not host table reads or rehearsals. Reed or another producer may be present at a session, or direct actors over the phone in the event they are not together. Recording sessions can take place anywhere, but are typically held at studios in Atlanta, Los Angeles, and New York, depending on the actor's home base.</p><br/><h3>Reception</h3><h4>Reviews</h4><p>Archer has been well received by the media. A number of TV critics have complimented the work of the voice actors, often singling out Benjamin for further praise: Tim Goodman from The Hollywood Reporter, for example, viewed Benjamin's acting as the bedrock of Archer, \"mixing rants, mumbling, whining and a stop-and-start delivery style that is note-perfect for comedy.\" Other reviewers cited the writing, the crude sensibility, and characterization among the show's most satisfying attributes: the main characters have been described as \"exceedingly well-defined.\" Chris Barton of the Los Angeles Times called Archer \"the smartest, strangest animated show on TV this side of Rick and Morty,\" and Entertainment Weekly journalist Ken Tucker praised the series for its \"solid plotting, vividly distinct characters, and some of the most unexpected punchlines and sight-gags in prime time.\"</p><p>Archer's artistic reinvention is a principal topic of discussion among critics. Some journalists felt these arcs provide the show greater creative license to explore deeper within itself. While the comedy received positive feedback for staying true to form \"in the service of something much grimier and at once totally fresh\" in early seasons, later Archer episodes have been subjected to criticism as the tone and emphasis of the show evolves. By the eighth and ninth seasons, some critics believed that despite having greater visual appeal, Archer too often sacrifices narrative continuity and humor through increasingly predictable and uninspired writing.</p><p>The series has been included on a number of best of lists. TV Guide ranked Archer among the 60 greatest TV cartoons of all time, and the show placed within the top ten on Entertainment Weekly's 25 Greatest Animated TV Series. Similarly, The New Yorker, in a non-ranked rundown of 2014's most noteworthy programs, called Archer \"good counter-programming for every horrible thing in the news.\"</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Year</th><th scope=\"col\">Award</th><th scope=\"col\">Category</th><th scope=\"col\">Nominee</th><th scope=\"col\">Result</th></tr><tr><td rowspan=\"2\">2010</td><td><span>Primetime Emmy Awards</span></td><td><span>Outstanding Voice-over Performance</span></td><td><span>H. Jon Benjamin</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>NewNowNext Awards</span></td><td>Best Show You're Not Watching</td><td><i>Archer</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\">2011</td><td><span>Annie Awards</span></td><td>Best General Audience Animated TV/Broadcast Production</td><td><i>Archer</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Critics' Choice Television Awards</span></td><td><span>Best Comedy Series</span></td><td><i>Archer</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"7\">2012</td><td rowspan=\"5\"><span>Annie Awards</span></td><td>Best General Audience Animated TV/Broadcast Production</td><td><i>Archer</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Character Design in a Television Production</td><td>Chad Hurd</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\">Voice Acting in a Television Production</td><td>H. Jon Benjamim</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Judy Greer</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Jessica Walter</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Comedy Awards</span></td><td>Best Animated Comedy Series</td><td><i>Archer</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Critics' Choice Television Awards</span></td><td><span>Best Animated Series</span></td><td><i>Archer</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\">2013</td><td rowspan=\"2\"><span>Annie Awards</span></td><td>Best General Audience Animated TV/Broadcast Production</td><td><i>Archer</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Voice Acting in an Animated Television or Other Broadcast Venue Production</td><td>Jessica Walter</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Critics' Choice Television Awards</span></td><td>Best Animated Series</td><td><i>Archer</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"5\">2014</td><td rowspan=\"2\"><span>Annie Awards</span></td><td>Best General Audience Animated TV/Broadcast Production</td><td><i>Archer</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Achievement in Storyboarding in an Animated TV/Broadcast Production</td><td>Adam Ford, et al.</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Critics' Choice Television Awards</span></td><td>Best Animated Series</td><td><i>Archer</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Primetime Emmy Awards</span></td><td><span>Outstanding Animated Program</span></td><td>For \"Archer Vice: The Rules Of Extraction\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>NAACP Image Awards</span></td><td><span>Outstanding Actress in a Comedy Series</span></td><td><span>Aisha Tyler</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"5\">2015</td><td rowspan=\"2\"><span>Annie Awards</span></td><td>Best General Audience Animated TV/Broadcast Production</td><td><i>Archer</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Achievement in Directing in an Animated TV/Broadcast Production</td><td>Bryan Fordney</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Critics' Choice Television Awards</span></td><td>Best Animated Series</td><td><i>Archer</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Primetime Emmy Awards</span></td><td>Outstanding Animated Program</td><td>\"Pocket Listing\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Creative Achievement in Interactive Media – Multiplatform Storytelling</span></td><td>Mark Paterson &amp; Tim Farrell for \"Archer Scavenger Hunt\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\">2016</td><td><span>Annie Awards</span></td><td>Outstanding Achievement in Directing in an Animated TV/Broadcast Production</td><td>Bryan Fordney</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Primetime Emmy Awards</span></td><td>Outstanding Animated Program</td><td>\"The Figgis Agency\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Creative Achievement in Interactive Media – Multiplatform Storytelling</td><td>Mark Paterson, Tim Farrell, &amp; Bryan Fordney for \"Archer Scavenger Hunt 2\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>2017</td><td><span>Primetime Emmy Awards</span></td><td>Outstanding Animated Program</td><td>\"Archer Dreamland: No Good Deed\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\">2018</td><td><span>Annie Awards</span></td><td>Outstanding Achievement for Writing in an Animated Television/Broadcast Production</td><td>Adam Reed</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Critics' Choice Television Awards</span></td><td>Best Animated Series</td><td><i>Archer</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Webby Awards</span></td><td>Best Use of Augmented Reality</td><td><i>Archer, P.I. App</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Saturn Awards</span></td><td>Best Animated Series or Film on Television</td><td><i>Archer</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>2020</td><td><span>Primetime Emmy Awards</span></td><td><span>Outstanding Individual Achievement in Animation</span></td><td>\"Road Trip\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\">2021</td><td rowspan=\"4\"><span>Critics' Choice Super Awards</span></td><td>Best Animated Series</td><td><i>Archer</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Voice Actor in an Animated Series</td><td>H. Jon Benjamin</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\">Best Voice Actress in an Animated Series</td><td>Aisha Tyler</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Jessica Walter</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\">2022</td><td><span>Hollywood Critics Association TV Awards</span></td><td>Best Broadcast Network or Cable Animated Series or Television Movie</td><td><i>Archer</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Primetime Creative Arts Emmy Awards</span></td><td>Outstanding Character Voice-Over Performance</td><td>Jessica Walter</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><br/><h3>Related media</h3><h4>Video games</h4><p>In September 2022, Archer characters would end up being playable characters in a card-based crossover game Animation Throwdown: The Quest for Cards, along with characters from Family Guy, Futurama, American Dad!, Bob's Burgers and King of the Hill.</p><h4>Companion books</h4><p>Several companion books have been published by HarperCollins' imprint It Books:</p><ul><li>How to Archer: The Ultimate Guide to Espionage and Style and Women and Also Cocktails Ever Written (January 2012, ISBN 9780062066312), the fictional how-to guide of the daily life of Sterling Archer.</li><li>Archer and Bob's Burgers: The Untold History of Television (August 2015, ISBN 1443444219) by Kathleen Olmstead, with information about the actors and production crew, the show's conception, and episode analyses.</li><li>The Art of Archer (December 2016, ISBN 0062484133) by Neal Holman, with a foreword by Christian Slater. The book contains commentary on Archer's creative development, concept art, cast interviews, script excerpts, and the original pitch for the series.</li></ul><h4>Tour</h4><p>Archer's success spurred a nationwide tour, Archer Live!, wherein actors reimagined scenes from the show's repertoire. The initial leg commenced with shows in Los Angeles, San Francisco, Philadelphia, and New York. Sporadic dates were later added to the itinerary. Live readings may also be held at promotional events such as the San Diego Comic-Con International.</p><h4>Album</h4><p>FX released Cherlene (Songs from the Series Archer), a compilation of country music, on March 3, 2014, through digital media. The album features a cover of \"Danger Zone\", with guest vocals by Kenny Loggins, as well as three original tracks composed by Aaron Lee Tasjan. Kevn Kinney, frontman of Drivin N Cryin, led music production of Cherlene. Kinney had met Adam Reed a decade earlier, and was hired after a lunch meeting with the writer and Matt Thompson in Atlanta. In preparation for his services, Kinney viewed Archer's first three seasons to familiarize himself with Cheryl Tunt—the eponymous character of Cherlene. The album was recorded at Griffin Mastering, Inc. with a group that included Tasjan, David Franklin, and Drivin N Cryin member Dave V. Johnson on instrumentation. Jessy Lynn Martens provided Cheryl's singing voice, chosen because of her subdued Southern accent and likeness to Judy Greer's voice. Cherlene received positive reviews and peaked at number 68 on iTunes' best-selling albums chart.</p><h4>Proposed film</h4><p>In June 2016, Thompson and Willis discussed the possibility of a feature-length Archer film with The Daily Beast. According to Thompson, this discussion happens \"once every two years\" among Reed and the producers, although work on the project would likely not begin until after the show ends. They cited Jon Hamm as their ideal choice of actor to portray Sterling if it is commissioned as a live-action adaptation.</p><h4>Other appearances</h4><p>\"Fugue and Riffs\", Archer's season four premiere, is a crossover episode with the Fox series Bob's Burgers, which also stars H. Jon Benjamin as the title character. It features a cameo of the Belcher family and Sterling, in a fugue state, assuming an identity identical to the main protagonist of Bob's Burgers. John Roberts reprises his role as Linda for the appearance. Reed devised the idea of a Bob's Burgers crossover because he was a fan of the series. According to H. Jon Benjamin, \"He asked me to ask Loren Bouchard, so I was the middle man. It went really smoothly. It was around a 15–20 second phone call—then they turned it over to hundreds of thousands of lawyers.\" Archer also partook in a brief, high octane comedy skit for the late-night talk show Conan.</p><p>The characters of Archer have appeared in other media as part of broad marketing campaigns for the show. Sports Illustrated Swimsuit Issue featured Lana, Cheryl, and Pam in a spread for their March 2016 issue to promote the seventh season, while a 2014 Esquire advertisement showcases Sterling in ready-to-wear from Ermenegildo Zegna and Saint Laurent. Similarly, to promote Kingsman: The Golden Circle (2017), Fox released an animated short film featuring Sterling's encounter with Eggsy Unwin.</p><p>Season 6 and 7 each featured an intricate online \"scavenger hunt\" triggered by the creators using URLs and other clues hidden in the episodes, with both seasons winning the Primetime Emmy Award for Outstanding Interactive Program for this side project. Season 8 was accompanied by an augmented reality mobile phone app featuring a separate case for the user to solve using clues embedded in the episodes and only accessible by viewing through the phone's camera, which won two Clio Awards.</p><br/><h3>Home media</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><span>DVD</span> and <span>Blu-ray</span> release dates by <span>DVD region code</span></caption><tbody><tr><th colspan=\"2\">Season</th><th>Region 1</th><th>Region 2</th><th>Region 4</th></tr><tr><td style=\"background: #000000;\"></td><td><span>1</span></td><td style=\"padding: 0 8px;\">December 28, 2010 (DVD)<br> December 27, 2011 (Blu-ray)</td><td style=\"padding: 0 8px;\">May 2, 2011</td><td style=\"padding: 0 8px;\">March 2, 2011</td></tr><tr><td style=\"background: #303A6D;\"></td><td><span>2</span></td><td style=\"padding: 0 8px;\">December 27, 2011</td><td style=\"padding: 0 8px;\">May 7, 2012</td><td style=\"padding: 0 8px;\">February 29, 2012</td></tr><tr><td style=\"background: #66b0d9;\"></td><td><span>3</span></td><td style=\"padding: 0 8px;\">January 8, 2013</td><td style=\"padding: 0 8px;\">July 1, 2013</td><td style=\"padding: 0 8px;\">March 13, 2013</td></tr><tr><td style=\"background: #C3DAE6;\"></td><td><span>4</span></td><td style=\"padding: 0 8px;\">January 7, 2014</td><td style=\"padding: 0 8px;\">N/A</td><td style=\"padding: 0 8px;\">February 5, 2014</td></tr><tr><td style=\"background: #FF52AF;\"></td><td><span>5</span></td><td style=\"padding: 0 8px;\">January 6, 2015</td><td style=\"padding: 0 8px;\">N/A</td><td style=\"padding: 0 8px;\">February 2, 2015</td></tr><tr><td style=\"background: #536878;\"></td><td><span>6</span></td><td style=\"padding: 0 8px;\">March 29, 2016</td><td style=\"padding: 0 8px;\">N/A</td><td style=\"padding: 0 8px;\">February 17, 2016</td></tr><tr><td style=\"background: #F5DEB3;\"></td><td><span>7</span></td><td style=\"padding: 0 8px;\">March 28, 2017</td><td style=\"padding: 0 8px;\">N/A</td><td style=\"padding: 0 8px;\">February 15, 2017</td></tr><tr><td style=\"background: #879FA1;\"></td><td><span>8</span></td><td style=\"padding: 0 8px;\">March 20, 2018</td><td style=\"padding: 0 8px;\">N/A</td><td style=\"padding: 0 8px;\">November 8, 2017</td></tr><tr><th></th><td><span>9</span></td><td>April 2, 2019</td><td>N/A</td><td>February 6, 2019</td></tr><tr><th></th><td><span>10</span></td><td>N/A</td><td>N/A</td><td>N/A</td></tr><tr><th></th><td><span>11</span></td><td>N/A</td><td>N/A</td><td>N/A</td></tr><tr><th></th><td><span>12</span></td><td>N/A</td><td>N/A</td><td>N/A</td></tr><tr><th></th><td><span>13</span></td><td>N/A</td><td>N/A</td><td>N/A</td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}