{
  "imDbId": "tt10048342",
  "title": "The Queen's Gambit",
  "fullTitle": "The Queen's Gambit (TV Series 2020–2020)",
  "type": "TVSeries",
  "year": "2020",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8577104",
      "warningSpoilers": false,
      "date": "30 September 2022",
      "rate": "8",
      "helpful": "50 out of 52 found this helpful.",
      "title": "Surprised by how much I liked this!",
      "content": "I was absolutely blown away by how good The Queen's Gambit was! The only reason I actually started watching it was because of all the great ratings/reviews and I'm glad I did because it was such an entertaining series. It's set during the Cold War era and follows orphaned chess prodigy Beth Harmon (Anya Taylor-Joy) as she struggles with addiction in her quest to become the greatest chess player in the entire world. Taylor-Joy has been a rising star for the last few years but she breaks out here as she was just absolutely terrific as the lead. She's now one of the hottest young actresses in Hollywood. This ended up winning an Emmy for most Outstanding Limited Series."
    },
    {
      "username": "RogerBorg",
      "userUrl": "https://www.imdb.com/user/ur0637715",
      "reviewLink": "https://www.imdb.com/review/rw8016730",
      "warningSpoilers": false,
      "date": "29 March 2022",
      "rate": "9",
      "helpful": "20 out of 20 found this helpful.",
      "title": "Isla Johnston is the unsung heroine of this piece",
      "content": "Yes, yes, Anya Taylor-Joy and those eyes. But let's acknowledge that the astonishing Isla Johnston carries the first few episodes with an equally compelling performance, far beyond her years.The handover from Isla to Anya is almost seamless, which is quite remarkable when we consider the intensity of the character. That an actor of this Johston's age could have pulled that off is extraordinary."
    },
    {
      "username": "ccrisss",
      "userUrl": "https://www.imdb.com/user/ur48462454",
      "reviewLink": "https://www.imdb.com/review/rw6202416",
      "warningSpoilers": false,
      "date": "24 October 2020",
      "rate": "10",
      "helpful": "504 out of 574 found this helpful.",
      "title": "Beautiful. Just Beautiful.",
      "content": "Watched it all in one night. I didn't think a story about chess would keep me interested. But this one got me deeply invested. Because this is not just about the game of chess, it's so much more.Ultimately, what I cared about wasn't just the game anymore, it was the person. I was rooting for her. I really cared what would happen to her and that's probably the most essential thing for me when watching any tv series.What made me attached to this character was how I saw her grow up from a little orphan girl, witnessing her from the first chess game all the way to the end and everything in between. I was enthralled, inspired, moved, proud. Had me in tears too. Excellent cast, story, cinematography, writing, everything. Thank you for this. Thank you."
    },
    {
      "username": "dangerousground-274-208413",
      "userUrl": "https://www.imdb.com/user/ur30856803",
      "reviewLink": "https://www.imdb.com/review/rw6202506",
      "warningSpoilers": false,
      "date": "24 October 2020",
      "rate": "10",
      "helpful": "706 out of 815 found this helpful.",
      "title": "Masterpiece",
      "content": "This is not the typical type of show that I would usually watch but I'm so glad I did. It's so unique and different that it's difficult to put into words. If you're thinking of watching this show, just do it, you won't be disappointed."
    },
    {
      "username": "anacasaux",
      "userUrl": "https://www.imdb.com/user/ur59804772",
      "reviewLink": "https://www.imdb.com/review/rw6208113",
      "warningSpoilers": false,
      "date": "26 October 2020",
      "rate": "9",
      "helpful": "2,084 out of 2,222 found this helpful.",
      "title": "Don't start this series late at night!",
      "content": "You'll end up like me, binge watching it until 5 AM (and I don't even know anything about chess). Very well written, directed and acted."
    },
    {
      "username": "phdcore",
      "userUrl": "https://www.imdb.com/user/ur103123837",
      "reviewLink": "https://www.imdb.com/review/rw6257515",
      "warningSpoilers": true,
      "date": "11 November 2020",
      "rate": "9",
      "helpful": "384 out of 420 found this helpful.",
      "title": "Mr Shaibel the main role",
      "content": "He did deserve more. But having never received it, made for a very emotional, powerful scene when Beth returned. That scene and that emotion would not have been possible if Mr. Shaibel had gotten what he deserved throughout the series. There were a few simple but powerful scenes with Mr. Shaibel that hit me really hard. When young Beth begged him to help her after she was punished and he couldn't even respond to her because he was so ashamed he didn't have the power to help her. When she drove away in the car after being adopted and he couldn't even wave goodbye to her... you could literally feel his grief without him even saying a word. When she walked down to the basement to see his old room and looked down at the table where he first taught her to play, that was hard enough. But when she looked over at the clippings he kept on his wall of her... that was just too much. Hard to keep your eyes dry watching that scene. This story was written with the purpose of having the reader or watcher, identify with Beth. But I think for a lot of us, we identified with Mr. Shaibel."
    },
    {
      "username": "anileoyoseliani",
      "userUrl": "https://www.imdb.com/user/ur83629134",
      "reviewLink": "https://www.imdb.com/review/rw6204640",
      "warningSpoilers": false,
      "date": "25 October 2020",
      "rate": "10",
      "helpful": "813 out of 904 found this helpful.",
      "title": "I Resign",
      "content": "When you've seen everything on Netflix, a you will watch any new show they throw at you. I did not have high expectations. But I was so wrong. So wonderfully and totally wrong. We watched Queen's Gambit, all seven hours of it, in a single sitting. This show is an absolute gem. Remarkable acting by Anya Taylor-Joy who will be a force to be reckoned with, her child counterpart- an absolute marvel. The series is smart, it's inspiring at times, it's sad and heartbreaking at times. Who knew watching game-plays of simulated chess can make your heart pound out of your ears? Truly, a story of determination, friendship, self discovery, struggle and triumph. I don't know about you, but my ceiling will be covered in chess pieces tonight."
    },
    {
      "username": "bilgedeger",
      "userUrl": "https://www.imdb.com/user/ur113529881",
      "reviewLink": "https://www.imdb.com/review/rw6206614",
      "warningSpoilers": false,
      "date": "25 October 2020",
      "rate": "10",
      "helpful": "2,031 out of 2,168 found this helpful.",
      "title": "Best Netflix Original of 2020",
      "content": "The Queen's Gambit was a random find for me. I started watching it without any expectations but the first episode was just enough to keep me interested. As I kept watching, it kept getting better and I must say the 7th episode was one of the best finale to a series that I have ever watched. The character developments for even the minor characters were well-thought-out and I immediately formed an emotional connection with most of them. The finale was so well done that it almost felt like an end to a show with several seasons rather than a limited series. The show also had very good messages sprinkled in between, they were subtle and didn't make me feel like an agenda was being showed down my throat. The acting was marvelous. The cinematography was great with some very impressive scene transitions. The score was amazing and really set the atmosphere and the tone of the show. If you are reading this before watching the show, go ahead and watch it. You won't be disappointed."
    },
    {
      "username": "sav-83975",
      "userUrl": "https://www.imdb.com/user/ur98392271",
      "reviewLink": "https://www.imdb.com/review/rw6206741",
      "warningSpoilers": false,
      "date": "25 October 2020",
      "rate": "10",
      "helpful": "306 out of 365 found this helpful.",
      "title": "9's and 10's all around is what this deserves.",
      "content": "You will binge watch this like I did guaranteed. What an amazing 8 hour movie."
    },
    {
      "username": "bilesbrent",
      "userUrl": "https://www.imdb.com/user/ur79731062",
      "reviewLink": "https://www.imdb.com/review/rw6199394",
      "warningSpoilers": false,
      "date": "23 October 2020",
      "rate": "10",
      "helpful": "568 out of 651 found this helpful.",
      "title": "Outstanding production, Compelling story, Inner lives of the characters expertly laid bare.",
      "content": "Top to bottom, scenic design, wardrobe, direction and casting, this is a top notch production. The acting is seamless and the characters embody their roles perfectly.One couldn't hope for a more original or more compelling story. As you might expect from the title, Chess plays a central role, and the author's use of the game as an extended metaphor shifts in ways both nuanced and explosive. For any thinking person, this series is sure to delight.In my opinion, strong characterization always provides the best entertainment. The producers of \"The Queen's Gambit\" tackle the tough task of creating a compelling story from the inner lives of the characters. Granted, they are working from an excellent novel, but oftentimes, attempts to bring works that center around the mental, rather than the physical journey of the central character fail miserably. In this case, the producers deserve the highest praise. If you like thoughtful stories that expose the inner lives of the characters, don't miss this one.The show, while generally acceptable for children, contains several adult themes, so parental guidance is recommended."
    },
    {
      "username": "Georgefestws",
      "userUrl": "https://www.imdb.com/user/ur124965837",
      "reviewLink": "https://www.imdb.com/review/rw6198749",
      "warningSpoilers": false,
      "date": "23 October 2020",
      "rate": "10",
      "helpful": "651 out of 744 found this helpful.",
      "title": "Guarnteed to be an award winning show!",
      "content": "This TV Mini-series is excellent! It is wonderful to see Anya Taylor-Joy in a well crafted show. She shines brilliantly as Beth Harmon a chess playing prodigy. The story takes us from when she is a small girl, orphaned, continuing through her teenage angst years. I highly recommend this show. Great cinematography and directing and of course to get back to the acting - its top notch! I only wish there was more than 7 episodes."
    },
    {
      "username": "carlvan1977",
      "userUrl": "https://www.imdb.com/user/ur86220066",
      "reviewLink": "https://www.imdb.com/review/rw6229171",
      "warningSpoilers": false,
      "date": "2 November 2020",
      "rate": "10",
      "helpful": "171 out of 208 found this helpful.",
      "title": "Outstanding!",
      "content": "You know it's good when you don't care were your cellphone is."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw7031984",
      "warningSpoilers": false,
      "date": "15 June 2021",
      "rate": "8",
      "helpful": "26 out of 31 found this helpful.",
      "title": "Surprised by how much I enjoyed this!",
      "content": "I was absolutely blown away by how good The Queen's Gambit was! The only reason I actually started watching it was because of all the great ratings/reviews and I'm glad I did because it was such an entertaining series! Anya Taylor-Joy has been a rising star for the last few years but she breaks out here as she was just absolutely terrific as the lead. She's now one of the hottest young actresses in Hollywood!"
    },
    {
      "username": "bdasmith01",
      "userUrl": "https://www.imdb.com/user/ur55727155",
      "reviewLink": "https://www.imdb.com/review/rw6205597",
      "warningSpoilers": false,
      "date": "25 October 2020",
      "rate": "10",
      "helpful": "682 out of 773 found this helpful.",
      "title": "Well done!",
      "content": "Really enjoyed this series. One reviewer gave a low rating mentioning how the first episode showed her using pills in the orphanage....yes they had to as it shapes the rest of her future. The characters are great and the acting on is superb. Kept me hooked!"
    },
    {
      "username": "Xavier_Stone",
      "userUrl": "https://www.imdb.com/user/ur119082541",
      "reviewLink": "https://www.imdb.com/review/rw6210045",
      "warningSpoilers": false,
      "date": "27 October 2020",
      "rate": "9",
      "helpful": "67 out of 91 found this helpful.",
      "title": "As a chess player this movie is good even if you've never played the game",
      "content": "I've seen quite a bit of chess movies and this one is by far the best. It combines the quirks of being a savant at a game and the underlying issues that come along with it. Generally the game of championship chess is extremely boring as it usually takes 2 hours a game, regularly 10-20mins/move. This movie speeds all that up yet keeps things grounded and interesting.The acting is really good and it has enough drama and tension besides chess. I definite must watch"
    },
    {
      "username": "mbognar",
      "userUrl": "https://www.imdb.com/user/ur32755298",
      "reviewLink": "https://www.imdb.com/review/rw6208576",
      "warningSpoilers": false,
      "date": "26 October 2020",
      "rate": "10",
      "helpful": "247 out of 297 found this helpful.",
      "title": "CHECK MATE!",
      "content": "While I am an avid chess player, you do not need to love chess in order to love this series. This is the first time I have ever given a rating a perfect 10. The cast is beyond amazing, Anya Taylor-Joy did an outstanding job. The story and writing was brilliant. The cinematography was perfection and captured every little detail for the time period. The music was perfect!The only disappointment is that there probably will not be a season two."
    },
    {
      "username": "lewilewis1997",
      "userUrl": "https://www.imdb.com/user/ur55718294",
      "reviewLink": "https://www.imdb.com/review/rw6198617",
      "warningSpoilers": true,
      "date": "23 October 2020",
      "rate": "9",
      "helpful": "117 out of 163 found this helpful.",
      "title": "Mind Blowing, Check Mate...!",
      "content": "An utterly engrossing tale that makes chess sexy, not words that normally exist in the same sentence.I'm on my 4th ep' and know I'll watch the lot today, with a rude interruption for a trip to the doctors, bummer. The rags to riches story is gathering pace, tragedy will almost certainly follow, but that's a guess. EDIT - Yes it did, sooner than I thought, and the decline into self medication almost ends the whole adventure. There's a review on here that questions the use of the early addiction story as pointless and even offensive. They obviously have no clue as to how childhood trauma shapes us for the rest of our lives. Add that to the fact that child care used drugs to subdue and control children in institutions up until the 60's and in some countries much later.There will almost certainly be negative reviews calling this 'PC nonsense'. Stuff 'em, history is full of brave and intelligent women, just ask Cleopatra or Marie Curie. Beth Harman is fearless and totally determined to do things her way. Her plan is simple, be the best by beating the very best.Anya Taylor-Joy is the perfect choice, a lot of shots are of players staring at each other, and her huge brown eyes are the star of the show and she uses them a thousand ways. Her adopted mother is the organiser and recognises the earning potential early on, even if she knows jack about chess, she certainly understands the dollar. What starts out as a money making scheme becomes quite a touching mother/daughter, even sister relationship but avoids un necessary sentiment. My assumption was that her adopted mother would be a barrier to Beth's aspirations, as all of the women she'd encountered since her dead biological mother with very sound life advice were. Yet she let Beth live the life of her choosing. There are plenty of examples in this series of women holding other women back, whether it's down to social convention or just the idea of 'not fitting in'. Without her would Beth have become Beth?Netflix have smashed it out of the park, again. The high production values and excellent casting, plus an adaption being praised as 'close to the book' makes this a must watch series for gals and guys alike. It's definitely one for snuggling up on a cold evening with your significant other.UPDATE - I've finished it, in one day as predicted. The finale is fantastic, I don't mind admitting that I cried, in a blokey, happy way. UDATE OF THE FIRST UPDATE (because I watched it again) It was better, by a mile."
    },
    {
      "username": "valentinmh",
      "userUrl": "https://www.imdb.com/user/ur83116671",
      "reviewLink": "https://www.imdb.com/review/rw6206293",
      "warningSpoilers": false,
      "date": "25 October 2020",
      "rate": "9",
      "helpful": "112 out of 153 found this helpful.",
      "title": "Excellent !",
      "content": "Agree with most of the high-rating reviews here. This is how a movie/series should be done, congratulations to all crew ! Glad there are still intellingent and talented people to do this, which - sadly - is less and less often in our time."
    },
    {
      "username": "Katz5",
      "userUrl": "https://www.imdb.com/user/ur2818012",
      "reviewLink": "https://www.imdb.com/review/rw8422452",
      "warningSpoilers": false,
      "date": "10 August 2022",
      "rate": "8",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Makes Chess Exciting",
      "content": "Chess has been the focus, or sub-focus, of several other movies, from Searching for Bobby Fischer to Fresh to Pawn Sacrifice. These are movies that lack the stand-up thrills of sports dramas like Rocky or Hoosiers, but what can you say? It's chess. A more cerebral game means more introverted, quirky characters. And The Queen's Gambit delivers in spades...or should I say, rooks. With 2.6K reviews on IMDb (as of the date of my review), enough has been said about the acting (wonderful, particularly Anya Taylor-Joy, whose eyes express just as much about her character as her words do), the story, and the backdrop.Beth Harmon is a child prodigy who loses her parents at a very early age. She survives a stereotypical (for movies, at least) child orphanage by fantasizing about chess moves; fantasies initially fueled by tranquilizers. I am no expert on state laws in Kentucky in the 1960s, but now it seems quite hard to believe that such strong drugs were handed out disguised as \"vitamins\" to children back then.The mini-series depicts Beth's triumphs and frequent set backs from age 9 to about 25. Because of her frequent addiction, financial, and relationship set backs, I had no idea where the story was going by the final episode. To reveal anything more would be a spoiler. But most characters, mainly the mostly male chess counterparts and her loyal friend and surrogate sister from the orphanage, but also the Russian chess adversaries, are very sympathetic (Russia is not portrayed in a negative light in this mini series).The 1960s haven't looked this good since Mad Men. And the 7-episode duration is perfect. There is no need for this to be a drawn-out series a'la Better Call Saul or Ozark (not that there was anything wrong with those series, of course). Recommended, but don't expect Game of Thrones. Which suit me just fine."
    },
    {
      "username": "jaimemedina-36288",
      "userUrl": "https://www.imdb.com/user/ur78124884",
      "reviewLink": "https://www.imdb.com/review/rw6210167",
      "warningSpoilers": false,
      "date": "27 October 2020",
      "rate": "10",
      "helpful": "51 out of 73 found this helpful.",
      "title": "Close your eyes",
      "content": "This was such a joy to watch. Tremendous performances by an excellent cast.The story moves carefully, thoughtfully, and deliberately. Yet there's a tension throughout. It's never predictable. Beneath it all is the backstory of the history of gender roles and underlying pervasive misogyny. Beth is forced to play the game in life and on the board.I loved every minute of it.On another level, I have to take note of the sheer unanimity of great reviews for this series. I don't think I've seen anything else that so unites everyone in the magnitude of appreciation. This is an achievement in and of itself in my book."
    },
    {
      "username": "Robot_Chikn_n_a_Biscuit",
      "userUrl": "https://www.imdb.com/user/ur155459126",
      "reviewLink": "https://www.imdb.com/review/rw8416188",
      "warningSpoilers": false,
      "date": "8 August 2022",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Where did this come from?",
      "content": "Yes, I played chess in junior high, and high school. No, I am not that good. I struggle to see several moves ahead and rely on learned tactics to win. This movie, though, is about a prodigy. A person who can see beyond the next move. A person who can see the whole game.Wonderfully executed. Well acted. I suspect many chess nerds will get some action, given the intensity of this movie.Well done!"
    },
    {
      "username": "Ar_Pharazon_the_golden",
      "userUrl": "https://www.imdb.com/user/ur22398091",
      "reviewLink": "https://www.imdb.com/review/rw6278115",
      "warningSpoilers": true,
      "date": "16 November 2020",
      "rate": "7",
      "helpful": "97 out of 150 found this helpful.",
      "title": "Rooky Balboa",
      "content": "As a story of female empowerment, the series is good. As a story of obsession with an activity, it is also interesting. It is even good as a way to make chess look cool.But for a chess player, the claims that the series 'gets the chess right' are only half-true. Not unlike Interstellar, getting a couple of things accurately does not fidelity make. The Queen's Gambit shows (mostly) realistic chess positions, and has put real effort into making sure the characters move naturally - and it does portray chess players discussions well enough (in spirit at least, though not in length or depth). However, the idea that a complete amateur can become a world class player with barely any training, no real study (Beth reads some books but declares disinterest in studying many critical aspects of the game), and winning virtually every single game, without even conceding a draw, is beyond ridiculous. Worse: it is unnecessary. The show could have just as well chosen a more realistic trajectory of Beth's career, but it chose not to in favour of a silly, 100% American success story, where losing one game means that you must immediately recognise the opponent is much better than you. There are other eye-rolling aspects, such as everyone being super-surprised at some move Beth makes (in reality, in most cases a player, or at least a grandmaster, will know they are lost without being flabbergasted by some miraculous threat), or how a Soviet player plays an easily, and immediately losing line AFTER a whole night of analysis on an adjourned position - but these are complaints only for people who actually care about such details."
    },
    {
      "username": "vabal",
      "userUrl": "https://www.imdb.com/user/ur125450811",
      "reviewLink": "https://www.imdb.com/review/rw6201284",
      "warningSpoilers": false,
      "date": "24 October 2020",
      "rate": "9",
      "helpful": "699 out of 784 found this helpful.",
      "title": "One of a kind!",
      "content": "It's not only a good series, it's not only the wonderful story, acting, cinematography, music. You watch it and it feels like the movie itself is a chessgame. With a rather weak opening indeed, a fabulous middlegame and a perfect ending. It's the kind of movies/series that stucks you in your armchair, on your couch or even in your bed anyway, forgetting about eating, sleeping, living. After the end, the return to reality has not yet occurred. You are still tormented in dimly lit orphanages, you travel all over the world, you are welcomed in super-bright chess tournaments a little more arrogant and well-dressed and you analyze variants. Do not miss it!"
    },
    {
      "username": "DrProfessor",
      "userUrl": "https://www.imdb.com/user/ur3695776",
      "reviewLink": "https://www.imdb.com/review/rw6220083",
      "warningSpoilers": false,
      "date": "30 October 2020",
      "rate": "7",
      "helpful": "75 out of 112 found this helpful.",
      "title": "Enjoyable watch.",
      "content": "I liked this. I enjoyed the acting and characters. I wasn't sure about casting Thomas Brodie-Sangster as Benny, but he eventually grew on me. I couldn't really give it a higher rating because it was just too predictable.It's nice to see chess get more mainstream recognition."
    },
    {
      "username": "damo-30792",
      "userUrl": "https://www.imdb.com/user/ur122139614",
      "reviewLink": "https://www.imdb.com/review/rw8517160",
      "warningSpoilers": false,
      "date": "5 September 2022",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Wow.",
      "content": "I can't believe I was reluctant to put this on, but I was bored. I just didn't think it was for me. Boy was I mistaken.Every character is well written, and you feel drawn into engaging with them. From the adorable mother, to the kind janitor, to the brilliant main protagonist, every single one of them was written and acted to perfection. The story was movingly played out on screen and switching off to go to bed was impossible. Who'd have thought a tale about chess could be so gripping and funny? For me, what let me settle into the show was the lack of woke dogma being sprinkled like arsenic into another wise awesome narrative. This was not a vehicle for pushing anything other than the story itself. This was a total win for Netflix. It just shows they have the winning formula for on screen entertainment, they just seem not to use it."
    }
  ],
  "errorMessage": ""
}