{
  "imDbId": "tt10048342",
  "title": "The Queen's Gambit",
  "fullTitle": "The Queen's Gambit (TV Series 2020–2020)",
  "type": "TVSeries",
  "year": "2020",
  "language": "en",
  "titleInLanguage": "The Queen's Gambit (miniseries)",
  "url": "https://en.wikipedia.org/wiki/The_Queen%27s_Gambit_(miniseries)",
  "plotShort": {
    "plainText": "The Queen's Gambit is a 2020 American coming-of-age period drama streaming television miniseries based on the 1983 novel of the same name by Walter Tevis. The title refers to the \"Queen's Gambit\", a chess opening. The series was written and directed by Scott Frank, who created it with Allan Scott, who owns the rights to the book. Beginning in the mid-1950s and proceeding into the 1960s, the story follows the life of Beth Harmon (Anya Taylor-Joy), a fictional American chess prodigy on her rise to the top of the chess world while struggling with drug and alcohol dependency.\r\nNetflix released The Queen's Gambit on October 23, 2020. After four weeks it had become Netflix's most-watched scripted miniseries, making it Netflix's top program in 63 countries. The series received critical acclaim, with particular praise for Taylor-Joy's performance, the cinematography, and production values. It also received a positive response from the chess community for its accurate depictions of high-level chess, and data suggests that it increased public interest in the game.\r\nThe Queen's Gambit won eleven Primetime Emmy Awards, including Outstanding Limited or Anthology Series, becoming the first show on a streaming service to win the category. The series also won two Golden Globe Awards: Best Limited Series or Television Film and Best Actress – Miniseries or Television Film for Taylor-Joy. She also won the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Miniseries or Television Movie.",
    "html": "<p>The Queen's Gambit is a 2020 American coming-of-age period drama streaming television miniseries based on the 1983 novel of the same name by Walter Tevis. The title refers to the \"Queen's Gambit\", a chess opening. The series was written and directed by Scott Frank, who created it with Allan Scott, who owns the rights to the book. Beginning in the mid-1950s and proceeding into the 1960s, the story follows the life of Beth Harmon (Anya Taylor-Joy), a fictional American chess prodigy on her rise to the top of the chess world while struggling with drug and alcohol dependency.</p><p>Netflix released The Queen's Gambit on October 23, 2020. After four weeks it had become Netflix's most-watched scripted miniseries, making it Netflix's top program in 63 countries. The series received critical acclaim, with particular praise for Taylor-Joy's performance, the cinematography, and production values. It also received a positive response from the chess community for its accurate depictions of high-level chess, and data suggests that it increased public interest in the game.</p><p>The Queen's Gambit won eleven Primetime Emmy Awards, including Outstanding Limited or Anthology Series, becoming the first show on a streaming service to win the category. The series also won two Golden Globe Awards: Best Limited Series or Television Film and Best Actress – Miniseries or Television Film for Taylor-Joy. She also won the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Miniseries or Television Movie.</p>"
  },
  "plotFull": {
    "plainText": "The Queen's Gambit is a 2020 American coming-of-age period drama streaming television miniseries based on the 1983 novel of the same name by Walter Tevis. The title refers to the \"Queen's Gambit\", a chess opening. The series was written and directed by Scott Frank, who created it with Allan Scott, who owns the rights to the book. Beginning in the mid-1950s and proceeding into the 1960s, the story follows the life of Beth Harmon (Anya Taylor-Joy), a fictional American chess prodigy on her rise to the top of the chess world while struggling with drug and alcohol dependency.\r\nNetflix released The Queen's Gambit on October 23, 2020. After four weeks it had become Netflix's most-watched scripted miniseries, making it Netflix's top program in 63 countries. The series received critical acclaim, with particular praise for Taylor-Joy's performance, the cinematography, and production values. It also received a positive response from the chess community for its accurate depictions of high-level chess, and data suggests that it increased public interest in the game.\r\nThe Queen's Gambit won eleven Primetime Emmy Awards, including Outstanding Limited or Anthology Series, becoming the first show on a streaming service to win the category. The series also won two Golden Globe Awards: Best Limited Series or Television Film and Best Actress – Miniseries or Television Film for Taylor-Joy. She also won the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Miniseries or Television Movie.\r\nOverview\r\nThe Queen's Gambit follows the life of an orphan chess prodigy, Elizabeth Harmon, during her quest to become an elite chess player while struggling with emotional problems, drugs and alcohol dependency. The title of the series refers to a chess opening of the same name. The story is set in the mid-1950s and 1960s.\r\nIn the 1950s in Lexington, Kentucky, an eight-year-old Beth, having lost her mother in a car crash, is taken to an orphanage where she is taught chess by the building's custodian, Mr. Shaibel. As was common at the time, the orphanage dispenses daily tranquilizer pills to the girls to \"balance their disposition\", which turns into an addiction for Beth. She quickly becomes a strong chess player due to her visualization skills. A few years later, Beth is adopted by childless suburban couple Alma and Allston Wheatley. As she adjusts to her new home, Beth enters a chess tournament and wins despite having no prior experience in competitive chess. Alma is initially resistant to Beth's interest in chess, but after Beth wins her first tournament, Alma is fully supportive of her adoptive daughter's sojourns to enter various chess competitions. Beth develops friendships with several people, including former Kentucky State Champion Harry Beltik, United States National Champion Benny Watts, and journalist and fellow player D.L. Townes.\r\nAs Beth rises to the top of the chess world and reaps the financial benefits of her success, her drug and alcohol dependency worsens. With help from her oldest friend Jolene, whom she grew up with in the orphanage, she prepares for her biggest challenge yet, a major international chess tournament against the world's best players in Moscow.\r\nCast and characters\r\nMain\r\nAnya Taylor-Joy as Beth Harmon, an orphan who matures into a competitive young adult fueled by a desire to become the greatest chess player in the world while masking a growing addiction to the drugs and alcohol that allow her to function. Isla Johnston as nine-year-old Beth Annabeth Kelly as five-year-old Beth\r\nIsla Johnston as nine-year-old Beth\r\nAnnabeth Kelly as five-year-old Beth\r\nBill Camp as Mr. William Shaibel, the custodian at the Methuen Home for Girls and an experienced chess player who teaches Beth how to play the game.\r\nMoses Ingram as Jolene, a rebellious teenager at the Methuen Home who becomes Beth's closest childhood friend.\r\nChristiane Seidel as Helen Deardorff, director of Methuen Home for Girls.\r\nRebecca Root as Miss Lonsdale, the chaplain and choir director at Methuen.\r\nChloe Pirrie as Alice Harmon, Beth's deceased mother (seen only in flashbacks) who earned a Ph.D. in mathematics at Cornell University before experiencing a downward spiral in her mental health.\r\nAkemnji Ndifornyen as Mr. Fergusson, the orderly at Methuen, who among other roles administers state-mandated pills to the girls.\r\nMarielle Heller as Alma Wheatley, who with her husband Allston adopts Beth as a young teenager and later acts as a manager for Beth's chess career. Alma's biological child died sometime before Beth's adoption, and she develops a worsening alcoholism that begins to influence Beth.\r\nHarry Melling as Harry Beltik, Kentucky State Champion, whom Beth defeats in her first tournament and later befriends.\r\nPatrick Kennedy as Allston Wheatley, Alma's husband and Beth's estranged adoptive father.\r\nJacob Fortune-Lloyd as D.L. Townes, a chess player and journalist who befriends Beth and with whom she is infatuated.\r\nThomas Brodie-Sangster as Benny Watts, a brash young New Yorker who is the reigning United States Chess Champion, later Beth's mentor, lover and friend.\r\nMarcin Dorociński as Vasily Borgov, Soviet World Champion and Beth's biggest challenge.\r\nRecurring\r\nSergio Di Zio as Beth's father.\r\nDolores Carbonari as Margaret, Beth's high school classmate and bully.\r\nEloise Webb as Annette Packer, a friendly teenager who becomes Beth's first tournament opponent.\r\nMatthew and Russell Dennis Lewis as Matt and Mike, twin brothers who serve as event organisers and tournament directors at Beth's first tournament and go on to become her friends.\r\nMax Krause as Arthur Levertov, a grandmaster and friend of Benny's who assists Beth with her training.\r\nRyan Wichert as Hilton Wexler, a strong player and chess problem enthusiast, friend of Benny.\r\nGuest starring\r\nJonjo O'Neill as Mr. Ganz, a local high school chess club teacher who invites a young Beth to play at his school.\r\nLouis Ashbourne Serkis as Georgi Girev, a 13-year-old Soviet chess prodigy.\r\nJanina Elkin as Borgov's wife, who is also his interpreter.\r\nMillie Brady as Cleo, a French model who had a brief affair with Benny. She quickly befriends Beth.\r\nBruce Pandolfini as Ed Spencer, a tournament director.\r\nJohn Schwab as Mr. Booth, Beth's minder from the State Department.\r\nMarcus Loges as Luchenko, a veteran former world chess champion and still a formidable player.\r\nEpisodes\r\nProduction\r\nDevelopment\r\nOn March 19, 2019, Netflix gave the production a series order consisting of six episodes. The series was written and directed by Scott Frank, who also created the series with Allan Scott. The two also served as executive producers alongside William Horberg. Allan Scott had been involved in attempts to get the book on screen since 1992, when he purchased the screenplay rights from Walter Tevis's widow.\r\nThe series was released on October 23, 2020, with seven episodes instead of the original six-episode order.\r\nWriting\r\nFormer World Chess Champion Garry Kasparov and chess coach Bruce Pandolfini acted as consultants. Pandolfini had consulted with Tevis prior to the novel's publication some 38 years earlier, coming up with the title \"The Queen's Gambit\".\r\nPandolfini, together with consultants John Paul Atkinson and Iepe Rubingh, devised several hundred chess positions to be used for various situations in the script. Kasparov developed critical moments in the story, such as when a real 1998 game between grandmasters Arshak Petrosian and Vladimir Akopian was improved to showcase Beth's skill, or a 1993 game between Vasyl Ivanchuk and Patrick Wolff became the prototype for the decisive game in the last episode.\r\nCasting\r\nAlongside the series order announcement, it was announced that Anya Taylor-Joy was set to star as the lead. In January 2020, it was reported Moses Ingram had joined the cast of the series. Upon the miniseries premiere date announcement, it was announced that Bill Camp, Thomas Brodie-Sangster, Harry Melling and Marielle Heller were cast in starring roles. Because the majority of the filming was carried out in Berlin, the minor roles were filled mostly by British and German actors.\r\nProduction design and filming\r\nProduction designer Uli Hanisch developed the series' sets to evoke the aesthetic of the 1950s and 1960s. Much of the series was filmed in Berlin because interiors found there could stand in for a large number of the show's locations, including Las Vegas, Cincinnati, Mexico City, Moscow, and Paris.\r\nLocations used in and near Berlin included the Kino International (for a restaurant, actually the Panorama Bar), the Berlin Zoo (for the zoo scene in Mexico City), the vintage clothes store Humana (for Ben Snyder’s Department in Louisville, Kentucky), Schloss Schulzendorf (for the Methuen Home orphanage), the Rathaus Spandau (for a hotel lobby in Cincinnati), the Meistersaal in Kreuzberg (for the Cincinnati tournament), Palais am Funkturm (for the Hotel Mariposa in Las Vegas), the Protestant University of Applied Sciences in Zehlendorf (for the US Championship games location), Haus Cumberland and its Café Grosz (for the Paris tournament), the Bode Museum (for scenes that take place in Paris), Karl-Marx-Allee (exterior of a hotel said to be in Moscow); the final scene of Beth walking in Moscow was filmed at Rosengarten Square, also on Karl-Marx-Allee. The Bärensaal (aka Bear hall) in the Altes Stadthaus was used for scenes set at the Moscow Tournament. The Friedrichstadt-Palast stood in for the Aztec Palace Hotel. The exterior of Henry Clay High School in Lexington was actually filmed at Max Taut Schule.\r\nSome scenes were filmed in Canada; principal photography began in August 2019 in Cambridge, Ontario. For example, the Harmon family home is a house on Brant Road in the city. Other houses where some filming was done are on Salisbury Ave. in Cambridge and on Blenheim Road; the latter is a mansion built in the 19th century. The exterior of St. Andrew's College, Aurora (Ontario) was used for the Ohio Championship facility but the interior was actually a Berlin facility. The exterior of the fictional Ben Snyder Department store in Kentucky was filmed at the Winners department store (Front Street and Berczy Park) in Toronto, Ontario, the rural bridge is the Meadowvale Road Bridge in Toronto and the Fairfield High School in the show is actually Western Technical-Commercial School in Toronto. The fictional Bradley's pharmacy was actually an outdoor set built at Walnut and King streets in Hamilton, Ontario.\r\nMusic\r\nThe musical score was composed by Carlos Rafael Rivera. Frank initially wanted the score to be piano-based only, but in the end decided with Rivera for a full orchestral score for more \"instrumental depth and color\". Rivera also described how he learned of the executive producer William Horberg's love of flute, and added prominent flute sections to the orchestral pieces. Rivera found scoring for chess a challenging task, having been warned by Frank that \"music would be doing a lot of heavy lifting\". He decided to reflect Beth's growth – both as a person and a chess player – by adding more and more instrumentation over time.\r\nReception\r\nAudience viewership\r\nIn October 2020, the series was the most watched show on Netflix in the United States. On November 23, 2020, Netflix announced that the series had been watched by 62 million households since its release, becoming \"Netflix's biggest scripted limited series to date.\" Of this, Scott Frank stated \"I am both delighted and dazed by the response\" while several outlets characterized it as an \"unlikely success\". The series topped the Nielsen's U.S. streaming rankings for the weeks of October 26 to November 1, November 2 to 8, and November 9 to 15, 2020, making it the first series to do so for three weeks straight.\r\nThe Queen's Gambit eventually ranked third in Reelgood's yearly ranking of Netflix shows during 2020, with Cocomelon taking the first spot.\r\nCritical response\r\nOn review aggregator Rotten Tomatoes, The Queen's Gambit received an approval rating of 96% based on 105 reviews, with an average rating of 7.9/10. The website's critics consensus reads, \"Its moves aren't always perfect, but between Anya Taylor-Joy's magnetic performance, incredibly realized period details, and emotionally intelligent writing, The Queen's Gambit is an absolute win.\" Metacritic gave the series a weighted average score of 79 out of 100 based on 28 reviews, indicating \"generally favorable reviews\".\r\nIn a column where she argues \"So many lives would be different if we'd had The Queen's Gambit 50 years ago,\" culture critic Mary McNamara said, \"I loved The Queen's Gambit so much, I watched the final episode three times.\" Sara Miller of The New Yorker recounted having experienced a sense of loss in her own association with the novel after seeing its depiction on screen because she could not relate to the main character: \"Anya Taylor-Joy is way too good-looking to play Beth Harmon\", she notes. Miller argues that Beth's ugliness is a central tension in the novel which the on-screen depiction misses completely despite staying true to everything else in the novel. Darren Franich of Entertainment Weekly gave the series a B and described the lead actress, \"Taylor-Joy excels in the quiet moments, her eyelids narrowing as she decimates an opponent, her whole body physicalizing angry desperation when the game turns against her.\" Variety's Caroline Framke wrote \"The Queen's Gambit manages to personalize the game and its players thanks to clever storytelling and, in Anya Taylor-Joy, a lead actor so magnetic that when she stares down the camera lens, her flinty glare threatens to cut right through it.\" Reviewing for Rolling Stone, Alan Sepinwall gave it 3 out of 5 stars and said, \"An aesthetically beautiful project with several superb performances, all in service to a story that starts to feel padded long before the end comes.\"\r\nCritics also frequently discussed the series' prominent theme of substance abuse. Phoebe Wong notes that \"Interestingly though, unlike other works which study the self-destructive aspects of perfectionist obsession, mental health and substance abuse issues extend beyond the protagonist to other characters\" in her review for The Tufts Daily. Her summary reads \"Impressive in its own right, The Queen's Gambit adopts a fresh perspective by delving into chess' intersections with substance abuse and gender discrimination\". Matt Miller of Esquire stated \"The result is a pretty scary depiction of the stress of competitive chess in the 1960s.\" On the other hand, Harper's Bazaar's Lilly Dancyger considered the \"misrepresentation\" of drug abuse to \"nearly ruin the show\" for her, using the following Stephen King quote to explain: \"The idea that the creative endeavor and mind-altering substances are entwined is one of the great pop-intellectual myths of our time.\"\r\nThe Washington Post's Monica Hesse considers the miniseries \"revisionist history\" but also \"a wonderful future\" in that the heroine's \"uncluttered path to success\" is \"uninterrupted by sexism\", and has men \"refreshingly\" looking out for the main female character, noting that the show \"has no women in peril, and no skeezy men\". Carina Chocano of The New York Times Magazine also believes that the show again and again foils the audience's expectations: the janitor does not molest her, her adoptive father leaves her alone, and her adoptive mother Alma does not hold her back, a departure Chocano attributes to the \"fantasy\"-like quality of The Queen's Gambit. Responding to these reviews, Fred Mazelis of the World Socialist Web Site wrote that \"the claims that the series is appreciated because it is fantasy are disingenuous, to say the least. The show has struck a chord precisely because it is not seen as utopian fiction.\" Bethonie Butler, also of The Washington Post, while praising the show overall, criticized the characterization of Jolene, the show's only major Black character, saying \"(her) backstory and character development are so limited that she seems to exist merely to make Beth's life easier\".\r\nMany aspects of the series' production values have been praised and discussed, including its location choices, set design, and costumes.\r\nAccolades\r\nChess community response\r\nThe series received praise from the chess community for its realistic portrayal of the game and players. In an interview with Vanity Fair, Woman Grandmaster Jennifer Shahade said that the series \"completely nailed the chess accuracy\". In an article about the miniseries in The Times, British chess champion David Howell felt that the chess scenes were \"well choreographed and realistic\", while British Women's chess champion Jovanka Houska said, \"I think it's a fantastic TV series ...t conveys the emotion of chess really well.\" Houska stated that she related to Beth being one of the few women in a tournament, and noted that sexism was worse at the \"hobby\" level, especially for young girls. International Master Dorsa Derakhshani described the show as \"very, very accurate\" and that she was surprised at \"how actually strong the games are\".\r\nJudit Polgár, who was the first woman to play for a world championship title, said that the show depicted the male players as \"too nice\", while chess streamer Andrea Botez also felt the show \"toned down\" the sexism in the chess world. Former British women's champion Sarah Longson said that realistically, Beth should have lost more. Reigning chess world champion Magnus Carlsen gave it 5 out of 6 stars but found it \"a little too unrealistic\" for how quickly Beth developed her skills.\r\nLawsuit\r\nIn the final episode of the mini-series, the women's world champion Nona Gaprindashvili is mentioned as having \"never faced men\", despite the real-life Gaprindashvili frequently playing against male opponents, including top-level grandmasters. In response, Gaprindashvili said it is dishonouring to have misinformation spread about someone's achievements. She sued Netflix for $5 million in a defamation lawsuit in September 2021, and called for the line that claimed she had never faced men to be removed. The case was settled in September 2022, on undisclosed terms.\r\nInterest in chess\r\nIn November 2020, The Washington Post reported that the COVID-19 pandemic had already increased the public's interest in chess, but the popularity of The Queen's Gambit made it explode. The New York Times compared the interest in chess to the \"similar chess mania\" after Bobby Fischer beat Boris Spassky to become world champion in 1972. According to The Guardian, grandmaster Maurice Ashley has been inundated by messages from people – mainly women – enthused by the series: \"the frenzy around it is crazy\". Sales of chess sets rose greatly following the release of the series, with U.S. company Goliath Games stating their chess set sales increased over a thousand percent due to the series, while marketing firm NPD Group found chess book sales had increased over 600 percent. Chess.com reports several million new users since the release of the series, with a higher rate of registrations by female players compared to before the series. Chess instructors have stated that the demand for chess lessons has significantly increased as well.\r\nAdaptations\r\nIn early 2021, due to the success of the series, the theatrical rights to the Tevis novel were acquired with the intent of producing a musical.\r\nLegacy\r\nTogether with The Crown, another Netflix production, costumes from The Queen's Gambit were put on display by the Brooklyn Museum as part of its virtual exhibition \"The Queen and the Crown\".",
    "html": "<p>The Queen's Gambit is a 2020 American coming-of-age period drama streaming television miniseries based on the 1983 novel of the same name by Walter Tevis. The title refers to the \"Queen's Gambit\", a chess opening. The series was written and directed by Scott Frank, who created it with Allan Scott, who owns the rights to the book. Beginning in the mid-1950s and proceeding into the 1960s, the story follows the life of Beth Harmon (Anya Taylor-Joy), a fictional American chess prodigy on her rise to the top of the chess world while struggling with drug and alcohol dependency.</p><p>Netflix released The Queen's Gambit on October 23, 2020. After four weeks it had become Netflix's most-watched scripted miniseries, making it Netflix's top program in 63 countries. The series received critical acclaim, with particular praise for Taylor-Joy's performance, the cinematography, and production values. It also received a positive response from the chess community for its accurate depictions of high-level chess, and data suggests that it increased public interest in the game.</p><p>The Queen's Gambit won eleven Primetime Emmy Awards, including Outstanding Limited or Anthology Series, becoming the first show on a streaming service to win the category. The series also won two Golden Globe Awards: Best Limited Series or Television Film and Best Actress – Miniseries or Television Film for Taylor-Joy. She also won the Screen Actors Guild Award for Outstanding Performance by a Female Actor in a Miniseries or Television Movie.</p><br/><h3>Overview</h3><p>The Queen's Gambit follows the life of an orphan chess prodigy, Elizabeth Harmon, during her quest to become an elite chess player while struggling with emotional problems, drugs and alcohol dependency. The title of the series refers to a chess opening of the same name. The story is set in the mid-1950s and 1960s.</p><p>In the 1950s in Lexington, Kentucky, an eight-year-old Beth, having lost her mother in a car crash, is taken to an orphanage where she is taught chess by the building's custodian, Mr. Shaibel. As was common at the time, the orphanage dispenses daily tranquilizer pills to the girls to \"balance their disposition\", which turns into an addiction for Beth. She quickly becomes a strong chess player due to her visualization skills. A few years later, Beth is adopted by childless suburban couple Alma and Allston Wheatley. As she adjusts to her new home, Beth enters a chess tournament and wins despite having no prior experience in competitive chess. Alma is initially resistant to Beth's interest in chess, but after Beth wins her first tournament, Alma is fully supportive of her adoptive daughter's sojourns to enter various chess competitions. Beth develops friendships with several people, including former Kentucky State Champion Harry Beltik, United States National Champion Benny Watts, and journalist and fellow player D.L. Townes.</p><p>As Beth rises to the top of the chess world and reaps the financial benefits of her success, her drug and alcohol dependency worsens. With help from her oldest friend Jolene, whom she grew up with in the orphanage, she prepares for her biggest challenge yet, a major international chess tournament against the world's best players in Moscow.</p><br/><h3>Cast and characters</h3><h4>Main</h4><ul><li>Anya Taylor-Joy as Beth Harmon, an orphan who matures into a competitive young adult fueled by a desire to become the greatest chess player in the world while masking a growing addiction to the drugs and alcohol that allow her to function. Isla Johnston as nine-year-old Beth Annabeth Kelly as five-year-old Beth</li><li>Isla Johnston as nine-year-old Beth</li><li>Annabeth Kelly as five-year-old Beth</li><li>Bill Camp as Mr. William Shaibel, the custodian at the Methuen Home for Girls and an experienced chess player who teaches Beth how to play the game.</li><li>Moses Ingram as Jolene, a rebellious teenager at the Methuen Home who becomes Beth's closest childhood friend.</li><li>Christiane Seidel as Helen Deardorff, director of Methuen Home for Girls.</li><li>Rebecca Root as Miss Lonsdale, the chaplain and choir director at Methuen.</li><li>Chloe Pirrie as Alice Harmon, Beth's deceased mother (seen only in flashbacks) who earned a Ph.D. in mathematics at Cornell University before experiencing a downward spiral in her mental health.</li><li>Akemnji Ndifornyen as Mr. Fergusson, the orderly at Methuen, who among other roles administers state-mandated pills to the girls.</li><li>Marielle Heller as Alma Wheatley, who with her husband Allston adopts Beth as a young teenager and later acts as a manager for Beth's chess career. Alma's biological child died sometime before Beth's adoption, and she develops a worsening alcoholism that begins to influence Beth.</li><li>Harry Melling as Harry Beltik, Kentucky State Champion, whom Beth defeats in her first tournament and later befriends.</li><li>Patrick Kennedy as Allston Wheatley, Alma's husband and Beth's estranged adoptive father.</li><li>Jacob Fortune-Lloyd as D.L. Townes, a chess player and journalist who befriends Beth and with whom she is infatuated.</li><li>Thomas Brodie-Sangster as Benny Watts, a brash young New Yorker who is the reigning United States Chess Champion, later Beth's mentor, lover and friend.</li><li>Marcin Dorociński as Vasily Borgov, Soviet World Champion and Beth's biggest challenge.</li></ul><h4>Recurring</h4><ul><li>Sergio Di Zio as Beth's father.</li><li>Dolores Carbonari as Margaret, Beth's high school classmate and bully.</li><li>Eloise Webb as Annette Packer, a friendly teenager who becomes Beth's first tournament opponent.</li><li>Matthew and Russell Dennis Lewis as Matt and Mike, twin brothers who serve as event organisers and tournament directors at Beth's first tournament and go on to become her friends.</li><li>Max Krause as Arthur Levertov, a grandmaster and friend of Benny's who assists Beth with her training.</li><li>Ryan Wichert as Hilton Wexler, a strong player and chess problem enthusiast, friend of Benny.</li></ul><h4>Guest starring</h4><ul><li>Jonjo O'Neill as Mr. Ganz, a local high school chess club teacher who invites a young Beth to play at his school.</li><li>Louis Ashbourne Serkis as Georgi Girev, a 13-year-old Soviet chess prodigy.</li><li>Janina Elkin as Borgov's wife, who is also his interpreter.</li><li>Millie Brady as Cleo, a French model who had a brief affair with Benny. She quickly befriends Beth.</li><li>Bruce Pandolfini as Ed Spencer, a tournament director.</li><li>John Schwab as Mr. Booth, Beth's minder from the State Department.</li><li>Marcus Loges as Luchenko, a veteran former world chess champion and still a formidable player.</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#854743;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#854743\">Title</th><th scope=\"col\" style=\"background:#854743\">Directed by</th><th scope=\"col\" style=\"background:#854743\">Teleplay by</th><th scope=\"col\" style=\"background:#854743\">Original release date</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Openings\"</td><td style=\"text-align:center\"><span>Scott Frank</span></td><td style=\"text-align:center\">Scott Frank</td><td style=\"text-align:center\">October 23, 2020</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #854743\"><p><span>Elizabeth Harmon</span> is orphaned at age 9 when her mother dies in a car crash on <span>New Circle Road</span>. She is subsequently taken to Methuen Home for Girls. At the orphanage, the children are given tranquilizing pills to make them more compliant. While dusting erasers in the basement, Beth discovers the custodian, Mr. Shaibel, studying chess on his own. After repeated requests, and demonstrating that she has already learned how the pieces move by observing him, he reluctantly agrees to teach her the game. She improves quickly, thanks to her <span>spatial intelligence</span> and abuse of the mind-altering tranquilizers, which allow her to focus and visualize chess games on the ceiling above her bed. When she is able to beat him regularly, Shaibel introduces her to the local high school chess club teacher, Mr. Ganz, whom she also beats. Ganz invites her to play a <span>simultaneous exhibition</span> against his entire club. </p>After the state passes a law outlawing the use of tranquilizers on children, Beth begins to suffer from withdrawal. Provided more than one tranquilizer pill by her friend Jolene, Beth beats Ganz's entire class easily, later commenting to Shaibel on their poor chess skills and how invigorating it was to win. Still suffering from withdrawal, she is caught stealing a jar of the medication and passes out after overdosing by swallowing several mouthfuls of pills.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Exchanges\"</td><td style=\"text-align:center\">Scott Frank</td><td style=\"text-align:center\">Scott Frank</td><td style=\"text-align:center\">October 23, 2020</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #854743\">Beth is adopted as a teenager by Lexington couple Alma and Allston Wheatley. Alma is unhappy, while Allston is emotionally distant and frequently absent for his sales job. At her new high school, Beth is bullied by the popular girls from the \"Apple Pi Club\" for her drab clothes and obvious intelligence. Beth steals tranquilizers from her mother (the same kind that she was given at the orphanage), and again begins to visualize chess positions on the ceiling. She also steals a chess magazine and learns about the upcoming Kentucky State Championship. Short of money, she writes to Mr. Shaibel, who sends her $5 for the entrance fee. She surprises the organizers by cruising through her early games, and develops a crush on a young man named Townes. After the second day of the tournament, Beth comes home to find that Allston has deserted her and Alma. Beth fears that she will be sent back to the orphanage, but Alma tells her they will lie so she can stay. During her final game of the tournament against state champion Harry Beltik, Beth becomes flustered by his late arrival and runs to the restroom, where she takes a tranquilizer pill to help win the game. Alma plans to take Beth to a tournament in <span>Cincinnati</span> where substantial prize money is up for grabs.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Doubled Pawns\"</td><td style=\"text-align:center\">Scott Frank</td><td style=\"text-align:center\">Scott Frank</td><td style=\"text-align:center\">October 23, 2020</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #854743\">Beth wins the tournament in Cincinnati, giving Alma 15% of the prize money. Beth continues to skip school while traveling to tournaments and quickly gains national recognition for her achievements. She also begins dressing more stylishly as her winnings increase. At school, Beth is invited to a meeting of the \"Apple Pi Club\" by the girls who had initially shunned her. She soon realizes she has nothing in common with them and, stealing a bottle of <span>gin</span>, escapes back home. In 1966, Beth heads to <span>Las Vegas</span> for the U.S. Open where she is reunited with Townes, now a journalist covering the event for the Lexington newspaper. They return to his hotel room where Townes takes pictures of her. The two play chess and share a brief, intimate moment, but are interrupted by Townes's roommate, who Beth suspects is also his boyfriend. Beth abruptly leaves before Townes can explain the situation. Beth runs into the current U.S. national champion, Benny Watts, who points out an error in her game against Beltik. Beth is taken aback and replays her earlier game, losing her confidence. She experiences her first professional loss against Watts the next day and they finish the tournament as co-champions.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Middle Game\"</td><td style=\"text-align:center\">Scott Frank</td><td style=\"text-align:center\">Scott Frank</td><td style=\"text-align:center\">October 23, 2020</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #854743\">Beth takes night classes in Russian at a local college. She attends a party where she smokes <span class=\"mw-redirect\">marijuana</span> and sleeps with one of the students. Left alone in the empty apartment for the weekend, she indulges herself with more alcohol and drugs. After graduating from high school, Beth travels to an international tournament in <span>Mexico City</span> with Alma. Beth competes against several international players, including 13-year-old Soviet prodigy Georgi Girev, whom she defeats in a tough game lasting two days. While in a crowded elevator, Beth overhears a conversation between Soviet world champion Vasily Borgov and two associates discussing her playing style and potential weaknesses. Borgov comments she is an orphan and a survivor like them. Beth then plays Borgov and loses to him in an intense game after he surprises her with an offbeat <span>opening</span>. Back in the hotel room, Beth discovers Alma has died of suspected <span>hepatitis</span>, likely worsened by her excessive drinking. Beth manages to contact Allston in <span>Denver</span>, who wants nothing to do with the burial arrangements. However, he agrees to let Beth keep the house. Beth buys more tranquilizers from a pharmacy before flying home to arrange Alma's burial, ordering her trademark <span>Gibson</span> as tribute.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Fork\"</td><td style=\"text-align:center\">Scott Frank</td><td style=\"text-align:center\">Scott Frank</td><td style=\"text-align:center\">October 23, 2020</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #854743\">Beth returns home to Kentucky and reconnects with Harry Beltik, who is attending college and has romantic feelings for her. At Beth's suggestion, he moves into Alma's house to accompany the now lonely Beth. The two spend time training and sleep together a few times until Beltik realizes Beth's obsession with chess will always overshadow any relationship they may have. The two part ways, as Beltik admits his passion for the game has waned. Beth meets her former high school tormentor Margaret in town now married soon after graduating. She now has a baby daughter and is fast becoming an alcoholic. Beth travels to the 1967 U.S. Championship in <span>Ohio</span>, where she reunites with Benny Watts. The evening before they are scheduled to face each other in the final game, Benny challenges Beth to several rounds of <span class=\"mw-redirect\">speed chess</span> for five dollars each. An experienced speed chess hustler, he beats her consistently and cleans her out of all her cash. The next day, however, Beth defeats Benny to become the U.S. champion. The two discuss Beth's future in international competition. Benny, recognizing that Beth needs both a role model and a trainer, invites Beth to train for the <span>Paris</span> Invitational with him in <span>New York City</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Adjournment\"</td><td style=\"text-align:center\">Scott Frank</td><td style=\"text-align:center\">Scott Frank</td><td style=\"text-align:center\">October 23, 2020</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #854743\"><p>Beth travels to New York with Benny, where he trains her for the Paris Invitational. He invites two strong players, Hilton Wexler and Arthur Levertov to assist, along with a mutual friend, a French model named Cleo, who quickly befriends Beth. Beth repeatedly beats Benny, Wexler, and Levertov at simultaneous speed chess, winning back more than Benny took from her in Ohio. Beth and Benny sleep together, but Benny ruins the mood by talking chess strategy for Paris afterwards. At the Paris Invitational, Beth advances to the finals against Borgov. Cleo, who is also in Paris, invites Beth out for drinks. Beth hesitantly joins Cleo at the bar, resulting in a late-night bender. Hungover, Beth oversleeps for the final and is unable to focus, losing once more to Borgov. Devastated, Beth declines Benny's offer to continue staying with him in New York to prepare for the Moscow Invitational. Instead she returns to Kentucky. </p>Upon her returning home, she is contacted by her lawyer stating her estranged adoptive father, Allston Wheatley, now has issues with her living in his house. He demands she vacate, insisting he did not give her the house, despite her protestations. Beth buys the house from him, agreeing to pay the equity of $7,000 but subtracting the burial arrangement cost for her adoptive mother, Alma Wheatley. Alone, she removes all his belongings from the house and redecorates the house. Soon after, she plunges into a days-long drug and alcohol binge, ignoring phone calls and the outside world. Reluctantly honoring her commitment to visit the Kentucky State Championship, she blows off her first-ever tournament opponent, Annette, before Harry confronts her about her alcoholism. The next day, Beth finds her girlhood friend Jolene at her front door.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"End Game\"</td><td style=\"text-align:center\">Scott Frank</td><td style=\"text-align:center\">Scott Frank</td><td style=\"text-align:center\">October 23, 2020</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"6\" style=\"border-bottom:solid 3px #854743\">In a flashback to the beginning of the series in 1957, Beth and her mother visit a person, who is revealed to be Beth's father. Beth's mother begs Beth's father to take in their child, but he rejects her, saying that it is too late. In the present of 1968, Jolene and Beth attend Mr. Shaibel's funeral. Afterwards, Beth revisits the orphanage and breaks down when she discovers Shaibel had followed her career up until his death. Jolene helps her quit drinking with a physical fitness regime. Beth rejects funding from the Christian Crusade to travel to the Moscow Invitational. She asks Benny to help fund her, who refuses. Jolene loans her the money, and Beth arrives at the Moscow Invitational. Beth wins several games, gaining many fans from the Russian public. In the final game against Borgov, Beth plays the <span>Queen's Gambit</span>; the game is <span>adjourned</span> after forty moves. Beth reconnects with Townes, who is covering the tournament for the <i><span>Lexington Herald-Leader</span></i>. Beth receives a phone call from Benny, who has assembled Harry, Matt, Mike, Wexler, and Levertov to analyze her game with Borgov. When play resumes that evening, Beth is able to visualize the game without tranquilizer pills and eventually beats Borgov following her refusal of a <span>draw offer</span>. Beth is celebrated widely by the locals gathered outside the venue. On the drive back to the airport, Beth exits the car and heads for a park where local men play chess. They recognize her and greet her warmly, inviting her to play.</td></tr></tbody></table><br/><h3>Production</h3><h4>Development</h4><p>On March 19, 2019, Netflix gave the production a series order consisting of six episodes. The series was written and directed by Scott Frank, who also created the series with Allan Scott. The two also served as executive producers alongside William Horberg. Allan Scott had been involved in attempts to get the book on screen since 1992, when he purchased the screenplay rights from Walter Tevis's widow.</p><p>The series was released on October 23, 2020, with seven episodes instead of the original six-episode order.</p><h4>Writing</h4><p>Former World Chess Champion Garry Kasparov and chess coach Bruce Pandolfini acted as consultants. Pandolfini had consulted with Tevis prior to the novel's publication some 38 years earlier, coming up with the title \"The Queen's Gambit\".</p><p>Pandolfini, together with consultants John Paul Atkinson and Iepe Rubingh, devised several hundred chess positions to be used for various situations in the script. Kasparov developed critical moments in the story, such as when a real 1998 game between grandmasters Arshak Petrosian and Vladimir Akopian was improved to showcase Beth's skill, or a 1993 game between Vasyl Ivanchuk and Patrick Wolff became the prototype for the decisive game in the last episode.</p><h4>Casting</h4><p>Alongside the series order announcement, it was announced that Anya Taylor-Joy was set to star as the lead. In January 2020, it was reported Moses Ingram had joined the cast of the series. Upon the miniseries premiere date announcement, it was announced that Bill Camp, Thomas Brodie-Sangster, Harry Melling and Marielle Heller were cast in starring roles. Because the majority of the filming was carried out in Berlin, the minor roles were filled mostly by British and German actors.</p><h4>Production design and filming</h4><p>Production designer Uli Hanisch developed the series' sets to evoke the aesthetic of the 1950s and 1960s. Much of the series was filmed in Berlin because interiors found there could stand in for a large number of the show's locations, including Las Vegas, Cincinnati, Mexico City, Moscow, and Paris.</p><p>Locations used in and near Berlin included the Kino International (for a restaurant, actually the Panorama Bar), the Berlin Zoo (for the zoo scene in Mexico City), the vintage clothes store Humana (for Ben Snyder’s Department in Louisville, Kentucky), Schloss Schulzendorf (for the Methuen Home orphanage), the Rathaus Spandau (for a hotel lobby in Cincinnati), the Meistersaal in Kreuzberg (for the Cincinnati tournament), Palais am Funkturm (for the Hotel Mariposa in Las Vegas), the Protestant University of Applied Sciences in Zehlendorf (for the US Championship games location), Haus Cumberland and its Café Grosz (for the Paris tournament), the Bode Museum (for scenes that take place in Paris), Karl-Marx-Allee (exterior of a hotel said to be in Moscow); the final scene of Beth walking in Moscow was filmed at Rosengarten Square, also on Karl-Marx-Allee. The Bärensaal (aka Bear hall) in the Altes Stadthaus was used for scenes set at the Moscow Tournament. The Friedrichstadt-Palast stood in for the Aztec Palace Hotel. The exterior of Henry Clay High School in Lexington was actually filmed at Max Taut Schule.</p><p>Some scenes were filmed in Canada; principal photography began in August 2019 in Cambridge, Ontario. For example, the Harmon family home is a house on Brant Road in the city. Other houses where some filming was done are on Salisbury Ave. in Cambridge and on Blenheim Road; the latter is a mansion built in the 19th century. The exterior of St. Andrew's College, Aurora (Ontario) was used for the Ohio Championship facility but the interior was actually a Berlin facility. The exterior of the fictional Ben Snyder Department store in Kentucky was filmed at the Winners department store (Front Street and Berczy Park) in Toronto, Ontario, the rural bridge is the Meadowvale Road Bridge in Toronto and the Fairfield High School in the show is actually Western Technical-Commercial School in Toronto. The fictional Bradley's pharmacy was actually an outdoor set built at Walnut and King streets in Hamilton, Ontario.</p><h4>Music</h4><p>The musical score was composed by Carlos Rafael Rivera. Frank initially wanted the score to be piano-based only, but in the end decided with Rivera for a full orchestral score for more \"instrumental depth and color\". Rivera also described how he learned of the executive producer William Horberg's love of flute, and added prominent flute sections to the orchestral pieces. Rivera found scoring for chess a challenging task, having been warned by Frank that \"music would be doing a lot of heavy lifting\". He decided to reflect Beth's growth – both as a person and a chess player – by adding more and more instrumentation over time.</p><br/><h3>Reception</h3><h4>Audience viewership</h4><p>In October 2020, the series was the most watched show on Netflix in the United States. On November 23, 2020, Netflix announced that the series had been watched by 62 million households since its release, becoming \"Netflix's biggest scripted limited series to date.\" Of this, Scott Frank stated \"I am both delighted and dazed by the response\" while several outlets characterized it as an \"unlikely success\". The series topped the Nielsen's U.S. streaming rankings for the weeks of October 26 to November 1, November 2 to 8, and November 9 to 15, 2020, making it the first series to do so for three weeks straight.</p><p>The Queen's Gambit eventually ranked third in Reelgood's yearly ranking of Netflix shows during 2020, with Cocomelon taking the first spot.</p><h4>Critical response</h4><p>On review aggregator Rotten Tomatoes, The Queen's Gambit received an approval rating of 96% based on 105 reviews, with an average rating of 7.9/10. The website's critics consensus reads, \"Its moves aren't always perfect, but between Anya Taylor-Joy's magnetic performance, incredibly realized period details, and emotionally intelligent writing, The Queen's Gambit is an absolute win.\" Metacritic gave the series a weighted average score of 79 out of 100 based on 28 reviews, indicating \"generally favorable reviews\".</p><p>In a column where she argues \"So many lives would be different if we'd had The Queen's Gambit 50 years ago,\" culture critic Mary McNamara said, \"I loved The Queen's Gambit so much, I watched the final episode three times.\" Sara Miller of The New Yorker recounted having experienced a sense of loss in her own association with the novel after seeing its depiction on screen because she could not relate to the main character: \"Anya Taylor-Joy is way too good-looking to play Beth Harmon\", she notes. Miller argues that Beth's ugliness is a central tension in the novel which the on-screen depiction misses completely despite staying true to everything else in the novel. Darren Franich of Entertainment Weekly gave the series a B and described the lead actress, \"Taylor-Joy excels in the quiet moments, her eyelids narrowing as she decimates an opponent, her whole body physicalizing angry desperation when the game turns against her.\" Variety's Caroline Framke wrote \"The Queen's Gambit manages to personalize the game and its players thanks to clever storytelling and, in Anya Taylor-Joy, a lead actor so magnetic that when she stares down the camera lens, her flinty glare threatens to cut right through it.\" Reviewing for Rolling Stone, Alan Sepinwall gave it 3 out of 5 stars and said, \"An aesthetically beautiful project with several superb performances, all in service to a story that starts to feel padded long before the end comes.\"</p><p>Critics also frequently discussed the series' prominent theme of substance abuse. Phoebe Wong notes that \"Interestingly though, unlike other works which study the self-destructive aspects of perfectionist obsession, mental health and substance abuse issues extend beyond the protagonist to other characters\" in her review for The Tufts Daily. Her summary reads \"Impressive in its own right, The Queen's Gambit adopts a fresh perspective by delving into chess' intersections with substance abuse and gender discrimination\". Matt Miller of Esquire stated \"The result is a pretty scary depiction of the stress of competitive chess in the 1960s.\" On the other hand, Harper's Bazaar's Lilly Dancyger considered the \"misrepresentation\" of drug abuse to \"nearly ruin the show\" for her, using the following Stephen King quote to explain: \"The idea that the creative endeavor and mind-altering substances are entwined is one of the great pop-intellectual myths of our time.\"</p><p>The Washington Post's Monica Hesse considers the miniseries \"revisionist history\" but also \"a wonderful future\" in that the heroine's \"uncluttered path to success\" is \"uninterrupted by sexism\", and has men \"refreshingly\" looking out for the main female character, noting that the show \"has no women in peril, and no skeezy men\". Carina Chocano of The New York Times Magazine also believes that the show again and again foils the audience's expectations: the janitor does not molest her, her adoptive father leaves her alone, and her adoptive mother Alma does not hold her back, a departure Chocano attributes to the \"fantasy\"-like quality of The Queen's Gambit. Responding to these reviews, Fred Mazelis of the World Socialist Web Site wrote that \"the claims that the series is appreciated because it is fantasy are disingenuous, to say the least. The show has struck a chord precisely because it is not seen as utopian fiction.\" Bethonie Butler, also of The Washington Post, while praising the show overall, criticized the characterization of Jolene, the show's only major Black character, saying \"(her) backstory and character development are so limited that she seems to exist merely to make Beth's life easier\".</p><p>Many aspects of the series' production values have been praised and discussed, including its location choices, set design, and costumes.</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th scope=\"col\">Award</th><th scope=\"col\">Date of ceremony</th><th scope=\"col\">Category</th><th scope=\"col\">Recipient(s)</th><th scope=\"col\">Result</th><th scope=\"col\" class=\"unsortable\"><abbr title=\"References\">Ref.</abbr></th></tr><tr><td rowspan=\"4\"><span class=\"mw-redirect\">IGN Awards</span></td><td rowspan=\"4\">December 21, 2020</td><td>Best TV Series of the Year</td><td rowspan=\"3\"><i>The Queen's Gambit</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\" style=\"text-align:center;\"></td></tr><tr><td>Best Drama TV Series of the Year</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best New TV Series of the Year</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Dramatic Performance in a TV Series</td><td><span>Anya Taylor-Joy</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Hollywood Music in Media Awards</span></td><td rowspan=\"2\"><span>January 27, 2021</span></td><td><span>Best Original Score in a TV Show/Limited Series</span></td><td rowspan=\"2\"><span>Carlos Rafael Rivera</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td><span>Best Main Title Theme – TV Show/Limited Series</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Satellite Awards</span></td><td rowspan=\"2\"><span>February 15, 2021</span></td><td><span>Best Miniseries</span></td><td><i>The Queen's Gambit</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td><span>Best Actress in a Miniseries or TV Film</span></td><td>Anya Taylor-Joy</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Golden Globe Awards</span></td><td rowspan=\"2\"><span>February 28, 2021</span></td><td><span class=\"mw-redirect\">Best Limited Series or Television Film</span></td><td><i>The Queen's Gambit</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td><span>Best Actress – Limited Series or Television Film</span></td><td>Anya Taylor-Joy</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">AACTA International Awards</span></td><td rowspan=\"2\"><span>March 6, 2021</span></td><td>Best Drama Series</td><td><i>The Queen's Gambit</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td>Best Actress in a Series</td><td>Anya Taylor-Joy</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>Critics' Choice Television Awards</span></td><td rowspan=\"3\"><span class=\"mw-redirect\">March 7, 2021</span></td><td><span>Best Limited Series</span></td><td><i>The Queen's Gambit</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"3\" style=\"text-align:center;\"></td></tr><tr><td><span>Best Actress in a Limited Series or Movie Made for Television</span></td><td>Anya Taylor-Joy</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actress in a Limited Series or Movie Made for Television</span></td><td><span>Marielle Heller</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">USC Scripter Awards</span></td><td>March 13, 2021</td><td>Best Adapted TV Screenplay</td><td><span>Scott Frank</span> <small>(for \"Openings\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"1\" style=\"text-align:center;\"></td></tr><tr><td><span>South by Southwest</span></td><td>March 19, 2021</td><td>Title Design Competition</td><td><span>Saskia Marka</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"1\" style=\"text-align:center;\"></td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>March 21, 2021</span></td><td><span>Long Form – Adapted</span></td><td>Scott Frank and <span>Allan Scott</span>;<br>Based on the <span>novel</span> by <span>Walter Tevis</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"1\" style=\"text-align:center;\"></td></tr><tr><td><span class=\"mw-redirect\">Producers Guild of America Awards</span></td><td><span>March 24, 2021</span></td><td><span>David L. Wolper Award for Outstanding Producer of Limited Series Television</span></td><td><span>William Horberg</span>, Allan Scott, Scott Frank, Marcus Loges and Mick Aniceto</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"2\"><span>Make-Up Artists and Hair Stylists Guild Awards</span></td><td rowspan=\"2\"><span>April 3, 2021</span></td><td>Best Television Series, Limited or Miniseries or New Media Series – Best Period and/or Character Make-Up</td><td rowspan=\"2\">Daniel Parker</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td>Best Television Series, Limited or Miniseries or New Media Series – Best Period and/or Character Hair Styling</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>Screen Actors Guild Awards</span></td><td rowspan=\"2\"><span>April 4, 2021</span></td><td><span>Outstanding Performance by a Male Actor in a Television Movie or Limited Series</span></td><td><span>Bill Camp</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\" style=\"text-align:center;\"></td></tr><tr><td><span>Outstanding Performance by a Female Actor in a Television Movie or Limited Series</span></td><td>Anya Taylor-Joy</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Art Directors Guild Awards</span></td><td><span>April 10, 2021</span></td><td><span>Excellence in Production Design for a Television Movie or Limited Series</span></td><td>Uli Hanisch</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Directors Guild of America Awards</span></td><td><span>April 10, 2021</span></td><td><span>Outstanding Directorial Achievement in Movies for Television and Limited Series</span></td><td>Scott Frank</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Costume Designers Guild Awards</span></td><td><span>April 13, 2021</span></td><td><span>Excellence in Period Television</span></td><td><span>Gabriele Binder</span> <small>(for \"End Game\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"3\"><span>MPSE Golden Reel Awards</span></td><td rowspan=\"3\">April 17, 2021</td><td><span class=\"mw-redirect\">Outstanding Achievement in Sound Editing - Sound Effects and Foley for Episodic Long Form Broadcast Media</span></td><td>Eric Hirsch, Gregg Swiatlowski (supervising sound editor); <span>Wylie Stateman</span> (sound designer); Patrick Cicero, Eric Hoehn, Leo Marcil, James David Redding III (sound effects editors) and Rachel Chancey (foley artist/editor) for <small>(for \"End Game\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"3\" style=\"text-align:center;\"></td></tr><tr><td><span class=\"mw-redirect\">Outstanding Achievement in Sound Editing – Dialogue and ADR for Episodic Long Form Broadcast Media</span></td><td>Gregg Swiatlowski (supervising sound editor); Eric Hirsch (dialogue editor); Eric Hoehn, Leo Marcel, Wylie Stateman (ADR editors) <small>(for \"End Game\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Achievement in Sound Editing – Music Score and Musical for Episodic Long Form Broadcast Media</span></td><td>Tom Kramer (music editor) <small>(for \"Adjournment\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>ACE Eddie Awards</span></td><td><span>April 17, 2021</span></td><td>Best Edited Limited Series or Motion Picture for Television</td><td><span>Michelle Tesoro</span> <small>(for \"Exchanges\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Cinema Audio Society Awards</span></td><td><span>April 17, 2021</span></td><td><span>Outstanding Achievement in Sound Mixing for Television Movie or Limited Series</span></td><td>Roland Winke, Eric Hirsch, Eric Hoehn, Leo Marcil and <span>Lawrence Manchester</span> <small>(for \"Middle Game\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span class=\"mw-redirect\">American Society of Cinematographers Awards</span></td><td><span>April 18, 2021</span></td><td>Outstanding Achievement in Cinematography in Motion Picture, Miniseries, or Pilot Made for Television</td><td>Steven Meizler <small>(for \"End Game\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td><span>MTV Movie &amp; TV Awards</span></td><td><span>May 16, 2021</span></td><td><span>Best Performance in a Show</span></td><td>Anya Taylor-Joy</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>ADC Awards</span></td><td>June 9, 2021</td><td>Bronze Cube Award for Main Title Design</td><td>Saskia Marka</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr><tr><td rowspan=\"4\"><span>Hollywood Critics Association TV Awards</span></td><td rowspan=\"4\"><span>August 29, 2021</span></td><td>Best Streaming Limited Series, Anthology Series or Live-Action Television Movie</td><td><i>The Queen's Gambit</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\" style=\"text-align:center;\"></td></tr><tr><td>Best Actress in a Limited Series, Anthology Series or Television Movie</td><td>Anya Taylor-Joy</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Supporting Actor in a Limited Series, Anthology Series or Television Movie</td><td>Bill Camp</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Supporting Actress in a Limited Series, Anthology Series or Television Movie</td><td>Marielle Heller</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"12\"><span>Primetime Creative Arts Emmy Awards</span></td><td rowspan=\"12\"><span>September 11 – 12, 2021</span></td><td><span>Outstanding Casting for a Limited or Anthology Series or Movie</span></td><td><span>Ellen Lewis</span>, Kate Sprance, Olivia Scott-Webb, Tina Gerussi, Anna-Lena Slater, Tatjana Moutchnik and Stephanie Maile</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"12\" style=\"text-align:center;\"></td></tr><tr><td><span>Outstanding Cinematography for a Limited or Anthology Series or Movie</span></td><td>Steven Meizler <small>(for \"End Game\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Period Costumes</span></td><td>Gabriele Binder, Gina Krauss, Katrin Hoffmann, Nanrose Buchmann and Sparka Lee Hall <small>(for \"End Game\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Period and/or Character Makeup (Non-Prosthetic)</span></td><td>Daniel Parker <small>(for \"Adjournment\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Main Title Design</span></td><td>Saskia Marka and David Whyte</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Music Composition for a Limited or Anthology Series, Movie, or Special</span></td><td>Carlos Rafael Rivera <small>(for \"End Game\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Original Music and Lyrics</span></td><td>\"I Can't Remember Love\" – Anna Hauss, Robert Weinröder and William Horberg <small>(for \"Adjournment\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Music Supervision</span></td><td><span>Randall Poster</span> <small>(for \"Adjournment\")</small></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Single-Camera Picture Editing for a Limited or Anthology Series or Movie</span></td><td>Michelle Tesoro <small>(for \"Exchanges\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Production Design for a Narrative Period or Fantasy Program (One Hour or More)</span></td><td>Uli Hanisch, Kai Karla Koch and Sabine Schaaf</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Sound Editing for a Limited or Anthology Series, Movie or Special</span></td><td>Gregg Swiatlowski, Eric Hirsch, <span>Wylie Stateman</span>, Leo Marcil, Mary-Ellen Porto, Patrick Cicero, James David Redding III, Eric Hoehn, Tom Kramer and Rachel Chancey <small>(for \"End Game\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Sound Mixing for a Limited or Anthology Series or Movie</span></td><td>Eric Hirsch, Eric Hoehn, Roland Winke and Lawrence Manchester <small>(for \"End Game\")</small></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\"><span>TCA Awards</span></td><td rowspan=\"3\"><span>September 15, 2021</span></td><td><span>Program of the Year</span></td><td rowspan=\"2\"><i>The Queen's Gambit</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\" style=\"text-align:center;\"></td></tr><tr><td><span>Outstanding Achievement in Movies, Miniseries and Specials</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Individual Achievement in Drama</span></td><td>Anya Taylor-Joy</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"6\"><span class=\"mw-redirect\">Primetime Emmy Awards</span></td><td rowspan=\"6\"><span>September 19, 2021</span></td><td><span>Outstanding Limited or Anthology Series</span></td><td>William Horberg, Allan Scott, Scott Frank, Marcus Loges and Mick Aniceto</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"6\" style=\"text-align:center;\"></td></tr><tr><td><span>Outstanding Directing for a Limited or Anthology Series or Movie</span></td><td rowspan=\"2\">Scott Frank</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Writing for a Limited or Anthology Series or Movie</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Lead Actress in a Limited or Anthology Series or Movie</span></td><td>Anya Taylor-Joy</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Supporting Actor in a Limited or Anthology Series or Movie</span></td><td><span>Thomas Brodie-Sangster</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Outstanding Supporting Actress in a Limited or Anthology Series or Movie</span></td><td><span>Moses Ingram</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Gotham Awards</span></td><td><span>November 29, 2021</span></td><td><span>Outstanding Performance in a New Series</span></td><td>Anya Taylor-Joy</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td style=\"text-align:center;\"></td></tr><tr><td><span>Grammy Awards</span></td><td><span>April 3, 2022</span></td><td><span>Best Score Soundtrack for Visual Media</span></td><td>Carlos Rafael Rivera</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td style=\"text-align:center;\"></td></tr></tbody></table><h4>Chess community response</h4><p>The series received praise from the chess community for its realistic portrayal of the game and players. In an interview with Vanity Fair, Woman Grandmaster Jennifer Shahade said that the series \"completely nailed the chess accuracy\". In an article about the miniseries in The Times, British chess champion David Howell felt that the chess scenes were \"well choreographed and realistic\", while British Women's chess champion Jovanka Houska said, \"I think it's a fantastic TV series ...t conveys the emotion of chess really well.\" Houska stated that she related to Beth being one of the few women in a tournament, and noted that sexism was worse at the \"hobby\" level, especially for young girls. International Master Dorsa Derakhshani described the show as \"very, very accurate\" and that she was surprised at \"how actually strong the games are\".</p><p>Judit Polgár, who was the first woman to play for a world championship title, said that the show depicted the male players as \"too nice\", while chess streamer Andrea Botez also felt the show \"toned down\" the sexism in the chess world. Former British women's champion Sarah Longson said that realistically, Beth should have lost more. Reigning chess world champion Magnus Carlsen gave it 5 out of 6 stars but found it \"a little too unrealistic\" for how quickly Beth developed her skills.</p><h4>Lawsuit</h4><p>In the final episode of the mini-series, the women's world champion Nona Gaprindashvili is mentioned as having \"never faced men\", despite the real-life Gaprindashvili frequently playing against male opponents, including top-level grandmasters. In response, Gaprindashvili said it is dishonouring to have misinformation spread about someone's achievements. She sued Netflix for $5 million in a defamation lawsuit in September 2021, and called for the line that claimed she had never faced men to be removed. The case was settled in September 2022, on undisclosed terms.</p><h4>Interest in chess</h4><p>In November 2020, The Washington Post reported that the COVID-19 pandemic had already increased the public's interest in chess, but the popularity of The Queen's Gambit made it explode. The New York Times compared the interest in chess to the \"similar chess mania\" after Bobby Fischer beat Boris Spassky to become world champion in 1972. According to The Guardian, grandmaster Maurice Ashley has been inundated by messages from people – mainly women – enthused by the series: \"the frenzy around it is crazy\". Sales of chess sets rose greatly following the release of the series, with U.S. company Goliath Games stating their chess set sales increased over a thousand percent due to the series, while marketing firm NPD Group found chess book sales had increased over 600 percent. Chess.com reports several million new users since the release of the series, with a higher rate of registrations by female players compared to before the series. Chess instructors have stated that the demand for chess lessons has significantly increased as well.</p><br/><h3>Adaptations</h3><p>In early 2021, due to the success of the series, the theatrical rights to the Tevis novel were acquired with the intent of producing a musical.</p><br/><h3>Legacy</h3><p>Together with The Crown, another Netflix production, costumes from The Queen's Gambit were put on display by the Brooklyn Museum as part of its virtual exhibition \"The Queen and the Crown\".</p><br/>"
  },
  "errorMessage": ""
}