{
  "imDbId": "tt0417373",
  "title": "The Venture Bros.",
  "fullTitle": "The Venture Bros. (TV Series 2003–2018)",
  "type": "TVSeries",
  "year": "2003",
  "language": "en",
  "titleInLanguage": "The Venture Bros.",
  "url": "https://en.wikipedia.org/wiki/The_Venture_Bros.",
  "plotShort": {
    "plainText": "The Venture Bros. is an American adult animated action comedy television series created by Chris McCulloch (also known as \"Jackson Publick\") and Doc Hammer for Cartoon Network's late night programming block Adult Swim. Following a pilot episode on February 16, 2003, the series premiered on August 7, 2004.\r\nThe Venture Bros. was one of Adult Swim's longest-running original series in terms of years, and had the record for fewest seasons produced of a scripted show per year of continuous production, with seven produced seasons over fifteen years of production.\r\nThroughout its run, the series has received critical acclaim for its writing, characters, humor, animation, and world building. It ended its run on October 7, 2018, with a total of 81 episodes over the course of 7 seasons, as well as 4 specials. On September 7, 2020, series creator Jackson Publick announced on Twitter that the series had been canceled. A direct-to-video film, The Venture Bros.: Radiant Is the Blood of the Baboon Heart, is currently in production and will premiere on Adult Swim and Max. The film will act as a finale to the series.",
    "html": "<p>The Venture Bros. is an American adult animated action comedy television series created by Chris McCulloch (also known as \"Jackson Publick\") and Doc Hammer for Cartoon Network's late night programming block Adult Swim. Following a pilot episode on February 16, 2003, the series premiered on August 7, 2004.</p><p>The Venture Bros. was one of Adult Swim's longest-running original series in terms of years, and had the record for fewest seasons produced of a scripted show per year of continuous production, with seven produced seasons over fifteen years of production.</p><p>Throughout its run, the series has received critical acclaim for its writing, characters, humor, animation, and world building. It ended its run on October 7, 2018, with a total of 81 episodes over the course of 7 seasons, as well as 4 specials. On September 7, 2020, series creator Jackson Publick announced on Twitter that the series had been canceled. A direct-to-video film, The Venture Bros.: Radiant Is the Blood of the Baboon Heart, is currently in production and will premiere on Adult Swim and Max. The film will act as a finale to the series.</p>"
  },
  "plotFull": {
    "plainText": "The Venture Bros. is an American adult animated action comedy television series created by Chris McCulloch (also known as \"Jackson Publick\") and Doc Hammer for Cartoon Network's late night programming block Adult Swim. Following a pilot episode on February 16, 2003, the series premiered on August 7, 2004.\r\nThe Venture Bros. was one of Adult Swim's longest-running original series in terms of years, and had the record for fewest seasons produced of a scripted show per year of continuous production, with seven produced seasons over fifteen years of production.\r\nThroughout its run, the series has received critical acclaim for its writing, characters, humor, animation, and world building. It ended its run on October 7, 2018, with a total of 81 episodes over the course of 7 seasons, as well as 4 specials. On September 7, 2020, series creator Jackson Publick announced on Twitter that the series had been canceled. A direct-to-video film, The Venture Bros.: Radiant Is the Blood of the Baboon Heart, is currently in production and will premiere on Adult Swim and Max. The film will act as a finale to the series.\r\nPlot\r\nThe series chronicles the lives and adventures of the Venture family: emotionally insecure, unethical and underachieving super-scientist father Dr. Thaddeus \"Rusty\" Venture; his well-meaning but incompetent teenage fraternal twin sons Hank and Dean Venture; the family's bodyguard, secret agent Brock Samson, or his temporary replacement, the reformed villain and pederast Sergeant Hatred; and the family's self-proclaimed archnemesis, The Monarch, a butterfly-themed supervillain. Initially conceived as a satire of boy adventurer and Space Age fiction prevalent in the early 1960s, it is considered to be an action/adventure series with both comedic and dramatic elements.\r\nDevelopment\r\nShow creator McCulloch was one of the main writers for the Saturday morning animated series The Tick. He created The Venture Bros. storyline sometime prior to 2000. After working for the television program Sheep in the Big City and the live-action version of The Tick, McCulloch set to turning The Venture Bros. into an animated series. The Venture Bros. was originally conceived as a comic book story for an issue of Monkeysuit. McCulloch realized that his notes were too extensive for a short comics story and proposed that Comedy Central air The Venture Bros. as an animated series, but the network rejected it. Although the first draft of the pilot script was written in the spring of 2000, the premise was not greenlit until around the summer of 2002 by Adult Swim. McCulloch had not previously considered Cartoon Network because he \"didn't want to tone The Venture Bros. down,\" and was unaware of the existence of the network's late night adult-oriented programming block, Adult Swim.\r\nWith the revised pilot, production began in autumn of that year, and the pilot was first run on February 16, 2003. The first season of the series was completed and premiered in 2004, and it was added to the summer schedule in August.\r\nCharacters\r\nThe characters of The Venture Bros. are largely re-imaginings of characters from Jonny Quest as well as comic book superheroes and supervillains.\r\nDr. Thaddeus \"Rusty\" Venture (voiced by James Urbaniak), a former boy adventurer and inspiration for the \"Rusty Venture\" cartoon series, runs what remains of Venture Industries, a once-leading global corporation established by his super-scientist adventurer father Jonas. Since Jonas's death, Venture Industries has declined to a shadow of its former glory, now occupying only a portion of the vast and deteriorating Venture compound and external locations including a base on Spider Skull Island, which his father captured, and the space station Gargantua-1, which his father built. Rusty dropped out of college shortly after his father's death and his academic credentials have been questioned. It is stated he only holds an honorary degree from a Tijuana community college. He attempts to follow in his father's footsteps by becoming a super-scientist himself. His competence frequently falls short of his father's and he often demonstrates questionable ethics, leading others to claim that his occasional successes merely capitalize on the work of his late father.\r\nHank (voiced by McCulloch) and Dean Venture (voiced by Michael Sinterniklaas) are the titular fraternal twin brothers of the show. Hank is the more adventurous and Dean is the more timid and bookish of the two brothers. The two teenaged brothers often wind up in perilous situations, and (as revealed in the second season) have been killed over a dozen times, only to be replaced with exact clones who have no memory of their own deaths. The title The Venture Bros. has taken on different meanings throughout the series with the introduction of Rusty's fraternal twin brother Jonas Jr., and Hank and Dean's illegitimate paternal half-brother, Dermott Fictel. The identity of Hank and Dean's mother remains the subject of some debate.\r\nBrock Samson (voiced by Patrick Warburton) is the longstanding bodyguard to the Venture family. Appointed by the Office of Secret Intelligence (OSI), the muscular and hyper-masculine Brock frequently uses his license to kill to protect the Venture family from any threat with sudden and brutal violence. He is a ruthless (and somewhat sadistic) hand-to-hand combatant, usually preferring to use a combat knife, his hands and feet, or his vintage Dodge Charger rather than firearms; the Monarch refers to him fearfully as Venture's \"Swedish murder machine\" (\"Dia de Los Dangerous!\"). In the fourth season, Brock Samson is replaced as a bodyguard by Sergeant Hatred (voiced by McCulloch), a former supervillain. Prior to becoming their bodyguard, Hatred was assigned to be the Venture family's arch-enemy. Hatred is also a \"cured\" pedophile; his pedophilia is actually controlled by an experimental drug (\"Nomolestol\") given to him by the OSI and its effectiveness has varied wildly between episodes. Season 6 sees Samson return to his position as the Venture's official bodyguard while Sgt. Hatred becomes security for the new Venture compound in New York City.\r\nDr. Venture's deceased father, Dr. Jonas Venture (voiced by Paul Boocock), was the model super-scientist of his day. He was a visionary who changed the world with his inventions and stands as the inspiration for most other protagonists in the series. He formed \"Team Venture\", a collection of friends and associates that helped him fight crime and subsequently save his son (Dr. Venture) from his arch-enemies. To help his son cope without a mother figure, he developed a loyal and rather emotional robot named H.E.L.P.eR. (listed in episode credits as voiced by \"Soul-Bot\") that accompanies and assists the Ventures. Early in the series, he was portrayed as a model man and father. However, later episodes show him as callous and uncaring about his son's well-being, while showcasing questionable ethics, both medically and socially. In the fourth-season episode \"Self-Medication\", there is a scene showing the young Rusty Venture receiving psychotherapy from his father. As Rusty says that he longs for a normal childhood, Jonas interrupts him and insists that he is ungrateful for the opportunities given to him. In general, Jonas' portrayal has shown him to be less and less of a sympathetic character as the series progresses.\r\nThroughout the series, the Venture family has had various recurring antagonists. Many are current or former members of The Guild of Calamitous Intent, an organization founded to save mankind from self-destruction but which now serves as an ad hoc placement agency matching super villains with appropriate heroic nemeses. The organization is run by the mysterious leader known only as \"The Sovereign\", who is revealed to be real-life rock star David Bowie in episode 26, though in episode 5 of the 5th season it is revealed that The Sovereign is actually a shape-shifter who frequently appears as Bowie.\r\nThe Venture Family's primary nemesis is the pernicious but ineffective super-villain the Monarch (voiced by McCulloch). Assuming the motif of a monarch butterfly and \"arching\" Dr. Venture since college, the Monarch will stop at nothing to antagonize Dr. Venture (even though his motive is unknown). Accompanying the Monarch is the masculine-voiced Dr. Girlfriend (voiced by Hammer), referred to by the Monarch as \"Dr. Mrs. The Monarch\" after their wedding.\r\nBaron Werner Ünterbheit (voiced by T. Ryder Smith) is a former dictator of Ünterland and bears a grudge against Venture. He blames Venture for the loss of his jaw in college, citing \"One is always supposed to look out for one's lab partner!\". The season three premiere reveals that the Monarch was responsible for the explosion that destroyed Ünterbheit's jaw, in an early attempt to kill Venture.\r\nPhantom Limb (voiced by James Urbaniak) is a ruthless killer, villain insurance agent, and high-ranking Guild member (or was until he tried to usurp the Sovereign). Also, he was the former lover of Dr. Girlfriend before she left him to become The Monarch's companion.\r\nThe Ventures' friends and acquaintances include expert necromancer Doctor Byron Orpheus (voiced by Steven Rattazzi) and his apathetic, teenage goth daughter Triana (voiced by Lisa Hammer), who rent a portion of the Venture Compound; the albino computer scientist Pete White (voiced by McCulloch), a former college friend of Dr. Venture's; hydrocephalic \"boy genius\" Master Billy Quizboy (voiced by Hammer); and Dr. Jonas Venture, Jr. (voiced by James Urbaniak), Dr. Venture's formerly parasitic fraternal twin brother who has succeeded in all of the areas that Rusty does not. Surviving members of the original Team Venture have also appeared as well as Dr. Orpheus's teammates in the Order of the Triad.\r\nEpisodes\r\nMost episodes begin with a cold open and are shot to appear to be in letter-box format. Almost every episode features both a smash cut into the end credits, and a short scene following the credits. The second season of the series premiered on the internet via Adult Swim Fix on June 23, 2006, and on television on June 25, 2006; the season finished on October 15, 2006. The considerable delay between the end of the first season and the start of the second was partially caused by Adult Swim's delay in deciding whether to renew the show, primarily because the show is drawn and inked in the traditional animation style (albeit digitally), causing each episode to take considerable time to move through production. Additionally, the producers were dealing with the time constraints of producing a first-season DVD that contained live action interviews and commentary for several episodes.\r\nThe third season began on June 1, 2008, and marked the beginning of the show's broadcast in high-definition. A 15-minute rough cut of \"The Doctor Is Sin\" aired on April 1, 2008, as part of Adult Swim's April Fool's Day theme of airing sneak peeks of new episodes. The fourth season was split into two segments airing a year apart, with the first eight episodes airing in the fall of 2009 and the remaining episodes in fall of 2010. A note contained in the closing credits of the Season 4 finale indicated that the series would continue into the fifth season.\r\nOn February 6, 2013, it was announced that Season 5 would premiere on May 19, 2013. This was later shifted to June 2, 2013, at midnight.\r\nOn July 8, 2013, Doc Hammer and Jackson Publick stated in an interview with Slate Magazine that they had begun writing the sixth season as of Summer 2013 and that it would enter full-production in September 2013. They tentatively stated that Season 6 would premiere in Fall of 2014, or very early 2015 at the latest. This estimated season-debut date turned out to be extremely premature as Season 6 premiered at Midnight, February 1, 2016.\r\nJackson Publick confirmed on Twitter that Season 7 of The Venture Brothers would be aired on Adult Swim in \"Summer\" 2018. On June 27, it was confirmed via Adult Swim's Instagram page that Season 7 would begin August 5, 2018. For this season, Publick stepped back from directing, assuming the role of supervising director. Two-time directing partner and storyboard director for season six, Juno Lee, took over as the series director. Barry J. Kelly also served as Lee's co-director.\r\nSince the first season, two credits have changed every episode. Soul-bot's \"voicing\" the character H.E.L.P.eR., and another as a nickname for animation director Kimson Albert. Each nickname is a quote from its respective episode; Albert left the series after several seasons. In season two, each end credit sequence holds a different additional (fake) duty for AstroBase Go!.\r\nCancellation\r\nAfter the conclusion of the seventh season in October 2018, the series was announced to be renewed for an eighth and final season. On September 5, 2020, one of the show's illustrators, Ken Plume, tweeted that The Venture Bros. was cancelled. Jackson Publick confirmed two days later that the show was cancelled. The script for Season 8 had been partially written at the time of its cancellation a few months before the public announcement.\r\nFilm\r\nFollowing the announcement, Adult Swim stated via Twitter that \"We also want more Venture Bros. and have been working with Jackson and Doc to find another way to continue the Venture Bros. story\". On November 13, 2020, HBO Max general manager Andy Forssell tweeted that HBO Max was \"working on\" reviving The Venture Bros. On May 12, 2021, it was announced that a direct-to-video film The Venture Bros.: Radiant Is the Blood of the Baboon Heart is in production from Adult Swim, which will conclude the story from the series, and air on HBO Max 90 days after its home video release.\r\nInternational broadcast\r\nIn Canada, The Venture Bros. previously aired on Teletoon's Teletoon at Night block and later G4's Adult Digital Distraction block. The series currently airs on the Canadian version of Adult Swim.\r\nThemes, homages, and references\r\nJonny Quest\r\nThe series' principal reference is to the 1964 animated science fiction adventure television series Jonny Quest, as it is the basis for many of the main characters. Dr. Venture is modelled after what a child such as Jonny Quest might have grown up to be like after having lived through a childhood filled with bizarre, life-threatening events. Brock is modelled on Race Bannon. The Venture boys are based on the Hardy Boys and take the places of Jonny and Hadji. In the episode \"Ice Station – Impossible!\", Brock mentions that he had served with Race Bannon on several occasions. He regards his fellow agent with respect calling him \"one of the best\". One newspaper critic remarked, \"If filmmakers Woody Allen and Sam Peckinpah had collaborated on Jonny Quest, it would have come out a lot like this.\" In season 2, Jonny Quest was introduced into the show as \"Action Jonny\", a homeless drug addict who deeply resents his father. As of season 4, Jonny is somewhat stable, and in a support group for former boy adventurers, along with Dr. Venture, the second Wonder Boy, RoBoy, and the Hale Brothers—the final three being parodies of Robin, Astro Boy, and the Hardy Boys, respectively.\r\nFailure as a recurring theme\r\nPublick and Hammer have stated that one of the primary themes of The Venture Bros. is failure. Hammer in 2006 said, \"Yeah, failure, that's what Venture Bros. is all about. Beautiful sublime failure.\"\r\nIn the commentary for the episode \"Home Insecurity\", Hammer and Publick elaborated on the theme.\r\nPublick: \"This show... If you'll permit me to get a 'big picture', this show is actually all about failure. Even in the design, everything is supposed to be kinda the death of the space-age dream world. The death of the jet-age promises.\" Hammer: \"It's about the beauty of failure. It's about that failure happens to all of us...Every character is not only flawed, but sucks at what they do, and is beautiful at it and Jackson and I suck at what we do, and we try to be beautiful at it, and failure is how you get by...It shows that failure's funny, and it's beautiful and it's life, and it's okay, and it's all we can write because we are big...failures. (laughter)\"\r\nIn 2013, Publick and Hammer discussed moving away from the theme and embracing the \"successes\" of the characters as well.\r\nPublick: I think you and I are both sick of every interview mentioning the \"It's a show about failure\" from five years ago. I don't think we made a conscious effort to fight that or anything, but every year, we push what we do as writers a little more. An area we hadn't gone into very much was positivity. I mean, all our victories are still satiric, but there are definitely places where we said, \"I want to see these guys do something. I don't want to just have everything fall on its face all the time.\r\nLGBTQ representation\r\nIn the series, the character of Colonel Horace Gentleman is humorously portrayed as having a lustful attraction to younger men, which he does not hide. He has an ex-wife, Mz. Quymn, as indicated in the episode \"Dr. Quymn, Medicine Woman,\" and a former lover, Kiki, shown in the episode \"Past Tense,\" who he lived with at his home in Tangiers, Morocco for years. Also, The Alchemist and Shore Leave were in an on-again, off-again relationship, shown in episodes such as \"Fallen Arches.\" According to the show creators, The Alchemist is gay in a way that is \"just incidental\" while Shore Leave is a very \"openly swishy queer proud guy.\" The same show also features Virginia \"Ginnie\" Dunne. She is Dr. Quymn's bodyguard, is very masculine, and a reported \"man-hater.\". In the episode \"Dr. Quymn, Medicine Woman,\" she is shown to be a lesbian who is trying to convert Dr. Quymn.\r\nReception\r\nThe show has received critical acclaim over its run. The Venture Bros. ranked at #56 on the IGN \"Best 100 Animated Series\" list. In 2013, Slate's Chris Wade called The Venture Bros. \"one of the best shows on television\" and praised the detailed serial nature of the humor with a favorable comparison to Arrested Development. Also in 2013, The Atlantic's Armin Rosen compared the show favourably to The Simpsons, noting that the two shows held the same \"slacker optimism\" and great comedy. The A.V. Club's Zach Handlen commented in 2012 that the show had evolved over its seasons into a \"meta-commentary on a whole sub-section of male nerd culture\" and that it had become one of the funniest contemporary shows.\r\nCritical reception to the first season was more mixed than later seasons but was still mostly positive. The A.V. Club's Emily VanDerWerff felt that the pop-culture references of the first season fell flat, especially in the beginning of the season, but grew better and funnier as the show's emotional core took hold. Mike Drucker, writing for IGN, criticized the predictability of some first-season episodes, but noted that the show was \"a refreshing cartoon because it willingly indulges in the sitcom fad of the '90s\".\r\nIn 2013 IGN placed The Venture Bros. as number 12 on their list of Top 25 animated series for adults. In January 2021, Sean Cubillas of Comic Book Resources (CBR) described the series as \"one of the most well-written superhero series of all time,\" a stand-out in the field of adult animation, and said it had \"witty writing, tot pacing, and large yet complex cast of characters.\"\r\nHome media\r\nThe first season of The Venture Bros. on DVD was released on May 30, 2006, as officially announced by Warner Home Video. It coincided with the June 25 premiere of the second season. Originally, it was scheduled for March 14, 2006, but was delayed until May 30, 2006. The DVD packaging and interior art was created by comic artist Bill Sienkiewicz. On May 31, 2006, the season one DVD reached #1 on Amazon's top selling DVDs list.\r\nOn March 27, 2010, series creator Jackson Publick revealed on his Livejournal that a standard definition DVD of the first half of season 4 would likely be released sometime between July and October 2010, with a DVD of the second half of the season and a Blu-ray box set of the entire season to be released after the full season has aired.\r\nOn March 28, 2023, it was announced the series will have a complete series DVD set which will be released on June 13, 2023 from Warner Bros. Discovery Home Entertainment. It will also be released on digital.\r\nThe first four seasons are available in the UK (both halves of Season 4 are sold as a set). Madman Entertainment have also released all seven seasons on DVD in Australia. No Blu-ray editions have yet been released in Australia. It's also the first Adult Swim series in Australia to be given a restricted MA15+ rating for Season 1 and later the higher R18+ rating for Season 4 Part 2.\r\nThe \"lost DVD commentary\"\r\nJackson Publick revealed that he and Doc Hammer had recorded a commentary track for the season one episode \"Home Insecurity\". Warner Home Video chose to omit this track from the Season One DVD due to space limitations and some minor sound quality issues. Publick also stated that the commentary could be downloaded.\r\nSoundtrack CD\r\nFor the video release of the Season 3, a soundtrack album was also released, titled The Venture Bros.: The Music of JG Thirlwell. This is the same audio CD included as a bonus with the Blu-ray version of Season 3. While the CD release was originally made available at Adult Swim's website, it was given a wide release on May 12, 2009; the vinyl LP release came out a month earlier. It can also be downloaded from most major digital retailers. The CD features 20 tracks, while the vinyl LP release is 16 tracks and a download link of the complete release including the songs omitted from the LP.\r\nMusic of The Venture Bros: Vol 2 was released digitally on April 10, 2016 and on CD and Vinyl on June 3, 2016. The album was released on Thirlwell's own Ectopic Ents label in collaboration with Williams Street Records.",
    "html": "<p>The Venture Bros. is an American adult animated action comedy television series created by Chris McCulloch (also known as \"Jackson Publick\") and Doc Hammer for Cartoon Network's late night programming block Adult Swim. Following a pilot episode on February 16, 2003, the series premiered on August 7, 2004.</p><p>The Venture Bros. was one of Adult Swim's longest-running original series in terms of years, and had the record for fewest seasons produced of a scripted show per year of continuous production, with seven produced seasons over fifteen years of production.</p><p>Throughout its run, the series has received critical acclaim for its writing, characters, humor, animation, and world building. It ended its run on October 7, 2018, with a total of 81 episodes over the course of 7 seasons, as well as 4 specials. On September 7, 2020, series creator Jackson Publick announced on Twitter that the series had been canceled. A direct-to-video film, The Venture Bros.: Radiant Is the Blood of the Baboon Heart, is currently in production and will premiere on Adult Swim and Max. The film will act as a finale to the series.</p><br/><h3>Plot</h3><p>The series chronicles the lives and adventures of the Venture family: emotionally insecure, unethical and underachieving super-scientist father Dr. Thaddeus \"Rusty\" Venture; his well-meaning but incompetent teenage fraternal twin sons Hank and Dean Venture; the family's bodyguard, secret agent Brock Samson, or his temporary replacement, the reformed villain and pederast Sergeant Hatred; and the family's self-proclaimed archnemesis, The Monarch, a butterfly-themed supervillain. Initially conceived as a satire of boy adventurer and Space Age fiction prevalent in the early 1960s, it is considered to be an action/adventure series with both comedic and dramatic elements.</p><br/><h3>Development</h3><p>Show creator McCulloch was one of the main writers for the Saturday morning animated series The Tick. He created The Venture Bros. storyline sometime prior to 2000. After working for the television program Sheep in the Big City and the live-action version of The Tick, McCulloch set to turning The Venture Bros. into an animated series. The Venture Bros. was originally conceived as a comic book story for an issue of Monkeysuit. McCulloch realized that his notes were too extensive for a short comics story and proposed that Comedy Central air The Venture Bros. as an animated series, but the network rejected it. Although the first draft of the pilot script was written in the spring of 2000, the premise was not greenlit until around the summer of 2002 by Adult Swim. McCulloch had not previously considered Cartoon Network because he \"didn't want to tone The Venture Bros. down,\" and was unaware of the existence of the network's late night adult-oriented programming block, Adult Swim.</p><p>With the revised pilot, production began in autumn of that year, and the pilot was first run on February 16, 2003. The first season of the series was completed and premiered in 2004, and it was added to the summer schedule in August.</p><br/><h3>Characters</h3><p>The characters of The Venture Bros. are largely re-imaginings of characters from Jonny Quest as well as comic book superheroes and supervillains.</p><ul><li>Dr. Thaddeus \"Rusty\" Venture (voiced by James Urbaniak), a former boy adventurer and inspiration for the \"Rusty Venture\" cartoon series, runs what remains of Venture Industries, a once-leading global corporation established by his super-scientist adventurer father Jonas. Since Jonas's death, Venture Industries has declined to a shadow of its former glory, now occupying only a portion of the vast and deteriorating Venture compound and external locations including a base on Spider Skull Island, which his father captured, and the space station Gargantua-1, which his father built. Rusty dropped out of college shortly after his father's death and his academic credentials have been questioned. It is stated he only holds an honorary degree from a Tijuana community college. He attempts to follow in his father's footsteps by becoming a super-scientist himself. His competence frequently falls short of his father's and he often demonstrates questionable ethics, leading others to claim that his occasional successes merely capitalize on the work of his late father.</li><li>Hank (voiced by McCulloch) and Dean Venture (voiced by Michael Sinterniklaas) are the titular fraternal twin brothers of the show. Hank is the more adventurous and Dean is the more timid and bookish of the two brothers. The two teenaged brothers often wind up in perilous situations, and (as revealed in the second season) have been killed over a dozen times, only to be replaced with exact clones who have no memory of their own deaths. The title The Venture Bros. has taken on different meanings throughout the series with the introduction of Rusty's fraternal twin brother Jonas Jr., and Hank and Dean's illegitimate paternal half-brother, Dermott Fictel. The identity of Hank and Dean's mother remains the subject of some debate.</li><li>Brock Samson (voiced by Patrick Warburton) is the longstanding bodyguard to the Venture family. Appointed by the Office of Secret Intelligence (OSI), the muscular and hyper-masculine Brock frequently uses his license to kill to protect the Venture family from any threat with sudden and brutal violence. He is a ruthless (and somewhat sadistic) hand-to-hand combatant, usually preferring to use a combat knife, his hands and feet, or his vintage Dodge Charger rather than firearms; the Monarch refers to him fearfully as Venture's \"Swedish murder machine\" (\"Dia de Los Dangerous!\"). In the fourth season, Brock Samson is replaced as a bodyguard by Sergeant Hatred (voiced by McCulloch), a former supervillain. Prior to becoming their bodyguard, Hatred was assigned to be the Venture family's arch-enemy. Hatred is also a \"cured\" pedophile; his pedophilia is actually controlled by an experimental drug (\"Nomolestol\") given to him by the OSI and its effectiveness has varied wildly between episodes. Season 6 sees Samson return to his position as the Venture's official bodyguard while Sgt. Hatred becomes security for the new Venture compound in New York City.</li><li>Dr. Venture's deceased father, Dr. Jonas Venture (voiced by Paul Boocock), was the model super-scientist of his day. He was a visionary who changed the world with his inventions and stands as the inspiration for most other protagonists in the series. He formed \"Team Venture\", a collection of friends and associates that helped him fight crime and subsequently save his son (Dr. Venture) from his arch-enemies. To help his son cope without a mother figure, he developed a loyal and rather emotional robot named H.E.L.P.eR. (listed in episode credits as voiced by \"Soul-Bot\") that accompanies and assists the Ventures. Early in the series, he was portrayed as a model man and father. However, later episodes show him as callous and uncaring about his son's well-being, while showcasing questionable ethics, both medically and socially. In the fourth-season episode \"Self-Medication\", there is a scene showing the young Rusty Venture receiving psychotherapy from his father. As Rusty says that he longs for a normal childhood, Jonas interrupts him and insists that he is ungrateful for the opportunities given to him. In general, Jonas' portrayal has shown him to be less and less of a sympathetic character as the series progresses.</li></ul><p>Throughout the series, the Venture family has had various recurring antagonists. Many are current or former members of The Guild of Calamitous Intent, an organization founded to save mankind from self-destruction but which now serves as an ad hoc placement agency matching super villains with appropriate heroic nemeses. The organization is run by the mysterious leader known only as \"The Sovereign\", who is revealed to be real-life rock star David Bowie in episode 26, though in episode 5 of the 5th season it is revealed that The Sovereign is actually a shape-shifter who frequently appears as Bowie.</p><ul><li>The Venture Family's primary nemesis is the pernicious but ineffective super-villain the Monarch (voiced by McCulloch). Assuming the motif of a monarch butterfly and \"arching\" Dr. Venture since college, the Monarch will stop at nothing to antagonize Dr. Venture (even though his motive is unknown). Accompanying the Monarch is the masculine-voiced Dr. Girlfriend (voiced by Hammer), referred to by the Monarch as \"Dr. Mrs. The Monarch\" after their wedding.</li><li>Baron Werner Ünterbheit (voiced by T. Ryder Smith) is a former dictator of Ünterland and bears a grudge against Venture. He blames Venture for the loss of his jaw in college, citing \"One is always supposed to look out for one's lab partner!\". The season three premiere reveals that the Monarch was responsible for the explosion that destroyed Ünterbheit's jaw, in an early attempt to kill Venture.</li><li>Phantom Limb (voiced by James Urbaniak) is a ruthless killer, villain insurance agent, and high-ranking Guild member (or was until he tried to usurp the Sovereign). Also, he was the former lover of Dr. Girlfriend before she left him to become The Monarch's companion.</li><li>The Ventures' friends and acquaintances include expert necromancer Doctor Byron Orpheus (voiced by Steven Rattazzi) and his apathetic, teenage goth daughter Triana (voiced by Lisa Hammer), who rent a portion of the Venture Compound; the albino computer scientist Pete White (voiced by McCulloch), a former college friend of Dr. Venture's; hydrocephalic \"boy genius\" Master Billy Quizboy (voiced by Hammer); and Dr. Jonas Venture, Jr. (voiced by James Urbaniak), Dr. Venture's formerly parasitic fraternal twin brother who has succeeded in all of the areas that Rusty does not. Surviving members of the original Team Venture have also appeared as well as Dr. Orpheus's teammates in the Order of the Triad.</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"3\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th><th scope=\"col\" style=\"padding:0 8px\">Network</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"3\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Pilot</span></span></span></span></th><td colspan=\"2\" style=\"padding:0.2em 0.4em\">February 16, 2003</td><td rowspan=\"15\"><span>Adult Swim</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">August 7, 2004</td><td style=\"padding:0 8px\">October 30, 2004</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"3\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Special</span></span></span></span></th><td colspan=\"2\" style=\"padding:0.2em 0.4em\">December 19, 2004</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 25, 2006</td><td style=\"padding:0 8px\">October 15, 2006</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 1, 2008</td><td style=\"padding:0 8px\">August 24, 2008</td></tr><tr style=\"height:100%\"><th scope=\"row\" rowspan=\"2\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"1\" rowspan=\"2\">16</td><td colspan=\"1\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">October 18, 2009</td><td style=\"padding:0 8px\">December 13, 2009</td></tr><tr style=\"height:100%\"><td colspan=\"1\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 12, 2010</td><td style=\"padding:0 8px\">November 21, 2010</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"3\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Special</span></span></span></span></th><td colspan=\"2\" style=\"padding:0.2em 0.4em\">August 28, 2011</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"3\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Special</span></span></span></span></th><td colspan=\"2\" style=\"padding:0.2em 0.4em\">October 28, 2012</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 2, 2013</td><td style=\"padding:0 8px\">July 21, 2013</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"3\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Special</span></span></span></span></th><td colspan=\"2\" style=\"padding:0.2em 0.4em\">January 19, 2015</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 31, 2016</td><td style=\"padding:0 8px\">March 20, 2016</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>7</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">August 5, 2018</td><td style=\"padding:0 8px\">October 7, 2018</td></tr></tbody></table><p>Most episodes begin with a cold open and are shot to appear to be in letter-box format. Almost every episode features both a smash cut into the end credits, and a short scene following the credits. The second season of the series premiered on the internet via Adult Swim Fix on June 23, 2006, and on television on June 25, 2006; the season finished on October 15, 2006. The considerable delay between the end of the first season and the start of the second was partially caused by Adult Swim's delay in deciding whether to renew the show, primarily because the show is drawn and inked in the traditional animation style (albeit digitally), causing each episode to take considerable time to move through production. Additionally, the producers were dealing with the time constraints of producing a first-season DVD that contained live action interviews and commentary for several episodes.</p><p>The third season began on June 1, 2008, and marked the beginning of the show's broadcast in high-definition. A 15-minute rough cut of \"The Doctor Is Sin\" aired on April 1, 2008, as part of Adult Swim's April Fool's Day theme of airing sneak peeks of new episodes. The fourth season was split into two segments airing a year apart, with the first eight episodes airing in the fall of 2009 and the remaining episodes in fall of 2010. A note contained in the closing credits of the Season 4 finale indicated that the series would continue into the fifth season.</p><p>On February 6, 2013, it was announced that Season 5 would premiere on May 19, 2013. This was later shifted to June 2, 2013, at midnight.</p><p>On July 8, 2013, Doc Hammer and Jackson Publick stated in an interview with Slate Magazine that they had begun writing the sixth season as of Summer 2013 and that it would enter full-production in September 2013. They tentatively stated that Season 6 would premiere in Fall of 2014, or very early 2015 at the latest. This estimated season-debut date turned out to be extremely premature as Season 6 premiered at Midnight, February 1, 2016.</p><p>Jackson Publick confirmed on Twitter that Season 7 of The Venture Brothers would be aired on Adult Swim in \"Summer\" 2018. On June 27, it was confirmed via Adult Swim's Instagram page that Season 7 would begin August 5, 2018. For this season, Publick stepped back from directing, assuming the role of supervising director. Two-time directing partner and storyboard director for season six, Juno Lee, took over as the series director. Barry J. Kelly also served as Lee's co-director.</p><p>Since the first season, two credits have changed every episode. Soul-bot's \"voicing\" the character H.E.L.P.eR., and another as a nickname for animation director Kimson Albert. Each nickname is a quote from its respective episode; Albert left the series after several seasons. In season two, each end credit sequence holds a different additional (fake) duty for AstroBase Go!.</p><br/><h3>Cancellation</h3><p>After the conclusion of the seventh season in October 2018, the series was announced to be renewed for an eighth and final season. On September 5, 2020, one of the show's illustrators, Ken Plume, tweeted that The Venture Bros. was cancelled. Jackson Publick confirmed two days later that the show was cancelled. The script for Season 8 had been partially written at the time of its cancellation a few months before the public announcement.</p><h4>Film</h4><p>Following the announcement, Adult Swim stated via Twitter that \"We also want more Venture Bros. and have been working with Jackson and Doc to find another way to continue the Venture Bros. story\". On November 13, 2020, HBO Max general manager Andy Forssell tweeted that HBO Max was \"working on\" reviving The Venture Bros. On May 12, 2021, it was announced that a direct-to-video film The Venture Bros.: Radiant Is the Blood of the Baboon Heart is in production from Adult Swim, which will conclude the story from the series, and air on HBO Max 90 days after its home video release.</p><br/><h3>International broadcast</h3><p>In Canada, The Venture Bros. previously aired on Teletoon's Teletoon at Night block and later G4's Adult Digital Distraction block. The series currently airs on the Canadian version of Adult Swim.</p><br/><h3>Themes, homages, and references</h3><h4>Jonny Quest</h4><p>The series' principal reference is to the 1964 animated science fiction adventure television series Jonny Quest, as it is the basis for many of the main characters. Dr. Venture is modelled after what a child such as Jonny Quest might have grown up to be like after having lived through a childhood filled with bizarre, life-threatening events. Brock is modelled on Race Bannon. The Venture boys are based on the Hardy Boys and take the places of Jonny and Hadji. In the episode \"Ice Station – Impossible!\", Brock mentions that he had served with Race Bannon on several occasions. He regards his fellow agent with respect calling him \"one of the best\". One newspaper critic remarked, \"If filmmakers Woody Allen and Sam Peckinpah had collaborated on Jonny Quest, it would have come out a lot like this.\" In season 2, Jonny Quest was introduced into the show as \"Action Jonny\", a homeless drug addict who deeply resents his father. As of season 4, Jonny is somewhat stable, and in a support group for former boy adventurers, along with Dr. Venture, the second Wonder Boy, RoBoy, and the Hale Brothers—the final three being parodies of Robin, Astro Boy, and the Hardy Boys, respectively.</p><h4>Failure as a recurring theme</h4><p>Publick and Hammer have stated that one of the primary themes of The Venture Bros. is failure. Hammer in 2006 said, \"Yeah, failure, that's what Venture Bros. is all about. Beautiful sublime failure.\"</p><p>In the commentary for the episode \"Home Insecurity\", Hammer and Publick elaborated on the theme.</p><blockquote>Publick: \"This show... If you'll permit me to get a 'big picture', this show is actually all about failure. Even in the design, everything is supposed to be kinda the death of the space-age dream world. The death of the jet-age promises.\" Hammer: \"It's about the beauty of failure. It's about that failure happens to all of us...Every character is not only flawed, but sucks at what they do, and is beautiful at it and Jackson and I suck at what we do, and we try to be beautiful at it, and failure is how you get by...It shows that failure's funny, and it's beautiful and it's life, and it's okay, and it's all we can write because we are big...failures. (laughter)\"</blockquote><p>In 2013, Publick and Hammer discussed moving away from the theme and embracing the \"successes\" of the characters as well.</p><blockquote>Publick: I think you and I are both sick of every interview mentioning the \"It's a show about failure\" from five years ago. I don't think we made a conscious effort to fight that or anything, but every year, we push what we do as writers a little more. An area we hadn't gone into very much was positivity. I mean, all our victories are still satiric, but there are definitely places where we said, \"I want to see these guys do something. I don't want to just have everything fall on its face all the time.</blockquote><h4>LGBTQ representation</h4><p>In the series, the character of Colonel Horace Gentleman is humorously portrayed as having a lustful attraction to younger men, which he does not hide. He has an ex-wife, Mz. Quymn, as indicated in the episode \"Dr. Quymn, Medicine Woman,\" and a former lover, Kiki, shown in the episode \"Past Tense,\" who he lived with at his home in Tangiers, Morocco for years. Also, The Alchemist and Shore Leave were in an on-again, off-again relationship, shown in episodes such as \"Fallen Arches.\" According to the show creators, The Alchemist is gay in a way that is \"just incidental\" while Shore Leave is a very \"openly swishy queer proud guy.\" The same show also features Virginia \"Ginnie\" Dunne. She is Dr. Quymn's bodyguard, is very masculine, and a reported \"man-hater.\". In the episode \"Dr. Quymn, Medicine Woman,\" she is shown to be a lesbian who is trying to convert Dr. Quymn.</p><br/><h3>Reception</h3><p>The show has received critical acclaim over its run. The Venture Bros. ranked at #56 on the IGN \"Best 100 Animated Series\" list. In 2013, Slate's Chris Wade called The Venture Bros. \"one of the best shows on television\" and praised the detailed serial nature of the humor with a favorable comparison to Arrested Development. Also in 2013, The Atlantic's Armin Rosen compared the show favourably to The Simpsons, noting that the two shows held the same \"slacker optimism\" and great comedy. The A.V. Club's Zach Handlen commented in 2012 that the show had evolved over its seasons into a \"meta-commentary on a whole sub-section of male nerd culture\" and that it had become one of the funniest contemporary shows.</p><p>Critical reception to the first season was more mixed than later seasons but was still mostly positive. The A.V. Club's Emily VanDerWerff felt that the pop-culture references of the first season fell flat, especially in the beginning of the season, but grew better and funnier as the show's emotional core took hold. Mike Drucker, writing for IGN, criticized the predictability of some first-season episodes, but noted that the show was \"a refreshing cartoon because it willingly indulges in the sitcom fad of the '90s\".</p><p>In 2013 IGN placed The Venture Bros. as number 12 on their list of Top 25 animated series for adults. In January 2021, Sean Cubillas of Comic Book Resources (CBR) described the series as \"one of the most well-written superhero series of all time,\" a stand-out in the field of adult animation, and said it had \"witty writing, tot pacing, and large yet complex cast of characters.\"</p><br/><h3>Home media</h3><p>The first season of The Venture Bros. on DVD was released on May 30, 2006, as officially announced by Warner Home Video. It coincided with the June 25 premiere of the second season. Originally, it was scheduled for March 14, 2006, but was delayed until May 30, 2006. The DVD packaging and interior art was created by comic artist Bill Sienkiewicz. On May 31, 2006, the season one DVD reached #1 on Amazon's top selling DVDs list.</p><p>On March 27, 2010, series creator Jackson Publick revealed on his Livejournal that a standard definition DVD of the first half of season 4 would likely be released sometime between July and October 2010, with a DVD of the second half of the season and a Blu-ray box set of the entire season to be released after the full season has aired.</p><p>On March 28, 2023, it was announced the series will have a complete series DVD set which will be released on June 13, 2023 from Warner Bros. Discovery Home Entertainment. It will also be released on digital.</p><p>The first four seasons are available in the UK (both halves of Season 4 are sold as a set). Madman Entertainment have also released all seven seasons on DVD in Australia. No Blu-ray editions have yet been released in Australia. It's also the first Adult Swim series in Australia to be given a restricted MA15+ rating for Season 1 and later the higher R18+ rating for Season 4 Part 2.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"3\" rowspan=\"2\">Season</th><th colspan=\"2\" rowspan=\"2\">Episodes</th><th>Release date</th><th rowspan=\"2\">Additional Information</th></tr><tr><th>Region 1</th></tr><tr><th style=\"background:#000\"></th><th><span>1</span></th><td>2004</td><td colspan=\"2\">13</td><td>May 30, 2006</td><td style=\"text-align: left\">This two-disc set includes all thirteen episodes from the first season. The episodes are presented as broadcast, with <span class=\"mw-redirect\">bleeped</span> profanity. Bonus features include \"The Terrible Secret of Turtle Bay\" (the <span class=\"mw-redirect\">pilot</span>) and \"A Very Venture Christmas\", deleted scenes, behind the scenes mockumentary with the Venture Bros. Cast and creators <span class=\"mw-redirect\">commentaries</span> on \"Mid-Life Chrysalis\", \"Eeney, Meeney, Miney... Magic!\", \"Tag Sale – You're It!\", \"Ghosts of the Sargasso\", \"Return to Spider-Skull Island\", and \"The Terrible Secret of Turtle Bay\".</td></tr><tr><th style=\"background:#A42B3A\"></th><th><span>2</span></th><td>2006</td><td colspan=\"2\">13</td><td>April 17, 2007</td><td style=\"text-align: left\">This two-disc set includes all thirteen episodes from the second season. As with the Season 1 DVD release, any nudity has been covered with black bars and the profanity has been censored. Bonus features include commentary on every episode by Jackson Publick and Doc Hammer and, for some episodes, \"special guests\" such as voice actors James Urbaniak and Michael Sinterniklaas. Features also include deleted scenes and a tour of Astro-base Go!.</td></tr><tr><th style=\"background:#FF9C36\"></th><th><span>3</span></th><td>2008</td><td colspan=\"2\">13</td><td>March 24, 2009</td><td style=\"text-align: left\">This two-disc set includes all thirteen episodes from the third season. Unlike the previous DVD releases, Season 3 is uncensored, with all profanity and nudity intact. Bonus features include deleted scenes and commentary. The season was also released on <span>Blu-ray</span>, which is packaged with a soundtrack CD that includes 20 tracks comprising the score from the season. The box cover is based on the box covers of many video games on the <span>Atari 2600</span>. Although the Blu-ray is only available in the \"Region A\" zone, it functions in the \"Region B\" zone also.</td></tr><tr><th style=\"background:#BBDDFF\"></th><th rowspan=\"2\"><span>4</span></th><td>2009</td><td rowspan=\"2\">16</td><td>8</td><td>October 26, 2010</td><td style=\"text-align: left\">This one-disc DVD set includes the first eight episodes from the fourth season. Similar to the Season 3 set, all episodes are uncensored. Bonus features include deleted scenes and commentary. Both halves of Season 4 were released on the Season 4 Blu-ray. The Blu-ray special features are uncensored and the final episode of this release has the option to be played with censored or uncensored audio. The rest of the episodes have censored visuals but audio remains uncensored. The streams available at Adult Swim are all censored.</td></tr><tr><th style=\"background:#99BBDD\"></th><td>2010</td><td>8</td><td>March 22, 2011</td><td style=\"text-align: left\">This one-disc DVD set includes the final eight episodes from the fourth season. Similar to the Season 3 set, all episodes are uncensored. Bonus features include deleted scenes and commentary. Both halves of Season 4 were released on the Season 4 Blu-ray.</td></tr><tr><th style=\"background:#405F54\"></th><th><span>5</span></th><td>2013</td><td colspan=\"2\">8</td><td>March 4, 2014</td><td style=\"text-align: left\">This two-disc DVD or one disc Blu-ray set includes all eight episodes from the fifth season, plus 2 bonus episodes (\"A Very Venture Halloween\" and \"From the Ladle to the Grave: The Shallow Gravy Story\"), audio commentary from Jackson Publick and Doc Hammer, and deleted scenes.</td></tr><tr><th style=\"background:#050744\"></th><th><span>6</span></th><td>2016</td><td colspan=\"2\">8</td><td>October 4, 2016</td><td style=\"text-align: left\">This two-disc DVD or one disc Blu-ray set includes all eight episodes from the sixth season, plus 1 bonus episode (\"All This and Gargantua-2\"), audio commentary from Jackson Publick and Doc Hammer, and deleted scenes.</td></tr><tr><th style=\"background:#2AA6A6\"></th><th><span>7</span></th><td>2018</td><td colspan=\"2\">10</td><td>June 4, 2019</td><td style=\"text-align: left\">This two-disc DVD or one disc Blu-ray set includes all ten episodes from the seventh season, including audio commentary from Jackson Publick and Doc Hammer, and deleted scenes.</td></tr></tbody></table><h4>The \"lost DVD commentary\"</h4><p>Jackson Publick revealed that he and Doc Hammer had recorded a commentary track for the season one episode \"Home Insecurity\". Warner Home Video chose to omit this track from the Season One DVD due to space limitations and some minor sound quality issues. Publick also stated that the commentary could be downloaded.</p><h4>Soundtrack CD</h4><p>For the video release of the Season 3, a soundtrack album was also released, titled The Venture Bros.: The Music of JG Thirlwell. This is the same audio CD included as a bonus with the Blu-ray version of Season 3. While the CD release was originally made available at Adult Swim's website, it was given a wide release on May 12, 2009; the vinyl LP release came out a month earlier. It can also be downloaded from most major digital retailers. The CD features 20 tracks, while the vinyl LP release is 16 tracks and a download link of the complete release including the songs omitted from the LP.</p><p>Music of The Venture Bros: Vol 2 was released digitally on April 10, 2016 and on CD and Vinyl on June 3, 2016. The album was released on Thirlwell's own Ectopic Ents label in collaboration with Williams Street Records.</p><br/>"
  },
  "errorMessage": ""
}