{
  "imDbId": "tt7366338",
  "title": "Chernobyl",
  "fullTitle": "Chernobyl (TV Series 2019–2019)",
  "type": "TVSeries",
  "year": "2019",
  "items": [
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw5285929",
      "warningSpoilers": true,
      "date": "28 November 2019",
      "rate": "10",
      "helpful": "157 out of 168 found this helpful.",
      "title": "Exemplary",
      "content": "CHERNOBYL is an excellent depiction of the infamous nuclear explosion that occurred in Ukraine back in 1986. I've previously read a book on the topic so I had some understanding of what took place, but this miniseries is even better. Over five carefully-paced episodes it really gets into the heart of the matter, depicting the science and circumstances behind the explosion and the failures that led to it happening in the first place. It also extensively depicts the fall-out and clean-up operations that were required afterwards. On top of all this, it's a character-focused drama in which the human cost is always at the forefront. Three exemplary performances from Jared Harris, Stellan Skarsgard and Emily Watson lead the way and the smaller roles are equally special. Doubtlessly the best TV show of the year, and one of the best of all time."
    },
    {
      "username": "deepfrieddodo",
      "userUrl": "https://www.imdb.com/user/ur123203865",
      "reviewLink": "https://www.imdb.com/review/rw8521402",
      "warningSpoilers": false,
      "date": "6 September 2022",
      "rate": "10",
      "helpful": "47 out of 49 found this helpful.",
      "title": "Painful To Watch, But Essential Viewing",
      "content": "An infamous world event captured in a riveting series. Chernobyl provides so much depth and wider information into the disaster by following the various lives and stories of those involved, the plot remains gripping beyond the event itself, and the aftermath takes complete scrutiny.Deeply unsettling and painful to watch at times, the effects of radiation poisoning are explicitly shown in all its horrors, and as horrible as it is to see, the makeup and costuming department must be commended. Everything in the series is visually stunning, staying truthful to history whilst always creating the correct atmosphere on screen.The truth is ultimately as sinister and concerning as any fictional horror/drama could envision. The politics involved at every step are explained well without removing from the intelligence of the dialogue. The addition of one character is justifiable to remove a cinematic mess of attempting to include dozens of science within a coherent script. Remaining close to the facts only adds to the power of the series.The casting is brilliant, the addition of multiple UK comedic actors in such serious roles only improves it, with the late Paul Ritter particularly standing out in his performance. None of the cast can be flawed, and there is no ambiguity over unnecessarily dodgy accents.Whilst baring all, the Chernobyl series remains respectful, yet damning to those responsible. It is historically important, and an absolute must-watch."
    },
    {
      "username": "jfirebug",
      "userUrl": "https://www.imdb.com/user/ur71468234",
      "reviewLink": "https://www.imdb.com/review/rw4875873",
      "warningSpoilers": false,
      "date": "21 May 2019",
      "rate": "10",
      "helpful": "1,481 out of 1,571 found this helpful.",
      "title": "Incredible",
      "content": "My husband grew up near Kyiv and his father drove one of the buses that evacuated the civilians from Pripyat. I have heard his stories of the disaster; the people's concerns, fears and sacrifices. We watch this together and he is amazed at it's authenticity. The set detail, the way the Soviet regime hierarchy functioned, the denial and secrecy surrounding the disaster. He tried (as he usually does when watching a Western production based in or about that part of the world) to find errors or inconsistencies but has not been able to - yet.The acting is impeccable by all, the filming is top notch, the sounds used to heighten the tension versus music. The way they are able to capture that exact feeling of anxiety, horror, disgust and sadness all rolled into one is admirable.I have completed the series and it definitely ranks as one of the best. This story has been waiting to be told and there is hands down no one better than HBO to do it. Russia has said it intends to produce its own Chernobyl program, it will be interesting to compare the two. Theirs will purportedly label the CIA as the perpetrator...."
    },
    {
      "username": "justahunch-70549",
      "userUrl": "https://www.imdb.com/user/ur150278302",
      "reviewLink": "https://www.imdb.com/review/rw8601557",
      "warningSpoilers": false,
      "date": "10 October 2022",
      "rate": "10",
      "helpful": "32 out of 33 found this helpful.",
      "title": "Compelling, moving, timely and important",
      "content": "If there is anything wrong with this, I'm unaware of it, though I will say the final two episodes can't quite compete with the first three. This has a large cast and everyone in large and small roles is absolutely perfect. This won 10 Emmy awards out of 19 nominations, but it's really a shame that none of the actors won, especially Jared Harris in the lead role. He is superb, but everyone is impressive. The cinematography and production design are beyond criticism as are the writing and direction. Everyone knows what this is about, so there is little to comment on other than that this is very important television, something that cannot be said a lot of the time. I didn't have HBO when this premiered in 2019, so I am now just getting around to seeing it. This is 2022 and some of it, especially in the final episode, needs to be seen and heard by American audiences.\"What is the cost of lies?\""
    },
    {
      "username": "ahmetkozan",
      "userUrl": "https://www.imdb.com/user/ur48829349",
      "reviewLink": "https://www.imdb.com/review/rw4922331",
      "warningSpoilers": false,
      "date": "8 June 2019",
      "rate": "10",
      "helpful": "419 out of 469 found this helpful.",
      "title": "Now you look like the minister of coal!",
      "content": "In terms of series expression, it moves on in a style that we can call \"documentary-drama\". But there is a serious scenario success here. The visual and verbal emotions of the series we watch are sometimes causing anxiety, sometimes causing anger and sometimes we cannot prevent our eyes from being moistened. The gloomy atmosphere of the Soviets is very well reflected. The background music supports this. It has a cinematic narrative. You feel the catastrophe up to your buttonhole. Nevertheless, acting certainly takes the business to a much higher level. Chernobyl is now at the top of the \"Top Rated TV Shows\" list in IMDb. This is a significant improvement, even if you are a person who does not consider the IMDb score very much. Such a great success in a short time... It really deserves a round of applause. 10/10"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8574390",
      "warningSpoilers": false,
      "date": "28 September 2022",
      "rate": "9",
      "helpful": "43 out of 46 found this helpful.",
      "title": "Must Watch!",
      "content": "Chernobyl is about the brave men and women who had to navigate the ridiculously scary nuclear accident at the Chernobyl Nuclear Power Plant in April of 1986. I can not overstate just how good Chernobyl really is! It's one of the best mini-series I've ever seen, it's right up there with Band of Brothers! It is heartbreaking to watch as this shocking disaster unfold and you will sit there at the edge of your seat as tense as can be. The attention to detail is just awesome. It absolutely lives up to all the hype and love it's gotten since it came out! It's one of the top rated shows ever for a reason... because it's fantastic! If you haven't seen this amazing series yet then make sure you do as soon as possible...you will not be disappointed."
    },
    {
      "username": "emholberg",
      "userUrl": "https://www.imdb.com/user/ur37247187",
      "reviewLink": "https://www.imdb.com/review/rw4893298",
      "warningSpoilers": false,
      "date": "27 May 2019",
      "rate": "9",
      "helpful": "366 out of 409 found this helpful.",
      "title": "It is hard to overestimate the importance of this show.",
      "content": "I was born in Ukraine, 1971. Parents - Soviet \"intelligentsia\": mother was a high school teacher, father - medical doctor in the military. By the time it happened, we lived near one of the strategic nuclear missile site deep in Siberia. Every year, during the summer school break we used to go to Ukraine, where we spent most of vocation. It should have been the same in 1986, but Chernobyl happened. Official info reiterated that there is nothing to worry about, unless you are in the vicinity of reactor itself. But we all had learned to read between the lines and my farther used his military channels to find out EXACTLY what kind of catastrophe was taking place. He had some info from KGB guys themselves. However, he was reassured that Kiev and certain parts of Ukraine was free of the nuclear fallout and the level of the radioactivity was within normal urban level. He was also clearly warned where NOT TO GO under any circumstances: North-West of Ukraine and big part of Belarus was a heavy fall-out zone. They also mentioned some European countries. Needless to say, that nobody else was talking about this on TV. We made a decision not to change our plans for the summer, but keep in mind those warnings.Each of us had DKP-50A - dosimeter that measures the exposure dose of gamma radiation. We checked the data afterwards and all measures were withing normal limits or less. I remember though, that it was restricted to collect mushrooms or wild berries in the forests anywhere in Ukraine. Any dusty environment was considered dangerous. All water wells were sealed with plastic etc etc Mini series exceeded my expectations. Authors put quite an effort to correctly depict intricate details of this catastrophe. As other reviewers already mentioned, I had noticed so far ( 3 episodes) only minor discrepancies in the overall image of the life in the USSR. People, behavior, political relations etc. Example of such a minuscule inaccuracy - officials, let along common folks, didn't use \"comrade\" as frequently as it might seems from the episodes. It was very formal, official form of addressing. Usually, after first meeting, they addressed each other by the first AND middle name. In the military it was different - \"comrade\" + rank (as in modern Russia, BTW). I'm looking forward to see the rest. I am thankful to the authors and actors for their job. My deep bow to those who lost their lives and health, saving millions of lives. EVERYONE should watch this show and see for himself the kind of horror that can be unleashed in the nuclear war."
    },
    {
      "username": "Ekul1021",
      "userUrl": "https://www.imdb.com/user/ur3024597",
      "reviewLink": "https://www.imdb.com/review/rw8515839",
      "warningSpoilers": true,
      "date": "4 September 2022",
      "rate": "10",
      "helpful": "23 out of 23 found this helpful.",
      "title": "Very difficult series to watch",
      "content": "The fact that Chernobyl disaster happened in real life makes any current Sci-Fi, drama, and any series put to shame. The series goes minute by minute, hour by hour of the disaster from the beginning to the trial in the last episode where it details the negligence and mismanaged of the nuclear power plant. Of course given this is the Soviet Union, our enemy are portrayed as humans and brothers and not like the typical James Bond Soviet enemies. The actors did a terrific job in portraying their historical counterpart. Otherwise, this was a very difficult series to watch especially the horrible affect of someone exposed to radiation as well as the hardship of keeping this disaster from ending the world. This series although took some liberties to entertainment, however should be a watched as a reminder that human and technology if not in check could end the world."
    },
    {
      "username": "EVON1TY",
      "userUrl": "https://www.imdb.com/user/ur47939660",
      "reviewLink": "https://www.imdb.com/review/rw8926097",
      "warningSpoilers": false,
      "date": "13 March 2023",
      "rate": "10",
      "helpful": "18 out of 18 found this helpful.",
      "title": "A life lesson. What is the cost of lies?",
      "content": "This TV Show is a life lesson. They could make a Documentary with a narrator, you'll know the exact same story. But will it be this effective? Absolutely not!They've managed to do a unique job. You are experiencing the event nearly as those who really did. Sadly this event was a terrible accident. You're thinking the cause of this some arrogant guy. But actually the whole thing is started with a simple lie. I bet you can't forget the line \"Every lie we debt to the truth, sooner or later that debt is paid.\" because it perfectly fits for the situation. This TV show is not your usual \"Based on a True Story\" type of TV show. You're not watching a TV show based on an event. You're just experiencing it, with it causes, problems and all.And to bring that realistic atmosphere, you should make the best technical details.The Art Direction & Set Decoration is just way beyond perfect. This brings so much detail to the story, visually after Cinematography this is the most important thing in a TV Show or a movie. They've managed extraordinary, beyond perfect, revolutionary job in this.Cinematography is also quite amazing. Lightning, color grading, angels, movements are just perfect.Costume design is also perfect, nearly everything is perfect after all we're watching a high budget HBO serie. But makeup is beyond perfect, how you managed to do that? I don't know what you think but I found that makeup so effective!Acting performances are also great. Well chosen actors takes your attention for real. Nearly every character chosen well. Legasov, Boris, Khomyuk, Dyatlov and even more. How can they find those amazing actors that fits so perfectly for the character?"
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8325723",
      "warningSpoilers": false,
      "date": "11 July 2022",
      "rate": "9",
      "helpful": "38 out of 41 found this helpful.",
      "title": "Brilliant!",
      "content": "I can not overstate just how good Chernobyl really is! It's one of the best mini-series ever made, it's right up there with Band of Brothers! It absolutely lives up to all the hype and love it's gotten since it first came out! It's one of the top rated shows ever for a reason... because it's fantastic! If you haven't seen this amazing series yet then make sure you do as soon as possible!"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw4913786",
      "warningSpoilers": false,
      "date": "5 June 2019",
      "rate": "9",
      "helpful": "66 out of 75 found this helpful.",
      "title": "the roar of a dragon",
      "content": "This is an HBO mini-series about the 1986 nuclear power plant disaster. A series of human error and a devastating design flaw would cause the worst nuclear accident in history. Deputy chairman Boris Shcherbina (Stellan Skarsgård) is put in charge. Valery Legasov (Jared Harris) is the scientist who figures out the seriousness of the situation. Ulana Khomyuk (Emily Watson) is a nuclear physicist in Minsk who detects the radiation and contributes to the solution.The most incredible aspect of the first episode is the roar of the exposed core. While I knew that the core was exposed, I never actually considered its primal roar. It breathe fire like a dragon. It blew my mind. The thesis of lies and hubris and scientific truths and real heroism is the story's beating heart. It is led by three stellar performers. Even if you think you know, this series will make you think some more. The final episode has a tough job of explaining the accident. It puts the exposition into the courtroom and it's surprising how understandable nuclear power science becomes. This is prestige television at its best."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw4907326",
      "warningSpoilers": false,
      "date": "2 June 2019",
      "rate": "10",
      "helpful": "95 out of 110 found this helpful.",
      "title": "Believe the hype.",
      "content": "Sometimes, you watch something, and it lives with you, when it's something that has happened, or could still, it haunts you. Chernobyl follows the likes of Threads, a drama that is so realistic, a story so well told, people will remember this for many years to come.I thought I vaguely knew the events surrounding Chernobyl, I knew nothing, this sensational drama tells the story in a manner that's compelling, informative, and dare I say it, entertaining.The effects, and acting are truly first rate, as is the superb makeup. However it's the way that this story is told, that's the best element.A story full of hardship, lies, cover ups, pride, and of course, Love.Superb from start to end. 10/10"
    },
    {
      "username": "thegldt",
      "userUrl": "https://www.imdb.com/user/ur24156053",
      "reviewLink": "https://www.imdb.com/review/rw4834102",
      "warningSpoilers": false,
      "date": "7 May 2019",
      "rate": "10",
      "helpful": "1,232 out of 1,315 found this helpful.",
      "title": "Bleak, Unsettling, Haunting All Throughout",
      "content": "'Chernobyl' is scarier than most horror movies in that it is a dramatization of actual, real-life horror experienced by thousands of people on that fateful April 1986 morning and the years that followed. This disaster has haunted the nation, Europe, and the rest of mankind more than three decades later. And that creeping dread permeates the whole show. It's difficult to watch. But it certainly makes it a must-watch."
    },
    {
      "username": "Lladerat",
      "userUrl": "https://www.imdb.com/user/ur58526361",
      "reviewLink": "https://www.imdb.com/review/rw4835991",
      "warningSpoilers": false,
      "date": "8 May 2019",
      "rate": "10",
      "helpful": "2,137 out of 2,263 found this helpful.",
      "title": "So far looks excellent",
      "content": "Im ukrainian, born in 1988 and still live here. I want to give the authors of this show a big thumbs up for the whole set they have made. Every little detail of the buildings, flats, uniforms, clothes, cars, especially big thumbs up for ambulance \"RAFiks\" (RAF-2203), almost everything is 99% identical to the real things of the time, just a few mistakes on some signs that have been written in a mix of russian\\ukrainian and some other unknown language, but it all doesnt matter, because what i have seen previously in other movies about soviets were so bad that its not even comparable to this. The other thing is this \"comrade\" word that almost everyone throws while calling or shouting at someone, its just one of those stereotypes thats still left in western world, in reality no one in an everyday life talked like that, especially not in Ukraine in 1986, it was mainly used in 'official' language in meetings and media, people just talked like you and i would today. Apart from this two small inaccuracies i am shocked at the level of production of this show, it is very good, no one outside of Ukraine has ever made a good tv series about Chernobyl before, i have a weird feeling it was made by someone from USSR, because there was zero moments where i cringed watching it. It was mostly \"spot on\", \"spot on\", \"wow, spot on\". Can't wait for the next episode!!!"
    },
    {
      "username": "Vivkon",
      "userUrl": "https://www.imdb.com/user/ur57578722",
      "reviewLink": "https://www.imdb.com/review/rw4833764",
      "warningSpoilers": false,
      "date": "7 May 2019",
      "rate": "10",
      "helpful": "285 out of 340 found this helpful.",
      "title": "Requiem for Lies",
      "content": "This is a heartbreaking story based on true events and people's memories of the 1986 nuclear disaster known as Chernobyl. Aside from the fatalities and severely disabled victims many people died due to lies and cover up activities in the Soviet Union. Poor minded politicians and engineers sacrificed truth to the fate of thousands of victims.HBO did a great job in revealing this great world sorrow. This TV series allows viewers to look into the Soviet political regime riddled with freedom of information restrictions. Any governmental mistakes and accidents immediately were became highly confidential material, creating an excellent this manipulation of mass consciousness. \"Chernobyl\" explicitly demonstrates how misinformation and false statements put in jeopardy the health and life of millions of innocent people and wildlife.This show allows the audience to feel the volume of grief and mourning of those families who lost their children, husbands and other families members due to this tragic event. The most heartbreaking dramatization in the first episode is the dialog between dispatchers. That dialog in Russian with English subtitles on the black screen and red text signals that everything has been started and nobody knows yet the consequences of the nuclear accident.This TV series is a form of dedication to all of those people who risked and sacrificed their lives to save the lives of others. It is possible that the airing of \"Chernobyl\" will bring world-wide attention to the impact of a nuclear energy disaster on human society. Some people will be taught first aid tips in the event of radiation exposure: move underground, remove contaminated cloth, wear a respiratory mask, have KI (potassium iodide) to block absorbed radioactive elements in the human body. Many people died, however, the TV memory of these events gives powerful recognition to the truth of what happened and what we have learned."
    },
    {
      "username": "DimitrisPassas-TapTheLine",
      "userUrl": "https://www.imdb.com/user/ur69946382",
      "reviewLink": "https://www.imdb.com/review/rw4957089",
      "warningSpoilers": false,
      "date": "24 June 2019",
      "rate": "10",
      "helpful": "53 out of 60 found this helpful.",
      "title": "\"What is the cost of lies?\"",
      "content": "That was an amazing cinematic experience that one can relish in the small screen, a true masterpiece destined to be considered a modern classic in the years to come. At first I was reluctant to watch \"Chernobyl\" as I'm a fiction fan rather than an true crime aficionado, nevertheless after the first ten minutes in the first episode I was literally glued to my seat and I binge-watched all five episodes in one evening. In my opinion it is one of the best television productions ever, setting its own distinctive mark that other creators are deemed to follow in the future.I knew very little about the actual incident and after watching \"Chernobyl\" I can honestly say that I have a thorough picture of both the event and its cataclysmic aftermath. For the record, the Chernobyl disaster is considered to be the worst nuclear accident in the human history. It happened on 26 April 1986 at the No. 4 nuclear reactor in the Chernobyl Nuclear Power Plant, near the city of Pripyat in the north of the Ukrainian SSR. Ukraine was still a part of the Soviet Union and the reaction from the authorities was not at all satisfying, as depicted and clearly criticized in the series. The President of the USSR at the time, Mikhail Gorbachev (played here by the popular Danish actor, David Dencik, struggled to contain the incident and started to take decisions rather too late when the whole world knew the extent of the disaster. The town of Pripyat was evacuated in a hasty and disorganized way and, most of all, far too late. Nowadays, the town stands as it was left at the time, in a way reminiscent of Pompei.The main protagonists are Valery Legasov (Jared Harris), a Russian nuclear scientist who was an expert on the RBMK reactors, Boris Shcherbina (Stellan Skarsgård), a career politician and senior member of the Kremlin and Ulana Khomyuk (Emily Watson), a Ukrainian nuclear scientist who joined the other two, trying to limit as far as it was possible the terrifying effects of the explosion. All performances are top-notch with Skarsgård delivering one of his best acting achievements ever in the television. The photography of the series stands a level -or two- above anything I've seen in TV shows so far, and the viewer feels like inhabiting the horror of the setting. The series was shot mainly in Lithuania to the decommissioned power plant Ignalina which bears resemblance to the Chernobyl plant. The representation of the life in the 80s in the Soviet environment is so realistic that we can almost experience it ourselves.I read on some of the - mostly raving- reviews that a small part of the audience found the ending to be a bit underwhelming, but I think that it was the most suitable finale in this bleak, tragic story. The courtroom scene explains everything even to the most ignorant viewer while it offers some a sense of justice. The open declaration of the truth by Valery Legasov, that finally leads to his own demise some months later, is the best conclusion that one can imagine for a show of this stature and I cannot think of something more appropriate.\"Chernobyl\" is a show that you will never forget. The first episode, which is perhaps the best of the show, is genuinely horrifying and the sequence with the two scientists hovering above the exposed reactor is destined to haunt you forever. Sometimes the reality is more petrifying that the most well-crafted horror fiction stories. Do yourselves a favor and indulge in this five-hour trip that will leave you numb and full of contradicting feelings. This is a solid 10/10."
    },
    {
      "username": "andie74439",
      "userUrl": "https://www.imdb.com/user/ur4489739",
      "reviewLink": "https://www.imdb.com/review/rw4854022",
      "warningSpoilers": false,
      "date": "15 May 2019",
      "rate": "10",
      "helpful": "1,054 out of 1,129 found this helpful.",
      "title": "The truth is scarier than any horror movie.",
      "content": "What is so terrifying is it's not trying to be a horror programme, it's what actually happened. It's not gratuitous... it's what happened. And it's scarier than any horror movie I could ever call to mind. There are scenes where my blood ran cold, where I felt queasy but most of all I was just horrified by the scenes that depicted those first on the scene. You always look for the helpers in any disaster. But what if the disaster overcomes the helpers. What if even the strongest of us are no match for the horrific event. It's almost unthinkable. But it happened here. This will stick with you long after the credits roll. As it should."
    },
    {
      "username": "wmeduardowm",
      "userUrl": "https://www.imdb.com/user/ur60724263",
      "reviewLink": "https://www.imdb.com/review/rw4834740",
      "warningSpoilers": false,
      "date": "7 May 2019",
      "rate": "10",
      "helpful": "1,170 out of 1,262 found this helpful.",
      "title": "HBO did it again!",
      "content": "The first episode somehow surpassed my expectations for what this TV Show would do with the biggest nuclear disaster ever! Without giving any spoilers besides the obvious, the cinematic quality is unbelievable! I found myself looking at many transition scenes with disbelief, a complete state of shock- that's how good the first episode of HBO's mini-series \"Chernobyl\" was! The writing wasn't LEGENDARY but it was great, but most importantly, consistent! Every actor did an amazing job at portraying each character and their feelings, which ultimately, led to a even greater ambience. When the episode ended, I was left with a feeling like if I was in Chernobyl! I felt like I was contaminated by radiation. Although that might sound silly, I really felt unwell after watching \"Chernobyl\"! That just shows how incredibly effective the first episode was on displaying the horrific events that took place in Chernobyl, and how many lives were absolutely destroyed and affected following the disaster. So far, a must-watch!"
    },
    {
      "username": "harshsam",
      "userUrl": "https://www.imdb.com/user/ur66102309",
      "reviewLink": "https://www.imdb.com/review/rw8534612",
      "warningSpoilers": false,
      "date": "11 September 2022",
      "rate": "9",
      "helpful": "19 out of 19 found this helpful.",
      "title": "Abolsute masterpiece!",
      "content": "Disclaimer->not for faint-hearted.Yes, you read it right this tv series is not for faint-hearted as it has some moments which will shake you up.It is one of the best tv series ever produced. Every actor has done its job perfectly, BG score will give you chills.If you made it to the end you take a sigh of relief then a thought will hit you that what you saw in these 5 episodes happened not too long ago and thus thought will shake you to the core,how we humans have made a deadly catastrophe. But there is a ray of hope that till the good and determined men/women are here we will be saved.It's a must-watch if you can."
    },
    {
      "username": "jazz1",
      "userUrl": "https://www.imdb.com/user/ur3192845",
      "reviewLink": "https://www.imdb.com/review/rw4898950",
      "warningSpoilers": false,
      "date": "30 May 2019",
      "rate": "10",
      "helpful": "167 out of 189 found this helpful.",
      "title": "Incredibly accurate",
      "content": "I grew up in soviet Russia, born in 1977 and this is incredibly accurate. Starting with the explosion, the incident itself, the way soviet politicians and the media handled (covered) it - and ending with all the little tiny details.I would never expect a Western TV show to go to this amount of detail portraying life in the soviet era. AND being so brutally honest about the accident itself. Also no fluff, no pathos, and no stereotypes like \"Russian bears with kalashnikovs playing balalaikas on Red Square\" - just brutal truth.Thank you for thatBorn in 1977 I still have vivid memories about the catastrophe, and everything - and I mean everything - in this show has been incredibly authentic. And mesmerizing. This thing keeps you on the edge of your seat and coming back to the real world after watching an episode is like waking up - \"wait, what? where am I?\"P.S. I remember watching the news with my mom that day. The anchor briefly mentioned something about a \"minor incident with 7 people injured in the fire\". Then within weeks rumors have spread (rumors, not the official news), that the whole town of Pripyat is being evacuated. And we better keep our windows shut. Or better yet spend the summer somewhere far East.I also remember that \"chernobyl liquidator\" was like a badge of honor for decades in Russia, Belarus, Ukraine and the whole Eastern-European \"block\", both officially and informally. These people were really honored. If you hear someone's a \"chernobyl liquidator\" - you give up your seat on the bus. You give way in the waiting line. I mean the whole waiting line just silently moves over, and one person walks in (which always made them shy).P.P.S. I also wish some of the younger Russians see this show and stop effing romanticizing soviet era. You guys have no idea."
    },
    {
      "username": "classicsoncall",
      "userUrl": "https://www.imdb.com/user/ur2707735",
      "reviewLink": "https://www.imdb.com/review/rw5463196",
      "warningSpoilers": true,
      "date": "6 February 2020",
      "rate": "10",
      "helpful": "25 out of 28 found this helpful.",
      "title": "\"\"All right comrades. Another few minutes, it will all be over.\"",
      "content": "It's hard to believe the Chernobyl disaster occurred over three decades ago, it seems like it was just yesterday. When it hit the news back in 1986, and being far removed from the Ukraine, it didn't have the same kind of impact on one's consciousness as watching this film and seeing how the Russian government, it's scientists, and everyday people reacted to the terrible news. Presented as a five part HBO mini-series, \"Chernobyl\" follows an exacting time line to present what led up to the explosion of the nuclear reactor, and details in easy enough to understand language the mistakes that were made that contributed to the disaster. That's especially borne out in the final chapter when scientist Valery Legasov (Jared Harris) states his summary to a Russian court, driven to tell the truth despite the potential repercussions of revealing government complicity in cutting corners and hiding errors. At times, the scenes of radiation impacted victims look like they derive from a horror movie, and a particularly poignant Episode Four focuses on Russian soldiers dispatched to shoot and kill any animals, wild or domestic, that survive in the contamination zone, in order to prevent the spread of disease. Some astounding figures are mentioned regarding the eventual clean up effort, taking three years and seven hundred fifty thousand men!!! to contain the area around Chernobyl and it's principal location of Pripyat in the Ukraine. Not mentioned in the story is the fact that the present day exclusion zone surrounding Chernobyl extends nineteen miles in all directions, and is largely uninhabited except for about three hundred residents who refuse to leave (there's always someone, isn't there?). For an event that captured the world's attention in 1986, this is an excellent documentary that captures the magnitude and horror of human error and miscalculation that led to one of history's worst disasters."
    },
    {
      "username": "advertslyf",
      "userUrl": "https://www.imdb.com/user/ur113127726",
      "reviewLink": "https://www.imdb.com/review/rw8523845",
      "warningSpoilers": false,
      "date": "8 September 2022",
      "rate": "10",
      "helpful": "22 out of 22 found this helpful.",
      "title": "The Shawshank Redemption of TV Series",
      "content": "It is hard to pin down any one element that distinguishes the series as A-class, but it has that somewhat indescribable character of screenplay, acting and theme that mix together to leave me with a sense of intrigue and wonder.Think Shawshank Redemption. You cannot say that the cinematography, the acting or the moral call to action is overwhelmingly a standout. And yet, when you watch Shawshank, you know you're watching a masterpiece.Rating description: my 10 review denotes a piece that I could watch again, would recommend to others as an immediate priority, and usually involves some deeper learning about human conduct."
    },
    {
      "username": "anyakiss",
      "userUrl": "https://www.imdb.com/user/ur96466453",
      "reviewLink": "https://www.imdb.com/review/rw4834250",
      "warningSpoilers": false,
      "date": "7 May 2019",
      "rate": "9",
      "helpful": "175 out of 211 found this helpful.",
      "title": "Chernobyl",
      "content": "Oh God. It's stunning. I'm impressed. Good job HBO. Getting from Russia."
    },
    {
      "username": "m-porpaczi",
      "userUrl": "https://www.imdb.com/user/ur23775785",
      "reviewLink": "https://www.imdb.com/review/rw4855031",
      "warningSpoilers": false,
      "date": "15 May 2019",
      "rate": "10",
      "helpful": "2,931 out of 3,070 found this helpful.",
      "title": "No hero wakes up wanting to die",
      "content": "As my mother tells it, the weather was quite nice, the sky was clear without any sign of clouds in the spring of 1986. It was like any other day behind the iron curtain. Not a lot to do but not a lot to worry about either, a long day of boring work after dropping the kid off at the kindergarten, just to pick him up again at the afternoon, just like yesterday or any other day since the beginning of time. This is why she did not understand why the old lady (who she very much liked because she seemed to love children and had that neverstopping smile) told everyone at the nursery school not to let the children out to play, don't feed them the veggies and don't let them drink the milk we had for every lunch before that day. We lived in a hungarian town close to the croatian border and the life in that town was pretty simple apart from that day. We lived 900 kms from Chernobyl and we did not even know that place exists until 3 days later.Apparently a man who did not introduce himself called most of the schools and nurseries in the country and told them the same message. A lot of teachers did not take it seriously as he did not mention any details, just the warning: do not let the children out, do not feed them any vegetables which grows overground (potatoes are fine), do not let them drink anything apart from bottled liquids.Noone knew what it was about. Noone knew what danger we are in. I assume this is why it was such a shock. The life was simple and we were not supposed to know stuff. We were not supposed to be afraid, maybe only because the capitalist pigs over the iron curtain. But something changed that day. A faceless, nameless man risked his life and called everyone he could to warn them about Chernobyl. News like this is not easy to contain, soon everyone was talking about what could happen and why. Is it a nuclear attack? Is it the CIA? Are they looking at us from satelites? Are they bombing us?It was the first crack on the Iron Curtain. Not Reagan's stupid monologue, not the thousands of fleeing east-germans, not the soviets economy's ridiculous debts. Entire nations realized their lives mean nothing, millions felt betrayed. A man with no name defeated the Soviet regime with a few telephone calls.We still don't know who that man was. After 30 years and a few inquiries we have no clue who risked his life to prevent thousands of deaths and millions of illnesses. Some historians are adamant the person was executed and vanished without a trace, some say noone found him at all. All I know I have to be grateful for him. We all have to be. He saved a nation. Sure, we could survive the radioactive cloud the mild wind blew over our country but when I look at my two children who are the same age I was back then I am pretty sure I am not willing to take any risks. Would you?Dear anonymous man who defied a violent regime to save millions: We will forever be grateful. Dear ukranian workers whose names we will never know: We will forever be grateful. The workers whose names we know: We will forever be grateful.This show tells a story noone should forget and this is the right way to tell it. Bluntly. How the man with no name told us."
    },
    {
      "username": "raggingbull",
      "userUrl": "https://www.imdb.com/user/ur79004012",
      "reviewLink": "https://www.imdb.com/review/rw4851459",
      "warningSpoilers": false,
      "date": "14 May 2019",
      "rate": "10",
      "helpful": "373 out of 426 found this helpful.",
      "title": "So far, so great 👍👍👍",
      "content": "Only two episodes in, and I'm totally hooked. Hard to believe that these things actually took place, and only 35 years ago. It's really quite frightening. Fans of bio-disaster films such as \"Contagion\" and \"Outbreak\" will be instant fans, but to be honest, \"Chernobyl\" offers something much more than others have within this sub-genre. The political and non-fiction elements give it a leg up, and the acting from Jared Harris and Stellan Skarsgard is excellent as usual. If the rest of this series follows suit, then this is something that you're not gonna want to miss."
    }
  ],
  "errorMessage": ""
}