{
  "imDbId": "tt9735318",
  "title": "The Beatles: Get Back",
  "fullTitle": "The Beatles: Get Back (TV Series 2021–2021)",
  "type": "TVSeries",
  "year": "2021",
  "items": [
    {
      "username": "Sunsphxsuns",
      "userUrl": "https://www.imdb.com/user/ur46581731",
      "reviewLink": "https://www.imdb.com/review/rw7587178",
      "warningSpoilers": false,
      "date": "26 November 2021",
      "rate": "10",
      "helpful": "167 out of 178 found this helpful.",
      "title": "GET BACK VS LET IT BE",
      "content": "On May 13, 1970, in Redondo Beach, California, I stuffed a VW bus with my closest musician friends and drove to Hollywood to see the midnight premier showing of The Beatles: Let It Be. Like many musicians who were professionally involved in the swiftly emerging music industry in the 60s and 70s, John Lennon, Paul McCartney, George Harrison and Ringo Starr had helped to shape and define not only the rock and roll we performed, but also how we socially and culturally defined ourselves in the massive Counterculture Movement.After screening the film, we drove back home in deafening silence. It was as if a global blackout had occurred, and when it was over, the music industry landscape had been transformed into a yawning, empty hole, one which would not begin to be filled in for another 51 years. It was true, there was little to say. We had just witnessed the depressing breakup of the world's greatest pop band, and the stunning finality of it all had been dutifully documented in Let It Be. To quote John Lennon: \"The dream was over.\"But thanks to director extraordinaire Peter Jackson, and the release of The Beatles: Get Back, the painful wound I thought would never heal was suddenly cleansed, dressed, stitched and repaired. The empty hole left by the original film began to fill in as the first few scenes of Get Back rolled across the television screen. Instead of mourning the demise of this iconic group, I found myself with a renewed sense of celebration, even relief, with the updated knowledge that the Beatles hadn't necessarily \"gone down in flames\" but rather, were subconsciously beginning the process of launching their solo careers, each of which would flourish for many years following their official breakup.Most IMDb fans already know the full story behind Let It Be (1970) and The Beatles: Get Back (2021) so there is no need to duplicate descriptions and comparisons. In both films, it is still the music that efficiently carries the storyline as well as the strong creative processes the Beatles possessed when building new songs in the recording studio.Peter Jackson's \"retelling\" allowed me to enjoy the film for what it was always meant to be: An upbeat and beautiful documentary best described by Greek philosopher Aristotle's timeless phrase, \"The whole is greater than the sum of its parts.\"No spoilers here as usual but I will reveal that the process of selecting and restoring the material for the film took New Zealander Peter Jackson a grueling four years."
    },
    {
      "username": "lee_eisenberg",
      "userUrl": "https://www.imdb.com/user/ur4888011",
      "reviewLink": "https://www.imdb.com/review/rw7597418",
      "warningSpoilers": true,
      "date": "29 November 2021",
      "rate": "10",
      "helpful": "118 out of 131 found this helpful.",
      "title": "you never knew the full story until now",
      "content": "The 1970 documentary has been known as the story of the Beatles' breakup. As it turns out, that documentary skewed things. Peter Jackson's new documentary \"The Beatles: Get Back\" incorporates approximately eight hours of footage from the making of the album and shows a completely unknown story behind it. For example, Yoko often gets blamed for breaking up the band, but all the members brought people (Paul brought Linda, Ringo brought Maureen, and George brought Hare Krishnas); at times, Paul could be irksome, often interrupting the other members. What was particularly neat was to see the guys writing songs on the fly.It's an experience like no other, especially the performance on the roof. It must've been one of the greatest things of all time to witness that performance. I also didn't know that the guys had used the recording sessions to come up with songs that they later released solo.Anyway, it's a documentary that you gotta see. You won't be disappointed."
    },
    {
      "username": "Michael Fargo",
      "userUrl": "https://www.imdb.com/user/ur0590820",
      "reviewLink": "https://www.imdb.com/review/rw7595629",
      "warningSpoilers": false,
      "date": "28 November 2021",
      "rate": "10",
      "helpful": "91 out of 97 found this helpful.",
      "title": "The Storm of Making Rainbows",
      "content": "There's a reason for an 8-hour documentary about the recording of The Beatles final release. Back when, there was such a ruckus and hurled allegations from all quarters: the band members, the critics, the (mostly) stoned fans and interested parties. Today, all of that seems like manufactured craziness, but Peter Jackson recreated what may have happened, offering a correction of what people erroneously believed as a clash of inflating egos and tantrums caused by (1) Yoko Ono's presence and (2) the pulling apart of the group by domesticity. In fact, Jackson lets us witness the growth of 4 talented people ready to move on with their drive towards solo careers. The group was just too confining, the mind-meld between McCartney and Lennon too dominant for Harrison and Starkey. Seeing McCartney and Lennon create--almost wordlessly--is riveting, and watching Harrison's resentment over being ignored or dismissed, painful. But there's a tight deadline for the project. Starkey is under contract to begin a movie at month's end, and the planned project includes an album, a TV special, a film plus a live performance in just 3 weeks. So time puts enormous pressure on getting the work done.The Beatles were a phenomenon unlike anything seen before primarily due to a growing interconnectedness of media that spread news (or rumor) with lighting speed. Reporting the most mundane morsel of what was going on with the group was its own industry. And, in the absence of any fact, the media could always make something up. Critics who were becoming a separate discipline, lying in wait to topple the successful, so they could gain respect and access...and influence. And The Beatles were a primary target for the mill. \"Let It Be\" was poorly received by the critics which today seems laughable. Take a dart and throw it at the eclectic track list, and you'd score an example of brilliance in both live recording, performing or writing. Sometimes all three. Phil Spector's odd postproduction edits only added to the critical fodder. Today, those additions make little difference. And, as McCartney remarks in the course of the film, Yoko Ono's presence--and any objection to it--also is inconsequential. It's too bad she didn't have the awareness of what her constant presence would give to her detractors.I wouldn't urge anyone to see this film due to its length. Writing songs and rehearsing them is a repetitious process. You'll either be fascinated or bored stiff. But the restoration alone is a gift; the amount of time we get to spend watching the recording process of geniuses of the 20th Century is a privilege. The music still thrills and influences. Whether you want to stick around and watch how it was created, under self-imposed dire pressure is a personal choice.Part 3 is the most accessible for the casual viewer. It contains things like a young Heather McCarthy upon hearing Yoko Ono's, unique wordless, guttural singing deciding to mimic her. We also get to move out of the claustrophobic confines of the yet-to-be-completed Apple studios and hear a relatively unrehearsed, rough shod performance (some used on the album). And the surprised inhabitants and passersby on Seville Row astonishment to hear The Beatles finally performing again. The constabulary are less impressed.It can be argued that the Beatles changed society. Whether you want to say they simply led what was already underway or did it single-handedly is an open question. So, Peter Jackson with \"The Beatles: Get Back\" did a service by correcting a record. Yes, there were struggles and resentments inside the group. But the real culprit in their split was their maturing talent and a need to express beyond the four as a group. At the time, the break up was devasting to the public and apparently to the group itself; but watching the film today, we can celebrate that they were released to not only express themselves but to give even more to their legacy."
    },
    {
      "username": "Lejink",
      "userUrl": "https://www.imdb.com/user/ur15298231",
      "reviewLink": "https://www.imdb.com/review/rw7606304",
      "warningSpoilers": false,
      "date": "2 December 2021",
      "rate": "9",
      "helpful": "55 out of 61 found this helpful.",
      "title": "Up On The Roof",
      "content": "The climactic third segment of Peter Jackson's re-edit on Michael Lindsay-Hogg's raw footage for the original \"Let It Be\" feature in 1970. In the intervening 51 years, many of the significant characters here are no longer with us, most obviously Lennon and Harrison, but also George Martin, Billy Preston and Linda McCartney (then Eastman) to name but a few. Me, I'm glad I've lived long enough as a lifelong Beatles fan to see this up-close-and-personal glimpse of them in the studio and of course, in the end, playing live for the last time, on the roof of the Apple Studios building on Savile Row, London.If the first film of the three showed the group not coping with being expected to work in the cavernous Twickenham Film Studio set to the extent of becoming fractious with one another and not getting a whole lot done and the second their reconciliation and rediscovery of their collective mojo boosted by the drafted-in guest appearance of keyboardist Billy Preston, then this last instalment showed the race against time to complete their elpee's worth of songs (at which they fail) and agreement to an almost ad-hoc suggestion that they perform their new material live above the mostly agog office and shop-workers below (at which they succeed).I do hope now that the often upbeat nature of these films and the way they showed the band tightening up, in more ways than one, will replace the perception of these sessions, as portrayed in the original film, as negative and downbeat. Yes, there were disagreements and falling-outs along the way, but when their backs were against the wall, the band always came out fighting, as McCartney states they invariably did when the occasion called. While in the first hour, perhaps the odd extended jam or two could have been cut down or out, these are more than made up for with priceless scenes with the group chemistry very much in evidence, witness George asking for help with his lyric for \"Sonething\", his own helping of Ringo to knock \"Octopus's Garden\" into shape or John and Paul hilariously co-singing \"Two Of Us\" as if they were ventriloquists.Best of all though was the music itself. Marvel at their prolific output, setting themselves a 14-song target, this, remember just a few months after they'd unleashed 30 newbies on \"The White Album\". Also dig how they individually and collectively pull a song together, not stopping until they get it right. Initially trepidatious at witnessing a perceived up-close disintegration of my favourite band, instead I got an insight into the years of gigging and recording which helped them stay together for so long. Yes, at times, it's clear the ends were fraying as they grew apart and would come loose for good after one final magnificent hurrah with \"Abbey Road\", but this extended window into their world only deepened my love and admiration for this most special band.The highpoint of \"Get Back\" of course was the uncut 40 minutes or so of the rooftop show, again with Billy Preston as their side-man on keyboards, blasting out their new music over the streets of London prompting the attention of the stuffy, out-of-touch local plod to shut them down. All the sometimes ramshackle rehearsals and run-throughs forgotten, on a cold but sunny winter morning, they sing and play magnificently together one last time in a truly Olympian performance, to the mortals below.And in the end, borrowing a phrase from a lesser but still very popular band, all I can say is thank you for the music, boys, you were the best."
    },
    {
      "username": "hughjman",
      "userUrl": "https://www.imdb.com/user/ur3681150",
      "reviewLink": "https://www.imdb.com/review/rw7585042",
      "warningSpoilers": false,
      "date": "26 November 2021",
      "rate": "10",
      "helpful": "106 out of 115 found this helpful.",
      "title": "Could watch them do anything",
      "content": "One of the things about being a Beatles fan since the Ed Sullivan show was that it was fun to watch them do ANYTHING. We weren't inundated with celebrity footage like we are now, so even getting to watch them boil an egg was wonderful. I still feel that way.One thing about this film: the Beatles just jamming is better than about half the music ever.And even with any bickering, you can tell how much fun they had playing together.It makes me sad all over again about John's life being cut so short."
    },
    {
      "username": "ferguson-6",
      "userUrl": "https://www.imdb.com/user/ur0806494",
      "reviewLink": "https://www.imdb.com/review/rw7596437",
      "warningSpoilers": true,
      "date": "29 November 2021",
      "rate": "10",
      "helpful": "90 out of 105 found this helpful.",
      "title": "they passed the audition",
      "content": "Greetings again from the darkness. It's a lot of Beatles. The three episodes total more than 7 hours of run time. It will be likely be too much for most folks. Not for me. In fact, I envy Oscar-winning director Peter Jackson, who got to go through every minute of 60 hours of video and 150 hours of audio from the 1969 sessions that led to the \"Let it Be\" album and documentary, as well as the band's infamous rooftop live performance atop Apple Studios. The 1970 film won the band an Oscar for best original music, but unfortunately, that 42 minutes on the rooftop would be their final public live performance as The Beatles.For those who have seen the 1970 documentary LET IT BE, you are aware of the discord amongst the band members during the sessions, but Peter Jackson's project shows us there was much more to the story: pressure, expectations, creative forces, doubt, friendship, young men changing, and plenty of laughter and joking. And cigarettes. An incredible number of cigarettes. Keep in mind that even though they were the biggest band in the world, these lads from Liverpool still only ranged in age from the youngest, George at 25, to the oldest, John at 28.One thing we notice is that there was a very small group involved with the daily activities. Outside of the band members, the faces we see most are Music Producer George Martin, the band's long-time assistant Mal Evans, and renowned Sound Engineer Glyn Johns. It's not really discussed here, but despite all the work we see Mr. Johns perform over the 22 days, it was Phil Spector who ended up with the production credit on the album. The director of the LET IT BE documentary, Michael Lindsay-Hogg, is seen quite a bit in the first two episodes, although he's not as funny as he seems to think he is. Film Producer Denis O'Dell initially sets the band up at Twickenham Film Studios, which he rented as the location for his upcoming zany comedy THE MAGIC CHRISTIAN starting Peter Sellers and, yes, Ringo Starr. It's this movie that has the Beatles on such a tight schedule, and it's at Twickenham where Peter Jackson's film kicks off.PART 1 (2 hours, 34 minutes) provides a quick history of the band, dating back to 1956 when John Lennon and Paul McCartney formed The Quarrymen and invited George Harrison to join as a guitarist. There is a clip of the band performing at The Cavern, and a note on how Brian Epstein became the band's manager. It was 1963 when George Martin began producing the band and that's they year they hit #1 in Britain, kicking off Beatlemania. The following year took them to the United States for the appearance on The Ed Sullivan Show, and it was 1966 when the band faced the backlash over John's comment about \"being more popular than Jesus.\" That was also the year when the band decided against future tours, choosing instead to focus on studio work and albums. 1968 brought the death of Brian Epstein at age 32, and the infamous trip to India, where they spent time with Maharishi Mahesh Yogi. So here they are in January 1969, with the goal of writing, rehearsing, and recording 14 songs, and then performing live over about a three week period.Director Jackson uses the 22 days as a framing structure, going day-by-day to track the progress. Day 1 is kind of a feeling-out day as the band checks out the studio. Day 2 finds Paul in business mode, as the other band members poke fun at the Fan Club publication. Day 3 delivers the familiar setting of George being \"annoyed\" by Paul, but it's Day 4 where \"Get Back\" is born, \"Across the Universe\" is introduced, and a terrific then-and-now montage of \"Rock and Roll Music\". Day 5 gives us \"I Me Mine\", as the band discusses ideas for the live show, and we learn code names for Ringo (Russian) and George (France). Day 6 finds Linda Eastman (not yet married to Paul) snapping photos in the studio while the band works on \"The Long and Winding Road\", and \"Let it Be.\". Day 7 is critical, as we get more \"Get Back\", numerous mentions of Eric Clapton, and George leaving the band with \"See ya' in the clubs.\" This is when we are subjected to our first Yoko Ono banshee screams. She has been attached to John's hip for most every minute.This first episode provides us our first look as the band works out songs on the fly. Ringo keeps amazing rhythm, while remaining mostly quiet. George's insecurity and annoyance with his role (and Paul's bossing) is beyond obvious (resulting in his leaving), and the band's uncertainty about the best direction for the live performance is a bit unsettling. Despite all of that, it's truly fascinating and humbling to watch and listen as they create the rough early versions of songs that we now know so well.PART 2 (2 hours, 12 minutes) is probably my favorite episode of the three. For Day 8, with George having quit the band, Ringo is the first to show up as flowers are delivered for George from the Hare Krishnas. We eavesdrop as Paul (with Linda in tow) analyze the John and Yoko relationship, and we are privy to a secret conversation between John and Paul regarding George and the band. The rest of the day is spent rehearsing 3 songs, including Paul and John brainstorming fine-tuning \"Get Back\" lyrics. Day 9 has Peter Sellers stopping by - and likely wondering what the heck kind of mess he's wandered into. This is Paul's day to be irritated and stating they can't go on like this. Day 10 reports on the band's meeting at George's house, which results in his return to the band and a shift from Twickenham studios to the Apple Studios on Savile Row, This throws a delay into things, and makes Day 11 a lost day.Day 12 has the four band members back recording, despite technological challenges and a scathing article on the band in local publications. It's this day when we hear an amazing version of \"I Dig a Pony\", followed by \"I've Got a Feeling\", \"Don't Let Me Down\", and \"She came in through the Bathroom Window\" (which would end up on Abbey Road). On Day 13, John recalls the Martin Luther King Jr speech, and the band gets a jolt of energy from keyboardist Billy Preston. Watching them perform \"I've Got a Feeling\" is pure musical joy. Day 14 stars strangely with more Yoko banshee screams, and Maxwell's anvil is in the middle of the room, while the band solidifies the \"Get Back\" single. Day 15 offers discussions of Billy Preston as the 5th Beatle, while we get a Pattie Harrison sighting, and performances of \"Two of Us\" and \"Polythene Pam.\" Day 16 includes flashbacks to the trip to India, George working on \"For You Blue\", the band's first look at the rooftop, and early work on \"Let it Be\". Once again, watching the creativity in action is simply mesmerizing.PART 3 (2 hours, 19 minutes) begins on Day 17, which is only 3 days until the rooftop performance. George is assisting Ringo with writing \"Octopus's Garden\", which will end up on the Abbey Road album. Linda's young daughter Heather bounces around the studio, and we can all relate to her cringing at Yoko's latest banshee scream. We see John go hard on \"Dig it\", while the band spends a great deal of time jamming to their favorite classics. These are musicians collaborating on the music they love - and enjoying every bit. Day 18 has George running through \"Old Brown Shoe\", and John and Yoko celebrate her divorce being final. With Alan Parsons in the booth, the band goes through many takes of \"Get Back\". On Day 19, George begins early work on \"Something\", which would be featured on the Abbey Road album, and they wrap up the \"Don't Let Me Down\" recording. With the live performance scheduled for tomorrow, Paul and John have a serious discussion about the payoff for all of this work. Is an album and one live show enough, if there is no TV special? As Paul's brother Michael watches, we can't help but think Paul was really hoping for another tour - one that would never happen.Day 21, January 30, is when the rooftop performance actually happens. There are 10 cameras in place, 5 of which are on the roof with the band. Most of us have seen these performances, but director Jackson includes some of the 'second takes'. The band opens with two takes of \"Get Back\", followed by \"Don't Let Me Down\", \"I've Got a Feeling\", \"One After 909\", \"Dig a Pony\", and second takes of \"I've Got a Feeling\" and \"Don't Let Me Down\". Included here are some of the interviews from folks on the street, and we see the cops who are unsure how to handle the noise complaints. What's obvious and thrilling is that John's and Paul's voices are in prime form, and the band is truly enjoying doing what they do better than any other band ... despite the cold London weather. You can sense their pride as they head to the booth for the playback. Day 22 is the Final Day, and the band finishes the mostly acoustic recordings for the album.Over the three episodes, we hear bits and pieces of more than 100 songs, and we witness the collaboration and tribulations of a band that reached heights of popularity previously unimaginable (remember Elvis never performed in the UK). It's quite a privilege to witness artists at work during the creative process. Tension and disagreements are to be expected, and yes, they did occur. Perhaps those tensions drove the individuals to be even more creative and better at their craft. Regardless of your thoughts on this, one thing is certain ... The Beatles \"passed the audition\".Now streaming on Disney+"
    },
    {
      "username": "blanche-2",
      "userUrl": "https://www.imdb.com/user/ur0342623",
      "reviewLink": "https://www.imdb.com/review/rw7610517",
      "warningSpoilers": false,
      "date": "3 December 2021",
      "rate": "10",
      "helpful": "56 out of 64 found this helpful.",
      "title": "an inside look at the greatest group of all time",
      "content": "\"Get Back\" tells the story of the end of The Beatles, sessions with the goal of a live performance, followed with a new album.This was absolutely fantastic. To see the Fab Four intermingling, to witness the creative process, the dynamic between John and Paul, George's unhappiness with the group, was remarkable.This was the brainchild of Michael Lindsay-Hogg, the son of actress Geraldine Fitzgerald and Sir Edward Lindsay-Hogg - except that it turned out that his father was really Orson Welles.With the death of their manager, Paul McCartney reluctantly became the \"head\" of the band, intending to give them focus. Lennon was very involved with Yoko Ono (who sat next to John at all times); George was unhappy; and the affable Ringo seemed to be in the background, a friend to everyone.When George says he's leaving - and leaves - there isn't much reaction. It's almost as if it dawns on them later as to what actually happened. \"If he's not back by Tuesday, we'll get Clapton,\" John says. After two meetings with George, he returns, with the promise that they will continue working in Apple's studio rather than at Twickenham, and that all talk of live performance be shelved - permanently.In a fascinating discussion between John and Paul, which was obtained by a hidden microphone, we learn more about their dynamic. Both are resentful of the other taking charge. Lennnon accuses McCartney of rejecting other peoples' ideas because -- \"I'm Paul McCartney.\"McCartney acknowledges, \"You have always been boss, and I've been sort of secondary boss.\" With Epstein's gone, and Lennon involved with Ono, McCartney filled the void. That seemingly bothered Harrison, who would have been happier with Lennon.It was finally decided that the Beatles would do a rooftop concert. Fascinating to see people walk by the building, stop, and realize what's going on. The group followed up with the album Let it Be. I'm not sure any of them ever did."
    },
    {
      "username": "HabibieHakim123",
      "userUrl": "https://www.imdb.com/user/ur105506099",
      "reviewLink": "https://www.imdb.com/review/rw7597708",
      "warningSpoilers": false,
      "date": "29 November 2021",
      "rate": "10",
      "helpful": "48 out of 54 found this helpful.",
      "title": "Just Wow.....",
      "content": "Greatest Band Of All Time Recording Some Of The Greatest Songs Of All Time Directed By One Of The Greatest Director Of All Time In One Of The Best Documentary Of All Time."
    },
    {
      "username": "theo-57528",
      "userUrl": "https://www.imdb.com/user/ur73380986",
      "reviewLink": "https://www.imdb.com/review/rw7583359",
      "warningSpoilers": false,
      "date": "25 November 2021",
      "rate": "10",
      "helpful": "131 out of 138 found this helpful.",
      "title": "Historical treasure",
      "content": "A historical treasure, masterpiece, call it what you will. All I know is that this will be admired not for years, but for centuries. Watching these compositions being created is truly staggering."
    },
    {
      "username": "gbill-74877",
      "userUrl": "https://www.imdb.com/user/ur66111139",
      "reviewLink": "https://www.imdb.com/review/rw7743421",
      "warningSpoilers": false,
      "date": "10 January 2022",
      "rate": "10",
      "helpful": "20 out of 22 found this helpful.",
      "title": "Brilliant",
      "content": "There is something so transcendent and yet somewhat sad about seeing this old footage, with its incredible level of access at a time so pivotal for The Beatles. At nearly eight hours long it's like the viewer is sitting in the studio with the band as they developed songs for what at varying turns was meant to be a concert, TV show, and documentary. It's a long haul and we do hear some of the material again and again as it's honed to its final form, but seeing the interaction between the band, watching them collaborate, and getting insight into their relationships is truly special, a blessing really, and I could have watched another eight hours of this.First of all, the band sound fantastic, and their skills as musicians are on full display from the first time they start practicing new material all the way up to their rooftop concert at the end. The presence of Billy Preston in these sessions can't be overstated either; he's brilliant too. John liked the idea of Preston being a 5th Beatle, not just for his keyboard skills but because of his positive effect on the band's energy, to which George playfully suggested getting Bob Dylan as well (shades of the supergroup, Traveling Wilburys, that he would help form in 1988).With the absence of former manager Brian Epstein keenly felt, we see Paul attempting to help fill this void, but occasionally rubbing George and John the wrong way. Paul is clearly the leader, bringing forth the most material, pushing the band to do something bigger than another album, and seemingly most invested in keeping the band together. We see a bit of a maniacal genius behind his affable exterior, however, something I wasn't expecting.It's interesting to think about the subsequent narrative that Yoko broke the band up, something pushed by Paul himself (e.g. In his early lyrics to 'Too Many People'), without Paul examining his own culpability. He ultimately wouldn't accept Allen Klein as the band's manager, here seen as someone John is so impressed with after an initial meeting, and is often bossy, particularly with George, which resulted in George storming off for five days. The interaction is at its lowest ebb when John flippantly quotes lyrics after a late night doing drugs while Paul stews and comments on the need for a schedule. Peter Sellers turns up and, sensing the bad vibes in the air, departs rather quickly. The growing cracks are evident, and it's a little unfortunate that this documentary came at a time when they were beginning to grow apart from each other (just imagine getting this kind of access a few years earlier!). Then again, filmed at this time, it's enlightening.Anyway, that negativity aside, there are lots of great moments to be found here and I was mesmerized throughout. Here were some of my favorite bits for each of the lads:Paul: Seeing Paul give birth to the song 'Get Back' while waiting for John to show up one morning, with Ringo and George gradually being drawn in, is an extraordinary, goosebump type of moment. It was also fascinating to watch it evolve, including briefly becoming a song condemning rising anti-immigration sentiment.Paul's songwriting is brilliant across so many other titles as well. There is something incredibly profound about the rest of the band watching him perform an early version of 'Let it Be' at the piano. In another moment he's casually practicing proto forms of 'Another Day' and 'The Long and Winding Road' at the piano, referencing 'The Wizard of Oz' and working the lyrics out while his (soon-to-be) wife Linda looks on and takes photos. He's then on to 'Golden Slumbers/Carry That Weight,' and later while all the equipment is being moved, drops by to record a demo of 'Oh! Darling.' It's just a fantastic, prolific burst of songwriting from him, though you could say that about the entire decade.Paul reading an incendiary tabloid article about the band aloud while Lennon leads the others in a blues song gives us a little look at what it's like to read about oneself in the press. The article from Michael Housego is maddening in how salacious it is, yet there are also elements of truth in it.Seeing little 6-year-old Heather Eastman, Linda's daughter, playing around in the studio, and Paul and the others playing around with her.This quote, heard 52 years later: \"It's going to be such an incredible, sort of comical thing like in 50 years' time, you know, they broke up cuz Yoko sat on an amp.\"John: My favorite moment for John was when George was talking about doing a solo album because he had so much material, with the idea being that he would then return to work with the Beatles. John is very supportive, something we see at other times, him listening to others calmly with direct eye contact, and then simply explaining his views. Paul and Ringo were away at lunch at the time, and when interviewed recently by Stephen Colbert, Peter Jackson said that Paul told him he was unaware this conversation had taken place, and said of it \"Oh, I wish I knew they had said that at the time,\" as it could have shown a path forward to staying together.It's also a joy to watch John getting animated and playfully goofing around, particularly after the band abandoned Twickenham Studios and moved to Apple. He spontaneously plays old songs from other artists for the fun of it, and at one point demonically makes faces at Paul while they sing through their teeth without moving their lips. On the final version of 'Let It Be,' the one used for the album, we see him making faces while mouthing the words.Hearing John talking about some of the things that had impressed him. He comments on liking what he saw in Fleetwood Mac on television the night before, and was extremely impressed by MLK's 'I Have A Dream' speech six years after hearing it, comparing it to the poetry of Tennyson.This exchange:George Martin: You can always edit.John: Edit? You're talking to The Bootles!George: My favorite moment with George was when Paul and John were reflecting back on their trip to India a couple of years earlier to see Maharishi Mahesh Yogi. Jackson interleaves this beautifully with footage from the trip, and they were saying how it wasn't quite themselves, because it was like them being in school. George then simply says that the whole point of it all was to help find oneself, and to be oneself, ironically.George's songwriting is lovely here as well. At one point we hear him describing the science fiction show on TV and something which followed that featured waltzing as the inspiration for his ethereal song 'I Me Mine,' and then see John and Yoko dancing in the studio to it. Later we see him getting newspaper stuffed into the piano to make it sound more honky-tonk for his song 'For You Blue,' and executing it in a small number of takes. He talks about his frustration with working on the lyrics to 'Something' for six months, and it's fascinating to watch him try to work through them with the others (John: \"Just say whatever comes into your head each time - 'attacks me like a cauliflower,' until you get the word, you know?\"). He also stays up late to write 'Old Brown Shoe' because a decade earlier John had advised him that it's best to finish songs straight away once started.This quote: \"The idea of the boat is completely insane.\" He says that while the band wrestle with all sorts of ideas, ranging from a TV show to filmmaker Michael Lindsay-Hogg pushing repeatedly for a concert at the ancient amphitheater at Sabratha in Libya on the Mediterranean coast. At one point they appear to be seriously considering getting a giant boat to take themselves and a large number of fans over, a ludicrous idea, and it's George who points this out.Ringo: Ringo: \"I've farted.\" Also Ringo: \"I would like to go on the roof.\" That came right after George said he didn't want to, and if Ringo had echoed him, the legendary performance on the roof of Apple Corps, their final public appearance, might not have happened.Ringo, often called Ritchie by the others, bringing in his first version of 'Octopus's Garden,' somewhat bashfully playing it, and George helping him flesh it out."
    },
    {
      "username": "wardster-24336",
      "userUrl": "https://www.imdb.com/user/ur86441522",
      "reviewLink": "https://www.imdb.com/review/rw7583824",
      "warningSpoilers": false,
      "date": "25 November 2021",
      "rate": "10",
      "helpful": "86 out of 94 found this helpful.",
      "title": "Brilliant",
      "content": "Perfect , masterful , and the best way to spend thanksgiving. Every Beatles fan should watch this ! It's so clear, it's liked they filmed it today . Masters are work and it feels like you're in the room with them."
    },
    {
      "username": "TheLastDon81",
      "userUrl": "https://www.imdb.com/user/ur71399861",
      "reviewLink": "https://www.imdb.com/review/rw7584998",
      "warningSpoilers": false,
      "date": "26 November 2021",
      "rate": "10",
      "helpful": "57 out of 64 found this helpful.",
      "title": "Amazing But just one thing....",
      "content": "After watching the first part of this documentary, I couldn't help but feel stressed out for the band as they put pressure on them selves to meet the deadline. A great job is done directing this and it's a true treasure of unseen footage. Just one thing.... Yoko is ALWAYS THERE!! Literally just sitting there saying nothing and staring.... All... the... time!! Wow... just wow. I guess we all have a friend whose spouse is always hovering lol. Anyway I'm excited for part 2. That's all."
    },
    {
      "username": "MReed542",
      "userUrl": "https://www.imdb.com/user/ur21080663",
      "reviewLink": "https://www.imdb.com/review/rw7587842",
      "warningSpoilers": false,
      "date": "26 November 2021",
      "rate": "10",
      "helpful": "59 out of 64 found this helpful.",
      "title": "A magnificent gift",
      "content": "What a treasure! If I could give this 20 stars I would. Some of my earliest memories are of the Beatles and I can still remember every word to every Beatle song even though other memories in my life have faded. This film is a gift to the world. A found item in the most magical of attics. To see the collaboration, the talent, the brotherhood in such intimate detail is truly wonderful. I loved every minute of it. Peter Jackson is also a gift and it must have been near impossible to decide what to leave in and what to exclude. Like LOTR he nails it, managing to honor the content without forcing himself of it. It will always be difficult to watch John knowing his unacceptable end but what a great tribute and memorial this is. And sweet George. While others screamed for Paul, I was always a George girl. If I could just go back in time and take the cigarette out of his hand I would. Alas it is the way of things. Thank you Peter Jackson for this most wonderful of gifts!!"
    },
    {
      "username": "deanbean317",
      "userUrl": "https://www.imdb.com/user/ur7136844",
      "reviewLink": "https://www.imdb.com/review/rw7589184",
      "warningSpoilers": true,
      "date": "27 November 2021",
      "rate": "10",
      "helpful": "38 out of 43 found this helpful.",
      "title": "Just as fresh as if it were...yesterday!",
      "content": "The standout event for me (so far) was watching Paul conjure the song Get Back from a magical void! As he sat in his chair strumming his bass, every Beatles fan recognized immediately the beginning bars of that now timeless classic. But when he initially started strumming...it was nothing...just idle strumming that slowly took form. He then added some cast off lyrics, repeated them a few times, then pulled that unforgettable chorus out of thin air! Even though this was filmed 50 years ago, the electricity of that moment crackled. Even though the unmistakable signs of a band in decay were on full display, as John stated, when their backs were against the wall, the \"geniuses at work\" sign was hung out, and the boys got about creating art. I CAN'T WAIT to see parts two and three!"
    },
    {
      "username": "blues9981",
      "userUrl": "https://www.imdb.com/user/ur9450775",
      "reviewLink": "https://www.imdb.com/review/rw7586127",
      "warningSpoilers": false,
      "date": "26 November 2021",
      "rate": "10",
      "helpful": "57 out of 64 found this helpful.",
      "title": "Wow wow and wow",
      "content": "I don't even know where to start. I subscribed to Disney+ just for this and it is a masterpiece. I've seen the \"Let It Be\" documentary (everybody knows the historic Paul and George argument and \"I'll play anything you want me to play\") but this is way beyond that. I related to every single rehearsal scene (from my experiences) and connected mostly with Paul (I don't want to be the leader and songwriter but someone has to do it). But oh Lord I wish I was Lennon. I knew he was hilarious but I had no idea he was the most hilarious human on the planet. (And a great soulful writer and singer, but we already knew that). There are scenes where Paul is trying to get the others to pay attention to some of his greatest songs in creation like Long and Winding Road, Get Back, and Let It Be...and no one cares. Until they do. And it's a really deep dive into the creative process and mumbling nonsense lyrics and playing total garbage until it all comes together. And drunken debauchery (along with other substances) until you have masterpiece level music. And I haven't even mentioned Linda's soulful eyes and camerawork, Ringo's sad silence before he's drawn into the songs, George's classic songs (like All Things Must Pass) that never made the record, the bizarre goofy blues jams, and Yoko. But I've already said too much. Just watch it."
    },
    {
      "username": "bruce350",
      "userUrl": "https://www.imdb.com/user/ur18278164",
      "reviewLink": "https://www.imdb.com/review/rw7588024",
      "warningSpoilers": false,
      "date": "26 November 2021",
      "rate": "10",
      "helpful": "38 out of 41 found this helpful.",
      "title": "Get Back is brilliant!",
      "content": "As a big Beatles fan since I was a kid and the anticipation of a new Beatles album was still a reality, I was transported back in time. As you watch the 4 lads come up with new songs, seemingly out of thin air, you get the feeling these guys are pure geniuses. The one part that blew my mind was a scene from 1966 at Candlestick Park in San Francisco. It was just 3 years earlier yet the Beatles had changed so drastically, from 4 MopTops still in the thrall of Beatlemania ('66) to 4 transformed and more mature, wealthy individualists on the verge of solo careers ('69).I just love this documentary."
    },
    {
      "username": "billcr12",
      "userUrl": "https://www.imdb.com/user/ur14295241",
      "reviewLink": "https://www.imdb.com/review/rw7588556",
      "warningSpoilers": false,
      "date": "26 November 2021",
      "rate": "10",
      "helpful": "82 out of 107 found this helpful.",
      "title": "Magic",
      "content": "Wow. Watching the Beatles rehearse and interact is mesmerizing. The music is better than anything over the past fifty plus years. My only complaint is the presence of Yoko Ono, who sits and stares into space and does her ridiculous screamimg routine for a couple of minutes each episode. Jackson should have left her on the cutting room floor. Otherwise, this is a must watch for all music lovers. It gives a new perspective on the history of the relationships between the four young men who changed the course of the history of music. Do not miss this great series."
    },
    {
      "username": "connjam5-381-425263",
      "userUrl": "https://www.imdb.com/user/ur33986412",
      "reviewLink": "https://www.imdb.com/review/rw7584974",
      "warningSpoilers": false,
      "date": "26 November 2021",
      "rate": "10",
      "helpful": "47 out of 53 found this helpful.",
      "title": "Fantastic",
      "content": "Fantastic to see the inner workings of the Fab Four and their creative process. Coming up with songs like let it be and get back on the hoof. Supremely talented. Also great to see the hierarchy of the group with Paul and John calling all of the shots. George being 'the quiet one' and Ringo just going along. Great insight."
    },
    {
      "username": "florenciaactis23",
      "userUrl": "https://www.imdb.com/user/ur57094459",
      "reviewLink": "https://www.imdb.com/review/rw7583976",
      "warningSpoilers": false,
      "date": "25 November 2021",
      "rate": "10",
      "helpful": "70 out of 77 found this helpful.",
      "title": "Amazing!!!!",
      "content": "This is just incredible!!! I can't believe this existed for so long and we are just watching it now. I can imagine all the hours of footage that are left. Just create a serie with the tapes, no need to edit, we will all be happy just hear them talk about anything :D."
    },
    {
      "username": "brimoose",
      "userUrl": "https://www.imdb.com/user/ur28285661",
      "reviewLink": "https://www.imdb.com/review/rw7583260",
      "warningSpoilers": false,
      "date": "25 November 2021",
      "rate": "10",
      "helpful": "90 out of 102 found this helpful.",
      "title": "WOW!!!",
      "content": "It really doesn't get any better than this. Over 50 yrs ago and I feel like I was in the room watching real magic with 4 magicians. I really don't know how anyone cannot be a Beatles fan."
    },
    {
      "username": "zorba-36271",
      "userUrl": "https://www.imdb.com/user/ur88581036",
      "reviewLink": "https://www.imdb.com/review/rw7588903",
      "warningSpoilers": false,
      "date": "26 November 2021",
      "rate": "10",
      "helpful": "31 out of 36 found this helpful.",
      "title": "I love seeing the process musicians go through to make music",
      "content": "Beautifully breaks down the process a group of talented musicians who went through to make their art. An excellent behinds the scenes peak at what the most popular band of all time (with a deadline) went through with multiple voices trying to steer them in multiple directions. The fighting in the middle if the creative process, pushing of ideas, & ultimately getting to a final result. Beautifully captured and I'm glad Peter Jackson put this together."
    },
    {
      "username": "mikeiskorn",
      "userUrl": "https://www.imdb.com/user/ur109877860",
      "reviewLink": "https://www.imdb.com/review/rw7623672",
      "warningSpoilers": false,
      "date": "7 December 2021",
      "rate": "10",
      "helpful": "16 out of 18 found this helpful.",
      "title": "Perfect",
      "content": "This review is going to be kept short because I feel I would be in danger of just copying what other reviewers have said but this documentary is fantastic. I wish it was longer!!! I could listen to and watch them rehearse all day. If you're a fan, you will absolutely love this and the way it looks! WOW! It's beautiful, crisp, clear and all round stunning to look at it."
    },
    {
      "username": "AudioFileZ",
      "userUrl": "https://www.imdb.com/user/ur3580907",
      "reviewLink": "https://www.imdb.com/review/rw7593918",
      "warningSpoilers": false,
      "date": "28 November 2021",
      "rate": "9",
      "helpful": "24 out of 29 found this helpful.",
      "title": "All Things Must Pass...Thankfully This Was On Film.",
      "content": "The Beatles were like a soundtrack to my life-long love of music. Being a fan like this I will not see this as too slow, too long, or repetitious. I see it like an unearthed treasure of seeing The Beatles at a nexus of profound change after all of the amazing music and success. Was a new chapter beginning? They definitely had an idea of returning to playing live. This is that story in great completeness. Like a fly on the wall we get to-candidly see the band in trying to harness the greatness for something special and now, thanks to Peter Jackson, we get it. Amazing candid look at late Beatles like no other. Disturbing the peace my left foot...the last concert deserved better than those \"Bobbies\" little snit!"
    },
    {
      "username": "mickman91-1",
      "userUrl": "https://www.imdb.com/user/ur10294945",
      "reviewLink": "https://www.imdb.com/review/rw7700612",
      "warningSpoilers": false,
      "date": "29 December 2021",
      "rate": "9",
      "helpful": "15 out of 17 found this helpful.",
      "title": "Like stepping into a time machine and spending time with John, Paul, George, and Ringo in a way that has never been possible before. Historically and culturally significant.",
      "content": "I am 30 years old so wasn't around in the 60s so didn't have already an idea formed at the time about what happened during this important stage of The Beatles. However, I am a music fan, I am British, and I am fairly well read so I am well aware of the inestimable impact of The Beatles on popular music and popular culture through the last 60 years and which continues on today. I wanted to watch this because (rave reviews aside) I know how well Peter Jackson did his WWI documentary, and I was curious about seeing John, Paul, George, and Ringo intimately in a way that has never been seen before.Overall, the words I would use to sum it up is FASCINATING. Absolutely fascinating. It's like stepping into a time machine and peering in through window of a time that in many ways feels so long ago, yet which feels so close in these pictures. It is 8 hours long and not a great deal happens in terms of narrative prior to the last hour. But you just can't look away. It is absolutely fascinating just spending time in the presence of these incredible musicians, artists, and personalities. And the knowledge of who they are and their stratospheric celebrity status at this time makes watching just absolutely fascinating. It's like when the Royal Family documentary was first aired in the 1960s and it showed them in a way that had not been seen before and helped to break the idea in the public consciousness of them being any different from any other family. This documentary for the first time shows the 4 lads as they really were - just a group of friends and incredible musicians performing their craft and trying to find their way. And I am confident that it will turn out to be pivotal in evolving the image of the Beatles in the public consciousness. Because it was so long ago many people rever the Beatles and their music as if they were mythical beings beyond critique, in a way that people don't worship celebrities anymore because we see them air all of their dirty laundry on our news feeds. This will surely break down some of the pedestals that the Beatles are placed on. But in my opinion this is not a negative thing. Because I understand that up to now the individuals at this time (1969) had been caricatured in unflattering ways: McCartney too egotistic, John too infatuated with Yoko, George too weak, Ringo too willing to be carried etc. But here we learn that none of this is true in the ways that people speculated. McCartney was passionate and the most prolific with song writing and willing to stick his head above the parapet to lead a band to produce their best work when they were tired and burnt out, John was prioritising other facets of his life less out of selfishness but more natural evolution yet still tried his best to have fun and make good music, George was itching to step into his own voice musically yet still noble enough to defer to McCartney and Lennon for the sake of the band, and Ringo the unsung hero who never made a fuss or put his head above the parapet, yet was always there with talented rhythms when needed.It is difficult to review this documentary in the normal way. Because it is not normal. It is a once in a generation type thing. Once in a 60-year type thing in fact. The influence and impact of the Beatles is unlike anything else in popular music. And this is the window into their lives and a period of their creative careers that has never been seen before nor will ever be seen again. So for historical and cultural importance it is a 10/10. For fascination and entertainment it is a 10/10. Credit has to be given to Peter Jackson for presumably his passion for this project and influence that made it happen, as well as putting it all together in a way that is very good quality as well as keeping it as authentic as possible and for keeping it the length it is. But even if technically it wasn't as good as Jackson has achieved it would still be just as fascinating and important because of its subject matter. However, I reserve 10/10 reviews for my very favourite things that affect me deeply on an emotional level and that I rewatch time and time again. This is not one of those things and perhaps only needs to be seen once. But that is a personal thing and aside from that, on an intellectual, engagement, and critical level it is perfect."
    },
    {
      "username": "notanaxkiller-107-287911",
      "userUrl": "https://www.imdb.com/user/ur55225194",
      "reviewLink": "https://www.imdb.com/review/rw7588084",
      "warningSpoilers": true,
      "date": "26 November 2021",
      "rate": "10",
      "helpful": "31 out of 37 found this helpful.",
      "title": "And in the end",
      "content": "I was about 15 when the Beatles hit the airways. They shook me like an internal earthquake. It was more than music; it was an understanding. A revelation. We were all thinking the same thing. This will sound trite to some. But the evidence of their commonality with all of us is revealed in their music. . NO ONE has EVER spoken with a single voice ...but that generation. They were our spokesmen. In six years, they changed the course of human nature. The world could STILL be saved now, if they remembered that All You Need Is Love. It's good to see the boys again. Future generations should pay attention. An event like the Beatles will never happen again. Never."
    }
  ],
  "errorMessage": ""
}