{
  "imDbId": "tt9735318",
  "title": "The Beatles: Get Back",
  "fullTitle": "The Beatles: Get Back (TV Series 2021–2021)",
  "type": "TVSeries",
  "year": "2021",
  "language": "en",
  "titleInLanguage": "The Beatles: Get Back",
  "url": "https://en.wikipedia.org/wiki/The_Beatles:_Get_Back",
  "plotShort": {
    "plainText": "The Beatles: Get Back is a 2021 documentary series directed and produced by Peter Jackson. It covers the making of the Beatles' 1970 album Let It Be (which had the working title of Get Back) and draws largely from unused footage and audio material originally captured for the 1970 documentary of the album by Michael Lindsay-Hogg. The docuseries has a total runtime of nearly eight hours, consisting of three episodes, each of duration between two and three hours covering about one week, together covering 21 days of studio time.\r\nAlso co-produced by Paul McCartney, Ringo Starr, Yoko Ono and Olivia Harrison, the series is presented by Walt Disney Studios in association with Apple Corps and WingNut Films. It premiered with three consecutive daily releases on Disney+ beginning on 25 November 2021. A portion of it, titled The Beatles: Get Back – The Rooftop Concert, was given a theatrical release in IMAX theatres across numerous US cities on 30 January 2022. It was then released internationally between 11 and 13 February 2022. The Beatles: Get Back was released on DVD and Blu-ray on 12 July 2022.\r\nJackson characterised the miniseries as \"a documentary about a documentary\". Get Back received critical acclaim for its coverage of the group's creative process, although detractors criticised the relatively long runtime. Commentators described it as challenging longtime beliefs that the making of the Let It Be album was marked entirely by tensions between the Beatles, instead showing a more upbeat side to its production.",
    "html": "<p>The Beatles: Get Back is a 2021 documentary series directed and produced by Peter Jackson. It covers the making of the Beatles' 1970 album Let It Be (which had the working title of Get Back) and draws largely from unused footage and audio material originally captured for the 1970 documentary of the album by Michael Lindsay-Hogg. The docuseries has a total runtime of nearly eight hours, consisting of three episodes, each of duration between two and three hours covering about one week, together covering 21 days of studio time.</p><p>Also co-produced by Paul McCartney, Ringo Starr, Yoko Ono and Olivia Harrison, the series is presented by Walt Disney Studios in association with Apple Corps and WingNut Films. It premiered with three consecutive daily releases on Disney+ beginning on 25 November 2021. A portion of it, titled The Beatles: Get Back – The Rooftop Concert, was given a theatrical release in IMAX theatres across numerous US cities on 30 January 2022. It was then released internationally between 11 and 13 February 2022. The Beatles: Get Back was released on DVD and Blu-ray on 12 July 2022.</p><p>Jackson characterised the miniseries as \"a documentary about a documentary\". Get Back received critical acclaim for its coverage of the group's creative process, although detractors criticised the relatively long runtime. Commentators described it as challenging longtime beliefs that the making of the Let It Be album was marked entirely by tensions between the Beatles, instead showing a more upbeat side to its production.</p>"
  },
  "plotFull": {
    "plainText": "The Beatles: Get Back is a 2021 documentary series directed and produced by Peter Jackson. It covers the making of the Beatles' 1970 album Let It Be (which had the working title of Get Back) and draws largely from unused footage and audio material originally captured for the 1970 documentary of the album by Michael Lindsay-Hogg. The docuseries has a total runtime of nearly eight hours, consisting of three episodes, each of duration between two and three hours covering about one week, together covering 21 days of studio time.\r\nAlso co-produced by Paul McCartney, Ringo Starr, Yoko Ono and Olivia Harrison, the series is presented by Walt Disney Studios in association with Apple Corps and WingNut Films. It premiered with three consecutive daily releases on Disney+ beginning on 25 November 2021. A portion of it, titled The Beatles: Get Back – The Rooftop Concert, was given a theatrical release in IMAX theatres across numerous US cities on 30 January 2022. It was then released internationally between 11 and 13 February 2022. The Beatles: Get Back was released on DVD and Blu-ray on 12 July 2022.\r\nJackson characterised the miniseries as \"a documentary about a documentary\". Get Back received critical acclaim for its coverage of the group's creative process, although detractors criticised the relatively long runtime. Commentators described it as challenging longtime beliefs that the making of the Let It Be album was marked entirely by tensions between the Beatles, instead showing a more upbeat side to its production.\r\nProduction\r\nWhile visiting Apple Corps to discuss working on a potential Beatles exhibition featuring augmented or virtual reality, Peter Jackson asked Apple about the archival footage for the 1970 documentary of the album, which he was allowed access to for a potential new documentary. Jackson was hesitant to sign onto the project because of his fears about the long-reported acrimony surrounding the Beatles breakup. Upon viewing the footage, he later stated, he \"was relieved to discover the reality is very different to the myth ... Sure, there's moments of drama – but none of the discord this project has long been associated with.\" Sixty hours of film footage, shot in January 1969, and over 150 hours of audio stemming from the original Let It Be film were made available to Jackson's team.\r\nProduction of The Beatles: Get Back employed film restoration techniques developed for Jackson's They Shall Not Grow Old. Jackson spent close to four years editing the series. It was created with cooperation from Paul McCartney, Ringo Starr and the widows of John Lennon (Yoko Ono) and George Harrison (Olivia Harrison), as well as music supervisor Giles Martin (son of George Martin and a regular producer of Beatles projects since 2006). In a news release, McCartney said: \"I am really happy that Peter has delved into our archives to make a film that shows the truth about the Beatles recording together\", while Starr echoed: \"There was hours and hours of us just laughing and playing music, not at all like the Let It Be film that came out. There was a lot of joy and I think Peter will show that.\"\r\nDisney was persuaded by the filmmakers to allow for the inclusion of profanity, with viewer discretion warnings at the start of each episode. According to Jackson: \"The Beatles are Scouse boys and they freely swear but not in an aggressive or sexual way. We got Disney to agree to have swearing, which I think is the first time for a Disney channel.\" Episodes also contain viewer discretion warnings for tobacco use. As a result, the theatrical release of The Beatles: Get Back – The Rooftop Concert received a PG-13 rating by the MPA for \"brief strong language, and smoking\".\r\nEpisodes\r\nContent\r\nThe final cut covers 21 days in the studio with the Beatles as they rehearse for a forthcoming album, concert and film project, and climaxes with the full 42-minute rooftop concert. Jackson described the series as \"a documentary about a documentary\", as well as a \"tougher\" one than Let It Be, since it includes controversial events such as Harrison's brief resignation from the band, which the original film had not covered. With the exception of specific shots where no alternative exists, most of the material that had been featured in Let It Be was not reused in Get Back, and the series primarily used footage captured from alternative camera angles in the case of sequences shared between the two works. According to Jackson, this choice was made out of a desire to \"not step on Let It Be's toes so that it is still a film that has a reason to exist, and our will be a supplement to it\".\r\nBen Sisario of The New York Times emphasises opening scenes of the series from January 1969, with McCartney creating the song \"Get Back\" \"out of nothing\" while awaiting Lennon who was running late. In his review, Sisario further posits that: Lennon's only aim in the Get Back project was \"communication with an audience\", McCartney asked the band to \"show enthusiasm for the project or abandon it\", Harrison openly contemplated \"a divorce\" (of the band), while the whole band were uncomfortable about Ono's presence at the sessions. However, the last statement is opposed by Andy Welch of The Guardian in his review of the documentary, who remarks: \"Yoko didn’t break up the Beatles. Blaming it on her was always an absurd, lazy accusation\". In other candid scenes, Starr offers Ono a piece of gum, Linda McCartney and Ono whisper as the band plays \"Let It Be\", Harrison impresses the band with a Bob Dylan cover, McCartney covers \"Strawberry Fields Forever\" with Lennon's approval, and McCartney defends Ono while grieving for the band's end.\r\nAnother key scene involves an off-camera lunch between Lennon and McCartney. The filmmakers put a microphone in the plant on the table unbeknownst to anyone, where it picked up the conversation. During the lunch, Lennon tells McCartney that he has become the leader of the group, which McCartney denies (\"You're still the boss, I'm just the secondary boss\"). They also discuss their treatment of Harrison, reminisce about the past and discuss the future of the group.\r\nRelease\r\nStreaming and home media\r\nThe project was announced on 30 January 2019, the fiftieth anniversary of the Beatles' rooftop concert. On 11 March 2020, The Walt Disney Studios announced they had acquired the worldwide distribution rights to Jackson's documentary, now titled The Beatles: Get Back. It was initially set to be theatrically released by Walt Disney Pictures on 4 September 2020 in the United States and Canada, with a global release to follow. Jackson said the feature film would have been around two-and-a-half hours long. On 12 June 2020, it was pushed back to 27 August 2021 due to the COVID-19 pandemic.\r\nOn 17 June 2021, it was announced that The Beatles: Get Back would instead be released as a three-part documentary series on Disney+ on the Thanksgiving weekend of 25, 26 and 27 November, with each episode being over two hours in length. On 16 November, McCartney attended the UK premiere of The Beatles: Get Back. Over its first four days of release, the series was streamed for a total of 503 million minutes (equaling 1.07 million complete views), with people over the age of 55 making up 54% of the demographic.\r\nWalt Disney Studios Home Entertainment distributed the series on Blu-ray and DVD on 12 July 2022. This was after a postponed release intended for 8 February 2022, reportedly due to a technical glitch with the discs that affected the sound and required reprinting.\r\nDuring The Rooftop Concert live screening event on 30 January 2022, Jackson stated that he hopes to release an extended edition of the series that would include three to four additional hours of previously unseen performance footage and band conversations, as well as new bonus material and interviews. He said that fans would need to help put pressure on Disney and Apple Corps to release this edition.\r\nThe Beatles: Get Back – The Rooftop Concert\r\nA feature of the rooftop concert from the documentary was released by Walt Disney Studios Motion Pictures in some United States IMAX theatres on 30 January 2022, with a global theatrical release from 11 to 13 February. The 30 January presentation was accompanied by a live-streamed Q&A with Jackson. In response to one question during the Q&A, Jackson said there were additional hours of restored but unreleased footage and interviews. As of 20 February 2022, the film has grossed $936,764 in the United States box office and $1.2 million internationally, for a worldwide total of $2.2 million.\r\nOn 30 January 2022, The Beatles: Get Back premiered in limited theatrical release in 67 theatres, grossing $391,252 at the box office. It was released again on 9 February, when it grossed approximately $50,468 in 80 theatres. It was released to an international audience during the 11–13 February box office weekend, and was shown in 181 theatres worldwide.\r\nOn 28 January 2022, the audio of the full rooftop performance, remixed in Dolby Atmos, was released to streaming services.\r\nMarketing\r\nOn 21 December 2020, a five-minute preview montage from the reproduced film, presented by Jackson, was released on YouTube and Disney+. The video features the band members dancing, doing impersonations, laughing, Lennon reading a newspaper article about Harrison's encounter with a photographer, as well as Lennon and McCartney \"jokingly singing 'Two of Us' through gritted teeth\". A one-minute clip of the film was released on YouTube on 12 November, containing a scene with the Beatles working on the song \"I've Got a Feeling\".\r\nThe release was preceded by the publication of a book of the same name – the first official book credited to the band since The Beatles Anthology (2000) – featuring an introduction by Hanif Kureishi. The book was initially scheduled for 31 August 2021 to coincide with the initial August release of the documentary, but was ultimately released on 12 October, ahead of the documentary. The documentary was also preceded by the release of a remixed, deluxe edition box set of the Let It Be album on 15 October by Apple Records.\r\nReception\r\nCritical reception\r\nReview aggregator Rotten Tomatoes reported an approval rating of 93% based on 119 reviews, with an average rating of 8.5/10. The website's critics consensus reads, \"It may be too much of a good thing for some viewers, but The Beatles: Get Back offers a thrillingly immersive look at the band's creative process.\" Metacritic gave the series a weighted average score of 85 out of 100 based on 28 critic reviews, indicating \"universal acclaim\".\r\nSheri Linden of The Hollywood Reporter called the documentary an \"immersive, in-the-moment chronicle of a generation-defining band in the act of creating, offering an up-close look at the quartet's alchemy\" and concluded that it \"offers ample evidence that necessity is in the eye of the beholder\". Rob Sheffield of Rolling Stone complimented the miniseries' intimacy, highlighting its poignant and \"quiet moments\" as \"the heart of the film\". Richard Roeper of the Chicago Sun-Times gave the miniseries a score of four out of four stars, deeming it \"one of the most entertaining, compelling and important chapters in filmed music history\" and praising the quality of the footage of the rooftop performance. In a five-star review for The Independent, Ed Cumming wrote that the acrimony besetting the Beatles had \"taken on a mythic quality\" since Lindsay-Hogg's 1970 film, but through Jackson's expanded coverage, \"Any future assessment of the band and its members will have to measure up against the people we see here.\"\r\nOwen Gleiberman, writing for Variety, said that while the story \"meanders\" and gets \"bloated\" in Part Three, it is an \"addictive\" portrait of a \"transcendent\" band that goes above \"both the hype and fan anxiety\". The Guardian's Alexis Petridis called the series \"aimless\", with repetition that was a \"threat to the viewer's sanity\", and said that while it had \"fantastic moments\", they were too few and far between. Writing in The Times, Beatles biographer Philip Norman was highly critical of the editing of the footage and general tone of Jackson's work, commenting that several \"inconvenient facts\", including Lennon's heroin addiction and the \"baiting\" of Ono, were ignored.\r\nAccolades\r\nSoundtrack\r\nThis is a list of all the songs heard in The Beatles: Get Back. All songs by Lennon–McCartney, except where noted.\r\nOpening\r\nTwickenham Studios sessions\r\nApple Studios sessions\r\nRooftop concert",
    "html": "<p>The Beatles: Get Back is a 2021 documentary series directed and produced by Peter Jackson. It covers the making of the Beatles' 1970 album Let It Be (which had the working title of Get Back) and draws largely from unused footage and audio material originally captured for the 1970 documentary of the album by Michael Lindsay-Hogg. The docuseries has a total runtime of nearly eight hours, consisting of three episodes, each of duration between two and three hours covering about one week, together covering 21 days of studio time.</p><p>Also co-produced by Paul McCartney, Ringo Starr, Yoko Ono and Olivia Harrison, the series is presented by Walt Disney Studios in association with Apple Corps and WingNut Films. It premiered with three consecutive daily releases on Disney+ beginning on 25 November 2021. A portion of it, titled The Beatles: Get Back – The Rooftop Concert, was given a theatrical release in IMAX theatres across numerous US cities on 30 January 2022. It was then released internationally between 11 and 13 February 2022. The Beatles: Get Back was released on DVD and Blu-ray on 12 July 2022.</p><p>Jackson characterised the miniseries as \"a documentary about a documentary\". Get Back received critical acclaim for its coverage of the group's creative process, although detractors criticised the relatively long runtime. Commentators described it as challenging longtime beliefs that the making of the Let It Be album was marked entirely by tensions between the Beatles, instead showing a more upbeat side to its production.</p><br/><h3>Production</h3><p>While visiting Apple Corps to discuss working on a potential Beatles exhibition featuring augmented or virtual reality, Peter Jackson asked Apple about the archival footage for the 1970 documentary of the album, which he was allowed access to for a potential new documentary. Jackson was hesitant to sign onto the project because of his fears about the long-reported acrimony surrounding the Beatles breakup. Upon viewing the footage, he later stated, he \"was relieved to discover the reality is very different to the myth ... Sure, there's moments of drama – but none of the discord this project has long been associated with.\" Sixty hours of film footage, shot in January 1969, and over 150 hours of audio stemming from the original Let It Be film were made available to Jackson's team.</p><p>Production of The Beatles: Get Back employed film restoration techniques developed for Jackson's They Shall Not Grow Old. Jackson spent close to four years editing the series. It was created with cooperation from Paul McCartney, Ringo Starr and the widows of John Lennon (Yoko Ono) and George Harrison (Olivia Harrison), as well as music supervisor Giles Martin (son of George Martin and a regular producer of Beatles projects since 2006). In a news release, McCartney said: \"I am really happy that Peter has delved into our archives to make a film that shows the truth about the Beatles recording together\", while Starr echoed: \"There was hours and hours of us just laughing and playing music, not at all like the Let It Be film that came out. There was a lot of joy and I think Peter will show that.\"</p><p>Disney was persuaded by the filmmakers to allow for the inclusion of profanity, with viewer discretion warnings at the start of each episode. According to Jackson: \"The Beatles are Scouse boys and they freely swear but not in an aggressive or sexual way. We got Disney to agree to have swearing, which I think is the first time for a Disney channel.\" Episodes also contain viewer discretion warnings for tobacco use. As a result, the theatrical release of The Beatles: Get Back – The Rooftop Concert received a PG-13 rating by the MPA for \"brief strong language, and smoking\".</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:white;text-align:center\"><th scope=\"col\" style=\"background:#000000;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#000000\">Title</th><th scope=\"col\" style=\"background:#000000\">Directed by <span style=\"background-color:white;padding:1px;display:inline-block;line-height:50%\"></span></th><th scope=\"col\" style=\"background:#000000\">Original release date <span style=\"background-color:white;padding:1px;display:inline-block;line-height:50%\"></span></th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part 1: Days 1–7\"</td><td style=\"text-align:center\"><span>Peter Jackson</span></td><td style=\"text-align:center\">25 November 2021</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #000000\">The Beatles begin rehearsing at <span>Twickenham Studios</span> for what is at first meant to be a television special about the recording of their next album leading up to a live show at a location to be determined. The band rehearse embryonic versions of songs that will appear on the <i>Let It Be</i> album, as well as some songs that were later recorded for solo releases by <span>John Lennon</span>, <span>Paul McCartney</span> and <span>George Harrison</span>. <span>Yoko Ono</span> is constantly present in the studio, on one occasion singing, and shown chatting with <span>Linda McCartney</span>. Harrison is shown with <span>Hare Krishna</span> friends. Music publisher <span>Dick James</span> appears and runs through the latest catalogue of songs he has acquired for <span>Northern Songs</span>. Director <span>Michael Lindsay-Hogg</span> tries to persuade the Beatles to end the project with an impressive live show. After seven days of tense rehearsals that reveal problems in the band members' motivation and collaborative process, Harrison abruptly leaves the group.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part 2: Days 8–16\"</td><td style=\"text-align:center\">Peter Jackson</td><td style=\"text-align:center\">26 November 2021</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #000000\">Rehearsals briefly resume amid uncertainty over the band's future. Actor <span>Peter Sellers</span> makes an awkward appearance. Following a productive meeting with Harrison, the Beatles agree to abandon the idea of a live show and relocate to their <span>Apple Corps</span> studio to formally record the new album. <span>Glyn Johns</span>, recording engineer and co-producer for the sessions, finds the studio's facilities substandard and contacts <span>George Martin</span> with an urgent request for replacement gear. <span>Billy Preston</span>, a musician the group met in Hamburg, joins in on the sessions on <span>electric piano</span>.</td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Part 3: Days 17–22\"</td><td style=\"text-align:center\">Peter Jackson</td><td style=\"text-align:center\">27 November 2021</td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #000000\">The Beatles continue recording as the deadline for completing the project, caused by <span>Ringo Starr</span>'s filming schedule for <i><span>The Magic Christian</span></i>, approaches. McCartney continues to hope that the band will perform live for an audience and Lennon meets American businessman <span>Allen Klein</span> for the first time. On the penultimate day, the Beatles perform an <span>unannounced concert</span> on the roof of the Apple Corps building, attracting crowds of passers-by as well as the attention of the <span>Metropolitan Police</span>. After the performance, they proceed to record the remaining tracks for the <i>Let It Be</i> album in the studio.</td></tr></tbody></table><br/><h3>Content</h3><p>The final cut covers 21 days in the studio with the Beatles as they rehearse for a forthcoming album, concert and film project, and climaxes with the full 42-minute rooftop concert. Jackson described the series as \"a documentary about a documentary\", as well as a \"tougher\" one than Let It Be, since it includes controversial events such as Harrison's brief resignation from the band, which the original film had not covered. With the exception of specific shots where no alternative exists, most of the material that had been featured in Let It Be was not reused in Get Back, and the series primarily used footage captured from alternative camera angles in the case of sequences shared between the two works. According to Jackson, this choice was made out of a desire to \"not step on Let It Be's toes so that it is still a film that has a reason to exist, and our will be a supplement to it\".</p><p>Ben Sisario of The New York Times emphasises opening scenes of the series from January 1969, with McCartney creating the song \"Get Back\" \"out of nothing\" while awaiting Lennon who was running late. In his review, Sisario further posits that: Lennon's only aim in the Get Back project was \"communication with an audience\", McCartney asked the band to \"show enthusiasm for the project or abandon it\", Harrison openly contemplated \"a divorce\" (of the band), while the whole band were uncomfortable about Ono's presence at the sessions. However, the last statement is opposed by Andy Welch of The Guardian in his review of the documentary, who remarks: \"Yoko didn’t break up the Beatles. Blaming it on her was always an absurd, lazy accusation\". In other candid scenes, Starr offers Ono a piece of gum, Linda McCartney and Ono whisper as the band plays \"Let It Be\", Harrison impresses the band with a Bob Dylan cover, McCartney covers \"Strawberry Fields Forever\" with Lennon's approval, and McCartney defends Ono while grieving for the band's end.</p><p>Another key scene involves an off-camera lunch between Lennon and McCartney. The filmmakers put a microphone in the plant on the table unbeknownst to anyone, where it picked up the conversation. During the lunch, Lennon tells McCartney that he has become the leader of the group, which McCartney denies (\"You're still the boss, I'm just the secondary boss\"). They also discuss their treatment of Harrison, reminisce about the past and discuss the future of the group.</p><br/><h3>Release</h3><h4>Streaming and home media</h4><p>The project was announced on 30 January 2019, the fiftieth anniversary of the Beatles' rooftop concert. On 11 March 2020, The Walt Disney Studios announced they had acquired the worldwide distribution rights to Jackson's documentary, now titled The Beatles: Get Back. It was initially set to be theatrically released by Walt Disney Pictures on 4 September 2020 in the United States and Canada, with a global release to follow. Jackson said the feature film would have been around two-and-a-half hours long. On 12 June 2020, it was pushed back to 27 August 2021 due to the COVID-19 pandemic.</p><p>On 17 June 2021, it was announced that The Beatles: Get Back would instead be released as a three-part documentary series on Disney+ on the Thanksgiving weekend of 25, 26 and 27 November, with each episode being over two hours in length. On 16 November, McCartney attended the UK premiere of The Beatles: Get Back. Over its first four days of release, the series was streamed for a total of 503 million minutes (equaling 1.07 million complete views), with people over the age of 55 making up 54% of the demographic.</p><p>Walt Disney Studios Home Entertainment distributed the series on Blu-ray and DVD on 12 July 2022. This was after a postponed release intended for 8 February 2022, reportedly due to a technical glitch with the discs that affected the sound and required reprinting.</p><p>During The Rooftop Concert live screening event on 30 January 2022, Jackson stated that he hopes to release an extended edition of the series that would include three to four additional hours of previously unseen performance footage and band conversations, as well as new bonus material and interviews. He said that fans would need to help put pressure on Disney and Apple Corps to release this edition.</p><h4>The Beatles: Get Back – The Rooftop Concert</h4><p>A feature of the rooftop concert from the documentary was released by Walt Disney Studios Motion Pictures in some United States IMAX theatres on 30 January 2022, with a global theatrical release from 11 to 13 February. The 30 January presentation was accompanied by a live-streamed Q&A with Jackson. In response to one question during the Q&A, Jackson said there were additional hours of restored but unreleased footage and interviews. As of 20 February 2022, the film has grossed $936,764 in the United States box office and $1.2 million internationally, for a worldwide total of $2.2 million.</p><p>On 30 January 2022, The Beatles: Get Back premiered in limited theatrical release in 67 theatres, grossing $391,252 at the box office. It was released again on 9 February, when it grossed approximately $50,468 in 80 theatres. It was released to an international audience during the 11–13 February box office weekend, and was shown in 181 theatres worldwide.</p><p>On 28 January 2022, the audio of the full rooftop performance, remixed in Dolby Atmos, was released to streaming services.</p><h4>Marketing</h4><p>On 21 December 2020, a five-minute preview montage from the reproduced film, presented by Jackson, was released on YouTube and Disney+. The video features the band members dancing, doing impersonations, laughing, Lennon reading a newspaper article about Harrison's encounter with a photographer, as well as Lennon and McCartney \"jokingly singing 'Two of Us' through gritted teeth\". A one-minute clip of the film was released on YouTube on 12 November, containing a scene with the Beatles working on the song \"I've Got a Feeling\".</p><p>The release was preceded by the publication of a book of the same name – the first official book credited to the band since The Beatles Anthology (2000) – featuring an introduction by Hanif Kureishi. The book was initially scheduled for 31 August 2021 to coincide with the initial August release of the documentary, but was ultimately released on 12 October, ahead of the documentary. The documentary was also preceded by the release of a remixed, deluxe edition box set of the Let It Be album on 15 October by Apple Records.</p><br/><h3>Reception</h3><h4>Critical reception</h4><p>Review aggregator Rotten Tomatoes reported an approval rating of 93% based on 119 reviews, with an average rating of 8.5/10. The website's critics consensus reads, \"It may be too much of a good thing for some viewers, but The Beatles: Get Back offers a thrillingly immersive look at the band's creative process.\" Metacritic gave the series a weighted average score of 85 out of 100 based on 28 critic reviews, indicating \"universal acclaim\".</p><p>Sheri Linden of The Hollywood Reporter called the documentary an \"immersive, in-the-moment chronicle of a generation-defining band in the act of creating, offering an up-close look at the quartet's alchemy\" and concluded that it \"offers ample evidence that necessity is in the eye of the beholder\". Rob Sheffield of Rolling Stone complimented the miniseries' intimacy, highlighting its poignant and \"quiet moments\" as \"the heart of the film\". Richard Roeper of the Chicago Sun-Times gave the miniseries a score of four out of four stars, deeming it \"one of the most entertaining, compelling and important chapters in filmed music history\" and praising the quality of the footage of the rooftop performance. In a five-star review for The Independent, Ed Cumming wrote that the acrimony besetting the Beatles had \"taken on a mythic quality\" since Lindsay-Hogg's 1970 film, but through Jackson's expanded coverage, \"Any future assessment of the band and its members will have to measure up against the people we see here.\"</p><p>Owen Gleiberman, writing for Variety, said that while the story \"meanders\" and gets \"bloated\" in Part Three, it is an \"addictive\" portrait of a \"transcendent\" band that goes above \"both the hype and fan anxiety\". The Guardian's Alexis Petridis called the series \"aimless\", with repetition that was a \"threat to the viewer's sanity\", and said that while it had \"fantastic moments\", they were too few and far between. Writing in The Times, Beatles biographer Philip Norman was highly critical of the editing of the footage and general tone of Jackson's work, commenting that several \"inconvenient facts\", including Lennon's heroin addiction and the \"baiting\" of Ono, were ignored.</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Award</th><th>Date of ceremony</th><th>Category</th><th>Nominee(s)</th><th>Result</th><th><abbr title=\"References\">Ref.</abbr></th></tr><tr><td><span>American Cinema Editors Awards</span></td><td><span>5 March 2022</span></td><td><span>Best Edited Documentary – (Non-Theatrical)</span></td><td><span>Jabez Olssen</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Cinema Audio Society Awards</span></td><td><span>6 March 2022</span></td><td><span>Outstanding Achievement in Sound Mixing for Television Non Fiction, Variety or Music – Series or Specials</span></td><td>Peter Sutton, Michael Hedges, Brent Burge, Alexis Feodoroff, Sam Okell, and Michael Donaldson <span style=\"font-size:85%;\">(for \"Part 3\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span class=\"mw-redirect\">Golden Reel Awards</span></td><td><span>13 March 2022</span></td><td><span>Outstanding Achievement in Sound Editing – Non-Theatrical Documentary</span></td><td>Brent Burge, Martin Kwok, Matt Stutter, Buster Flaws, Melanie Graham, Emile De La Rey, Steve Gallagher, Tane Upjohn-Beatson, Michael Donaldson, and Simon Riley <span style=\"font-size:85%;\">(for \"Part 3\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Producers Guild of America</span></td><td><span>19 March 2022</span></td><td><span>Outstanding Producer of Nonfiction Television</span></td><td><span>Paul McCartney</span>, <span>Ringo Starr</span>, <span>Yoko Ono Lennon</span>, <span>Olivia Harrison</span>, <span>Peter Jackson</span>, Clare Olssen, Jonathan Clyde, Jeff Jones, and Ken Kamins</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span>Television Critics Association</span></td><td><span>6 August 2022</span></td><td><span>Outstanding Achievement in News and Information</span></td><td rowspan=\"2\"><i>The Beatles: Get Back</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td><span class=\"mw-redirect\">Hollywood Critics Association TV Awards</span></td><td><span>14 August 2022</span></td><td>Best Streaming Docuseries or Non-Fiction Series</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\"></td></tr><tr><td rowspan=\"5\"><span>Primetime Emmy Awards</span></td><td rowspan=\"5\"><span>3 September 2022</span></td><td><span>Outstanding Documentary or Nonfiction Series</span></td><td>Paul McCartney, Ringo Starr, Yoko Ono Lennon, Olivia Harrison, Peter Jackson, Clare Olssen, and Jonathan Clyde</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td align=\"center\" rowspan=\"5\"></td></tr><tr><td><span>Outstanding Directing for a Documentary/Nonfiction Program</span></td><td>Peter Jackson <span style=\"font-size:85%;\">(for \"Part 3\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Picture Editing for a Nonfiction Program</span></td><td>Jabez Olssen <span style=\"font-size:85%;\">(for \"Part 3\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Sound Editing for a Nonfiction or Reality Program (Single or Multi-Camera)</span></td><td>Martin Kwok, Emile De La Rey, Matt Stutter, Michael Donaldson, Stephen Gallagher, Tane Upjohn-Beatson, and Simon Riley <span style=\"font-size:85%;\">(for \"Part 3\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Outstanding Sound Mixing For a Nonfiction or Reality Program (Single or Multi-Camera)</span></td><td>Michael Hedges, Brent Burge, Alexis Feodoroff, and Giles Martin <span style=\"font-size:85%;\">(for \"Part 3\")</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\"><span>Critics' Choice Documentary Awards</span></td><td rowspan=\"4\"><span>13 November 2022</span></td><td>Best Limited Documentary Series</td><td rowspan=\"3\"><i>The Beatles: Get Back</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"4\"><br></td></tr><tr><td>Best Archival Documentary</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Music Documentary</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Editing</td><td rowspan=\"2\">Jabez Olssen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Cinema Eye Honors</span></td><td><span>January 12, 2023</span></td><td>Outstanding Broadcast Editing</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr></tbody></table><br/><h3>Soundtrack</h3><p>This is a list of all the songs heard in The Beatles: Get Back. All songs by Lennon–McCartney, except where noted.</p><h4>Opening</h4><h4>Twickenham Studios sessions</h4><h4>Apple Studios sessions</h4><h4>Rooftop concert</h4><br/>"
  },
  "errorMessage": ""
}