{
  "imDbId": "tt1439629",
  "title": "Community",
  "fullTitle": "Community (TV Series 2009–2015)",
  "type": "TVSeries",
  "year": "2009",
  "items": [
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8560155",
      "warningSpoilers": false,
      "date": "22 September 2022",
      "rate": "9",
      "helpful": "55 out of 58 found this helpful.",
      "title": "Hilarious!",
      "content": "Community is one of the most underrated comedies of all-time. It's a comedy that takes place at Greendale Community College and follows the lives of its students, most adults looking to better their lives. I don't even k ow how to describe how much I love this incredible show! It's easily one of my all-time favorite comedies. All you have to do is read through the reviews to see how much everyone liked this show. You'll find it hard to find anyone who's actually watched the show who doesn't love it. It's one of the rare shows where the entire cast is hilarious and there's not a wink link among them. It stars Joel McHale, Gillian Jacobs, Alison Brie, Donald Glover, Danny Purdi, Chevy Chase & Ken Jeong. They all give outstanding performances here. I've probably seen the entire series 3 or 4 times through and still find it just as funny as I did the first time. This is a must watch!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8839769",
      "warningSpoilers": false,
      "date": "30 January 2023",
      "rate": "9",
      "helpful": "39 out of 41 found this helpful.",
      "title": "One of the most underrated comedies of all-time!",
      "content": "Community is absolutely one of my favorite sitcoms of all-time! I know people say this about a lot of shows but this is absolutely one of the most underrated comedies in the history of television. It's on most best comedies of all-time lists I've ever seen. Every character on the show is hilarious, there's not a weak link among them. There's literally not a bad character on the entire show. It's also one of the rare shows where every season is just as hilarious as the one's before it. Every episode of every season is worth watching. The in,y exception is the last season isn't as good after Donald Glover leaves the show. It also has an endless supply of cameos throughout the series that are all fantastic. If you're looking for a show that will actually are you laugh out loud then give this a try. You won't be disappointed!"
    },
    {
      "username": "Lukasmj",
      "userUrl": "https://www.imdb.com/user/ur158768880",
      "reviewLink": "https://www.imdb.com/review/rw8781518",
      "warningSpoilers": false,
      "date": "6 January 2023",
      "rate": "8",
      "helpful": "27 out of 28 found this helpful.",
      "title": "One of the best sitcoms.",
      "content": "Community is a single-camera comedy series produced by NBC. Overflowing with pop culture references, showrunner Dan Harmon's series is set in the fictional Greendale Community College. There, a group consisting of Jeff, Britta, Troy, Pierce, Abed and Shirley meet to learn together for the Spanish course. Of course, the pedagogical successes in this colorful mixture are limited.The series made me laugh and entertained me a lot.I would definitely rank it among the best sitcoms, but unfortunately for me personally the series declined tremendously after Donald Glover left the series.Still a very good sitcom."
    },
    {
      "username": "slzoras",
      "userUrl": "https://www.imdb.com/user/ur127586402",
      "reviewLink": "https://www.imdb.com/review/rw8511803",
      "warningSpoilers": false,
      "date": "3 September 2022",
      "rate": "8",
      "helpful": "36 out of 37 found this helpful.",
      "title": "The greatest comfort show",
      "content": "Community is one of the smartest and most endearing sitcoms ever created. Despite its ups and downs, its creative lacks, the behind the scenes drama, I still would recommend it to anyone who considers themselves a fan of movies or tv shows, or anyone who's just a bit trope-savvy and enjoys cleverness and absurd humor. The comforting nature of the show comes from its setting: a school, a community college of dubious prestige where \"lesser people\" find each other and find value in their own messy existence. They have adventures and discoveries in the setting of the school, they fight, they fall in love. It takes the very concept of a teen sitcom and adds an extremely important factor: the playfulness. The playfulness of living a boring day of school, a boring event, like a life-changing movie-like adventure. That's how being in school feels like, and it's weird that the only show that captures it is a show about adults: every mystery turns into a true-crime fiction, every paint-ball game into a western/star wars fantasy war, every discovery into something magical. The show is not just \"parodying\" these stories, the show is the characters basically reenacting, living their lives as these stories. There's a kind of childish joy in seeing a blanket fort turn into a crazy underground city, or an investigation into a dead yam turn into a law&order episode. Rather, there's a joy in watching the characters basically pretending that this is the case, themselves playing characters, creating a make-believe world out of a trivial day of school, thrilling and fun but also ultimately safe and comforting. You can feel Harmon's joy of the creative process through the characters, and I'm willing to bet a lot of the actors in the cast had a blast. The 4th season (the one everyone hates) is not as bad as people say, it's just a pointless and functional imitation of the previous seasons. Pierce was probably one of the most interesting characters to put in the main cast of a show like this, shame for all that's happened. The later seasons feel a bit tired, but you can't deny that there's a lot of great moments in seasons 5 and 6, as short-lived and unlucky they were. It's amazing on first watch and still holds up on the third."
    },
    {
      "username": "LeonardOsborneKael",
      "userUrl": "https://www.imdb.com/user/ur13583332",
      "reviewLink": "https://www.imdb.com/review/rw2149280",
      "warningSpoilers": false,
      "date": "29 October 2009",
      "rate": "10",
      "helpful": "303 out of 344 found this helpful.",
      "title": "Great ensemble work with fresh ideas about relationships",
      "content": "The promos for this series really turned me off. Another dreary, predictable story about the uncaring horny guy pursuing the lovely stand-offish female? Wow was I wrong! These characters are refreshingly complex and give us lots of surprises in an all too short half-hour. The concept of a bunch of mismatched community college students bumbling through life is rich with possibilities and, speaking as a former community college student, has the ring of truth all the way through. All the actors are wonderful -- especially Gillian Jacobs and Alison Brie. The cherry on top is the amazing Chevy Chase, so oft-criticized for being the self-indulgent ham, who delivers as nuanced and compelling ensemble-sensitive performance as you are ever going to see. My sense is that this show has got some serious legs!"
    },
    {
      "username": "safenoe",
      "userUrl": "https://www.imdb.com/user/ur34307814",
      "reviewLink": "https://www.imdb.com/review/rw6906133",
      "warningSpoilers": false,
      "date": "12 May 2021",
      "rate": "10",
      "helpful": "52 out of 60 found this helpful.",
      "title": "Peak TV",
      "content": "If there was ever the epitime of Peak TV, then Community is it. Community has the heart and I'm sure I'll never tire watching the first three seasons at least. Season 4 was a bit underrated, and season 5 was slightly overrated. Season six was more the reboot season. The series finale was incredibly moving, and makes you really yearn for a movie please."
    },
    {
      "username": "ajgreer-20023",
      "userUrl": "https://www.imdb.com/user/ur90829077",
      "reviewLink": "https://www.imdb.com/review/rw8661807",
      "warningSpoilers": true,
      "date": "7 November 2022",
      "rate": "10",
      "helpful": "25 out of 25 found this helpful.",
      "title": "The Most Incredible Show to Ever Exist",
      "content": "Community is what you get when you combine the talents of the co-creator of Rick and Morty and the directors of Avengers: Endgame. From beginning to end, you don't know what the show is going to throw at you. Whether it's a parody of older films or a myriad of paintball battle royales, this show has so much to offer. It's insane the different cameos and references throughout the series, with actors like Nathan Fillion and Seth Green making appearances. The main cast is stellar too, with Donald Glover being a big part for the first few seasons, and Keith David being a permanent mainstay in the final season. Overall, the show is absolutely spectacular, and is a joy to watch from beginning to end.#sixseasonsandamovie."
    },
    {
      "username": "choralone42",
      "userUrl": "https://www.imdb.com/user/ur16873056",
      "reviewLink": "https://www.imdb.com/review/rw6367024",
      "warningSpoilers": true,
      "date": "15 December 2020",
      "rate": "7",
      "helpful": "18 out of 18 found this helpful.",
      "title": "Seasons 1-3 are the best, seasons 4-6 are very uneven.",
      "content": "I absolutely loved season 1-3 of Community but the combination of main characters leaving the show & the strife with it's creator seriously hurt later seasons. While I know there are still fans out there hoping for a movie I personally would only like to see that if ALL of the original cast (except for Chang) are involved.I will give each season it's own rating and a few notes.Season 1 - 8. Starts a little slow but quickly finds it legs. Modern Warfare is a classic!Season 2 - 10. Easily the best season of the show. The 2 paintball episodes that cap the season were genius!Season 3 - 8. Very good but I had to deduct a point due to the excessive amounts of Chang, he wore out his welcome in this season. I loved Digital Estate Planning and Pillows and Blankets!Season 4 - 6. Without Dan Harmon the show feels quite \"off\" but at least all of the original cast is here. Heroic Origins is the highlight of the season! I feel the show could have stopped here with Jeff graduating as it's a natural ending. I wanted to punch Chang/Kevin just about every time he was on screen.Season 5 - 6. Harmon is back! Pierce is gone and Troy leaves halfway through. The study group now being the \"Save Greendale Committee\" and Jeff being a teacher doesn't entirely work for me. Without Troy around Abed seems lost for the rest of the series. Geothermal Escapism is the best episode of this season with App Developments and Condiments a close second.Season 6 - 4. Shirley is also gone. With 3 of the original \"Greendale 7\" gone the show really suffers. Yes new characters are added but almost everyone seems to just be going through the motions. Modern Espionage is easily the best episode but even it pales in comparison to the paintball episodes from seasons 1 and 2. Several episodes were tough to get through and weren't funny or very enjoyable. Thankfully Chang isn't as annoying as he was in seasons 4 & 5.I can see why the show had a small but extremely loyal fan base after the first 3 seasons. It's a real shame the last 3 seasons went down like they did as the show deserved better."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3010984",
      "warningSpoilers": false,
      "date": "6 May 2014",
      "rate": "9",
      "helpful": "30 out of 34 found this helpful.",
      "title": "Love the references, not just another network TV comedy",
      "content": "Jeff Winger (Joel McHale) is a lawyer with a degree from Columbia (the country) who is on the verge of being disbarred. He enrolls in Greendale Community College, and tries to get close to Britta Perry (Gillian Jacobs) by tutoring her on Spanish. The film obsessed weirdo Abed Nadir (Danny Pudi) mistakenly invites divorcée Shirley Bennett (Yvette Nicole Brown), former drugged up Annie Edison (Alison Brie), slightly dim former high school football star Troy Barnes (Donald Glover), and cranky old rich guy Pierce Hawthorne (Chevy Chase) to the study session. They form a study group and a new family of sorts in this ridiculous lower education center.Show runner Dan Harmon has created one of the most unique network TV comedies around. It has the group friendship that is the bread and butter of network TV. It forms the backbone of the show. The comedy is very sarcastic and throws a lot of references around. Dan Harmon and his writers obviously love TV and movies. I love the group, but I'm in love with the comedic material. You don't have to be Abed to like this show, but it sure would help. The low viewership finally catches up after 5 seasons."
    },
    {
      "username": "ahmedgorshy",
      "userUrl": "https://www.imdb.com/user/ur106582401",
      "reviewLink": "https://www.imdb.com/review/rw6198210",
      "warningSpoilers": false,
      "date": "23 October 2020",
      "rate": "10",
      "helpful": "65 out of 76 found this helpful.",
      "title": "Community review",
      "content": "Community review Before I start writing a review, I have to tell you that society is one of the series. Whenever you watch episodes of them in a row, you know the reason for their greatness, so do not judge the first two episodes of the series, which I think are somewhat below the standard for me. If you're a fan of Arrested devolpment like me, the community will undoubtedly like you. It consists of six seasons. I will evaluate each season separately. The first season was undoubtedly exceptional, especially when you re-watch you will find it more enjoyable from the first time you watched it. The first season takes time to get to know the characters and hang on to them, and as soon as you get attached to them, you will enter directly into the atmosphere, so how can you not like characters like the narcissist, Jeff Winger, or the Arab obsessed with movies and series (just like me) and troy whoever does not like Troy or the racist old man Pierce is my favorite character in the series and I am the princess, as Jeff says Britta and Shirley Season 1 rating is 8.7/10 Season 2 rating is 9.6/10 Season 3 rating is 9.8/10 Season 4 rating is just A fart 😂 Season 5 rating is 8.0 Season 6 rating is 8.5 or 9.0 because the Perfect ending #six_ seasons_ and _movie"
    },
    {
      "username": "duncancrowley",
      "userUrl": "https://www.imdb.com/user/ur101604960",
      "reviewLink": "https://www.imdb.com/review/rw6095986",
      "warningSpoilers": true,
      "date": "15 September 2020",
      "rate": "10",
      "helpful": "98 out of 107 found this helpful.",
      "title": "Made me cry",
      "content": "The ending made me cry, I eventually got so attached to the characters I didn't want to let go."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw6744080",
      "warningSpoilers": false,
      "date": "26 March 2021",
      "rate": "8",
      "helpful": "20 out of 22 found this helpful.",
      "title": "Finding a new home",
      "content": "I had heard so much about this show and never really got around watching it. What I had heard were mostly good things. And I would agree - but also add that it is especially true of the first 4 seasons of the show. If the show didn't jump the shark in season 5, it most definitely did in season 6 (which felt also like it was the season it changed channels? I might be wrong with the last one, but season 6 especially feels completely detached from the rest of the show, for so many reasons). <brThe show also almost feels like it does not appreciate what the Russo brothers did for it. Or maybe it is tough love that in season 6 the MCU is being made fun of. Maybe the fart joke also has a different meaning than the break after season 4 (which is how I understood the \"inside joke\"). <brThe actors are all more than fine and especially Danny Pudi. His character is so meta and fourth wall breaking that you will either love or hate him. Maybe be annoyed by him. But I know I loved him ... and he and the show almost made me rethink my overall rating - thought about going back to a 9 - especially because I feel like the first 4 seasons deserve a 10/10 ... but it could not sway me in the end. <brThe show got new life into it by being put on Netflix ... especially during the pandemic this was the show to be (re)discovered. I fell in love with the characters and almost fell out of love with them again ... I cannot stress enough that you should really take the last season with a grain of salt ... or whole box of it! Apart from the declining quality, it seemed to be sponsored heavily .. all those ads or product placements ... really not something I admired. But season 6 had highlights too - Paintball episode (always great) and the finale - so meta, it probably will make you dizzy trying to decipher it all ..."
    },
    {
      "username": "robin-55284",
      "userUrl": "https://www.imdb.com/user/ur76487165",
      "reviewLink": "https://www.imdb.com/review/rw8665360",
      "warningSpoilers": false,
      "date": "9 November 2022",
      "rate": "10",
      "helpful": "22 out of 22 found this helpful.",
      "title": "Community: a great group of knuckleheads",
      "content": "Love this show. Loved it the first time around and watching now in 2022. It holds up well continuing to show the transition to political correctness and the building of acceptance for themselves and others. Yes there's a sentimentality, a laugh out loud blast and most importantly continuity. The shows have twists and turns and even though we know where it's leading, we enjoy the ride and the surprises along the way. I think it is a perfect ensemble. Each personality is discreet yet all working towards the same goal: school/social acceptance. I love it. Watch. Guest stars are fun and cast delivers."
    },
    {
      "username": "Red_Identity",
      "userUrl": "https://www.imdb.com/user/ur15562504",
      "reviewLink": "https://www.imdb.com/review/rw2451605",
      "warningSpoilers": false,
      "date": "30 June 2011",
      "rate": "",
      "helpful": "26 out of 32 found this helpful.",
      "title": "Ambitious, Energetic, and completely Hilarious!",
      "content": "Community is that great comedy that you cannot wait to see. It's not only that it is funny (and when it is funny, it is hilarious!) it's just that it's simply a joy to watch. The ensemble cast is great. In fact, there is probably not a better comedic ensemble cast out there right now. No one outshines anybody because they are all great, and all of the characters are likable. I never knew Joel McHale had it in himself to play this type of character this well. I thought he was more of a sketch comedian, based on his show The Soup. Jillian Jacobs is great as the most well-rounded character here, and she becomes more lovable as the show goes on. Chevy Chase is just freakin funny, no question about it. Alison Brie is the 'cute' one, and will have your heart. What I really love about this show and what makes it stand apart from other great comedies in the air right now like 30 Rock, Modern Family, and The Middle is it's energy. It gives off a cinematic tone and feel, of the best type of comedies out there. It has energy that never stops, and the meta-humor and pop culture references elevate it. Ultimately, this is as smart and ambitious as 30 Rock and as funny as Modern Family. However, it does stand higher than those shows because of that combination. You won't be disappointed."
    },
    {
      "username": "gcasaus",
      "userUrl": "https://www.imdb.com/user/ur129648753",
      "reviewLink": "https://www.imdb.com/review/rw8760749",
      "warningSpoilers": false,
      "date": "27 December 2022",
      "rate": "9",
      "helpful": "22 out of 22 found this helpful.",
      "title": "OMG",
      "content": "Easily one of my favorites of all time (I think this may even rival Seinfeld in my book). My favorite comedies before were Seinfeld, Friends, and Everybody Loves Raymond. But this gem of a show needs to be up there. I am going to do some research on the writers to see if they've written any other shows. If they have, then sign me up to watch. I can't say enough about this show .... It truly is top notch. I have not read any reviews of this show. There are always people with no lives and who like to antagonize for the sake of antagonizing, but I think they might be hard pressed to come with with anything negative about this."
    },
    {
      "username": "TedStixonAKAMaximumMadness",
      "userUrl": "https://www.imdb.com/user/ur4669024",
      "reviewLink": "https://www.imdb.com/review/rw2369089",
      "warningSpoilers": false,
      "date": "13 January 2011",
      "rate": "10",
      "helpful": "43 out of 56 found this helpful.",
      "title": "\"Community\" is an Incredible series. Simultaneously outlandish and realistic, it's fun, touching and hilarious. One of the best TV Comedies of the past 10 years...",
      "content": "Premiering in 2009, \"Community\", created by Dan Harmon, stars a fantastic cast of actors, portraying characters from very different stations in life, as they all come together in the hopes of receiving a higher education (well... \"medium\" education is more accurate) at community college. Though each character is very different, and many don't seem like the types to hang around with one another, the seven leads eventually come together, first starting as a study group, before blossoming into a sort-of family.Joel McHale (E!'s \"The Soup\") stars as Jeff Winger, a lawyer who has returned to college on a deal to keep himself from getting disbarred- if he can earn a more legitimate degree (his previous degree was not from Columbia University, but rather, an illegitimate degree from Columbia the country), he can return to his former law firm. He's cocky, smarmy, and exploitive at times. He starts the series as a self-centered jerk, for lack of a better description, but over time, has calmed down and opened up a little more.Gillian Jacobs portrays Britta Perry, a fellow classmate whom Jeff has on-again, off-again feelings for. Britta is a strong-minded and strong-willed woman, with concrete (if not sometimes asinine) beliefs, thought she often hides the fact that she can be sensitive and vulnerable. She's the voice of reason, arguably, but she's also a darned great character, and doesn't fall back on clichés at all.Danny Pudi (in an outstanding performance) plays Abed Nadir, a pop-culture aficionado, who also seems to have some social and minor mental difficulties (Jeff says he has Asperger's Syndrome at one point, and as someone who has the condition, I'd say he was probably spot on), but is also fairly intelligent and can \"read people\" very good, even to the point where he can predict people's behavior slightly. He wants to be a filmmaker, and spends a lot of his time referencing movies and TV shows, and directing student films.Yvette Nicole Brown plays Shirley Bennet, an older woman who has returned to community college to start her life anew after her husband left her. She's a very kind woman, and a devoted Christian (which occasionally causes problems with the group's diversity), though she has gossiping problems as well.Alison Brie plays Annie Edison, a strong-willed but insecure young woman who just graduated High School. She was very unpopular in the past, and sees community college as a second chance at making friends (and getting close to Troy, her crush). She was formerly addicted to Adderall, but has turned her life around following rehab. She's the bookworm of the group, and tries a lot harder than everyone else, but hides many insecurities common for people her age.Donald Glover plays Troy Barnes, a former football star who had to stop playing following an injury. He's a bit rambunctious, and has a simple sense of humor. He becomes best friends with Abed, and they spend much time together. Short clips featuring the two of them close every show.And finally, Chevy Chase plays Pierce Hawthorne, a moist-towelette heir... member of a Buddhist Cult based around obscure concepts and \"levels\" (Guess which trendy Hollywood \"religion\" that's parodying!)... Very racist, but never with poor intentions... Seeing himself as more talented and valuable than he is much of the time... And physically awkward, setting up for a lot of slapstick gags. This character is perfect for Chevy. Need I say more?Every actor on the show is exquisite (with Pudi's performance being my personal favorite- no disrespect to the others), and each actor really transforms into the character. They all gel perfectly. They all work perfectly. This is one of the best comedy casts I've seen in a long time. The show also features actors such as Jim Rash, John Oliver and of course Ken Jeong in recurring roles as staff members, and each one gives a great performance as well.The show is quite smart, and well written. Characters are fleshed out and developed in a naturalistic way, and the situations often build off of that. Also, it's interesting in that the college (the infamously bizarre Greendale Acadamy) itself seems to become a character in the show. \"Community\" has just the right combination of realism and obscure outlandishness. As insane as the show can get (and it gets pretty insane), it never \"jumps the shark.\" Everything still seems grounded and real in it's own cartoonish way.It honestly doesn't surprise me that the Russo brothers produce this show. When I first started watching it, I got a small hint of \"Arrested Development\" (the best TV comedy since \"I Love Lucy\", as far as I'm concerned), many episodes of which were directed by them, and when I found out about their involvement here, it made sense.Similar to \"Arrested\", this is a fantastic show. It's smart and put together, and is a prime example of modern TV comedy done right. It's one of the best TV comedies of the past 10 years, and my favorite show on TV now. A perfect 10 out of 10 from me."
    },
    {
      "username": "staceyhicken",
      "userUrl": "https://www.imdb.com/user/ur16320944",
      "reviewLink": "https://www.imdb.com/review/rw2280155",
      "warningSpoilers": false,
      "date": "16 July 2010",
      "rate": "10",
      "helpful": "186 out of 212 found this helpful.",
      "title": "Non stop laughter",
      "content": "This show is just awesome. Me and my chap are often having to pause it or rewind it just because of the amount and the level of humour! All the characters are great. Sexy Jeff pulls the best faces, Pierce is just brilliant (he is very nearly my fave), Annie and Shirley bounce of each other and have some great moments, Britta is cute, funny and geeky and Abed and Troy take over the show when they have scenes together. Even watching the pilot episode i was laughing my bum off!!! Spanish professor Chang is also great. My only criticism is that Troy needs a story line or a few more scenes as he is so so funny but the end scenes with Abed and Troy more than make up for that. They are genius! The whole cast is just great and after watching the whole first series in one weekend i cannot wait for the next one. One of the most clever, entertaining and FUNNY shows i have ever seen. Along with the other fans. I beg you PLEASE do not cancel it! Here in the UK i am sure we would pick up this series for at least 5 seasons, its just THAT good! :-)"
    },
    {
      "username": "benps",
      "userUrl": "https://www.imdb.com/user/ur98017655",
      "reviewLink": "https://www.imdb.com/review/rw5964146",
      "warningSpoilers": false,
      "date": "3 August 2020",
      "rate": "10",
      "helpful": "31 out of 34 found this helpful.",
      "title": "SIX SEASONS AND A MOVIE!!",
      "content": "Community is easily one of my favourite shows, even if it did go through a rough period. The writing in this show was amazing. It's sharp, witty, and smart, yet it never felt overly-sophisticated. The characters were all extremely likeable too, and the entire cast managed to bring something distinct and quirky to their role. I especially loved Abed, as I certainly related to him the most. Every episode always felt creative visually as well. In terms of direction and cinematography, Community was always very playful and never felt stale. It was definitely high above many sitcoms and shows in general in terms of visual presentation. Season 1-3 are amazing and flawless in my opinion, but with that being said, there was season 4 (The 'Gas leak year') and admittedly I don't think the show ever recovered after that, despite seasons 5 & 6 being great, it still never felt the same. Seasons 1-3 were so good though that I can actually overlook it. Those seasons alone make me forget about season 4 entirely. Very few shows offer as much comfort and make me as happy as Community does."
    },
    {
      "username": "ReganRebecca",
      "userUrl": "https://www.imdb.com/user/ur2257003",
      "reviewLink": "https://www.imdb.com/review/rw3614929",
      "warningSpoilers": false,
      "date": "7 January 2017",
      "rate": "8",
      "helpful": "17 out of 20 found this helpful.",
      "title": "Uneven but awesome series",
      "content": "There are six seasons of Community, and I think the first two are essentially perfect. Featuring a rag-tag team of 7 individuals who have enrolled in community college after their lives didn't go as planned, this is an excellent, charming comedy made by people who clearly love TV and aren't shy about playing with tropes or even flat out mentioning them. Unfortunately, like with all TV shows, there were behind the scenes push-pull between the studio and the creatives. And not everything can stay perfectly flawless forever. In later seasons behind the scenes drama shows up on screen and characters rotate out to be replaced by new ones. That said, even as the creative juices dried up a little and the show kept revisiting past glories by making sequels to their most successful episodes, the show still remained incredibly watchable. A great comedy show with lots of laughs that always cheers me up."
    },
    {
      "username": "Pickaport",
      "userUrl": "https://www.imdb.com/user/ur133776421",
      "reviewLink": "https://www.imdb.com/review/rw8722184",
      "warningSpoilers": false,
      "date": "7 December 2022",
      "rate": "10",
      "helpful": "21 out of 21 found this helpful.",
      "title": "Buddy show",
      "content": "I agree with some of the comments about the show going down hill after the first few seasons. One of their goals was to have \"SIX SEASONS AND A MOVIE!\" Well they squeezed out the six seasons. I found out that there was a lot of drama behind the scenes with Chevy Chase and Dan Harmon.(Dan Harmon found out that he has Asperger's syndrome during the show)But the show for me was very funny and I enjoyed the companionship that they developed during the episodes. Troy and Abed are an amazing combo and any person with a nerdy imagination will love them as well. It's a real buddy show and something I really enjoy coming back to and watch."
    },
    {
      "username": "nthernquist",
      "userUrl": "https://www.imdb.com/user/ur152119663",
      "reviewLink": "https://www.imdb.com/review/rw8466316",
      "warningSpoilers": false,
      "date": "19 August 2022",
      "rate": "10",
      "helpful": "27 out of 28 found this helpful.",
      "title": "This show is streets ahead",
      "content": "Community is a special kind of TV show. It is quirky in the best kind of way. It is the most unconventional sitcom that I have ever seen. The cast all give hilarious performances. The finale made me cry. Not because of how it ended, but because I realized that that was it, and that there was nothing new from these characters for me."
    },
    {
      "username": "scottmcray",
      "userUrl": "https://www.imdb.com/user/ur118658136",
      "reviewLink": "https://www.imdb.com/review/rw5753580",
      "warningSpoilers": false,
      "date": "19 May 2020",
      "rate": "10",
      "helpful": "317 out of 335 found this helpful.",
      "title": "Cleverest sitcom I've ever seen",
      "content": "I envy everyone who has a chance to watch it for the first time."
    },
    {
      "username": "dennislucy",
      "userUrl": "https://www.imdb.com/user/ur104662823",
      "reviewLink": "https://www.imdb.com/review/rw8791454",
      "warningSpoilers": false,
      "date": "10 January 2023",
      "rate": "9",
      "helpful": "23 out of 23 found this helpful.",
      "title": "Hilarious easy watch",
      "content": "My boyfriend came across a yt short of this and said we need to try it. We binged watched the whole of series 1 in just 2 days.We have started season 2 and can't wait to see where it leads.Before this, brooklyn 99 or archer have been my comedy go-to for easy watching and still are because I don't live with my boyfriend and we decided we will only watch it together. This show is addictive though and we get very easily sucked into 'just 1 more episode' multiple times (only 20 minutes long) The characters are hilarious and all have their flaws, but as a team they are perfect for each other. Every episode so far is fresh and ridiculous but also breaks down and strengthens the relationships between the characters. The relationship between Abed and Troy is the cutest, and they're always doing some nerdy/weird stuff at the end of each show. I could actually watch a drink off of just those 2.The rest of the characters are also great, the whole Dad & mum of the group roles, the very unacceptable behaviour from each character being forgiven by the group because they adopt each other as a family with life lessons being learned in hilariously messed up ways. It's a friendship group where they compliment each other and very much need each other. It's just a crazy, light hearted show that I am eager to watch more of."
    },
    {
      "username": "elgsdyr",
      "userUrl": "https://www.imdb.com/user/ur37334175",
      "reviewLink": "https://www.imdb.com/review/rw6028182",
      "warningSpoilers": false,
      "date": "26 August 2020",
      "rate": "9",
      "helpful": "8 out of 8 found this helpful.",
      "title": "So much brilliance",
      "content": "Community is really a mixed bag. The best parts of the show is up there with the best of the best, while other parts (or whole seasons) felt like a different show written by other (less talented) writers. Which is exactly what happened...The beginning of the first season felt quite generic to me and it actually took me three attempts before I got engaged properly with viewing. About 2/3 into the season it seemed slowly find it's proper feet to stand on and I started getting hooked. The last 1/3 as well the whole season 2 and 3 is an impressive display of some of the most brilliant, intelligent, and creative humour I have ever seen on a show like this. It doesn't get better than this. Unfortunately, they then sacked Dan Harmon and season 4 ended up barely watchable for me. Only the characters and the promise of Harmon's return in s5 kept me going. S5 was much better and had occasional glimpses of the brilliance seen in s2 & s3 but on the whole didn't reach the same heights. Final season took another step downwards, sadly. It wasn't bad but too many of the main characters were gone and the premise of the show had changed too much from what worked so amazingly well in the early seasons.My seasonal ratings: Season 1: 8 (starts at 6, ends at 10) Season 2: 10 Season 3: 10 Season 4: 5 Season 5: 7 Season 6: 6"
    },
    {
      "username": "zombiemockingbird",
      "userUrl": "https://www.imdb.com/user/ur101559732",
      "reviewLink": "https://www.imdb.com/review/rw5954490",
      "warningSpoilers": false,
      "date": "31 July 2020",
      "rate": "5",
      "helpful": "29 out of 38 found this helpful.",
      "title": "Stop watching after season 4",
      "content": "The first season was really fun and entertaining. Season 2 and 3 weren't bad, season 4 started going downhill and season 5 bottomed out. Season 6 is unwatchable, They overdid the dark timeline story line which was stupid. They overdid every story Chang was in.The Troy and Britta romance was completely stupid and unbelievable. All of the characters personalities kept intensifying till they all just became annoying. It quit being funny or entertaining in season 5 and I started hating Annie and Britta. Paget Brewster in season 6 was a fish out of water. I think it could have continued to be good if the writers hadn't just overdone EVERYTHING."
    }
  ],
  "errorMessage": ""
}