{
  "imDbId": "tt0475784",
  "title": "Westworld",
  "fullTitle": "Westworld (TV Series 2016–2022)",
  "type": "TVSeries",
  "year": "2016",
  "items": [
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw9086280",
      "warningSpoilers": false,
      "date": "29 May 2023",
      "rate": "8",
      "helpful": "28 out of 28 found this helpful.",
      "title": "Great Sci-fi Series (especially season 1)",
      "content": "The first season of Westworld was absolutely amazing, I've never seen anything quite like it. That first season is easily among the best sci-fi shows ever created! There are a lot of people who don't like Seasons 2-4 and that's because they're comparing them to Season 1...don't! If you compare them to Season 1 then of course it's going to fall short because of how incredible that season was but if you just take them for what they are you'll find that that's a pretty good show that's definitely worth watching. I thought Season 2 was just ok but actually really liked Seasons 3 and 4! I really don't get all the hate for those seasons (unless you're comparing them to the first season). I can't believe they cancelled this before the final season. I know they're shopping around to other networks so I hope it gets picked up for a final season."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw9088935",
      "warningSpoilers": false,
      "date": "30 May 2023",
      "rate": "9",
      "helpful": "26 out of 26 found this helpful.",
      "title": "Entertaining",
      "content": "Westworld is one of the best sci-fi series I've ever seen. Like most people here have already pointed out...Season 1 was just incredible! Season 1 was so good that I binged the entire season in a little over a day. I just couldn't stop watching it. I personally like Seasons 2, 3 and 4 more than most, there just not as good as Season 1 so people complain about it. This is a great sci-fi series that is intelligent and thought provoking with plenty of twists that will keep you entertained throughout every season. If you're a sci-fi fan and you haven't seen this yet then stop what you're doing and go watch it immediately!"
    },
    {
      "username": "HafizhMaulana21",
      "userUrl": "https://www.imdb.com/user/ur158897541",
      "reviewLink": "https://www.imdb.com/review/rw8817965",
      "warningSpoilers": false,
      "date": "22 January 2023",
      "rate": "8",
      "helpful": "20 out of 21 found this helpful.",
      "title": "A great serial with mind blowing plot",
      "content": "A western theme park where visitors are free to do anything. The existence of a mysterious man who tries to find out the origin of the amusement park actually makes the robots aware of their identity.Season 1: Westworld is an interesting and exciting scifi genre show. It has an interesting story premise with a series of dense conflicts and full of mysteries. Westworld is an awesome series, amazing even this first season was able to introduce the world of Westworld and its characters well. This season has a slow pace and is full of plot twists. Each of his scenes gives such a good slice of mystery. This season was able to build a dense and really neat conflict. We are shown to know more about the secrets and behind of the theme park. The season also features several conflicts that go hand in hand and become an overwhelming anti-climactic whole. The dialogue is so deep, meaningful that it even becomes a clue to the anti-climax of this season. It's just that there's one scene that's confusing by Bernard Lowe's explanation of the core of Dolores' thinking."
    },
    {
      "username": "vikanov",
      "userUrl": "https://www.imdb.com/user/ur23311516",
      "reviewLink": "https://www.imdb.com/review/rw9041055",
      "warningSpoilers": false,
      "date": "8 May 2023",
      "rate": "9",
      "helpful": "24 out of 24 found this helpful.",
      "title": "Question the Nature of Reality, Consciousness, and Humanity",
      "content": "Westworld is a mind-exploding, thought-provoking, and powerful series that challenges its viewers to question the nature of reality, consciousness, and humanity. Created by Jonathan Nolan and Lisa Joy, and based on the 1973 film of the same name, the series is set in a futuristic amusement park populated by highly advanced robots known as hosts.What sets Westworld apart is its intricate and complex storytelling, which seamlessly weaves together multiple timelines, character arcs, and philosophical themes. The series explores the concept of artificial intelligence and the ethics of creating sentient beings for entertainment, as well as the intersection of technology and morality.The performances in the series are exceptional, with standout performances from Evan Rachel Wood as Dolores, Thandie Newton as Maeve, Jeffrey Wright as Bernard, and Ed Harris as the enigmatic Man in Black. The writing is also exceptional, with each episode offering new twists and turns that keep viewers on the edge of their seats.The series also features stunning production design, with breathtaking vistas and intricate sets that bring the world of Westworld to life. The visual effects are also top-notch, seamlessly blending the real and the artificial to create a seamless and immersive viewing experience.Overall, Westworld is a mind-bending and thought-provoking series that challenges its viewers to question their assumptions about reality, consciousness, and humanity. It is a powerful exploration of the potential dangers and ethical considerations of advanced technology, and a must-watch for anyone interested in science fiction, philosophy, and the future of humanity."
    },
    {
      "username": "hnt_dnl",
      "userUrl": "https://www.imdb.com/user/ur13630333",
      "reviewLink": "https://www.imdb.com/review/rw5716794",
      "warningSpoilers": true,
      "date": "7 May 2020",
      "rate": "3",
      "helpful": "493 out of 639 found this helpful.",
      "title": "From first to worst",
      "content": "WESTWORLD is an anomaly of a TV series. Season 1 is one of the best seasons ever. Ranking my Top 10 seasons, Season 1 of Westworld makes the cut. The first season featured brilliant acting from the likes of Sir Anthony Hopkins (as park founder Dr. Robert Ford), Evan Rachel Wood (as original park host Dolores Abernathy), Jeffrey Wright (as park behavorial expert Bernard Lowe), Sidse Babett Knudsen (as company exec Theresa), James Marsden (as host Teddy), Shannon Woodard (as park programmer Elsie) Jimmy Simpson (as park guest William), Angela Sarafyan (as host Clementine), Thandie Newton (as host Maeve), and Ed Harris (as the mysterious park guest The Man in Black). There were also entertaining minor characters like Lawrence, Armistice, Hector, and Logan.Of course, it wasn't without flaws. There were a couple of poorly realized characters like Lee Sizemore and Charlotte Hale (more on her later), and in retrospect, the Maeve character was always the worst thing about this show, which started with that dumb subplot of the two butchers Felix and Sylvester (also really bad characters in retrospect) who gave her god powers. But a few mere blemishes on an otherwise spotless season. But the real problem was the writers didn't see one. In particular, Maeve was so popular after the first season that starting in Season 2, the writers devoted a huge chunk of screen time to a very wasteful and filler side story of Maeve dragging her lackeys along with her to the dull Shogunworld, which at the time, was easily the worst episode of the show (Season 3 changed this, more on this later).THEN Season 2 happened! What started out as an engrossing, well-written, acted, and plotted ensemble multi-genre (sci-fi, Western, action) tale with deep philosophical themes turned into some weird feminist fantasy star vehicle for Dolores and Maeve. Dolores went from arguably the best character of the show to arguably it's worst because Wood forgot how to act! The sweet, inquisitive, philosophical Dolores became a 1-dimensional terminator. Maeve got more and more stupid powers, filler side quests and obnoxious \"dahling\" dialogue. Newton's \"acting\" consists of 2 or 3 facial expressions, with her go to expression being smugness. This character is a slow-acting infection that is a huge reason it went stale. I promise if you took out Maeve's parts of the show the first 2 seasons, not only would Season 1 have been perfect, but Season 2 would have been much better than it turned out.And what a terrible season that Season 2 turned out to be! Upon realizing that fans figured out all the twists in Season 1, the creators and showrunners Jonathan Nolan and Lisa Joy opted to make Season 2 even more confusing to the point they forgot to write a good story within all the confusion. Instead, it was mostly a bunch of unnecessary flashbacks, characters talking in meaningless riddles, and a dubious new aspect of the series...action scenes! Trained security and mercenaries were incredibly inept, fighting without proper gear and cover, missing wide open targets, getting themselves killed in the most dumb ways. Personally, I think that Riddle of the Sphinx is the only truly great episode of the second season and belongs in the ranks of Season 1. The rest can go fly a kite as far as I'm concerned, including Kiksuya, which most fans actually believe to be the best of the show, which is fine, but I just didn't care for that episode.NOW to Season 3. For me, this was the make or break season. Would the show return even close to it's Season 1 form or would it continue the trend of mediocrity established by Season 2? It most definitely went the way of the latter! The first mistake was the addition of Aaron Paul to the cast. I don't care about his Breaking Bad pedigree (a show I never watched, yeah I know blasphemy). This isn't Breaking Bad. Sometimes, an actor just doesn't translate well to another show and Paul most definitely does not here. His character Caleb Nichols has got to the worst, most uninteresting character this show has ever had! The writers ingratiated him in the Season 3 premiere with a mountain of cliche, boring backstory to make us feel for the guy, but it all rung hollow, especially as the season progressed. Caleb was just as dull in the end as he was at the start. In between, he just walked around in an eternal state of confusion following Dolores around like a pet.While Season 3 started out somewhat promising in the first half, that terrible Genre episode was the start of something bad! Finally, an episode that was actually worse and more filler than Shogunworld. Featuring the dull Caleb, Genre consisted of a slow car chase, pretentious camera filtering, loud music, terrible acting, and a weak ending. It can't get worse than that, right? Wrong, because the last 2 episodes of Season 3 were somehow worse than that! And guess who the focus of those last 2 episodes were? Yes, our new main character Caleb. The writing just went off the rails down the stretch. Season 3 \"featured\" mindless, poorly written action scenes, unnecessarily vague dialogue, pretentious monologues and flashbacks, and some really BAD acting. Surprisingly, I actually thought the best character in Season 3 was Charlotte Hale (essayed by a much improved Tessa Thompson), who was previously terrible the first 2 seasons. Just when the show goes bad, her performance gets good. Too bad no one else lived up to her character in the third season.In addition to Paul, there was a ton of awful acting in Season 3, mostly from minor characters and a few major ones as well. Whether it be a random Delos board member, a security meathead, an assassin goon, etc., it's like the directors this season didn't have any kind of wherewithal to tell these actors how to deliver lines that don't sound like they're in a high school play. The original main characters didn't fare much better. Dolores continued to be annoying and Bernard, Maeve, William, and Stubbs were just there and completely irrelevant to the plot. Serac was a decent character, but he's no Ford, the very mention of whose name reminds of how great this show used to be. This once-masterpiece has devolved into a forgettable Syfy-like series. Speaking of, I can think of a few things I've seen on Syfy the last few years that are probably more re-watchable than Westworld is now! After Season 1 of this series, I thought it put the classic 1973 movie to shame. Now, 3 seasons into this show, I'd recommend to anyone to watch the '73 film (which doesn't take itself too seriously and is just the right mixture of sci-fi, humor, action, and heart) over this increasingly pretentious and poorly done exercise in TV futility."
    },
    {
      "username": "cgvsluis",
      "userUrl": "https://www.imdb.com/user/ur60227834",
      "reviewLink": "https://www.imdb.com/review/rw8282113",
      "warningSpoilers": false,
      "date": "28 June 2022",
      "rate": "7",
      "helpful": "62 out of 76 found this helpful.",
      "title": "Phenomenal player piano music and Anthony Hopkins, but maybe it should be season one and done.",
      "content": "This series is so hard to rate as I both love and dislike it...I waited to see episode one of season four, mainly because my husband who loves the series is convinced that they are going to turn the ship around and I will start loving the show again. *sigh*I am going to start by being honest, I love Yul Brynner. No one plays an enigmatic character better than he did...which is why he made the original 1973 film Westworld for me. I am not a science fiction fan (I'm an actual scientist, I know it's rare), but it was easy to see and understand why the 1973 film had such a cult following. It also made it easy to recommend when I met individuals who liked science fiction but had never seen it. A big part of the film is the mystery or the unknown. You have lots of unanswered questions and your mind is left open to think about the what if's. I would go a step further to say that it sparks the imagination and creativity, kind of like a good book.Now focusing back on this HBO series...the production is amazingly good. It seems that no money was spared to bring to life this beautiful production. I love the use of the player piano to do current day pop songs a wonderful touch that just showed that in season one they got it...got the charm, got the allure. Anthony Hopkins is fantastic as Dr. Robert Ford and to this day remains my favorite character in the series.Season one gives the viewers something more than the film does, it gives us a better look behind the curtain into the creation of the parks and the writers...this was interesting. I would say season one is great television and worth watching which is high praise from me, because as mentioned I don't care for science fiction.Season Two was not as memorable, but it explores more the rich entitled nature of those who own the park and are rich enough to use it to do bad things. (I think this was done to build sympathy for the robots?)Season three was a completely forgettable waste of time that for me was when the series really \"jumped the shark\" so to speak. Very little time was spent in the park...lots of killing, rioting in streets, an algorithm making decisions for the humans....sorry I already had another nap.Season four...ok I just watched episode one with my husband last night because he is a huge fan and has really been looking forward to it. He, who I introduced the original film to years ago, is convinced that this season is going be better than the last (which he also didn't care for). But that is the difference between him and I...the big reveal at the end of episode one...didn't care and that ultimately is the problem, they left me at the end of season three not caring.They have shown us the awful things that the humans do in the park...the humans are bad and the robots are bad, what is left to care about in this new \"future world\" they have created? I am sad to say that I don't think going back to the park is going to fix the apathy that the show runners created in season three.I am giving this series a 7...because I don't know how to rate a 8-9, that goes to 5-6 and then down to 0. I hope for my husbands sake it gets better, but I am not sure I am willing to watch much more.I will give a shout out to some phenomenal acting by Anthony Hopkins, Ed Harris, Thandiwe Newton, and Jeffrey Wright. They are quite the contrast to Evan Rachel Wood who is giving the stoniest performance ever and truth be told I don't know if it is the actress or the direction she is being given, but she is hard to watch...including episode 1 season 4 (human...what a joke?!?). Also I want to give another shout out to two characters I really enjoyed: Lee Sizemore (Simon Quarterman) and Hector Escaton (Rodrigo Santoro)...both were interesting and added a lot for me. Finally, the character I wanted to see meet with a violent end: Charlotte Hale (Tessa Thompson) (yes there is some holdover from Veronica Mars...I'll be honest), but I harbored a lot of dislike for this character and was left less than satisfied."
    },
    {
      "username": "altereggo123",
      "userUrl": "https://www.imdb.com/user/ur24145048",
      "reviewLink": "https://www.imdb.com/review/rw8286090",
      "warningSpoilers": true,
      "date": "29 June 2022",
      "rate": "1",
      "helpful": "160 out of 200 found this helpful.",
      "title": "Really good until it became incoherent",
      "content": "The show once had a great and time-tested premise-androids who rebel at simply being used by humans and long to be human themselves. Limiting all this behavior to the computer-simulated region of Westworld to made sense. Then the writers went crazy and decided that all human behavior could be programmed in a similar way through a mega-computer controlling the human race. It lost me with this. I don't really know where are in Season 4, but I know that so far it makes zero sense. The only thing that is certain is that every family/roomate situation/work relationship is bi-racial. Grade: A for inclusive casting, F for plot development."
    },
    {
      "username": "thePopcornExplorer",
      "userUrl": "https://www.imdb.com/user/ur36922988",
      "reviewLink": "https://www.imdb.com/review/rw8573679",
      "warningSpoilers": false,
      "date": "28 September 2022",
      "rate": "9",
      "helpful": "32 out of 37 found this helpful.",
      "title": "Groundbreaking, but slowly losing its essence",
      "content": "When I first saw Westworld, I kid you not I saw the entire first season in a single day, of course seeing Jonathan Nolan as one of the co-writers of the project immediately convinced me, but nothing prepared me for the Sci-Fi spectacle that was season 1.That might sound good for a TV show but I feel Westworld suffers (a bit more) from \"True Detective disease\", the first season sets the bar so high that is almost impossible to be consistently that good, one can even argue that this could've been a miniseries and wrap up after the final episode of its first season... However it didn't, so then came season 2 which even though wasn't as impactful and good as its predecessor it still managed to keep the story going with some now famous Westworld twists.Westworld is in its essence a study of humanity, how our own flaws can cause our (possible) future extinction, how we are so violence driven in a world that has so much more to offer, this is the beauty of Westworld and adding all of this to the twists, the amazing cinematography, special effects and acting made this series gain such popularity.However things changed radically on season 3 and consequently the 4th as well - while I kind of understand that they want to continue to explore how our world would be impacted after the events of season 1 finale, I don't think they executed it the best way.It feels like a completely different show, and no matter how futuristic the first two seasons are, due to the set up somehow they felt like a possible future reality, but season 3 depicts \"our world\" in a highly futuristic fashion and I am not talking about the esthetic aspect of it, the actual way society is ruled is completely unrelatable contrary to how they explored the AI concepts on the first two seasons.For me that caused a dissociation with the plots of the last 2 seasons, which are not terrible, they are just more generic and boring.. I will continue to watch what seems to be the 5th and final season but I don't think the series will ever get to the former glory, I sound cliché I know, not all series get worse, but this is the downside of making one of the best seasons right from the scratch."
    },
    {
      "username": "e_s_reyne",
      "userUrl": "https://www.imdb.com/user/ur38179902",
      "reviewLink": "https://www.imdb.com/review/rw5715295",
      "warningSpoilers": false,
      "date": "7 May 2020",
      "rate": "3",
      "helpful": "747 out of 923 found this helpful.",
      "title": "So Bummed",
      "content": "Season 1 was one of the best seasons I've ever seen on television. Ever. Season 2 was forgettable. And season 3 is complete trash. I want to keep liking this show so badly. I love the addition of Aaron Paul and some of the other characters are still interesting, but it seems the show lost all direction just a couple episodes into season 2 and could never find its bearings again. This is not \"Westworld\" anymore."
    },
    {
      "username": "george_aten13",
      "userUrl": "https://www.imdb.com/user/ur10571055",
      "reviewLink": "https://www.imdb.com/review/rw6767995",
      "warningSpoilers": false,
      "date": "1 April 2021",
      "rate": "5",
      "helpful": "158 out of 198 found this helpful.",
      "title": "Season 1 great",
      "content": "The first season was great. The second season ok. The third season, despite the great cast, is a disaster."
    },
    {
      "username": "permaculture-45885",
      "userUrl": "https://www.imdb.com/user/ur93354203",
      "reviewLink": "https://www.imdb.com/review/rw8870087",
      "warningSpoilers": false,
      "date": "13 February 2023",
      "rate": "8",
      "helpful": "13 out of 13 found this helpful.",
      "title": "...aaaaaand... CANCELLED!",
      "content": "I share the common opinion: Two first season were masterpieces, third was a total disaster with a couple of Mary Sue, weak white people, etc, but season 4 was not bad, even if it was convoluted. Season 5 could have been better.We will never know. Another great series bites the dust. What is the point of building such a rich universe during 4 seasons, and then drop everything? So much wasted potential. Maybe the scenarist were not up to the task. Nonetheless, this should have been lead to its conclusion. I was hoping to see Anthony Hopkins rising from the dead.When HBO eventually file for bankruptcy, in a year or two, I'll cheer."
    },
    {
      "username": "athanasiosze",
      "userUrl": "https://www.imdb.com/user/ur22784486",
      "reviewLink": "https://www.imdb.com/review/rw8737023",
      "warningSpoilers": false,
      "date": "15 December 2022",
      "rate": "8",
      "helpful": "26 out of 31 found this helpful.",
      "title": "First and second seasons are masterpieces. And then...",
      "content": "FIRST SEASON : 9,5/10.SECOND SEASON : 8,9/10 THIRD SEASON : 7,5/10 FOURTH SEASON : 7,3/10.It is widely believed that first season is one of the best tv shows ever. I believe that second season is up there, too. It's a little bit worse but still, it was mindblowing, touching and made my brain hurt in a good way. There is a \"a sense of continuity\" between these two seasons, there is a flow, the viewer feels these seasons as an undivided work of art.To be honest, i don't remember much about third season. I rememeber that i like it, however, the magic was gone. No mystery anymore, it was just a good sci-fi tv show. Still, there were moments of greatness and i didn't hate this new direction. There were good messages too, noone wants to live in an Orwellian society, the majority of people at least.Fourth season has some moments of greatness too. Episode 4 made me think that i am going to relive Westworld's glory days. First 5 episodes were much better than the whole third season.And that's the moment where it should have ended. WESTWORLD should have ended in episode 4. It wouldn't have been a happy ending, but it doesn't matter.Because, the last two episodes were a mess. Maybe these were not as confusing as i thought at first, i mean, the ending makes sense, i understood what happened but it is the least satisfying ending of a show i loved, in the last 3 years. (Ok, new DEXTER had an even worse ending).Also, it feels almost unbelieavable that even acting got worse in 4th season. I didn't like Tessa's Thompson acting, she looked like a mediocre actress. Aurora Perrineau and some new actors in Westworld were not convincing too, there is a massive drop in acting's quaity. To be honest, I didn't get impressed by anyone's acting, even some good actors were a bit awkward, performances looked forced, not natural. I mean, i still liked Harris, Thandiwe Newton, Wright, Wood and Hemsworth but even these beloved actors/actresses didn't excite me like the previous seasons. Maybe it's not their fault, there should have been a better script.Still, i gave 4th season a 7,3/10 because it doesn't get much better nowadays. At least, first 5-6 episodes made me invested again and i would watch definitely a fifth season.I feel sorry that it got cancelled, i hope that, one day, we will watch the final season as Westworld's creators planned."
    },
    {
      "username": "jefferydhamstra",
      "userUrl": "https://www.imdb.com/user/ur110828165",
      "reviewLink": "https://www.imdb.com/review/rw8781565",
      "warningSpoilers": false,
      "date": "6 January 2023",
      "rate": "8",
      "helpful": "33 out of 37 found this helpful.",
      "title": "A mind bending series destroyed by its own ambition.",
      "content": "Westworld is one of the most technically perfect shows ever produced. From the beautiful 35mm film it was shot on, the incredible production design, one of the best soundtracks and sound designs of any show ever, and the mostly flawless visual effects, Westworld was designed for those looking for a big screen experience on the small screen, and like most movies, watching it on anything but a big screen with a big surround system is doing this show a disservice. Season 1 is an absolute masterpiece of filmmaking and is virtually flawless and is well worth the time. Season 2 immediately took the show in a new direction and it never recovered. Season 2 has many high points but the decision to focus more on the hosts than the humans is a mistake that plagues the rest of the shows run. Season 3 is a completely different show with the same characters and not even the constantly booming score can keep it from dragging. Season 4 came back with a vengeance and did a great job for the most part of taking the show both back to its roots and in a new direction at the same time. Overall I am sad to see this show canceled. After the misstep of season 3 I was very hopeful that they would have a great 5th season to wrap up the series. Well I will miss returning to Westworld, we will always have the first season to come back to, and watch the final credits roll wondering just how good the show could have been if the writers kept the show pointing North instead of wandering around exploring concepts that had no reason to be in this show. The saddest part is that with so many shows that fall from grace, we will never get to roll back the clock and give the creators another chance."
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw3555108",
      "warningSpoilers": true,
      "date": "3 October 2016",
      "rate": "",
      "helpful": "672 out of 974 found this helpful.",
      "title": "How do we define \"human\"?",
      "content": "As many sci-fi fans will know, the show 'Westworld' is based on the 1973 feature film of the same name (written and directed by Michael Crichton), and the premise is basically the same as it was then: In a future where technological possibilities are seemingly endless, a highly sophisticated theme park offers rich clients the chance to visit the long gone era of the Old West (Crichton later explored a variation of that theme in a certain well known novel - which was then adapted by a certain Mr. Spielberg - albeit with slightly different creatures than cowboys populating a slightly more \"jurassic\" environment).The show does a great job pulling the viewer immediately into Westworld. Within 10 minutes of the first episode, the basic rules of the theme park are established: paying guests called \"newcomers\" get to interact with androids called \"hosts\" (which to the naked eye are indiscernible from the guests) in a world dressed up like the Old West - and in this world, the guest truly is king. The rules are brutally simple: the visitors get to do whatever they like with - or to - the androids. They can have a friendly chat with them, flirt with them or embark on a spontaneous (or scripted) adventure with them - but they can also shoot them, rape them, torture them and kill them at will. Imagine a real-life version of the game 'Grand Theft Auto' (in a slightly different setting) and you'll get the idea.The androids, on the other hand, are constructed and programmed in a way that is supposed to inhibit them from physically harming \"living\" creatures. At the beginning of the show - thanks to an interesting choice of storytelling - we get to experience Westworld from the perspective of the androids, which reveals a cruel detail about their nature: they apparently experience emotions. Artificial or not, they do feel pain and fear - as well as affection and anger, and they have no idea that they don't count as \"real\" people (at least not to those who call themselves real people). And while that detail certainly makes the \"game\" even more thrilling and more realistic for the visitors, it means that the shocking abuse some of the androids have to suffer is harrowingly real to them.The way the show is constructed - so far - it immediately confronts the viewer with very uncomfortable questions. How do we as humans behave towards creatures we consider non-human? How excessive do we become and how thin does our layer of morality turn out to be if we're allowed to live out all our fantasies without having to fear any consequences for our actions? And at what point should a creature have rights similar to those we demand for ourselves? How do we define \"sentient\"? How do we define \"human\"? And how well do we actually understand - and how well are we able to control - the amazing technology our species seems to have acquired so suddenly?As an avid film fan, I found 'Westworld' immediately intriguing; not only because it dares to challenge the viewer with fascinating philosophical questions and scientific concepts, but also because its premise offers the chance to explore a wide range of film genres: sci- fi, western, drama, horror - to name but a few. In the first few episodes alone, there are hints of many of my favorite films and stories such as (obviously) 'Frankenstein', 'Blade Runner', 'A.I.', 'Ex Machina', 'Jurassic Park', 'The Truman Show' and 'Rise of the Planet of the Apes' (and I suspect somewhere down the road there will be a strong 'Spartacus' vibe). As for the non plot related aspects of the show: production design, music and effects are fantastic - as we've come to expect from HBO's high concept productions - and, with very few exceptions, the impressive ensemble of high caliber actors do a great job at bringing their respective characters to life (artificial and otherwise).A special mention needs to go to Ed Harris and Anthony Hopkins: their charismatic screen presence is once more just impossible to ignore and they simply own every scene they're in. Generally speaking, there really isn't much to complain about in 'Westworld' (so far), and I'm pretty sure HBO have another winner. Given the amount of talent involved, anything else actually would have been surprising. Produced by J.J. Abrams, created by Jonathan Nolan and Lisa Joy Nolan based on a concept by the late - great - Michael Crichton; directed by Neil Marshall and Vincenzo Natali (among others), and with a cast most shows would kill for, the stars really seem to have aligned for 'Westworld'.My overall verdict so far: 'Westworld' is intelligent science fiction for adults (some scenes are very graphic) which offers more than just eye candy and is full of mysteries for the patient viewer to uncover. The show's main themes may not be new, but I found the way they are presented never less than compelling. It succeeds in creating a powerful metaphor for oppression, and by showing how quickly humans tend to deem \"un-humane\" treatment of other beings acceptable - once they've managed to convince themselves they're \"less\" human than they are - the show drove a point home that resonated strongly with me. 8 stars out of 10.Favorite TV-Shows reviewed: imdb.com/list/ls075552387/Favorite films: IMDb.com/list/mkjOKvqlSBs/Lesser-Known Masterpieces: imdb.com/list/ls070242495/Favorite Low-Budget and B-Movies: imdb.com/list/ls054808375/"
    },
    {
      "username": "TruthSeeker82",
      "userUrl": "https://www.imdb.com/user/ur48587966",
      "reviewLink": "https://www.imdb.com/review/rw6262248",
      "warningSpoilers": false,
      "date": "12 November 2020",
      "rate": "9",
      "helpful": "126 out of 158 found this helpful.",
      "title": "First season was really good",
      "content": "I really liked the first season. Second was fine but the third was quite over dramatic. So my rating is for the first season."
    },
    {
      "username": "artabuneta",
      "userUrl": "https://www.imdb.com/user/ur107618753",
      "reviewLink": "https://www.imdb.com/review/rw8450792",
      "warningSpoilers": false,
      "date": "15 August 2022",
      "rate": "3",
      "helpful": "74 out of 94 found this helpful.",
      "title": "Season 4 is very bad",
      "content": "An incomprehensible storyline, confusing shifts between timelines, one-dimensional characters, much tearjerking, embarrassingly bad dialogue and, worst of all, boring."
    },
    {
      "username": "Nekravol",
      "userUrl": "https://www.imdb.com/user/ur76924811",
      "reviewLink": "https://www.imdb.com/review/rw8277559",
      "warningSpoilers": false,
      "date": "26 June 2022",
      "rate": "6",
      "helpful": "111 out of 135 found this helpful.",
      "title": "Geometric regression",
      "content": "Is that even a word?Anyway, Season 1 is one of the best pieces of television ever. It's deep. It's philosophical without being pretentious. The characters are complex and appealing. The acting is authentic and natural. I watched it as it came out all the way back and it was out of this world. The good thing is it can be viewed as a standalone story. Watch it and stop there.Season 2 is... decent. A far cry from Season 1, but not yet terrible. The story is confusing, some of the good characters are gone and the remaining ones are lesser. Passable effort overall.Season 3 is awful. The show degrades to a feminist power fantasy, a continuation of what started back in Season 2, but it's all the show is about by this point. Characters are completely one dimensional, old characters that were previously amazing are debased and destroyed in an almost ritualistic fashion. Aaron Paul's character is one of the worst characters I have seen brought to television. You could replace him with a bag of potatoes and I wouldn't be able to tell the difference. The story is dreadful, which is such a shame, because the issue at it's very core is actually very interesting and could itself one day become a reality.Watch Season 1 and stop."
    },
    {
      "username": "DUTCHY_BOY_1",
      "userUrl": "https://www.imdb.com/user/ur57304965",
      "reviewLink": "https://www.imdb.com/review/rw8301524",
      "warningSpoilers": false,
      "date": "5 July 2022",
      "rate": "5",
      "helpful": "74 out of 95 found this helpful.",
      "title": "USED TO BE A 10, BUT A BORING AND CONFUSING 5 NOW.",
      "content": "This used to be a 10 but now its a 5. First two seasons were a 10, the third season was a 7, then fourth season is a 5. The show has had that many unnecesary plot twists that it doesnt make sense anymore and is just all over the place. The new characters u forget there names and forget who they are or what there even doing in the show and its just very boring and confusing show now. Started going down hill season 3. Im actually giving up on it now. Its like new writers have took over and destroyed it, and whoever picked the new actors and characters needs sacking ASAP ! Lol."
    },
    {
      "username": "erollence",
      "userUrl": "https://www.imdb.com/user/ur49891076",
      "reviewLink": "https://www.imdb.com/review/rw8459916",
      "warningSpoilers": true,
      "date": "18 August 2022",
      "rate": "7",
      "helpful": "26 out of 29 found this helpful.",
      "title": "Season 4: a Dream inside a Flashback inside a Simulation inside a Loop",
      "content": "Just finished season 4. A main character dies... oh wait! Now they're alive again! Gotcha! Then the character is killed again. Now they're alive. Gotcha AGAIN!Season 4 has been a simulation inside a dream inside a memory inside 1 of 10,000 possible outcomes inside another simulation. Try to keep up viewers!You know why I was so excited about the launch of the Westworld series? WESTWORLD! Too bad we really only had 1 full season in Westword. Now it's just a sci-fi experiment: what's real? What's really real? What is the real meaning of really being real? Really?Does season 5 end with Dr. Ford waking up and exclaiming, \"It was all a dream\"? YEESH!"
    },
    {
      "username": "loozzotys",
      "userUrl": "https://www.imdb.com/user/ur93738371",
      "reviewLink": "https://www.imdb.com/review/rw8287980",
      "warningSpoilers": false,
      "date": "30 June 2022",
      "rate": "2",
      "helpful": "55 out of 73 found this helpful.",
      "title": "Season 3 utter unwatchable trash but...",
      "content": "Season 1 Epic, season 2 was OK but getting confusing and lazy, by season 3 it was unwatchable trash with bad acting, bad directing bad cinematography, bad CGI and extremely bad dialogue and awful writing.However can Westworld oroducers6 redeem themselves one last time with Season 4?I am watching season 4 now and ok i think i might give this a chance because it does seem a bit better than season 3....well they couldn't do worse could they ? Because season 3 was abysmally bad."
    },
    {
      "username": "dcarroll74",
      "userUrl": "https://www.imdb.com/user/ur57756206",
      "reviewLink": "https://www.imdb.com/review/rw5618633",
      "warningSpoilers": false,
      "date": "8 April 2020",
      "rate": "1",
      "helpful": "212 out of 311 found this helpful.",
      "title": "Good gone Bad",
      "content": "Having read the original book (script) and seen the original films, I knew that a televised seried would be different, especially giving the time between both, nearly 40 years. Series 1 and 2 I accepted and actually enjoyed. Series 3, not a hope. It became so convoluted I couldn't understand what was going on, even within a single episode, nevermind over a complete series. I will not be watching the rest, which is a pity considering, I admire Thandie Newton and Ed Harris. Those involved in this production, have done the same as J. Abrahams did to the current Star Trek franchise. Destroyed the original concept, and ruined the current ideal. Welcome to the 21st Century, where dreams are crushed."
    },
    {
      "username": "soulfunkyjazz",
      "userUrl": "https://www.imdb.com/user/ur134469399",
      "reviewLink": "https://www.imdb.com/review/rw8787602",
      "warningSpoilers": false,
      "date": "8 January 2023",
      "rate": "10",
      "helpful": "29 out of 33 found this helpful.",
      "title": "Great Show",
      "content": "I'm just in the process of binge-watching season 4 of Westworld. I love this series. It's a very intelligent show. I've watched all the previous seasons. I have to admit I had to watch them twice fully get the plot and the different timelines because you would get lost if you don't pay attention. Love this show the writing is brilliant. It's too bad the show got canceled due to low viewership I heard. Probably because those certain viewers' minds are constantly saturated with reality shows too much so they couldn't possibly fathom a smart sci-fi show such as this. I hope Netflix picks it up so that hopefully there would be a season 5."
    },
    {
      "username": "julianmarku",
      "userUrl": "https://www.imdb.com/user/ur82657799",
      "reviewLink": "https://www.imdb.com/review/rw8450578",
      "warningSpoilers": false,
      "date": "15 August 2022",
      "rate": "3",
      "helpful": "45 out of 59 found this helpful.",
      "title": "What is the praise that people are giving this show?! Season 4 is seriously meh...",
      "content": "Think about where we were at the end of season 1, where we were at the end of season 3 and where we are at the end of season 4.Season 4 is basically the writers going to their room picking all their toys and stuffing everything back in the closet because big daddies WB is coming home.The world was too big for these writers and they realized that they made a mistake of running out of their room and thinking: yeah we can write about Westworld and sci-fi future! Yeah!Is this getting a season 5? Because House of Dragon is here and I don't think HBO or WB has money to throw around anymore which is probably why the budget for season 5 is probably going to be cut down by half.Let's just put it clearly, season 1 was the best season for this show. It never lived up to it. NEVER. People didn't care what was outside the park, but the writers were so bored about being IN the park that they couldn't wait to get out. And once they were out, they had NO IDEA how to writer something smart.I hope WB comes back and gives Jonathan Nolan a huge bag of cash to write season 5 on his own because wow... this show is not going out with a whimper, it's going out with a fart."
    }
  ],
  "errorMessage": ""
}