{
  "imDbId": "tt0086831",
  "title": "Yes, Prime Minister",
  "fullTitle": "Yes, Prime Minister (TV Series 1986–1987)",
  "type": "TVSeries",
  "year": "1986",
  "episodes": [
    {
      "id": "tt0751837",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "The Grand Design",
      "image": "https://m.media-amazon.com/images/M/MV5BNzIwMzY5OTczOV5BMl5BanBnXkFtZTgwNjE0NzUyMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1988",
      "released": "6 Aug. 1988",
      "plot": "The new Prime Minister is preoccupied with defense issues as he begins to learn some of the details, such as the Russians having six times as many nuclear weapons as the UK or that the armed forces could withstand a conventional attack for 72 hours at best. As only Jim Hacker can do, his \"Grand Design\" is less than practical and it is left to Sir Humphrey, now Cabinet Secretary, to inject a dose of realism. The PM also wants a cook for 10 Downing St., but wants the government rather than himself to pay.",
      "imDbRating": "8.5",
      "imDbRatingCount": "305"
    },
    {
      "id": "tt0751839",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "The Ministerial Broadcast",
      "image": "https://m.media-amazon.com/images/M/MV5BMTYyNDg4NjE4M15BMl5BanBnXkFtZTgwODgzNzUyMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1988",
      "released": "13 Aug. 1988",
      "plot": "Jim Hacker plans to introduce his \"Grand Design\" to the British public during his first broadcast as the new P.M. However, Humphrey continues to try to convince Hacker to hold off, planning to let it die.",
      "imDbRating": "8.4",
      "imDbRatingCount": "284"
    },
    {
      "id": "tt0751841",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "The Smoke Screen",
      "image": "https://m.media-amazon.com/images/M/MV5BOTU2MzMwNTAzNF5BMl5BanBnXkFtZTgwODczNzUyMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1988",
      "released": "20 Aug. 1988",
      "plot": "Sir Humphrey opposes P.M. Hacker's plan to cut taxes, so Hacker steers the Minister for Health into campaigning against smoking as a diversion.",
      "imDbRating": "8.6",
      "imDbRatingCount": "278"
    },
    {
      "id": "tt0751838",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "The Key",
      "image": "https://m.media-amazon.com/images/M/MV5BOTM4MTA3NzgxNV5BMl5BanBnXkFtZTgwOTY0NzUyMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1988",
      "released": "27 Aug. 1988",
      "plot": "Sir Humphrey has to scramble when the Prime Minister's Political Advisor, Mrs. Wainwright, convinces the PM that she should get her old office back. Sir Humphrey and his predecessors have been trying to get her moved for years but he may have met his match when she also suggests to the PM that he re-assign Sir Humphrey's responsibilities for promotions and appointments. When the PM orders Bernard to take away Sir Humphrey's key to the door connecting the Cabinet Office to 10 Downing Street, the Cabinet Secretary sees the light.",
      "imDbRating": "9.2",
      "imDbRatingCount": "378"
    },
    {
      "id": "tt0776052",
      "seasonNumber": "1",
      "episodeNumber": "5",
      "title": "A Real Partnership",
      "image": "https://m.media-amazon.com/images/M/MV5BODU2MzYyNTkwMF5BMl5BanBnXkFtZTgwMjE4MTYyMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1988",
      "released": "3 Sep. 1988",
      "plot": "The Prime Minister must deal with a worsening financial crisis that requires all government Departments to cut their budgets. The belt-tightening coincides with a hoped-for civil service pay increase and Sir Humphrey and Sir Frank Gordon, the Treasury Secretary, decide they need to ensure the pay rise is announced as soon as possible. The PM thinks he has Sir Humphrey this time when his political adviser provides challenging questions about the pay rise. Sir Humphrey seeks advice from his predecessor, Sir Arnold Robinson, and develops a plan to win over the PM.",
      "imDbRating": "8.3",
      "imDbRatingCount": "255"
    },
    {
      "id": "tt0751831",
      "seasonNumber": "1",
      "episodeNumber": "6",
      "title": "A Victory for Democracy",
      "image": "https://m.media-amazon.com/images/M/MV5BMTcwNTI2MTMwMl5BMl5BanBnXkFtZTgwMzQ0NzUyMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1988",
      "released": "10 Sep. 1988",
      "plot": "The Foreign Office is having problems with the PM who is starting to question their advice in favour of a more pro-US line. In question is the political situation on the island of St. Georges' where Marxist guerrillas are posing a threat, and an impending vote at the UN to condemn Israel. Sir Humphrey and his Foreign Office counterpart connive, of course, to ensure that the PM sees things their way. The PM, however, sets about to outwit them.",
      "imDbRating": "8.5",
      "imDbRatingCount": "273"
    },
    {
      "id": "tt0751836",
      "seasonNumber": "1",
      "episodeNumber": "7",
      "title": "The Bishops Gambit",
      "image": "https://m.media-amazon.com/images/M/MV5BMTgxNDgyNzcxNF5BMl5BanBnXkFtZTgwOTczNzUyMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1988",
      "released": "17 Sep. 1988",
      "plot": "P.M. Hacker is to appoint a new bishop, and Sir Humphrey may secure a cushy appointment on retirement if he can convince Hacker to appoint the current Dean to the bishopric.",
      "imDbRating": "8.4",
      "imDbRatingCount": "257"
    },
    {
      "id": "tt0751834",
      "seasonNumber": "1",
      "episodeNumber": "8",
      "title": "One of Us",
      "image": "https://m.media-amazon.com/images/M/MV5BMTYwNTEzOTMzMl5BMl5BanBnXkFtZTgwMDE0NzUyMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1988",
      "released": "24 Sep. 1988",
      "plot": "When the Director General of MI5 informs the Prime Minister that his predecessor was a Soviet agent, Jim Hacker learns that he had been thoroughly investigated some years previously by none other than Sir Humphrey and given a clean bill. Needing to regain the upper hand over Hacker, Sir Humphrey suggests that he order the rescue of a dog that has wandered onto an artillery range. While the ploy to get positive publicity works, it also provides Sir Humphrey with valuable leverage.",
      "imDbRating": "8.6",
      "imDbRatingCount": "251"
    }
  ],
  "errorMessage": ""
}