{
  "imDbId": "tt1353056",
  "title": "RuPaul's Drag Race",
  "fullTitle": "RuPaul's Drag Race (TV Series 2009– )",
  "type": "TVSeries",
  "year": "2009",
  "items": [
    {
      "username": "marymcfarland-01866",
      "userUrl": "https://www.imdb.com/user/ur108950002",
      "reviewLink": "https://www.imdb.com/review/rw8047549",
      "warningSpoilers": false,
      "date": "10 April 2022",
      "rate": "10",
      "helpful": "19 out of 20 found this helpful.",
      "title": "Long overdue review...",
      "content": "I'm ashamed to say I was late joining this Fandom. I don't really watch competition/reality TV, I find most of it ridiculous. BUT... My son asked me to watch Drag Race with him at some point during covid. We binged...well...all of it. And I'm a forever fan.I always liked RuPaul...now I LOVE RuPaul. This show, all the queens... it's helped me connect with and relate to my son in a way we might not have been able to do otherwise.2 thumbs up."
    },
    {
      "username": "copperncherrio",
      "userUrl": "https://www.imdb.com/user/ur22518687",
      "reviewLink": "https://www.imdb.com/review/rw2398347",
      "warningSpoilers": true,
      "date": "13 March 2011",
      "rate": "10",
      "helpful": "21 out of 25 found this helpful.",
      "title": "This Show is For YOU!",
      "content": "The funniest guilty pleasure, full of my favorite things: fashion, drama, and competition. The only thing I really hate is how the drag queens have a better body then I'll ever would. Boo!The girls from season 1 is very different from that of season 2. However, both are just as entertaining. My favorite competitors actually happen to be the runner up in both seasons. They are very creative and diverse. However, I did love the winner from season one Without giving too much away, if you like good old reality competitive TV show, with interesting and creative people, this is the show for you!In all, it's like a drag version of Project Runway mixed with America's Next Top Model. Which are two of the few reality shows that I watch. Plus, I've always loved RuPaul."
    },
    {
      "username": "peterkowalski",
      "userUrl": "https://www.imdb.com/user/ur19482739",
      "reviewLink": "https://www.imdb.com/review/rw6750184",
      "warningSpoilers": false,
      "date": "27 March 2021",
      "rate": "",
      "helpful": "36 out of 52 found this helpful.",
      "title": "Not my show anymore",
      "content": "I used to watch the show from the very first episode; back in the day, it wasn't popular, it wasn't that interesting, nobody knew about it. I stuck with it through thick and thin. Watched it all, because I loved it from the first sight.After all the seasons, international editions, all stars, covid, in and out, I look back and see how over produced and fake it has become. How clear it has become DragRace is not about Drag anymore; it's about taking drag to the bank. It's not about personality, fashion, carisma, talent. It's about what sells at the moment, and what won't.Sashay. Away."
    },
    {
      "username": "dsprcBz",
      "userUrl": "https://www.imdb.com/user/ur26193972",
      "reviewLink": "https://www.imdb.com/review/rw2429860",
      "warningSpoilers": false,
      "date": "17 May 2011",
      "rate": "8",
      "helpful": "61 out of 81 found this helpful.",
      "title": "Addictive",
      "content": "I am addicted to this show – stumbled upon it on VH1 with the Jocks in Frocks episode, was totally entertained by it, then looked it up on the internet and started watching all episodes, (ALL episodes, extras included) of Season 3, 2 and 1 on the Logo site, and I'm straight as a flagpole.Can they put this on DVD please ? – The Logo site keeps buffering with the same damn commercials (I like the Orbitz commercial tho w/Carmen, Manila and Shangela, tho). They must include the Untucked episodes on the DVD.It's funny how so many people take this reality show contest sooo seriously – I mean the winner is crowned to a live audience of 3 people, and the host of the Grand Finale in the Untucked episode is eating fried chicken out of a bucket (that's why I love this show) It's so campy and yet so glamorous.I'm so addicted – I can name every queen of every season, and since I'm sick and can't do anything but stare in front of a computer, I'll critique them all(Season 1 – The Originators) Bebe Zahara Benet – If Snatch Game were in Season 1, she'd nail Oprah / Nina Flowers – The fiercest androgynous look ever / Rebecca Glasscock - The 1st pretty girl of RPDR / Shannel - The prettiest \"real\" eyes / Ongina - The prettiest bald queen / Jade - At times, prettier than Rebecca / Akashia - Worst runway walk ever / Tammie Brown - Kinda spooky look / Victoria \"Pork Chop\" Parker - First big girl to go, will make the trivia list(Season 2) Tyra Sanchez – Straight women would've gone for him, he's a pretty boy / Raven - A macho pretty boy / Jujubee - She's Got Personality, lots of it / Tatianna - Prettier than Rebecca / Pandorra Box - Looks more like Kathy Griffin than Kathy Griffin / Jessica Wild - Miss Popularity / Sahara Davenport - Miss Ballet Moves / Morgan McMichaels - Miss Rebel / Sonique - Miss Acrobat / Mystique Summers Madison - Miss Splits / Nicole Paige Brooks - Reminded me of Julia Roberts, yes Julia Roberts / Shangela - (Seasons 2 & 3) I like and dislike her cause she's got lots of talent but her character on the show reminded me of someone really \"shady\"(Season 3 – I like this season best thus far, simply because of the variety of contestants)Raja – The fiercest ever runway walk / Manila Luzon - A glamorous camp queen / Alexis Mateo - Competitive, deserved top 3 / Yara Sofia – Wish she were in top 3, likable personality, but what's up with the freaky contact lenses / Carmen Carrera – The pretty girl of season 3, pulls off the female illusion the best / Delta Work - The prettiest of the big girls / Mariah Paris Balenciaga – Perhaps the most beautiful of all 3 seasons queens / Stacy Layne Bryant Matthews, etc. etc. - Already looks like a woman / Indiah Ferrah - She's got $600 boobs and she's gonna wear them / Mimi Imfurst – Aptly named / Phoenix - 2 episodes is not enough to pass judgment / Venus D-Lite - Madonna livesThe Judges: who cares? The Pitt Crew: Nice touch, Ru.I hope Season 4 is just as enjoyable as Season 3. Can't wait for the next generation of Hoogers."
    },
    {
      "username": "julialug",
      "userUrl": "https://www.imdb.com/user/ur4883395",
      "reviewLink": "https://www.imdb.com/review/rw2958967",
      "warningSpoilers": false,
      "date": "11 February 2014",
      "rate": "10",
      "helpful": "66 out of 78 found this helpful.",
      "title": "Fantastic show on so many levels",
      "content": "This is a great show. One of the best reality shows I've ever seen. Those interested in fashion, makeup and pop-culture will find it instantly interesting, but beyond the obvious, you'll find a show that makes you think about life, about parenting, about friendship and about love. It is truly wonderful to see these amazingly talented people that went through hard times, but are still able to find joy and beauty in life.They say Drag is the art of illusion. And isn't illusion a fantastic subject? Films like \"Pan's Labyrinth\" and \"You Will meet a tall dark stranger\" make me think so. For me, this kind of art can be appreciated on many levels, and watching this show, just makes me like I could feel/be fabulous too.(I'm married, with three kids, just saying!)"
    },
    {
      "username": "maddison-59657",
      "userUrl": "https://www.imdb.com/user/ur69868463",
      "reviewLink": "https://www.imdb.com/review/rw6698514",
      "warningSpoilers": false,
      "date": "16 March 2021",
      "rate": "3",
      "helpful": "11 out of 14 found this helpful.",
      "title": "The show has become very Stale and Boring now",
      "content": "In the beginning this show was very original and interesting, however some 12 years later it has actually become very boring and unoriginal. The show has become stale due to over production of the show. You have this show, all stars, drag race Canada , drag race uk, and werq the world. It is just too much. Now it seems like any gay man can put on a dress and be on drag race!"
    },
    {
      "username": "femkemvs",
      "userUrl": "https://www.imdb.com/user/ur92155267",
      "reviewLink": "https://www.imdb.com/review/rw5570733",
      "warningSpoilers": false,
      "date": "22 March 2020",
      "rate": "8",
      "helpful": "10 out of 13 found this helpful.",
      "title": "A great show (which has lost its way)",
      "content": "Every generation has its tv shows that sweep the airwaves. Rupaul's Drag Race is certainly amongst those for this millennium. It's not just a show; it's a cultural phenomenon that has brought the art of drag to the mainstream and earned countless fans in the lgbtqa+ community and beyond.Drag Race is among the better reality tv competition shows because it is so fun and inventive. There's a little bit of everything in there, from fashion to comedy to acting to singing. Many of the queens to come out of the show are icons and have helped make drag as popular as it is today.However, where Drag Race in the past seemed to be above the usual shady reality show tricks, in recent seasons it has become more and more unfair and seems to be more rigged than it ever was. Most fans agree that the show's peak was seasons 5 and 6, but since then (for the most part) it has been losing its way. Season 7 is famous for being a disaster, season 9 was good but the change in format for determining the winner was one of the shadiest things Rupaul has done, season 10 was messy and season 11 was the most unfair season of the show so far. Storyline and drama seems to have become the show's primarily focus, sacrificing fair judging for causing a stir. Yet, the earlier seasons did not need this to create a good story. Season 5 had the best storyline of any season and it didn't feel manufactured or forced by the judges. There was a definite attempt to replicate it in season 11, but because it wasn't natural, it didn't work. Things like that make the enjoyment for the show go down, along with the quality.This does not mean the show has become awful, but it has experienced a drop in quality. The earlier seasons will always be the peak of the show and unless Rupaul changes the way things are done, I think the show will continue to go downhill."
    },
    {
      "username": "guanyuu",
      "userUrl": "https://www.imdb.com/user/ur46795744",
      "reviewLink": "https://www.imdb.com/review/rw2910256",
      "warningSpoilers": false,
      "date": "23 November 2013",
      "rate": "9",
      "helpful": "25 out of 34 found this helpful.",
      "title": "The most real reality TV so far..!",
      "content": "I just watched the 1st season of Repual's Drag Race and because of the positive energy this show implements; I attend to watch more Repaul's seasons. First of all, for those who compare this show to American Next Top Model and other shows of the same genre; you are wrong in so many levels since the core, for starters, of both shows are totally different. Rupaul's show focus on testing drag's surviving skills in the preforming business. Papering self make-up & hair, sewing unique outfits, dancing & lip-syncing, are some of the jobs assigned for the contestants in Rupaul's Drag Race because these queens are exposed to them every time they want to channel their drag persona on stage and more importantly, to themselves. In terms of human quality and productivity, Rupaul's Drag Race has a lot to offer. Being drag is not easy or safe even in our time. Drag Queens and cross-dressers has had it the hardest among the gay community considering that the majority of drag queens are gay. They put literally themselves out there for the world to judge and there are some, even among gay guys, who try to segregate themselves from them and feel repulsed by them so a drag lady has to be really courageous and develops an unbeatable character to feel strong & stable against all criticism about her life. This is another value that the show is trying to bring through the course of the race. In terms of other reality TV shows, I feel that Rupaul's Drag Race is the most genuine of them all although, ironically, the concept of the show is based on men dressing as women which is should not be up-normal anymore. Rupaul is trying to deliver a positive message in his show about loving oneself which is lacking in many competition shows. I have seen a dance competition show where the majority of the contestants below 20 and the judges are emitting real sociopath behavior when it comes to evaluating the young contestants outcome, all for the sake of the shock value to improve the network ratings. Others might find problem with the tune of the show and how it represent drag in stereotypical image which is incorrect. Drag queens are flamboyant by nature and these individuals have to channel their femininity while they are in the dress and make-up so the only question is if the viewer is comfortable about which 45 min of drag and what does it represent or if the viewer really know the difference between drag queens, transvestites, transsexuals, gays, etc. As the first show of its kind, I find that the creators and the producers of the show have done a great job and if there is a little bit of shallowness, it should be with tolerable amount especially comparing to other reality shows and computation shows which are now quantity with no quality."
    },
    {
      "username": "edicionccq",
      "userUrl": "https://www.imdb.com/user/ur109023433",
      "reviewLink": "https://www.imdb.com/review/rw5270286",
      "warningSpoilers": true,
      "date": "20 November 2019",
      "rate": "9",
      "helpful": "5 out of 7 found this helpful.",
      "title": "RuPaul's First Decade Race",
      "content": "Year after year the show has been delivering a new season of this competition. Every year there are new contestants and challenges, so every season is different. Therefore let's get started with the first X seasons. Season 1: This season can be jumped, and it's probably recommended to do so. The unique thing this season does successfully is establish the basic of the reality but the winner and the filter are so boring. Season 2: Things look more pleasing for the show. The cast is more likeable, and the visual quality has improved. Some things need some changes but this is an enjoyable season. Season 3: Going up. Funnier and smarter. The cast is full of talent and most of the jokes become legendary for the history of the show. Season 4: This is where the joke gets so hilarious that it's practically flawless. The competition is increasingly formidable, and choosing the winner becomes a challenge. The gags are shocking and the storytelling is intriguing. Season 5: One of the best casting in the show. There's a moment when it's anybody's game cause they are all so talented. The jokes are better, and the lipsync is on point. This season almost achieves perfection. Season 6: The peak of the show. A cast full of talent and memorable queens but overall the most rightful winner of the show and one of the most memorable top 3 in the reality. Many good gags and flawless lipsyncs. Season 7: This is in my opinion the worst season ever, and I know that this season is full of talent like Ginger Minj, Katya and Trixie Mattel but most of these queens were good after the show, not in the season. Everything is a mess and the winner remain a polemic decision. Season 8: I admit it. I love this season because it was the first season that I follow but it doesn't possess that much talent. Just four queens are absolutely lovely in every way and the rest is just forgettable. The winner is so much better than the previous season so at least that was right. Season 9: This is the moment where the show decides to be good again and cast many talented queens. The competition is increasingly formidable again.The shocking gags are back, and they were better than ever before. Season 10: The season X maintains the quality of the previous one. The queens are talented but for the final 4 the winner gets obvious and it's not so surprising. The season is excellent but not as much as it used to be in preceding years.So... Yeah, many things happen in the first ten years of the show. Various ups and downs but somehow still manages to make it up together to deliver something enjoyable."
    },
    {
      "username": "j-michele-roberts",
      "userUrl": "https://www.imdb.com/user/ur22887521",
      "reviewLink": "https://www.imdb.com/review/rw2211801",
      "warningSpoilers": true,
      "date": "22 February 2010",
      "rate": "9",
      "helpful": "19 out of 24 found this helpful.",
      "title": "Groundbreaking TV and total eye-candy",
      "content": "So many things to love about RuPaul's Drag Race. It gives a platform (heel?) for these gorgeous talented performers to strut their stuff (perhaps a bit too literally for poor Jade). It debunks a bunch of drag-queen myths (no, they don't live in drag all of the time). RuPaul, appearing in both male (dorky and adorable) and full-on drag magnificence is a perfect blend of snarky and kind; guest judge Santino Rice from Project Runway is delightfully perceptive and just bitchy enough. I fell in love with a number of amazing queens: sweet Nina Flowers, who rocks the glam/androgynous look better than Ziggy Stardust ever could; Ongina, the feisty, funny, gender-bending fashionista who reduces everyone to tears (no spoiler here); Bebe Sahara Benet, CAMEROOOOOOOOONNNN! I'm deducting one star because the contestants that were eliminated early were pretty weak, and because I think there could have been a smidge more drama (Rebecca, you bore me so). Looks like that's been rectified in Season 2 - meow!"
    },
    {
      "username": "quintero93",
      "userUrl": "https://www.imdb.com/user/ur36722050",
      "reviewLink": "https://www.imdb.com/review/rw2988515",
      "warningSpoilers": false,
      "date": "29 March 2014",
      "rate": "10",
      "helpful": "35 out of 47 found this helpful.",
      "title": "Ground Breaking",
      "content": "This show is truly ground breaking. This show allows all of America to see a bit of what gay culture is. Not to mention that its funny and the competition is fierce. IT makes people look at how talented and funny drag queens are. Drag is truly an art and it takes skill experience and talent. This show has guest judges apart from the standard judges which are Rupaul, Michelle Visage, and Santino Rice. The guest judges have included actors,singers and TV personalities. The challenges are design to test the queens and to allow them to show America why it is they should win. Acting, singing, rapping, comedy, dancing, impersonation, have all been bases for challenges. Anyone who is obsessed with pop culture should watch this show."
    },
    {
      "username": "shannonlawolfe",
      "userUrl": "https://www.imdb.com/user/ur85794130",
      "reviewLink": "https://www.imdb.com/review/rw4073472",
      "warningSpoilers": false,
      "date": "25 February 2018",
      "rate": "10",
      "helpful": "13 out of 18 found this helpful.",
      "title": "BEST SHOW EVER INVENTED!!!",
      "content": "I have seen every episode to date and just cannot get enough, obsessed is an understatement. Color, comedy, drama, entertainment, and all kinds of feels... This show has it all! Rupaul is legendary."
    },
    {
      "username": "claudiocafaro",
      "userUrl": "https://www.imdb.com/user/ur104586658",
      "reviewLink": "https://www.imdb.com/review/rw7851259",
      "warningSpoilers": false,
      "date": "9 February 2022",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Super show",
      "content": "Every season is different and fun and some are just trash but there are really lovely seasons and queens it's a great show! And it's getting bigger every year, now you have so much different drag races like Hollan, all stars and much more!"
    },
    {
      "username": "hjalsayegh",
      "userUrl": "https://www.imdb.com/user/ur60545327",
      "reviewLink": "https://www.imdb.com/review/rw3410600",
      "warningSpoilers": false,
      "date": "8 February 2016",
      "rate": "9",
      "helpful": "14 out of 29 found this helpful.",
      "title": "Serving Fish",
      "content": "The checklist for this show reads like this :-Reality TV - Drama - men in drag - cheese extra thick - beauty pageantI'll be honest and say this show has everything I DESPISE all crammed together! I watched it by accident one day (season three mid episode) and I thought it was a normal beauty pageant show... then the camera went back stage and my mind took a minute to process... wait what? WHAT?!?!So what's the verdict? I LOVE IT!!!!!!!! not only is everything done tastefully and with a lot of dignity attached to it, it also manages to do that with a lot of fun and not taking itself too seriously. The show Humanizes the people on it so you don't see a \"drag queen\" you see the contestants. (Raven you will always be my fav!) at their best and not so best. each bigger then life and an entertainer at heart.Rupaul keeps it interesting with lots of fun little twists and event and the clothes (and the shoes, oh god the shoes!!!) are always beautiful.I love that the show celebrates different body types, they're not all skinny and tall blondes, curvy girls have a real shot here and some you'll fall in love with.Right now this show is by far the best American reality TV show there is. which queen will you root for this season?"
    },
    {
      "username": "edicionccq",
      "userUrl": "https://www.imdb.com/user/ur109023433",
      "reviewLink": "https://www.imdb.com/review/rw5287279",
      "warningSpoilers": true,
      "date": "29 November 2019",
      "rate": "9",
      "helpful": "3 out of 4 found this helpful.",
      "title": "RuPaul's New Beginning Race - S11 Review.",
      "content": "SPOILERS AHEAD CAUSE I NEED TO COMPLAINGoing into S11, I was excited. I love almost every queen since the previews and this season was the first that I watch without any spoiler in mind. AND I TREASURE IT. I mean most of it.Most of the queens are flawless, and most of them are also charismatic. Miss Vanjie was a good return queen for a couple of episodes, but she didn't deserve going that far.Some things seem so forced to make some storylines work. Like that episode where Plastique Tiara won over Brooke Lynn... Choices. Or Rajah O'hara wins over Scarlett or Silky vs Nina or Vanjie vs Brooke. I mean. Many things were forced this season.The season finale was amazing. Most of it, I admire the winner but for me it wasn't the rightful one."
    },
    {
      "username": "emmarosepollard",
      "userUrl": "https://www.imdb.com/user/ur102025752",
      "reviewLink": "https://www.imdb.com/review/rw4797808",
      "warningSpoilers": false,
      "date": "23 April 2019",
      "rate": "10",
      "helpful": "6 out of 9 found this helpful.",
      "title": "Absolutely fabulous",
      "content": "I was introduced to RuPaul's Drag Race late last year and have gone through about 6 seasons in a short space of time (plus series spin offs and spin off films!). It's so addictive, hilarious, bitchy and utterly fabulous. It's such a celebration of diversity, LGBTQ+ communities and just being fabulous in general. The catchphrases used are so catchy (\"Okuuuur!\") that you will find them creeping into your everyday language. An utter joy to watch and it makes me so happy that we are in a time where this show exists."
    },
    {
      "username": "blimeystone",
      "userUrl": "https://www.imdb.com/user/ur34888522",
      "reviewLink": "https://www.imdb.com/review/rw6556587",
      "warningSpoilers": false,
      "date": "2 February 2021",
      "rate": "1",
      "helpful": "14 out of 27 found this helpful.",
      "title": "I used to love this show so much.",
      "content": "It was one of the few shows that brought creativity and anti bullying to the tv. Now they have a bully on the show and are coddling her. It's disgusting. Nothing but hypocrites."
    },
    {
      "username": "Evil_In",
      "userUrl": "https://www.imdb.com/user/ur3788904",
      "reviewLink": "https://www.imdb.com/review/rw7859027",
      "warningSpoilers": false,
      "date": "12 February 2022",
      "rate": "9",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Inspiring Queens!",
      "content": "These Queens are all an example of strength, will, and that dreams can come true if you work for it. Admire them all. Loved every season except season 7, those were the weakest Queens as regards skills."
    },
    {
      "username": "mastersahk",
      "userUrl": "https://www.imdb.com/user/ur41850342",
      "reviewLink": "https://www.imdb.com/review/rw3323196",
      "warningSpoilers": true,
      "date": "25 September 2015",
      "rate": "10",
      "helpful": "7 out of 11 found this helpful.",
      "title": "One of the best",
      "content": "the world is filled with reality TV shows, big brother, survivor, celebrity apprentice etc. many reality TV shows are a major part of pop culture, and now there is Rupaul's Drag Race. Rupaul's drag race is the euphony of a fantastic show.it has a great representation of the excitement of the LGBT community and it really shows the vulnerable side of the LGBT community as well. the show features many exciting and original challenges that involve design, music, acting and so much more. each season is completely different from the last which is what makes the viewer come back for more. the personalities of each contestant really make the viewer feel connected to the show. there has never been a show like this in the history of television, and it's time that there should be more. with the show's host Rupaul, he is seen as almost a mother figure the contestants which is a difference to where on other reality shows the host can be depicted as a ignorant and selfish person. even though the show is targeted to the LGBT community, I recommend it for all viewers. in reality TV, we have finally stacked gold with Rupaul's Drag Race."
    },
    {
      "username": "fionawebster",
      "userUrl": "https://www.imdb.com/user/ur19480009",
      "reviewLink": "https://www.imdb.com/review/rw6646636",
      "warningSpoilers": false,
      "date": "28 February 2021",
      "rate": "10",
      "helpful": "4 out of 6 found this helpful.",
      "title": "66-yr-old married hetero woman & rare TV watcher ADORES this show!",
      "content": "Let me state this first: I mostly DETEST reality TV. I think it's demeaning to the hapless wannabees who participate, and degrading to our society. (Witness our abysmal 45th president!) But I do have an outsider's curiosity about fashion, so I enjoyed the first few seasons of Project Runway. I watched one season of America's Top Model and was appalled by how stupid the models were, how unfunny the show was. That was it for me--heck, I hardly ever watch late-night talk shows. All the same, I'd been impressed with Ru Paul from a couple of his early TV appearances, so I checked out his Drag Race. Man oh man did I get addicted quickly! I started at the beginning and am watching the 7th season now. Unless it really jumps the shark, I plan to stick with it all the way through.What makes the show is Ru Paul himself: he's quite intelligent, creative, educated about culture, funny as hell, warm-hearted, self-mocking, spiritual (I've seen a couple of his lectures)--and refreshingly humble, given his undeniable beauty/glamour/fashion-sense and meteoric rise to fame. Oddly for me, usually a cringer at puns, I even like his ample use of wordplay, because he whips out his puns at top speed, with impeccable comic timing, drawing on a wide range of references. His repartee with the other judges (all sweet human beings, with the marked exception of the weirdly bitter, inconsistent & nasty Michelle Visage) also shows off his lightning wit. And when he's listening attentively to an especially inarticulate/ignorant queen in the workroom, he's hilarious in how he gives them a very flat, \"huh\" facial expression that cuts them dead in a way that's brutally honest, not at all mean-spirited. Even when he (rarely) loses his temper, it's well-controlled and justifiable.Because of who Ru Paul is as a person, the tone he consistently strikes, this show is about so much more than drag queens or LGBTQ+ people. It's about competition, showmanship, fashion and (exaggerated) femininity, for sure, but it's also about family, friendship, culture, self-actualization, body positivity, and love.I guess the only thing that puts me off a bit about the show is that more often than not I've never heard of his celebrity judges. But then, I am a 66-yr-old who's watched little TV. So that doesn't even knock down my rating by one star. Oh, and there is some bullying among the queens that the viewer has to put up with--but I suppose that counts as \"snarky\" humor these days: they are adults, after all."
    },
    {
      "username": "crows-are-bros",
      "userUrl": "https://www.imdb.com/user/ur34793652",
      "reviewLink": "https://www.imdb.com/review/rw6086371",
      "warningSpoilers": false,
      "date": "11 September 2020",
      "rate": "2",
      "helpful": "13 out of 23 found this helpful.",
      "title": "More reality TV than competition",
      "content": "The biggest issue with this show is the production and overall priorities. It is focused on being a reality TV show more than it's focused on being an honest competition focused on finding the very best. They call it the olympics of drag -- but that's hardly true."
    },
    {
      "username": "bostonbeans",
      "userUrl": "https://www.imdb.com/user/ur1886330",
      "reviewLink": "https://www.imdb.com/review/rw5982560",
      "warningSpoilers": false,
      "date": "11 August 2020",
      "rate": "2",
      "helpful": "21 out of 55 found this helpful.",
      "title": "Only for Drag Queens and drag Queen Lovers",
      "content": "Honestly, I was wondering what the rave was about.. but I don't get it.. I don't find this interesting, funny or even remotely entertaining. I guess it is when you are part of that world or have some friends in it.. otherwise this is utterly boring.. I don't get why this show has already lasted so long !"
    },
    {
      "username": "aliburaktugrul",
      "userUrl": "https://www.imdb.com/user/ur104538334",
      "reviewLink": "https://www.imdb.com/review/rw5737058",
      "warningSpoilers": false,
      "date": "14 May 2020",
      "rate": "6",
      "helpful": "8 out of 15 found this helpful.",
      "title": "always the same",
      "content": "(sorry for my english first of all ) I was a Huge fan of the show 8 YEARS AGO ! and my love of the show slowly ended. Because its ALWAST THE SAME ! EVERYTHING ! just watch all the seasons you will see what i try to say.. the background musics and everything.. in first 5 minutes always the same background music and then other music came and 10 minutes later the other music comes .. and it gets too borring every season because people doesnt like shady queens and queens knows it now and there is NO DRAMA now ..queens not saying what they want or thinks anymore because they know fanbase would cancel them. Season 12 was soo borring to me because queens seems like they are not showing who they really are.. and then people says old seasons were better .. SMH Bottom line is The Fan base ruind the Show ! and it beens more than 11 years and stage challenges the set is always the same ..they could improve the lip sync lightings and everything but no they only spend money to the guess judges ."
    },
    {
      "username": "b4blue",
      "userUrl": "https://www.imdb.com/user/ur6569605",
      "reviewLink": "https://www.imdb.com/review/rw7375944",
      "warningSpoilers": false,
      "date": "24 September 2021",
      "rate": "1",
      "helpful": "6 out of 19 found this helpful.",
      "title": "I used to love this show",
      "content": "In a way I still do. I love what it used to represent. I love how amazing new queens are. The level of professionalism and talent that queens that grew up with social media present is pretty amazing. However, new trends that seems forced with political climate, are destroying the concept. Diversity is being destroyed with completely irrational, made up diversity. Queens are not bad asses any more. Everyone has to walk on egg shells. Everything (but only if it fits this week standard) goes and nobody gets called out. They all need to be super supportive towards each other, otherwise their career is gone out the window. RuPaul even knows that for himself. Dark days for drag."
    },
    {
      "username": "skyfall-33402",
      "userUrl": "https://www.imdb.com/user/ur72556036",
      "reviewLink": "https://www.imdb.com/review/rw7556297",
      "warningSpoilers": true,
      "date": "17 November 2021",
      "rate": "10",
      "helpful": "2 out of 4 found this helpful.",
      "title": "Amazing",
      "content": "I loved every second of it. Good visuals, and an amazing fight scene between doctor strange and God himself. The drag Queen's bring great amounts of love and light into the mcu which was much needed. Loved when God killed doctor strange. 10/10 must watch."
    }
  ],
  "errorMessage": ""
}