{
  "imDbId": "tt1353056",
  "title": "RuPaul's Drag Race",
  "fullTitle": "RuPaul's Drag Race (TV Series 2009– )",
  "type": "TVSeries",
  "year": "2009",
  "episodes": [
    {
      "id": "tt2408420",
      "seasonNumber": "5",
      "episodeNumber": "1",
      "title": "RuPaullywood or Bust",
      "image": "https://m.media-amazon.com/images/M/MV5BMTk5Mjg0NTI2OF5BMl5BanBnXkFtZTgwNTQ2MjU1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "28 Jan. 2013",
      "plot": "In the this season five premiere, fourteen new drag queens compete for the title of America's Next Drag Superstar with a prize package including a life time supply of Color Evolution cosmetics, a one of a kind trip courtesy of ALandCHUCK.travel, headline Logo's Drag Race tour featuring Absolut Vodka cocktails perfected, and $100,000. In the mini challenge, they have an \"underwater serving glamor\" photo shoot. In the main challenge, they dumpster dive for materials to create an \"award winning look that screams Hollywood red carpet couture\" to wear on the runway.",
      "imDbRating": "8.0",
      "imDbRatingCount": "335"
    },
    {
      "id": "tt2481570",
      "seasonNumber": "5",
      "episodeNumber": "2",
      "title": "Lip Synch Extravaganza Eleganza",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQxNTQ3MzUyMF5BMl5BanBnXkFtZTgwNjc3OTU1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "4 Feb. 2013",
      "plot": "With one queen down, the contestants must lip sync to three of RuPaul's hit songs in the mini challenge. For the main challenge, they split into three teams to lip sync to \"classic moments\" from \"RuPaul's Drag Race: Untucked!\" On the main stage, the queens come out \"dressed to impress.\"",
      "imDbRating": "8.0",
      "imDbRatingCount": "327"
    },
    {
      "id": "tt2662664",
      "seasonNumber": "5",
      "episodeNumber": "3",
      "title": "Draggle Rock",
      "image": "https://m.media-amazon.com/images/M/MV5BMjIzNjQzOTEzOV5BMl5BanBnXkFtZTgwNTEwMTU1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "11 Feb. 2013",
      "plot": "In the mini challenge, the queens partner up to dress up blank mannequins for the \"Miss Junior Drag Superstar Pageant.\" For the main challenge, they're split into two teams and must transform themselves into \"lovable, eccentric characters\" and write the material for their own kidster TV show. On the main stage, they are instructed to come down the runway tickled pink.",
      "imDbRating": "7.8",
      "imDbRatingCount": "316"
    },
    {
      "id": "tt2721560",
      "seasonNumber": "5",
      "episodeNumber": "4",
      "title": "Black Swan: Why It Gotta Be Black?",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQzMzEyMDQyN15BMl5BanBnXkFtZTgwOTg4ODU1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "18 Feb. 2013",
      "plot": "In the mini challenge, the queens compete in a \"Soul Train\" style dance off to see who the two best dancers are. For the main challenge, they split into two teams and perform two acts of an original American drag ballet called \"No RuPaulogies\" which tracks the highs and lows of RuPaul's life and career. On the main stage, six of the contestants are asked which queen deserves to go home.",
      "imDbRating": "8.3",
      "imDbRatingCount": "335"
    },
    {
      "id": "tt2721578",
      "seasonNumber": "5",
      "episodeNumber": "5",
      "title": "Snatch Game",
      "image": "https://m.media-amazon.com/images/M/MV5BMjMyNTU5MjQ4Ml5BMl5BanBnXkFtZTgwNTA5ODU1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "25 Feb. 2013",
      "plot": "In the mini challenge, the remaining nine queens must turn snuggies into something red carpet worthy to see \"who wore it best\" (like US Weekly magazine does). For the main challenge, they compete in a \"Match Game\" style game show where they must pull off their best and funniest celebrity impersonations. On the main stage, they are instructed to serve their own girlish glamor on the runway aka \"deadliest snatch.\"",
      "imDbRating": "8.4",
      "imDbRatingCount": "342"
    },
    {
      "id": "tt2726274",
      "seasonNumber": "5",
      "episodeNumber": "6",
      "title": "Can I Get an Amen?",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc4OTA5MDAwMl5BMl5BanBnXkFtZTgwODg1MDY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "4 Mar. 2013",
      "plot": "In the mini challenge, the queens must put their makeup on in complete darkness. The winner splits them into three teams for the main challenge which is to write and record a video for RuPaul's new inspirational anthem \"Can I Get an Amen?\" On the main stage, the queens must put a look together for the runway that shows off their favorite body part.",
      "imDbRating": "8.2",
      "imDbRatingCount": "338"
    },
    {
      "id": "tt2737222",
      "seasonNumber": "5",
      "episodeNumber": "7",
      "title": "RuPaul Roast",
      "image": "https://m.media-amazon.com/images/M/MV5BMTgxNjgxNTU0OV5BMl5BanBnXkFtZTgwNTY5NzQ1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "11 Mar. 2013",
      "plot": "For the mini challenge, the library is open! After they \"read\" each other, the winner decides the order of presenters for the main challenge: the contestants must write and perform in a \"roast\" of RuPaul (plus the other judges and contestants) in front of a live audience. On the main stage, the queens must hit the runway decked out in their swankiest cocktail attire.",
      "imDbRating": "9.1",
      "imDbRatingCount": "444"
    },
    {
      "id": "tt2758136",
      "seasonNumber": "5",
      "episodeNumber": "8",
      "title": "Scent of a Drag Queen",
      "image": "https://m.media-amazon.com/images/M/MV5BMjI3OTE1OTE5Ml5BMl5BanBnXkFtZTgwMzg1ODU1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "18 Mar. 2013",
      "plot": "In the mini challenge, the queens play \"Whatcha Packin'?\" (memory) with 20+ male models' underwear. The winner receives a phone call home. In this week's main challenge, the queens create and market their own signature fragrance. They must come up with the scent, the name, the packaging, and film a commercial for it. On the main stage, the queens mark the runway with the scent of a drag queen while their commercials are viewed.",
      "imDbRating": "8.3",
      "imDbRatingCount": "320"
    },
    {
      "id": "tt2815066",
      "seasonNumber": "5",
      "episodeNumber": "9",
      "title": "Drama Queens",
      "image": "https://m.media-amazon.com/images/M/MV5BNjIwYWY5MmUtOWEyZC00MTAyLTkzMzctZDAyNzA4Yjk3MWUzXkEyXkFqcGdeQXVyMjkyNTQ5MDU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "1 Apr. 2013",
      "plot": "For the mini challenge, the six remaining queens must cry on cue. The two winners become team captains and select their cast mates for the main challenge. They star in two separate telenovela style soap operas with Wilmer Valderrama. On the main stage, \"category is Latina glamarosa extravaganza\" where the telenovelas are viewed. Even though they worked as teams, the contestants are judged as individuals.",
      "imDbRating": "8.2",
      "imDbRatingCount": "308"
    },
    {
      "id": "tt2815082",
      "seasonNumber": "5",
      "episodeNumber": "10",
      "title": "Super Troopers",
      "image": "https://m.media-amazon.com/images/M/MV5BOGMyNTgyNGMtYzEyNC00ZDhmLWEyZDktNTkwNTFmMWJiYzZmXkEyXkFqcGdeQXVyMjkyNTQ5MDU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "8 Apr. 2013",
      "plot": "The dolls get patriotic, as they are paired up with gay veterans for a drag runway makeover. With guest judges What Not to Wear's Clinton Kelly and Fashion Police's George Kotsiopoulos.",
      "imDbRating": "8.3",
      "imDbRatingCount": "306"
    },
    {
      "id": "tt2815086",
      "seasonNumber": "5",
      "episodeNumber": "11",
      "title": "Sugar Ball",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU2NTQ4MDY1MF5BMl5BanBnXkFtZTgwMjY2MjU1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "15 Apr. 2013",
      "plot": "The contestants have a \"good old fashion bitch-fest\" with puppets for the mini challenge where each queen drags up a puppet likeness of one of their competitors. For the main challenge, they throw a Sugar Ball where they must construct three different luscious looks: \"Super Duper Sweet 16\" (teenage party girl), \"Sugar Mama Executive Realness,\" and \"Candy Couture\" (edible eleganza). If that wasn't enough, they're later told that they must perform a \"sugar babies opening number\" where the winner of the mini challenge is in charge of the choreography.",
      "imDbRating": "8.4",
      "imDbRatingCount": "328"
    },
    {
      "id": "tt2815090",
      "seasonNumber": "5",
      "episodeNumber": "12",
      "title": "The Final Three, Hunty",
      "image": "https://m.media-amazon.com/images/M/MV5BODA3ODkyMzU1OV5BMl5BanBnXkFtZTgwMDg2MjU1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "22 Apr. 2013",
      "plot": "The top 3 queens go to court, as Judge Ru presents their final challenge - starring in the music video for RuPaul's hit The Beginning.",
      "imDbRating": "8.2",
      "imDbRatingCount": "285"
    },
    {
      "id": "tt2854266",
      "seasonNumber": "5",
      "episodeNumber": "13",
      "title": "Countdown to the Crown",
      "image": "https://imdb-api.com/images/original/nopicture.jpg",
      "year": "2013",
      "released": "29 Apr. 2013",
      "plot": "In this season five recap, RuPaul hosts in a newscast style. Up first is a look at the queens who \"sashayed away.\" Next, the season long feud between two pageant queens is recapped. Contestant outtakes from the RuPaul Roast episode are shown. Three previous season four queens show us heartwarming moments, answer questions, and share about winning the crown. Guest judge outtakes are shown. A refresher in drag linguistics is given. Fashion do's and don'ts are examined. The first ever Ru on Ru interview introduces the lost \"Untucked\" episode from \"The Final Three, Hunty....",
      "imDbRating": "6.9",
      "imDbRatingCount": "220"
    },
    {
      "id": "tt2854524",
      "seasonNumber": "5",
      "episodeNumber": "14",
      "title": "Reunited!",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQyNTc3MTE3M15BMl5BanBnXkFtZTgwNzAyMTY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "6 May 2013",
      "plot": "In this finale of season five, the entire cast is reunited. A group performance kicks it all off. RuPaul interviews all the contestants and gives a lesson in \"Drag Race Herstory.\" There's a short performance by underwear models, the contestants answer viewer questions, and the crowning of this season's Miss Congeniality all before the winner of \"America's Next Drag Superstar\" is announced.",
      "imDbRating": "8.4",
      "imDbRatingCount": "315"
    }
  ],
  "errorMessage": ""
}