{
  "imDbId": "tt1353056",
  "title": "RuPaul's Drag Race",
  "fullTitle": "RuPaul's Drag Race (TV Series 2009– )",
  "type": "TVSeries",
  "year": "2009",
  "language": "en",
  "titleInLanguage": "RuPaul's Drag Race",
  "url": "https://en.wikipedia.org/wiki/RuPaul%27s_Drag_Race",
  "plotShort": {
    "plainText": "RuPaul's Drag Race is an American reality competition television series, the first in the Drag Race franchise, produced by World of Wonder for Logo TV (season 1–8), WOW Presents Plus, VH1 (season 9–14) and, beginning with the fifteenth season, MTV. The show documents RuPaul in the search for \"America's next drag superstar\". RuPaul plays the role of host, mentor, and head judge for this series, as contestants are given different challenges each week. Contestants are judged by a panel that includes RuPaul, Michelle Visage, an alternating third main judge of either Carson Kressley, Ross Mathews, or Ts Madison, and one or more guest judges, who critique their progress throughout the competition. The title of the show is a play on drag queen and drag racing, and the title sequence and song \"Drag Race\" both have a drag-racing theme.\r\nRuPaul's Drag Race has spanned fifteen seasons and inspired the spin-off shows RuPaul's Drag U, RuPaul's Drag Race All Stars, and RuPaul's Secret Celebrity Drag Race; the companion series RuPaul's Drag Race: Untucked; and numerous international franchises including British and Australian and New Zealand versions hosted by RuPaul as well as Chilean, Thai, Canadian, Dutch, Spanish, Italian, French, Philippine, Belgian, and Swedish editions, upcoming Mexican, German, and Brazilian installments, and international vs. the World competitions hosted in The United Kingdom and Canada.\r\nThe show has become the highest-rated television program on Logo TV, and airs internationally, including in the United Kingdom, Australia, Canada, the Netherlands and Israel. The show earned RuPaul seven consecutive Emmy Awards (2016 to 2022) for Outstanding Host for a Reality or Competition Program. The show itself has been awarded as the Primetime Emmy Award for Outstanding Reality-Competition Program 4 consecutive times (2018 to 2021), and the Outstanding Reality Program Award at the GLAAD Media Awards. It has been nominated for four Critics' Choice Television Awards including Best Reality Series – Competition and Best Reality Show Host for RuPaul, and was nominated for a Creative Arts Emmy Award for Outstanding Make-up for a Multi-Camera Series or Special (Non-Prosthetic). Later in 2018, the show became the first show to win a Primetime Emmy Award for Outstanding Reality-Competition Program and a Primetime Emmy Award for Outstanding Host for a Reality or Reality-Competition Program in the same year, a feat it has since repeated three times.",
    "html": "<p>RuPaul's Drag Race is an American reality competition television series, the first in the Drag Race franchise, produced by World of Wonder for Logo TV (season 1–8), WOW Presents Plus, VH1 (season 9–14) and, beginning with the fifteenth season, MTV. The show documents RuPaul in the search for \"America's next drag superstar\". RuPaul plays the role of host, mentor, and head judge for this series, as contestants are given different challenges each week. Contestants are judged by a panel that includes RuPaul, Michelle Visage, an alternating third main judge of either Carson Kressley, Ross Mathews, or Ts Madison, and one or more guest judges, who critique their progress throughout the competition. The title of the show is a play on drag queen and drag racing, and the title sequence and song \"Drag Race\" both have a drag-racing theme.</p><p>RuPaul's Drag Race has spanned fifteen seasons and inspired the spin-off shows RuPaul's Drag U, RuPaul's Drag Race All Stars, and RuPaul's Secret Celebrity Drag Race; the companion series RuPaul's Drag Race: Untucked; and numerous international franchises including British and Australian and New Zealand versions hosted by RuPaul as well as Chilean, Thai, Canadian, Dutch, Spanish, Italian, French, Philippine, Belgian, and Swedish editions, upcoming Mexican, German, and Brazilian installments, and international vs. the World competitions hosted in The United Kingdom and Canada.</p><p>The show has become the highest-rated television program on Logo TV, and airs internationally, including in the United Kingdom, Australia, Canada, the Netherlands and Israel. The show earned RuPaul seven consecutive Emmy Awards (2016 to 2022) for Outstanding Host for a Reality or Competition Program. The show itself has been awarded as the Primetime Emmy Award for Outstanding Reality-Competition Program 4 consecutive times (2018 to 2021), and the Outstanding Reality Program Award at the GLAAD Media Awards. It has been nominated for four Critics' Choice Television Awards including Best Reality Series – Competition and Best Reality Show Host for RuPaul, and was nominated for a Creative Arts Emmy Award for Outstanding Make-up for a Multi-Camera Series or Special (Non-Prosthetic). Later in 2018, the show became the first show to win a Primetime Emmy Award for Outstanding Reality-Competition Program and a Primetime Emmy Award for Outstanding Host for a Reality or Reality-Competition Program in the same year, a feat it has since repeated three times.</p>"
  },
  "plotFull": {
    "plainText": "RuPaul's Drag Race is an American reality competition television series, the first in the Drag Race franchise, produced by World of Wonder for Logo TV (season 1–8), WOW Presents Plus, VH1 (season 9–14) and, beginning with the fifteenth season, MTV. The show documents RuPaul in the search for \"America's next drag superstar\". RuPaul plays the role of host, mentor, and head judge for this series, as contestants are given different challenges each week. Contestants are judged by a panel that includes RuPaul, Michelle Visage, an alternating third main judge of either Carson Kressley, Ross Mathews, or Ts Madison, and one or more guest judges, who critique their progress throughout the competition. The title of the show is a play on drag queen and drag racing, and the title sequence and song \"Drag Race\" both have a drag-racing theme.\r\nRuPaul's Drag Race has spanned fifteen seasons and inspired the spin-off shows RuPaul's Drag U, RuPaul's Drag Race All Stars, and RuPaul's Secret Celebrity Drag Race; the companion series RuPaul's Drag Race: Untucked; and numerous international franchises including British and Australian and New Zealand versions hosted by RuPaul as well as Chilean, Thai, Canadian, Dutch, Spanish, Italian, French, Philippine, Belgian, and Swedish editions, upcoming Mexican, German, and Brazilian installments, and international vs. the World competitions hosted in The United Kingdom and Canada.\r\nThe show has become the highest-rated television program on Logo TV, and airs internationally, including in the United Kingdom, Australia, Canada, the Netherlands and Israel. The show earned RuPaul seven consecutive Emmy Awards (2016 to 2022) for Outstanding Host for a Reality or Competition Program. The show itself has been awarded as the Primetime Emmy Award for Outstanding Reality-Competition Program 4 consecutive times (2018 to 2021), and the Outstanding Reality Program Award at the GLAAD Media Awards. It has been nominated for four Critics' Choice Television Awards including Best Reality Series – Competition and Best Reality Show Host for RuPaul, and was nominated for a Creative Arts Emmy Award for Outstanding Make-up for a Multi-Camera Series or Special (Non-Prosthetic). Later in 2018, the show became the first show to win a Primetime Emmy Award for Outstanding Reality-Competition Program and a Primetime Emmy Award for Outstanding Host for a Reality or Reality-Competition Program in the same year, a feat it has since repeated three times.\r\nFormat\r\nProspective Drag Race contestants submit video auditions to the show's production company, World of Wonder. RuPaul, the host and head judge, views each tape and selects the season's competitors. Once the chosen pool of performers is on set, they film a series of episodes in which they compete against each other in various challenges. Each episode typically concludes with the removal of one contestant from the competition. Rarely, the outcome of an episode has been a double elimination, no elimination, contestant disqualification or removal of a contestant on medical grounds. Each episode features a so-called maxi challenge that tests competitors' skills in a variety of areas of drag performance. Some episodes also feature a mini challenge, the prize of which is often an advantage or benefit in the upcoming maxi challenge. Following the maxi challenge, contestants present themed looks in a runway walk. RuPaul and a panel of judges then critique each contestant's performance, deliberate amongst themselves, and announce the week's winner and bottom two competitors. The bottom two queens compete in a so-called Lip Sync for Your Life; the winner of the lip sync remains in the competition, and the loser is eliminated. Generally, the contestant that the judges feel has displayed the most \"charisma, uniqueness, nerve and talent\" (C.U.N.T.) is the one who advances. The final three, or four depending on what RuPaul chooses, contestants remaining compete in a special finale episode wherein the season's winner is crowned. In early seasons, the finale was pre-recorded in the studio with no audience. More recently, the finale has taken the form of a lip sync tournament before a live audience. The season 12 finale was filmed remotely due to the COVID-19 pandemic. The whole season is typically filmed in four weeks.\r\nMini and maxi challenges\r\nMini challenges are quick, small assignments that RuPaul announces at the beginning of an episode. One of the most popular mini challenges, which recurs from season to season, is the reading challenge. In it, contestants satirically criticize one another in a process called \"reading\", which was popularized by the film Paris Is Burning. Maxi challenges vary in the skill they test; some are group challenges that involve singing and acting, while others feature comedy, a talent of choice, dancing, or makeovers. The winner receives a material or monetary prize. Until the show's sixth season, the winner sometimes also received immunity against elimination the following week. Drag Race's most popular seasonal maxi challenge is Snatch Game, a spoof on Match Game wherein contestants impersonate celebrities or famous fictional personas.\r\nJudging\r\nRuPaul has been the series' head judge since its premiere. For the first two seasons, Merle Ginsberg joined him on the panel; she was replaced in season 3 by longtime friend of RuPaul and co-host of The RuPaul Show Michelle Visage. Santino Rice served as a judge from season 1 through season 6. From season 7 onward, Ross Mathews and Carson Kressley have occupied Rice's former seat. New York City makeup artist Billy B held a regular judging spot in the third and fourth seasons when Rice was absent. Most weeks, one or two celebrity guest judges join the panel. After appearing as a recurring guest judge in seasons 13 and 14, Ts Madison became a regular member of the judging panel from the fifteenth season.\r\nCompanion series\r\nThe first season of Drag Race was accompanied by a seven-episode web series titled Under the Hood of RuPaul's Drag Race, which Logo TV made available for streaming on its website. The series featured behind-the-scenes and deleted footage from the main show's tapes. From season 2 onward, a companion show called RuPaul's Drag Race: Untucked, which has the same premise, has aired instead. Untucked largely focuses on conversations and drama that occur between contestants backstage while the judges deliberate on each episode's results. In most seasons, it has aired on TV following the main show, but it was available only online for season 7 through season 9. A number of smaller web series also accompany each episode of Drag Race. Whatcha Packin', which began at the start of the sixth season, features Michelle Visage interviewing the most recently eliminated queen about their run on the show and showcasing runway outfits they had brought but did not have the opportunity to wear. In 2014, the web-series Fashion Photo Ruview aired for the first time, co-hosted by Raja Gemini and Raven who evaluate the runway looks of the main show. Since season 8, a five- to fifteen-minute (later eighteen- to thirty-minute) aftershow called The Pit Stop has also been produced. It involves a host and guest, typically past competitors of Drag Race, discussing the recently aired episode. Each season's host (or hosts) are different; to date, these have included the YouTuber Kingsley, Raja Gemini, Bob the Drag Queen, Alaska Thunderfuck, Trixie Mattel, Manila Luzon, Monét X Change, and Bianca Del Rio.\r\nSeries overview\r\nSeasons 1–8 (2009–2016): Logo TV\r\nSeason 1 premiered in the U.S. on February 2, 2009, on Logo TV. Nine contestants competed to become \"America's Next Drag Superstar\". The winner won a lifetime supply of MAC Cosmetics, was featured on the cover of Paper and in an LA Eyeworks campaign, joined the Absolut Pride tour, and won a cash prize of $20,000. One of the nine, Nina Flowers, was determined by an audience vote via the show's official website. The winner of season 1 was BeBe Zahara Benet, with Nina Flowers winning Miss Congeniality. In late 2013, Logo re-aired the season as RuPaul's Drag Race: The Lost Season Ru-Vealed, featuring commentary from RuPaul.\r\nFor season 2 (2010), 12 contestants competed for a lifetime supply of NYX Cosmetics and be the face of nyxcosmetics.com, an exclusive one year public relations contract with LGBT firm Project Publicity, be featured in an LA Eyeworks campaign, join the Logo Drag Race Tour, and a cash prize of $25,000. A new tradition of writing a farewell message in lipstick on the workstation mirror was started by the first eliminated queen, Shangela. Each week's episode is followed by a behind-the-scenes show, RuPaul's Drag Race Untucked. The winner of season 2 was Tyra Sanchez, with Pandora Boxx winning Miss Congeniality. On December 6, 2011, Amazon.com released season 2 on DVD via the CreateSpace program.\r\nSeason 3 (2011) had Michelle Visage replacing Merle Ginsberg on the judging panel as well as Billy Brasfield (commonly known as Billy B), Mike Ruiz, and Jeffrey Moran (courtesy of Absolut Vodka) filling in for Santino Rice's absence during several episodes. Due to Billy B's continued appearances, he and Rice are considered to have been alternate judges for the same seat on judges panel. Other changes made included the introduction of a wildcard contestant from the past season, Shangela; an episode with no elimination; and a contestant, Carmen Carrera, being brought back into the competition after having been eliminated a few episodes prior. A new pit crew was also introduced consisting of Jason Carter and Shawn Morales. As with the previous season, each week's episode was followed by a behind-the-scenes show, RuPaul's Drag Race: Untucked. The winner of the season 3 was Raja, with Yara Sofia winning Miss Congeniality. On December 6, 2011, Amazon.com released this season on DVD via their CreateSpace program.\r\nSeason 4 began airing on January 30, 2012, with cast members announced November 13, 2011. The winner headlined Logo's Drag Race Tour featuring Absolut Vodka, won a one-of-a-kind trip, a lifetime supply of NYX Cosmetics, a cash prize of $100,000, and the title of \"America's Next Drag Superstar\". Like the previous season, Rice and Billy B (Billy Brasfield), shared the same seat at the judges table alternatively, with Brasfield filling in for Rice when needed. The winner of season 4 was Sharon Needles, with Latrice Royale winning Miss Congeniality.\r\nSeason 5 began airing on January 28, 2013, with a 90-minute premiere episode. Fourteen contestants competed for the title of \"America's Next Drag Superstar\" along with a lifetime supply of Colorevolution Cosmetics, a one-of-a-kind trip courtesy of AlandChuck.travel, a headlining spot on Logo's Drag Race Tour featuring Absolut Vodka and a cash prize of $100,000. Rice and Visage were back as judges on the panel. The winner of season 5 was Jinkx Monsoon, with Ivy Winters winning Miss Congeniality.\r\nSeason 6 began airing February 24, 2014. Like season 5, season 6 saw 14 contestants competing for the title of \"America's Next Drag Superstar\". For the first time in the show's history, the season premiere was split into two episodes; the fourteen queens are split into two groups and the seven queens in each group compete against one another before being united as one group in the third episode. Rice and Visage returned as judges at the panel. Two new pit crew members, Miles Moody and Simon Sherry-Wood, joined Carter and Morales. The winner won a prize package that included a supply from Colorevolution Cosmetics and a cash prize of $100,000. The winner of season 6 was Bianca Del Rio, with BenDeLaCreme winning Miss Congeniality.\r\nSeason 7 began airing on March 2, 2015. Returning judges included RuPaul and Visage, while the space previously occupied by Rice was filled by new additions Ross Mathews and Carson Kressley. Mathews and Kressley were both present for the season premiere and then took turns sharing judging responsibilities. Morales and Simon Sherry-Wood did not appear this season and were replaced by Bryce Eilenberg. Like the previous two seasons, this one featured fourteen contestants competing for the title of \"America's Next Drag Superstar\", a one-year supply of Anastasia Beverly Hills cosmetics, and a cash prize of $100,000. The season premiere debuted with a live and same-day viewership of 348,000, a 20 percent increase from the previous season. On March 20, 2015, it was announced that Logo had given the series an early renewal for an eighth season. The winner of season 7 was Violet Chachki, with Katya winning Miss Congeniality.\r\nSeason 8 on began airing on March 7, 2016, with cast members announced during the NewNowNext Honors on February 1, 2016. Visage returned as a main judge, while Kressley and Mathews returned as rotating main judges. The first episode celebrated the 100th taping of the show, and the 100th drag queen to compete. Similar to season 2, this season had twelve contestants competing for the title of \"America's Next Drag Superstar\", a one-year supply of Anastasia Beverly Hills cosmetics, and a cash prize of $100,000. The winner of season 8 was Bob the Drag Queen, with Cynthia Lee Fontaine winning Miss Congeniality.\r\nSeasons 9–14 (2017–2022): VH1\r\nSeason 9 began airing on March 24, 2017 on VH1, with cast members being announced on February 2, 2017. Visage returned as a main judge, while Kressley and Mathews returned as rotating main judges. This season features fourteen contestants competing for the title of \"America's Next Drag Superstar\", a one-year supply of Anastasia Beverly Hills cosmetics, and a cash prize of $100,000. The ninth season aired on VH1, with encore presentations continuing to air on Logo. This season featured the return of Cynthia Lee Fontaine, who previously participated in the season 8. Season 9 featured a top four in the finale episode, as opposed to the top three, which was previously established in season 4. The winner of season 9 was Sasha Velour, with Valentina winning Miss Congeniality.\r\nSeason 10 began airing on March 22, 2018. Visage returned as a main judge, while Kressley and Mathews returned as rotating main judges. This season features thirteen new contestants, and one returning contestant, competing for the title of \"America's Next Drag Superstar\", a one-year supply of Anastasia Beverly Hills cosmetics, and a cash prize of $100,000. Eureka O'Hara, who was removed from the ninth season due to an injury, returned to the show after she accepted an open invitation. Season 10 premiered alongside the televised return of Untucked. The tenth season featured a top four following the previous season's finale format. The winner of season 10 was Aquaria, with Monét X Change winning Miss Congeniality.\r\nSeason 11 began airing February 28, 2019. This season had fifteen contestants, whereas previous seasons typically had fourteen contestants. Visage returned as a main judge, while Kressley and Mathews returned as rotating main judges. This season features fourteen new contestants, and one returning contestant, competing for the title of \"America's Next Drag Superstar\", a one-year supply of Anastasia Beverly Hills cosmetics, and a cash prize of $100,000. This season saw the return of Vanessa Vanjie Mateo, who was the first contestant eliminated in season 10. Season 11 again featured a top four in the finale. As with season 10, each week's episode was followed by an episode of the televised return of RuPaul's Drag Race: Untucked. The winner of season 11 was Yvie Oddly, with Nina West winning Miss Congeniality. On January 22, 2019, casting for Season 12 (2020) was announced via YouTube and Twitter and was closed on March 1, 2019. On August 19, 2019, it was announced that the series had been renewed for a twelfth season. The season began airing on February 28, 2020. This is the first and only season to have the reunion and finale recorded virtually from the contestants' homes due to the COVID-19 pandemic. The winner of season 12 was Jaida Essence Hall, with Heidi N Closet winning Miss Congeniality.\r\nOn December 2, 2019, casting for Season 13 (2021) was announced via YouTube and Twitter. The casting call closed on January 24, 2020. On August 20, 2020, it was announced the thirteenth season had been ordered by VH1. It began airing on January 1, 2021. The winner of season 13 was Symone, with Kandy Muse as runner-up, and LaLa Ri as Miss Congeniality.\r\nCasting for Season 14 began on November 23, 2020. In August 2021, it was announced the fourteenth season had been ordered by VH1. The cast for the fourteenth season was revealed through VH1 on December 2, 2021. The season started airing on January 7, 2022. The season welcomed Maddy Morphosis, the show's first heterosexual, cisgender male contestant. The season notably also featured five transgender contestants: Kerri Colby and Kornbread \"The Snack\" Jeté (both of whom entered the competition openly trans), Jasmine Kennedie (who came out as a trans woman during filming of the show), Bosco (who also came out as a trans woman as the season aired), and Willow Pill (who came out as trans femme as the season aired). The winner of season 14 was Willow Pill, with Lady Camden as runner-up, and Kornbread \"The Snack\" Jeté as Miss Congeniality. The winning queen received a cash prize of $150,000, the highest amount awarded to date in a regular season. The runner-up received a $50,000 cash prize.\r\nCasting for Season 15 began on November 4, 2021, and closed on January 7, 2022.\r\nSeason 15 (2023): MTV\r\nSeason 15 premiered on January 6, 2023, on MTV. This season features the largest cast in the show's history, with sixteen queens competing and the largest cash prize, with the winner earning $200,000. It is also the first season to feature biological relatives, twins Sugar and Spice. The winner of season 15 was Sasha Colby, with Anetra as runner-up, and Malaysia Babydoll Foxx as Miss Congeniality.\r\nContestants\r\nMore than 150 contestants have competed on the U.S. version of the show.\r\nSpin-offs\r\nSpecials\r\nRuPaul's Drag Race: Green Screen Christmas (2015): On December 13, 2015, Logo aired a seasonal themed episode of Drag Race. The non-competitive special was released in conjunction with RuPaul's holiday album Slay Belles and featured music videos for songs from the album. The cast included RuPaul, Michelle Visage, Siedah Garrett, and Todrick Hall, and former contestants Alyssa Edwards, Laganja Estranja, Latrice Royale, Raja, and Shangela.\r\nRuPaul's Drag Race Holi-slay Spectacular (2018): On November 1, 2018, VH1 announced a seasonal themed special episode of Drag Race scheduled to air on December 7, 2018. The special saw eight former contestants compete for the title of \"America's first Drag Race Christmas Queen\". Competitors included Eureka O'Hara, Jasmine Masters, Kim Chi, Latrice Royale, Mayhem Miller, Shangela, Sonique, and Trixie Mattel.\r\nRuPaul's Drag Race: Corona Can't Keep a Good Queen Down (2021): On February 26, 2021, the one hour special aired on VH1 in between episodes 8 and 9 of Season 13 and detailed the contestants' journeys with filming the season amid the ongoing COVID-19 pandemic.\r\nTelevision series\r\nRuPaul's Drag U (2010–2012): In each episode, three women are paired with former Drag Race contestants (\"Drag Professors\"), who give them drag makeovers and help them to access their \"inner divas\".\r\nRuPaul's Drag Race All Stars (2012–present): Past contestants return and compete for a spot in the Drag Race Hall of Fame. The show's format is similar to that of RuPaul's Drag Race, with challenges and a panel of judges.\r\nDancing Queen (2018): In April 2013, RuPaul confirmed that he planned to executive-produce a spin-off of Drag Race that stars season five and All Stars season two contestant Alyssa Edwards. Alyssa Edwards has confirmed that the spin-off's title is Beyond Belief (later retitled as Dancing Queen), and that his dance company in Mesquite, Texas is the setting. The series aired on Netflix on October 5, 2018.\r\nRuPaul's Secret Celebrity Drag Race (2020–Present): On April 10, 2020, VH1 announced a celebrity edition of Drag Race scheduled to air for four weeks beginning on April 24, 2020. The series featured a trio of celebrities receiving makeovers from former contestants. After receiving help from \"Queen Supremes\" Alyssa Edwards, Asia O'Hara, Bob the Drag Queen, Kim Chi, Monét X Change, Monique Heart, Nina West, Trinity the Tuck, Trixie Mattel and Vanessa Vanjie Mateo, the celebrities competed in fan-favorite challenges and on the runway to be named \"America's Next Celebrity Drag Race Superstar\" and prize money for choice charities.\r\nRuPaul's Drag Race: Vegas Revue (2020): On July 22, 2020, it was announced that a docu-series would premiere on August 21, 2020.\r\nInternational adaptations\r\nThe Switch Drag Race (2015–2018): This licensed glocalization of Drag Race premiered in October 2015 on Chilean television channel Mega. As in Drag Race, queens compete in \"mini-challenges\" and a main challenge and are evaluated by a panel of judges. Similar to Drag Race, The Switch requires contestants to lip-sync, dance, and perform impersonations.\r\nDrag Race Thailand (2018–present): In October 2017, Kantana Group acquired the rights to produce its own version of Drag Race. Season 1 of Drag Race Thailand was met with successful ratings on Thai television. It was later announced that the first season will premiere in the U.S. in May 2018. The first season also made stirs in the Asian LGBT community, the most prominent of which was a campaign to establish versions of Drag Race in the Philippines and Taiwan as well, two of the most LGBT-accepting nations in Asia.\r\nRuPaul's Drag Race UK (2019–present): On December 5, 2018, it was announced that the British version of RuPaul's Drag Race would be an eight-part series filmed in London based on local drag queens and would air on BBC Three in 2019. Visage confirmed via social media that she would appear as a judge.\r\nCanada's Drag Race (2020–present): On June 27, 2019, OutTV and Bell Media's streaming service Crave announced that they had co-commissioned a Canadian version of Drag Race. Rights to the series, as well as the U.S. and British versions, will be shared by OutTV and Crave. Additionally, season 11 runner-up Brooke Lynn Hytes was confirmed as one of the judges, becoming the first Drag Race contestant to serve as a permanent judge. The show premiered on July 2, 2020.\r\nDrag Race Holland (2020–2021): A Dutch version of Drag Race was announced on July 26, 2020. The series debuted on Videoland in The Netherlands, and aired on WOW Presents Plus internationally. The show is hosted by Fred van Leer and premiered September 18, 2020.\r\nRuPaul's Drag Race Down Under (2021–present): On August 26, 2019, an Oceanic version was announced to be in production and said to air in 2020, but was likely delayed due to the COVID-19 pandemic. Filming began in Auckland, New Zealand in January 2021. The series premiered on TVNZ 2 and TVNZ OnDemand in New Zealand, Stan in Australia, and on WOW Presents Plus internationally on 1 May 2021. The judging panel features RuPaul, Michelle Visage, and Rhys Nicholson.\r\nDrag Race España (2021–present): On November 16, 2020, Atresmedia announced that they would produce a Spanish version of Drag Race together with Buendía Estudios after reaching an agreement with Passion Distribution in favour of World of Wonder. The series debuted on Atresmedia's pay streaming service ATRESplayer Premium on 30 May 2021, and aired on WOW Presents Plus internationally. It is hosted by Supremme de Luxe.\r\nDrag Race Italia (2021–present): An Italian version of Drag Race was announced on June 30, 2021. The series debuted in November 2021 on Discovery+.\r\nDrag Race France (2022–present): On November 17, 2021, a French version of Drag Race was announced.\r\nDrag Race Philippines (2022–present): On August 17, 2021, a Filipino version of Drag Race was announced. The series debuted on August 17, 2022 on Discovery+ and HBO Go in the Philippines and aired on WOW Presents Plus internationally.\r\nDrag Race Belgique (2023): A Belgian version of Drag Race was announced on April 29, 2022 and is set to broadcast February 16, 2023 on Tipik and to stream on WOW Presents Plus internationally.\r\nDrag Race Sverige (2023): A Swedish version of Drag Race was announced on April 5, 2022 to broadcast on Sveriges Television and stream on WOW Presents Plus.\r\nDrag Race Brasil (TBA): Announced on December 12, 2022.\r\nDrag Race Mexico (TBA): Announced on December 12, 2022.\r\nDrag Race Germany (TBA): Announced on December 12, 2022.\r\nOther media\r\nFeature film: In August 2015, RuPaul revealed that a movie featuring all of the contestants was in the works. \"We've got a director for it, we've got a light script, but it just needs a little more retooling and scheduling.\"\r\nRuPaul's Drag Race Superstar is a mobile app by World of Wonder and Leaf Mobile's subsidiary East Side Games, which was released on October 25, 2021.\r\nHome media\r\nFull seasons of shows in the Drag Race franchise are available to stream on WOW Presents Plus in over 200 territories. The show is also currently available on the following streaming platforms:\r\nUnited States — Hulu (seasons 3–8; All Stars 1–4); Paramount Plus (seasons 1–12, All Stars 1–6, Untucked seasons 9–11, All Stars Untucked seasons 5–6), WOW Presents Plus (Untucked seasons 7–8, Thailand season 2, and all other international series)\r\nCanada — Netflix (seasons 1–12, All Stars 4, Untucked seasons 11 and 12), Crave (all seasons, All Stars 1–6, UK series 1–3, Canada season 1 and 2, Down Under season 1), WOW Presents Plus (seasons 1–10, Untucked seasons 1–10, All Stars 1–4)\r\nUK & Ireland — Netflix (seasons 11-13, Untucked seasons 11–13, All Stars 4-6, Celebrity season 1), BBC iPlayer (UK series 1,2 and 3, Canada season 1 and 2, Down Under season 1), WOW Presents Plus (seasons 1–10, Untucked seasons 1–10, all episodes of All Stars and Holland)\r\nAustralia — Stan (all seasons of original, All Stars, Untucked, UK, Canada, Down Under and Thailand Season 2), WOW Presents Plus (UK series 1, Canada season 1)\r\nAwards and nominations\r\nRuPaul's Drag Race has been nominated for thirty-nine Emmy Awards, and won twenty-four. It has also been nominated for nine Reality Television Awards, winning three, and nominated for six NewNowNext Awards, winning three.\r\nCritical reception\r\nThrillist called Drag Race \"the closest gay culture gets to a sports league\". In 2019, the TV series was ranked 93rd on The Guardian's list of the 100 best TV shows of the 21st century.\r\nShannon Keating for BuzzFeed News wrote about the show’s “subversive, irreverent beginnings” briefly turning “comfortably mainstream... humdrum and derivative” prior to season 13’s release. She recalls that a flurry of political disputes, as well as “overexposure”, threatened to ruin Drag Race’s legacy before the refreshed 2021 season.\r\nColeman Splide for The Daily Beast wrote in 2021 that “RuPaul has continually allowed the legacy of his subversive landmark reality show to be slowly chipped away at”. Though Splide states that the show is “a critical part of bringing empowering inclusivity to the forefront of mainstream culture”, he maintains that it also invites indignation from an ever-expanding and oftentimes toxic fanbase, as well as contributing to the increasingly capitalised nature of pride celebrations around the globe.\r\nControversy\r\nIn March 2014, Drag Race sparked controversy over the use of the term \"shemale\" in the season 6 mini challenge \"Female or She-male?\". Logo has since removed the segment from all platforms and addressed the allegations of transphobia by removing the \"You've got she-mail\" intro from new episodes of the series. This was replaced with, \"She done already done had herses!\"\r\nRuPaul additionally came under fire for comments made in an interview with The Guardian, in which he stated he would \"probably not\" allow a transgender contestant to compete. He compared transgender drag performers to doping athletes on his Twitter, and has since apologized. Sasha Velour (season 9) disagreed, tweeting \"My drag was born in a community full of trans women, trans men, and gender non-conforming folks doing drag. That's the real world of drag, like it or not. I thinks it's fabulous and I will fight my entire life to protect and uplift it\".\r\nRelationship with the trans community\r\nFor the first twelve seasons, RuPaul would say, \"Gentlemen, start your engines, and may the best woman win,\" before the contestants' runway looks for the episode were shown. When season 13 introduced the show's first ever transgender male contestant, Gottmik, RuPaul's catchphrase was changed in order to promote inclusivity: \"Racers, start your engines, and may the best drag queen win.\" In season 6 of All Stars, an altered version of the show's opening theme was introduced with the new tag line.\r\nPerformers of any sexual orientation and gender identity are eligible to audition, although most contestants to date have been gay, cisgender men. Transgender competitors have become more common as seasons have progressed; Sonique, a season two contestant, became the first openly trans contestant when she came out as a woman during the reunion special. Sonique later won All Stars 6, becoming the first trans woman to win an English-language version of the show and the second overall. Monica Beverly Hillz (season 5) became the first contestant to come out as a trans woman during the competition. Peppermint (season 9) is the first contestant who was out as a trans woman prior to the airing of her season. Other trans contestants came out as women after their elimination, including Carmen Carrera, Kenya Michaels, Stacy Layne Matthews, Jiggly Caliente, Gia Gunn, Laganja Estranja and Gigi Goode. Additionally, Gottmik (season 13) was the first AFAB and currently the only openly transgender male contestant in the franchise's history. Various contestants have come out as non-binary as well, including Jinkx Monsoon and Adore Delano.\r\nSeason 14 is the first regular season to feature five transgender women in the cast—Kerri Colby, Kornbread \"The Snack\" Jeté, Bosco, Jasmine Kennedie, and Willow Pill. While Kerri Colby and Kornbread entered the show openly trans, Bosco and Willow came out after the show's taping, and Jasmine Kennedie came out in episode 7 of Untucked.\r\nBroadcast\r\nAustralia: In Australia, lifestyle channel LifeStyle YOU regularly showed and re-screened seasons 1–7, including Untucked. In addition, free-to-air channel SBS2 began screening the first season on August 31, 2013. On March 13, 2017, it was announced that on-demand service Stan would fast-track season 9 (including Untucked). As of 2020, Stan streams all seasons since Season 1, as well as Untucked, All Stars, All Stars Untucked, Canada's Drag Race, Secret Celebrity, Drag Race UK and Season 2 of Drag Race Thailand.\r\nCanada: The series airs on OutTV in Canada at the same time as the US airing. Unlike Logo, OutTV continues to broadcast Untucked immediately after each Drag Race episode. Beginning with season 12, OutTV has shared its first-run rights to the main series (but not Untucked) with the more widely subscribed Crave streaming service, with episodes available on Crave shortly after they premiere on OutTV, in connection with Crave and OutTV's co-production of Canada's Drag Race. Past seasons are also available on Netflix in Canada, with each season released there shortly before the next season begins.\r\nIreland: In Ireland, season 2 to season 8 of the programme were available on Netflix; as of the release of Season 10, only seasons 8 & 9 are available. Netflix has started airing season 10 episodes one day after they air in the USA. All seasons of the show have been made available on Netflix since October 2018\r\nIndonesia: In Indonesia, season 1 to season 13 of the programme were available on Netflix, alongside the Christmas spectacular; As of the release of All Stars, only season 4 and 5 is available. Netflix also aired Untucked season 10 episodes one day after they air in the USA.\r\nUK: E4 aired season 1 in 2009, followed by season 2 in 2010. Since its success on Netflix in the UK, TruTV acquired the broadcast rights for all eight seasons of the show including Untucked episodes. In June 2015, TruTV started airing two episodes of the show a week, starting with season 4, followed by All Stars, then season 5. As of May 2018, the series airs on VH1 UK Monday–Thursday at 11pm, beginning with All Stars season 3.\r\nIsrael: Yes has broadcast all seasons and Untucked episodes. Seasons 1–12, All Stars seasons 4–5 and Untucked seasons 11–12 are also available on Netflix.\r\nDiscography",
    "html": "<p>RuPaul's Drag Race is an American reality competition television series, the first in the Drag Race franchise, produced by World of Wonder for Logo TV (season 1–8), WOW Presents Plus, VH1 (season 9–14) and, beginning with the fifteenth season, MTV. The show documents RuPaul in the search for \"America's next drag superstar\". RuPaul plays the role of host, mentor, and head judge for this series, as contestants are given different challenges each week. Contestants are judged by a panel that includes RuPaul, Michelle Visage, an alternating third main judge of either Carson Kressley, Ross Mathews, or Ts Madison, and one or more guest judges, who critique their progress throughout the competition. The title of the show is a play on drag queen and drag racing, and the title sequence and song \"Drag Race\" both have a drag-racing theme.</p><p>RuPaul's Drag Race has spanned fifteen seasons and inspired the spin-off shows RuPaul's Drag U, RuPaul's Drag Race All Stars, and RuPaul's Secret Celebrity Drag Race; the companion series RuPaul's Drag Race: Untucked; and numerous international franchises including British and Australian and New Zealand versions hosted by RuPaul as well as Chilean, Thai, Canadian, Dutch, Spanish, Italian, French, Philippine, Belgian, and Swedish editions, upcoming Mexican, German, and Brazilian installments, and international vs. the World competitions hosted in The United Kingdom and Canada.</p><p>The show has become the highest-rated television program on Logo TV, and airs internationally, including in the United Kingdom, Australia, Canada, the Netherlands and Israel. The show earned RuPaul seven consecutive Emmy Awards (2016 to 2022) for Outstanding Host for a Reality or Competition Program. The show itself has been awarded as the Primetime Emmy Award for Outstanding Reality-Competition Program 4 consecutive times (2018 to 2021), and the Outstanding Reality Program Award at the GLAAD Media Awards. It has been nominated for four Critics' Choice Television Awards including Best Reality Series – Competition and Best Reality Show Host for RuPaul, and was nominated for a Creative Arts Emmy Award for Outstanding Make-up for a Multi-Camera Series or Special (Non-Prosthetic). Later in 2018, the show became the first show to win a Primetime Emmy Award for Outstanding Reality-Competition Program and a Primetime Emmy Award for Outstanding Host for a Reality or Reality-Competition Program in the same year, a feat it has since repeated three times.</p><br/><h3>Format</h3><p>Prospective Drag Race contestants submit video auditions to the show's production company, World of Wonder. RuPaul, the host and head judge, views each tape and selects the season's competitors. Once the chosen pool of performers is on set, they film a series of episodes in which they compete against each other in various challenges. Each episode typically concludes with the removal of one contestant from the competition. Rarely, the outcome of an episode has been a double elimination, no elimination, contestant disqualification or removal of a contestant on medical grounds. Each episode features a so-called maxi challenge that tests competitors' skills in a variety of areas of drag performance. Some episodes also feature a mini challenge, the prize of which is often an advantage or benefit in the upcoming maxi challenge. Following the maxi challenge, contestants present themed looks in a runway walk. RuPaul and a panel of judges then critique each contestant's performance, deliberate amongst themselves, and announce the week's winner and bottom two competitors. The bottom two queens compete in a so-called Lip Sync for Your Life; the winner of the lip sync remains in the competition, and the loser is eliminated. Generally, the contestant that the judges feel has displayed the most \"charisma, uniqueness, nerve and talent\" (C.U.N.T.) is the one who advances. The final three, or four depending on what RuPaul chooses, contestants remaining compete in a special finale episode wherein the season's winner is crowned. In early seasons, the finale was pre-recorded in the studio with no audience. More recently, the finale has taken the form of a lip sync tournament before a live audience. The season 12 finale was filmed remotely due to the COVID-19 pandemic. The whole season is typically filmed in four weeks.</p><h4>Mini and maxi challenges</h4><p>Mini challenges are quick, small assignments that RuPaul announces at the beginning of an episode. One of the most popular mini challenges, which recurs from season to season, is the reading challenge. In it, contestants satirically criticize one another in a process called \"reading\", which was popularized by the film Paris Is Burning. Maxi challenges vary in the skill they test; some are group challenges that involve singing and acting, while others feature comedy, a talent of choice, dancing, or makeovers. The winner receives a material or monetary prize. Until the show's sixth season, the winner sometimes also received immunity against elimination the following week. Drag Race's most popular seasonal maxi challenge is Snatch Game, a spoof on Match Game wherein contestants impersonate celebrities or famous fictional personas.</p><h4>Judging</h4><p>RuPaul has been the series' head judge since its premiere. For the first two seasons, Merle Ginsberg joined him on the panel; she was replaced in season 3 by longtime friend of RuPaul and co-host of The RuPaul Show Michelle Visage. Santino Rice served as a judge from season 1 through season 6. From season 7 onward, Ross Mathews and Carson Kressley have occupied Rice's former seat. New York City makeup artist Billy B held a regular judging spot in the third and fourth seasons when Rice was absent. Most weeks, one or two celebrity guest judges join the panel. After appearing as a recurring guest judge in seasons 13 and 14, Ts Madison became a regular member of the judging panel from the fifteenth season.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><b>Judges on <i>RuPaul's Drag Race</i></b></caption><tbody><tr><th rowspan=\"2\" style=\"width:15%;\" scope=\"col\">Judge</th><th colspan=\"15\">Season</th></tr><tr><th style=\"width:5%;\" scope=\"colspan\"><span>1</span></th><th style=\"width:5%;\" scope=\"colspan\"><span>2</span></th><th style=\"width:5%;\" scope=\"colspan\"><span>3</span></th><th style=\"width:5%;\" scope=\"colspan\"><span>4</span></th><th style=\"width:5%;\" scope=\"colspan\"><span>5</span></th><th style=\"width:5%;\" scope=\"colspan\"><span>6</span></th><th style=\"width:5%;\" scope=\"colspan\"><span>7</span></th><th style=\"width:5%;\" scope=\"colspan\"><span>8</span></th><th style=\"width:5%;\" scope=\"colspan\"><span>9</span></th><th style=\"width:5%;\" scope=\"colspan\"><span>10</span></th><th style=\"width:5%;\" scope=\"colspan\"><span>11</span></th><th style=\"width:5%;\" scope=\"colspan\"><span>12</span></th><th style=\"width:5%;\" scope=\"colspan\"><span>13</span></th><th style=\"width:5%;\" scope=\"colspan\"><span>14</span></th><th style=\"width:5%;\" scope=\"colspan\"><span>15</span></th></tr><tr><th scope=\"row\" style=\"text-align: center;\"><span>RuPaul</span></th><td colspan=\"15\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><th scope=\"row\" style=\"text-align: center;\"><span class=\"nowrap\"><span>Merle Ginsberg</span></span></th><td colspan=\"2\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td><td colspan=\"4\" data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\"></td><td colspan=\"1\" style=\"background: #DEF; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Guest</span></td><td colspan=\"8\" data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\"></td></tr><tr><th scope=\"row\" style=\"text-align: center;\"><span>Santino Rice</span></th><td colspan=\"6\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td><td colspan=\"1\" style=\"background: #DEF; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Guest</span></td><td colspan=\"8\" data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\"></td></tr><tr><th scope=\"row\" style=\"text-align: center;\"><span class=\"nowrap\"><span>Michelle Visage</span></span></th><td colspan=\"2\" data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\"></td><td colspan=\"13\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><th scope=\"row\" style=\"text-align: center;\">Billy B</th><td colspan=\"2\" data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\"></td><td colspan=\"2\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td><td colspan=\"11\" data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\"></td></tr><tr><th scope=\"row\" style=\"text-align: center;\"><span>Ross Mathews</span></th><td colspan=\"3\" data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\"></td><td colspan=\"1\" style=\"background: #DEF; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Guest</span></td><td colspan=\"2\" data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\"></td><td colspan=\"9\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><th scope=\"row\" style=\"text-align: center;\"><span class=\"nowrap\"><span>Carson Kressley</span></span></th><td colspan=\"6\" data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\"></td><td colspan=\"9\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr><tr><th scope=\"row\" style=\"text-align: center;\"><span class=\"nowrap\"><span>Ts Madison</span></span></th><td colspan=\"12\" data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\"></td><td colspan=\"2\" style=\"background: #DEF; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Guest</span></td><td colspan=\"1\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-cast\"><span>Main</span></td></tr></tbody></table><h4>Companion series</h4><p>The first season of Drag Race was accompanied by a seven-episode web series titled Under the Hood of RuPaul's Drag Race, which Logo TV made available for streaming on its website. The series featured behind-the-scenes and deleted footage from the main show's tapes. From season 2 onward, a companion show called RuPaul's Drag Race: Untucked, which has the same premise, has aired instead. Untucked largely focuses on conversations and drama that occur between contestants backstage while the judges deliberate on each episode's results. In most seasons, it has aired on TV following the main show, but it was available only online for season 7 through season 9. A number of smaller web series also accompany each episode of Drag Race. Whatcha Packin', which began at the start of the sixth season, features Michelle Visage interviewing the most recently eliminated queen about their run on the show and showcasing runway outfits they had brought but did not have the opportunity to wear. In 2014, the web-series Fashion Photo Ruview aired for the first time, co-hosted by Raja Gemini and Raven who evaluate the runway looks of the main show. Since season 8, a five- to fifteen-minute (later eighteen- to thirty-minute) aftershow called The Pit Stop has also been produced. It involves a host and guest, typically past competitors of Drag Race, discussing the recently aired episode. Each season's host (or hosts) are different; to date, these have included the YouTuber Kingsley, Raja Gemini, Bob the Drag Queen, Alaska Thunderfuck, Trixie Mattel, Manila Luzon, Monét X Change, and Bianca Del Rio.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Companion series</caption><tbody><tr><th>Show</th><th>Hosts</th></tr><tr><td>Fashion Photo RuView</td><td>Raja and Raven</td></tr><tr><td>The Pit Stop</td><td nowrap=\"\">Various</td></tr><tr><td>Whatcha Packin'</td><td>Michelle Visage</td></tr><tr><td>Extra Lap Recap</td><td>John Polly</td></tr></tbody></table><br/><h3>Series overview</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><i>RuPaul's Drag Race</i> series overview</caption><tbody><tr style=\"height: 4em;\"><th>Season</th><th>Premiere</th><th>Finale</th><th>Winner</th><th>Runner(s)-up</th><th>Miss Congeniality</th><th><span class=\"nowrap\">No. of contestants</span></th><th>Winner's prizes</th></tr><tr><th><span>1</span></th><td>February 2, 2009</td><td nowrap=\"\">March 23, 2009</td><td><b><span>BeBe Zahara Benet</span></b></td><td colspan=\"2\"><span>Nina Flowers</span></td><td>9</td><td><ul><li>$20,000 courtesy of the <span>V&amp;S Group</span> and <span>MAC Cosmetics</span></li><li>Top billing in <i><span>Logo TV</span>'s Drag Race Tour</i></li><li>Appearance in an advertising campaign for L.A. Eyeworks</li><li>Photo-spread in <i><span>Paper</span></i> magazine</li><li>Crown from <i>Fierce Drag Jewels</i></li></ul></td></tr><tr style=\"background: #D0E6FF;\"><th><span>2</span></th><td>February 1, 2010</td><td>April 26, 2010</td><td><b><span>Tyra Sanchez</span></b></td><td><span>Raven</span></td><td><span>Pandora Boxx</span></td><td>12</td><td><ul><li>$25,000</li><li>Lifetime supply of <i><span class=\"mw-redirect\">NYX</span></i> cosmetics and be the face of <i>NYXCosmetics.com</i></li><li>Top billing in <i>Logo TV's Drag Race Tour</i></li><li>Appearance in an advertising campaign for L.A. Eyeworks</li><li>One-year contract with Project Publicity</li><li>Crown from <i>Fierce Drag Jewels</i></li></ul></td></tr><tr><th><span>3</span></th><td>January 24, 2011</td><td>May 2, 2011</td><td><b><span>Raja</span></b></td><td><span>Manila Luzon</span></td><td><span>Yara Sofia</span></td><td>13</td><td><ul><li>$75,000</li><li>Lifetime supply of <i><span>Kryolan</span></i> cosmetics</li><li>Top billing in <i>Logo TV's Drag Race Tour</i></li><li>Crown from <i>Fierce Drag Jewels</i></li></ul></td></tr><tr style=\"background: #D0E6FF;\"><th><span>4</span></th><td>January 30, 2012</td><td>April 30, 2012</td><td><b><span>Sharon Needles</span></b></td><td><span>Chad Michaels</span><br><span class=\"mw-redirect\">Phi Phi O'Hara</span></td><td><span>Latrice Royale</span></td><td>13</td><td><ul><li>$100,000</li><li>Lifetime supply of <i>NYX</i> cosmetics</li><li>Top billing in <i>Logo TV's Drag Race Tour</i></li><li>Holiday courtesy of <i>ALandCHUCK.travel</i></li><li>Crown from <i>Fierce Drag Jewels</i></li></ul></td></tr><tr><th><span>5</span></th><td>January 28, 2013</td><td>May 6, 2013</td><td><b><span>Jinkx Monsoon</span></b></td><td><span>Alaska</span><br><span>Roxxxy Andrews</span></td><td><span>Ivy Winters</span></td><td>14</td><td><ul><li>$100,000</li><li>Collection of <i>ColorEvolution</i> cosmetics</li><li>Top billing in <i>Logo TV's Drag Race Tour</i></li><li>Holiday courtesy of <i>ALandCHUCK.travel</i></li><li>Crown from <i>Fierce Drag Jewels</i></li></ul></td></tr><tr style=\"background: #D0E6FF;\"><th><span>6</span></th><td>February 24, 2014</td><td>May 19, 2014</td><td><b><span>Bianca Del Rio</span></b></td><td><span>Adore Delano</span><br><span>Courtney Act</span></td><td><span>BenDeLaCreme</span></td><td>14</td><td><ul><li>$100,000</li><li>Collection of <i>ColorEvolution</i> cosmetics</li><li>Crown from <i>Fierce Drag Jewels</i></li></ul></td></tr><tr style=\"height: 67px;\"><th><span>7</span></th><td>March 2, 2015</td><td>June 1, 2015</td><td><b><span>Violet Chachki</span></b></td><td><span>Ginger Minj</span><br><span>Pearl</span></td><td><span>Katya</span></td><td>14</td><td><ul><li>$100,000</li><li>One-year supply of <i><span>Anastasia Beverly Hills</span></i> cosmetics</li><li>Crown and scepter from <i>Fierce Drag Jewels</i></li></ul></td></tr><tr style=\"background: #D0E6FF;\"><th><span>8</span></th><td>March 7, 2016</td><td>May 16, 2016</td><td nowrap=\"\"><b><span>Bob the Drag Queen</span></b></td><td><span>Kim Chi</span><br><span>Naomi Smalls</span></td><td nowrap=\"\"><span>Cynthia Lee Fontaine</span></td><td>12</td><td><ul><li>$100,000</li><li>One-year supply of <i><span>Anastasia Beverly Hills</span></i> cosmetics</li><li>Crown and scepter from <i>Fierce Drag Jewels</i></li></ul></td></tr><tr style=\"height: 67px;\"><th><span>9</span></th><td>March 24, 2017</td><td>June 23, 2017</td><td><b><span>Sasha Velour</span></b></td><td><span class=\"mw-redirect\">Peppermint</span></td><td><span>Valentina</span></td><td>14</td><td><ul><li>$100,000</li><li>A one-year supply of <i><span>Anastasia Beverly Hills</span></i> cosmetics</li><li>Crown and scepter from <i>Shandar</i></li></ul></td></tr><tr style=\"background: #D0E6FF;\"><th><span>10</span></th><td>March 22, 2018</td><td>June 28, 2018</td><td><b><span>Aquaria</span></b></td><td><span>Eureka O'Hara</span><br><span>Kameron Michaels</span></td><td><span>Monét X Change</span></td><td>14</td><td><ul><li>$100,000</li><li>One-year supply of <i><span>Anastasia Beverly Hills</span></i> cosmetics</li><li>Crown and scepter from <i>Fierce Drag Jewels</i></li></ul></td></tr><tr style=\"height: 67px;\"><th><span>11</span></th><td>February 28, 2019</td><td>May 30, 2019</td><td><b><span>Yvie Oddly</span></b></td><td nowrap=\"\"><span>Brooke Lynn Hytes</span></td><td><span>Nina West</span></td><td>15</td><td><ul><li>$100,000</li><li>One-year supply of <i><span>Anastasia Beverly Hills</span></i> cosmetics</li><li>Crown and scepter from <i>Fierce Drag Jewels</i></li></ul></td></tr><tr style=\"background: #D0E6FF;\"><th><span>12</span></th><td nowrap=\"\">February 28, 2020</td><td>May 29, 2020</td><td><b><span>Jaida Essence Hall</span></b></td><td><span>Crystal Methyd</span><br><span>Gigi Goode</span></td><td><span>Heidi N Closet</span></td><td>13</td><td><ul><li>$100,000</li><li>One-year supply of <i><span>Anastasia Beverly Hills</span></i> cosmetics</li><li>Crown and scepter from <i>Fierce Drag Jewels</i></li></ul></td></tr><tr style=\"height: 67px;\"><th><span>13</span></th><td>January 1, 2021</td><td>April 23, 2021</td><td><b><span>Symone</span></b></td><td><span>Kandy Muse</span></td><td><span>LaLa Ri</span></td><td>13</td><td><ul><li>$100,000</li><li>One-year supply of <i><span>Anastasia Beverly Hills</span></i> cosmetics</li><li>Crown and scepter from <i>Fierce Drag Jewels</i></li></ul></td></tr><tr style=\"background: #D0E6FF;\"><th><span>14</span></th><td>January 7, 2022</td><td>April 22, 2022</td><td><b><span>Willow Pill</span></b></td><td><span>Lady Camden</span></td><td nowrap=\"\"><span>Kornbread<br>\"The Snack\" Jeté</span></td><td>14</td><td><ul><li>$150,000, powered by <span>Cash App</span></li><li>One-year supply of <i><span>Anastasia Beverly Hills</span></i> cosmetics</li><li>Crown and scepter from <i>Fierce Drag Jewels</i></li></ul></td></tr><tr style=\"height: 67px;\"><th><span>15</span></th><td>January 6, 2023</td><td>April 14, 2023</td><td><b><span>Sasha Colby</span></b></td><td><span>Anetra</span></td><td nowrap=\"\">Malaysia Babydoll Foxx</td><td>16</td><td><ul><li>$200,000, powered by <span>Cash App</span></li><li>One-year supply of <i><span>Anastasia Beverly Hills</span></i> cosmetics</li><li>Crown and scepter from <i>Fierce Drag Jewels</i></li></ul></td></tr></tbody></table><h4>Seasons 1–8 (2009–2016): Logo TV</h4><p>Season 1 premiered in the U.S. on February 2, 2009, on Logo TV. Nine contestants competed to become \"America's Next Drag Superstar\". The winner won a lifetime supply of MAC Cosmetics, was featured on the cover of Paper and in an LA Eyeworks campaign, joined the Absolut Pride tour, and won a cash prize of $20,000. One of the nine, Nina Flowers, was determined by an audience vote via the show's official website. The winner of season 1 was BeBe Zahara Benet, with Nina Flowers winning Miss Congeniality. In late 2013, Logo re-aired the season as RuPaul's Drag Race: The Lost Season Ru-Vealed, featuring commentary from RuPaul.</p><p>For season 2 (2010), 12 contestants competed for a lifetime supply of NYX Cosmetics and be the face of nyxcosmetics.com, an exclusive one year public relations contract with LGBT firm Project Publicity, be featured in an LA Eyeworks campaign, join the Logo Drag Race Tour, and a cash prize of $25,000. A new tradition of writing a farewell message in lipstick on the workstation mirror was started by the first eliminated queen, Shangela. Each week's episode is followed by a behind-the-scenes show, RuPaul's Drag Race Untucked. The winner of season 2 was Tyra Sanchez, with Pandora Boxx winning Miss Congeniality. On December 6, 2011, Amazon.com released season 2 on DVD via the CreateSpace program.</p><p>Season 3 (2011) had Michelle Visage replacing Merle Ginsberg on the judging panel as well as Billy Brasfield (commonly known as Billy B), Mike Ruiz, and Jeffrey Moran (courtesy of Absolut Vodka) filling in for Santino Rice's absence during several episodes. Due to Billy B's continued appearances, he and Rice are considered to have been alternate judges for the same seat on judges panel. Other changes made included the introduction of a wildcard contestant from the past season, Shangela; an episode with no elimination; and a contestant, Carmen Carrera, being brought back into the competition after having been eliminated a few episodes prior. A new pit crew was also introduced consisting of Jason Carter and Shawn Morales. As with the previous season, each week's episode was followed by a behind-the-scenes show, RuPaul's Drag Race: Untucked. The winner of the season 3 was Raja, with Yara Sofia winning Miss Congeniality. On December 6, 2011, Amazon.com released this season on DVD via their CreateSpace program.</p><p>Season 4 began airing on January 30, 2012, with cast members announced November 13, 2011. The winner headlined Logo's Drag Race Tour featuring Absolut Vodka, won a one-of-a-kind trip, a lifetime supply of NYX Cosmetics, a cash prize of $100,000, and the title of \"America's Next Drag Superstar\". Like the previous season, Rice and Billy B (Billy Brasfield), shared the same seat at the judges table alternatively, with Brasfield filling in for Rice when needed. The winner of season 4 was Sharon Needles, with Latrice Royale winning Miss Congeniality.</p><p>Season 5 began airing on January 28, 2013, with a 90-minute premiere episode. Fourteen contestants competed for the title of \"America's Next Drag Superstar\" along with a lifetime supply of Colorevolution Cosmetics, a one-of-a-kind trip courtesy of AlandChuck.travel, a headlining spot on Logo's Drag Race Tour featuring Absolut Vodka and a cash prize of $100,000. Rice and Visage were back as judges on the panel. The winner of season 5 was Jinkx Monsoon, with Ivy Winters winning Miss Congeniality.</p><p>Season 6 began airing February 24, 2014. Like season 5, season 6 saw 14 contestants competing for the title of \"America's Next Drag Superstar\". For the first time in the show's history, the season premiere was split into two episodes; the fourteen queens are split into two groups and the seven queens in each group compete against one another before being united as one group in the third episode. Rice and Visage returned as judges at the panel. Two new pit crew members, Miles Moody and Simon Sherry-Wood, joined Carter and Morales. The winner won a prize package that included a supply from Colorevolution Cosmetics and a cash prize of $100,000. The winner of season 6 was Bianca Del Rio, with BenDeLaCreme winning Miss Congeniality.</p><p>Season 7 began airing on March 2, 2015. Returning judges included RuPaul and Visage, while the space previously occupied by Rice was filled by new additions Ross Mathews and Carson Kressley. Mathews and Kressley were both present for the season premiere and then took turns sharing judging responsibilities. Morales and Simon Sherry-Wood did not appear this season and were replaced by Bryce Eilenberg. Like the previous two seasons, this one featured fourteen contestants competing for the title of \"America's Next Drag Superstar\", a one-year supply of Anastasia Beverly Hills cosmetics, and a cash prize of $100,000. The season premiere debuted with a live and same-day viewership of 348,000, a 20 percent increase from the previous season. On March 20, 2015, it was announced that Logo had given the series an early renewal for an eighth season. The winner of season 7 was Violet Chachki, with Katya winning Miss Congeniality.</p><p>Season 8 on began airing on March 7, 2016, with cast members announced during the NewNowNext Honors on February 1, 2016. Visage returned as a main judge, while Kressley and Mathews returned as rotating main judges. The first episode celebrated the 100th taping of the show, and the 100th drag queen to compete. Similar to season 2, this season had twelve contestants competing for the title of \"America's Next Drag Superstar\", a one-year supply of Anastasia Beverly Hills cosmetics, and a cash prize of $100,000. The winner of season 8 was Bob the Drag Queen, with Cynthia Lee Fontaine winning Miss Congeniality.</p><h4>Seasons 9–14 (2017–2022): VH1</h4><p>Season 9 began airing on March 24, 2017 on VH1, with cast members being announced on February 2, 2017. Visage returned as a main judge, while Kressley and Mathews returned as rotating main judges. This season features fourteen contestants competing for the title of \"America's Next Drag Superstar\", a one-year supply of Anastasia Beverly Hills cosmetics, and a cash prize of $100,000. The ninth season aired on VH1, with encore presentations continuing to air on Logo. This season featured the return of Cynthia Lee Fontaine, who previously participated in the season 8. Season 9 featured a top four in the finale episode, as opposed to the top three, which was previously established in season 4. The winner of season 9 was Sasha Velour, with Valentina winning Miss Congeniality.</p><p>Season 10 began airing on March 22, 2018. Visage returned as a main judge, while Kressley and Mathews returned as rotating main judges. This season features thirteen new contestants, and one returning contestant, competing for the title of \"America's Next Drag Superstar\", a one-year supply of Anastasia Beverly Hills cosmetics, and a cash prize of $100,000. Eureka O'Hara, who was removed from the ninth season due to an injury, returned to the show after she accepted an open invitation. Season 10 premiered alongside the televised return of Untucked. The tenth season featured a top four following the previous season's finale format. The winner of season 10 was Aquaria, with Monét X Change winning Miss Congeniality.</p><p>Season 11 began airing February 28, 2019. This season had fifteen contestants, whereas previous seasons typically had fourteen contestants. Visage returned as a main judge, while Kressley and Mathews returned as rotating main judges. This season features fourteen new contestants, and one returning contestant, competing for the title of \"America's Next Drag Superstar\", a one-year supply of Anastasia Beverly Hills cosmetics, and a cash prize of $100,000. This season saw the return of Vanessa Vanjie Mateo, who was the first contestant eliminated in season 10. Season 11 again featured a top four in the finale. As with season 10, each week's episode was followed by an episode of the televised return of RuPaul's Drag Race: Untucked. The winner of season 11 was Yvie Oddly, with Nina West winning Miss Congeniality. On January 22, 2019, casting for Season 12 (2020) was announced via YouTube and Twitter and was closed on March 1, 2019. On August 19, 2019, it was announced that the series had been renewed for a twelfth season. The season began airing on February 28, 2020. This is the first and only season to have the reunion and finale recorded virtually from the contestants' homes due to the COVID-19 pandemic. The winner of season 12 was Jaida Essence Hall, with Heidi N Closet winning Miss Congeniality.</p><p>On December 2, 2019, casting for Season 13 (2021) was announced via YouTube and Twitter. The casting call closed on January 24, 2020. On August 20, 2020, it was announced the thirteenth season had been ordered by VH1. It began airing on January 1, 2021. The winner of season 13 was Symone, with Kandy Muse as runner-up, and LaLa Ri as Miss Congeniality.</p><p>Casting for Season 14 began on November 23, 2020. In August 2021, it was announced the fourteenth season had been ordered by VH1. The cast for the fourteenth season was revealed through VH1 on December 2, 2021. The season started airing on January 7, 2022. The season welcomed Maddy Morphosis, the show's first heterosexual, cisgender male contestant. The season notably also featured five transgender contestants: Kerri Colby and Kornbread \"The Snack\" Jeté (both of whom entered the competition openly trans), Jasmine Kennedie (who came out as a trans woman during filming of the show), Bosco (who also came out as a trans woman as the season aired), and Willow Pill (who came out as trans femme as the season aired). The winner of season 14 was Willow Pill, with Lady Camden as runner-up, and Kornbread \"The Snack\" Jeté as Miss Congeniality. The winning queen received a cash prize of $150,000, the highest amount awarded to date in a regular season. The runner-up received a $50,000 cash prize.</p><p>Casting for Season 15 began on November 4, 2021, and closed on January 7, 2022.</p><h4>Season 15 (2023): MTV</h4><p>Season 15 premiered on January 6, 2023, on MTV. This season features the largest cast in the show's history, with sixteen queens competing and the largest cash prize, with the winner earning $200,000. It is also the first season to feature biological relatives, twins Sugar and Spice. The winner of season 15 was Sasha Colby, with Anetra as runner-up, and Malaysia Babydoll Foxx as Miss Congeniality.</p><br/><h3>Contestants</h3><p>More than 150 contestants have competed on the U.S. version of the show.</p><br/><h3>Spin-offs</h3><h4>Specials</h4><ul><li>RuPaul's Drag Race: Green Screen Christmas (2015): On December 13, 2015, Logo aired a seasonal themed episode of Drag Race. The non-competitive special was released in conjunction with RuPaul's holiday album Slay Belles and featured music videos for songs from the album. The cast included RuPaul, Michelle Visage, Siedah Garrett, and Todrick Hall, and former contestants Alyssa Edwards, Laganja Estranja, Latrice Royale, Raja, and Shangela.</li><li>RuPaul's Drag Race Holi-slay Spectacular (2018): On November 1, 2018, VH1 announced a seasonal themed special episode of Drag Race scheduled to air on December 7, 2018. The special saw eight former contestants compete for the title of \"America's first Drag Race Christmas Queen\". Competitors included Eureka O'Hara, Jasmine Masters, Kim Chi, Latrice Royale, Mayhem Miller, Shangela, Sonique, and Trixie Mattel.</li><li>RuPaul's Drag Race: Corona Can't Keep a Good Queen Down (2021): On February 26, 2021, the one hour special aired on VH1 in between episodes 8 and 9 of Season 13 and detailed the contestants' journeys with filming the season amid the ongoing COVID-19 pandemic.</li></ul><h4>Television series</h4><ul><li>RuPaul's Drag U (2010–2012): In each episode, three women are paired with former Drag Race contestants (\"Drag Professors\"), who give them drag makeovers and help them to access their \"inner divas\".</li><li>RuPaul's Drag Race All Stars (2012–present): Past contestants return and compete for a spot in the Drag Race Hall of Fame. The show's format is similar to that of RuPaul's Drag Race, with challenges and a panel of judges.</li><li>Dancing Queen (2018): In April 2013, RuPaul confirmed that he planned to executive-produce a spin-off of Drag Race that stars season five and All Stars season two contestant Alyssa Edwards. Alyssa Edwards has confirmed that the spin-off's title is Beyond Belief (later retitled as Dancing Queen), and that his dance company in Mesquite, Texas is the setting. The series aired on Netflix on October 5, 2018.</li><li>RuPaul's Secret Celebrity Drag Race (2020–Present): On April 10, 2020, VH1 announced a celebrity edition of Drag Race scheduled to air for four weeks beginning on April 24, 2020. The series featured a trio of celebrities receiving makeovers from former contestants. After receiving help from \"Queen Supremes\" Alyssa Edwards, Asia O'Hara, Bob the Drag Queen, Kim Chi, Monét X Change, Monique Heart, Nina West, Trinity the Tuck, Trixie Mattel and Vanessa Vanjie Mateo, the celebrities competed in fan-favorite challenges and on the runway to be named \"America's Next Celebrity Drag Race Superstar\" and prize money for choice charities.</li><li>RuPaul's Drag Race: Vegas Revue (2020): On July 22, 2020, it was announced that a docu-series would premiere on August 21, 2020.</li></ul><h4>International adaptations</h4><ul><li>The Switch Drag Race (2015–2018): This licensed glocalization of Drag Race premiered in October 2015 on Chilean television channel Mega. As in Drag Race, queens compete in \"mini-challenges\" and a main challenge and are evaluated by a panel of judges. Similar to Drag Race, The Switch requires contestants to lip-sync, dance, and perform impersonations.</li><li>Drag Race Thailand (2018–present): In October 2017, Kantana Group acquired the rights to produce its own version of Drag Race. Season 1 of Drag Race Thailand was met with successful ratings on Thai television. It was later announced that the first season will premiere in the U.S. in May 2018. The first season also made stirs in the Asian LGBT community, the most prominent of which was a campaign to establish versions of Drag Race in the Philippines and Taiwan as well, two of the most LGBT-accepting nations in Asia.</li><li>RuPaul's Drag Race UK (2019–present): On December 5, 2018, it was announced that the British version of RuPaul's Drag Race would be an eight-part series filmed in London based on local drag queens and would air on BBC Three in 2019. Visage confirmed via social media that she would appear as a judge.</li><li>Canada's Drag Race (2020–present): On June 27, 2019, OutTV and Bell Media's streaming service Crave announced that they had co-commissioned a Canadian version of Drag Race. Rights to the series, as well as the U.S. and British versions, will be shared by OutTV and Crave. Additionally, season 11 runner-up Brooke Lynn Hytes was confirmed as one of the judges, becoming the first Drag Race contestant to serve as a permanent judge. The show premiered on July 2, 2020.</li><li>Drag Race Holland (2020–2021): A Dutch version of Drag Race was announced on July 26, 2020. The series debuted on Videoland in The Netherlands, and aired on WOW Presents Plus internationally. The show is hosted by Fred van Leer and premiered September 18, 2020.</li><li>RuPaul's Drag Race Down Under (2021–present): On August 26, 2019, an Oceanic version was announced to be in production and said to air in 2020, but was likely delayed due to the COVID-19 pandemic. Filming began in Auckland, New Zealand in January 2021. The series premiered on TVNZ 2 and TVNZ OnDemand in New Zealand, Stan in Australia, and on WOW Presents Plus internationally on 1 May 2021. The judging panel features RuPaul, Michelle Visage, and Rhys Nicholson.</li><li>Drag Race España (2021–present): On November 16, 2020, Atresmedia announced that they would produce a Spanish version of Drag Race together with Buendía Estudios after reaching an agreement with Passion Distribution in favour of World of Wonder. The series debuted on Atresmedia's pay streaming service ATRESplayer Premium on 30 May 2021, and aired on WOW Presents Plus internationally. It is hosted by Supremme de Luxe.</li><li>Drag Race Italia (2021–present): An Italian version of Drag Race was announced on June 30, 2021. The series debuted in November 2021 on Discovery+.</li><li>Drag Race France (2022–present): On November 17, 2021, a French version of Drag Race was announced.</li><li>Drag Race Philippines (2022–present): On August 17, 2021, a Filipino version of Drag Race was announced. The series debuted on August 17, 2022 on Discovery+ and HBO Go in the Philippines and aired on WOW Presents Plus internationally.</li><li>Drag Race Belgique (2023): A Belgian version of Drag Race was announced on April 29, 2022 and is set to broadcast February 16, 2023 on Tipik and to stream on WOW Presents Plus internationally.</li><li>Drag Race Sverige (2023): A Swedish version of Drag Race was announced on April 5, 2022 to broadcast on Sveriges Television and stream on WOW Presents Plus.</li><li>Drag Race Brasil (TBA): Announced on December 12, 2022.</li><li>Drag Race Mexico (TBA): Announced on December 12, 2022.</li><li>Drag Race Germany (TBA): Announced on December 12, 2022.</li></ul><h4>Other media</h4><ul><li>Feature film: In August 2015, RuPaul revealed that a movie featuring all of the contestants was in the works. \"We've got a director for it, we've got a light script, but it just needs a little more retooling and scheduling.\"</li><li>RuPaul's Drag Race Superstar is a mobile app by World of Wonder and Leaf Mobile's subsidiary East Side Games, which was released on October 25, 2021.</li></ul><br/><h3>Home media</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Season</th><th>Release date</th><th>Special features</th><th>Discs</th></tr><tr><td style=\"text-align:center;\">2</td><td>December 6, 2011</td><td><ul><li>Bonus scenes</li><li>Interviews with contestants</li><li>Extended reunion moments</li></ul></td><td style=\"text-align:center;\">3</td></tr><tr><td style=\"text-align:center;\">3</td><td>December 6, 2011</td><td><ul><li>Bonus scenes</li><li>Interviews with contestants</li><li>Extended reunion moments</li></ul></td><td style=\"text-align:center;\">4</td></tr><tr><td style=\"text-align:center;\">4</td><td>June 26, 2012</td><td><ul><li>Bonus scenes</li><li>Episodes of Untucked</li><li>Episodes of <i>Drag Ya Later</i> with Jon &amp; John</li></ul></td><td style=\"text-align:center;\">5</td></tr><tr><td style=\"text-align:center;\">5</td><td>June 10, 2013</td><td><ul><li>Bonus scenes</li><li>Episodes of Untucked</li></ul></td><td style=\"text-align:center;\">5</td></tr><tr><td style=\"text-align:center;\">6</td><td>October 21, 2014</td><td><ul><li>Bonus scenes</li><li>Episodes of Untucked</li></ul></td><td style=\"text-align:center;\">5</td></tr><tr><td style=\"text-align:center;\">7</td><td>June 8, 2016</td><td><ul><li>Bonus scenes</li><li>RuPaul's Drag Race: The Ru-les</li><li>Episodes of Whatcha Packin'</li></ul></td><td style=\"text-align:center;\">4</td></tr><tr><td style=\"text-align:center;\">8</td><td>July 29, 2016</td><td><ul><li>Bonus scenes</li><li>Episodes of Whatcha Packin'</li></ul></td><td style=\"text-align:center;\">3</td></tr></tbody></table><p>Full seasons of shows in the Drag Race franchise are available to stream on WOW Presents Plus in over 200 territories. The show is also currently available on the following streaming platforms:</p><ul><li>United States — Hulu (seasons 3–8; All Stars 1–4); Paramount Plus (seasons 1–12, All Stars 1–6, Untucked seasons 9–11, All Stars Untucked seasons 5–6), WOW Presents Plus (Untucked seasons 7–8, Thailand season 2, and all other international series)</li><li>Canada — Netflix (seasons 1–12, All Stars 4, Untucked seasons 11 and 12), Crave (all seasons, All Stars 1–6, UK series 1–3, Canada season 1 and 2, Down Under season 1), WOW Presents Plus (seasons 1–10, Untucked seasons 1–10, All Stars 1–4)</li><li>UK & Ireland — Netflix (seasons 11-13, Untucked seasons 11–13, All Stars 4-6, Celebrity season 1), BBC iPlayer (UK series 1,2 and 3, Canada season 1 and 2, Down Under season 1), WOW Presents Plus (seasons 1–10, Untucked seasons 1–10, all episodes of All Stars and Holland)</li><li>Australia — Stan (all seasons of original, All Stars, Untucked, UK, Canada, Down Under and Thailand Season 2), WOW Presents Plus (UK series 1, Canada season 1)</li></ul><br/><h3>Awards and nominations</h3><p>RuPaul's Drag Race has been nominated for thirty-nine Emmy Awards, and won twenty-four. It has also been nominated for nine Reality Television Awards, winning three, and nominated for six NewNowNext Awards, winning three.</p><br/><h3>Critical reception</h3><p>Thrillist called Drag Race \"the closest gay culture gets to a sports league\". In 2019, the TV series was ranked 93rd on The Guardian's list of the 100 best TV shows of the 21st century.</p><p>Shannon Keating for BuzzFeed News wrote about the show’s “subversive, irreverent beginnings” briefly turning “comfortably mainstream... humdrum and derivative” prior to season 13’s release. She recalls that a flurry of political disputes, as well as “overexposure”, threatened to ruin Drag Race’s legacy before the refreshed 2021 season.</p><p>Coleman Splide for The Daily Beast wrote in 2021 that “RuPaul has continually allowed the legacy of his subversive landmark reality show to be slowly chipped away at”. Though Splide states that the show is “a critical part of bringing empowering inclusivity to the forefront of mainstream culture”, he maintains that it also invites indignation from an ever-expanding and oftentimes toxic fanbase, as well as contributing to the increasingly capitalised nature of pride celebrations around the globe.</p><br/><h3>Controversy</h3><p>In March 2014, Drag Race sparked controversy over the use of the term \"shemale\" in the season 6 mini challenge \"Female or She-male?\". Logo has since removed the segment from all platforms and addressed the allegations of transphobia by removing the \"You've got she-mail\" intro from new episodes of the series. This was replaced with, \"She done already done had herses!\"</p><p>RuPaul additionally came under fire for comments made in an interview with The Guardian, in which he stated he would \"probably not\" allow a transgender contestant to compete. He compared transgender drag performers to doping athletes on his Twitter, and has since apologized. Sasha Velour (season 9) disagreed, tweeting \"My drag was born in a community full of trans women, trans men, and gender non-conforming folks doing drag. That's the real world of drag, like it or not. I thinks it's fabulous and I will fight my entire life to protect and uplift it\".</p><br/><h3>Relationship with the trans community</h3><p>For the first twelve seasons, RuPaul would say, \"Gentlemen, start your engines, and may the best woman win,\" before the contestants' runway looks for the episode were shown. When season 13 introduced the show's first ever transgender male contestant, Gottmik, RuPaul's catchphrase was changed in order to promote inclusivity: \"Racers, start your engines, and may the best drag queen win.\" In season 6 of All Stars, an altered version of the show's opening theme was introduced with the new tag line.</p><p>Performers of any sexual orientation and gender identity are eligible to audition, although most contestants to date have been gay, cisgender men. Transgender competitors have become more common as seasons have progressed; Sonique, a season two contestant, became the first openly trans contestant when she came out as a woman during the reunion special. Sonique later won All Stars 6, becoming the first trans woman to win an English-language version of the show and the second overall. Monica Beverly Hillz (season 5) became the first contestant to come out as a trans woman during the competition. Peppermint (season 9) is the first contestant who was out as a trans woman prior to the airing of her season. Other trans contestants came out as women after their elimination, including Carmen Carrera, Kenya Michaels, Stacy Layne Matthews, Jiggly Caliente, Gia Gunn, Laganja Estranja and Gigi Goode. Additionally, Gottmik (season 13) was the first AFAB and currently the only openly transgender male contestant in the franchise's history. Various contestants have come out as non-binary as well, including Jinkx Monsoon and Adore Delano.</p><p>Season 14 is the first regular season to feature five transgender women in the cast—Kerri Colby, Kornbread \"The Snack\" Jeté, Bosco, Jasmine Kennedie, and Willow Pill. While Kerri Colby and Kornbread entered the show openly trans, Bosco and Willow came out after the show's taping, and Jasmine Kennedie came out in episode 7 of Untucked.</p><br/><h3>Broadcast</h3><ul><li>Australia: In Australia, lifestyle channel LifeStyle YOU regularly showed and re-screened seasons 1–7, including Untucked. In addition, free-to-air channel SBS2 began screening the first season on August 31, 2013. On March 13, 2017, it was announced that on-demand service Stan would fast-track season 9 (including Untucked). As of 2020, Stan streams all seasons since Season 1, as well as Untucked, All Stars, All Stars Untucked, Canada's Drag Race, Secret Celebrity, Drag Race UK and Season 2 of Drag Race Thailand.</li><li>Canada: The series airs on OutTV in Canada at the same time as the US airing. Unlike Logo, OutTV continues to broadcast Untucked immediately after each Drag Race episode. Beginning with season 12, OutTV has shared its first-run rights to the main series (but not Untucked) with the more widely subscribed Crave streaming service, with episodes available on Crave shortly after they premiere on OutTV, in connection with Crave and OutTV's co-production of Canada's Drag Race. Past seasons are also available on Netflix in Canada, with each season released there shortly before the next season begins.</li><li>Ireland: In Ireland, season 2 to season 8 of the programme were available on Netflix; as of the release of Season 10, only seasons 8 & 9 are available. Netflix has started airing season 10 episodes one day after they air in the USA. All seasons of the show have been made available on Netflix since October 2018</li><li>Indonesia: In Indonesia, season 1 to season 13 of the programme were available on Netflix, alongside the Christmas spectacular; As of the release of All Stars, only season 4 and 5 is available. Netflix also aired Untucked season 10 episodes one day after they air in the USA.</li><li>UK: E4 aired season 1 in 2009, followed by season 2 in 2010. Since its success on Netflix in the UK, TruTV acquired the broadcast rights for all eight seasons of the show including Untucked episodes. In June 2015, TruTV started airing two episodes of the show a week, starting with season 4, followed by All Stars, then season 5. As of May 2018, the series airs on VH1 UK Monday–Thursday at 11pm, beginning with All Stars season 3.</li><li>Israel: Yes has broadcast all seasons and Untucked episodes. Seasons 1–12, All Stars seasons 4–5 and Untucked seasons 11–12 are also available on Netflix.</li></ul><br/><h3>Discography</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>List of soundtrack albums</caption><tbody><tr><th scope=\"col\" rowspan=\"1\" style=\"width:18em;\">Title</th><th scope=\"col\" rowspan=\"1\" style=\"width:14em;\">Album Details</th></tr><tr><th scope=\"row\"><i>RuPaul's Drag Race: The Rusical</i></th><td><ul><li>Released: April 22, 2016</li><li>Label: World of Wonder Records</li><li>Formats: Digital download, streaming</li></ul></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>List of compilation albums</caption><tbody><tr><th scope=\"col\" rowspan=\"1\" style=\"width:18em;\">Title</th><th scope=\"col\" rowspan=\"1\" style=\"width:14em;\">Album Details</th></tr><tr><th scope=\"row\"><i><span>RuPaul Presents: The CoverGurlz</span></i></th><td><ul><li>Released: January 28, 2014</li><li>Label: World of Wonder Records</li><li>Formats: Digital download, streaming</li></ul></td></tr><tr><th scope=\"row\"><i><span>RuPaul Presents: CoverGurlz 2</span></i></th><td><ul><li>Released: February 23, 2016</li><li>Label: World of Wonder Records</li><li>Formats: Digital download, streaming</li></ul></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>List of extended plays</caption><tbody><tr><th scope=\"col\" rowspan=\"1\" style=\"width:18em;\">Title</th><th scope=\"col\" rowspan=\"1\" style=\"width:14em;\">Album Details</th></tr><tr><th scope=\"row\"><i><span>RuPaul's Drag Race Live: The Official Vegas Soundtrack</span></i></th><td><ul><li>Released: January 27, 2020</li><li>Label: World of Wonder Records</li><li>Formats: Digital download, streaming</li></ul></td></tr><tr><th scope=\"row\"><i><span>Moulin Ru! The Rusical</span></i></th><td><ul><li>Released: March 26, 2022</li><li>Label: World of Wonder Records</li><li>Formats: Digital download, streaming</li></ul></td></tr><tr><th scope=\"row\"><i><span>Wigloose: The Rusical!</span></i></th><td><ul><li>Released: March 18, 2023</li><li>Label: World of Wonder Records</li><li>Formats: Digital download, streaming</li></ul></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>List of singles, with select chart positions</caption><tbody><tr><th scope=\"col\" rowspan=\"2\" style=\"width:18em;\">Title</th><th scope=\"col\" rowspan=\"2\" style=\"width:1em;\">Season</th><th scope=\"col\" colspan=\"1\">Peak chart positions</th></tr><tr><th scope=\"col\" style=\"width:3em;font-size:85%;\"><span class=\"mw-redirect\">US<br>Dance<br>Dig.</span><br></th></tr><tr><th scope=\"row\">\"Cover Girl\"<br><span style=\"font-size:85%;\">(featuring <span>BeBe Zahara Benet</span>)</span></th><td><span>1</span></td><td>—</td></tr><tr><th scope=\"row\">\"Can I Get An Amen\"</th><td><span>5</span></td><td>—</td></tr><tr><th scope=\"row\">\"Oh No She Better Don't\"<br><span style=\"font-size:85%;\">(with <span>ShyBoy</span>)</span></th><td><span>6</span></td><td>—</td></tr><tr><th scope=\"row\">\"Legs\"</th><td rowspan=\"3\"><span>8</span></td><td>—</td></tr><tr><th scope=\"row\">\"I Don't Like to Show Off\"</th><td>—</td></tr><tr><th scope=\"row\">\"Fat, Fem, and Asian\"</th><td>—</td></tr><tr><th scope=\"row\">\"Category Is\" (Cast Version)</th><td><span>9</span></td><td>—</td></tr><tr><th scope=\"row\">\"<span>PharmaRusical</span>\"</th><td rowspan=\"3\"><span>10</span></td><td>—</td></tr><tr><th scope=\"row\">\"<span class=\"mw-redirect\">Cher: The Unauthorized Rusical</span>\"</th><td>—</td></tr><tr><th scope=\"row\">\"American\" (Cast Version)</th><td>12</td></tr><tr><th scope=\"row\">\"Trump: The Rusical\"<br><span style=\"font-size:85%;\">(featuring April Malina, Melodye Perry, Brooke Wilkes, Devon Weigel and <span>Anna Graves</span>)</span></th><td rowspan=\"2\"><span>11</span></td><td>—</td></tr><tr><th scope=\"row\">\"Queens Everywhere\" (Cast Version)</th><td>20</td></tr><tr><th scope=\"row\">\"I'm That Bitch\"</th><td rowspan=\"5\"><span>12</span></td><td>—</td></tr><tr><th scope=\"row\">\"You Don't Know Me\"</th><td>—</td></tr><tr><th scope=\"row\">\"<span>Madonna: The Unauthorized Rusical</span>\"</th><td>—</td></tr><tr><th scope=\"row\">\"I Made It / Mirror Song / Losing is the New Winning (Las Vegas Live Medley)\"</th><td>—</td></tr><tr><th scope=\"row\">\"The Shady Bunch\"</th><td>—</td></tr><tr><th scope=\"row\">\"ConDragulations\" (Cast Version)</th><td rowspan=\"4\"><span>13</span></td><td>—</td></tr><tr><th scope=\"row\">\"Phenomenon\" (Cast Version)</th><td>—</td></tr><tr><th scope=\"row\">\"<span>Social Media: The Unverified Rusical</span>\"</th><td>—</td></tr><tr><th scope=\"row\">\"Lucky\"</th><td>—</td></tr><tr><th scope=\"row\">\"Save a Queen\"</th><td rowspan=\"10\"><span>14</span></td><td>—</td></tr><tr><th scope=\"row\">\"My Baby Is Love: The RuPremes\"</th><td>—</td></tr><tr><th scope=\"row\">\"He’s My Baby: The RuNettes\"</th><td>—</td></tr><tr><th scope=\"row\">\"Bad Boy Baby: The ShangRu-Las\"</th><td>—</td></tr><tr><th scope=\"row\">\"Catwalk\" (Cast Version)</th><td>—</td></tr><tr><th scope=\"row\">\"I Hate People\" (<span>Willow Pill</span>)</th><td>—</td></tr><tr><th scope=\"row\">\"I Fell Down (I Got Up)\" (Lady Camden)</th><td>—</td></tr><tr><th scope=\"row\">\"Fighter\" (Daya Betty)</th><td>—</td></tr><tr><th scope=\"row\">\"Devil\" (<span>Bosco</span>)</th><td>—</td></tr><tr><th scope=\"row\">\"Check My Track Record\" (Angeria Paris VanMichaels)</th><td>—</td></tr><tr><th scope=\"row\">\"Golden Girlfriends – Banjo Bitches\"</th><td rowspan=\"8\"><span>15</span></td><td>—</td></tr><tr><th scope=\"row\">\"Golden Years – Rockin' Old Gs\"</th><td>—</td></tr><tr><th scope=\"row\">\"Golden Hips – Ol' Dirty Bitches\"</th><td>—</td></tr><tr><th scope=\"row\">\"Blame It on the Edit\" (Cast Version)</th><td>—</td></tr><tr><th scope=\"row\">\"Lotus\" (Anetra)</th><td>—</td></tr><tr><th scope=\"row\">\"It's Giving Fashion\" (Luxx Noir London)</th><td>—</td></tr><tr><th scope=\"row\">\"Delusion\" (Mistress Isabelle Brooks)</th><td>—</td></tr><tr><th scope=\"row\">\"Goddess\" (Sasha Colby)</th><td>—</td></tr><tr><td colspan=\"3\"><span style=\"font-size:85%;\">\"—\" denotes a recording that failed to chart, was ineligible for the chart or was not released.</span></td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}