{
  "imDbId": "tt12392504",
  "title": "Scam 1992: The Harshad Mehta Story",
  "fullTitle": "Scam 1992: The Harshad Mehta Story (TV Series 2020–2020)",
  "type": "TVSeries",
  "year": "2020",
  "items": [
    {
      "username": "swapniludand24",
      "userUrl": "https://www.imdb.com/user/ur37854651",
      "reviewLink": "https://www.imdb.com/review/rw6166553",
      "warningSpoilers": false,
      "date": "11 October 2020",
      "rate": "10",
      "helpful": "307 out of 341 found this helpful.",
      "title": "Strong screenplay that needs to be seen.",
      "content": "Okay, so the bottom line is \"harshad mehta\" was involved in most of the wrong doing but was he the only guy responsible ? No, Never. In a scam like huge as 1992 shown in this series, it was never one person befooling the entire nation. This show has 2 names written all over it, pratik gandhi (harshad mehta) and the creator himself Hansal mehta. What a crazy show he has pulled off, no big actors with huge following but bunch of actors who have shown their par excellence in this 9 episode long series. this is the best work of hansal mehta that he has pulled of in his career. From the scene 1 to the last pratik gandhi has stole the show. what a great addition to the film industry. The strongest point in this very complicated series filled with so many jargons is the fact is it's screenplay. to the point, no nonsense, no strong language without any use, no vulgarity and just a focus on story-line. a Strong screenplay and good direction is always the key to the film/ series and SCAM 1992 is here to proof. don't think just watch it, you love it and want to watch it in just one go. too good to be made for an Indian audience which focuses only on one thing a good meme templates, which this series is definitely not.a must must watch"
    },
    {
      "username": "pratikshah-65174",
      "userUrl": "https://www.imdb.com/user/ur86649094",
      "reviewLink": "https://www.imdb.com/review/rw6196869",
      "warningSpoilers": false,
      "date": "22 October 2020",
      "rate": "9",
      "helpful": "220 out of 254 found this helpful.",
      "title": "Holy S##t...It was hard to belive Indian web series could be of this quality.",
      "content": "Honestly, I was blown away. This is the only Indian web series I found which doesn't use overly melodramatic scenes. Usually Indian TV series in general stretch the story to the point it almost gets frustrating. But not this one. Do your self a favor and watch it now!"
    },
    {
      "username": "aanal-91393",
      "userUrl": "https://www.imdb.com/user/ur84727244",
      "reviewLink": "https://www.imdb.com/review/rw6163523",
      "warningSpoilers": false,
      "date": "10 October 2020",
      "rate": "10",
      "helpful": "235 out of 274 found this helpful.",
      "title": "One Of The Best Indian Web Series i Ever Seen",
      "content": "You will get A to Z all details of this scam, i may be wrong but due to this series, i don't think that i need to watch the upcoming movie \"big bull\" because 2 to 3 hours too less for explain the story. If you are at home, just watch this web series, you will not bore for even 1 second, All actors played their role excellently, i like reporter character as well."
    },
    {
      "username": "rishiraj-06635",
      "userUrl": "https://www.imdb.com/user/ur61591452",
      "reviewLink": "https://www.imdb.com/review/rw6161197",
      "warningSpoilers": false,
      "date": "9 October 2020",
      "rate": "10",
      "helpful": "149 out of 178 found this helpful.",
      "title": "Omerta, Shahid , 1992 Scam Director Hansal Mehta is on a roll.",
      "content": "This web series is a masterpiece. Pratik Gandhi is the future superstar of cinema."
    },
    {
      "username": "chipsarecrispy",
      "userUrl": "https://www.imdb.com/user/ur96694404",
      "reviewLink": "https://www.imdb.com/review/rw6164017",
      "warningSpoilers": false,
      "date": "10 October 2020",
      "rate": "10",
      "helpful": "44 out of 55 found this helpful.",
      "title": "Harshad Metha - naam toh suna hoga",
      "content": "Amazing series. Many want to learn the art of making money, few learn it and some unique personality over achieve it. Had heard lot about this scam and got to know lot about it. It's a known story about many taking advantage of the loopholes in the system but sadly Harshad ended up on receiving end. Acting, story, music and everything is up to the mark"
    },
    {
      "username": "pawanpunjabithewriter",
      "userUrl": "https://www.imdb.com/user/ur54077131",
      "reviewLink": "https://www.imdb.com/review/rw6309991",
      "warningSpoilers": false,
      "date": "26 November 2020",
      "rate": "9",
      "helpful": "22 out of 26 found this helpful.",
      "title": "Once a lifetime experience to watch",
      "content": "I have no words. Pratik Gandhi has played Harshad Mehta the way it seems so magical, so real. This series has been made fantastically. Everyone have their role to perfect. Cinematography is outstanding. The stock market world, the 80s the 90s , the businesses, the culture, the politics, money, scam, you won't get to watch these things in any movie or series. This is completely a new experience to watch. I loved the role of Harshad Mehta, Ashwin Mehta and his friend from Stock Market the Seth. Hated Sucheta Dalal to a great extent. I would watch this series sometime again. It's once in a lifetime work. Hats off to the team!"
    },
    {
      "username": "jlcsmartme",
      "userUrl": "https://www.imdb.com/user/ur95100944",
      "reviewLink": "https://www.imdb.com/review/rw6160242",
      "warningSpoilers": false,
      "date": "9 October 2020",
      "rate": "10",
      "helpful": "86 out of 107 found this helpful.",
      "title": "Masterpiece",
      "content": "Real talent and story comes in webseries. We love it. Awesome storyline screenplay and best music. Kudos to the production team."
    },
    {
      "username": "sohamlele-90248",
      "userUrl": "https://www.imdb.com/user/ur117704524",
      "reviewLink": "https://www.imdb.com/review/rw6159940",
      "warningSpoilers": false,
      "date": "9 October 2020",
      "rate": "9",
      "helpful": "119 out of 151 found this helpful.",
      "title": "Probably the best of 2020",
      "content": "Scam 1992 The Harshad Mehta story is a brilliant web series directed by Hansal Mehta. I've been a Hansal Mehta fan since Bose and Omerta. His direction is mindblowing. Performance by Pratik Gandhi, Shreya Dhanwanthary and others are good. In short a definite watch."
    },
    {
      "username": "Amyth47",
      "userUrl": "https://www.imdb.com/user/ur45390749",
      "reviewLink": "https://www.imdb.com/review/rw6357375",
      "warningSpoilers": false,
      "date": "12 December 2020",
      "rate": "9",
      "helpful": "24 out of 30 found this helpful.",
      "title": "One of the best Indian web series!",
      "content": "My Rating : 9/10Right from the opening shots (hell, even the theme song kicks in adrenaline like no other!) and voiceover 'Scam 1992: The Harshad Mehta Story' takes the viewer on an epic journey - no nonsense, no vulgarity, no melodrama, no big actors or names - just a strong focus on the screenplay and excellent direction - the acting is top-notch - shows that talent and craft are not the heirloom of aristocracy.Absolute must-see! You will be hooked!"
    },
    {
      "username": "miteshrajgor",
      "userUrl": "https://www.imdb.com/user/ur125005215",
      "reviewLink": "https://www.imdb.com/review/rw6160231",
      "warningSpoilers": false,
      "date": "9 October 2020",
      "rate": "10",
      "helpful": "174 out of 202 found this helpful.",
      "title": "Perfect!!",
      "content": "Great story, direction and acting. Pratik gandhi is doing great job. Must watch!"
    },
    {
      "username": "naimeshpatel-04004",
      "userUrl": "https://www.imdb.com/user/ur125003631",
      "reviewLink": "https://www.imdb.com/review/rw6160075",
      "warningSpoilers": true,
      "date": "9 October 2020",
      "rate": "10",
      "helpful": "148 out of 173 found this helpful.",
      "title": "Indian Stock market's earlier reality",
      "content": "Its not just only about harshad metha but also about other big market participants who use to rule markets, Harshad got caught because his ignorance and fame.He used to believe he can run whole market by his illegal methods and try to make his name and wealth but we also should not ignore other market participants also and their nasty techniques.Like Manubhai, Amit kedia , citibank cartel also use to do these things but one that caught first get the punishment.All these other actors had a connection with RBI governor and Income Tax Departments.i never heard about earlier CitiBank cartel in india maybe media dont highlight that too much or maybe they were made to ignore that.(Socialist Era)End of the day its BULLS vs BEARS Bull lost because he lost his main goal to make money and engaged in unnecessary activities(Fame,Big man in market)Remember india was socialist country that time.Rich men always have more contacts and when someone coming out of pack and try to break already monopolized market he always create more enemies than friends"
    },
    {
      "username": "aryanhot-13790",
      "userUrl": "https://www.imdb.com/user/ur96108355",
      "reviewLink": "https://www.imdb.com/review/rw6166056",
      "warningSpoilers": false,
      "date": "11 October 2020",
      "rate": "10",
      "helpful": "29 out of 37 found this helpful.",
      "title": "Amazing",
      "content": "The acting of Pratik Gandhi is amazing. The story and everything is amazing. It's a must watch."
    },
    {
      "username": "brijeshvaghani",
      "userUrl": "https://www.imdb.com/user/ur76571463",
      "reviewLink": "https://www.imdb.com/review/rw6171881",
      "warningSpoilers": false,
      "date": "13 October 2020",
      "rate": "10",
      "helpful": "15 out of 18 found this helpful.",
      "title": "Couldn't be more precise......",
      "content": "Series portraits one of the biggest Indian stock market scandal perfectly, which caused numbers of amendments in Acts, laws of banking and stock system.Directed by national award winner Hansal Mehta and i guess now he should win one more. He is genuinely Gem of the industry. Actor pratik gandhi and all other actors have made everyone speechless by their acting. Dialogues were written very beautifully with Gujrati idioms and phrases.I have never given 10/10 to any hindi series but this time i was unable to stop my self from rating 10/10."
    },
    {
      "username": "gauravchinia",
      "userUrl": "https://www.imdb.com/user/ur125127825",
      "reviewLink": "https://www.imdb.com/review/rw6175179",
      "warningSpoilers": false,
      "date": "14 October 2020",
      "rate": "10",
      "helpful": "31 out of 40 found this helpful.",
      "title": "Shoul be in top 5 indian web series",
      "content": "Mind blowing adaptation of 90's scam. Way by which the financial terms r introduced r brilliant even a common man can watch ! Powerful performances & theme music which compels everyone to give it a try !"
    },
    {
      "username": "myash-57173",
      "userUrl": "https://www.imdb.com/user/ur115490271",
      "reviewLink": "https://www.imdb.com/review/rw6165081",
      "warningSpoilers": false,
      "date": "11 October 2020",
      "rate": "10",
      "helpful": "45 out of 58 found this helpful.",
      "title": "Web series in India opens up everything",
      "content": "Must watch , great direction , character , and BGM"
    },
    {
      "username": "shashankpatel-37369",
      "userUrl": "https://www.imdb.com/user/ur93407151",
      "reviewLink": "https://www.imdb.com/review/rw6168394",
      "warningSpoilers": false,
      "date": "12 October 2020",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Surprisingly superb.",
      "content": "It will change the whole idea of the 1992 scamz if this story has been plotted as honestly as it's shown. Though whatever happened was not right, harshad was made victim to save every other persons and loophole involved. Though the thinking was wrong, the approach to him was bias and harsh as he was the only responsible person for everything, which isn't the case as visible from the story atleast. The cast has been simply outstanding, Pratik, Shreya, Rajat , and every other person was beyond fabulous. It's so great to see such a story but would have been even more successful if had been on a better stage like Netflix or prime which is in almost every other home. If you are someone who likes to see the real drama behind the story, who believes in true story, dare not to miss this."
    },
    {
      "username": "pranavmody",
      "userUrl": "https://www.imdb.com/user/ur62569946",
      "reviewLink": "https://www.imdb.com/review/rw6176185",
      "warningSpoilers": false,
      "date": "14 October 2020",
      "rate": "10",
      "helpful": "22 out of 27 found this helpful.",
      "title": "A Masterpiece",
      "content": "This definitely is one of the most brilliant series 2020 has produced.It tells the story of the scam in such a way that even a layman can understand the hardcore terms of stock and money market. The way it progresses the story, I did not even blink for a second. It's a well told narration based on facts and how things were in that timeline. Hats off to Hansal Mehta for this brilliant direction.The casting has been the highlight of this series with Pratik Gandhi as Harshad Mehta and Shreya Dhanwanthary as Suchita Dalal. The expressions and dialogue delivery is on point. The same goes for the rest of the cast and there is not a single one who is not worth 10/10 when it comes to acting.Absolutely worth the time."
    },
    {
      "username": "tikssharma",
      "userUrl": "https://www.imdb.com/user/ur123669504",
      "reviewLink": "https://www.imdb.com/review/rw6174699",
      "warningSpoilers": false,
      "date": "14 October 2020",
      "rate": "10",
      "helpful": "23 out of 28 found this helpful.",
      "title": "Bacchan of OTT",
      "content": "Awesome series with perfect casting!! This series has set a benchmark of perfect casting, perfect acting. Background music is a \"Bull\". Pratik Gandhi, what a talent you are!!! Hats off to you Lala 😀"
    },
    {
      "username": "ingalegaurav89",
      "userUrl": "https://www.imdb.com/user/ur54170714",
      "reviewLink": "https://www.imdb.com/review/rw6175075",
      "warningSpoilers": false,
      "date": "14 October 2020",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "Must watch!!!",
      "content": "Tight script & impeccable acting by Mr. Pratik Gandhi. His acting is better than few Khans of industry."
    },
    {
      "username": "adarshkumardash-09256",
      "userUrl": "https://www.imdb.com/user/ur123925153",
      "reviewLink": "https://www.imdb.com/review/rw6166185",
      "warningSpoilers": false,
      "date": "11 October 2020",
      "rate": "10",
      "helpful": "26 out of 35 found this helpful.",
      "title": "Beautifully Real",
      "content": "Its gorgeously shot and cleverly shown the reality of Harshad Mehta. Definitely a Watch!!"
    },
    {
      "username": "amardeepmishra-13783",
      "userUrl": "https://www.imdb.com/user/ur121919130",
      "reviewLink": "https://www.imdb.com/review/rw6166201",
      "warningSpoilers": false,
      "date": "11 October 2020",
      "rate": "10",
      "helpful": "13 out of 15 found this helpful.",
      "title": "Definitely you will like this series, must watch!",
      "content": "After a long time best documentary kind of series."
    },
    {
      "username": "jfeivy",
      "userUrl": "https://www.imdb.com/user/ur125168767",
      "reviewLink": "https://www.imdb.com/review/rw6175761",
      "warningSpoilers": false,
      "date": "14 October 2020",
      "rate": "10",
      "helpful": "47 out of 57 found this helpful.",
      "title": "Best Web series of India",
      "content": "For me SCAM1992 is the best web series of India till now. After ages actor has been into its character. Music was outstanding. Screenplay was tight n perfect. All the actors in the series has done justice to its role."
    },
    {
      "username": "rb-63142",
      "userUrl": "https://www.imdb.com/user/ur122270165",
      "reviewLink": "https://www.imdb.com/review/rw6162571",
      "warningSpoilers": false,
      "date": "10 October 2020",
      "rate": "10",
      "helpful": "32 out of 42 found this helpful.",
      "title": "outstanding",
      "content": "A new type of web series and with good story and brilliant star cast"
    },
    {
      "username": "mayankshukla1404",
      "userUrl": "https://www.imdb.com/user/ur101992435",
      "reviewLink": "https://www.imdb.com/review/rw6175580",
      "warningSpoilers": false,
      "date": "14 October 2020",
      "rate": "10",
      "helpful": "10 out of 13 found this helpful.",
      "title": "The Bull of Dalal Street",
      "content": "Let's get straight to the point. Scam 1992: The Harshad Mehta Story is arguably the best Indian web show ever made. The sheer amount of research and detailing that went into the making of this series is commendable. This is one of the finest storytelling in recent times backed by a lifetime performance. Both Hansal Mehta the director and lead actor Prateek Gandhi hit it out of the park with this one. To execute a stock exchange drama and make it interesting is not an easy task but Hansal succeeds in doing this. For someone like me coming from a non financial background it did take some time to adjust to all the stock market terms and understand them. But slowly and gradually as I got sucked into this world there was no looking back. The show just kept on getting interesting and dramatic as it moved on. While the first half of the show is centred around Harshad's rise from rags to riches. The second half is about his downfall as the noose starts tightening around him. To his credit Hansal Mehta doesn't take any sides and tells the Harshad story without making a hero or an anti hero out of him. Here was a man who knew the system very well and used its loopholes and irregularities to his advantage. But his oversized ambition and greed eventually did him in. Speaking of performances Prateek Gandhi is Harshad Mehta. Period. This is the best performance of the year. He just owned this character. The rest of the supporting actors are very cleverly cast and they all are brilliant. The ones who stand out in particular are Shreya Dhanwanthary, Ananth Narayan Mahadevan, Nikhil Dwivedi, Rajat Kapoor and Shadaab Khan. Overall the show is a slow burner. It does tests your patience initially but keeps on getting better with every episode. You can't help but applaud the makers along with the whole team who executed this real life incident splendidly. This captivating drama with 10 whopping episodes comes across as an extremely well-written and directed piece of work. Take a bow Hansal Mehta! Streaming on Sonyliv now."
    },
    {
      "username": "Azanspy",
      "userUrl": "https://www.imdb.com/user/ur44306450",
      "reviewLink": "https://www.imdb.com/review/rw6219337",
      "warningSpoilers": false,
      "date": "30 October 2020",
      "rate": "9",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Who would've thought Sony Liv was the one who's going to bring the best Indian series ever.",
      "content": "Scam 1992 is one of the best and truest biopic you'll see. It's arguably the best series series to come from India. The makers has done almost everything perfectly. The direction, cinematography, music was all good. The acting deserves a separate praise has they have done a very good casting and all did well. The series was very engaging and it made want to stream episode after episode till the end without boring me. Kudos to Hansel Mehta for that. He's a very talented director who has proved himself and I hope he would do more good project like this and not like his upcoming Amazon Prime movie which looks bad. I subscribed Sony Liv just to watch this and that's Rs 300 well spent. Hope they have more to offer like this."
    }
  ],
  "errorMessage": ""
}