{
  "imDbId": "tt0979432",
  "title": "Boardwalk Empire",
  "fullTitle": "Boardwalk Empire (TV Series 2010–2014)",
  "type": "TVSeries",
  "year": "2010",
  "items": [
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw6259526",
      "warningSpoilers": false,
      "date": "11 November 2020",
      "rate": "10",
      "helpful": "86 out of 93 found this helpful.",
      "title": "Don't Miss This Show!",
      "content": "Boardwalk Empire is absolutely, without a doubt one the best gangster shows ever created. Every season is as addictive as the last. Steve Buscemi leads an amazing cast as he gives one of the best performances ever put on tv! This is tv at its best so don't miss it!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8753455",
      "warningSpoilers": false,
      "date": "24 December 2022",
      "rate": "10",
      "helpful": "49 out of 52 found this helpful.",
      "title": "Brilliant!",
      "content": "Boardwalk Empire is one of the best shows I've ever seen. The acting and writing are as good as anything you'll see on tv. The production is also fantastic, the attention to detail is just incredible. It tells the story of Atlantic City politician/gangster, Enoch \"Nucky\" Thompson (Steve Buscemi), and how he runs the town both legally and criminally. He runs it with his brother Elias (Shea Whigham), who is also the Sheriff, and their gang of tough guys. It takes place during prohibition and Nucky is the #1 distributor of illegal alcohol. He does this while doing business with some of the most notorious gangsters in American history like Al Capone, Lucky Luciano, Jim Colosimo, Arnold Rothstein, among others. There's not much I can say that hasn't already been said about this incredible show so just go watch it. You won't be disappointed!"
    },
    {
      "username": "Clive_W",
      "userUrl": "https://www.imdb.com/user/ur30888832",
      "reviewLink": "https://www.imdb.com/review/rw6395545",
      "warningSpoilers": false,
      "date": "24 December 2020",
      "rate": "10",
      "helpful": "59 out of 62 found this helpful.",
      "title": "Bullets and heads will role",
      "content": "This show has to be one of my personal favourites, I would always recommend people to check out. In terms of the show itself, you've got an awesome cast of great actors, with some the most beautiful cinematography, and hands down the story is just fantastic. You've got historical true elements mixed of course with fictional aspects, more so on the fictional side but it's just amazing to see these actors play out some the most iconic historic mobsters, Stephen Graham as Al Capone is just amazing, one my top favourite actors to see on screen. And ultimately one the best endings to a show, with no spoilers the story comes full circle, with a satisfying end."
    },
    {
      "username": "intelearts",
      "userUrl": "https://www.imdb.com/user/ur2419668",
      "reviewLink": "https://www.imdb.com/review/rw2334108",
      "warningSpoilers": false,
      "date": "4 November 2010",
      "rate": "9",
      "helpful": "134 out of 160 found this helpful.",
      "title": "My 347th Review: ...this is as good as TV gets....",
      "content": "With production values that are mind-boggling, cast, and a budget to die for HBO is now what film studios were in the 1930s, they have the clout and the ability to go way further than most films can - and you get episode after episode.the detailing is beyond accurate and lavish - every stitch, every furnishing, every telegraph wire looks and feels authentic and it is all shot and lit to the highest standards of film not TV. The story of prohibition and Atlantic City is fully detailed, complex, with Steve Buscemi heading up a great cast. I have a gripe that the F-word was not ubiquitous at the time and strikes a jarring note in an otherwise near perfect production. Where this shines is in the details - I just hope the story lines and acting live up to the promise - they certainly have so far."
    },
    {
      "username": "ben-mckimm",
      "userUrl": "https://www.imdb.com/user/ur33572331",
      "reviewLink": "https://www.imdb.com/review/rw8338388",
      "warningSpoilers": false,
      "date": "16 July 2022",
      "rate": "9",
      "helpful": "29 out of 31 found this helpful.",
      "title": "Wow",
      "content": "It was nearly perfect. I feel like the final season was a little unnecessary but they made it work. Richard Harrow is probably my favourite character from anything ever and I know they think they used him just enough but they could have featured him just a little more.I feel sorry for everyone who says they stopped watching after season 2."
    },
    {
      "username": "dogonlion",
      "userUrl": "https://www.imdb.com/user/ur67314647",
      "reviewLink": "https://www.imdb.com/review/rw5999551",
      "warningSpoilers": false,
      "date": "16 August 2020",
      "rate": "10",
      "helpful": "41 out of 45 found this helpful.",
      "title": "A masterpiece !",
      "content": "The writing, acting, music, historical events. It's all there. Then you have Martin Scorsese involved, so what can go wrong?"
    },
    {
      "username": "martinpersson97",
      "userUrl": "https://www.imdb.com/user/ur45812214",
      "reviewLink": "https://www.imdb.com/review/rw8782641",
      "warningSpoilers": true,
      "date": "6 January 2023",
      "rate": "9",
      "helpful": "27 out of 30 found this helpful.",
      "title": "Boardwalk Coda: The death of man",
      "content": "My title, of course, refers to Francis Ford Coppola's epilogue to his epic Godfather trilogy, a comparison I thought was very befitting.It is an incredible series, in typical HBO fashion. Uncensored, gritty and with a very realistic tone. The characters are all extremly well-written and acted, and at its core it is very much the tale about the corruption and fall of man, the descent into crime and darkness; conveyed in Nucky and his surrogate son Jimmy. Just like Coppola tried to build upon in his epic.The writing, cinematography and themes are outstanding, as is its great and classic soundtrack. It just breathes classic Scorsese, and, like his other collaborations with Winter, this is a work of art for the ages.Recommended for any lover of film or the crime/mafi genre!"
    },
    {
      "username": "oscarjneklund",
      "userUrl": "https://www.imdb.com/user/ur154260428",
      "reviewLink": "https://www.imdb.com/review/rw8295690",
      "warningSpoilers": false,
      "date": "3 July 2022",
      "rate": "9",
      "helpful": "28 out of 30 found this helpful.",
      "title": "What a show! 🎥",
      "content": "This show, wow! High quality, old history environment at it's finest. Steve Buscemi has to be one of the greatest actors of all time, he really knows how to get into character. 🇺🇲"
    },
    {
      "username": "angelorwez",
      "userUrl": "https://www.imdb.com/user/ur150272282",
      "reviewLink": "https://www.imdb.com/review/rw8698034",
      "warningSpoilers": false,
      "date": "27 November 2022",
      "rate": "9",
      "helpful": "33 out of 37 found this helpful.",
      "title": "amazing television",
      "content": "This is no doubt top-tier television...it is too evident...something completely worth your time...the only other show this can be compared to is peaky blinders...and even though they're set in different locations...the mood and aura are very similar...what it has up on peaky blinders is that it immerses you in waay better...you really feel like you're in the prohibition era...even the soundtracks are well suited...very well done...Nucky's character lights up every scene he's in...his Jokes land very well...his character is very well-acted...his persona his demeanour...everything is on point...Eli's presentation is very subtle but profound...very well written character...as the story rolls forward...the other characters start to grow on you...this world starts to open up and every piece of the story starts to spread its wings...all the dons and the detective start to hold firm in story...Nucky's little mistress...who flagged off this character?!...very unnecessary for her to talk like that...she's not intelligent...we can get that from her mannerisms and actions...you don't need to dumb her down to the extent she looks like a retard...the accent for me is a little of a turn off but i recognize it is necessary for authenticity...the acting is fantastic the pacing is perfect...the story is intriguing and it pulls you in completely...it's hard not to compare shows...especially when they're so similar...it's better than peaky blinders...peaky blinders is more about the aura and getting you to be invested emotionally...it taps into the action and is about leading you somewhere...this is how this happened...this show taps into the story of the era...it tries to paint a clearer picture...it builds a cause and then presents the consequences...peaky blinders is more about events and how they happen...this is more about the story around events...that's why it has a richer character pool...it's more elaborate...Character development is fantastic...it feels natural and doesn't feel set up...you're just there for the ride as events unfold...it's got all the good stuff...great pacing...good dialogue...it has topic points that keep you thinking...races your mind and pushes you to thought...very good element...extremely impressive...it feels organic...nothing feels staged...the story unfolds nicely at its own pace...it doesn't feel like it's going somewhere...which is a mistake most shows like these make..."
    },
    {
      "username": "estathena2",
      "userUrl": "https://www.imdb.com/user/ur20702609",
      "reviewLink": "https://www.imdb.com/review/rw8778802",
      "warningSpoilers": false,
      "date": "4 January 2023",
      "rate": "8",
      "helpful": "30 out of 33 found this helpful.",
      "title": "Full Series Review",
      "content": "A worthwhile series that starts off incredibly strong & maintains its seductive pull throughout. Reminiscent of The Sopranos but set in the prohibition era, the attention to detail - from clothing, set design, to music draws you in and holds your attention.Steve Buscemi's performance captivates as it grows to eventually repulse, but still you root for him - top dog to underdog, to wanting out, you want him to make it out alive.Characters comes and go, the writing lags here and there, but overall the show is worth the time and attention required to fully appreciate its genius.I throughly enjoyed it & highly recommend it."
    },
    {
      "username": "luckeyburrows",
      "userUrl": "https://www.imdb.com/user/ur108265080",
      "reviewLink": "https://www.imdb.com/review/rw7930611",
      "warningSpoilers": false,
      "date": "8 March 2022",
      "rate": "10",
      "helpful": "28 out of 30 found this helpful.",
      "title": "Outstanding",
      "content": "This is is definitely worth watching. From the year 1920 to 1931 this classic gangster show and it's music and the character Richard Harrow is one of the best ones I've ever seen. I highly recommend you watch this, from the writer of The Sopranos."
    },
    {
      "username": "soulfx-1",
      "userUrl": "https://www.imdb.com/user/ur7535584",
      "reviewLink": "https://www.imdb.com/review/rw7204938",
      "warningSpoilers": false,
      "date": "7 August 2021",
      "rate": "8",
      "helpful": "19 out of 20 found this helpful.",
      "title": "Starts off great, interesting ending",
      "content": "Starts off great as you learn about the corruption spreading as prohibition takes off. It's a story of morality and it doesn't have a happy ending.You're reminded this an HBO show that loosely follows real life historical figures through the rise of organized crime and the forces trying to stop them.The later seasons start to get a bit tired and boring, but it has a strong ending."
    },
    {
      "username": "ColtPython82",
      "userUrl": "https://www.imdb.com/user/ur62191031",
      "reviewLink": "https://www.imdb.com/review/rw8431251",
      "warningSpoilers": false,
      "date": "11 August 2022",
      "rate": "10",
      "helpful": "31 out of 34 found this helpful.",
      "title": "Amazing show, almost like a prequel to Sopranos. But where's the Capone sequel series?",
      "content": "I love Boardwalk Empire, it's like a Soprano's mafia origin story. But a lingering question I've always had is why didn't they make a Boardwalk Empire sequel series starring Capone, Meyer, and Lucky? The show set up a new series perfectly with the introduction of these characters and a sequel show set in Chicago would've been amazing. Actually the actors who played them are the perfect age now to play these historical characters, so hopefully the show runners give it a thought."
    },
    {
      "username": "851222",
      "userUrl": "https://www.imdb.com/user/ur4405474",
      "reviewLink": "https://www.imdb.com/review/rw2314237",
      "warningSpoilers": false,
      "date": "22 September 2010",
      "rate": "9",
      "helpful": "170 out of 240 found this helpful.",
      "title": "Simply ... WOW!",
      "content": "Greetings from Lithuania.What a wonderful pilot!First i read some reviews before watching pilot, and they where saying how \"boooring\" this episode was. Hell no! That was one of the best pilots in a ... ever! When you have screenwriter of \"Sopranos\" and Mr. M.Scorsese in a director chair - nothing can go wrong! A pilot of \"Boardwalk Empire\" reminded my of \"Goodfellas\", \"Sopranos\" (i read that behind this show is a writer of \"Sopranos\" after watching pilot) and ... \"Departed\" - it's was THAT good.If this show will live up to the pilot - we have a new Emmy winner in all possible categories.Watch it and don't wary about negative reviews - this is a really great show."
    },
    {
      "username": "douglasmcbroom",
      "userUrl": "https://www.imdb.com/user/ur127033612",
      "reviewLink": "https://www.imdb.com/review/rw7041659",
      "warningSpoilers": false,
      "date": "18 June 2021",
      "rate": "9",
      "helpful": "16 out of 18 found this helpful.",
      "title": "\"I Am Not Seeking Forgiveness\"",
      "content": "Boardwalk Empire is a brilliant series, created by Terence Winter and exec produced by Martin Scorsese and Mark Wahlberg. It also showcases the work of director Tim Van Patton and many of the actors involved with The Sopranos-still the G. O. A. T. Yet, whilst Empire is one of the greats, in my book, it is on the second tier of that list. That is mostly because of the 5th Season, but I'll get to that later.Firstly, why it's a great series. Most of the key players are, both on and off the screen, Sopranos alum. Tim Van Patten is the best in the business. Steve Buscemi is compelling in his starring role role as 'Nucky Thompson' the Boss of Atlantic City. Buscemi continues the theme, established by The Sopranos, that character actors can carry a series. Kelly Macdonald also delivers as Nucky's protege-cum-lover-cum-wife-cum-nemesis-cum-friend. The standouts on the supporting cast include: Shea Whigham, Michael Shannon, Stephen Graham, Vincent Piazza, Michael Kenneth Williams, Charlie Cox, Gretchen Moll, Jack Huston, and Michael Stuhlbarg. Also, an admiring nod to the unique characters created by Michael Laciura and Stephen Root. Which brings us to Michael Pitt. What a shame no one wanted to work with him, such that his character was written out at least a season before I believe it was planned. He was a co-star and created a compelling, complicated character.The writing, when it's good, is first rate and unafraid to take its time and develop characters. The sets, costumes and photography are stunning. The attention to period detail is impressive. The story captures family, friendships, loyalty, betrayal, crime, politics, history and race relations-no mean feat. The best episodes of the series can hang their hat on any series' coat rack: 'To The Lost', 'Two Imposters', 'Margate Sands' and 'Farewell Daddy Blues' being my favorites. Best Season: Season 2.Now, let me explain why I only rate it in the bottom tier of first-tier series'. There are too many bad episodes, often back-to-back and sometimes back-to-back-to-back. The writing ranged from brilliant to sketchy to downright boring. My partial list of the worst episodes includes: 'Bone For Tuna', 'Ging Gang Goolie', 'What Does The Bee Do?', 'Resignation', 'Acres Of Diamonds', 'The North Star', 'William Wilson', 'The Good Listener', 'What Jesus Said', 'King Of Norway' and the ENTIRE 5th Season. In fact, I based my rating of a 9 stars on the first 4 Seasons. I would rate Season 5 as 2 stars. The series could have, and should have, ended with a 2 hour Season 4 finale. We did not need the deadly-dull, incessant flashback plot. We did not need to catch-up with the despicable Gillian. We did not need to bring Margaret back into the picture. We did not need Willie's startling and unexplained character turnabout. Season 5, hands down, is the worst season. I also would have preferred an ending for Enoch that mirrored that of the real-life character he was based upon."
    },
    {
      "username": "rukstar69",
      "userUrl": "https://www.imdb.com/user/ur56708603",
      "reviewLink": "https://www.imdb.com/review/rw6246036",
      "warningSpoilers": false,
      "date": "8 November 2020",
      "rate": "9",
      "helpful": "20 out of 22 found this helpful.",
      "title": "Brilliant from top to bottom.",
      "content": "This show is amazing all around such great acting and story line. It's one of those shows that needs time to set things up so if it seems slow and confusing at first try and stick it out. I love seeing all these big time crime syndicates come up and thru the ranks. The way they can transform a set back 100 years with such precision and accuracy is astounding to me. Sopranos is my favorite show ever and you'll see a lot of these actors and actresses in this series."
    },
    {
      "username": "davidnewell-1",
      "userUrl": "https://www.imdb.com/user/ur17810603",
      "reviewLink": "https://www.imdb.com/review/rw6189083",
      "warningSpoilers": false,
      "date": "19 October 2020",
      "rate": "9",
      "helpful": "12 out of 12 found this helpful.",
      "title": "Great series",
      "content": "A must watch series Brilliant acting and story. Thought ending was slightly rushed"
    },
    {
      "username": "nwdean-862-186903",
      "userUrl": "https://www.imdb.com/user/ur48607389",
      "reviewLink": "https://www.imdb.com/review/rw7407915",
      "warningSpoilers": false,
      "date": "4 October 2021",
      "rate": "10",
      "helpful": "22 out of 24 found this helpful.",
      "title": "Excellent",
      "content": "Painful, but the pain is worth it! Defining performances by Buscemi and Williams."
    },
    {
      "username": "Clarence-Worley-86",
      "userUrl": "https://www.imdb.com/user/ur99764910",
      "reviewLink": "https://www.imdb.com/review/rw6988275",
      "warningSpoilers": false,
      "date": "31 May 2021",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Top 2 best shows ever created",
      "content": "Sopranos being number one show in history of television.. and Boardwalk Empire at number 2. That is how amazing this show really is , and the best part is that The Sopranos writers are all over this! If you are thinking about starting this series and being completely amazed please do you won't be disappointed. Some of the best, most iconic characters come from this show. This is absolutely terrific."
    },
    {
      "username": "twelve-house-books",
      "userUrl": "https://www.imdb.com/user/ur82450930",
      "reviewLink": "https://www.imdb.com/review/rw5488971",
      "warningSpoilers": false,
      "date": "16 February 2020",
      "rate": "9",
      "helpful": "14 out of 16 found this helpful.",
      "title": "Never Better",
      "content": "There has never been a mob/mafia film like this one, and there never will be again. Phenomenal writing, dialogue, acting, directing, photography--the works. I only give the series a 9 because many of the sex scenes, and much of the profanity, could have been left out and the story would not have suffered at all. Ultra-violent, authentic dialogue from that era, and touching in many parts."
    },
    {
      "username": "flexi_brain",
      "userUrl": "https://www.imdb.com/user/ur121603670",
      "reviewLink": "https://www.imdb.com/review/rw7586153",
      "warningSpoilers": false,
      "date": "26 November 2021",
      "rate": "10",
      "helpful": "20 out of 22 found this helpful.",
      "title": "A must watch show",
      "content": "This is fabulous. There is so much energy that I can't get my mind off it. The storyline and the performances are simply out of the blue. Mucky Thompson's dialogue delivery is simple too great."
    },
    {
      "username": "gfargas-97361",
      "userUrl": "https://www.imdb.com/user/ur130916080",
      "reviewLink": "https://www.imdb.com/review/rw7453116",
      "warningSpoilers": false,
      "date": "17 October 2021",
      "rate": "9",
      "helpful": "19 out of 20 found this helpful.",
      "title": "Gripping...",
      "content": "Anyone who is interested in the Mafia will love this series. Prohibition era series set in Atlantic City starring Steve Buscemi just makes for a fantastic show. Great acting, great action scenes, sex, manipulation, tragedy, comedy and much more. This show had me hooked from the very beginning and though there were a few problems later on in the show it still never disappoints. Any problems that occurred were definitely made up for and I highly recommend watching all the way through."
    },
    {
      "username": "daycu-",
      "userUrl": "https://www.imdb.com/user/ur147326490",
      "reviewLink": "https://www.imdb.com/review/rw8341136",
      "warningSpoilers": false,
      "date": "16 July 2022",
      "rate": "",
      "helpful": "26 out of 28 found this helpful.",
      "title": "One of HBOs finest shows!!",
      "content": "This show is pure art!! It's easily one of the best gangster dramas out there. From the amazing lead performance from Steve Buscemi, to the precise attention to detail, the casting, and most of all the production design... Man it's just breathtaking at times. Each episode feels like a movie and is very cinematic. Boardwalk Empire can be surprisingly funny at times, but at it's core it remains a very dark lavish show with lots of twists."
    },
    {
      "username": "swyatt-45704",
      "userUrl": "https://www.imdb.com/user/ur110786459",
      "reviewLink": "https://www.imdb.com/review/rw5302659",
      "warningSpoilers": false,
      "date": "6 December 2019",
      "rate": "10",
      "helpful": "71 out of 75 found this helpful.",
      "title": "Phenomenal",
      "content": "Terrific from start to finish. Can't say enough about how entertaining this show is."
    },
    {
      "username": "wwe7961",
      "userUrl": "https://www.imdb.com/user/ur23619158",
      "reviewLink": "https://www.imdb.com/review/rw2349288",
      "warningSpoilers": false,
      "date": "6 December 2010",
      "rate": "10",
      "helpful": "69 out of 93 found this helpful.",
      "title": "A brilliant crime story filled with flare, emotion, and memorable characters.",
      "content": "I am not a big TV lover. Mostly I watch South Park, but this show has gotten me interested in more live-action shows. It tells its stories with the same quality as a normal theater film for each episode making it feel like a massive crime drama experience. I have been waiting for a while now to review it, and now that the first season is over I can make my honest opinion clear. I live on a barrier island in New Jersey named Long Beach Island. It is about an hour drive away from Atlantic City so as you can guess I've been there a few times. My favorite part about Atlantic City is the boardwalk. Since this show is named Boardwalk Empire it should do a good job at showing what it looked like back in the 20's. Simply put it captures the 20's perfectly. The show is directed so well I felt like I was transported back to those days. They also capture the feel of the 20's in other ways by showing historic events such as the World Series scam. In the end though it best captures the spirit of the 20's on the boardwalk. As for the plot it is set in the 1920's. Prohabition has begun starting a whole decade of illegal alcohol smuggling. The Treasurer of Atlantic City Nucky Thompson is starting a smuggling business that results in some bloody consequences. Along the way he meets a woman named Mrs. Schroeder, deals with an oncoming election, and more. It is a very well told story. It manages to tell several different stories throughout the show, but none of them feel underdone. They all are extremely well put together story lines. You have the main alcohol smuggling story, the story of Nucky and Margaret, the story of Jimmy, the story of Capone, the story of Lucky, the story of Eli Thompson, the story of Agent Nelson Van Alden, and many more. All these different stories keep things fresh. The emotions that are shown in the episodes are powerful. As the episodes go on emotions get stronger like layers of an onion. Something that is also present in this show is flare. Every gangster flick needs that style to it. It needs to have that gangster feel. While this show doesn't have a lot of that when it happens it is really cool. Now I end this review on the acting. Everybody does a swell job. Buscemi is great as usual, and everyone else is great. The person who I'm most interested in is Michael Pitt who is a relatively unknown actor, but here is great and I would like to see him other things. He could make it real big. Overall I love this show. I will be a viewer of the next season for sure."
    }
  ],
  "errorMessage": ""
}