{
  "imDbId": "tt0112130",
  "title": "Pride and Prejudice",
  "fullTitle": "Pride and Prejudice (TV Series 1995–1995)",
  "type": "TVSeries",
  "year": "1995",
  "items": [
    {
      "username": "wisewebwoman",
      "userUrl": "https://www.imdb.com/user/ur0509769",
      "reviewLink": "https://www.imdb.com/review/rw0973978",
      "warningSpoilers": false,
      "date": "7 December 2004",
      "rate": "10",
      "helpful": "223 out of 229 found this helpful.",
      "title": "An annual DVD event for me.",
      "content": "Watching this is a celebration of how Jane Austen should be interpreted.This version is true to the novel and true to the characters and the wonderful tension between Elizabeth and Darcy is beautifully depicted.Not for a moment do you think that these two are not meant to be together.The Austen wit of both the main characters and the minor roles are strongly projected and the costumes and sets are faithful to the era of Austen's writing.There is an incredible scene where Elizabeth is playing the piano and her eyes meet and hold on Darcy's who is at the other end of the room. Now, for me, that is one of the most sexy and sensual scenes I have ever seen. Everything is flawless about this production.Superlative, satisfying and stunning.Do not miss it. 10 out of 10."
    },
    {
      "username": "Wulfstan10",
      "userUrl": "https://www.imdb.com/user/ur3483002",
      "reviewLink": "https://www.imdb.com/review/rw1034998",
      "warningSpoilers": false,
      "date": "7 March 2005",
      "rate": "10",
      "helpful": "307 out of 313 found this helpful.",
      "title": "Hard to Beat",
      "content": "This version of Pride and Prejudice is simply outstanding and excels in essentially every aspect. It is faithful to the book, particularly capturing the spirit of the book and the energy and constant tension of the story. It excellently portrays the world of the book as it relates to the story, with keen attention to the details of costume, the furniture, etc. Moreover, the actors were on the whole outstanding. I fail to see how anyone could have portray Darcy better than did Colin Firth, who perfectly captured the character's aristocratic refinedness, his shyness and sense of decorum that come across as apparent stuffiness and disdain, and his underlying passion, all at the same time. He perfectly blends all these different traits and is utterly convincing in portraying the outward stiffness as a simple facade for the strong emotions and character underneath, rather than simply being stiff and wooden. His looks, and especially his eyes, say so much of the complexity of his character and his feelings with subtle expressions. Similarly Jennifer Ehle excellently portrays Lizzie, showing her to be tender, witty, thoughtful, occasionally prone to strong judgments without all the information, yet trying to grapple with different feelings as her involvement with Darcy, et al., progresses. David Bamber is great as Mr. Collins and perfectly conveys his mix of traits. Alison Steadman's histrionics and fickle opinions are wonderful as the mom, and remind me very much of an actual relative of mine, while Benjamin Whitrow is a great counterpart as the father who is outwardly usually calm and peaceful, yet always able to rile up his wife. The others are great, too, but there is no point in listing them all. The bottom line is that I find it hard to beat this production, which is utterly gripping and keeps anyone interested in these stories completely entranced the whole way through."
    },
    {
      "username": "Rosabel",
      "userUrl": "https://www.imdb.com/user/ur0363779",
      "reviewLink": "https://www.imdb.com/review/rw0353935",
      "warningSpoilers": false,
      "date": "9 July 1999",
      "rate": "10",
      "helpful": "239 out of 250 found this helpful.",
      "title": "Perfect book, perfect film",
      "content": "A female journalist once wrote that no actress could ever portray Elizabeth Bennet to the satisfaction of a woman viewer for one very simple reason: every woman really visualizes herself in that role. Jennifer Ehle has done the impossible - she is, and in my mind, forever will be, Elizabeth. The beauty, wit, and sparkling liveliness of the character are perfectly captured in her performance. And Colin Firth's Mr. Darcy is an exact match for her. His smoldering good looks are wonderful, and he can portray reserve without descending into woodenness and blankness. The scene where he and Elizabeth dance a long and stately dance together in the midst of a crowd is both controlled and exciting - with very little change of tone, and while preserving the most correct decorum, their conversation reveals dangerous undercurrents of emotion, and meanwhile the steps of the dance keep pulling them together and apart again. The rest of the characters are equally fine - David Bamber's obsequious Mr. Collins is especially unforgettable."
    },
    {
      "username": "pekinman",
      "userUrl": "https://www.imdb.com/user/ur4303406",
      "reviewLink": "https://www.imdb.com/review/rw2108260",
      "warningSpoilers": true,
      "date": "8 August 2009",
      "rate": "10",
      "helpful": "26 out of 26 found this helpful.",
      "title": "A great adaptation of Jane Austen",
      "content": "This version of 'Pride and Prejudice ' is one of the greatest adaptations of any classic book that has yet been filmed. This is due in large part to the masterful screenplay written by Andrew Davies. He has managed to lace together all the pertinent dialogue scattered about the chapters into cogent conversations without resorting to anachronistic modernisms. This allows the film to flow seamlessly and in a very satisfying manner. A great cast of actors has been given a fine script and they all turn in great performances. I wondered at the wild, over-sexed behavior of the youngest Bennet daughter, Lydia, here acted by Julia Sawalha. She is allowed to display her wide-ranging, formidable comedic talents. I especially loved the little snort she emits in an early scene, displaying that she is truly her mother's favorite daughter and very much like her. Mrs Bennet, played hilariously by Alison Steadman, is a vulgar, loud and ostentatious woman and I liked her very much in this part.Mr Bennet, the long-suffering patron of this family is played with laconic humor by Benjamin Whitrow, a piece of perfect casting. Jennifer Ehle is splendid as Elizabeth Bennet, the heroine who gets her man in the end, as they always do in Austen's novels. I won't belabor the countless nuances of her characterization other than to say that she is deeply satisfying at every level. Her elder sister, Jane, is played by Susannah Harker ('House of Cards') with a sweetness that stops just short of simpering.The middle daughter, Mary, is an early prototype for the first suffragettes. Lucy Briers had quite a challenge to make anything of Mary who is often relegated to the background. But Briers sets the tone for one of the most hilarious scenes in any film I've ever seen; the dinner party at the Netherfields Ball where she entertains the guests by singing and playing atrociously. Note Anna Chancellor (Miss Bingley) in this scene. I burst out in loud guffaws at her reactions.Anna Chancellor was an inspired piece of casting for Miss Caroline Bingley the aristocratic and condescending sister of Jane Bennet's beloved. Miss Bingley is an interesting character. The Prejudice against her is immediate, on the part of Elizabeth, as Miss Bingley is aloof and fork-tongued. But she is really a good person who tells the truth. It's just that she is a product of her highly sheltered and sophisticated environment and \"comes off\" snooty and vindictive. Colin Firth is ideal as Mr Darcy the romantic interest of Elizabeth Bennet's life. Tall, handsome, well set-up, intelligent and gentle, Firth's portrayal possesses all the traits of a high-born gentleman. He is NOT a snob but he is aloof and easily bored. Not unusual in a very intelligent person. However, Elizabeth's Prejudice, out of ignorance of Darcy's life, seems a worse misdemeanor than his Pride which seems like arrogance but isn't.David Bamber ('Heavy Weather') portrays the obsequious Reverend Collins with oily unctuousness. Collins is funny, yes, but also maddening in his obtuse inability to comprehend the feelings and thoughts of anyone besides himself. Only his new wife, Charlotte Lucas, comprehends his nature and finds happiness in her life with him. Charlotte is one of those characters, along with Jane Bennet and Mrs Gardiner, who occupy points of equilibrium and sensibility to their environments. When any of these 3 women are holding forth one senses serenity in the atmosphere that stops the whirling dizziness of most of the characters' states-of-mind.Barbara Leigh-Hunt turns in a masterful performance as the monstrous bitch Lady Catherine de Bourgh. Such spite and malice as Lady Catherine possesses is spat out with acidic nastiness. Her first scene when she meets Elizabeth is also extremely funny.There is a minor masterful performance from Harriet Eastcott, who plays nursemaid-companion to Lady de Bourgh's sickly daughter. Without uttering a word Ms Eascott conveys volumes as to the put upon, subservient and terrified situation of Mrs Jenkinson.One of the great delights of this mini-series is how it takes its time to actually observe this long-dead society. The ball scenes are gorgeously executed. The choreography of those intricate and beautiful dances is hypnotizing. There are long periods where the camera watches these dancers, moves about among them. It is beautiful to behold. The actors must have been sorely challenged to deliver their lines in such a natural manner and yet having to time them to fit the complicated steps they have to perform.All the technical aspects of this film are superb, especially the editing. The forte-piano playing of Melvyn Tan glues the entirety together. Simon Langton's direction is so good as to be invisible. I cannot praise this version of 'Pride and Prejudice' enough. It is one of the two great Jane Austen adaptations on film, along with Roger Michell's wonderful version of 'Persuasion' with Amanda Root and Ciaran Hinds."
    },
    {
      "username": "ROCKY-19",
      "userUrl": "https://www.imdb.com/user/ur0145613",
      "reviewLink": "https://www.imdb.com/review/rw0354010",
      "warningSpoilers": false,
      "date": "22 December 1998",
      "rate": "",
      "helpful": "153 out of 164 found this helpful.",
      "title": "It's about time!",
      "content": "After so many years of seeing adaptations of Pride and Prejudice on stage, screen and television, I had long given up hope of an entertaining and faithful adaptation. Then a miracle! Class, style, humor and intelligence is alive and well! Direction, script and cinematography are all exceptional in A&E's production. Imagine watching a six-hour program over and over and over. It has to be done. Jennifer Ehle gives Elisabeth all the archness, tenderness, and homey wit that Austen could desire. Each individual cast member gives a memorable performance that makes the character real. Simon Langton, as director, has a real ear for dialogue and silence. Indeed, it is often the silences in conversation that are the most hilarious. The most serious fault in most previous productions was the casting of Darcy. A stiff actor in a stiff part gives you only a stiff character (even, God bless him, Olivier). If Darcy fails, the entire production is a waste. The inspired casting of Colin Firth in this production was defining. Putting Firth, a naturally lively chap, in the role was like harnessing energy. You can often feel that intensity of containment, which is just perfect for Darcy. This is a must-see for any loyal Austen reader or anyone else who likes romance, wit and social commentary all rolled into one. And pity Emma Thompson's Sense and Sensibility, which opened in the U.S. shortly after Pride and Prejudice debuted. Comparisons were inevitable and did not favor S&S."
    },
    {
      "username": "Qanqor",
      "userUrl": "https://www.imdb.com/user/ur4572257",
      "reviewLink": "https://www.imdb.com/review/rw2395765",
      "warningSpoilers": false,
      "date": "8 March 2011",
      "rate": "10",
      "helpful": "21 out of 21 found this helpful.",
      "title": "Perfection",
      "content": "This is the most pointless review I've ever written here, since there are already tons of reviews, tons of praising reviews, and everything that I might want to say has already been said. So nobody is going to find my review, nobody is going to read it, nobody is going to find it useful. It is for this reason that I've put off writing this for so long.But I watched this series again last week, and I just love it so much-- to the point of reverence-- that I've elevated it into the top echelon of my very favorite movies. For many years now I've been saying I have three favorite movies (North By Northwest, The Music Man, and Airplane), but henceforth I have four favorites. And so I'm finally writing a review, mostly because it bugs me that I wrote reviews for lessor versions of P&P but not this one.This one is the standard by which all others should be judged. Scene after scene, character after character, line after line, it is just perfect. Or so close to it that I'm not going to quibble.But everyone has already gone over its many merits, and there's no point in me repeating those praises. Still, one thing which deserves special comment is the music. The main theme is really, really good; a solid melody, some superb chord changes, and well scored. I've had it stuck in my head now for over a week now. And it's skillfully and effectively worked throughout the production in various variations, if one pays attention.Finally, I have to give strong praise for the extremely minor character of Mary. This is the rare production that really gets Mary right: insufferably moralizing and disdainful (and actually homely, rather than typical Hollywood stick-an-ugly-pair-of-glasses-on-her homely). Poor Mary. She really gets the short end of the stick in the Bennet home. Jane and especially Lizzy are beloved by their father; Kitty and especially Lydia are the mother's favorites. But really, nobody cares very much for Mary. And, not being pretty, the young men officers are indifferent as well. And so, finding little pleasure in the world, she shuns pleasure right back, and retreats into her sermons and books. It always seems like a defense mechanism rather than a true passion. This is the only production I can recall that really brings forth that aspect of the character.Look at this. For a review I wasn't even going to write, I've rambled on far too long. In any case, if you *haven't* seen this production of Pride and Prejudice, do so at once!Also (and perhaps most importantly): It was seeing this series that eventually got me to go back and actually read the *book*. And oh was I delighted I did! If you've never read the original Jane Austen book of Pride and Prejudice, do so at once!"
    },
    {
      "username": "nycritic",
      "userUrl": "https://www.imdb.com/user/ur0384847",
      "reviewLink": "https://www.imdb.com/review/rw1340163",
      "warningSpoilers": true,
      "date": "12 April 2006",
      "rate": "10",
      "helpful": "28 out of 29 found this helpful.",
      "title": "The BBC Version",
      "content": "At 300 minutes, it might seem a bit steep to sit through -- after all, the novel is barely under 400 pages and its plot is concise enough to garner a shorter transition from book form to images. But, when you sit and read PRIDE AND PREJUDICE, widely considered to be Jane Austen's magnum opus, and savor its miniaturist style, its sharp language, the treatment of even its minor characters as a huge tapestry, there is no other way to create a complete vision of the novel but to do a televised re-working of her novel. (The advent of Emma Thompson and the 2005 movie now proves otherwise.) The interesting aspect of the miniseries is that it never feels like it's moving at a crawl. The story of Austen's micro-society develops at its own pace, much like the novel: it's as if the novel had literally come alive and were being acted by the people from FAHRENHEIT 451, complete with costumes and settings. We meet the Bennets right at the beginning when they discuss how Netherfield is to be let at last, and that its owner is none other than an eligible bachelor. Elizabeth, the second eldest Bennet herself is the one who utters the opening line of Austen's book -- and it's appropriate that she be the one who does so: listen to how she says it, not to when she does or who she does to.The arrival of such a man causes an uproar it the small community. Charles Bingley is a congenial man, personable, but has some odious sisters, Caroline and Louisa Hurst. His friend, Mr. Darcy, is also eligible and ten times richer than Bingley, but is soon to be revealed to be someone disagreeable. At the ball, Jane Bennet becomes close with Charles (much to her mother's delight) and Elizabeth seen to be a little taken with the imposing nature of Darcy, but his aloof nature and continuous rebuffs, plus a harsh commentary he makes of her within earshot hurts her deeply: her pride has been hurt; hence, from now on, she will have nothing to do with him.But fate has her meet him again when Jane falls ill after she gets called to spend an evening with Bingley and his sisters. While Darcy seems to be taking a repressed liking to Elizabeth, she is unaware of it, and grows increasingly hostile towards him, particularly after learning from George Wickham that he behaved quite badly towards him. In the middle of this, and because the Bennets have no son, the girls stand no chance of inheriting. Their property has been entailed to a male heir. Reverend Collins comes looking for a wife, proposes to Elizabeth, gets rebuffed, and winds up marrying Charlotte Lucas -- Elizabeth's best friend. On top of this, the Bingleys leave Netherfield, and Jane's future is left up in the air.Eventually the plot reaches a head, and like the novel, it occurs midway. Jane Austen must have been aware at an empiric form that editing can balance out a work and enhance its effect, because in putting the crisis of the action halfway she establishes that Elizabeth and Darcy will have to shift towards each other in a realistic way, the same way other events will allow Jane and Bingley to consummate their union. This is what makes this story so enduring -- everything in it is realistic as possible, adhering to what society's attitude towards woman and men of their time was, where marriage was taken as serious as a retirement plan or having medical benefits. The miniseries captures the slow breakdown of Austen's plot in a way that could have been stagy but is not. Not one thread is left untold, unlike the 1940 version (despite the presences of Laurence Olivier and Greer Garson) where the story looked a little more like farce and characters in the book behaved much differently in that film version. Jennifer Ehle and Colin Firth are perfect in their renditions of Elizabeth and Darcy. She resembles an earthier version of Meryl Streep down to her voice and mannerisms; he is as aloof as alluring. Who wouldn't believe they didn't have what it took to merge together? Both have to do much acting without expressing much if at all, yet Ehle brings a nice iconoclastic attitude towards her character, the same way Firth embodies masculine arrogance.Now, with the 2005 film version having got the praise it did, there will be people who prefer this version to the movie version and vice versa. There may be Olivier purists who will balk at such a long version. Having read the novel several times, I can relate to this one best because it retains pages of dialog intact without making it too talky and that's a tricky thing to do. Minus Alison Steadman's character, everyone is at a uniform level, but Steadman is a shade too shrill. While Mrs. Bennet wasn't the most agreeable person in the world, I believe that she has been represented better in the movie version because while still being a hyperactive, over-emotional woman, she was aware her daughters would be left destitute if they did not marry well. Even so, she does have a delicate tightrope to walk and I found myself liking Mrs. Bennet in the end and understood she was also a part of this enormous tapestry that Austen herself had woven so lovingly."
    },
    {
      "username": "keng5",
      "userUrl": "https://www.imdb.com/user/ur4478403",
      "reviewLink": "https://www.imdb.com/review/rw1086930",
      "warningSpoilers": false,
      "date": "23 May 2005",
      "rate": "10",
      "helpful": "191 out of 195 found this helpful.",
      "title": "Doing justice to Jane Austen.",
      "content": "This is a drama to rave about. I've not seen its like on television before; nor do I expect to see its like again. It was superb. It was almost perfect - though not quite.It is rare to find a Jane Austen dramatisation that comes so near to being perfect on every level and that stays so true to the original novel. The greater part of the dialogue in the series is Jane Austen's own and every scene is included and follows the same chronological order. The drama departs from the novel in only two instances. In order to extend our knowledge of the characters of Darcy(Colin Firth), and Mr Collins(David Bamber), two scenes are added; to demonstrate that Darcy is not just an effete aristocrat but a real man worthy of Elizabeth's love we are shown him indulging in manly pursuits; fencing, and swimming in his private lake (it puzzles me why so many women seem to drool over his wet-shirt scene); and to demonstrate that Mr Collins is an idiotic, narrow- minded prude we are shown him trembling with embarrassment and horror when he happens to come across Lydia (Julia Sawalha) in a state of dishabille. David Bamber makes Mr Collins deliciously toadying and obsequious. A remarkable piece of acting.It is its faithfulness to the original that makes this drama so good. No one has ever written a more tightly plotted novel. Its series of climaxes make the novel difficult to put down; just as one plot-line reaches its climactic conclusion, another is building. And the duel of wits and sharp dialogue between Darcy and Elizabeth (Jennifer Ehle) as they get to know each other is entrancing. And then comes that moment. She is at the piano befriending Darcy's sister, Georgiana (Emilia Fox), when he holds her gaze with a silent declaration of his love and admiration. This involved a fine piece of editor-timing; a split second either way, either too long or too short, and the poignancy of that moment would have been lost. It is interesting to compare Colin Firth's Darcy with that of Lawrence Olivier's Darcy in the Hollywood film. Olivier falsely portraits him as appealingly shy and self-conscious. But Darcy was in no way shy, he was just proud, with every reason to have a good opinion of himself. He found it impossible to imagine that anyone in a lower strata of society, living in a small provincial town, could be his equal - until he met Elizabeth!However, I felt there was one weak link in the chain of superb acting; Alison steadman. Many will disagree but I think she over-acted, turning her Mrs Bennet into a nerve- grating, neurasthenic caricature. But apart from that, I heartily recommend this video. Don't miss it. You'll not see its like again. I must just mention the charming piano music by Carl Davis, so beautifully evocative of a beautiful period in history (for the rich)."
    },
    {
      "username": "SimonJack",
      "userUrl": "https://www.imdb.com/user/ur17816293",
      "reviewLink": "https://www.imdb.com/review/rw2999966",
      "warningSpoilers": true,
      "date": "17 April 2014",
      "rate": "10",
      "helpful": "14 out of 14 found this helpful.",
      "title": "Excellent series of Austen classic not likely to be bettered",
      "content": "Of the several versions of \"Pride and Prejudice\" I have seen, this 1995 BBC mini-series is by far the best. First, it gives us more of the story than any other version, with 5 ½ hours of film time. The 1980 minis- series was more than an hour shorter; the 1940 film was under two hours; and the 2005 film was barely two hours. Second, it develops all the characters more fully, including the lesser supporting roles. Third, its script additions to the story seem to fit best Jane Austen's style and plot, so they enrich the story where otherwise we would have holes. Austen said she didn't know the manners and behavior of men when they were not in the company of women. So she didn't write scenes or situations with just men in them. Writer Andrew Davies wrote some excellent filler for this film. The opening with Darcy and Bingley riding their horses across fields to see Bingley's new country home is a great introduction. Toward the end, we have another perfect scenario. Darcy rides to Pemberley a day ahead of his entourage. He stops to cool off with a swim in his lake, and then bumps into Elizabeth as he walks up to his house in dripping wet clothes. It is a more human way for the couple to meet to rekindle their relationship. Here, on his home territory, he loses his shyness and begins to warm up. Everything about this film excels. But the script and acting raise it above all other versions. Those who see P&P simply as a romance or love story will be satisfied with the shorter movies. For sure, it is a beautiful story of love, especially two loves. But those loves are ensconced in a critique of society and the times. Austen deals with social mores, the class system of the time, families, marriage and morality, manners and respect, and vice and virtue. And, it's how she works all this together that gives depth to the story. This film gives us the greatest satisfaction with how the love stories turn out.Most – but not all – of the characters in this version are the best portrayals among all the P&P films made. Most viewers admire Jennifer Ehle and Colin Firth for their roles. But some others are equally good, and I think a couple are very exceptional performances. For sure, Ehle is superb as Elizabeth. With her constant smile and eyes she shows restraint in her silence at times, and wonderful wit in her barbs at other times. Firth, better than anyone else in the role, shows Darcy's frustration at times over his social shyness. His consternation is very noticeable at not being able to break the ice with Elizabeth as his attraction for her grows.Lydia and Kitty have much more screen time here with their childishness. It gives us a better sense of how Mr. Bennett felt as the father of the silliest girls anywhere. Mr. Bennett is best played here by Benjamin Whitrow, although Moray Watson was very good as well in the 1980 mini- series. Whitrow shows the right amount of disdain, affection, hurt and withdrawal. It's clear why Lizzie likes him, because of his clear-headedness, but she also rues that he has lost respect for his wife. Crispin Bonham-Carter seems best fit for the part of Mr. Bingley, both in physical appearance and in his persona. The Bingley sisters don't stand out in one particular film. But Anna Chancellor has more time to develop her character here, and gives a biting portrayal of the caustic Miss Bingley. All of the roles of Jane have been very good; but a nod goes to Susannah Harker in this 1995 film. She is more naturally shy in her humility and goodness. The character of Wickham is played well in all versions; but again, Adrian Lukis really shines in this one. We see the uncertainty in his face as he learns from Lizzie that her views of Mr. Darcy are changing. Charlotte Lucas is played best here by Lucy Scott. She seems more natural, yet uncomfortable with her appearance. She is adroit in her observations and in the knowing exchanges she has with Lizzie. The only role I didn't think was very good or right was that of Lady Catherine de Bourgh. Barbara Leigh-Hunt seems way too old to have a young teenage daughter. Judy Parfitt nailed that role in the 1980 mini-series. I saved for last the two roles I think excel the most – even above those of Elizabeth and Darcy. No one in any other version comes close to the outstanding performance Alison Steadman gives here as Mrs. Bennet. She put such exuberance and flighty vitality into the role of the silly, nearly hysterical housewife, that it was hard not to dislike her. We can empathize with Mr. Bennet and understand how he came to lose respect for her. Steadman brings her consummate acting abilities to the part and engages viewers to feel real embarrassment for her. That is great acting. And, that's what Elizabeth begins to see toward the end. Finally, Mr. Collins. David Bamber's interpretation is likely the most difficult of any Austen role to play. Did Jane Austen write or envision him as such a wimpish and puerile person? Clearly, she wrote some criticism, if not sarcasm, for the church of the time in its relationships with the classes. Bamber's portrayal of Collins helps focus on that issue. This film gives a much better view and treatment of this character than any other film. So much went into the making of this series, and it is nearly perfect in all aspects. It's hard to imagine that any attempt will even be made to try to better this version of \"Pride and Prejudice.\" It is the classic film rendition of a great classic novel."
    },
    {
      "username": "Adriane",
      "userUrl": "https://www.imdb.com/user/ur0153547",
      "reviewLink": "https://www.imdb.com/review/rw0353990",
      "warningSpoilers": false,
      "date": "30 April 2001",
      "rate": "",
      "helpful": "94 out of 108 found this helpful.",
      "title": "Very true to the book (that's why it was worth watching)..",
      "content": "I am a college student and I love reading classic literature. Jane Austen is one of my favorite writers of all time, and I was very happy with the movie versions of both Emma (with Gwyneth Paltrow) and Sense and Sensibility (with Emma Thompson & Kate Winslet). Both of the books are classics, and the movies are very true to their predescesors. This was no exception. I have read the book, and loved it, and I absolutely loved this mini-series. I was told by my English professor that it was the best version, and I was not happy with the version with Laurence Olivier. The cast was perfect, and how I loved seeing the relationship between Elizabeth & darcy unfold! One of the best 5 hours ever spent on a movie. 10/10"
    },
    {
      "username": "Tom_Benton",
      "userUrl": "https://www.imdb.com/user/ur3633883",
      "reviewLink": "https://www.imdb.com/review/rw0354097",
      "warningSpoilers": false,
      "date": "29 June 2004",
      "rate": "10",
      "helpful": "70 out of 72 found this helpful.",
      "title": "Quite simply the most flawless thing I've ever seen.",
      "content": "Much had I heard of Jane Austen's legendary classic, \"Pride and Prejudice\", and so to kick off my summer I set about reading it. It was possibly the greatest book I'd ever read. I looked up the different screen adaptations of it, and found that Colin Firth had starred in one (I previously enjoyed him in \"Bridget Jones's Diary\" - which is, in fact, a semi-remake of Austen's tale - and \"Love Actually\"). So I traveled to my handy-dandy Borders store and picked up a DVD copy. As I walked out of the store, I hoped that I hadn't wasted $40 for this thing. And you know what?It was worth every last penny.\"Pride and Prejudice\" is quite simply the most flawless thing I've ever seen. The story involves Elizabeth Bennet (Jennifer Ehle), who's opinion changes greatly of a seemingly very proud, rude man that moves into town. To sum up the whole story would be impossible, as there isn't really a simple lot.First of all, let's examine the overall look of the thing. Simon Langton's direction is excellent, and he succeeds in getting the most breathtaking views of everything and anything. The production design and costuming is perfect, capturing the time without error, and the locations are simply gorgeous. Carl Davis' score is terrific and fitting (also to the times). Andrew Davies' script brings every last scene from the book and then pops in some new, being as absolutely faithful to the book as anyone could hope to be.But now on to the casting. The cast is outstanding, although the film's one problem (albeit a very slight one) is the role of Mrs. Bennet, who - although wacky in the book - is completely over-the-top here and quite frequently even annoying. But the stars of the film couldn't be better. Jennifer Ehle is absolutely wonderful as Lizzy Bennet, and her eyes are so dazzling that they mesmerized me throughout the whole 300 minutes! The show is completely stolen, however, by Colin Firth as Mr. Darcy. Colin Firth is not just playing Mr. Darcy; Colin Firth IS Mr. Darcy. He was born to play this role, and plays it so flawlessly, that it deserves to be considered one of the best performances any actor has ever given. Words cannot describe Firth's perfection as Darcy.All in all, \"Pride and Prejudice\" is the greatest thing ever to air on television, and were it a film, it would be the greatest film of all-time. Those of you who have read the book shouldn't worry a bit about the long running time of the mini-series; as impossible as it seems, you shan't even notice. When I finished the series, I had such a feeling of satisfaction as no entertainment has ever before granted me.This is perfection."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw2681577",
      "warningSpoilers": false,
      "date": "30 September 2012",
      "rate": "10",
      "helpful": "18 out of 19 found this helpful.",
      "title": "Perfection.",
      "content": "Having read Jane Austin's novel and seen several other versions of the story, it's easy to believe that I adored this 1995 mini-series. Most of it is because Austin's book is one of the best and most beloved of the 19th century--and all the films try to cram all this wonderful material into only two hours (more or less). You simply cannot rush the great story and so many plots and subplots are omitted or rushed in other film versions. Here, however, there is five entire hours and the story is given what it deserves. It also deserved wonderful locations, acting, costumes and a screenplay--all which it has here.My advice is to see the other film versions--they're all pretty nice (even the Bollywood film \"Bride and Prejudice\"). Then, buy yourself a copy of the 1995 mini-series, curl up and give it your undivided attention. Don't be surprised if five hours later you are finishing the film and using a few Kleenex! See this film!"
    },
    {
      "username": "k-king2",
      "userUrl": "https://www.imdb.com/user/ur2392553",
      "reviewLink": "https://www.imdb.com/review/rw0354099",
      "warningSpoilers": false,
      "date": "12 July 2004",
      "rate": "10",
      "helpful": "49 out of 51 found this helpful.",
      "title": "A masterpiece!",
      "content": "First let me state that I am a 30 something male who generally does not like chick flicks. I have not seen any other version nor read the book. The mini-series is just perfect. It is a fantastic love story that is witty, charming, and very funny. I am not sure how many times I have watched it now, at least 5, and it improves with each viewing. The story and characters are so rich and interesting and the acting is just superb. I have a Top Ten list of movies/shows based on the premise that you are stuck on an island and can only bring 10 movies with you to watch for the rest of your life. This version of Pride and Prejudice has a permanent spot on that list. I rarely give 9s when voting here and I give this a 10! If you like period pieces, good acting, or a great love story then this is a must see!"
    },
    {
      "username": "denis888",
      "userUrl": "https://www.imdb.com/user/ur11215533",
      "reviewLink": "https://www.imdb.com/review/rw1417194",
      "warningSpoilers": false,
      "date": "11 July 2006",
      "rate": "10",
      "helpful": "12 out of 12 found this helpful.",
      "title": "Classical masterpiece made a fantastic movie",
      "content": "If there's a film that may be voted one of the best screen adaptations, then Pride and Prejudice is the one. From the very beginning, from the opening captions and sounds of the clavichord, you are tuned to a wonderful atmosphere of the 19th Century Britain. Everything is a winner in this excellent serial. Think of Mr. Bennet  cold, reserved, true English gentleman, kind at heart and somewhat ice on the surface. Think of absolutely unbeatable Miss Elizabeth Bennet, played by Jennifer Ehle, and here you see the marvelous portrait of a witty, smart, clever lady in full glory. And do not forget of Mr. Darcy, mastered by excellent Colin Firth  what a brilliant role! He looks so proud, so conceited at first, but then, as the film progresses, he warms up a little and becomes a charming elegant knight. One of the best roles is there of Mrs. Bennet, she is so convincing that you almost have to pinch yourself reminding that it is only a film! Every part in the film  Lady Catherine De Burgh, Lydia, Kitty, Jane, and Mr. Bingley  is excellently chosen and played with an exquisite touch that says much about the classical British film school. Scenery is another achievement here, one may only admire and contemplate over the majestic hills, green pastures and severely looking castles all around. Dances, costumes, music, mimic, manners, even language and food  all is executed with a precision that awakes admiration only. Solid 10 points  a masterpiece!"
    },
    {
      "username": "Red-125",
      "userUrl": "https://www.imdb.com/user/ur0442119",
      "reviewLink": "https://www.imdb.com/review/rw3629912",
      "warningSpoilers": false,
      "date": "29 January 2017",
      "rate": "9",
      "helpful": "11 out of 11 found this helpful.",
      "title": "Excellent version of a great novel",
      "content": "\"Pride and Prejudice\" (1995) is a BBC TV mini-series directed by Simon Langton. Pride and Prejudice is probably Jane Austen's most popular novel, and it comes to life in this film. (If you haven't read the novel, I would try to find a synopsis. The plot is complicated. Characters appear and you're not always certain where they fit in, or to whom they are related.)Jennifer Ehle portrays Elizabeth Bennet, the second of the five Bennet sisters, and the one with the most intelligence and the best grasp on reality. Susannah Harker plays Jane Bennet, also intelligent, but more gentle and loving than her younger sister. There are three other sisters, but only one of them figures prominently in the plot. Alison Steadman portrays Mrs Bennet, who is extremely foolish, but, in truth, is sometimes right.Important male characters are Benjamin Whitrow as Mr Bennet, who has not an ounce of romance in him, but respects his two older daughters.The male characters include Colin Firth as the brooding, fabulously wealth Mr. Darcy. Crispin Bonham-Carter portrays Mr. Bingley, also rich, but under Darcy's spell. Adrian Lukis is Mr. Wickham, who is able to charm everyone, until they know him better. David Bamber is the insufferable Mr. Collins.No one can deny the greatness of Jane Austen's book, and I think it will be considered a masterpiece as long as people read English novels. For IMDb, we reviewers have to review the film version of the novel. How well did the director and the actors reflect Austen's written word?I think that this version is a wonderful interpretation of the novel. The plot revolves around Elizabeth, and I think Ehle's portrayal is masterful. In the novel, she is considered attractive, but not conspicuously beautiful. (Jane is considered the great beauty.)What makes Ehle's acting wonderful is the expression in her eyes, and her beautiful smile. That smile tells us of her character. It's not a full cheerful smile--it's the smile of a woman who knows what is happening to her, and around her, and smiles in understanding.Colin Firth is an excellent actor. Maybe he broods a little too much, but who can say whether Jane Austen had that much brooding in her mind when she wrote her novel. One of our friends told us that the moment when Firth emerges from swimming in the lake, with his elegant white shirt clinging to his body, represents one of the great iconic moments of BBC television. I can accept that.We saw the film on the small screen. It was made for television, so clearly it should--and does--work well. However, if it's ever shown in a theater, I'd go to see it on the large screen. That's because the BBC production values are so high that the colors and scenery of the countryside would be shown to better advantage on a large screen.This 1995 P&P is a longer and better version of the 1980 version that I've also reviewed. However, the earlier version also has a great many good points. My suggestion--see them both."
    },
    {
      "username": "voltage11",
      "userUrl": "https://www.imdb.com/user/ur3494136",
      "reviewLink": "https://www.imdb.com/review/rw1071571",
      "warningSpoilers": false,
      "date": "1 May 2005",
      "rate": "10",
      "helpful": "18 out of 18 found this helpful.",
      "title": "Capital! Capital!!!",
      "content": "You just don't get much better than Pride and Prejudice, whether you're reading the book or watching the mini-series. I first saw P&P about four years ago, and it was my first taste of Jane Austen. It opened the world of classic literature to me and film adaptations of those classics.Now, of course, five and a half hours is a LONG time...but all the more to sit through! When you love something, it's fabulous to have it extended for as long as possible. This version is right on with the book; the conversations were practically ripped from the pages. If you've been a faithful fan of the book, you can rest easy that this is a faithful adaptation.As for the actors, it's hard to find anything bad to say. Jennifer Ehle and Colin Firth portrayed Lizzie and Mr. Darcy perfectly, and I have no qualms with putting their faces to the characters when reading the book. In fact, I can't think of one person I could complain about...they were all well suited.This is very light-hearted, wholesome entertainment that has become a favorite of nearly everyone who I've seen it with...including my dear dad. Well, not a favorite for him, but he enjoyed it very much! If you don't think you can sit for almost 6 hours, take it in spurts...although I have yet to see a friend ask me to stop if from boredom. Even my sister's ex-boyfriend sat through all 6 hours and enjoyed it. We've been lucky with men around here, apparently. ;) If you enjoy this, I also recommend Sense and Sensibility. Happy viewing!"
    },
    {
      "username": "taloolah",
      "userUrl": "https://www.imdb.com/user/ur7958834",
      "reviewLink": "https://www.imdb.com/review/rw1215964",
      "warningSpoilers": false,
      "date": "14 November 2005",
      "rate": "10",
      "helpful": "50 out of 51 found this helpful.",
      "title": "All- time favourite",
      "content": "this will be very biased - I love this series and practically know it by heart. When my video tape was wrecked from rewinding, I finally got myself the DVD... and still love to watch it.This is the most complete adaption of the novel, and there are so many lovable details in it that just make it a very unique movie experience. There are however minor changes, due to the fact that each episode of the series had to be leaving the audience wanting more... but nothing that really differs from the original.The actors are awesome - Colin Firth is and will be the one and only Darcy, and Jennifer Ehle was a wonderful Elizabeth - spirited, lively, yet still always within decorum ( only that her skirts were \" 6 inches deep in mud, I assure you\"). Jane is, although maybe not for our standards pretty, a very classic beauty, and very much in character.The Bingley sisters are wonderfully arrogant, and Bingley is such a nice guy - not the insipid undecided, but rather too much trusting those he holds dear. Mrs Bennet, though annoying, is wonderful, and Mr. Bennet, witty and sarcastic, a perfect choice....in short, the complete cast has so decidedly imprinted upon my image of the characters that I find it hard to imagine anyone else playing that particular role.The movie works very efficiently and elegantly with flashbacks to tell the various sub-plots, yet remains focused on the main actions. The scenery is well made, and the costumes are beautiful. I liked the fact that each actor had a wardrobe just as they would have had had they lived in the time, and not a new dress for each new scene.For us, it may be hard to acquaint oneself with the language of Jane Austen, the rules of decorum of her time, and the social standards and sets of rules. In watching the movie, a lot of these things come clear - visualization as a means of understanding the regency period.On a last note - the music is awesome. I have the opening melody as my cellphone ring ever since my Cellphone was able too...;) There are so many little details, over which discussions can be lead for hours and hours, or pages and pages, and this s one of the best parts about the movie - although it gives an interpretation, it is not finite. A perfect movie to visualize the novel,and a must-see."
    },
    {
      "username": "nowego",
      "userUrl": "https://www.imdb.com/user/ur16749093",
      "reviewLink": "https://www.imdb.com/review/rw2381078",
      "warningSpoilers": false,
      "date": "6 February 2011",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Perfection",
      "content": "This is one of the few series that I have been able to watch multiple times and not get bored. I am a 40+ male and I have watched this series many more times than my wife. She has watched it once and I have seen it at least 10 times.This is as close to perfection as you can get on many levels. I have read the book a few times and this adaption is so faithful to the book it could not have been done better and hasn't to date in my opinion.The casting is spot on and after seeing all of the other versions of Pride and Prejudice in movie form I cannot see anyone else playing Darcy other than Colin Firth and Jennifer Ehle is flawless as Elizabeth. Alison Steadman as Mrs Bennet and David Bamber as Mr Collins are just sublime. There are many other fantastic actors and characters who just make the series what it is, a must watch for anyone who likes period pieces, but it is also a must see for almost anyone with a brain, there is something in this for everyone no matter what age.This is 300 minutes of exquisite entertainment. 10 out of 10 for me."
    },
    {
      "username": "knightsofneech",
      "userUrl": "https://www.imdb.com/user/ur2160387",
      "reviewLink": "https://www.imdb.com/review/rw0354108",
      "warningSpoilers": false,
      "date": "20 September 2004",
      "rate": "",
      "helpful": "239 out of 250 found this helpful.",
      "title": "Probably the best BBC miniseries made-Austen would be proud...",
      "content": "This adaptation of the Jane Austen novel is really incredible. Set design and costumes are very believable and the acting is practically perfect for most of characters.A few comments on costume: one of the most believable aspects of the details put into this miniseries has to do with the costumes. Elizabeth and Jane are both adorned simple enough to convey a Christian background and some decor and modesty, as they would have properly been dressed during this time, yet the costumers could have expanded their wardrobe as you see many times in American films (the 1999 version of Emma comes to mind here, particularly) and yet at the time, the women would *not* have had 10 different ensembles to wear at special events. I honestly admired the holding back of their wardrobes to a few gowns rather than having gone overboard as you often see! The women who were of higher stature were properly attired in their jewels and every costume fit the character and situation beautifully. This and the musical score are two of the biggest highlights, I felt.I would also like to give props to Jennifer Ehle and Colin Firth who were cast wonderfully. Jennifer was able to convey a sort of devilish satire and quick wit which I thought suited her exceedingly well and accentuated the wit Austen was trying to get across in the novel. Firth held back and it suited his character. He shows a quiet power, a feeling of disdain and complexity in his acting that worked well for the first half of the miniseries and then turned this into admiration and openness later as the story develops. By the time he declares his undying love to Elizabeth you get the impression he is ready to burst open and you breathe a huge sigh of relief for him, yet the energy continues to pulse. Its a great thing to watch..I would recommend this miniseries to anyone, especially those not yet familiar with Austen. This specific miniseries is so well done many people I have watched it with have sparked incredible interests in the intrigues of Austen's works. Good job BBC!"
    },
    {
      "username": "lauraeileen894",
      "userUrl": "https://www.imdb.com/user/ur1680684",
      "reviewLink": "https://www.imdb.com/review/rw1667468",
      "warningSpoilers": false,
      "date": "3 June 2007",
      "rate": "10",
      "helpful": "19 out of 21 found this helpful.",
      "title": "Definitive Jane Austen adaptation",
      "content": "The BBC miniseries version of \"Pride & Prejudice\" will undoubtedly be the yardstick by which all Jane Austen adaptations will be measured. Oh, there have been plenty of entertaining adaptations since then, such as \"Sense and Sensibility\" and the 2005 version of \"P&P\" with Keira Knightley, but it's safe to say that the classic miniseries is the definitive adaptation of a Jane Austen novel. Director Simon Langton captures the essential wit, satire, and suspense of Austen's most character-driven story. Twinkly-eyed, rosy-cheeked Jennifer Ehle makes a delightful Elizabeth Bennett, and she perfectly embodies Elizabeth's finest qualities: cool-headed, headstrong, witty and passionate. Elizabeth deserves to be placed in the same category of strong literary heroines such as Jo March and Scarlett O'Hara. You come to love Elizabeth as you watch her escape an engagement to the repulsive, simpering Mr. Collins (David Babson) and maintain her sanity among her foolish family members, including her hysterical mother (Allison Steadman) and her vapid, boy-crazy youngest sister Lydia (Julia Sawalha, playing the antithesis of her character from \"Absolutely Fabulous\"). The supporting cast is also delightful, including Susannah Harker as Elizabeth's serene and lovely sister Jane, Crispin Bonham Carter as Jane's cheerful suitor Mr. Bingley, and Benjamin Whitrow as cynical Mr. Bennett.But let us not forget the real highlight of \"Pride and Prejudice\": Colin Firth's star making turn as the misunderstood (but no less dashing) Mr. Darcy. Elizabeth initially dislikes Mr. Darcy, but is surprised to find that he improves \"on closer acquaintanceship\". Firth plays Mr. Darcy as a man who is uptight and priggish on the outside, but warm, passionate, and romantic on the inside. Plus, it helps that Firth is criminally handsome and has soulful brown eyes that could melt even the coldest heart (oh, I'm such a girl!). The kiss at the end is one of the tender, romantic kisses I've ever seen on screen\"P&P\" remains true to the spirit of Austen's story, so it doesn't pander to modern audience's expectations (if your tastes run towards explosions and sloppy sex scenes, this is not for you). Yet it remains delicious entertainment for people willing and patient enough to give it a try. Jane Austen, obviously, never lived to see her books made into film, but I think it's safe to say this brilliant miniseries would have made her glow with, well, pride."
    },
    {
      "username": "pri_e",
      "userUrl": "https://www.imdb.com/user/ur0591310",
      "reviewLink": "https://www.imdb.com/review/rw0354011",
      "warningSpoilers": false,
      "date": "11 August 2001",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "Can watch this thousands of times",
      "content": "When I first heard of this movie I hadn't read the book yet so I just scoffed at the idea of it. I finally did read the book and was absolutely moved by it. My favourite movie is the 1996 version of \"Emma\" with Gwyneth Paltrow so I was looking up other titles and just figured since it was acclaimed worldwide I'd check it out for myself. I was addicted to it !! Once I started watching I had to go right through to the end, it was such a brilliant adaption. I thought Jennifer Ehle and Colin Firth had amazing chemistry, they were perfect as Elizabeth and Mr Darcy. The rest of the cast were excellent as well, this is definitely one movie for the romantics and even for comedy."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2199657",
      "warningSpoilers": false,
      "date": "30 January 2010",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Pride and Prejudice-simply sublime!",
      "content": "The book by Jane Austen is amazing, and deservedly one of the best loved books ever. Out of the numerous adaptations I have seen of this fabulous book, this one is what I call the most definitive of the lot. To sum up this adaptation in one word, sublime would sum it up wonders.Everything was perfect, from the period detail, music, acting, direction to the scripting. The adaptation looks exquisite; the photography is crisp, the costumes are gorgeous and the scenery is breathtaking. I loved the music too, I look out for this all the time, and the music was so pleasant and soothing.The direction is stylish, and the script is witty and intelligent while sticking true to the spirit of the book. And of course the performances, everyone involved did superbly. Colin Firth makes a fine Mr Darcy, handsome, dashing and intelligent, and Jennifer Ehrle is an attractive, witty and spirited Elizabeth.Everybody else did just as well, even better in some cases. Particularly Anna Chancellor as Miss Bingley, an inspired choice and plays her like an aloof yet sophisticated sort of character. And Barbara Leigh-Hunt was outstanding as Lady Catherine. David Bamber and Harriet Escott also stood out.Did I have a favourite scene? Not really, I was utterly captivated by it all, but I have to say the ballroom scenes were gorgeous to watch. In conclusion, I am running out of things to say about this adaptation. It was just delightful, and I got so much pleasure watching it. 10/10 Bethany Cox"
    },
    {
      "username": "tazcat39",
      "userUrl": "https://www.imdb.com/user/ur1809659",
      "reviewLink": "https://www.imdb.com/review/rw0354033",
      "warningSpoilers": false,
      "date": "3 August 2002",
      "rate": "",
      "helpful": "81 out of 93 found this helpful.",
      "title": "Mr. Darcy (Colin Firth) Stole my Heart!",
      "content": "Never having read Austen before, I completely fell in love with this A&E mini series and, although I am a senior citizen, with Colin Firth who is wonderful as the Prideful Mr. Darcy. Jennifer Ehle is equally good as the charming but prejudiced Lizzy. I also enjoyed Benjamin Whitrow as the father of \"the five silliest girls in England\" and Alison Steadman's hilarious rendition of Mrs. Bennett. I immediately bought the tapes and have watched them over and over.I recommend this mini series to everyone. It far exceeds the films made of Austen's works. Emma (and Gywnneth Paltrow) pales in comparison with this A&E mini series.I, too, enjoyed Bridget Jones Diary all the more because of Colin Firth's Mark DARCY."
    },
    {
      "username": "ar_brierley",
      "userUrl": "https://www.imdb.com/user/ur96471124",
      "reviewLink": "https://www.imdb.com/review/rw4670971",
      "warningSpoilers": false,
      "date": "18 February 2019",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "BEST version EVER!!",
      "content": "This adaptation has really stood the test of time!! Almost 25 years since it was made, and it's still the BEST adaptation there ever could be. Jane Austen would be very proud. Thank you BBC for this perfect series."
    },
    {
      "username": "engxladso",
      "userUrl": "https://www.imdb.com/user/ur0504293",
      "reviewLink": "https://www.imdb.com/review/rw0353942",
      "warningSpoilers": false,
      "date": "13 November 1999",
      "rate": "10",
      "helpful": "41 out of 42 found this helpful.",
      "title": "best TV series ever!!!",
      "content": "I'm a typical guy I guess. I like football, sci-fi, action movies, but definitely not period romances! I ended up watching it because my wife had it on. I was quickly hooked, much to my surprise. When it came on again (thankyou, thankyou A&E) I was glued to it all from the start to the wonderful climax. But that wasn't enough! Now we have the tapes and watch them over and over again and I have read the book four times! I don't understand why I don't get bored, but I don't. I just totally love it. I'm not really sure why. Maybe its because it is so much more than just a romance.It is so interesting to have a window into the thinking, social mores and lifestyles of early 19th century, rural, genteel England, and to see how very, very different society's attitudes are today. The specific examples of Mr Wickham's disgraceful conduct would not be considered unusual today, but what makes him such a blackguard is how far he stepped beyond the bounds of acceptable behaviour at that time. The central message of the story which I found personally educational is the moment when Elizabeth, having thought herself an excellent judge of human character, while reading Darcy's letter realizes that she has entirely deceived herself with regards to the character of both Wickham and Darcy and that this self deception has resulted from vanity, because Wickham flattered her whereas Darcy insulted her with his \"She is tolerable I suppose, though not handsome enough to tempt me.\"All this is all very well and good but this is not why I love P&P. All the characters come across as real people and they are successful at transmitting all the emotional tension that gradually builds up throughout the six hours. One can really identify with the characters. I would love it if Darcy was my best mate. I mean what a great guy. What a hero. (And an Arsenal supporter too! (in another movie called Fever Pitch)) I love the following scenes:\"You must allow me to tell you how ardently I admire and love you\";\"and when sanctioned by your excellent parents...\" dab dab collapsing sweatily against the doorpost while Lizzie rapidly retreats, finishing his speech to himself \"I am sure that my proposals will not fail in being... acceptable\";\"the Look\" as my wife calls it between Darcy and Elizabeth at Pemberley; the party at Netherfield where most of the Bennets disgrace themselves; Lady Catherine 'refuses her consent';Mr Collins' visit to 'condole' with the Bennets;\"for it has been many months since that I have considered her the most handsome woman of my aquaintance\" so there!;and absolutely the best, \"my feelings are so different, in fact... they are the opposite\". Joy, joy, joy.There are so many others too...I hope this doesn't give too much away to those who haven't seen it. If you haven't seen it, get it. It will be the best money you spend on entertainment all year!To all those who were involved in making this production: Bravo. This was the best ever. It produces the same feelings in me as when Arsenal win the League!"
    }
  ],
  "errorMessage": ""
}