{
  "imDbId": "tt0096639",
  "title": "Lonesome Dove",
  "fullTitle": "Lonesome Dove (TV Series 1989–1989)",
  "type": "TVSeries",
  "year": "1989",
  "language": "en",
  "titleInLanguage": "Lonesome Dove (miniseries)",
  "url": "https://en.wikipedia.org/wiki/Lonesome_Dove_(miniseries)",
  "plotShort": {
    "plainText": "Lonesome Dove is a 1989 American epic Western adventure television miniseries directed by Simon Wincer. It is a four-part adaptation of the 1985 novel of the same name by Larry McMurtry and is the first installment in the Lonesome Dove series. The novel was based upon a screenplay by Peter Bogdanovich and McMurtry. The miniseries stars an ensemble cast headed by Robert Duvall as Augustus McCrae and Tommy Lee Jones as Woodrow Call. The series was originally broadcast by CBS from February 5 to 8, 1989, drawing a huge viewing audience, earning numerous awards, and reviving both the television Western and the miniseries.\r\nAn estimated 26 million homes tuned in to watch Lonesome Dove, unusually high numbers for a Western at that time. The Western genre was considered dead by most people, as was the miniseries. By the show's end, it had earned huge ratings and virtually revamped the entire 1989–1990 television season. A favorite with audiences, as well as critics, Lonesome Dove garnered many honors and awards. At the 1989 Emmy Awards, the miniseries had 18 nominations and seven wins, including one for director Simon Wincer. Lonesome Dove also won two Golden Globes, for Best Miniseries and Best Actor in a Miniseries (Robert Duvall).",
    "html": "<p>Lonesome Dove is a 1989 American epic Western adventure television miniseries directed by Simon Wincer. It is a four-part adaptation of the 1985 novel of the same name by Larry McMurtry and is the first installment in the Lonesome Dove series. The novel was based upon a screenplay by Peter Bogdanovich and McMurtry. The miniseries stars an ensemble cast headed by Robert Duvall as Augustus McCrae and Tommy Lee Jones as Woodrow Call. The series was originally broadcast by CBS from February 5 to 8, 1989, drawing a huge viewing audience, earning numerous awards, and reviving both the television Western and the miniseries.</p><p>An estimated 26 million homes tuned in to watch Lonesome Dove, unusually high numbers for a Western at that time. The Western genre was considered dead by most people, as was the miniseries. By the show's end, it had earned huge ratings and virtually revamped the entire 1989–1990 television season. A favorite with audiences, as well as critics, Lonesome Dove garnered many honors and awards. At the 1989 Emmy Awards, the miniseries had 18 nominations and seven wins, including one for director Simon Wincer. Lonesome Dove also won two Golden Globes, for Best Miniseries and Best Actor in a Miniseries (Robert Duvall).</p>"
  },
  "plotFull": {
    "plainText": "Lonesome Dove is a 1989 American epic Western adventure television miniseries directed by Simon Wincer. It is a four-part adaptation of the 1985 novel of the same name by Larry McMurtry and is the first installment in the Lonesome Dove series. The novel was based upon a screenplay by Peter Bogdanovich and McMurtry. The miniseries stars an ensemble cast headed by Robert Duvall as Augustus McCrae and Tommy Lee Jones as Woodrow Call. The series was originally broadcast by CBS from February 5 to 8, 1989, drawing a huge viewing audience, earning numerous awards, and reviving both the television Western and the miniseries.\r\nAn estimated 26 million homes tuned in to watch Lonesome Dove, unusually high numbers for a Western at that time. The Western genre was considered dead by most people, as was the miniseries. By the show's end, it had earned huge ratings and virtually revamped the entire 1989–1990 television season. A favorite with audiences, as well as critics, Lonesome Dove garnered many honors and awards. At the 1989 Emmy Awards, the miniseries had 18 nominations and seven wins, including one for director Simon Wincer. Lonesome Dove also won two Golden Globes, for Best Miniseries and Best Actor in a Miniseries (Robert Duvall).\r\nPlot\r\nIn the late 1870s, Captain Augustus \"Gus\" McCrae and Captain Woodrow F. Call, two famous former Texas Rangers, run a livery in the small, dusty Texas border town of Lonesome Dove along the Rio Grande. Gus is an upbeat womanizer and twice a widower, and Call is a strict, stoic workaholic. Working with them are Joshua Deets, a black tracker and scout from their Ranger days, Pea Eye Parker, another former Ranger who works hard but isn't very bright, and Bolívar, a retired Mexican bandit who is their cook. Also living with them is Newt Dobbs, a 17-year-old whose mother was a prostitute named Maggie and whose father may be any man on the ranch, save for Gus who secretly knows who Newt's true father is.\r\nPart I: Leaving\r\nFormer Texas Ranger and comrade of Gus and Call's, Jake Spoon, shows up after an absence of more than a decade. He reveals that he is a fugitive after having accidentally shot the dentist and mayor of Fort Smith, Arkansas, in a bar-room gunfight. The dentist/mayor's brother happens to be the sheriff, July Johnson.\r\nReunited with Gus and Call, Jake's glowing description of Montana inspires Call to gather a herd of cattle and drive them there, attracted by the notion of settling pristine country. Gus is less enthusiastic, pointing out that they are getting old and that they are Rangers and traders, not cowboys. But he changes his mind when he realizes Lonesome Dove has little left to offer him by way of excitement, now that much of the land has been \"civilized\".\r\nAt the continued insistence of the dentist's widow, Sheriff Johnson sets off in pursuit of Spoon, accompanied by his young stepson Joe who travels at the request of Joe's mother and Sheriff Johnson's wife Elmira. Once her son and husband have left for Texas, Elmira leaves Fort Smith for Ogallala, Nebraska, to meet up with her first husband and Joe's father, Dee Boot. Sailing up the Arkansas River on a whiskey boat, she falls in with a group of buffalo hunters.\r\nMeanwhile, the men of Lonesome Dove make preparations for their adventure north, including stealing 2,500 horses and cattle from across the Rio Grande in Mexico, befriending two lost Irish immigrants, Allan and Sean O'Brien, and being joined by nearly all of the male citizens of the town. Before leaving, Gus returns to fetch his livery sign and say farewell to his pigs, who end up following him anyway.\r\nBack in Fort Smith, Peach (widowed from Jake's shooting) insists that Roscoe Brown, July's timid deputy, has to find July not only to inform him that his wife's run off, but also that she is pregnant.\r\nJake decides not to travel with the herd, mainly because he promises to take the town's only prostitute, Lorena \"Lorie\" Wood, to San Francisco via Denver. Some time later the group survives a huge dust storm, but Sean, one of the Irishmen, is attacked by water moccasins while crossing the Nueces River.\r\nPart II: On the Trail\r\nThe young Irishman soon succumbs to his numerous snakebites, dies, and is buried. While travelling through a forest in east Texas, Roscoe encounters Janey, a young girl fleeing from an old abusive \"owner\". As they travel together they are robbed, when luckily Sheriff Johnson happens to catch up with them. Meanwhile, Johnson's wife Elmira arrives by boat at Bent's Fort, Colorado, and sets off overland across the plains with two hunters interested in her following.\r\nMeanwhile, the camp's cook refuses to cross the river after Sean O'Brien's mishap, so Gus and Call head into San Antonio in search of a new cook. They soon find Po Campo, who gets the job after impressing Gus and Call not only with his cooking, but with his attitude. On the way back, Gus catches up with Lorie, whom Jake has abandoned in order to go gambling in Austin. Before he returns, Gus and Lorie encounter Blue Duck, a notorious Mexican/Indian bandit from Gus and Call's Ranger days. After Gus sends Newt over to Lorie's camp to guard her, Blue Duck knocks Newt unconscious, kidnaps Lorie, and attempts to sell/barter her to a gang of Comanchero bandits camped on the Llano Estacado.\r\nKnowing that Gus is in pursuit, Blue Duck asks the Comancheros to kill Gus when he arrives, with Lorie being their reward. Gus and the bandits engage in a brief gun battle that quickly turns into a stalemate. Gus, having killed his horse for cover on the flat plains, is pinned down by the bandits' gunfire until nightfall, when Sheriff Johnson's party arrives and scares them off. Johnson, despite Gus's protests, joins Gus in the rescue of Lorie. The pair then ride to a hilltop above the Comancheros' camp. After a brief one-sided gunfight, in which Gus kills all of Blue Duck's gang, Lorie is rescued.\r\nBut while Gus and Johnson are away, Blue Duck uses his knife to kill deputy Roscoe, Janey, and Joe. He then steals their horses and escapes. The tearful Sheriff, with Gus's help, buries them all. Gus and Lorie ride north to rejoin Call and the herd. After being severely traumatized by her capture, Lorie now regards Gus as her primary protector. Meanwhile, in a saloon in Fort Worth, oblivious of Lorie's ordeal, Jake Spoon falls in with a gang that is headed north to rob banks in Kansas.\r\nPart III: The Plains\r\nAs they ride through the bush, Spoon and the robbers come across a group of horse wranglers. They shoot most of the wranglers and steal the horses. They then travel to a sodbuster's farm, two of whom the leader kills, hangs, and burns for no apparent reason. Although Spoon disagrees, the gang leader bullies and threatens Spoon into submission. When one of the dying wranglers is rescued by the cowboys, Call leads a posse to search for the thieves. Gus and Call quickly capture the robbers and prepare to hang them. With his last words, Jake Spoon admits that it is better to be hanged by his friends than by strangers. Jake, with his head in the noose, then spurs his own horse which causes it to run from underneath him; effectively hanging himself, much to the shock and dismay of his former friends.\r\nBy chance, Elmira and the buffalo hunters arrive at the home of Gus' old sweetheart, Clara Allen, near the Platte River in Nebraska. Clara's husband is an invalid, having been kicked in the head by a horse. Elmira gives birth to a son, but abandons the child with Clara and goes to Ogallala in search of Dee Boot. She finds Dee in jail, where he is shortly hanged for a murder. Two weeks later, Sheriff Johnson also arrives at Clara's house and sees his abandoned son. Later in Ogallala, Sheriff Johnson sees Elmira, who is still recovering from childbirth. That night, Elmira secretly departs east for St. Louis with the two buffalo hunters, but all three and their horses are soon killed by the Sioux. Sheriff Johnson returns to Clara's house and is offered a job. Clara, having lost her own three sons to pneumonia, is quite fond of Johnson's newborn son, and names him Martin.\r\nGus and Call's cattle drive also arrives at Ogallala, where they relax and enjoy the town. Some U.S. cavalry soldiers attempt to commandeer the group's horses, and things intensify when their scout both brutally beats top cowhand Dishwater \"Dish\" Boggett and viciously whips Newt when they resist, prompting an enraged Call to savagely beat the scout and nearly kill him before Gus restrains him with a lasso. In the aftermath, Gus tells Newt that Call is his father. Clara, although happy to see Gus, and with her husband gravely ill, makes it clear that she will not marry Gus. Instead, she invites Gus to settle and ranch on a piece of nearby property. Further, she invites Lorie to remain with her and her daughters. Before he departs, Gus promises he will return one day.\r\nContinuing their journey, Gus and Call lead their cattle drive north through the badlands of Wyoming Territory, nearly exhausting their water supply, and into Montana Territory. Impoverished Indians soon steal a dozen of their horses for food. Gus, Call, and Deets ride after the horse thieves to retrieve the horses. Call frightens the Indians away with a gunshot. Deets takes pity on a blind Indian child left behind, and goes to assist him. Another Indian mistakes his intentions and impales Deets with a spear. Mortally wounded, he dies in Gus and Call's arms a few moments later.\r\nPart IV: Return\r\nDeets is buried, then the party continues on across the Powder River. Meanwhile, in Nebraska, Clara's husband finally dies and is buried as well.\r\nLeaving the main group to scout ahead with Pea Eye Parker, Gus decides to pursue some buffalo. He and Parker end up being chased by mounted Indians, and Gus is badly wounded by two arrows in his right leg. While trying to get back to the herd for help, an exhausted Pea Eye is guided by the ghost of Deets, whereas Gus is found by a stranger and taken 40 miles away to Miles City, Montana.\r\nThere a doctor amputates Gus's right leg. He tells Gus that his left leg is septic and that he will die unless it also is amputated, but Gus refuses to let him remove it. Gus tells Call (who has come in search of him) to give his money to Lorie, to bury him in Texas, and to admit that he, Call, is Newt's father. After some brief reminiscing with Call at Gus's bedside, Gus dies. Call arranges to store Gus's body in the town over the winter. He then leads the cattle drive to a wilderness lake where the party raises a cabin and a corral.\r\nThe following spring, Call honors Gus's wish to be returned to Texas. Just before departing, Call gives Newt a pocket-watch that belonged to his own father and states that Newt will run the ranch in his absence. The moment is filled with anticipation, but Call is incapable of actually calling Newt his son out loud.\r\nCall soon returns to Ogallala. Sheriff Johnson, Clara, Lorie, and the ranch hand Dish live happily together. Dish is enamored with Lorie, but she does not return his affections. When Call brings Gus's body, Lorie stays and mourns by the coffin all night long. Clara asks Call to bury Gus at her home, but Call declines. Clara then berates Call for the bad effect he and Gus had on each other, blaming their adventures as the reason neither of them could find happiness.\r\nAfter a long journey, Call arrives at Santa Rosa, New Mexico Territory, where Blue Duck has finally been captured. Call visits Blue Duck in his jail cell, where Blue Duck mocks Call's failure to capture him. While being led to the gallows, Blue Duck grabs deputy Robert Hofer and throws himself out a window, choosing a murder-suicide rather than allow himself to be hanged.\r\nDespite blizzards, a broken wagon, and the loss of the coffin, Call finally succeeds in burying Gus after a journey of some 3000 miles. Call weeps for his friend after burying him, the first display of emotion he has allowed himself since Deets's death. After the burial, Call tours Lonesome Dove, reunites with his former cook Bolivar, and discovers that the saloon owner who once employed Lorie was so heartbroken by her departure that he burned the saloon down around himself.\r\nAs Call walks out of town, a reporter recognizes him and tries to interview him about his remarkable feats. Call ignores the reporter's questions—aside from ironically agreeing with him that he was a man of vision—and walks away.\r\nCast\r\nRobert Duvall as Captain Augustus \"Gus\" McCrae, former Texas Ranger\r\nTommy Lee Jones as Captain Woodrow F. Call, former Texas Ranger\r\nDanny Glover as Joshua Deets, former scout for the Texas Rangers\r\nDiane Lane as Lorena Wood, prostitute\r\nRobert Urich as Jake Spoon, former Texas Ranger\r\nFrederic Forrest as Blue Duck, half Native-American, half Mexican bandit and murderer\r\nD. B. Sweeney as Dishwater \"Dish\" Boggett, ramrod of the Hat Creek trail herd\r\nRicky Schroder as Newt Dobbs, Captain Call's illegitimate son\r\nAnjelica Huston as Clara Forsythe Allen, Gus' former love\r\nChris Cooper as Sheriff July Johnson\r\nTim Scott as \"Pea Eye\" Parker, former Texas Ranger\r\nGlenne Headly as Elmira \"Ellie\" Johnson\r\nBarry Corbin as Deputy Roscoe Brown\r\nWilliam Sanderson as \"Lippy\" Jones\r\nBarry Tubb as Jasper Fant\r\nGavan O'Herlihy as Dan Suggs, leader of the Suggs Gang\r\nSteve Buscemi as Luke, takes on Elmira\r\nFrederick Coffin as \"Big Zwey\", takes on Elmira\r\nTravis Swords as Allan O'Brien\r\nNina Siemaszko as Janey\r\nMissy Crider as Sally Allen, Clara's daughter\r\nLauren Stanley as Betsy Allen, Clara's daughter\r\nJerry Biggs as Roy Suggs, Suggs Gang\r\nSean Hennigan as Eddie Suggs, Suggs Gang\r\nJulius Tennon as Frog Lip, Suggs Gang\r\nBradley Gregg as Sean O'Brien\r\nKevin O'Morrison as Doctor\r\nRon Weyand as Old Hugh\r\nLanny Flaherty as \"Soupy\" Jones\r\nDavid Carpenter as \"Needle\" Nelson\r\nJames McMurtry as Jimmy Rainey\r\nCharlie Haynie as Ben Rainey\r\nSonny Carl Davis as Bert Borum\r\nHelena Humann as Peach Johnson\r\nO-Lan Jones as Sally Skull\r\nJorge Martínez de Hoyos as Po Campo, second Hat Creek trail cook\r\nLeón Singer as Bolivar, Hat Creek cook and H.C. first trail cook\r\nJack Caffrey as Cholo, Clara's ranch hand\r\nAdam Faraizl as Joe Boot\r\nMichael Tylo as Dee Boot\r\nMatthew Cowles as John \"Monkey John\"\r\nMargo Martindale as \"Buffalo Heifer\", prostitute\r\nJordan Lund as Hutto\r\nTony Epper as Dixon\r\nBud Shrake as Sodbuster\r\nProduction\r\nLarry McMurtry's original novel was based upon a screenplay that he had co-written with Peter Bogdanovich for a movie that was intended to star John Wayne as Call, James Stewart as Gus, and Henry Fonda as Jake Spoon, but the project collapsed when John Ford advised Wayne to reject the script.\r\nMost Hollywood studios were at first not interested in the rights to the novel, which ended up being bought by Motown Productions, headed by Suzanne de Passe. Motown made the miniseries for CBS with Robert Halmi Inc. as deficit financier. Robert Halmi's company was being taken over at that time by Qintex whose head of American operations, David Evans, suggested Simon Wincer as director. CBS also suggested him on the basis of The Last Frontier (1986) and Bluegrass (1988). Robert Duvall, who had director approval, watched some of Wincer's films and approved him.\r\nFour actors (Charles Bronson, Robert Duvall, James Garner, and Jon Voight) were offered the role of Woodrow Call but declined for various reasons before the role fell to Tommy Lee Jones. Garner said that he was originally set to play one of the lead roles but had to drop out for ill health. Duvall turned down the part of Call on the grounds he had already played that type of character, and asked to play Gus. Bronson agreed to play Blue Duck but he was under contract to Cannon Films who said he was required to make a movie for them instead.\r\nThe miniseries was partially shot at the Alamo Village, the movie set originally created for John Wayne's The Alamo (1960).\r\nThe majority of the miniseries was filmed at the Moody Ranch located seven miles south of Del Rio, Texas. Other locations used for filming were ranches in Texas and New Mexico, and the series was shot over 90 days. Real ranch horses were used for authenticity during the filming of the movie. Tommy Lee Jones and Robert Duvall did their own stunts in the film, except for one brief scene that required Duvall to ride in the center of a herd of bison.\r\nIon Television has shown a digitally remastered version of the miniseries starting the weekend of June 30, 2007 during the \"RHI Movie Weekend\". (Sonar Entertainment is the current owner of the Lonesome Dove miniseries).\r\nReception\r\nLonesome Dove received universal acclaim from critics. The New York Times commented that:\r\nThis six-hour miniseries, based on a Pulitzer Prize-winning novel by Larry McMurtry, revitalized both the miniseries and Western genres, both of which had been considered dead for several years.... Lonesome Dove earned 18 Emmy nominations and inspired a pair of miniseries sequel as well as two attempts at an ongoing television series.\r\nThe first installment, on February 5, 1989, led the Nielsen ratings for the week, with an impressive 28.5 rating (34 share, 44 million estimated viewers). That rating was the highest rating of any movie or miniseries that season, topping The Karen Carpenter Story (26.4 rating), and also well ahead of the first episode of the most massive miniseries that season, War and Remembrance (21.8 rating). Part 4 led ratings for the following week of ratings (27.3 rating), with Part 2 in 8th place (23.8 rating) and Part 3 in 4th place (24.8 rating).\r\nAwards\r\nLonesome Dove was nominated for 18 Emmy Awards, winning seven. The series was also deemed Program of the Year by the National Television Critics Association, as well as Outstanding Dramatic Achievement. It received the D.W. Griffith Award for Best Television Miniseries, and CBS was presented with a Peabody Award for Outstanding Achievement in Drama. In a 2003 TRIO Network Special, TRIO ranked Lonesome Dove third in a list of ten outstanding miniseries, beginning from the time the format was created\r\nSoundtrack\r\nThe score for Lonesome Dove was composed and conducted by Basil Poledouris, his first western and the first of his five scores for director Simon Wincer - Poledouris subsequently scored the director's next four theatrical films (Quigley Down Under, Harley Davidson and the Marlboro Man, Free Willy and Crocodile Dundee in Los Angeles). In 1993 Cabin Fever Music released an album of selections from his score; Sonic Images issued an expansion in 1998, with cues premiered on the 1998 album listed below in bold.\r\nHome media\r\nLonesome Dove has been released in various formats for over two decades.\r\nCabin Fever Entertainment (1991-1998) VHS\r\nHallmark Entertainment/Artisan Home Entertainment (1998-2003) VHS & DVD\r\nGenius Products/Vivendi Entertainment (2008-2014) DVD & Blu-ray\r\nMill Creek Entertainment (2014- ) DVD & Blu-ray\r\nIn 2008, Lonesome Dove was released on Blu-ray for the first time. This release, and the accompanying DVD release, was labeled the Collector's Edition. This edition was the first time the miniseries was presented in widescreen on home video.\r\nLonesome Dove was filmed in the full frame, 1.37:1 aspect ratio, but was framed so it could be presented in both fullscreen and widescreen. In the featurette \"On Location with Director Simon Wincer\" from the 2008 collector's edition, Wincer claims that prior to its television premier Lonesome Dove was screened for critics in a movie theater in the widescreen aspect ratio. He was very enthusiastic that the 2008 edition would be presented in widescreen and said \"the quality of the picture will now be so much better . . . it just gives the film a whole new life.\"",
    "html": "<p>Lonesome Dove is a 1989 American epic Western adventure television miniseries directed by Simon Wincer. It is a four-part adaptation of the 1985 novel of the same name by Larry McMurtry and is the first installment in the Lonesome Dove series. The novel was based upon a screenplay by Peter Bogdanovich and McMurtry. The miniseries stars an ensemble cast headed by Robert Duvall as Augustus McCrae and Tommy Lee Jones as Woodrow Call. The series was originally broadcast by CBS from February 5 to 8, 1989, drawing a huge viewing audience, earning numerous awards, and reviving both the television Western and the miniseries.</p><p>An estimated 26 million homes tuned in to watch Lonesome Dove, unusually high numbers for a Western at that time. The Western genre was considered dead by most people, as was the miniseries. By the show's end, it had earned huge ratings and virtually revamped the entire 1989–1990 television season. A favorite with audiences, as well as critics, Lonesome Dove garnered many honors and awards. At the 1989 Emmy Awards, the miniseries had 18 nominations and seven wins, including one for director Simon Wincer. Lonesome Dove also won two Golden Globes, for Best Miniseries and Best Actor in a Miniseries (Robert Duvall).</p><br/><h3>Plot</h3><p>In the late 1870s, Captain Augustus \"Gus\" McCrae and Captain Woodrow F. Call, two famous former Texas Rangers, run a livery in the small, dusty Texas border town of Lonesome Dove along the Rio Grande. Gus is an upbeat womanizer and twice a widower, and Call is a strict, stoic workaholic. Working with them are Joshua Deets, a black tracker and scout from their Ranger days, Pea Eye Parker, another former Ranger who works hard but isn't very bright, and Bolívar, a retired Mexican bandit who is their cook. Also living with them is Newt Dobbs, a 17-year-old whose mother was a prostitute named Maggie and whose father may be any man on the ranch, save for Gus who secretly knows who Newt's true father is.</p><h4>Part I: Leaving</h4><p>Former Texas Ranger and comrade of Gus and Call's, Jake Spoon, shows up after an absence of more than a decade. He reveals that he is a fugitive after having accidentally shot the dentist and mayor of Fort Smith, Arkansas, in a bar-room gunfight. The dentist/mayor's brother happens to be the sheriff, July Johnson.</p><p>Reunited with Gus and Call, Jake's glowing description of Montana inspires Call to gather a herd of cattle and drive them there, attracted by the notion of settling pristine country. Gus is less enthusiastic, pointing out that they are getting old and that they are Rangers and traders, not cowboys. But he changes his mind when he realizes Lonesome Dove has little left to offer him by way of excitement, now that much of the land has been \"civilized\".</p><p>At the continued insistence of the dentist's widow, Sheriff Johnson sets off in pursuit of Spoon, accompanied by his young stepson Joe who travels at the request of Joe's mother and Sheriff Johnson's wife Elmira. Once her son and husband have left for Texas, Elmira leaves Fort Smith for Ogallala, Nebraska, to meet up with her first husband and Joe's father, Dee Boot. Sailing up the Arkansas River on a whiskey boat, she falls in with a group of buffalo hunters.</p><p>Meanwhile, the men of Lonesome Dove make preparations for their adventure north, including stealing 2,500 horses and cattle from across the Rio Grande in Mexico, befriending two lost Irish immigrants, Allan and Sean O'Brien, and being joined by nearly all of the male citizens of the town. Before leaving, Gus returns to fetch his livery sign and say farewell to his pigs, who end up following him anyway.</p><p>Back in Fort Smith, Peach (widowed from Jake's shooting) insists that Roscoe Brown, July's timid deputy, has to find July not only to inform him that his wife's run off, but also that she is pregnant.</p><p>Jake decides not to travel with the herd, mainly because he promises to take the town's only prostitute, Lorena \"Lorie\" Wood, to San Francisco via Denver. Some time later the group survives a huge dust storm, but Sean, one of the Irishmen, is attacked by water moccasins while crossing the Nueces River.</p><h4>Part II: On the Trail</h4><p>The young Irishman soon succumbs to his numerous snakebites, dies, and is buried. While travelling through a forest in east Texas, Roscoe encounters Janey, a young girl fleeing from an old abusive \"owner\". As they travel together they are robbed, when luckily Sheriff Johnson happens to catch up with them. Meanwhile, Johnson's wife Elmira arrives by boat at Bent's Fort, Colorado, and sets off overland across the plains with two hunters interested in her following.</p><p>Meanwhile, the camp's cook refuses to cross the river after Sean O'Brien's mishap, so Gus and Call head into San Antonio in search of a new cook. They soon find Po Campo, who gets the job after impressing Gus and Call not only with his cooking, but with his attitude. On the way back, Gus catches up with Lorie, whom Jake has abandoned in order to go gambling in Austin. Before he returns, Gus and Lorie encounter Blue Duck, a notorious Mexican/Indian bandit from Gus and Call's Ranger days. After Gus sends Newt over to Lorie's camp to guard her, Blue Duck knocks Newt unconscious, kidnaps Lorie, and attempts to sell/barter her to a gang of Comanchero bandits camped on the Llano Estacado.</p><p>Knowing that Gus is in pursuit, Blue Duck asks the Comancheros to kill Gus when he arrives, with Lorie being their reward. Gus and the bandits engage in a brief gun battle that quickly turns into a stalemate. Gus, having killed his horse for cover on the flat plains, is pinned down by the bandits' gunfire until nightfall, when Sheriff Johnson's party arrives and scares them off. Johnson, despite Gus's protests, joins Gus in the rescue of Lorie. The pair then ride to a hilltop above the Comancheros' camp. After a brief one-sided gunfight, in which Gus kills all of Blue Duck's gang, Lorie is rescued.</p><p>But while Gus and Johnson are away, Blue Duck uses his knife to kill deputy Roscoe, Janey, and Joe. He then steals their horses and escapes. The tearful Sheriff, with Gus's help, buries them all. Gus and Lorie ride north to rejoin Call and the herd. After being severely traumatized by her capture, Lorie now regards Gus as her primary protector. Meanwhile, in a saloon in Fort Worth, oblivious of Lorie's ordeal, Jake Spoon falls in with a gang that is headed north to rob banks in Kansas.</p><h4>Part III: The Plains</h4><p>As they ride through the bush, Spoon and the robbers come across a group of horse wranglers. They shoot most of the wranglers and steal the horses. They then travel to a sodbuster's farm, two of whom the leader kills, hangs, and burns for no apparent reason. Although Spoon disagrees, the gang leader bullies and threatens Spoon into submission. When one of the dying wranglers is rescued by the cowboys, Call leads a posse to search for the thieves. Gus and Call quickly capture the robbers and prepare to hang them. With his last words, Jake Spoon admits that it is better to be hanged by his friends than by strangers. Jake, with his head in the noose, then spurs his own horse which causes it to run from underneath him; effectively hanging himself, much to the shock and dismay of his former friends.</p><p>By chance, Elmira and the buffalo hunters arrive at the home of Gus' old sweetheart, Clara Allen, near the Platte River in Nebraska. Clara's husband is an invalid, having been kicked in the head by a horse. Elmira gives birth to a son, but abandons the child with Clara and goes to Ogallala in search of Dee Boot. She finds Dee in jail, where he is shortly hanged for a murder. Two weeks later, Sheriff Johnson also arrives at Clara's house and sees his abandoned son. Later in Ogallala, Sheriff Johnson sees Elmira, who is still recovering from childbirth. That night, Elmira secretly departs east for St. Louis with the two buffalo hunters, but all three and their horses are soon killed by the Sioux. Sheriff Johnson returns to Clara's house and is offered a job. Clara, having lost her own three sons to pneumonia, is quite fond of Johnson's newborn son, and names him Martin.</p><p>Gus and Call's cattle drive also arrives at Ogallala, where they relax and enjoy the town. Some U.S. cavalry soldiers attempt to commandeer the group's horses, and things intensify when their scout both brutally beats top cowhand Dishwater \"Dish\" Boggett and viciously whips Newt when they resist, prompting an enraged Call to savagely beat the scout and nearly kill him before Gus restrains him with a lasso. In the aftermath, Gus tells Newt that Call is his father. Clara, although happy to see Gus, and with her husband gravely ill, makes it clear that she will not marry Gus. Instead, she invites Gus to settle and ranch on a piece of nearby property. Further, she invites Lorie to remain with her and her daughters. Before he departs, Gus promises he will return one day.</p><p>Continuing their journey, Gus and Call lead their cattle drive north through the badlands of Wyoming Territory, nearly exhausting their water supply, and into Montana Territory. Impoverished Indians soon steal a dozen of their horses for food. Gus, Call, and Deets ride after the horse thieves to retrieve the horses. Call frightens the Indians away with a gunshot. Deets takes pity on a blind Indian child left behind, and goes to assist him. Another Indian mistakes his intentions and impales Deets with a spear. Mortally wounded, he dies in Gus and Call's arms a few moments later.</p><h4>Part IV: Return</h4><p>Deets is buried, then the party continues on across the Powder River. Meanwhile, in Nebraska, Clara's husband finally dies and is buried as well.</p><p>Leaving the main group to scout ahead with Pea Eye Parker, Gus decides to pursue some buffalo. He and Parker end up being chased by mounted Indians, and Gus is badly wounded by two arrows in his right leg. While trying to get back to the herd for help, an exhausted Pea Eye is guided by the ghost of Deets, whereas Gus is found by a stranger and taken 40 miles away to Miles City, Montana.</p><p>There a doctor amputates Gus's right leg. He tells Gus that his left leg is septic and that he will die unless it also is amputated, but Gus refuses to let him remove it. Gus tells Call (who has come in search of him) to give his money to Lorie, to bury him in Texas, and to admit that he, Call, is Newt's father. After some brief reminiscing with Call at Gus's bedside, Gus dies. Call arranges to store Gus's body in the town over the winter. He then leads the cattle drive to a wilderness lake where the party raises a cabin and a corral.</p><p>The following spring, Call honors Gus's wish to be returned to Texas. Just before departing, Call gives Newt a pocket-watch that belonged to his own father and states that Newt will run the ranch in his absence. The moment is filled with anticipation, but Call is incapable of actually calling Newt his son out loud.</p><p>Call soon returns to Ogallala. Sheriff Johnson, Clara, Lorie, and the ranch hand Dish live happily together. Dish is enamored with Lorie, but she does not return his affections. When Call brings Gus's body, Lorie stays and mourns by the coffin all night long. Clara asks Call to bury Gus at her home, but Call declines. Clara then berates Call for the bad effect he and Gus had on each other, blaming their adventures as the reason neither of them could find happiness.</p><p>After a long journey, Call arrives at Santa Rosa, New Mexico Territory, where Blue Duck has finally been captured. Call visits Blue Duck in his jail cell, where Blue Duck mocks Call's failure to capture him. While being led to the gallows, Blue Duck grabs deputy Robert Hofer and throws himself out a window, choosing a murder-suicide rather than allow himself to be hanged.</p><p>Despite blizzards, a broken wagon, and the loss of the coffin, Call finally succeeds in burying Gus after a journey of some 3000 miles. Call weeps for his friend after burying him, the first display of emotion he has allowed himself since Deets's death. After the burial, Call tours Lonesome Dove, reunites with his former cook Bolivar, and discovers that the saloon owner who once employed Lorie was so heartbroken by her departure that he burned the saloon down around himself.</p><p>As Call walks out of town, a reporter recognizes him and tries to interview him about his remarkable feats. Call ignores the reporter's questions—aside from ironically agreeing with him that he was a man of vision—and walks away.</p><br/><h3>Cast</h3><ul><li>Robert Duvall as Captain Augustus \"Gus\" McCrae, former Texas Ranger</li><li>Tommy Lee Jones as Captain Woodrow F. Call, former Texas Ranger</li><li>Danny Glover as Joshua Deets, former scout for the Texas Rangers</li><li>Diane Lane as Lorena Wood, prostitute</li><li>Robert Urich as Jake Spoon, former Texas Ranger</li><li>Frederic Forrest as Blue Duck, half Native-American, half Mexican bandit and murderer</li><li>D. B. Sweeney as Dishwater \"Dish\" Boggett, ramrod of the Hat Creek trail herd</li><li>Ricky Schroder as Newt Dobbs, Captain Call's illegitimate son</li><li>Anjelica Huston as Clara Forsythe Allen, Gus' former love</li><li>Chris Cooper as Sheriff July Johnson</li><li>Tim Scott as \"Pea Eye\" Parker, former Texas Ranger</li><li>Glenne Headly as Elmira \"Ellie\" Johnson</li><li>Barry Corbin as Deputy Roscoe Brown</li><li>William Sanderson as \"Lippy\" Jones</li><li>Barry Tubb as Jasper Fant</li><li>Gavan O'Herlihy as Dan Suggs, leader of the Suggs Gang</li><li>Steve Buscemi as Luke, takes on Elmira</li><li>Frederick Coffin as \"Big Zwey\", takes on Elmira</li><li>Travis Swords as Allan O'Brien</li><li>Nina Siemaszko as Janey</li><li>Missy Crider as Sally Allen, Clara's daughter</li><li>Lauren Stanley as Betsy Allen, Clara's daughter</li><li>Jerry Biggs as Roy Suggs, Suggs Gang</li><li>Sean Hennigan as Eddie Suggs, Suggs Gang</li><li>Julius Tennon as Frog Lip, Suggs Gang</li><li>Bradley Gregg as Sean O'Brien</li><li>Kevin O'Morrison as Doctor</li><li>Ron Weyand as Old Hugh</li><li>Lanny Flaherty as \"Soupy\" Jones</li><li>David Carpenter as \"Needle\" Nelson</li><li>James McMurtry as Jimmy Rainey</li><li>Charlie Haynie as Ben Rainey</li><li>Sonny Carl Davis as Bert Borum</li><li>Helena Humann as Peach Johnson</li><li>O-Lan Jones as Sally Skull</li><li>Jorge Martínez de Hoyos as Po Campo, second Hat Creek trail cook</li><li>León Singer as Bolivar, Hat Creek cook and H.C. first trail cook</li><li>Jack Caffrey as Cholo, Clara's ranch hand</li><li>Adam Faraizl as Joe Boot</li><li>Michael Tylo as Dee Boot</li><li>Matthew Cowles as John \"Monkey John\"</li><li>Margo Martindale as \"Buffalo Heifer\", prostitute</li><li>Jordan Lund as Hutto</li><li>Tony Epper as Dixon</li><li>Bud Shrake as Sodbuster</li></ul><br/><h3>Production</h3><p>Larry McMurtry's original novel was based upon a screenplay that he had co-written with Peter Bogdanovich for a movie that was intended to star John Wayne as Call, James Stewart as Gus, and Henry Fonda as Jake Spoon, but the project collapsed when John Ford advised Wayne to reject the script.</p><p>Most Hollywood studios were at first not interested in the rights to the novel, which ended up being bought by Motown Productions, headed by Suzanne de Passe. Motown made the miniseries for CBS with Robert Halmi Inc. as deficit financier. Robert Halmi's company was being taken over at that time by Qintex whose head of American operations, David Evans, suggested Simon Wincer as director. CBS also suggested him on the basis of The Last Frontier (1986) and Bluegrass (1988). Robert Duvall, who had director approval, watched some of Wincer's films and approved him.</p><p>Four actors (Charles Bronson, Robert Duvall, James Garner, and Jon Voight) were offered the role of Woodrow Call but declined for various reasons before the role fell to Tommy Lee Jones. Garner said that he was originally set to play one of the lead roles but had to drop out for ill health. Duvall turned down the part of Call on the grounds he had already played that type of character, and asked to play Gus. Bronson agreed to play Blue Duck but he was under contract to Cannon Films who said he was required to make a movie for them instead.</p><p>The miniseries was partially shot at the Alamo Village, the movie set originally created for John Wayne's The Alamo (1960).</p><p>The majority of the miniseries was filmed at the Moody Ranch located seven miles south of Del Rio, Texas. Other locations used for filming were ranches in Texas and New Mexico, and the series was shot over 90 days. Real ranch horses were used for authenticity during the filming of the movie. Tommy Lee Jones and Robert Duvall did their own stunts in the film, except for one brief scene that required Duvall to ride in the center of a herd of bison.</p><p>Ion Television has shown a digitally remastered version of the miniseries starting the weekend of June 30, 2007 during the \"RHI Movie Weekend\". (Sonar Entertainment is the current owner of the Lonesome Dove miniseries).</p><br/><h3>Reception</h3><p>Lonesome Dove received universal acclaim from critics. The New York Times commented that:</p><blockquote>This six-hour miniseries, based on a Pulitzer Prize-winning novel by Larry McMurtry, revitalized both the miniseries and Western genres, both of which had been considered dead for several years.... Lonesome Dove earned 18 Emmy nominations and inspired a pair of miniseries sequel as well as two attempts at an ongoing television series.</blockquote><p>The first installment, on February 5, 1989, led the Nielsen ratings for the week, with an impressive 28.5 rating (34 share, 44 million estimated viewers). That rating was the highest rating of any movie or miniseries that season, topping The Karen Carpenter Story (26.4 rating), and also well ahead of the first episode of the most massive miniseries that season, War and Remembrance (21.8 rating). Part 4 led ratings for the following week of ratings (27.3 rating), with Part 2 in 8th place (23.8 rating) and Part 3 in 4th place (24.8 rating).</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Viewership and ratings for <i>Lonesome Dove</i></caption><tbody><tr><th scope=\"col\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\">Title</th><th scope=\"col\">Air date</th><th scope=\"col\">Timeslot (<span>ET</span>)</th><th scope=\"col\"><span class=\"mw-redirect\">Rating/share</span><br>(households)</th><th scope=\"col\">Viewers<br>(millions)</th><th scope=\"col\" class=\"unsortable\"><abbr title=\"Reference(s)\">Ref(s)</abbr></th></tr><tr><th scope=\"row\" style=\"text-align: center;\">1</th><td>\"Part 1\"</td><td>February 5, 1989</td><td>Sunday 9:00 p.m.</td><td>28.5/42</td><td>44.1</td><td></td></tr><tr><th scope=\"row\" style=\"text-align: center;\">2</th><td>\"Part 2\"</td><td>February 6, 1989</td><td>Monday 9:00 p.m.</td><td>23.8/34</td><td>36.8</td><td></td></tr><tr><th scope=\"row\" style=\"text-align: center;\">3</th><td>\"Part 3\"</td><td>February 7, 1989</td><td>Tuesday 9:00 p.m.</td><td>24.8/37</td><td>37.0</td><td></td></tr><tr><th scope=\"row\" style=\"text-align: center;\">4</th><td>\"Part 4\"</td><td>February 8, 1989</td><td>Wednesday 9:00 p.m.</td><td>27.3/41</td><td>41.5</td><td></td></tr></tbody></table><br/><h3>Awards</h3><p>Lonesome Dove was nominated for 18 Emmy Awards, winning seven. The series was also deemed Program of the Year by the National Television Critics Association, as well as Outstanding Dramatic Achievement. It received the D.W. Griffith Award for Best Television Miniseries, and CBS was presented with a Peabody Award for Outstanding Achievement in Drama. In a 2003 TRIO Network Special, TRIO ranked Lonesome Dove third in a list of ten outstanding miniseries, beginning from the time the format was created</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>1989 <span class=\"mw-redirect\">Emmy Awards</span></caption><tbody><tr><th style=\"width:50em\">Category</th><th style=\"width:3em\">Won</th><th style=\"width:50em\">Winner</th></tr><tr><td><small>Outstanding Achievement in Casting for a Miniseries or a Special</small></td><td data-sort-value=\"Yes\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-yes2\"><noscript><img alt=\"Yes\" src=\"//upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png\" decoding=\"async\" title=\"Yes\" width=\"13\" height=\"13\" data-file-width=\"600\" data-file-height=\"600\"></noscript></td><td>Lynn Kressel</td></tr><tr><td><small>Outstanding Achievement in Makeup for a Miniseries or a Special</small></td><td data-sort-value=\"Yes\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-yes2\"><noscript><img alt=\"Yes\" src=\"//upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png\" decoding=\"async\" title=\"Yes\" width=\"13\" height=\"13\" data-file-width=\"600\" data-file-height=\"600\"></noscript></td><td><span>Manlio Rocchetti</span> <small>(makeup supervisor)</small>, Carla Palmer <small>(makeup artist)</small>, and Jean Ann Black <small>(makeup artist)</small> <br><small>For Part 4 (\"The Return\")</small></td></tr><tr><td><small>Outstanding Achievement in Music Composition for a Miniseries or a Special (Dramatic Underscore)</small></td><td data-sort-value=\"Yes\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-yes2\"><noscript><img alt=\"Yes\" src=\"//upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png\" decoding=\"async\" title=\"Yes\" width=\"13\" height=\"13\" data-file-width=\"600\" data-file-height=\"600\"></noscript></td><td>Basil Poledouris <small>(composer)</small> <br><small>For Part 4 (\"The Return\")</small></td></tr><tr><td><small>Outstanding Costume Design for a Miniseries or a Special</small></td><td data-sort-value=\"Yes\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-yes2\"><noscript><img alt=\"Yes\" src=\"//upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png\" decoding=\"async\" title=\"Yes\" width=\"13\" height=\"13\" data-file-width=\"600\" data-file-height=\"600\"></noscript></td><td>Van Broughton Ramsey <br><small>For Part 2 (\"On the Trail\")</small></td></tr><tr><td><small>Outstanding Directing in a Miniseries or a Special</small></td><td data-sort-value=\"Yes\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-yes2\"><noscript><img alt=\"Yes\" src=\"//upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png\" decoding=\"async\" title=\"Yes\" width=\"13\" height=\"13\" data-file-width=\"600\" data-file-height=\"600\"></noscript></td><td>Simon Wincer <small>(director)</small> <br><small>For Part 1 (\"Leaving\") and Part 4 (\"The Return\")</small></td></tr><tr><td><small>Outstanding Sound Editing for a Miniseries or a Special</small></td><td data-sort-value=\"Yes\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-yes2\"><noscript><img alt=\"Yes\" src=\"//upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png\" decoding=\"async\" title=\"Yes\" width=\"13\" height=\"13\" data-file-width=\"600\" data-file-height=\"600\"></noscript></td><td><span>Dave McMoyler</span> (supervising sound editor); Joseph Melody <small>(co-supervising editor)</small>; Mark Steele, Richard S. Steele, Michael J. Wright, Gary Macheel, Stephen Grubbs, Mark Friedgen, Charles R. Beith Jr., Scott A. Tinsley, Karla Caldwell, George B. Bell, and G. Michael Graham <small>(sound editors)</small>; Kristi Johns <small>(supervising adr editor)</small>; Tom Villano <small>(supervising music editor)</small>; and Jamie Forester <small>(supervising music editor)</small> <br><small>For Part 3 (\"The Plains\")</small></td></tr><tr><td><small>Outstanding Sound Mixing for a Miniseries or a Special</small></td><td data-sort-value=\"Yes\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-yes2\"><noscript><img alt=\"Yes\" src=\"//upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png\" decoding=\"async\" title=\"Yes\" width=\"13\" height=\"13\" data-file-width=\"600\" data-file-height=\"600\"></noscript></td><td>Donald F. Johnson <small>(sound mixer)</small>, James L. Aicholtz <small>(dialogue mixer)</small>, Michael Herbick <small>(music mixer)</small>, and <span>Kevin O'Connell</span> <small>(sound effects mixer)</small> <br><small>For Part 4 (\"The Return\")</small></td></tr><tr><td><small>Outstanding Achievement in Hairstyling for a Miniseries or a Special</small></td><td></td><td>Philip Leto <small>(hairstylist)</small> and Manlio Rocchetti <small>(hair supervisor)</small> <br><small>For Part 2 (\"On the Trail\")</small></td></tr><tr><td><small>Outstanding Art Direction for a Miniseries or a Special</small></td><td></td><td>Cary White <small>(production designer)</small> and Michael J. Sullivan <small>(set decorator)</small> <br><small>For Part 4 (\"The Return\")</small></td></tr><tr><td><small>Outstanding Cinematography for a Miniseries or a Special</small></td><td></td><td><span>Douglas Milsome</span> <small>(director of photography)</small> <br><small>For Part 4 (\"The Return\")</small></td></tr><tr><td><small>Outstanding Editing for a Miniseries or a Special - Single Camera Production</small></td><td></td><td><span>Corky Ehlers</span> <small>(editor)</small> <br><small>For Part 3 (\"The Plains\")</small></td></tr><tr><td><small>Outstanding Lead Actor in a Miniseries or a Special</small></td><td></td><td>Robert Duvall <br><small>For Part 2 (\"On the Trail\")</small></td></tr><tr><td><small>Outstanding Lead Actor in a Miniseries or a Special</small></td><td></td><td>Tommy Lee Jones <br><small>For Part 4 (\"The Return\")</small></td></tr><tr><td><small>Outstanding Lead Actress in a Miniseries or a Special</small></td><td></td><td>Anjelica Huston <br><small>For Part 3 (\"The Plains\")</small></td></tr><tr><td><small>Outstanding Lead Actress in a Miniseries or a Special</small></td><td></td><td>Diane Lane <br><small>For Part 3 (\"The Plains\") and Part 4 (\"The Return\")</small></td></tr><tr><td><small>Outstanding Miniseries</small></td><td></td><td><span>Suzanne de Passe</span> <small>(executive producer)</small>, Bill Wittliff <small>(executive producer)</small>, Robert Halmi Jr. <small>(co-executive producer)</small>, <span>Dyson Lovell</span> <small>(producer)</small>, and Michael Weisbarth <small>(supervising producer)</small></td></tr><tr><td><small>Outstanding Supporting Actor in a Miniseries or a Special</small></td><td></td><td>Danny Glover <br><small>For Part 1 (\"Leaving\"), Part 2 (\"On the Trail\"), and Part 3 (\"The Plains\")</small></td></tr><tr><td><small>Outstanding Supporting Actress in a Miniseries or a Special</small></td><td></td><td>Glenne Headly <br><small>For Part 1 (\"Leaving\"), Part 2 (\"On the Trail\"), and Part 3 (\"The Plains\")</small></td></tr><tr><td><small>Outstanding Writing in a Miniseries or a Special</small></td><td></td><td>Bill Wittliff <small>(teleplay)</small> <br><small>For Part 1 (\"Leaving\") and Part 4 (\"The Return\")</small></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>1990 <span class=\"mw-redirect\">Golden Globes</span></caption><tbody><tr><th>Category</th><th style=\"width:3em\">Won</th><th>Winner</th></tr><tr><td><small>Best Mini-Series or Motion Picture Made for TV</small></td><td data-sort-value=\"Yes\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-yes2\"><noscript><img alt=\"Yes\" src=\"//upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png\" decoding=\"async\" title=\"Yes\" width=\"13\" height=\"13\" data-file-width=\"600\" data-file-height=\"600\"></noscript></td><td></td></tr><tr><td><small>Best Performance by an Actor in a Mini-Series or Motion Picture Made for TV</small></td><td data-sort-value=\"Yes\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-yes2\"><noscript><img alt=\"Yes\" src=\"//upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png\" decoding=\"async\" title=\"Yes\" width=\"13\" height=\"13\" data-file-width=\"600\" data-file-height=\"600\"></noscript></td><td>Robert Duvall</td></tr><tr><td><small>Best Performance by an Actor in a Supporting Role in a Series, Mini-Series or Motion Picture Made for TV</small></td><td></td><td>Tommy Lee Jones</td></tr><tr><td><small>Best Performance by an Actress in a Supporting Role in a Series, Mini-Series or Motion Picture Made for TV</small></td><td></td><td>Anjelica Huston</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Other</caption><tbody><tr><th>Awards</th><th>Category</th><th style=\"width:3em\">Won</th><th>Winner</th></tr><tr><td><small>American Cinema Editors (1990)</small></td><td><small>Best Edited Episode from a Television Mini-Series</small></td><td></td><td><span>Corky Ehlers</span> <small>For Part 3 (\"The Plains\")</small></td></tr><tr><td><small>BMI Film &amp; TV Awards (1990)</small></td><td></td><td data-sort-value=\"Yes\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-yes2\"><noscript><img alt=\"Yes\" src=\"//upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png\" decoding=\"async\" title=\"Yes\" width=\"13\" height=\"13\" data-file-width=\"600\" data-file-height=\"600\"></noscript></td><td><span>Basil Poledouris</span></td></tr><tr><td><small><span>Casting Society of America</span> (1989)</small></td><td><small>Best Casting for TV Miniseries</small></td><td data-sort-value=\"Yes\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-yes2\"><noscript><img alt=\"Yes\" src=\"//upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png\" decoding=\"async\" title=\"Yes\" width=\"13\" height=\"13\" data-file-width=\"600\" data-file-height=\"600\"></noscript></td><td>Lynn Kressel</td></tr><tr><td><small><span>Directors Guild of America</span> (1990)</small></td><td><small>Outstanding Directorial Achievement in Dramatic Specials</small></td><td></td><td><span>Simon Wincer</span></td></tr><tr><td><small><span>TV Land Awards</span> (2007)</small></td><td><small>Miniseries You Didn't Miss a Moment Of</small></td><td></td><td></td></tr><tr><td><small><span>Television Critics Association Awards</span> (1989)</small></td><td><small>Outstanding Achievement in Drama</small></td><td data-sort-value=\"Yes\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-yes2\"><noscript><img alt=\"Yes\" src=\"//upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png\" decoding=\"async\" title=\"Yes\" width=\"13\" height=\"13\" data-file-width=\"600\" data-file-height=\"600\"></noscript></td><td></td></tr><tr><td><small><span>Television Critics Association Awards</span> (1989)</small></td><td><small>Program of the Year</small></td><td data-sort-value=\"Yes\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-yes2\"><noscript><img alt=\"Yes\" src=\"//upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png\" decoding=\"async\" title=\"Yes\" width=\"13\" height=\"13\" data-file-width=\"600\" data-file-height=\"600\"></noscript></td><td></td></tr><tr><td><small>Western Heritage Awards (1990)</small></td><td><small>Television Feature Film</small></td><td data-sort-value=\"Yes\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-yes2\"><noscript><img alt=\"Yes\" src=\"//upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png\" decoding=\"async\" title=\"Yes\" width=\"13\" height=\"13\" data-file-width=\"600\" data-file-height=\"600\"></noscript></td><td>William D. Wittliff <small>(writer/executive producer)</small>, Suzanne de Passe <small>(executive producer)</small>, Robert Duvall <small>(star)</small>, Tommy Lee Jones <small>(star)</small>, and Anjelica Huston <small>(star)</small></td></tr><tr><td><small><span class=\"mw-redirect\">Writers Guild of America Awards</span> (1990)</small></td><td><small>Adapted Long Form</small></td><td data-sort-value=\"Yes\" style=\"background: #DFD; vertical-align: middle; text-align: center;\" class=\"table-yes2\"><noscript><img alt=\"Yes\" src=\"//upload.wikimedia.org/wikipedia/en/thumb/f/fb/Yes_check.svg/13px-Yes_check.svg.png\" decoding=\"async\" title=\"Yes\" width=\"13\" height=\"13\" data-file-width=\"600\" data-file-height=\"600\"></noscript></td><td>William D. Wittliff <br><small>For Part 1 (\"Leaving\")</small></td></tr></tbody></table><br/><h3>Soundtrack</h3><p>The score for Lonesome Dove was composed and conducted by Basil Poledouris, his first western and the first of his five scores for director Simon Wincer - Poledouris subsequently scored the director's next four theatrical films (Quigley Down Under, Harley Davidson and the Marlboro Man, Free Willy and Crocodile Dundee in Los Angeles). In 1993 Cabin Fever Music released an album of selections from his score; Sonic Images issued an expansion in 1998, with cues premiered on the 1998 album listed below in bold.</p><br/><h3>Home media</h3><p>Lonesome Dove has been released in various formats for over two decades.</p><ul><li>Cabin Fever Entertainment (1991-1998) VHS</li><li>Hallmark Entertainment/Artisan Home Entertainment (1998-2003) VHS & DVD</li><li>Genius Products/Vivendi Entertainment (2008-2014) DVD & Blu-ray</li><li>Mill Creek Entertainment (2014- ) DVD & Blu-ray</li></ul><p>In 2008, Lonesome Dove was released on Blu-ray for the first time. This release, and the accompanying DVD release, was labeled the Collector's Edition. This edition was the first time the miniseries was presented in widescreen on home video.</p><p>Lonesome Dove was filmed in the full frame, 1.37:1 aspect ratio, but was framed so it could be presented in both fullscreen and widescreen. In the featurette \"On Location with Director Simon Wincer\" from the 2008 collector's edition, Wincer claims that prior to its television premier Lonesome Dove was screened for critics in a movie theater in the widescreen aspect ratio. He was very enthusiastic that the 2008 edition would be presented in widescreen and said \"the quality of the picture will now be so much better . . . it just gives the film a whole new life.\"</p><br/>"
  },
  "errorMessage": ""
}