{
  "imDbId": "tt0421357",
  "title": "Fullmetal Alchemist",
  "fullTitle": "Fullmetal Alchemist (TV Series 2003–2004)",
  "type": "TVSeries",
  "year": "2003",
  "items": [
    {
      "username": "Rectangular_businessman",
      "userUrl": "https://www.imdb.com/user/ur13538926",
      "reviewLink": "https://www.imdb.com/review/rw4219169",
      "warningSpoilers": true,
      "date": "29 June 2018",
      "rate": "8",
      "helpful": "21 out of 22 found this helpful.",
      "title": "I still enjoy this version",
      "content": "I know most fans tend to compare this series unfavorably to \"Full Metal Alchemist: Brotherhood\", but personally I think this version of the story did many things right (and in some aspects, I think it handled a couple of parts of the story in a better way than the original) doing a pretty good balance of drama, suspense and comedy, with plenty of beautiful moments, even if the plot wasn't a 100 % faithful adaptation of the original manga.And honestly, I prefer that it tried to be its own thing instead of stretching the plot indefinitely with lots of pointless filler (like Naruto did) and its conclusion, while quite different to the one from the manga, is still managed to be something quite satisfying.Both versions of Full Metal Alchemist are good, and personally consider both of them to be worth-watching."
    },
    {
      "username": "chrichtonsworld",
      "userUrl": "https://www.imdb.com/user/ur9516916",
      "reviewLink": "https://www.imdb.com/review/rw1677211",
      "warningSpoilers": false,
      "date": "19 June 2007",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Without a doubt one of the best anime series ever made",
      "content": "When I heard of \"Full Metal Alchemist\" i didn't know what to expect! But only after watching the first episode I knew this series was special! From the start it drew me in and took me on a journey in to incredible adventures! It is the story that is truly amazing! At first the story is quite simple,but after a couple of episodes you will get some twists and turns you won't see coming! They managed to dazzle and surprise you almost every episode! Once you start watching \"Full Metal Alchemist\" you will not stop! The anime successfully mixed different genres (sciencefiction,drama,action,horror and comedy)! Also FMA throws in some serious subjects for us to think about and be entertained at the same time! But what really makes this anime works are the characters! A lot of attention is paid to them! The good guys,the villains all have their good qualities and bad qualities! Evil characters don't have to be pure evil! And the good characters also make mistakes! In that sense most of the characters are very similar to us humans and therefore are very appealing! This anime sure will make an impact on you on different levels! A MUST SEE!"
    },
    {
      "username": "eagleknight98",
      "userUrl": "https://www.imdb.com/user/ur5961855",
      "reviewLink": "https://www.imdb.com/review/rw1112051",
      "warningSpoilers": false,
      "date": "26 June 2005",
      "rate": "9",
      "helpful": "82 out of 95 found this helpful.",
      "title": "Top , non-Miyazaki, Anime",
      "content": "This anime is about two gifted brothers who are intelligent, kind and ambitious. They live in a world where Alchemy, and subsequently Alchemist, is the law of the world (vs. science in ours). With alchemy, one can do wonders... repair broken items....change physical properties of a matter...etc. However, alchemy is bound to one rule....one cant take (or make) a thing without giving something in return. With this simple rule, the two brothers go in a maze of exciting adventures, meeting wonderful characters and even sometimes, respectable enemies. The anime is 51 episodes long, which might seem a little too long initially, yet fortunately...each and every episode will tie you to your seat and make you crave for more. Story line is good, a mix of brotherhood, friendship, love, humanity and (like any other anime) the effect of war on people, not to forget the hilarious moments this anime is mined with. Character development is excellent. Drawing is top notch and music is entertaining. Unfortunately, this anime is not concluded after 51 episodes. The movie, and hopefully the conclusion, is to be release 23rd July 2005. This anime is worth every second....a must see."
    },
    {
      "username": "Achyut_Prashast_Singh",
      "userUrl": "https://www.imdb.com/user/ur46915265",
      "reviewLink": "https://www.imdb.com/review/rw6964908",
      "warningSpoilers": false,
      "date": "25 May 2021",
      "rate": "10",
      "helpful": "7 out of 7 found this helpful.",
      "title": "It might not follow the manga completely, but its own original story is a masterpiece.",
      "content": "I have watched both the 2003 and 2009 versions, and while I think the 2009 version is superior, just like the majority of viewers seem to think, the fact that the 2003 version is overlooked also can't be denied. While it does go a completely different route from the manga after a point of time, the fact that it's something original at par with it instead of being a low quality filler-like string of episodes is the biggest reason I hold this version in high regard.I was so hooked that I watched almost 13-15 episodes a day and binged the whole thing in just four days. While some of the faces seemed drawn a little awkwardly (Roy Mustang's eyes having too much gap, for example), the overall animation quality is splendid. The action scenes are neatly drawn and beautifully crafted with sufficient tension and intensity to match the show's rather dark tone. There's some humor from time to time, but it is indeed pretty dark and serious, especially when you compare it to the similarly action-packed and dark but also the hilarious second adaptation.I know that the second adaptation is more faithful to the manga and far more epic, but this 2003 version uses a comparatively smaller percentage of the manga and expands it using original storylines developed by the creators, which is a huge plus point and remarkable. The character drama is well developed and something that adds soul to the proceedings. The ending, while dividing a lot of viewers, actually is pretty good given how the rest of the show unfolded, And yeah, the soundtrack is pretty cool and worth revisiting. I can't really say this is the superior version of the two, but this is surely a worthy competitor given how much originality it brings to the table on its own, which is again still laudable given how much it differs from the source material."
    },
    {
      "username": "filmfan1991",
      "userUrl": "https://www.imdb.com/user/ur35193004",
      "reviewLink": "https://www.imdb.com/review/rw4099084",
      "warningSpoilers": true,
      "date": "21 March 2018",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Despite being overshadowed by its more faithful sister series, the original FMA is one of the best anime series, PERIOD",
      "content": "I remember watching this tv show over a decade ago back when it used to air on Adult Swim. It was a much different anime series than what I was used to at the time. It was dark and gritty, but it still had fair amounts of humor. It doesn't matter if this show wasn't faithful to the manga because the original is still one of the best. This is a show that has to be seen to believed and it is so captivating even over a decade after its original release that it's easy to forget that this show is animated. I call that a true testament to the writers, animators and director that poured their heart and soul into this series. The story follows two brothers Edward and Alphonse Elric as they go on a journey to reclaim what they lost. Years before they tried to bring their dead mother back to life using alchemy, but it went horribly wrong. In the process Edward lost his right arm and left leg while Alphonse lost his entire body and had his soul bound to a suit of armor. That's the basic synopsis but the story gets more complex and engaging as the show progresses going into deep themes of war, family, corruption, genocide, and even religion. The story can be funny in one episode and then be dark in the next and still flow together. It is even heartfelt at times that it still makes me cry all these years later. The story is fairly faithful to the manga up until the Laboratory 5 arc then diverges and tells its own original story. Normally the story would have suffered in quality because of such a divergence but here its not the case. The story is still captivating and engaging. Now the characters are what really drive the core of this show because without captivating and interesting characters then the show wouldn't be watched. Edward and Alphonse Elric make for one of the best anime duos of all time and maybe even in all of television for that matter. Their brotherly relationship is very genuine, warming and they play off of each other extremely well. The supporting characters are all great as well and each of them gets to shine throughout the show. The main villains are artificial humans called Homunculi named after the Seven Deadly Sins and a man known as Scar. These are not your typical two dimensional villains out to control the world. The original FMA is probably one of the only tv shows I ever watched that made me sympathise with the villains and that is something that few shows even, live action are able to pull off well.The animation is great for its time and still holds up very well even by today's standards. The music by Michiru Oshima is very excellent bringing out the full emotion of the entire series. The most memorable for me was \"Brothers\" which serves as a somber theme to both Edward and Alphonse.The show is very notable for having a fantastic dub done by Funimation which is almost if not just as good as \"Cowboy Bebop\". Vic Mignogna is excellent as Edward and he does a fantastic job of bringing out his hotheaded personality and genuine emotions. Likewise with Aaron Dismuke who plays Alphonse. Dismuke was actually 12 years old around the same age as Alphonse in the tv show which added extra depth to the character. Both Mignogna and Dismuke play off each other very well and you really do get the sense that these are brothers looking out for each other. The rest of the cast is great too all giving great performances with Laura Bailey as Lust and Travis Willingham as Roy Mustang being the standouts.As you can probably tell I really love this series and I think it truly is one of the best animes ever made. I don't say that lightly. It really is that great despite it not being faithful to the manga unlike its sister series \"Brotherhood\". The show does a great job at telling its own original story and it is so captivating and engaging with each passing episode that its hard to stop watching. If anyone is looking into getting into anime, the original \"Fullmetal Alchemist\" is a great place to start."
    },
    {
      "username": "WeAreLive",
      "userUrl": "https://www.imdb.com/user/ur79460801",
      "reviewLink": "https://www.imdb.com/review/rw5921470",
      "warningSpoilers": true,
      "date": "20 July 2020",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "This was a very fun anime (warning for spoilers)",
      "content": "When Edward and Alphonse were kids there father went leaving their mother Trisha Elric to look after them. In the main time these two brother learn chemistry behind alchemy from their fathers notes. One day after coming home from playing with their childhood friend Winry Rockbell the Elric brother witness a very devastation sight of their mothers death. After this they end up committing a crime which was forbid in Alchemy. In attempts to revive their mother Edward ends up losing an arm and a leg and alphonse ends up losing his entire body leaving his sole into a robotic like/knight armour. The military find out of his crime and instead of arresting them they plan to train them into becoming soldiers and find away to bring their bodies back.The anime's story just takes me on journey which is not only touching but at the same time an adventure within the 51 episode count. While it may not be like the manga which is why brotherhood exists. I still enjoy it for what it is on its own merit.The voice cast is excellent Vic Mignogna put his heart and soul into the role of Ed and I honestly don't think anyone else would have had the same impact on me if it were someone else. With of course Aaron Dismuke giving an excellent performance as Alphonse who was 12 at the time when he was recording this. He not only sounds like adolescent boy but at the same time it made certain scenes look feel realistic. I am so glad this kid never left voice acting it's definitely the best role of his career. The rest of the cast were also pretty good.The music, the animation and everything else was excellent as well."
    },
    {
      "username": "vanillasquirelll",
      "userUrl": "https://www.imdb.com/user/ur15960565",
      "reviewLink": "https://www.imdb.com/review/rw1688683",
      "warningSpoilers": false,
      "date": "7 July 2007",
      "rate": "10",
      "helpful": "91 out of 106 found this helpful.",
      "title": "Dear, Dear, anime fans who obsess over Naruto and Bleach-YOU HAVEN'T SEEN ANYTHING YET",
      "content": "If I were to pick one word to describe FullMetal Alchemist, Hagane no renkinjutsushi, it would amazing, or ohmygod, or simply just a drop of the jaw and \"wow.\" But that wouldn't do something this great justice. For those of you have heard this series can't compare with Naruto and Bleach, no, it can't, it's 100x better. This series will make you laugh, feel a very deep compassion for the characters, want to make you scream in rage, make you want to scream with happiness, and yes, even cry. Yeah. I cried a couple times. And the plot, oh yes, the plot. It's one of the best I've ever seen. Some might say it's too dark, I disagree, it's just honest. It explains that what's gone is gone, and we can't bring it back, people die for a reason, people die for no reason, life isn't fair, you only get what you give, all good things come to an end and we can only make the best of what we're given. Now the Characters, from Edward to Envy, Winry to Hughes, Scar to Rose, Riza to Roy, all characters have something special about them, and it will make you feel a deep compassion for them, weather it's Edward or Roy. Each character is developed and deep to it's full extent. The music is great, the Japanese voice actors are amazing, and the English Dub is one of the best I've seen. In short: If your an anime fan, or just dipping your toes, FullMetal Alchemist is a showcase of wonderful characters and plot, action, drama, tears and laughs."
    },
    {
      "username": "kaboomzor",
      "userUrl": "https://www.imdb.com/user/ur6615030",
      "reviewLink": "https://www.imdb.com/review/rw1194319",
      "warningSpoilers": false,
      "date": "15 October 2005",
      "rate": "",
      "helpful": "63 out of 71 found this helpful.",
      "title": "I'm not the biggest fan of anime, but I can tell you - this is an excellent series",
      "content": "When I had heard that Fullmetal Alchemst, one of the most popular cartoons in Japan was coming to America, I must admit, I was a bit excited.I had heard about it many times form several of my friends who were die-hard fans of anime of any kind. I myself am not a particularly big fan of anime - I enjoy one every so often, but this absolutely blew me away.The tragic story is of the two Elric brothers, Edward and Alphonse (\"Al\" for short). In a tragic accident, their mother is killed. Devastated, the boys decide to use the ancient art of Alchemy to bring her back to life - but there's one complication: The main rule of Alchemy. This rule of \"Equivalent exchange\" states that \"Nothing can be gained without first losing something of equal value.\" The boys succeed in resurrecting their mother, but at a horrible cost - Edward's left leg is taken, as is Al's body. Desperate to restore his brother's life, Edward uses his own blood to inscribe an Alchemic circle in a suit of armor, binding Alphonse's soul to the metal. In doing so, he makes yet another sacrifice - his right arm is lost to the demons of the abyss.To recap - Ed loses his right arm and right leg, and Alphonse's body is taken. Now, you'd think that would be an equivalent enough exchange - two body parts and a whole body for their mother's life. But then you'd be wrong, of course. The thing they bring back is not their mother, but an inhuman creature composed of hastily put-together body parts - something that is human and yet not human. An abomination that cannot move or think on its own. From that point on, Ed and Al set out to learn the secret of \"Human Transmutation,\" the one Alchemic skill that would have any hope of bringing back their mother. But at a cost that they may be unwilling to accept...Overall, the series is gripping. Well-written dialogue, intense plot, and the best voice acting I've heard in a television series in a long time. Vic Mignogna, the actor who plays Ed in the American cast is absolutely brilliant - the voice he provides is believable and emotionally charged, a task most voice actors tend to fail miserably at. Aaron Dismuke, the voice of the 14-year-old Alphonse is excellent as well - not only does the irony of an adolescent voice coming from a six-foot-tall suit of armor succeed in getting a few chuckles, but the voice represents the character well. The voice acting brings the characters to life in a way that no other anime ever has before.Overall, it's an incredible series. I'd recommend this to anime fans, and fans of fantasy or sci-fi of any kind (unless you just can't stand Japanese cartoons). FullMetal Alchemist is definitely one of the best television series out there."
    },
    {
      "username": "JayDSan",
      "userUrl": "https://www.imdb.com/user/ur6272628",
      "reviewLink": "https://www.imdb.com/review/rw1177532",
      "warningSpoilers": false,
      "date": "22 September 2005",
      "rate": "",
      "helpful": "223 out of 239 found this helpful.",
      "title": "Changed my mind about Anime",
      "content": "I might as well just come right out and say it to start with--I have never been a fan of Anime. In general, I watch it if it happens to be on, but more as background noise than for the actual plot content. But this series changed my mind about all that.The first few episodes I watched were on Adult Swim. I liked the idea of magic being explained in a (somewhat) scientific fashion, so I found recordings of the aired episodes online (with subtitles) with the intention of watching them whenever I was bored.I say without shame that I, who have not watched more than a half hour of anime in a single sitting, watched all fifty-one episodes in a single sitting. And it had me sitting on the edge of my seat every time. When a few of the episodes were corrupted, I even edited the videos manually with a hex editor to get them to play properly.I was really turned off to Anime originally because of the way the Japanese animators use frame rates. You only really need one or two frames per second to show movement--and this contrasts with the relatively constant frame rate in American cartoons. It can look rather ugly if you're not used to it. For action scenes, though, they bring out the full 30fps, and the sudden contrast between 2fps, with the character standing there, and 30fps, where the character is executing these stunning martial arts moves, is an incredible sight to see.But I would like to say that this series is a complete series. The last episode does, in fact, contain the conclusion--no premature terminations here. Most anime contains a \"Lead-out\" which gives the viewer something to think about. It makes it seem more like the characters are still doing something, still living, even after the series is over. I must say that makes the end of the series even harder to bear, because believe it or not, it's like saying goodbye to a close friend.This series has definitely had a major impact on me. It is worth the time (or money) to acquire it. I wouldn't recommend watching all fifty-one episodes together like I did. The intrigue of the plot is intended to hit the viewers like a hammer, and it keeps them coming back week after week. If you watch them all together, it begins and ends so quickly you feel like you've been hit by a truck when it finally DOES end.Full Metal Alchemist is a prime example of excellent story writing. It'll make you laugh and maybe even make a few of you cry, but one thing it won't do is leave you disappointed."
    },
    {
      "username": "aw58",
      "userUrl": "https://www.imdb.com/user/ur11758434",
      "reviewLink": "https://www.imdb.com/review/rw1442349",
      "warningSpoilers": false,
      "date": "8 August 2006",
      "rate": "10",
      "helpful": "57 out of 64 found this helpful.",
      "title": "My favorite Anime",
      "content": "I was sick last year (2005 this is '06) for three days straight. So as a result I ended up 'channel surfing' all day and all night. I didn't get ANY sleep.Eventually I turned the channel onto Adult Swim. Mostly because I had seen the title Full Metal Alchemist and was drawn in. I remembered the myths about alchemy although vaguely mostly from random books I had read.The episode I ended up watching was the exam episode which should've been the actual beginning to the series but is actually around the third or fourth episode.And was hooked. I had thought that anime was a useless Japanese art form. Man was I wrong! Intriguing storyline AND amazing animation. This was an aspiring animators dream world.I ended up spending the rest of the year watching all the episodes on Adult Swim...I'd even wake up in the morning and think Full Metal Alchemist's on tonight! And plan my day accordingly. I also ended up buying the Manga which if you have cash to burn and love the series you should do so.The story itself is pretty straightforward at first and seems almost like Inu Yasha where there's the same premise behind every episode but that's only for a little while until you know the characters and than it starts adding to the background situations starts to show whats really going on and whats really behind their quest.The animation in itself just adds to the story with the rich backgrounds and the amazing fights.Overall this would be a good anime to start with if your looking for one. There's only 51 episodes, a movie -Full Metal Alchemist and the Conqueror of Shamballa- and a couple of games so it won't burn too big of a hole in your pocket."
    },
    {
      "username": "Chibichasechan",
      "userUrl": "https://www.imdb.com/user/ur8602397",
      "reviewLink": "https://www.imdb.com/review/rw1618360",
      "warningSpoilers": false,
      "date": "15 March 2007",
      "rate": "9",
      "helpful": "30 out of 41 found this helpful.",
      "title": "Well done, one of my favorite Anime.",
      "content": "Full Metal Alchemist, about 2 loving brothers who get thrown into a world a war and war craft just to receive a certain something, which therefore leads them into a completely different world, and opinion of their objective.I have been a fan of anime for a while now, ever since I was very small watching Sailor Moon and Pokémon. But ever since then I was blinded from the world of anime and wasn't into it anymore.Well, until I contacted my long lost ex-girlfriend after about 6 months on MSN, I can seriously say I was hooked, for the first time in my life.So I downloaded all of the episodes and watched about 10 a day, my eyes couldn't move off the screen as they were fixed on only one thing, the show. Which then later got me into reading the Manga, well only the first 5 since I cannot find the rest.The story and it's characters go through so much. From Ed and Al longing for the philosopher's stone to revive their dear mother, to despising it on learning how to create it, then to learning on what the Homculus group is really doing to Ed and Al.I would definitely prefer watching this amazing Anime, then read the manga, believe me, it's worth the time."
    },
    {
      "username": "graceseeker23",
      "userUrl": "https://www.imdb.com/user/ur7404958",
      "reviewLink": "https://www.imdb.com/review/rw1196535",
      "warningSpoilers": false,
      "date": "18 October 2005",
      "rate": "10",
      "helpful": "59 out of 72 found this helpful.",
      "title": "The Greatest Anime Series I Have Seen",
      "content": "It has been 2 weeks since I have finished this series and the ending is still lingering with me. I heard that this was an excellent series from a friend so I decided to check it out myself. Well, all I can say is that FMA has exceeded all my expectations and have become my favorite anime in recent years. It has actually surpassed my other favorites including Neon Genesis, Cowboy Bebop, Berserk, Escaflowne, GTO, and even Gungrave which is second on my list. The writer and director of this series has such a wonderful imagination. I just don't know how they come up w/ these ideas. The voice acting (Japanese), writing, animation, music, and action is awesome. I just can't praise FMA enough. This is definitely a journey worth taking for all those looking for a good anime."
    },
    {
      "username": "STEofMiamiU",
      "userUrl": "https://www.imdb.com/user/ur7094350",
      "reviewLink": "https://www.imdb.com/review/rw1170681",
      "warningSpoilers": false,
      "date": "10 September 2005",
      "rate": "",
      "helpful": "53 out of 65 found this helpful.",
      "title": "A story with an ending no one I know could even guess",
      "content": "This series has one of the most amazing endings I've ever seen...ANYWHERE. Out the half dozen other people I know who've seen the entire series, not one of us was able to even come close to guessing the ending. FMA reminds me a bit of Harry Potter just in that, in both series, you have 1) child prodigies, 2) engrossing character growth and plot development, and 3) a story that individuals of all ages can appreciate and enjoy. One thing I appreciated and enjoyed very much about the series is that it's like one long fable--there's moral after moral after moral. As a side-note, it's one of the only animes that I've seen which spans several years, allowing for a lot more character growth and focus on the players in the story than is typically seen in most animes. Probably the single best anime that I've ever seen, and certainly in my Top 10 favorite stories of all time. Like Harry Potter though, it may at first appear to be a kids' story, but toward the end it's oriented more toward adults. Highly recommended."
    },
    {
      "username": "dave13-1",
      "userUrl": "https://www.imdb.com/user/ur5625948",
      "reviewLink": "https://www.imdb.com/review/rw2595542",
      "warningSpoilers": false,
      "date": "12 April 2012",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "The best anime series in YEARS.",
      "content": "Most of the anime series currently in release, let's be honest, are basically toy commercials. The characters are just kids playing with toys, showing the viewers how the games work, showing how much fun the game is, and whipping in repetitious plugs for game expansion packs. This magical adventure is a rare exception and a rare gem. The complex fictional frame has no other purpose than to provide a background for a brilliant and moving tale that combines the fantastic with dark human tragedy and indomitable brotherly love. Two teenage brothers, prodigies in the 'science' of alchemy, travel in the name of the state, looking for the philosopher's stone. The stone can amplify an alchemist's power, making it the object of both evil and noble ambitions. The brothers themselves want the stone to restore their bodies, one damaged, the other lost - his soul now inhabits an empty suit of armor - in an ill- advised effort to employ alchemy to raise their dead mother. Along the way, they meet an assortment of practitioners who use and more often abuse their power. This first instalment in the series was so interesting, so emotionally involving and so just plain different from so much current anime that I could not wait to get to the next disc. Highly recommended."
    },
    {
      "username": "rawlinson_stephen",
      "userUrl": "https://www.imdb.com/user/ur7445120",
      "reviewLink": "https://www.imdb.com/review/rw1565083",
      "warningSpoilers": false,
      "date": "6 January 2007",
      "rate": "9",
      "helpful": "32 out of 35 found this helpful.",
      "title": "Utterly addictive pleasure",
      "content": "Whilst most anime is an acquired taste, falling into the fighting (think Dragonball or Bleach) magical girl (Sailor Moon) or romantic (Chobits) genres, Fullmetal Alchemist rises above all this. As the story gradually unfolds, you are drawn ever deeper into a believable alternative world where magic replaces science and its practitioners (Alchemists) are held in high esteem. Yet, few are what they seem and you cannot trust anybody. The good are, in fact, capable of deeds of great evil, and the bad are often doing what they do for good reasons. And just when you think you're getting a handle on it, something comes along that shocks you in such a way you are left thinking about it for days to come. Whilst there are obviously anime elements (the look, fighting segments) the story and, above all, the willingness to shock the audience by hurting and killing characters we have come to know and admire, make Fullmetal Alchemist well worth your time. Of course, you will have to invest a lot of time - 51 half hour episodes and a movie means 26 hours or so of viewing. But it is time well worth spending."
    },
    {
      "username": "BushidoHacks",
      "userUrl": "https://www.imdb.com/user/ur1475225",
      "reviewLink": "https://www.imdb.com/review/rw0982239",
      "warningSpoilers": true,
      "date": "20 December 2004",
      "rate": "",
      "helpful": "14 out of 18 found this helpful.",
      "title": "Dramatic and Impressive",
      "content": "At times the story for Edward and Alphanse is melancholy. The boys lose there mother. They lose their bodies. They lose people who care for them, who befriended them, and who they thought they could trust.It could be stated the story is that of loss at the beginning. However, the story's main theme is the Principal of Equivalent Exchange, the postulate that states that nothing can be gained without loss. In the real world, this is a true statement, except it does not apply to the magic and alchemy which is part of the story of Full Metal Alchemist. Children are born into the world only to lose their parents in the future. Peace can be achieved between two nations while war begins with another set of nations. A new day begins while the day ends on the other end of the world. This is the story of Full Metal Alchemist. A story that nothing can be gained without losing something else. Conversely, nothing can be lost without gaining something in return."
    },
    {
      "username": "tankace",
      "userUrl": "https://www.imdb.com/user/ur63469855",
      "reviewLink": "https://www.imdb.com/review/rw3568304",
      "warningSpoilers": true,
      "date": "24 October 2016",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "What grief and lose does to the people.",
      "content": "Full Metal Alchemist follows the two brothers Edward and Alphonsoe Elric during their search for the philosopher's stone in order to get their bodies back to normal, after an alchemy experiment went horribly wrong. That's the summary of the show more or less, but what I really make me like the series was that its main focus was what people are willing to do in order to get someone they loved back or honor their legacy no matter the cost.And here is were Alchemy fits perfectly for the main principal of that SCIENCE is \"For anything of value to be create something of equal value must be sacrificed, that is the law of equivalent exchange\". So in the series we meet any characters who either throw this rule of the widow to get what they want, use it as an excuse to do horrible things or on the bright side use it as a motivation to do some good in the world. In general alchemy is portrait as a science which makes the user seem all powerful and god like, but break those rules and something terrible is going to happen ,much like with the science of our world, dismissed it, make fun of it and in the end the rules, who spare neither good nor evil, nor rich nor poor, will come and beat you in the ass.But to elaborate to the subject of grief and in general on the human relationships in the show. Even character that look at first goofy and immature, when you past some time with them you see that their clever, responsible where is absolutely necessary and loyal to the core, in simple words persons that in a case of life and death are the best for the job, OK anyone who saw the series is going to thing Alex Louis Armstrong and Maes Hughes ,amn what a character! Also the villains are also motivated by a desire to either avenge lost friends and family ,or to get power, wealth, respect or the deepest of all a sense of goal in life. In short we see every kid of motivation from the shallower to the the most though provoking and meaningful.Overall I recommended the series as a gate-anime for anyone who wants, as I, to start watching anime series and movies and doesn't know from where to begin, here is a way."
    },
    {
      "username": "ThunderKing6",
      "userUrl": "https://www.imdb.com/user/ur71305899",
      "reviewLink": "https://www.imdb.com/review/rw6450344",
      "warningSpoilers": false,
      "date": "6 January 2021",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "My IMDb stalker please stand up.",
      "content": "Hagne is a special show.I'm not really into anime besides Pokemon, Dbz and digimon and a couple others.Animation, story was a magnificent experience. Hagne is underrated gold.Verdict: as for my IMDb stalker... Your verdict is a BIG L."
    },
    {
      "username": "miguelweidlich",
      "userUrl": "https://www.imdb.com/user/ur68288339",
      "reviewLink": "https://www.imdb.com/review/rw4494793",
      "warningSpoilers": false,
      "date": "4 December 2018",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "One of the best examples of balance",
      "content": "In 2003 a anime giant was born in the form of Fullmetal Alchemist. The first and one of the very few shows in general (not only Japanese or animated) to be well balanced. It got great action, but it also got great dialogues! It got great humor but it also got great drama! It got a great timeless soundtrack but once it also got great pop songs in the openings and endings! It got it's flaws (particular with the ending). But even then it's balanced up! It's very hard to find a story THIS balanced in any media, and when I find a show like this, it just make my day better. I definitely recommend it."
    },
    {
      "username": "theriteofspring",
      "userUrl": "https://www.imdb.com/user/ur3392231",
      "reviewLink": "https://www.imdb.com/review/rw1234682",
      "warningSpoilers": false,
      "date": "10 December 2005",
      "rate": "",
      "helpful": "65 out of 87 found this helpful.",
      "title": "Trade An Arm For Full Metal Alchemist If You Have To",
      "content": "A friend raved about this anime, so I took a cursory scroll through it and found nothing worth noting. It just seemed so homogenized. The art didn't stand out. The characters seemed to be cookie-cutter determined types out to save the world. Even the name \"Fullmetal Alchemist\" seems completely avoidable with magic being the status quo in much of anime. I borrowed a disc anyways and watched it. I begged for the other discs in advance.Fullmetal Alchemist has superb flow. 24 is the only thing in recent memory that has a comparable flow and that's only because that show supposedly happens in real time. In FMA, you have multiple reasons to continue each episode but the focus is not lost. It's always centered (unless if very appropriately not centered) on the two Alric Brothers who share perhaps the strongest bond in all of anime. This bond may be broken at any time, mainly because FMA takes place in a very dynamic world. A war may possibly re-surge. Fellow soldiers we meet rise in ranks and there are casualties. But amidst all this is a very pervasive mystery to which no one is safe. We are as blind to this mystery as the brothers and it's unnerving to stop watching, knowing that unseen forces may encounter our heroes at any time. Prepare to marathon. It's a continuous narrative, unlike that Cowboy Bebop crap.Above all, FMA is a parable. We're told about the principle of equivalent trade, which is yin yang in other words, but we get much more than this taoist tidbit. We learn to deal with death. People do grow old and die. People do die for a reason. People do die for no reason. Some people may call FMA needlessly dark for a children's anime, but rather it's brutally honest. It's likely you will feel real pain. It's unlikely you'll forget the pain. Anyone we meet to whom a great misery befalls is so uniquely focused and blindly determined that the mechanics of his/her devastation become very clear. They seem proverbial, as though the Brothers Grimm were revived to create some of these characters. The series has enough fluff to get us through grim reality, but most of the time, it's really an opportunity to show how much heart many of the characters possess. It may seem odd for an anime centered around some teenage boys to have no sexual connotations whatsoever, but that'd just get in the way of the very strong emotions expressed in this anime. Friendship is the greatest form of love, and the one between the Alric Brothers is perhaps the greatest friendship in all of anime.Concerning the Technical aspects once more, the animation is great where it counts (where there's action). Being a musician, I find it odd that I don't remember any of the music. It's definitely there and fitting, just not memorable. Doesn't matter. This anime could look and sound like crap and still be worth watching."
    },
    {
      "username": "joana98",
      "userUrl": "https://www.imdb.com/user/ur91114609",
      "reviewLink": "https://www.imdb.com/review/rw7578728",
      "warningSpoilers": false,
      "date": "24 November 2021",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "much more than an anime",
      "content": "I used to watch this anime as a child. Of course I enjoyed the fantastic magical part of it, but despite everything I still remember the opening quote: \"Humankind cannot gain anything without first giving something in return. To obtain, something of equal value must be lost. That is alchemy's first law of Equivalent Exchange. In those days, we really believed that to be the world's one, and only truth.\"much more than just a cartoon."
    },
    {
      "username": "socalichic4eva",
      "userUrl": "https://www.imdb.com/user/ur1512349",
      "reviewLink": "https://www.imdb.com/review/rw0939128",
      "warningSpoilers": true,
      "date": "29 August 2004",
      "rate": "",
      "helpful": "13 out of 18 found this helpful.",
      "title": "One of the most impressive anime shows....ever.",
      "content": "I know you tend to hear that, a lot. This anime or that anime is the epitome of brilliance and beauty. But \"Hagane no Renkinjutsushi\"(translated as Fullmetal Alchemist) is one that really deserves the praise.Slight spoilers may appear in the following paragraphs. The story, which easily becomes engaging and addictive, revolves around the young brothers, Edward and Alphonse Elric. They both study the powerful and complicated science of alchemy, which allows the user to create one object out of another, such as turning lead to gold, or water to wine. There are some natural laws and taboos of the world of alchemy, though. You must give something of equal mass in order to gain something. Turning lead to gold is not allowed. But, most importantly, transmutation of humans (Human, or Bio Alchemy) is forbidden.When Al and Ed break the most dangerous rule of all, they pay the ultimate price. In a failed transmutation, Alphonse loses his entire body, and Edward loses an arm and a leg. They now search for the Philosopher's Stone, which which hopefully be able to restore their bodies. On their journey, they must deal with corruption in the military, a vengeful man who preys on alchemists, soulless gollems called \"homonculi,\" alongside personal pain and haunting memories.Fullmetal Alchemist has some of the most wonderful imagery I've ever seen in an anime. Gorgeous, flowing animation, unique character designs, and some disturbing sequences that will stick with you for days. There is a brilliant underlying darkness in all the scenes, even when sometimes it falls into a little silliness. There are some very surprising twists, heart wrenching deaths, and some great observations on religion, science and government, all thrown in. Major praise also is deserving for the women that play the two brothers- Kugimiya Rie and Paku Romi. They handle the emotions of seriousness, fear, loathing and horror with such skill.I'm very surprised that no one else has posted a review for this show yet. In the fan community, it's one of the biggest things since Naruto. Hugely popular- and worthy of the popularity. This is definitely one you'll want to watch, and then add to your collection. Check it out when it comes to Cartoon Network on November 13th at 11:30. You may just be surprised."
    },
    {
      "username": "mikeydewsnap",
      "userUrl": "https://www.imdb.com/user/ur71651805",
      "reviewLink": "https://www.imdb.com/review/rw6007414",
      "warningSpoilers": false,
      "date": "18 August 2020",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "I watched brotherhood first, but...",
      "content": "Coming from someone who used to say Brotherhood was his favourite series, I can honestly say this series is equally as good as the remake. In many ways this show's story and themes are much more mature than the more adventure focused 2009 series. It also has a superior soundtrack and stronger story boarding and colour direction.I strongly recommend new fans watch this series first!"
    },
    {
      "username": "insatiableaskeri",
      "userUrl": "https://www.imdb.com/user/ur134032486",
      "reviewLink": "https://www.imdb.com/review/rw8550910",
      "warningSpoilers": false,
      "date": "17 September 2022",
      "rate": "8",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Meaningful piece of art!",
      "content": "To encapsulate, I just gotta reckon that the story about two spunky and rampant Elric brothers is worth a shot! Like in any other anime flicks there are tons of exuberant jokes, thoughtful characters and highly emotional situations that wring your heart! In fact, there is a plethora of moral paradigms that are thoroughly mentioned in this film such as retaliation for a close person, disingenious attitude in favour of personal needs and great stamina while having eternal casualities and facing with unscrupulous and snotty enemies.A must-watch for everyone who cherishes loyalty, real friendship and wholehearted self-commitment to reaching the goal!"
    },
    {
      "username": "siderite",
      "userUrl": "https://www.imdb.com/user/ur3146136",
      "reviewLink": "https://www.imdb.com/review/rw1409313",
      "warningSpoilers": false,
      "date": "3 July 2006",
      "rate": "8",
      "helpful": "6 out of 11 found this helpful.",
      "title": "This cute anime has what Harry Potter lacks",
      "content": "It is about many things, amongst them brotherly love, honour (you can't miss that in a Japanese film :) ), respect for life, etc... up to the meaning of life and death itself. But what I thought it started bringing into this world is what the Harry Potter books lacked: responsibility for your actions. You can't just do anything and not give something in return.However, along with good ideas, nice animation, beautiful scenery and appropriate music, there were some elements that I hated more than anything. The women in this film needed a good spanking, each and every one of them. Things that were important for the characters were completely ignored because these women had a vision about good and bad and a lot of feelings to be resolved. Also the silliness was above the comfort level. I mean, can you really feel a movie if people keep making faces at each other and getting annoyed by insignificant things while wars and death and magic surrounds them?OK, I understand that movies about responsibility are mostly directed towards children, but this could have been a more intense and with a wider success if the makers would have heightened the audience level a little.Overall, though, it is a great show. I can best relate it to Inuyasha, less about romance, more about brotherly love, and set in a parallel 1920s.Addendum: the series has a full length movie that really completes the whole show. I didn't feel it was part of the series, though, with a lot of characters out of... well, character, and some silly connection with Hitler and this side of the \"Gate\". Warning: seeing the movies without watching the series is pointless, you won't understand anything."
    }
  ],
  "errorMessage": ""
}