{
  "imDbId": "tt8420184",
  "title": "The Last Dance",
  "fullTitle": "The Last Dance (TV Series 2020–2020)",
  "type": "TVSeries",
  "year": "2020",
  "items": [
    {
      "username": "ThomDerd",
      "userUrl": "https://www.imdb.com/user/ur73053202",
      "reviewLink": "https://www.imdb.com/review/rw5749962",
      "warningSpoilers": false,
      "date": "18 May 2020",
      "rate": "10",
      "helpful": "170 out of 175 found this helpful.",
      "title": "It's personal.",
      "content": "A great docu-series, kudos on the direction and putting it all together, making it very exciting to watch. Undeniably, Michael Jordan is the master in finding motivation. For every episode, every grudge, every game...it's getting personal for Michael. The rest of the Bulls protagonists also make this dynasty memorable and they all together bring back a nostalgia for the 90s. But for Mike, it's always personal. Overall, some time jumps are confusing and some important things maybe are brushed off too fast, while other events get a greater mention than they should; that's the only negative thing I could spot. The rest looks great, especially the remastered footage and the interviews. If you are not familiar with the 90s Bulls and Michael Jordan then this will provide a 360 view on the legend. 10/10"
    },
    {
      "username": "danielcereto",
      "userUrl": "https://www.imdb.com/user/ur29002389",
      "reviewLink": "https://www.imdb.com/review/rw5659033",
      "warningSpoilers": false,
      "date": "20 April 2020",
      "rate": "10",
      "helpful": "261 out of 281 found this helpful.",
      "title": "The Last Dance",
      "content": "As a basketball lover that grew up watching Michael as an idol this series called \"The last dance\" is just an amazing dream. I was only a teenager during the 90's with barely access to NBA basketball or footage. So, all the episodes are just amazing. Pretty intense, interesting and an amazing way to understand how Michael Jordan become the best NBA basketball Player of all time and at the same time understand how was his last dance with the Chicago Bulls."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8576933",
      "warningSpoilers": false,
      "date": "30 September 2022",
      "rate": "10",
      "helpful": "44 out of 45 found this helpful.",
      "title": "One of the best sports documentaries of all-time!",
      "content": "As a basketball player who grew up watching Michael Jordan, this documentary was absolutely amazing! For those of you that were too young, this was a great introduction to the best player of all-time! This documentary shows both the ups and downs of one of the best dynasties in sports history and an inside look at one of the best athletes to ever walk this planet! The ONLY people who seem to not like this documentary and rate it low are 12-year old LeBron fans (not all, just the Jordan haters) who can't stand the FACT that 90% of the world thinks Jordan is easily the best ever. It's not even an argument when 9 out of 10 people believe one thing and in this case it's that Jordan is the GOAT. But that 1 out of 10 keep trying...God bless em!"
    },
    {
      "username": "allmoviesfan",
      "userUrl": "https://www.imdb.com/user/ur62318327",
      "reviewLink": "https://www.imdb.com/review/rw8810209",
      "warningSpoilers": false,
      "date": "19 January 2023",
      "rate": "8",
      "helpful": "26 out of 26 found this helpful.",
      "title": "The Last Dance",
      "content": "One of the best - if not the very best - sports documentary I have ever seen, but the rating I've given it is because of the distinct lack of Luc Longley, who won three championships with MJ, Scottie, Dennis and Phil, but is rarely, if ever, sighted. As an Aussie, that's not good enough. More Luc! But seriously, The Last Dance is a brilliant look into the final NBA title that the Bulls won with Jordan and Jackson before the team was rebuilt, with it's core going their seperate ways. Present-day interviews are interspersed with game footage and interviews from the era. Some very interesting revelations from all sorts of people in and around what is arguably the greatest basketball dynasty in history. Highly recommended!"
    },
    {
      "username": "Lukasmj",
      "userUrl": "https://www.imdb.com/user/ur158768880",
      "reviewLink": "https://www.imdb.com/review/rw8674559",
      "warningSpoilers": false,
      "date": "14 November 2022",
      "rate": "10",
      "helpful": "26 out of 26 found this helpful.",
      "title": "Very good documentary, about the last season of a iconic Basketball-Team.",
      "content": "I loved \"The Last Dance\".It perfectly accompanies viewers through the Bulls' 1997-98 season.Perfectly shows the successes of the Bulls, but also the setbacks.Plus getting interviews from players who played back then this season just makes it all the better.But I'm probably just a little influenced because I've always loved Michael Jordan. Not only because of his talent in basketball, but also simply because of his personality and his stamina.If you want to see a good documentary about a great basketball team with background information, you are more than served with \"The Last Dance\"!"
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw7408736",
      "warningSpoilers": false,
      "date": "4 October 2021",
      "rate": "10",
      "helpful": "40 out of 42 found this helpful.",
      "title": "A must watch for any sports fan!",
      "content": "This documentary is about the best player of all-time in Michael Jordan and how he led the best team of all-team in the Chicago Bulls as they make a run for their sixth championship in the last year the team competed together. You don't even have to be a Jordan fan, or even a basketball fan for that matter, to enjoy this documentary. It's terrific, the only thing that I didn't like that much was how they time jumped so much. This documentary has unseen footage and candid interviews as it goes in depths into the team and the pressure they were under to win. It will make you emotionally invested whether you're a fan or not. If you want a compelling documentary on one of the best sports dynasties ever then give this a try!"
    },
    {
      "username": "ivanmessimilos",
      "userUrl": "https://www.imdb.com/user/ur45842290",
      "reviewLink": "https://www.imdb.com/review/rw7258700",
      "warningSpoilers": false,
      "date": "22 August 2021",
      "rate": "9",
      "helpful": "20 out of 20 found this helpful.",
      "title": "Amazing detail documentary",
      "content": "An amazing and detailed documentary about jordan, one of the best and greatest athletes ever, not just a basketball player.Considering a total of just over 8 hours, his entire career has been shown through numerous unpublished recordings, interviews and photographs. Although the title the last dance represents his last season in a Chicago bulls jersey, the documentary touched on literally everything in his career. I think that a lot of effort has been invested in building a project like this. Just collecting and restoring old shots seems like an eternity. I especially liked that this is not a typical documentary with a linear plot because every bit of the plot goes back in time when it is related to the appropriate story or person. The documentary is further enriched with many people from Jordan's private and sports life, so we can see some events from multiple perspectives, there is his family, his teammates, but also rivals, opponents and people who are totally unknown to the public, but are always were with him. Although i knew most of the things from his sports life and how games ended, when he dropped out, when he won the title, how and against whom, i still felt a certain tension and excitement because of the way the documentary showed everything and some minor things which i didn't know, but all together it's great connected so we have depth of the overall story and career. From my perspective Jordan has always been big and untouchable. The bulls were the best team and Jordan their best player. The fact that Toni Kukoc, as a Croat from Split, was an important wheel of that machine, certainly helped. This is where i see the only complaint with the whole project. Many players got a bigger stage light in the documentary (probably because they're Americans so they're more interesting) than they objectively deserved with their games from Kukoc who was the third Bulls player in importance and statistically. But I don't want to talk about it now even though i could really do a lot about Kukoc, but that's for some other, sporting discussion.Definitely a recommendation for all fans of sports, basketball, and i believe for those who are not so interested in sports. I've watched these ten episodes in three days, and i'd have watched it before had i had more time because it's really great done from a film perspective."
    },
    {
      "username": "eb-77766",
      "userUrl": "https://www.imdb.com/user/ur115866776",
      "reviewLink": "https://www.imdb.com/review/rw8469761",
      "warningSpoilers": false,
      "date": "20 August 2022",
      "rate": "10",
      "helpful": "23 out of 23 found this helpful.",
      "title": "Sporting documentary at its finest",
      "content": "I had thought about watching this for 2 years since I heard a lot of positives about it. When I finally turned it on it didn't disappoint..As a Swedish kid in the beginning of the 90's my first impression of the NBA and MJ was Dream Team in -92.. I am not really a basketball fan but that said that is one of the stronger sporting memories I have and especially from the Olympics. That team really made the NBA global and I still remember some specific plays from that tournament. To say I was impressed is some understatement..The rest of the 90's I followed the NBA and the Bulls sporadically but that's a lot more than it was before. In the 90's broadcast wasn't as available as it is today either. I specifically remember MJs 5th match in his comeback (55 points) because it actually was quite big news even in Sweden that now he was really back.But about the documentary itself.. Tbh, the raw material is pretty good. Both the Bulls of the 90's and MJ are very interesting stories. But personally I believe they have made a great job. A lot of players, coaches and other staff members give their perspective on those days which gives a nuanced picture of the events.Because I also think that they (at least try to) give an honest picture of MJ as well. He wasn't a saint by any means and he wasn't trying to be either. But watching this there is no doubt he was the ultimate competitor. I can't remember how many times a guy outshined him one day to be completely outplayed the next day. Or whatever.He was a complex teammate as well. Some even say he was a bully and depending on how you received him that could absolutely be the case. I myself wouldn't have been able to handle him as a teammate. Too much.But the greatest sporting figures don't end up there by chance. They are different. They are competitive at a level most people can't relate to. And that was MJ.. He was also a physical specimen few can match and he made the most of it.I also think it's obvious that MJ was a decent guy. He loved his parents and family and his emotions about his father's fate were really strong.. He was also very emotional even if he kept most of that within himself. He was also very passionate about the team and despite a big ego he wanted his teammates to succeed as well.All the characters involved of course made up for this great documentary as well.. Phil Jackson, Scottie Pippen, Dennis Rodman, John Paxson etc but also opponents like Magic Johnson, Reggie Miller or Larry Bird.My favorite was Steve Kerr though. A guy who wasn't the most talented but worked his way up and made himself significant and earned everybody's respect including MJs. Very humble and nice to listen to as well.Finally.. I am a huge sports fan but as I said I am not that much into basketball. However I am not that much into boxing either. But there are sport stars (like Barack Obama fittingly claimed in the end) who go way beyond their sport. Michael Jordan is one of those athletes. Muhammad Ali was another. Tiger Woods has to be mentioned up there for me as well. Roger Federer is my personal favorite . Usain Bolt. Etc. It's of course a personal opinion.It was a true joy to watch this series about one of these athletes and his team in the 90's.Of course 10/10."
    },
    {
      "username": "tinytots2",
      "userUrl": "https://www.imdb.com/user/ur144605672",
      "reviewLink": "https://www.imdb.com/review/rw8457485",
      "warningSpoilers": false,
      "date": "17 August 2022",
      "rate": "8",
      "helpful": "18 out of 18 found this helpful.",
      "title": "What time is it? Game time!",
      "content": "Michael Jordan is one of the most accomplished and celebrated sportsmen of all time. Chronicling the superstar basketballer's career and rise to fame, The Last Dance tells the tale of Jordan and the Chicago Bulls dynasty of the 90s that won six NBA Championships in eight years.The show is compelling and entertaining both for casual sports fans and avid basketball lovers. Jordon's emergence on the scene, his growth and improvement culminating in the Bulls' first three-peat, the 1992 Olympics experience with the Dream Team, the baseball interlude after his father's murder and his successful return to the NBA to lead the Bulls to their second three-peat are all presented in engaging fashion. His innate talent, fiery competitiveness and determination to win are in abundant evidence throughout. Others that played key roles in the Bulls' success such as coach Phil Jackson and teammates Scottie Pippen and Dennis Rodman also receive their due. The recorded game footage and locker room content shines a light on the diverse personalities and their interpersonal relationships while also depicting the intense pressure due to the media's constant scrutiny. Similarly, the interviews give different perspectives on the events that occurred along with recounting humorous anecdotes and interesting incidents. All of this is blended together impressively, with the varied soundtrack deserving a special shout-out.Of course, no documentary can include every relevant aspect and be completely free of bias. Prominent rival players like Karl Malone and Shawn Kemp are featured but not interviewed while others part of the Bulls dynasty like Luc Longley and Ron Harper are absent. Jerry Krause, perhaps a little undeservingly, is made out to be the scapegoat of nearly every decision. Jordon's marital problems, especially during the controversial \"gambling problem\" times, are not alluded to. The non-linear timeline is helpful when hearkening back to childhood or early career years; however, its use becomes questionable towards the end as there is little narrative connection between the individual scenes and segments. Additionally, the claim of there being a lot of unreleased candid footage for the 1998 season is never borne out and the pacing makes it hard to tell if the focus is on that specific year or on much of the past decade.For all its flaws, The Last Dance makes for an immersive and enjoyable viewing experience as it relives the years of Jordan-mania in all its glory. The show relates an informative and insightful story about a sporting icon beloved worldwide and the legendary team he led to many triumphs."
    },
    {
      "username": "greg-goremykin",
      "userUrl": "https://www.imdb.com/user/ur36802151",
      "reviewLink": "https://www.imdb.com/review/rw5747658",
      "warningSpoilers": false,
      "date": "18 May 2020",
      "rate": "10",
      "helpful": "119 out of 135 found this helpful.",
      "title": "Why 10/10 isn't overstating it.",
      "content": "I've had never liked Michael Jordan (the hazards of being a Pistons fan I guess, you grab onto anything the slightest bit negative about someone you're predisposed to not like, that confirmation bias), just like as a Tigers, Wings and Lions fan I dislike all the icons over the years with the Sox and Cubs, 'Hawks, or Bears either. The rivalries between Detroit and Chicago with all our rival teams for so many years being in the same conferences and divisions, you are almost expected to loathe each others' teams and fans.But even 25 years past it's still a real thing, whether justified or not, and I will always consider Jordan a suck for forcing Isiah Thomas off the Dream Team. Other people may be taking flak e.g. Magic Johnson now after so long to get some of it off Jordan, but at the time the sole thing stopping Thomas from (rightfully, it was a real unwarranted slap in the face to him) being on the team was Jordan, and everyone knows it.It came close to a real abuse of power, in this case star power to interject himself into a decision he should have had zero influence in. That makes it doubly ironic that he didn't help his biggest asset, Scottie Pippen, out by using the undeniable star-power franchise-making influence he had over the entire Bulls organization from bottom to top to force the GM and/or owner to offer Pippen a wage reopener on his contract. Other athletes did this all the time to help out a teammate who got a particularly horrible contract, ones with much less power than Jordan I might add. When Pippen was traded Shaq immediately gave up 2 million dollars a year of his own salary to give directly to Pippen, and they were brand new teammates with no existing relationship of any kind.That's what a classy player does, or one with the slightest lack of pervasive self regard. At the time I'd hoped it shamed Jordan a bit for Shaq to have done what he did without a second's thought, again, what a class act in comparison, but Jordan has always struck me as an Ayn Rand-type, with that \"I at least partially lucked into this lifeboat so I hope the rest of you suckers can swim\" attitude, and him never lifting a finger when he could have with absolutely no detriment to himself to make sure one way or another than the league-wide disgrace over the pittance Pippen was paid was rectified. There was no downside to Jordan to help out someone who's supposed to be not just your most needed teammate to help you do the magic, like Messier to Gretzky, but also a friend.But maybe that really ruthless way of looking at every opportunity or situation on or off the court as toward one single goal, winning, blinded Jordan to this really easy opportunity to do something truly righteous and with the kind of fortune Jordan amassed through sponsorships he could well afford to shave a couple of mil off his Bulls salary to help out Pippen who had arguably earned that money right off Jordan for how they had eyes in the back of their heads knowing every second where the other one was on the court, it was uncanny.And I haven't even mentioned the series yet I know, but I wanted to give the full context about how many different things I don't like about Michael Jordan before saying how much I loved this documentary series. I'm a big fan of documentaries, but especially longer series versus a feature-length, where the director and writer(s) can really dig into a subject. I watch the classic older docs like \"Victory At Sea\" or \"The World At War\" that Laurence Olivier narrated so well, and I try to watch every decent documentary series from all over the world as much as I can (other than cheesy ones with inaccuracies that don't dig very deep into the subject matter, like those churned out by \"history-themed\" cable channels).I came into this wanting it to be a total hatefest on my part while watching, about this documentary was so riveting in that way that it makes you forget yourself as well as any preconceived notions one has about Jordan; maybe that is why this has really proved popular beyond all expectation in this weird time we are in. It is the ultimate escapism for a sports fan particularly, and even more particularly when sports of any type are in short supply. And I found something so very unexpected happening inside me, deeply in a way, as a person, seeing Jordan's humanity so fully exposed as it was bound to be with so many thousands of hours of film to go through, it changed the way I feel about Jordan completely just through the reaction of my own basic compassion I develop for anyone I get to know, and I feel like through watching this I really got to know Michael Jordan, the person, not just Michael Jordan, the player.Beyond reliving something in a way that makes you feel you're right back to all those times if you'd been a basketball fan that long, and feel like you're back there still even if you hadn't been born yet maybe. The series really uses framing of the different time periods very subtly, but while still shifting the mood seamlessly in a second flat... I don't think I've ever quite seen that before. I just turn 50 and this series brought me back with such potent nostalgia to my 20s that I felt like I did watching some of those games for the first time ever, a virtual time machine, and though I still don't like some of his actions and choices back then, \"The Last Dance\" made me like Michael Jordan, the man. Maybe even love him. And considering my starting point, that is something."
    },
    {
      "username": "sriramthestranger",
      "userUrl": "https://www.imdb.com/user/ur108282385",
      "reviewLink": "https://www.imdb.com/review/rw7791093",
      "warningSpoilers": false,
      "date": "23 January 2022",
      "rate": "10",
      "helpful": "12 out of 12 found this helpful.",
      "title": "Fantastic Sports Documentary!!!",
      "content": "Its not just a documentary of events, rather it dwells deep into the psyche of Jordan and his teammates. One of the rare documentaries that keeps you hooked for all the 10 episodes and uplifting. Definitely a must watch!!!"
    },
    {
      "username": "mg-231645",
      "userUrl": "https://www.imdb.com/user/ur112107413",
      "reviewLink": "https://www.imdb.com/review/rw8747238",
      "warningSpoilers": false,
      "date": "20 December 2022",
      "rate": "",
      "helpful": "24 out of 24 found this helpful.",
      "title": "Bulls Dynasty!",
      "content": "Back in 2020 when I watched this on Netflix, it delivers an outstanding documentary of Michael Jordan & Chicago Bulls. This documentary totally indicates how the bulls started an all-time dynasty team. I really appreciate the story it was so amazing, MJ shows how to lead a team by motivating his teammates. Scottie Pippen also shares one of his career experiences during his time on the bulls.Unforgettable moments like the first & second threepeat of the bulls during 90s era. The 1995-1996 season is my favorite episode on this documentary.Jordan, Pippen and Rodman are the best.It was so good 10/10."
    },
    {
      "username": "trapp_33",
      "userUrl": "https://www.imdb.com/user/ur126888395",
      "reviewLink": "https://www.imdb.com/review/rw7894714",
      "warningSpoilers": false,
      "date": "24 February 2022",
      "rate": "9",
      "helpful": "15 out of 15 found this helpful.",
      "title": "masterpiece",
      "content": "The series shows you the way to ascend from beginning to end and the way they move in the timeline is something special and I have not seen it before, and how it shows you that the team's journey was not easy and smooth. They went through many difficulties to win titles and the most beautiful thing is that it is a true story and not a fantasy and I loved the way the characters moved between now and before, the music was great, and the way the events progressed was beautiful and flawless."
    },
    {
      "username": "alindsayal",
      "userUrl": "https://www.imdb.com/user/ur147091341",
      "reviewLink": "https://www.imdb.com/review/rw7674316",
      "warningSpoilers": false,
      "date": "23 December 2021",
      "rate": "9",
      "helpful": "12 out of 12 found this helpful.",
      "title": "A Fantastic Sports Documentary",
      "content": "This is the documentary that has been taking over the world the last few months and I have now finished The Last Dance and here is my review for it. The premise of the show focuses on the final season of the dominant Chicago Bulls Basketball team as they went for a sixth championship, it mainly focuses on the superstar Michael Jordan but also gives some of the backstory of his teammates and the history of the team towards there previous championships.As mentioned the show focuses on Michael Jordan and I thought they did a great job of portraying him, he was at the time this show was set the biggest sports star in the world and I thought they got that across really well. You really see how crazy this guys lifestyle was and how it was pretty much impossible for him to be an average guy just playing Basketball. He also has a mentality that for me was fascinating, he is a born winner and you see just how passionate and determined he is, any young sportsperson can really learn from especially the first few episodes how he became the great player that he is.I also thought, even though Jordan was involved in making the show he allowed quite a bit of a mixed review of himself, you see that he is not perfect and has some issues but he doesn't hide away from them and realises that sometimes his demand for perfection hurts his relationships with people.You also see some really interesting parts about his teammates mainly Scotty Pippin and Dennis Rodman, we learn a bit about them and the show does a really good job in putting across that it wasn't just the Jordan team and that these guys and others contributed to the teams major success.The look in history and through the games, is great. If you don't know all the details like me it sends you on journeys throughout the games and does a brilliant job in showcasing the magnitude of them.The only negatives I had about the show is that I always think 10 episodes can be a few too many for a documentary series and that is the case here, with maybe 8 episodes being a better length. Also the show jumps back and forwards a lot and it can be a little jarring at times to work out exactly what point in the timeline we are in.Overall, this is a truly fantastic documentary, that if you are a fan of sports is a must watch and even if you aren't you will probably enjoy this series.Rating - 9/10."
    },
    {
      "username": "Analog_Devotee",
      "userUrl": "https://www.imdb.com/user/ur107152571",
      "reviewLink": "https://www.imdb.com/review/rw6857902",
      "warningSpoilers": false,
      "date": "28 April 2021",
      "rate": "10",
      "helpful": "16 out of 17 found this helpful.",
      "title": "Isn't it fitting that the best athlete to ever grace an arena receives the best documentary to grace the screen?",
      "content": "The greatest sports documentary ever made. I have watched this all the way through at least 8 times now and I never get tired of it."
    },
    {
      "username": "TheOne746",
      "userUrl": "https://www.imdb.com/user/ur85917776",
      "reviewLink": "https://www.imdb.com/review/rw5658315",
      "warningSpoilers": false,
      "date": "20 April 2020",
      "rate": "10",
      "helpful": "82 out of 98 found this helpful.",
      "title": "Two episodes in...",
      "content": "And this has been a great insight. Never before seen footage makes this a must watch documentary of MJ."
    },
    {
      "username": "michelQDimples",
      "userUrl": "https://www.imdb.com/user/ur4415715",
      "reviewLink": "https://www.imdb.com/review/rw8486995",
      "warningSpoilers": false,
      "date": "25 August 2022",
      "rate": "10",
      "helpful": "24 out of 24 found this helpful.",
      "title": "The very human flight of a super human. \"Hold on to the cape!\"",
      "content": "It grips you from the start.Michael Jordan posesses that undeniable charm, that spark, that \"it\", on and off the court, the magnetic pull which gravitates you towards him, whether you are life-long basketball fan, or a young kid who happens to be glancing at the big screen when he comes on: MJ is the only basketball player who embodies the elegance of a ballet dancer when he plays: his unparalell hang time acompanied by his countless creative ways of position his legs(notice how the majority of players just have their legs straight or bent when in air).For someone who is not fortunate to be born early enough to follow his entire career, most of it actually, this documentary is a time machine that takes you back to Michael at the starting line ready to take off, during the flight you share almost first-person, his struggles, his joys and tears along the way, experience the bonds/feuds shared among he and his team/rivalries, laugh at the silly behind-the-scene moments(\"That's waterproof color right there\",lol). Those highlights of MJ and the Bulls you saw tid bits of from before are finally put in their historical context, giving you a much deeper understanding of the Bulls dynasty, and more importantly its ups and downs.Yet the most captivating element of this show is, the very human side of those legendary figures.Having stepped out of the spotlight and retired the halo above their heads(adding an air of nonchalance, superstars looking back on their past glories and mistakes with matured perspective, now with all the loss and gains far behind them), they show you they are human, with all their flaws, anger, frustration, vulnerablility(moments of weakness) and failures. However it's this very same reason that makes they more endearing and admirable. Your affection and respect for them grow.And the drama..Shakespear couldn't have written a more breathtaking script. You will find yourself glued to the screen, emotionally invested, binging one episode after next. After the show is over, you are left with pieces of memorable moments that continue to linger: Phil Jackson staring at MJ with genuine concern during the latter's 93' retirement annoucement, Pippen's constant inner conflict having to choose the spotlight or the team, Rodman's \"bad boy\" transformation, MJ's \"flu\" game, MJ crying on the floor after his father's day championship...The one possible tiny flaw IMO would be the constant skipping back & forth the timeline. While it helps give the future events more texture and nuances by referring to relavent events in the past(at times necessary and extremely cleverly executed), for those who's not familiar with the Bulls history, it lightly dampers the impact of the emotional continuity and dynamics(you are digging your fingers into the arms of your seat, \"How is this gonna end?\", then it cuts to 4 years ago), and could leave you sometimes disoriented. However it's not a real flaw as much as an artistic choice that could be easily overcome with a second/third viewing. And believe me, it's well worth it.\"The last dance\" is more than just a sports documentary about MJ & the Bulls.It's a love letter to the game of basketball, an invitation to be living side by side those iconic characters you'd heard so much about along side Michael: Phil Jackson, Pippen, Rodman... This documentary may be about basketball, but it's so much more. It's a close-up, as well as a landscape view of life at its most intense, most sincere, and most worth living & dying for."
    },
    {
      "username": "JurijFedorov",
      "userUrl": "https://www.imdb.com/user/ur4032055",
      "reviewLink": "https://www.imdb.com/review/rw7722768",
      "warningSpoilers": false,
      "date": "4 January 2022",
      "rate": "8",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Overall great",
      "content": "There are some great things here. Overall it just works and is very entertaining, educational, and presents the best possible history of Chicago Bulls and Michael Jordan you could have asked for. There are a ton of great scenes filmed during that period and a ton of great modern interview to go with it. Especially in 1998 where a camera crew followed the team you got close-up scenes that pretty much put the viewer in their dressing room. It's so personal that this is absolutely impossible to make in 99,9% of cases. You just don't have enough historical recordings lying around you can reuse like this. You need to get creative and animate scenes, have more interviews, then you can show scores, photos, newspapers, sounds, modern shots of the buildings. Here all of that is not needed. They have more than enough videos to make this all work perfectly as a proper historical documentary. Especially because basketball games are filmed close up. If you watch soccer games we only have grainy recordings from 90's games and player faces are not seen unless the TV producer that day decided to show a player face. We don't have all these extra recordings lying around anywhere so soccer documentaries are always a bit impersonal. Here it's fully personal and you walk with Michael Jordan.There are of course some issues with this documentary that I have to point out. Firstly, it jumps from year to year. Basically all episodes have Michael Jordan starting out and then moving forward through the years and then all episodes have the 1998 season too which was the last year this superteam was together until the GM got rid of them all to rebuild the team. He failed spectacularly at rebuilding it. The GM wanted to get rid of big players to put himself in the center, but unfortunately it ruined his own team in the process and Chicago Bulls were never even close to that level ever again. So the episodes are about how this short GM already said prior to the 1998 season that this was the last year for the best basketball coach ever. He just hated people who took the limelight from him and wanted him gone. And all episodes have therefore 2 different years, 1??? And 1998. We have a timeline shown on screen that moves back and forth between the 2 years. In the first 6 episodes it just doesn't work because it's too huge a jump from for example 1984 to 1998. It feels disconnected and unstructured. It doesn't quite work as you don't experience the history as it happened and as someone who didn't follow the sport it's very hard to follow the timeline. But later when the jump is smaller it works close to perfectly. There are of course issues with remembering what year you are in. For example, at the end the Bulls play the same team yet again in the finals. So I started to forget what game they were showing. The players look the same, the stadiums are the same. It's a bit hard to fully follow a doc made this way where you never know what year you are in.But you just can't look past how strong this documentary is overall. It's an amazing presentation of Jordan. I already knew a lot about him, but I had never seen such a close up look at the player and his superteam. It's way better than anything else I have seen on this and one of the best basketball documentaries ever. Hell, on the best sport documentaries I have seen altogether. I did have some issue with political statements and such. They for example interview Obama and he made it all about left-wing politics and race. Instead of talking about Jordan he constantly talked about African Americans and how terrible Jordan was for not supporting Democrats in their elections. Can we get a single Netflix documentary without this stuff please? I know Netflix is very left-wing and always do this, but I'm talking about both sides here. I don't want documentaries to have this type of preaching in them, please. No matter if it's Obama or Trump. Besides this it never really felt irritating. There were some strong storylines about Jordan's gambling and his dad getting murdered. And it was nice to see his teammates getting a ton of screen time too. I didn't know some of them and now I appreciate them a lot. I now feel like Jordan is the best basketball player ever and I'm a big fan. The way he acts and competes is amazing! F#ck politics in sports! Thank you Black Jesus."
    },
    {
      "username": "robotikarm",
      "userUrl": "https://www.imdb.com/user/ur67079047",
      "reviewLink": "https://www.imdb.com/review/rw6088151",
      "warningSpoilers": false,
      "date": "12 September 2020",
      "rate": "9",
      "helpful": "42 out of 45 found this helpful.",
      "title": "Amazing!",
      "content": "As a Pacers fan, I HATED Jordan and the Bulls because they were always the team to beat. Watching this as an adult gave me a different perspective and I have to respect Michael Jordan for his leadership and talent. I wish there were 10 more episodes to watch!"
    },
    {
      "username": "wookietower",
      "userUrl": "https://www.imdb.com/user/ur33849017",
      "reviewLink": "https://www.imdb.com/review/rw7890233",
      "warningSpoilers": false,
      "date": "22 February 2022",
      "rate": "9",
      "helpful": "13 out of 13 found this helpful.",
      "title": "Finally got around to watching after 2 years, it was worth it",
      "content": "I remember when there was massive hype around this doc back in 2020 because it was basically the only sport-related anything going on at the time due to all the COVID suspended sports at the time.Gotta say it was worth waiting to watch this, as it really provided a lot of insight into so much of what made this era of the NBA so fascinating. I was in high school when all this occurred, and it was great to look back and to get new insights into what made MJ tick, how the team was brought together, the impact on the NBA, our culture, sports in general and really society as a whole that this man and this team had.I do agree with some of the comments that it was a bit too focused on MJ's perspective. Every story made it seem like his take was the only correct one and that any shortcomings of anyone involved, be it Pippen, Rodman, Doug Collins, Phil, Krause or Reinsdorf, were all things that made MJ that much greater because of everything he had to overcome.Having said that, you cannot argue with what Jordan accomplished despite all that seemed to stand in his way. He battled through a lot, and still reigned as the greatest of his era, and of all-time if we are being honest.It still doesn't make sense why the team was torn apart, the explanations offered don't make any sense and even if Krause was still alive I doubt he's be able to jusity it. All-in-all a fantastic documentary and one to watch for any sports fan."
    },
    {
      "username": "chris082179",
      "userUrl": "https://www.imdb.com/user/ur24214315",
      "reviewLink": "https://www.imdb.com/review/rw8546624",
      "warningSpoilers": false,
      "date": "16 September 2022",
      "rate": "9",
      "helpful": "24 out of 24 found this helpful.",
      "title": "Amazing",
      "content": "The series is very well put together and is by far the greatest sports documentary I have ever seen of the greatest sports story I have ever seen. Ultimately, this is a must watch for all, with valuable life lessons that the viewers can extrapolate, beyond it being a mostly fast paced but very detailed telling of the greatest spectacle in sports of our time.I recently had my 15 year old daughter watch this (who never watched s sports game in her life) and throughout I found it an opportunity to point out valuable lessons and to reinforce qualities that I might not much have talked about outside of watching together. She found it enjoyable herself, which surely is a feat in itself for any documentary to do for my child.It gets a 9 for just a few parts that seem to dwell on a little longer than maybe necessary, and slow the pace a bit, while omitting other interesting aspects of players of the Chicago bulls at the time, but this is by far the most accurate recreation and most in depth portrayal of what happened during this time for this team and does justice for the team, weighing heavily in favor of Jordan's story, deservingly so... as he elevated not only the entire sport, he elevated the entire sports industry as a whole, to an entirely different level."
    },
    {
      "username": "pn977",
      "userUrl": "https://www.imdb.com/user/ur80744671",
      "reviewLink": "https://www.imdb.com/review/rw6926244",
      "warningSpoilers": false,
      "date": "16 May 2021",
      "rate": "10",
      "helpful": "13 out of 13 found this helpful.",
      "title": "By Far the best sports documentary",
      "content": "It's really hard to be able to impress the audience with a sports documentary. But The Last Dance somehow beautifully manages to make every revolutionary detail pop out. Its definitely a plus point that Michael Jordan ACTUALLY did change the game of basketball forever. There will be that one guy who comes around and elevates the game, and that's exactly what Michael Jordan portrayed through this documentary. Its a must watch, go for it!"
    },
    {
      "username": "ishgrewal83",
      "userUrl": "https://www.imdb.com/user/ur57413493",
      "reviewLink": "https://www.imdb.com/review/rw5660081",
      "warningSpoilers": false,
      "date": "20 April 2020",
      "rate": "10",
      "helpful": "163 out of 183 found this helpful.",
      "title": "Just WoW",
      "content": "Awesome and came at perfect timing. With no sports around due to current situation this show has provided much needed boost for all the sports fans around the world. 10/10"
    },
    {
      "username": "drbarbc-526-517466",
      "userUrl": "https://www.imdb.com/user/ur37693582",
      "reviewLink": "https://www.imdb.com/review/rw5659181",
      "warningSpoilers": false,
      "date": "20 April 2020",
      "rate": "10",
      "helpful": "72 out of 86 found this helpful.",
      "title": "This is perfect!",
      "content": "I'm huge fan of MJ, having watched him since his NC days. I watched every Bulls game during their championship seasons. I also scored floor seats to his last game @ the United Center when he came back w/the Wizards. (In case you're curious how he was received, arriving with the visiting team - to a standing ovation that lasted so long they had to blink the lights.) This miniseries is PERFECT, it's so well done, it's such a precious gift during quarantine. Watch it now!!"
    },
    {
      "username": "vth-06551",
      "userUrl": "https://www.imdb.com/user/ur60110826",
      "reviewLink": "https://www.imdb.com/review/rw5752278",
      "warningSpoilers": true,
      "date": "19 May 2020",
      "rate": "",
      "helpful": "251 out of 264 found this helpful.",
      "title": "When this ended I just said \"damn\"",
      "content": "I have always been a skeptic of Michael Jordan... I was born in 1998, and have grown up watching watching LeBron. I have always known that Michael Jordan is refered to as the G.O.A.T, but after watching Lebron throughout his career, I could never imagine anyone being better than him. I was on the brink of thinking that MJ's greatness was some kind of a \"myth\". After all, MJ is rarely presenting himself and rarely reaching out to the world today. I had only watched highlights of him and heard stories about him being a bully towards his teammates. Therefore I always imagined him as somewhat careless and arrogant.BOY WAS I WRONG!This man had so much love and passion for the game! Never have I seen anyone be this dominant and still striving for more. A true role-model. Furthermore, all of the raw footage from the hallways, bus rides and practice showcases so much of a personality that I never thought he had. He was intelligent and cool as hell and there's a difference between arrogance and self-confidence.Netflix did a great job editing this series, the music is thrilling, the presence of his teammates, family and other celebrities are amazing.I started out thinking of him as a myth... I finished it knowing he was a true Legend."
    }
  ],
  "errorMessage": ""
}