{
  "imDbId": "tt1230180",
  "title": "The Angry Video Game Nerd",
  "fullTitle": "The Angry Video Game Nerd (TV Series 2004– )",
  "type": "TVSeries",
  "year": "2004",
  "items": [
    {
      "username": "vince200002000",
      "userUrl": "https://www.imdb.com/user/ur7731934",
      "reviewLink": "https://www.imdb.com/review/rw1894701",
      "warningSpoilers": false,
      "date": "17 June 2008",
      "rate": "10",
      "helpful": "68 out of 74 found this helpful.",
      "title": "He's Gonna Take You Back To The Past",
      "content": "Ah yes, what can we say about The Angry Video Game Nerd? Aside from having a nerdy shirt and a pocket pouch, James Rolfe is the star of one of the funniest shows a lot of us has ever seen. Everything about the show is hilarious whether it be the words he makes up to describe how much he hates the games he plays, or to see him take out his rage on the game by destroying it after he is done with it etc. Another reason why the show is so great is because of all the neat special effects that James does, and he does one hell of an awesome job. The theme song is catchy and funny too. I applaud him for all the work he puts into his show to entertain his fans. Great job James, your show is excellent."
    },
    {
      "username": "aaronkavo-1",
      "userUrl": "https://www.imdb.com/user/ur12873524",
      "reviewLink": "https://www.imdb.com/review/rw1894276",
      "warningSpoilers": false,
      "date": "17 June 2008",
      "rate": "10",
      "helpful": "56 out of 62 found this helpful.",
      "title": "My Second review.",
      "content": "First of, I already did a review for this in early June, 2008, but it didn't get through. Whatever. So this is my second review. Well, what can I say? The Angry Video Game Nerd is THE best internet show ever made. My personal favorite is the Bible Games episode, that was so funny. At the moment I am waiting for my Angry Nerd DVD I ordered yesterday (June 16th, 2008). I love this show. I mean, James Rolfe is so creative. He can make anyone laugh. Though it's meant for older viewers, for both nostalgia and curse words, kids and teens love it also just for being awesome. It's weird to think that I found out about this show in 2006 by mistake, but, that's the same with every show, right? Anyway check out the show, you won't be disappointed. Anyway, I hope this was helpful."
    },
    {
      "username": "randyfromscream",
      "userUrl": "https://www.imdb.com/user/ur72472558",
      "reviewLink": "https://www.imdb.com/review/rw3749097",
      "warningSpoilers": false,
      "date": "8 July 2017",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "The best Video Game critic ever!",
      "content": "He's the angriest gamer you'll ever heard! I've know this guy since summer of 2016. His video make me laugh a lot. The first AVGN video is Friday The 13th (NES). The channel is Cinemassacre, that's where the AVGN episodes are at. His biggest enemy is LJN (the worst game company). My question is why when Nintendo is around when there's a movie LJN have to make it? This is worth watching and I hope someday he review BatMan Dark Tomorrow (more like BatMan Dank Tomorrow). This is the best video game critic in my opinion."
    },
    {
      "username": "obeyweegee",
      "userUrl": "https://www.imdb.com/user/ur74912501",
      "reviewLink": "https://www.imdb.com/review/rw3852160",
      "warningSpoilers": false,
      "date": "7 November 2017",
      "rate": "10",
      "helpful": "13 out of 13 found this helpful.",
      "title": "My favorite internet person",
      "content": "This guy is amazing! Although I only recently started watching him (last year to be exact), he's one of my favorites. Not only that, but he revolutionized gaming on the internet. While I wouldn't exactly recommend him for kids (like at ALL), for others, it's a treat! I love this guy and hope to see more of his content."
    },
    {
      "username": "osopar",
      "userUrl": "https://www.imdb.com/user/ur17513402",
      "reviewLink": "https://www.imdb.com/review/rw1893477",
      "warningSpoilers": false,
      "date": "16 June 2008",
      "rate": "10",
      "helpful": "87 out of 94 found this helpful.",
      "title": "Something spectacular has emerged from Philadelphia...",
      "content": "If you haven't seen the outrageous antics of, as the memorable theme song denounces, \"the angriest gamer you've ever heard,\" then you've fallen way too far off of the radar. On a quest to permanently rape and pillage all of the \"shitty games\" in his path, the Nerd also happens to be a comic genius, which makes for a fantastic amalgam of crap, and laughing about crap. What at first may come across as a simple usage of cuss words and toilet humor will quickly have you laughing so hard you'd wished you'd never heard of him in the first place... No wait... That's BS... The games are bad, the between-the-lines references are cool, and a plethora of pop-culture characters and always riveting special effects littered throughout each and every episode will have you wishing that you'd owned some of these atrocious Nintendo (and other console) titles so you could laugh even more. The series is so damn perfect and original, that it's been copied and imitated (never topped by far) by countless individuals (it makes me so damn... Irate... That many of these imitators give him no credit...) Unless you're as tightly wound as an anime turd, you will enjoy AVGN. You don't have to be a gamer to connect with your inner child, which is essentially the effect that the show has, which, I might add, it pulls off extremely well. So put that game controller down, sit back, and watch keenly as James Rolfe takes you back to the past, to examine the ultimate travesties of the video game market."
    },
    {
      "username": "Krepspen",
      "userUrl": "https://www.imdb.com/user/ur18894218",
      "reviewLink": "https://www.imdb.com/review/rw1874411",
      "warningSpoilers": false,
      "date": "14 May 2008",
      "rate": "",
      "helpful": "84 out of 91 found this helpful.",
      "title": "One of the funniest shows i've seen!",
      "content": "i may be easily amused, but this is awesome!The acting is great, the humor is perfect! and of course the special-effects in the later episodes are great for an amateur (although i find it a little wrong calling him an amateur). It's also interesting to look at bad old games. and you've got to love the theme song! great work by Kyle Justin.the guest appearances are funny as s**t! most of them are by Mike Matei. i recommend this to everyone with a sense of humor. and i don't think i'm exaggerating when i'm giving it a 10/10. a must see."
    },
    {
      "username": "peachcobly",
      "userUrl": "https://www.imdb.com/user/ur76319857",
      "reviewLink": "https://www.imdb.com/review/rw3806941",
      "warningSpoilers": false,
      "date": "16 September 2017",
      "rate": "10",
      "helpful": "12 out of 12 found this helpful.",
      "title": "Fantastic Show!",
      "content": "When I came across this web-series for the first time, I couldn't stop watching it. Filmmaker James Rolfe is very talented when it comes to writing reviews and comedy sketches. In this show, he combines both of them and makes extremely well written video game reviews. These games are mostly from the 70s, 80s and 90s. This appeals to me and it gives the show a nice, retro vibe. It is clever how all the episodes intertwine with each other. And above all, IT'S SO FUNNY!!! I can't think of an episode where I didn't laugh. He takes the bad elements of the video games and pokes fun at them and rants about them in ways that make you laugh and also think \"That's a good point. This game does suck.\" Never before have I seen a web-series do this. Over all, The Angry Video Game Nerd is one of my top two favorite series's on YouTube. Perfection!"
    },
    {
      "username": "vincent_romeijn",
      "userUrl": "https://www.imdb.com/user/ur4960552",
      "reviewLink": "https://www.imdb.com/review/rw1923869",
      "warningSpoilers": true,
      "date": "4 August 2008",
      "rate": "10",
      "helpful": "19 out of 23 found this helpful.",
      "title": "Great show!",
      "content": "This is one of the funniest shows I've ever seen. The Angry Video Game Nerd (played by James Rolfe), makes funny reviews of very bad old games, especially from the 8-bit NES. While he reviews the games, he curses a lot and drinks beer to soothe the pain, and this makes it even funnier.There have been a lot of imitations, but none of these was as good as the Angry Video Game Nerd himself.Since he begun, he's gained a huge fanbase, and he has even released a DVD set. It's very funny, and you can watch all episodes for free on the internet, so check it out!"
    },
    {
      "username": "hellraiser7",
      "userUrl": "https://www.imdb.com/user/ur24931284",
      "reviewLink": "https://www.imdb.com/review/rw2888882",
      "warningSpoilers": false,
      "date": "18 October 2013",
      "rate": "10",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Video Exterminator",
      "content": "To me the strangest thing about technology is the sub culture it produces. Who'd of thought the underground sub culture amateur films and web series would actually come this far today; which just further proves that you can still create good and great things no matter your limitations. This show was one of the first that to me helped pave that way.It's such a simple idea but that's why it's so great and has grown and is still is going to this day, heck there's even going to be a movie about this hopefully it's great. The show is basically like MST3K (Mystery Science Theater 3000) just as they take a lot of bad B movies and make mockery jokes on them, this show does it to video games.James Rolfe is just great, he's kinda playing himself but at the same time slightly contrary due to some of his exaggerated nature. And that's the point he's not a guy meant to be taken seriously; he's almost like a radio shock jock the things he spews out are just really hilarious from the amount of anger, frustrations, and colorful profanity he spews it's both jaw dropping and also just plain funny. But mainly why the humor works is the mere fact that's it's funny because it's true. Yeah there are some visual humor gags which are funny and help reinforce James comedy but really for me it's the verbal humor and James performance that drives this series.I wouldn't say every game he played is really as bad as he makes it, one or two I actually liked (I said one or two). But most of the games he's review are yeah really really bad and sadly I've been unfortunate to play a few of them myself (but don't own for the record thank god or should I say thank me.). Who hasn't felt that disappointment whenever you've rented a game at the video store and you had high hopes this game would blow your mind, only to simply dash your hopes like yesterday's news.James in a way kind of represents our voice on what we were thinking and feeling at the time we might have played one of the games he selected. Though to me the ones that he picks the most or that I've always like were on licensed video games (games based on movies) which I agree always seemed to be the ones that disappointed the most. I can never entirely understand why the heck it is so hard to make a game based on a movie actually good let alone work at all. Mainly because they were made for all the wrong reasons, just simply not made with care or effort at all. Whatever the real reason we'll never know, all I can say is if James or you've played a bad one then it's best to stick to the real deal the movie itself.Some of my favorite have been now doubt the \"Top Gun\" game which was just hilarious seeing how he's just struggling to land the sucker, yeah I've played that game I couldn't land the sucker either. His segment on Atari Porn games, I still wonder what in the hell they were thinking back then. And my favorite one was the recent \"Toxic Crusaders\" episode because it had Lloyd Kalfman in it, just seeing him in that episode I thought was a dream come true and yes on further note I really like the first and forth \"Toxic Avenger\" movies. I just really love the back and forth between both James and Lloyd most of it was actually unscripted, and I really had a feeling that both were having fun together, which made the episode all the more fun and hilarious for me.Well that's all I can say, if you've played a bad video game then \"The Angry Video Game Nerd\" will be there.Rating: 4 stars"
    },
    {
      "username": "wwe7961",
      "userUrl": "https://www.imdb.com/user/ur23619158",
      "reviewLink": "https://www.imdb.com/review/rw2290851",
      "warningSpoilers": false,
      "date": "5 August 2010",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "One of my favorite online reviewers",
      "content": "The Angry Video Game Nerd is an internet god. I've seen every review he has ever done. He is hilarious, but he is also very informative. I can't pick my favorite video though. One of my favorites I have to say is the Superman 64 review. As for just moments in his videos I have to say that his fight with Bugs Bunny in the Bugs Bunny's Birthday Blowout review killed me. Also in the more recent Game Glitches episode I was almost running out of air when Clubber Lang in the Rocky Game completely glitched. AVGN is one of my inspirations. He is one of the funniest guys you'll ever find on the internet. There is a little nerd in all of us."
    },
    {
      "username": "kdnor2011",
      "userUrl": "https://www.imdb.com/user/ur20621243",
      "reviewLink": "https://www.imdb.com/review/rw2297208",
      "warningSpoilers": false,
      "date": "17 August 2010",
      "rate": "10",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Very Entertaining.",
      "content": "James Rolfe is a very entertaining film maker. His biggest claim to fame is obviously the Angry Video Game Nerd. The Nerd basically reviews bad video games, and rips them apart after getting annoyed. He comments on the graphics, gameplay, sound, and sometimes just the overall objective of the game. All while swearing and making obscene gestures.What I love about him, is that he can just make me laugh at the weird facial expressions he makes. A recent episode has him look in shock as he dies less then a second in the second game of Action 52. Another has him look confused and angry at a Pac man screen as a glictch shows it as... well, let's just say a mean way of saying homosexual.Rolfe also does very entertaining movie reviews, some from the thirtys and some from today. He's great, check him out."
    },
    {
      "username": "doublenpatriot",
      "userUrl": "https://www.imdb.com/user/ur19579510",
      "reviewLink": "https://www.imdb.com/review/rw2040125",
      "warningSpoilers": false,
      "date": "20 March 2009",
      "rate": "10",
      "helpful": "30 out of 37 found this helpful.",
      "title": "He's the Angry Video Game Nerd!",
      "content": "Back then there were games that ticked us all off to no end, then from Philadelphia, came a game reviewer that took us back to the past to play the games that suck ass. And from there, was when our inner anger exploded when the Angry Video Game Nerd vent his wrath upon these horrible games. He has made over many videos and gain millions of fans that fell in love of his anger. To this day, he continues to make reviews on games, which bring laughter to us all. My favorite episode would be the Ghostbusters NES game, I never knew that there was one for the NES, but now I do and I know it sucks. So with that said, James Rolfe, I salute you.P.S. Superman N64 was nothing but a PIECE OF DOG CRAP!"
    },
    {
      "username": "Darkside-Reviewer",
      "userUrl": "https://www.imdb.com/user/ur100147162",
      "reviewLink": "https://www.imdb.com/review/rw4833613",
      "warningSpoilers": false,
      "date": "6 May 2019",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "The Past is bad games",
      "content": "I came across AVGN last year with a random recommend video on YouTube I thought hey this sounds good and I underestimated it hugely I laughed more than I have at most YouTube shows and this was just one episode I then found out I had over a hundred more to watch.The Idea of the show is The angry video game nerd aka The Nerd takes you back to the old days of gaming not with the best like Zelda and Mario but the absolute worst that classic consoles had to offer which you soon learn is a lot.The Nerd picks out all there flaws which are often plentiful rages at the game like you wish you could and sometimes even destroys the game in fun ways with drills fire grenades he's fully prepared for the war on bad games.The Nerd swears so much and rants about games that make him angry with original quality insults you will laugh at again and again the war on bad games has begun and he is the cure.If you enjoy comedy and video games then type AVGN into YouTube and pick a video of his by the end you will be laughing and adding AVGN to your playlist and subscriptions."
    },
    {
      "username": "mmallon4",
      "userUrl": "https://www.imdb.com/user/ur55846361",
      "reviewLink": "https://www.imdb.com/review/rw3170231",
      "warningSpoilers": false,
      "date": "25 January 2015",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "This Game Sucks...",
      "content": "The reviewing of poor media products on the internet has become a whole genre of comedy in itself. Movies, video games, anime, comic books, music, etc, all have dedicated reviewers who will pick them apart and criticize all in the good name of entertainment. One of the most famous perpetrators and originators of this genre within the cyberspace of the internet is none other than The Angry Video Game Nerd. The Nerd (James D. Rolfe), is a fouled mouthed, short tempered retro gamer, destined to review as he would call them, \"sh***y f**king games\".The Nerd's trademark humor is comprised mostly of strong profanity and over the top comparisons to describe how awful a game is, i.e. \"This game is so hard it would actually be easier to outside in a thunderstorm and dodge rain\". It's an acquired taste but trust me when I say there are few times in my life in which I laughed as hard when I first discovered this guy and watched his Ghostbusters review back in 2007.This is partially due to many of the games he reviews being so horrific they almost review themselves but also because of James' charisma as a performer. Let's face it, almost everyone who goes on the internet and makes videos in which they try to entertain or inform (including top subscribed You Tubers, although I won't name names) are ether dull or are trying to force a personality onto themselves. James on the other hand is just a complete natural. He's always an absolute joy to listen to and makes the art of appearing on camera and reviewing media (whether comically or straight) seem easy. However James is first and foremost a film maker and thanks to this The Angry Video Game Nerd had considerably greater production values than most other internet content. Frankly the guy is one of my personal heroes. I still continue to enjoy new episodes of The Angry Video Game Nerd. I'm glad James now only makes several episodes per year, whereas at the height of the series productivity we had two every month. Some of the more recent episodes are among some of the funniest he's ever done, not bad for something which debuted on YouTube 9 years ago. I just hope he will keep the character in this state of semi retirement. With The Angry Video Game Nerd, James Rolfe managed to create something totally original. Countless imitators will come and go but the original will never be topped."
    },
    {
      "username": "rbn_lrk-1",
      "userUrl": "https://www.imdb.com/user/ur5268350",
      "reviewLink": "https://www.imdb.com/review/rw3087390",
      "warningSpoilers": false,
      "date": "16 September 2014",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "So long ago",
      "content": "Edit, AVGN is not so active after the AVGN movie.If you like elder Video Games, or are a die hard fan I recommend you to see this on Youtube right now.Or, if you are into comedy and the 1980s and 1990s.This is the AVGN.A man that raves about Video Games.From Atari sex games, and up to old magazines.The room that the AVGN sits in is a gamers wet dream.Whenever the AVGN flips out over games like Super Mario Bros. 3 it's comedy gold.Funny to see AVGN go both in depth, and also give his rants.Now switch to see this program on Youtube.10/10"
    },
    {
      "username": "cjclouse",
      "userUrl": "https://www.imdb.com/user/ur96376901",
      "reviewLink": "https://www.imdb.com/review/rw4521649",
      "warningSpoilers": false,
      "date": "20 December 2018",
      "rate": "9",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Best reviewer ever known",
      "content": "The nerd is one of the first reviewers that ever launched on YouTube and more well known with his foul mouth."
    },
    {
      "username": "fanoingo",
      "userUrl": "https://www.imdb.com/user/ur10761146",
      "reviewLink": "https://www.imdb.com/review/rw1895889",
      "warningSpoilers": false,
      "date": "20 June 2008",
      "rate": "10",
      "helpful": "34 out of 40 found this helpful.",
      "title": "Gaming and Movie Pop Culture and Humor= Pure Entertainment",
      "content": "For those who surfed the internet, then there's no doubt you've heard of the Angry Video Game Nerd.James Rolfe combines classic Video Game pop culture and an outrageous sense of humor to create one of the funniest internet shows ever created. It's just always fun to see The Nerd destroy and rip apart the games he plays.Of course my favorite parts of the show are when special guests appear and The Nerd always takes them on.Now there's way too many good episodes to choose as a favorite. But I can only say this: Out of all the knockoffs that many have become after The AVGN, none will be as best as the original."
    },
    {
      "username": "Aaron1375",
      "userUrl": "https://www.imdb.com/user/ur1111192",
      "reviewLink": "https://www.imdb.com/review/rw2604952",
      "warningSpoilers": false,
      "date": "30 April 2012",
      "rate": "10",
      "helpful": "6 out of 8 found this helpful.",
      "title": "He is a rather angry fellow isn't he?",
      "content": "I enjoy video games. I owned an Atari 2600, Nintendo, Sega Genesis, Sega CD, Nintendo 64, Gameboy, Playstation, Playstation 2, Gamecube, Xbox, Xbox 360, Nintendo WII, PS3, Nintendo DS, PSP, Nintendo 3Ds...so yeah, it is safe to assume I enjoy video games. I also enjoy watching people riff on bad things such as movies, hence my love for the show MST3K. Well this one features a man known as the Angry Video Game Nerd and he basically slices and dices video games of the past. I find the show hilarious and find myself agreeing with him on a lot of his points. Granted, I do not think that Dr. Jekyll and Mr. Hyde is as bad as he claims, nor do I find Castlevania II bad, but I usually tend to agree with him. Not that you have to agree with him to find the show funny, the guy had me laughing hysterically during his episode where he revisited Dr. Jekyll and Mr. Hyde and talked about how the birds pooped on you. Suffice to say he is extremely vulgar, most certainly not for the kids. Though I find it hysterical that he did not censor himself at all while he babysat the kids in episode where he reviewed the game Halloween for the Atari 2600. I have seen plenty of people try to imitate him, probably saw them before the angry video game nerd, but they just do not get it. He is not simply a guy reviewing games and being humorous, he is a tortured soul trying to warn us and educate us on bad video games. Ironically, we probably end up buying a lot of the games he reviews wanting to experience the nightmare ourselves! However, played Friday the 13th when I was younger and it was a horrible game. Watching his review brought back the memories of how bad as I had forgotten the hellish cavern and forest parts of the game and the completely messed up sense of direction. Many times he has the same feelings I experienced as a kid playing a game for the first time. Like Ghostbusters, I too loved the movie and when I played the game I was completely and utterly disappointed by it. I also had the hardest time with that jump on ninja turtles and was stunned when I learned you simply walked over it. Not only does he review games, but he often times puts on a funny skit type thing like when he was captured by the leatherface clan. Kind of sad that a guy can randomly make a show on the web that is funnier than all the sitcoms on television."
    },
    {
      "username": "Farlo123",
      "userUrl": "https://www.imdb.com/user/ur94801318",
      "reviewLink": "https://www.imdb.com/review/rw4439962",
      "warningSpoilers": false,
      "date": "5 November 2018",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "My favorite YouTube channel",
      "content": "This, Board James and YKWB are why Cinemassacre is my favorite YouTube channel. Not only are they veterans (the first AVGN was made in 2004!) but even videos released now (after 14 years!) are still as entertaining as back then."
    },
    {
      "username": "doritofangd",
      "userUrl": "https://www.imdb.com/user/ur88922240",
      "reviewLink": "https://www.imdb.com/review/rw4389439",
      "warningSpoilers": false,
      "date": "10 October 2018",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "The Best Series From the Internet",
      "content": "While the series has a few flaws , they are very minor. The series is about The AVGN , a nerd who reviews awful games (on some occasions good games) and while not meant to be taken seriously , it's somehow more trustable than today's game journalists (IGN , Polygon , Kotaku , Common Sense Media)."
    },
    {
      "username": "joecoolbrad",
      "userUrl": "https://www.imdb.com/user/ur21113658",
      "reviewLink": "https://www.imdb.com/review/rw2109531",
      "warningSpoilers": false,
      "date": "10 August 2009",
      "rate": "10",
      "helpful": "16 out of 21 found this helpful.",
      "title": "Pure Comedic Gold!",
      "content": "The good: Catchy theme song, great character, great comedy. The bad: I get stomach cramps hearing what the nerd would rather do. Ew.If you have never heard of the nerd, you are a deprived individual. This Internet series is just great. It's hilarious, original, and more entertaining than most big-budget TV comedies. James Rolfe is a great actor/producer/director and Mike Matei gets absolutely immersed in his roles, which include Mike Myers, Jason, The Joker, and Bugs Bunny.Every new episode gets better, every one is hilarious. I would love to hear James doing a big budget film. Talent like his is hard to find.Bottom Line: My favorite show. Ever. Excellent"
    },
    {
      "username": "mysterymovieguy",
      "userUrl": "https://www.imdb.com/user/ur13552778",
      "reviewLink": "https://www.imdb.com/review/rw2033711",
      "warningSpoilers": false,
      "date": "7 March 2009",
      "rate": "10",
      "helpful": "22 out of 27 found this helpful.",
      "title": "The Angry Video Game Nerd",
      "content": "I couldn't think of a good enough title to summarize how creative and hilarious this series is. Sure its on the internet, but James Rolfe has shown the creativity that is still within the minds of some filmmakers out there who should be making the movies, unlike most directors we see today. James had no intention of becoming as big as he did, but with an idea like this, he deserved to. We follow the adventures of the Nerd(played by James) as he re-lives the games from back in the day that have tormented him for over 20 years. With his constant swearing, violent acts occasionally, and great in depth analysis of the games he plays, The Nerd keeps you laughing through an entire episode. Somethings about the show that are better than 90% of TV today are:1)The Writing 2)The THEME SONG 3)and The NerdIf you'V heard of this before on the internet, you should definitely check it out, because it has to be one of the best ideas that has come across us in a while."
    },
    {
      "username": "creativegenius-40304",
      "userUrl": "https://www.imdb.com/user/ur63804972",
      "reviewLink": "https://www.imdb.com/review/rw3375682",
      "warningSpoilers": false,
      "date": "19 December 2015",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "AVGN rocks!",
      "content": "He's gonna take you back to the past to play those crazy games that suck ads. He'd rather have a buffalo take some ultra-bluesy stuff in his ear. He'd rather eat the rotten meat-hole of a redneck horse and down it with tears. He's the angriest gamer you've ever heard. He's the Angry Nintendo Nerd. He's the Angry Atari Sega Nerd. He's the Angry Video Game Nerd. When he turns on his TV, Make sure it's tuned to Channel 3. He's got an awesome shirt and a pocket pouch, although I've never seen him write anything down. He's got a Power Glove and a filthy mouth. Armed with his Zapper, he will tear these games down. He's the angriest gamer you've ever heard. He's the Angry Nintendo Nerd. He's the Angry Atari Sega Nerd. He's the Angry Video Game Nerd. He's close to barf all over his feet while playing stuff that no one can beat. He just can't take it anymore, Although he won't stop 'till he's past Level 4. With his Power Glove and his Zapper Gun, he's trying hard, but then again it's no fun. He's the angriest gamer you've ever heard. He's the Angry Nintendo Nerd. He's the Angry Atari Sega Nerd. He's the Angry Video Game Nerd. He plays the worst games of all time, They're terrible abominations of mankind. They make him so mad, he could spit or say \"Cowabunga?\" Cowafreakin' piece of dog spit! They rip you off and don't care one bit, But the Nerd, he doesn't ever forget. He'd rather fight a insane shark before he takes more animals to the ark. His list is long, with many names, What were they thinking when they made all these games!? He's the Angry Nintendo Nerd. He's the Angry Atari Sega Nerd. He's the Angry Video Game Nerd. He asks stuff that do not make sense. And he knows about the gaming defense. Why can't a turtle swim? Why can't I land a plane? They got a quick buck for this spit-load of duck!? The characters' names are wrong! Why's the password so long!? Why don't the weapons do anything!? He's the angriest gamer you've ever heard, If you like him, you must buy his new shirt, The game sucks so bad, he makes up his own words. He's the angriest, most messed-up gaming nerd. He's the angry console gaming nerd. He's the angry Atari Amiga CD-I Colecovision Intellivision Sega Neo-Geo Turbografx-16 Odyssey 3DO Commodore Nintendo Nerd. He's the Angry Video Game... Nerd.So, that's my longest AVGN review. Also, I give a 10/10. :)"
    },
    {
      "username": "hawkeyeflames",
      "userUrl": "https://www.imdb.com/user/ur21052681",
      "reviewLink": "https://www.imdb.com/review/rw2059037",
      "warningSpoilers": false,
      "date": "28 April 2009",
      "rate": "10",
      "helpful": "26 out of 30 found this helpful.",
      "title": "Best Retro Gaming show on the Net",
      "content": "The Angry Video Game Nerd is an original concept created by James Rolfe. A show that picks out flaws of old retro games that many children of the 70, 80's and early 90's grew up with.I've personally been following this show since he started on Youtube. And continued on to make the jump to Gametrailers when his show got picked up.It impresses me how this show just continues to get better and more entertaining. If you go back and look at some of the earlier episodes, its easy to tell how much better the show has become. The latest videos of 2009 have been some of his most well done yet. Michael Jacksons Moonwalker video was a riot.There have been quite a few people who have tried to emulate his style and brand of humor. But these other imitators seem to die off pretty quick. There's a reason why he's the best out there. And that's because he created this genre. That's why he is (and will always be) the best at it.If you haven't yet seen this show, I HIGHLY recommend getting yourself over to Gametrailers to check it out. In my opinion, funniest, most original show on the web. I just wish they'd come out more often"
    },
    {
      "username": "mitsubishizero",
      "userUrl": "https://www.imdb.com/user/ur85976313",
      "reviewLink": "https://www.imdb.com/review/rw4820999",
      "warningSpoilers": true,
      "date": "1 May 2019",
      "rate": "9",
      "helpful": "5 out of 7 found this helpful.",
      "title": "Hilarious to the nth degree!",
      "content": "James Rolfe as the titular nerd is hilarious. His foul-mouthed rants about bad (and sometimes good games), catchy theme song, his sense of humor and wordplay and his attire make him recognizable and fun to watch. Basically the premise of his show is just the Nerd reviewing bad games and making fun of their obviously noticeable flaws such as Castlevania 2: Simon's Quest and the NES' The Terminator from faulty controls, grammatically incorrect translations to near impossible designs and levels. It's also funny how as a reoccurring gag he bashes an out of business publishing company LJN for many of the games he reviews.Personally my favorite episodes are the ones where he reviews the CDI Zelda and Hotel Mario games much to his frustration upon playing them. He highlights the problems while also explaining the history behind them as well. Some of the good games he's reviewed are Super Mario Bros 3, Ghosts and Goblins, Ninja Gaiden and Metal Gear which also have noticeable aforementioned flaws. The only one that doesn't fall under that category is Ninja Baseball Batman which's an obscure arcade game to the west.If you like in your face exaggerations of everyday things then this's for you but if you like subtle less sweary comedy, you might want to skip it. Take it for what it's worth and see for yourself."
    }
  ],
  "errorMessage": ""
}