{
  "imDbId": "tt1230180",
  "title": "The Angry Video Game Nerd",
  "fullTitle": "The Angry Video Game Nerd (TV Series 2004– )",
  "type": "TVSeries",
  "year": "2004",
  "episodes": [
    {
      "id": "tt1246784",
      "seasonNumber": "2",
      "episodeNumber": "1",
      "title": "Teenage Mutant Ninja Turtles 3: Part 1",
      "image": "https://m.media-amazon.com/images/M/MV5BZjFkM2RmNTktNTZmNi00ZWY3LThjNGEtNTU1OTgwYWE0ZjU4XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "25 Jan. 2007",
      "plot": "The Nerd gives us his opinion on the third Ninja Turtles movie by expressing how it's inferior towards the first two movies and the cartoon series. Before he goes into a deep review on the film, he talks a little about the impact the franchise had in America while going over the first two movies. The only way he was able to show how he feels about the movie is by comparing the action, quotes, and story of the third movie to it's predecessors making a point in how the trilogy decline.",
      "imDbRating": "8.1",
      "imDbRatingCount": "265"
    },
    {
      "id": "tt1246783",
      "seasonNumber": "2",
      "episodeNumber": "2",
      "title": "Teenage Mutant Ninja Turtles 3: Part 2",
      "image": "https://m.media-amazon.com/images/M/MV5BODY1ZmU5NWQtNWYzNi00YjUyLTg5MmYtY2NhMzQ1NzE4NzUxXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "25 Jan. 2007",
      "plot": "After finishing his review on the third movie the only way the Nerd will feel satisfied with himself is by destroying his Ninja Turtles 3 VHS tape. By doing so is by using a katana to slice it in half and then smash it with a hammer until it is nothing more than a pile of shredded scraps of plastic and paper. After doing this the Nerd felt like that Justice has been served for all Ninja Turtle fans out there.",
      "imDbRating": "8.1",
      "imDbRatingCount": "239"
    },
    {
      "id": "tt1246760",
      "seasonNumber": "2",
      "episodeNumber": "3",
      "title": "Atari 5200",
      "image": "https://m.media-amazon.com/images/M/MV5BMDBmNDUxMDMtMmZjMy00Y2EwLThhOGQtNjE0ODM2MGYzYWZkXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "13 Feb. 2007",
      "plot": "The Nerd shows clips of various games to the Atari 2600 and expresses how it defines the term classic video games. He mentions that there were successors to the console that came and disappear within a couple years. Like the 5200 that was meant to replace the 2600, but it failed and eventually faded from the market. The main reason was because of the size of the console and AC adapter. While hooking it up to the TV with it's limited cable range makes it a real chore. After the Nerd goes through the painful process of trying to hook it up while almost breaking his back...",
      "imDbRating": "8.1",
      "imDbRatingCount": "281"
    },
    {
      "id": "tt1246771",
      "seasonNumber": "2",
      "episodeNumber": "4",
      "title": "Ghostbusters",
      "image": "https://m.media-amazon.com/images/M/MV5BNTM5ZmFhMzctZDhkYS00NmM5LWFmMTUtZDFkOTg0YzkzYjQzXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "27 Feb. 2007",
      "plot": "Since the Nerd is a huge fan of Ghostbusters, having collected all kinds of toys and memorabilia, including the Nintendo game. He completely eviscerates this horribly misconceived video game that has horrible graphics, unspeakable game play, a near-impossible stairwell level and very little to do with the movie it's based upon.",
      "imDbRating": "8.5",
      "imDbRatingCount": "311"
    },
    {
      "id": "tt1246773",
      "seasonNumber": "2",
      "episodeNumber": "5",
      "title": "Ghostbusters: Follow-Up",
      "image": "https://m.media-amazon.com/images/M/MV5BNGVjMjgwYWItY2ZlMS00NTc3LWFmZTAtYTA3NDNmMmViNjgzXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "20 Mar. 2007",
      "plot": "The Nerd continues his rant about the horrible Ghostbusters Nintendo game and goes over ways for it to have been improved upon. Next, he looks at the Atari version, as well as one for the Sega Master system which, except for some more creative concepts, are virtually no better than the NES version.",
      "imDbRating": "8.1",
      "imDbRatingCount": "281"
    },
    {
      "id": "tt1246772",
      "seasonNumber": "2",
      "episodeNumber": "6",
      "title": "Ghostbusters: Conclusion",
      "image": "https://m.media-amazon.com/images/M/MV5BY2VjYjhmMTgtNzIyNy00MDc5LWEwMjQtZmE3Mjc1OTg4NGFhXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "3 Apr. 2007",
      "plot": "To wrap up his spiel on Ghostbusters video games, the Nerd reviews the Ghostbusters II NES game, which he finds to be much better than the original. To end on a positive note, he reviews the Sega Genesis Ghostbusters game, which he finds to be the best of all.",
      "imDbRating": "7.9",
      "imDbRatingCount": "258"
    },
    {
      "id": "tt1246781",
      "seasonNumber": "2",
      "episodeNumber": "7",
      "title": "Spider-Man",
      "image": "https://m.media-amazon.com/images/M/MV5BYjc5ZTAzZWUtMjc5YS00NjZhLWFiOTMtMDg5NzFkN2VlNzQ5XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "17 Apr. 2007",
      "plot": "The Nerd plays Spider-Man for the Atari 2600. He finds it to be a frustrating, Godawful mess, but thankfully Spidey himself shows up to give the Nerd a hand. When he fails at beating his own game, they move on to an NES version... which is also a piece of crap. The Game Boy game is the worst of all, as Spidey fails to beat it while dangling from the Nerd's ceiling. To top it all off, the Nerd plays the Spider-Man 2 game for Game Boy Advance, which is decent enough, except it depicts Spidey as a pizza delivery boy.",
      "imDbRating": "7.8",
      "imDbRatingCount": "285"
    },
    {
      "id": "tt1246779",
      "seasonNumber": "2",
      "episodeNumber": "8",
      "title": "Sega CD",
      "image": "https://m.media-amazon.com/images/M/MV5BNjZkMWM4ZDEtNDM1My00NDY3LWFmNDEtODFmNWVhMDkwZmI3XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "2 May 2007",
      "plot": "The Nerd investigates the Sega Genesis accessory that gave us better graphics...and worse games.",
      "imDbRating": "8.3",
      "imDbRatingCount": "280"
    },
    {
      "id": "tt1246778",
      "seasonNumber": "2",
      "episodeNumber": "9",
      "title": "Sega 32X",
      "image": "https://m.media-amazon.com/images/M/MV5BY2E2MTAwZTgtMTE1YS00NWUyLTk0NzMtMjk0MTQ0ZjdhMTQwXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "15 May 2007",
      "plot": "The Nerd reviews the second Genesis accessory with games that aren't worth the console's price...$2.50.",
      "imDbRating": "8.3",
      "imDbRatingCount": "266"
    },
    {
      "id": "tt1246780",
      "seasonNumber": "2",
      "episodeNumber": "10",
      "title": "Silver Surfer",
      "image": "https://m.media-amazon.com/images/M/MV5BOWNhZWQxNGMtOWU1NC00M2YwLTlhNzEtYTRjZmE5NDMzNzQ2XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "5 Jun. 2007",
      "plot": "The AVGN tackles one of the hardest games in the NES library: Silver Surfer. What makes it so hard is that SS dies with a single hit, and the levels are packed to the brims with obstacles, projectiles and inconsistent scenery. If you touch anything, game over.",
      "imDbRating": "8.2",
      "imDbRatingCount": "272"
    },
    {
      "id": "tt1246765",
      "seasonNumber": "2",
      "episodeNumber": "11",
      "title": "Die Hard",
      "image": "https://m.media-amazon.com/images/M/MV5BMzA1NTE5ZmEtOGU0OC00OTRiLWJlMjYtNzY0MWM5NzIzYzU2XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "19 Jun. 2007",
      "plot": "The Nerd fins the front cover of the Die Hard game to be a little controversial due to it depicting a skyscraper being blown up which he advices that we all know what it reminds us of. Though he puts that issue aside and starts playing the game on his NES. While the terrorists in the game are able to take 3/4's of John McClain's health away, the Nerd's biggest complaint for the game is the dark areas that only light up when you enter the area which makes it inconvenient when there's a terrorist lurking in that area and you don't know it unless you go into that area. ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "253"
    },
    {
      "id": "tt1246775",
      "seasonNumber": "2",
      "episodeNumber": "12",
      "title": "Independence Day",
      "image": "https://m.media-amazon.com/images/M/MV5BZGUxZDdkMmYtNGI3Yy00YmE0LThjODgtNDMzYzI2YzZhZjNjXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "4 Jul. 2007",
      "plot": "The Nerd reviews Independence Day for Playstation 1 and it's basically an average flight simulator like any other video game that involves flight simulator. The main complaint the Nerd has for the game is that objects don't appear until you're a few feet in front of them. While getting items on the ground is suicide cause it's hard to not touch the ground without taking some damage. The Nerd concludes the game with wishing everyone a great Fourth of July but advices everyone to stay away from the Independence Day game.",
      "imDbRating": "7.0",
      "imDbRatingCount": "243"
    },
    {
      "id": "tt1246787",
      "seasonNumber": "2",
      "episodeNumber": "13",
      "title": "The Simpsons",
      "image": "https://m.media-amazon.com/images/M/MV5BZDEzN2JjZTItYzNmMi00MGEwLWIzMTEtZWE4MWZkMGUyOGNkXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "17 Jul. 2007",
      "plot": "The Nerd reviews Bart vs. The Space Mutants and Bart vs. The World, two licensed Simpsons games for the NES. He cites bad controls and ludicrous concepts as the games' low points.",
      "imDbRating": "7.7",
      "imDbRatingCount": "257"
    },
    {
      "id": "tt1246763",
      "seasonNumber": "2",
      "episodeNumber": "14",
      "title": "Bugs Bunny Birthday Blowout",
      "image": "https://m.media-amazon.com/images/M/MV5BMTg3ZGIxMDEtNmZhMC00M2NjLWI1NGMtOGEyMDBhY2I1ODI0XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "7 Aug. 2007",
      "plot": "The review starts off in the same fashion as a Looney Tunes short film. The Nerd reviews Bugs Bunny's Birthday Blowout which is nothing more than a poor man's Super Mario Bros. style slide scroller game. While the game is generous of providing extra lives, it however suffers from being unorganized by having breakable blocks placed over bottom-less pits and enemies that can hurt you even if you hurt them. Upon reviewing the game the Nerd is visited by Bugs Bunny himself, which the Nerd gives out his hatred by beaten the daylights out of the poor rabbit while trying to ...",
      "imDbRating": "8.4",
      "imDbRatingCount": "310"
    },
    {
      "id": "tt1246761",
      "seasonNumber": "2",
      "episodeNumber": "15",
      "title": "Atari Porn",
      "image": "https://m.media-amazon.com/images/M/MV5BYTQzMzhlNmQtYmE5Yi00ODI2LWJjOTgtZTI5ZDM4YjhiMzRlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "22 Aug. 2007",
      "plot": "The Nerd does a brief history lecture on General George Armstrong Custard, only cause he's about to review one of the adult theme games for the Atari 2600. The game in general is \"Custard's Revenge\" which like the other Atari adult games was unlicensed and the Atari company had nothing to do with them. And just for fun, the Nerd reviews other Atari adult games only to find that each one either made no sense in how the game play is mastered or how the ideas for the games looked like they were thought up by sick minded game developers.",
      "imDbRating": "8.4",
      "imDbRatingCount": "273"
    },
    {
      "id": "tt1246776",
      "seasonNumber": "2",
      "episodeNumber": "16",
      "title": "Nintendo Power Memories",
      "image": "https://m.media-amazon.com/images/M/MV5BNjIyMTBjNDctMjIzZS00MmZlLThjNDktMmYxOTFiNTI4MjI2XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "4 Sep. 2007",
      "plot": "The Nerd does a tribute to the magazine Nintendo Power by showing selected ads that were made exclusive to the magazine, the posters, the walk-through content, and the fan letters that are answered by the staff. The Nerd praises it for being the earliest way to know how to beat the toughest Nintendo games. Before the Internet became more common to use the only way to know how to beat a game is by magazine subscription. Besides the magazine being very nostalgic, the Nerd also points out some things that he finds absurd like how the posters are hard to take out, the ...",
      "imDbRating": "8.4",
      "imDbRatingCount": "276"
    },
    {
      "id": "tt1246770",
      "seasonNumber": "2",
      "episodeNumber": "17",
      "title": "Fester's Quest",
      "image": "https://m.media-amazon.com/images/M/MV5BMTYyNzg3MTgtZDI4ZS00NDQwLWJiNmItYzc3NGE1MGJhODI5XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "18 Sep. 2007",
      "plot": "Dressed as every member of the Addams Family, the Nerd reviews Fester's Quest, an overly long and overly difficult game that he deems is not worth the effort. He destroys it with Gomez's train and moves on to the movie licensed game on Sega, another creepy and kooky game.",
      "imDbRating": "7.5",
      "imDbRatingCount": "242"
    },
    {
      "id": "tt1246788",
      "seasonNumber": "2",
      "episodeNumber": "18",
      "title": "The Texas Chainsaw Massacre",
      "image": "https://m.media-amazon.com/images/M/MV5BZjBkZDk3YjAtZjViMi00NDQ0LTliMzYtZjEzYTkzY2Y0Mzc1XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "10 Oct. 2007",
      "plot": "The Nerd goes to a small yard sale run by a hillbilly. All of the games on sale were all bad ones. The one that caught the Nerd's attention was the Texas Chainsaw Massacre for the Atari 2600. After negotiating with the red neck, the Nerd got the game along with another rare 2600 game for free. The Nerd returns home with his newly bought 2600 games and starts to play the Leatherface game first. Which he immediately sees why it's such a rare game, is because the object of the game is to cut people down with a chainsaw. While the graphics aren't too detail it's not as ...",
      "imDbRating": "7.9",
      "imDbRatingCount": "272"
    },
    {
      "id": "tt1246774",
      "seasonNumber": "2",
      "episodeNumber": "19",
      "title": "Halloween",
      "image": "https://m.media-amazon.com/images/M/MV5BNzE1NmM5MmMtZjI2YS00NWVmLWE2M2QtMjI2Yjg1NGIyYTFjXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "31 Oct. 2007",
      "plot": "Sometime after the Nerd escape from Leatherface, the crazed fan, and the red neck. He's now safe at home, but isn't in a good mood cause he has to baby sit two kids he doesn't like. In the mean time, he decides to review an Atari 2600 game which happens to be a game adaption of John Carpenter's Halloween. The game the Nerd got as a bonus when he purchased the Leatherface game from the crazed red neck that knocked him out with a banjo. The game is a complete opposite to the Leatherface game, cause you don't control Myers in the game but instead you control Laurie ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "280"
    },
    {
      "id": "tt1246769",
      "seasonNumber": "2",
      "episodeNumber": "20",
      "title": "Dragon's Lair",
      "image": "https://m.media-amazon.com/images/M/MV5BZjlkNDAyMWQtYzQ3Yi00NmQ3LTgwMWYtMGM1NWYyZTczNTU5XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "20 Nov. 2007",
      "plot": "Due to popular demand, the Nerd reviews Dragon's Lair. Not the arcade classic, but the poorly programmed and extremely difficult NES version. He can barely make it past the first screen due to his character dying with one hit and a dragon that's nearly impossible to kill.",
      "imDbRating": "8.0",
      "imDbRatingCount": "249"
    },
    {
      "id": "tt1246758",
      "seasonNumber": "2",
      "episodeNumber": "21",
      "title": "An Angry Nerd Christmas Carol: Part 1",
      "image": "https://m.media-amazon.com/images/M/MV5BZGFjZjQyNzctMjY0Zi00NTcxLWFlYjgtODJkNzk3NGEwYzMzXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "18 Dec. 2007",
      "plot": "The Nerd receives a crappy present which is a NES game of Home Alone 2. So he decides to review the game only to find the choice of enemies and the layouts of the levels to be very terrible. His main complaint about the game is that some platforms you can't get on and there are some enemies you can't stun. After he can't take the game anymore he rants on about how he hates poorly made games and how he hates the holiday of Christmas in the same mannerism as Scrooge from the Christmas Carol. After shaking his game shelf a Sega Genesis game comes off the top shelf and ...",
      "imDbRating": "7.3",
      "imDbRatingCount": "237"
    },
    {
      "id": "tt1246759",
      "seasonNumber": "2",
      "episodeNumber": "22",
      "title": "An Angry Nerd Christmas Carol: Part 2",
      "image": "https://m.media-amazon.com/images/M/MV5BNTljOTNmNDMtNzM1YS00YTJiLTg3ZmMtNjM5NjBhOTk4MGY1XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "24 Dec. 2007",
      "plot": "The Nerd is visited by the Ghost of Christmas Past who shows him his childhood of when he played the NES as a kid and when he first got his Super Nintendo. After reliving his youth, he's now being greeted by the Ghost of Christmas Present who shows what him what he's about to review later on which turns out to be Shaq Fu for the Super Nintendo. As the Nerd watches himself play the bad game he sees how frustrated he himself gets from playing a poorly marketed game that basically just has Shaq placed in a poorly executed fighting game. The game was so bad that a website...",
      "imDbRating": "7.5",
      "imDbRatingCount": "234"
    },
    {
      "id": "tt1246764",
      "seasonNumber": "2",
      "episodeNumber": "23",
      "title": "Chronologically Confused About the Legend of Zelda Timeline",
      "image": "https://m.media-amazon.com/images/M/MV5BYTRiZmYwOGQtOGI1Yy00Y2M0LTkxNDMtNTQ3ZTk1MGNmZGI1XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "8 Jan. 2008",
      "plot": "The Nerd does a review on the time-line of Legend of Zelda in the same fashion as his previous review on confusing titles to sequels of movies and games. For this one he talks about the Zelda games made up to the year 2008. And tries to piece together how each of them fit as one whole time-line. Only to discover that most of them are less connected than the other. Which in the end he concludes that the franchise doesn't need to have a well explained time-line when each game is worth playing without knowing what occurred in any of the other games.",
      "imDbRating": "7.6",
      "imDbRatingCount": "224"
    },
    {
      "id": "tt1246777",
      "seasonNumber": "2",
      "episodeNumber": "24",
      "title": "Rambo",
      "image": "https://m.media-amazon.com/images/M/MV5BNDg0NDA0YzctZmFmNC00YjUxLTk5MTAtODllN2JhZmY1YmM3XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "22 Jan. 2008",
      "plot": "With the upcoming release of the fourth Rambo movie, the Nerd reviews Rambo for the NES. The game suffers from four problems which are: confusing navigation on the landscapes, pointless chat options, unnecessary use of animals as enemies, and the idea of the screen blinking red when low on health. The Nerd also reviews some other Rambo games but couldn't find a single one that actually is fun to play. He feels the games should of taken advice from Contra on how to make a commando theme game more fun.",
      "imDbRating": "7.8",
      "imDbRatingCount": "241"
    }
  ],
  "errorMessage": ""
}