{
  "imDbId": "tt1230180",
  "title": "The Angry Video Game Nerd",
  "fullTitle": "The Angry Video Game Nerd (TV Series 2004– )",
  "type": "TVSeries",
  "year": "2004",
  "episodes": [
    {
      "id": "tt1246790",
      "seasonNumber": "3",
      "episodeNumber": "1",
      "title": "Virtual Boy",
      "image": "https://m.media-amazon.com/images/M/MV5BOGMwZjFhZjgtZTFjMS00MjMxLTkxOWQtZWJkZDBiNmI0MDEyXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "19 Feb. 2008",
      "plot": "The Nerd investigates the infamous handheld that gave us headaches...in 3D!",
      "imDbRating": "8.3",
      "imDbRatingCount": "280"
    },
    {
      "id": "tt1246789",
      "seasonNumber": "3",
      "episodeNumber": "2",
      "title": "The Wizard of Oz",
      "image": "https://m.media-amazon.com/images/M/MV5BZWQxYzQ4NmUtZWI2Zi00ZWEzLTgxY2MtY2IxOGI1OWY1YmJhXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "4 Mar. 2008",
      "plot": "The Nerd plays the Super Nintendo adaption of the 1939 Wizard of Oz movie. Something that can't be made into a good game. Mainly due to the addition of weird enemies and locations that don't look like something you'd find in either the movie or the original books. The Nerd's main complaint is the large number of glitches the game has where various platforms make the characters in the game fall through. While playing the game, the Nerd is visited by the Cowardly Lion who won't shut up through out the review.",
      "imDbRating": "8.0",
      "imDbRatingCount": "250"
    },
    {
      "id": "tt1246767",
      "seasonNumber": "3",
      "episodeNumber": "3",
      "title": "Double Vision: Part 1",
      "image": "https://m.media-amazon.com/images/M/MV5BZThjY2NjMTQtYTVhNS00YmRiLWE0NjktNDlhZjBmNzJiZTc4XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "25 Mar. 2008",
      "plot": "The Nerd does a review on the two competing consoles to the Atari 2600 Intellivision and Colecovision. He starts his review on Intellivision first and also does a review on most of its games. His main complaint is the controller for the Intellivision makes playing the games harder. Despite how most of Intellivision's games are knock offs of already popular Atari games. He's also amused by the fuzzy sound quality of the voice synthesizer that is only compatible to certain Intellivision games.",
      "imDbRating": "7.9",
      "imDbRatingCount": "237"
    },
    {
      "id": "tt1246768",
      "seasonNumber": "3",
      "episodeNumber": "4",
      "title": "Double Vision: Part 2",
      "image": "https://m.media-amazon.com/images/M/MV5BZjczYjczYjItNzU3Yy00OWExLTk2N2EtNDU0ZWQyMDk2ODg5XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "8 Apr. 2008",
      "plot": "The Nerd does a follow up to the previous review by showing us the features of the Colecovision. The controllers aren't any different from the Intellivision, while most of the games are as bad they look. His main complaint is one of the add-ons to the console is a device that allows you to play Atari 2600 games on the Colecovision. The Nerd found it hard to believe the competitor of Atari was allowed to sell such a device. Cause in today's gaming market it wouldn't be allowed when it can create multiple lawsuits.",
      "imDbRating": "7.9",
      "imDbRatingCount": "227"
    },
    {
      "id": "tt1248153",
      "seasonNumber": "3",
      "episodeNumber": "5",
      "title": "The Wizard and Super Mario Bros 3",
      "image": "https://m.media-amazon.com/images/M/MV5BOTA1YmFkZjYtZjA4Ni00MmMyLTg4YjUtNGVjN2ExNjY1Nzg2XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "22 Apr. 2008",
      "plot": "The Nerd decides to review a good game for once which is Super Mario Bros. 3. Before he reviews it, he talks about the movie The Wizard which is how American gamers first learn about the game as it was a product placement along with the NES Power Glove. While the Nerd doesn't find the story for The Wizard to be great, he did admit that it holds a place in the gaming community. After putting his review on the Wizard aside he starts to play Super Mario Bros. 3, while it has a lot of hard parts it is really fun to play, however the Nerd couldn't help but notice the game ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "266"
    },
    {
      "id": "tt1247828",
      "seasonNumber": "3",
      "episodeNumber": "6",
      "title": "N.E.S. Accessories!",
      "image": "https://m.media-amazon.com/images/M/MV5BMmRjMTcxNTctZGNkZi00MzcwLWIzNTItYjgxNDFiNWVlNmUyXkEyXkFqcGdeQXVyOTM4NTAzMjM@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "14 May 2008",
      "plot": "The Nerd reviews all the crap Nintendo tried to market along with the NES. Zapper guns, LaserScopes, Roll'n Rocker, and other accessories one needs to look \"cool\" while playing video games.",
      "imDbRating": "8.8",
      "imDbRatingCount": "320"
    },
    {
      "id": "tt1247827",
      "seasonNumber": "3",
      "episodeNumber": "7",
      "title": "The Indiana Jones Trilogy",
      "image": "https://m.media-amazon.com/images/M/MV5BYmRiZWViMTQtNWNhNy00MjMzLWI1Y2MtZmQxYTE3MGUyMWY1XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "21 May 2008",
      "plot": "In honor of the release of Indiana Jones and the Kingdom of the Crystal Skull, the AVGN reviews the games based on the original trilogy. Raiders of the Lost Ark on Atari, Temple of Doom and Last Crusade on NES, and naturally, they all suck. He does praise the Lucas Arts SNES release, which contains three much more faithful adaptations of the movies.",
      "imDbRating": "8.2",
      "imDbRatingCount": "250"
    },
    {
      "id": "tt1247829",
      "seasonNumber": "3",
      "episodeNumber": "8",
      "title": "Star Trek",
      "image": "https://m.media-amazon.com/images/M/MV5BYjk3NTIwN2EtNmQwMC00MzgxLTg4YWMtMzY0ZjczYmNhN2I2XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "11 Jun. 2008",
      "plot": "In a Star Trek theme review, the Nerd dons a yellow Starfleet uniform and decides to review a couple Star Trek related games, cause reviewing all of them would be too much for him to handle. The most absurd one he can find is the 25th Anniversary game for the NES which consists of pointless dialog and confusing quests, the Nerd thought about destroying it with a phaser but had a change of heart believing that the game developers tried their hardiest when making the game.",
      "imDbRating": "7.3",
      "imDbRatingCount": "224"
    },
    {
      "id": "tt1252718",
      "seasonNumber": "3",
      "episodeNumber": "9",
      "title": "Superman",
      "image": "https://m.media-amazon.com/images/M/MV5BNGVhMTBmODgtMzA1NS00MmNlLTgxYzgtMTk3M2RmNDNlYTAyXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "26 Jun. 2008",
      "plot": "The Nerd reviews two of the earlier Superman theme games. The first one for the Atari 2600 is not just bad in graphics but is confusing to navigate. While the Superman game for the NES is another story where all of the characters are drawn in a chibi style and the use of attacks don't do justice towards the enemies. The Nerd's biggest complete about the game is that one of the missions involve trying to see why the stocks are so low in the stock market. The Nerd isn't sure why a game intended for kids would be interested in the stock market. Overall the Nerd finds the...",
      "imDbRating": "7.8",
      "imDbRatingCount": "245"
    },
    {
      "id": "tt1254378",
      "seasonNumber": "3",
      "episodeNumber": "10",
      "title": "Superman 64",
      "image": "https://m.media-amazon.com/images/M/MV5BNzcyZjkzZmMtMDYwMC00ODdmLTgzYWMtNWNkMjU3ODMzNzRhXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "8 Jul. 2008",
      "plot": "The Nerd complies to his fan requests to review Superman 64 which he decided to pull everyone's leg by reviewing the Superman game for Commodore 64. His main complaint is the load time takes forever and he finds the Commodore controller to be so stiff that he resulted in using an alternate controller. After that he does review Superman 64 for the Nintendo 64 as the fans wished him to do so in the first place. Once he dived into the first level he already finds it to be terrible when all you do is fly through rings under a short time limit. When it comes to video game ...",
      "imDbRating": "8.6",
      "imDbRatingCount": "346"
    },
    {
      "id": "tt1266164",
      "seasonNumber": "3",
      "episodeNumber": "11",
      "title": "Batman: Part 1",
      "image": "https://m.media-amazon.com/images/M/MV5BZGMzYWFkYTktNzQwNC00ZTBmLThhMGUtNjkwMjMwZjUwYTBkXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "22 Jul. 2008",
      "plot": "AVGN gets dressed up like Batman to review a series of games based on the Caped Crusader. First up, a Commodore 64 game, which sucks and is given \"the Bat punishment.\" While he praises the NES adaptation of the 1989 movie and the SNES adaptation of Batman Returns, not to mention the SNES game of the Animated Series, he deems the Atari Linx and Sega CD games to be crap, but the worst of all is Batman Forever on SNES. As if all that weren't bad enough, one of Batman's arch-nemeses pays the Bat-Nerd a visit.",
      "imDbRating": "8.5",
      "imDbRatingCount": "269"
    },
    {
      "id": "tt1276193",
      "seasonNumber": "3",
      "episodeNumber": "12",
      "title": "Batman: Part 2",
      "image": "https://m.media-amazon.com/images/M/MV5BZmM2MjkxZmMtZGQ4YS00MDZhLWE0NjktMGNiMDY2ODA5ZTQ0XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "11 Aug. 2008",
      "plot": "The Joker holds AVGN hostage and forces him to play the NES, Game Boy and Sega versions of Return of the Joker. They all suck. It enrages the Bat-Nerd so much, he breaks free and fights off the Joker, and then, as a final Bat punishment, he shoves every single bad Batman game up the Clown Prince of Crime's ass.",
      "imDbRating": "8.3",
      "imDbRatingCount": "257"
    },
    {
      "id": "tt1283326",
      "seasonNumber": "3",
      "episodeNumber": "13",
      "title": "Deadly Towers",
      "image": "https://m.media-amazon.com/images/M/MV5BMTdkYWRlNzYtY2FiMy00MTExLThlNWMtNTcyN2I3ZGI5ZDJiXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "19 Aug. 2008",
      "plot": "As a special incentive, the AVGN has his fans write his dialogue as he sets out to rant and rave about an NES game he wishes never existed.",
      "imDbRating": "6.8",
      "imDbRatingCount": "218"
    },
    {
      "id": "tt1287520",
      "seasonNumber": "3",
      "episodeNumber": "14",
      "title": "Battletoads",
      "image": "https://m.media-amazon.com/images/M/MV5BYTU1Zjg2ZDEtZjE1OS00ZGEwLTgyMDYtZjEyNTFjZWVkZTk3XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "3 Sep. 2008",
      "plot": "The Nerd and his guitar guy from behind the couch, Kyle Justin, join forces to play Battletoads on Nintendo proving that, with just one player the game is a mild challenge, but with two players, it's damn near impossible!",
      "imDbRating": "8.0",
      "imDbRatingCount": "238"
    },
    {
      "id": "tt1293873",
      "seasonNumber": "3",
      "episodeNumber": "15",
      "title": "Dick Tracy",
      "image": "https://m.media-amazon.com/images/M/MV5BMTE2MGQ4NTItNmMzMC00MGRkLTgzOGYtZWEzOWQ5OTMwOGZhXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "16 Sep. 2008",
      "plot": "Game on the chopping block this week: Dick Tracy on Nintendo. The world's most popular yellow-coated detective in the world's most frustrating, nonlinear game. Watch as the Nerd struggles to find out-of-reach clues, tries to dodge impossible projectiles, and worst of all, realizes you only get 1 life and no continues.",
      "imDbRating": "8.1",
      "imDbRatingCount": "233"
    },
    {
      "id": "tt1308195",
      "seasonNumber": "3",
      "episodeNumber": "16",
      "title": "Dracula",
      "image": "https://m.media-amazon.com/images/M/MV5BZjEyNTdiY2YtY2IwYy00M2IyLTk3NDQtNjhkODg1ZGM3YjgzXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "14 Oct. 2008",
      "plot": "In this special Halloween episode, the Nerd reviews games that star one of the most popular icons in horror film: Count Dracula.",
      "imDbRating": "8.0",
      "imDbRatingCount": "221"
    },
    {
      "id": "tt1315601",
      "seasonNumber": "3",
      "episodeNumber": "17",
      "title": "Frankenstein",
      "image": "https://m.media-amazon.com/images/M/MV5BNzg2MmNkM2MtOWMzMi00MGY5LWJmNDItZTc4MGZjNjVkNmQzXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "28 Oct. 2008",
      "plot": "The Nerd and his diabolical creation, Franken-Nerd, play games dedicated to that other popular horror movie icon: Frankenstein.",
      "imDbRating": "7.6",
      "imDbRatingCount": "215"
    },
    {
      "id": "tt1322465",
      "seasonNumber": "3",
      "episodeNumber": "18",
      "title": "CD-i: Part 1 - Hotel Mario",
      "image": "https://m.media-amazon.com/images/M/MV5BOGU0MmMzYzQtZGQ3Yy00YmE2LWFhMjgtMTE5MDQ3Y2M5NDVjXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "12 Nov. 2008",
      "plot": "After spending $700 on a CD-i and games, the Nerd reviews Hotel Mario.",
      "imDbRating": "7.5",
      "imDbRatingCount": "221"
    },
    {
      "id": "tt1329564",
      "seasonNumber": "3",
      "episodeNumber": "19",
      "title": "CD-i Part 2: Zelda Wand of Gamelon",
      "image": "https://m.media-amazon.com/images/M/MV5BNjc0ZTJmOWUtMDA2NS00MDI3LWE5MzYtMTEyODBkYmFmYzk1XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "25 Nov. 2008",
      "plot": "The Nerd now reviews one of the three Zelda games for the CD-i. Out of the three he decides to play Zelda: Wand of Gamelon first cause the Nerd thought it be cool to control Zelda in a Zelda game for once since her name is on every single Zelda game. The Nerd soon finds out that the game is nothing like the Nintendo licensed Zelda games. Instead the game has bad animation, poor voice acting, complicated controls, confusing layouts of the levels, and frustrating use of items. The main criticism the Nerd had for the game is that a lot of the areas go dark for no reason ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "226"
    },
    {
      "id": "tt1334676",
      "seasonNumber": "3",
      "episodeNumber": "20",
      "title": "CD-i Part 3: Faces of Evil and Zelda's Adventure",
      "image": "https://m.media-amazon.com/images/M/MV5BOWI0Njk5ZTktOGQwOC00Y2U1LWI1NjQtYWZjZDJmNmFiZDQ4XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "9 Dec. 2008",
      "plot": "The Nerd concludes his CD-i review with the two remaining Zelda games. The first one is Link: The Faces of Evil which has all of the same problems as Wand of Gamelon had. While the final game the Nerd reviews is Zelda's Adventure, which he praises it for not having the same bad animation as the first two games and is now an over head view like the earlier Zelda games instead of a slide scroller game. However the game still suffers with an abundance of flaws such as poorly detailed backgrounds making it hard to know what is an opening and what isn't. The CD load time ...",
      "imDbRating": "7.9",
      "imDbRatingCount": "220"
    },
    {
      "id": "tt1349499",
      "seasonNumber": "3",
      "episodeNumber": "21",
      "title": "Bible Games 2",
      "image": "https://m.media-amazon.com/images/M/MV5BNTIyYzUxMzMtNzNlZi00NjhjLWE5ZDgtY2ZjZGRjMDliNmMwXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "23 Dec. 2008",
      "plot": "It's Christmas time once more, and this time the Nerd decides to play more Bible games. This time most of the ones he's reviewing are official licensed games. The most obscured game he plays is Sunday Funday which is one of the last NES games of any kind. The most annoying thing about the game is the placement of springs and propellers create a confusing trap in most levels which makes it impossible to proceed further into the game. The Nerd concludes the review with three CD-i Bible games. Which are all contain mediocre mini games that are unappealing to play.",
      "imDbRating": "8.0",
      "imDbRatingCount": "217"
    },
    {
      "id": "tt1351967",
      "seasonNumber": "3",
      "episodeNumber": "22",
      "title": "Michael Jackson's Moonwalker",
      "image": "https://m.media-amazon.com/images/M/MV5BZjI0OWU2OTItYWZlNi00YTUyLWJjZDUtY2EyYTM0OGMzMTEzXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "7 Jan. 2009",
      "plot": "The Nerd reviews one of the first Genesis games he ever played which is Moonwalker. He expressed that at the time anything with Michael Jackson was worth buying and the idea of controlling a celebrity in a video game was relatively new back then. As he plays the game the one thing he finds annoying is fact you have to check every single door and window to find a lost kid to rescue while The Nerd couldn't understand why some copies of the game have the Thriller theme while others don't. Especially when the game has a zombie level which features the Thriller dance moves...",
      "imDbRating": "8.0",
      "imDbRatingCount": "238"
    },
    {
      "id": "tt1365066",
      "seasonNumber": "3",
      "episodeNumber": "23",
      "title": "Milon's Secret Castle",
      "image": "https://m.media-amazon.com/images/M/MV5BMmU3OGRkYTktYjAwMC00ZDkzLTgxZTYtYjIyM2MwZDhlYzJkXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "27 Jan. 2009",
      "plot": "When it comes to secrets, Milon's Secret Castle is filled with them. When the Nerd tries to play this game, he finds it to be unusual that two entrances to the castle lead right back outside and a window that just leads to an empty room. Upon reading the help column of an old Nintendo Power magazine, the Nerd learns the tricks on how to progress further into the game. However he finds it to be annoying that Milon's Secret Castle doesn't give you any hints or indications on where to go or what to do. It's as if the game developers want gamers to not be able to beat the...",
      "imDbRating": "7.5",
      "imDbRatingCount": "212"
    }
  ],
  "errorMessage": ""
}