{
  "imDbId": "tt1230180",
  "title": "The Angry Video Game Nerd",
  "fullTitle": "The Angry Video Game Nerd (TV Series 2004– )",
  "type": "TVSeries",
  "year": "2004",
  "episodes": [
    {
      "id": "tt1398472",
      "seasonNumber": "4",
      "episodeNumber": "1",
      "title": "Atari Jaguar: Part 1",
      "image": "https://m.media-amazon.com/images/M/MV5BZDYyNmU1OWEtN2I5Ni00YTkxLWFmNWYtYzljYTVlYjIzMzhlXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "16 Mar. 2009",
      "plot": "The Nerd gives us a history on Atari's library of game consoles. Along with show casing most of the consoles Atari manufactured for the market. He mentions how with so many consoles to choose from in the gaming market, Atari had to come up with a console that would wow gamers. The Jaguar 64 was introduced to the public and was the first console to use 64 bits of graphics. It was Atari's last console to be made and it reminded gamers that great graphics doesn't always mean great games. The Nerd pointed out how the cartridge games for the console have handles for some ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "217"
    },
    {
      "id": "tt1403869",
      "seasonNumber": "4",
      "episodeNumber": "2",
      "title": "Atari Jaguar: Part 2",
      "image": "https://m.media-amazon.com/images/M/MV5BMDkxYTZiYjUtZDYxZi00MjMxLWI1OGMtYjgxNTE0YTQ2ZGVmXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "25 Mar. 2009",
      "plot": "The Nerd reviews some of the Jaguar games, he saves his criticism for Cybermorph due to the obnoxious green female head and the fogging atmosphere you fly around in the game. Durign the second part of the review, the Nerd introduces us to the Jaguar CD add-on to the Jaguar. Like the Sega CD, it requires a Jaguar to play and it needs an AC adapter to work. The Nerd is clueless as to why it couldn't be it's own separate console, specially when hardly anyone own a Jaguar at the time. He was going to review some Jaguar CD games only the CD add-on won't work no matter what...",
      "imDbRating": "8.2",
      "imDbRatingCount": "220"
    },
    {
      "id": "tt1413101",
      "seasonNumber": "4",
      "episodeNumber": "3",
      "title": "Metal Gear",
      "image": "https://m.media-amazon.com/images/M/MV5BMzE1YzgzMDEtODhmMC00NzZjLTgzOWEtMDQwZDc3YTA0Y2YyXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "8 Apr. 2009",
      "plot": "The original Metal Gear is hailed a classic by video game buffs and is considered to be one of the best games on the NES. The Angry Video Game Nerd, however, begs to differ.",
      "imDbRating": "7.6",
      "imDbRatingCount": "199"
    },
    {
      "id": "tt1421892",
      "seasonNumber": "4",
      "episodeNumber": "4",
      "title": "Odyssey",
      "image": "https://m.media-amazon.com/images/M/MV5BNDM2MzUwMDYtNTljYS00MmY1LTgxZmEtYmQwZjVkYjFlOWU4XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "21 Apr. 2009",
      "plot": "The Nerd reviews the very first home video game console in existence: the 1972 Magnavox Odyssey. Watch as he and a hilarious special guest play the most primitive of video games ever created.",
      "imDbRating": "7.5",
      "imDbRatingCount": "214"
    },
    {
      "id": "tt1431927",
      "seasonNumber": "4",
      "episodeNumber": "5",
      "title": "X-Men",
      "image": "https://m.media-amazon.com/images/M/MV5BYjczY2JkMGMtMGE2Ni00YTk5LWJmZDYtMDZmMzQ0M2EzYWQwXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "6 May 2009",
      "plot": "The Nerd pays his respects to the X-Men by reviewing their library of video games. He finds the two on NES to be inferior... it's LJN, what did you expect? And two on Sega that actually are pretty decent.",
      "imDbRating": "7.4",
      "imDbRatingCount": "196"
    },
    {
      "id": "tt1441218",
      "seasonNumber": "4",
      "episodeNumber": "6",
      "title": "The Terminator",
      "image": "https://m.media-amazon.com/images/M/MV5BNWNlYTJiZTItZjU5ZC00Mzg2LWFkMjMtMjVkNWFjMjFkMmI3XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "19 May 2009",
      "plot": "Being a big fan of the Terminator movies, the Nerd decides to give the video games a try. He dislikes the NES game for not offering enough lives, having no continues and being put together in a sloppy way. The SNES version sucks too. However, he praises the Sega CD game for its awesome soundtrack.",
      "imDbRating": "7.8",
      "imDbRatingCount": "204"
    },
    {
      "id": "tt1449690",
      "seasonNumber": "4",
      "episodeNumber": "7",
      "title": "Terminator 2",
      "image": "https://m.media-amazon.com/images/M/MV5BYWFiZTJhMjktNmIyYi00MzRmLWFlYjMtODU0MzhkMGM5NjRmXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "2 Jun. 2009",
      "plot": "The Nerd's arch-nemesis LJN strikes again. Having license all home console versions of the Terminator 2 game, the Nerd checks them all out, and while the NES game is okay, the Game Boy sucks and the SNES is virtually unplayable.",
      "imDbRating": "7.8",
      "imDbRatingCount": "201"
    },
    {
      "id": "tt1458363",
      "seasonNumber": "4",
      "episodeNumber": "8",
      "title": "Transformers",
      "image": "https://m.media-amazon.com/images/M/MV5BNGViNDE1MzUtNmE5MS00OTU3LWE5YTctODg5MzE3NWI0ZDA1XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "17 Jun. 2009",
      "plot": "The Nerd lists all the different formats a gamer would play for video games, and then shows an unlikely format for the first Transformers game which is a cassette tape. It's for the cassette tape player for the Commodore 64 which gives you a playable game. However it's not what you'd expect for a Transformers video game. It's mostly a simulation game with target shooting theme levels. There was a slide scroller game made for Transformers except it's a Japanese only game. So the Nerd gets out the Famicon which is the only way to play the game and wonders if the game is...",
      "imDbRating": "7.7",
      "imDbRatingCount": "202"
    },
    {
      "id": "tt1466380",
      "seasonNumber": "4",
      "episodeNumber": "9",
      "title": "Mario Is Missing",
      "image": "https://m.media-amazon.com/images/M/MV5BZTAxYzFiNDItYzNiYi00OTZkLTg0MTctNjVkOWYxYTY1MjMxXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "1 Jul. 2009",
      "plot": "The idea of Luigi being in his own game fore once sounded like a cool idea to the Nerd. Only to discover that \"Mario is Missing\" for the NES is a poorly executed educational game with borrowed graphics from Super Mario World. The Nerd didn't like the idea of Luigi being in a learning game especially one that has bad controls and missions that make no sense like New York being concern that King Kong was abducted. The Super Nintendo version is slightly better but still has unusual control schemes. Even the NES and Super Nintendo versions of \"Mario's Time Machine\" wasn't...",
      "imDbRating": "7.4",
      "imDbRatingCount": "204"
    },
    {
      "id": "tt1478182",
      "seasonNumber": "4",
      "episodeNumber": "10",
      "title": "Plumbers Don't Wear Ties!",
      "image": "https://m.media-amazon.com/images/M/MV5BMDllOTk0YTYtYjIwZi00NzI1LWJlNTAtNDEyOTc2NTFiMDAxXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "21 Jul. 2009",
      "plot": "The Nerd looks for the worst full motion video game on the ill-fated 3DO, only to discover the worst video game he's ever seen...at least it would be, if it had any gameplay. Or video.",
      "imDbRating": "9.1",
      "imDbRatingCount": "438"
    },
    {
      "id": "tt1486456",
      "seasonNumber": "4",
      "episodeNumber": "11",
      "title": "Bugs Bunny's Crazy Castle",
      "image": "https://m.media-amazon.com/images/M/MV5BZjhmYzdmMDktZTU5MS00OTY3LWI3OGMtZjUzNjY1ODVhYzIwXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "5 Aug. 2009",
      "plot": "Bugs Bunny gets revenge on the Nerd by forcing him to play not one, not two, not three, not four, but FIVE Crazy Castle games! It's a pie-throwing, bomb-bursting, game-smashing, fist-flying, anvil-crashing, carrot-chomping, all-out bombastic barrage of loony proportions!",
      "imDbRating": "8.2",
      "imDbRatingCount": "248"
    },
    {
      "id": "tt1495237",
      "seasonNumber": "4",
      "episodeNumber": "12",
      "title": "Super Pitfall",
      "image": "https://m.media-amazon.com/images/M/MV5BMTIyZDVhOTktM2I0OC00Nzg3LTgyODQtZWFmNTdjZTMwYWE0XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "20 Aug. 2009",
      "plot": "Pitfall for Atari 2600 was a classic, however the NES game Super Pitfall is a horse of a different color. The Nerd dislikes how the level layouts of the game make little sense such as ladders leading to no where and anti-gravity lakes with no bottom except for thin air. The Nerd's main complaint is almost all of the items are invisible and only appear if you jump on a certain spot. This becomes annoying when all you do in the game is jump around in every single area.",
      "imDbRating": "7.9",
      "imDbRatingCount": "212"
    },
    {
      "id": "tt1505696",
      "seasonNumber": "4",
      "episodeNumber": "13",
      "title": "Godzilla",
      "image": "https://m.media-amazon.com/images/M/MV5BMDBiYTRjMTUtODEyMy00ZTM5LWFhMmUtZDk3MjJkZmFkNDQ4XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "4 Sep. 2009",
      "plot": "The Nerd loves Godzilla, but unfortunately for him the movies were hard to find growing up and the available video games were all terrible. To his extreme dismay, he finds out all the good Godzilla games came out after he was an adult.",
      "imDbRating": "8.1",
      "imDbRatingCount": "217"
    },
    {
      "id": "tt1516360",
      "seasonNumber": "4",
      "episodeNumber": "14",
      "title": "Wayne's World",
      "image": "https://m.media-amazon.com/images/M/MV5BZDhmZTgyZDItMGI4ZC00YWNmLTk5ZDMtNjY5ZTcwOTA1ODIxXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "24 Sep. 2009",
      "plot": "The Nerd isn't sure how any game company can create a video game based off of the movie Wayne's World when all the movie is just about two guys hosting their own show in a basement along with an abundance of jokes towards clichés that were occurring at the time. So the Nerd couldn't help but check out what the NES game is like. The game is already a big downer when there's a lack of good color and the Nerd's main complaint is that Garth has an effective weapon while Wayne just gives out a wimpy kick. The Super Nintedno version on the other hand is no improvement even ...",
      "imDbRating": "7.4",
      "imDbRatingCount": "197"
    },
    {
      "id": "tt1528185",
      "seasonNumber": "4",
      "episodeNumber": "15",
      "title": "Castlevania: Part I",
      "image": "https://m.media-amazon.com/images/M/MV5BMGUwZDllZWUtYmUzYS00YjY1LWFkYjYtMWIyMmJlMmJkNTQzXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "8 Oct. 2009",
      "plot": "In honor of the Halloween season, the Nerd decides to treat himself to the Castlevania series by reviewing every game for the Nintendo, Super Nintendo and even Nintendo 64. First, he pays his respects to the original Castlevania, a game that always seems to creep into his subconscious.",
      "imDbRating": "8.1",
      "imDbRatingCount": "210"
    },
    {
      "id": "tt1533559",
      "seasonNumber": "4",
      "episodeNumber": "16",
      "title": "Castlevania Part II: Simon's Quest and Dracula's Curse",
      "image": "https://m.media-amazon.com/images/M/MV5BMWFmNmJjM2UtOWUzNy00MmIyLTkwN2QtMWIyZjM5YzIxZTg5XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "21 Oct. 2009",
      "plot": "Continuing his Castlevania marathon, the Nerd decides to revisit the horrors of Castlevania II: Simon's Quest by doing a fresh, new review of it. He also tackles Castlevania III, which he feels was a true sequel to the first installment.",
      "imDbRating": "8.0",
      "imDbRatingCount": "204"
    },
    {
      "id": "tt1544389",
      "seasonNumber": "4",
      "episodeNumber": "17",
      "title": "Castlevania Part III",
      "image": "https://m.media-amazon.com/images/M/MV5BN2U1ZDUyZDktNzM2Yy00OGE3LWJmOTctNjdiZjg2ZDA0MzY3XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "5 Nov. 2009",
      "plot": "The Nerd continues to revisit the Castlevania games. In this one, he covers Super Castlevania IV. He also covers the dreaded Nintendo 64 Castlevania game.",
      "imDbRating": "7.9",
      "imDbRatingCount": "198"
    },
    {
      "id": "tt1551965",
      "seasonNumber": "4",
      "episodeNumber": "18",
      "title": "Castlevania Part IV: Bloodlines and Symphony of the Night",
      "image": "https://m.media-amazon.com/images/M/MV5BZjk3ODU4ZTAtMmZiNS00ZGM3LTg4YjAtMmVmY2ZhYTk1MmU4XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "19 Nov. 2009",
      "plot": "It's the final part of the Nerd's Castlevania marathon, so he decides to cover Bloodlines and Symphony of the Night. He also discusses the future of Castlevania.",
      "imDbRating": "7.9",
      "imDbRatingCount": "202"
    },
    {
      "id": "tt1562539",
      "seasonNumber": "4",
      "episodeNumber": "19",
      "title": "Little Red Hood",
      "image": "https://m.media-amazon.com/images/M/MV5BNzg4MzU2NmEtNTEyMC00ZGUyLWEyZTAtZWYzMTQ5MzczZGY1XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "3 Dec. 2009",
      "plot": "Out of all of the NES games in his collection, the Nerd decides to review the one that stands out like a sore thumb which has an unusual slot on top of the cartridge. Mainly because it's an unlicensed game much like the Noah's Ark 3D game for the Super Nintendo. The game is called Little Red Hood, which in no way does it resemble the original story. So the Nerd starts to play it and already could tell it's an abomination with putrid color schemes and unusual game rules. In fact the game has no organized rules when enemies re-spawn rapidly, items would sometimes ...",
      "imDbRating": "7.6",
      "imDbRatingCount": "206"
    },
    {
      "id": "tt1578157",
      "seasonNumber": "4",
      "episodeNumber": "20",
      "title": "Winter Games",
      "image": "https://m.media-amazon.com/images/M/MV5BZTQ4ZGJlNTgtOWNkMS00ZGY2LTk5MDgtY2YxZGRkMzZmMDQyXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "23 Dec. 2009",
      "plot": "It's the middle of winter at the Nerd's house, and to keep himself occupied from being cold is by reviewing Winter Games for the NES. The Nerd explains how the Winter Games for the Atari 2600 was fun, however the NES version is inferior due to it having only four winter Olympic game events and has a bad control scheme. The biggest complaint the Nerd has for the game is the figure skating game in which no matter what buttons he presses he is unable to achieve any good skating moves and always receives a 0.0 for a score despite managing to pull off a few good skating ...",
      "imDbRating": "7.4",
      "imDbRatingCount": "203"
    },
    {
      "id": "tt1579165",
      "seasonNumber": "4",
      "episodeNumber": "21",
      "title": "Street Fighter 2010",
      "image": "https://m.media-amazon.com/images/M/MV5BNzYyZmRkYWYtZWI1ZS00NjZiLTg1ZTctYjIyZDkyMWZmYmRhXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "6 Jan. 2010",
      "plot": "What better way to kick off the year 2010 than by playing Street Fighter 2010? The Nerd strives to beat this ridiculously hard game that has nothing to do with the Street Fighter series, and as a bonus, he plays not only the Sega Saturn adaptation of the Street Fighter movie, but he actually manages to find and play the original Street Fighter game! And as you might expect, they all suck.",
      "imDbRating": "7.8",
      "imDbRatingCount": "199"
    },
    {
      "id": "tt1589578",
      "seasonNumber": "4",
      "episodeNumber": "22",
      "title": "Hydlide",
      "image": "https://m.media-amazon.com/images/M/MV5BM2JmYmRiNmMtM2Y5Yi00ZDQyLWExYjUtNGMxNGQxZTQxZWZiXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "20 Jan. 2010",
      "plot": "Within the NES collection of the Nerd lies a game called Hydlide, the pronunciation of the name is debate-able. The Nerd points out that while the game looks like a rip off of Legend of Zelda, its actually older than Zelda. It was originally released as a computer game but got re-released for the NES at the wake of the first Zelda game. Excluding the similarities to Zelda, the game is nothing special. The Nerd's main complaint is the confusing selection of options on the menu screen and the use of long passwords in order to beat the game. When a save feature would of ...",
      "imDbRating": "7.2",
      "imDbRatingCount": "194"
    },
    {
      "id": "tt1599218",
      "seasonNumber": "4",
      "episodeNumber": "23",
      "title": "Ninja Gaiden",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ0MjRhNzUtNmI0My00NmRlLWI4MzEtMGY2OTRkZDgyZTkwXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "4 Feb. 2010",
      "plot": "Ninja Gaiden is one of the Nerd's favorite games, but its extreme difficulty has prevented him from beating it. This game is so hard, you'd have to be a ninja to beat it. The Nerd seeks one out, who trains him in the art of overcoming difficulty and sharpens his skills. However, this game might prove to be more than a match for the wise old master.",
      "imDbRating": "7.9",
      "imDbRatingCount": "221"
    },
    {
      "id": "tt1604004",
      "seasonNumber": "4",
      "episodeNumber": "24",
      "title": "Swordquest",
      "image": "https://m.media-amazon.com/images/M/MV5BZGI4NzM0MTAtODVhNC00NDAyLTg2ODUtOTNmZjA4ODg5NWM1XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "18 Feb. 2010",
      "plot": "The Nerd does a history lecture on the Swordquest games which were not just your average Atari action genre games but were actually games used for a promotional contest where gamers have a chance to win actual treasures made of gold and other minerals. Only three games were made when it was planned to be a four game series. However due to the 1983 video game crash, Atari pulled the plug on the production of the fourth and final game and the two remaining contests never happened. The three remaining treasures are said to be in the ownership of the head of Atari at the ...",
      "imDbRating": "8.3",
      "imDbRatingCount": "214"
    },
    {
      "id": "tt1613590",
      "seasonNumber": "4",
      "episodeNumber": "25",
      "title": "Pong Consoles",
      "image": "https://m.media-amazon.com/images/M/MV5BODI3NmFlOTEtYmI0Mi00MDE4LThjNTUtOWQ4MmM0NmU4ZDI4XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "6 Mar. 2010",
      "plot": "The Nerd does a lecture on the game Pong a very simple concept for a game that ended up spawning to many spin-offs and remakes. In this case he reviews every single Pong console he can obtain. Most of these console don't have insert slots for games because the games are already programmed into the consoles themselves. Most of the consoles would either not work properly or have unusual features during the game play. The most obscure consoles are the ones that don't have an AC adapter outlet which makes hooking the consoles up a big chore. The Nerd expressed how times ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "217"
    }
  ],
  "errorMessage": ""
}