{
  "imDbId": "tt1230180",
  "title": "The Angry Video Game Nerd",
  "fullTitle": "The Angry Video Game Nerd (TV Series 2004– )",
  "type": "TVSeries",
  "year": "2004",
  "episodes": [
    {
      "id": "tt1854094",
      "seasonNumber": "6",
      "episodeNumber": "1",
      "title": "Spielberg Games",
      "image": "https://m.media-amazon.com/images/M/MV5BNTc1YWYyYTctNDcxOC00YTVkLWI3OTAtMjRiYTZhYmY3YmM5XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.8254_AL_.jpg",
      "year": "2011",
      "released": "6 Apr. 2011",
      "plot": "The Nerd reviews certain video games all based off of Speilberg movies. Starting with Jaws for the NES, which the Nerd complains that the concept is boring when all you do is collect sea shells in order to get power ups that'll allow you to kill the shark quicker. The second game he reviews is Hook for the NES, which is sadly a poorly executed plat-former game resembling nothing like the movie. The Nerd then reviews several Jurassic Park games that are either appealing to play or are contain annoying concepts. Out of all of them, the Nerd regards the 3DO version to be...",
      "imDbRating": "8.3",
      "imDbRatingCount": "222"
    },
    {
      "id": "tt1986688",
      "seasonNumber": "6",
      "episodeNumber": "2",
      "title": "The Making of an Episode",
      "image": "https://m.media-amazon.com/images/M/MV5BMDQzMzczNDctYWU2Yi00NDdmLTgzYzEtNzA4OWFkYTA0YWI1XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "6 Jul. 2011",
      "plot": "James Rolfe steps out of character to take us through the entire process, from script to screen, that comes from making an episode of The Angry Video Game Nerd.",
      "imDbRating": "8.5",
      "imDbRatingCount": "188"
    },
    {
      "id": "tt2011774",
      "seasonNumber": "6",
      "episodeNumber": "3",
      "title": "Kid Kool",
      "image": "https://m.media-amazon.com/images/M/MV5BYjViNDkzNTItN2VmOC00YzM5LWJkNWUtZDFiNmQ0YjA4Mzk5XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.8095_AL_.jpg",
      "year": "2011",
      "released": "3 Aug. 2011",
      "plot": "Kid Kool for the NES is a rushed slide scroller game that fell into obscurity. The Nerd reviews the game and already finds the title to be misleading when the main character looks nothing like the one on the cartridge cover and it's no where close to being \"cool\". The Nerd's main complaint is the jumping controls aren't that responsive and random placements of hidden item blocks which creates a hazard when trying to jump to another area or trying to jump on enemies.",
      "imDbRating": "7.2",
      "imDbRatingCount": "189"
    },
    {
      "id": "tt2040109",
      "seasonNumber": "6",
      "episodeNumber": "4",
      "title": "Nintendo World Championships",
      "image": "https://m.media-amazon.com/images/M/MV5BZTI1MTdhYmMtY2ViZS00YzIwLWI0MWYtMGE4MjM0ZTIzN2MzXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "26 Aug. 2011",
      "plot": "The Nerd won several NES cartridges from an online auction. Among the games included was the 1990 Nintendo World Championships game. The only NES game the Nerd doesn't own, because it is so rare that authentic copies of the game cost at least $10,000. The game included in the auction deal however was not a legit copy, but just a reproduced edition that is more common to obtain. When all else fails, Nerd contacts a fellow gamer named Pat the NES Punk for a trade in between his box of games for Pat's own NWC game. Upon Pat's observing of the box of game, he find an ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "217"
    },
    {
      "id": "tt2078357",
      "seasonNumber": "6",
      "episodeNumber": "5",
      "title": "Dark Castle",
      "image": "https://m.media-amazon.com/images/M/MV5BMzAxMjljNDQtZGU3OC00NzkyLWI1YzYtMjAxYzc3YmUwNTRmXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "5 Oct. 2011",
      "plot": "In light of the Halloween season, the Nerd plays the Sega Genesis cult classic, Dark Castle. A virtually unplayable game with horrible controls, stage hazards and unspeakable game play.",
      "imDbRating": "7.9",
      "imDbRatingCount": "196"
    },
    {
      "id": "tt2132086",
      "seasonNumber": "6",
      "episodeNumber": "6",
      "title": "Bible Games III",
      "image": "https://m.media-amazon.com/images/M/MV5BNjQ2M2Y0M2UtMWY0YS00MTUwLThiZDItYzYxMzJhM2M3MWU2XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.9683_AL_.jpg",
      "year": "2011",
      "released": "7 Dec. 2011",
      "plot": "The Nerd does one final review on Bible Games licensed and unlicensed alike. Cause he makes it clear that he doesn't want to do a Bible Game 4 review. So he reviews the Bible game for Game Boy which has the entire Bible on the game as well as a hang man style game that only uses words from the old English language. The most amusing thing about the game is that the Nerd is able to do a word search on the Bible and discovered there's a lot of A-words in various bible verses. While the most obscured game he reviews for this review is a game called 6 in 1. Which is ...",
      "imDbRating": "7.5",
      "imDbRatingCount": "173"
    }
  ],
  "errorMessage": ""
}