{
  "imDbId": "tt1230180",
  "title": "The Angry Video Game Nerd",
  "fullTitle": "The Angry Video Game Nerd (TV Series 2004– )",
  "type": "TVSeries",
  "year": "2004",
  "episodes": [
    {
      "id": "tt1648752",
      "seasonNumber": "5",
      "episodeNumber": "1",
      "title": "Action 52",
      "image": "https://m.media-amazon.com/images/M/MV5BZjM3YTBiNWUtYjdhYy00ZjUzLTg1NzAtOGNlMDAxMDViMTQ0XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "30 Apr. 2010",
      "plot": "After getting so many request to review Action 52, the Nerd has no choice but to give what his fans want. The game is an unlicensed NES game compiled with 52 games. This seem to be a cool idea, until the Nerd discovers what those games are. So he does a marathon run on the first 51 games and every single one either has characters dying in mid-air, characters too small to identify, too many space shooter genre games, games that make no sense, enemies that don't die, games that keep crashing, & whole bunch of other disastrous elements. After being tortured by only 51 ...",
      "imDbRating": "8.6",
      "imDbRatingCount": "265"
    },
    {
      "id": "tt1670827",
      "seasonNumber": "5",
      "episodeNumber": "2",
      "title": "Cheetahmen",
      "image": "https://m.media-amazon.com/images/M/MV5BMGZmZjhkNTYtY2Q2Ni00MTU4LWFjZDAtNmJjODhlNTJlZmNiXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "9 Jun. 2010",
      "plot": "The Nerd reviews the 52nd game on Action 52 titled the Cheetah Men, which came with it's own single volume comic and a preview to a line of action figures that never got made. It looked like the best game cause all of the efforts seem to be poured into it the most compared to the other games. However the game isn't any better than the other 51 games. It suffers from unusual glitches and the attack moves are worthless to certain enemies. After finishing all 52 games, the Nerd decided to play the unreleased Cheetah Men 2 game. It's so rare that only 1500 cartridges were...",
      "imDbRating": "8.4",
      "imDbRatingCount": "241"
    },
    {
      "id": "tt1687727",
      "seasonNumber": "5",
      "episodeNumber": "3",
      "title": "Game Glitches",
      "image": "https://m.media-amazon.com/images/M/MV5BOGIyMTE1NDAtNjRhOC00ODZlLTkyYzYtNzc1YjRiYzU4NWRiXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "7 Jul. 2010",
      "plot": "The Nerd is about to enjoy playing the NES Pac-Man, only to discover that it contains game glitches. He tries to blow the dust out of it and even try playing it on different NES consoles, but nothing worked. When this sort of thing happens, the Nerd knows it's the work of the Glitch Gremlin. A tiny little gremlin who is the main cause of all game glitches. Upon trying to get rid of the gremlin, the Nerd discusses several games that contain glitches after being released in public. These glitches can make the games more interesting or make them a lot more helpful upon ...",
      "imDbRating": "7.7",
      "imDbRatingCount": "231"
    },
    {
      "id": "tt1702933",
      "seasonNumber": "5",
      "episodeNumber": "4",
      "title": "Zelda II: The Adventure of Link",
      "image": "https://m.media-amazon.com/images/M/MV5BOWE4ZDNjMWYtNzliYy00ZjFiLWExNjctNTE1ZWQwNTkzNjc5XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "4 Aug. 2010",
      "plot": "The Nerd is surprised to get a lot of requests to review the second Zelda game which he comments is a good game. But decides to review it since the game was known for being harder than the other entries in the Zelda franchise. The main complaint the Nerd had was the constant encounters with the enemies which happens too often during the over world exploration. While the only way to progress further in areas you need a walkthrough in order to beat the game. In the end the game is a hate it or like it game and the Nerd could see that Nintendo tried to separate the ...",
      "imDbRating": "7.8",
      "imDbRatingCount": "216"
    },
    {
      "id": "tt1720771",
      "seasonNumber": "5",
      "episodeNumber": "5",
      "title": "Back to the Future Trilogy",
      "image": "https://m.media-amazon.com/images/M/MV5BNTkxMDU0NzctNTBhZC00Zjc4LTg1OWEtMjQzOWEyNzU1ODM5XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "3 Sep. 2010",
      "plot": "The Angry Video Game Nerd reviews the Back to the Future video games and also revisits Teenage Mutant Ninja Turtles (NES), Who Framed Roger Rabbit (NES), Top Gun (NES), Back to the Future (NES), and Back to the Future Part II & III (NES).",
      "imDbRating": "8.5",
      "imDbRatingCount": "221"
    },
    {
      "id": "tt1740627",
      "seasonNumber": "5",
      "episodeNumber": "6",
      "title": "Dr. Jekyll & Mr. Hyde Re-Revisited",
      "image": "https://m.media-amazon.com/images/M/MV5BYTBiOGYxMGQtMDkwNS00MGFmLWIxMzctNWJiMTY1NzEyOWVlXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "6 Oct. 2010",
      "plot": "After being surprised that people ignored his warning and played the Dr. Jekyll and Mr. Hyde game for the NES. The Nerd reluctantly decides to revisit the game to give it a more explored review on it. But the idea of re-playing the game makes the Nerd feel uneasy about it. As he starts off playing the game he points out a few tips on how to play the game longer, except doing so is a real chore. While the obstacles in the game still make no sense, like how Jekyll has no defense yet Hyde does. The armada of townsfolk and random animals attacking Jekyll makes the game ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "226"
    },
    {
      "id": "tt1763960",
      "seasonNumber": "5",
      "episodeNumber": "7",
      "title": "Lester the Unlikely",
      "image": "https://m.media-amazon.com/images/M/MV5BOTlkODY4ZjUtZDlkMC00MDVhLWJlZmMtNzI4OThmNDMwNjFlXkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "3 Nov. 2010",
      "plot": "The Nerd randomly picks a Super Nintendo game to review which turns out to be Lester the Unlikely. The Nerd knows that the game isn't going to be fun just by seeing the main title screen and the intro. What perplexes the Nerd is that Lester is a wimpy guy who can't attack with anything but a puny kick, unable to with stand jumping from a high place, and is afraid of almost everything he encounters. To make matters worse, the levels of the game look like they're design for a more playable plat-former game with a character that isn't as weak as Lester. In the end the ...",
      "imDbRating": "7.7",
      "imDbRatingCount": "213"
    },
    {
      "id": "tt1791939",
      "seasonNumber": "5",
      "episodeNumber": "8",
      "title": "How the Nerd Stole Christmas",
      "image": "https://m.media-amazon.com/images/M/MV5BZjM0NjVmZGQtOTRhZS00YmZlLWI3ODQtNTBmMWNiZGQyYTdmXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2010",
      "released": "8 Dec. 2010",
      "plot": "The Nerd who appears only as an illustration is frustrated that the citizens of Gameville have all the good games, while he is stuck with the bad games. So the Nerd decides to ruin the citizens of Gameville's Christmas by replacing their presents containing good games with really bad games. He does this in the same style as the Grinch complete with Narrator and a singer who sings a parody of You're a Mean One Mr. Grinch. Upon his heist, the Nerd gives off some very brief reviews on random bad games and pointing out what makes them so bad.",
      "imDbRating": "7.0",
      "imDbRatingCount": "192"
    },
    {
      "id": "tt1811243",
      "seasonNumber": "5",
      "episodeNumber": "9",
      "title": "Day Dreamin' Davey",
      "image": "https://m.media-amazon.com/images/M/MV5BNTU2ZmFlYzAtN2VkOS00NWE5LTgyMWMtMjVkYmM1M2FmNDg5XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "5 Jan. 2011",
      "plot": "The Nerd reviews a NES game called Day Dreamin' Davey which features a very bland story about a kid who keeps falling asleep and is amazed by basic objects. The Nerd's main complaint about the game is the constant reusing of only three dream worlds which are a Medievil World, Roman World, and the Wild West. While the levels themselves have no logic when it comes to item locations and the number of hits it takes to kill an enemy. This game is so bad that the Nerd would rather dream of playing a better game than Day Dreamin' Davey.",
      "imDbRating": "7.3",
      "imDbRatingCount": "198"
    },
    {
      "id": "tt1833528",
      "seasonNumber": "5",
      "episodeNumber": "10",
      "title": "Star Wars Games",
      "image": "https://m.media-amazon.com/images/M/MV5BM2M5NjJjZGYtYTBlZC00OWRlLTlkNjgtZGNhM2M3NmRhYzg1XkEyXkFqcGdeQXVyNTM3MDMyMDQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "2 Feb. 2011",
      "plot": "The Nerd does a review on the first home console Star Wars games all the way to the ones made in the mid-90s. When it comes to Star Wars, it's such a huge franchise that making video game adaptations is a good way to expand it. Doing this task lead to certain video game developers to develop both hard and unusual Star Wars games. The hardest game the Nerd plays is the Famicon version which gives you no life bar and only three continues and a start-all-over-from-the-beginning type of game. Out of all of the games, the Nerd praises the Super Star Wars game for the Super...",
      "imDbRating": "8.4",
      "imDbRatingCount": "234"
    },
    {
      "id": "tt1854954",
      "seasonNumber": "5",
      "episodeNumber": "11",
      "title": "R.O.B. the Robot",
      "image": "https://m.media-amazon.com/images/M/MV5BMmIzOWVhZTAtN2MzZi00Y2U0LTlkMWEtNTljYzY5YjI1OGY0XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2011",
      "released": "2 Mar. 2011",
      "plot": "After the Nerd goes through a frantic frenzy about playing nothing but bad games, he finally settles down and randomly picks a NES game called Gyromite. When he starts the game he finds it unusual that you can't progress further into the game unless the second controller is being used with controls the barriers that prevents you from proceeding. The Nerd isn't sure who he can invite to help him play a bad game, until the robot named Rob appears and says he'll help the Nerd. It turns out that Rob the robot who was a Nintendo accessory was designed to play as a second ...",
      "imDbRating": "8.6",
      "imDbRatingCount": "268"
    }
  ],
  "errorMessage": ""
}