{
  "imDbId": "tt1230180",
  "title": "The Angry Video Game Nerd",
  "fullTitle": "The Angry Video Game Nerd (TV Series 2004– )",
  "type": "TVSeries",
  "year": "2004",
  "episodes": [
    {
      "id": "tt2292954",
      "seasonNumber": "7",
      "episodeNumber": "1",
      "title": "Schwarzenegger Games",
      "image": "https://m.media-amazon.com/images/M/MV5BMTVhZTQxM2UtNTU2Ny00YTcyLWE5NjYtZjg5NWZkY2FkZmU1XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "23 Jul. 2012",
      "plot": "After a 6 month hiatus, the Nerd is back. And to honor his return to reviewing bad and challenging games, he decides to review some Schwarzenegger games for the NES. Mainly due to Schwarzenegger returning to acting after finishing his term as Governer. When it comes to Arnold, his action films are always appealing to watch. As for video game adaptations it's the complete opposite. They either don't feature the main character to resemble Arnold or the game-play and level layouts are a complete mess. The Nerd saved all of the criticism for the Predator game for the NES....",
      "imDbRating": "8.1",
      "imDbRatingCount": "210"
    },
    {
      "id": "tt2476022",
      "seasonNumber": "7",
      "episodeNumber": "2",
      "title": "Ghosts N' Goblins",
      "image": "https://m.media-amazon.com/images/M/MV5BNTRkNzhhMDMtNjZkNy00MzIyLWI3YzItYWVjZDFlM2YzMDlhXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "23 Oct. 2012",
      "plot": "After doing an autograph signing at a convention, the Nerd receives a petition to review the NES game Ghost N' Goblins. While he comments that it's not a bad game, he does however admit that it's one of the hardest NES games to play. So the Nerd decides to review the game since it's Halloween related. As he's playing it he expresses that the fair thing about the game is that you're given unlimited continues so that way you don't have to keep restarting the game. The biggest flaw to the game however is that you're on given two life bars of health and that's it. While ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "204"
    },
    {
      "id": "tt2578830",
      "seasonNumber": "7",
      "episodeNumber": "3",
      "title": "Atari Sports",
      "image": "https://m.media-amazon.com/images/M/MV5BYzg1MDgxODQtM2MzMi00Y2Q2LWIwZDktMWY2ODAyY2M1ZmU2XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.9683_AL_.jpg",
      "year": "2012",
      "released": "17 Dec. 2012",
      "plot": "The Nerd has for a while not done a review that's entirely dedicated towards sports games. The reason being of course is that he's not a big sports fan, he's a video game nerd to be exact. After getting requests to do a review on sports games, the Nerd complies to his fans by playing Atari sport genre games. Mainly cause those are the first sports games made for a home console. Most of the games don't resemble the actual sport either due to the limitation of graphics or due to the unusual rules that don't occur in a real life sport. Despite that the Nerd found most of...",
      "imDbRating": "8.2",
      "imDbRatingCount": "208"
    },
    {
      "id": "tt2755328",
      "seasonNumber": "7",
      "episodeNumber": "4",
      "title": "Ikari Warriors",
      "image": "https://m.media-amazon.com/images/M/MV5BN2QxNjdhZjItZWJmNS00ZjM4LThkMzEtMDA1MTRjN2VkMzMwXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "6 Mar. 2013",
      "plot": "The Nerd reviews Ikari Warriors for the NES. While the game at first appears to be a decent shoot 'em up game it's actually a really hard game to go through unless you have two people playing the game. Desperate to beat the game, the Nerd revives Guitar Guy who has been dead for sometime by using the Ikari Warrior continue code. The Guitar Guy is surprised to be alive again and originally believed that the Nerd had forgotten him cause the original theme song hasn't been used for so long. The Guitar Guy agreed to help Nerd beat the game if he can play the main theme ...",
      "imDbRating": "7.6",
      "imDbRatingCount": "207"
    },
    {
      "id": "tt2885248",
      "seasonNumber": "7",
      "episodeNumber": "5",
      "title": "Toxic Crusaders",
      "image": "https://m.media-amazon.com/images/M/MV5BMjUxYjU3MTEtNDllZS00OTJkLWE2MTgtM2Q4MzkxODIwNjVlXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.9683_AL_.jpg",
      "year": "2013",
      "released": "30 Apr. 2013",
      "plot": "The Nerd reviews the Toxic Crusaders games for the Gameboy, Genesis, and NES. The games are so bad, he invited over the creator himself, Lloyd Kaufman to witness how bad they are. Lloyd, who is very proud of his Toxic Avenger movies, agrees to play the games. However, when he and the Nerd play the NES version, they couldn't handle the complicated levels and game play. The idea of having a select button for the stronger attack move baffles the Nerd and Kaufman.",
      "imDbRating": "6.6",
      "imDbRatingCount": "219"
    },
    {
      "id": "tt3019320",
      "seasonNumber": "7",
      "episodeNumber": "6",
      "title": "Bill & Ted's Excellent Adventure",
      "image": "https://m.media-amazon.com/images/M/MV5BYzk0MGUwZGMtYTRlMC00MTI1LWFjNmQtMGE2YjRkMjdlNjlkXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "30 Jun. 2013",
      "plot": "LJN rises again with a shitty game and James has to review it.",
      "imDbRating": "7.7",
      "imDbRatingCount": "188"
    },
    {
      "id": "tt3170602",
      "seasonNumber": "7",
      "episodeNumber": "7",
      "title": "Tiger Electronic Games",
      "image": "https://m.media-amazon.com/images/M/MV5BNDdkMmQ3NWItMmJiNS00MDFlLTljNTQtNmVkZDNhYjRmMDY4XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "6 Sep. 2013",
      "plot": "After clearing up the 7-year mystery of Taxman, the Nerd looks at an abundance of Tiger Electronic handheld games. You remember those, right? Basically a poor man's Game Boy? But those were only the beginning...",
      "imDbRating": "8.3",
      "imDbRatingCount": "234"
    },
    {
      "id": "tt3278826",
      "seasonNumber": "7",
      "episodeNumber": "8",
      "title": "Alien³",
      "image": "https://m.media-amazon.com/images/M/MV5BMTM0MDI2NDQtNmQwMi00ZDMzLTgxODUtZWYxZmY4OTQ3NDk3XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "21 Oct. 2013",
      "plot": "In light of the Halloween season, and to promote the Cinemassacre's Monster Madness reviews of the Alien franchise, the Nerd reviews Alien 3 on NES. So how does it fare? It's made by LJN. 'Nuff said.",
      "imDbRating": "7.0",
      "imDbRatingCount": "170"
    },
    {
      "id": "tt3345398",
      "seasonNumber": "7",
      "episodeNumber": "9",
      "title": "AVGN Games",
      "image": "https://m.media-amazon.com/images/M/MV5BZDg5MmJhZjItY2IwYy00MmE1LTk1OWEtM2MxMWI3OTJjOThjXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "19 Nov. 2013",
      "plot": "In an ironic change of pace, the Nerd decides to review video games based on himself. Yeah, over the years, an abundance of AVGN games have been created independently by aspiring game designers. As a special tribute, the Nerd gives them each their 15 seconds of fame.",
      "imDbRating": "8.5",
      "imDbRatingCount": "265"
    },
    {
      "id": "tt3410658",
      "seasonNumber": "7",
      "episodeNumber": "10",
      "title": "Wish List: Part 1",
      "image": "https://m.media-amazon.com/images/M/MV5BM2U3NjM1MzAtMGFlMS00MWYwLThhOWUtMjZiODNkNzU2YTlkXkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.8254_AL_.jpg",
      "year": "2013",
      "released": "17 Dec. 2013",
      "plot": "This Christmas, the AVGN takes us back to the past... before internet, and you had to buy things out of store catalogs. It's a holly jolly dose of nostalgia as the Nerd remembers back to all the Nintendo, Atari, VHS and action figures we all asked Santa to bring us. Also, he does some mini-reviews of bad Sonic games. Part 1 of 2.",
      "imDbRating": "7.9",
      "imDbRatingCount": "174"
    },
    {
      "id": "tt3414914",
      "seasonNumber": "7",
      "episodeNumber": "11",
      "title": "Wish List: Part 2",
      "image": "https://m.media-amazon.com/images/M/MV5BMjU2M2M2NWQtNjIxYS00OTlhLWIzMDgtMzMxNjgwY2E2MWM3XkEyXkFqcGdeQXVyMTQzMjU1NjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "19 Dec. 2013",
      "plot": "Concluding his little Christmas wish-list tribute to the fans, the Nerd reviews some more big requests, like the Three Stooges, Boy and His Blob, Home Improvement on SNES, and a GOOD Spider-Man game. The biggest surprise and the biggest Christmas miracle of all time occurs when the Nerd discovers who made that awesome Spider-Man game.",
      "imDbRating": "7.8",
      "imDbRatingCount": "195"
    }
  ],
  "errorMessage": ""
}