{
  "imDbId": "tt1870479",
  "title": "The Newsroom",
  "fullTitle": "The Newsroom (TV Series 2012–2014)",
  "type": "TVSeries",
  "year": "2012",
  "items": [
    {
      "username": "Lightseven",
      "userUrl": "https://www.imdb.com/user/ur5028627",
      "reviewLink": "https://www.imdb.com/review/rw2632407",
      "warningSpoilers": false,
      "date": "24 June 2012",
      "rate": "10",
      "helpful": "443 out of 522 found this helpful.",
      "title": "Witness to genius",
      "content": "I've been watching television for all of my 57 years on the planet. It is a rare thing when I see a show that grabs me from the first moments and holds me to my chair until the very last, but this just happened tonight as I watched the first episode of The Newsroom. Brilliant writing, terrific characters, excellent dialog, smooth and sexy directing that organically brought all the pieces together, and there couldn't have been better casting. Every character just felt exactly right. When it was over, I said this will be the new West Wing. Jeff Daniels shines in this role and what a great opportunity to showcase his effortless acting. I can easily see major Hollywood \"A\" listers grabbing their telephone's right now making late Sunday night calls to their agents demanding they get a guest appearance on The Newsroom. I was hoping for good when I heard about this show last winter, but what was delivered was excellence. Well done HBO. You've got me hooked. Well done!"
    },
    {
      "username": "nikhil_taneja",
      "userUrl": "https://www.imdb.com/user/ur22935626",
      "reviewLink": "https://www.imdb.com/review/rw2633075",
      "warningSpoilers": false,
      "date": "26 June 2012",
      "rate": "10",
      "helpful": "411 out of 489 found this helpful.",
      "title": "Critics be damned! Welcome back, Sorkin!",
      "content": "In the tradition of his earlier 'behind-the-scenes of TV' shows, Aaron Sorkin's The Newsroom takes a hard (and witty) look at the behind the scenes of cable news. And like all his other shows, The Newsroom deals as much with themes of honour, ethics, loyalty, idealism and love, as it does with the news. It's also written in Sorkinese – Aaron Sorkin's fast-paced, back-and-forth, sing-song dialogue that'll leave you heady on a good day but with a headache on a bad one. So, like critics have lambasted, is it \"weighted too heavily toward sermonizing diatribes (LA Times)?\" Maybe. Does it \"choke on its own sanctimony (NY Times)?\" Perhaps. Is it \"yet another platform in which to Set the People Straight is a worthwhile purpose (Huffington Post)?\" Most definitely yes. But is this all really so horribly, terribly bad? NO! The main bone of contention for critics for this show seems to be that it tries too hard to be good, do good and instill good, just like all of Sorkin's earlier work. But when did that become a crime, in times of shows about becoming the next scrawniest supermodel, douchiest reality housemate or Tim Allen's 30th comeback? What's wrong with a show fantasizing about a world upheld by a long-forgotten morality in a time infested with shows that fall over each other to portray stark, grim realities and apocalyptic futures? The Newsroom's got a fantastic cast with enough charm to last you till the next Woody Allen movie. Emily Mortimer's already got me falling in love with her, Jeff Daniel makes you really root for him, John Gallagher Jr and Alison Pill have an instant chemistry and Sam Waterson's singularly enough to bring you back every week. Yes, it's longer than it needed to be, and yes, it could have done with a little more Noam Chomsky and a little less Don Quixote. But really, as long as it does what so few show can ever claim to together – rouse you, make you think and ENTERTAIN, bloody well at that – who's complaining? Admittedly, I'm a fan of Aaron Sorkin. I've seen (repeatedly) and LOVED Sports Night and The West Wing, and I think Studio 60 on the Sunset Strip is one of the best shows ever made. His writing has inspired me in the past, and after watching The Newsroom, I have all reasons to believe that it will continue to, well into the future. Critics be damned, watch this show simply because it's good television. It may not change the world, but at least it's trying to."
    },
    {
      "username": "Instant_Palmer",
      "userUrl": "https://www.imdb.com/user/ur39322316",
      "reviewLink": "https://www.imdb.com/review/rw3307426",
      "warningSpoilers": false,
      "date": "30 August 2015",
      "rate": "10",
      "helpful": "32 out of 38 found this helpful.",
      "title": "Sorkin Does TV Really Well - He \"Just Decided To\"",
      "content": "Aaron Sorkin has owned Television for the past 15 years. He just never misses.I've been on a Sorkin set ('West Wing'), the recipient of his quick barbed wit, and a witness to his working with actors and directors.His brilliance is legendary - when Aaron pulls up to the gas pump, there is a Sorkin octane choice...jet fuel. Spend even 5 minutes talking with him and you will be convinced of this. He is also radical, keenly focused, intensely in tuned to the nuances of others (picking up on voice inflection, body language, even physio clues), fiercely loyal, blatantly opinionated and quick barbed (he will call you out without hesitation and you best be on your A Game if you dare to engage), an optimist with a pragmatic foundation, a visionary and dreamer with chutzpah and a get-it-done (and done right) attitude, and as finely tuned no-fear mentality as I have ever witnessed in the entertainment field.Sorkin clearly has a vision of the world where right has might, intellect is the most valuable asset, one's ethics compass has no ambiguity (save for the complex journey and angst one must sometimes endure in getting to the right decision) - In Sorkin's world, those who care a lot about what they do, and how well they do it, earn the front row seat and get the best view.When Sorkin arrives on set, his presence is immediately felt...even the most seasoned actors respond to his attention like an adoring offspring. I am certain Sorkin just being on set raises the level of every actor. His \"hardware collection\" (and that of actors and crew) is a testimony to his brilliance in bringing out the best in others.The Newsroom is a tour de Sorkin. Only a three year run, but that in itself is so Sorkin - do it right or not at all and get out on top. How many TV dramas get past three years without noticeable decay?This is my favorite of all Sorkin creations. Verbal excess has killed many a TV show. The Newsroom thrives on it. What could have been perceived as sanctimonious, is inspiring. The often frenetic pace (always under pressure and deadlines), gives the perception you've just watched a perfectly paced two-hour movie somehow shrunk to one hour, and you cannot wait to see the sequel.Watch this series from Episode one on. I've purposely NOT seen the extra behind the scenes bits or trailers. Maybe another time. The show is so good, I don't need reinforcement of it.This series sucks you in from the first episode and never lets you escape its gravity - HIGHLY recommended viewing.Bravo to the entire cast and crew, with obvious special acknowledgment to Jeff Daniels for his believable and inspirational portrayal of the ideal prime time news anchor. He brings the Sorkin vision and communication style to life, and his performances are brilliant and inspiring.HBO's 'The Newsroom' is a must-see TV series."
    },
    {
      "username": "gradyharp",
      "userUrl": "https://www.imdb.com/user/ur3223254",
      "reviewLink": "https://www.imdb.com/review/rw2632902",
      "warningSpoilers": false,
      "date": "25 June 2012",
      "rate": "10",
      "helpful": "143 out of 197 found this helpful.",
      "title": "Brilliant, Briskly Intelligent Writing",
      "content": "A new series launched on HBO with a star-spangled episode 'We just decided to'. As conceived and written by Aaron Sorkin it is a timely, incredibly intelligently written show populated with some of our best seasoned actors as well as some very fine actors on the way up. This is the kind of television that reminds us that at one time the news programs informed us about current events and ran a continuing commentary on the development of events in this country and around the world in a manner that kept us alerted of why we as a nation needed to remain alert to both good and bad events, to celebrate when indicated and to fight back when injustices were occurring. This direction is indicated in the background imagery for the titles – running glimpses of the likes of Walter Cronkite, Edward R Murrow, Huntley/Brinkley etc who were responsible news anchors instead of the flippant celebrities more concerned with ratings of their show than the news we see today.The first episode opens with popular news anchor Will McAvoy (Jeff Daniels who proves his acting chops here) being interviewed on a college campus and responds to a student question 'Why is America the greatest country' by answering 'We're not. We used to be' and then runs us past our history of reportage on television that proves that the country has fallen in world view because we no longer care about our initial basic rites an freedoms and concern for humanity. It is a powerful start with some of the most gut-wrenching insightful history of this country that has been written for television.From there, McAvoy returns to his station to find a support team missing and a replacement named. But enter an old flame, the war correspondent fatigued Mackenzie MacHale (Emily Mortimer, never more brilliant) who has been assigned Will's new Executive Producer and in the midst of many changes the new arrangement (not a popular one for Will) evolves into a return to actual news reporting of the significant type – all over the 2010 BP oil explosion and spill that threatened the Gulf of Mexico. It is raw, real, factual, and immediate news delivered with veracity and commitment.Greg Mottola directs with keen precision, allowing moments of comic relief to be present if subtle and keeps the momentum of the show propelling smoothly. The cast of superb actors includes John Gallagher, Jr. (brilliant), Dev Patel, Allison Pill, Sam Waterston (never better), Thomas Sadoski, Chris Chalk, Trieu Tran, Charlie Weirauch, Margaret Judson, Olivia Munn, Adina Porter – and more. A more talented and committed cast would be hard to imagine. THIS is the kind of television series we so very sorely need right now. It is refreshingly free of the usual clatter and gimmicks that clutter the airways, and it s full of information and food for thought delivered in an entertaining manner. And this is only Episode 1! Grady Harp"
    },
    {
      "username": "blanche-2",
      "userUrl": "https://www.imdb.com/user/ur0342623",
      "reviewLink": "https://www.imdb.com/review/rw3434034",
      "warningSpoilers": false,
      "date": "19 March 2016",
      "rate": "9",
      "helpful": "13 out of 15 found this helpful.",
      "title": "I liked it, so sue me.",
      "content": "Boy, some people did not like this show.Someone here said the first five minutes of the pilot were fabulous (I'm paraphrasing) and then it was downhill from there.This is what makes the world go round. In the beginning, I found \"Newsroom\" too chaotic. I wasn't connecting with the characters and it was all too much.Then I really got into it, and I found it fantastic. I loved the acting and the characters, and I don't understand why it went off the air. I also loved the witty dialogue, and I liked the fact that it showed the interpersonal relationships within the newsroom as well as out. The whole Genoa thing was particularly chilling, when you absolutely know what's going on - fascinating to watch.This is an Aaron Sorkin show, along the lines of The West Wing. And what actors - Sam Waterston, Jane Fonda, Jeff Daniels, Emily Mortimer, Allison Pill, Marcia Gay Harden, everyone top-notch. Even though I haven't been the age of most of the newsroom characters for many many years, I could still appreciate their lives and what they went through.How bad can something with Sam Waterston in it be, I ask myself. Certainly worth checking out."
    },
    {
      "username": "mynexthome",
      "userUrl": "https://www.imdb.com/user/ur25668058",
      "reviewLink": "https://www.imdb.com/review/rw3137820",
      "warningSpoilers": false,
      "date": "7 December 2014",
      "rate": "10",
      "helpful": "69 out of 79 found this helpful.",
      "title": "Over, but not forgotten",
      "content": "Maybe I am just coming into adulthood after my 45 years, but The Newsroom has always been food for thought. The pace, direction and writing has been excellent. I have watched and re-watched every episode over the past 3 seasons and really can't understand why they would cancel this show for the ages. First I was not a person that watched West Wing. I was younger and dumber for the show to stick. this show grabbed me from the get go and I have never been more surprised with it's greatness.HBO - why oh why are buying into the big network belief that the public is not getting what you bring us. This show is why I subscribe to your network and seeing it leave is a shame. The past episode \"Oh Shenandoah\" was brilliant is so many ways. It left me thinking about my father and how we can challenge ourselves in moments of being tested. I came here to tell everyone I will watch the last episode with sadness and wish I could continue this great program going forward, but it's over. I will save these three seasons and remember every episode with fondness and hope to see these great actors, directors and writers in the future where they can continue to express themselves without worrying about ratings or money driven desires.Thank you for 3 great seasons!"
    },
    {
      "username": "Filmbrewer",
      "userUrl": "https://www.imdb.com/user/ur24774459",
      "reviewLink": "https://www.imdb.com/review/rw2632574",
      "warningSpoilers": false,
      "date": "25 June 2012",
      "rate": "9",
      "helpful": "174 out of 227 found this helpful.",
      "title": "Brilliant and Challenging",
      "content": "Rarely does a television show come along and sweep you off your feet with brilliant writing, an amazing cast and an actual message that is relevant and inspirational. Aaron Sorkin has done it again with The Newsroom! This show is truly a display of what television can achieve if we have the right people who are willing to break the rules of the mundane drab to make an engaging and intelligent show. Jeff Daniels plays Will McAvoy, the cautious, veteran news anchor tiptoeing with his career in order to \"play it safe\", concerned more with keeping his ratings than stepping on toes. He has the smarts, the background and the ability to be something more, a challenger of beliefs and a defender of ideals, but lacks the motivation until Mackenzie MacHale (played beautifully by Emily Mortimer), a woman from his past, reenters his life. She is the spark to ignite his flame and gets him burning with an unquenchable passion once again.Within the first five minutes of the show, Jeff Daniels delivers a speech of Aaron Sorkin's words about the state of America that is extremely touching, stimulating and brutally true for a vast majority of the population. It's reminiscent of his West Wing days, but with even more flare and aggression. I only hope he can keep the pace that he has set with the pilot; the bar is set high."
    },
    {
      "username": "rakkirakkason",
      "userUrl": "https://www.imdb.com/user/ur34617978",
      "reviewLink": "https://www.imdb.com/review/rw2632834",
      "warningSpoilers": false,
      "date": "25 June 2012",
      "rate": "10",
      "helpful": "712 out of 819 found this helpful.",
      "title": "I signed up for IMDb solely to give this show 10 stars",
      "content": "I have never felt as driven to make sure other people understood just how perfect a show was. Not for Game of Thrones, Firefly, Sopranos or any of the other shows I obsess about. But this show changed that! This show boils down everything that is wrong with America and puts out a simple answer to solving that. DO THE BLOODY NEWS LIKE IT'S NEWS NOT A HIGH SCHOOL PROM ELECTION! Jeff Daniels is perfect in his role as the tired beaten down journalist that just doesn't give a damn about anything anymore, but used too. And we can see the spark that ignites him to become great again. Why aren't real reporters like this? Why oh why? If this show get's cancelled I will camp out in front of HBO HQ and not leave till the last Game of Thrones series comes out (because I have to get on with my life at some point). This was my first review ever on IMDb, all because of this amazing show! You better watch it as well!"
    },
    {
      "username": "henryshear",
      "userUrl": "https://www.imdb.com/user/ur89269798",
      "reviewLink": "https://www.imdb.com/review/rw5605171",
      "warningSpoilers": false,
      "date": "4 April 2020",
      "rate": "9",
      "helpful": "14 out of 17 found this helpful.",
      "title": "Fascinating Examination of Journalistic Ethics Juxtaposed with Witty Writing!",
      "content": "I had attempted to watch the West Wing, but found it to be too dated. Newsroom was my second attempt to watch an Aaron Sorkin show. I absolutely fell in love with some of the characters, most notably Will McAvoy and Jim Harper.The writing is absolutely brilliant. The dialogue is very witty and creates some fun situations. There are several comedic moments in the show while balancing massive news stories such as Deepwater Horizon or the assassination of OBL. What I love most is how often Don Quixote comes into play through dialogue.The premise of the show is to report the news the correct way, not through calling attention to reality TV stars or a celebrity feud. Don Quixote and his mission to civilize is a frequent presence of the show. I identify far too much with Will McAvoy. Will is fiercely loyal, protective and can be a bit of an ass. Will was fine reporting stories that were not necessarily newsworthy until his former flame MacKenzie McHale (Emily Mortimer) arrives as the new EP for his show. Mac forces and encourages him to report the actual news to the public. Will takes it upon himself to educate viewers, but also gossip columnists and others who he deems do not know the actual news. The relationship between Mac and Will is one of the series best.Romance is a huge part of the show. There is a love between Will and Mac for the entirety of the series. I love Jim Harper (Josh Gallagher Jr.) though. He is kind, dorky and has the greatest bromance with Neal Sampat (Dev Patel). He also has a crush on fellow coworker Maggie Jordan (Alison Pill) and their chemistry is amazing.Lastly, I was shocked to find the number of terrible reviews from numerous media outlets. The show does hope to change the way Americans view the news. The news does frequently mention the latest celebrity scandal and does not educate. The series hopes to fill that void. I believe that The NY Times, LA Times and others felt threatened by exposing the inner workings of a news station. I loved the show because it shows the idiocy of politicians, governmental mistakes and other key issues. Although, if you are conservative I do advise against watching the show.I was very sad watching the series finale. I felt very close to some of the characters which is not something that happens to me very often. The series ends beautifully and I feel the series is so important as a whole. I wish the show was still continuing in the age of fake news, but I am thankful it was on for as long as it was. I found myself laughing, deep in thought and learning. I definitely recommend this!!!"
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw3635378",
      "warningSpoilers": false,
      "date": "8 February 2017",
      "rate": "9",
      "helpful": "14 out of 18 found this helpful.",
      "title": "Room filled with News",
      "content": "We actually need this back badly (not \"bigly\", though if that word existed that too). It's 2017 and especially season 1 resonates more than well and could've fitted right in. Anyone could predict the direction things were taking, but both parties could not stop it. For better or worse America has a president now who'd accuse the Newsroom of being Fake News. They're not (mostly that is) and they actually have something to tell.The show is more than well written and sometimes slips into straight out comedy (almost stand up situations), but it works well (\"welly\"?). The very first season and especially the very first scene is amazing and warrant a 10/10. The following 2 seasons fall shorter, not by much (unless you count the number of episodes in each) but that's why I decided to go with 9/10. Still more than amazing and maybe one of the best shows made in the 21st century. If you don't mind it's very \"talky\" mindset, you will love it"
    },
    {
      "username": "treehuggie-15653",
      "userUrl": "https://www.imdb.com/user/ur111214181",
      "reviewLink": "https://www.imdb.com/review/rw5457416",
      "warningSpoilers": false,
      "date": "3 February 2020",
      "rate": "10",
      "helpful": "33 out of 38 found this helpful.",
      "title": "BEST SHOW I HAVE EVER SEEN",
      "content": "I can not express how much this show means to me. I cried my eyes out. I could not stop watching this show, I don't understand why there is only three seasons. It is the best show I have ever seen before"
    },
    {
      "username": "steph_jt",
      "userUrl": "https://www.imdb.com/user/ur16441288",
      "reviewLink": "https://www.imdb.com/review/rw2632627",
      "warningSpoilers": false,
      "date": "25 June 2012",
      "rate": "10",
      "helpful": "136 out of 189 found this helpful.",
      "title": "Sensational!",
      "content": "I've been waiting for what seems like forever for a top notch show to present itself, and I truly feel this is it. To say the first show was riveting is a gross understatement. As a news show, this fictitious newsroom had me planted on the edge of my seat, and when things finally got going, I found myself fidgeting and wide-eyed waiting for what came next. I have to say the leads in this show have amazing chemistry, the sort of chemistry that usually takes several shows to develop, yet here it was, in spades no less. It's easy to believe that I'm overstating this, but I truly believe this show has the potential for greatness, and believe me, I'm normally a fairly harsh critic, but in this case I feel completely justified in touting this as the next great show. There's some great social commentary on offer here, while not exactly new, it's offered up in a far more palatable fashion than the usual polarised and emotional manner. Needless to say, I implore all to watch this first episode, as it was so good, it could have been stretched another 30 minutes to become a great movie. The fact that we get more, is the icing on the cake. I can only hope the writers can keep producing scripts near the same level as this one. 5 stars, or 10 out of 10. Watch it!"
    },
    {
      "username": "squirrelsheryl",
      "userUrl": "https://www.imdb.com/user/ur34606559",
      "reviewLink": "https://www.imdb.com/review/rw2632595",
      "warningSpoilers": false,
      "date": "25 June 2012",
      "rate": "",
      "helpful": "248 out of 314 found this helpful.",
      "title": "It is great to have him back",
      "content": "I am watching it for a second time. All of the critics are acting as if Aaron Sorkin kicked dirt in their faces. The critics said nothing of substance- just vitriolic rants. Maybe Sorkin has hit a nerve. In a sea of crap T.V. this is entertaining. Believe me, we all know that the Newsroom characters are no more realistic than President Bartlet or Sam or Toby, Josh,Leo, C.J., Josh, or Donna. I don't think for one minute that the President of the United States has a secretary who doles out cookies, but I desperately need to believe that we are capable of being all of these characters. I desperately need to be quixotic for an hour a week."
    },
    {
      "username": "itsoferrall",
      "userUrl": "https://www.imdb.com/user/ur98781455",
      "reviewLink": "https://www.imdb.com/review/rw6279272",
      "warningSpoilers": true,
      "date": "17 November 2020",
      "rate": "9",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Can we please bring this show back?",
      "content": "The show ended when it could have gone another season. I love the 3 seasons that they did. I pray they bring this show back. They can base it on Wills new family."
    },
    {
      "username": "mjorgensen62-40-114257",
      "userUrl": "https://www.imdb.com/user/ur25942821",
      "reviewLink": "https://www.imdb.com/review/rw2632610",
      "warningSpoilers": false,
      "date": "24 June 2012",
      "rate": "10",
      "helpful": "100 out of 153 found this helpful.",
      "title": "Hot new show",
      "content": "THIS IS THE MOST EXCITING SHOW I HAVE SEEN ON T.V. SINCE \"THE WEST WING.\"I used TWW because, yes, this too is an Aaron Sorkin tour-de-force.Imagine your most idealized concept of how news SHOULD be reported. Now, imagine any news service (network or cable) who would actually report the news. Now, put someone in charge who will clean house and hire people who will actually do their jobs, without regard to ratings or demographics.Aw, forget it. That only happens on T.V. Usually HBO. Wait!! This IS HBO!! And, when that oil rig in the gulf blows out, only a couple of people see the true potential of the consequences of that explosion. And they just happen to be well-connected enough to get on-the-record statements from people who are in positions to know what they're talking about. Like the people who would become known to all of us soon while the greatest oil spill in history gets out of control, but also gets spun to everyone's benefit.But this show is NOT about the spill. It's about a group of highly- qualified people coming together to produce a news show that actually dispenses NEWS. I have great hope for future episodes. I even watched this first episode twice. Great show."
    },
    {
      "username": "leftbanker-1",
      "userUrl": "https://www.imdb.com/user/ur20309759",
      "reviewLink": "https://www.imdb.com/review/rw5890656",
      "warningSpoilers": false,
      "date": "8 July 2020",
      "rate": "10",
      "helpful": "10 out of 15 found this helpful.",
      "title": "One of a Kind (sounds trite but it really is)",
      "content": "I re-watched this series in lock-down. I enjoyed it and wrote the slightly unforgiving review (below this paragraph). Only when I went looking for something else to follow this series did it dawn on me how brilliant The Newsroom really is. I defy you to find another series geared for adults that attempts to raise our collective level of discourse, that constantly tries to uplift viewers and make them feel better about the world. What you mostly find is TV completely lacking in quality, or violent crime dramas. I love violent crime dramas, but they fail miserably in the \"raise our collective level of discourse\" test.Apart from the corny love interests, they leaned heavily towards the maudlin whenever the chance arose, and if it didn't, they would pound it into the story like they were driving a railroad spike into viewers collective skulls.The British chick is all wrong. They say she's American but her father was a diplomat. What? She would absolutely have an American accent. They wanted her to be highly intelligent and I think many American have an inferiority complex when it comes to British accents (I don't suffer from this malady) so the casting department chose her for her accent alone. You can't really act intelligent, and few actors can pull this off, probably because they are fairly bright to begin with. I don't mean to disparage the actor who plays Makenzie, but I wasn't exactly over-powered by her intellect.What the show has in its favor (among many other things) is excellent direction and mostly flawless and outstanding acting, something I mostly find missing in foreign TV. The editing is always perfect so you never feel like you are staring at something or someone for no reason."
    },
    {
      "username": "darth_trek",
      "userUrl": "https://www.imdb.com/user/ur13557930",
      "reviewLink": "https://www.imdb.com/review/rw7576026",
      "warningSpoilers": false,
      "date": "23 November 2021",
      "rate": "10",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Sorkin at his best",
      "content": "This is Aaron Sorkin at his best. For me it is probably the best TV show I've ever seen. Big call I know. I can't tell you the number of times I've watched the series through. The very first scene is just pure artistry both Erin men and acted by the legend Jeff Daniels. The rest of the casts performances are of equal grandeur. The story arcs are riveting with season 2 masterful. Do yourself a favour and watch this."
    },
    {
      "username": "Amadio",
      "userUrl": "https://www.imdb.com/user/ur3043469",
      "reviewLink": "https://www.imdb.com/review/rw2677893",
      "warningSpoilers": false,
      "date": "23 September 2012",
      "rate": "2",
      "helpful": "74 out of 138 found this helpful.",
      "title": "Children in big bodies",
      "content": "First of all I know this is American drama and that emotions are a key component of such products. Second, I expect the characters to be somewhat believable and somewhat likable. While most comments on IMDb that dislike this program are about the perceived left-wing bias, my criticism is that all the characters seem to be on day-release from intense psychotherapy. If they are not, they certainly should be getting therapy. Everybody seems unable to deal with who they are, and what others do around them. Everyone gets upset at the slightest action of another. Everyone is either maudlin, fearful, or angst-ridden. They have the emotional response of emo teenagers. And this does not for good drama make. You have to care about characters in order to be involved and feel for them. Instead, we are subjected to children in big bodies who are eminently unlovable. This is the worst of American drama. While I understand that HBO made this for an American audience, it is so self-absorbed as to make Paris Hilton look positively interesting. The newsroom? Oooh! Television! Wow. And people get upset! Fascinating. And there are real stories as well. I mean real stories! How can you not want to watch it? It's not even boring, it's painfully masturbatory. It is so full of its own self-importance as be an exercise in politics. While some might like it because it is 'socially relevant' the script means that you are constantly being subjected to trauma. Ugh!"
    },
    {
      "username": "JohnRayPeterson",
      "userUrl": "https://www.imdb.com/user/ur24880647",
      "reviewLink": "https://www.imdb.com/review/rw2846272",
      "warningSpoilers": true,
      "date": "6 August 2013",
      "rate": "9",
      "helpful": "8 out of 12 found this helpful.",
      "title": "Interesting characters and moral dilemmas. Excellent.",
      "content": "Beyond the IMDb storyline, you need to know the series takes that new team of smart, highly motivated driven news people through their paces, bringing us into the newsroom and in the network back-offices. The team is lead by MacKenzie McHale, played by Emily Mortimer, a very experienced news person, who's also a former girlfriend of the anchor Will McAvoy, played by Jeff Daniels. Their history is something that ought to have made it impossible for them to work together, yet here they are working as professionals do, overcoming the past; well that's not quite it, but the bumps in the road, make for interesting dynamic. The lead character, does not eat up most the screen time (after 14 episodes that's clear) and so we have plenty of other characters to find interesting and become addicted to, just as Sorkin did with West Wing. By the way, Will does most everything one could imagine would make you despise him, but his experience, wit and intellect keeps you engaged. Daniels is just outstanding in this role.Charlie Skinner, played by Sam Waterston, is Will's boss, an executive who has a very non-executive view of things and cares very much about his new news team, to a fault. I just love Waterston in this role, more than I did when he had his long run on Law & Order; the dialogue for him is so much more interesting and ordinary person, refreshing. There are too many characters for me to go down the line, but one thing is sure, there are some for most every picky viewer to like and dislike, starting with the occasional appearances of Jane Fonda as the network owner. The series, now in its second season, already shows ratings increase humble as it may be, and user reviews are still strong both on IMDb and Metacritic. The critics though, for reasons I'll attempt to explain, have not shared the public enthusiasm. From the critics reviews I've read, the displeasure stems from such things as, unrealistic portrayal of one thing or another and they go on to explain those reasons in details. A series is not a movie, and viewers make up their own opinions based on whether they like what they see and hear. The series West Wing, another Aaron Sorkin production, also did not fare well with the critics but nonetheless scored big with audience and won awards to boot. I see the pattern repeating, which may be good news for Sorkin. The audience was in both cases moved by the characters depicted. And this is probably why critics and viewers don't see eye to eye; us viewers are quite content with interesting and engaging characters, we don't need all our 'i's dotted, 't's crossed and every details to be real if there's humour, drama and moral questions left for us to ponder.The stories the newsroom covers is a mix of recent past events and make believe ones, so there's something for the viewers to relate to on many of what the crew covers. I'll likely edit this review at the end of season two, but I trust I'll feel just as I do now, a fan, a happy one."
    },
    {
      "username": "ibiggmikei",
      "userUrl": "https://www.imdb.com/user/ur5395838",
      "reviewLink": "https://www.imdb.com/review/rw2632404",
      "warningSpoilers": false,
      "date": "24 June 2012",
      "rate": "9",
      "helpful": "127 out of 184 found this helpful.",
      "title": "Future Emmy Winning Show",
      "content": "I watched this show after watching True Blood, which I watch out of habit on Sunday nights with my wife. I am SO glad we kept HBO on. I remember hearing about this show from different promos and snippets of interviews on the computer, but wow. Aaron Sorkin leaves his mark all over this show, right from the intro, which was very reminiscent of The West Wing right until the ending. Fantastic creation by him.Without mentioning any spoilers, the show is about a news anchor (Jeff Daniels) who is beloved by his viewers but not so much by his co-workers and employees due to his aloofness, biting sarcasm, and general malaise. His character has a turning point in the opening scene and it is phenomenal. The writing, acting, cinematography, and tempo of the show are excellent. I fell in love with it right away. And how great is Sam Waterson on this show? I hope that this show has a domino effect and REAL news anchors take note and feel inspired. Hopefully, this show may lead to REAL NEWS STORIES by REAL NEWS ANCHORS. 9/10. Emmy's are DEFINITELY in this show's future."
    },
    {
      "username": "pmazza3",
      "userUrl": "https://www.imdb.com/user/ur30641463",
      "reviewLink": "https://www.imdb.com/review/rw5815003",
      "warningSpoilers": false,
      "date": "11 June 2020",
      "rate": "9",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Terrific",
      "content": "I'm just a sucker for anything Sorkin. I thought The Newsroom was terrific and it's a shame there are only 25 episodes. Great acting by all involved and I loved the breaking news stories and their approach. On another note I have watched at least twice all the episodes of Studio 60. The best show no one ever saw."
    },
    {
      "username": "Royson58",
      "userUrl": "https://www.imdb.com/user/ur3321190",
      "reviewLink": "https://www.imdb.com/review/rw2827979",
      "warningSpoilers": false,
      "date": "8 July 2013",
      "rate": "7",
      "helpful": "24 out of 39 found this helpful.",
      "title": "Good, but slanted",
      "content": "The general idea of the show is easy to sum up: cable TV \"news\" shows have been doing a poor job educating the American electorate, focusing on ratings (which means focusing on entertainment). Sounds great.Also understand there is another premise: Liberal arguments are correct and factually based, Conservative arguments are incorrect, and only rely on emotion. Basically, FOX News, turned 180 degrees, and with as nasty attitude towards the opposition as Sean Hannity. Just as \"Fair and Balanced\". Stereotypes abound.A close examination of the personal stories will show the greatest weakness. Relationships are just too complicated for too long. And instead of getting resolution, you get more complications. And just like previous stated about the lone Republican doing nothing like a Republican, the one \"Christian\" has only gotten mad at other Christians, and never stood up for any \"Christian value\" that could be deemed controversial (between numerous drunken spells and booty calls)."
    },
    {
      "username": "sajakram",
      "userUrl": "https://www.imdb.com/user/ur104320449",
      "reviewLink": "https://www.imdb.com/review/rw6979286",
      "warningSpoilers": true,
      "date": "29 May 2021",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Great Show, Superb writing",
      "content": "Very sharp and intelligent writing and well executed all round. Shame it was only 3 seasons, could have done with at least a couple more really. Loved the characters and how they developed.And for once a proper series finale, beautifully wrapped up.Well done to all involved."
    },
    {
      "username": "cliffmacdev",
      "userUrl": "https://www.imdb.com/user/ur49227379",
      "reviewLink": "https://www.imdb.com/review/rw3049527",
      "warningSpoilers": false,
      "date": "13 July 2014",
      "rate": "10",
      "helpful": "8 out of 11 found this helpful.",
      "title": "The Best Television Ever!",
      "content": "This is one of the best television programmes I've ever seen. Mr. Sorkin needs to be lauded for the brilliance of the subject matter and the style used to convey it! This series ranks with Yes Prime Minister and The West Wing. Only David Kelly's Boston Legal comes close. He singles out both of the political parties using current events and dissects the crux of the underlying problems. It appears one sided against the GOP but they do have more loonies. They also have far more entertaining characters than the Democrats. I find it amazing that it it only has one more season and scary, that viewers aren't clamoring that such excellent telly can be finished. This is Jeremy Paxman good! What an amazing country America is, that can have such contrasting television. Jerry Springer, Kardashians and programmes like The Newsroom. I looked at the Wikipedia reviews from the critics and it always baffles me, that such obviously inferior intelligences, have the gall to criticize someone like Sorkin. It's impossible for brilliant people like Sorkin to include Springer intellectual themes, but that is exactly what some of the critics are suggesting. Surely, they are aware of the show's subject matter and the audience aimed at, who would balk at such paltry programming? I have no criticisms and I am immensely grateful to be both educated and entertained and can only wish for more television of this nature!Sorkin's perspectives and passion are what makes these shows so utterly fascinating. Americans are not familiar with Jeremy Paxman so are really unaware what brilliant broadcasting is and also what truly intelligent people crave. Sorkin delivers in spades. These are the intellects that dissect mass media and show what's relevant. Ignorant people need this as importantly as good role models are to children. Thinking has to be directed or ultra right wing perspectives will flourish. It's such a pity this series will be ending, he will be sorely missed and television will be a much more diminished forum!I'm currently watching the third series and it just gets better with every episode. I think based on humanitarian reasons, Mr. Sorkin needs to reconsider. America desperately needs you. You never sell out and you address pertinent issues like no one can. So many are imbeciles and need your educational entertainment to flourish. You need to think of the youth of America and not just yourself Mr. Sorkin. They need you and so does America!"
    },
    {
      "username": "inframan",
      "userUrl": "https://www.imdb.com/user/ur0097195",
      "reviewLink": "https://www.imdb.com/review/rw2636256",
      "warningSpoilers": false,
      "date": "2 July 2012",
      "rate": "1",
      "helpful": "48 out of 106 found this helpful.",
      "title": "Getting old fast",
      "content": "Sadly, this show is getting old very fast. Do they really think speed-talking makes this show more hip? Half the characters in Newsroom sound like outtakes from The Social Network. Rapid-fire banter does not a His Girl Friday make. More like Social Network meets Broadcast News.What's with the network soap subplots of office gossip on which boss cheated on whom. Who cares in this day & age? Only the chemistry between Will & Charlie (Sam Waterston) works at this point. When either or both characters are not on-screen, the dialog sounds like tweet rehashes of NY Times front page clichés (student debt, high rent housing for 20-somethings) better handled in Girls. Maggie's goofy self-righteous quirkiness competes with Mac's whininess for irritation points.Come on, what topics could be more tedious for a prime-time HBO show than how a network newsroom covers the BP spill (last year's news) or Will & Mac's (surrogate mom & dad of the newsroom crew) sexual history? Jokes (comedy situations) dependent on educated adults in a high-tech media organization incapable of correctly typing & sending e-mails? Excuse me? Too bad Julia Louis-Dreyfus was committed to Veep. She might have given this series the humor & nuance it sorely lacks. Plus her chemistry with Jeff Daniels could have been terrific.ADDENDUM - 7/17/2012I have had it with this inexcusably derivative series. It's funny to read the reviews claiming how fresh this show is because it deals with \"contemporary\" issues when the \"issues\" are actually 2+ years old which in TV news years is about 30-something.The cutesy stuff between 50+ sad-sack Daniels & whiny (& strangely humorless) Mortimer only gets more grating in each episode. But the worst part is the dialog tossed about by the newsroom crew, standard & very tired baggage of adolescent misunderstandings, unrequited love & goofy non-sequiturs.The humor on this show sounds & feels like out-takes from early 1960s Beach party movies. If Bud Lite is your favorite drink, you'll love this show. Personally, I'm tired of the dumbing down."
    }
  ],
  "errorMessage": ""
}