{
  "imDbId": "tt1870479",
  "title": "The Newsroom",
  "fullTitle": "The Newsroom (TV Series 2012–2014)",
  "type": "TVSeries",
  "year": "2012",
  "language": "en",
  "titleInLanguage": "The Newsroom (American TV series)",
  "url": "https://en.wikipedia.org/wiki/The_Newsroom_(American_TV_series)",
  "plotShort": {
    "plainText": "The Newsroom is an American political drama television series created and principally written by Aaron Sorkin that premiered on HBO on June 24, 2012, and concluded on December 14, 2014, consisting of 25 episodes over three seasons.\r\nThe series chronicles behind-the-scenes events at the fictional Atlantis Cable News (ACN) channel. It features an ensemble cast including Jeff Daniels as anchor Will McAvoy who, together with his staff, sets out to put on a news show \"in the face of corporate and commercial obstacles and their own personal entanglements\". Other cast members include Emily Mortimer, John Gallagher Jr., Alison Pill, Thomas Sadoski, Dev Patel, Olivia Munn, and Sam Waterston.\r\nSorkin, who created the Emmy Award-winning political drama The West Wing, had reportedly been developing a cable-news-centered TV drama since 2009. After months of negotiations, premium cable network HBO ordered a pilot in January 2011 and then a full series in September that year. Sorkin did his research for the series by observing several real-world cable news programs first-hand. He served as executive producer, along with Scott Rudin and Alan Poul.",
    "html": "<p>The Newsroom is an American political drama television series created and principally written by Aaron Sorkin that premiered on HBO on June 24, 2012, and concluded on December 14, 2014, consisting of 25 episodes over three seasons.</p><p>The series chronicles behind-the-scenes events at the fictional Atlantis Cable News (ACN) channel. It features an ensemble cast including Jeff Daniels as anchor Will McAvoy who, together with his staff, sets out to put on a news show \"in the face of corporate and commercial obstacles and their own personal entanglements\". Other cast members include Emily Mortimer, John Gallagher Jr., Alison Pill, Thomas Sadoski, Dev Patel, Olivia Munn, and Sam Waterston.</p><p>Sorkin, who created the Emmy Award-winning political drama The West Wing, had reportedly been developing a cable-news-centered TV drama since 2009. After months of negotiations, premium cable network HBO ordered a pilot in January 2011 and then a full series in September that year. Sorkin did his research for the series by observing several real-world cable news programs first-hand. He served as executive producer, along with Scott Rudin and Alan Poul.</p>"
  },
  "plotFull": {
    "plainText": "The Newsroom is an American political drama television series created and principally written by Aaron Sorkin that premiered on HBO on June 24, 2012, and concluded on December 14, 2014, consisting of 25 episodes over three seasons.\r\nThe series chronicles behind-the-scenes events at the fictional Atlantis Cable News (ACN) channel. It features an ensemble cast including Jeff Daniels as anchor Will McAvoy who, together with his staff, sets out to put on a news show \"in the face of corporate and commercial obstacles and their own personal entanglements\". Other cast members include Emily Mortimer, John Gallagher Jr., Alison Pill, Thomas Sadoski, Dev Patel, Olivia Munn, and Sam Waterston.\r\nSorkin, who created the Emmy Award-winning political drama The West Wing, had reportedly been developing a cable-news-centered TV drama since 2009. After months of negotiations, premium cable network HBO ordered a pilot in January 2011 and then a full series in September that year. Sorkin did his research for the series by observing several real-world cable news programs first-hand. He served as executive producer, along with Scott Rudin and Alan Poul.\r\nSeries overview\r\nThe 25-episode series is set behind the scenes at the fictional Atlantis Cable News (ACN) and revolves around anchor Will McAvoy, his new executive producer MacKenzie McHale, newsroom staff Jim Harper, Maggie Jordan, Sloan Sabbith, Neal Sampat, Don Keefer, and the head of ACN, Charlie Skinner.\r\nCast and characters\r\nMain cast\r\nJeff Daniels as Will McAvoy: the anchor and managing editor of News Night. A moderate Republican news anchor whose broadcast persona is characterized as unwilling to offend anyone. Known for being difficult to work with, his world is turned upside down when his ex-girlfriend MacKenzie re-enters his life with a plan to revamp his news broadcast.\r\nEmily Mortimer as MacKenzie \"Mac\" Morgan McHale: News Night's new executive producer and Will's ex-girlfriend, returning from 26 months as an embedded journalist overseas, MacKenzie strives to return ACN to the days of real news broadcasts. MacKenzie had an affair with her ex-boyfriend, Brian Brenner, during her relationship with Will. Mac graduated from Cambridge.\r\nJohn Gallagher Jr. as Jim Harper: Senior Producer who follows MacKenzie to News Night. At his new job, he develops feelings for Maggie.\r\nAlison Pill as Maggie Jordan: an eager, young associate producer of News Night. Formerly Will's somewhat inept personal assistant, she is appointed an assistant producer by MacKenzie. She has complicated personal relationships with Don and Jim.\r\nThomas Sadoski as Don Keefer: News Night's former executive producer who leaves for the new program on the network, Right Now with Elliot Hirsch, but continues to work with the News Night team in a variety of capacities. Plain-speaking and straightforward, but also quite insecure, Don begins to doubt his feelings for Maggie. Ultimately, he breaks up with her, encouraging her to go after Jim. He subsequently goes on to date Sloan.\r\nDev Patel as Neal Sampat: writer of Will's blog and electronic media expert who covered the London Underground bombings with a camera phone. Neal works with the team to develop the use of electronic media as part of the new format.\r\nOlivia Munn as Sloan Sabbith: an economist with two Ph.D.s, she presents an economic news segment on Will's show. Sloan is good at her job, but also very socially inept and prone to creating uncomfortable situations for herself and others. She develops feelings for Don throughout the show.\r\nSam Waterston as Charlie Skinner: Atlantis Cable News (ACN) president and retired US Marine. Charlie's role is to joust with Atlantis World Media owner Leona Lansing and her son, AWM president Reese Lansing, while defending the new News Night format.\r\nSupporting cast\r\nJane Fonda as Leona Lansing: CEO of Atlantis World Media (AWM), the parent company of ACN.\r\nAdina Porter as Kendra James: a booker for News Night.\r\nChris Chalk as Gary Cooper: an associate producer for News Night, and former TMI employee.\r\nChris Messina as Reese Lansing: president of AWM, and Leona's son.\r\nTerry Crews as Lonny Church: Will's bodyguard assigned to him after Will receives death threats. (season 1)\r\nKelen Coleman as Lisa Lambert: Maggie's roommate who dates Jim. (seasons 1–2)\r\nDavid Harbour as Elliot Hirsch: the anchor of Right Now, a new program on the network.\r\nJon Tenney as Wade Campbell: a Congressional candidate who briefly dates MacKenzie to boost his campaign through ACN. (season 1)\r\nDavid Krumholtz as Dr. Jacob Habib: Will's current therapist, who is the son of Will's original therapist. (season 1)\r\nHope Davis as Nina Howard: a gossip columnist for TMI, AWM's tabloid magazine. (seasons 1–2)\r\nStephen McKinley Henderson as Solomon Hancock: a man who tells Charlie how to blackmail Reese. (season 1)\r\nNatalie Morales as Kaylee: Neal's girlfriend whose father died on 9/11. (season 1)\r\nPaul Schneider as Brian Brenner: a writer for New York magazine whom Will hires for an all-access profile. MacKenzie cheated on Will with Brian during the first four months of their relationship. (season 1)\r\nMarcia Gay Harden as Rebecca Halliday: a litigator defending Atlantis Cable News against First Amendment-related cases. (seasons 2–3)\r\nHamish Linklater as Jerry Dantana: a senior producer from ACN's Washington bureau who fills in while Jim is on the campaign trail and brings the Genoa tip to MacKenzie's attention. (season 2)\r\nGrace Gummer as Hallie Shea: a reporter who is embedded with the Mitt Romney campaign. (seasons 2–3)\r\nConstance Zimmer as Taylor Warren: a spokeswoman for the Mitt Romney campaign. (season 2)\r\nAya Cash as Shelly Wexler: Occupy Wall Street advocate. (season 2)\r\nB. J. Novak as Lucas Pruit: a young, wealthy libertarian interested in buying ACN, whose views on citizen journalism clash with Charlie, Will and Mac's. (season 3)\r\nMary McCormack as Molly Levy: an FBI agent who is a friend of Mac. (season 3)\r\nClea DuVall as Lilly Hart: a whistleblower who leaks thousands of classified government documents. (season 3)\r\nJimmi Simpson as Jack Spaniel: an ethics professor who briefly dates Maggie. (season 3)\r\nPaul Lieberstein as Richard Westbrook: EPA vice-director. (season 3)\r\nDerek Webster as Rodger Hutchinson: an FBI agent. (season 3)\r\nBrian Howe as Barry Lasenthal: a Department of Justice officer who is able to arrest Will. (season 3)\r\nKeith Powell as Wyatt Geary: the new VP of human resources who wants to prove that Don is in a relationship with Sloan. (season 3)\r\nJon Bass as Bree Dorrit: the temporary substitute for Neal. (season 3)\r\nCo-stars\r\nMargaret Judson as Tess Westin: an associate producer for News Night.\r\nThomas Matthews as Martin Stallworth: an associate producer for News Night.\r\nJohn F. Carpenter as Herb Wilson: the control room head for News Night.\r\nTrieu Tran as Joey Phan: the graphics producer for News Night.\r\nWynn Everett as Tamara Hart: an associate producer and booker for News Night.\r\nCharlie Weirauch as Jake Watson: a switcher/board op for News Night.\r\nChasty Ballesteros as Tea: the bartender at Hang Chews, the karaoke bar frequented by the News Night staff. (seasons 1–2)\r\nSarah Scott Davis as Terry Smith: the anchorwoman of Capitol Report, the news bulletin from Washington following News Night.\r\nAlison Becker as Sandy Whiddles: a professional media source, seeking out involvement in \"kiss and tell\" stories for financial gain. (season 1)\r\nRiley Voelkel as Jennifer \"Jenna\" Johnson: a sophomore student Will encounters at Northwestern University, later hired as Will's assistant.\r\nJohn Hawkinson as Rudy: a control-room tech whiz on News Night. (season 3)\r\nFrank Cermak as Luke. (season 3)\r\nProduction\r\nDevelopment\r\nEntertainment Weekly reported in April 2009 that Sorkin, while still working on the screenplay for The Social Network, was contemplating a new TV drama about the behind-the-scenes events at a cable news program. Sorkin was the series creator of Sports Night and Studio 60 on the Sunset Strip, both shows depicting the off-camera happenings of fictional television programs. Talks were reportedly ongoing between Sorkin and HBO since 2010. In January 2011, Sorkin revealed the project on BBC News.\r\nTo research the cable news world, Sorkin had been an off-camera guest at MSNBC's Countdown with Keith Olbermann in 2010 to observe the show's production and quizzed Parker Spitzer's staff when he was a guest on that show. He also spent time shadowing Hardball with Chris Matthews as well as other programs on Fox News and CNN. Sorkin told TV Guide that he intended to take a less cynical view of the media: \"They're going to be trying to do well in a context where it's very difficult to do well when there are commercial concerns and political concerns and corporate concerns.\" Sorkin decided that rather than have his characters react to fictional news events as on his earlier series, The Newsroom would be set in the recent past and track real-world stories largely as they unfolded, to give a greater sense of realism.\r\nHBO ordered a pilot in January 2011 with the working title More as This Story Develops. The Social Network's Scott Rudin signed on as executive producer. Rudin's only previous television work was the 1996 spin-off series Clueless. By June, Jeff Daniels, Emily Mortimer, Sam Waterston, Olivia Munn, and Dev Patel were cast, while Greg Mottola had signed on to direct the pilot. The pilot script was later reportedly obtained by several news outlets.\r\nOn September 8, 2011, HBO ordered a full series starting with an initial 10-episode run with a premiere date set for summer 2012. A day after the second episode aired, HBO renewed the series for a second season.\r\nSorkin said in June 2012 that The Newsroom \"is meant to be an idealistic, romantic, swashbuckling, sometimes comedic but very optimistic, upward-looking look at a group of people who are often looked at cynically. The same as with The West Wing, where ordinarily in popular culture our leaders are portrayed either as Machiavellian or dumb; I wanted to do something different and show a highly competent group of people.\"\r\nSeries title\r\nWhile the pilot was in development, the project was tentatively titled More as This Story Develops. On November 29, 2011, HBO filed for a trademark on \"The Newsroom\" with the U.S. Patent and Trademark Office. The new name immediately drew comparisons with the Ken Finkleman-created Canadian comedy series of the same name that aired on CBC and public television stations in the U.S. The series' name was confirmed as The Newsroom in an HBO promo released on December 21, 2011, previewing its programs for 2012.\r\nWriting in Maclean's, Jaime Weinman said the choice of name was \"a bit of a grimly amusing reminder that the U.S. TV industry doesn't take Canada very seriously ... The Newsroom is often considered the greatest show Canada has ever produced, but a U.S. network feels no need to fear unflattering comparisons: assuming they've heard of the show, they probably think most people in the States have not heard of it.\" In an interview with The Daily Beast following the Sorkin show's premiere, Finkleman revealed that HBO did contact him for permission to reuse the title, which he granted.\r\nCasting\r\nJeff Daniels was cast in the lead role in March 2011. Alison Pill and Olivia Munn reportedly entered negotiations to star in April 2011. The fictional executive producer role was initially offered to Marisa Tomei, but negotiations fell through. Tomei was replaced by Emily Mortimer in May 2011. Sam Waterston also joined the project in May. John Gallagher Jr., Thomas Sadoski, and Dev Patel were added to the cast in June 2011.\r\nNew York magazine reported that Sorkin had planned for MSNBC host Chris Matthews and Andrew Breitbart to appear in a roundtable debate scene in the pilot; however, the idea was shot down by MSNBC purportedly because the network was displeased with the corporate culture portrayal of cable news and skewering of left-leaning media in the show's script. Chris Matthews' son, Thomas, joined the cast in the role of Martin Stallworth, an associate producer for the fictional show.\r\nThree months after the series was picked up, Jane Fonda signed on to play Leona Lansing, the CEO of the fictional network's parent company. Fonda was married to Turner Broadcasting System and CNN founder Ted Turner for 10 years. Lansing was touted by some observers as a female version of Fonda's ex-husband. The name \"Leona Lansing\" is taken from the names of two highly successful businesswomen, real estate developer Leona Helmsley and former Paramount Pictures CEO Sherry Lansing.\r\nJon Tenney guest-starred as Wade, MacKenzie's boyfriend. Natalie Morales has a guest role as Kaylee, Neal's girlfriend. Terry Crews plays Lonny, Will's bodyguard.\r\nRosemarie DeWitt was originally cast as Rebecca Halliday, a litigator who is tasked with defending ACN in a wrongful termination suit in the second season, but DeWitt had to vacate the role due to scheduling conflicts. The role was recast with Marcia Gay Harden. Patton Oswalt was announced to play Jonas Pfeiffer, the new V.P. of human resources at ACN, in November 2012, but he ultimately did not appear in the season.\r\nFilming\r\nThe Newsroom's set is located in Sunset Gower Studios, Hollywood, on Stage 7. The fictional Atlantis World Media building, however, is actually the Bank of America Tower on Sixth Avenue and 42nd Street in Manhattan (directly across the street from HBO's New York City offices at the time of filming), with CGI being used to change the name of the building above the entrance. Production began in the fall of 2011. The schedule called for each episode—comprising a dialogue-dense script of 80 to 90 pages – to be filmed in nine days, as opposed to six to seven pages per day for broadcast network TV series. The pilot episode was shot on 16 mm film, while the rest of the series was shot digitally with Arri Alexa cameras.\r\nWriting team\r\nWith fewer than 10 credited writers, The Newsroom has fewer writers than most other television series. It was reported that Sorkin planned to replace most of the first season's writers in the second season. He later said this was untrue. Sorkin explained his approach to writing:\r\nI create these shows so that I can write them. I'm not an empire builder. I'm not interested in just producing. All I want to do is write. I came up as a playwright—writing is something you do by yourself in a room. That said, I couldn't possibly write the show without that room full of people. I go in there, and we kick around ideas. I'm writing about all kinds of things I don't know anything about. So they do research for me.\r\nSorkin hired conservative media consultants for the second season to help him represent \"every part of the ideological spectrum,\" thus giving the show \"a political perspective that I don't have.\" Sorkin also revealed that the second season would include the 2012 United States presidential election.\r\nEpisodes\r\nIn season 1, each episode is built around a major news event from the recent past, such as the Deepwater Horizon oil spill and the killing of Osama Bin Laden. This acts as a background for the interpersonal drama, as well as providing a sense of familiarity, as the audience is likely to know the context and so not require too much explanation of events. Sorkin has said the news events on the show \"will always be real\", which, for him, \"became a kind of creative gift. For one thing, the audience knows more than the characters do, which is kind of fun. And it gives me the chance to have the characters be smarter than we were.\" However, he has also said \"t is a romanticised, idealised newsroom, a sort of a heightened newsroom – it is not meant to be a documentary.\"\r\nThe second season features a story arc in which the News Night team has reported, and been forced to retract, a false news story about the United States Marine Corps using Sarin gas during the war in Afghanistan in 2009. This story is based on a real-life news scandal from 1998, in which CNN and TIME were both criticized for reporting a dubious and unreliably sourced story that the United States had used Sarin during the Operation Tailwind excursion in the Vietnam War.\r\nThe third season tackles two controversial topics in news reporting. The first is the subject of citizen journalism, and the season begins with the Boston Marathon bombing and its subsequent investigation, which was quite significantly affected by the reports of social media users. The show takes on a particularly critical tone regarding the role that citizen journalists play in the coverage of major news stories, portraying the spread of misinformation and hindrance to law enforcement that ensues. This is expanded in subsequent episodes, where the idealistic, libertarian views of ACN's new buyer clash with the journalistic integrity of the team. The other major topic is whistleblowing, explored when major character Neal Sampat is contacted by an anonymous source, who leaks details of the US government's complicity in an atrocity in an African state. This leads to a clash between Will and the FBI, resulting in Will's spending time in jail for refusing to name Neal's source and being held in contempt. The whistleblowing storyline takes place in parallel to the Edward Snowden disclosures in 2013.\r\nBroadcast\r\nThe Newsroom premiered in the United States on HBO on June 24, 2012. It was watched by 2.1 million viewers, making it one of HBO's most-watched series premieres since 2008. The first episode was made available free to all viewers on multiple platforms, including HBO.com, iTunes, YouTube, and other free on-demand services.\r\nInternational\r\nThe show aired simultaneously on HBO Canada. It premiered on Sky Atlantic in the United Kingdom and Ireland on July 10, 2012, two weeks after its U.S. debut. In Germany and Austria The Newsroom premiered on Sky's video-on-demand service Sky Go one day after the U.S. premiere on June 25, 2012, and Sky Anytime one day later. HBO Europe also began airing the show in all twelve countries with appropriate subtitles one day after the U.S. premiere. The show premiered in New Zealand on August 13, 2012, on SKY NZ's SoHo channel. The show debuted in Australia on the SoHo channel on August 20, 2012. In India, the show premiered on HBO Defined on May 21, 2013, season 2 premiered on July 30, 2013, with episodes airing two weeks after the U.S. premiere, and season 3 premiered on November 10, 2014, one day after the U.S. premiere. As of 2019, all episodes are available for streaming on Hotstar.\r\nReception\r\nCritical response\r\nCritical reaction to the series in its first season was mixed. The show's second and third seasons saw more positive responses from reviewers.\r\nSeason 1\r\nOn Metacritic, the first season scored 56 out of 100, based on 31 critics, indicating \"mixed or average reviews\". On Rotten Tomatoes, the first season has a rating of 46%, based on 46 reviews, with an average rating of 6.4/10. The site's critical consensus reads, \"Though it sports good intentions and benefits from moments of stellar dialogue and a talented cast, The Newsroom may feel too preachy, self satisfied, and cynical to appeal to a wide range of viewers.\"\r\nTim Goodman of The Hollywood Reporter writes that how viewers respond to the show \"has everything to do with whether you like his style. Because ... Sorkin is always true to himself and doesn't try to cover his tendencies or be embarrassed by them\". Alessandra Stanley of The New York Times commented that \"at its best ... The Newsroom has a wit, sophistication and manic energy.... But at its worst, the show chokes on its own sanctimony\". Time's James Poniewozik criticized the show for being \"smug\" and \"intellectually self-serving\", with \"Aaron Sorkin writing one argument after another for himself to win.\" Los Angeles Times critic Mary McNamara said the show's drama is \"weighted too heavily toward sermonizing diatribes\".\r\nReviews by newscasters have been mixed as well. Jake Tapper, then of ABC News, criticized Sorkin's partisanship: \"they extol the Fourth Estate's democratic duty, but they believe that responsibility consists mostly of criticizing Republicans.\" Dave Marash was not convinced that the show portrays the news industry accurately. On August 1, 2012, Sorkin responded to critics by including news consultants with newsroom experience. Former CBS Evening News anchor Dan Rather gave the pilot a favorable review, saying the show \"has the potential to become a classic\".\r\nSeason 2\r\nThe second season received generally favorable reviews. It has a score of 66 out of 100, based on 20 critics, from review aggregation website Metacritic. On Rotten Tomatoes, the season holds a rating of 69%, based on 39 reviews, with an average rating of 6.9/10. The site's critical consensus reads, \"Thanks to focused storytelling and a more restrained tone, The Newsroom finds surer footing in its second season, even if it still occasionally succumbs to Aaron Sorkin's most indulgent whims.\"\r\nIn an early review of season 2, Verne Gay of Newsday called it: \"Edgier, more sharply drawn, while that Sorkian chatter remains at a very high boil.\" Oscar Moralde of Slant Magazine noted what he referred to as the show's \"grandiloquent speechifying\", but praised Olivia Munn, calling her \"a joy to watch\" and concluded that \"season two of The Newsroom salvages the promise of becoming something urgent and vital\". Brian Lowry of Variety, in a negative review, said: \"Ultimately, one needn't be a purveyor of snark to view The Newsroom as a disappointment—too smart to be dismissed, but so abrasive as to feel like Media Lectures for Dummies.\" Emily VanDerWerff of The A.V. Club gave season 2 an overall \"B−\" grade.\r\nSeason 3\r\nThe third and final season received positive reviews. On Metacritic, it has a score of 63 out of 100, based on 16 critics, indicating \"generally favorable reviews\". On Rotten Tomatoes, the season has a rating of 61%, based on 41 reviews, with an average rating of 7.5/10. The site's consensus reads, \"With an energetic new arc and deeper character development, The Newsroom finds itself rejuvenated in its third season—even if it still occasionally serves as a soapbox for creator Aaron Sorkin.\"\r\nAwards and nominations\r\nIn 2012, The Newsroom was honored, along with four others, with the Critics' Choice Television Award for Most Exciting New Series. The series also received two nominations at the 70th Golden Globe Awards, for Best Television Series – Drama and Best Actor – Television Series Drama for Jeff Daniels. Daniels was also nominated for a Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Drama Series and won as Outstanding Lead Actor in a Drama Series at the 65th Primetime Emmy Awards, in which the series received two other nominations, Outstanding Guest Actress in a Drama Series for Jane Fonda and Outstanding Main Title Design. For the 20th Screen Actors Guild Awards, Jeff Daniels was nominated for Best Drama Actor. For the 66th Primetime Emmy Awards, Jeff Daniels was nominated for Outstanding Lead Actor in a Drama Series and Jane Fonda was nominated for Outstanding Guest Actress in a Drama Series. For the 67th Primetime Emmy Awards, Jeff Daniels was nominated for Outstanding Lead Actor in a Drama Series.",
    "html": "<p>The Newsroom is an American political drama television series created and principally written by Aaron Sorkin that premiered on HBO on June 24, 2012, and concluded on December 14, 2014, consisting of 25 episodes over three seasons.</p><p>The series chronicles behind-the-scenes events at the fictional Atlantis Cable News (ACN) channel. It features an ensemble cast including Jeff Daniels as anchor Will McAvoy who, together with his staff, sets out to put on a news show \"in the face of corporate and commercial obstacles and their own personal entanglements\". Other cast members include Emily Mortimer, John Gallagher Jr., Alison Pill, Thomas Sadoski, Dev Patel, Olivia Munn, and Sam Waterston.</p><p>Sorkin, who created the Emmy Award-winning political drama The West Wing, had reportedly been developing a cable-news-centered TV drama since 2009. After months of negotiations, premium cable network HBO ordered a pilot in January 2011 and then a full series in September that year. Sorkin did his research for the series by observing several real-world cable news programs first-hand. He served as executive producer, along with Scott Rudin and Alan Poul.</p><br/><h3>Series overview</h3><p>The 25-episode series is set behind the scenes at the fictional Atlantis Cable News (ACN) and revolves around anchor Will McAvoy, his new executive producer MacKenzie McHale, newsroom staff Jim Harper, Maggie Jordan, Sloan Sabbith, Neal Sampat, Don Keefer, and the head of ACN, Charlie Skinner.</p><br/><h3>Cast and characters</h3><h4>Main cast</h4><ul><li>Jeff Daniels as Will McAvoy: the anchor and managing editor of News Night. A moderate Republican news anchor whose broadcast persona is characterized as unwilling to offend anyone. Known for being difficult to work with, his world is turned upside down when his ex-girlfriend MacKenzie re-enters his life with a plan to revamp his news broadcast.</li><li>Emily Mortimer as MacKenzie \"Mac\" Morgan McHale: News Night's new executive producer and Will's ex-girlfriend, returning from 26 months as an embedded journalist overseas, MacKenzie strives to return ACN to the days of real news broadcasts. MacKenzie had an affair with her ex-boyfriend, Brian Brenner, during her relationship with Will. Mac graduated from Cambridge.</li><li>John Gallagher Jr. as Jim Harper: Senior Producer who follows MacKenzie to News Night. At his new job, he develops feelings for Maggie.</li><li>Alison Pill as Maggie Jordan: an eager, young associate producer of News Night. Formerly Will's somewhat inept personal assistant, she is appointed an assistant producer by MacKenzie. She has complicated personal relationships with Don and Jim.</li><li>Thomas Sadoski as Don Keefer: News Night's former executive producer who leaves for the new program on the network, Right Now with Elliot Hirsch, but continues to work with the News Night team in a variety of capacities. Plain-speaking and straightforward, but also quite insecure, Don begins to doubt his feelings for Maggie. Ultimately, he breaks up with her, encouraging her to go after Jim. He subsequently goes on to date Sloan.</li><li>Dev Patel as Neal Sampat: writer of Will's blog and electronic media expert who covered the London Underground bombings with a camera phone. Neal works with the team to develop the use of electronic media as part of the new format.</li><li>Olivia Munn as Sloan Sabbith: an economist with two Ph.D.s, she presents an economic news segment on Will's show. Sloan is good at her job, but also very socially inept and prone to creating uncomfortable situations for herself and others. She develops feelings for Don throughout the show.</li><li>Sam Waterston as Charlie Skinner: Atlantis Cable News (ACN) president and retired US Marine. Charlie's role is to joust with Atlantis World Media owner Leona Lansing and her son, AWM president Reese Lansing, while defending the new News Night format.</li></ul><h4>Supporting cast</h4><ul><li>Jane Fonda as Leona Lansing: CEO of Atlantis World Media (AWM), the parent company of ACN.</li><li>Adina Porter as Kendra James: a booker for News Night.</li><li>Chris Chalk as Gary Cooper: an associate producer for News Night, and former TMI employee.</li><li>Chris Messina as Reese Lansing: president of AWM, and Leona's son.</li><li>Terry Crews as Lonny Church: Will's bodyguard assigned to him after Will receives death threats. (season 1)</li><li>Kelen Coleman as Lisa Lambert: Maggie's roommate who dates Jim. (seasons 1–2)</li><li>David Harbour as Elliot Hirsch: the anchor of Right Now, a new program on the network.</li><li>Jon Tenney as Wade Campbell: a Congressional candidate who briefly dates MacKenzie to boost his campaign through ACN. (season 1)</li><li>David Krumholtz as Dr. Jacob Habib: Will's current therapist, who is the son of Will's original therapist. (season 1)</li><li>Hope Davis as Nina Howard: a gossip columnist for TMI, AWM's tabloid magazine. (seasons 1–2)</li><li>Stephen McKinley Henderson as Solomon Hancock: a man who tells Charlie how to blackmail Reese. (season 1)</li><li>Natalie Morales as Kaylee: Neal's girlfriend whose father died on 9/11. (season 1)</li><li>Paul Schneider as Brian Brenner: a writer for New York magazine whom Will hires for an all-access profile. MacKenzie cheated on Will with Brian during the first four months of their relationship. (season 1)</li><li>Marcia Gay Harden as Rebecca Halliday: a litigator defending Atlantis Cable News against First Amendment-related cases. (seasons 2–3)</li><li>Hamish Linklater as Jerry Dantana: a senior producer from ACN's Washington bureau who fills in while Jim is on the campaign trail and brings the Genoa tip to MacKenzie's attention. (season 2)</li><li>Grace Gummer as Hallie Shea: a reporter who is embedded with the Mitt Romney campaign. (seasons 2–3)</li><li>Constance Zimmer as Taylor Warren: a spokeswoman for the Mitt Romney campaign. (season 2)</li><li>Aya Cash as Shelly Wexler: Occupy Wall Street advocate. (season 2)</li><li>B. J. Novak as Lucas Pruit: a young, wealthy libertarian interested in buying ACN, whose views on citizen journalism clash with Charlie, Will and Mac's. (season 3)</li><li>Mary McCormack as Molly Levy: an FBI agent who is a friend of Mac. (season 3)</li><li>Clea DuVall as Lilly Hart: a whistleblower who leaks thousands of classified government documents. (season 3)</li><li>Jimmi Simpson as Jack Spaniel: an ethics professor who briefly dates Maggie. (season 3)</li><li>Paul Lieberstein as Richard Westbrook: EPA vice-director. (season 3)</li><li>Derek Webster as Rodger Hutchinson: an FBI agent. (season 3)</li><li>Brian Howe as Barry Lasenthal: a Department of Justice officer who is able to arrest Will. (season 3)</li><li>Keith Powell as Wyatt Geary: the new VP of human resources who wants to prove that Don is in a relationship with Sloan. (season 3)</li><li>Jon Bass as Bree Dorrit: the temporary substitute for Neal. (season 3)</li></ul><h4>Co-stars</h4><ul><li>Margaret Judson as Tess Westin: an associate producer for News Night.</li><li>Thomas Matthews as Martin Stallworth: an associate producer for News Night.</li><li>John F. Carpenter as Herb Wilson: the control room head for News Night.</li><li>Trieu Tran as Joey Phan: the graphics producer for News Night.</li><li>Wynn Everett as Tamara Hart: an associate producer and booker for News Night.</li><li>Charlie Weirauch as Jake Watson: a switcher/board op for News Night.</li><li>Chasty Ballesteros as Tea: the bartender at Hang Chews, the karaoke bar frequented by the News Night staff. (seasons 1–2)</li><li>Sarah Scott Davis as Terry Smith: the anchorwoman of Capitol Report, the news bulletin from Washington following News Night.</li><li>Alison Becker as Sandy Whiddles: a professional media source, seeking out involvement in \"kiss and tell\" stories for financial gain. (season 1)</li><li>Riley Voelkel as Jennifer \"Jenna\" Johnson: a sophomore student Will encounters at Northwestern University, later hired as Will's assistant.</li><li>John Hawkinson as Rudy: a control-room tech whiz on News Night. (season 3)</li><li>Frank Cermak as Luke. (season 3)</li></ul><br/><h3>Production</h3><h4>Development</h4><p>Entertainment Weekly reported in April 2009 that Sorkin, while still working on the screenplay for The Social Network, was contemplating a new TV drama about the behind-the-scenes events at a cable news program. Sorkin was the series creator of Sports Night and Studio 60 on the Sunset Strip, both shows depicting the off-camera happenings of fictional television programs. Talks were reportedly ongoing between Sorkin and HBO since 2010. In January 2011, Sorkin revealed the project on BBC News.</p><p>To research the cable news world, Sorkin had been an off-camera guest at MSNBC's Countdown with Keith Olbermann in 2010 to observe the show's production and quizzed Parker Spitzer's staff when he was a guest on that show. He also spent time shadowing Hardball with Chris Matthews as well as other programs on Fox News and CNN. Sorkin told TV Guide that he intended to take a less cynical view of the media: \"They're going to be trying to do well in a context where it's very difficult to do well when there are commercial concerns and political concerns and corporate concerns.\" Sorkin decided that rather than have his characters react to fictional news events as on his earlier series, The Newsroom would be set in the recent past and track real-world stories largely as they unfolded, to give a greater sense of realism.</p><p>HBO ordered a pilot in January 2011 with the working title More as This Story Develops. The Social Network's Scott Rudin signed on as executive producer. Rudin's only previous television work was the 1996 spin-off series Clueless. By June, Jeff Daniels, Emily Mortimer, Sam Waterston, Olivia Munn, and Dev Patel were cast, while Greg Mottola had signed on to direct the pilot. The pilot script was later reportedly obtained by several news outlets.</p><p>On September 8, 2011, HBO ordered a full series starting with an initial 10-episode run with a premiere date set for summer 2012. A day after the second episode aired, HBO renewed the series for a second season.</p><p>Sorkin said in June 2012 that The Newsroom \"is meant to be an idealistic, romantic, swashbuckling, sometimes comedic but very optimistic, upward-looking look at a group of people who are often looked at cynically. The same as with The West Wing, where ordinarily in popular culture our leaders are portrayed either as Machiavellian or dumb; I wanted to do something different and show a highly competent group of people.\"</p><h4>Series title</h4><p>While the pilot was in development, the project was tentatively titled More as This Story Develops. On November 29, 2011, HBO filed for a trademark on \"The Newsroom\" with the U.S. Patent and Trademark Office. The new name immediately drew comparisons with the Ken Finkleman-created Canadian comedy series of the same name that aired on CBC and public television stations in the U.S. The series' name was confirmed as The Newsroom in an HBO promo released on December 21, 2011, previewing its programs for 2012.</p><p>Writing in Maclean's, Jaime Weinman said the choice of name was \"a bit of a grimly amusing reminder that the U.S. TV industry doesn't take Canada very seriously ... The Newsroom is often considered the greatest show Canada has ever produced, but a U.S. network feels no need to fear unflattering comparisons: assuming they've heard of the show, they probably think most people in the States have not heard of it.\" In an interview with The Daily Beast following the Sorkin show's premiere, Finkleman revealed that HBO did contact him for permission to reuse the title, which he granted.</p><h4>Casting</h4><p>Jeff Daniels was cast in the lead role in March 2011. Alison Pill and Olivia Munn reportedly entered negotiations to star in April 2011. The fictional executive producer role was initially offered to Marisa Tomei, but negotiations fell through. Tomei was replaced by Emily Mortimer in May 2011. Sam Waterston also joined the project in May. John Gallagher Jr., Thomas Sadoski, and Dev Patel were added to the cast in June 2011.</p><p>New York magazine reported that Sorkin had planned for MSNBC host Chris Matthews and Andrew Breitbart to appear in a roundtable debate scene in the pilot; however, the idea was shot down by MSNBC purportedly because the network was displeased with the corporate culture portrayal of cable news and skewering of left-leaning media in the show's script. Chris Matthews' son, Thomas, joined the cast in the role of Martin Stallworth, an associate producer for the fictional show.</p><p>Three months after the series was picked up, Jane Fonda signed on to play Leona Lansing, the CEO of the fictional network's parent company. Fonda was married to Turner Broadcasting System and CNN founder Ted Turner for 10 years. Lansing was touted by some observers as a female version of Fonda's ex-husband. The name \"Leona Lansing\" is taken from the names of two highly successful businesswomen, real estate developer Leona Helmsley and former Paramount Pictures CEO Sherry Lansing.</p><p>Jon Tenney guest-starred as Wade, MacKenzie's boyfriend. Natalie Morales has a guest role as Kaylee, Neal's girlfriend. Terry Crews plays Lonny, Will's bodyguard.</p><p>Rosemarie DeWitt was originally cast as Rebecca Halliday, a litigator who is tasked with defending ACN in a wrongful termination suit in the second season, but DeWitt had to vacate the role due to scheduling conflicts. The role was recast with Marcia Gay Harden. Patton Oswalt was announced to play Jonas Pfeiffer, the new V.P. of human resources at ACN, in November 2012, but he ultimately did not appear in the season.</p><h4>Filming</h4><p>The Newsroom's set is located in Sunset Gower Studios, Hollywood, on Stage 7. The fictional Atlantis World Media building, however, is actually the Bank of America Tower on Sixth Avenue and 42nd Street in Manhattan (directly across the street from HBO's New York City offices at the time of filming), with CGI being used to change the name of the building above the entrance. Production began in the fall of 2011. The schedule called for each episode—comprising a dialogue-dense script of 80 to 90 pages – to be filmed in nine days, as opposed to six to seven pages per day for broadcast network TV series. The pilot episode was shot on 16 mm film, while the rest of the series was shot digitally with Arri Alexa cameras.</p><h4>Writing team</h4><p>With fewer than 10 credited writers, The Newsroom has fewer writers than most other television series. It was reported that Sorkin planned to replace most of the first season's writers in the second season. He later said this was untrue. Sorkin explained his approach to writing:</p><blockquote>I create these shows so that I can write them. I'm not an empire builder. I'm not interested in just producing. All I want to do is write. I came up as a playwright—writing is something you do by yourself in a room. That said, I couldn't possibly write the show without that room full of people. I go in there, and we kick around ideas. I'm writing about all kinds of things I don't know anything about. So they do research for me.</blockquote><p>Sorkin hired conservative media consultants for the second season to help him represent \"every part of the ideological spectrum,\" thus giving the show \"a political perspective that I don't have.\" Sorkin also revealed that the second season would include the 2012 United States presidential election.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 24, 2012</td><td style=\"padding:0 8px\">August 26, 2012</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">9</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">July 14, 2013</td><td style=\"padding:0 8px\">September 15, 2013</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">November 9, 2014</td><td style=\"padding:0 8px\">December 14, 2014</td></tr></tbody></table><p>In season 1, each episode is built around a major news event from the recent past, such as the Deepwater Horizon oil spill and the killing of Osama Bin Laden. This acts as a background for the interpersonal drama, as well as providing a sense of familiarity, as the audience is likely to know the context and so not require too much explanation of events. Sorkin has said the news events on the show \"will always be real\", which, for him, \"became a kind of creative gift. For one thing, the audience knows more than the characters do, which is kind of fun. And it gives me the chance to have the characters be smarter than we were.\" However, he has also said \"t is a romanticised, idealised newsroom, a sort of a heightened newsroom – it is not meant to be a documentary.\"</p><p>The second season features a story arc in which the News Night team has reported, and been forced to retract, a false news story about the United States Marine Corps using Sarin gas during the war in Afghanistan in 2009. This story is based on a real-life news scandal from 1998, in which CNN and TIME were both criticized for reporting a dubious and unreliably sourced story that the United States had used Sarin during the Operation Tailwind excursion in the Vietnam War.</p><p>The third season tackles two controversial topics in news reporting. The first is the subject of citizen journalism, and the season begins with the Boston Marathon bombing and its subsequent investigation, which was quite significantly affected by the reports of social media users. The show takes on a particularly critical tone regarding the role that citizen journalists play in the coverage of major news stories, portraying the spread of misinformation and hindrance to law enforcement that ensues. This is expanded in subsequent episodes, where the idealistic, libertarian views of ACN's new buyer clash with the journalistic integrity of the team. The other major topic is whistleblowing, explored when major character Neal Sampat is contacted by an anonymous source, who leaks details of the US government's complicity in an atrocity in an African state. This leads to a clash between Will and the FBI, resulting in Will's spending time in jail for refusing to name Neal's source and being held in contempt. The whistleblowing storyline takes place in parallel to the Edward Snowden disclosures in 2013.</p><br/><h3>Broadcast</h3><p>The Newsroom premiered in the United States on HBO on June 24, 2012. It was watched by 2.1 million viewers, making it one of HBO's most-watched series premieres since 2008. The first episode was made available free to all viewers on multiple platforms, including HBO.com, iTunes, YouTube, and other free on-demand services.</p><h4>International</h4><p>The show aired simultaneously on HBO Canada. It premiered on Sky Atlantic in the United Kingdom and Ireland on July 10, 2012, two weeks after its U.S. debut. In Germany and Austria The Newsroom premiered on Sky's video-on-demand service Sky Go one day after the U.S. premiere on June 25, 2012, and Sky Anytime one day later. HBO Europe also began airing the show in all twelve countries with appropriate subtitles one day after the U.S. premiere. The show premiered in New Zealand on August 13, 2012, on SKY NZ's SoHo channel. The show debuted in Australia on the SoHo channel on August 20, 2012. In India, the show premiered on HBO Defined on May 21, 2013, season 2 premiered on July 30, 2013, with episodes airing two weeks after the U.S. premiere, and season 3 premiered on November 10, 2014, one day after the U.S. premiere. As of 2019, all episodes are available for streaming on Hotstar.</p><br/><h3>Reception</h3><h4>Critical response</h4><p>Critical reaction to the series in its first season was mixed. The show's second and third seasons saw more positive responses from reviewers.</p><h4>Season 1</h4><p>On Metacritic, the first season scored 56 out of 100, based on 31 critics, indicating \"mixed or average reviews\". On Rotten Tomatoes, the first season has a rating of 46%, based on 46 reviews, with an average rating of 6.4/10. The site's critical consensus reads, \"Though it sports good intentions and benefits from moments of stellar dialogue and a talented cast, The Newsroom may feel too preachy, self satisfied, and cynical to appeal to a wide range of viewers.\"</p><p>Tim Goodman of The Hollywood Reporter writes that how viewers respond to the show \"has everything to do with whether you like his style. Because ... Sorkin is always true to himself and doesn't try to cover his tendencies or be embarrassed by them\". Alessandra Stanley of The New York Times commented that \"at its best ... The Newsroom has a wit, sophistication and manic energy.... But at its worst, the show chokes on its own sanctimony\". Time's James Poniewozik criticized the show for being \"smug\" and \"intellectually self-serving\", with \"Aaron Sorkin writing one argument after another for himself to win.\" Los Angeles Times critic Mary McNamara said the show's drama is \"weighted too heavily toward sermonizing diatribes\".</p><p>Reviews by newscasters have been mixed as well. Jake Tapper, then of ABC News, criticized Sorkin's partisanship: \"they extol the Fourth Estate's democratic duty, but they believe that responsibility consists mostly of criticizing Republicans.\" Dave Marash was not convinced that the show portrays the news industry accurately. On August 1, 2012, Sorkin responded to critics by including news consultants with newsroom experience. Former CBS Evening News anchor Dan Rather gave the pilot a favorable review, saying the show \"has the potential to become a classic\".</p><h4>Season 2</h4><p>The second season received generally favorable reviews. It has a score of 66 out of 100, based on 20 critics, from review aggregation website Metacritic. On Rotten Tomatoes, the season holds a rating of 69%, based on 39 reviews, with an average rating of 6.9/10. The site's critical consensus reads, \"Thanks to focused storytelling and a more restrained tone, The Newsroom finds surer footing in its second season, even if it still occasionally succumbs to Aaron Sorkin's most indulgent whims.\"</p><p>In an early review of season 2, Verne Gay of Newsday called it: \"Edgier, more sharply drawn, while that Sorkian chatter remains at a very high boil.\" Oscar Moralde of Slant Magazine noted what he referred to as the show's \"grandiloquent speechifying\", but praised Olivia Munn, calling her \"a joy to watch\" and concluded that \"season two of The Newsroom salvages the promise of becoming something urgent and vital\". Brian Lowry of Variety, in a negative review, said: \"Ultimately, one needn't be a purveyor of snark to view The Newsroom as a disappointment—too smart to be dismissed, but so abrasive as to feel like Media Lectures for Dummies.\" Emily VanDerWerff of The A.V. Club gave season 2 an overall \"B−\" grade.</p><h4>Season 3</h4><p>The third and final season received positive reviews. On Metacritic, it has a score of 63 out of 100, based on 16 critics, indicating \"generally favorable reviews\". On Rotten Tomatoes, the season has a rating of 61%, based on 41 reviews, with an average rating of 7.5/10. The site's consensus reads, \"With an energetic new arc and deeper character development, The Newsroom finds itself rejuvenated in its third season—even if it still occasionally serves as a soapbox for creator Aaron Sorkin.\"</p><h4>Awards and nominations</h4><p>In 2012, The Newsroom was honored, along with four others, with the Critics' Choice Television Award for Most Exciting New Series. The series also received two nominations at the 70th Golden Globe Awards, for Best Television Series – Drama and Best Actor – Television Series Drama for Jeff Daniels. Daniels was also nominated for a Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Drama Series and won as Outstanding Lead Actor in a Drama Series at the 65th Primetime Emmy Awards, in which the series received two other nominations, Outstanding Guest Actress in a Drama Series for Jane Fonda and Outstanding Main Title Design. For the 20th Screen Actors Guild Awards, Jeff Daniels was nominated for Best Drama Actor. For the 66th Primetime Emmy Awards, Jeff Daniels was nominated for Outstanding Lead Actor in a Drama Series and Jane Fonda was nominated for Outstanding Guest Actress in a Drama Series. For the 67th Primetime Emmy Awards, Jeff Daniels was nominated for Outstanding Lead Actor in a Drama Series.</p><br/>"
  },
  "errorMessage": ""
}