{
  "imDbId": "tt1489428",
  "title": "Justified",
  "fullTitle": "Justified (TV Series 2010–2015)",
  "type": "TVSeries",
  "year": "2010",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8643750",
      "warningSpoilers": false,
      "date": "29 October 2022",
      "rate": "10",
      "helpful": "54 out of 55 found this helpful.",
      "title": "Love This Show!!",
      "content": "I don't even know how to describe how much I loved this show. Justified is easily one of my favorite shows of all-time! The show is about a wild-west like U. S. Marshall Deputy named Raylan Givens (Timothy Olyphant) who will go to any lengths to bring justice to the criminals he's hunting. This all takes place in his hometown in Kentucky. Olyphant was absolutely perfect in this as Raylan Givens. The rest of the cast is great too, especially the incredibly underrated Walton Goggins as outlaw Boyd Crowder. I literally loved every episodes of every season. I heard they're bringing it back after in 2023 for another season so I can't wait!"
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw5746854",
      "warningSpoilers": false,
      "date": "17 May 2020",
      "rate": "10",
      "helpful": "80 out of 87 found this helpful.",
      "title": "One of the most underrated and best shows ever created!",
      "content": "Justified is one of the most underrated and best tv shows I've ever seen and absolutely deserves all the great reviews and high ratings it gets! It's one of the rare shows where every season is as good as the others. Timothy Olyphant was perfect in this as Raylan Givens. I can't say enough about this phenomenal show except to go watch it, you will not be disappointed! Absolutely loved it!"
    },
    {
      "username": "athanasiosze",
      "userUrl": "https://www.imdb.com/user/ur22784486",
      "reviewLink": "https://www.imdb.com/review/rw8796946",
      "warningSpoilers": false,
      "date": "13 January 2023",
      "rate": "8",
      "helpful": "33 out of 34 found this helpful.",
      "title": "One of the GOAT tv shows.",
      "content": "FIRST SEASON : 8/10SECOND SEASON: 8,3/10THIRD SEASON : 8,4/10FOURTH SEASON : 8,1/10FIFTH SEASON: 8,1/10SIXTH SEASON: 8,3/10.This is not just one of the greatest tv shows of all time, but one of the most consistent ones too. Because there is not even a one \"just good\" season, they are all very good. From beginning to end, there is not even a slightly drop in quality. Ok, first 4-5 episodes are not great, but when it starts being great, it's great all the way through. There is tension, top notch acting, very likeable characters, drama, catharsis. It's realistic but not excessively griity. These are human characters not tv caricatures. And the greatest quality here is the script. Not only the plot. The dialogues are sharp as a razor. The interaction between the characters is convincing as it gets.Olyphant is Swagger Incarnated. Goggins is the archetype of the charismatic, vicious but charming, criminal. Joelle Carter is the Damsel in Distress who choose to fight back for her life, instead of waiting for the \"Prince in white horse\".Every actor here does an amazing job, the casting is excellent.The ending is brilliant.Congratulations to everyone involved in this fantastic tv show."
    },
    {
      "username": "info-90701",
      "userUrl": "https://www.imdb.com/user/ur66306211",
      "reviewLink": "https://www.imdb.com/review/rw8738719",
      "warningSpoilers": false,
      "date": "16 December 2022",
      "rate": "8",
      "helpful": "28 out of 29 found this helpful.",
      "title": "I'm on Season Four and . . .",
      "content": "The show is great, though the people are horrible human beings, almost all of them. It is a frightening statement about good and evil, and all the blurry, indistinct, self-involved lines in between. It is a vivid, dismal view of the darkness in human beings and the ugliness of always making money king. It is depressing, brilliant, devastating, uplifting and everything in between. A roller coaster of the horrors of human beings in the US, as shown through a distinct group of people who apparently, are a bit off the grid in their thinking and actions, and yet are a reflection of the rest of the madness in this country.The show creator is brilliant. Olyphant is mesmerizing, as is the entire cast, delivering their parts well."
    },
    {
      "username": "brooksrob1",
      "userUrl": "https://www.imdb.com/user/ur33279366",
      "reviewLink": "https://www.imdb.com/review/rw8653558",
      "warningSpoilers": true,
      "date": "3 November 2022",
      "rate": "10",
      "helpful": "33 out of 35 found this helpful.",
      "title": "Because we dug coal together. ~a tear~",
      "content": "After a third binge, I had to check IMDB out to see how others viewed it...I have loved this show since it first came on... Raylen *Olyphant has the most endearing mannerisms throughout...Never a stupid line... His self assured nature gets him in trouble a few times but; He'll deliver and \"Aww shucks\" statement that just makes his character amazing...The Bennets, Meggs, Limehouse The Dixie Mob, assorted criminals. Give Raylen a run for the money...Raylens interactions with Boyd are what makes the show so watchable. I had seen Goggins in a few things previously, but; Justified raised my opinion of him far more. He's a force and outshines Olyphant a few times...Which is no easy task... The look in Raylens eyes when He says the review title is very poignant..."
    },
    {
      "username": "deloudelouvain",
      "userUrl": "https://www.imdb.com/user/ur58525162",
      "reviewLink": "https://www.imdb.com/review/rw3238688",
      "warningSpoilers": false,
      "date": "15 May 2015",
      "rate": "8",
      "helpful": "36 out of 42 found this helpful.",
      "title": "Once upon a time in Kentucky...",
      "content": "I just finished the whole series and I enjoyed every single one of the episodes from all seasons. This is an underrated series that deserves much more people to know about it. I'm normally not a big fan of Kentucky accent but in this show it's just great. The conversations between the actors are also excellent. I just love the way they talk in Justified. The actors are all top notch, can't really fail anybody on this show. Walton Goggins (as Boyd Crowder) and Timothy Olyphant (as Raylan Givens)are definitely the two actors that carry this series to a higher level. Their eternal battle against each other is a pleasure for the eye and ear. The story is well written, you never get bored for a second. I certainly will watch Justified again in the future."
    },
    {
      "username": "redx1708",
      "userUrl": "https://www.imdb.com/user/ur8837819",
      "reviewLink": "https://www.imdb.com/review/rw8143861",
      "warningSpoilers": false,
      "date": "14 May 2022",
      "rate": "10",
      "helpful": "26 out of 28 found this helpful.",
      "title": "Top rating is \"Justified\".",
      "content": "Very few shows running over several seasons would qualify for a 10 rating. Sooner or later there's gotta be a decline in quality. Could be plot holes, ideas getting thin or simply that they are losing pace. Even shows that I enjoyed would, when I eyed them objectively, only be getting a 7 or 8 rating.Only 2 shows would, in my opinion, qualify for a 10, those being \"The Wire\" and \"Breaking Bad\".I have never even bothered to review either, since I couldn't really add anything to what has already been said about both. They were both unique groundbreakers on a level of their own.Now \"Justified\" is not really a groundbreaker, and compared to those other two, a lot more of a traditional kind of cop show. So why am I throwing a 10 at it ?Well, it's just so awesome well made !! While it starts out pretty straight forward, halfway through season 1 it develops into this sprawling hillbilly saga. Forget about \"Banshee\" or \"Ozark\", Justified has them beat by miles.For one thing it has a multitude of great characters, and every character seems to be played by just the perfect actor/actress. In the leads Timothy Olyphant is the essence of the cool, but slightly emotionally damaged Marshal, and Walton Goggins steals pretty much every scene he's in.They are supported by a great cast of characters. Arlo, Ava, Mags Bennet, Dewey Crowe, Wynn Duffy, Ellen May,Loretta, well the list could go on forever. Each one nailed to perfection by actors who seem born to do exactly those parts, ( Abby Miller probably delivers the performance of her life as Ellen May). Everybody, known and less known, just acts everything they got out of their parts to a degree that it almost seems like overkill to add Sam Elliot and Mary Steenburgen to the cast for the last season, but even that works out perfectly.So what could I do, but rate it 10 ? Beats me, lol. I have watched all 6 seasons 3 or 4 times, and it's still the box I'll pull from the shelf, if I can't figure out what else to watch. It's just that good !!"
    },
    {
      "username": "vrave-97",
      "userUrl": "https://www.imdb.com/user/ur160199202",
      "reviewLink": "https://www.imdb.com/review/rw8760991",
      "warningSpoilers": false,
      "date": "27 December 2022",
      "rate": "10",
      "helpful": "28 out of 28 found this helpful.",
      "title": "Get to episode 5 and then it explodes all the way to the end.",
      "content": "The first four episodes just feels like a regular cop show.But it gels in episode 5 and does not stop until the very last show of the last season.Essentially it is one story from start to finish. Not across a season, but across all of the seasons. Something to really let yourself be taken on a journey.All the characters are great and I sort of root for everyone really, or you can at least see their side of the story.Very funny. Well written. Well filmed.Exciting and psychologically thought provoking. Tactics and deceit. Cerebral(maybe) For most of the actors these roles were their defining role in as much as they never look quite right in any other role."
    },
    {
      "username": "beso-langa",
      "userUrl": "https://www.imdb.com/user/ur44372228",
      "reviewLink": "https://www.imdb.com/review/rw8207174",
      "warningSpoilers": false,
      "date": "5 June 2022",
      "rate": "9",
      "helpful": "33 out of 36 found this helpful.",
      "title": "The funniest crime series I've ever watched!!!",
      "content": "Walton Goggins (Boyd Crowder) steals the show. Timothy Olyphant runs it but it is the anecdotes of the offbeat criminal characters such as Arlo, Dewey, Dickie Bennet & family, Limehouse and Wyn that just makes this ensemble tick. I doubt reading the short story could justify, no puns intended, the right measure of action, comedy and drama. This show kicks ass and I feel I caught it late for the right time. There aren't as many brilliant shows nowadays. Yeah Breaking Bad was the $#! T but I don't even think Saul Goodman/ Jimmy McGill is as hilarious or superb like Boyd Crowder. I can't wait for the anthology..."
    },
    {
      "username": "jstepp-72919",
      "userUrl": "https://www.imdb.com/user/ur94349456",
      "reviewLink": "https://www.imdb.com/review/rw5495122",
      "warningSpoilers": false,
      "date": "19 February 2020",
      "rate": "10",
      "helpful": "24 out of 26 found this helpful.",
      "title": "Cant get enough",
      "content": "Just watched it for the third time all the way through. It is so good. Tim and Walton did so good...their growing rivalry mixed with their respect for each other is amazing. Walton just delivers an unparalleled witty performance. Probably watch it again sooner than later"
    },
    {
      "username": "jackDee-56565",
      "userUrl": "https://www.imdb.com/user/ur110145410",
      "reviewLink": "https://www.imdb.com/review/rw6065406",
      "warningSpoilers": false,
      "date": "5 September 2020",
      "rate": "10",
      "helpful": "25 out of 30 found this helpful.",
      "title": "Justifiably one of the best series ever",
      "content": "Timothy Olyphant and Walton Goggins worked well together all the seasons are great and worthy of rewatches, most of the villains are fantasic , Raylan is a great lawman and a total badass, Boyd is one of the best anti hero characters ever written, you wont be disappointed with Justified it had a fitting finale"
    },
    {
      "username": "baltdis",
      "userUrl": "https://www.imdb.com/user/ur78772989",
      "reviewLink": "https://www.imdb.com/review/rw8037474",
      "warningSpoilers": false,
      "date": "6 April 2022",
      "rate": "10",
      "helpful": "14 out of 14 found this helpful.",
      "title": "Kentucky mafia meets Detroit mafia meets the law. The law wins.",
      "content": "Raylan Givens always gets his man. Modern day western and fantastic character development. The twisting story between Boyd Crowder and Raylan Givens is incredible start to finish. Do not pass up this series."
    },
    {
      "username": "revrobertv",
      "userUrl": "https://www.imdb.com/user/ur85081172",
      "reviewLink": "https://www.imdb.com/review/rw8331653",
      "warningSpoilers": false,
      "date": "13 July 2022",
      "rate": "10",
      "helpful": "27 out of 30 found this helpful.",
      "title": "Masterpiece",
      "content": "I know I can tend to be pretty critical about television shows. I have to say this show is a masterpiece. The acting is impeccable. The character choice, one of the best I've ever seen in watching television for 55 years. I'm not going to leave spoilers here for the show. If you want to sit down and thoroughly enjoy a television series, Justified will not disappoint."
    },
    {
      "username": "donb-519-335075",
      "userUrl": "https://www.imdb.com/user/ur37466759",
      "reviewLink": "https://www.imdb.com/review/rw3295670",
      "warningSpoilers": true,
      "date": "11 August 2015",
      "rate": "9",
      "helpful": "16 out of 18 found this helpful.",
      "title": "One of the best",
      "content": "Cindy and I went to college at Eastern Kentucky University in Richmond, Ky. We had many acquaintances from Harlan County - where Justified takes place. The re-creation of how friendly and laid back people are in Eastern Ky was the first thing that attracted me to Justified.The lead character, Raylon Givins, played so smoothly by Timothy Olyphant, knows most of the people he is working with, and going after, as part of his job as a U.S. Marshall. Raylon is from Harlan and he prosecutes his job with vigor, barely keeping his toes on the right side of the law. Raylon knew; played ball with; and most importantly, dug coal with many of the bad guys he was later to apprehend - and in many cases kill.There is a lot of the typical Western in Justified, from Raylon's cowboy hat - his signature look - to the six-guns that many of the bad guys carry (in holsters naturally). Raylon carries a Glock - clearly the most reliable semiautomatic ever made. And naturally he is the quickest draw in the West ... er the East . . . of Kentucky that is.The other main characters (and there are so many) are terrific - especially Walter Goggons - who plays Boyd Crowder and Joelle Carter - who plays Boyd's sister-in-law and on and off lover, Ava Crowder. This show has won a number of Emmy's and other awards, but not nearly as many as it should have.Boyd Crowder is one of the most memorable bad guys since Ian McShane as Swearingen in Deadwood. But where Swearingen was pretty much totally evil (in a compassionate way), Boyd is always on top of things- even when he is shot and/or in prison. Boyd is the ultimate survivor and the smartest bad guy since Hannibal Lechter. You will find yourself rooting for Boyd throughout the series.Walter Goggins has been around since 1990 and has had many parts, but this is his signature role.Each of the seasons has a particular flow and storyline - all of them with very rich characters (some so low-life you cannot believe it.) Cindy and I have been dreading seeing the 78 episodes fly by. If you get into it, you will be hooked as we were.Unlike the 90+ episodes of Sons of Anarchy which eventually got a little stale (hung on too long), Justified stayed crisp, interesting and engrossing until the end. The last season is terrific, tying up a number of loose ends, but in a way which leaves things open for sequels - or maybe a movie. I'm hoping for a season 7 in a couple of years.Hope you check it out. There is huge competition for your viewing hours with so many great shows. I am glad Cindy and I have stuck with the heroes and miscreants of Easter Ky to the end."
    },
    {
      "username": "bhester0806",
      "userUrl": "https://www.imdb.com/user/ur51677889",
      "reviewLink": "https://www.imdb.com/review/rw4327052",
      "warningSpoilers": false,
      "date": "8 September 2018",
      "rate": "10",
      "helpful": "18 out of 21 found this helpful.",
      "title": "One of the special ones",
      "content": "Just finished rewatching Justified for the 3rd time and it's better every time. It's one of the if not the best show ever made. All the actors go above and beyond. Timothy O completely embodies Raylan Givens down to the walk. Walton G's Boyd is probably the best and most articulate bad guy of all times. A lot of people won't make it through the first season but the ones that do will be so glad they did.Justified falls in that \"special\" category with Breaking Bad and Game of Thrones. It's just one of those shows where everything worked and everything's good."
    },
    {
      "username": "kbuttstadt",
      "userUrl": "https://www.imdb.com/user/ur6971480",
      "reviewLink": "https://www.imdb.com/review/rw2241132",
      "warningSpoilers": false,
      "date": "24 April 2010",
      "rate": "9",
      "helpful": "79 out of 89 found this helpful.",
      "title": "One Smooth Ride",
      "content": "Justified is another fine entry into FX's stable of shows. As a fan of both crime fiction & serialized television, this has been on my radar for some time. First, the story is wonderfully structured & grounded in reality (It helps when you shoot on location & cast actors that actually feel like they belong there) The U.S. Marshalls & their multiple duties have always been a great source for story-telling, and this is no different. Second, the cast is perfect for this type of slow-burn law enforcement story. Timothy Olyphant once again nails the 'cowboy' role we've seen him in before(Deadwood, The Crazies). He runs the risk of being type-cast; but if he's always this good in these types of roles, who cares? The rest of the cast is rounded-out by some familiar & not-so-familiar faces, and the whole of them seem to bring their A-game to this project. The third reason this show is quality is the production value. Everything from the costumes(I love the cowboy hat) to the locations & the music have all been perfectly fitting with the story & the characters. This show also sneaks up on you a little bit, once you think Justified isn't 'edgy' enough for FX, something happens to change your mind. It's only similar to the other FX crime shows in that it centers around a really angry guy. I hope Justified & FX continue to pleasantly surprise me."
    },
    {
      "username": "ibibrov",
      "userUrl": "https://www.imdb.com/user/ur64593446",
      "reviewLink": "https://www.imdb.com/review/rw5983567",
      "warningSpoilers": false,
      "date": "11 August 2020",
      "rate": "9",
      "helpful": "13 out of 14 found this helpful.",
      "title": "Superb performances, great writing, with a superb final scene",
      "content": "I have to admit, when it comes to watching shows, it's very hard for me to watch for longer than about 4 seasons at once, so I automatically get a little prejudiced. However, some of the characters just annoyed me, such as Ava Crowder, especially in the later seasons, she just pissed me off. But the writing, and especially the performances of Timothy Oluphant and Walton Goggins as the ultra cool Raglan Givens and the Incredibly charismatic Boyd Crowder, and their entire relationship and dynamic were bar-none masterful, and one of the most complex, and riveting duos I've ever seen. The final scene sums up pretty much the entire show and their relationship and it was incredible. The cinematography and music were also all very great, and I also really appreciate that they didn't insert sjw politics etc, for the most part, so in summary, I'm very happy with this show, and rate it 8.5/10."
    },
    {
      "username": "MNKim1967",
      "userUrl": "https://www.imdb.com/user/ur81658256",
      "reviewLink": "https://www.imdb.com/review/rw5624017",
      "warningSpoilers": false,
      "date": "9 April 2020",
      "rate": "9",
      "helpful": "12 out of 12 found this helpful.",
      "title": "\"Justified\", a show I loved to hate.",
      "content": "In a nutshell, I loved to hate \"Justified\". The only reason it came to my attention after multiple years of being a completed series is because it kept showing up in my Hulu queue as something I might be interested in, so, eventually, I tuned in and kept tuning in because of the excellent casting and acting, dialogue, and overall production; in other words, it really is a great series. Why did I love to hate it?; because the \"bad guys\" won a lot more than the \"good guys\". \"Justified\" is essentially a \"Wild, Wild West\" drama relocated to the hills of Kentucky where gold and black gold have been replaced by the illicit drug trade and greed and abject poverty keep the wheels constantly greased; bodies drop like matchsticks and life is basically worthless to those around you who's only moral code is \"don't get caught\", and most don't because many of the \"powers that be\" are either in on it, or, just don't care. Sounds depressing, I know, and, sometimes, I could only watch an episode at a time, however, I continued to watch it until the end (there were also times I could swear the banjo from \"Deliverance\" was going to play which gives credence to the quality of production). I'd recommend at least tuning in once - you might like it."
    },
    {
      "username": "gabo_alepb",
      "userUrl": "https://www.imdb.com/user/ur68134243",
      "reviewLink": "https://www.imdb.com/review/rw5663683",
      "warningSpoilers": true,
      "date": "22 April 2020",
      "rate": "9",
      "helpful": "12 out of 13 found this helpful.",
      "title": "A 21th century Western",
      "content": "Seasons 2,3,4 and 6 awesome Season 5 regular Season 1 still finding it's soul. One of the best final episode of all tv shows I've seen. Is season 7 really necessary? I don't think so. The finale ended the storyline in a sublime fashion."
    },
    {
      "username": "interestingstuff",
      "userUrl": "https://www.imdb.com/user/ur61866820",
      "reviewLink": "https://www.imdb.com/review/rw8496605",
      "warningSpoilers": false,
      "date": "29 August 2022",
      "rate": "8",
      "helpful": "25 out of 33 found this helpful.",
      "title": "It's watchable",
      "content": "Pros-Great acting by many actors especially Timothy Olyphant, Walton Goggins, Natalie Zea and Jeremy Davies.-Great choice of music and excellent soundtrack.-Great atmosphere and cinematics.-Funny and entertaining dialogue. Interesting characters with multiple sides.Cons:-Extremely confusing story that's difficult to follow at times because so many things happening at once and how it jumps from place to place without proper transition. The story jumps around so much that if you blink once while watching, you miss a major plot point. If you blink twice, you'll miss the whole story.-In every episode they introduce 5-10 new characters with complicated relationships and stories not to mention constantly shifting alliances which makes it even more difficult to follow the story. You'll literally have to watch each episode 2-3 times just to be able to follow what's going on and you'll still miss 70% of what's going on.-Most characters talk with a forced and fake southern accent and talk extremely fast in a way that you'll miss a lot of dialogue if you don't turn on subtitles. Also most characters constantly talk in riddles and idioms which looks cute at first but gets old quickly.-There are many times they sacrifice realism for storytelling. Sometimes it isn't too bad but there are times it gets too over the top like a cartoon.Overall:-Good acting, good cinematics, good music, bad writing. Still watchable. 7/10."
    },
    {
      "username": "Bobby1331",
      "userUrl": "https://www.imdb.com/user/ur156994986",
      "reviewLink": "https://www.imdb.com/review/rw8643766",
      "warningSpoilers": false,
      "date": "29 October 2022",
      "rate": "10",
      "helpful": "28 out of 29 found this helpful.",
      "title": "Just about perfect",
      "content": "What can you say about this incredible show that hasn't already been said? It's one of the best tv shows ever. This show will grab you and pull you in until the next thing you know you binged the entire series. Every episode is so incredibly written and the entire cast is perfect. Every season had such high expectations but it not only continued to meet those expectations but exceeded them season after season. There's really nothing I can say about this show that hasn't already been said. If you haven't seen this yet then do yourself a favor and go watch it as soon as possible. It's the perfect show."
    },
    {
      "username": "f_nastase",
      "userUrl": "https://www.imdb.com/user/ur40069654",
      "reviewLink": "https://www.imdb.com/review/rw3234578",
      "warningSpoilers": false,
      "date": "8 May 2015",
      "rate": "10",
      "helpful": "126 out of 132 found this helpful.",
      "title": "Definitely worth every second I've spent in front of the screen",
      "content": "Positively one of the best TV shows I've seen in years. I, for one, didn't cared as much about gun action( which by they way is abundant) as I did for the excellent dialogue and the acting. Acting in particular is extremely good, not one single character is out of his role, to be truthful even a dog if you see in a scene in this series, you get the feeling that it's exactly where that dog belongs to. As for the dialogue, it is so good, that it's actually the only flaw this show has. It seems very unlikely that all that crowd of cunning rednecks have such a large arsenal of polite irony, well placed quotes, to the border of well educated people and yet fall over and over to next man's scheme or simply go down by the hand of their own stupidity. Anyways I cannot up-vote this show enough and I can only suggest to make yourselves comfortable in any greasy sofa you have, and prepare to get ported to Harlan, Kentucky."
    },
    {
      "username": "WrongSinner",
      "userUrl": "https://www.imdb.com/user/ur31990993",
      "reviewLink": "https://www.imdb.com/review/rw2587937",
      "warningSpoilers": false,
      "date": "27 March 2012",
      "rate": "9",
      "helpful": "114 out of 120 found this helpful.",
      "title": "You should be watching this show",
      "content": "This is the most refreshing show I have found in a long time. When so much on TV falls into one box or another, Justified makes its own way. This has one of the strongest casts on television. Many of the recurring actors were written for only a few episodes. Then, they created such dynamic characters, they have been brought back time and again. Walton Goggins and Tim Olyphant (as well as their supporting cast) are sincerely underrated as actors. They carry every scene they are in and when they are together, it is impossible to turn away.There is a wit and humor to this show. It keeps you on the edge of your seat with suspense and then will zing a one-liner at you. I've never laughed and cringed so much in my life.I am so glad this was renewed for a fourth season and it is the only show I care about watching.If you are going to check it out, make sure you watch whatever season you pick from the beginning. Season one had many stand alone episodes. However, season two and season three involved complex plots that slowly burned into sensational finales. If you try to jump into the middle you may not enjoy it because of the subtle complexities in the plots.Please check it out because it is one of the best dramas on television with a sensational cast."
    },
    {
      "username": "Mr-Fusion",
      "userUrl": "https://www.imdb.com/user/ur1994077",
      "reviewLink": "https://www.imdb.com/review/rw3639144",
      "warningSpoilers": false,
      "date": "13 February 2017",
      "rate": "10",
      "helpful": "16 out of 21 found this helpful.",
      "title": "Hat and shoulders above the rest",
      "content": "\"Justified\" had real promise when it first started. It wasn't just a cop show, but also a bit of a Western. with old-fashioned lawman Raylan Givens chasing down modern fugitives. He's kind of a dick, but the best kind: a charming one. And Timothy Olyphant was (is) perfect for this role. But just beyond that first season, the show became serialized and blossomed into an honest-to-god crime drama. This is exactly why it became one of my all-time favorite TV shows; it was quietly riveting week-in and week-out. But it was also a world full of entertaining characters and a cast to match. Walton Goggins proved to be Olyphant's equal as his primary opposition (and a show highlight), and this Kentucky underworld is one I often couldn't wait to return to. Put simply, it's an Elmore Leonard joint, complete with his ear- candy dialog and offbeat characters; and that's enough for me. But they went and made it one of the funniest, engaging and rewarding shows I've ever seen. 10/10"
    },
    {
      "username": "avalosraul",
      "userUrl": "https://www.imdb.com/user/ur70640055",
      "reviewLink": "https://www.imdb.com/review/rw6435323",
      "warningSpoilers": false,
      "date": "2 January 2021",
      "rate": "10",
      "helpful": "18 out of 20 found this helpful.",
      "title": "Timothy Olyphant IS RAYLAN GIVENS",
      "content": "You have to watch this show. Nothing else to be said just watch the show."
    }
  ],
  "errorMessage": ""
}