{
  "imDbId": "tt1489428",
  "title": "Justified",
  "fullTitle": "Justified (TV Series 2010–2015)",
  "type": "TVSeries",
  "year": "2010",
  "language": "en",
  "titleInLanguage": "Justified (TV series)",
  "url": "https://en.wikipedia.org/wiki/Justified_(TV_series)",
  "plotShort": {
    "plainText": "Justified is an American neo-Western crime drama television series that premiered on March 16, 2010, on the FX network. Developed by Graham Yost, it is based on Elmore Leonard's stories about the character Raylan Givens, particularly \"Fire in the Hole\". Timothy Olyphant portrays Raylan Givens, a tough deputy U.S. Marshal enforcing his own brand of justice. The series revolves around the inhabitants and culture in the Appalachian mountains area of eastern Kentucky, specifically Harlan County where many of the main characters grew up. It also features Lexington, Kentucky, where the local U.S. Marshals office is situated. The series, comprising 78 episodes, was aired over six seasons and concluded on April 14, 2015.\r\nJustified received critical acclaim throughout most of its run, and has been listed by several publications as one of the best shows of the 2010s. Its acting, directing, art direction, and writing were praised, as were the performances of Olyphant and Walton Goggins. Justified was nominated for eight Primetime Emmy Awards, with two wins, for Margo Martindale's performance as Mags Bennett and Jeremy Davies' performance as Dickie Bennett.\r\nIn January 2022, FX announced Justified: City Primeval, a limited sequel series with Olyphant reprising his role as Raylan Givens. It is set to premiere in mid-2023.",
    "html": "<p>Justified is an American neo-Western crime drama television series that premiered on March 16, 2010, on the FX network. Developed by Graham Yost, it is based on Elmore Leonard's stories about the character Raylan Givens, particularly \"Fire in the Hole\". Timothy Olyphant portrays Raylan Givens, a tough deputy U.S. Marshal enforcing his own brand of justice. The series revolves around the inhabitants and culture in the Appalachian mountains area of eastern Kentucky, specifically Harlan County where many of the main characters grew up. It also features Lexington, Kentucky, where the local U.S. Marshals office is situated. The series, comprising 78 episodes, was aired over six seasons and concluded on April 14, 2015.</p><p>Justified received critical acclaim throughout most of its run, and has been listed by several publications as one of the best shows of the 2010s. Its acting, directing, art direction, and writing were praised, as were the performances of Olyphant and Walton Goggins. Justified was nominated for eight Primetime Emmy Awards, with two wins, for Margo Martindale's performance as Mags Bennett and Jeremy Davies' performance as Dickie Bennett.</p><p>In January 2022, FX announced Justified: City Primeval, a limited sequel series with Olyphant reprising his role as Raylan Givens. It is set to premiere in mid-2023.</p>"
  },
  "plotFull": {
    "plainText": "Justified is an American neo-Western crime drama television series that premiered on March 16, 2010, on the FX network. Developed by Graham Yost, it is based on Elmore Leonard's stories about the character Raylan Givens, particularly \"Fire in the Hole\". Timothy Olyphant portrays Raylan Givens, a tough deputy U.S. Marshal enforcing his own brand of justice. The series revolves around the inhabitants and culture in the Appalachian mountains area of eastern Kentucky, specifically Harlan County where many of the main characters grew up. It also features Lexington, Kentucky, where the local U.S. Marshals office is situated. The series, comprising 78 episodes, was aired over six seasons and concluded on April 14, 2015.\r\nJustified received critical acclaim throughout most of its run, and has been listed by several publications as one of the best shows of the 2010s. Its acting, directing, art direction, and writing were praised, as were the performances of Olyphant and Walton Goggins. Justified was nominated for eight Primetime Emmy Awards, with two wins, for Margo Martindale's performance as Mags Bennett and Jeremy Davies' performance as Dickie Bennett.\r\nIn January 2022, FX announced Justified: City Primeval, a limited sequel series with Olyphant reprising his role as Raylan Givens. It is set to premiere in mid-2023.\r\nPlot\r\nDeputy U.S. Marshal Raylan Givens is something of a 19th-century-style, Old West lawman living in modern times. His unconventional enforcement of justice makes him a target of criminals and a problem child to his U.S. Marshals Service superior. In response to his controversial but \"justified\" quick-draw shooting of mob hitman Tommy Bucks in Miami, Givens is reassigned to the Eastern District of Kentucky Marshal's Office, which is based in Lexington. This jurisdiction includes Harlan County, where Raylan was born and raised and which he thought he had escaped for good in his youth.\r\nSeason 1\r\nThe story arc of season one concentrates on the crimes of the Crowder family. Raylan seeks to protect Ava Crowder (Joelle Carter) from the rest of the Crowder clan after she shoots and kills her husband, Bowman Crowder, in retaliation for years of abuse. Her biggest threat initially comes from Boyd Crowder (Walton Goggins), a local criminal masquerading as a white supremacist whom Raylan shoots in a stand-off. Boyd survives the shot to the chest and claims it is a sign from God that he should change his ways. Raylan hesitates to believe him, but Boyd is soon sent to prison, where he spends his time reading the Bible and preaching to convicts. The season builds towards the release of family patriarch Bo (M. C. Gainey), who wishes to rebuild his family's drug trade and to settle old scores, including one with Raylan's father, Arlo (Raymond J. Barry), who has cheated him out of money. Bo's release is soon followed by Boyd's, after a technicality prevents him from being further incarcerated. While Bo works on gaining dominance over the local drug trade, Boyd collects a camp of spiritually reformed criminals whom he trains to blow up meth houses in the county to \"clean up Harlan\". The explosions cause a few casualties, leading Raylan and the other U.S. Marshals to keep an eye on the team.\r\nIn the meantime, Raylan is dealing with personal dilemmas, including working in the same building as his ex-wife (Natalie Zea), for whom he still has feelings. His continuing visits to Harlan are peppered with small crimes and big shootings, and his success in dealing with these matters draws Bo's attention. Bo promises the niece and nephew of Gio Reyes, head of a Miami drug cartel, that he will deliver Raylan to them in exchange for a large shipment of drugs. Boyd catches word of this and, with his \"flock\" of reformed prisoners, blows up the truck carrying the shipment, leading the niece and nephew to hold Bo accountable for the damages. This leads Bo to go to Boyd's camp and threaten to kill his own son, illustrating the harsh family relations that provide some insight into how Boyd turned out the way he has. Instead of killing Boyd, Bo offers his son the option to abandon his group, after which Bo will leave all of them alone. Boyd walks away into the forest. He hears gunshots and returns to see that all of his followers have been killed. This sends him to Raylan's door depressed, saying he will help Raylan find Bo as long as he is allowed to be the one to kill him.\r\nAn earlier plan is foiled, involving Arlo's shooting Raylan, to deliver Raylan into Bo's clutches, then handing him over to Gio, but Bo has taken Ava hostage. This is the turning point that drives Boyd and Raylan to join forces for the first time, and Boyd leads him to the Crowder cabin. There, Raylan manages to kill one of Bo's henchmen. As Raylan and Bo are walking to the cabin, Boyd appears ready to shoot and kill Bo. Before Boyd has an opportunity, Bo is shot and killed by a sniper, who then starts shooting at Raylan and Boyd, who take cover in the cabin. They discover they are surrounded by Gio's niece and nephew plus two other gunmen, who then attack the cabin with machine guns. Boyd, Ava, and Raylan are trapped; the niece and nephew demand Raylan be turned over to them.\r\nAfter Boyd attempts to pass himself off as Raylan, and Raylan kills two of the gunmen, Raylan tells Boyd and Ava to leave out the back way, and he walks forward, hands in the air. As the niece steps out from behind her car, the nephew attempts to shoot Raylan, Boyd shoots the nephew, and the niece drives away. Boyd wants to chase her, but Raylan stops him, saying it is against the law. However, Boyd absconds in Bo's car, but doesn't use violence. This signifies the beginning of an uneasy friendship between the two characters that will continue throughout the series.\r\nSeason 2\r\nSeason 2 deals primarily with the criminal dealings of the Bennett clan. Family matriarch Mags Bennett (Margo Martindale) and her three sons Dickie (Jeremy Davies), Coover (Brad William Henke), and Doyle (Joseph Lyle Taylor), Chief of Bennett Hollow Police, plan to expand their marijuana business into Crowder territory following Bo's death, as Boyd has proven somewhat reluctant to follow in his father's footsteps. Raylan gets involved in the struggle between the two criminal organizations, and because of a long-standing feud between the Givens and Bennett families centering on an incident between Raylan and Dickie in their youth (which left Dickie with a lame leg), matters grow very complicated, with the pair's pasts catching up with them. Meanwhile, an effort by a mining conglomerate to secure access rights to the mountain results in Raylan and Boyd becoming involved on opposite sides of the operation. This provokes a local backlash against the Bennetts, after Boyd reveals Mags' secret involvement in negotiations with the conglomerate, to the detriment of her neighbors.\r\nSeason 3\r\nSeason 3 introduces a new main villain, Robert Quarles (Neal McDonough) of Detroit. The criminal organization connected to the Frankfort, Kentucky mob has exiled Quarles to Kentucky. Quarles allies himself with local enforcer Wynn Duffy (Jere Burns) and begins to supplant the local criminals when Raylan begins investigating. Quarles' efforts also bring him into conflict with Boyd's group, resulting in the deaths of several locals. Simultaneously, Dickie Bennett, the lone survivor of the Bennett clan, seeks the aid of the black residents of Noble's Holler and their leader, Ellstin Limehouse (Mykelti Williamson), to recover his inheritance. Limehouse attempts to keep his people out of the struggle between the criminal groups but becomes involved when Boyd gets the upper hand on Quarles, leading to a series of betrayals and deaths.\r\nSeason 4\r\nSeason 4 is about a mystery which was left unsolved for 30 years. On January 21, 1983, a man wearing a defective parachute plummets onto a residential street in Corbin, Kentucky, dying instantly. His body is surrounded by bags full of cocaine and an ID tag for a \"Waldo Truth\". Raylan learns of the mystery when a vintage diplomatic bag is found hidden at Arlo's house containing only Waldo Truth's ID tag. Further investigation indicates that the parachutist died and Raylan's father Arlo hid the bag, but he refuses to divulge any information.\r\nAs the investigation continues to unfold, information is revealed that could lead to the arrest of a major mafia figure. Raylan is now living above a bar and attempting to stash extra money away to provide for his unborn child and is in a questionable relationship with the bartender, Lindsey Salazar. Boyd Crowder seeks to expand his empire with help from an old army buddy Colton \"Colt\" Rhodes (Ron Eldard). Boyd's efforts are complicated by the arrival of a snake handling revival preacher named Billy St. Cyr (Joe Mazzello). Billy's success is cutting into Boyd's profits, as his users and dealers are getting hooked on faith instead of drugs. Boyd's cousin Johnny (David Meunier) grows ever more resentful of Boyd's success and plans to betray him to Wynn Duffy. Boyd's ambition has him force a deal with Duffy that involves Boyd chasing down leads in the same parachutist mystery, eventually bringing Boyd to an unexpected crossroads that threatens his personal or professional destruction.\r\nSeason 5\r\nSeason 5 features the alligator-farming Crowe crime family, led by Darryl Crowe Jr. (Michael Rapaport). Jere Burns, who recurred in the first four seasons as Wynn Duffy, was made a series regular.\r\nSeason 6\r\nSeason 6 revolves around the culmination of Raylan and Boyd's rivalry, complicated by Ava's betrayal, the machinations of Avery Markham (Sam Elliott), and a plot to rob him by Boyd, Wynn Duffy and Markham's secret adversary. Boyd succeeds in robbing Markham, but Raylan's plan to entrap him with Ava's help has tragic consequences. Raylan's job, life, and future are all threatened in a way they have never been before.\r\nCast and characters\r\nMain cast\r\nTimothy Olyphant as Deputy U.S. Marshal Raylan Givens, a lawman who, after making headlines killing a fugitive, is sent to Kentucky, where he gets deeply involved in the criminal element of his hometown. Raylan was born and raised in Harlan, Kentucky, where his father was a well-known career criminal. Raylan suffered emotional and likely physical abuse from his father, Arlo. During high school, Raylan played baseball and eventually went to work in the Kentucky coal mines, where he worked with Boyd Crowder. Raylan went to college with money given to him by his aunt. After graduating he became a deputy U.S. Marshal, driving him back to Kentucky. He is divorced from Winona Hawkins, a court stenographer, and is often involved with a variety of women. Raylan is known for wearing a distinctive cowboy hat.\r\nNick Searcy as Chief Deputy U.S. Marshal Art Mullen, who knows Raylan from Glynco. He generally follows the law, but gives Raylan some leeway when he trusts his judgment. Art is more of a father figure to Raylan than Arlo, but becomes distrustful of him after he demonstrates his inability to separate his personal and professional lives, frequently crossing the line between right and wrong.\r\nJacob Pitts as Deputy U.S. Marshal Tim Gutterson, a sardonic former Army Ranger sniper who is generally unimpressed by Raylan's antics. Art worries that Tim bottles up his PTSD and is likely to blow at any minute.\r\nErica Tazel as Deputy U.S. Marshal Rachel Brooks, a straight-and-narrow marshal who frequently lashes at Raylan, claiming that he wouldn't get away with his behavior if he weren't white, a man, and handsome.\r\nJoelle Carter as Ava Crowder, a woman from Harlan who grew up with Raylan and Boyd. Prior to the events of the show, she was married to Boyd's abusive brother Bowman, whom she killed. As the show progresses, Ava becomes central to Harlan's crime syndicate in her own right.\r\nNatalie Zea as Winona Hawkins (seasons 1–3; recurring seasons 4, 6; guest season 5), Raylan's ex-wife. At the show's start, she is married to Gary Hawkins, a real estate agent. She works at the same courthouse as Raylan as a court stenographer. She still loves Raylan, but does not trust him as a safe choice given his profession and his tendency to get into trouble.\r\nWalton Goggins as Boyd Crowder (seasons 2–6; recurring season 1), the son of one of Harlan's biggest career criminals. Boyd is known for robbing banks and using pyrotechnics, which brings Raylan, with whom he used to dig coal, back to Harlan. At the start of the series Boyd goes from a member of a white supremacist group to a born again Christian, though he later moves on to attempting to control Harlan's criminal underground.\r\nJere Burns as Wynn Duffy (seasons 5–6; guest seasons 1–2; recurring seasons 3–4), a shady Dixie Mafia businessman who travels around in a motor home and who becomes involved in Harlan crime.\r\nRecurring cast\r\nDavid Meunier as Johnny Crowder (seasons 1–5), Boyd's cousin.\r\nRaymond J. Barry as Arlo Givens (seasons 1–4, 6), Raylan's father and a criminal who often worked with Bo Crowder, but who is now suffering from a form of dementia.\r\nRick Gomez as Assistant U.S. Attorney David Vasquez (seasons 1, 3–6), who works with Art, Raylan, and the other Kentucky marshals.\r\nM. C. Gainey as Bo Crowder (season 1), Boyd's father who is released from jail.\r\nBrent Sexton as Sheriff Hunter Mosley (seasons 1, 4), the Harlan sheriff. He grew up with Raylan.\r\nDamon Herriman as Dewey Crowe (seasons 1–3, 5–6), a Harlan stooge who works with Boyd.\r\nLinda Gehringer as Helen Givens (seasons 1–3), Arlo's second wife and Raylan's aunt. Her sister was Frances, Arlo's first wife and Raylan's mother.\r\nWilliam Ragsdale as Gary Hawkins (seasons 1–3), Winona's second husband, a real estate agent who gets into trouble with Wynn Duffy.\r\nKevin Rankin as Derek \"Devil\" Lennox (seasons 1–3), one of Boyd's associates.\r\nStephen Root as Judge Mike Reardon (seasons 1–3, 5), the judge Winona works for, known for his strange habits such as wearing nothing but a gun and Speedo swimming trunks under his judge robes.\r\nMel Fair as Deputy U.S. Marshal Nelson Dunlop (seasons 1–6)\r\nKaitlyn Dever as Loretta McCready (seasons 2–3, 5–6), a no-nonsense teen involved in the weed business who is taken under Mags Bennett's care after her father dies, and whom Raylan is a father figure to.\r\nJim Beaver as Sheriff Shelby Parlow/Drew Thompson (seasons 2–4), a former lawman who runs for Sheriff at the behest of Boyd.\r\nAbby Miller as Ellen May (seasons 2–4, 6), a dim prostitute who works at Audrey's.\r\nJeremy Davies as Dickie Bennett (seasons 2–3, 5–6), Mags Bennett's middle son, who has had a feud with Raylan since a high school baseball game.\r\nMargo Martindale as Mags Bennett (season 2), the matriarch of the Bennett family.\r\nJoseph Lyle Taylor as Doyle Bennett (season 2), Mags' son who is also a Police Chief of a small town, just outside of Harlan.\r\nBrad William Henke as Coover Bennett (season 2), Mags' youngest, dense son with anger issues.\r\nPeter Murnik as Kentucky State Police Trooper Tom Bergen (seasons 2–3), a state police officer who works with Raylan.\r\nJames LeGros as Wade Messer (seasons 2–3, 5), a Harlan man who is easily bought.\r\nWilliam Gregory Lee as Sheriff Nick Mooney (seasons 2–5), an ill-tempered dirty cop who eventually becomes Harlan's sheriff.\r\nJonathan Kowalsky as Mike Cosmatopolis (seasons 2–6), Wynn's bodyguard and right-hand man.\r\nMickey Jones as Rodney \"Hot Rod\" Dunham (seasons 2–3, 5), a weed dealer.\r\nMykelti Williamson as Ellstin Limehouse (seasons 3–4, 6), a prominent man in Harlan's black community who owns a butcher shop and BBQ joint, and is also known for his ability to help out those who need it, if they can pay.\r\nNeal McDonough as Robert Quarles (season 3), the sadistic surrogate son of Detroit crime bigwig Theo Tonin who is sent to be his eyes in Kentucky.\r\nDavid Andrews as Sheriff Tillman Napier (seasons 3–4), who hosts swinger parties for Harlan's wealthy.\r\nBrendan McCarthy as Tanner Dodd (season 3), an associate of Robert Quarles.\r\nDemetrius Grosse as Errol (seasons 3, 6), one of Limehouse's employees.\r\nTodd Stashwick as Ash Murphy (season 3), a corrupt prison guard who helps Dickie Bennett and Dewey Crowe out of prison.\r\nJenn Lyon as Lindsey Salazar (seasons 3–4), the bartender at the bar Raylan frequents and eventually lives above.\r\nJesse Luken as Jimmy Tolan (seasons 3–5), one of Boyd's men. He is Boyd's favorite and most trusted soldier, and Boyd regards him as family.\r\nRon Eldard as Colton Rhodes (season 4), a former member of the Military Police whom Boyd knows from their days in the army.\r\nJoe Mazzello as Billy St. Cyr (season 4), a tent-revival pastor who comes into Harlan and causes trouble for Boyd.\r\nLindsay Pulsipher as Cassie St. Cyr (season 4), the sister of revivalist Billy St. Cyr.\r\nPatton Oswalt as Constable Bob Sweeney (seasons 4, 6), a bumbling law enforcement officer who aspires to be like Raylan but lacks skill and a lot of common sense.\r\nSam Anderson as Lee Paxton (seasons 4–5), a funeral director who is one of Harlan's elite and a member of Napier's swingers' club.\r\nMike O'Malley as Nick \"Nicky\" Augustine (season 4), one of Tonin's most trusted soldiers.\r\nRobert Baker as Randall Kusik (season 4), Lindsey Salazar's husband and cockfighting entrepreneur.\r\nBrian Howe as Arnold (season 4), a client of Ellen May's who is also a member of Napier's swingers' club.\r\nJohn Kapelos as Ethan Picker (seasons 4–5), a henchman of Nick Augustine's.\r\nMichael Rapaport as Darryl Crowe Jr. (season 5), Dewey's cousin and head of the Florida contingent of the Crowe family.\r\nA. J. Buckley as Danny Crowe (season 5), Darryl's brother.\r\nAlicia Witt as Wendy Crowe (season 5), Darryl's sister and a paralegal.\r\nEdi Gathegi as Jean Baptiste (season 5), a Haitian croc hunter who works with the Crowe family.\r\nJacob Lofland as Kendal Crowe (season 5), Wendy's son who grows up thinking he's her brother.\r\nAmy Smart as Alison Brander (season 5), Kendal's child services caseworker, who gets involved with Raylan.\r\nSteve Harris as Roscoe (season 5), one of Rodney Dunham's drug enforcers.\r\nWood Harris as Jay (season 5), Roscoe's brother.\r\nDon McManus as Billy Geist (seasons 5–6), Ava's lawyer.\r\nKarolina Wydra as Mara Paxton (season 5), Lee's wife.\r\nDanielle Panabaker as Penny Cole (season 5), an incarcerated woman whom Ava befriends.\r\nMary Steenburgen as Katherine Hale (seasons 5–6), a crime lord's widow whose past connects with Wynn Duffy's.\r\nJustin Welborn as Carl (seasons 5–6), one of Boyd's henchmen.\r\nBill Tangradi as Cyrus Boone (seasons 5–6), a drug distributor.\r\nDanny Strong as Albert Fekus (seasons 5–6), a prison guard who pretends Ava attacked him to get her locked up.\r\nSam Elliott as Avery Markham (season 6), a big-time Colorado weed grower who moves back to Kentucky to reconnect with Katherine Hale.\r\nGarret Dillahunt as Ty Walker (season 6), a security expert and former soldier who works as one of Avery's enforcers.\r\nJeff Fahey as Zachariah Randolph (season 6), Ava's uncle.\r\nJonathan Tucker as Boon (season 6), one of Markham's men who takes a particular interest in Loretta.\r\nRyan Dorsey as Earl (season 6), Carl's brother.\r\nScott Grimes as Sean/Seabass (season 6), one of Markham's enforcers.\r\nDuke Davis Roberts as Mundo/Choo-Choo (season 6), one of Markham's enforcers who suffered brain damage after an incident in the army.\r\nEpisodes\r\nProduction\r\nOriginally titled Lawman, Justified was given a 13-episode order by FX on July 28, 2009, and premiered on March 16, 2010. The first episode was referred to as the \"Fire in the Hole pilot\" during shooting and retains this as the name of the episode itself. FX renewed the show for a second season, which premiered on February 9, 2011. A third season of 13 episodes was announced on March 29, 2011, and premiered January 17, 2012. A fourth season of 13 episodes was announced on March 6, 2012, and premiered January 8, 2013. The show was renewed for a fifth season, which premiered on January 7, 2014. On January 14, 2014, the series was renewed for a sixth and final season, which premiered on January 20, 2015.\r\nFilming\r\nWhile the pilot was shot in Pittsburgh and suburban Kittanning and Washington, Pennsylvania, the subsequent 38 episodes were shot in California. The small town of Green Valley, California often doubles for Harlan, Kentucky. In the pilot, Pittsburgh's David L. Lawrence Convention Center appears on film as the small town \"airport\", and the construction of the new Consol Energy Center serves as the \"new courthouse\".\r\nThe series began filming using the EPIC camera, manufactured by Red Digital Cinema Camera Company, with the third season. Director of photography Francis Kenny said, \"We persuaded Sony Entertainment that by shooting with Epic cameras production would be increased tenfold and it would look spectacular.\" After filming the first two episodes of the season, Kenny said, \"Episode one of season three is now complete and our dreams have come true. The show looks better than ever and the producers are now true believers of the Red System.\"\r\nCrew\r\nGraham Yost developed the series for television based on the character U.S. Marshal Raylan Givens, with the onscreen credit giving the source as Leonard's short story \"Fire in the Hole\". Both Yost and Leonard are credited as executive producers on the project. Yost is also the series head writer and showrunner. Other executive producers for the series include Sarah Timberman, Carl Beverly, and Michael Dinner. Dinner also directed the series pilot, the second episode of the first season, and the second-season finale.\r\nCasting\r\nThe character of Boyd was intended to die in the pilot episode, but producer Yost kept the character when test audiences liked Walton Goggins performance. Goggins was promoted to main cast from season 2 onward. The Rachel character, as played by Erica Tazel, was included by Elmore Leonard in his final novel, Raylan.\r\nTheme song\r\nThe show's theme song, \"Long Hard Times to Come\", was performed by the New York City–based Gangstagrass and produced by Rench, and features rapper T.O.N.E-z, Matt Check on banjo, Gerald Menke on resonator guitar, and Jason Cade on fiddle. The song was nominated for a 2010 Emmy Award for Outstanding Original Main Title Theme Music.\r\nCancellation\r\nThe decision to end the show was primarily based on lead actor Timothy Olyphant and series developer Graham Yost. FX network president John Landgraf said, \"They felt that the arc of the show and what they had to say would be best served by six seasons instead of seven. Regretfully, I accepted their decision.\" Yost's comments were \"Our biggest concern is running out of story and repeating ourselves. This was a long conversation. There were financial incentives to keep going, but it really felt, in terms of story, that six years felt about right.\"\r\nReception\r\nRatings\r\nThe pilot episode that aired on March 16, 2010, was watched by 4.2 million viewers and was the highest debut show for FX since The Shield.\r\nCritical reception\r\nThroughout its run, Justified received largely positive reviews from critics. On the review aggregation website Metacritic, all seasons except the first received a score indicating \"universal acclaim.\" Author Elmore Leonard ranked Justified as one of the best adaptations of his work, which includes Get Shorty, Jackie Brown, 3:10 to Yuma and Out of Sight. Leonard also praised the casting of Olyphant as Raylan, describing the actor as \"the kind of guy I saw when I wrote his lines.\"\r\nThe first season was positively received. The critical consensus for the season on Rotten Tomatoes reads, \"A coolly violent drama, Justified benefits from a seductive look and a note-perfect Timothy Olyphant performance.\" TV Guide critic Matt Roush said, \"The show is grounded in Olyphant's low-key but high-impact star-making performance, the work of a confident and cunning leading man who's always good company.\" Chicago Tribune critic Maureen Ryan stated, \"The shaggily delightful dialogue, the deft pacing, the authentic sense of place, the rock-solid supporting cast and the feeling that you are in the hands of writers, actors and directors who really know what they're doing—all of these are worthy reasons to watch Justified.\" Jesse Damiani of HuffPost referred to the show's dialogue as \"best-in-television,\" explaining, \"What this quality of dialogue accomplishes...is crafting Harlan County as its own character, a place where wit and strategy are currency, weaponry, and protection in a bleak economic landscape.\" Mike Hale of The New York Times noted the show's \"modest virtues\", but was critical of the first season's pace and characterization, writing: \"Justified can feel so low-key that even the crisis points drift past without making much of an impression... It feels as if the attention that should have gone to the storytelling all went to the atmosphere and the repartee.\"\r\nEric Dodds of Time suggested the first episodes were too procedural to \"crack the upper echelon\" of prestige television dramas. Critics did note that the characters played by Jacob Pitts and Erica Tazel, Tim Gutterson and Rachel Brooks respectively, remained underutilized throughout the show's run.\r\nThe second season received increased acclaim. The critical consensus for the second season on Rotten Tomatoes reads, \"Justified finds its footing in its second season with an expanded cast of characters that enriches its seedy world.\" Robert Bianco of USA Today praised Margo Martindale's performance, stating: \"Like the show itself, Margo Martindale's performance is smart, chilling, amusing, convincing and unfailingly entertaining. And like the show, you really don't want to miss it.\" Slant Magazine critic Scott Von Doviak observed, \"Justified's rich vein of gallows humor, convincing sense of place, and twisty hillbilly-noir narratives are all selling points, but it's Olyphant's devilish grin that seals the deal.\"\r\nThe third season continued to receive acclaim, with Rotten Tomatoes' critical consensus reading, \"Justified continues to dispense its brand of spare dialogue and sudden violence, culminating in a very satisfying finale.\" Jeremy Enger of The New York Times said the series \"captures his darkly funny, morally murky tone and spikes the traditional crime procedural with hooch and Oxycontin, tracking its hero's attempts to thwart colorful drug dealers and gunrunners and negotiate his own fractured relationships. The series unspools in an oddly captivating alternate South peopled by whimsically twisted archetypes and marked by sudden shifts between folksy black comedy and graphic violence.\" Emily Nussbaum of The New Yorker was critical of the third season, writing: \"Extended storytelling has its own conventions and clichés, all of which appeared in Season 3... it echoed every cable drama, in the worst way.\" Verne Gay of Newsday said of the third season, \"Lean, laconic, precise and as carefully word-crafted as any series on TV, there's pretty much nothing here to suggest that the third season won't be as good as the second – or better.\"\r\nFor the fourth season, Rotten Tomatoes' critical consensus is, \"Bolstered by witty, efficient dialogue and confident storytelling, Justified makes a strong case for consideration among cable television's top dramas.\" Tom Gliatto of People Weekly wrote, \"What gives the show its kick is the gleefully childish lack of repentance shown by most of these rascals—countered by Olyphant's coolly amused control.\" Verne Gay of Newsday found that \"Character—as the old saying goes—is a long-standing habit, and their habits remain very much intact. The same could be said of Justified.\" Chuck Bowen of Slant Magazine found that \"Justified is the strongest, liveliest, and most tonally accurate adaptation of the writer's work to date, and the latest season bracingly suggests that isn't likely to change anytime soon.\"\r\nThe fifth season proved to be less popular, although it continued to receive positive reviews. Tim Goodman of The Hollywood Reporter considered the season to be \"a stretch on all fronts\" and Eric Dodds of Time complained the season didn't spend enough time with its characters. Rotten Tomatoes' critical consensus for this season reads, \"Justified continues to bring the shock value with clever storylines and a potent blend of comedy and drama.\" When discussing what worked well and less well with the season, showrunner Yost noted how the unexpected departure of actor Edi Gathegi (playing Jean Baptiste) \"upset the balance of the season\", but also how it led to the prominence of the character of young Kendall Crowe (played by Jacob Lofland).\r\nThe sixth and final season once again received critical acclaim. Rotten Tomatoes' critical consensus reads \"Justified returns to form for its endgame, rebounding with crisp storytelling and colorful characters who never take themselves too seriously.\" Critics generally considered the series finale to be a very satisfying conclusion according to Rotten Tomatoes' roundup.\r\nAccolades\r\nJustified received a 2010 Peabody Award. The series has received eight Primetime Emmy Award nominations. For the first season, the series received a single nomination, for Outstanding Original Main Title Theme Music. For the second season, it received four acting nominations for the 63rd Primetime Emmy Awards—Timothy Olyphant for Outstanding Lead Actor in a Drama Series, Walton Goggins for Outstanding Supporting Actor in a Drama Series, Margo Martindale for Outstanding Supporting Actress in a Drama Series, and Jeremy Davies for Outstanding Guest Actor in a Drama Series, with Martindale winning. For the third season, it received two nominations for the 64th Primetime Emmy Awards, with Jeremy Davies winning for Outstanding Guest Actor in a Drama Series, and a nomination for Outstanding Art Direction for a Single-Camera Series. For its fifth season, it received a nomination for Outstanding Art Direction for a Contemporary or Fantasy Series (Single-Camera). The sixth season received five nominations at the 5th Critics' Choice Television Awards, the most of any other programs nominated. It received nominations for Best Drama Series, Timothy Olyphant for Best Actor in a Drama Series, Walton Goggins for Best Supporting Actor in a Drama Series, Joelle Carter for Best Supporting Actress in a Drama Series and Sam Elliott for Best Guest Performer in a Drama Series, with Elliot winning.\r\nHome media\r\nThe DVD and Blu-ray sets were released in region 1 on January 18, 2011, for season one, January 3, 2012, for season two, December 31, 2012, for season three, December 17, 2013, for season four, December 2, 2014, for season five, and June 2, 2015, for season six.\r\nJustified: City Primeval\r\nIn March 2021, FX and various Justified writers including Graham Yost began development on a drama series based on Elmore Leonard's novel City Primeval. Timothy Olyphant was also set to reprise his role as Raylan Givens.\r\nIn January 2022, FX greenlit the limited series and confirmed Olyphant would reprise his role. Several of the original Justified writers and producers are involved; showrunners for City Primeval are Dave Andron and Michael Dinner, with Dinner also directing. Other executive producers include Olyphant, Yost, Sarah Timberman, Carl Beverly and Peter Leonard, with the writing staff consisting of Taylor Elmore, Chris Provenzano, Walter Mosley, V.J. Boyd, Eisa Davis and Ingrid Escajeda. The limited series is set eight years after the original series and sees Givens, who is now living in Florida working as a marshal, go to Detroit after crossing paths with a violent sociopath named Clement Mansell. In February 2022, it was revealed that Quentin Tarantino was in talks to direct episodes of the series.\r\nFilming began in Chicago on May 4, 2022. Alongside Olyphant, the series also stars Aunjanue Ellis, Boyd Holbrook, Adelaide Clemens, Vondie Curtis-Hall, Marin Ireland, Norbert Leo Butz, Victor Williams, and Vivian Olyphant (Timothy Olyphant's real-life daughter). It is set to premiere in mid-2023.",
    "html": "<p>Justified is an American neo-Western crime drama television series that premiered on March 16, 2010, on the FX network. Developed by Graham Yost, it is based on Elmore Leonard's stories about the character Raylan Givens, particularly \"Fire in the Hole\". Timothy Olyphant portrays Raylan Givens, a tough deputy U.S. Marshal enforcing his own brand of justice. The series revolves around the inhabitants and culture in the Appalachian mountains area of eastern Kentucky, specifically Harlan County where many of the main characters grew up. It also features Lexington, Kentucky, where the local U.S. Marshals office is situated. The series, comprising 78 episodes, was aired over six seasons and concluded on April 14, 2015.</p><p>Justified received critical acclaim throughout most of its run, and has been listed by several publications as one of the best shows of the 2010s. Its acting, directing, art direction, and writing were praised, as were the performances of Olyphant and Walton Goggins. Justified was nominated for eight Primetime Emmy Awards, with two wins, for Margo Martindale's performance as Mags Bennett and Jeremy Davies' performance as Dickie Bennett.</p><p>In January 2022, FX announced Justified: City Primeval, a limited sequel series with Olyphant reprising his role as Raylan Givens. It is set to premiere in mid-2023.</p><br/><h3>Plot</h3><p>Deputy U.S. Marshal Raylan Givens is something of a 19th-century-style, Old West lawman living in modern times. His unconventional enforcement of justice makes him a target of criminals and a problem child to his U.S. Marshals Service superior. In response to his controversial but \"justified\" quick-draw shooting of mob hitman Tommy Bucks in Miami, Givens is reassigned to the Eastern District of Kentucky Marshal's Office, which is based in Lexington. This jurisdiction includes Harlan County, where Raylan was born and raised and which he thought he had escaped for good in his youth.</p><h4>Season 1</h4><p>The story arc of season one concentrates on the crimes of the Crowder family. Raylan seeks to protect Ava Crowder (Joelle Carter) from the rest of the Crowder clan after she shoots and kills her husband, Bowman Crowder, in retaliation for years of abuse. Her biggest threat initially comes from Boyd Crowder (Walton Goggins), a local criminal masquerading as a white supremacist whom Raylan shoots in a stand-off. Boyd survives the shot to the chest and claims it is a sign from God that he should change his ways. Raylan hesitates to believe him, but Boyd is soon sent to prison, where he spends his time reading the Bible and preaching to convicts. The season builds towards the release of family patriarch Bo (M. C. Gainey), who wishes to rebuild his family's drug trade and to settle old scores, including one with Raylan's father, Arlo (Raymond J. Barry), who has cheated him out of money. Bo's release is soon followed by Boyd's, after a technicality prevents him from being further incarcerated. While Bo works on gaining dominance over the local drug trade, Boyd collects a camp of spiritually reformed criminals whom he trains to blow up meth houses in the county to \"clean up Harlan\". The explosions cause a few casualties, leading Raylan and the other U.S. Marshals to keep an eye on the team.</p><p>In the meantime, Raylan is dealing with personal dilemmas, including working in the same building as his ex-wife (Natalie Zea), for whom he still has feelings. His continuing visits to Harlan are peppered with small crimes and big shootings, and his success in dealing with these matters draws Bo's attention. Bo promises the niece and nephew of Gio Reyes, head of a Miami drug cartel, that he will deliver Raylan to them in exchange for a large shipment of drugs. Boyd catches word of this and, with his \"flock\" of reformed prisoners, blows up the truck carrying the shipment, leading the niece and nephew to hold Bo accountable for the damages. This leads Bo to go to Boyd's camp and threaten to kill his own son, illustrating the harsh family relations that provide some insight into how Boyd turned out the way he has. Instead of killing Boyd, Bo offers his son the option to abandon his group, after which Bo will leave all of them alone. Boyd walks away into the forest. He hears gunshots and returns to see that all of his followers have been killed. This sends him to Raylan's door depressed, saying he will help Raylan find Bo as long as he is allowed to be the one to kill him.</p><p>An earlier plan is foiled, involving Arlo's shooting Raylan, to deliver Raylan into Bo's clutches, then handing him over to Gio, but Bo has taken Ava hostage. This is the turning point that drives Boyd and Raylan to join forces for the first time, and Boyd leads him to the Crowder cabin. There, Raylan manages to kill one of Bo's henchmen. As Raylan and Bo are walking to the cabin, Boyd appears ready to shoot and kill Bo. Before Boyd has an opportunity, Bo is shot and killed by a sniper, who then starts shooting at Raylan and Boyd, who take cover in the cabin. They discover they are surrounded by Gio's niece and nephew plus two other gunmen, who then attack the cabin with machine guns. Boyd, Ava, and Raylan are trapped; the niece and nephew demand Raylan be turned over to them.</p><p>After Boyd attempts to pass himself off as Raylan, and Raylan kills two of the gunmen, Raylan tells Boyd and Ava to leave out the back way, and he walks forward, hands in the air. As the niece steps out from behind her car, the nephew attempts to shoot Raylan, Boyd shoots the nephew, and the niece drives away. Boyd wants to chase her, but Raylan stops him, saying it is against the law. However, Boyd absconds in Bo's car, but doesn't use violence. This signifies the beginning of an uneasy friendship between the two characters that will continue throughout the series.</p><h4>Season 2</h4><p>Season 2 deals primarily with the criminal dealings of the Bennett clan. Family matriarch Mags Bennett (Margo Martindale) and her three sons Dickie (Jeremy Davies), Coover (Brad William Henke), and Doyle (Joseph Lyle Taylor), Chief of Bennett Hollow Police, plan to expand their marijuana business into Crowder territory following Bo's death, as Boyd has proven somewhat reluctant to follow in his father's footsteps. Raylan gets involved in the struggle between the two criminal organizations, and because of a long-standing feud between the Givens and Bennett families centering on an incident between Raylan and Dickie in their youth (which left Dickie with a lame leg), matters grow very complicated, with the pair's pasts catching up with them. Meanwhile, an effort by a mining conglomerate to secure access rights to the mountain results in Raylan and Boyd becoming involved on opposite sides of the operation. This provokes a local backlash against the Bennetts, after Boyd reveals Mags' secret involvement in negotiations with the conglomerate, to the detriment of her neighbors.</p><h4>Season 3</h4><p>Season 3 introduces a new main villain, Robert Quarles (Neal McDonough) of Detroit. The criminal organization connected to the Frankfort, Kentucky mob has exiled Quarles to Kentucky. Quarles allies himself with local enforcer Wynn Duffy (Jere Burns) and begins to supplant the local criminals when Raylan begins investigating. Quarles' efforts also bring him into conflict with Boyd's group, resulting in the deaths of several locals. Simultaneously, Dickie Bennett, the lone survivor of the Bennett clan, seeks the aid of the black residents of Noble's Holler and their leader, Ellstin Limehouse (Mykelti Williamson), to recover his inheritance. Limehouse attempts to keep his people out of the struggle between the criminal groups but becomes involved when Boyd gets the upper hand on Quarles, leading to a series of betrayals and deaths.</p><h4>Season 4</h4><p>Season 4 is about a mystery which was left unsolved for 30 years. On January 21, 1983, a man wearing a defective parachute plummets onto a residential street in Corbin, Kentucky, dying instantly. His body is surrounded by bags full of cocaine and an ID tag for a \"Waldo Truth\". Raylan learns of the mystery when a vintage diplomatic bag is found hidden at Arlo's house containing only Waldo Truth's ID tag. Further investigation indicates that the parachutist died and Raylan's father Arlo hid the bag, but he refuses to divulge any information.</p><p>As the investigation continues to unfold, information is revealed that could lead to the arrest of a major mafia figure. Raylan is now living above a bar and attempting to stash extra money away to provide for his unborn child and is in a questionable relationship with the bartender, Lindsey Salazar. Boyd Crowder seeks to expand his empire with help from an old army buddy Colton \"Colt\" Rhodes (Ron Eldard). Boyd's efforts are complicated by the arrival of a snake handling revival preacher named Billy St. Cyr (Joe Mazzello). Billy's success is cutting into Boyd's profits, as his users and dealers are getting hooked on faith instead of drugs. Boyd's cousin Johnny (David Meunier) grows ever more resentful of Boyd's success and plans to betray him to Wynn Duffy. Boyd's ambition has him force a deal with Duffy that involves Boyd chasing down leads in the same parachutist mystery, eventually bringing Boyd to an unexpected crossroads that threatens his personal or professional destruction.</p><h4>Season 5</h4><p>Season 5 features the alligator-farming Crowe crime family, led by Darryl Crowe Jr. (Michael Rapaport). Jere Burns, who recurred in the first four seasons as Wynn Duffy, was made a series regular.</p><h4>Season 6</h4><p>Season 6 revolves around the culmination of Raylan and Boyd's rivalry, complicated by Ava's betrayal, the machinations of Avery Markham (Sam Elliott), and a plot to rob him by Boyd, Wynn Duffy and Markham's secret adversary. Boyd succeeds in robbing Markham, but Raylan's plan to entrap him with Ava's help has tragic consequences. Raylan's job, life, and future are all threatened in a way they have never been before.</p><br/><h3>Cast and characters</h3><h4>Main cast</h4><ul><li>Timothy Olyphant as Deputy U.S. Marshal Raylan Givens, a lawman who, after making headlines killing a fugitive, is sent to Kentucky, where he gets deeply involved in the criminal element of his hometown. Raylan was born and raised in Harlan, Kentucky, where his father was a well-known career criminal. Raylan suffered emotional and likely physical abuse from his father, Arlo. During high school, Raylan played baseball and eventually went to work in the Kentucky coal mines, where he worked with Boyd Crowder. Raylan went to college with money given to him by his aunt. After graduating he became a deputy U.S. Marshal, driving him back to Kentucky. He is divorced from Winona Hawkins, a court stenographer, and is often involved with a variety of women. Raylan is known for wearing a distinctive cowboy hat.</li><li>Nick Searcy as Chief Deputy U.S. Marshal Art Mullen, who knows Raylan from Glynco. He generally follows the law, but gives Raylan some leeway when he trusts his judgment. Art is more of a father figure to Raylan than Arlo, but becomes distrustful of him after he demonstrates his inability to separate his personal and professional lives, frequently crossing the line between right and wrong.</li><li>Jacob Pitts as Deputy U.S. Marshal Tim Gutterson, a sardonic former Army Ranger sniper who is generally unimpressed by Raylan's antics. Art worries that Tim bottles up his PTSD and is likely to blow at any minute.</li><li>Erica Tazel as Deputy U.S. Marshal Rachel Brooks, a straight-and-narrow marshal who frequently lashes at Raylan, claiming that he wouldn't get away with his behavior if he weren't white, a man, and handsome.</li><li>Joelle Carter as Ava Crowder, a woman from Harlan who grew up with Raylan and Boyd. Prior to the events of the show, she was married to Boyd's abusive brother Bowman, whom she killed. As the show progresses, Ava becomes central to Harlan's crime syndicate in her own right.</li><li>Natalie Zea as Winona Hawkins (seasons 1–3; recurring seasons 4, 6; guest season 5), Raylan's ex-wife. At the show's start, she is married to Gary Hawkins, a real estate agent. She works at the same courthouse as Raylan as a court stenographer. She still loves Raylan, but does not trust him as a safe choice given his profession and his tendency to get into trouble.</li><li>Walton Goggins as Boyd Crowder (seasons 2–6; recurring season 1), the son of one of Harlan's biggest career criminals. Boyd is known for robbing banks and using pyrotechnics, which brings Raylan, with whom he used to dig coal, back to Harlan. At the start of the series Boyd goes from a member of a white supremacist group to a born again Christian, though he later moves on to attempting to control Harlan's criminal underground.</li><li>Jere Burns as Wynn Duffy (seasons 5–6; guest seasons 1–2; recurring seasons 3–4), a shady Dixie Mafia businessman who travels around in a motor home and who becomes involved in Harlan crime.</li></ul><h4>Recurring cast</h4><ul><li>David Meunier as Johnny Crowder (seasons 1–5), Boyd's cousin.</li><li>Raymond J. Barry as Arlo Givens (seasons 1–4, 6), Raylan's father and a criminal who often worked with Bo Crowder, but who is now suffering from a form of dementia.</li><li>Rick Gomez as Assistant U.S. Attorney David Vasquez (seasons 1, 3–6), who works with Art, Raylan, and the other Kentucky marshals.</li><li>M. C. Gainey as Bo Crowder (season 1), Boyd's father who is released from jail.</li><li>Brent Sexton as Sheriff Hunter Mosley (seasons 1, 4), the Harlan sheriff. He grew up with Raylan.</li><li>Damon Herriman as Dewey Crowe (seasons 1–3, 5–6), a Harlan stooge who works with Boyd.</li><li>Linda Gehringer as Helen Givens (seasons 1–3), Arlo's second wife and Raylan's aunt. Her sister was Frances, Arlo's first wife and Raylan's mother.</li><li>William Ragsdale as Gary Hawkins (seasons 1–3), Winona's second husband, a real estate agent who gets into trouble with Wynn Duffy.</li><li>Kevin Rankin as Derek \"Devil\" Lennox (seasons 1–3), one of Boyd's associates.</li><li>Stephen Root as Judge Mike Reardon (seasons 1–3, 5), the judge Winona works for, known for his strange habits such as wearing nothing but a gun and Speedo swimming trunks under his judge robes.</li><li>Mel Fair as Deputy U.S. Marshal Nelson Dunlop (seasons 1–6)</li><li>Kaitlyn Dever as Loretta McCready (seasons 2–3, 5–6), a no-nonsense teen involved in the weed business who is taken under Mags Bennett's care after her father dies, and whom Raylan is a father figure to.</li><li>Jim Beaver as Sheriff Shelby Parlow/Drew Thompson (seasons 2–4), a former lawman who runs for Sheriff at the behest of Boyd.</li><li>Abby Miller as Ellen May (seasons 2–4, 6), a dim prostitute who works at Audrey's.</li><li>Jeremy Davies as Dickie Bennett (seasons 2–3, 5–6), Mags Bennett's middle son, who has had a feud with Raylan since a high school baseball game.</li><li>Margo Martindale as Mags Bennett (season 2), the matriarch of the Bennett family.</li><li>Joseph Lyle Taylor as Doyle Bennett (season 2), Mags' son who is also a Police Chief of a small town, just outside of Harlan.</li><li>Brad William Henke as Coover Bennett (season 2), Mags' youngest, dense son with anger issues.</li><li>Peter Murnik as Kentucky State Police Trooper Tom Bergen (seasons 2–3), a state police officer who works with Raylan.</li><li>James LeGros as Wade Messer (seasons 2–3, 5), a Harlan man who is easily bought.</li><li>William Gregory Lee as Sheriff Nick Mooney (seasons 2–5), an ill-tempered dirty cop who eventually becomes Harlan's sheriff.</li><li>Jonathan Kowalsky as Mike Cosmatopolis (seasons 2–6), Wynn's bodyguard and right-hand man.</li><li>Mickey Jones as Rodney \"Hot Rod\" Dunham (seasons 2–3, 5), a weed dealer.</li><li>Mykelti Williamson as Ellstin Limehouse (seasons 3–4, 6), a prominent man in Harlan's black community who owns a butcher shop and BBQ joint, and is also known for his ability to help out those who need it, if they can pay.</li><li>Neal McDonough as Robert Quarles (season 3), the sadistic surrogate son of Detroit crime bigwig Theo Tonin who is sent to be his eyes in Kentucky.</li><li>David Andrews as Sheriff Tillman Napier (seasons 3–4), who hosts swinger parties for Harlan's wealthy.</li><li>Brendan McCarthy as Tanner Dodd (season 3), an associate of Robert Quarles.</li><li>Demetrius Grosse as Errol (seasons 3, 6), one of Limehouse's employees.</li><li>Todd Stashwick as Ash Murphy (season 3), a corrupt prison guard who helps Dickie Bennett and Dewey Crowe out of prison.</li><li>Jenn Lyon as Lindsey Salazar (seasons 3–4), the bartender at the bar Raylan frequents and eventually lives above.</li><li>Jesse Luken as Jimmy Tolan (seasons 3–5), one of Boyd's men. He is Boyd's favorite and most trusted soldier, and Boyd regards him as family.</li><li>Ron Eldard as Colton Rhodes (season 4), a former member of the Military Police whom Boyd knows from their days in the army.</li><li>Joe Mazzello as Billy St. Cyr (season 4), a tent-revival pastor who comes into Harlan and causes trouble for Boyd.</li><li>Lindsay Pulsipher as Cassie St. Cyr (season 4), the sister of revivalist Billy St. Cyr.</li><li>Patton Oswalt as Constable Bob Sweeney (seasons 4, 6), a bumbling law enforcement officer who aspires to be like Raylan but lacks skill and a lot of common sense.</li><li>Sam Anderson as Lee Paxton (seasons 4–5), a funeral director who is one of Harlan's elite and a member of Napier's swingers' club.</li><li>Mike O'Malley as Nick \"Nicky\" Augustine (season 4), one of Tonin's most trusted soldiers.</li><li>Robert Baker as Randall Kusik (season 4), Lindsey Salazar's husband and cockfighting entrepreneur.</li><li>Brian Howe as Arnold (season 4), a client of Ellen May's who is also a member of Napier's swingers' club.</li><li>John Kapelos as Ethan Picker (seasons 4–5), a henchman of Nick Augustine's.</li><li>Michael Rapaport as Darryl Crowe Jr. (season 5), Dewey's cousin and head of the Florida contingent of the Crowe family.</li><li>A. J. Buckley as Danny Crowe (season 5), Darryl's brother.</li><li>Alicia Witt as Wendy Crowe (season 5), Darryl's sister and a paralegal.</li><li>Edi Gathegi as Jean Baptiste (season 5), a Haitian croc hunter who works with the Crowe family.</li><li>Jacob Lofland as Kendal Crowe (season 5), Wendy's son who grows up thinking he's her brother.</li><li>Amy Smart as Alison Brander (season 5), Kendal's child services caseworker, who gets involved with Raylan.</li><li>Steve Harris as Roscoe (season 5), one of Rodney Dunham's drug enforcers.</li><li>Wood Harris as Jay (season 5), Roscoe's brother.</li><li>Don McManus as Billy Geist (seasons 5–6), Ava's lawyer.</li><li>Karolina Wydra as Mara Paxton (season 5), Lee's wife.</li><li>Danielle Panabaker as Penny Cole (season 5), an incarcerated woman whom Ava befriends.</li><li>Mary Steenburgen as Katherine Hale (seasons 5–6), a crime lord's widow whose past connects with Wynn Duffy's.</li><li>Justin Welborn as Carl (seasons 5–6), one of Boyd's henchmen.</li><li>Bill Tangradi as Cyrus Boone (seasons 5–6), a drug distributor.</li><li>Danny Strong as Albert Fekus (seasons 5–6), a prison guard who pretends Ava attacked him to get her locked up.</li><li>Sam Elliott as Avery Markham (season 6), a big-time Colorado weed grower who moves back to Kentucky to reconnect with Katherine Hale.</li><li>Garret Dillahunt as Ty Walker (season 6), a security expert and former soldier who works as one of Avery's enforcers.</li><li>Jeff Fahey as Zachariah Randolph (season 6), Ava's uncle.</li><li>Jonathan Tucker as Boon (season 6), one of Markham's men who takes a particular interest in Loretta.</li><li>Ryan Dorsey as Earl (season 6), Carl's brother.</li><li>Scott Grimes as Sean/Seabass (season 6), one of Markham's enforcers.</li><li>Duke Davis Roberts as Mundo/Choo-Choo (season 6), one of Markham's enforcers who suffered brain damage after an incident in the army.</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th><th scope=\"col\" rowspan=\"2\" style=\"padding:0 8px\">Average viewers<br>(millions)</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 16, 2010</td><td style=\"padding:0 8px\">June 8, 2010</td><td>2.42</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 9, 2011</td><td style=\"padding:0 8px\">May 4, 2011</td><td>2.65</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 17, 2012</td><td style=\"padding:0 8px\">April 10, 2012</td><td>2.39</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 8, 2013</td><td style=\"padding:0 8px\">April 2, 2013</td><td>2.43</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 7, 2014</td><td style=\"padding:0 8px\">April 8, 2014</td><td>2.29</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 20, 2015</td><td style=\"padding:0 8px\">April 14, 2015</td><td>1.86</td></tr></tbody></table><br/><h3>Production</h3><p>Originally titled Lawman, Justified was given a 13-episode order by FX on July 28, 2009, and premiered on March 16, 2010. The first episode was referred to as the \"Fire in the Hole pilot\" during shooting and retains this as the name of the episode itself. FX renewed the show for a second season, which premiered on February 9, 2011. A third season of 13 episodes was announced on March 29, 2011, and premiered January 17, 2012. A fourth season of 13 episodes was announced on March 6, 2012, and premiered January 8, 2013. The show was renewed for a fifth season, which premiered on January 7, 2014. On January 14, 2014, the series was renewed for a sixth and final season, which premiered on January 20, 2015.</p><h4>Filming</h4><p>While the pilot was shot in Pittsburgh and suburban Kittanning and Washington, Pennsylvania, the subsequent 38 episodes were shot in California. The small town of Green Valley, California often doubles for Harlan, Kentucky. In the pilot, Pittsburgh's David L. Lawrence Convention Center appears on film as the small town \"airport\", and the construction of the new Consol Energy Center serves as the \"new courthouse\".</p><p>The series began filming using the EPIC camera, manufactured by Red Digital Cinema Camera Company, with the third season. Director of photography Francis Kenny said, \"We persuaded Sony Entertainment that by shooting with Epic cameras production would be increased tenfold and it would look spectacular.\" After filming the first two episodes of the season, Kenny said, \"Episode one of season three is now complete and our dreams have come true. The show looks better than ever and the producers are now true believers of the Red System.\"</p><h4>Crew</h4><p>Graham Yost developed the series for television based on the character U.S. Marshal Raylan Givens, with the onscreen credit giving the source as Leonard's short story \"Fire in the Hole\". Both Yost and Leonard are credited as executive producers on the project. Yost is also the series head writer and showrunner. Other executive producers for the series include Sarah Timberman, Carl Beverly, and Michael Dinner. Dinner also directed the series pilot, the second episode of the first season, and the second-season finale.</p><h4>Casting</h4><p>The character of Boyd was intended to die in the pilot episode, but producer Yost kept the character when test audiences liked Walton Goggins performance. Goggins was promoted to main cast from season 2 onward. The Rachel character, as played by Erica Tazel, was included by Elmore Leonard in his final novel, Raylan.</p><h4>Theme song</h4><p>The show's theme song, \"Long Hard Times to Come\", was performed by the New York City–based Gangstagrass and produced by Rench, and features rapper T.O.N.E-z, Matt Check on banjo, Gerald Menke on resonator guitar, and Jason Cade on fiddle. The song was nominated for a 2010 Emmy Award for Outstanding Original Main Title Theme Music.</p><h4>Cancellation</h4><p>The decision to end the show was primarily based on lead actor Timothy Olyphant and series developer Graham Yost. FX network president John Landgraf said, \"They felt that the arc of the show and what they had to say would be best served by six seasons instead of seven. Regretfully, I accepted their decision.\" Yost's comments were \"Our biggest concern is running out of story and repeating ourselves. This was a long conversation. There were financial incentives to keep going, but it really felt, in terms of story, that six years felt about right.\"</p><br/><h3>Reception</h3><h4>Ratings</h4><p>The pilot episode that aired on March 16, 2010, was watched by 4.2 million viewers and was the highest debut show for FX since The Shield.</p><h4>Critical reception</h4><p>Throughout its run, Justified received largely positive reviews from critics. On the review aggregation website Metacritic, all seasons except the first received a score indicating \"universal acclaim.\" Author Elmore Leonard ranked Justified as one of the best adaptations of his work, which includes Get Shorty, Jackie Brown, 3:10 to Yuma and Out of Sight. Leonard also praised the casting of Olyphant as Raylan, describing the actor as \"the kind of guy I saw when I wrote his lines.\"</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Season scores for <i>Justified</i> by review aggregators</caption><tbody><tr><th rowspan=\"2\">Season</th><th colspan=\"3\"><span>Rotten Tomatoes</span></th><th colspan=\"2\"><span>Metacritic</span></th></tr><tr><th>Approval</th><th>Average</th><th>Ref</th><th>Score</th><th>Ref</th></tr><tr><td>1</td><td>93%</td><td>8.3/10</td><td></td><td>80/100<br>(generally favorable)</td><td></td></tr><tr><td>2</td><td>100%</td><td>8.8/10</td><td></td><td>91/100<br>(universal acclaim)</td><td></td></tr><tr><td>3</td><td>96%</td><td>9.6/10</td><td></td><td>89/100<br>(universal acclaim)</td><td></td></tr><tr><td>4</td><td>100%</td><td>9.5/10</td><td></td><td>90/100<br>(universal acclaim)</td><td></td></tr><tr><td>5</td><td>96%</td><td>8/10</td><td></td><td>84/100<br>(universal acclaim)</td><td></td></tr><tr><td>6</td><td>100%</td><td>9/10</td><td></td><td>89/100<br>(universal acclaim)</td><td></td></tr></tbody></table><p>The first season was positively received. The critical consensus for the season on Rotten Tomatoes reads, \"A coolly violent drama, Justified benefits from a seductive look and a note-perfect Timothy Olyphant performance.\" TV Guide critic Matt Roush said, \"The show is grounded in Olyphant's low-key but high-impact star-making performance, the work of a confident and cunning leading man who's always good company.\" Chicago Tribune critic Maureen Ryan stated, \"The shaggily delightful dialogue, the deft pacing, the authentic sense of place, the rock-solid supporting cast and the feeling that you are in the hands of writers, actors and directors who really know what they're doing—all of these are worthy reasons to watch Justified.\" Jesse Damiani of HuffPost referred to the show's dialogue as \"best-in-television,\" explaining, \"What this quality of dialogue accomplishes...is crafting Harlan County as its own character, a place where wit and strategy are currency, weaponry, and protection in a bleak economic landscape.\" Mike Hale of The New York Times noted the show's \"modest virtues\", but was critical of the first season's pace and characterization, writing: \"Justified can feel so low-key that even the crisis points drift past without making much of an impression... It feels as if the attention that should have gone to the storytelling all went to the atmosphere and the repartee.\"</p><p>Eric Dodds of Time suggested the first episodes were too procedural to \"crack the upper echelon\" of prestige television dramas. Critics did note that the characters played by Jacob Pitts and Erica Tazel, Tim Gutterson and Rachel Brooks respectively, remained underutilized throughout the show's run.</p><p>The second season received increased acclaim. The critical consensus for the second season on Rotten Tomatoes reads, \"Justified finds its footing in its second season with an expanded cast of characters that enriches its seedy world.\" Robert Bianco of USA Today praised Margo Martindale's performance, stating: \"Like the show itself, Margo Martindale's performance is smart, chilling, amusing, convincing and unfailingly entertaining. And like the show, you really don't want to miss it.\" Slant Magazine critic Scott Von Doviak observed, \"Justified's rich vein of gallows humor, convincing sense of place, and twisty hillbilly-noir narratives are all selling points, but it's Olyphant's devilish grin that seals the deal.\"</p><p>The third season continued to receive acclaim, with Rotten Tomatoes' critical consensus reading, \"Justified continues to dispense its brand of spare dialogue and sudden violence, culminating in a very satisfying finale.\" Jeremy Enger of The New York Times said the series \"captures his darkly funny, morally murky tone and spikes the traditional crime procedural with hooch and Oxycontin, tracking its hero's attempts to thwart colorful drug dealers and gunrunners and negotiate his own fractured relationships. The series unspools in an oddly captivating alternate South peopled by whimsically twisted archetypes and marked by sudden shifts between folksy black comedy and graphic violence.\" Emily Nussbaum of The New Yorker was critical of the third season, writing: \"Extended storytelling has its own conventions and clichés, all of which appeared in Season 3... it echoed every cable drama, in the worst way.\" Verne Gay of Newsday said of the third season, \"Lean, laconic, precise and as carefully word-crafted as any series on TV, there's pretty much nothing here to suggest that the third season won't be as good as the second – or better.\"</p><p>For the fourth season, Rotten Tomatoes' critical consensus is, \"Bolstered by witty, efficient dialogue and confident storytelling, Justified makes a strong case for consideration among cable television's top dramas.\" Tom Gliatto of People Weekly wrote, \"What gives the show its kick is the gleefully childish lack of repentance shown by most of these rascals—countered by Olyphant's coolly amused control.\" Verne Gay of Newsday found that \"Character—as the old saying goes—is a long-standing habit, and their habits remain very much intact. The same could be said of Justified.\" Chuck Bowen of Slant Magazine found that \"Justified is the strongest, liveliest, and most tonally accurate adaptation of the writer's work to date, and the latest season bracingly suggests that isn't likely to change anytime soon.\"</p><p>The fifth season proved to be less popular, although it continued to receive positive reviews. Tim Goodman of The Hollywood Reporter considered the season to be \"a stretch on all fronts\" and Eric Dodds of Time complained the season didn't spend enough time with its characters. Rotten Tomatoes' critical consensus for this season reads, \"Justified continues to bring the shock value with clever storylines and a potent blend of comedy and drama.\" When discussing what worked well and less well with the season, showrunner Yost noted how the unexpected departure of actor Edi Gathegi (playing Jean Baptiste) \"upset the balance of the season\", but also how it led to the prominence of the character of young Kendall Crowe (played by Jacob Lofland).</p><p>The sixth and final season once again received critical acclaim. Rotten Tomatoes' critical consensus reads \"Justified returns to form for its endgame, rebounding with crisp storytelling and colorful characters who never take themselves too seriously.\" Critics generally considered the series finale to be a very satisfying conclusion according to Rotten Tomatoes' roundup.</p><h4>Accolades</h4><p>Justified received a 2010 Peabody Award. The series has received eight Primetime Emmy Award nominations. For the first season, the series received a single nomination, for Outstanding Original Main Title Theme Music. For the second season, it received four acting nominations for the 63rd Primetime Emmy Awards—Timothy Olyphant for Outstanding Lead Actor in a Drama Series, Walton Goggins for Outstanding Supporting Actor in a Drama Series, Margo Martindale for Outstanding Supporting Actress in a Drama Series, and Jeremy Davies for Outstanding Guest Actor in a Drama Series, with Martindale winning. For the third season, it received two nominations for the 64th Primetime Emmy Awards, with Jeremy Davies winning for Outstanding Guest Actor in a Drama Series, and a nomination for Outstanding Art Direction for a Single-Camera Series. For its fifth season, it received a nomination for Outstanding Art Direction for a Contemporary or Fantasy Series (Single-Camera). The sixth season received five nominations at the 5th Critics' Choice Television Awards, the most of any other programs nominated. It received nominations for Best Drama Series, Timothy Olyphant for Best Actor in a Drama Series, Walton Goggins for Best Supporting Actor in a Drama Series, Joelle Carter for Best Supporting Actress in a Drama Series and Sam Elliott for Best Guest Performer in a Drama Series, with Elliot winning.</p><br/><h3>Home media</h3><p>The DVD and Blu-ray sets were released in region 1 on January 18, 2011, for season one, January 3, 2012, for season two, December 31, 2012, for season three, December 17, 2013, for season four, December 2, 2014, for season five, and June 2, 2015, for season six.</p><br/><h3>Justified: City Primeval</h3><p>In March 2021, FX and various Justified writers including Graham Yost began development on a drama series based on Elmore Leonard's novel City Primeval. Timothy Olyphant was also set to reprise his role as Raylan Givens.</p><p>In January 2022, FX greenlit the limited series and confirmed Olyphant would reprise his role. Several of the original Justified writers and producers are involved; showrunners for City Primeval are Dave Andron and Michael Dinner, with Dinner also directing. Other executive producers include Olyphant, Yost, Sarah Timberman, Carl Beverly and Peter Leonard, with the writing staff consisting of Taylor Elmore, Chris Provenzano, Walter Mosley, V.J. Boyd, Eisa Davis and Ingrid Escajeda. The limited series is set eight years after the original series and sees Givens, who is now living in Florida working as a marshal, go to Detroit after crossing paths with a violent sociopath named Clement Mansell. In February 2022, it was revealed that Quentin Tarantino was in talks to direct episodes of the series.</p><p>Filming began in Chicago on May 4, 2022. Alongside Olyphant, the series also stars Aunjanue Ellis, Boyd Holbrook, Adelaide Clemens, Vondie Curtis-Hall, Marin Ireland, Norbert Leo Butz, Victor Williams, and Vivian Olyphant (Timothy Olyphant's real-life daughter). It is set to premiere in mid-2023.</p><br/>"
  },
  "errorMessage": ""
}