{
  "imDbId": "tt0106179",
  "title": "The X-Files",
  "fullTitle": "The X-Files (TV Series 1993–2018)",
  "type": "TVSeries",
  "year": "1993",
  "items": [
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2873940",
      "warningSpoilers": false,
      "date": "22 September 2013",
      "rate": "9",
      "helpful": "52 out of 57 found this helpful.",
      "title": "Groundbreaking Sci-fi",
      "content": "Fox Mulder (David Duchovny) is a marginalized loner FBI agent stuck in the basement. He's been ostracized because he's a true believer in the paranormal. Dr Dana Scully (Gillian Anderson) is a skeptic, a woman of science, and assigned to keep Mulder under control.The X Files represents a breakout for the sci-fi genre. Its success gave it license to put on more paranormal shows treated as reasonable. It also became a benchmark by which these shows are measured. There are amazing episodes with some less so. The best is the chemistry between the two leads. It broke new ground with great writing from some future notable names. It lasted 9 seasons. It may have gone on too long but it was great while it lasted."
    },
    {
      "username": "clark-39",
      "userUrl": "https://www.imdb.com/user/ur0734731",
      "reviewLink": "https://www.imdb.com/review/rw0317281",
      "warningSpoilers": false,
      "date": "16 December 2001",
      "rate": "",
      "helpful": "355 out of 385 found this helpful.",
      "title": "It's been a great ride.",
      "content": "What can one say? The X-Files will forever be remembered as a true hit TV show, and a breakout accomplishment for Fox. Its survived cast changes, location moves, ups and downs in ratings, and years of airing. I think I speak for everyone when I say that it has been a thrill. Chris Carter has created one of the most defining shows of the '90s. People that don't even watch the show know what it is, and EVERYONE knows who Fox Mulder and Dana Scully are, whether they've ever seen one episode or not. The show brought on a whole new level of TV entertainment in 1993, with its different, moody atmosphere, intriguing lead characters, and mind-bending plots. I admit, while watching most of the episodes, I thought, \"This isn't very scary...\", but then I payed attention to the detail and it got so good...the lighting, the sets...even when Mulder and Scully are outside (which is often), the sky is hardly ever sunny and bright, but rather dark and shadowy. The details on these things are terrific alone. And Chris Carter has also managed to create intense torture for the fans by forever dragging out the \"Mulder and Scully in love\" idea. People used to tune in to see when those two would kiss, and they had alot of fun with that, especially in the feature film. But a true sign of integrity for the show is the amount of truth in it. While the show is about the paranormal, and truth in it seems ironic, the show knows what the heck it's talking about. Every word from Scully's mouth is based on actual science. And unlike other FBI shows, The X-Files shows the FBI like it really is--not some tired cliche, but REAL people. And whenever someone, whether a fan or not, hears anything referring to aliens, they immediately think of little green men with small bodies, big heads, and large eyes...all courtesy of The X-Files. In short, this amazing television series has affected so many people. I feel blessed to have grown up with this show, rather than being born after it, doomed to see it in reruns. Because I got to be there for the ride...and though it was often bumpy and is now coming to its end...I can look back and say, \"Hey, it was a GREAT 9 years.\""
    },
    {
      "username": "Rob_Taylor",
      "userUrl": "https://www.imdb.com/user/ur1980092",
      "reviewLink": "https://www.imdb.com/review/rw0317350",
      "warningSpoilers": true,
      "date": "11 August 2004",
      "rate": "8",
      "helpful": "110 out of 124 found this helpful.",
      "title": "An epic series, in more ways than one.",
      "content": "I started watching the X Files years ago, catching an episode here, an episode there. And I have to say that most of the underlying conspiracy plot was lost to me as a result. Consequently, I rated the show as OK, but nothing special. Something to watch if you happened to turn the TV on and it was playing, but not something to actively seek out.However, I recently acquired all 9 seasons and set about watching them, in order, from start to finish, at about a rate of an episode a day. I have to say it all makes a lot more sense now. The conspiracy theorie's \"on-off is it-isn't it\" nature makes for confusing twists and turns which is exactly what it is supposed to do.I can't really say whether the earlier seasons are better than the later ones or not. When you watch that many episodes over a few months they all seem much the same in terms of quality. There are standout episodes just as there are the odd turkeys, but overall the quality is good and fairly consistent.What most people don't get, I think, is that the show became less about the conspiracy theory and weirdness and more about Mulder and Scully as the seasons rolled by. Perhaps this was why it was such a shock when Mulder vanished at the end of season 7 and was replaced by Doggett and Reyes. I too, was inherently antagonistic towards them but, I am very glad to say, they do grow on you. But the two seasons they were in were not really enough for you to get to know them intimately, as you did Mulder and Scully.The show was filled with memorable characters such as CSM and the Lone Gunmen. Special episodes gave you an insight into these recurring characters and how they came to be who they are. Indeed, the Gunmen got their own show, albeit only for a run of thirteen episodes (unlucky for them!). Other characters like Gibson Praise, The Alien Bountyhunter, Pusher, Tooms and Agent Harrison also recurred and were pleasant enough to watch whenever they were on screen. Old faithfuls, if you would.I've become, from an indifferent beginning, a definite fan of the show. It was a shame to watch the final episode and think that it was over, but here's hoping they make a couple more movies. I think it's probably a foregone conclusion that they will, since the ending of the show was left wide open with unresolved issues. But maybe that's what was intended, that the ending be a non-happy one. Only time, and another movie (or series) will tell.EDIT FOR SEASON 10: Well, this is a review I never thought I'd update! A new series picking up where it left off, though years later, of course. It is looking pretty good so far, though the pilot was a little odd. Ep 2 is an improvement and Ep 3 shows that the show can poke fun at itself. Ep 4 is the best so far. Here's hoping it continues to get better and better."
    },
    {
      "username": "Sanpaco13",
      "userUrl": "https://www.imdb.com/user/ur11377559",
      "reviewLink": "https://www.imdb.com/review/rw1608373",
      "warningSpoilers": false,
      "date": "27 February 2007",
      "rate": "10",
      "helpful": "119 out of 136 found this helpful.",
      "title": "Scully? Marry me.",
      "content": "Well I have been putting this off for a while because really I can't figure out how words can really express just how amazing of a show this is. I think I was 11 or 12 when the Pilot first aired. I didn't watch the show then because I was afraid of it after I saw episodes like \"The Jersey Devil\" and \"Born Again\" when they first aired, which is really funny because theses are some of the tamest episodes to me now. So unfortunately I wasn't quite ready or prepared for the X-Files during it's running. Later I remember watching TV one Saturday and there was a Chris Carter double feature. First \"Jose Chung's From Outer Space\" and then the Millennium episode \"Jose Chung's Doomsday Defense\". Both episodes had me in tears laughing at the dark humor.I later found out that FX had an episode every night at 9 and so every night for an entire summer I got to watch an episode and I quickly became immersed in the mythology of the alien conspiracy. Some of the most memorable episodes for me from this period are \"Bad Blood\", \"The Host\", \"Darkness Falls\", \"E.B.E\", \"Little Green Men\", and countless others. I quickly became a fan but I had yet to see every episode and I avoided watching it new airings for fear of spoilers. So I began to buy the seasons on DVD. Over two years I was able to purchase and watch every episode. Interesting to me was the fact that I had already seen most of the episodes through syndication but there were many that I hadn't.Anyway enough about my history with the show. The elements of the show that I think make it a great are simple. Likable characters, psychopathic bad guys, enough dark comedy mixed in with the horror and drama to give the viewer a healthy balance. The writer's of the show have a wonderful talent of leaving certain stories hanging only to the extent that does not make the viewer feel betrayed but wanting to watch more.The X-Files defined an era of television and opened the way for other Sci-Fi related shows as well as helping define the crime drama shows that are all over the place now. If the 60's/70's gave us Trekkies for decades on, the 90's gave us the X-Files which will continue to create X-Philes for decades on in suit."
    },
    {
      "username": "Op_Prime",
      "userUrl": "https://www.imdb.com/user/ur0199296",
      "reviewLink": "https://www.imdb.com/review/rw0317243",
      "warningSpoilers": false,
      "date": "8 June 2000",
      "rate": "",
      "helpful": "117 out of 139 found this helpful.",
      "title": "Really one of the coolest shows around",
      "content": "The X-Files is one of the best shows ever. The show has great episodes dealing with something paranormal and/or conspiracy. The characters have a great chemistry, especially Mulder and Scully. It's not as good as it was a few years back, but it's still way above most shows on today. Many episodes have dealt with this alien conspiracy recently, but the neat thing about it is how not everything is explained, leaving the door open for further episodes. The X-Files is a very excellent show."
    },
    {
      "username": "Arkaan",
      "userUrl": "https://www.imdb.com/user/ur0294077",
      "reviewLink": "https://www.imdb.com/review/rw0317229",
      "warningSpoilers": false,
      "date": "9 November 1999",
      "rate": "",
      "helpful": "137 out of 162 found this helpful.",
      "title": "One of the best shows on television",
      "content": "According to my friends, I am not a true X-phile (don't ask why). Oh well. The X-Files ranks as one of the most intelligent and brilliant shows on television. It is a cinematic show, using techniques that are more associated with movies than the tv show (like the long unedited sequence in Triangle). Admittedly it was once a better show than it is now, but most episodes are minor masterpieces. But when it peaks, like with \"Redux\", \"Triangle\", and \"One Son\", it peaks like no other show has before. It is completely unclassifiable. It is a mystery, a sci-fi, and sometimes self parody, and the show has several markedly sexual overtones (the cigarette smoking man). The sexual tension is what probably has attracted the most people. The byplay between Mulder and Scully is cool and reserved, yet you wonder exactly what there really thinking. It pays homage to old shows, and movies as well (\"Duel in the Sun\", \"Rope\"). This show doesn't always give you what you want. Though it has gotten more Hollywood-ish, it's a testament to the creators and writers that they haven't put Scully and Mulder together (will they or won't they? Probably. It is Hollywood, after all). This show is a thinking person's show. Sometimes it does get slow, but it always remains interesting."
    },
    {
      "username": "BaronBl00d",
      "userUrl": "https://www.imdb.com/user/ur0166205",
      "reviewLink": "https://www.imdb.com/review/rw1394751",
      "warningSpoilers": false,
      "date": "16 June 2006",
      "rate": "10",
      "helpful": "96 out of 119 found this helpful.",
      "title": "Greatest Science Fiction/Horror television Series of All Time",
      "content": "The writing, the acting, the production values, the continuity, the heart of The X Files all secure a reputation for this show as the best in its class. It has no peers. The story of two FBI agents working in a small office in the basement of the FBI to uncover, prove, disprove supernatural and unexplained phenomena and alien presence builds beautifully in the nine seasons the show existed. And having seen every episode in chronological order, they build with purpose, continuity, and innovation. Sure, there were set-backs when one actor didn't do most of a season, or another actress was pregnant, or whatever might have arisen, but the show's writers and creator - and make no mistake here that creator Chris Carter and his staff of writers/directors are the reason for this show being what it is - always met each and every set-back with a creative, engaging response. When Fox Mulder's character was gone for most of two seasons, they created two new characters that were every bit as solid as Mulder and Scully. Robert Patrick's Doggett and Anabeth Gish's Reyes were equally compelling characters. There are so many good things to say about this show. The two leads, David Duchovny and Gillian Anderson, grew as characters and thespians before our very eyes. They honed their crafts and became stronger screen presences. These characters were characters that we learned to like and wanted to follow. Duchovny brought some much needed wry humour to an otherwise serious subject. He was able at one moment to convince you that the world was one big conspiracy and in the next moment comment on the lack of movement from a dead person with lighthearted appeal. Anderson softened each year, becoming less rigid and inflexible. The cast of supporting characters was always first-rate with Mitch Pillegi as Skinner and William Davis as the antagonistic Smoking Man never giving a bad performance. The three Lone Gunmen were excellent light diversions in bloody cases or cases involving alien invasion or what not. The first season will always be my favorite. Mulder and Scully are finding themselves as characters and the idea of conspiracy is all too real. Jerry Hardin plays Deep Throat, the man feeding Mulder news of government conspiracy, with strength and a true believability. But before I get too compartmentalized, The X Files was able to be two series in one - perhaps its greatest achievement. One the one hand, we had Mulder and Scully battling conspiracy, aliens looking to invade Earth, Mulder finding his sister that had been abducted by aliens, and other plot strands of a similar nature. But the show would also show totally unrelated episodes that were very scary and horrifyinfg. We saw worm men, killer insects, a man that sucked the fat out of his victims, cannibalistic cults, and the list goes on and on. I love the myth episodes, but these horror episodes are my favorites because they are so creative. I cannot remember how many times, having just watched and episode, saying how does someone think this stuff up? Whether The X Files is spoofing the Brady Bunch or alluding to Moby Dick or creating a homage to Frankenstein and movies of its ilk or just trying its best to scare you or disgust you(the episode Home - a favorite of mine), it is always true to itself in terms of the creativity that courses through its proverbial veins. Yes, sometimes, it is a bit full of itself, and, yes, sometimes, the creativity falls right down on its face(as when the show combined the X Files with Cops). But the show has far more, far more hits than misses. I think that as time goes by, this television show will be remembered for much more than what we remember it for today. I think it will be one of the all-time greats. The Truth is out there."
    },
    {
      "username": "AlsExGal",
      "userUrl": "https://www.imdb.com/user/ur15148330",
      "reviewLink": "https://www.imdb.com/review/rw3256083",
      "warningSpoilers": true,
      "date": "11 June 2015",
      "rate": "9",
      "helpful": "20 out of 23 found this helpful.",
      "title": "A timeless show that will make you want to believe...",
      "content": "... whether you actually do or not. On paper, it doesn't sound like much. Two FBI agents are teamed up - a believer in UFO's since as a child he witnessed the abduction of his sister by aliens - Fox Mulder - and Dana Scully, an M.D. and a skeptic about paranormal activity. I watched from the very first episode and there is just something magical about the chemistry of the entire thing. Scully is ordered into the assignment, and everybody believes Fox Mulder saw something awful happen to his sister, but they think his mind created the alien abduction scenario to help him cope with the shock. And so for seven years they encounter things for which maybe a logical explanation can be found, maybe not.I really loved X-Files, but I think I liked their individual episodes more than their story arcs, which, actually, were quite confusing. Was smoking man Mulder's biological father? Was Mulder's sister really kidnapped by aliens and gone for good or did she come back as some kind of cloned pseudo daughter for Smoking Man? Was Scully's baby just a case of \"the doctors were wrong you can get pregnant\"? Was he a product of an alien experiment she does not remember? I dunno. But the fact is people all over the Internet will tell you they do know that this or that was true when largely all we have are insinuations in the show itself, never explicit facts. Maybe this was done on purpose, and sometimes it made the show confusing but it always kept an air of mystery going on that was thoroughly compelling.As for the idea that Smoking Man - one of the true villains in the series and brilliantly and subtly played by William B. Davis - was at the center of every assassination of the 1960's - I always found that a bit Forrest Gumpish for me, but an interesting idea. (He wanted to be the one to kill Martin Luther King because he respected him so much???? What the...) My two most favorite episodes of the entire series were \"Home\" and \"Clyde Bruckman's Final Repose\" - neither of which did anything to advance a story arc but were great examples of just how good X-Files could be when everything came together to tell an interesting story in 50 minutes or so. If you watch \"Home\" from the beginning of season four I'll just tell you that you'll never be able to listen to \"Wonderful Wonderful\" sung by Johnny Mathis in quite the same way again. It will be like listening to \"Layla\" after you've seen Goodfellas.The thing the show did best? Showing a growing loving relationship between Mulder and Scully that maybe got physical and sexual and maybe did not. The point is they wisely never had a TADA! moment of consummation, the kind that killed \"Moonlighting\" and killed \"Cheers\" twice in the 80s by killing the sexual tension.The thing they did worst? Probably soldiering on for two seasons without David Duchovny for large chunks of those two seasons. Was it better than anything else on TV today - certainly. But even two characters that were well written and well characterized - Doggett and Reyes - could not replace Mulder. That is the only reason I did not rate this series as ten stars.Watch it from beginning to end - even the last two seasons - I think you'll find it time well spent."
    },
    {
      "username": "chadly86",
      "userUrl": "https://www.imdb.com/user/ur1229190",
      "reviewLink": "https://www.imdb.com/review/rw0317267",
      "warningSpoilers": true,
      "date": "20 June 2001",
      "rate": "",
      "helpful": "144 out of 163 found this helpful.",
      "title": "An intelligent and inspiring look into the human imagination",
      "content": "It is unfortunate that I became a fan of this series 8 years after it was created. I look at TV these days with disappointment and boredom most of the time since most television drama series/movies deal with one of three genres: law, medicine, or science fiction. At first glance, The X-Files would seem to fit into this trend. However, its uniqueness is that it fits into all three of these categories plus a fourth and most important one: human imagination. This is what makes The X-Files one of the most intelligent and most important shows on television today. After all of these years, it is still one-of-a-kind. It forces us to think, to imagine, and to hope. I can't say that about too many other shows at the present time.I have heard several complaints from many people about the past few years of this show: The writing seems to have deteriorated, the loss of David Duchovny hurt the show, one never seems to find out anything from the show (and on the opposite end, we've found out too much from the show), and it has worn out its welcome. I disagree with all of these. The writing is as good as ever (This year had excellent shows; check out Redrum, This Is Not Happening, and the two-part season finale for a peek.). David Duchovny leaving the show may be a blow to fans, but I think Robert Patrick has done a terrific job in stepping in so late in a series. The acting is as good on that show as it has ever been. As for what we have learned from the show, I think that if one expects to be content with knowing why things that happened on the show happened, he is missing one of the major points of the show. The show is half the story; your imagination is the rest. Chris Carter has found that happy medium ground of saying enough but not too much. And I for one should be proof that the show has not been on too long. It is still finding fans (old and new). Those of you who have shied away from the show are missing out on truly great television.My favorite show is the third episode from the sixth season: Triangle. The show was wonderfully written and brilliantly acted. Any new fan should check this show in particular out.The truth is out there. The X-Files is still a terrific show after 8 years, and I am anxiously awaiting what is to come."
    },
    {
      "username": "TooCynicalToSpeak",
      "userUrl": "https://www.imdb.com/user/ur1262290",
      "reviewLink": "https://www.imdb.com/review/rw0317306",
      "warningSpoilers": false,
      "date": "20 October 2002",
      "rate": "10",
      "helpful": "362 out of 413 found this helpful.",
      "title": "The most intricately perfect work of art.",
      "content": "I find it hard to comment on The X- Files because it simply transcends words. It's an intelligent masterpiece, an epos of beautifully complicated scenarios, plots and characters. Eruditely taking on the grayest of areas, confronting those things under your bed and inside your closet thus bringing new meaning to the fears brought on by conventions and the imprudent obstinacy of social norms. The script, the actors and the direction make the most unbelievable seem believable and the unfathomable- unfathomably real. So thought provoking that if you really let yourself dwell in its essence, it can change the way you see the world, if only just by believing in the conviction that The Truth Is Out There."
    },
    {
      "username": "Ohgress",
      "userUrl": "https://www.imdb.com/user/ur3393966",
      "reviewLink": "https://www.imdb.com/review/rw0946754",
      "warningSpoilers": false,
      "date": "14 October 2004",
      "rate": "",
      "helpful": "497 out of 536 found this helpful.",
      "title": "This story never ends...",
      "content": "I was 17 years old when TV4 broadcast this show for the first time in Sweden back in 1994. Back then I had a big geeky interest in UFO:s and the paranormal so you can imaging how I felt when this TV-show came along. It was like my heart could explode of joy. Well, the geeky interest for UFO:s faded and sometimes I was quite tired of the X-files but I always kept on watching. The funny thing is that it is now, a year after the \"end\" of the show, when I'm 27 years old, that I realize how extremely important the show has been to me. It has been a big part of my life for ten years. And now, life feels a bit empty without it.What is the best part of the X-files then? Well, of course, first of all, Mulder and Scully and the tension between them. You can't describe it with words, it's magical. That is, very good acting. (If the main goals of life for Gillian Anderson and David Duchovny weren't to become icons, well tough luck :)!) Second, the Gothic atmosphere. The X-files is forests, fog, darkness, snow, mud, autumn, rain, desert. Mmm, me love. Third, the dialog. \"SCULLY: Mulder, I wouldn't put myself on the line for anybody but you. MULDER: If there's an ice tea in that bag, could be love. SCULLY: Must be fate, Mulder. Root beer.\" That says about everything. Forth, all the other characters. They are so complex and carefully created. And fifth, the story. I mean, this is the story of all stories. It has everything. A love bigger than the universe, heroes, diplomats, true evil, a father-son-tragedy and a big, huge and completely wonderful conspiracy. And some aliens not to forget.I love this story and it will never end. Not in my heart anyway..."
    },
    {
      "username": "jamhorner",
      "userUrl": "https://www.imdb.com/user/ur15855020",
      "reviewLink": "https://www.imdb.com/review/rw1691422",
      "warningSpoilers": false,
      "date": "11 July 2007",
      "rate": "10",
      "helpful": "27 out of 33 found this helpful.",
      "title": "The Greatest Sci-Fi Show Ever",
      "content": "The X-Files would have probably have been the single best sci-fi show ever created by Chris Carter and Fox. The show itself was very well made and had a good feel of jump-out horror, psychological horror and suspense horror. Which for a TV series is pretty good. The plot line itself was very well constructed. It would tell individual and bizarre stories but would have a bigger and more enticing plot that would reveal itself.The characters have great chemistry together (Dana Scully and Fox Mulder). There is a perfect blend of cryptozoologists, rational-real-life people, control freaks, mysterious men and aliens. The show plays on such legends as Area 51, Lock Ness, Aliens, and Men in Black, abductions, freaks and more. The acting is solid, both on set and off set.This movie would be ideal for those who believe that there is something out there and that the \"Truth is out there.\""
    },
    {
      "username": "alekspredator87",
      "userUrl": "https://www.imdb.com/user/ur52780913",
      "reviewLink": "https://www.imdb.com/review/rw8365427",
      "warningSpoilers": false,
      "date": "24 July 2022",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "I want to believe",
      "content": "The series \"The X-Files\" is a truly significant milestone of its time. He appeared at the right time, at a time when arguments about various kinds of conspiracies, including the concealment of contacts with extraterrestrial civilizations, were in vogue in the States.The series became fateful for the main actors: David Duchovny and Gillian Anderson. This on-screen couple has been looking great together for many seasons. They get to know each other, learn to work together, become imbued with trust in each other and supposedly teach us, the audience, how to support and save each other when all the power structures and whole departments are against. The world of the main characters Dana Scully and Fox Moldrea is its own close world, which may well be alien to an incomprehensible person, but it is so close to us, the audience, those who literally live life together with the heroes series after series, those who understand each of the two partners and truly empathize with both.The first seasons have become classics. Fighting monsters and aliens from other worlds, government conspiracies and constant walking on the edge of the blade. All this allows us to trace the evolution of the main characters, who from season to season go to their goal, trying to get to the Truth. And we all know that the Truth is out there somewhere.As a result, by about 5-6 seasons, the series seemed to have begun to slip, as for me, the plots became less interesting and serious, but still as interesting. But the viewer is familiar with the characters, knows what to expect from them, they have fallen in love and there is no desire to stop watching the general history of the presented world.Seasons 8 and 9, in my opinion, contrast quite strongly with the previous ones. New main characters appear, the world around us is changing. The series tries to keep up with the times, having crossed the new millennium. But there is no longer enough of the beloved Molder, which is not enough on the screen. Cases investigated by FBI agents, however, come across quite interesting.Seasons 10 and 11 were for nothing. Why did I decide this for myself? Everything is simple. I didn't really remember them, although I looked carefully. This is significant, because these seasons seem to be white noise. They passed by, they didn't really remember anything. What can not be said about the first seasons, when literally every episode is remembered simply by name.The cast of the series is excellent. I love David Duchovny and Gillian Anderson in these roles. William B. Davis, Mitch Pileggi, Nicholas Lee and others have performed well. Even the minor characters who were the heroes of this or that series were so convincing and colorful that you still remember them (hello to Eugene Tooms and Clyde Brookman).The screensaver and musical theme of the series are very decent. They became iconic. The music in the series, the opening scenes of each episode - all this seems to invite you to plunge into the world of the 90s in America. The apathetic and anxious mood of each episode is in a hurry to say, now a new exciting and scary adventure awaits you. But you know for yourself that your favorite characters will come on stage and deal with what is happening with their inherent enthusiasm and zeal.The X-Files is a milestone in history. A cult phenomenon of its time. A story that lasted in fact for almost 20 years. Let it end not very interesting, but the very fact of the existence of this story often warms, because periodically you can stumble upon this or that series on TV, review the series once again consciously and again immerse yourself in the interesting world of aliens from outer space and extraordinary monsters.10 out of 10."
    },
    {
      "username": "ShadeGrenade",
      "userUrl": "https://www.imdb.com/user/ur7743887",
      "reviewLink": "https://www.imdb.com/review/rw2332010",
      "warningSpoilers": true,
      "date": "31 October 2010",
      "rate": "9",
      "helpful": "16 out of 20 found this helpful.",
      "title": "Paranoia for the masses",
      "content": "I was cleaning out the spare room the other day when I came across a stack of magazines ( 'Starburst', 'T.V. Zone' and 'Dreamwatch', all defunct alas ) from the mid-90's. The show everyone was talking about then was 'The X Files'. It debuted on U.S. television in 1993, and two years later scored the highest ratings for Britain's B.B.C.-2 channel ( it was then promoted to B.B.C.-1 ). The country ( nay, the world ) went 'X Files' crazy. You could not pick up a paper, turn on the radio nor switch on the television without seeing or hearing it being mentioned. I went into W.H. Smiths once to buy 'Private Eye' and David Duchovny and Gillian Anderson were on the covers of practically every magazine ( including 'Yachting Monthly' if I'm not mistaken ). Books about the making of the show or tie-in fiction took up whole shelves. Even Jonathan Ross' wife Jane Goldman had one published. Each time something odd happened in the world, reporters mentioned that it was like 'something out of the X Files'. Why was it so popular? The '90's saw a boom in television sci-fi, with umpteen 'Star Trek' series, 'Farscape' and 'Quantum Leap' on air, but this only partly answers the question. The plain fact is that 'The X Files' was a very good show.Created by Chris Carter, it told of the exploits of two F.B.I. agents - the enigmatic Fox Mulder ( Duchovny ) and the sceptical Dana Scully ( Anderson ) - whose job it is to investigate the unexplained, from alien abductions to mutants living down sewers. Mulder is obsessed with the idea that there is life on other planets ( he believes his sister was kidnapped by aliens ). The U.S. government, rather than be portrayed as the good guys, was depicted as being behind a major cover-up, hence the show's famous catchphrase 'The Truth Is Out There'. It owed a great debt to 'Kolchak: The Night Stalker' which starred Darren McGavin ( as roving news man 'Carl Kolchak' ) and ran for one season in 1974/75. Carter openly acknowledged this. But there was more to 'Files' than just aliens and other assorted grotesques. The relationship between Mulder and Scully had viewers fascinated; it was coldly formal, yet the possibility existed they might throw self-control to the wind and leap into bed. It was one one of the first shows to benefit from the then-new Internet as viewers could watch episodes and then debate them online. Anderson and Duchovny became sci-fi sex symbols, Mark Snow's catchy theme tune even made the British pop charts. An amusing sketch on 'Spitting Image' had Mulder and Scully confronted by the cast of the 'Scooby Doo' cartoon series, enraged at the blatant theft of their show's format. The stylishly directed show was both critically and commercially acclaimed, winning awards by the score for its writing and acting. Imitations came out of the woodwork - 'Poltergeist: The Legacy', 'Strange Luck', 'Dark Skies', and a retread of 'The Outer Limits'. But over time, viewers grew weary with the show's refusal to provide answers to the enigmas posed, and to make matters worse, Duchovny's involvement decreased to the point where he left eventually to be replaced by Robert Patrick ( from 'Terminator 2: Judgement Day' ). I cannot recall at which point I stopped watching. It could have Season 6. The show had run out of puff, and with Duchovny gone there seemed no point in tuning in anymore. The final blow for the show came with 9/11. Nobody wanted to watch a programme about government conspiracies in the aftermath of the horrific tragedy, and its ninth season a year later was to be its last. Two movies - 'The X Files' ( 1998 ) and 'The X Files: I Want To Believe' ( 2008 ) were made, but as the latter was a flop, it is unlikely we will see more. Mulder's sister will have to stay with the little green men.It is strange to think that a show so loved at the time could go on to be virtually forgotten now. I'm inclined to think it would have benefited from being cancelled a lot sooner. It is a reverse situation from 'Dark Skies' which suffered from having too few episodes! These days, Britain's main television obsession is 'The X Factor', a bizarre situation itself worthy of a Mulder and Scully investigation ( could Simon Cowell be an alien? )."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1369918",
      "warningSpoilers": false,
      "date": "17 May 2006",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "even in its lulls, this was one of the best shows on prime-time TV",
      "content": "The X-Files was, regrettably, not a show I was die-hard about when it was airing week after week in my youth/teen years. I would catch an episode here and there, be entertained, but also think 'this episode isn't TOO much different from the other ones'. The film that came out as the spin-off of the series did spark my interest more, however, as having a full arc even for someone as just a casual fan. Then as the series went in its latter days, I did tune out (thinking, 'why's Robert Patrick on the show, all this Scully baby-drama, etc'). However, as the show now goes on in syndication on the various cable channels, and I have refreshed my awareness of the first season as quasi-background, I've become rather addicted (minus the Patrick episodes, the lulls mentioned earlier). Sometimes what draws me in is the occasional, unexpected morbid humor. But mostly its in how the stories on the show, while of course sticking close to being 'TV', are the more engrossing the more you know about the characters. And there are some very inventive episodes regarding the unexplained, the bizarre human characters, and of course the UFO's and other assorted visitor folk. While I'm not as immersed in the show yet as with shows I've been watching since a youth (Seinfeld, Simpsons, South Park, Daily Show), part of the fun of getting further and further into the episodes is seeing the comparisons, of what's gotten better or worse, more intriguing or less. Much like the inspiration of the show- All the President's Men- the more you see of what can't be explained, the more you can't stop finding the truth. Hokey at times, sure, but also a cult-delight."
    },
    {
      "username": "Critic3",
      "userUrl": "https://www.imdb.com/user/ur0103057",
      "reviewLink": "https://www.imdb.com/review/rw0317205",
      "warningSpoilers": false,
      "date": "8 September 1998",
      "rate": "",
      "helpful": "17 out of 18 found this helpful.",
      "title": "A Must-See",
      "content": "I am a late bloomer to the X-Files. So I must say there is still hope for you if you have never even seen an episode. I watched the first few episodes and then stopped. I watched off and on if I was bored on Sunday nights. In the fifth season an episode called Bad Blood reeled me in and I 've been addicted ever since. David Duchovny is absolutely luscious, Gillian Anderson is one sexy lady, and of course the stories are great. I'm pretty much caught up by reading summaries, watching reruns, and of course seeing the movie. The X-Files has it all: great acting, great writing, great special effects, and, what else are you going to be doing on a Sunday night ?"
    },
    {
      "username": "AaronCapenBanner",
      "userUrl": "https://www.imdb.com/user/ur23589178",
      "reviewLink": "https://www.imdb.com/review/rw2921268",
      "warningSpoilers": false,
      "date": "13 December 2013",
      "rate": "9",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Do You Believe?",
      "content": "Chris Carter created this long-running series that starred David Duchovny & Gillian Anderson as FBI agents Fox Mulder(the believer) & Dana Scully(the skeptic), who spent nine seasons investigating the paranormal and government conspiracies(ghosts, UFO's, monsters, mutants, etc.) usually covered up by the Smoking Man(played by William B. Davis). Mitch Pileggi played their boss A.D. Skinner, who had to walk a fine line between helping them, but protecting himself against the other. Most episodes were exciting and well-made, with only a few real duds over the years, but far more classics, and epitomizes the 1990's feeling of false security. Trend-setting and influential show that is still popular today."
    },
    {
      "username": "blackasp98",
      "userUrl": "https://www.imdb.com/user/ur12009491",
      "reviewLink": "https://www.imdb.com/review/rw1630051",
      "warningSpoilers": false,
      "date": "3 April 2007",
      "rate": "10",
      "helpful": "23 out of 29 found this helpful.",
      "title": "Completely the best series ever made",
      "content": "In all my years of watching television,i have to say that the x-files to me has to be the most controversial and well made series in history.Chris Carter who gave the idea that the governments keep secrets or too many secrets away from the public,only gives the people the absolute power to say....I do believe.David duchovny and Gillian Anderson,is the best duo on TV bar none.And yet the supporting cast throughout the seasons gave us the spectacle of comradery in the toughest situations each agent had to endure.Especially the odd three known as the lone gunman.Aliens,specters,or freaks of nature or government conspiracies could not hide well enough,and this television show brought us more imagination to our lives than anything else being watched.Hopefully there will be a second movie which i hear is in the works to 2008.Hopefully the legal battles are done by then with David and carter.It was so sad to see them feud like this all because one wanted to move to L.A.,still other than that we are going to see a wonderful film to give us dreamers and aliens another chance to maybe see a next series kick-off with the new generation dynamic duo.Hats off to David and Gillian,and also carter.Fantastic wonder you gave us all."
    },
    {
      "username": "thornedbud",
      "userUrl": "https://www.imdb.com/user/ur1045089",
      "reviewLink": "https://www.imdb.com/review/rw0317304",
      "warningSpoilers": false,
      "date": "3 October 2002",
      "rate": "",
      "helpful": "121 out of 148 found this helpful.",
      "title": "Addictive",
      "content": "Forget alcohol, this absolutely incredible show is quite possibly more addicting. The acting is to say the least amazing, and the characters are so real it's a bit spooky. The first fours seasons are the best, combing sci-fi, horror and reality drama into a most satisfying combination. I find the show fearlessness when showing gore is refreshing (no i do not have a gore fetish)and ability to back up the most wild theories is almost unimaginable. The scripts are so unbelievable, that you might laugh them off at first thought, but they draw you in making you want to believe. Most episodes in the first 5 seasons are phenomenal, though there are some duds, after all, nobody can have perfection. The chemistry shared between the two main characters, Mulder and Scully is at times choking, they seem so connected that you can help but momentarily forget, they aren't real. Splitting them up pretty much wrote the epitaph for the show, bringing them back together for the series finale did boost it ever so slightly. Even before I watched the show I knew half the catch phrases, Trust no one, the truth is out there, i want to believe and characters names, now what does that say? The show will forever be remembered hopefully when it was strongest, not toward then sad end it had."
    },
    {
      "username": "eclud",
      "userUrl": "https://www.imdb.com/user/ur138982952",
      "reviewLink": "https://www.imdb.com/review/rw8480992",
      "warningSpoilers": false,
      "date": "23 August 2022",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Pilot episode still gives me the creeps",
      "content": "Its 100% that the very first episode of xfiles was very eerie and creepy. Back in 93' there was nothing like this show..period.The pilot stands alone on many ways...the Xfiles theme was not included, and you get a strange feeling about the episode..good acting with dark twist...a great mix of Sci-fi, thriller, mystery and horror.This epic piece af art is still watchable!!"
    },
    {
      "username": "xsnowangelx",
      "userUrl": "https://www.imdb.com/user/ur5938627",
      "reviewLink": "https://www.imdb.com/review/rw1232318",
      "warningSpoilers": true,
      "date": "6 December 2005",
      "rate": "10",
      "helpful": "30 out of 35 found this helpful.",
      "title": "Brilliant",
      "content": "The X-Files is one of the greatest shows ever made. The concept was original. The chemistry was amazing. Gillian Anderson and David Duchovny make one of the best on-screen pairings of all time. Week after week, the X-Files consistently delivered solid, fantastic entertainment. They had a great team of writers who wrote such original and brilliant episodes as 'Clyde Bruckman's Final Repose' and 'Beyond The Sea'. Whether it was straight horror: Season 4's 'Home', horror mixed with humor: Season 5's 'Bad Blood', or just good old aliens: Season 2's 'Little Green Men' X-Files did it best. It lasted a long 9 seasons and inspired 1 movie so far, and I am devastated that I have no new X-Files to see. There have been many imitations since it ended but nothing will ever come close."
    },
    {
      "username": "A_Different_Drummer",
      "userUrl": "https://www.imdb.com/user/ur44112735",
      "reviewLink": "https://www.imdb.com/review/rw3403618",
      "warningSpoilers": false,
      "date": "26 January 2016",
      "rate": "10",
      "helpful": "17 out of 26 found this helpful.",
      "title": "finally a reboot that works",
      "content": "So there I am, your humble reviewer, painfully forcing myself to watch Heroes Reborn and thinking how can anyone from the money side sign off on this junk, and I am writing IMDb reviews of Heroes Reborn and saying OMG this is awful for the lova Pete go buy a DVD of the original and loyal fans of Heroes Reborn, all 7 of them, are not only whacking the NOT USEFUL key but actually contacting me via the IMDb message board to tell it is time to hang up my reviewer spurs....... and then I hear that Heroes Reborn has not been renewed because even its own fans hated it and I think maybe my reviewing skills are not that far off and then I hear about the X-Files reboot and I try it with great fear NOT because I am afraid of aliens or the Truth but because I do not think I can handle another bad reboot ...... and then I am watching and I think Yes Yes that is how you do a reboot you work from strength and then augment that strength, and I know that I am hooked from halfway into the first episode and my brain is pumping endorphins and I love the way they incorporated modern conspiracies and I liked the way they used McHale from The Soup and I am having this incredible stream of consciousness but I am not actually typing anything and I have no idea how my thoughts are being recorded by the IMDb.."
    },
    {
      "username": "ILuvTVMovies",
      "userUrl": "https://www.imdb.com/user/ur147508992",
      "reviewLink": "https://www.imdb.com/review/rw8718359",
      "warningSpoilers": false,
      "date": "5 December 2022",
      "rate": "8",
      "helpful": "8 out of 9 found this helpful.",
      "title": "One of my favorite shows",
      "content": "The X-Files is a perfect show for those of us who love mystery, whodunits and the supernatural. It combines all three elements into a perfect blend. It's like comfort food. Chicken soup for the soul!There's nothing better than curling up on the couch and binging a bunch of episodes. The writing is fantastic, each episode is so well crafted and suspenseful.The lead actors worked really well together, creating real living people you care about. They also do a great job of having the viewer relate to, believe and root for both Mulder and Scully's points of view, even though they are diametrically opposed. That's no easy feat but The X-Files manages to do it.I would recommend this show to anyone who grew up reading mysteries or liked puzzles. It's a great ride well worth taking."
    },
    {
      "username": "scottmannen1",
      "userUrl": "https://www.imdb.com/user/ur20336887",
      "reviewLink": "https://www.imdb.com/review/rw3402307",
      "warningSpoilers": false,
      "date": "24 January 2016",
      "rate": "10",
      "helpful": "45 out of 74 found this helpful.",
      "title": "Perfect Timing on the Return to Greatness!",
      "content": "I actually watched the episode before taking the time to write a review about it. Too many people wanted to be first to write the reviews to the returned series, and have managed to get away with it by providing a review with the most generic information possible, so much so that it becomes glaring clear they never actually say the first episode. I suppose you can't blame someone for wanting to be a part of the return to greatness!I did watch the first episode, and it truly has been done correct! I figured that X-Files season 10 was either going to be 'boom or bust' endeavour. Lucky for us they really did right by it by bringing back all of the old regulars, bringing in some new talent that looks respectable, and changing the theme completely! It's no longer about the aliens vs. The human race. Instead Chris Carter has humans using alien technology as the root of all evil, the corporations behind them and the evil agenda's they are pushing!9/11 was just the beginning according to an older, wiser Mulder. These evil cabals led by the Smoking Man are using ufo's, nanotechnology and sub-orbital UAV technology to track Americans everywhere and anywhere. Without spoiling the main story, which by the way tracks as far back as to Roswell, and as recently as 9/11.There is a real tension that plays heavy to the U.S. conspiracy, even more than before! If episode 2 which airs tomorrow evening is as good or better than this, then we are in for a rare nostalgic treat! That's what a feel like when I am watch this show: A Nostalgic Treat.Enjoy!"
    },
    {
      "username": "Ed-Shullivan",
      "userUrl": "https://www.imdb.com/user/ur31328960",
      "reviewLink": "https://www.imdb.com/review/rw3402278",
      "warningSpoilers": false,
      "date": "24 January 2016",
      "rate": "10",
      "helpful": "37 out of 67 found this helpful.",
      "title": "Awesome pilot for the reboot! Wow!",
      "content": "Scully says to Mulder \"You want to believe, you so badly want to believe\". Mulder responds \"I do believe\". This simple exchange between Mulder and Scully re-ignites that age old question...\"Is their life on other planets and are there actual alien abductions of humans?\" It was this intense exchange between the two main characters that draws you right back in to the success of the original 1993 ground breaking Science Fiction series. Are we witnessing a bigger conspiracy than the Manhattan project? What was the outcome of the Manhattan project? Was this the cause of the initial entry of aliens to earth that the government kept secret for the past 70 years?There is so much information that Mulder and Scully are provided by the new rich guy Tad O'Malley (played by Joel McHale) that we the audience may start to believe that our own government is the biggest conspirator of hidden agendas and that the government would actually blame the cataclysmic outcome on our neighboring nations that would result in World War III. Or worse is there a global warming theory that has the elitist heading to another planet as the world is destroyed? I just loved that the great character actor Rance Howard was provided a part in the pilot episode as he divulges critical information to Mulder.It is a great start for the re-boot. Too bad it will be limited to only 6 episodes."
    }
  ],
  "errorMessage": ""
}