{
  "imDbId": "tt1533395",
  "title": "Life",
  "fullTitle": "Life (TV Series 2009–2009)",
  "type": "TVSeries",
  "year": "2009",
  "language": "en",
  "titleInLanguage": "Life (British TV series)",
  "url": "https://en.wikipedia.org/wiki/Life_(British_TV_series)",
  "plotShort": {
    "plainText": "Life is a British nature documentary series created and produced by the BBC in association with The Open University. It was first broadcast as part of the BBC's Darwin Season on BBC One and BBC HD from October to December 2009. The series takes a global view of the specialised strategies and extreme behaviour that living things have developed in order to survive; what Charles Darwin termed \"the struggle for existence\". Four years in the making, the series was shot entirely in high definition.\r\nLife premiered on 12 October 2009 in the United Kingdom consisting of ten 50-minute episodes. The opening programme gives a general introduction to the series, a second look at plants, and the remainder are dedicated to some of the major animal groups. They aim to show common features that have contributed to the success of each group, and to document intimate and dramatic moments in the lives of selected species chosen for their charisma or their extraordinary behaviour. A ten-minute making-of feature Life on Location aired at the end of each episode, taking the total running time to 60 minutes.\r\nLife is produced by the BBC Natural History Unit and The Open University. It is distributed under licence by the BBC in over 50 other countries, including by the Discovery Channel in the United States and Skai TV in Greece. The original script was written and narrated by David Attenborough.",
    "html": "<p>Life is a British nature documentary series created and produced by the BBC in association with The Open University. It was first broadcast as part of the BBC's Darwin Season on BBC One and BBC HD from October to December 2009. The series takes a global view of the specialised strategies and extreme behaviour that living things have developed in order to survive; what Charles Darwin termed \"the struggle for existence\". Four years in the making, the series was shot entirely in high definition.</p><p>Life premiered on 12 October 2009 in the United Kingdom consisting of ten 50-minute episodes. The opening programme gives a general introduction to the series, a second look at plants, and the remainder are dedicated to some of the major animal groups. They aim to show common features that have contributed to the success of each group, and to document intimate and dramatic moments in the lives of selected species chosen for their charisma or their extraordinary behaviour. A ten-minute making-of feature Life on Location aired at the end of each episode, taking the total running time to 60 minutes.</p><p>Life is produced by the BBC Natural History Unit and The Open University. It is distributed under licence by the BBC in over 50 other countries, including by the Discovery Channel in the United States and Skai TV in Greece. The original script was written and narrated by David Attenborough.</p>"
  },
  "plotFull": {
    "plainText": "Life is a British nature documentary series created and produced by the BBC in association with The Open University. It was first broadcast as part of the BBC's Darwin Season on BBC One and BBC HD from October to December 2009. The series takes a global view of the specialised strategies and extreme behaviour that living things have developed in order to survive; what Charles Darwin termed \"the struggle for existence\". Four years in the making, the series was shot entirely in high definition.\r\nLife premiered on 12 October 2009 in the United Kingdom consisting of ten 50-minute episodes. The opening programme gives a general introduction to the series, a second look at plants, and the remainder are dedicated to some of the major animal groups. They aim to show common features that have contributed to the success of each group, and to document intimate and dramatic moments in the lives of selected species chosen for their charisma or their extraordinary behaviour. A ten-minute making-of feature Life on Location aired at the end of each episode, taking the total running time to 60 minutes.\r\nLife is produced by the BBC Natural History Unit and The Open University. It is distributed under licence by the BBC in over 50 other countries, including by the Discovery Channel in the United States and Skai TV in Greece. The original script was written and narrated by David Attenborough.\r\nProduction\r\nProduction team\r\nLife was the first series commissioned by the then Network Controller of BBC One, Peter Fincham, just weeks after he took up the post in March 2005. It was reportedly one of the most expensive documentaries ever ordered by the broadcaster, with a budget of £10 million (though the BBC have never confirmed this figure). The Natural History Unit's production team includes series producer Martha Holmes (Life in the Freezer, The Blue Planet) and executive producer Mike Gunton (Galápagos, Life in the Undergrowth). Individual episodes were produced by Rupert Barrington, Adam Chapman, Martha Holmes, Neil Lucas, Patrick Morris and Ted Oakes. The specially-commissioned score was composed by George Fenton and performed by the Band of Life. The opening titles and brand imaging were created by Burrell Durrant Hifle.\r\nIn February 2007, Gunton revealed that the BBC were looking for a new narrator for the series owing to Attenborough's imminent retirement. However, later that year it was announced that the veteran narrator would be collaborating on both this series and the forthcoming Frozen Planet.\r\nFilming\r\nThe first year of production was spent researching possible stories for the series. The Life team contacted scientists and experts around the world in search of new discoveries to film, and new approaches to familiar subjects. Nearly three years of filming followed, involving 150 shoots on all seven continents, many of them full-scale expeditions to remote wilderness areas.\r\nNew camera technology was used to build on the cinematic techniques first employed in Planet Earth, notably the pioneering use of stabilised helicopter-mounted cameras. The Life crew succeeded in using gyroscopic stabilisation to create steady shots from moving vehicles, even on rough terrain, allowing the cameras to track alongside reindeer and elephant herds for the first time. Miniature high-definition cameras were used extensively for the \"Insects\" programme. In the forests of Mexico, the crew erected a spider's web of cables in the canopy to give the sense of flying alongside millions of monarch butterflies. In Zambia, they filmed from a hot air balloon to avoid disturbing the huge flocks of straw-coloured fruit bats.\r\nFollowing recent debate about the use of artifice in natural history programmes, the BBC were more candid about sequences which had not been filmed in the wild. Close-ups of wild clownfish would have disturbed their natural behaviour, so captive animals were filmed in an aquarium at a Welsh university.\r\nDespite the best efforts of the film-makers, some sequences ended up on the cutting room floor. Scientists in Arctic Scandinavia had accumulated enough evidence to suggest that golden eagles were the main predators of reindeer calves, but an attack had never been witnessed. After two summers tracking the herds in Finland, cameraman Barrie Britton finally filmed a hunt in full. However, the attack had taken place nearly a mile away, and the footage was too distant to be considered for broadcast.\r\nTelevision firsts\r\nThe budget and timescale for the series enabled the producers to set ambitious filming challenges, and expedition crews brought back several sequences which have never been shown before.\r\nSome involved highly specialised hunting behaviour that has only recently been discovered. In the shallow, muddy waters of Florida Bay, one pod of bottlenose dolphins have learned a unique hunting technique called mud-ring feeding. Aerial photography shows the lead dolphin circling a shoal of mullet, flicking its tail flukes to disturb mud on the seabed. The fish trapped inside the mud ring panic and leap out of the water to escape the trap, straight into the waiting mouths of the pod. In Kenya's Lewa Wildlife Conservancy, three cheetah brothers have learned to take on prey many times their own size. They are filmed bringing down an ostrich, but also hunt zebra, eland and oryx. A film crew travelled to the Falkland Islands to follow up reports of an orca that had learned to take elephant seal pups from a nursery pool. On the Indonesian island of Rinca, the first footage of Komodo dragons hunting a water buffalo corroborated new scientific evidence suggesting the dragons used venom to kill their prey.\r\nOther sequences had previously proved too difficult to film. The humpback whale heat run has been dubbed \"the biggest battle on Earth\", but the whales move so fast that underwater cameras struggle to keep up. The Life crew used cameras mounted on helicopters and boats along with a team of free-divers to follow the action. The biggest filming challenge was to show a year in the life of an oak woodland using timelapse photography. After capturing real-world footage of a Devon wood, the crew rebuilt the entire scene in a studio in Exeter and digitally superimposed 96 separate layers of footage to create the final one-minute sequence. The whole project took two years.\r\nSuper high-speed cameras capable of shooting up to 8,000 frames per second were used to slow down dramatic action. For the first time, these were used underwater to reveal the hunting behaviour of sailfish. They were also used to show 'Jesus Christ lizards' running on water, the courtship flight of the marvellous spatuletail and flying fish leaving the water. The first footage showing Antarctic killer whales hunting a crabeater seal, but the seal survived.\r\nThe pebble toad's strange escape method had been caught on tape for the first time.\r\nBroadcast\r\nLife debuted on British television on 12 October 2009, with a standard definition broadcast on BBC One and a high-definition simulcast on BBC HD.\r\nThe series was sold to international broadcasters by the BBC's commercial arm, BBC Worldwide, and marketed under the BBC Earth brand used for all BBC-produced natural history content. The global success of Life was noted as one of the key factors behind BBC Worldwide's record profits in 2010.\r\nThe series received its North American premiere on Discovery Channel Canada on 15 November 2009. In the US, the series premiered on 21 March 2010 on Discovery Channel with Attenborough's narration replaced by Oprah Winfrey reading from a different script tailored to American audiences. Each episode was curtailed in length to accommodate commercial breaks. The behind-the-scenes shorts were dropped for the same reason, and instead were compiled into an eleventh episode.\r\nLife was also acquired by several Latin American broadcasters and debuted on 18 March 2010 on Discovery Channel Latin America and Discovery HD Theater, with narration by Colombian singer Juanes.\r\nIn Israel the series aired in July 2010 as part of the new IBA channel Channel 1 HD and it was narrated by Orna Banay.\r\nIn Turkey, the series aired in May 2010 on NTV (Turkey). It was narrated by famous Turkish actor Tuncel Kurtiz.\r\nIn Australia, an edited version (without Life on Location) with Attenborough's narration aired on ABC1 each Sunday at 7:30 pm from 25 July 2010.\r\nIn Croatia the series aired each Saturday from 2 October 2010 on HRT1.\r\nEpisodes\r\n\"Our planet may be home to 30 million different kinds of animals and plants, each individual locked in its own lifelong fight for survival. Everywhere you look, on land or in the ocean, there are extraordinary examples of the lengths living things go to stay alive.\"— David Attenborough's opening narration\r\nInside Life\r\nA complementary children's TV series, Inside Life, aired on the CBBC Channel and followed young volunteers as they go behind the scenes with the Life production team and accompany the film-makers on expeditions in the field. It began airing on 13 October 2009.\r\nOne Life\r\nIn 2011, BBC Earth used Attenborough's footage of animals to create a documentary film called One Life, narrated by Daniel Craig.\r\nReception\r\nThe series was nominated for six Primetime Emmy Awards in July 2010. These included a nomination for Outstanding Nonfiction Series along with selections in a number of technical categories. The episode \"Challenges of Life\" went on to win the Outstanding Cinematography for Nonfiction Programming award.\r\nIn June 2010, Life won two Rockies at the Banff World Television Festival for best wildlife and natural history programme and best documentary.\r\nIn October 2010, Life was awarded the Jury's Special Prize at the Wildscreen Festival.\r\nDVD, Blu-ray Disc and book\r\nThe series was released in the UK as Region 2, four-disc DVD (BBCDVD3068) and Blu-ray Disc (BBCBD0055) box sets by 2Entertain on 30 November 2009. Region 1 DVD and Blu-ray Discs of both the BBC and Discovery versions of the series were released on 1 June 2010. In Australia, a Region 4, four-disc DVD and Blu-ray Disc was released by ABC DVD/Village Roadshow on 7 October 2010.\r\nA hardcover book written by producers Martha Holmes and Michael Gunton accompanies the television series. Life was published in the UK by BBC Books (ISBN 9781846076428) on 1 October 2009.",
    "html": "<p>Life is a British nature documentary series created and produced by the BBC in association with The Open University. It was first broadcast as part of the BBC's Darwin Season on BBC One and BBC HD from October to December 2009. The series takes a global view of the specialised strategies and extreme behaviour that living things have developed in order to survive; what Charles Darwin termed \"the struggle for existence\". Four years in the making, the series was shot entirely in high definition.</p><p>Life premiered on 12 October 2009 in the United Kingdom consisting of ten 50-minute episodes. The opening programme gives a general introduction to the series, a second look at plants, and the remainder are dedicated to some of the major animal groups. They aim to show common features that have contributed to the success of each group, and to document intimate and dramatic moments in the lives of selected species chosen for their charisma or their extraordinary behaviour. A ten-minute making-of feature Life on Location aired at the end of each episode, taking the total running time to 60 minutes.</p><p>Life is produced by the BBC Natural History Unit and The Open University. It is distributed under licence by the BBC in over 50 other countries, including by the Discovery Channel in the United States and Skai TV in Greece. The original script was written and narrated by David Attenborough.</p><br/><h3>Production</h3><h4>Production team</h4><p>Life was the first series commissioned by the then Network Controller of BBC One, Peter Fincham, just weeks after he took up the post in March 2005. It was reportedly one of the most expensive documentaries ever ordered by the broadcaster, with a budget of £10 million (though the BBC have never confirmed this figure). The Natural History Unit's production team includes series producer Martha Holmes (Life in the Freezer, The Blue Planet) and executive producer Mike Gunton (Galápagos, Life in the Undergrowth). Individual episodes were produced by Rupert Barrington, Adam Chapman, Martha Holmes, Neil Lucas, Patrick Morris and Ted Oakes. The specially-commissioned score was composed by George Fenton and performed by the Band of Life. The opening titles and brand imaging were created by Burrell Durrant Hifle.</p><p>In February 2007, Gunton revealed that the BBC were looking for a new narrator for the series owing to Attenborough's imminent retirement. However, later that year it was announced that the veteran narrator would be collaborating on both this series and the forthcoming Frozen Planet.</p><h4>Filming</h4><p>The first year of production was spent researching possible stories for the series. The Life team contacted scientists and experts around the world in search of new discoveries to film, and new approaches to familiar subjects. Nearly three years of filming followed, involving 150 shoots on all seven continents, many of them full-scale expeditions to remote wilderness areas.</p><p>New camera technology was used to build on the cinematic techniques first employed in Planet Earth, notably the pioneering use of stabilised helicopter-mounted cameras. The Life crew succeeded in using gyroscopic stabilisation to create steady shots from moving vehicles, even on rough terrain, allowing the cameras to track alongside reindeer and elephant herds for the first time. Miniature high-definition cameras were used extensively for the \"Insects\" programme. In the forests of Mexico, the crew erected a spider's web of cables in the canopy to give the sense of flying alongside millions of monarch butterflies. In Zambia, they filmed from a hot air balloon to avoid disturbing the huge flocks of straw-coloured fruit bats.</p><p>Following recent debate about the use of artifice in natural history programmes, the BBC were more candid about sequences which had not been filmed in the wild. Close-ups of wild clownfish would have disturbed their natural behaviour, so captive animals were filmed in an aquarium at a Welsh university.</p><p>Despite the best efforts of the film-makers, some sequences ended up on the cutting room floor. Scientists in Arctic Scandinavia had accumulated enough evidence to suggest that golden eagles were the main predators of reindeer calves, but an attack had never been witnessed. After two summers tracking the herds in Finland, cameraman Barrie Britton finally filmed a hunt in full. However, the attack had taken place nearly a mile away, and the footage was too distant to be considered for broadcast.</p><h4>Television firsts</h4><p>The budget and timescale for the series enabled the producers to set ambitious filming challenges, and expedition crews brought back several sequences which have never been shown before.</p><p>Some involved highly specialised hunting behaviour that has only recently been discovered. In the shallow, muddy waters of Florida Bay, one pod of bottlenose dolphins have learned a unique hunting technique called mud-ring feeding. Aerial photography shows the lead dolphin circling a shoal of mullet, flicking its tail flukes to disturb mud on the seabed. The fish trapped inside the mud ring panic and leap out of the water to escape the trap, straight into the waiting mouths of the pod. In Kenya's Lewa Wildlife Conservancy, three cheetah brothers have learned to take on prey many times their own size. They are filmed bringing down an ostrich, but also hunt zebra, eland and oryx. A film crew travelled to the Falkland Islands to follow up reports of an orca that had learned to take elephant seal pups from a nursery pool. On the Indonesian island of Rinca, the first footage of Komodo dragons hunting a water buffalo corroborated new scientific evidence suggesting the dragons used venom to kill their prey.</p><p>Other sequences had previously proved too difficult to film. The humpback whale heat run has been dubbed \"the biggest battle on Earth\", but the whales move so fast that underwater cameras struggle to keep up. The Life crew used cameras mounted on helicopters and boats along with a team of free-divers to follow the action. The biggest filming challenge was to show a year in the life of an oak woodland using timelapse photography. After capturing real-world footage of a Devon wood, the crew rebuilt the entire scene in a studio in Exeter and digitally superimposed 96 separate layers of footage to create the final one-minute sequence. The whole project took two years.</p><p>Super high-speed cameras capable of shooting up to 8,000 frames per second were used to slow down dramatic action. For the first time, these were used underwater to reveal the hunting behaviour of sailfish. They were also used to show 'Jesus Christ lizards' running on water, the courtship flight of the marvellous spatuletail and flying fish leaving the water. The first footage showing Antarctic killer whales hunting a crabeater seal, but the seal survived.</p><p>The pebble toad's strange escape method had been caught on tape for the first time.</p><br/><h3>Broadcast</h3><p>Life debuted on British television on 12 October 2009, with a standard definition broadcast on BBC One and a high-definition simulcast on BBC HD.</p><p>The series was sold to international broadcasters by the BBC's commercial arm, BBC Worldwide, and marketed under the BBC Earth brand used for all BBC-produced natural history content. The global success of Life was noted as one of the key factors behind BBC Worldwide's record profits in 2010.</p><p>The series received its North American premiere on Discovery Channel Canada on 15 November 2009. In the US, the series premiered on 21 March 2010 on Discovery Channel with Attenborough's narration replaced by Oprah Winfrey reading from a different script tailored to American audiences. Each episode was curtailed in length to accommodate commercial breaks. The behind-the-scenes shorts were dropped for the same reason, and instead were compiled into an eleventh episode.</p><p>Life was also acquired by several Latin American broadcasters and debuted on 18 March 2010 on Discovery Channel Latin America and Discovery HD Theater, with narration by Colombian singer Juanes.</p><p>In Israel the series aired in July 2010 as part of the new IBA channel Channel 1 HD and it was narrated by Orna Banay.</p><p>In Turkey, the series aired in May 2010 on NTV (Turkey). It was narrated by famous Turkish actor Tuncel Kurtiz.</p><p>In Australia, an edited version (without Life on Location) with Attenborough's narration aired on ABC1 each Sunday at 7:30 pm from 25 July 2010.</p><p>In Croatia the series aired each Saturday from 2 October 2010 on HRT1.</p><br/><h3>Episodes</h3><blockquote>\"Our planet may be home to 30 million different kinds of animals and plants, each individual locked in its own lifelong fight for survival. Everywhere you look, on land or in the ocean, there are extraordinary examples of the lengths living things go to stay alive.\"— David Attenborough's opening narration</blockquote><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"color:black;text-align:center\"><th scope=\"col\" style=\"background:#00FF00;width:5%\"><abbr title=\"Number\">No.</abbr></th><th scope=\"col\" style=\"background:#00FF00\">Title</th><th scope=\"col\" style=\"background:#00FF00\">Original air date</th><th scope=\"col\" style=\"background:#00FF00;width:10%\">UK viewers<br>(millions)</th></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep1\" style=\"text-align:center\">1</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Challenges of Life\"</td><td style=\"text-align:center\">12 October 2009</td><td style=\"text-align:center\">6.84 million viewers (26.4% audience share)<i></i></td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #00FF00\"><div class=\"thumb tleft\"></div><p>The opening episode introduces the series by showing examples of extraordinary feeding, hunting, courting and parenting behaviour from across the animal kingdom and around the globe.</p><ul><li>In <span>Florida Bay</span>, <span>bottlenose dolphins</span> catch leaping fish as they attempt to escape a corral of encircling mud, whipped up with the lead dolphin's tail.</li><li>Other unusual collaborative hunting techniques include three <span>cheetahs</span> combining to bring down an <span>ostrich</span> in <span>Kenya</span>, chameleons catching insects with its tongue in <span>Madagascar</span>, and <span>Antarctic</span> <span class=\"mw-redirect\">killer whales</span> attacking a <span>crabeater seal</span>.</li><li>In the <span>Gulf of Mexico</span>, <span>flying fish</span> take an aerial route to avoid predatory <span>sailfish</span>.</li><li>In <span>Brazil</span>, <span>tufted capuchins</span> have learned to crack open palm nuts by smashing them with rocks.</li></ul><p><span>Venus flytrap</span> plants ensnare their unwitting insect victims to gain nutrients in <span>North Carolina</span>.</p><ul><li>The mating behavior of <span>stalk-eyed flies</span> is discussed.</li><li>Two male <span class=\"mw-redirect\">hippos</span> clash over the territorial mating rights to a remaining deep stretch of the <span>Luangwa River</span> in <span>Zambia</span>.</li><li>In <span>Oregon</span>, male <span>Clark's grebes</span> put on a spectacular mating performance with their mates.</li><li>A female <span class=\"mw-redirect\">giant Pacific octopus</span> makes the ultimate sacrifice, starving to death as she guards her eggs.</li><li>In some species, parents go to great lengths to protect their young. A mother <span>strawberry poison-dart frog</span> carries each of her six tadpoles high into the rainforest canopy to the safety of a <span class=\"mw-redirect\">bromeliad</span> pool, then provides them with nutritious unfertilised eggs.</li><li>On <span>Deception Island</span>, young <span>chinstrap penguins</span> are trapped on a beach by ice-strewn seas. Abandoned by their parents, they must reach open water to feed. A lone chick fights its way through the ice, only to be ambushed by a <span>leopard seal</span>. <i>Life on Location: Ice Alliance</i> shows how the filmmakers collaborated with a French yachtsman and the <span>Royal Navy</span> to film <span>Antarctica</span>'s top predators.</li></ul></td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep2\" style=\"text-align:center\">2</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Reptiles and Amphibians\"</td><td style=\"text-align:center\">19 October 2009</td><td style=\"text-align:center\">4.93 million viewers (18.9% audience share)<i></i></td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #00FF00\"><div class=\"thumb tright\"></div><p>In the opening sequence, a solitary male <span>Komodo dragon</span> battles another male during the breeding season on <span>Komodo</span>. This, states Attenborough, is the last place on Earth still ruled by <span>reptiles</span>. Though they may seem primitive, reptiles and <span>amphibians</span> still thrive thanks to diverse survival strategies.</p><ul><li>In <span>Venezuela</span>, <span>waterfall toad</span> escapes a hungry snake by jumping off the branch its on and landing on another branch far way from the snake. Nearby, on the cliffs and plateaus, a <span>pebble toad</span> evades a <span>tarantula</span> by free-falling down a steep rock face. On the <span>Pantanal</span>, <span>caiman</span> wait for the rains to arrive so they can feast on fish. In <span>Belize</span>, The basilisk, nicknamed the <span>Jesus Christ lizard</span>, can literally run on water. In <span>Brazil</span>, the <span class=\"mw-redirect\">Brazilian pygmy gecko</span> is so light it does not break the water surface.</li><li>In <span>Madagascar</span>, a panther chameleon catches insects with its tongue to feed itself.</li><li>Reptiles are <span>cold-blooded</span>, and some have developed unusual strategies to absorb heat. In the <span>Namib</span> Desert, the panther chameleon's cousin, the <span>Namaqua chameleon</span>, darkens the skin on the side of its body facing the sun.</li><li>In <span>Canada</span>, a male <span>red-sided garter snake</span> masquerades as a female using fake <span>pheromones</span>, attracting rival males which help raise its body temperature and thus its chance of breeding.</li><li><span>Malagasy collared lizards</span> conceal their eggs by burying them, but egg-eating <span>hognose snakes</span> stake out their favourite laying sites.</li><li>Other reptiles guard their eggs. <span>Horned lizards</span> in <span>Arizona</span> drive off egg-eating predators such as <span class=\"mw-redirect\">western patch-nosed snakes</span>, but lizard-eating adversaries such as <span>coachwhip</span> snakes prompt a different reaction – the lizard plays dead.</li><li><span>Niue Island</span> <span class=\"mw-redirect\">sea kraits</span> lay their eggs in a chamber only accessible via an underwater tunnel.</li><li>During the dry season in Africa, a male <span>giant bullfrog</span> saves his young from dying out in their birth pool, by making a path that leads to the main pool.</li><li>In <span>Komodo</span>, Komodo dragons prey on <span>water buffalo</span> in the dry season. They stalk a buffalo for three weeks as it slowly succumbs to a toxic bite, then strip the carcass in four hours. In <i>Life on Location: Chasing the Dragon</i>, the Komodo film crew tell of the harrowing experience of filming the dragon hunt.</li></ul></td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep3\" style=\"text-align:center\">3</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Mammals\"</td><td style=\"text-align:center\">26 October 2009</td><td style=\"text-align:center\">5.55 million viewers (21.9% audience share)<i></i></td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #00FF00\"><div class=\"thumb tleft\"></div><p>Intelligence, warm blood and strong family bonds have made <span>mammals</span> the most successful group of animals on the planet.</p><ul><li>In the <span>Antarctic</span>, a <span>Weddell seal</span> leads her pup on its first swim beneath the ice.</li><li>In East Africa, a <span>rufous sengi</span> uses a mental map of the pathways it has cleared to outwit a chasing lizard.</li><li>A young <span>aye-aye</span> takes four years to learn how to find and extract <span>beetle</span> grubs, food no other mammal can reach.</li><li><span>Reindeer</span> move through the <span>Arctic</span> <span>tundra</span>, making the longest overland migration of any animal. Other mammals have evolved different ways of travelling long distances: ten million <span class=\"mw-redirect\">fruit bats</span> (<span>straw-coloured fruit bats</span>) congregate at <span>Zambia</span>'s <span>Kasanka</span> swamps to gorge on fruiting trees.</li><li>Mammals employ different strategies to find food. At night on the African <span class=\"mw-redirect\">savannah</span>, <span>hyenas</span> force <span>lions</span> off a kill through sheer weight of numbers, whilst in the Arctic, dozens of <span>polar bears</span> take advantage of a <span>bowhead whale</span> carcass.</li><li>Raising young is another important factor in mammals' success. <span>Coatis</span> and <span>meerkats</span> form social groups to share the burden of childcare.</li><li>A first-time <span>African elephant</span> mother needs the experience of the herd's matriarch to get her young calf out of trouble. The largest animals in the ocean are also mammals.</li><li>The seas around <span>Tonga</span> are both a nursery and mating ground for <span>humpback whales</span>. A female leads her potential suitors on a chase, the males battling for dominance behind her. <i>Life on Location: The Heat Run</i> follows the never-before filmed humpback heat run.</li></ul></td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep4\" style=\"text-align:center\">4</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Fish\"</td><td style=\"text-align:center\">2 November 2009</td><td style=\"text-align:center\">4.56 million viewers (18.1% audience share)<i></i></td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #00FF00\"><div class=\"thumb tright\"></div><p><span>Fish</span>, the most diverse group of <span>vertebrate</span> animals, thrive in the world's <span>rivers</span>, <span>lakes</span> and <span>oceans</span>.</p><ul><li>Slow-motion footage reveals the behaviour of some of the fastest fish in the sea, <span>sailfish</span> and <span>flying fish</span>. The latter gather in large numbers to lay their eggs on a floating palm frond, which sinks under the weight.</li><li>The eggs of <span class=\"mw-redirect\">weedy sea dragons</span>, found in the shallow waters off southern Australia, are carried by the male.</li><li>In the Southwest Pacific, a <span class=\"mw-redirect mw-disambig\">Convict fish</span> makes its group of thousands of young juveniles to do all the work for him.</li><li>In the fertile seas of the western Pacific, competition is fierce. A <span>sarcastic fringehead</span> defends its home, an old shell, from a passing <span>octopus</span> and a rival.</li><li>In Japan, <span>mudskippers</span> have carved a niche on the rich <span>mudflats</span>.</li><li><span>Freshwater fish</span> are also featured. Tiny <span>gobies</span> are filmed climbing Hawaiian waterfalls to colonise the placid pools upstream, while in East Africa, <span>barbels</span> pick clean the skin of the resident <span class=\"mw-redirect\">hippos</span> and feed on their rich dung in return.</li><li><span>Wrasses</span> perform the cleaning duties on <span>coral reefs</span>, but <span class=\"mw-redirect\">jacks</span> also remove parasites by scratching against the rough skin of <span>silvertip sharks</span>.</li><li><span>Clownfish</span>, whose life cycle is filmed in intimate detail using macro cameras, are protected by the fronds of an <span>anemone</span>, but other species seek safety in numbers. A shoal of ever-moving <span>anchovies</span> proves too difficult a target for <span>sea lions</span>. Sometimes, predators have the edge: <span class=\"mw-redirect\">ragged tooth sharks</span> are shown attacking <span>sardines</span> trapped in shallow waters off South Africa.</li><li>In <span>Belize</span>, <span>Snapper fish</span> disperse their eggs out in the open, but some of the eggs fall victim to the surrounding hungry <span>whale sharks</span>.</li><li><i>Life on Location: Fish Out of Water</i> looks at the efforts of underwater cameramen to capture the sailfish and flying fish sequences.</li></ul></td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep5\" style=\"text-align:center\">5</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Birds\"</td><td style=\"text-align:center\">9 November 2009</td><td style=\"text-align:center\">4.33 million viewers (17.6% audience share)<i></i></td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #00FF00\"><div class=\"thumb tleft\"></div><p><span>Birds</span>, whose <span>feathers</span> have made them extremely adaptable and enabled them to fly, are the subject of the fifth episode.</p><ul><li>The courtship flight of the <span class=\"mw-redirect\">marvellous spatuletail hummingbird</span> is shot at high speed to slow down its rapid wing beats. The male must rest every few seconds due to the energy needed to display his elongated tail feathers.</li><li><span>Lammergeiers</span>, by contrast, soar on mountain thermals with a minimum of effort.</li><li>A <span>red-billed tropicbird</span> bringing a meal back to its chick uses aerial agility to evade the marauding <span>magnificent frigatebirds</span>.</li><li>During their trip from <span>Argentina</span> to <span>Canada</span>, <span>red knots</span> make a pit stop in <span>Delaware</span> Bay to feast on <span>horseshoe crab</span> eggs, however, this also gives <span>peregrine falcons</span> a chance to get an easy meal of red knots.</li><li>Some birds nest in extreme locations to avoid threats from predators. <span>Kenya</span>'s caustic <span>soda lakes</span> are a perilous environment for a <span>lesser flamingo</span> chick, while <span>chinstrap penguins</span> breed on a volcanic island off the <span>Antarctic Peninsula</span>.</li><li>In South Africa's <span>Dassen Island</span> and <span>Malgas Island</span>, declining fish stocks force <span>Cape gannets</span> to abandon their chicks to search for food, presenting <span>great white pelicans</span> with the chance to snatch an easy meal to feed their own young.</li><li>Feathers can also be used for display. Male <span class=\"mw-redirect\">sage grouse</span> square up to one another at their leks, courting <span>Clark's</span> and <span>western grebes</span> perform an elaborate ritual to reaffirm their bond and thousands of lesser flamingos move in a synchronised display in <span>Lake Bogoria</span>.</li><li>Male birds-of-paradise show off their brilliant plumes in wild courtship displays (some of this footage is from Planet Earth). In <span>West Papua</span>, the small, drab <span>Vogelkop bowerbird</span> uses a different strategy. The male decorates his bower with colourful jewels from the forest, and uses vocal <span>mimicry</span> to attract the attention of a female. Mating is filmed for the first time, the end result of a long and difficult quest featured in <i>Life on Location: Hide and Seek</i>.</li></ul></td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep6\" style=\"text-align:center\">6</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Insects\"</td><td style=\"text-align:center\">16 November 2009</td><td style=\"text-align:center\">3.80 million viewers (14.6% audience share)<i></i></td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #00FF00\"><div class=\"thumb tright\"></div><p>The sixth episode enters the world of <span>insects</span>. By assuming a variety of body shapes and incorporating armour and wings, they have evolved diverse survival strategies and become the most abundant creatures on Earth.</p><ul><li>In <span>Chilean</span> <span>Patagonia</span>, male <span>Darwin's beetles</span> lock horns and hurl their rivals from the treetops in search of a mate.</li><li>A <span>damselfly</span>'s chance to mate and lay eggs can be cut abruptly short by a leaping frog.</li><li><span class=\"mw-redirect\">Monarch butterflies</span> use their wings to power them on an epic migration to their hibernating grounds in the forests of <span>Mexico</span>'s <span>Sierra Madre</span>.</li><li>In <span>Mono Lake</span>, <span>alkali flies</span> are constantly preyed upon by <span>Wilson's phalaropes</span> and seagulls.</li><li>Many insects carry chemical weapons as a form of defence. High-speed cameras show <span>oogpister beetles</span> squirting <span>formic acid</span> into the face of an inquisitive <span>mongoose</span>, <span>devil rider sick insects</span> firing biter-tasting oils called turpines from the back of their heads and necks, European wood ants firing stinging acid from their abdomens, and <span>bombardier beetles</span> firing boiling caustic liquid from their abdomens.</li><li>Some insects gain an advantage through co-operation. When an <span>American black bear</span> destroys a <span>bee</span>'s nest, the colony survives by carrying their honey to a new site.</li><li><span>Japanese red bug</span> nymphs will move to a different nest if their mother fails to provide sufficient food.</li><li>In the Australian <span>Outback</span>, male <span>Dawson's bees</span> fight to the death over females emerging from their nest burrows. As a result, all males die, but the strongest mate most often.</li><li><span>Argentina</span>'s <span class=\"mw-redirect\">grasscutter ants</span> form huge colonies five million strong. They feed on a <span>fungus</span> which they cultivate underground, in nest structures which have natural ventilation.</li><li><i>Life on Location: Flying with Butterflies</i> documents the Mexico crew's attempts to rig up aerial camera shots of the awakening monarch butterflies.</li></ul></td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep7\" style=\"text-align:center\">7</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Hunters and Hunted\"</td><td style=\"text-align:center\">23 November 2009</td><td style=\"text-align:center\">4.04 million viewers (15.9% audience share)<i></i></td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #00FF00\"><div class=\"thumb tleft\"></div><p>Mammals have adopted diverse strategies to hunt their prey and evade predators.</p><ul><li>As well as revisiting the cheetah hunt first shown in Challenges of Life, the episode shows how a sure-footed <span>ibex</span> kid escapes a hunting <span>fox</span> by bounding across a precipitous mountainside above the <span>Dead Sea</span>.</li><li>Slow motion footage reveals the fishing behaviour of <span>greater bulldog bats</span> in <span>Belize</span>.</li><li>The play-fighting of juvenile <span>stoats</span> helps train them to run down prey such as <span>rabbits</span>, which are many times their own size.</li><li>After the dolphin hunt from Challenges of Life is revisited, in the <span>Alaskan</span> midsummer, <span>Brown bears</span> await the return of spawning <span class=\"mw-redirect\">salmon</span> so they can feast with enough fat to survive the winter.</li><li>The alpha female of an <span>Ethiopian wolf</span> pack stays at the den to wean her cubs while other adults hunt rats on the highland plateau.</li><li>The extraordinary nasal appendage of a <span>star-nosed mole</span> enables it to hunt successfully underground and, by using bubbles to detect its prey, underwater.</li><li>In <span>Bandhavgarh National Park</span>, a <span>tiger</span>'s stealthy approach to a group of feeding <span>chital</span> deer is thwarted when a <span>langur</span>, watching from above, raises the alarm.</li><li>The final sequence shows a female killer whale taking <span>elephant seal</span> pups from their nursery pool in the <span>Falkland Islands</span>. This is a risky strategy as she could easily become beached in the shallow water. She is the only killer whale known to hunt this way, but her calf shadows her moves, ensuring her knowledge will be passed on. Also close by were the film crew, who reveal how the sequence was shot in <i>Life on Location: Rock Pooling</i>.</li></ul></td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep8\" style=\"text-align:center\">8</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Creatures of the Deep\"</td><td style=\"text-align:center\">30 November 2009</td><td style=\"text-align:center\">3.95 million viewers (15.6% audience share)<i></i></td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #00FF00\"><div class=\"thumb tright\"></div><p><span class=\"mw-redirect\">Marine invertebrates</span>, the descendants of one billion years of evolutionary history, are the most abundant creatures in the ocean.</p><ul><li>In hydrothermal vents, live creatures such as <span>Pompeii worms</span>, crabs, and tube worms.</li><li>In the <span>Gulf of California</span>, packs of <span>Humboldt squid</span> make night-time raids from the deep to co-operatively hunt <span>sardines</span>.</li><li>Beneath the permanent Antarctic <span>sea ice</span> of <span>McMurdo Sound</span>, <span>sea urchins</span>, red <span class=\"mw-redirect\">sea stars</span> and <span class=\"mw-redirect\">nemertean worms</span> are filmed scavenging on a <span>Weddell seal pup</span> carcass.</li><li>A <span>fried egg jellyfish</span> hunts amongst a swarm of <span class=\"mw-redirect\">Aurelia</span> in the open ocean, spearing its prey with harpoon-like tentacles.</li><li>In the shallows off South Australia, hundreds of thousands of <span>spider crabs</span> gather annually to moult.</li><li>Many invertebrates have simple nervous systems, but <span>giant cuttlefish</span> have large brains and complex mating habits. Large males use flashing stroboscopic colours and strength to win a mate, whereas smaller rivals rely on deceit: both tactics are successful.</li><li>A <span class=\"mw-redirect\">giant Pacific octopus</span> sacrifices her life to tend her single clutch of eggs for six months when she gets old. As a <span class=\"mw-redirect\">Pycnopodia</span> starfish feeds on her remains, it comes under attack from a <span>king crab</span>.</li><li><span>Coral reefs</span>, such as the <span>Great Barrier Reef</span>, which rival rainforests in their diversity, are the largest living structures on Earth and are created by coral <span>polyps</span> that compete for space. <span class=\"mw-redirect\">Christmas tree worms</span>, barnacles, <span>Porcelain crabs</span>, <span class=\"mw-redirect\">boxer crabs</span>, <span class=\"mw-redirect\">orangutan crabs</span>, sea cucumbers, nudibranchs, sea slugs, <span class=\"mw-redirect\">emperor shrimp</span>, and cleaner shrimp are shown to illustrate the many specialised ways of making a living on a reef. Marine invertebrates have a lasting legacy on land too – their shells formed the <span>chalk</span> and <span>limestone</span> deposits of <span>Eurasia</span> and the Americas. <i>Life on Location: Sink or Swim</i> documents the recording of Antarctic sea life and the birth of a reef.</li></ul></td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep9\" style=\"text-align:center\">9</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Plants\"</td><td style=\"text-align:center\">7 December 2009</td><td style=\"text-align:center\">4.30 million viewers (18.0% audience share)<i></i></td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #00FF00\"><div class=\"thumb tleft\"></div><p>Plants endure a daily struggle for water, nutrients and light.</p><ul><li>On the forest floor where light is scarce, <span class=\"mw-redirect\">time-lapse</span> shots show <span class=\"mw-redirect\">ivies</span>, <span>creepers</span>, and passion flower vines climbing into the canopy using sticky pads, hooks or coiled tendrils.</li><li><span>Epiphytes</span> grow directly on the topmost branches of trees. Their bare roots absorb water and trap falling leaves, which provide nutrients as they decompose.</li><li>Animals can also be a source of food: the <span>sundew</span> traps <span>mosquitoes</span> with sticky fluid, and <span>venus flytraps</span> close their clamshell leaves on unwitting insects.</li><li><span>Sandhill milkweed</span> defends itself against feeding <span>monarch</span> <span>caterpillars</span> by secreting sticky latex from its leaves. The milkweed endures the onslaught because, like most plants, it produces flowers, and the newly hatched butterflies <span>pollinate</span> them.</li><li>In <span>Dominica</span>, the <span>purple-throated carib</span> hummingbird has beaks long enough to reach the energy-rich nectar of the <i><span>Heliconia</span></i>.</li><li>After flowering, <span>brunsvigia</span> plants in South Africa are snapped off by strong winds, sending their seed heads cartwheeling across the ground.</li><li>In Borneo, <i><span>Alsomitra</span></i> is a plant that produces winged seeds.</li><li><span>Saguaro cacti</span> produce succulent fruit to attract desert animals which ingest and disperse their seeds.</li><li>Some plants have adapted to survive environmental extremes. <span>Dragon's blood trees</span> and desert roses thrive on arid <span>Socotra</span>, and coastal <span>mangrove</span> trees survive by filtering salt from seawater.</li><li><span>Bristlecone pines</span> live above 3,000 m in North America's mountains. They have a six-week growing season and can live for 5,000 years, making them the oldest living things on Earth.</li><li><span class=\"mw-redirect\">Grasses</span> are the most successful of all plants. Of their 10,000 varieties, two cover more land than any other plant: rice and wheat. <i>Life on Location: Time Warp</i> goes behind the scenes of a time-lapse sequence in an English woodland. Because actually growing plants outdoors would prove a challenge to film (with constantly changing conditions) this scene used plants grown in a studio on a <span>bluescreen</span> duplicating a real outdoor backdrop. The entire process took two years to make.</li></ul></td></tr><tr style=\"text-align:center;background:#F2F2F2\"><th scope=\"row\" rowspan=\"1\" id=\"ep10\" style=\"text-align:center\">10</th><td class=\"summary\" rowspan=\"1\" style=\"text-align:left\">\"Primates\"</td><td style=\"text-align:center\">14 December 2009</td><td style=\"text-align:center\">5.14 million viewers (21.9% audience share)<i></i></td></tr><tr class=\"expand-child\"><td class=\"description\" colspan=\"5\" style=\"border-bottom:solid 3px #00FF00\"><div class=\"thumb tright\"></div><p>Intelligence, curiosity and complex societies have enabled <span>primates</span> to exploit many different habitats.</p><ul><li>In <span>Ethiopia</span>, male <span>hamadryas baboons</span> restore discipline after a skirmish with a rival troop.</li><li>In <span>Japanese macaque</span> society, only those members from the correct bloodlines are permitted to use <span class=\"mw-redirect\">thermal springs</span> in winter; others are left out in the cold.</li><li>Examples of primate communication include a silverback <span>gorilla</span> advertising his territory though vocalisations and chest-beating, and the piercing calls of <span>spectral tarsiers</span> which help keep their group together.</li><li>In <span>Thailand</span>'s rainforests, <span>lar gibbons</span> use song to reinforce sexual and family bonds.</li><li>Baby <span>Phayre's leaf monkeys</span> are born bright orange, so the grey adults can keep an eye on them.</li><li>By contrast, <span>ring-tailed lemurs</span> in <span>Madagascar</span> broadcast sexual signals using scent glands.</li><li>A young <span>orangutan</span>'s upbringing equips it with all the skills it needs to survive in the forest, including finding food, moving through the canopy and building a shelter.</li><li>On South Africa's <span>Cape Peninsula</span>, <span>chacma baboons</span> forage kelp beds exposed by the lowest tides for nutritious <span class=\"mw-redirect\">shark eggs</span> and <span>mussels</span>.</li><li><span class=\"mw-redirect\">White-faced capuchins</span> collect <span>clams</span> in <span>Costa Rica</span>'s coastal <span>mangroves</span>, but lack the powerful jaws to pierce the shells. Their solution is to beat the shellfish against trees or rocks, which eventually exhausts the muscle that holds the shell closed. <i>Life on Location: 99 Percent</i> follows camerawoman Justine Evans to <span>Guinea</span> to film <span class=\"mw-redirect\">tool use</span> in <span>chimpanzees</span>. Dextrous hand movements enable them to dip for <span>ants</span> and <span>termites</span> using plant stems. They have also learned to crack nuts using precise and efficient blows with a stone. One male chimp is filmed sharing his stone with a female.</li></ul></td></tr></tbody></table><br/><h3>Inside Life</h3><p>A complementary children's TV series, Inside Life, aired on the CBBC Channel and followed young volunteers as they go behind the scenes with the Life production team and accompany the film-makers on expeditions in the field. It began airing on 13 October 2009.</p><br/><h3>One Life</h3><p>In 2011, BBC Earth used Attenborough's footage of animals to create a documentary film called One Life, narrated by Daniel Craig.</p><br/><h3>Reception</h3><p>The series was nominated for six Primetime Emmy Awards in July 2010. These included a nomination for Outstanding Nonfiction Series along with selections in a number of technical categories. The episode \"Challenges of Life\" went on to win the Outstanding Cinematography for Nonfiction Programming award.</p><p>In June 2010, Life won two Rockies at the Banff World Television Festival for best wildlife and natural history programme and best documentary.</p><p>In October 2010, Life was awarded the Jury's Special Prize at the Wildscreen Festival.</p><br/><h3>DVD, Blu-ray Disc and book</h3><p>The series was released in the UK as Region 2, four-disc DVD (BBCDVD3068) and Blu-ray Disc (BBCBD0055) box sets by 2Entertain on 30 November 2009. Region 1 DVD and Blu-ray Discs of both the BBC and Discovery versions of the series were released on 1 June 2010. In Australia, a Region 4, four-disc DVD and Blu-ray Disc was released by ABC DVD/Village Roadshow on 7 October 2010.</p><p>A hardcover book written by producers Martha Holmes and Michael Gunton accompanies the television series. Life was published in the UK by BBC Books (ISBN 9781846076428) on 1 October 2009.</p><br/>"
  },
  "errorMessage": ""
}