{
  "imDbId": "tt0112159",
  "title": "Neon Genesis Evangelion",
  "fullTitle": "Neon Genesis Evangelion (TV Series 1995–1996)",
  "type": "TVSeries",
  "year": "1995",
  "items": [
    {
      "username": "Arnold-10",
      "userUrl": "https://www.imdb.com/user/ur0039178",
      "reviewLink": "https://www.imdb.com/review/rw0354137",
      "warningSpoilers": false,
      "date": "16 March 2000",
      "rate": "",
      "helpful": "287 out of 333 found this helpful.",
      "title": "The most controversial, talked about, and yes, impressive anime series ever...",
      "content": "Well, what can I say about a series that's as absolutely mind-blowing as the 26 episodes and two movies that make up Neon Genesis Evangelion? This is, quite simply, a masterpiece. What starts out as a simple \"save the world\" mecha story evolves into a shocking and powerful psychological drama full of conspiracy, dysfunctional characters, and some of the most harrowingly emotional and painful fight scenes ever. Don't let the first several episodes fool you- they're entertaining enough, but the power of the series remains hidden.When I popped in the first video, I was excited to see a new anime, but otherwise pretty relaxed. By the end of episode 18 or so, my heart was racing, and I was nearly in tears. It never let up after that. This is not just an anime. This is an experience."
    },
    {
      "username": "ttornak",
      "userUrl": "https://www.imdb.com/user/ur6107994",
      "reviewLink": "https://www.imdb.com/review/rw1139060",
      "warningSpoilers": true,
      "date": "31 July 2005",
      "rate": "",
      "helpful": "332 out of 381 found this helpful.",
      "title": "More than a feeling",
      "content": "I'm not an anime fan. I tried this because of the reviews it gathered and after watching this I checked out other anime-titles. I couldn't have been more disappointed. No other anime even tried to approach the quality of this series.The series start off simple enough. A boy is 'chosen' to fight big monsters in a robot. However, the monsters seem to be less important than the troubles the people face fighting them.Although Shinji is no coward by any standard, he's a very troubled person. He hates himself and his father. He needs people around him but they are a constant source of pain. He's a loner, but he doesn't like it much.Not a single major character is one-dimensional. Rei is a bit of an enigma, but you could imagine how this very intelligent girl would develop into someone resembling Ritsuko. Asuka is the brass, loud and overconfident girl who's smarter than she appears. Misato seems to be an emotional shut-in but she tries to enjoy life to the fullest. Ritsuko seems perfect at first, an intelligent career woman who's reliable and self-sufficient. And definitely last is Gendo, the commander : cold and focused, dealing with the threat as well as the constant verbal attacks of the Seele-members. Any major character could be analyzed as they grow throughout the series.The first 15 episodes could be considered semi-light fare. Enjoyable and although there are several hints dropped along the way, nothing really gets out of hand too far. The series grow however, and after the 15th episode, the masks are taken off one by one, and it's not a pretty sight.By the end of it all, the series have asked immortal questions like what are we, why are we here and is life worth all the pain that goes with it. For once these questions don't sound trite as the characters have a very good reason for asking.Disturbing through the fate and behaviour of it's protagonists, stripping away all illusions about what men are and the horrors we are capable of, the series still manage to retain sympathy for it's characters and a spark of hope for mankind.The series are not perfect. There's some fan-service,corny moments and situations that don't seem logical, especially in the first part of the series. But the many layers and genuine characters more than make up for it. In this case, the endresult outweigh the sum of it's part tremendously.There are 101 reasons why the series have become how they are now. Production problems (time and money), Hidalgo's personal situation, the fans, the critics and so on. You can find socio-economic, theological and psychological analysis of this work. All very well written, interesting and equally valid. Whatever interests you, this series can make you think and hopefully feel.I've only given 3 movies a 10. This is one of them. The rating is for the series+the movie. Powerful and unique."
    },
    {
      "username": "enricoshapka",
      "userUrl": "https://www.imdb.com/user/ur103624867",
      "reviewLink": "https://www.imdb.com/review/rw6560195",
      "warningSpoilers": false,
      "date": "3 February 2021",
      "rate": "10",
      "helpful": "38 out of 47 found this helpful.",
      "title": "What do you wish?",
      "content": "Now I understand why people say this is the anime of animes. First don't watch this anime if you're not mature or 18+. There's also some epileptic and tripping parts that should be warned before watching. This is one of the darkest, most depressing and disturbing anime I've seen. After half episodes it becomes the real thing (hate,nudity,tools,betrayals for each character). The characters are likeable, the drawings are good and music is amazing, you can really see it's a 90's anime. But holy the Story is fkd up and disturbing. The last 2 episodes can be skipped if you don't want to see the perspective of Shinji. I agree that this is overrated but it's a great anime, that I don't recommend to children but adults."
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw5522067",
      "warningSpoilers": false,
      "date": "2 March 2020",
      "rate": "9",
      "helpful": "30 out of 40 found this helpful.",
      "title": "Neon Genesis Evangelion",
      "content": "This anime series is set fifteen years after a global disaster known as the Second Impact. It is centred on fourteen year old Shinji Ikari; he is summoned to the city of Tokyo-3 where he learns he has been chosen to pilot 'Evangelion Unit One'; to all intents and purposes a giant robot with biological components which can only be synchronised with pilots of a certain age. In Unit One Shinji will have to battle strange beings that have been dubbed 'Angels' whose arrival was foretold in the Dead Sea Scrolls. Shinji's job isn't helped by the fact that the Eva Project is run by his estranged father who seems more interested in Rei Ayanami, the slightly mysterious pilot of Eva Unit Zero. As the attacks continue a third pilot, Asuka Langley Soryu. Shinji always had issues but this work takes an emotional and psychological toll on him.One might expect this to be an exciting 'fighting robot' series but it quickly descends into existential angst and depression... a very interesting twist that I'm sure viewers who watched this series when it was new would have been shocked by. The central story is full of religious symbolism but it isn't overtly religious in a way that might offend or irritate viewers. The characters aren't that likeable; many, especially Shinji, come across as whiny and others, notably his father, as unpleasant and bullying. Things gets distinctly strange towards the end with two final episodes that are likely to leave some viewers exasperated; others will find this only adds to the sense that this series is something different. Normally I watch anime in Japanese with subtitles but as the dub was available on Netflix I watched that and thought the English voice cast did a solid job. Overall I'd certainly recommend this to anime fans; it may show its age at times but it is still solid and had effects on many later series."
    },
    {
      "username": "soulcharmer",
      "userUrl": "https://www.imdb.com/user/ur2457015",
      "reviewLink": "https://www.imdb.com/review/rw1007848",
      "warningSpoilers": false,
      "date": "27 January 2005",
      "rate": "",
      "helpful": "89 out of 125 found this helpful.",
      "title": "Anime at its best.",
      "content": "Evangelion blows your mind. First few episodes may seem like regular giant-robot-post-apocalyptic nonsense for kiddies but soon it begins to unmask itself. The background story is very complicated and not every detail of it is ever revealed. Characters are developed more than in many regular movies out there. Simply lovable.The show can feel ultimately silly, weird, technologically naive, even insane. But it has a purpose - you shall experience every mood and emotion thinkable over the episodes. Pure originality seeps out of the series all the time. But it's all just the beginning. The real weirdness, packed with substance nonetheless, comes in the last three episodes. No matter how you will anticipate the story would end, it won't be anywhere near the real conclusion. I can't describe it without spoiling it. Evangelion just blows your mind.9/10"
    },
    {
      "username": "JTurner82",
      "userUrl": "https://www.imdb.com/user/ur4989916",
      "reviewLink": "https://www.imdb.com/review/rw1783412",
      "warningSpoilers": true,
      "date": "19 December 2007",
      "rate": "7",
      "helpful": "46 out of 68 found this helpful.",
      "title": "Brilliant and impressive if sometimes too confusing landmark series.",
      "content": "Gainax's staggeringly ambitious, 26-episode series NEON GENESIS EVANGELION is declared as one of the most compelling Anime productions of all time. It also happens to be one of most controversial. On one side of the coin are a bunch of loyal, unbending followers that idolize the show. On the other are a group of naysayers who say otherwise. As far as my views of EVANGELION are concerned, I fall somewhere in the middle. In many ways, the show is indeed brilliant and thought provoking--something rarely seen in any animated production, American or Japanese. At the same time, however, there are elements of EVANGELION that rub me the wrong way.The show, set in post-apocalyptic Tokyo-3, involves alien-like monsters known as \"Angels\" that continually threaten the metropolis. Only psychologically messed up teenagers -- who include introverted Shinji Ikari, enigmatic Rei Ayanami, and mean-spirited Asuka Langley Sohryu -- stand a chance against them. They do this by piloting their Evangelions -- giant, superpowerful, robot-like fighters. In charge of the whole thing is Misato Katsuragi, a tough, no-nonsense woman who cares for the children while dealing with her own issues. Also calling the shots is Shinji's cold, unsympathetic father, Gendo Ikari, Shinji's cold, unlovable father, who seems to have an agenda of his own, although we're not entirely clear about what it is. And then there is the matter over whether the real threat in Tokyo-3 is in the presence of the Angels or an even more ominous organization, known as SEELE, which is occasionally seen as a group of tabloids with numbers.As mentioned, there are many aspects of EVANGELION that are good and bad. The technical aspects of this show are impressive -- particularly the dramatic and emotionally charged battles between the EVAs and the grotesquely designed angels; a sense of mystery and intrigue exudes from its complex storyline. As a matter of fact, the show is at its best when it focuses on the conflict between the Angels and the human race. Furthermore, even though a majority of the characters are basically unlikable (save perhaps, for Misato), director Anno does dedicate some episodes delving into their tormented pasts. This is often done in surreal, bizarre, \"dream\" like sequences involving kaleidoscopic imagery and inner thoughts. Also interesting (and sometimes disorienting) is the use of classical music for several episodes toward the end, notably Handel's \"Messiah\" and Beethoven's \"Choral\" Symphony.It has been widely touted that the characters of EVANGELION are some of the most complex, socially washed out beings ever committed to Anime. On one level, it provides for some intriguing interactions, from Shinji's estranged relationships with both his father and the bitchy Asuka to Misato's own fractured love affair with her off again on again beau, Kaji. The character development becomes gradually less intriguing, however, as each episode exorcises the same angst-ridden issues over and over again, with little to no resolution. In the surprisingly grim and violent latter half of the series, the characters all head into a downward spiral. At the same time, EVANGELION starts to become less intriguing (if sometimes confusing) and turns messy, almost to the point of being totally incomprehensible. Questions that viewers are likely to have about the plot are never answered, and some later episodes have scenes in which absolutely nothing happens that last too long.Another problem with EVANGELION is its ending or rather, lack thereof. While Gainax's previous TV show, NADIA, took a wrong turn at the midpoint, it did get recover for its last episodes and delivered a strong, if too short conclusion. Here, however, the story simply falls apart. The final two episodes, which are very much played out like extensive therapy sessions, eschew both action and coherency in favor of deconstructing the protagonists' minds. In doing so, it makes the mistake of underwhelming the audience. There are some interesting artistic styles, like Shinji being drawn as a sketch in deep space, but even this potentially experimental approach is compromised by the lack of a structure for a compelling conclusion.In spite of its faults, NEON GENESIS EVANGELION is still worth watching for many reasons. Its impressively directed action sequences, intriguing mysteries, and in-depth character studies have been seldom matched in others of its kind.The English dub, provided by Industrial Smoke & Mirrors in the mid '90s, like the show, tends to receive polarized reaction. The dub follows the script fairly well, and the acting is mostly emotionally sound (if at times too melodramatic). On the flipside, it is somewhat disappointing that the young protagonists don't sound like children--especially after ADV's dub for NADIA impressed me with their use of actual child actors. Fortunately, the whole dub is carried by Alison Keith's terrific turn as Misato--she brings a lot of sassiness and instant likability to the character. Her performance *sells* the dub as a whole even when the script becomes confusing in places.NEON GENESIS EVANGELION will certainly not win over converts beyond a certain age -- as mentioned, its complicated and sometimes too angst-ridden plot is more likely to appeal to adolescents. As an ambitious and daring exercise in bringing Anime to wider audiences, however, its remarkable in how it achieved that goal."
    },
    {
      "username": "kevinxirau",
      "userUrl": "https://www.imdb.com/user/ur27881178",
      "reviewLink": "https://www.imdb.com/review/rw5034682",
      "warningSpoilers": false,
      "date": "2 August 2019",
      "rate": "7",
      "helpful": "19 out of 26 found this helpful.",
      "title": "An anime landmark, but not without flaws.",
      "content": "\"Neon Genesis Evangelion\", Hideaki Anno's magnum opus and a reflection of his depression at the time. Long have I heard of this legendary anime, but never felt the drive in giving it a try until recently. Is it worth it? Well, yes but in some ways no.Plot: Years after the apocalyptic event known as the 2nd Impact, the story concerns Shinji Ikari, a lonely boy who is suddenly summoned by his neglectful father Gendo, the head of the group called NERV. The reason: to pilot a mech called an Evangelion (Eva for short) to combat unusual creatures called Angels alongside brash Asuka and stoic Rei. Despite considerable reservations and low self-esteem, he agrees, going on a journey involving giant-sized battles, unnerving revelations, and a dive into others' inner demons.On the surface, this seems like a standard action series, but it's really a character study filled with religious parallels, psychological analyses, and sexual elements. Most of the major characters suffer from some shortcoming and have different ways of coping. My favorite is Misato, a woman who is both head of operations against Angels and Shinji's caretaker/mother figure; she shares common ground with him, is a risk taker, and has relatable flaws. Shinji, though, is a divisive figure as your enjoyment of the show depends on how much you invest in or even tolerate him. Having \"hedgehog's dilemma\" among others, he hesitates on things from fighting to getting close to anyone. While at times understandable, it does try one's patience (he's more tolerable after the first few episodes). There are scenes that offer levity with light-hearted moments, which I appreciate. While sometimes short, the battles alone are worth a watch with cool strategies, gruesome bloody violence, and a pantheon of monstrous Angels whose designs are as alien as their origins and motives. Outside the fights, though, the animation tends to be minimalistic. In fact, many scenes involve still shots that go on for too long, which bugged me. There's also no real explanation of why the Evas have to be piloted by 14-year olds and some side characters are written out in a way that doesn't feel conclusive.\"Evangelion\" has two endings. First, the show's last 2 episodes are an abstract mind trip where the staff literally ran out of money and scraped together. The second is the movie \"End of Evangelion\", which is more grand and decisive, but also VERY trippy. Analyses from other people helped me understand the film, but it's not satisfying entertainment-wise. I'm curious about the remake \"Rebuild of Evangelion\", but that's for another time. While not for everyone, the anime certainly earned its reputation."
    },
    {
      "username": "Ricardo-36",
      "userUrl": "https://www.imdb.com/user/ur0281280",
      "reviewLink": "https://www.imdb.com/review/rw0354148",
      "warningSpoilers": false,
      "date": "29 December 2000",
      "rate": "",
      "helpful": "116 out of 183 found this helpful.",
      "title": "This is not an anime, it's THE anime.",
      "content": "What can I say about the most perfect anime ever created? What can I say about Shinji, the most complex character ever created?Evangelion begins like an action sci-fi anime, like Akira. It has everything: humor, drama, action, great soundtrack. Great fun! But then you watch episode 24... and WOW!The 3 last episodes are the most perfect writen anime episodes ever. Yeah, some people don't understand it. Some people don't like it. But that's because those 3 episodes are about 1000 years ahead of our time. For the very first time you get inside a character's mind, you understand his problems and his fears. Yeah it's disturbing some times, but isn't real life disturbing?It doesn't matter if you like animes or not, WATCH THIS! But watch from the beginning, or else you will not recieve the final message from episode 26. I'm sure that you will love Evangelion!"
    },
    {
      "username": "Achyut_Prashast_Singh",
      "userUrl": "https://www.imdb.com/user/ur46915265",
      "reviewLink": "https://www.imdb.com/review/rw6038257",
      "warningSpoilers": false,
      "date": "29 August 2020",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "Mecha action + Human emotion. Result? An original, entertaining, thought provoking anime.",
      "content": "Wow. I just finished binge watching the series and I don't know what to feel right now. This quintessential anime series has left me with an experience of a lifetime. It is a perfect blend of mecha action and human emotion. The animation is definitely top notch, but it's the storytelling that's the real hero of this series.I could feel the tension from the first episode itself. The way the makers dealt with the three kids is plausible. I personally related a lot to Shinji Ikari and felt he was a lot like me. There were times where I cared a lot for both Rei and Asuka, given what all they had to go through. That being said, almost half of the series is somewhere between serious and lighthearted in terms of tone. It's the other half that starts to get intense with every episode and just hits the thinking viewer in the feels. I could feel like the last few episodes were directly talking to me. Yes, the same few episodes which are considered controversial for some reason.But aside from that, the show is highly entertaining, hands down. The humor is hilarious wherever it's present, and the mecha action is really cool or maybe even the finest I've seen yet. Some episodes are bound to leave you depressed, so better be prepared. Neon Genesis Evangelion is an unprecedented victory of sheer imagination and storytelling. For me, it's a perfect one as it both entertained and made me think. I can't thank the makers of this psychological sci-fi action anime enough, as a lot of dialogue has provided solutions to problems I have personally encountered and still encounter in life."
    },
    {
      "username": "MARVELMANIAC69",
      "userUrl": "https://www.imdb.com/user/ur2390406",
      "reviewLink": "https://www.imdb.com/review/rw1003785",
      "warningSpoilers": false,
      "date": "21 January 2005",
      "rate": "",
      "helpful": "68 out of 100 found this helpful.",
      "title": "Beautiful",
      "content": "My Mother bought me the boxset off this that ADV released as a Christmas present last year and I must say I felt like bowing to me saying giving her a thousand thank you's.This is the best show ever created, the characters are so lovable and their backgrounds are so depressing, this is how all anime's should be made that try to make statements that psychologicly screw you up and keep you glued to the screen, breath taken.This show starts off on quite a light level and by the end you'll be broken down in tears, and really makes you think about life.This is a classic in anime.10 out of 10"
    },
    {
      "username": "tuomas_gimli",
      "userUrl": "https://www.imdb.com/user/ur16826873",
      "reviewLink": "https://www.imdb.com/review/rw2689412",
      "warningSpoilers": false,
      "date": "16 October 2012",
      "rate": "4",
      "helpful": "104 out of 168 found this helpful.",
      "title": "A mixed bag if there ever was one",
      "content": "Neon Genesis Evangelion is hailed as one of the greatest animes ever. As a mix of monster vs. Mecha action, character-driven psychological drama and conspiracy thriller, there's certainly plenty to delve into. Too bad the different elements never truly match with each other, and the result is possibly the grandmother of all \"mixed bags\".There are very many aspects of Evangelion to like, or at least to admire. The ambition of the series is unquestionable, telling a story which starts out as fairly simple mecha action, but then turning into something far more sinister and grand. The designs of the Angels and Evas are still very imaginative and original and each battle provides a different scenario. The Angels are among one of the most genuinely alien-feeling creatures I've seen in fiction overall. The boldness it takes to put the characters into such dark places as they are in the end is very admirable, as the second season provides disturbing imagery all the way through. The characters are fairly deep with complex relationships, and the scenario of humanity trying to survive, but possibly heading double-time towards extinction is interesting. And the effort it must have taken to put together a story with so many different elements deserves a clapping.But where to begin with the problems, which sadly far outweigh the good elements? -The tone is very inconsistent, starting out with a mysterious feel with some heavy drama and then settling into a comfortable, fairly light-hearted monster-action period. During the second season the series plunges all the way into thorough unpleasantness before finally crapping out altogether and being left wallowing in psychedelic imagery and dialogue.-With such a grand story to tell, Evangelion should be a series with absolutely zero filler, yet there are at least three to five episodes out of 26 which have no relevance at all in terms of the main story-Nearly all the characters are almost completely unlikable. Despite this probably being one of the main points, as the series turns into full- fledged tragedy during the last 10 or so episodes, they seem neither to feel genuine sympathy for each other nor really care much about anything other than themselves. Character traits which are introduced as quirks or comedic elements (like Misato's drinking) later become sources of self-loathing and disgust. One particular central character and their own subplot is squandered so badly in terms of dramatic potential it's almost insulting.-The animation quality sees a steep drop after episode 19. This was later somewhat redeemed in the director's cut versions, but the lack of budget towards the end is still painfully obvious. Many scenes feature little more than static images with voiceovers, and at times feel more like a power point presentation instead of animation.There are dozens of oddities and illogicalities that constantly have the viewer thinking \"How did they do that?\". For example, we never see how the various parts of NERV HQ are placed in relation to each other. For all we know, all the various rooms and halls could exist entirely in small pocket dimensions of their own.-Despite their heavy presence, the biblical imagery and names are pure surface, and nowadays feel pretentious rather than original. You could replace all the names with Godzilla, Mothra, King Kong and such and it'd still be the same story.-A large amount of screen time is taken up by meaningless techno-babble, which serves next to no purpose. There are also some weird dialogues and monologues that pop out of nowhere and seem to have been written by someone tripping on acid. The infamous last 2 episodes are so full of esoteric philosophical mush that it feels like a completely different series. Whether this was the creator's intention or not I won't theorize on, it simply doesn't work.-The very heavy presence of angst both teen and mature can be quite grating, even for a series about psychological problems and mental breakdown. Even the adult characters fall into the pit of constant self-loathing towards the end.-Despite it being constantly referred to and being one of the central plot elements of the entire series, the Human Instrumentality Project never seems to be what's driving the story. Also the vast amount of lore involving the Second Impact, SEELE and NERV is almost all dumped into a single episode, instead of being slowly unearthed. It could have been used to create mystery, but as it stands it creates merely confusion and dissatisfaction.To list more would be just nit-picking, but there are plenty more. The end result is a series that is at times excellent, but most of the time just irritating or dull to watch.Recommendation: Evangelion is possibly one of the most divisive works of fiction ever created. Anyone who hasn't seen this series but has an interest in it should watch it just to form an opinion of their own."
    },
    {
      "username": "washuu",
      "userUrl": "https://www.imdb.com/user/ur0182749",
      "reviewLink": "https://www.imdb.com/review/rw0354146",
      "warningSpoilers": false,
      "date": "13 December 1998",
      "rate": "",
      "helpful": "66 out of 93 found this helpful.",
      "title": "This is real MUST SEE TV!",
      "content": "This is quite possibly the best fantasy ever devised on the face of the planet. It has large unique mecca, nifty technology, emotional byplay, philosophical questions, great characters, unique music, great artwork... you name it it's got it. If you love anime watch it! If you hate anime watch it! Be warned though it looks deceptively simple at first. To get its full effect you must be willing to watch the entire series."
    },
    {
      "username": "Adele666",
      "userUrl": "https://www.imdb.com/user/ur104081577",
      "reviewLink": "https://www.imdb.com/review/rw5511235",
      "warningSpoilers": false,
      "date": "26 February 2020",
      "rate": "10",
      "helpful": "13 out of 19 found this helpful.",
      "title": "A Masterpiece in Art and Animation.",
      "content": "This artistic masterpiece is far superior to any anime or any animation that was made in the 1990s. It can easily hold up today.This anime is about a boy who is 'forced' to pilot a mecha after an Angel attack. With Nerv's mecha or as they are called Evangelion, they fight these strange monsters.This series is more than just your typical mecha anime. It is about loneliness and the meaning of life and lies. The animation is visually appealing. This is a must watch for anyone, anime fan or not,."
    },
    {
      "username": "ebossert",
      "userUrl": "https://www.imdb.com/user/ur10058980",
      "reviewLink": "https://www.imdb.com/review/rw1947397",
      "warningSpoilers": false,
      "date": "17 September 2008",
      "rate": "1",
      "helpful": "131 out of 276 found this helpful.",
      "title": "No Words Can Adequately Express My Hatred For This Series",
      "content": "This incredibly overrated anime television series (26 episodes, 25 minutes each) is about a 14-year-old boy (and two of his girl classmates) who pilots a giant robot to defend Japan against invading beings called Angels. There is very little explanation given to the Angels or why their numbers have increased in recent times, and they just seem to pop out of nowhere for no apparent reason (why not attack all at once instead of at spaced out intervals that are convenient for the humans you're attempting to destroy?). The robot fight scenes attempt to employ a variety of obstacles, but the action itself is poorly executed and boring to watch. Almost every episode seems like a waste of space where nothing of interest occurs.Some might be intrigued by fans who mention the (very few) symbolic references herein, but that's all they are - shallow one-liners to religious or philosophical concepts that are randomly tossed in with zero craftsmanship. As a whole the series is incredibly tedious due to the superficiality of the characters, who are really nothing more than self-pitying crybabies. The psychology is pathetic, with hopelessly simplistic conflicts like \"I hate my father\" repeated over and over and over and over again with no progression beyond their face value. It's no understatement to say that these characters plunge this series from time-wasting mediocrity to anger-inducing garbage during the final episodes with their endless, angst-ridden diatribes of excessively repetitive psychobabble (some of which is totally meaningless).I'm not kidding when I say that this series just got worse and worse as it progressed. Every day I'd look at the DVD set sitting on my living room table and say to myself, \"Damn, I've gotta watch the next episode at some point. (sigh) I may as well slug through another one tonight.\" The real kicker was that the episodes were only 25 minutes long, yet they were somehow able to digress into a completely uninteresting borefest within the opening 10 minutes. This is coming from a guy who will happily sit through 150-minute films with glacial pacing, so my criticism of this series is most damning indeed.Never in my entire life have I despised watching a series as much as \"Evangelion.\" I had already purchased it based off of all the fanatical comments on IMDb, and I certainly wasn't going to let it collect dust after spending my hard-earned money. What followed was 10 hours of pure, unmitigated torture. My love/hate relationship with anime is turning into a hate/love relationship after this highly acclaimed disaster.\"Evangelion\" represents everything anime should NOT be - massive quantities of dull, pretentious tripe under the guise of intelligent cinema. The universal acclaim for this piece of crap is simply unbelievable; and the ridiculous assertions by fans that this series as \"one of mankind's greatest achievements\" is probably the most stupifying comment I've ever heard on IMDb - and I've seen some doozies."
    },
    {
      "username": "Snootz",
      "userUrl": "https://www.imdb.com/user/ur49392222",
      "reviewLink": "https://www.imdb.com/review/rw5490060",
      "warningSpoilers": false,
      "date": "17 February 2020",
      "rate": "5",
      "helpful": "36 out of 70 found this helpful.",
      "title": "Disappointingly mediocre",
      "content": "I have heard for ages that Evangelion is the best there is. So I was quite surprised to find it sub-standard in just about all aspects. Admittedly it's 2020 and this was made more than 20 years ago. Still, this is basically giant robots against impossibly powerful giant (and very wierd) monsters. By episode 10 I was starting to yawn. Episode 12 was definitely the breaking point.Honestly, there are far better anime, far better plots, better story lines, better character development. Currently this has a rating of 8.5 on IMDB; I am puzzled to understand why. The only thing I can figure is that it appeals to a specific area of anime fandom. I have the same opinions regarding Transformers; no matter how popular it is, I find both the TV series and especially the movies just over the top absurd.The 12 episodes I slogged through on this basically boiled down to repetitive elements: stick teenagers in skin-tight costumes and put them in a giant robot (or naked, inside a giant robot, which seems like a silly contrivance since nothing but bare shoulders are shown). Launch the giant robots. Barely destroy the giant monsters, garnering extreme damage to surrounding countryside and the robots themselves. Retrieve robots, fix robots, lather, rinse, repeat. Over and over.The characters are 2-dimensional, from the emotionless girl to the clueless boy to the extremely obnoxious girl to the domineering father to the... well, it's a whole pot full of stock characters. There are many anime I have enjoyed immensely; this is not one of them. Trite, boring, redundant. By the time I finished episode 12 I really didn't care what happened next."
    },
    {
      "username": "baumhenrik",
      "userUrl": "https://www.imdb.com/user/ur80388571",
      "reviewLink": "https://www.imdb.com/review/rw6173233",
      "warningSpoilers": false,
      "date": "13 October 2020",
      "rate": "7",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Checked off the list",
      "content": "I had Neon Genesis Evangelion on my anime Watchlist ever since I first heard of it. I'm not usually a fan of giant battle robots but this one was always brought to me as something different. So I finally watched it after years. First off some things I liked the most about the show. The art style. I love the 90s characteristic anime style and NGE had some of the best artwork I've ever seen. I also liked the concept of angels and how diverse they appeared with different strengths and weaknesses. Also the philosophical approach was a hook for me. But still I feel a bit underwhelmed by the show. I wasn't quite as blown away as every other one it seems. I felt that the actual twist points all happened within 3-4 episodes. Not saying that everything else was not worth watching. Lots of words. Might come back and edit some once I thought about it more."
    },
    {
      "username": "Lady_Targaryen",
      "userUrl": "https://www.imdb.com/user/ur6643268",
      "reviewLink": "https://www.imdb.com/review/rw1369098",
      "warningSpoilers": true,
      "date": "16 May 2006",
      "rate": "10",
      "helpful": "20 out of 36 found this helpful.",
      "title": "The most famous anime of all times",
      "content": "\"Shin seiki evangelion\" is the most famous anime of all times. Almost 10 years before this anime was released(until today) is considered to be the most perfect and outstanding anime series of all. The soundtrack is amazing(with the famous ending theme song being \"Fly Me to the Moon\" as well as the classic Beethoven),the names of the characters and many of the things has a reason or a deep meaning behind it, like the three MAGI Supercomputers, Melchior, Balthasar and Casper (Gaspar),that are the names of the three wise men (also known as \"magi\") who, according to Christian legend, followed the guiding star to Bethlehem in order to give praise and gifts to the newborn Christ,the plot is very well written and full of meanings that can be open to discussion. I am not an Evangelion nerd, but I can understand why it was a winner of the'' Best TV Animation Award\". I am just waiting to be released in DVD here in Brazil to buy them."
    },
    {
      "username": "cannabinosa",
      "userUrl": "https://www.imdb.com/user/ur117406976",
      "reviewLink": "https://www.imdb.com/review/rw6255005",
      "warningSpoilers": false,
      "date": "10 November 2020",
      "rate": "10",
      "helpful": "3 out of 3 found this helpful.",
      "title": "There it goes...",
      "content": "Low budget with a lot of static scenes, jumped straight to the ending because of lack of money and time, and never explained an important part of the plot like why do the angels attack. But there it goes, the best anime ever created."
    },
    {
      "username": "xstrongmenalsocryx",
      "userUrl": "https://www.imdb.com/user/ur2944164",
      "reviewLink": "https://www.imdb.com/review/rw0354195",
      "warningSpoilers": false,
      "date": "3 July 2004",
      "rate": "",
      "helpful": "144 out of 188 found this helpful.",
      "title": "Greatest Achievement in Audio/Visual Entertainment",
      "content": "Whether you enjoy the world of anime or not this is an experience you must have before you die. Nothing else in the world is like it. For the sake of your personal experience I cannot tell you much about it and here's why. The first 20 some episodes you are immersed in the semi-futuristic world of Tokyo 3 and the characters are developed beautifully, some of the best character development I've ever witnessed. You get a very very good feel for the world and the situation they live in, only to have that blown away in the final episodes. Please for the sake of yourself watch this, from the start, you will not regret it.Hideaki Anno has conceived of a story more important to my life than any other.Hideaki Anno is pure genius."
    },
    {
      "username": "TheMediaGuru24",
      "userUrl": "https://www.imdb.com/user/ur61741336",
      "reviewLink": "https://www.imdb.com/review/rw5850868",
      "warningSpoilers": false,
      "date": "24 June 2020",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "An Absolute Classic",
      "content": "This anime is the second best anime I have watched, yes it gets very complex towards the end and personally I don't think the ending is amazing (unlike End of Evangelion).The 26 episodes are great although at the start the show just seems like a standard mech vs creature show it gradually becomes a complex and much more interesting show. Episode 25 and 26 aren't necessarily bad I just don't find them as interesting as the other episodes, it is very vague, yes it works better after you watch End of Evangelion but you shouldn't have to rely on a movie which was released later to like the final episodes of a show.The characters are where this show is at it's best. All complex and sympathetic apart from a few which you will hate in a good way. Asuka is my favorite character in the show. After watching Asuka's episode of her backstory I couldn't help but love this character, once again her character arc ends abruptly but with End of Evangelion it fixes that. Shinji is also an amazing and deeply flawed protagonist, he is very passive and never finds out massive plot points like some other protagonist might. It is very interesting and something we have rarely seen since. Rei is great as well but she needed more time with Shinji to make her arc more satisfying because she does disappear into the background for a few episodes.The Soundtrack is amazing, it has classics and my favorite opening theme with Cruel Angels Thesis, almost every anime fan will have either heard or seen the opening.This anime definitely won't appeal to everyone and can be hard to recommend in my opinion but definitely give it a try, who knows maybe you will get glued to the screen and binge it like I did."
    },
    {
      "username": "filmfan1991",
      "userUrl": "https://www.imdb.com/user/ur35193004",
      "reviewLink": "https://www.imdb.com/review/rw2647259",
      "warningSpoilers": false,
      "date": "22 July 2012",
      "rate": "10",
      "helpful": "10 out of 15 found this helpful.",
      "title": "Classic, Controversial, Epic and flawed due to the final two episodes",
      "content": "Neon Genesis Evangelion. One of the most controversial and influential sci-fi anime of all time. Even more than 15 years after its release in Japan and at least a decade since it was released and dubbed in English in America, it still manages to resonate and astound anime audiences with its story, characters and the impact that its had on multiple genres outside of anime.Now this is a difficult anime series to review because of how complicated the story gets as it goes on. I'll make the basic synopsis as simple as I can without spoiling: The year is 2015 and the world is invaded by celestial beings known as \"Angels\", 15 years prior to the beginning of the series, an event caused by the Angels known as \"Second Impact\" devastated the world and reduced the human population by half. In order to combat the Angels, the Japanese government created NERV to combat the Angels. NERV fights the Angels with the Evangelion Units AKA EVA Units who are piloted by select few teenagers.The basic synopsis sounds like any other mech anime and it is for at least the first 14 episodes but after that, it gets more complicated and the plot takes many twists and turns deconstructing the tropes and conventions for the mech anime genre becoming something new and refreshing which is what this series is well known for. The characters are very well written and three dimensional making them all the more relatable.This series is written and directed by Hideaki Anno who suffered depression when he made this series and it shows in the psychology of his characters. His direction is epic for an animated TV show and has some great shots that make for good cinematography even though its animated. Also it has one of the best anime opening theme songs ever done.Unfortunately, there was a outcry in Japan for this series being too violent for television which resulted in budget cuts which in turn resulted in the infamous final two episodes that don't end the series properly.In my opinion, watch the first 24 episodes, then watch End of Evangelion which is the proper ending to the series which is why I only give this series a 9 out of 10 stars."
    },
    {
      "username": "ACollegeStudent",
      "userUrl": "https://www.imdb.com/user/ur118665987",
      "reviewLink": "https://www.imdb.com/review/rw6664010",
      "warningSpoilers": true,
      "date": "5 March 2021",
      "rate": "7",
      "helpful": "7 out of 10 found this helpful.",
      "title": "Could've been a masterpiece if they actually explained the Lore. Bring the dislikes NGE fans",
      "content": "Rating 7.8Favorite Episode: Asuka StrikesA psychological \"mecha\" show. It's not really about the mechs/plot, but more about the messages around human interaction. I can see the argument for this being a masterpiece, but it doesn't explain major plot points and leaves too many unanswered questions to be one. I shouldn't have to spend hours on a wiki to get half-explained answers to questions such as where did Adam come from? What was the first impact? Why do angels want adam? What is the dummy plug actually? Seele? Why is Gendo such a terrible father? Lance of longinus? Etc. The actual lore, and why things are the way they are is this shows pitfall. They don't get into it enough for everything to align with the audience."
    },
    {
      "username": "Nyx_Selene",
      "userUrl": "https://www.imdb.com/user/ur15089770",
      "reviewLink": "https://www.imdb.com/review/rw1784033",
      "warningSpoilers": false,
      "date": "21 December 2007",
      "rate": "1",
      "helpful": "72 out of 136 found this helpful.",
      "title": "The self-pitying nagging never seemed to end",
      "content": "Contrary to most other commentators, I deeply hate this series.It starts out looking interesting, with mysterious aliens and giant robots, and I kept my hopes up until the very last episode. At the end of it, I still didn't understand what the alien attacks were all about (maybe I missed something, who knows?), and realized that I had sat through 26 episodes consisting mainly of the characters' own self-hating, selfishness and self-pitying. It actually flips between alien/robot fights and these dark, depressing blinking-on-and-off scenes where one or more characters shouts \"I hate me/you/it\" 10-12 times in a row.I can't really see either Shinji or Asuka (two of the main characters) showing growth or change. (Nor can I see any of the other characters learning or growing either, for that matter.) I wanted to kick them and tell them to get a bloody life during the first episodes, and the feeling didn't change during the last ones. Shinji truly possesses the kind of helpless hopelessness that makes people angry rather than charitable, and Asuka is such an infuriating know-it-all that I wanted to smash the TV screen every time she came into view. Oh, and more than anyone else, these two hate everything, and say it veeeeeeeery often. Shinji even makes a half-assed attempt at suicide. Please, explain to me why I should give a rat's ass about this animé, when even it's characters are trying to off themselves to get out of it.I'm otherwise a big fan of animé and manga, and never before have I disliked one so much. I read that the series creator/writer wrote this while suffering from a depression, and I can believe that; it made me depressed to watch it. Is that the aim of this series? I'm honestly asking. Is it designed to make the viewer confused and annoyed? And if suffering from a depression, why just not write a book or biography about it, instead of mixing it up with aliens and mecha's? This alien war plot, as far as I could tell, lead to absolutely nowhere.Finally, since I'm truly fascinated by how many people claim to love this patchwork of dead-end plots, I can't help but wonder how many of them actually find it good, and how many say they do because they've been told it is."
    },
    {
      "username": "Zethia",
      "userUrl": "https://www.imdb.com/user/ur2635672",
      "reviewLink": "https://www.imdb.com/review/rw0354188",
      "warningSpoilers": true,
      "date": "7 February 2004",
      "rate": "",
      "helpful": "43 out of 57 found this helpful.",
      "title": "A piece of psychodrama.",
      "content": "-Spoilers are included.-I don't know much about Animes, but this one is just unique and extraordinary. the plot is apocalyptic and there are abstractly profound scenes, such as Sinji's instable psychological state occasionally gets into. NGE places Biblical metaphors, Jewish myths, as characters and the whole plot's symbolism throughout. and there is Kierkegaard's notion about 'three stages of the human existence', similar with 'three impacts on the earth'. even the episode 16 has a Japanese title that exactly means one of his writing, 'the sickness unto death'.Kierkegaard, who is Danish solifidian existential philosopher, said every human unconsciously have the anxiety and the despair because we don't know what we should do, where we came from, where we were meant to be gone, in the middle of the world, with plenty of other lives, the losing the purpose of the life and God(liken to Sinji's father, Asuka's mother)'s love. and after all, we suffer the despair, the same thing that Sinji undergoes. and K' refers to the human existence in the form of three stages, composed with the aesthetic, the ethical and the religious, also similar with 'three impacts' or 'three cases' in the episode 25, 26.He argues, that most important other than anything, all of these ego-improvement process, is have to be done only by the an individual's free will, not by others', deep awakening in frond of God by the own will is needed to do overcome the sickness unto death as Sinji finally completes. Meanwhile, an individual never can't understand perfectly the others as the ego and the other self, the other's view on an individual's ego, are totally different. so Sinji and Rei suffer the loneliness from this, which makes us to got conflicts, killings, wars all over the world endlessly. but if our bodies and spirits put together, we could evolve to understand every the other's thing in the state, can't possibly define whether it's 'we' or just alone. Seele want humanity to be one under the 'human completion plan'. this kind of notion is associated with Husserl, Heidegger, and Sartre's philosophical theory.Anyway, I won't enumerate it more. overall, this animation doesn't explain/clear a thing. the scenario is hard to follow if you didn't see it very carefully. only I can say about this Anime is surely odd, exquisite as well. and I'm sure the director is someone like Japanese Stanley Kubrick. he gave me a serious headache."
    },
    {
      "username": "Aaron1375",
      "userUrl": "https://www.imdb.com/user/ur1111192",
      "reviewLink": "https://www.imdb.com/review/rw6279722",
      "warningSpoilers": false,
      "date": "17 November 2020",
      "rate": "9",
      "helpful": "5 out of 7 found this helpful.",
      "title": "Entertaining anime marred by its non ending.",
      "content": "I have always heard that this series was really good and different so I wanted to give it a try and finally found a place to watch it. Well, it was definitely good and a bit different, but there are plenty of weird anime series and movies out there so this one was not too different. The only aspect that was a bit disappointing were the final three episodes as the series seems to be racing to some sort of mind numbing and insane conclusion, but instead we get what I will refer to as a non ending. So much build up literally goes nowhere; however, I do know there is a movie which I intend to watch and that it is what they say is an alternative ending, but I would have to think that it is the true ending because the last two episodes of this one really do nothing more than look into the main protagonist's mind leaving a huge hole full of questions about certain events that have transpired.The story has a young boy who has been living with his teacher as his father basically has abandoned him. That seems to be changing as the boy is invited to the installation his father is in control of; however, he is not there to be reunited with his father, but rather to pilot a huge mech/organic being known as an Eva to fight creatures called Angels who are responsible for the world being totally thrown out of whack. Through the adventures Shinji (the main protagonist) will make friends at school and fight angels along with Rei and Auska two other Eva pilots. Though there is something off and not entirely right about what is going on as strange details emerge with each Angel encounter.As I said, really good show with a lot of humor and such at the beginning. It starts out a bit like your more typical anime, but gets darker as it goes, but then totally goes blank for the finale. I do believe that the movie is supposed to be the ending as I read that the final two episodes of this are happening between this and the movie in Shinji's mind which is good because if you take what they present here there are so many questions left unanswered.So, a good series with some good twists and turns, I would rank it a ten, but they did seem to keep one hanging in terms to what happened during the second impact and the whole spear thing too. I am hoping the movie clarifies some of that. I enjoyed the battles with the angels, but a lot of time they were not at the forefront which did make this show a bit different. The first battle is literally told in a recap rather than in real time. I am hoping the movie clarifies more stuff, but as it is, it is an enjoyable anime series and one that does not go on for an eternity so you can watch it in a fairly short period of time."
    }
  ],
  "errorMessage": ""
}