{
  "imDbId": "tt10233448",
  "title": "Vinland Saga",
  "fullTitle": "Vinland Saga (TV Series 2019– )",
  "type": "TVSeries",
  "year": "2019",
  "items": [
    {
      "username": "samxxxul",
      "userUrl": "https://www.imdb.com/user/ur40889724",
      "reviewLink": "https://www.imdb.com/review/rw6350371",
      "warningSpoilers": true,
      "date": "9 December 2020",
      "rate": "10",
      "helpful": "59 out of 68 found this helpful.",
      "title": "Spellbound, by far one of the best shows i have seen..!",
      "content": "With perseverance hitting on the head the young Thorfinn is hellbent to avenge the death of his father by the mercenary leader Askeladd. Times change and on the other hand, Thorfinn is hand in gloves in the camp of his nemesis. Having passed the test of valour, betrayal and indifference in foreign land, his vengeance takes a backseat but still fueled by the revenge for one's own and for his father.This is a basic plot to what will unfold to be inked in your memory as some of finest genre experiences you will ever witness.With only 24 episodes, this anime can be ranked alongside genre masterpieces. For some this might sound like a hybrid; the offspring of a union between 'Attack of the Titan, Cowboy bebop with dash of influences from few war/historical live action series. It is fair enough and the influence can be seen, I also consider Studio Ghibli to be a major force behind the imagination. Regardless, this anime is a standout and the character development for the leads is simply unparalleled. I cannot pick a favourite and can't help to love or hate a character. If I say Askeladd is brilliant, pair him with Thorfinn and other characters like Canute or Einar who are equally amazing. Personally, I loved and hated each character in this one, including the HIGH drunk priest. Vinland Saga boasts of a rich universe, full of striking characters and with supporting stories inclined to history and folklores. The Banter between the Vikings and Christians is hilarious, might piss of the pious. All the merit goes to the creators of the series, since plots involving secondary characters often appear just to plug holes or wrap the story. Here, in addition to being attractive, the subplots perfectly fit the mysterious world of the series. The different regions are captured in all it's glory, the inhabitants go about their business, the war breaks out, we see the childishness and natural naivety. Also, the series critically examines the phenomenon of religion and does not slip into moralizing.Another element of prominence is the soundtrack, there are series of scores (including the opening) that very well fulfill the role of transmitting various types of emotions to the viewer.Conclusion: The mix of war, melodrama, small-town comedy, merged into a wide-ranging character drama, can be frustrating when answers form the axiom. However, if you let the world of Vinland Saga take effect, you get the rare chance to explore the enigmatic power the genre, soon to become part of one of the greatest anime in the future. The end of prologue in Season 1 is perfect setup for what's about to happen next and the reason why I can look forward to the next!"
    },
    {
      "username": "r-aldowaisan",
      "userUrl": "https://www.imdb.com/user/ur49295113",
      "reviewLink": "https://www.imdb.com/review/rw5379924",
      "warningSpoilers": false,
      "date": "4 January 2020",
      "rate": "10",
      "helpful": "107 out of 128 found this helpful.",
      "title": "Best Ending Ever",
      "content": "Amazing, wow, i watched this episode like 5 times already, every 3 or 4 days i watch it again, incridabel really. And am 53 old."
    },
    {
      "username": "mdwaqaruddin-52968",
      "userUrl": "https://www.imdb.com/user/ur92923823",
      "reviewLink": "https://www.imdb.com/review/rw5000145",
      "warningSpoilers": false,
      "date": "17 July 2019",
      "rate": "10",
      "helpful": "152 out of 182 found this helpful.",
      "title": "Spoiler- Its Going to become Another Classic.....",
      "content": "Infinte Potential. In few years it going to be recognized among Deathnote, Fullmetal Alchemist Brotherhood, Attack on titan, Stein's Gate, and then VINLAND SAGA...Mark these words..... Rating- 10/10"
    },
    {
      "username": "vault13-347-485335",
      "userUrl": "https://www.imdb.com/user/ur33206743",
      "reviewLink": "https://www.imdb.com/review/rw4993929",
      "warningSpoilers": false,
      "date": "13 July 2019",
      "rate": "10",
      "helpful": "120 out of 145 found this helpful.",
      "title": "Its like GoT with Vikings!",
      "content": "If you loved the first 4 seasons of GOT, trust me, you are in for a treat here! Treason, violence, schemes, twists, shocking deaths, great characters and their individual development over the course of time, its all here! Im a manga reader and this is getting better with every issue! Cant say more without spoilers, i hope the anime will be as good as the manga!"
    },
    {
      "username": "minihingstar",
      "userUrl": "https://www.imdb.com/user/ur75809477",
      "reviewLink": "https://www.imdb.com/review/rw5025396",
      "warningSpoilers": false,
      "date": "28 July 2019",
      "rate": "10",
      "helpful": "110 out of 129 found this helpful.",
      "title": "4 episodes in...",
      "content": "And can tell... tissues needed here. The anime is as epic as the manga. So far 10/10"
    },
    {
      "username": "joacoromero_90",
      "userUrl": "https://www.imdb.com/user/ur54805742",
      "reviewLink": "https://www.imdb.com/review/rw4983744",
      "warningSpoilers": false,
      "date": "8 July 2019",
      "rate": "10",
      "helpful": "160 out of 199 found this helpful.",
      "title": "Shingeki now has an Enemy for Anime of The year",
      "content": "Where i can start ? Wit studio is making something special here even more than Attack of titans you can smell it from the first episode. Character design, Landscapes, Sky , Water Movement , accurate History recreation, Music , pace and mistery it just works wonderfully in each episode to the point i think we might have one of the best TV shows of the recent years . it's hard to express on words but it's just beautiful and unique . Share to your friends , post it on social media so we can see this story reach the end on a High Budget .i'm in love with Vinland saga and now all i want to do is know more about Vll-Xl Viking Story."
    },
    {
      "username": "MrHeraclius",
      "userUrl": "https://www.imdb.com/user/ur87850731",
      "reviewLink": "https://www.imdb.com/review/rw5561728",
      "warningSpoilers": false,
      "date": "19 March 2020",
      "rate": "",
      "helpful": "45 out of 63 found this helpful.",
      "title": "Vinland Saga",
      "content": "Story The story is about revenge and the growth of are main character as his views change from a boy to a pure blooded viking. While the show is slow paced the characters and action will hold your interest.Art The art in the show is really well done since it's made by Wit Studio the same people who do Shingeki no Kyojin and many other damn good looking anime. Unfortunately the only part in the anime that looks bad at times is the sea and for a viking show that's kinda bad but since the rest of the show looks so good i'm willing to overlook the bad cgi water.Music Hmm music is 50/50 for me while it sounds good like the op is one of my fav this season but the rest of the music doesn't really fit a viking show now it is good just for me doesn't really fit the setting.Character So far I've really liked the characters they look and act like vikings and i'm enjoying are main character growth.Enjoyment I love this show so far and i've only heard good things from the manga readers so i'm really looking to see more from the story."
    },
    {
      "username": "aboalhyjaa",
      "userUrl": "https://www.imdb.com/user/ur69239269",
      "reviewLink": "https://www.imdb.com/review/rw4986681",
      "warningSpoilers": false,
      "date": "9 July 2019",
      "rate": "10",
      "helpful": "52 out of 81 found this helpful.",
      "title": "I already see a new AOT in it😍",
      "content": "This anime is amazing!! I cant believe how much its real and how it talks about the vikings and their history-true history though- ."
    },
    {
      "username": "dmedinagimenez",
      "userUrl": "https://www.imdb.com/user/ur89409666",
      "reviewLink": "https://www.imdb.com/review/rw5906233",
      "warningSpoilers": true,
      "date": "14 July 2020",
      "rate": "9",
      "helpful": "28 out of 36 found this helpful.",
      "title": "I can only say \"wow\"",
      "content": "After having seen Kimetsu no Yaiba and Dororo, animes that belongs to 2019, I did a survey on Instagram saying that, \"in your opinion, what was the best anime of 2019 between Kimetsu no Yaiba and Dororo\" , then I find one that tells me In his opinion, Vinland Saga is the best he has seen in 2019.At that point I asked myself, \"What anime is that?\" And I quickly started searching Vinland Saga on IMDb and I find 8.9 score. And on top of that I see that it's about Vickings, and for me that's something new, something I've never seen before.Then I say to myself, \"How is it possible that I have so much score? Probably is overrated.\" And that same day I downloaded the entire show and as soon as I finished I started watching the first chapter.The opening began and I was amazed at how impressive it was, then the story began to unfold and I loved how it progressed. Thorfinn the protagonist begins as a child with the desire to grow up and be just like his father, the most powerful Vicking ever. His father was a very strong person, but Askeladd (one of his former company companions) for money had a desire to kill Thorfinn's father, Thors. Thorfinn comes along with his father at the time. Once on the battlefield, Thors defends himself from the Askeladd army using only his fists, he had no desire to kill anyone. The moment Thors dies, his son blinded by anger and revenge decides to unite with Askeladd and his army, and once he gets stronger, kill him so that he can avenge his father.From then on the main plot continues to evolve and improve making Vinland Saga become a cult anime that should be remembered along with shows like Fullmetal Alchemist, Hunter x Hunter, Attack On Titan, Death Note etc...A masterpiece without a doubt."
    },
    {
      "username": "umlaziking",
      "userUrl": "https://www.imdb.com/user/ur110613987",
      "reviewLink": "https://www.imdb.com/review/rw5719782",
      "warningSpoilers": false,
      "date": "8 May 2020",
      "rate": "10",
      "helpful": "21 out of 31 found this helpful.",
      "title": "Brilliant",
      "content": "This anime is just beautiful, its really up there rivalling animes like attack on titan and demon slayer, Hell i even think this anime is waaay better than the two, this anime is really well written and very tops. I really hope it continues the way its going cause it really has so much potential to be the greatest anime of all time"
    },
    {
      "username": "AdityaDev007",
      "userUrl": "https://www.imdb.com/user/ur103998856",
      "reviewLink": "https://www.imdb.com/review/rw5617282",
      "warningSpoilers": false,
      "date": "7 April 2020",
      "rate": "9",
      "helpful": "15 out of 21 found this helpful.",
      "title": "The Second best Wit Studio's Product after The first : Attack on Titan",
      "content": "An EPIC Story with great characters. This masterpiece deserves anime of the year but again if Attack on Titan was not in existence. The animation and overall action scenes are visual treat not more comparable with Violet Evergarden. The problem with this is that Wit Studio missed an important thing that is an epic background score which are important for action scenes not to worry more about it because the scenes will grab you so emotionally that you will not require background music. Characters like Askeladd is not renewable in history it will force you to think about his strong intentions though he is not a antagonist or protagonist, This anime is not for War it is more than it"
    },
    {
      "username": "Alexlionfire",
      "userUrl": "https://www.imdb.com/user/ur40976263",
      "reviewLink": "https://www.imdb.com/review/rw4993749",
      "warningSpoilers": false,
      "date": "13 July 2019",
      "rate": "9",
      "helpful": "36 out of 51 found this helpful.",
      "title": "You must watch this one!",
      "content": "I found out about this anime from a random trailer on YouTube. I had absolutely no idea there was a manga on this subject. Oh, boy am I glad I decided to watch the trailer! After watching all 3 episodes, all I can say is IMPRESSIVE! From the opening sequence to the great cgi, graphics and world building to the believable environment, characters and story. And the historical aspects are treated with respect. The simple fact that there are no horned helmets makes me want to rate it 10/10! Somehow, it brings back memories from the very first season of Vikings. I am really intrigued by Vinland Saga and can't wait to find out more about this series. Maybe I'll even give the manga a go. It's a must watch!"
    },
    {
      "username": "yogeshnandal-44248",
      "userUrl": "https://www.imdb.com/user/ur105976131",
      "reviewLink": "https://www.imdb.com/review/rw5025382",
      "warningSpoilers": false,
      "date": "28 July 2019",
      "rate": "10",
      "helpful": "25 out of 40 found this helpful.",
      "title": "Most Epic Anime ever made....",
      "content": "It's a anime totally worth watching, it's like a combination of game of thrones with vikings and spartas. Too Good for an anime. Better then it's compitiors like Dr. stone or fire force. Highly recommend to watch..."
    },
    {
      "username": "Mymoviediscography",
      "userUrl": "https://www.imdb.com/user/ur144384572",
      "reviewLink": "https://www.imdb.com/review/rw9064810",
      "warningSpoilers": false,
      "date": "19 May 2023",
      "rate": "9",
      "helpful": "4 out of 5 found this helpful.",
      "title": "A Sweeping Epic of Honor, Betrayal, and Redemption",
      "content": "\"Vinland Saga\" is a visually stunning and emotionally gripping anime series that delves into the complexities of war, honor, and personal growth. Set in a Viking era filled with turmoil and violence, the show takes viewers on a thrilling journey as it weaves together a tale of revenge, political intrigue, and the search for a fabled land called Vinland.One of the standout aspects of \"Vinland Saga\" is its exceptional animation. The hand-drawn artwork is rich in detail and breathtaking in its execution, bringing the world of Vikings to life with its vibrant colors and fluid action sequences. The battles are meticulously choreographed, displaying a visceral intensity that keeps you on the edge of your seat.But beyond the stunning visuals, the series shines in its character development. Each character, from the tormented protagonist Thorfinn to the enigmatic Askeladd, is nuanced and multi-dimensional. Their motivations and struggles are explored with depth, making it easy for the audience to become emotionally invested in their stories. The relationships that form and evolve throughout the series are equally compelling, adding layers of complexity to the narrative.\"Vinland Saga\" is not just a tale of violence and warfare, but also a reflection on the consequences of one's actions and the pursuit of personal growth. The show delves into the moral dilemmas faced by its characters and explores themes of forgiveness, redemption, and the search for a peaceful existence in a world consumed by chaos.The pacing of the series is generally well-balanced, allowing for moments of introspection and character development amidst the epic battles. The soundtrack further enhances the emotional impact of the story, with its haunting melodies and powerful compositions.While \"Vinland Saga\" is a captivating and thought-provoking series, it may not be suitable for all viewers. Its mature themes, graphic violence, and intense storytelling may not resonate with everyone. However, for those who appreciate a sweeping epic that tackles complex themes with stunning visuals and compelling characters, \"Vinland Saga\" is an absolute must-watch."
    },
    {
      "username": "BadgerStorm4345",
      "userUrl": "https://www.imdb.com/user/ur113370202",
      "reviewLink": "https://www.imdb.com/review/rw5955994",
      "warningSpoilers": false,
      "date": "31 July 2020",
      "rate": "10",
      "helpful": "12 out of 20 found this helpful.",
      "title": "An Enthralling Masterpiece in the making",
      "content": "Vinland Saga is one of the best shows to come out in 2019, without a doubt. It's story is so well written that it's strange they didn't adapt the manga sooner. The character dynamics are all incredibly important and the characters grow naturally with the situations they're put in. The animation can be beautiful or incredibly violent, which makes for emotional and awesome moments, but mainly it shows the horrors of war. The music is top notch and fits the time. Vinland Saga is a new anime that will eventually be a masterpiece at its current rate."
    },
    {
      "username": "yogeshnandal-44248",
      "userUrl": "https://www.imdb.com/user/ur105976131",
      "reviewLink": "https://www.imdb.com/review/rw5293688",
      "warningSpoilers": false,
      "date": "1 December 2019",
      "rate": "10",
      "helpful": "14 out of 22 found this helpful.",
      "title": "absolutely epic anime till now(24th episode)",
      "content": "Only a monster **** can't love this anime it's to gr8"
    },
    {
      "username": "mohammedskoidr99",
      "userUrl": "https://www.imdb.com/user/ur103217401",
      "reviewLink": "https://www.imdb.com/review/rw4989553",
      "warningSpoilers": false,
      "date": "11 July 2019",
      "rate": "10",
      "helpful": "25 out of 36 found this helpful.",
      "title": "The first three episodes were a prelude to the best",
      "content": "A very impressive step by the Wit studio when he started with Thores character at first .Drawing characters was more than fantastic and the CGI was never bad either I have great hope in this anime........When the rest of the episodes are available I will talk more about him"
    },
    {
      "username": "henrique1993",
      "userUrl": "https://www.imdb.com/user/ur53216500",
      "reviewLink": "https://www.imdb.com/review/rw5042555",
      "warningSpoilers": false,
      "date": "6 August 2019",
      "rate": "10",
      "helpful": "55 out of 70 found this helpful.",
      "title": "Top 5 Anime Ever Produced in Human History",
      "content": "No Anime was ever as immersive as to make me cry on the FIRST half of the VERY FIRST episode. Fullmetal Alchemist: Brotherhood's got me at the 4th episode, Shingeki no Kyojin got me at the end of the 1st, but Vinland Saga? Hell, it's not just the graphical shock the series environment puts you in, It's the BEAUTIFUL details, the landscapes that are magically followed by a \"Ghibli Studio Level\" piano, the incredible voice acting coordinated with a full suit of emotions that are required when you approach a Vikings culture and environment as respectfully as they did. 5 episodes out now for Vinland Saga, and the details keep surfacing in an incredibly EPIC way. This anime is just sublime in every aspect you can look at, and I will be dammed if it doesn't end up going down as one of the TOP 5 ANIMES EVER PRODUCED IN HUMAN HISTORY."
    },
    {
      "username": "LUchiha",
      "userUrl": "https://www.imdb.com/user/ur85043917",
      "reviewLink": "https://www.imdb.com/review/rw5366973",
      "warningSpoilers": false,
      "date": "30 December 2019",
      "rate": "10",
      "helpful": "11 out of 16 found this helpful.",
      "title": "An Underrated gem of 2019",
      "content": "I feel bad for this anime that it couldn't create that much of hype as Demon slayer, Dr. Stone did this year. This anime wasn't even promoted that much by Wit Studio or by official AOT page even on Facebook for what god damn reason I don't know. My interest for this anime only develop due to the Fact that Wit Studio (makers of Attack on Titan) was behind this task. But after watching first 3 episodes OMG it was something that i haven't witness in anime for so many years. As the anime progress i kinda feel attached to it. It was like Game of Thrones of Anime (without dragons of course). When i asked my friends who are into anime haven't even heard of it I kinda feel sad but after my recommendation, they loved it. So guys please spread this anime recommendation to your friends,family whoever and Please ALSO TELL THEM TO RATE THIS ANIME ON \"IMDB\" so more western audience could get to know about this MASTERPIECE. Make it cross 5000+ Thank you for your Encouragement."
    },
    {
      "username": "Lillmackish",
      "userUrl": "https://www.imdb.com/user/ur79107883",
      "reviewLink": "https://www.imdb.com/review/rw5043579",
      "warningSpoilers": false,
      "date": "6 August 2019",
      "rate": "10",
      "helpful": "55 out of 71 found this helpful.",
      "title": "A potential upcoming classic!",
      "content": "When we talk about what constitutes a great cinematic universe, opinions always differ. Some like it realistic, whilst others don't. Some like the story fast paced, whilst others don't. Some like the characters being original and grounded in a sense of reality, whilst others prefer the generic, more idealistic, style of character that's more grounded in fantasy. I, for one, prefer a realistic setting with relatable characters that develop in an understandable way given the realistic circumstances. I also like it at a pace that keeps the story interesting, whilst also not rushing it making the story feel underdeveloped and difficult to comprehend.This anime has got it all. Everything from the historical aspects, to how it establishes its cast, all the way to the wide array of emotions it's managed to surge within me during such a short amount of time, is just phenomenal...and we're only five episodes in. Also, don't even get me started on the animation quality and the splendid use of CGI.This is how CGI's supposed to be used to make an animated story feel real. This, is amazing.Making characters feel realistic and relatable, whilst also grounding them in a story that's only been on for 100 minutes, give or take, is amazing. Movies can do this, because they \"only\" need a crescendo like build up that's more often than not really fast paced, and end it all with a climax built up from the accumulated emotions of the main character. A television series needs to do all of that, and at the same time also keep the viewer interested through a much slower pace.An amazing example of how Vinland Saga handles character grounding came from episode four of this series. Seeing Thors handling the situation at hand the way he did felt realistic, because of how the series already had developed him as a character. Some might argue his ideals were naive, and I might agree, but that doesn't make his actions feel any less real.But, forget about Thors and his ideals for a second. Forget the fantastic animation quality of the episode and lets for the love of God forget how unrealistic it actually is to jump ten meters straight.Let's focus on Askeladd. We'd already seen a glimpse of him during the previous episode, where he shows up and immediately establishes himself as the slippery kind of crook guy that doesn't hesitate to step on any kind of honor to get what he wants. What's truly amazing about this next episode is seeing Askeladd handling Thors and their diametrical ideals confronting one another. The respect Askeladd managed to feel for a man whose view of the world really is his polar opposite, as well as the complex array of emotions he felt during the episode just added another level of layer to his character.That's grounding a character in a story, and that's doing it in just one episode. That, is superb.I've seen some compare this to Attack on Titan, and I get it. A main character that's growing through a search for revenge and all that jazz. The series I'd like to compare this to would rather be early Berserk and early Game of Thrones, though. The fact that these two shows were able to build a believable universe with an intriguing plot during such a short period of time with relatable emotions built upon actual realism is what made them true masterpieces.I'm not saying Vinland Saga will ascend. I'm not even saying it will keep on delivering.I'm saying it's already a masterpiece."
    },
    {
      "username": "morbiusfan2023",
      "userUrl": "https://www.imdb.com/user/ur157997919",
      "reviewLink": "https://www.imdb.com/review/rw9026736",
      "warningSpoilers": false,
      "date": "1 May 2023",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "I couldnt love it more",
      "content": "Only 8 episodes in and I absolutely love it I couldn't like it more, it's so emotional, well paced, the characters have so much depth, the action is so thrilling, it is realistic, and so much more and doesnt have random stuff thrown in for no reason like a lot of other animes. Vinland Saga is already my favorite anime ever and that probably wouldnt change for a while as it is so good, I definitely recommend it to anyone who prefers the more grounded/realistic stuff over the typical kind of fantasy animes.Overall I rate vinland saga a 10/10 it is perfect in nearly every aspect and deserves more love."
    },
    {
      "username": "Mateo-EGC",
      "userUrl": "https://www.imdb.com/user/ur147942948",
      "reviewLink": "https://www.imdb.com/review/rw8782997",
      "warningSpoilers": false,
      "date": "6 January 2023",
      "rate": "10",
      "helpful": "5 out of 7 found this helpful.",
      "title": "A true warrior.",
      "content": "For me, Vinland Saga is a masterpiece of animation.From beginning to end it's amazing, at first you can hate certain characters, but then you can like them and feel something for them. It has a great antagonist, and the main character is not just a character.It's definitely a true Viking story, there are some real details like the cruelty they possessed. Watching Thorfinn's development I loved, from being a boy to a warrior who has a lot to learn, it makes me love the character that much more, and knowing that he doesn't have the script on his side and that not everything revolves around him makes it more enjoyable.I love the two openings, as well as the endings. It also has a great soundtrack for the suspense and action moments, as it has great battles that I loved watching for their animation and choreography.I admit I cried with its ending because I didn't expect it, anime in general is unexpected because anything can happen. I can't wait to see more of this beautiful story, to see more about Thorfinn and to know if he will become a true warrior or not."
    },
    {
      "username": "secret_arash",
      "userUrl": "https://www.imdb.com/user/ur114560829",
      "reviewLink": "https://www.imdb.com/review/rw6533234",
      "warningSpoilers": false,
      "date": "27 January 2021",
      "rate": "10",
      "helpful": "7 out of 11 found this helpful.",
      "title": "Unexpectedly Amazing!",
      "content": "I started watching this show without any information about its story or genre or anything that helps a bit, therefore, when I watched the first episode and realized the story happens during vikings era and their conflicts with England, I got a little bit disappointed because I've already watched bot Vikings and The Last Kingdom. However, as I continued watching, I started to enjoy this one much more than those other two!Everything about the show is brilliant. The first 4 episodes were amazingly perfect. The rest may not be as perfect as them but it is so damn good and entertaining. The fact that it apperantly has a great ending as well makes me think of it as one the best shows of 2019."
    },
    {
      "username": "samball-28104",
      "userUrl": "https://www.imdb.com/user/ur74693576",
      "reviewLink": "https://www.imdb.com/review/rw5083640",
      "warningSpoilers": false,
      "date": "27 August 2019",
      "rate": "10",
      "helpful": "15 out of 23 found this helpful.",
      "title": "I don't even like anime for the most part but this is absolutely amazing",
      "content": "No spoilersThis series is only 8 episodes in and already it's got me desperately waiting for the next episode. The character development is absolutely subliminal and the story is the most captivating I've watched in years. I would recommend this to people who don't even like anime, and if you do I would DEFINITELY recommend it!"
    },
    {
      "username": "mayank09876",
      "userUrl": "https://www.imdb.com/user/ur44661012",
      "reviewLink": "https://www.imdb.com/review/rw5960702",
      "warningSpoilers": false,
      "date": "2 August 2020",
      "rate": "9",
      "helpful": "8 out of 14 found this helpful.",
      "title": "One of best anime's I have watched",
      "content": "The anime is very loosely based on the life of real life Icelandic explorer from the times of vikings, although this particular season doesn't have much to do with exploring, instead the focus is more on the childhood of our protagonist Thorfinn and his life in the battlefield during the time of Danes invasion of England in the 11th Century. The historical anime is filled with famous real life characters from the time period although dramatized for watching pleasure.As the theme is based on Vikings, we have plenty of action, the killing, looting and pillaging is without remorse, very realistic and unlike what you would expect in anime, this is a show meant for adults.The animation itself is superb, the flow of action cinematography is top notched, and the music perfect for the fight sequences and tense moments. Nothing less was expected from Wit studios who have made a name for themselves with quality production.The anime is based off a manga and I was already a fan of the source material. even though the story and plot didn't have any surprise for me, I was impression with the powerful story, it is easily on of the deepest stuff written for anime.Sadly I do feel it doesn't get the attention it deserves as it is a Japanese production based on European source."
    }
  ],
  "errorMessage": ""
}