{
  "imDbId": "tt1628033",
  "title": "Top Gear",
  "fullTitle": "Top Gear (TV Series 2002– )",
  "type": "TVSeries",
  "year": "2002",
  "items": [
    {
      "username": "0w0",
      "userUrl": "https://www.imdb.com/user/ur54176053",
      "reviewLink": "https://www.imdb.com/review/rw5371613",
      "warningSpoilers": false,
      "date": "1 January 2020",
      "rate": "1",
      "helpful": "69 out of 73 found this helpful.",
      "title": "Old top gear is 10/10. Anything past 2015 is 1/10",
      "content": "I TRIED watching the Top Gear past 2015, but with Jeremy, Richard and James' departure, the show is simply AWEFUL. BBC and Top Gear made what's probably the biggest mistake in Prime Television HISTORY, by firing the Top Gear presenters who had been with the show for over 20 seasons, and now, they're trying to fill the shoes of Giants, with a rag-tag bunch of idiots... I honestly don't know who any of these new people are, and frankly, I don't care.I tried today watching the new \"Nepal Special\" where 3 random guys take 3 £6000 cars for a drive through Nepal, but it's simply not entertaining. And they think that being mischievous and screaming like a child, is going to make it seem like they can somehow bring levity to a really boring situation (almost like these youtubers who scream and act fake, just in an effort to seem funny).So here's my rating: Anything before 2015 is 10/10 Anything after 2015 is 1/10"
    },
    {
      "username": "prose",
      "userUrl": "https://www.imdb.com/user/ur0340133",
      "reviewLink": "https://www.imdb.com/review/rw1469492",
      "warningSpoilers": false,
      "date": "8 September 2006",
      "rate": "10",
      "helpful": "122 out of 129 found this helpful.",
      "title": "You don't even have to like cars....",
      "content": "Yes, this show is about cars, but then again it isn't. Mostly it's about extremes of opinion, dreams and fantasies, dares, one-up-man-ship, and taking everything just a little bit further. And it's also entertaining - very entertaining, which is what television is meant to be, and so often is not. I'm not all that interested in cars, and my son doesn't even drive, but we both love the show, and watch it religiously.The balance of presenters: Jeremy, the loud-mouthed, cuttingly funny, over-bearing older guy; Richard, the young, cute, quirky, adolescent one; James, the sensitive, quiet, contemplative, intelligent one; is nothing short of genius!It seems that no expense is spared, either on the experiments and dares, or on filming, and this adds to the visual experience. This show is funny, even hilarious at times, classy, controversial, and hugely entertaining. Most people I know who watch this show know almost less than nothing about cars, and I think that says a lot about how successfully this program reaches beyond the expected demographic of young male petrol-heads."
    },
    {
      "username": "plan99",
      "userUrl": "https://www.imdb.com/user/ur2109886",
      "reviewLink": "https://www.imdb.com/review/rw6153309",
      "warningSpoilers": false,
      "date": "6 October 2020",
      "rate": "1",
      "helpful": "39 out of 43 found this helpful.",
      "title": "Needs to be renamed \"Bottom Gear\".",
      "content": "With May, Clarkson and Hammond presenting this was a ten star show. With Le Blanc etc. Presenting it was a one star show. With Chris Harris (excellent) Flintoff and Paddy presenting it was a four or five star show. Unfortunately the increasingly childish antics of Chris, Flinty and Paddy from October 2020 when they are on screen together has reduced it back to a one star show. I predict a rapid drop in viewing figures by the end of the current six episodes if the remaining five are as bad as the first one, dire. Chris' test drives are the only bits worth watching.Good news, the next two episodes are a great improvement so there's hope yet that it will get back to being at least a seven star show.Oh dear March 2021 and all pretence that TG is a motoring programme has gone out the window. Informative car info which was 80% of the content has been replaced by 80% the boys having expensive fun with almost zero entertainment value for viewers. Anyone looking for just cause to scrap the TV licence can use TG as an illustration of how far the BBC has declined recently.November 2021 and some good news, the childish behaviour has been dialled down from 10 to 7 so there is hope for it yet.The 5 june 2022 episode. Judging by this episode the BBC think that the average age of a Top Gear viewer is ten. The extremely childish behaviour of The Three Stooges in this episode was painful to watch and another few like this one and the viewing figures will drop off (another) cliff. It's also looking increasingly obviously staged. One star is far too generous."
    },
    {
      "username": "jaedotest",
      "userUrl": "https://www.imdb.com/user/ur102243667",
      "reviewLink": "https://www.imdb.com/review/rw5611574",
      "warningSpoilers": false,
      "date": "5 April 2020",
      "rate": "1",
      "helpful": "27 out of 27 found this helpful.",
      "title": "Can't replace the greats",
      "content": "Will never be the same and the replacement host are just painful to watch, feels like a chore especially listening to Chris' nonsence"
    },
    {
      "username": "markmcblain",
      "userUrl": "https://www.imdb.com/user/ur76423149",
      "reviewLink": "https://www.imdb.com/review/rw5459389",
      "warningSpoilers": false,
      "date": "4 February 2020",
      "rate": "2",
      "helpful": "15 out of 15 found this helpful.",
      "title": "Yawn",
      "content": "The once mighty show is dead. Paddy McGuiness, Freddie Flintoff and the other bloke are dire. They laugh at their own jokes. It is a boys club. With three stooges. There is no charisma, studio atmosphere or anything new. Clarkson and co. killed the golden goose. This is the first time I have tuned in for years. It was woeful. Can it."
    },
    {
      "username": "Masterchief49508",
      "userUrl": "https://www.imdb.com/user/ur5855006",
      "reviewLink": "https://www.imdb.com/review/rw1392294",
      "warningSpoilers": false,
      "date": "12 June 2006",
      "rate": "10",
      "helpful": "174 out of 192 found this helpful.",
      "title": "Simply the Best Television Program and DVD Series Devoted to Automobiles, Ever",
      "content": "As an American, your selection of automotive programming is quite limited. On one hand there is the SPEED Channel that is not available in every market, and on the other there is the \"Powerblock\" on Spike TV that offers little more than how to add a bit of power to your Grandmother's '81 Caprice.Even as an import, Top Gear simply blew my mind away during my first viewing of the show last year when The Discovery Channel ran a season of the show slightly altered for the US Market.For one, the personality of the show is unlike anything I have seen before. The show's lead host, Mr. Jeremy Clarkson is rather opinionated on everything, and although he will never hide the fact that he does not like something, he himself is quite likable as a person. On the opposite side of the spectrum, there is Mr. James May, quite possibly the most British man I have ever seen on television or in the movies. He isn't offensive in any way, and although he may be known as \"captian slow,\" his presentations are quite enjoyable as they always seem to come from someone with a level head. Caught in the middle is Mr. Richard Hammond, a rather young Briton who embodies the current generation of automotive fandom. All together, the hosts balance each other out, and each offer their own perspective to the show, appealing to a wide range of people.Outside of the \"acting,\" the cinematography of the show is breathtaking, given that it is a weekly event in the UK. Occasionally the segments rival that of some of the best television shows or movies that I have seen, and although they are primarily focused on the car and the hosts themselves, the surrounding environment often plays a large role in the different reviews....But then you add the great soundtracks of the reviews, the quirky setups to the different tests (such as a Bugatti Veyron racing a plane from Italy to England), and the great test laps done by the Stig... It all adds up to one of the greatest television programs, well, ever.It truly is a shame that the viewing of Top Gear is generally limited to the internet via You Tube or Google Video here in the US, but there was a pilot filmed for The Discovery Channel in the US for an American version of Top Gear, but thus far, nothing has happened.If you have the time, I highly suggest you take a look at the show, interested in automobiles or not."
    },
    {
      "username": "Ally Kent",
      "userUrl": "https://www.imdb.com/user/ur0102215",
      "reviewLink": "https://www.imdb.com/review/rw1450330",
      "warningSpoilers": false,
      "date": "16 August 2006",
      "rate": "10",
      "helpful": "110 out of 119 found this helpful.",
      "title": "This one goes up to 11!!",
      "content": "I don't care what anyone says - the British are the funniest of all. Jeremy, Richard and James are all so different - but this is what makes this show REALLY work. I have fallen off the couch so many times laughing that it is becoming a hazard! The show is entertaining, informative and hilarious - I would say the only drawback is after watching it you have to go and get in your own car and imagine what Jeremy would say about it. (I can assure you - his comments would not be good about mine!!)It also doesn't hurt that James May is the most delicious thing on two legs - I just love this British gentleman - he is what men ought to be!This one definitely goes all the way to 11!"
    },
    {
      "username": "DVD_Connoisseur",
      "userUrl": "https://www.imdb.com/user/ur0789739",
      "reviewLink": "https://www.imdb.com/review/rw1750873",
      "warningSpoilers": false,
      "date": "22 October 2007",
      "rate": "",
      "helpful": "7 out of 7 found this helpful.",
      "title": "One of the reasons why I don't mind paying the BBC licence fee",
      "content": "\"Top Gear\", in its rejuvenated, hour-long format, is simply compulsory viewing on a Sunday evening. As a glossy motoring magazine aimed at petrol-heads of all ages, the show pulverises any competition with its blend of beautiful photography, humorous scripts and highly watchable presenters.The living legend that is Jeremy Clarkson remains one of the funniest men on television and it will be a truly sad day when he decides to move on from motoring journalism. However, his fellow presenters, Richmond Hammond and James May are just as enjoyable to watch. I've been a fan of the diminutive and enthusiastic Hamster since the early days of \"Granada Men and Motors\" and it was a dream come true to see him land a presenting role on the restyled \"Top Gear\". Floppy-haired James May is one of television's true English gentlemen - well spoken, witty and just a touch eccentric. The chemistry between these three men is comedy gold and I often watch with my jaw dropped in disbelief at just how good this show is.The famous races, where each presenter has to reach a certain far-off place using a variety of means, are truly gripping films for the series and raise the bar on what we now expect from a motoring television show. The recent \"Polar Special\" was an example of the imagination and budget that makes \"Top Gear\" such an original and watchable programme.Simply brilliant - 10 out of 10."
    },
    {
      "username": "riggo-73503",
      "userUrl": "https://www.imdb.com/user/ur64376466",
      "reviewLink": "https://www.imdb.com/review/rw7595774",
      "warningSpoilers": false,
      "date": "28 November 2021",
      "rate": "2",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Don't bother, try amazon instead",
      "content": "Flint off, Arris and Puddy are just unwatchable oafs with no presenting talent at all This program has took off and soared with Clarkson, May and Hammond. Figures don't lie.It's gone from Matt Le Plonker to pure crass whipet and pigeon racing dialogue that subtitles might help you understand."
    },
    {
      "username": "tocanepauli",
      "userUrl": "https://www.imdb.com/user/ur28431397",
      "reviewLink": "https://www.imdb.com/review/rw6683811",
      "warningSpoilers": false,
      "date": "11 March 2021",
      "rate": "1",
      "helpful": "20 out of 24 found this helpful.",
      "title": "It's lost its mojo!",
      "content": "Just can't get into it anymore. 3 northern type blokes, all similar bland personalities, does not make for enthralling, amusing viewing. The Fun has gone and any jokes just seem \"flat\". It's now just another car show, in fact it's worse than a lot of other car shows."
    },
    {
      "username": "ultrachronic",
      "userUrl": "https://www.imdb.com/user/ur3063090",
      "reviewLink": "https://www.imdb.com/review/rw0570504",
      "warningSpoilers": false,
      "date": "27 June 2004",
      "rate": "",
      "helpful": "104 out of 118 found this helpful.",
      "title": "Best Car programme ever!",
      "content": "If you like cars, then this programme is just simply amazing. Unlike most programmes that are in this genre, the programme has survived a beyond 20 years at the top, and not many programmes come close. 5th Gear on five does come close, but it just doesn't have the heart or the dedication that Top Gear does.While the people on 5th Gear only talk about cars, the Top Gear crew talk about everything that is to do with cars, and not just the cars themselves. For example, they have \"Star in a Reasonably Priced Car\" where a celebrity goes round their track to see how fast they are. And once, they decided to test the Toyota Pickup's claim of being the \"the toughest car on the road\" by basically ramming it into stuff, and putting it on a building that got demolished etc. and it still actually run. They also once tested if you can run your diesel car off of Vegetable Oil (you can, although your exhaust smells like a bag of chips).Overall, this programme's great and a show you must fit into your weekly schedule, gets 10/10"
    },
    {
      "username": "AT-AT",
      "userUrl": "https://www.imdb.com/user/ur6280254",
      "reviewLink": "https://www.imdb.com/review/rw1520505",
      "warningSpoilers": false,
      "date": "13 November 2006",
      "rate": "",
      "helpful": "28 out of 31 found this helpful.",
      "title": "I'm not really sure why I'm writing this....",
      "content": "...because I'm not really that interested in cars. And I haven't the foggiest when this is showing, but when I accidentally zap by it, you can be quite sure I am staying on the channel. It appears to me, as a 'non car enthusiast', that many of the reviews are opinionated and not very relevant to the average viewer (as are some of the cars they test for us) but it's all done with charisma and that dry British humor. That is a good thing by the way ;) I guess the reason I'm writing this, is to show that even though you don't feel affectionate about cars, you can still easily enjoy this program. It's just me saying; 'good job BBC'"
    },
    {
      "username": "kozinskimaciej",
      "userUrl": "https://www.imdb.com/user/ur66561093",
      "reviewLink": "https://www.imdb.com/review/rw3552805",
      "warningSpoilers": false,
      "date": "29 September 2016",
      "rate": "10",
      "helpful": "18 out of 20 found this helpful.",
      "title": "Skip everything from 2016 forward",
      "content": "Top Gear is classic.Top Gear is best car / vehicle show ever made and it is a diamond.Top Gear is funny, interesting and packs a punch of information about cars.Well it was until 2016 came along and they changed the cast.Top Gear 2016 is very bad for newcomers. We all got used to the Clarkson, the small guy and the old guy. Old Top Gear had soul and all around was just a pleasure to watch. The new show is just like a copycat you see in other countries that try to make their own show with similar people but they fail and will fail always.R.I.P TOP GEAR 2015"
    },
    {
      "username": "darrylzero",
      "userUrl": "https://www.imdb.com/user/ur0816483",
      "reviewLink": "https://www.imdb.com/review/rw1120561",
      "warningSpoilers": false,
      "date": "6 July 2005",
      "rate": "",
      "helpful": "230 out of 248 found this helpful.",
      "title": "Hands down the greatest show about cars in the world.",
      "content": "Top Gear is, without question, the single greatest show about cars on TV. What sets Top Gear apart is the attitude the presenters have. Other shows tend focus on reviewing all of the various technical details and specifications of the particular car they review... They'll give you more information yes, but they do so in a cold and clinical manner. That comes off as being a bit, well, German doesn't it? Top Gear on the other hand, refuses to take itself seriously, which is what makes it so great. Sure, Top Gear will talk about how many newton meters of torque the Mercedes AMG CLS65 has and how that makes it the most powerful production car in the world, but how will they convey that? By showing you just how many men it requires to beat it in a tug of war contest. They'll try to explain why the Cadillac Escalade, arguably one of the worst cars you can buy, is one of the coolest. They'll see how many motorcycles you can jump with a bus. Yes, you read that the right way 'round: How many parked motorcycles you can jump over while driving a bus.But Top Gear is more than just goofing around in cars. It's witty, it's funny, and it makes you feel like one of the guys. The three presenters all poke fun at one another, at cars, at themselves, and all the while you feel like you are right there in the studio hanging out with them. Oh yeah, and you don't even have to like cars to like the show. There's something in it for everyone. For sheer car freaks, the filmed review segments of the cars have seriously high production value- You'd think you were watching a $150 million dollar film directed by Michael Bay. The are just that slick. The music selection used in the filmed segments is also top notch, with some of the coolest cuts from both then and now. The news segment, where the presenters sit down to discuss what's new in the world of cars, traffic laws, or motoring in general is riotously funny. You may not know who the Chief Constable of Wales or the British Minister of Transporation are, but trust me- You don't need to in order to laugh at them. Then there's the \"Star in a Reasonably Priced Car\" segment, where each week a guest celebrity will come on to do an interview and then race around the Top Gear test track in a budget priced sedan to see how they compare to other famous celebrities who have done the same. And for the girls that tune in? Well, there's co-host Richard Hammond.It is the presenters (hosts) that make the show though. You'll love to hate Jeremy Clarkson, possibly the worlds most opinionated and boastful man. James May, in sharp contrast, is almost a stereotype of an English gentleman. Reserved, witty, and refusing to run on television, May is cursed with quite possibly the best narrative style and voice I've ever heard. Bringing up the rear is Richard Hammond, the youngest, shortest, and most enthusiastic of the lot. Women will love him, because he's also the cutest.I'm not even going to mention their tamed racing driver who tests all of the high powered cars on the same track to see how they compare to one another, a mysterious creature dressed in white that is only known as \"The Stig\". Well, apart from that mention of The Stig. I won't do it any more.But please, please please, make sure you watch the full, unedited, hour-long version of Top Gear, which in some markets is known as \"Top Gear Xtra\". There is a trimmed down 30 minute version of the show which omits the news, the celebrities, and trims the filmed reviews for time. It's still good, but nowhere near as brilliant. And avoid the horribly edited and mangled US version of the show. Arguably the best Car show on in the states, it is an affront to the glory that is the raw, hour long series that is broadcast in the UK."
    },
    {
      "username": "petkovtihomir",
      "userUrl": "https://www.imdb.com/user/ur36738200",
      "reviewLink": "https://www.imdb.com/review/rw4084066",
      "warningSpoilers": false,
      "date": "7 March 2018",
      "rate": "1",
      "helpful": "57 out of 60 found this helpful.",
      "title": "Beginnnig of the end",
      "content": "After Jeremy, Hammond and May left (2015) Top Gear is a total disaster. None of the new hosts has any charisma or sense of humor. Does this review contain spoilers?! NO! No one expected something good to happen."
    },
    {
      "username": "cassio-15308",
      "userUrl": "https://www.imdb.com/user/ur62726889",
      "reviewLink": "https://www.imdb.com/review/rw6421561",
      "warningSpoilers": false,
      "date": "29 December 2020",
      "rate": "1",
      "helpful": "16 out of 17 found this helpful.",
      "title": "New Top Gear 1/10 old Top Gear 10/10",
      "content": "The new members do not have the charisma of the old members. They should change the name for the notes to be fair, they would certainly be notes far from each other."
    },
    {
      "username": "pidstr",
      "userUrl": "https://www.imdb.com/user/ur20242830",
      "reviewLink": "https://www.imdb.com/review/rw4997158",
      "warningSpoilers": false,
      "date": "15 July 2019",
      "rate": "",
      "helpful": "10 out of 11 found this helpful.",
      "title": "BBC Slowly killing the Golden Goose",
      "content": "When 'new' Top Gear first started (2002), Clarkson, Hammond and Dawe, it was rough. Once May joined in (about 10 episodes later), the team clicked and it was magic. The sort of magic like Abbott & Costello, Laurel & Hardie, or Hyneman & Savage,.. they just worked well together. After the punch on, the single season with Evans was woeful, and everyone knew it. LeBlanc, Harris and Reid was a relief, looking like TG was back on track (and back to the proper track,..) 2019's effort (season 27) is a shocker. If the BBC wants to keep the show, and it's ratings, they need to ditch the two latest additions, bring Reid back to the main show, and maybe go chase someone like Vicki, Jodie Kidd, or even Jay Kay, or take a risk and grab another american who loves cars, drives, and comes up good on camera - Ms Patrick's not racing anymore,... As things stand, Season 27 is best viewed as an episode of 'Chris Harris on Cars', for each of the review peices, hidden inside rubbish segments by Englishmen who don't speak English in any understandable manner."
    },
    {
      "username": "rhkloida-686-200201",
      "userUrl": "https://www.imdb.com/user/ur22988262",
      "reviewLink": "https://www.imdb.com/review/rw5472945",
      "warningSpoilers": false,
      "date": "10 February 2020",
      "rate": "2",
      "helpful": "13 out of 13 found this helpful.",
      "title": "Who hired the new Hosts?",
      "content": "This was one of my favorite shows of all time. The new hosts have one person with a good personality, and the other two are some of the least likeable people I've ever seen on television. I truly hope they cancel this before they ruin the legacy of an iconic show."
    },
    {
      "username": "jcmark-66725",
      "userUrl": "https://www.imdb.com/user/ur106562980",
      "reviewLink": "https://www.imdb.com/review/rw6557607",
      "warningSpoilers": false,
      "date": "2 February 2021",
      "rate": "2",
      "helpful": "17 out of 19 found this helpful.",
      "title": "Thank god for The Grand Tour",
      "content": "Chris Evans one season stint was clearly an indicator for how the show was going to regress heavily after the departure of the three most iconic Top Gear presenters. Jeremy Clarkson, who was a part of the original Top Gear program, and the additions of Richard Hammond and James May truly brought the show into the forefront of television. While vulgar and slightly out of touch, they made their foibles into a truly entertaining, informative show. It was one of the most innovative and constantly improving shows of its time.The show never caught a good stride after their departure. Harris is not bad, and I commend him much more for his journalistic work done before Top Gear. But Paddy and Freddie are just not working on the show. The show will never be able to reclaim its former international status. Thank god for The Grand Tour."
    },
    {
      "username": "michael-3288",
      "userUrl": "https://www.imdb.com/user/ur19765403",
      "reviewLink": "https://www.imdb.com/review/rw4572042",
      "warningSpoilers": false,
      "date": "10 January 2019",
      "rate": "1",
      "helpful": "22 out of 24 found this helpful.",
      "title": "Used to be fab, now rubbish",
      "content": "When Clarkson May and Hammond left, the producers had a great format and blank canvas to build on. I wont bore you but suffice to say instead of taking it an exciting new direction, the BBC have tried to keep it going by bringing in impersonators to take over their roles. I mean Chris Harris et al pretending to be Jeremy Clarkson and spouting Clarksonesque one liners starting \"It's a bit like...\" fused with forced banter makes for awkward viewing. The only person with any personality is Matt LeBlanc but he has no one to work with/bounce off. It's clear even the BBC know that Top Gear is now called THE GRAND TOUR!"
    },
    {
      "username": "J0SCH",
      "userUrl": "https://www.imdb.com/user/ur23458973",
      "reviewLink": "https://www.imdb.com/review/rw5493242",
      "warningSpoilers": false,
      "date": "18 February 2020",
      "rate": "1",
      "helpful": "12 out of 13 found this helpful.",
      "title": "Used to be incredible; Ruined by terrible new hosts",
      "content": "Chris Harris is brilliant and is the only true car guy -- he knows his stuff and his passion comes right through the screen... his back must be in tremendous pain from carrying this show by himself.The other two -- Paddy McGuiness and Freddie Flintoff -- are painful to watch. Their voices are annoying, they're sometimes hard to understand, and they're just not funny. There is no chemistry with these guys, no character buildup or development, and no reason to care. The old trio (Clarkson, May, Hammond) were friends -- and enemies -- and there was conflict and resolution. It's like Paddy and Freddie were just two generic bodies swapped in to host... which is likely what happened.In the old Top Gear, there were moments were you had to suspend some disbelief as to whether certain vehicles were truly built by the hosts or whether certain things happened on their adventures... but at least you felt they were somehow deeply involved... in the new Top Gear everything is unbelievable. Again, aside from Chris, they're not car experts or handy guys.It would be the exact same show if you had Chris driving/competing along with the camera guys or other Top Gear staffers.To be fair, the other hosts post Clarkson/May/Hammond and before this crew were a mixed bag... but a moot point since they are no longer hosting.Aside from the hosts, the writing/ideas feels a bit unoriginal but again, I'm wondering if that's partially or fully due to the current hosts. The production quality is still top notch with access to quality vehicles, beautiful cinematography, etc., but I don't think that's enough to save this show as that is not a point of differentiation anymore today with other shows on the air or online."
    },
    {
      "username": "mrpicky",
      "userUrl": "https://www.imdb.com/user/ur64299457",
      "reviewLink": "https://www.imdb.com/review/rw3544362",
      "warningSpoilers": false,
      "date": "15 September 2016",
      "rate": "3",
      "helpful": "17 out of 23 found this helpful.",
      "title": "New Top Gear",
      "content": "Kicking Clarkson out was the biggest mistake BBC could have made. I do not know is he a racist or just a giant douche, and I don't want to know! I want a good show, and boy did he provide. Top gear was the number one show in the world! It was all based on chemistry between this 3 guys. Their love for cars, their sense of humor. You can not replicate that or fake it! After guys are gone all they have left with is the celebrity in RPC. Are you kidding me? That was the weakest part of the old show, and now they are trying to build on it? Well Good Luck! I would not mind if they did totally new show and it was different but good. Instead we were presented with a very weak fake. You just feel fooled and angry! Clarkson got 4 times bigger budget from Amazon, and BBC got nothing now."
    },
    {
      "username": "Elkrider",
      "userUrl": "https://www.imdb.com/user/ur1671722",
      "reviewLink": "https://www.imdb.com/review/rw1118550",
      "warningSpoilers": false,
      "date": "4 July 2005",
      "rate": "",
      "helpful": "73 out of 89 found this helpful.",
      "title": "This is the real thing! 10/10",
      "content": "In short, Top Gear is the ultimate TV car program. If you like cars, it's the thing to watch - and if you don't, watch it anyway because you don't need to be a petrolhead or car buff to enjoy it. Pure, undiluted fun. Three insane Brits who are not shy of giving devastating test summaries for cars that didn't cut it. Not to mention the other stuff they think up, be that the 1500 quid used Porsche test or Caravan Conkers...the list is almost endless. While other TV car shows feature lots of boring junk, the Top Gear crew isn't afraid of anything. If needs be they put on helmets and crash test cars into a wall at 30 mph.Even my mother likes to watch it, and her interest in cars is limited to \"I like how that one looks\" at the very best.Eat your heart out, Richard Brunstrom! ;^> JK'05 aka Elkrider"
    },
    {
      "username": "Foobarman",
      "userUrl": "https://www.imdb.com/user/ur20411819",
      "reviewLink": "https://www.imdb.com/review/rw2049620",
      "warningSpoilers": true,
      "date": "8 April 2009",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "By far the best car show ever made!",
      "content": "\"Top Gear\" is definitely the best car show ever. It has been running since 1978 and is a show all about automobiles. This show is one of my favorite shows (not just about cars). It has the perfect mix of humor, stunts, races and general car information. This is what makes the show so good.This is the No 1. show for car fans. And even if you aren't a car fan - this show is still great to watch. You don't have to know everything about cars to be able to follow Top Gear. The way they talk isn't too technical and they will explain things that are complex.Each episode is usually made up of numerous different sections: they will test out a few cars, maybe have a few challenges, putting a guest star in a reasonably-priced car and interviewing the guest, and sometimes traveling to a different country. All of these different sections each episode make the show really interesting and not boring.I totally recommend this show to anyone who likes cars. Its a funny and interesting show."
    },
    {
      "username": "benwalshe",
      "userUrl": "https://www.imdb.com/user/ur20927928",
      "reviewLink": "https://www.imdb.com/review/rw2286711",
      "warningSpoilers": false,
      "date": "28 July 2010",
      "rate": "10",
      "helpful": "71 out of 77 found this helpful.",
      "title": "The best show on TV just keep getting better...",
      "content": "I've been watching this show for over 7 years now and I have to say it just keeps getting better. Many people spit and shout about the show not being about cars and more of an entertainment show than a car show. Well firstly let me say that this show began in 1978and went on for 12 seasons and the one complaint about that show was that it was boring and Clarkson picked up on this and changed the show (in my view) for the better.What is it about the show that makes it so outrageously good? Well lets discuss the characters. Jeremy Clarkson - the man you wish was your friend. A sarcastic, cheeky and rude individual who is hilariously funny. His ideas are genius and he is not afraid to speak his mind - that is what i like most about him. He does not and will not lie and say a car is good and/or bad on bias alone in which many people think he does. Take Alfa's for instance, he loves them, but he will not sugar coat what he knows about the electrics in the car you just have to actually listen to what he says. Richard Hammond - The quirky one. Tends to be more positive about things but my god he is funny. His outrageous ideas and creations like his Narrow boat are fantastic. He is critical when reviewing, yet entertaining when necessary. James May (Captain Slow) - You have to love him really. He is a more precise critic on cars but tend to take, Unfortunately for him, more boring cars like 4 door saloons but in recent episodes we have seen him show his true colours and passion for cars by taking the Veyron up to top speed twice. You have to remember that this is no the reason why this show is still a highly rated show 8 years on is not just because of these 3 personalities. When Clarkson was asked why is this show so great he gave FULL responsibility to the camera crews (who do absolutely stunning wok and should set a benchmark for cameramen around the world), the producers (who supposedly stay in work until 2am working) and all the back-room staff that organise everything.You have to remember that these people have a passion for cars. Anyone who loves cars and has that inner child inside which allows for that bit of fun would realise that this truly is one of the best shows on modern TV and always will be. It is also every 10 year old dream job and also mine!"
    }
  ],
  "errorMessage": ""
}