{
  "imDbId": "tt1628033",
  "title": "Top Gear",
  "fullTitle": "Top Gear (TV Series 2002– )",
  "type": "TVSeries",
  "year": "2002",
  "episodes": [
    {
      "id": "tt1317981",
      "seasonNumber": "12",
      "episodeNumber": "1",
      "title": "£5,000 Lorry Challenge",
      "image": "https://m.media-amazon.com/images/M/MV5BMjE1OTIxNTcwMV5BMl5BanBnXkFtZTgwNTM0NzczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "2 Nov. 2008",
      "plot": "Jeremy road tests the new Porsche 911 GT2 and compares it to the new Lamborghini Gallardo LP560-4. In an attempt to see how hard can it be to be a lorry driver, the presenters were given each 5000 pounds and go out and buy a lorry (big rigs that transport containers) and then they will be given a number of challenges.",
      "imDbRating": "8.3",
      "imDbRatingCount": "280"
    },
    {
      "id": "tt1321094",
      "seasonNumber": "12",
      "episodeNumber": "2",
      "title": "Muscle Car Challenge",
      "image": "https://m.media-amazon.com/images/M/MV5BMTY5MDA1ODIwMF5BMl5BanBnXkFtZTgwNTAxODczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "9 Nov. 2008",
      "plot": "Jeremy road tests the new Fiat 500 Abarth. The boys went to the U.S to test a new generation of muscle cars while they went on an epic journey from San Fransisco to the Bonneville Salt Flats in Utah. In the road trip, James drive the new Cadillac CTS-V, Jeremy drives the new Chevrolet Corvette ZR1 and Richard drives the new Dodge Challenger.",
      "imDbRating": "8.3",
      "imDbRatingCount": "278"
    },
    {
      "id": "tt1326690",
      "seasonNumber": "12",
      "episodeNumber": "3",
      "title": "Tuning Challenge - Finnish Folk Racing - Corvette V-8 Engine Blender-Made Smoothie",
      "image": "https://m.media-amazon.com/images/M/MV5BNzI1MDIwNTg0OV5BMl5BanBnXkFtZTgwOTkxNTczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "16 Nov. 2008",
      "plot": "James goes to Finland to see why the Finns are more suited to motor sports. Richard tests the newest form of transport in Japan. The boys attempt to modify a second-hand car that can go around the Top Gear test track faster than a Mitsubishi Evo X.",
      "imDbRating": "8.1",
      "imDbRatingCount": "236"
    },
    {
      "id": "tt1331963",
      "seasonNumber": "12",
      "episodeNumber": "4",
      "title": "Economy Race From Basel To Blackpool Illuminations",
      "image": "https://m.media-amazon.com/images/M/MV5BMTg0NTU5MjI1OF5BMl5BanBnXkFtZTgwNzQ0MjgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "23 Nov. 2008",
      "plot": "James road tests the new Pagani Zonda F Roadster as he compares it to the Bugatti Veyron (The Top Gear had to wait two years before the Buggati Veyron finally comes to the Top Gear Test Track. The boys are having a fuel economy race from Switzerland to Blackpool England because each of their cars must make it to Blackpool by using only one tank of fuel.",
      "imDbRating": "8.5",
      "imDbRatingCount": "268"
    },
    {
      "id": "tt1331964",
      "seasonNumber": "12",
      "episodeNumber": "5",
      "title": "Portofino To Saint-Tropez Race - Powerboat Vs. Ferrari Daytona - Best Bus For British City Streets",
      "image": "https://m.media-amazon.com/images/M/MV5BNzM4MTA0NTE3MV5BMl5BanBnXkFtZTgwNjQ0MjgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "30 Nov. 2008",
      "plot": "To celebrate the 40th anniversary of the iconic car for jet-setters on the Riviera, the Ferrari Daytona, Richard drives one in a race against James in a multi-million pound powerboat from Portofino, Italy to St. Tropez, France. Jeremy compares the new BMW M3 saloon to the Lexus IS-F. Richard and some British Touring Car Championship drivers race different types of buses in a showdown around a rally-cross circuit. Grand Designs host Kevin McCloud is the Star In A Reasonably Priced Car.",
      "imDbRating": "7.8",
      "imDbRatingCount": "230"
    },
    {
      "id": "tt1341101",
      "seasonNumber": "12",
      "episodeNumber": "6",
      "title": "Did The Communists Make A Good Car? - Ford Fiesta With The Royal Marines",
      "image": "https://m.media-amazon.com/images/M/MV5BYzg2MTdlNWQtZmU1Zi00YjA0LTg0NGQtMmMwZjJiNjVjYzIwXkEyXkFqcGdeQXVyOTU5Njc3ODI@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "7 Dec. 2008",
      "plot": "Richard road tests two new cars, the Caterham R500 and the Veritas RS3. Jeremy and James find out to see whether cars that are made from Communist Countries are that good. Jeremy road tests the new Ford Fiesta extensively.",
      "imDbRating": "8.4",
      "imDbRatingCount": "254"
    },
    {
      "id": "tt1341102",
      "seasonNumber": "12",
      "episodeNumber": "7",
      "title": "50 Years Of British Touring Car Racing - TG Stuntman Takes On Fifth Gear's Caravan Jump Record - Top Gear Awards 2008",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQyMDE3OTYwNl5BMl5BanBnXkFtZTgwMDYyNjczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "14 Dec. 2008",
      "plot": "Richard celebrates 50 years of British Touring Car Championship. Jeremy road test a brand new electric sports car, The Tesla. James went to Los Angeles to road test the new Honda FCX Clarity. Top Gear Awards 2008.",
      "imDbRating": "8.0",
      "imDbRatingCount": "227"
    },
    {
      "id": "tt1345357",
      "seasonNumber": "12",
      "episodeNumber": "8",
      "title": "Vietnam Special",
      "image": "https://m.media-amazon.com/images/M/MV5BMjM3Nzg0MjM0MV5BMl5BanBnXkFtZTgwMTEzMzczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "28 Dec. 2008",
      "plot": "The boys headed to Vietnam for epic road trip across the country. Each of them were given 15 million dong (about US$ 1000) to spend on buying some wheels and must make it to the north of Vietnam.",
      "imDbRating": "9.4",
      "imDbRatingCount": "1024"
    }
  ],
  "errorMessage": ""
}