{
  "imDbId": "tt1628033",
  "title": "Top Gear",
  "fullTitle": "Top Gear (TV Series 2002– )",
  "type": "TVSeries",
  "year": "2002",
  "episodes": [
    {
      "id": "tt3004026",
      "seasonNumber": "20",
      "episodeNumber": "1",
      "title": "AC45 Racing Yacht Vs Toyota Auris - Introduction Of The New Reasonably Priced Car: Vauxhall Astra",
      "image": "https://m.media-amazon.com/images/M/MV5BMjE3MTY3MzIyMl5BMl5BanBnXkFtZTgwNDE2MzgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "8 Jul. 2013",
      "plot": "Jeremy Clarkson and James May race a car against a high-performance yacht in a battle up the coastline of New Zealand. Meanwhile, Richard Hammond attempts to find a hero from a trio of newcomers, the Renaultsport Clio 200, Peugeot 208 GTI and Ford Fiesta ST, and top stars including Warwick Davis, Charles Dance and Joss Stone assemble at the track to welcome a brand new Reasonably Priced Car.",
      "imDbRating": "8.3",
      "imDbRatingCount": "399"
    },
    {
      "id": "tt3036276",
      "seasonNumber": "20",
      "episodeNumber": "2",
      "title": "Search For The World's Best Taxi - Tribute To BBC Television Centre",
      "image": "https://m.media-amazon.com/images/M/MV5BMTY5MjAzNTkzNV5BMl5BanBnXkFtZTgwOTY0ODczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "15 Jul. 2013",
      "plot": "Jeremy Clarkson tests the 730 horsepower Ferrari F12 in the wide open spaces of Scotland, Richard Hammond searches for the world's best taxi, and James May pays tribute to BBC Television Centre using a motorcyclist and a pair of Parkour runners. Meanwhile, the extraordinary BAC Mono is put to the test on the track and movie director Ron Howard is the star in the brand new Reasonably Priced Car.",
      "imDbRating": "8.2",
      "imDbRatingCount": "334"
    },
    {
      "id": "tt3045672",
      "seasonNumber": "20",
      "episodeNumber": "3",
      "title": "Spanish Road Trip In Budget Convertibles",
      "image": "https://m.media-amazon.com/images/M/MV5BNTMyMDYxMTI3OF5BMl5BanBnXkFtZTgwNDE1OTczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "22 Jul. 2013",
      "plot": "Jeremy Clarkson, Richard Hammond and James May are on a mission to take their strong British pounds to the cash strapped people of Spain. They have chosen some discreet, sensitive cars for the job with Clarkson in a McLaren 12C Spider, Hammond driving a Ferrari 458 Spider and May in an Audi R8 V10 Spyder. Sherlock and Star Trek actor Benedict Cumberbatch is the star in the Reasonably Priced Car.",
      "imDbRating": "8.6",
      "imDbRatingCount": "389"
    },
    {
      "id": "tt3069944",
      "seasonNumber": "20",
      "episodeNumber": "4",
      "title": "Building The Ford Transit Hovervan",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA2MjEzNjAwMV5BMl5BanBnXkFtZTgwNjQwNzczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "29 Jul. 2013",
      "plot": "Jeremy Clarkson, Richard Hammond and James May bring relief to flood-stricken areas of Britain by building a car that can turn into a hovercraft. Also in this show, Jeremy is on the track in the insane Mercedes SLS Black and the 739 horsepower SLS Electric while Hollywood star Hugh Jackman is the star in the Reasonably Priced Car.",
      "imDbRating": "8.7",
      "imDbRatingCount": "367"
    },
    {
      "id": "tt3087458",
      "seasonNumber": "20",
      "episodeNumber": "5",
      "title": "Best Crossovers For Caravanners",
      "image": "https://m.media-amazon.com/images/M/MV5BMTgxOTY0NzE5M15BMl5BanBnXkFtZTgwOTc5NDczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "5 Aug. 2013",
      "plot": "Jeremy Clarkson and James May investigate a type of tall hatchback called a 'crossover'. Since these cars are designed for caravanners, the pair pick examples from Mazda and Volkswagen and spend a couple of days living in them. Meanwhile, Richard Hammond is in Italy driving a Â£2m, 570 horsepower Sesto Elemento. Plus, Aerosmith legend Steven Tyler is the rock star in the Reasonably Priced Car.",
      "imDbRating": "8.6",
      "imDbRatingCount": "348"
    },
    {
      "id": "tt3100324",
      "seasonNumber": "20",
      "episodeNumber": "6",
      "title": "Tribute To British Automobile Manufacturing",
      "image": "https://m.media-amazon.com/images/M/MV5BODQ5NTA3Njc2M15BMl5BanBnXkFtZTgwMzgyNDczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "12 Aug. 2013",
      "plot": "Jeremy Clarkson drives the new Jaguar F-type sports car on some of Britain's finest roads, James May takes the New Bus for London for a nice day out in the country, and Richard Hammond tests the new Range Rover Sport. Inspired by these machines, the presenters have an epic celebration of all that is great about Britain's motor industry, culminating in a grand finale in front of Buckingham Palace.",
      "imDbRating": "8.3",
      "imDbRatingCount": "375"
    }
  ],
  "errorMessage": ""
}