{
  "imDbId": "tt1628033",
  "title": "Top Gear",
  "fullTitle": "Top Gear (TV Series 2002– )",
  "type": "TVSeries",
  "year": "2002",
  "episodes": [
    {
      "id": "tt2658640",
      "seasonNumber": "19",
      "episodeNumber": "1",
      "title": "Taking The Bentley Continental GT Speed To A Welsh Rally Stage - Building A Car Smaller Than A Peel P50: Clarkson's P45",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc4NDM3NzQ1OV5BMl5BanBnXkFtZTgwNDI2MDgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "4 Feb. 2013",
      "plot": "In this first episode, Jeremy attempts to build a car that's even smaller than the famous Peel P50 and then tests it out on the streets of London. Meanwhile, James is testing the latest Bentley Continental GT Speed by taking it on a rally stage. As if that wasn't enough, Homeland star Damian Lewis is the star in the Reasonably Priced Car.",
      "imDbRating": "8.5",
      "imDbRatingCount": "412"
    },
    {
      "id": "tt2673814",
      "seasonNumber": "19",
      "episodeNumber": "2",
      "title": "Super Car Road Trip From Las Vegas, Nevada To Calexico, California",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU1MzQyNjYwNF5BMl5BanBnXkFtZTgwNTA2MDgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "11 Feb. 2013",
      "plot": "The brand new season of the world's most popular car show continues with an epic road trip across the western side of the United States in three front-engined supercars. Along the way, the three presenters take in racing circuits, airborne attacks and a race against the police. Meanwhile, back in the studio legendary Fleetwood Mac drummer Mick Fleetwood is the star in the Reasonably Priced Car.",
      "imDbRating": "8.5",
      "imDbRatingCount": "392"
    },
    {
      "id": "tt2700584",
      "seasonNumber": "19",
      "episodeNumber": "3",
      "title": "Shelby Mustang GT500 Vs The Pan-European Rail Network Epic Race From Wembley To The San Siro Stadium In Milan",
      "image": "https://m.media-amazon.com/images/M/MV5BMTg2NTE2NTEwMF5BMl5BanBnXkFtZTgwMzc5NzczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "18 Feb. 2013",
      "plot": "Jeremy Clarkson, Richard Hammond and James May engage in an epic race from Wembley to the San Siro stadium in Milan. Hamstrung by a rule about price, Clarkson maximises his bang-for-buck with a $55,000, 662 horsepower Shelby Mustang GT500 while Hammond and May pin their hopes to the ever-improving pan-European rail network. Car-loving singer Amy MacDonald is the star in the Reasonably Priced Car.",
      "imDbRating": "8.2",
      "imDbRatingCount": "360"
    },
    {
      "id": "tt2715432",
      "seasonNumber": "19",
      "episodeNumber": "4",
      "title": "Rugby Match With Kia Cee'ds At Twickenham",
      "image": "https://m.media-amazon.com/images/M/MV5BMjM0NjkyMDkwMV5BMl5BanBnXkFtZTgwOTE5NjczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "25 Feb. 2013",
      "plot": "Jeremy Clarkson subjects the new Kia Cee'd to a road test involving eels, curry, a rock legend, an American cop, and a rather unusual game of rugby involving James May. Meanwhile, Richard Hammond is in Mexico for a road test of the Mastretta sports car, a trio of hot hatchbacks tear it up on the test track and another top celebrity takes their turn as the star in the Reasonably Priced Car.",
      "imDbRating": "8.1",
      "imDbRatingCount": "349"
    },
    {
      "id": "tt2741132",
      "seasonNumber": "19",
      "episodeNumber": "5",
      "title": "Range Rover Vs An Autonomous Military Machine - Designing A Vehicle For The Elderly: Rover James",
      "image": "https://m.media-amazon.com/images/M/MV5BMjIyMjc2NTk5Ml5BMl5BanBnXkFtZTgwNDExMzgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "4 Mar. 2013",
      "plot": "Contains language some may find offensive. Jeremy Clarkson and Richard Hammond tackle the twin problems of an ageing population and the increasing complexity of modern cars. Their solution is to design a vehicle exclusively for the elderly. Meanwhile, James May shifts to Nevada for the ultimate challenge against an autonomous military machine. Plus actor James McAvoy is the star in the Reasonably Priced Car.",
      "imDbRating": "8.4",
      "imDbRatingCount": "340"
    },
    {
      "id": "tt2741136",
      "seasonNumber": "19",
      "episodeNumber": "6",
      "title": "Africa Special, Part 1",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA3NjQwNjI3M15BMl5BanBnXkFtZTgwNDIxMzgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "11 Mar. 2013",
      "plot": "In the first of a two-part Top Gear special, Jeremy Clarkson, Richard Hammond and James May are in Africa with a simple mission - to find the definitive source of the Nile. Over the years many explorers claim to have already done just that, but the Top Gear trio believe that they can do better by traveling using only grit, ingenuity and three ageing estate cars.",
      "imDbRating": "9.1",
      "imDbRatingCount": "870"
    },
    {
      "id": "tt2741140",
      "seasonNumber": "19",
      "episodeNumber": "7",
      "title": "Africa Special, Part 2",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU5NDA5MjMzNV5BMl5BanBnXkFtZTgwNDMxMzgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "18 Mar. 2013",
      "plot": "In the second part of the Top Gear special, Jeremy Clarkson, Richard Hammond and James May continue their epic African odyssey. Having survived insane traffic, lethal mud slides and some distinctly dubious map reading, the trio and their ailing estate cars reach the climax of their quest to find the definitive source of the Nile.",
      "imDbRating": "9.2",
      "imDbRatingCount": "768"
    },
    {
      "id": "tt2780442",
      "seasonNumber": "19",
      "episodeNumber": "8",
      "title": "Best of Top Gear 1",
      "image": "https://imdb-api.com/images/original/nopicture.jpg",
      "year": "2013",
      "released": "17 Mar. 2013",
      "plot": "Know what this is about? Be the first one to add a plot.",
      "imDbRating": "7.3",
      "imDbRatingCount": "133"
    },
    {
      "id": "tt2806582",
      "seasonNumber": "19",
      "episodeNumber": "9",
      "title": "Best of Top Gear 2",
      "image": "https://imdb-api.com/images/original/nopicture.jpg",
      "year": "2013",
      "released": "24 Mar. 2013",
      "plot": "Know what this is about? Be the first one to add a plot.",
      "imDbRating": "7.2",
      "imDbRatingCount": "123"
    }
  ],
  "errorMessage": ""
}