{
  "imDbId": "tt1628033",
  "title": "Top Gear",
  "fullTitle": "Top Gear (TV Series 2002– )",
  "type": "TVSeries",
  "year": "2002",
  "episodes": [
    {
      "id": "tt0729679",
      "seasonNumber": "3",
      "episodeNumber": "1",
      "title": "Celebrating 40 Years of the Porsche 911",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ4MDYzMzk4NV5BMl5BanBnXkFtZTgwNDI4MTYzMzE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "26 Oct. 2003",
      "plot": "Jeremy goes to Detroit to review the Ford GT. Back in the studio, the team take a look at the Ford Visos concept car. Jeremy takes the Volkswagen Lupo turbo diesel on a lap of the M25 in convoy with a petrol-powered Lupo. EastEnders tough guy Martin Kemp is the Star In A Reasonably Priced Car. The Stig is set a challenge to reach 100mph (160km/h) in a Jaguar powered by nitrous injection on board the aircraft carrier HMS Invincible, but he goes too quick and flies off the deck.",
      "imDbRating": "7.7",
      "imDbRatingCount": "236"
    },
    {
      "id": "tt0729680",
      "seasonNumber": "3",
      "episodeNumber": "2",
      "title": "Can a Volvo Estate Jump Four Caravans?",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQzOTAyNjI2N15BMl5BanBnXkFtZTgwNzc5NjkwMzE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "2 Nov. 2003",
      "plot": "Jeremy begins the show by announcing the death of The Stig after the HMS Invincible stunt in the previous episode, then he introduces a brand new Stig, whose racing suit is white, not black. Richard reviews the BMW M3 CSL, and it becomes the first car that \"Fresh Stig\" drives around the test track, while the team look at its pedigree, the original M1 and M3 and the second-generation M5, on a visit to the Isle of Man. Stephen Fry is the Star In A Reasonably Priced Car. A Volvo 240 attempts to jump five caravans side by side.",
      "imDbRating": "7.9",
      "imDbRatingCount": "235"
    },
    {
      "id": "tt0729681",
      "seasonNumber": "3",
      "episodeNumber": "3",
      "title": "How to Escape a Sinking Car",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ3MjY1NTYyNl5BMl5BanBnXkFtZTgwNjIwODczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "9 Nov. 2003",
      "plot": "Jeremy takes the Bentley Continental GT on a grand tour. James drives around an estate in an estate when he finds out why the Subaru Legacy Outback is a perfect aristocrat's car. Jeremy swans around in a Saab 95. Comedian Rob Brydon has his best friend Steve Coogan in his sights when he is the Star In A Reasonably Priced Car.",
      "imDbRating": "7.7",
      "imDbRatingCount": "229"
    },
    {
      "id": "tt0729682",
      "seasonNumber": "3",
      "episodeNumber": "4",
      "title": "Lamborghini 40th Anniversary Celebration",
      "image": "https://m.media-amazon.com/images/M/MV5BNzM1Njg0NzgwNV5BMl5BanBnXkFtZTgwNDM4MTYzMzE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "16 Nov. 2003",
      "plot": "To celebrate the 40th anniversary of Lamborghini, the team look at some of the company's most memorable cars. Richard drives the car that started it all, the Miura, which first hit British roads in 1967, and finds out how much improved the 1971 SV version is when he goes for a ride in one driven by its owner, Jay Kay. James finds out that his childhood dream car, the Countach, has a nightmare side to it, and Jeremy reviews their latest vehicle, the Gallardo. Richard compares BMW's official Works Cooper S with third-party tuned models from Hartge, Digi-tec and BBR. ...",
      "imDbRating": "7.8",
      "imDbRatingCount": "230"
    },
    {
      "id": "tt0729683",
      "seasonNumber": "3",
      "episodeNumber": "5",
      "title": "Is the Toyota Hilux Really Indestructible?",
      "image": "https://m.media-amazon.com/images/M/MV5BMmVkYTI5NzItNjI5YS00YzA2LWI5N2UtMmU4NjlhMzI5MzY0XkEyXkFqcGdeQXVyMjQ3MjU3NTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "23 Nov. 2003",
      "plot": "Jeremy performs a number of tests to find out how tough a Toyota Hilux really is, and reviews the Mazda RX-8, which The Stig takes for a lap of the test track. James is astonished by the new Fiat Panda. Simon Cowell is the Star In A Reasonably Priced Car.",
      "imDbRating": "8.2",
      "imDbRatingCount": "274"
    },
    {
      "id": "tt0729684",
      "seasonNumber": "3",
      "episodeNumber": "6",
      "title": "Is the Toyota Hilux Really indestructible? Part 2",
      "image": "https://m.media-amazon.com/images/M/MV5BODE4NGI2NjYtZWU0Zi00ZTU2LWI0NWItYjk1ZDZjYTBmZGNhXkEyXkFqcGdeQXVyMjQ3MjU3NTU@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "7 Dec. 2003",
      "plot": "James comes up with another test for the battered but still working Toyota Hilux, and reviews the 1970's Aston Martin V8 Vantage. Jeremy cruises around town in the successor to the Citroën Saxo, the C2. Richard looks at a couple of French convertibles, the Renault Megane CC and the Peugeot 307 CC. Comedian Sanjeev Bhaskar is the Star In A Reasonably Priced Car.",
      "imDbRating": "8.0",
      "imDbRatingCount": "244"
    },
    {
      "id": "tt0729685",
      "seasonNumber": "3",
      "episodeNumber": "7",
      "title": "The Best British Car of All Time",
      "image": "https://m.media-amazon.com/images/M/MV5BMTA0Njc1MjE5MjdeQTJeQWpwZ15BbWU4MDAzNjY5MDMx._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "14 Dec. 2003",
      "plot": "Jeremy tests the off-road abilities of the Porsche Cayenne turbo. Richard goes to South Africa to review the Mercedes McLaren SLR. Jeremy tests the MG XPower SV, and bumps his head on its interior. Three professors are challenged to find out who can do the best burn-out. In a search for the best British car, Jeremy drives a Noble M12, Richard a Morgan Plus 8, and James a Rover 75 around the test track. Britain takes on Germany in a battle of sports cars. Rory Bremner is the Star In A Reasonably Priced Car.",
      "imDbRating": "7.7",
      "imDbRatingCount": "224"
    },
    {
      "id": "tt0729686",
      "seasonNumber": "3",
      "episodeNumber": "8",
      "title": "Generation Battle - Mercedes SL vs. Mercedes SL",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ0MTYyODU5Nl5BMl5BanBnXkFtZTgwOTc1NjkwMzE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "21 Dec. 2003",
      "plot": "Top Gear finds Jeremy Clarkson comparing the current Mercedes SL with the same model from 1972. Richard Hammond sees how much car you can get for under $16,000 when he tries out the latest Nissan Micra. Clarkson compares the modern day Audi TT V6 to Ford's classic Cabri V6. And the Star in the Reasonably Priced Car is actor-comedian Johnny Vegas (The Libertine, Bleak House).",
      "imDbRating": "7.7",
      "imDbRatingCount": "217"
    },
    {
      "id": "tt0729687",
      "seasonNumber": "3",
      "episodeNumber": "9",
      "title": "Clarkson vs. the Chrysler Crossfire",
      "image": "https://m.media-amazon.com/images/M/MV5BMTg4OTQ0NTE3M15BMl5BanBnXkFtZTgwNDIwODczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2003",
      "released": "28 Dec. 2003",
      "plot": "Jeremy road tests the Chrysler Crossfire. Richard tests the Brabus Smart Roadster. Top Gear Awards 2003. James goes to Birmingham in a Jaguar XJ6. Richard drives an improved version of the Honda NSX Type-R.",
      "imDbRating": "7.7",
      "imDbRatingCount": "224"
    }
  ],
  "errorMessage": ""
}