{
  "imDbId": "tt1628033",
  "title": "Top Gear",
  "fullTitle": "Top Gear (TV Series 2002– )",
  "type": "TVSeries",
  "year": "2002",
  "episodes": [
    {
      "id": "tt0729688",
      "seasonNumber": "4",
      "episodeNumber": "1",
      "title": "Race to Monte Carlo - Aston Martin DB9 vs. Public Transport",
      "image": "https://m.media-amazon.com/images/M/MV5BMTcwMzEwOTI1NF5BMl5BanBnXkFtZTgwMjIwODczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "27 Jul. 2009",
      "plot": "It's an epic race from England To Monte Carlo, France as Richard and James traveling on a train that goes at the speed of 200mph against Jeremy in an Aston Martin DB9. James road test the City Rover. Jeremy road test the Lotus Exige and challenges an Apache Helicopter to get a lock-on target on the Lotus as it races around the track.",
      "imDbRating": "8.3",
      "imDbRatingCount": "265"
    },
    {
      "id": "tt0729689",
      "seasonNumber": "4",
      "episodeNumber": "2",
      "title": "Hammond Tests the Cadillac Escalade and Puts a Nun in a Monster Truck",
      "image": "https://m.media-amazon.com/images/M/MV5BMjEzMjgzODIwM15BMl5BanBnXkFtZTgwMTIwODczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "28 Jul. 2009",
      "plot": "Jeremy tests the Alfa Romeo 166. Richard answers a question which is can a nun drive a monster truck. Richard tests the Cadillac Escalade. James tests the Ford FAB-1, the car that was featured in the new movie, \"Thunderbirds\". Jeremy road tests the new Mercedes-Benz SLR McLaren.",
      "imDbRating": "7.7",
      "imDbRatingCount": "229"
    },
    {
      "id": "tt0729690",
      "seasonNumber": "4",
      "episodeNumber": "3",
      "title": "£100 Car Challenge",
      "image": "https://m.media-amazon.com/images/M/MV5BMTY4NTkwNTQ1MF5BMl5BanBnXkFtZTgwMDIwODczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "29 Jul. 2009",
      "plot": "The boys are given 100 pounds each to buy cars that costs less than 100 pounds. Once they have purchase the car of their choice, they are given a number of challenges. Richard road test a muscle car that he want to buy, the 1968 Dodge Charger 440 R/T. Jeremy road tests 2 lightweight supercars, the Porsche 911 GT3 RS and the Ferrari 360 Challenge Stradale.",
      "imDbRating": "8.0",
      "imDbRatingCount": "244"
    },
    {
      "id": "tt0729691",
      "seasonNumber": "4",
      "episodeNumber": "4",
      "title": "Bullseye! The Boys Play Car Darts",
      "image": "https://m.media-amazon.com/images/M/MV5BNzI1MTY2NDkyOV5BMl5BanBnXkFtZTgwNDU1NjkwMzE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "30 Jul. 2009",
      "plot": "Jeremy goes on a fuel economy run by driving an Audi A8 (with a V8 diesel engine) from London to Edinburgh and back in one single fuel tank. James races a racing pigeon in the new Ford SportKa. A 2nd shootout on the test track between the new Mitsubishi Evo VIII FQ-320 and the Subaru Impreza WRX STi WR-1. James and Richard have a game of 'car darts'. Jeremy road tests the new Porsche Carrera GT.",
      "imDbRating": "8.2",
      "imDbRatingCount": "232"
    },
    {
      "id": "tt0729692",
      "seasonNumber": "4",
      "episodeNumber": "5",
      "title": "Sport Coupes Shootout - 911 vs. 6 Series vs. XKR",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc0ODg3MjMxMV5BMl5BanBnXkFtZTgwODc1NjkwMzE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "31 Jul. 2009",
      "plot": "Richard road tests 3 family hatchbacks, the Vauxhall Astra, Mazda 3 and the VW Golf. Jeremy tests the MG ZT260. Richards attempts to prove that it is safe to be in your car while being struck by lightning by using a VW Golf (with Richard in the car) while it was being struck by 10 000 volts of electricity. The boys test the new BMW 645Ci on Pendine Sands and compares it to the Porsche 911 Carrera 2 and the Jaguar XK-R",
      "imDbRating": "7.7",
      "imDbRatingCount": "216"
    },
    {
      "id": "tt0729693",
      "seasonNumber": "4",
      "episodeNumber": "6",
      "title": "Can You Run a Car on Poo?",
      "image": "https://m.media-amazon.com/images/M/MV5BMTgyNTYzNzcxNV5BMl5BanBnXkFtZTgwNDAwODczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "3 Aug. 2009",
      "plot": "Jeremy tests the Nissan Cube, one of the most popular cars in Japan. Richard tests the new Cadillac CTS. James tests the Jaguar XJS which is being updated and modernized (the original XJS was poorly built). Richard investigates whether you could run your car on poop (In detail: Running on LPG from biomass from humans or animals). Jeremy reviews the Renault Clio 182 on the test track.",
      "imDbRating": "7.6",
      "imDbRatingCount": "217"
    },
    {
      "id": "tt0729694",
      "seasonNumber": "4",
      "episodeNumber": "7",
      "title": "Hammond and May Try Mini-Cabbing",
      "image": "https://m.media-amazon.com/images/M/MV5BMTUyOTg3MDY4OF5BMl5BanBnXkFtZTgwMzAwODczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "4 Aug. 2009",
      "plot": "Jeremy road tests the powerful Mercedes-Benz CL65 AMG. The boys take the car to its paces by racing it against the Aston Martin DB9 and the Bentley Continental GT in a half-mile drag race. Richard and James test the Ford C-Max and the Renault Scenic by posing as minicab drivers. Jeremy tests a new car from Holland, the Spyker C8.",
      "imDbRating": "7.7",
      "imDbRatingCount": "220"
    },
    {
      "id": "tt0729695",
      "seasonNumber": "4",
      "episodeNumber": "8",
      "title": "Clarkson Drives His Dream Car - the Ford GT",
      "image": "https://m.media-amazon.com/images/M/MV5BMjE1MDU5OTQyMF5BMl5BanBnXkFtZTgwMjExNzkwMzE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "5 Aug. 2009",
      "plot": "Jeremy takes a \"look\" at the Toyota Prius. James tests the new Maserati Quattroporte. The boys gives a preview of the new Mercedes Benz CLS. Richard celebrates the death of the Rover V8 engine and giving it a proper send off by taking part a race in a Rover SD1 (fitted with the Rover V8 engine). To find out whether diesel has caught up with petrol, Jeremy and Richard are having a race around the test track with Jeremy in the new Skoda Fabia VRS which has a turbocharged diesel engine and Richard in the Mini Cooper which has a supercharged petrol engine. Jeremy tests ...",
      "imDbRating": "7.8",
      "imDbRatingCount": "220"
    },
    {
      "id": "tt0729696",
      "seasonNumber": "4",
      "episodeNumber": "9",
      "title": "Can You Parachute Into a Moving Car?",
      "image": "https://m.media-amazon.com/images/M/MV5BMjE0MjA5Mjk1M15BMl5BanBnXkFtZTgwOTY3NjkwMzE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "6 Aug. 2009",
      "plot": "Richard having a comparison of roadsters which features the Mercedes Benz SL600, the Mazda MX-5, Toyota MR2 and the Fiat Barchetta. In the news segment, the presenters discuss the 10-year transport plan which was introduced by Alistair Darling, who was the Transport Secretary. James attempts to see whether can you parachute into a moving car. James and Richard compare cabriolets on Lewis and Harris in Scotland (known for having the least number of convertibles being bought per capita) which includes the Mini Cooper Cabriolet, the Vauxhall Tigra, the Mercedes Benz SLK ...",
      "imDbRating": "7.7",
      "imDbRatingCount": "216"
    },
    {
      "id": "tt0729697",
      "seasonNumber": "4",
      "episodeNumber": "10",
      "title": "Clarkson Gets Wet in the X3",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU0NDIwOTY2MF5BMl5BanBnXkFtZTgwMTgyNzkwMzE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2009",
      "released": "7 Aug. 2009",
      "plot": "Richard reviews the Peugeot 407 by using it as pace car. James test the Volvo V50. Richard stages the Olympic Games by having a long jump event using cars. Jeremy tests the BMW X3. Richard reviews the Chevrolet Corvette.",
      "imDbRating": "7.7",
      "imDbRatingCount": "214"
    }
  ],
  "errorMessage": ""
}