{
  "imDbId": "tt1628033",
  "title": "Top Gear",
  "fullTitle": "Top Gear (TV Series 2002– )",
  "type": "TVSeries",
  "year": "2002",
  "episodes": [
    {
      "id": "tt0729718",
      "seasonNumber": "7",
      "episodeNumber": "1",
      "title": "Isle of Man Shootout - V8 Vantage vs. M6 vs. Carrera S",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU5NTUzNjUwNF5BMl5BanBnXkFtZTgwNzQwODczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "13 Nov. 2005",
      "plot": "Richard tests the new Ascari KZ1. The boys travel to the Isle Of Man to test the new Aston Martin V8 Vantage and compares it to the new BMW M6 and the Porsche 911 Carrera 2S.",
      "imDbRating": "7.9",
      "imDbRatingCount": "221"
    },
    {
      "id": "tt0729719",
      "seasonNumber": "7",
      "episodeNumber": "2",
      "title": "Hammond and May Race Life-Sized RC Cars",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU4MDM4NzQ5M15BMl5BanBnXkFtZTgwMDEwODczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "20 Nov. 2005",
      "plot": "Jeremy road tests the new Porsche Cayman. Richard explains the history of British racing green. James and Richard play with life-size radio-controlled cars that is based on real life cars. Jeremy tests the new Audi RS4 by races it to the top Verdon Gorge in France against a speed climber.",
      "imDbRating": "7.9",
      "imDbRatingCount": "218"
    },
    {
      "id": "tt0762541",
      "seasonNumber": "7",
      "episodeNumber": "3",
      "title": "Supercar Road Trip - Ford GT vs. Ferrari F430 vs. Pagani Zonda",
      "image": "https://m.media-amazon.com/images/M/MV5BNDk2NTU4OTk5OV5BMl5BanBnXkFtZTgwMzAxMzczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "27 Nov. 2005",
      "plot": "The boys are having a road trip to the famous Milau Viaduct bridge in France in supercars of their choice (Jeremy in his own Ford GT, Richard a Pagani Zonda and James in a Ferrari F430 Spyder). In the news segment, the boys announce their Emmy win for Best Non-scripted Entertainment category. Jeremy reviews the Ford Focus ST.",
      "imDbRating": "8.2",
      "imDbRatingCount": "242"
    },
    {
      "id": "tt0729720",
      "seasonNumber": "7",
      "episodeNumber": "4",
      "title": "Mid-Engine Italian Supercars for Under £10,000",
      "image": "https://m.media-amazon.com/images/M/MV5BNDg0NzkwNjU2OF5BMl5BanBnXkFtZTgwODMwODczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "4 Dec. 2005",
      "plot": "Richard tests the new Pagani Zonda F. In the news segment, the boys mourn the death of rally driver Richard Burns. The boys were given 10,000 pounds each and were told to buy a supercar for less than 10,000 pounds. The catch is that the supercars they bought must be mid-engine and Italian. The end result is Jeremy buying a Maserati Merak (which it claimed to be an SS version), Richard a Ferrari 308 GT4 and James a Lamborghini Urraco. James reviews the new Renault Clio by having a race through the streets of Lisbon in Portugal against a downhill mountain biker.",
      "imDbRating": "8.3",
      "imDbRatingCount": "242"
    },
    {
      "id": "tt0729721",
      "seasonNumber": "7",
      "episodeNumber": "5",
      "title": "Bugatti Veyron vs. Cessna 182 Airplane",
      "image": "https://m.media-amazon.com/images/M/MV5BMTk1NDg1MjE4MV5BMl5BanBnXkFtZTgwMjEwODczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "11 Dec. 2005",
      "plot": "Richard reviews the Marcos TSO GT2. James compares the new 4WD Porsche 911 Carrera 4 to the RWD Porsche 911 Carrera 2 by having the Stig doing a lap in both cars around the indoor exhibition rally track of World Rally Championship at the Millennium Stadium. The boys are having another epic race from Italy to England with Richard and James using a light aircraft (since James has a pilot license) against Jeremy in the Buggati Veyron",
      "imDbRating": "8.3",
      "imDbRatingCount": "244"
    },
    {
      "id": "tt0729722",
      "seasonNumber": "7",
      "episodeNumber": "6",
      "title": "Mazda MX-5 vs. Greyhound",
      "image": "https://m.media-amazon.com/images/M/MV5BMjI1NjUyNTkxMF5BMl5BanBnXkFtZTgwOTIwODczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "27 Dec. 2005",
      "plot": "Jeremy tests the Volkswagen Golf R32 and the BMW 130i. Richard and James are having a time trial race at the Prescott Hill Climb Course by pitting an Austin-Healey Spite (representing the old generation) against a modified Peugeot 306 (representing the young generation) to settle an argument about modern day driving. Richard tests the new Mazda MX-5 by racing it against a greyhound at a dog-racing dirt track. Jeremy attempts to see if he can get around the Laguna Seca race track posting the same lap time as he did on the \"Gran Turismo 4\" video game (using the same ...",
      "imDbRating": "7.8",
      "imDbRatingCount": "209"
    },
    {
      "id": "tt0762542",
      "seasonNumber": "7",
      "episodeNumber": "7",
      "title": "Winter Olympics",
      "image": "https://m.media-amazon.com/images/M/MV5BMjE2MDE2MTA3N15BMl5BanBnXkFtZTgwMTAxMzczMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2006",
      "released": "12 Feb. 2006",
      "plot": "The boys are having their very own Winter Olympic Games in Norway by using cars for each event. Jeremy and James races each other in the biathlon event using SUVs. Jeremy takes the Volvo XC90 while James chooses the Audi Q7. Richard attempts to see which one can survive cold temperatures, a Citroen C1 or a man (that man would be Richard). In the speed skating event, Jeremy takes the new Jaguar XK and races against a professional speed skater around the ice skating ring. In an attempt to prove to Jeremy that 4 wheel drive cars are better when driving on ice than rear ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "412"
    }
  ],
  "errorMessage": ""
}