{
  "imDbId": "tt1628033",
  "title": "Top Gear",
  "fullTitle": "Top Gear (TV Series 2002– )",
  "type": "TVSeries",
  "year": "2002",
  "language": "en",
  "titleInLanguage": "Top Gear (2002 TV series)",
  "url": "https://en.wikipedia.org/wiki/Top_Gear_(2002_TV_series)",
  "plotShort": {
    "plainText": "Top Gear is a British motoring magazine and factual television programme, it is a revival of the 1977–2001 show of the same name by Jeremy Clarkson and Andy Wilman for the BBC, and premiered on 20 October 2002. The programme focuses on the examination and reviewing of motor vehicles, primarily cars, though this was expanded upon after the broadcast of its earlier series to incorporate films featuring motoring-based challenges, special races, timed laps of notable cars, and celebrity timed laps on a course specially-designed for the relaunched programme. The programme drew acclaim for its visual and presentation style since its launch, which focused on being generally entertaining to viewers, as well as criticism over the controversial nature of its content. The show was also praised for its occasionally-controversial humour and lore existing in not just the automotive community but in the form of internet memes and jokes. The programme was aired on BBC Two until it was moved to BBC One for its twenty-ninth series in 2020.\r\nThe programme's first series in 2002 was presented by Clarkson, Richard Hammond, and Jason Dawe, with an anonymous test driver \"The Stig\", an individual played by several different racing drivers over the course of the show's history, being featured; Wilman was the show's executive producer. Following the first series, Dawe was replaced by James May, with the line-up unchanged until the end of the twenty-second series, when the BBC chose to not renew Clarkson's contract on 25 March 2015, following an incident during filming. His dismissal from Top Gear prompted the departure of Hammond, May and Wilman from the programme, who joined Clarkson in forming a new motoring series, The Grand Tour.\r\nAfter the group's departure, others were appointed as hosts for the programme, including Chris Evans and Matt LeBlanc, both joined by four co-presenters for the twenty-third series: Rory Reid, Sabine Schmitz, Chris Harris and Eddie Jordan. After negative feedback on this series, Evans resigned from the programme, with LeBlanc joined by Harris and Reid as the main hosts for the following three series. From the twenty-seventh series onwards (2019), the presenting line-up was changed following the departure of LeBlanc and Reid, with Harris joined by Andrew Flintoff and Paddy McGuinness as the main presenters. This series proved more popular with viewers. On 23 March 2023, the BBC halted the filming of the thirty-fourth series after Flintoff was injured in an accident during filming.\r\nTop Gear has been one of the BBC's most commercially successful programmes since its relaunch. It has become a significant show in British popular culture, with episodes also broadcast internationally in many countries in Europe, North America, Southeast Asia and more, making it the most widely broadcast factual television programme in the world. Its success has led to various forms of merchandising, including live tours, special DVD editions, and books, as well as spawning a variety of international versions in various countries, including the United States, Australia, South Korea, China and France.",
    "html": "<p>Top Gear is a British motoring magazine and factual television programme, it is a revival of the 1977–2001 show of the same name by Jeremy Clarkson and Andy Wilman for the BBC, and premiered on 20 October 2002. The programme focuses on the examination and reviewing of motor vehicles, primarily cars, though this was expanded upon after the broadcast of its earlier series to incorporate films featuring motoring-based challenges, special races, timed laps of notable cars, and celebrity timed laps on a course specially-designed for the relaunched programme. The programme drew acclaim for its visual and presentation style since its launch, which focused on being generally entertaining to viewers, as well as criticism over the controversial nature of its content. The show was also praised for its occasionally-controversial humour and lore existing in not just the automotive community but in the form of internet memes and jokes. The programme was aired on BBC Two until it was moved to BBC One for its twenty-ninth series in 2020.</p><p>The programme's first series in 2002 was presented by Clarkson, Richard Hammond, and Jason Dawe, with an anonymous test driver \"The Stig\", an individual played by several different racing drivers over the course of the show's history, being featured; Wilman was the show's executive producer. Following the first series, Dawe was replaced by James May, with the line-up unchanged until the end of the twenty-second series, when the BBC chose to not renew Clarkson's contract on 25 March 2015, following an incident during filming. His dismissal from Top Gear prompted the departure of Hammond, May and Wilman from the programme, who joined Clarkson in forming a new motoring series, The Grand Tour.</p><p>After the group's departure, others were appointed as hosts for the programme, including Chris Evans and Matt LeBlanc, both joined by four co-presenters for the twenty-third series: Rory Reid, Sabine Schmitz, Chris Harris and Eddie Jordan. After negative feedback on this series, Evans resigned from the programme, with LeBlanc joined by Harris and Reid as the main hosts for the following three series. From the twenty-seventh series onwards (2019), the presenting line-up was changed following the departure of LeBlanc and Reid, with Harris joined by Andrew Flintoff and Paddy McGuinness as the main presenters. This series proved more popular with viewers. On 23 March 2023, the BBC halted the filming of the thirty-fourth series after Flintoff was injured in an accident during filming.</p><p>Top Gear has been one of the BBC's most commercially successful programmes since its relaunch. It has become a significant show in British popular culture, with episodes also broadcast internationally in many countries in Europe, North America, Southeast Asia and more, making it the most widely broadcast factual television programme in the world. Its success has led to various forms of merchandising, including live tours, special DVD editions, and books, as well as spawning a variety of international versions in various countries, including the United States, Australia, South Korea, China and France.</p>"
  },
  "plotFull": {
    "plainText": "Top Gear is a British motoring magazine and factual television programme, it is a revival of the 1977–2001 show of the same name by Jeremy Clarkson and Andy Wilman for the BBC, and premiered on 20 October 2002. The programme focuses on the examination and reviewing of motor vehicles, primarily cars, though this was expanded upon after the broadcast of its earlier series to incorporate films featuring motoring-based challenges, special races, timed laps of notable cars, and celebrity timed laps on a course specially-designed for the relaunched programme. The programme drew acclaim for its visual and presentation style since its launch, which focused on being generally entertaining to viewers, as well as criticism over the controversial nature of its content. The show was also praised for its occasionally-controversial humour and lore existing in not just the automotive community but in the form of internet memes and jokes. The programme was aired on BBC Two until it was moved to BBC One for its twenty-ninth series in 2020.\r\nThe programme's first series in 2002 was presented by Clarkson, Richard Hammond, and Jason Dawe, with an anonymous test driver \"The Stig\", an individual played by several different racing drivers over the course of the show's history, being featured; Wilman was the show's executive producer. Following the first series, Dawe was replaced by James May, with the line-up unchanged until the end of the twenty-second series, when the BBC chose to not renew Clarkson's contract on 25 March 2015, following an incident during filming. His dismissal from Top Gear prompted the departure of Hammond, May and Wilman from the programme, who joined Clarkson in forming a new motoring series, The Grand Tour.\r\nAfter the group's departure, others were appointed as hosts for the programme, including Chris Evans and Matt LeBlanc, both joined by four co-presenters for the twenty-third series: Rory Reid, Sabine Schmitz, Chris Harris and Eddie Jordan. After negative feedback on this series, Evans resigned from the programme, with LeBlanc joined by Harris and Reid as the main hosts for the following three series. From the twenty-seventh series onwards (2019), the presenting line-up was changed following the departure of LeBlanc and Reid, with Harris joined by Andrew Flintoff and Paddy McGuinness as the main presenters. This series proved more popular with viewers. On 23 March 2023, the BBC halted the filming of the thirty-fourth series after Flintoff was injured in an accident during filming.\r\nTop Gear has been one of the BBC's most commercially successful programmes since its relaunch. It has become a significant show in British popular culture, with episodes also broadcast internationally in many countries in Europe, North America, Southeast Asia and more, making it the most widely broadcast factual television programme in the world. Its success has led to various forms of merchandising, including live tours, special DVD editions, and books, as well as spawning a variety of international versions in various countries, including the United States, Australia, South Korea, China and France.\r\nDevelopment\r\nAfter the BBC cancelled the original format of Top Gear in December 2001, Jeremy Clarkson and producer Andy Wilman met together to work out ideas for reviving the programme for television. This led to them eventually meeting the broadcaster to pitch the idea of changing it from a motoring magazine format to one that was studio-based. Amongst the ideas that were pitched included: the involvement of a fixed location for car reviews and other films, alongside locations across Britain and abroad; putting notable cars through a timed lap of a circuit; the involvement of test driver with veteran racing experience, who handle driving some of the cars for the programme; and the participation of celebrity guest who would be invited to take part in an episode, undertake an interview over motoring matters, such as their car history, and take part in a special challenge to do a timed lap in a designated car. Following the pitch, the BBC decided to green-light the new format, in order to create a programme to compete with Channel 5's new motoring show Fifth Gear, from which several original Top Gear presenters including Tiff Needell, Vicki Butler-Henderson and producer Jon Bentley went to.\r\nProduction began in mid-2002, with the broadcaster securing the right to use Dunsfold Aerodrome, an airport and business park in Waverley, Surrey, as the programme's fixed location – while its runways and taxiways were allocated for reviews and other films, one of the site's large aircraft hangars was transformed into Top Gear's new studio. To match the proposed ideas for the new format, the BBC gained assistance from Lotus to design a race circuit for use on the programme that would be situated at the fixed location, while editing of films that were recorded for each episode, focused on extending the runtime of the programme to one hour. Wilman took on the role of the show's executive producer, while Clarkson became part of the hosting line-up. Because those who had worked with Clarkson on the original programme had left the BBC to work on Fifth Gear, the production team arranged for him to be joined by Richard Hammond and Jason Dawe.\r\nA difficulty found during production revolved around the show's test driver – neither Clarkson nor Wilman could find a racing driver with experience at speaking on-camera. In discussions over this, the pair opted to make the driver silent, and later having their identity concealed. When they recruited Perry McCarthy amongst their possible candidates for the role, his input led to Wilman choosing to nickname the test driver \"the Stig\".\r\nPresenters\r\nTo date, there have been 13 presenters of the show:\r\nJeremy Clarkson, 2002–2015\r\nJason Dawe, 2002\r\nRichard Hammond, 2002–2015\r\nThe Stig, 2002–present\r\nJames May, 2003–2015\r\nChris Evans, 2016\r\nMatt LeBlanc, 2016–2019\r\nSabine Schmitz, 2016–2020\r\nEddie Jordan, 2016–2018\r\nChris Harris, 2016–present\r\nRory Reid, 2016–2019\r\nFreddie Flintoff, 2019–present\r\nPaddy McGuinness, 2019–present\r\nHistory\r\nBeginnings: 2002–2005\r\nThe first series of the new format of Top Gear premiered on 20 October 2002. In its early state, the programme's segments were based on elements of the previous format, such as interviews and viewers' letters, but also featured some new humorous elements, such as the presenters regularly destroying a caravan during the early series.\r\nAfter the first series, Dawe was replaced by James May. Having previously been a presenter on Channel 4's motoring programme Driven and the 1999 series of Top Gear, May initially declined to be a part of the new format, until its growing popularity later changed his mind.\r\nAt the beginning of the third series, McCarthy was replaced by Ben Collins for contractual reasons – the change in drivers was notable in the fact that for Collins' version, the Stig's outfit was changed from a black outfit to a white one.\r\nAs the programme progressed, the format slowly began to transform, with a focus towards creating a unique presentation style for the programme, which included the addition of new segments, a more unusual approach to reviewing cars, road trips, and more specialised films involving races – either between cars or between a car and another form of transportation – and completing a variety of challenges, mostly with cheap, second-hand cars.\r\nChanges and growing popularity: 2006–2014\r\nIn early 2006, the BBC made plans to move the programme's film site from Dunsfold to Enstone, Oxfordshire, in preparation for its eighth series. These were later cancelled, after West Oxfordshire District Council strongly objected to the planned move, on the basis of noise and pollution concerns. As a direct result, the broadcaster ordered that filming continued at Dunsfold during May of that year, despite having no permit to do so, with the eighth series unveiling a revamped studio set. In addition, the \"Star in a Reasonably Priced Car\" segment was modified with new rules along with a new car, while Hammond included one of his dogs for the series throughout its studio segments, along with a number of films made for this series and the next.\r\nOn 20 September, during production for the ninth series, Hammond was seriously injured while driving a Vampire turbojet drag racing car at up to 314 miles per hour (505 km/h), as part of a planned feature, leading the BBC to postpone the broadcast of Best of Top Gear until a later date, and delaying production on the series until the presenter had recovered. Both the BBC and the Health and Safety Executive carried out inquiries into the accident, with filming later resuming on 5 October. The opening episode of the ninth series, aired on 28 January 2007, included footage of Hammond's crash; while it was not repeated like other episodes in the programme, it attracted higher ratings than the finale of Celebrity Big Brother, providing one of the highest ratings for BBC Two for a decade, alongside the series finale, which attracted around 8 million viewers.\r\nLater that summer, on 25 July, the BBC aired a special edition episode entitled Top Gear: Polar Special. It was one of the first episodes of the programme to be shown in high-definition, and the third special to be produced, focusing on a race to the North Magnetic Pole, at its recorded location in 1996, between a \"polar modified\" Toyota Hilux and a dog sled. Considerable planning and co-ordination for the filming of the episode was conducted by both Top Gear's production team and Toyota, with both Clarkson and May, driving the Hilux, being the first people to reach the recorded location of the North Magnetic Pole by car. It was one of a number of challenges in which the presenters had to be focused and serious, despite the comedic scenes shown, with another being on 9 September, when the presenters, including The Stig, participated in the 2007 Britcar 24-hour race at Silverstone, using a race-prepared, second-hand diesel BMW 330d, fuelled by biodiesel refined from crops they had sown as part of an earlier feature.\r\nWith popularity for the show rising to considerable levels, the waiting list to get a ticket for a recording became extensive – an individual seeking a ticket, found that they would be required to wait for 21 years before securing a place. On 17 June 2008, Hammond and May revealed during an interview on BBC Radio 1's The Chris Moyles Show, that the eleventh series would feature a new \"host\" in the line-up, who was later revealed on the programme as \"Top Gear Stunt Man\", an individual who made few, occasional appearances on the programme. From the twelfth series, feature-length specials were created for the show, each visiting a different part of the world for a road trip using second-hand cars, with a number produced to be aired as a Christmas special. Despite growing popularity, an interview made with the Radio Times by Wilman revealed that future programmes would have less time devoted to big challenges, stating the following:\r\n\"We've looked back at the last two or three runs and noticed that a programme can get swallowed up by one monster film – a bit like one of those Yes albums from the 1970s where side one is just one track – so we're trying to calm down the prog-rock side. We'll inevitably still have big films, because it's the only way you can enjoy the three of them cocking about together, but they'll be shorter overall, and alongside we'll be inserting two- or three-minute punk songs.\"\r\nThe success of the programme soon led to a live-version format being created called Top Gear Live; produced by a former producer of the programme, Rowland French, the touring show aimed to attempt to \"bring the TV show format to life... featuring breath-taking stunts, amazing special effects and blockbusting driving sequences featuring some of the world's best precision drivers\". The Live tour began on 30 October 2008 in Earls Court, London, moving on to Birmingham in November before being performed in at least 15 other countries worldwide.\r\nAs the 14th series was being broadcast in late 2009, the programme began to attract criticism from some viewers, over its predictability through the over-reliance on stunts and forced humour at the expense of serious content. On 13 December 2009, controller of BBC Two Janice Hadlow appeared on the BBC's Points of View to reject such comments, purely on the evidence of Top Gear's ratings and audience appreciation figures. However, a week later on 20 December, Wilman admitted that the three presenters were now \"playing to their TV cartoon characters a bit too much\". His statement included referring to \"this incarnation of Top Gear\" being close to its end, and that the production team would be working towards keeping its \"dignity still intact\", while experimenting with new ideas for the programme. Nevertheless, a one-off special of the long-running US news programme 60 Minutes featuring Clarkson, Hammond, and May, attracted 16 million viewers in October 2010.\r\nClarkson's final warning, hiatus due to Clarkson's suspension and the end of an era: 2014–15\r\nTowards the end of 2014, the BBC became concerned over Clarkson's behaviour on the programme, including its production. Their concerns were raised by two incidents that year. The first involved an un-aired take from the 19th series emerging on national news media, featuring the presenter attempting to choose between two cars using the traditional rhyme \"Eeny, meeny, miny, moe\" but failing to censor the original version's use of the word nigger. The second involved an investigation into racism complaints by the regulator Ofcom, in regards to the show's \"Burma Special\", which led to the programme being found in breach of broadcasting rules: the presenters had been involved in constructing a bridge, when Clarkson, seeing an Asian man crossing it, remarked that the bridge \"had a slope on it\". As a result of these matters, the broadcaster issued a \"final warning\" against Clarkson. The programme then suffered another incident, when production of its next special in Argentina was dogged by major issues that placed the team at serious risk of harm, as one of the car licence plates had read \"H982 FKL\" in an alleged reference to the Falklands War of 1982. The controversial incident it created was covered by international news media, but despite the issues faced, the special was later aired as part of the BBC's Christmas schedule for 2014, though with amendments to its ending and the inclusion of an introduction for it.\r\nOn 10 March 2015, the 22nd series of the programme was abruptly put into hiatus by the BBC. The broadcaster's actions were the result of them suspending Clarkson in order to investigate allegations made against him, over verbal and physical abuse he had committed against one of the show's producers, Oisin Tymon. On 25 March, Clarkson's contract with the BBC was terminated, with Director-General of the BBC Tony Hall announcing that the remaining episodes future were uncertain until the broadcaster could determine how to air them out and complete the 22nd series. Clarkson's forced departure soon had a considerable impact on the programme, beginning with that year's Top Gear Live – as a result of the BBC's decision, the tour's name was changed to \"Clarkson, Hammond and May Live\" and announced on 1 April 2015. Wilman later revealed on 23 April that he would be resigning from the programme, along with Clarkson's co-presenters May and Hammond, having stated that they would not continue working on Top Gear without Clarkson; however, the group consented to making one final episode for the BBC consisting of the trio's final films, which was aired as a special on 28 June 2015. Following this episode, Hammond, May and Wilman joined up with Clarkson, and subsequently signed a deal with Amazon to produce a new motoring programme in the same vein as their former show, which debuted in 2016 under the title of The Grand Tour.\r\nPresenter reshuffling: 2016–2019\r\nFollowing the departure of Clarkson, and the subsequent departure of May, Hammond and Wilman, the BBC began searching for their replacements. On 16 June 2015, Chris Evans was confirmed as one of the new hosts, with it later suggested he would be hosting the show alone as part of a new format, despite a previous announcement that the broadcaster was holding open audition for his co-presenters; this claim was later dismissed as untrue. Although former Formula 1 driver David Coulthard had been widely reported to be joining the programme as a host, this was dismissed as speculation when he was revealed, on 11 January 2016, to be the new host of Channel 4's coverage for the 2016 F1 season. On 4 February, it was officially announced that American actor Matt LeBlanc was to join the show as Evans' co-host. On an edition of his BBC Radio 2 breakfast show, a week later, Evans revealed that both men would also be joined by Eddie Jordan, motoring journalist Chris Harris, German motor racing driver Sabine Schmitz, and motoring journalist Rory Reid.\r\nFilming for the twenty-third series soon began in early 2016. While the show still retained the use of the show's presentation style and its test driver The Stig, the format received a number of changes – a small number of segments were dropped, the studio received a revamp to its layout, the celebrity segment was redesigned to feature a rallycross-styled challenge, while Evans and LeBlanc would front the show with the other co-presenters appearing \"when required\". On 27 April 2016, BBC Three announced that a spin-off programme to Top Gear had been commissioned, entitled Extra Gear. Designed to be aired after each episode of the new series was aired, its format focused on providing exclusive new content online – hosted by both Reid and Harris, the spin-off would consist of new footage, interviews, specially recorded films and behind-the-scenes access to the main programme.\r\nA combination of delays with production and conflicts with scheduling, led to the premiere date of the 23rd series being pushed back to 29 May 2016. In addition, the new series aired with only six of the ten episodes that it promised to show. The new look of the show received mixed feedback from critics and viewers alike – although praise was given for the inclusion of LeBlanc, Harris and Reid, the new format was panned for its sluggish pace, the lack of humour in the studio segments, and the length of time spent on the revamped celebrity segment, \"Star in a Rally-Cross Car\". The most negative feedback received for the 23rd series was towards Evans' involvement – his presentation style was largely criticised, along with the lack of chemistry he had with LeBlanc. In addition to feedback, several newspaper articles highlighted the fact that the new series struggled to make reasonable viewing figures, with this partly blamed on its broadcast schedule putting it up against live broadcasts of the UEFA Euro 2016 championships. On 4 July, following the series finale, Evans announced his resignation from Top Gear, based on feedback. As a result, the BBC announced on 26 September that, among the remaining five presenters, LeBlanc would be joined by Harris and Reid to become the main hosts for the next series.\r\nTo make amends for its dismal performance, Top Gear underwent a more thorough revamp, which included redoing the studio, and redesigning the show's opening titles. The show's format was refocused on elements developed in early series, a deeper work on chemistry between the presenters, while also revising the celebrity segment – as the arrangement for the 23rd series had proven to be a failure, the segment returned to its original format.\r\nNew era: 2019–present\r\nOn 31 May 2018, LeBlanc announced he would be leaving the show after the twenty-sixth series in 2019. Andrew Flintoff and Paddy McGuinness were announced on 22 October 2018 to be replacing LeBlanc and joining Harris for the twenty-seventh series. As a part of the reshuffle Rory Reid was announced to be stepping down as a main host to present Extra Gear and make occasional appearances on the main show; however, Extra Gear did not return and so Reid moved to ITV4 to present Speed Freaks. The new presenting line-up received a positive reception compared to the mixed reviews of the previous few series.\r\nDuring the broadcast of the twenty-eighth series in early 2020, it was announced that, from the twenty-ninth series, the show would move channels to BBC One following the positive reception of the new presenting lineup. The twenty-ninth series itself, which was broadcast in late 2020, also saw some changes as a result of filming and broadcast during the COVID-19 pandemic, including the show moving out of the studio and onto the runway, in a 'drive-in festival' style, to enable the audience members to remain physically distanced, and the dropping of the Star in a ... Car segment to maintain social distancing. Further changes were made to the thirtieth series, broadcast in early 2021, due to restrictions as a result of the COVID-19 pandemic: studio segments were recorded during a two-night shoot outside Television Centre, London, instead of the previous location at Dunsfold Aerodrome, with no full audience, and all of the films in the series were recorded in the UK. The new outdoor studio at Television Centre was retained for the thirty-first series, which was broadcast later that year.\r\nThe revamped show fronted by the new trio helped Top Gear increase viewership to numbers not seen since the departure of Clarkson, Hammond and May. The twenty-seventh series has also been one of the most popular shows for British 16 to 34 year olds.\r\nOn 4 August 2021, it was announced that production of the show would transfer to BBC Studios Bristol from the thirty-third series onwards; however, Dunsfold Aerodrome will still be used for filming.\r\nFormat\r\nEach episode of Top Gear focus a series of segments, switching between those filmed within the programme's main studio before a studio audience, and pre-recorded films conducted before the broadcast of an episode – these films primarily cover major segments of the episodes, with studio segments often used as links or breaks between them. The most common forms of segments used in the show's history are \"Car Reviews\", \"Power Laps\", \"Star in a ... Car\", \"Cool Wall\", \"Challenges\" and \"Races\".\r\nCar reviews\r\nA major segment of the programme, happening at least once in most episodes, it focuses on the presenters conducting a road-test of a car, looking at such factors as ride quality, speed, handling, practicality, and reliability. These reviews are conducted either on and around Top Gear's test track, or on the roads of Britain and abroad, and often focus on one car, primarily from well known car manufacturers. On a number of occasions, the review may feature more than one car from the same class, as well as include exotic/foreign models, and feature more than one presenter as a way of providing different opinions on the cars being reviewed and putting forth an argument over the model they believe is worthwhile to own.\r\nAlthough the programme operated in a standard manner in the early series to the original format of car reviews in the 1977 show, it soon began to adopt an unusual approach of reviewing cars, by conducting an unusual test(s) to either put a vehicle through its paces in an arranged scenario, or to demonstrate and showcase an exceptional quality that it exhibited. An example of this comes from the \"Toyota Hilux Destruction\" film, divided between two episodes of the third series – to prove the strength of a Toyota Hilux pick-up truck, presenters Clarkson and May set about subjecting it to various, mainly destructive tests to see if it could survive against them and still run, allowing the use of tools for repair but prohibiting the replacement of any components (with the exception of the windscreen). Other notable uses of this unusual approach have included:\r\nTesting the ride quality of two off-road vehicles by having a passenger receive a tattoo in each vehicle as it is driven off-road, to see how smoothly it can be done in each.\r\nTesting a car's handling, by racing it through a shopping centre against a more powerful, but much larger car.\r\nAssigning the presenter's mothers with the duty of reviewing a small selection of cars.\r\nTesting the comfort of a vehicle by chauffeuring a VIP to an event.\r\nAnother unusual approach with car reviews was to conduct them in the form of a challenge. Examples of such \"review\" challenges have included:\r\nRoad-testing cars in the style of \"Russian Roulette\", in which presenters did not know what they would get to drive and had to review it in the presence of their owners while driving them and their car back to their home.\r\nComparing the practicality of two new vehicles by operating them as taxi cabs for a night.\r\nSpending 24 hours within a car without stepping out of it any point within the time period.\r\nTaking an off-road vehicle up a mountain in Scotland.\r\nPower laps\r\nThis segment focuses on a featured car undergoing a timed lap of the programme's test track, with the car driven by The Stig. Often used after the main review of an episode, it mainly involved the car or cars from the review, though it sometimes featured vehicles that either had been reviewed in a previous episode but couldn't be put on the track due to problems or unfavourable conditions on the track, or were special models (such as racing versions of the car). On occasions when multiple cars did a timed lap, the episode either shows the film of each car one after the other, or alongside each other. After the film is shown, the presenter reveals the time to the studio audience and the viewer – abbreviations next to lap times, such as \"W\" for \"wet\", highlight if they were conducted under certain track conditions.\r\nIn order to qualify for a place on the Power Lap Board, cars that undergo a Power Lap must fulfil certain requirements:\r\nRoadworthy, and make use of standard road tyres.\r\nCommercially available.\r\nAble to negotiate a speed bump.\r\nAs such, vehicles that do not qualify have their times mentioned, but do not get included on the Lapboard. Examples of this include the Renault F1 car (0:59.0) and the Caparo T1 (1:10.6), which were disqualified for failing the speed bump requirement; the Ferrari FXX (1:10.7), which was disqualified for using slick tyres; and the Pagani Zonda R (1:08.5), which was disqualified for not being road legal. In addition, non-production cars are also disallowed from the board, such as the Aston Martin DBR9 Le Mans racer.\r\n\"Star in a ... Car\"\r\nAnother major segment in the programme, featured in the majority of episodes broadcast, the format for this involves a celebrity being invited to take part in a timed lap around Top Gear's test track in a car provided for the segment. They then join the presenters in the studio for an interview, mainly about their car history, their performance in the car and a look back to the highlights from their practice laps. After viewing footage of their timed lap, their time is stated and recorded onto a leaderboard, much in a similar fashion to lap times for Power Laps, including the use of abbreviations to denote track conditions the celebrity faced. In the event that the car being used was put of action by serious mechanical damage during practice sessions, a back-up car would be provided for the celebrity to use to continue practising, and/or to do their timed lap in. Although only one celebrity is involved in this segment, in a number of episodes, including the majority of the eleventh and twenty-third series, it sometimes featured two celebrities taking part, with footage of each timed lap shown one after the other.\r\nFrom the first series to the twenty-second series, when the show was presented by Clarkson, Hammond and May, the segment was entitled as \"Star in a Reasonably Priced Car\" – its name was derived from the fact that the celebrities drove around the test track in an affordable car available on the market. The segment was often shown during the middle of an episode, and had the celebrities interviewed by Clarkson. The affordable car used in the segment was changed several times, each being replaced after a number of series – because the new car was often different, in terms of engine specifications, power, speed, handling, and other factors, a new leaderboard would be created a direct result. In addition, the introduction of a new car would be reserved for the opening episode, with the celebrity segment pre-recorded before the series began – it featured no interview, and involved a group of celebrities taking part to set a lap time in the new car. Up until the eighth series, the rules of the segment were that celebrities were given a set number of laps to do, with the fastest amongst these being recorded, but from the ninth series onwards, the rules were changed so that they were now given a few practice laps to get to grips with both the car and the track, before conducting a timed lap. In some episodes, the invited celebrity was a F1 driver, with the segment referred to as \"F1 Star in a Reasonably Priced Car\" – while it stuck to the standard format, the only difference was that the F1 drivers were restricted to the use of the first car used in the segment, which was retained to maintain fairness with those invited.\r\nDuring Evans' short-lived tenure as the show's host, the twenty-third series saw the segment renamed \"Star in a Rally-Cross Car\". While it stuck to the same format as \"Reasonably Priced\", it featured a number of changes. The first change was that the interview, conducted with Evans, was much longer, with the celebrities involved discussing what was their favourite car in a certain field and the studio audience voting on which one they preferred. The second change, which was the primary reason for the change in name, was that celebrities drove around a specially modified, rally-cross version of the Top Gear test track – while it used the majority of the circuit, it featured two off-road sections and a small jump – in a rally-spec Mini Cooper. After the series ended, the segment received negative feedback and criticism from viewers and critics, and was dropped from the programme as a result.\r\nFrom the twenty-fourth series onwards, the segment's format was revised, and renamed as \"Star in a Reasonably Fast Car\". While similar in format to \"Reasonably Priced\", in that celebrities were interviewed about their car history and did a timed lap around the test track, it featured a number of changes. Apart from the car being much faster the segment was split into two parts – the celebrity joined much earlier in the episode, discussed their car history with LeBlanc, Harris and Reid, gave some feedback on a film that had been shown prior to footage of their timed lap, and viewed footage of a practice lap in which Harris tutored them on how to get around the circuit in the new car, before the footage of their timed lap. This was altered slightly in Series 25, with it returning to only one part with the training run still shown. The segment was dropped in Series 29 to maintain social distancing during the COVID-19 pandemic, and did not return in later series.\r\nChallenges\r\nAs part of Top Gear's format, every episode has contained at least a number of segments involving challenges. In the first few series, these were focused on novelty challenges and stunts that were typically based on absurd premises, such as a bus jumping over motorcycles (as opposed to the more typical scenario of a motorcycle jumping over buses) or a nun driving a monster truck. However, these later changed into situations in which the presenters were either competing against each other with a car they chose in a series of tests, or working together to accomplish a goal, with the tagline \"How hard can it be?\" becoming a common phrase for the introduction of some of the challenges featured on the programme. Challenges that appear in episodes, mainly fall under the following categories:\r\n\"Cheap Car\" – The presenters are each given a budget with which to buy a second-hand car, and must adhere to certain criteria associated with the challenge (e.g. the car must be from a particular decade, or not be designed for a certain purpose). These types of challenges are often done as a competition, in that the presenters' choices undergo a series of tasks, which they have no prior knowledge of, that are designed to determine how well each car fares on various aspects such as reliability and power. Each presenter is scored based on how well their car did in the task. The winner in such competitions is often the presenter who scored the most points.\r\n\"Car Creation\" – The presenters take on the challenge of creating a vehicle, such as a police car or hovercraft, mainly using a car they feel will be good as the basis for their design. While they mostly work together to create something unique, occasionally they will make their own designs separately and then compete against each other to see whose design is the best. Regardless of the set-up, the presenters' creation will undergo a series of challenges designed to determine how well it has been made and how well it suits its purpose. Many of the cars created by the presenters were later displayed at World of Top Gear at the National Motor Museum, Beaulieu after their appearance.\r\n\"Car Review\" Challenge (see Car Reviews above)\r\nCar Sports – The presenters create their own versions of sports using cars as players, with such sports including football, rugby and ice hockey; tennis was also involved, though required a lot of editing. In 2006, a special episode entitled Top Gear Winter Olympics, featured the presenters partaking in a number of winter sport challenges that utilised cars, including a biathlon and downhill slope jumping.\r\nSpecialised – The presenters undergo a specially designed challenge, in which they attempt to tackle something unique. Such challenges have included participating in the Britcar 24-hour endurance race at Silverstone Circuit, presenting a drive-time radio show, conducting roadworks within 24 hours, and making a televised advertisement for a car.\r\nRaces\r\nAnother part of the show's format was the inclusion of a race in every series by the presenters. Such races (which were sometimes referred to as \"epic\" by Clarkson) were mainly conducted over long distances, though each fell under a certain category:\r\n\"Car vs. Public Transport\" – In this race, one presenter took to driving between one location to another in a car, while the other presenters raced them to the finish line on another form of transport. The general emphasis on such races was to prove that a car could reach a destination much faster than by using the transportation involved in the race. Such races were usually edited to portray the result as close and to conceal the winner until the very end of the race (regardless of the actual closeness of the race).\r\nNovelty Race – In these races, one of the presenters took to racing a car in a head-to-head race against an unusual opponent. Such races were arranged mainly to demonstrate the various strengths and, more often, weaknesses of cars, with opponents ranging from a marathon runner, to a pigeon and the postal service.\r\n\"Cross City Race\" – One presenter takes the car and drives across the city from one point to another, while the others take on a different form of transport and try to beat them to the finish line.\r\nMotorsport Race – Conducted in the fashion of a motor-racing event, these focused on bringing forth vehicles from a certain class, and racing them around a circuit to determine which one is the best. Such races involved racing drivers in control of the vehicle, and often led to fierce jostling between vehicles, usually resulting in some being knocked out of the race.\r\nSpecialised Race – Not conforming to any of the above categories, these races had unique conditions and rules to them. Such races have included an economy race, in which the presenters chose a car and had to reach a finish line on the amount of fuel their choice could carry, a race between old, very powerful racing cars and new showroom cars, and a race designed with a 1949 theme, between a car, a steam train and a motorbike, to see which was the fastest transportation method from that year.\r\nThe Cool Wall\r\nIn \"The Cool Wall\", the segment focused on an argument between two of the presenters over which cars are cool and which are not, placing photographs of these on various sections of a large board divided into a series of categories: \"Seriously Uncool\", \"Uncool\", \"Cool\", and \"Sub Zero\". This segment was purely designed for comedy, as it was mainly handled by both Clarkson and Hammond since its introduction in the sixth episode of the first series, and both presenter often argued and attempted to put a car they liked into a category that the other refused to let it be a part of, with Clarkson basing some of his arguments on how the cars would impress actress Kristin Scott Thomas, and later, BBC newsreader Fiona Bruce. Cars were placed into a specific category depending on certain attributes, which, according to Andy Wilman, were not necessarily related to the quality of the car itself. An example of this is that a car considered to be \"fashionable\" may be deemed uncool if the impact it has is massive but short-lived and the perception of it is that it looks ridiculous. A notable rule of this segment was that the car becomes \"Seriously Uncool\" if a presenter buys one. The segment appeared frequently during early series acting as a low budget time filler segment but later appeared only a few times since the original Cool Wall was damaged at the start of the tenth series and also due to show being able to produce more pre-recorded film and challenge content due to the bigger budgets of later series. The final appearance of the Cool Wall occurred in the last episode of the sixteenth series though it still remained as part of the studio set until the end of twenty-second series. The Cool Wall was removed from the studio entirely ahead of the twenty third series after the studio was refurbished following the departure of Clarkson, Hammond and May from the show.\r\nSpecials\r\nIn 2006, Top Gear featured its first, feature-length, special edition episode, in which the presenters conducted a various challenges related to sporting events used in the Winter Olympics, in which cars took the place of athletes in each event. Following this special, the production team worked on creating additional, feature-length specials, in which the common theme was that the presenters conducted a road trip, mainly using a series of second-hand vehicles that they put through a series of challenges along their journey. The format often saw the presenters conduct a small filmed segment to provide an insight of what they were doing; the exception to this format was Top Gear's Polar Special. A number of specials were designed to be aired as a Top Gear \"Christmas Special\", with the last three split into two parts. These specials are listed below:\r\nAward ceremony\r\nAt the end of each autumn series, hosts Clarkson, Hammond and May presented an award ceremony, in which they picked out cars on various aspects. While some were serious, others were meant as jokes against cars that the presenters hated. One award given, was to one of the presenters, referred to as \"Cock of Year\", in which they had conducted a mistake while filming the show for that year, while another was given to the celebrity who drove well, and not necessarily the fastest.\r\nThe most important award given out in this special segment was \"car of the year,\" in which the only criterion was that all three presenters must come to a unanimous choice on the winning car. Past winners were:\r\n2002: Land Rover Range Rover\r\n2003: Rolls-Royce Phantom\r\n2004: Volkswagen Golf GTI\r\n2005: Bugatti Veyron\r\n2006: Lamborghini Gallardo Spyder\r\n2007: Subaru Legacy Outback/Ford Mondeo (joint)\r\n2008: Caterham Seven R500\r\n2009: Lamborghini Gallardo LP550-2 Balboni\r\n2010: Citroën DS3\r\n2011: Range Rover Evoque\r\n2012: Toyota GT86\r\n2013: Ford Fiesta ST\r\n2014: BMW i8\r\nIn the final episode of the 14th series, a special award called \"Car of the Decade\" was given to mark the end of the 2000s, and was awarded to the Bugatti Veyron, primarily as it was the only car worthy of the award.\r\nEpisodes\r\nBroadcast\r\nFirst-run episodes of the programme are shown in the United Kingdom on BBC One, and BBC One HD (previously on BBC Two for the first twenty-eight series, BBC HD between the fourteenth and nineteenth series, and BBC Two HD between the twentieth and twenty-eighth series), with repeats also aired on BBC Three and Dave. All episodes have been available to watch on BBC iPlayer in the UK since mid-2021; episodes from the fifteenth to twenty-second series, as well as multiple specials from other series, were available on Netflix streaming before this. The popularity of the programme eventually led to Top Gear being broadcast internationally in 214 different territories by the end of 2014; however the show's publicist has stated that the oft-repeated claim of 350 million viewers per week is \"unreliable\".\r\nSome of the countries where the programme is broadcast are listed below along with the channels it is transmitted on:\r\nAustralia: Nine Network, GO!, 9Rush, Discovery Turbo, BBC Brit, Discovery Channel\r\nBarbados: CBC TV 8\r\nBelgium: Canvas\r\nBrazil: Discovery Channel Brasil\r\nCanada: BBC Canada\r\nCzech Republic: Prima COOL\r\nDenmark: TV3+, 6'eren, BBC Entertainment, BBC Knowledge\r\nFinland: MTV3, MTV3 Max, FOX\r\nGreece: Skai TV\r\nHungary: Viasat3, Viasat6, M2, RTL Spike\r\nIndia: BBC Entertainment, AXN India\r\nIndonesia: NET.\r\nIran: BBC Persian\r\nIreland: RTÉ Two, Setanta Ireland\r\nItaly: Discovery Channel, DMAX, Spike\r\nMalaysia: Media Prima's NTV7, HyppTV's BBC Knowledge\r\nNetherlands: Veronica\r\nNew Zealand: Prime TV, TV3, TVNZ Duke\r\nPakistan: 24 News HD\r\nPoland: BBC Brit\r\nSouth Africa: BBC Entertainment, SABC 3\r\nSweden: Kanal 9\r\nUnited States: BBC America, Motortrend\r\nAwards and nominations\r\nIn November 2005, Top Gear won an International Emmy in the Non-Scripted Entertainment category. In the episode where the presenters showed the award to the studio audience, Clarkson joked that he was unable to go to New York to receive the award because he was busy writing the new script.\r\nTop Gear has also been nominated in three consecutive years (2004–2006) for the British Academy Television Awards in the Best Feature category. Clarkson was also nominated in the best \"Entertainment Performance\" category in 2006. In 2004 and 2005, Top Gear was also nominated for a National Television Award in the Most Popular Factual Programme category; it won the award in 2006, 2007, 2008 and 2011. Accepting the award in October 2007, Richard Hammond made the comment that they really deserved it this year, because he didn't have to crash to get some sympathy votes. On 20 January 2010 Top Gear was once again nominated for a National Television Award, in the category \"Best Factual Programme\" however, they lost out to Loose Women.\r\nTop Gear presenters have also announced on the programme that they have won some slightly lower profile awards. In Series 10, Richard Hammond won the award for the \"Best TV Haircut\" and James May won the award for the worst. All three presenters have won the award for Heat magazine's \"weirdest celebrity crush\" revealed during the news. In series 11, the Stig won an award from the Scouts for Services to Instruction. After revealing that, the Stig was shown \"attacking\" the Scouts, and the presenters coming to the conclusion that he is either terrified of Scouts or was a Girl Guide.\r\nAt the end of 2009 Top Gear was voted best programme of the decade in a Channel 4-commissioned survey, The Greatest TV Shows of the Noughties, ahead of The Apprentice and Doctor Who in second and third places respectively. Industry insiders and television pundits voted; also a thousand members of the public took part in a YouGov poll. The results were broadcast on Sunday 27 December 2009 at 9:00 pm, the same time as the Bolivia Special on BBC Two.\r\nControversies\r\nTop Gear has often been criticised for content inside programmes by some members of the public and by Ofcom. Most of the criticisms stem from comments from the presenting team; however, other aspects of the programme have been underlined as unsuitable. Incidents and content ranging from (but not limited to) remarks considered by some viewers to be offensive, promoting irresponsible driving, ridiculing environmental issues, Germans, Mexicans, and Poles, and alleged homophobia have generated complaints. In 2011, British actor Steve Coogan, who had appeared on Top Gear three times, wrote a Guardian article criticising the presenters' characterisations of Mexicans as lazy. He wrote: \"The Lads have this strange notion that if they are being offensive it bestows on them a kind of anti-establishment aura of coolness; in fact, like their leather jackets and jeans, it is uber-conservative (which isn't cool).\"\r\nTop Gear has been accused of misrepresenting vehicle manufacturer Tesla in an episode first aired in 2008. The firm took Top Gear to court for libel and malicious falsehood after it suggested one of its Roadster vehicles had run out of power after only 55 miles. On 19 October 2011, the High Court of Justice in London rejected Tesla's libel claim, claiming the series is an entertainment programme and not an information programme.\r\nClarkson has been critical of the BBC over their handling of the programme. In the February 2006 issue of Top Gear magazine, he voiced his opinion that the BBC did not take Top Gear seriously. He has also commented on his dislike of BBC bosses for choosing the length of the series and for often replacing the programme with snooker (which Clarkson labelled as \"drunk men playing billiards\"), despite Top Gear having considerably higher viewing figures.\r\nIn March 2014, Indian-born actress Somi Guha made a formal complaint to BBC for $1.8 million, for a racist term used after building a bridge over the Kok River in the Burma Special. Upon its completion, Clarkson said, \"That's a proud moment, but there's a slope on it\", and Richard Hammond added, \"Yeah, right. It's definitely higher on that side\". This led to complaints that \"slope\" is a derogatory term for an Asian person. In April, Top Gear's executive producer Andy Wilman apologised for the racist remark. In July 2014, Ofcom ruled that the BBC had breached broadcasting rules by including this offensive racial term. In May 2014, there were complaints and calls for Clarkson to be sacked after it was revealed that he recited \"Eeny, meeny, miny, moe; catch a nigger by his toe\" as a children's rhyme on an unaired take from the show. Clarkson denied having used the word, then apologised when a previously unbroadcast clip revealed him doing so. Clarkson says that he had attempted to mumble the word. He has also revealed the production notes from the episode, which reads \"I didn't use the N-word here but I've just listened through my headphones and it sounds like I did. Is there another take?\"\r\nTop Gear also received extensive criticism in late October 2014 during filming of an episode for Series 22 in Argentina. The presenters and the associated film crew were chased out of the country by angry protesters allegedly throwing rocks at the team. This was in protest against the number plate, H982 FKL, on Jeremy Clarkson's Porsche 928 GT, which was believed to make reference to the 1982 Falklands War. Another set of plates with the registration number BE11 END (\"bellend\") on them were found in the car, which were interpreted as another indication of a premeditated plot to mock the country. The BBC maintained that the registration number was pure coincidence.\r\nThe show also received widespread criticism after the sacking of Jeremy Clarkson, and subsequent resignations of James May and Richard Hammond. The criticism continued for the first episode of the following series, hosted by Chris Evans and Matt LeBlanc.\r\nInternational versions\r\nThe popularity of the original UK series eventually led to the creation of a number of international versions, each with local production teams and presenters, all made under licence from BBC Studios:\r\nAustralia\r\nOn 19 November 2007, it was revealed that a localised Australian series of Top Gear would be produced by the Special Broadcasting Service network in conjunction with Freehand Productions, BBC Worldwide's Australasian partner. This announcement marks the first time a deal has been struck for a version of Top Gear to be produced exclusively for a foreign market. No indication was given as to the exact makeup of the series, other than that it would have a distinctly Australian style. SBS ran a competition to find hosts for the series, and in May 2008 confirmed that the presenters for the Australian programme were to be Charlie Cox, Warren Brown, Steve Pizzati and a local \"cousin\" of the Stig. James Morrison replaced Charlie for the second series of Top Gear Australia. Top Gear host Jeremy Clarkson added, \"I'm delighted that Top Gear is going to Australia.\" It was announced that the Nine Network had secured the rights to the local and UK versions from 2010 on both its Nine and Go! (digital TV) stations. On 20 June 2010, it was announced that actor and comedian Shane Jacobson and Top Gear Australia magazine editor Ewen Page would join a returning Steve Pizzati to present the programme which premiered on 28 September 2010. The Australian version has received lacklustre reviews. Eventually, Top Gear UK and Top Gear Australia met up and challenged each other. Top Gear Australia was cancelled in September 2011.\r\nRussia\r\nOn 14 October 2008, the Top Gear website confirmed that a Russian edition of the programme was scheduled for production by the end of that year. Initially, 15 episodes were scheduled. It was revealed on 20 December that the pilot, branded Top Gear: Russian Version, was filmed for broadcast on 22 February 2009. The format is similar to its British counterpart, with three hosts: an ex rock guitarist Nikolai Fomenko, an ex-MTV Russia VJ Oscar Kuchera, and a former automotive journalist Mikhail Petrovsky.\r\nAfter only half of the first series, broadcasting of the Russian version ceased due to viewers' criticism. The channel switched to broadcasting the British version of the series from then on.\r\nUnited States\r\nNews of an American version of Top Gear surfaced in January 2006, when the official Top Gear website ran a feature about the filming of an American version of the series, produced by the Discovery Channel. The pilot featured Bruno Massel as one of the hosts, but it was not picked up by the network, which later began running edited versions of Series 1–5 of the UK original.\r\nNBC announced it ordered a pilot episode for an American version of Top Gear to be produced by BBC Worldwide America. The pilot, filmed in June 2008, was presented by television and radio host Adam Carolla, rally driver Tanner Foust, and television carpenter Eric Stromer. However, following the failure of a car-themed drama, NBC did not place the program on its schedule, indicating it planned to hold it as a spring/summer (2009) series replacement. Eventually, NBC dropped the series.\r\nEventually, however, the History cable channel had picked up the series and ordered between 10 and 12 episodes. The series began production in August 2010, with a premiere on 21 November 2010. A trailer was released in early August showing footage of the hosts simulating a \"Moonshine run\". Tanner Foust remained as a host, and was joined by comedian/actor Adam Ferrara and racing analyst Rutledge Wood. In total, the show aired 72 episodes across 6 seasons between 2010 and 2016.\r\nIn 2017, a new American adaptation of Top Gear was announced, called Top Gear America. The programme was hosted by Tom Ford, William Fichtner and Antron Brown, and ran for one season of eight episodes that was broadcast on BBC America between July and September 2017.\r\nIn 2019, the programme was moved to MotorTrend, where it was then revived for more seasons, and Ford, Fichtner and Brown were replaced by Dax Shepard, Rob Corddry, and Jethro Bovingdon.\r\nAt present, 29 episodes of Top Gear America have aired across three seasons since 30 July 2017.\r\nSouth Korea\r\nOn 20 August 2011, the first series of the Korean version of Top Gear, produced by the XTM Channel, was aired with 13 episodes. On 8 April 2012, the second series of 10 episodes began.\r\nPast presenters are Kim Kap-soo, Jo Min-ki, Park Jun-gyu and Yeon Jung-hoon, with the current presenters being Ryu Si-won, Danny Ahn, and Kim Jin-pyo. The fourth series was launched in April 2013.\r\nChina\r\nThe first attempt at a Chinese Top Gear was in 2011. Fifteen minutes of the pilot leaked before the airdate but was promptly removed at the BBC's request.\r\nIn May 2014, BBC announced that it has signed a deal with Honyee Media to produce a local version of Top Gear in China. On 13 November 2014, the first series of the Top Gear China premiered on Shanghai Dragon Television, presented by Cheng Lei, a veteran Chinese TV presenter, Richie Jen, a Taiwanese singer and actor, and Tian Liang, a former Olympic gold-medalist in diving.\r\nFrance\r\nA French version of Top Gear began in 2015 on RMC Découverte, NextRadioTV's free-to-air channel. It is presented by the actor Philippe Lellouche, the professional driver Bruce Jouanny and Yann Larret-Menezo, an electronic music artist and journalist.\r\nFilming was at the end of 2014 and in January 2015 on the aérodrome de Brienne-le-Château near Troyes.\r\nThe first series consists of 10 episodes including three made of highlights of the series.\r\nThe first episode, broadcast on 18 March 2015 at 20:45, broke RMC Découverte's audience record with 966,000 viewers (3.6% audience share).\r\nItaly\r\nThere is also an Italian version of Top Gear, from 22 March to 26 April 2016. The show was broadcast on Sky Uno and Sky Sport Mix, and was hosted by Joe Bastianich, Guido Meda, Davide Valsecchi and The Stig. The Italian version was similar to the UK version.\r\nHong Kong\r\nIn October 2011, a Hong Kong version of Top Gear was launched. Unlike other Top Gear shows, Top Gear Hong Kong is not broadcast as a television show, but it is presented on a YouTube channel called TopGear HK 極速誌. A monthly magazine is also run and sold in Hong Kong. As of August 2021, TopGear HK 極速誌 has 178k subscribers on YouTube.\r\nSweden\r\nIn 2019, it was announced that Top Gear would be given three Scandinavian adaptations. The Swedish adaptation, Top Gear Sverige, aired on Kanal 5 during 2020 and was presented by six times Speedway World Champion Tony Rickardsson, actor, comedian & musician Marko Lethosalo, and TV personality Adam Alsing.\r\nDenmark\r\nThe Danish adaptation of Top Gear, known as Top Gear Danmark, aired on Kanal 5 for one series in 2020 and was presented by TV personality Felix Smith, actor Dar Salim and former racing driver Jesper Carlsen.\r\nNorway\r\nThe Norwegian adaptation of Top Gear, called Top Gear Norge, was broadcast on TVNorge in 2020 and was presented by stunt driver Fredric Aasbø, musician Esben \"Dansken\" Selvig and TV presenter Petter Schjerven.",
    "html": "<p>Top Gear is a British motoring magazine and factual television programme, it is a revival of the 1977–2001 show of the same name by Jeremy Clarkson and Andy Wilman for the BBC, and premiered on 20 October 2002. The programme focuses on the examination and reviewing of motor vehicles, primarily cars, though this was expanded upon after the broadcast of its earlier series to incorporate films featuring motoring-based challenges, special races, timed laps of notable cars, and celebrity timed laps on a course specially-designed for the relaunched programme. The programme drew acclaim for its visual and presentation style since its launch, which focused on being generally entertaining to viewers, as well as criticism over the controversial nature of its content. The show was also praised for its occasionally-controversial humour and lore existing in not just the automotive community but in the form of internet memes and jokes. The programme was aired on BBC Two until it was moved to BBC One for its twenty-ninth series in 2020.</p><p>The programme's first series in 2002 was presented by Clarkson, Richard Hammond, and Jason Dawe, with an anonymous test driver \"The Stig\", an individual played by several different racing drivers over the course of the show's history, being featured; Wilman was the show's executive producer. Following the first series, Dawe was replaced by James May, with the line-up unchanged until the end of the twenty-second series, when the BBC chose to not renew Clarkson's contract on 25 March 2015, following an incident during filming. His dismissal from Top Gear prompted the departure of Hammond, May and Wilman from the programme, who joined Clarkson in forming a new motoring series, The Grand Tour.</p><p>After the group's departure, others were appointed as hosts for the programme, including Chris Evans and Matt LeBlanc, both joined by four co-presenters for the twenty-third series: Rory Reid, Sabine Schmitz, Chris Harris and Eddie Jordan. After negative feedback on this series, Evans resigned from the programme, with LeBlanc joined by Harris and Reid as the main hosts for the following three series. From the twenty-seventh series onwards (2019), the presenting line-up was changed following the departure of LeBlanc and Reid, with Harris joined by Andrew Flintoff and Paddy McGuinness as the main presenters. This series proved more popular with viewers. On 23 March 2023, the BBC halted the filming of the thirty-fourth series after Flintoff was injured in an accident during filming.</p><p>Top Gear has been one of the BBC's most commercially successful programmes since its relaunch. It has become a significant show in British popular culture, with episodes also broadcast internationally in many countries in Europe, North America, Southeast Asia and more, making it the most widely broadcast factual television programme in the world. Its success has led to various forms of merchandising, including live tours, special DVD editions, and books, as well as spawning a variety of international versions in various countries, including the United States, Australia, South Korea, China and France.</p><br/><h3>Development</h3><p>After the BBC cancelled the original format of Top Gear in December 2001, Jeremy Clarkson and producer Andy Wilman met together to work out ideas for reviving the programme for television. This led to them eventually meeting the broadcaster to pitch the idea of changing it from a motoring magazine format to one that was studio-based. Amongst the ideas that were pitched included: the involvement of a fixed location for car reviews and other films, alongside locations across Britain and abroad; putting notable cars through a timed lap of a circuit; the involvement of test driver with veteran racing experience, who handle driving some of the cars for the programme; and the participation of celebrity guest who would be invited to take part in an episode, undertake an interview over motoring matters, such as their car history, and take part in a special challenge to do a timed lap in a designated car. Following the pitch, the BBC decided to green-light the new format, in order to create a programme to compete with Channel 5's new motoring show Fifth Gear, from which several original Top Gear presenters including Tiff Needell, Vicki Butler-Henderson and producer Jon Bentley went to.</p><p>Production began in mid-2002, with the broadcaster securing the right to use Dunsfold Aerodrome, an airport and business park in Waverley, Surrey, as the programme's fixed location – while its runways and taxiways were allocated for reviews and other films, one of the site's large aircraft hangars was transformed into Top Gear's new studio. To match the proposed ideas for the new format, the BBC gained assistance from Lotus to design a race circuit for use on the programme that would be situated at the fixed location, while editing of films that were recorded for each episode, focused on extending the runtime of the programme to one hour. Wilman took on the role of the show's executive producer, while Clarkson became part of the hosting line-up. Because those who had worked with Clarkson on the original programme had left the BBC to work on Fifth Gear, the production team arranged for him to be joined by Richard Hammond and Jason Dawe.</p><p>A difficulty found during production revolved around the show's test driver – neither Clarkson nor Wilman could find a racing driver with experience at speaking on-camera. In discussions over this, the pair opted to make the driver silent, and later having their identity concealed. When they recruited Perry McCarthy amongst their possible candidates for the role, his input led to Wilman choosing to nickname the test driver \"the Stig\".</p><br/><h3>Presenters</h3><p>To date, there have been 13 presenters of the show:</p><ul><li>Jeremy Clarkson, 2002–2015</li><li>Jason Dawe, 2002</li><li>Richard Hammond, 2002–2015</li><li>The Stig, 2002–present</li><li>James May, 2003–2015</li><li>Chris Evans, 2016</li><li>Matt LeBlanc, 2016–2019</li><li>Sabine Schmitz, 2016–2020</li><li>Eddie Jordan, 2016–2018</li><li>Chris Harris, 2016–present</li><li>Rory Reid, 2016–2019</li><li>Freddie Flintoff, 2019–present</li><li>Paddy McGuinness, 2019–present</li></ul><br/><h3>History</h3><h4>Beginnings: 2002–2005</h4><p>The first series of the new format of Top Gear premiered on 20 October 2002. In its early state, the programme's segments were based on elements of the previous format, such as interviews and viewers' letters, but also featured some new humorous elements, such as the presenters regularly destroying a caravan during the early series.</p><p>After the first series, Dawe was replaced by James May. Having previously been a presenter on Channel 4's motoring programme Driven and the 1999 series of Top Gear, May initially declined to be a part of the new format, until its growing popularity later changed his mind.</p><p>At the beginning of the third series, McCarthy was replaced by Ben Collins for contractual reasons – the change in drivers was notable in the fact that for Collins' version, the Stig's outfit was changed from a black outfit to a white one.</p><p>As the programme progressed, the format slowly began to transform, with a focus towards creating a unique presentation style for the programme, which included the addition of new segments, a more unusual approach to reviewing cars, road trips, and more specialised films involving races – either between cars or between a car and another form of transportation – and completing a variety of challenges, mostly with cheap, second-hand cars.</p><h4>Changes and growing popularity: 2006–2014</h4><p>In early 2006, the BBC made plans to move the programme's film site from Dunsfold to Enstone, Oxfordshire, in preparation for its eighth series. These were later cancelled, after West Oxfordshire District Council strongly objected to the planned move, on the basis of noise and pollution concerns. As a direct result, the broadcaster ordered that filming continued at Dunsfold during May of that year, despite having no permit to do so, with the eighth series unveiling a revamped studio set. In addition, the \"Star in a Reasonably Priced Car\" segment was modified with new rules along with a new car, while Hammond included one of his dogs for the series throughout its studio segments, along with a number of films made for this series and the next.</p><p>On 20 September, during production for the ninth series, Hammond was seriously injured while driving a Vampire turbojet drag racing car at up to 314 miles per hour (505 km/h), as part of a planned feature, leading the BBC to postpone the broadcast of Best of Top Gear until a later date, and delaying production on the series until the presenter had recovered. Both the BBC and the Health and Safety Executive carried out inquiries into the accident, with filming later resuming on 5 October. The opening episode of the ninth series, aired on 28 January 2007, included footage of Hammond's crash; while it was not repeated like other episodes in the programme, it attracted higher ratings than the finale of Celebrity Big Brother, providing one of the highest ratings for BBC Two for a decade, alongside the series finale, which attracted around 8 million viewers.</p><p>Later that summer, on 25 July, the BBC aired a special edition episode entitled Top Gear: Polar Special. It was one of the first episodes of the programme to be shown in high-definition, and the third special to be produced, focusing on a race to the North Magnetic Pole, at its recorded location in 1996, between a \"polar modified\" Toyota Hilux and a dog sled. Considerable planning and co-ordination for the filming of the episode was conducted by both Top Gear's production team and Toyota, with both Clarkson and May, driving the Hilux, being the first people to reach the recorded location of the North Magnetic Pole by car. It was one of a number of challenges in which the presenters had to be focused and serious, despite the comedic scenes shown, with another being on 9 September, when the presenters, including The Stig, participated in the 2007 Britcar 24-hour race at Silverstone, using a race-prepared, second-hand diesel BMW 330d, fuelled by biodiesel refined from crops they had sown as part of an earlier feature.</p><p>With popularity for the show rising to considerable levels, the waiting list to get a ticket for a recording became extensive – an individual seeking a ticket, found that they would be required to wait for 21 years before securing a place. On 17 June 2008, Hammond and May revealed during an interview on BBC Radio 1's The Chris Moyles Show, that the eleventh series would feature a new \"host\" in the line-up, who was later revealed on the programme as \"Top Gear Stunt Man\", an individual who made few, occasional appearances on the programme. From the twelfth series, feature-length specials were created for the show, each visiting a different part of the world for a road trip using second-hand cars, with a number produced to be aired as a Christmas special. Despite growing popularity, an interview made with the Radio Times by Wilman revealed that future programmes would have less time devoted to big challenges, stating the following:</p><blockquote>\"We've looked back at the last two or three runs and noticed that a programme can get swallowed up by one monster film – a bit like one of those Yes albums from the 1970s where side one is just one track – so we're trying to calm down the prog-rock side. We'll inevitably still have big films, because it's the only way you can enjoy the three of them cocking about together, but they'll be shorter overall, and alongside we'll be inserting two- or three-minute punk songs.\"</blockquote><p>The success of the programme soon led to a live-version format being created called Top Gear Live; produced by a former producer of the programme, Rowland French, the touring show aimed to attempt to \"bring the TV show format to life... featuring breath-taking stunts, amazing special effects and blockbusting driving sequences featuring some of the world's best precision drivers\". The Live tour began on 30 October 2008 in Earls Court, London, moving on to Birmingham in November before being performed in at least 15 other countries worldwide.</p><p>As the 14th series was being broadcast in late 2009, the programme began to attract criticism from some viewers, over its predictability through the over-reliance on stunts and forced humour at the expense of serious content. On 13 December 2009, controller of BBC Two Janice Hadlow appeared on the BBC's Points of View to reject such comments, purely on the evidence of Top Gear's ratings and audience appreciation figures. However, a week later on 20 December, Wilman admitted that the three presenters were now \"playing to their TV cartoon characters a bit too much\". His statement included referring to \"this incarnation of Top Gear\" being close to its end, and that the production team would be working towards keeping its \"dignity still intact\", while experimenting with new ideas for the programme. Nevertheless, a one-off special of the long-running US news programme 60 Minutes featuring Clarkson, Hammond, and May, attracted 16 million viewers in October 2010.</p><h4>Clarkson's final warning, hiatus due to Clarkson's suspension and the end of an era: 2014–15</h4><p>Towards the end of 2014, the BBC became concerned over Clarkson's behaviour on the programme, including its production. Their concerns were raised by two incidents that year. The first involved an un-aired take from the 19th series emerging on national news media, featuring the presenter attempting to choose between two cars using the traditional rhyme \"Eeny, meeny, miny, moe\" but failing to censor the original version's use of the word nigger. The second involved an investigation into racism complaints by the regulator Ofcom, in regards to the show's \"Burma Special\", which led to the programme being found in breach of broadcasting rules: the presenters had been involved in constructing a bridge, when Clarkson, seeing an Asian man crossing it, remarked that the bridge \"had a slope on it\". As a result of these matters, the broadcaster issued a \"final warning\" against Clarkson. The programme then suffered another incident, when production of its next special in Argentina was dogged by major issues that placed the team at serious risk of harm, as one of the car licence plates had read \"H982 FKL\" in an alleged reference to the Falklands War of 1982. The controversial incident it created was covered by international news media, but despite the issues faced, the special was later aired as part of the BBC's Christmas schedule for 2014, though with amendments to its ending and the inclusion of an introduction for it.</p><p>On 10 March 2015, the 22nd series of the programme was abruptly put into hiatus by the BBC. The broadcaster's actions were the result of them suspending Clarkson in order to investigate allegations made against him, over verbal and physical abuse he had committed against one of the show's producers, Oisin Tymon. On 25 March, Clarkson's contract with the BBC was terminated, with Director-General of the BBC Tony Hall announcing that the remaining episodes future were uncertain until the broadcaster could determine how to air them out and complete the 22nd series. Clarkson's forced departure soon had a considerable impact on the programme, beginning with that year's Top Gear Live – as a result of the BBC's decision, the tour's name was changed to \"Clarkson, Hammond and May Live\" and announced on 1 April 2015. Wilman later revealed on 23 April that he would be resigning from the programme, along with Clarkson's co-presenters May and Hammond, having stated that they would not continue working on Top Gear without Clarkson; however, the group consented to making one final episode for the BBC consisting of the trio's final films, which was aired as a special on 28 June 2015. Following this episode, Hammond, May and Wilman joined up with Clarkson, and subsequently signed a deal with Amazon to produce a new motoring programme in the same vein as their former show, which debuted in 2016 under the title of The Grand Tour.</p><h4>Presenter reshuffling: 2016–2019</h4><p>Following the departure of Clarkson, and the subsequent departure of May, Hammond and Wilman, the BBC began searching for their replacements. On 16 June 2015, Chris Evans was confirmed as one of the new hosts, with it later suggested he would be hosting the show alone as part of a new format, despite a previous announcement that the broadcaster was holding open audition for his co-presenters; this claim was later dismissed as untrue. Although former Formula 1 driver David Coulthard had been widely reported to be joining the programme as a host, this was dismissed as speculation when he was revealed, on 11 January 2016, to be the new host of Channel 4's coverage for the 2016 F1 season. On 4 February, it was officially announced that American actor Matt LeBlanc was to join the show as Evans' co-host. On an edition of his BBC Radio 2 breakfast show, a week later, Evans revealed that both men would also be joined by Eddie Jordan, motoring journalist Chris Harris, German motor racing driver Sabine Schmitz, and motoring journalist Rory Reid.</p><p>Filming for the twenty-third series soon began in early 2016. While the show still retained the use of the show's presentation style and its test driver The Stig, the format received a number of changes – a small number of segments were dropped, the studio received a revamp to its layout, the celebrity segment was redesigned to feature a rallycross-styled challenge, while Evans and LeBlanc would front the show with the other co-presenters appearing \"when required\". On 27 April 2016, BBC Three announced that a spin-off programme to Top Gear had been commissioned, entitled Extra Gear. Designed to be aired after each episode of the new series was aired, its format focused on providing exclusive new content online – hosted by both Reid and Harris, the spin-off would consist of new footage, interviews, specially recorded films and behind-the-scenes access to the main programme.</p><p>A combination of delays with production and conflicts with scheduling, led to the premiere date of the 23rd series being pushed back to 29 May 2016. In addition, the new series aired with only six of the ten episodes that it promised to show. The new look of the show received mixed feedback from critics and viewers alike – although praise was given for the inclusion of LeBlanc, Harris and Reid, the new format was panned for its sluggish pace, the lack of humour in the studio segments, and the length of time spent on the revamped celebrity segment, \"Star in a Rally-Cross Car\". The most negative feedback received for the 23rd series was towards Evans' involvement – his presentation style was largely criticised, along with the lack of chemistry he had with LeBlanc. In addition to feedback, several newspaper articles highlighted the fact that the new series struggled to make reasonable viewing figures, with this partly blamed on its broadcast schedule putting it up against live broadcasts of the UEFA Euro 2016 championships. On 4 July, following the series finale, Evans announced his resignation from Top Gear, based on feedback. As a result, the BBC announced on 26 September that, among the remaining five presenters, LeBlanc would be joined by Harris and Reid to become the main hosts for the next series.</p><p>To make amends for its dismal performance, Top Gear underwent a more thorough revamp, which included redoing the studio, and redesigning the show's opening titles. The show's format was refocused on elements developed in early series, a deeper work on chemistry between the presenters, while also revising the celebrity segment – as the arrangement for the 23rd series had proven to be a failure, the segment returned to its original format.</p><h4>New era: 2019–present</h4><p>On 31 May 2018, LeBlanc announced he would be leaving the show after the twenty-sixth series in 2019. Andrew Flintoff and Paddy McGuinness were announced on 22 October 2018 to be replacing LeBlanc and joining Harris for the twenty-seventh series. As a part of the reshuffle Rory Reid was announced to be stepping down as a main host to present Extra Gear and make occasional appearances on the main show; however, Extra Gear did not return and so Reid moved to ITV4 to present Speed Freaks. The new presenting line-up received a positive reception compared to the mixed reviews of the previous few series.</p><p>During the broadcast of the twenty-eighth series in early 2020, it was announced that, from the twenty-ninth series, the show would move channels to BBC One following the positive reception of the new presenting lineup. The twenty-ninth series itself, which was broadcast in late 2020, also saw some changes as a result of filming and broadcast during the COVID-19 pandemic, including the show moving out of the studio and onto the runway, in a 'drive-in festival' style, to enable the audience members to remain physically distanced, and the dropping of the Star in a ... Car segment to maintain social distancing. Further changes were made to the thirtieth series, broadcast in early 2021, due to restrictions as a result of the COVID-19 pandemic: studio segments were recorded during a two-night shoot outside Television Centre, London, instead of the previous location at Dunsfold Aerodrome, with no full audience, and all of the films in the series were recorded in the UK. The new outdoor studio at Television Centre was retained for the thirty-first series, which was broadcast later that year.</p><p>The revamped show fronted by the new trio helped Top Gear increase viewership to numbers not seen since the departure of Clarkson, Hammond and May. The twenty-seventh series has also been one of the most popular shows for British 16 to 34 year olds.</p><p>On 4 August 2021, it was announced that production of the show would transfer to BBC Studios Bristol from the thirty-third series onwards; however, Dunsfold Aerodrome will still be used for filming.</p><br/><h3>Format</h3><p>Each episode of Top Gear focus a series of segments, switching between those filmed within the programme's main studio before a studio audience, and pre-recorded films conducted before the broadcast of an episode – these films primarily cover major segments of the episodes, with studio segments often used as links or breaks between them. The most common forms of segments used in the show's history are \"Car Reviews\", \"Power Laps\", \"Star in a ... Car\", \"Cool Wall\", \"Challenges\" and \"Races\".</p><h4>Car reviews</h4><p>A major segment of the programme, happening at least once in most episodes, it focuses on the presenters conducting a road-test of a car, looking at such factors as ride quality, speed, handling, practicality, and reliability. These reviews are conducted either on and around Top Gear's test track, or on the roads of Britain and abroad, and often focus on one car, primarily from well known car manufacturers. On a number of occasions, the review may feature more than one car from the same class, as well as include exotic/foreign models, and feature more than one presenter as a way of providing different opinions on the cars being reviewed and putting forth an argument over the model they believe is worthwhile to own.</p><p>Although the programme operated in a standard manner in the early series to the original format of car reviews in the 1977 show, it soon began to adopt an unusual approach of reviewing cars, by conducting an unusual test(s) to either put a vehicle through its paces in an arranged scenario, or to demonstrate and showcase an exceptional quality that it exhibited. An example of this comes from the \"Toyota Hilux Destruction\" film, divided between two episodes of the third series – to prove the strength of a Toyota Hilux pick-up truck, presenters Clarkson and May set about subjecting it to various, mainly destructive tests to see if it could survive against them and still run, allowing the use of tools for repair but prohibiting the replacement of any components (with the exception of the windscreen). Other notable uses of this unusual approach have included:</p><ul><li>Testing the ride quality of two off-road vehicles by having a passenger receive a tattoo in each vehicle as it is driven off-road, to see how smoothly it can be done in each.</li><li>Testing a car's handling, by racing it through a shopping centre against a more powerful, but much larger car.</li><li>Assigning the presenter's mothers with the duty of reviewing a small selection of cars.</li><li>Testing the comfort of a vehicle by chauffeuring a VIP to an event.</li></ul><p>Another unusual approach with car reviews was to conduct them in the form of a challenge. Examples of such \"review\" challenges have included:</p><ul><li>Road-testing cars in the style of \"Russian Roulette\", in which presenters did not know what they would get to drive and had to review it in the presence of their owners while driving them and their car back to their home.</li><li>Comparing the practicality of two new vehicles by operating them as taxi cabs for a night.</li><li>Spending 24 hours within a car without stepping out of it any point within the time period.</li><li>Taking an off-road vehicle up a mountain in Scotland.</li></ul><h4>Power laps</h4><p>This segment focuses on a featured car undergoing a timed lap of the programme's test track, with the car driven by The Stig. Often used after the main review of an episode, it mainly involved the car or cars from the review, though it sometimes featured vehicles that either had been reviewed in a previous episode but couldn't be put on the track due to problems or unfavourable conditions on the track, or were special models (such as racing versions of the car). On occasions when multiple cars did a timed lap, the episode either shows the film of each car one after the other, or alongside each other. After the film is shown, the presenter reveals the time to the studio audience and the viewer – abbreviations next to lap times, such as \"W\" for \"wet\", highlight if they were conducted under certain track conditions.</p><p>In order to qualify for a place on the Power Lap Board, cars that undergo a Power Lap must fulfil certain requirements:</p><ul><li>Roadworthy, and make use of standard road tyres.</li><li>Commercially available.</li><li>Able to negotiate a speed bump.</li></ul><p>As such, vehicles that do not qualify have their times mentioned, but do not get included on the Lapboard. Examples of this include the Renault F1 car (0:59.0) and the Caparo T1 (1:10.6), which were disqualified for failing the speed bump requirement; the Ferrari FXX (1:10.7), which was disqualified for using slick tyres; and the Pagani Zonda R (1:08.5), which was disqualified for not being road legal. In addition, non-production cars are also disallowed from the board, such as the Aston Martin DBR9 Le Mans racer.</p><h4>\"Star in a ... Car\"</h4><p>Another major segment in the programme, featured in the majority of episodes broadcast, the format for this involves a celebrity being invited to take part in a timed lap around Top Gear's test track in a car provided for the segment. They then join the presenters in the studio for an interview, mainly about their car history, their performance in the car and a look back to the highlights from their practice laps. After viewing footage of their timed lap, their time is stated and recorded onto a leaderboard, much in a similar fashion to lap times for Power Laps, including the use of abbreviations to denote track conditions the celebrity faced. In the event that the car being used was put of action by serious mechanical damage during practice sessions, a back-up car would be provided for the celebrity to use to continue practising, and/or to do their timed lap in. Although only one celebrity is involved in this segment, in a number of episodes, including the majority of the eleventh and twenty-third series, it sometimes featured two celebrities taking part, with footage of each timed lap shown one after the other.</p><p>From the first series to the twenty-second series, when the show was presented by Clarkson, Hammond and May, the segment was entitled as \"Star in a Reasonably Priced Car\" – its name was derived from the fact that the celebrities drove around the test track in an affordable car available on the market. The segment was often shown during the middle of an episode, and had the celebrities interviewed by Clarkson. The affordable car used in the segment was changed several times, each being replaced after a number of series – because the new car was often different, in terms of engine specifications, power, speed, handling, and other factors, a new leaderboard would be created a direct result. In addition, the introduction of a new car would be reserved for the opening episode, with the celebrity segment pre-recorded before the series began – it featured no interview, and involved a group of celebrities taking part to set a lap time in the new car. Up until the eighth series, the rules of the segment were that celebrities were given a set number of laps to do, with the fastest amongst these being recorded, but from the ninth series onwards, the rules were changed so that they were now given a few practice laps to get to grips with both the car and the track, before conducting a timed lap. In some episodes, the invited celebrity was a F1 driver, with the segment referred to as \"F1 Star in a Reasonably Priced Car\" – while it stuck to the standard format, the only difference was that the F1 drivers were restricted to the use of the first car used in the segment, which was retained to maintain fairness with those invited.</p><p>During Evans' short-lived tenure as the show's host, the twenty-third series saw the segment renamed \"Star in a Rally-Cross Car\". While it stuck to the same format as \"Reasonably Priced\", it featured a number of changes. The first change was that the interview, conducted with Evans, was much longer, with the celebrities involved discussing what was their favourite car in a certain field and the studio audience voting on which one they preferred. The second change, which was the primary reason for the change in name, was that celebrities drove around a specially modified, rally-cross version of the Top Gear test track – while it used the majority of the circuit, it featured two off-road sections and a small jump – in a rally-spec Mini Cooper. After the series ended, the segment received negative feedback and criticism from viewers and critics, and was dropped from the programme as a result.</p><p>From the twenty-fourth series onwards, the segment's format was revised, and renamed as \"Star in a Reasonably Fast Car\". While similar in format to \"Reasonably Priced\", in that celebrities were interviewed about their car history and did a timed lap around the test track, it featured a number of changes. Apart from the car being much faster the segment was split into two parts – the celebrity joined much earlier in the episode, discussed their car history with LeBlanc, Harris and Reid, gave some feedback on a film that had been shown prior to footage of their timed lap, and viewed footage of a practice lap in which Harris tutored them on how to get around the circuit in the new car, before the footage of their timed lap. This was altered slightly in Series 25, with it returning to only one part with the training run still shown. The segment was dropped in Series 29 to maintain social distancing during the COVID-19 pandemic, and did not return in later series.</p><h4>Challenges</h4><p>As part of Top Gear's format, every episode has contained at least a number of segments involving challenges. In the first few series, these were focused on novelty challenges and stunts that were typically based on absurd premises, such as a bus jumping over motorcycles (as opposed to the more typical scenario of a motorcycle jumping over buses) or a nun driving a monster truck. However, these later changed into situations in which the presenters were either competing against each other with a car they chose in a series of tests, or working together to accomplish a goal, with the tagline \"How hard can it be?\" becoming a common phrase for the introduction of some of the challenges featured on the programme. Challenges that appear in episodes, mainly fall under the following categories:</p><ul><li>\"Cheap Car\" – The presenters are each given a budget with which to buy a second-hand car, and must adhere to certain criteria associated with the challenge (e.g. the car must be from a particular decade, or not be designed for a certain purpose). These types of challenges are often done as a competition, in that the presenters' choices undergo a series of tasks, which they have no prior knowledge of, that are designed to determine how well each car fares on various aspects such as reliability and power. Each presenter is scored based on how well their car did in the task. The winner in such competitions is often the presenter who scored the most points.</li><li>\"Car Creation\" – The presenters take on the challenge of creating a vehicle, such as a police car or hovercraft, mainly using a car they feel will be good as the basis for their design. While they mostly work together to create something unique, occasionally they will make their own designs separately and then compete against each other to see whose design is the best. Regardless of the set-up, the presenters' creation will undergo a series of challenges designed to determine how well it has been made and how well it suits its purpose. Many of the cars created by the presenters were later displayed at World of Top Gear at the National Motor Museum, Beaulieu after their appearance.</li><li>\"Car Review\" Challenge (see Car Reviews above)</li><li>Car Sports – The presenters create their own versions of sports using cars as players, with such sports including football, rugby and ice hockey; tennis was also involved, though required a lot of editing. In 2006, a special episode entitled Top Gear Winter Olympics, featured the presenters partaking in a number of winter sport challenges that utilised cars, including a biathlon and downhill slope jumping.</li><li>Specialised – The presenters undergo a specially designed challenge, in which they attempt to tackle something unique. Such challenges have included participating in the Britcar 24-hour endurance race at Silverstone Circuit, presenting a drive-time radio show, conducting roadworks within 24 hours, and making a televised advertisement for a car.</li></ul><h4>Races</h4><p>Another part of the show's format was the inclusion of a race in every series by the presenters. Such races (which were sometimes referred to as \"epic\" by Clarkson) were mainly conducted over long distances, though each fell under a certain category:</p><ul><li>\"Car vs. Public Transport\" – In this race, one presenter took to driving between one location to another in a car, while the other presenters raced them to the finish line on another form of transport. The general emphasis on such races was to prove that a car could reach a destination much faster than by using the transportation involved in the race. Such races were usually edited to portray the result as close and to conceal the winner until the very end of the race (regardless of the actual closeness of the race).</li><li>Novelty Race – In these races, one of the presenters took to racing a car in a head-to-head race against an unusual opponent. Such races were arranged mainly to demonstrate the various strengths and, more often, weaknesses of cars, with opponents ranging from a marathon runner, to a pigeon and the postal service.</li><li>\"Cross City Race\" – One presenter takes the car and drives across the city from one point to another, while the others take on a different form of transport and try to beat them to the finish line.</li><li>Motorsport Race – Conducted in the fashion of a motor-racing event, these focused on bringing forth vehicles from a certain class, and racing them around a circuit to determine which one is the best. Such races involved racing drivers in control of the vehicle, and often led to fierce jostling between vehicles, usually resulting in some being knocked out of the race.</li><li>Specialised Race – Not conforming to any of the above categories, these races had unique conditions and rules to them. Such races have included an economy race, in which the presenters chose a car and had to reach a finish line on the amount of fuel their choice could carry, a race between old, very powerful racing cars and new showroom cars, and a race designed with a 1949 theme, between a car, a steam train and a motorbike, to see which was the fastest transportation method from that year.</li></ul><h4>The Cool Wall</h4><p>In \"The Cool Wall\", the segment focused on an argument between two of the presenters over which cars are cool and which are not, placing photographs of these on various sections of a large board divided into a series of categories: \"Seriously Uncool\", \"Uncool\", \"Cool\", and \"Sub Zero\". This segment was purely designed for comedy, as it was mainly handled by both Clarkson and Hammond since its introduction in the sixth episode of the first series, and both presenter often argued and attempted to put a car they liked into a category that the other refused to let it be a part of, with Clarkson basing some of his arguments on how the cars would impress actress Kristin Scott Thomas, and later, BBC newsreader Fiona Bruce. Cars were placed into a specific category depending on certain attributes, which, according to Andy Wilman, were not necessarily related to the quality of the car itself. An example of this is that a car considered to be \"fashionable\" may be deemed uncool if the impact it has is massive but short-lived and the perception of it is that it looks ridiculous. A notable rule of this segment was that the car becomes \"Seriously Uncool\" if a presenter buys one. The segment appeared frequently during early series acting as a low budget time filler segment but later appeared only a few times since the original Cool Wall was damaged at the start of the tenth series and also due to show being able to produce more pre-recorded film and challenge content due to the bigger budgets of later series. The final appearance of the Cool Wall occurred in the last episode of the sixteenth series though it still remained as part of the studio set until the end of twenty-second series. The Cool Wall was removed from the studio entirely ahead of the twenty third series after the studio was refurbished following the departure of Clarkson, Hammond and May from the show.</p><h4>Specials</h4><p>In 2006, Top Gear featured its first, feature-length, special edition episode, in which the presenters conducted a various challenges related to sporting events used in the Winter Olympics, in which cars took the place of athletes in each event. Following this special, the production team worked on creating additional, feature-length specials, in which the common theme was that the presenters conducted a road trip, mainly using a series of second-hand vehicles that they put through a series of challenges along their journey. The format often saw the presenters conduct a small filmed segment to provide an insight of what they were doing; the exception to this format was Top Gear's Polar Special. A number of specials were designed to be aired as a Top Gear \"Christmas Special\", with the last three split into two parts. These specials are listed below:</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th rowspan=\"2\">Special</th><th rowspan=\"2\">Airdate</th><th rowspan=\"2\" width=\"20%\">Mission</th><th colspan=\"3\">Vehicles</th><th rowspan=\"2\">Viewers<br>(millions)</th></tr><tr><th>Hammond</th><th>Clarkson</th><th>May</th></tr><tr><th style=\"text-align:left;\"><span>United States</span></th><td>11 February 2007</td><td>On a budget of $1,000, choose a car and drive from Miami to New Orleans across four states in second-hand American cars.</td><td><span class=\"mw-redirect\">Dodge Ram</span> <span style=\"font-size:85%;\">(1992)</span></td><td><span>Chevrolet Camaro</span> RS <span style=\"font-size:85%;\">(1989)</span></td><td><span>Cadillac Fleetwood Brougham</span> <span style=\"font-size:85%;\">(1989)</span></td><td>6.18</td></tr><tr><th style=\"text-align:left;\"><span>Polar</span></th><td>25 July 2007</td><td>Travel from <span>Resolute, Canada</span> to the <span class=\"mw-redirect\">Magnetic North Pole</span>.</td><td><span class=\"mw-redirect\">Dogsled</span></td><td colspan=\"2\" style=\"text-align:center;\"><span>Toyota Hilux</span> <span style=\"font-size:85%;\">(2007)</span></td><td>4.50</td></tr><tr><th style=\"text-align:left;\"><span>Botswana</span></th><td>4 November 2007</td><td>On a budget of £1,500, choose a car and travel from the Zimbabwean border to the Namibian border, a trip of 1,000 miles in second-hand and two-wheel drive cars available in-country.</td><td><span>Opel Kadett</span> <span style=\"font-size:85%;\">(1963)</span></td><td><span class=\"mw-redirect\">Lancia Beta Coupé</span> <span style=\"font-size:85%;\">(1981)</span></td><td><span>Mercedes-Benz 230E</span> <span style=\"font-size:85%;\">(1985)</span></td><td>6.84</td></tr><tr><th style=\"text-align:left;\"><span>Vietnam</span></th><td>28 December 2008</td><td>On a budget of ₫15,000,000 (roughly US$1000), travel from <span class=\"mw-redirect\">Saigon</span> to <span>Hạ Long</span> in eight days on second-hand motorcycles.</td><td>125cc <span>Minsk</span> <span style=\"font-size:85%;\">(1992)</span></td><td><span>Piaggio</span> <span>Vespa</span> <span style=\"font-size:85%;\">(1981)</span></td><td>50cc <span>Honda Super Cub</span></td><td>6.70</td></tr><tr><th style=\"text-align:left;\"><span>Bolivia</span></th><td>27 December 2009</td><td>Complete a 1,000-mile trek from the Bolivian rainforest to the Pacific coast of Chile in four-wheel drive vehicles bought online. Vehicle budget of £3,500.</td><td><span>Toyota Land Cruiser</span> <span style=\"font-size:85%;\">(1974)</span></td><td><span>Range Rover</span> <span style=\"font-size:85%;\">(1984)</span></td><td><span class=\"mw-redirect\">Suzuki Samurai</span> <span style=\"font-size:85%;\">(1988)</span></td><td>7.45</td></tr><tr><th style=\"text-align:left;\"><span>Middle East</span></th><td>26 December 2010</td><td>Travel from northern <span>Iraq</span> to <span>Bethlehem</span> in second-hand two seater convertibles, with a budget of £3,500.</td><td><span>Fiat Barchetta</span> <span style=\"font-size:85%;\">(2000)</span></td><td><span>Mazda MX-5</span> <span style=\"font-size:85%;\">(2000)</span></td><td><span>BMW Z3</span> <span style=\"font-size:85%;\">(1998)</span></td><td>7.68</td></tr><tr><th style=\"text-align:left;\"><span>India</span></th><td>28 December 2011</td><td>Travel across India from <span>Mumbai</span> to the Chinese border in British-built vehicles which cost less than £7,000.</td><td><span>Mini Cooper</span> <span style=\"font-size:85%;\">(2000)</span></td><td><span>Jaguar XJS</span> <span style=\"font-size:85%;\">(1995)</span></td><td><span>Rolls-Royce Silver Shadow</span> <span style=\"font-size:85%;\">(1975)</span></td><td>6.61</td></tr><tr><th style=\"text-align:left;\"><span class=\"mw-redirect\">Africa</span></th><td>3 March 2013 <span style=\"font-size:85%;\">(Part One)</span><br>10 March 2013 <span style=\"font-size:85%;\">(Part Two)</span></td><td>Find the true source of the <span>River Nile</span> driving second-hand <span class=\"mw-redirect\">estate cars</span> costing no more than £1,500.</td><td><span>Subaru Impreza WRX Estate</span> <span style=\"font-size:85%;\">(2002)</span></td><td><span>BMW 528i Touring</span> <span style=\"font-size:85%;\">(1999)</span></td><td><span>Volvo 850R Wagon</span> <span style=\"font-size:85%;\">(1996)</span></td><td>7.33 <span style=\"font-size:85%;\">(Part One)</span><br>7.48 <span style=\"font-size:85%;\">(Part Two)</span></td></tr><tr><th style=\"text-align:left;\"><span>Burma</span></th><td>9 March 2014 <span style=\"font-size:85%;\">(Part One)</span><br>16 March 2014 <span style=\"font-size:85%;\">(Part Two)</span></td><td>Cross <span class=\"mw-redirect\">Burma</span> in second-hand lorries, to construct a bridge over the <span>River Kwai</span>.</td><td colspan=\"2\"><span>Isuzu</span> TXD</td><td><span>Hino Ranger</span></td><td>6.29 <span style=\"font-size:85%;\">(Part One)</span><br>7.01 <span style=\"font-size:85%;\">(Part Two)</span></td></tr><tr><th style=\"text-align:left;\"><span>Patagonia</span></th><td>27 December 2014 <span style=\"font-size:85%;\">(Part One)</span><br>28 December 2014 <span style=\"font-size:85%;\">(Part Two)</span></td><td>A 1600-mile trek through <span>Patagonia</span> in order to stage a game of car football against Argentina.</td><td><span>Ford Mustang Mach 1</span> <span style=\"font-size:85%;\">(1971)</span></td><td><span>Porsche 928</span> GT <span style=\"font-size:85%;\">(1991)</span></td><td><span>Lotus Esprit</span> V8 <span style=\"font-size:85%;\">(1997)</span></td><td>7.21 <span style=\"font-size:85%;\">(Part One)</span><br>7.38 <span style=\"font-size:85%;\">(Part Two)</span></td></tr><tr><th rowspan=\"2\" style=\"text-align:left;\"><span>Nepal</span></th><td rowspan=\"2\">29 December 2019</td><td rowspan=\"2\">A high-altitude voyage from <span>Kathmandu</span> to the Forbidden City of <span class=\"mw-redirect\">Lo Manthang</span> in old cars.</td><th>Harris</th><th>McGuinness</th><th>Flintoff</th><td rowspan=\"2\">3.72</td></tr><tr><td><span>Renault 4</span></td><td><span>Peugeot 106 Rallye</span></td><td><span>Hulas</span> Mustang</td></tr><tr><th style=\"text-align:left;\"><span>Christmas</span></th><td>24 December 2021</td><td>Drive from <span>Bethlehem, Wales</span> to the <span>Top Gear test track</span>.</td><td><span>Citroen BX 4x4 GTi</span></td><td><span>Ford Escort XR3i</span></td><td><span>Range Rover</span></td><td>4.15</td></tr></tbody></table><h4>Award ceremony</h4><p>At the end of each autumn series, hosts Clarkson, Hammond and May presented an award ceremony, in which they picked out cars on various aspects. While some were serious, others were meant as jokes against cars that the presenters hated. One award given, was to one of the presenters, referred to as \"Cock of Year\", in which they had conducted a mistake while filming the show for that year, while another was given to the celebrity who drove well, and not necessarily the fastest.</p><p>The most important award given out in this special segment was \"car of the year,\" in which the only criterion was that all three presenters must come to a unanimous choice on the winning car. Past winners were:</p><ul><li>2002: Land Rover Range Rover</li><li>2003: Rolls-Royce Phantom</li><li>2004: Volkswagen Golf GTI</li><li>2005: Bugatti Veyron</li><li>2006: Lamborghini Gallardo Spyder</li><li>2007: Subaru Legacy Outback/Ford Mondeo (joint)</li><li>2008: Caterham Seven R500</li><li>2009: Lamborghini Gallardo LP550-2 Balboni</li><li>2010: Citroën DS3</li><li>2011: Range Rover Evoque</li><li>2012: Toyota GT86</li><li>2013: Ford Fiesta ST</li><li>2014: BMW i8</li></ul><p>In the final episode of the 14th series, a special award called \"Car of the Decade\" was given to mark the end of the 2000s, and was awarded to the Bugatti Veyron, primarily as it was the only car worthy of the award.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Series</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"3\">Originally aired</th><th scope=\"col\" rowspan=\"2\" style=\"padding:0 8px\">Average UK viewers<br>(in millions)</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th><th scope=\"col\" style=\"padding:0 8px\">Network</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">20 October 2002</td><td style=\"padding:0 8px\">29 December 2002</td><td rowspan=\"30\"><span>BBC Two</span></td><td>3.30</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">11 May 2003</td><td style=\"padding:0 8px\">20 July 2003</td><td>3.16</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">9</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">26 October 2003</td><td style=\"padding:0 8px\">28 December 2003</td><td>4.03</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">9 May 2004</td><td style=\"padding:0 8px\">1 August 2004</td><td>3.48</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">9</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">24 October 2004</td><td style=\"padding:0 8px\">26 December 2004</td><td>4.15</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">11</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">22 May 2005</td><td style=\"padding:0 8px\">7 August 2005</td><td>4.21</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>7</span></span></span></span></th><td colspan=\"2\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">13 November 2005</td><td style=\"padding:0 8px\">12 February 2006</td><td>4.61</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>8</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">7 May 2006</td><td style=\"padding:0 8px\">30 July 2006</td><td>4.45</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>9</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">28 January 2007</td><td style=\"padding:0 8px\">4 March 2007</td><td>7.45</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Special</span></span></span></span></th><td colspan=\"2\">1</td><td colspan=\"2\" style=\"padding:0.2em 0.4em\">25 July 2007</td><td>4.50</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>10</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">7 October 2007</td><td style=\"padding:0 8px\">23 December 2007</td><td>7.01</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>11</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">22 June 2008</td><td style=\"padding:0 8px\">27 July 2008</td><td>5.94</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>12</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">2 November 2008</td><td style=\"padding:0 8px\">28 December 2008</td><td>7.32</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>13</span></span></span></span></th><td colspan=\"2\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">21 June 2009</td><td style=\"padding:0 8px\">2 August 2009</td><td>7.17</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>14</span></span></span></span></th><td colspan=\"2\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">15 November 2009</td><td style=\"padding:0 8px\">3 January 2010</td><td>6.69</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>15</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">27 June 2010</td><td style=\"padding:0 8px\">1 August 2010</td><td>6.25</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>16</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">21 December 2010</td><td style=\"padding:0 8px\">27 February 2011</td><td>7.19</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>17</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">26 June 2011</td><td style=\"padding:0 8px\">31 July 2011</td><td>6.42</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>18</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">28 December 2011</td><td style=\"padding:0 8px\">11 March 2012</td><td>6.07</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>19</span></span></span></span></th><td colspan=\"2\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">27 January 2013</td><td style=\"padding:0 8px\">10 March 2013</td><td>6.58</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>20</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">30 June 2013</td><td style=\"padding:0 8px\">4 August 2013</td><td>5.31</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>21</span></span></span></span></th><td colspan=\"2\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">2 February 2014</td><td style=\"padding:0 8px\">16 March 2014</td><td>6.49</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>22</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">27 December 2014</td><td style=\"padding:0 8px\">28 June 2015</td><td>6.49</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Specials</span></span></span></span></th><td colspan=\"2\">2</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">26 December 2015</td><td style=\"padding:0 8px\">30 December 2015</td><td>1.79</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>23</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">29 May 2016</td><td style=\"padding:0 8px\">3 July 2016</td><td>3.89</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>24</span></span></span></span></th><td colspan=\"2\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">5 March 2017</td><td style=\"padding:0 8px\">23 April 2017</td><td>3.15</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>25</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">25 February 2018</td><td style=\"padding:0 8px\">1 April 2018</td><td>3.11</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>26</span></span></span></span></th><td colspan=\"2\">5</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">17 February 2019</td><td style=\"padding:0 8px\">17 March 2019</td><td>2.35</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>27</span></span></span></span></th><td colspan=\"2\">5</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">16 June 2019</td><td style=\"padding:0 8px\">14 July 2019</td><td>4.46</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>28</span></span></span></span></th><td colspan=\"2\">7</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">29 December 2019</td><td style=\"padding:0 8px\">1 March 2020</td><td>4.76</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>29</span></span></span></span></th><td colspan=\"2\">5</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">4 October 2020</td><td style=\"padding:0 8px\">1 November 2020</td><td rowspan=\"5\"><span>BBC One</span></td><td>5.68</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>30</span></span></span></span></th><td colspan=\"2\">4</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">14 March 2021</td><td style=\"padding:0 8px\">4 April 2021</td><td>6.42</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>31</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">14 November 2021</td><td style=\"padding:0 8px\">24 December 2021</td><td>5.72</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>32</span></span></span></span></th><td colspan=\"2\">5</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">5 June 2022</td><td style=\"padding:0 8px\">3 July 2022</td><td>3.93</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>33</span></span></span></span></th><td colspan=\"2\">5</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">30 October 2022</td><td style=\"padding:0 8px\">18 December 2022</td><td>4.39</td></tr></tbody></table><br/><h3>Broadcast</h3><p>First-run episodes of the programme are shown in the United Kingdom on BBC One, and BBC One HD (previously on BBC Two for the first twenty-eight series, BBC HD between the fourteenth and nineteenth series, and BBC Two HD between the twentieth and twenty-eighth series), with repeats also aired on BBC Three and Dave. All episodes have been available to watch on BBC iPlayer in the UK since mid-2021; episodes from the fifteenth to twenty-second series, as well as multiple specials from other series, were available on Netflix streaming before this. The popularity of the programme eventually led to Top Gear being broadcast internationally in 214 different territories by the end of 2014; however the show's publicist has stated that the oft-repeated claim of 350 million viewers per week is \"unreliable\".</p><p>Some of the countries where the programme is broadcast are listed below along with the channels it is transmitted on:</p><ul><li>Australia: Nine Network, GO!, 9Rush, Discovery Turbo, BBC Brit, Discovery Channel</li><li>Barbados: CBC TV 8</li><li>Belgium: Canvas</li><li>Brazil: Discovery Channel Brasil</li><li>Canada: BBC Canada</li><li>Czech Republic: Prima COOL</li><li>Denmark: TV3+, 6'eren, BBC Entertainment, BBC Knowledge</li><li>Finland: MTV3, MTV3 Max, FOX</li><li>Greece: Skai TV</li><li>Hungary: Viasat3, Viasat6, M2, RTL Spike</li><li>India: BBC Entertainment, AXN India</li><li>Indonesia: NET.</li><li>Iran: BBC Persian</li><li>Ireland: RTÉ Two, Setanta Ireland</li><li>Italy: Discovery Channel, DMAX, Spike</li><li>Malaysia: Media Prima's NTV7, HyppTV's BBC Knowledge</li><li>Netherlands: Veronica</li><li>New Zealand: Prime TV, TV3, TVNZ Duke</li><li>Pakistan: 24 News HD</li><li>Poland: BBC Brit</li><li>South Africa: BBC Entertainment, SABC 3</li><li>Sweden: Kanal 9</li><li>United States: BBC America, Motortrend</li></ul><br/><h3>Awards and nominations</h3><p>In November 2005, Top Gear won an International Emmy in the Non-Scripted Entertainment category. In the episode where the presenters showed the award to the studio audience, Clarkson joked that he was unable to go to New York to receive the award because he was busy writing the new script.</p><p>Top Gear has also been nominated in three consecutive years (2004–2006) for the British Academy Television Awards in the Best Feature category. Clarkson was also nominated in the best \"Entertainment Performance\" category in 2006. In 2004 and 2005, Top Gear was also nominated for a National Television Award in the Most Popular Factual Programme category; it won the award in 2006, 2007, 2008 and 2011. Accepting the award in October 2007, Richard Hammond made the comment that they really deserved it this year, because he didn't have to crash to get some sympathy votes. On 20 January 2010 Top Gear was once again nominated for a National Television Award, in the category \"Best Factual Programme\" however, they lost out to Loose Women.</p><p>Top Gear presenters have also announced on the programme that they have won some slightly lower profile awards. In Series 10, Richard Hammond won the award for the \"Best TV Haircut\" and James May won the award for the worst. All three presenters have won the award for Heat magazine's \"weirdest celebrity crush\" revealed during the news. In series 11, the Stig won an award from the Scouts for Services to Instruction. After revealing that, the Stig was shown \"attacking\" the Scouts, and the presenters coming to the conclusion that he is either terrified of Scouts or was a Girl Guide.</p><p>At the end of 2009 Top Gear was voted best programme of the decade in a Channel 4-commissioned survey, The Greatest TV Shows of the Noughties, ahead of The Apprentice and Doctor Who in second and third places respectively. Industry insiders and television pundits voted; also a thousand members of the public took part in a YouGov poll. The results were broadcast on Sunday 27 December 2009 at 9:00 pm, the same time as the Bolivia Special on BBC Two.</p><br/><h3>Controversies</h3><p>Top Gear has often been criticised for content inside programmes by some members of the public and by Ofcom. Most of the criticisms stem from comments from the presenting team; however, other aspects of the programme have been underlined as unsuitable. Incidents and content ranging from (but not limited to) remarks considered by some viewers to be offensive, promoting irresponsible driving, ridiculing environmental issues, Germans, Mexicans, and Poles, and alleged homophobia have generated complaints. In 2011, British actor Steve Coogan, who had appeared on Top Gear three times, wrote a Guardian article criticising the presenters' characterisations of Mexicans as lazy. He wrote: \"The Lads have this strange notion that if they are being offensive it bestows on them a kind of anti-establishment aura of coolness; in fact, like their leather jackets and jeans, it is uber-conservative (which isn't cool).\"</p><p>Top Gear has been accused of misrepresenting vehicle manufacturer Tesla in an episode first aired in 2008. The firm took Top Gear to court for libel and malicious falsehood after it suggested one of its Roadster vehicles had run out of power after only 55 miles. On 19 October 2011, the High Court of Justice in London rejected Tesla's libel claim, claiming the series is an entertainment programme and not an information programme.</p><p>Clarkson has been critical of the BBC over their handling of the programme. In the February 2006 issue of Top Gear magazine, he voiced his opinion that the BBC did not take Top Gear seriously. He has also commented on his dislike of BBC bosses for choosing the length of the series and for often replacing the programme with snooker (which Clarkson labelled as \"drunk men playing billiards\"), despite Top Gear having considerably higher viewing figures.</p><p>In March 2014, Indian-born actress Somi Guha made a formal complaint to BBC for $1.8 million, for a racist term used after building a bridge over the Kok River in the Burma Special. Upon its completion, Clarkson said, \"That's a proud moment, but there's a slope on it\", and Richard Hammond added, \"Yeah, right. It's definitely higher on that side\". This led to complaints that \"slope\" is a derogatory term for an Asian person. In April, Top Gear's executive producer Andy Wilman apologised for the racist remark. In July 2014, Ofcom ruled that the BBC had breached broadcasting rules by including this offensive racial term. In May 2014, there were complaints and calls for Clarkson to be sacked after it was revealed that he recited \"Eeny, meeny, miny, moe; catch a nigger by his toe\" as a children's rhyme on an unaired take from the show. Clarkson denied having used the word, then apologised when a previously unbroadcast clip revealed him doing so. Clarkson says that he had attempted to mumble the word. He has also revealed the production notes from the episode, which reads \"I didn't use the N-word here but I've just listened through my headphones and it sounds like I did. Is there another take?\"</p><p>Top Gear also received extensive criticism in late October 2014 during filming of an episode for Series 22 in Argentina. The presenters and the associated film crew were chased out of the country by angry protesters allegedly throwing rocks at the team. This was in protest against the number plate, H982 FKL, on Jeremy Clarkson's Porsche 928 GT, which was believed to make reference to the 1982 Falklands War. Another set of plates with the registration number BE11 END (\"bellend\") on them were found in the car, which were interpreted as another indication of a premeditated plot to mock the country. The BBC maintained that the registration number was pure coincidence.</p><p>The show also received widespread criticism after the sacking of Jeremy Clarkson, and subsequent resignations of James May and Richard Hammond. The criticism continued for the first episode of the following series, hosted by Chris Evans and Matt LeBlanc.</p><br/><h3>International versions</h3><p>The popularity of the original UK series eventually led to the creation of a number of international versions, each with local production teams and presenters, all made under licence from BBC Studios:</p><h4>Australia</h4><p>On 19 November 2007, it was revealed that a localised Australian series of Top Gear would be produced by the Special Broadcasting Service network in conjunction with Freehand Productions, BBC Worldwide's Australasian partner. This announcement marks the first time a deal has been struck for a version of Top Gear to be produced exclusively for a foreign market. No indication was given as to the exact makeup of the series, other than that it would have a distinctly Australian style. SBS ran a competition to find hosts for the series, and in May 2008 confirmed that the presenters for the Australian programme were to be Charlie Cox, Warren Brown, Steve Pizzati and a local \"cousin\" of the Stig. James Morrison replaced Charlie for the second series of Top Gear Australia. Top Gear host Jeremy Clarkson added, \"I'm delighted that Top Gear is going to Australia.\" It was announced that the Nine Network had secured the rights to the local and UK versions from 2010 on both its Nine and Go! (digital TV) stations. On 20 June 2010, it was announced that actor and comedian Shane Jacobson and Top Gear Australia magazine editor Ewen Page would join a returning Steve Pizzati to present the programme which premiered on 28 September 2010. The Australian version has received lacklustre reviews. Eventually, Top Gear UK and Top Gear Australia met up and challenged each other. Top Gear Australia was cancelled in September 2011.</p><h4>Russia</h4><p>On 14 October 2008, the Top Gear website confirmed that a Russian edition of the programme was scheduled for production by the end of that year. Initially, 15 episodes were scheduled. It was revealed on 20 December that the pilot, branded Top Gear: Russian Version, was filmed for broadcast on 22 February 2009. The format is similar to its British counterpart, with three hosts: an ex rock guitarist Nikolai Fomenko, an ex-MTV Russia VJ Oscar Kuchera, and a former automotive journalist Mikhail Petrovsky.</p><p>After only half of the first series, broadcasting of the Russian version ceased due to viewers' criticism. The channel switched to broadcasting the British version of the series from then on.</p><h4>United States</h4><p>News of an American version of Top Gear surfaced in January 2006, when the official Top Gear website ran a feature about the filming of an American version of the series, produced by the Discovery Channel. The pilot featured Bruno Massel as one of the hosts, but it was not picked up by the network, which later began running edited versions of Series 1–5 of the UK original.</p><p>NBC announced it ordered a pilot episode for an American version of Top Gear to be produced by BBC Worldwide America. The pilot, filmed in June 2008, was presented by television and radio host Adam Carolla, rally driver Tanner Foust, and television carpenter Eric Stromer. However, following the failure of a car-themed drama, NBC did not place the program on its schedule, indicating it planned to hold it as a spring/summer (2009) series replacement. Eventually, NBC dropped the series.</p><p>Eventually, however, the History cable channel had picked up the series and ordered between 10 and 12 episodes. The series began production in August 2010, with a premiere on 21 November 2010. A trailer was released in early August showing footage of the hosts simulating a \"Moonshine run\". Tanner Foust remained as a host, and was joined by comedian/actor Adam Ferrara and racing analyst Rutledge Wood. In total, the show aired 72 episodes across 6 seasons between 2010 and 2016.</p><p>In 2017, a new American adaptation of Top Gear was announced, called Top Gear America. The programme was hosted by Tom Ford, William Fichtner and Antron Brown, and ran for one season of eight episodes that was broadcast on BBC America between July and September 2017.</p><p>In 2019, the programme was moved to MotorTrend, where it was then revived for more seasons, and Ford, Fichtner and Brown were replaced by Dax Shepard, Rob Corddry, and Jethro Bovingdon.</p><p>At present, 29 episodes of Top Gear America have aired across three seasons since 30 July 2017.</p><h4>South Korea</h4><p>On 20 August 2011, the first series of the Korean version of Top Gear, produced by the XTM Channel, was aired with 13 episodes. On 8 April 2012, the second series of 10 episodes began.</p><p>Past presenters are Kim Kap-soo, Jo Min-ki, Park Jun-gyu and Yeon Jung-hoon, with the current presenters being Ryu Si-won, Danny Ahn, and Kim Jin-pyo. The fourth series was launched in April 2013.</p><h4>China</h4><p>The first attempt at a Chinese Top Gear was in 2011. Fifteen minutes of the pilot leaked before the airdate but was promptly removed at the BBC's request.</p><p>In May 2014, BBC announced that it has signed a deal with Honyee Media to produce a local version of Top Gear in China. On 13 November 2014, the first series of the Top Gear China premiered on Shanghai Dragon Television, presented by Cheng Lei, a veteran Chinese TV presenter, Richie Jen, a Taiwanese singer and actor, and Tian Liang, a former Olympic gold-medalist in diving.</p><h4>France</h4><p>A French version of Top Gear began in 2015 on RMC Découverte, NextRadioTV's free-to-air channel. It is presented by the actor Philippe Lellouche, the professional driver Bruce Jouanny and Yann Larret-Menezo, an electronic music artist and journalist.</p><p>Filming was at the end of 2014 and in January 2015 on the aérodrome de Brienne-le-Château near Troyes.</p><p>The first series consists of 10 episodes including three made of highlights of the series.</p><p>The first episode, broadcast on 18 March 2015 at 20:45, broke RMC Découverte's audience record with 966,000 viewers (3.6% audience share).</p><h4>Italy</h4><p>There is also an Italian version of Top Gear, from 22 March to 26 April 2016. The show was broadcast on Sky Uno and Sky Sport Mix, and was hosted by Joe Bastianich, Guido Meda, Davide Valsecchi and The Stig. The Italian version was similar to the UK version.</p><h4>Hong Kong</h4><p>In October 2011, a Hong Kong version of Top Gear was launched. Unlike other Top Gear shows, Top Gear Hong Kong is not broadcast as a television show, but it is presented on a YouTube channel called TopGear HK 極速誌. A monthly magazine is also run and sold in Hong Kong. As of August 2021, TopGear HK 極速誌 has 178k subscribers on YouTube.</p><h4>Sweden</h4><p>In 2019, it was announced that Top Gear would be given three Scandinavian adaptations. The Swedish adaptation, Top Gear Sverige, aired on Kanal 5 during 2020 and was presented by six times Speedway World Champion Tony Rickardsson, actor, comedian & musician Marko Lethosalo, and TV personality Adam Alsing.</p><h4>Denmark</h4><p>The Danish adaptation of Top Gear, known as Top Gear Danmark, aired on Kanal 5 for one series in 2020 and was presented by TV personality Felix Smith, actor Dar Salim and former racing driver Jesper Carlsen.</p><h4>Norway</h4><p>The Norwegian adaptation of Top Gear, called Top Gear Norge, was broadcast on TVNorge in 2020 and was presented by stunt driver Fredric Aasbø, musician Esben \"Dansken\" Selvig and TV presenter Petter Schjerven.</p><br/>"
  },
  "errorMessage": ""
}