{
  "imDbId": "tt0903747",
  "title": "Breaking Bad",
  "fullTitle": "Breaking Bad (TV Series 2008–2013)",
  "type": "TVSeries",
  "year": "2008",
  "items": [
    {
      "username": "FiRE010",
      "userUrl": "https://www.imdb.com/user/ur128165243",
      "reviewLink": "https://www.imdb.com/review/rw7088846",
      "warningSpoilers": false,
      "date": "4 July 2021",
      "rate": "10",
      "helpful": "1,026 out of 1,086 found this helpful.",
      "title": "Really Great",
      "content": "I have never watched a show that is as consistently genuine and engaging as Breaking Bad. This is undoubtedly one of the greatest shows ever, and it consistently improves as it progresses.The Journeys of Walter White and Jesse Pinkman are unforgettable. These are some of the best-written characters to ever come from a pen-hitting paper.My praises for the acting and cinematography are unending. Some of the shots are intricate works of art, and I was rarely distracted by the acting. The performances are excellent to the extent that it feels improper to refer to them as performances.Overall, Breaking Bad consistently maintains a level of engagement and technical quality seen in only the best of movies, and in terms of tone, every intense moment is executed with excellence and always achieves the impact it reaches for.I feel like the show's plot in the early seasons lacks a certain level of complexity due to it not having a vast amount of plot threads, and the start is a bit slow-paced, but Breaking Bad is an absolute must-watch. If you have mixed feelings towards Season 1, trust me, it is only uphill from there.If there was ever a series you could call perfect, I think this might be it."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw7530139",
      "warningSpoilers": false,
      "date": "9 November 2021",
      "rate": "10",
      "helpful": "283 out of 310 found this helpful.",
      "title": "Damn near perfect!",
      "content": "Breaking Bad is absolutely, without a doubt, one of the greatest tv shows ever created...it's damn near perfect! I know that people say that about a ton of different shows but Breaking Bad really is universally thought of as one of the greatest shows of all-time. All you have to do is go google \"greatest tv shows of all-time\" and I guarantee you that it's at or near the top of every list you'll find and there's a reason for that...because it is! Every season is just as brilliant as the others, which everyone knows is almost impossible for a show to do but one which Breaking Bad absolutely pulls off!! If you're one of the few people who still haven't seen this amazing show then do yourself a favor and go watch this immediately...you will not be disappointed!"
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3856786",
      "warningSpoilers": false,
      "date": "13 November 2017",
      "rate": "10",
      "helpful": "428 out of 498 found this helpful.",
      "title": "Among the best and most addictive shows there is",
      "content": "'Breaking Bad' is one of the most popular rated shows on IMDb, is one of those rarities where every season has either been very positively received or near-universally acclaimed critically and where all of my friends have said nothing but great things about.Very few shows in recent memory had me so hooked from the very start that before the week was over the whole show had been watched, especially when for a lot of shows now airing watching one episode all the way through can be an endeavour. 'Breaking Bad' had that effect on me, and its reputation as one of the best, consistently brilliant and most addictive shows in many years (maybe even ever) is more than deserved in my eyes. Its weakest season is perhaps the first season, understandable as any show's first season is the one where things are still settling.Actually everything is established remarkably from the very start, but once the writing and characterisation becomes even meatier the show reaches even higher levels.Visually, 'Breaking Bad' is one of those shows that is both stylish and beautiful, with photography and editing that are cinematic quality and put a lot of films today to shame, where there are a lot of visually beautiful ones but also some painfully amateurish looking ones. The music always has the appropriate mood, never too intrusive, never too muted.The writing for 'Breaking Bad' is a fine example to all shows of how to have a lot of style but also to have a lot of substance. The dialogue throughout is thought-provoking and tense, while also have a darkly wicked sense of humour and heart-tugging pathos. The stories are texturally rich, intimate, tense and layered, with the pace of them consistently deliberate but taut. The direction couldn't be better.Can't say anything bad about the acting. Bryan Cranston is phenomenal as one of the most fascinating anti-heroes, or even of any kind of character, in either film or television. Aaron Paul has never been better and Anna Gunn is affecting. The characters are compelling in their realism.Overall, describing it as brilliant doesn't do 'Breaking Bad' justice. 10/10 Bethany Cox"
    },
    {
      "username": "KinoKoopaKid",
      "userUrl": "https://www.imdb.com/user/ur135021534",
      "reviewLink": "https://www.imdb.com/review/rw7178102",
      "warningSpoilers": false,
      "date": "30 July 2021",
      "rate": "10",
      "helpful": "285 out of 307 found this helpful.",
      "title": "99.1% pure",
      "content": "One of the greatest shows ever, the pacing is excellent. The characters are well developed and entertaining. The show ties everything together very neatly. It's honestly a show that get's better each time you view it. It's cathartic to see Walter break bad and how the story unravels is the best way it could have. Very good storytelling, well done to Vince Gilligan."
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw2939980",
      "warningSpoilers": false,
      "date": "12 January 2014",
      "rate": "10",
      "helpful": "1,016 out of 1,214 found this helpful.",
      "title": "If you mix Scarface, Robin Hood and maybe Tyler Durden with enough meth - you'll get a mean cocktail called 'Heisenberg'",
      "content": "If you are among the few who haven't seen it yet: believe the hype, it really is THAT good. Breaking Bad may not depict reality the way 'Generation Kill' or 'The Wire' did - but then it's not about that, either. From an artistic point of view - performances, writing, direction, camera, music - this show is every bit as good as the other two mentioned above, but unlike those, 'Breaking Bad' just wants to entertain and therefore enjoys a lot more creative freedom.The show plays like the daydream fantasy of any underachieving, struggling middle class family man who's had to bury all his dreams (I mean: who wouldn't want to be a meth-kingpin for a little while?), before it turns into a nightmare. One could almost say that 'Heisenberg' is Walter White's 'Tyler Durden'(for those who don't get the reference: watch 'Fight Club' - you won't regret it).For pure entertainment value, this is simply the best show I've ever seen. Every single one of the main characters has already reached the status of a screen icon - when does that ever happen?! Most fun I've ever had watching a TV-show and an instant classic."
    },
    {
      "username": "jehuschultz",
      "userUrl": "https://www.imdb.com/user/ur89521583",
      "reviewLink": "https://www.imdb.com/review/rw5495416",
      "warningSpoilers": false,
      "date": "19 February 2020",
      "rate": "10",
      "helpful": "1,493 out of 1,648 found this helpful.",
      "title": "The Best",
      "content": "I cannot stress enough how good this show is. I've watched a lot of TV in my life and this show still remains the best show I've ever seen."
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8725086",
      "warningSpoilers": false,
      "date": "9 December 2022",
      "rate": "10",
      "helpful": "68 out of 76 found this helpful.",
      "title": "Absolutely Brilliant!!",
      "content": "Breaking Bad is every bit as good as everyone says it is. It's easily one of my favorites shows of all-time and one of the best shows in the history of television. Just read through the reviews and look at the 9.5 rating to see how loved this show really is. The writing and acting is what makes this show so special. I love this show so much that I've already watched it all the way through twice already and plan on doing so again sometime in the near future. There's nothing more I can say about this incredible show that hasn't already been said so just go watch it. But plan ahead to give yourself enough time because you're going to want to binge this as quickly as you can. It's addicting once you start!"
    },
    {
      "username": "bruhperson",
      "userUrl": "https://www.imdb.com/user/ur100125831",
      "reviewLink": "https://www.imdb.com/review/rw4705146",
      "warningSpoilers": false,
      "date": "7 March 2019",
      "rate": "10",
      "helpful": "4,034 out of 4,378 found this helpful.",
      "title": "It's ok I guess",
      "content": "Re-Watched it 7 times and counting. I guess I liked it."
    },
    {
      "username": "dhanushreddy-14919",
      "userUrl": "https://www.imdb.com/user/ur122376478",
      "reviewLink": "https://www.imdb.com/review/rw7137780",
      "warningSpoilers": false,
      "date": "18 July 2021",
      "rate": "10",
      "helpful": "253 out of 283 found this helpful.",
      "title": "ABSOLUTE PERFECTION!!!!",
      "content": "Direction- PERFECT!!Screenplay-PERFECT!!Writing-PERFECT!!Score-PERFECT!!Cinematography-PERFECT!!Casting-PERFECT!!Beginning-PERFECT!!Climax-PERFECT!!Acting-BEYOND PERFECT!!Overall-(as I said) ABSOLUTE PERFECTION."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw6881910",
      "warningSpoilers": true,
      "date": "5 May 2021",
      "rate": "10",
      "helpful": "156 out of 191 found this helpful.",
      "title": "Every bit as good as you've heard",
      "content": "I'd put off watching BREAKING BAD for years and years, not being particularly interested in a contemporary story about a couple of drug dealers, but I needn't have worried. This is a series that lives up to all the accolades, just as involving and gripping as I'd hoped. About half a dozen actors give career best performances as characters that evolve slowly and realistically over five seasons, and the depth is incredible, along with the refusal to paint a single person in black and white. Humour, suspense, action and the depths of the human existence being frequently explored; there's really nothing better."
    },
    {
      "username": "FishDrowned",
      "userUrl": "https://www.imdb.com/user/ur142431060",
      "reviewLink": "https://www.imdb.com/review/rw7529887",
      "warningSpoilers": false,
      "date": "9 November 2021",
      "rate": "10",
      "helpful": "85 out of 97 found this helpful.",
      "title": "By far the greatest show I've ever watched",
      "content": "Breaking Bad feels like fever dream. A really REALLY good fever dream. The directing is absolutely perfect. The characters bounce off each other in this really well done way. I can really feel the true emotion and pure character coming from each one. I can feel the greed, lust, money hunger animals each of these characters are. There are no true heroes in this story (except hank I love u)."
    },
    {
      "username": "napierslogs",
      "userUrl": "https://www.imdb.com/user/ur1977084",
      "reviewLink": "https://www.imdb.com/review/rw2251230",
      "warningSpoilers": true,
      "date": "17 May 2010",
      "rate": "10",
      "helpful": "832 out of 1,094 found this helpful.",
      "title": "Breaking Bad is the best television show",
      "content": "\"Breaking Bad\" is the best television show. Ever.We start out with one main character, Walter White (played by Bryan Cranston), who is struggling to make ends meet working both as a high school chemistry teacher and part time at a car wash. Then he gets diagnosed with cancer. Then he breaks bad.Teaming up with an unlikely sidekick, Jesse Pinkman (played by Aaron Paul), who is the immature \"yo, bitch\"-spouting, high-school-screw-up small-time drug dealer, Walt and Jesse both put their skills towards the drug world to try to make good by their families.This show has been masterfully put together with layer upon layer of insight into some of the most interesting characters ever realized in the history of television. We have some very dark characters, and a lot of grey characters, and it all adds up to brilliant dialogue and plot lines.The creator, writers, directors and actors have paid attention to every single detail, putting thought into every nuance in every character in every scene. Because of this attention to detail there is something for everyone in this show. Every thinking brain will immediately be attracted to the intelligence so evidently on display, that even if you're not a drug dealing chemist living in Albuquerque, you will find something in the characters that connects you to them and makes you hang on for dear life.Get on your couch now and start watching \"Breaking Bad\" from the very beginning, and don't miss a single scene."
    },
    {
      "username": "pranavagarwal-77843",
      "userUrl": "https://www.imdb.com/user/ur93637358",
      "reviewLink": "https://www.imdb.com/review/rw4826116",
      "warningSpoilers": false,
      "date": "4 May 2019",
      "rate": "10",
      "helpful": "2,741 out of 3,059 found this helpful.",
      "title": "Dont watch this show",
      "content": "Dont you ever watch this show as it is so perfect u will never be able to watch another show"
    },
    {
      "username": "EVON1TY",
      "userUrl": "https://www.imdb.com/user/ur47939660",
      "reviewLink": "https://www.imdb.com/review/rw8903827",
      "warningSpoilers": false,
      "date": "3 March 2023",
      "rate": "10",
      "helpful": "25 out of 28 found this helpful.",
      "title": "Truly Amazing, Wonderful, 99.1 Pure Perfect ⭐",
      "content": "This serie is unique. This is somehow realistic and amazing also. Even if you're going to watch for find the flaws, I bet you can't find real major flaws in this serie. You know some people are just tries to find nonsense things in contents. (I mean in a movie or TV show) They are hard to pleased but even those people can enjoy this serie, because they really can't find one easily.I don't know how Vince Gilligan think this serie. It is real complicated and amazing story. He's a true genius that deserves so much more. He shared the golden age of TV Shows with Game of Thrones. It is best crime, drama TV series possible. And it ended with the best way possible.The actings are quite remarkable. I don't know how we were'nt know the name Bryan Cranston, I don't know how he didn't became a big star before this show. Giancarlo Esposito, Aaron Paul, Anna Gunn Jonathan Bakns and Bob Odenkirk is also pretty amazing. Nearly all cast did a perfect job.Cinematography is so good in this serie. Not only looks great but also brings realistic style with that shaking camera sequences. You feel the moment with silence.Costume Design is also underrated. Did you know that characters has his own colors that reflects his personality? I know, it isn't a secret, many people know that but it really is something great.Also makeups are pretty good, did you know Bryan Cranston had hair when he's bald? Yes there was hair behind that. I know it's not that hard thing to do, It's not magic. But also wounded characters are too realistic. Especially Jesse's wounded face."
    },
    {
      "username": "valis1949",
      "userUrl": "https://www.imdb.com/user/ur3173363",
      "reviewLink": "https://www.imdb.com/review/rw2029161",
      "warningSpoilers": false,
      "date": "26 February 2009",
      "rate": "10",
      "helpful": "779 out of 1,049 found this helpful.",
      "title": "Mind Blowing",
      "content": "BREAKING BAD:Season One explodes like a sucker punch to the gut, and is nothing short of mind-blowing. The pilot for this series is a definite \"Must See\", and stands with the greats of Action/Adventure Television and Cinema. This segment begins at such a giddy peak, that you think the only way forward would be to tell the tale as a long flashback. However, through a marvelous piece of editing and writing, the plot miraculously moves forward from that point. Bryon Cranston's idiosyncratic performance is a joy to behold. He embodies a man who is against a rock, and an even harder place, who has no other option but to throttle his higher aspirations and grimly carry on. His solace and validation in middle-class morality and virtuous conduct is long gone. I eagerly look forward to more of this ambitious, entertaining series."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw6345229",
      "warningSpoilers": true,
      "date": "7 December 2020",
      "rate": "10",
      "helpful": "113 out of 146 found this helpful.",
      "title": "Loving it so far...",
      "content": "Review of Season One:This is one of those shows I missed the first time around but was eager to catch up with having heard so many good things. Having just watched the short first season, I can report I love it. It starts off strongly with no messing about, and then delves deep into character work for a few episodes before bringing it back on a high at the climax. The acting is of a very fine calibre and the elements of blacker-than-black humour add immeasurably to the entertainment value. A good show all round, and I look forward to seeing where they take it from here."
    },
    {
      "username": "kotaracmarinmile",
      "userUrl": "https://www.imdb.com/user/ur159515686",
      "reviewLink": "https://www.imdb.com/review/rw8712582",
      "warningSpoilers": true,
      "date": "3 December 2022",
      "rate": "10",
      "helpful": "30 out of 30 found this helpful.",
      "title": "What should I say?",
      "content": "10/10 acting, 10/10 characters, every Episode has been amazing (Especialy Ozymandias, Felina, 4 Days Out, Pilot etc..) Vince Gilligan made one of the greatest fictional characters ever like Walter White, Gustavo Fring and Saul Goodman AND also the best ever rated TV episode Ozymandias which has an 10/10 rating on here. I trurly enjoyed watching this Series and Im kinda sad that I finished it, I just wish sometimes that I forget the whole Story so I can watch it all over again. I cant wait to watch Better Call Saul and El Camino and who knows, maybe we could get surprised with an Gus Fring Series too."
    },
    {
      "username": "lerrom",
      "userUrl": "https://www.imdb.com/user/ur112246926",
      "reviewLink": "https://www.imdb.com/review/rw8603483",
      "warningSpoilers": false,
      "date": "11 October 2022",
      "rate": "10",
      "helpful": "37 out of 43 found this helpful.",
      "title": "If I could rate it 20/10, I would.",
      "content": "Where do I even begin? The writing is near perfect, the actors and characters are all amazing, the over-arching story just gets only better and better. This show is just a bullet train, this just goes and refuses to stop. It pulls no punches, everything that happens has all the impact. And honestly, there isn't a single bad episode. Every episode, yes even \"Fly\", serves a purpose, and honestly, shouldn't be skipped over upon first viewing. And for a show that ended in 2013, it's still relatively popular and beloved among people. Everyone I know still loves the show and loves it to death.There isn't much else to say, other than that this show is perfect. 10/10."
    },
    {
      "username": "p-57286",
      "userUrl": "https://www.imdb.com/user/ur156555023",
      "reviewLink": "https://www.imdb.com/review/rw8668835",
      "warningSpoilers": false,
      "date": "11 November 2022",
      "rate": "10",
      "helpful": "23 out of 25 found this helpful.",
      "title": "The most cinematic television show of all time",
      "content": "Breaking Bad is a perfect series. This is a fact. In the past, there were movies and series. They lived in a very different universe from each other. Nowadays there are cinematographic television series. In the 70s, 80s and 90s, series such as Full House, Seinfield and Family Ties with the formula of Sitcom and Miami Vice, 21 Jump Street and Starsky and Hutch with the formula of detective fiction appeared. In 1992, Twin Peaks appeared, a series with episodes of almost an hour long, with a cinematic style, including having been created by a film director, David Lynch. Other series emerged with a cinematic style, such as The Wire, Oz, Mad Men and The Sopranos. Breaking Bad is the most cinematic of them all. Walter White is the most complex and best-developed character in the history of world television. There are dozens and dozens of memorable and memorable scenes in Breaking Bad. The series holds up great over five seasons, which is no easy feat. It's also impressive how the series managed to build a sensational episode in which more than 30 minutes of episode take place inside a laboratory. The episode \"The Fly\", serves to develop the relationship between Walt and Jessie. The figure of Walt\\Heisenberg is a very emblematic figure. He is the personification of the anti-hero. The series remains one of the best series of all time or perhaps the best."
    },
    {
      "username": "tobydale",
      "userUrl": "https://www.imdb.com/user/ur23897356",
      "reviewLink": "https://www.imdb.com/review/rw8587299",
      "warningSpoilers": false,
      "date": "4 October 2022",
      "rate": "10",
      "helpful": "26 out of 31 found this helpful.",
      "title": "This is brilliant",
      "content": "What hasn't already been said about Breaking Bad?It's brilliant.4,500+ reviewers here on IMDB have probably said all that needs saying - but I've just watched it all through again and I'm gonna add my bit.We don't know the drug producing criminal underworld. We don't know the anger of a frustrated genius. We (in the main) don't know how we would think if we had cancer and not much time to provide for our family. Breaking Bad starts with these things and boy - does it get bad...!Everything about this works. There is a bit of Jesse in all of us, a bit of Walt in all of us, Skyler, Marie, Hank - they are all a lot like us. But some have different capabilities than others.... The characters and acting is excellent, the camera work in New Mexico superb. The story, drama and the build-ups are relentless.It's the descent, the ego, the destruction of - pretty much everything. Then there is the fragility, the feeling of \"in-too-deep\"; so many feelings are brought to the surface here - all in a completely extreme but somehow believable way. Breaking Bad is extraordinary."
    },
    {
      "username": "otnememento-2",
      "userUrl": "https://www.imdb.com/user/ur19665877",
      "reviewLink": "https://www.imdb.com/review/rw5499460",
      "warningSpoilers": false,
      "date": "21 February 2020",
      "rate": "10",
      "helpful": "320 out of 444 found this helpful.",
      "title": "The best",
      "content": "The best series I have seen in my whole life, even better than the wire."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw3179838",
      "warningSpoilers": false,
      "date": "8 February 2015",
      "rate": "10",
      "helpful": "67 out of 89 found this helpful.",
      "title": "arguably the greatest dramatic series... ever?",
      "content": "It's hard for me to be super objective about this show. Over the course of 62 episodes, right from the start, for me, Vince Gilligan and his team of writers and directors crafted a piece of neo-noir-western American tragedy that almost never, if ever, lost its footing. In its story of the rise and fall of Walter White (or his fun alias Heisenberg) and how he becomes a Meth \"Emperor\" in Albuquerque during his run of lung cancer, we get all kinds of dramaturgy here. There's conflict, conflict, conflict going on in this show, always, from the familial (what do I tell my wife, Skylar, or not tell her, what doesn't she tell me, how far do the lies and deceit and horrors go?) to the more genre-leaning (how much criminals go in their crazy s***, which is established early on with the throw of the particular chemical and the \"This... is not Meth\" explosion) to the dark comedy that gives the Coens a run for their money (Better Call Saul!) - not to mention how it made Aaron Paul just as much as star as Bryan Cranston, both working actors along with Anna Gunn, Dean Norris, Betsy Brandt and Bob Odenkirk. It all... fits.Often with a show it's easy to let things slip, even (or especially) on the great shows when it comes to character dynamics, repetition, things that can be hard to control over the space of such a long period of time. But everything is so carefully mapped out, season after season, for the unpredictable to keep happening and for the dramatic beats to gain tension and mystery. Just take how the writers set up, so patiently, over a season, the opening clues of objects and debris all outside of a house, and when you finally find out what all this is about - BAM right to the gut.What one comes away with, outside of the tremendous performances (you might gripe that Cranston got too many Emmys, but... what didn't he deserve with every fiber of his acting bad-assery?) and the consequences that are built up for all the characters, including those we think are made of rock and steel (Mike Erhmantraut), is the world of moral terror. What is morality in this world? There isn't any. It's the Wild West, but crossed with something like, I dunno, American Beauty. What happens when you take a hardcore drug-gangster tale of suspense and warp it with dark comedy about what it means to be a man in society today, or what it means to have a family (and believe me, there are many moments that are downright haunting, harrowing to the soul that speak to this, especially as it builds and builds in its last eight episodes)? You get... this. Perfection.I wish I could tell you there's problems with the show, but rarely can I find any. I'm sure if I dug deep enough some might be there, a cliché exploited for the drug-war scenarios or having a baby around for easy drama or theatrics. But so many times on this show you - or I should say I - get thrown curve balls that really have no other way of working out except how they do. When a moment like Walter White in his crawl space discovering a terrible revelation and going from agony to abhorrent laughter arrives, it's just one of those amazing moments of drama in any American medium. It might be throwing praise like gravy on a Thanksgiving platter, but I'm reminded of Nicholson's comment once on Kubrick: everyone acknowledges he's the man, and I still think that underrates him."
    },
    {
      "username": "manishsingh-03299",
      "userUrl": "https://www.imdb.com/user/ur103582513",
      "reviewLink": "https://www.imdb.com/review/rw4900981",
      "warningSpoilers": false,
      "date": "31 May 2019",
      "rate": "10",
      "helpful": "1,791 out of 2,041 found this helpful.",
      "title": "Those days ain't gonna come back..",
      "content": "When you finish the show you'll never be the same..I guarantee you"
    },
    {
      "username": "alanbenfieldjr",
      "userUrl": "https://www.imdb.com/user/ur77751130",
      "reviewLink": "https://www.imdb.com/review/rw3740327",
      "warningSpoilers": false,
      "date": "27 June 2017",
      "rate": "10",
      "helpful": "661 out of 865 found this helpful.",
      "title": "Addicted: Meth or Math.",
      "content": "Drug wars, meth, the lot. I thought no thank you. I kept hearing how good it was and I kept saying: \"No thank you\" Last January I got sick, one of those illnesses you can't quite figure out. Maybe it was pre and post election depression, I don't know. But I stayed in bed for almost 10 days and then it happened. I saw the first episode and I was immediately and I mean immediately, hooked. I saw the entire series in 9 days. Voraciously. Now I had time to reflect. Why I wonder. When I think about it the first thing that comes to mind is not a thing it's Bryan Cranston. I know the concept was superb as was the writing but Bryan Cranston made it all real. His performance, the creation of Walter White will be studied in the Acting classes of the future. He is the one that pulls you forward - as well as backwards and sideways - then I realized that his creation acquired the power that it acquired, in great part thanks to the extraordinary cast of supporting players. I could write a page for each one of them but I'm just going to mention Aaron Paul. I ended up loving him. I developed a visceral need to see him find a way out. Well, what can I tell you. I know that one day, maybe when my kids are old enough, I shall see \"Breaking Bad\" again. I can't wait."
    },
    {
      "username": "OrangeSequins",
      "userUrl": "https://www.imdb.com/user/ur161901026",
      "reviewLink": "https://www.imdb.com/review/rw8847352",
      "warningSpoilers": false,
      "date": "2 February 2023",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Wow, what a series!",
      "content": "\"Breaking Bad\" has 5 seasons and a total of 62 episodes. It stars Bryan Cranston, Aaron Paul, Anna Gunn, Dean Norris and RJ Mitte. The series has gained a lot of popularity over the years, and let's face it, it really is a masterpiece to be praised.Directing: Sometimes even too good. Every director who worked on the series did a great job.Writing: Very brilliant. The whole story of the series is impressively written.Acting: Absolutely fantastic! Every actor brings out their best.Editing: The editing is also very commendable! It's outstanding and unique.Soundtrack: Every song is great. There are a lot of vocal songs in the series, but for example, there is also the great, catchy intro by Dave Porter (who scored several songs for the series).All in all, this is a brilliant series that is absolutely worth watching. I can only recommend it."
    }
  ],
  "errorMessage": ""
}