{
  "imDbId": "tt2303687",
  "title": "Line of Duty",
  "fullTitle": "Line of Duty (TV Series 2012–2021)",
  "type": "TVSeries",
  "year": "2012",
  "items": [
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw3694768",
      "warningSpoilers": false,
      "date": "27 April 2017",
      "rate": "10",
      "helpful": "177 out of 194 found this helpful.",
      "title": "This has become the Series of the year (again)",
      "content": "A very difficult show to review, overall I'd give Series 1 an 8/10, a very good show, strong characters, intrigue etc, however something happens in the second series and has continued through to the present day, since that very first episode of Series 2 (or in fairness Part 6 of the opening Series) Line of Duty has become the best thing on the box. The cast work together in a way that you don't often see in many shows, the degree of realism each of them injects makes the show feel very real. Dunbar, Compston, McClure, Parkinson etc are all utterly phenomenal, I think though, it was the performance of Keeley Hawes as Lindsay Denton that increased my interest in the show, she was utterly amazing.The transformation in the character of Steve Arnott has been intriguing, plaudits for Martin Compston, incredible actor, so diverse.I suppose you could argue it's made in the style of the Scandinavian noir, but it goes deeper then that somehow, offering even more for the viewers. The series treats the viewer as if they have a degree of intelligence, it's deep and intricate without being too clever for its own good.It comes as no surprise that the show's viewing figures have almost trebled, if you've not seen it, you have no idea what you're missing out on. 10/10Bring on Series 5"
    },
    {
      "username": "BeneCumb",
      "userUrl": "https://www.imdb.com/user/ur32764997",
      "reviewLink": "https://www.imdb.com/review/rw3211884",
      "warningSpoilers": false,
      "date": "31 March 2015",
      "rate": "9",
      "helpful": "108 out of 120 found this helpful.",
      "title": "Strong British series, in the Scandinavian style",
      "content": "In recent years, I have generally \"moved on\" from Poirot-Wallander type of series (usually 1 episode - 1 solved case) to more sophisticated and intertwined series where events take place in parallel and with flashbacks, and for full comprehension, one should watch all the episodes in sequence. It take more time and dedication, but there are more versatile characters and more complex situations where one can ponder on and over more intensely.Line of Duty is a really fine example of the above. The two series - so far - have been really catchy to follow, there is both mind-work and twisted turns, and they are more or less equal (in my opinion, One has a bit stronger performances thanks primarily to Lennie James as DCI Tony Gates, but Two has a bit meatier script). But anyway, I did really enjoy the course of events, the often thin line between cops and crooks (what about its actuality?), and nice round-up of things that really took place. I would juxtapose Line of Duty with e.g. Engrenages (France) and Ørnen: En krimi-odyssé (Denmark).I am looking forward to next seasons already.PS. 3, 4 and 5 are meaty as well, please proceed :) PS. 6 has somewhat less interesting outcome, but interesting twists and turns still visible."
    },
    {
      "username": "robin_should",
      "userUrl": "https://www.imdb.com/user/ur53210487",
      "reviewLink": "https://www.imdb.com/review/rw3467731",
      "warningSpoilers": false,
      "date": "11 May 2016",
      "rate": "8",
      "helpful": "313 out of 340 found this helpful.",
      "title": "Another show which has not enough recognition",
      "content": "Once again I stumbled onto this show by accident. Thank goodness. I find British police drama much more intense than the run of the mill American shows. This one is no exception. The acting is very convincing on all accounts. You think in the beginning how can this \"kid\" be a good main character. He then proves you very wrong and you see that his conviction to the case is what makes him compelling to watch. All the main players are only too human. The stories all have their own twists and turns, keeping you on your toes all the time. Making this show fascinating to watch. I admit there was an awful lot of binge watching as I couldn't leave the plot at the end of each episode. Please give this a chance and be rewarded for doing so."
    },
    {
      "username": "peterrichboy",
      "userUrl": "https://www.imdb.com/user/ur73908325",
      "reviewLink": "https://www.imdb.com/review/rw3660413",
      "warningSpoilers": false,
      "date": "12 March 2017",
      "rate": "10",
      "helpful": "94 out of 108 found this helpful.",
      "title": "Superb crime drama",
      "content": "I have been a huge fan of this show since season one and it's a rare feet when seasons 2 and 3 surpass the quality of the first. It draws you in and keeps you gripped never failing to end each episode on a cliffhanger which makes you desperate to see the next instalment. The cast is UK A list Aidrian DUnbar, Vicky Mclure, Martin Compson and Keely Hawes who gives the performance of her career in seasons 2 and 3. I'm not one to give plots away, but if your a fan of quality crime drama or Nordic noir I cannot recommend this show highly enough. Just one note of caution if your planning DVD series binge then expect some late nights!"
    },
    {
      "username": "clivejamesrd",
      "userUrl": "https://www.imdb.com/user/ur92636609",
      "reviewLink": "https://www.imdb.com/review/rw6946454",
      "warningSpoilers": false,
      "date": "21 May 2021",
      "rate": "10",
      "helpful": "24 out of 26 found this helpful.",
      "title": "4 days in binge watch heaven!!!",
      "content": "Laid up with my back issues, this series had me riveted and I watched all six seasons in 4 days. I consider this the UK answer to Breaking Bad. Excellent televsion entertainment from all angles: Amazing performances, writing, story, the works! Totally credible!Complex AF but left no untidy loose ends when it wrapped up. Who could ask for more?I can. More of this caliber please?"
    },
    {
      "username": "sas2014",
      "userUrl": "https://www.imdb.com/user/ur39799076",
      "reviewLink": "https://www.imdb.com/review/rw3686719",
      "warningSpoilers": false,
      "date": "17 April 2017",
      "rate": "10",
      "helpful": "93 out of 109 found this helpful.",
      "title": "en captivating, best of the British film making",
      "content": "I am a crime story lover and by far this is the best (even better than scandi crime Bridges and killing)I have ever seen. The characters are complex and specially Tandi N in series 3, is the most clever criminal police woman ever! I cant say enough to justify watching this best of the British film making, so 100% try"
    },
    {
      "username": "pk1873",
      "userUrl": "https://www.imdb.com/user/ur26056556",
      "reviewLink": "https://www.imdb.com/review/rw2983592",
      "warningSpoilers": false,
      "date": "16 March 2014",
      "rate": "10",
      "helpful": "201 out of 228 found this helpful.",
      "title": "First season good, second season unmissable",
      "content": "I watched series one last year, it was a good cop show, it came at things from a slightly different angle as it had the anti-corruption unit (internal affairs) as the 'good guys', so my rating was a solid 7.5... i enjoyed it enough to tune in to the second series which as i write this has one episode left to air and i have to say it has been TV at it's very best, from the opening few minutes it had me glued eagerly anticipating each weeks new developments, no spoilers here i only recommend you watch it for yourself to experience the shocks, the thrills and the suspense which it has in abundance, the casting of Keeley Hawes as DI Lindsay Denton was a masterstroke, the character is complex to say the least and she will trigger every emotion you have in your arsenal. Superb character acting, it really is. My revised rating overall is 9/10 but i'd give series two 10/10 after 5 of the 6 episodes...Well I thought I'd return for an update as I love this show so much now.. Needless to say season 2 finished as it had began.. sheer class and a great example of how good TV is right now.. Keeley Hawes we salute you.. now we are 1 ep into season 3 and Jed Mercurio has done it again the season opener quite literally blew me away I was so looking forward to it and it was like welcoming an old friend back into my life.. I can't wait to see where the show is taking me next"
    },
    {
      "username": "stevepb",
      "userUrl": "https://www.imdb.com/user/ur25267822",
      "reviewLink": "https://www.imdb.com/review/rw6877195",
      "warningSpoilers": false,
      "date": "3 May 2021",
      "rate": "9",
      "helpful": "22 out of 24 found this helpful.",
      "title": "The world we have now",
      "content": "Yes, the final episode of series six of \"Line of Duty\" was, in a way, disappointing, because we didn't really get all the answers and we didn't get \"justice\" for everyone. \"Chicago P. D.\" it's not.What we got was something much closer to reality, the real world, as sad as that may be.Since \"Children of the North\" I'll give anything that Adrian Dunbar appears in a chance. Ted Hastings is a truly memorable character, perfectly realised, but everybody connected with \"Line of Duty\" deserves a standing ovation."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw7147051",
      "warningSpoilers": false,
      "date": "21 July 2021",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "Brilliant: riveting viewing",
      "content": "(Reviewed after Season 6).Police Sergeant Steve Arnott is forced out of the Anti-Terrorism unit when an operation goes terribly wrong and he refuses to cover up the truth. He finds himself in AC-12, an anti-corruption unit tasked with finding, investigating and arresting corrupt police officers. The unit is run by Superintendent Ted Hastings, an old school, by-the-book policeman with a passion for exposing police corruption. His zeal, and the fact that AC-12 even exists, often makes AC-12 pariahs within their own police force.Brilliant series. At first glance you might think: surely a series that focuses on cops investigating the wrongdoings of other cops can't be that exciting? Furthermore, you might even think you don't agree with the fact that they even exist, as they could, through interfering with police operations to the point of undermining them, hinder the police more than help them. However, that theory gets dispelled pretty quickly as you see what AC-12 do and the sorts of cases and criminals they investigate.Storylines are excellent: solid, clever plots that are far from predictable. Just when you think the story is headed in a certain direction it takes a wickedly unexpected turn, upsetting all your forward thinking. Allied to this is the fact that hardly any characters are unexpendable, further adding to the unpredictability of proceedings. This all makes for riveting, edge-of-your seat viewing.The broader, inter-season, plot is very well done and adds another dimension to the series. The writers do well to weave seemingly minor characters in and out of the different seasons. It's as if they've got the plot planned out several seasons ahead...There's also some great character story arcs, not all of which involve the main characters. The Lindsay Denton arc was particularly interesting and engaging.At a more granular level, showing how police go about investigating crimes and interrogating suspects is very meticulously done and makes for interesting, edifying viewing. The forensic aspect is always intriguing and gets a thorough examination.A must-see."
    },
    {
      "username": "prosper1",
      "userUrl": "https://www.imdb.com/user/ur3995436",
      "reviewLink": "https://www.imdb.com/review/rw3459818",
      "warningSpoilers": false,
      "date": "28 April 2016",
      "rate": "9",
      "helpful": "33 out of 41 found this helpful.",
      "title": "brilliant",
      "content": "This is a brilliant series. It is what I expect from the BBC, rather than the dreg they've been commissioning lately. The writing is tight and unrelenting in keeping upping the ante. It is complex, that is, we have great character arcs, as well as story arcs. The casting is so sublime that you would have to restrain yourself meeting those villains on the street and let's face it, drama is most often successful due to great villains. Shows like this, the tunnel, undercover, etc., make it nearly impossible to watch network TV in Amerika, where it is the same thing over and over again. The conclusion and arrest is telegraphed usually in the 1st five minutes. Kudos, and I don't give these freely, to the team that created this show. I look forward to more with baited breath. Bravo"
    },
    {
      "username": "lotekguy-1",
      "userUrl": "https://www.imdb.com/user/ur3835197",
      "reviewLink": "https://www.imdb.com/review/rw7366370",
      "warningSpoilers": false,
      "date": "21 September 2021",
      "rate": "8",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Lennie James got screwed",
      "content": "I devoured the first three seasons in two days. The scripts are intelligent, intense, and simultaneously wonderfully and appallingly cynical about corruption within police departments and other phases of law enforcement. The dialog is brilliantly written, making long interrogation scenes bristle with tension, never seeming overly talky. The series is ideal for binge watching, since seeing each season of episodes back-to-back helps keep the complicated plotlines sorted.After viewing the first season, I checked IMDb's listing of the show's awards and nominations, and was shocked that Lennie James only got one minor nomination, with no wins, for his outstanding performance. The role he played called for all the tools in a large talent box, juggling the good, bad and ugly of his character, and the wide gamut of emotions evoked by his rapidly-changing circumstances. Admittedly, I haven't seen all the other honored dramatic performances of that year, but it's hard to imagine his star could shine so brightly in such a high-quality series and be so egregiously overlooked by so many industry groups."
    },
    {
      "username": "chloegalley",
      "userUrl": "https://www.imdb.com/user/ur105187335",
      "reviewLink": "https://www.imdb.com/review/rw8004664",
      "warningSpoilers": false,
      "date": "25 March 2022",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "The best police drama that has been on TV !!!",
      "content": "Review after watching the full box set series 1-6.My mum was the one who told me how good this was then I started watching it. OMG so good keeps you on the edge of your seat with loads of twist and turns, very good. You do have to to concentrate when watching it as the story continues throughout to series 6 and possible could be a series 7. Excellent acting with superb cast and a great storyline. A brilliant police drama/ Thriller with plenty of action in it. The best police drama than has been on TV ever and has won a lot of awards for it. If you have not seen it then you should is definitely a brilliant watch and you won't be disappointed. Get comfy and you can watch the full box set on BBC iplayer right now."
    },
    {
      "username": "bobou-513-708245",
      "userUrl": "https://www.imdb.com/user/ur37294656",
      "reviewLink": "https://www.imdb.com/review/rw4061924",
      "warningSpoilers": false,
      "date": "14 February 2018",
      "rate": "10",
      "helpful": "61 out of 76 found this helpful.",
      "title": "Best detective show hands down",
      "content": "Probably too well done to be a smash hit. But this is surely the best detective show ever produced. The incredible twists and turns in the plot line will keep you glued to your screen. Absolutely brilliant script writing supported by perfect casting and acting.Simply, as good as it gets."
    },
    {
      "username": "snowyprecipice",
      "userUrl": "https://www.imdb.com/user/ur47991635",
      "reviewLink": "https://www.imdb.com/review/rw3722964",
      "warningSpoilers": false,
      "date": "3 June 2017",
      "rate": "10",
      "helpful": "28 out of 36 found this helpful.",
      "title": "Amazing piece of work",
      "content": "This has been an amazing series so far (just finished season 3). It feels so real, so gritty. The characters are so nuanced and complex; they have good and bad sides to them, and you can't help but root for them at different points (both the 'bad' and 'good'). Most notable were Lindsay Denton and Dot Cottan as the troubled and complex characters. The main AC-12 team were all riveting to watch. Can't wait to start season 4!"
    },
    {
      "username": "Lejink",
      "userUrl": "https://www.imdb.com/user/ur15298231",
      "reviewLink": "https://www.imdb.com/review/rw2652172",
      "warningSpoilers": true,
      "date": "30 July 2012",
      "rate": "8",
      "helpful": "22 out of 31 found this helpful.",
      "title": "Internal affair",
      "content": "Covering similar territory to the BBC's great \"Between The Lines\" series of the 90's, this five part-series was essential viewing in our household. Gripping from the start, it never really let go and even if the conclusion was slightly unsatisfactory in my eyes, in that pretty much all the bad guys got away with it and justice wasn't seen to be done, but in terms of plotting and character development, it was riveting throughout.The subject of police corruption and the workings of the internal affairs unit has to be handled sensitively but realistically and here I was convinced from the outset. What made it more interesting and watchable was that the central character under investigation, DCI Tony Gates is presented to us as an award-winning cop, a family man who even stops crime on his time-off, foiling a petty robbery at a restaurant where he's eating in the first episode. Unfortunately in so doing, he absent-mindedly allows the restaurant to not take payment for his meal (in this day and age, it's an offence for the police to accept gratuities, even when off-duty) and worse, he's in the company of his lover, rich girl lawyer Jacqui, both of which come back to haunt him as he becomes the subject of an investigation for 'laddering\", the practice of only solving easy crimes and getting multiple offences tagged onto the crime sheet, thus boosting his efficiency figures.Things get far deeper and murkier from there as Gates finds himself at the mercy and under the control of an underworld kingpin, only heard in the first four episodes by his rasping Glasgow accent, messages passed to him on disposable mobile phones by a tear-away ten year old boy, who later participates in a particularly disturbing torture sequence involving Gates' investigating nemesis D.S. Arnott.The direction was excellent throughout, involving and exciting, with the ensemble acting likewise of the highest order. I wasn't quite convinced, as I wasn't in the otherwise excellent \"The Forsyte Saga\" remake some years ago by Gina McKee as a femme fatale, but in particular Martin Compston and Vicky McClure as the pursuing investigators, the latter undercover, made for an effective team, with thankfully not a whiff of romance in sight between them. As Gates, Lennie James played a difficult part, engaging the viewer's sympathy and anger by turns, before making the ultimate sacrifice at the end.I'd like to see Compston and McClure reunite to fight more corruption, along with Adrian Dunbar as their wily boss pulling the strings behind them and hope the series did well enough for more episodes to come. Series of this standard are few and far between on British TV and I for one would like to see more, much more of the same."
    },
    {
      "username": "face-819-933726",
      "userUrl": "https://www.imdb.com/user/ur47382469",
      "reviewLink": "https://www.imdb.com/review/rw2964892",
      "warningSpoilers": true,
      "date": "20 February 2014",
      "rate": "9",
      "helpful": "27 out of 38 found this helpful.",
      "title": "Like The Wire meeting the Shield head on with British real life issues up in lights.",
      "content": "I am really Enjoying this series. There have not been many really smart police dramas no mater what country you compare this with though you will find that this is going to meet all other crime dramas head on and without trying to protect itself, or the sensibilities of the people. They are holding up a sign to the world with this show, and written in bold is that they know they are broken, but they have not been beaten. What you liked about The Wire, and The Shield, the truth, and heart of those shows is here, and shining like a beacon. You will be on board in the first episode, and surely you will want more. There have been a couple of nice shows like By Any Means lately, and deep dramas like Broadchurch, however what you get from Line of Duty is the real world and the real problems that can derail a really good image that is only ever the fragile image that people want to see. It's only when you dig down to the veins, and fibers that you really see the whole story."
    },
    {
      "username": "caitlinbiwer",
      "userUrl": "https://www.imdb.com/user/ur62831811",
      "reviewLink": "https://www.imdb.com/review/rw3330446",
      "warningSpoilers": false,
      "date": "7 October 2015",
      "rate": "9",
      "helpful": "67 out of 79 found this helpful.",
      "title": "A series to watch",
      "content": "Line of duty is an exceptional police drama. My parents first found it on BBC2 which I find unusual by the fact that it is hidden amongst a less popular channel. Furthermore, the acting is brilliant and you'll be on the edge of your seat at the end of every episode - it is indeed one of the best police series I have watched yet. I suppose it could be down to the fact that it is very unique, in which the producers have found a huge gap within the crime genre of focusing upon AC12 which is an anti-corruption unit. This means that the entire series one and two focus upon entirely different story lines but withholds the same cast in both the first and second series. All I can say is it is a must-see and you will be hooked from the first episode - and I cannot wait till the third season!"
    },
    {
      "username": "paul2001sw-1",
      "userUrl": "https://www.imdb.com/user/ur2082018",
      "reviewLink": "https://www.imdb.com/review/rw2650287",
      "warningSpoilers": false,
      "date": "27 July 2012",
      "rate": "7",
      "helpful": "38 out of 58 found this helpful.",
      "title": "Straight down the line",
      "content": "Last year the BBC brought us the superb, slightly strange police thriller 'The Shadow Line'; this year, the rather more conventional 'The Line of Duty' has aired. Aspects of this programme are quite good, although it never feels exactly fresh. Anti-corruption units, and undercover agents, have been on our screen before ('Between the Lines' - there's clearly something magnetic about that word 'line' and 'The Ghost Squad') - and some of the conspiracy elements seem both far fetched and perfunctory. Perhaps the greatest problem is that Lennie James' protagonist is a hard man to connect with: an almost-clean copper brought down by a bad friend, he remains a hard man to like, and while he appears to be driven by his own private sense of ethics, this moral code seems completely self-centred - he's torn when he fails to live up to his own expectations of himself, but it's hard to see why we should care. And the portrait of feral kids on the local housing estate seems both lazy, and again relatively loosely connected to the more serious crime in the background - if you're looking for the forensic detail of 'The Wire', you won't find it here. None of this actually makes for a bad series - it does all the standard things you expect a show of this sort to do reasonably well, but it doesn't add much you won't have seen before."
    },
    {
      "username": "wellthatswhatithinkanyway",
      "userUrl": "https://www.imdb.com/user/ur0345596",
      "reviewLink": "https://www.imdb.com/review/rw4972978",
      "warningSpoilers": false,
      "date": "2 July 2019",
      "rate": "9",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Successful, full on TV crime drama",
      "content": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday MorningSERIES TWOAfter a number of officers are killed in a violent ambush on a remote stretch of road, DI Lindsay Denton (Keeley Hawes) becomes a figure of interest, after being the only survivor of the incident. Fresh from their previous case, Detective Steve Arnott (Martin Compston) and DC Kate Fleming (Vicky McClure) once again work together to try and get to the bottom of it, while facing institutional opposition from the dubious Sergeant Ted Hastings (Adrian Dunbar.)There's so much new, original content available now on online and streaming services, as well as the terrestrial channels, that it's really quite overwhelming, and so I find myself having to catch up on things it feels seemingly everyone else has already seen (I speak as someone who's never watched a full Game of Thrones episode!) One such example would be LOD, Jed Murcurio's unflinching, full on nosedive into the police division known as AC-12. I've made it onto series three now (thank you Netflix!) and will gradually work my way towards Series 5 (the most recent and apparently last series.)It's pretty clear a lot of deep, thorough research has been done into police procedurals and operational strategies, and Mercurio is keen to showcase it on screen. While a lot of effort has obviously been made to make it as accurate as possible, at times it all feels a bit forced, and hard to believe anyone is speaking like a normal person would. As if to add a further layer of grittiness to his project, Mercurio shoots everything in a bleak, gloomy style, with a script low with much in the way of humour and light.However, all this said, it's highly intelligent and well written, and genuinely manages to keep you riveted and on edge as to what's going to come next, as well as featuring strong, assured performances from lead stars Compston and McClure, as well as more established talent such as Adrian Dunbar, Keeley Hawes and Lennie James. Certainly an intriguing and enlightening nosedive into the inner workings of an operational commands unit. ****"
    },
    {
      "username": "arab-61505",
      "userUrl": "https://www.imdb.com/user/ur94475032",
      "reviewLink": "https://www.imdb.com/review/rw4617808",
      "warningSpoilers": false,
      "date": "31 January 2019",
      "rate": "10",
      "helpful": "47 out of 58 found this helpful.",
      "title": "Probably the best drama the BBC has ever done",
      "content": "Can't believe it hasn't had more awards or recognition. Every series is as good as the last. Blows the likes of The Bodyguard and Killing Eve out the water. The acting is so much better with Keeley Hawes (good in The Bodyguard but brilliant in this), Vicky McClure, and Thandie Newton (series 4) all particularly magnificent. Can't wait for series 6!"
    },
    {
      "username": "baronetdedlock",
      "userUrl": "https://www.imdb.com/user/ur5278030",
      "reviewLink": "https://www.imdb.com/review/rw3008097",
      "warningSpoilers": false,
      "date": "1 May 2014",
      "rate": "9",
      "helpful": "154 out of 170 found this helpful.",
      "title": "Excellent Series!",
      "content": "This is a review of both Season 1 & 2 of this wonderful British series. Although there is a different story line in each of the seasons, there is some continuity in the important characters: the actors Martin Compston, Adrian Dunbar and Vicki McClure, among others, appear in both seasons as the same characters. The story in each season deals with a conflict within a police department between the regular forces and the internal affairs or \"anti-corruption\" unit. Thematically, it is concerned with the moral ambiguities that arise when policemen investigate their own. I think this is one of the best British police procedurals that I have seen. The acting and the writing are uniformly excellent, and I hope it comes back for a third season."
    },
    {
      "username": "s3276169",
      "userUrl": "https://www.imdb.com/user/ur49392790",
      "reviewLink": "https://www.imdb.com/review/rw3441794",
      "warningSpoilers": false,
      "date": "29 March 2016",
      "rate": "7",
      "helpful": "22 out of 33 found this helpful.",
      "title": "Tense anti corruption police drama.....",
      "content": "Line of Duty is a Brit cop drama that focuses on the tense interplay, between the anti corruption units, within the UK Police and the officers, they are tasked with investigating. Refreshingly, this drama, renders real characters, on both sides of the divide. No one is perfect, including the investigated and the investigators.The standard of casting and acting, as is typical with most UK productions of this kind, is of a high caliber. The convincing characterizations and the tension that mounts for the viewer, as the lives of often good people, who makes bad decisions, slowly unravel, is not always easy to watch. This is an engaging series, that works well.It keeps the viewers attention with storyline(s) that are, for the most part, believable. Often focusing on personal issues, that make their way into the workplace, as is so often the case, in real life. Where this series falls down somewhat, is some of the more implausible mistakes made by seasoned police officers. A ring from a glass left on a table, for example, taken by a compromised officer is inexplicable. As is, false claims, regarding a relationship, whilst knowing full well, that text records from mobiles, including intimate ones, are readily available. Any experienced detective would realize, in some instances, truth is less damaging than lies and may, in fact, better hide a bigger lie. The other shortfall, is how cold and often, unlikable, a good portion of the characters are. Injecting a little human warmth, into this series, would actually increase the impact on the viewer, when things turn sour. This, I think, is what stops Line of Duty from being an exceptional series, like the much loved, classic detective series, in the same vein, Cracker. Cracker is outstanding because it takes far more emotional and personal risks, with its characterizations. That said, for the most part, Line of Duty is a good series and still represents an intelligent, worthwhile watch. Seven out of ten from me."
    },
    {
      "username": "sir_1973",
      "userUrl": "https://www.imdb.com/user/ur47242456",
      "reviewLink": "https://www.imdb.com/review/rw2891338",
      "warningSpoilers": false,
      "date": "11 October 2013",
      "rate": "8",
      "helpful": "107 out of 125 found this helpful.",
      "title": "Stuck. Φοβεροοοοοο",
      "content": "Being fan of British TV, i was hooked and couldn't stop this series. Has everything. Plot, dark and right timing. Great TV. The characters are natural and great acting from all of them. The suspense comes at right levels each episode and there is no way to stop until you find what will come next.There are some very ... i don't know the right word(not with the bad meaning) with \"The Wire\". The characters are almost real like the classic good British TV. The atmosphere is not annoying dark and the lines between \"Right and Wrong\" are not clear, (like real life). Absolutely RECOMMENDED..."
    },
    {
      "username": "The_late_Buddy_Ryan",
      "userUrl": "https://www.imdb.com/user/ur23365095",
      "reviewLink": "https://www.imdb.com/review/rw4565929",
      "warningSpoilers": false,
      "date": "6 January 2019",
      "rate": "9",
      "helpful": "13 out of 20 found this helpful.",
      "title": "The smartest, most suspenseful, most involving series we've seen in donkey's years",
      "content": "My wife, no fan of cop shows as such, was knocked out by this UK police procedural, as was I. Showrunner Jed Mercurio knows what evil lurks in the hearts of men, and for five seasons now his dauntless AC-12 (for anticorruption) unit has been hunting down a ring of \"bent coppers\" and their black-clad enforcers (\"balaclava men\") in an unidentified city in the English Midlands (sometimes played by Belfast, btw). Plots are intricate, just this side of bewildering at times, and cases take up at least an entire season.Subplots that aren't resolved right away carry over to the next season. Each time one of the hydralike heads of the OCG (\"organized crime gang\") gets lopped off, it instantly sprouts a new one, and the bent coppers and their criminal minions keep coming back for more. Season six is alleged to already be in the works; we can only hope that the story arc of the series is long and that it bends towards justice....Despite the show's overall complexity, the individual episodes have incredible momentum, and since the bent coppers are indistinguishable from the honest ones, a Cold War atmosphere of tension and suspicion prevails, punctuated by occasional, expertly staged car chases and shootouts. The show's cynicism about corrupt officials and local elites--one of the recurring subplots is a mashup of the Jimmy Savile and Kincora Boys' Home child-abuse scandals--really seems to resonate in post-Brexit Britain. You don't have to be a fan of Antifa or QAnon, IMHO, to find this outlook appealing.The dialogue is sharp and the characters are complex, though thankfully not as \"quirky\" or \"damaged\" as some of their US counterparts. I couldn't put a name to any of the regular cast members when we first started watching, but they're all fine actors; faces familiar from PBS and HBO turn up as guest perps and prime suspects--Lennie James (The Walking Dead), Gina McKee (The Forsyte Saga), Keeley Hawes (Bodyguard), Polly Walker (Rome), Thandie Newton (Westworld) and Anna Maxwell Martin (Motherlands)."
    },
    {
      "username": "premedprincessxo",
      "userUrl": "https://www.imdb.com/user/ur99569553",
      "reviewLink": "https://www.imdb.com/review/rw7796663",
      "warningSpoilers": false,
      "date": "25 January 2022",
      "rate": "9",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Classy, Intelligent Police Show",
      "content": "Found this gem just by chance on Netflix (season 5). Then proceeded to Amazon Prime to binge watch the other 5 seasons out. ABSOLUTELY LOVE!!!Every single character on the show is super charismatic and watchable. The main three- Kate, Steve and Hastings are instantly likeable and the actors are extremely talented. Hastings is an absolute riot \"MY TEAM FOLLOWS REGS TO THE LETTER OF THE LAW-THE LETTER\"Aside from the main three, practically every single person on this show is enjoyable to watch and captivating. Who knows maybe it is the accents. But you don't see too many American shows with such consistency in talent/screen presence from the main cast to the villains to smaller roles. Tony, the Caddy, Tommy Hunter, Jo, Maneet, Ryan, John, Gillian, etc. Can't think of someone who did not leave an impression.With all that said, it is a show which requires you to pay attention and really focus. Also super long interrogation scenes which took some getting used to. It is different from anything I have seen and has replaced Law&Order SVU as my favorite police drama - BY A LONG SHOT!"
    }
  ],
  "errorMessage": ""
}