{
  "imDbId": "tt2303687",
  "title": "Line of Duty",
  "fullTitle": "Line of Duty (TV Series 2012–2021)",
  "type": "TVSeries",
  "year": "2012",
  "episodes": [
    {
      "id": "tt3162268",
      "seasonNumber": "2",
      "episodeNumber": "1",
      "title": "The Ambush",
      "image": "https://m.media-amazon.com/images/M/MV5BMjAxNDY5NzI4NF5BMl5BanBnXkFtZTgwOTkxNDEzMDI@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "12 Feb. 2014",
      "plot": "A police convoy escorting a civilian under a witness protection scheme is attacked, the witness hospitalized and all the police officers killed, except Inspector Lindsay Denton, who organized the operation at very short notice and who only informed DCC Dryden of the route. Ted Hastings asks Steve and Kate to interview her but Kate pulls out, claiming one of the dead officers, Jayne Akers, was a friend - though she has been having an affair with Jayne's husband Rich. Her place is taken by Georgia Trotman, who is troubled that the men are savage with their interrogation...",
      "imDbRating": "8.5",
      "imDbRatingCount": "1440"
    },
    {
      "id": "tt3162272",
      "seasonNumber": "2",
      "episodeNumber": "2",
      "title": "Carly",
      "image": "https://m.media-amazon.com/images/M/MV5BMjI0NjU0Mzc2OF5BMl5BanBnXkFtZTgwNjIzNDEzMDI@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "19 Feb. 2014",
      "plot": "Following the deaths of Georgia and the witness it is Steve who gets a grilling as to the police presence at the hospital whilst Lindsay is accused of attacking her neighbour, which she denies. Steve discovers that a nurse on the witness's ward, Claire Tindall, was threatened into giving the killer access by a man she knows as Joe, but whom she is unable to identify. Lindsay continues to search for vanished teenager Carly Kirk and Kate is drafted in as her assistant - in reality a move to try and get Lindsay to admit her guilt - but Lindsay sees through the ruse. ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "1266"
    },
    {
      "id": "tt3162274",
      "seasonNumber": "2",
      "episodeNumber": "3",
      "title": "Behind Bars",
      "image": "https://m.media-amazon.com/images/M/MV5BOWFiODdhYTMtYzhhNC00MmRkLWExMDMtZjgzYzIwYmRlMzM1XkEyXkFqcGdeQXVyNjc3NTM5NjI@._V1_Ratio2.1587_AL_.jpg",
      "year": "2014",
      "released": "26 Feb. 2014",
      "plot": "Lindsay is remanded in custody where she is victimized by both staff and prisoners. Meanwhile Steve and Kate discover the identity of the dead witness from blunt inspector Cottan. He was known as Tommy and Cottan believes that Jayne Akers, his liaison officer, was the real mole who betrayed the escort. Kate visits Lindsay, who knows about her affair with Jayne's husband whilst Cottan has similar suspicions. Lindsay's accusations also cause friction between Hastings and Steve, whilst Dryden's driving offence attracts the press so to save himself he strikes a deal ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "1186"
    },
    {
      "id": "tt3162276",
      "seasonNumber": "2",
      "episodeNumber": "4",
      "title": "Blood Money",
      "image": "https://m.media-amazon.com/images/M/MV5BYjliYWY0MTgtOGYzNC00NzljLTkzMzgtZGEyMzM2NWQ2MjM2XkEyXkFqcGdeQXVyNjc3NTM5NjI@._V1_Ratio2.1587_AL_.jpg",
      "year": "2014",
      "released": "5 Mar. 2014",
      "plot": "An arrogant Dryden is questioned regarding the traffic offence and is dismissive though Steve lets him know Lindsay has revealed that he knew about the convoy route and aims to pursue it further. Rich Akers is also pulled in after £20,000 of which he claims ignorance is found under the floor boards at his house. Hargreaves is convinced this was the bribe given Jayne to betray the escort and when Steve and Kate examine Jayne's car they discover a tracking device though Hargreaves is not keen for its revelation. Furthermore Cottan and Hargreaves see video evidence ...",
      "imDbRating": "8.4",
      "imDbRatingCount": "1183"
    },
    {
      "id": "tt3162280",
      "seasonNumber": "2",
      "episodeNumber": "5",
      "title": "Last Words",
      "image": "https://m.media-amazon.com/images/M/MV5BZWRlYzQzNTQtNzQ5MC00Mzc5LWJiMzAtYWJmZTgxYzg2YmRkXkEyXkFqcGdeQXVyNjc3NTM5NjI@._V1_Ratio2.1587_AL_.jpg",
      "year": "2014",
      "released": "12 Mar. 2014",
      "plot": "Lindsay wakes up in a lock-up and is questioned by her abductors. Prasad soon kills his accomplice, Cole, but Lindsay outwits him and makes him admit on the phone that he and Cole were working for Dryden, who set up the ambush. Steve locates her at her dead mother's bedside and she is granted bail, unaware that Prasad, whom she believed that she killed in self-defense, is still alive and demanding immunity. Cottan brings in his old mate Morton for some dirt on Dryden and it is revealed that Dryden had sex with Carly Kirk. He is arrested and questioned, admitting that ...",
      "imDbRating": "8.6",
      "imDbRatingCount": "1193"
    },
    {
      "id": "tt3162282",
      "seasonNumber": "2",
      "episodeNumber": "6",
      "title": "The Caddy",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ4ODk2OTk2NV5BMl5BanBnXkFtZTgwNzA0NDEzMDI@._V1_Ratio1.7778_AL_.jpg",
      "year": "2014",
      "released": "19 Mar. 2014",
      "plot": "Prasad claims that Dryden wanted Tommy silenced as he was blackmailing him about Carly, hence the ambush. However the order was to spare Lindsay. Hastings charges Dryden for the driving scam but has insufficient evidence for the weightier charges as Dryden apparently proves that the last he saw of Carly was when he put her on a train. Kate is surprised that Steve seems to believe in Lindsay's innocence until he admits that he is purposely trying to gain her confidence to trap her. When she is shown to have accepted a proposal by a colleague to snare a child abuser she...",
      "imDbRating": "8.2",
      "imDbRatingCount": "1221"
    }
  ],
  "errorMessage": ""
}