{
  "imDbId": "tt2303687",
  "title": "Line of Duty",
  "fullTitle": "Line of Duty (TV Series 2012–2021)",
  "type": "TVSeries",
  "year": "2012",
  "episodes": [
    {
      "id": "tt2384267",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "A Disastrous Affair",
      "image": "https://m.media-amazon.com/images/M/MV5BMzM5MzFmYjctMGE4Ny00NzdjLTlhN2EtYWEyNTk3ZThjNTNlXkEyXkFqcGdeQXVyOTMyODgwOTQ@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "21 Aug. 2012",
      "plot": "After a bungled raid which kills an innocent man young DS Steve Arnott faces disgrace. However he is transferred to the anti-corruption squad, whose head, superintendent Ted Hastings, gives him a \"very special case\" to investigate - DCI Tony Gates, recently awarded a medal for heroic conduct but with a suspiciously high arrest rate. Hastings tries to get Gates on minor bribery charges, in vain, and is unaware that the married Gates has covered up a fatal hit-and-run by his lover, businesswoman Jackie Laverty. Meanwhile DC Kate Fleming joins Gates's team and tells ...",
      "imDbRating": "7.7",
      "imDbRatingCount": "1733"
    },
    {
      "id": "tt2388095",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "The Assault",
      "image": "https://m.media-amazon.com/images/M/MV5BMTg3NTU4ODQ3MF5BMl5BanBnXkFtZTgwOTIzNDEzMDI@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "28 Aug. 2012",
      "plot": "Having been duped into covering up Jackie's hit and run, Gates is desperate to sever ties with her. But as Arnott and Fleming close in on his secret, Gates is plunged into an even more dangerous situation.",
      "imDbRating": "8.1",
      "imDbRatingCount": "1473"
    },
    {
      "id": "tt2393075",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "In the Trap",
      "image": "https://m.media-amazon.com/images/M/MV5BNTI5MjQ4NTQ2MF5BMl5BanBnXkFtZTgwNDg0NzMzMDI@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "4 Sep. 2012",
      "plot": "Gates, knocked unconscious by the attackers, tampers with evidence, hiding a whiskey glass before police arrive to find Jackie has vanished. He claims he has just got there himself. Hastings and Arnott quiz him on his relationship with Jackie and he admits she was an old flame but denies knowledge of her money laundering. Arnott goes over the top in confronting him with evidence to suggest he was at Jackie's house when she was killed but makes himself look desperate. Gates is taken off the case and later, whilst investigating Wes's murder, is grabbed by masked men and...",
      "imDbRating": "8.0",
      "imDbRatingCount": "1399"
    },
    {
      "id": "tt2392125",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "Terror",
      "image": "https://m.media-amazon.com/images/M/MV5BMjI2ODI5MjUxMF5BMl5BanBnXkFtZTgwNzIzNDEzMDI@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "11 Sep. 2012",
      "plot": "Whilst the money laundering investigation is passed to Fraud Squad, Gates is still hounded by his blackmailers. Kate wants to connect him to Jackie's murder and sets out to gain his trust to find further proof though Gates' loyal colleague Morton rumbles her. Hastings and Arnott interview Gates' team and learn from D.S. Cottan that he diverted them from attending the drug dealers' murders, leading them to believe that Gates knew that the dead pair were working with Jackie though Gates persuades his gullible superior that the couple were in fact terrorists building a ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "1347"
    },
    {
      "id": "tt2356337",
      "seasonNumber": "1",
      "episodeNumber": "5",
      "title": "The Probation",
      "image": "https://m.media-amazon.com/images/M/MV5BMTkyOTE3ODEyNV5BMl5BanBnXkFtZTgwMDAyNDEzMDI@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "18 Sep. 2012",
      "plot": "Gates returns to rescue Arnott but leaves before Kate, her cover now blown, arrives to find evidence that a body had been stored at the warehouse. Arnott recalls that the chief torturer was called Tommy and admits to Kate that Gates saved him. She believes he is weakening in his attitude to Gates, whom he goes to see in secret, confirming his view that Gates is innocent of all the murders. Convinced that Gates is in danger but can bring the killers to justice Arnott persuades Hastings to let Gates set up a meeting with Tommy, recorded on a wire. Arnott and Kate intend...",
      "imDbRating": "8.3",
      "imDbRatingCount": "1464"
    }
  ],
  "errorMessage": ""
}