{
  "imDbId": "tt0071075",
  "title": "The World at War",
  "fullTitle": "The World at War (TV Series 1973–1974)",
  "type": "TVSeries",
  "year": "1973",
  "items": [
    {
      "username": "choatelodge",
      "userUrl": "https://www.imdb.com/user/ur1510370",
      "reviewLink": "https://www.imdb.com/review/rw1004449",
      "warningSpoilers": false,
      "date": "22 January 2005",
      "rate": "10",
      "helpful": "193 out of 202 found this helpful.",
      "title": "Of unmatched significance in the library of video productions",
      "content": "This series, produced at probably the most propitious time following the events of the second World War, is on a scale of value that stands far above any individual's presumption to criticize.The timing of World at War's production in 1974, amounting to some three decades after the events of the war, permits an accurate relating of events in a manner uncoloured by residual propaganda and slant. The passage of thirty years allows the telling to be backed up by an impressive and fascinating panoply of the very individuals involved, ranging from some of the highest military and political figures down to the field soldiers, civilians, and such survivors of the death camps as have remained to bear witness to the unimaginable inhumanities of which civilized humans are capable. Most approaching or well into their senior years, the interviewed subjects have had enough time to reflect on their experiences and in most instances have had enough time for whatever propaganda and fervor may have affected them in the past to have receded away, leaving only the memories of what they saw and what they did.The information that these survivors give, strikingly reinforced by the postures and expressions they display while telling their part, give their stories all the more impact. Such names as Ira Eaker, Adolph Galland, Louis Mountbatten, Albert Speer, Gertrude Junge (Hitler's personal secretary)... the list is far too long to relate. Today, within the lifetime of the survivors of this enormous lesson in the hideous price of political ambition, are young people who chant the same sort of militaristic and nationalistic war promotion as led to WW2. The DVD series we discuss here ought to comprise the core of a mandatory history subject in schools, that the lessons bought at such a horrible cost in those days should not have been wasted but should be taken to heart by those who did not see firsthand the terrible price.I am almost done watching the 11 disk set, having seen most of the series when a local TV channel aired it more than 10 years ago. It has lost none of its poignancy to me, indeed has become even more of a magnificent chronicle of some of the very darkest days of human times.The highest possible rating seems unworthy of being applied to this presentation. I think the value of this series is beyond counting."
    },
    {
      "username": "Varlaam",
      "userUrl": "https://www.imdb.com/user/ur0093896",
      "reviewLink": "https://www.imdb.com/review/rw0133292",
      "warningSpoilers": false,
      "date": "4 September 1998",
      "rate": "10",
      "helpful": "59 out of 66 found this helpful.",
      "title": "The most authoritative Second World War documentary series",
      "content": "Certainly any others I have seen pale in comparison. The series gives balanced coverage to all theatres of operation. No one country is given undue credit for the Allied victory. Laurence Olivier brings great weight and dignity to his role as narrator."
    },
    {
      "username": "motor89",
      "userUrl": "https://www.imdb.com/user/ur0624770",
      "reviewLink": "https://www.imdb.com/review/rw0133311",
      "warningSpoilers": false,
      "date": "13 September 2003",
      "rate": "",
      "helpful": "144 out of 160 found this helpful.",
      "title": "Unmissable",
      "content": "Even thirty years later this documentary has lost none of its power. Quite the opposite. It serves as a superb introduction, for those born after WWII, to an enormous conflict that radically re-shaped the world around us and subjected our grandparents/parents to dreadful hardship. The series begins slowly, with an episode on Hitler's and the Nazi party's rise to power. It does skip a great deal of material on the origins and growth of National Socialism... but I suppose that is only to be expected. Despite being an epic thirty-two hours in length there is only so much time, and much material not directly about the war had to be skipped.It is a fine antidote to the drivel put out by film studios... which, for the most part, show the war being almost entirely fought by the U.S.A, with the British involved in a few skirmishes here and there. Little do they realise the scale of British fighting and loss. Perhaps even more importantly it gives coverage of one of the most undervalued (particularly by Commie-bashing Hollywood) that Russia suffered more losses than any other country in WWII. Without their sacrifice it would have been a different outcome.I can't stress enough how good this series is. From the title sequence with its stirring Carl Davis music and arresting images to the well-written and perfectly judged narration, it has the lot. If you get the chance to see it -- whether on DVD, or just a TV repeat -- do not miss it."
    },
    {
      "username": "magicwand444",
      "userUrl": "https://www.imdb.com/user/ur11111297",
      "reviewLink": "https://www.imdb.com/review/rw1703726",
      "warningSpoilers": false,
      "date": "31 July 2007",
      "rate": "10",
      "helpful": "54 out of 57 found this helpful.",
      "title": "powerful and spellbinding",
      "content": "i watched this series when it first came out in the 70s.i was 14 years old and i watched it at my best friends house as my dad didn't want to watch it.it became a weekly ritual every Sunday, and as anyone will tell you for two fourteen year olds to watch a documentary in almost reverential silence must mean that this was something special.the broad sweep of the events of world war 2 makes for a difficult subject to document.so the makers broke it down into what they considered to be the most significant key happenings and devoted one episode to each.some episodes covered long periods such as 'wolf pack' which covered nearly all six years of the battle of the Atlantic.while the battle of Stalingrad had one episode to itself.this documentary could not be made today quite simply because most of those interviewed are dead.the list of significant players appearing gives an amazing insight into the thinking at the time.Anthony eden the foreign secretary,Carl donnitz,head of the u-boats,Albert speer,pet architect confident and later armament minister for Hitler.in one of the later episodes we see traudl junge, Hitler's secretary,who was with him in the bunker and it was to her that he dictated his last will and testament-she left the bunker after Hitler's suicide and escaped through the Russian lines.these and many others play a major role in the realism of the events portrayed.if i have any criticism of the series it is that the code-breakers of bletchly park are not included but the revelations of their part in the war only emerged after the series had been made so i cannot blame the programme makers.the opening titles and music are magnificent,and Lawrence Olivier's narration lends a natural gravity to the script.the best documentary series ever made? without doubt.unmissable"
    },
    {
      "username": "Hup234!",
      "userUrl": "https://www.imdb.com/user/ur0257686",
      "reviewLink": "https://www.imdb.com/review/rw0133298",
      "warningSpoilers": false,
      "date": "23 October 1999",
      "rate": "",
      "helpful": "23 out of 25 found this helpful.",
      "title": "A masterful production. Unforgettable imageries.",
      "content": "It's been a quarter-century since this series made its debut, and I wanted to briefly comment on Carl Davis' towering soundtrack score. The theme and opening titles are unexpected and make a terrific impact upon the viewer, coming as they do after a low-keyed prologue narrated by Laurence Olivier. With their work, and with the superb scripts (and their author(s) have not received the accreditation due), I can't imagine how the telling could ever be improved upon in any subsequent productions. No, I think this will remain the definitive World War II anthology. Highly recommended - though a cautionary is called for throughout the Holocaust sequences. (There was much trepidation at its debut over televising that episode.)"
    },
    {
      "username": "Rich-315",
      "userUrl": "https://www.imdb.com/user/ur0962281",
      "reviewLink": "https://www.imdb.com/review/rw0133301",
      "warningSpoilers": false,
      "date": "4 April 2001",
      "rate": "10",
      "helpful": "131 out of 141 found this helpful.",
      "title": "The war documentary to end all war documentaries",
      "content": "Utterly brilliant. Powerful and evocative. The most compelling documentary series ever made concerning war. It's tone offers a stark contrast to the often gung-ho attitude towards World War 2 that the media exhibits. Rather than opting for screaming about the horror of war, it allows Sir Laurence Olivier's quiet voice to take a back seat to the true images of war: corpses everywhere, explosions, terrified citizens and soldiers, broken men, indifferent politicians, mistakes that cost thousands of lives, the suffering of the innocents. Most of all it truly brings home that mankind is capable of when all normal rules of \"civility\" are removed. There is something distinctly Hobbesian about man in a true state of nature, he will return to a more beastly form capable of crimes that will still shock and fascinate 60 years on. Perhaps there could be a follow up series called \"The century at war\" for the twentieth century was truly the century of horrors. I feel it is an irony of immense magnitude that it took an event which caused the death of 50 million people to produce such a compelling and excellent series such as this."
    },
    {
      "username": "classicalsteve",
      "userUrl": "https://www.imdb.com/user/ur7383416",
      "reviewLink": "https://www.imdb.com/review/rw2364799",
      "warningSpoilers": false,
      "date": "6 January 2011",
      "rate": "10",
      "helpful": "21 out of 25 found this helpful.",
      "title": "Definitive World War II Documentary: Finest Chronicle of the Great Epic Tragedy of the 20th Century",
      "content": "At this writing, just over 65 years have passed since Nazi Germany surrendered to the Allies, and yet the cataclysmic events seem from another time, another era, another epoch; a dark fantasy which seems illusory, almost fabricated. And yet this is not fiction but historic reality. The large hosts of military armies chanting \"Sieg Heil\" amid the plethora of swastika banners and German crosses appear like scenes from a surrealistic film, almost imaginary in its strangeness. A central figure elevated to the status of messiah by his people, almost a god, fueled by the undying devotion of millions. An horrific ideology overtakes an entire nation which had been known for high culture, literature, science and music. And the crimes against humanity within its borders escalate before this messiah and his nation confront the rest of humankind through a conscious combination of political maneuvering and military might. The messiah is not one of benevolence and peace but one of wrath and war.Is this a nightmare from which humankind would awaken eventually and say thank goodness, it was only a dream? Or a dark landscape of atrocity from which the only escape is death? And yet, no matter how unreal these times appear to us three quarters of a century later, the events of Europe in the 1930's and the 1940's have become not just a chapter of human history but a multi-volume work of epic proportions, the modern equivalent of Homer's \"the Iliad\" or Edward Gibbons \"Rise and Fall of the Roman Empire\". World War II is the great epic tragedy of the 20th century, a story written in the blood and anguished cries of millions, and rivaled only by its parent, World War I.Jeremy Isaac's \"The World at War\" produced in the late 1960's and early 1970's and premiered on British television in 1973 (and later in the US) remains the most outstanding production to date in English which presents a coherent narrative of one of the strangest episodes of human history. Narrated by the incomparable Sir Laurence Olivier, \"the World at War\" was the first attempt, so far as I know, to piece the large puzzle of people and events, both large and small, into a presentable film. For nearly 23 hours, divided into 26 episodes, audiences are taken back to the early 20th century to witness events that literally changed the course of human experience. The film relies on Olivier's narration, archival footage from the era, interviews of scholars, and interviews of people from the time, recounting memories of what they had witnessed.The interviews alternate between people of high standing and those of middle class as well as scholarly discourse. In the first episode, one woman remembers being enthralled to the point of silent awe when Hitler and his entourage greeted her and her colleagues. Another woman recalls that the doctor to her children had been dismissed from a hospital he had helped found, only on the grounds of his being of Jewish decent. A scholar recounts how Hitler perpetrated the burning of the Reichstag and blamed it on the communist presence in Germany to strengthen his power by marginalizing rivals. Hitler's strategy was to gain complete political solidarity in Germany at the price of human rights and freedom. But his aims did not end with Germany; Hitler sought to regain those lands around Germany which had been lost as a result of World War I. The documentary begins with Hitler's rise to Chancelor of Germany in 1933 as head of the German Socialist Worker's Party (Nazi Party), and his eventual rise to dictator upon the death of President Hindenburg in 1934. Hitler schemes to destroy all political adversaries to promote complete centralized power of the government. In short, he completely remakes Germany's political and judiciary structure to encompass an ideology in which political dissenters and those labeled as part of inferior races (i.e. Jews, Gypsies, and other minorities) are not only marginalized and stripped of human rights but are to be persecuted and eventually exterminated. At first, the world seems only to watch in awe and anxiety but for some reason is reluctant to act. The documentary then furthers how Hitler will take his ideology outside his boundaries and force the world to reckon with this new European power. The dictator plans to absorb many of the surrounding countries of western and central Europe into the Third Reich, blatantly undermining the Versailles Treaty of 1919. His designs begin near his own borders, first absorbing Austria into the German empire, and then France to the west and Czechoslovakia and Poland to the east. He forces Britain, the Soviet Union and Italy to sign treaties, but later will bomb England and begin an eastern offensive into Russia. Finally, a western and eastern alliance is formed among those countries which had not fallen into the Reich's hands. Their mission: to arrest Germany's military campaigns, and the inspiring speech by English Prime Minister Winston Churchill to Britain's Parliament becomes the rallying cry. The bombing of Pearl Harbor in late 1941 followed by Germany's declaration of war against the United States force Americans into the conflict on the side of the allies.Isaac's outstanding documentary is English language television at its finest and would not be rivaled until Ken Burns' \"The Civil War\" almost two decades later. In all likelihood, Burns was inspired by World at War in terms of its thoroughness of historical scholarship balanced with stories of everyday people along with a fine narrator; it is the war documentary by which all others are judged. \"The World at War\" stands as a crowning achievement dealing with a fascinating if horrific subject, the history of the human race nearly annihilating itself. But maybe the documentary is a positive model in and of itself, showing how much more wonderful it is to create than to destroy."
    },
    {
      "username": "widescreenguy",
      "userUrl": "https://www.imdb.com/user/ur3375665",
      "reviewLink": "https://www.imdb.com/review/rw0133312",
      "warningSpoilers": false,
      "date": "28 April 2004",
      "rate": "10",
      "helpful": "68 out of 88 found this helpful.",
      "title": "still mesmerizing after 30 years",
      "content": "The music and Laurence Olivier's sombre delivery set the tone perfectly for this outstanding documentary. This is still a must see for WW II buffs, descendants of the participants of that conflict, politicians who think things always go their way when they extend their foreign policy via the deck of an aircraft carrier (did you hear that George Bush?) and anyone else curious or needing to know the whys whos and hows of some aspect of that conflict. The 26 episodes are roughly in chronological order but can be seen out of sequence since they are more or less self contained. There is bound to be new insight for the new viewer because of the sheer volume presented. Actual footage of the battles is interspersed with interviews of those involved in the stories. Many of the interviews are with second line authorities, that is, support personnel to the main characters, privates, captains, secretaries, eyewitnesses and the like. You get a real upfront taste of what war is all about.I am presently watching the DVD version of the original television documentary. I strongly recommend this over the worn out, gaptoothed, overpriced VHS offerings available on eBay. I paid $120 Cdn for five 2-sided DVD discs. This new release includes bonus material and is in full screen mode. The menus are easy to follow, there is first a choice of which episode you want to view and then after selecting that you are given the option of various chapters in the episode or to play the whole episode. It is understandable with such a comprehensive presentation there is a tiny amount more of navigation in the menu but the impact of what you will see is not diminished after 30 years, nay, after 60 years since the war finished.I remember watching the first broadcast on the Buffalo PBS station just before moving from London in 1975 and wishing right from that time that I could have a copy. Now my wish has finally come true.See this documentary. Tell your friends. Buy a copy for your library. Remember and honour the sacrifices and challenges overcome by those from America, Russia, Britain, Canada and all the other nations and peoples involved in the final victory. What an eye opener."
    },
    {
      "username": "mm-39",
      "userUrl": "https://www.imdb.com/user/ur0453228",
      "reviewLink": "https://www.imdb.com/review/rw2623075",
      "warningSpoilers": true,
      "date": "6 June 2012",
      "rate": "10",
      "helpful": "18 out of 23 found this helpful.",
      "title": "The gold standard for documentaries.",
      "content": "I have a passion for military history, and believe The World at War is best documentary about World War 2. There is no bias with the series, just solid documented facts. The series documents battles, strategies, leaders, personalities, equipment, what the conditions where like etc. The strongest part of the series is the interviews with the people who were actually there, and many are prominent people. (I E Albert Spears). Olivier is a great narrator and creates a level of excellence for the series. The World at War never becomes dated, and can be watched repeatedly. I give the series a ten out of ten. Watch the series on the military channel."
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw3375058",
      "warningSpoilers": false,
      "date": "19 December 2015",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "The ultimate documentary on WW2",
      "content": "The ultimate documentary on WW2.A documentary series on World War 2, from its causes, its commencement through to its conclusion, with episodes on major theatres, campaigns and battles. Also includes episodes on things that one wouldn't normally think about when detailing a war, but which is no less important, eg the home front, innovations.Very well researched, with rare archival footage of battles and the like. Probably the most impressive thing is the interviews. The interviewees include some very high-profile people, people with a large hand in whatever battle or event is being discussed. For example, in \"Whirlwind\", the episode on the Allied bombing of Germany, we see interviews with Marshall of the RAF Sir Arthur \"Bomber\" Harris (commander of RAF Bomber Command during WW2), Albert Speer (German munitions and industry minister), Adolf Galland (German fighter ace), Jimmy Stewart (famed actor and WW2 bomber squadron leader), General Curtis LeMay (US bomber group commander) plus aircrews on both sides and German civilians affected by the Allied bombing.All this while narrated by Sir Laurence Olivier - you can't get much more gravitas than that!Suitable not just for students of history, but for everyone. In fact, this should be compulsory viewing for anyone who wants to understand the history of the 20th century, and the sacrifices that were made in order that we might be free from tyranny."
    },
    {
      "username": "nickenchuggets",
      "userUrl": "https://www.imdb.com/user/ur107418055",
      "reviewLink": "https://www.imdb.com/review/rw6679283",
      "warningSpoilers": false,
      "date": "10 March 2021",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Down this road, on a summer day in 1944, the soldiers came.",
      "content": "There's no way I can do world at war justice by writing about how amazing it is. You simply need to experience it for yourself to see the incredible footage, intriguing interviews, unforgettable music and atmosphere, and Olivier's narrating (arguably the best part). Your eyes and ears are glued to the screen as events, both horrific and jovial, are recounted by him in a calm but authoritative voice. The solemn narrating combined with seeing the atrocities of the second world war unfold on the screen are nothing short of magical. World at war is often gruesome, macabre, and shockingly violent, but that doesn't mean it's bad. The show lets you draw your own conclusions about what you just saw. It is very uncommon, especially with regards to ww2 documentaries, to see the producers and writers take a completely unbiased look at what exactly took place, and world at war executed this flawlessly. The series was also made at a time when many of the officers and high ranking leaders of the war effort for various nations were still alive, which helps add more depth to the series and is greatly appreciated. The interviews with Hitler's personal secretary Traudl Junge, Admiral Doenitz of the german navy, and Arthur \"Bomber\" Harris of the royal air force were all riveting, and that's to say nothing of all the others made to speak in front of the cameras. It simply makes you care more about what's going on when there are different viewpoints. The series does a good job of providing comic relief in between the usual sections filled to the brim with the savage brutality we've come to associate world war 2 with. Only the very best pieces of television can make an audience sad, laugh, scared, worried, or excited within only 1 episode. The chilling opening music by Carl Davis along with Laurence Olivier's voice is what essentially sets the tone for what you're about to see, and the narration is without a doubt one of the best parts of the show. The interviews are fascinating, but when Laurence is talking, you want him to keep talking. When he's not, you can't wait till he comes back. World at War is also a rare series that does not have a single bad episode. They're all amazing in all respects. Each episode focuses on a different time period and place of world war 2, such as \"On Our Way\" which is all about the USA before and shortly after pearl harbor, or \"Red Star\" which is all about the horrors people had to live through in the Soviet Union as Hitler's war machine tore into it. Probably my favorite episode of the entire show is \"Wolf Pack\" since the entire thing is about german submarines. The episode begins with the calm, rolling waves of the ocean, and there is just silence for about 5 seconds. Laurence then says \"The Atlantic. Britain's lifeline. Treacherous enough in peacetime. In war, black with menace.\" The bottom line is World at War is the premiere documentary on the second world war and there has never been another show like it, and there probably never will be."
    },
    {
      "username": "wlb",
      "userUrl": "https://www.imdb.com/user/ur0746682",
      "reviewLink": "https://www.imdb.com/review/rw2060710",
      "warningSpoilers": false,
      "date": "2 May 2009",
      "rate": "10",
      "helpful": "18 out of 21 found this helpful.",
      "title": "History will judge this the definitive video WW2 documentary",
      "content": "I remember watching this in the 1970s - then I have just recently borrowed a couple of episodes from our public library.With a nearly 30 year hiatus, I have come to another conclusion. Most of the principals interviewed in this series - some at the center of power like Traudl Junge (Hitler's Secretary),Karl Doenitz (head of Germany's navy) Anthony Eden (UK) - are long gone but their first hand accounts will live on.From Generals and Admirals to Sergeants, Russian civilians, concentration camp survivors, all are on record here. I can remember the Lord Mountbatten interview (killed in the 1970s) This is truly a gem and I believe the producer of this series was knighted by Queen Elizabeth for this work - well deserved.Seeing these few episodes from the library makes me want to buy the set.This is the only \"10\" I have given any review but I have discovered like a fine bottle of wine, it is more appreciated with a little time..."
    },
    {
      "username": "khanbaliq2",
      "userUrl": "https://www.imdb.com/user/ur22131361",
      "reviewLink": "https://www.imdb.com/review/rw2130009",
      "warningSpoilers": true,
      "date": "20 September 2009",
      "rate": "10",
      "helpful": "15 out of 19 found this helpful.",
      "title": "Clearly the best documentary series about the Second World War.",
      "content": "Still the definitive program about the Second World War, The World At War isn't just long, but also very informative. The series contains 26 episodes (each episode lasts for about 45 min.), and includes the events leading up to and following in the wake of the war. Most episodes are about the war in Europe, and there are several episodes about the war in the Pacific. Other episodes include information about the wars in Africa, Burma, the Atlantic and the home fronts of Germany, Great Britain, United States and Soviet Union. There is one episode that's dedicated to the Holocaust. The series starts off with the episode A New Germany (1933-1939), and tells about the rise of the Nazis in Germany and German territorial gains prior to the outbreak of war. The series ends with the episode Remember; the war's influence in a post-war world. Remember is a fitting episode to end this great program. Every episode begins with a short introduction and then with opening credits. The credits are accompanied by a powerful music theme. There are many fitting music pieces throughout the series. Each episode is like a mini-film. The footage is fantastic, and so is the way it was put together. In addition, some of the footage is in color. The information included also makes the episodes memorable and entertaining.The series was produced by Jeremy Isaacs for Thames Television (UK). Commissioned in 1969, it took four years to produce, such was the depth of its research. The series was narrated by Laurence Olivier (one of the most famous and revered actors of the 20th century). The series interviewed leading members of the Allied and Axis campaigns, including eyewitness accounts by civilians, enlisted men, officers and politicians, amongst them Albert Speer, Karl Donitz, Jimmy Stewart, Bill Mauldin, Curtis LeMay, Lord Mountbatten, Alger Hiss, Toshikazu Kase, Arthur Harris, Charles Sweeney, Paul Tibbets, Traudl Junge and historian Stephen Ambrose. Jeremy Isaacs says in \"The Making of The World at War\" that he sought to interview, not necessarily the surviving big names, but their aides and assistants. The most difficult subject to locate and persuade to be interviewed, according to Isaacs, was Heinrich Himmler's adjutant, Karl Wolff. The latter admitted to witnessing a large-scale execution in Himmler's presence.The World At War is often considered to be the definitive television history of the Second World War. Some consider it the finest example of the documentary form. In a list of the 100 Greatest British Television Programmes drawn up by the British Film Institute in 2000, voted for by industry professionals, The World at War ranked 19th. The program has everything that the viewer needs to know about the war. After watching a few episodes I liked the series so much that I tried to watch the remaining episodes one after the other. I've seen some of them several times. There are two other great documentary series that I know of that may be of interest to the viewer. One is called The Great War (1964) that's about World War I. The other is called Cold War (1998) that's about the Cold War obviously."
    },
    {
      "username": "Cosmoeticadotcom",
      "userUrl": "https://www.imdb.com/user/ur12394529",
      "reviewLink": "https://www.imdb.com/review/rw1949576",
      "warningSpoilers": true,
      "date": "21 September 2008",
      "rate": "9",
      "helpful": "19 out of 26 found this helpful.",
      "title": "Great",
      "content": "It was not long after my family moved into the very first home we had ever owned, in our line's history, that I recall watching, with my dad, a really good television show called The World At War, which recounted the history of the Second World War. The documentary series was produced between 1971 and 1974 by Jeremy Isaacs of Thames Television and featured many key interview subjects, from the common soldier in all the armies to major powerbrokers such as Lord Mountbatten, war correspondent and novelist Lawrence Durrell, Hitler's architect and Armaments Minister Albert Speer, who disingenuously tries to weasel out of his responsibility for the Nazi genocide, German Admiral Karl Dönitz, Averell Harriman, Alger Hiss, film star James Stewart, who served in the US Army 8th Airforce, and General Eisenhower's driver, Kay Summersby, and Adolf Hitler's secretary Traudl Junge. There are even segments with the last survivor of the assassination plot against Hitler, Ewald Heinrich Von Kleist. It is an amazing filmic and journalistic feat that was accomplished, for so many aspects of the war that are missing from other attempts at visually documenting it are here. Isaacs got many honors for the series, from a knighthood to the Royal Television Society's Desmond Davis Award, L'Ordre National du Mérit, and numerous Emmy Awards. Watching this series, again on DVD, and thinking back on my dad's removed fascination with it, when originally aired, made me realize that those days with my dad are now farther removed from the present than the war years the series documents were from his watching of them. Yet, I know why he was so rapt by the series, despite its flaws, and the fact that a more thorough and unbiased video history of the war is just begging to be made. It's because the series wisely focused on the ordinary person, like him. This focus undoes almost all the biases the rest of the series promotes, and makes the whole DVD set an easy recommendation for history buffs, yet to be used as a starting point, not an end all and be all. This series was not just the tales of the giants: Hitler, Churchill, Stalin, Tojo, Roosevelt, Rommel, Mussolini, Eisenhower. It was tales of the ordinary man, and how his contributions changed the world.Watching this series also nails the current lie that we are involved in some global struggle, a 'clash of civilizations', on par with the World Wars, when we are really avaricious and unaccountable myopics absurdly trying to fend off some puny backwater terrorists. This series shows those claims for what they are- lies. Now is not a time of giants that will be studied in the future for their contributions in moving the world forward, but of small men with small agendas, which is a thing quite different, in the worst possible ways, from being ordinary men, like my dad was; ordinary men who helped change human history for the better, in The World At War."
    },
    {
      "username": "trickyascupart",
      "userUrl": "https://www.imdb.com/user/ur7333305",
      "reviewLink": "https://www.imdb.com/review/rw1223601",
      "warningSpoilers": false,
      "date": "24 November 2005",
      "rate": "10",
      "helpful": "57 out of 66 found this helpful.",
      "title": "The Ultimate World War Two Documentary Series",
      "content": "Although too young to remember the first showing of the series (being just a baby) I later caught repeats of it on television in the late 80's, just when I was getting interested in the war and all of its aspects. It was my grandfather who first showed me the series and also gave me my first interests, relating tales of his time in the Royal Navy at Malta and later in the Pacific. Since then I have devoured many books and seen many television series about the World War Two era, with mixed opinions. The British television stations are generally very good at producing these, as The World At War can easily attest, with many gems made by both the BBC and independent companies. I strongly recommend such titles as \"The Nazis - A warning From History\", \"Blitz\" and the BBC series about Dunkirk. \"Britain At War In Colour\", with its companion series \"Japan\", \"Germany\" and \"America\" are of a very high standard. The World At War is by far the best and, despite its age, never fails to deliver. There will always be new revelations about the war that will keep cropping up that obviously aren't included in the series and of course World War Two took place over such a large canvas that to produce a series with EVERY detail would take more time and money then any other, even if such an undertaking was even possible. What I feel I must say to those who decry that it does not include everything is that The World At War can't physically do that as a series but it sure as heck can prompt you to do further research - and make it enjoyable. That certainly worked for me: I now have a very comprehensive library of books, videos, DVDs and tapes and CDs. Recommend to anyone with even a passing interest. The series was so well made that they'd find it hard not to agree that it is quality programming and highly informative."
    },
    {
      "username": "d1494",
      "userUrl": "https://www.imdb.com/user/ur1568235",
      "reviewLink": "https://www.imdb.com/review/rw0133305",
      "warningSpoilers": false,
      "date": "12 September 2002",
      "rate": "10",
      "helpful": "23 out of 28 found this helpful.",
      "title": "An Absolute Must,one of the greatest documentaries ever made",
      "content": "This should be required viewing for all young people. This is documentary at its best, from the haunting music and terrific narration by Olivier to its unflinching and penetrating analyses, The World at War is unforgettable and irreplaceable for anyone who wants to know about humanity's sorry experience at the nadir of the 20th century."
    },
    {
      "username": "talley-1",
      "userUrl": "https://www.imdb.com/user/ur2998631",
      "reviewLink": "https://www.imdb.com/review/rw1192806",
      "warningSpoilers": false,
      "date": "13 October 2005",
      "rate": "10",
      "helpful": "72 out of 80 found this helpful.",
      "title": "Best overall documentary of WWII",
      "content": "My wife and I have watched this whole series at least three times. I can't imagine how it could be better. This isn't the \"complete\" history of WWIIno library could hold such a historybut it is the best summary of that history. Lots of detail, lots of personal stories, and still keeps the overall picture in view.Olivier's narration is excellently written and, of course, superbly given. The interviews are from all sides, except the Russian, because the producers were not allowed to talk to many Russians. It is very much worth owning this complete program on DVD. We treasure our copy.The producer's do an excellent job of providing pictures and action where there was almost none extant in any archive: There are almost no films of convoys and submarine battles, for instance, but still, the episode on this subject is very well done."
    },
    {
      "username": "afonsobritofalves",
      "userUrl": "https://www.imdb.com/user/ur87748969",
      "reviewLink": "https://www.imdb.com/review/rw4407416",
      "warningSpoilers": false,
      "date": "19 October 2018",
      "rate": "9",
      "helpful": "7 out of 8 found this helpful.",
      "title": "One of the best series ever",
      "content": "Without doubt the best series of history and the best series in documentary of always !!! Very interesting, full of information important to the history of humanity that everyone should know. One of the best educational series ever. A real injustice just having a season. True quality. Highly recommend."
    },
    {
      "username": "dm_451",
      "userUrl": "https://www.imdb.com/user/ur5182869",
      "reviewLink": "https://www.imdb.com/review/rw1065067",
      "warningSpoilers": false,
      "date": "22 April 2005",
      "rate": "10",
      "helpful": "98 out of 106 found this helpful.",
      "title": "Far Superior to any other documentary. Should be an 11 * rating.",
      "content": "Theo Robertson has commented that WAW didn't adequately cover the conditions after WWI which lead to Hitler's rise and WWII.Perhaps he missed the first ONE and a quarter HOURS of volume 8? Covers this period, and together with the earlier volumes in the series, shows clearly the existing conditions, I feel. A friend of mine grew up in Germany during this period, joined the Hitler Youth even, and his experiences were very similar to that mentioned in WAW.This documentary is SO far above the History Channel's documentaries I also own, that there is no comparison.The ONLY fault, and it is a small one, that I have with WAW is this: the numbers are not included, many times. For instance, if you're talking about lend-lease, then how much war material was lent/leased? How much to Russia, how much to Britian? How many merchant ships did the U-Boats sink, and when? How many ships did the German or Japanese Navy have, total, in 1941? What type were they? How many troops? How many troops did the allies have, in total, and by country? Lots of numbers could have made a lot of viewers nod off, but I would have preferred MORE! And naturally, I always want to see more military analysis. Like WHY didn't Patton & Clark trap the German army that was at Cassini, after they had it surrounded, instead of racing Monty to Rome, and letting it escape? I don't think you can begin to understand war until you've seen some of these video segments on \"total war\", like the fire bombing of Dresden. It's like trying to understand Auschwitz, etc., before you see the clips of the death camps: you just can't wrap your head around it - it's too unbelievable.Unknown at that time, and of course, unfilmed, were the most egregious cruelties and inhumanities of the Japanese, including cannibalism, (read \"Flyboys\"), and some LIVE vivisection of medical \"experimentation\" prisoners, w/o any anesthetic! Dave"
    },
    {
      "username": "jimlacy2003",
      "userUrl": "https://www.imdb.com/user/ur17921286",
      "reviewLink": "https://www.imdb.com/review/rw2487575",
      "warningSpoilers": false,
      "date": "12 September 2011",
      "rate": "10",
      "helpful": "12 out of 15 found this helpful.",
      "title": "Remains the definitive WWII history series",
      "content": "I originally watched parts of the series when I was a kid as my father had it on VHS. Didn't get much of it at the time. I didn't see so much significance in it as I wasn't the WWII history aficionado as I am now.I have a collection of countless WWII history documentaries, and many WWII dramas. After watching many, some of them quite interesting and compelling then recently getting the Blue Ray version of this series, it's obvious the \"The World at War\" is the definitive series of the genre.Firstly, in 1973 even while the BBC was filming this some 28'ish years after the war, there were a lot people around from the war to interview. So the series is full of wonderful interviews from people that were there.The deep baritone voice narration keeps the whole thing compelling, albeit some times difficult to watch/grasp to do the nature. And there is some pretty large volume series, maybe 10 or so volumes, but nothing matches this series in size and completeness.Now as another reviewer pointed out there is undoubtedly some bias. As with any such history recount there are often different political views.It all depends on who is telling the story. For instance here in America when I was a child I was taught that certain late 1800 generals were basically hero's for fighting Indians (Native Americans). But in reality it turns out that were actually brutal killers involved in more of a massacre of the people.Also there is just differing opinions on the how and why somethings happened in WWII. For instance with the \"Battle of Dunkirk\" some historians suggested that it was a big blunder by Hitler allowing the British soldiers to escape, while a more contemporary view is that it was more an issue of logistics.You have to make your own study with a \"gain of salt\" and come to your own conclusions. Why I suggest you watch several documentaries and read the books by \"Albert Speer\" (for more of an German inside view), etc.While on the subject, it's actually kind of a shame in WWII dramas (fictional and partly historical) where things are often distorted and twisted for dramatic effect. While almost every German is the bad guy and usually all demonized et al. For example, I'm sure the average German solider didn't know much about the genocide at all, and was not involved in any untoward brutality. He was too busy being a solider as any solider is conscripted to do. From various other documentaries it shows the Japanese were just as inhuman, if not more so. Also it overshadows other genocidal dictators like Stalin and Mao Ze-Dong responsible for around twice and at least five times as many deaths respectively! Often of there own people even! I'm not sympathizing, nor taking sides. There was undoubtedly unprecedented evil in the Nazi regime, but contorting the truth and turning the facts more into a fantasy is a disservice. If you really want to understand how things came about, how a country was turned around into such a hating war machine, plus how to advance as a world civilization and not have such things happen again then you have to embrace the facts.The movies want a great bad guy to hate, but it always isn't the facts. I would like to see more movies like \"Das Boot\", \"Letters from Iwo Jima\", etc., that show somewhat of a different point of view. Although these are still \"Hollywoodized\" by making things okay/politically correct because they all die in the end, etc.I digress. If you want to see a great documentary for entertainment and to study a part of WWII watch this excellent BBC \"The World at War\" series!"
    },
    {
      "username": "strek1",
      "userUrl": "https://www.imdb.com/user/ur0697217",
      "reviewLink": "https://www.imdb.com/review/rw1057047",
      "warningSpoilers": false,
      "date": "9 April 2005",
      "rate": "10",
      "helpful": "54 out of 64 found this helpful.",
      "title": "Still the benchmark WWII Documentary",
      "content": "After all these years I still consider this series the finest example of World War II documentary film making. The interviews with the many participants from all countries set this apart from any other project. It would be great to see a contemporary documentarian(Ken Burns ?) take on this topic and try to gather information from veterans before they are all gone. With modern technology to improve old archival footage and lots of information that has been unearthed since 1974 when The World At War was produced, an updated version of this series would be welcome. The History Channel has made some fine shows dealing with many aspects of WWII but an expansive series such as the World At War has not been successfully attempted since the original. If you are interested in this era don't miss this series. It is required viewing."
    },
    {
      "username": "naseby",
      "userUrl": "https://www.imdb.com/user/ur2388657",
      "reviewLink": "https://www.imdb.com/review/rw2017746",
      "warningSpoilers": true,
      "date": "3 February 2009",
      "rate": "10",
      "helpful": "11 out of 14 found this helpful.",
      "title": "The yardstick that all documentaries are/should be measured by (SPOILERS)",
      "content": "This excellent series, narrated by Laurence Olivier, brilliantly, it should be said, charts the beginning to the end of World War 2. The origins are not entirely examined fully from Germany's fall at the hands of the Versailles treaty which helped propel Hitler's demonic rise, but as one reviewer says, that must be hard to do, in a 26-part series with so much to cram in. Apart from the expected combat photography/action, there are plenty of personal, emotional and human tragedies that are told giving the viewer an amazing insight, especially if you're not necessarily a World War 2 buff/fan. Episodes showing 'testimonies' and what life was like on the home front of the main allies/adversary, Britain, Germany, Japan, Russia and the U.S.A. were quite eye-opening. Showing the extreme savagery of the war on the frontline and of course the sufferings of civilians, the death camps etc., were very well handled and exposed. I'd fully recommend this in any history class for the younger generation (Of which it could be said I am one at 47!).Certain things are quite strangely left out, like the advent of the new jet era beginning, with Frank Whittle's experimental Gloster jet and the Gloster Meteor's combat debut as well as that of the German Messerschmitt Me 262 - especially as the V-1 was seen making its debut and there was surprisingly smaller mention of the V2. This is probably a small oversight, not referring to the more sensational secret and fantastic weapons which WW2 brought forward from a more barren old science. But a great series that made its mark and has done so ever since when thankfully repeated. A series to own as a box set in history terms, on DVD for anyone especially who happens to be a military fan. Jeremy Isaacs and Thames TV should be well proud."
    },
    {
      "username": "action-6",
      "userUrl": "https://www.imdb.com/user/ur0186091",
      "reviewLink": "https://www.imdb.com/review/rw0133299",
      "warningSpoilers": false,
      "date": "5 March 2000",
      "rate": "10",
      "helpful": "12 out of 17 found this helpful.",
      "title": "A stunning documentary about world war 2",
      "content": "The world at war is one of the best documentaries about world war 2. The 24 episodes cover the war and what it was like in the countries involved in it. The first episode tells us how the Hitler came to power, and how he was able to build up one of the strongest armies in the world. They also fucus on the military actions taken during the war, and the holocaust. One of the strongest and best documentaries ever made. All of you must watch this. Perfection! 10/10"
    },
    {
      "username": "Brucey_D",
      "userUrl": "https://www.imdb.com/user/ur65243464",
      "reviewLink": "https://www.imdb.com/review/rw4529269",
      "warningSpoilers": false,
      "date": "23 December 2018",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "\"...Remember....\"",
      "content": "This is pretty well the most definitive account of WWII; made at a time when the dust had settled, and a sense of perspective achieved, but not so long after that all the figures involved had passed away. Even forty-five years on, it remains a benchmark both in its account of WWII events and in documentary film making.It would be all too easy to have given something other than a sober, dispassionate account of events; nonetheless they managed to do this quite well, despite the often appalling events being described, and the temptation towards political posturing. From Olivier's measured delivery, through the script and editing work, the interviews with protagonists and survivors alike, even through to the evocative music and credits, this series is a masterpiece.After the Great War, the war to end all wars, the first fully industrialised war, who could think it possible that the World would be plunged once again into global conflict only twenty years later? Yet it happened; from initial events such as the Japanese invasion of China and German expansionism in Europe, eventually there was war on multiple fronts, with few countries not somehow dragged into the conflict.Instead of presenting events world-wide in chronological order, which would potentially be as confusing as 'the fog of war' itself, this series breaks the conflict down into twenty-five episodes, each giving an account of one theatre of war or one aspect of it. Some episodes are truly harrowing even now; the passage of time alone cannot dim the horror of those events; interviews with survivors almost invariably betray deep scars that could never fully heal, creating statements which are more powerful than the words alone could ever convey.Of course there are errors and omissions; there is relatively little mention of the fate of the Baltic states, for example. Other facts, such as the existence and importance of the Ultra secret, were not fully publicly disclosed even then, which today puts a different slant on the accounts of several of the battles fought, notably the battle of the Atlantic. As time goes on, doubtless other secrets will be revealed which may yet change our perspective on some of the events; nonetheless this does little to undermine the achievement and importance of this series.A final comment is that when this series was made, the world was arguably still at war; the cold war was at its height and we were (and maybe still are) potentially only a stone's throw away from nuclear Armageddon."
    },
    {
      "username": "katey525",
      "userUrl": "https://www.imdb.com/user/ur4037474",
      "reviewLink": "https://www.imdb.com/review/rw1337537",
      "warningSpoilers": false,
      "date": "9 April 2006",
      "rate": "10",
      "helpful": "49 out of 59 found this helpful.",
      "title": "This is THE WWII documentary....",
      "content": "If you want just about everything you want to know about WWII from multiple perspectives, this DVD delivers, you WILL learn new things guaranteed, so much so that you won't need any other documentary's on the subject. Get this, watch it, learn from it. Good for school use as well. As a bonus, watch this with Tora tora tora, saving private ryan, patton, band of brothers, a bridge too far, the longest day and other WWII epics along with this to make your knowledge of WWII even more complete. Sir Laurence Oliver's voice adds to the overall atmosphere of each episode in this 26 part series. Seriously you won't find a better WWII documentary set on the subject. PERFECT 10!!!"
    }
  ],
  "errorMessage": ""
}