{
  "imDbId": "tt2243973",
  "title": "Hannibal",
  "fullTitle": "Hannibal (TV Series 2013–2015)",
  "type": "TVSeries",
  "year": "2013",
  "items": [
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw3065233",
      "warningSpoilers": false,
      "date": "9 August 2014",
      "rate": "",
      "helpful": "373 out of 413 found this helpful.",
      "title": "The most visual – and visually daring – crime show on TV",
      "content": "Having seen the films based on Thomas Harris' novels, I couldn't for the life of me imagine an actor other than Anthony Hopkins for the role of Hannibal Lecter (although I had seen - and liked - Brian Cox' take on the character in Michael Mann's 'Manhunter' which was released before 'The Silence of the Lambs'). Apart from that, I didn't see the point in retelling a story that had already been told very well on film – and with outstanding actors. For those reasons, I deprived myself of the pleasure of watching 'Hannibal' until the second season of the show started - but boy: am I glad I finally got over myself and did start! To those who haven't watched it for the same reasons I didn't I can only say: knowing the storyline from the films (or the books) doesn't spoil this in the least; the writers cleverly play with your expectations and they have taken enough liberties that you can never tell what is going to happen. And Mads Mikkelsen makes for a terrific Hannibal. The cat and mouse play between him and Hugh Dancy's Will Graham is a thrilling joy to watch; the conversations between the two are an example of surgically precise writing where every word counts and could - literally – be a concealed weapon (the writing in general is top notch, especially the dialogues).Visually, this series is unlike anything I've ever seen; the opulence of the images seems to be directly inspired by the aesthetic of oil paintings; whenever food is served or you see the interior of Hannibal's mansion you're reminded of still lives from the Dutch Baroque; certain dreams, visions and hallucinations even recall the works of Hieronymus Bosch. Don't get me wrong: first and foremost this is a gory crime show about an exceptionally well educated and highly intelligent serial killer (and not some \"art show\") – albeit one with a very unique look.My verdict: 'Hannibal' offers gory thrills along with amazing images, fascinating characters and an outstanding cast. Perhaps the most visual – and visually daring – crime show ever. 9 stars out of 10.Favorite films: http://www.IMDb.com/list/mkjOKvqlSBs/Lesser-known Masterpieces: http://www.imdb.com/list/ls070242495/Favorite Low-Budget and B-movies: http://www.imdb.com/list/ls054808375/Favorite TV-Shows reviewed: http://www.imdb.com/list/ls075552387/"
    },
    {
      "username": "jack_o_hasanov_imdb",
      "userUrl": "https://www.imdb.com/user/ur55640799",
      "reviewLink": "https://www.imdb.com/review/rw7211622",
      "warningSpoilers": false,
      "date": "9 August 2021",
      "rate": "9",
      "helpful": "35 out of 38 found this helpful.",
      "title": "Wow",
      "content": "After I started this series, my mouth was open, it was very good. I was amazed, the acting, the script, everything was perfect."
    },
    {
      "username": "petemcphee2",
      "userUrl": "https://www.imdb.com/user/ur55355932",
      "reviewLink": "https://www.imdb.com/review/rw5868073",
      "warningSpoilers": false,
      "date": "29 June 2020",
      "rate": "10",
      "helpful": "50 out of 55 found this helpful.",
      "title": "Possibly the best written crime/horror ever",
      "content": "Many will argue that Hopkins is \"the best and only\" Hannibal, much like folk declare allegiance to Bond actors. But I like to think of each incarnation as seperate and of its time. There's no doubting that Hugh Dancy's Will Graham is streets ahead of Ed Norton's earlier portayal. Hannibal is easily my favourite Lector telling. It benefits from two things; The depth of field afforded the story by being a TV series and the ability to tap and reference the rich tapestry of what's went before. Hannibal the TV series is exceptional, a prequel that feeds directly into a narrative that feels fresh and yet familiar. Because of the intricacies of the known characters it plays out like a chess game. Intelligence is sexy, murder is horrifying... Sexy horrifying is so alluring as an entertainment form. The visual effects of this are mind blowing. I've never seen horror be filmed as artistically as this outside of Penny Dreadful. For 3 seasons this show thrilled and entertained. Now we are anticipating a 4th season to emerge from the gloom of Covid-19. Let's hope its writers have learned everything the original 3 seasons took in from the previous incarnations. Let's hope we remain horrified, mesmerised and even rooting for the biggest and baddest anti hero of Modern Horror."
    },
    {
      "username": "rlranallo",
      "userUrl": "https://www.imdb.com/user/ur75405551",
      "reviewLink": "https://www.imdb.com/review/rw5956755",
      "warningSpoilers": false,
      "date": "1 August 2020",
      "rate": "10",
      "helpful": "58 out of 62 found this helpful.",
      "title": "Mads and Hugh - impeccable for these roles WOW",
      "content": "Mads and Hugh are perfect for the roles they capture in this series. They balance that fine line of love and disgust and adoration for one another - it's so beautifully done I just wish this would of continued on after season 3 Definitely not for the weak hearted in regards to gore"
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw3169754",
      "warningSpoilers": false,
      "date": "25 January 2015",
      "rate": "9",
      "helpful": "71 out of 85 found this helpful.",
      "title": "Excellent but NOT for every taste...",
      "content": "I am going to say something heretical, so hold on to your seats. I thought that the Hannibal Lecter character in the movie \"Silence of the Lambs\" was extremely overrated. Subtle, he was NOT, that's for sure. Because of this, I really, really like the new incarnation of the doctor in this Bryan Fuller series. He is sophisticated, clever and, most importantly, a credible villain--not some bizarro dude going on about chianti and fava beans! In fact, the sophistication and style of this show is why I think it's a winner.I must point out, however, that \"Hannibal\" is NOT a show for everyone. Children should NEVER watch it nor should people who are sensitive and would be upset or offended by the carnage in the shows. Some of them are REALLY tough to watch--such as the mushroom people or the angels. Now I am NOT saying don't watch it--but maybe you should use common sense and not watch. Or, do like my daughter does, just avert your eyes when the gore hits a particularly high level...and it often does! Very well written, acted and directed--this is almost too good for network TV.FYI--My daughter has the Blu-Ray for season one. According to her, some of the shows are MUCH more graphic on DVD--such as the one with the musical instrument killer."
    },
    {
      "username": "ichsachmalso",
      "userUrl": "https://www.imdb.com/user/ur14767233",
      "reviewLink": "https://www.imdb.com/review/rw5831425",
      "warningSpoilers": false,
      "date": "17 June 2020",
      "rate": "9",
      "helpful": "80 out of 89 found this helpful.",
      "title": "So aesthetically pleasing",
      "content": "I've been a fan of the franchise long before the show came into being, and it did not disappoint! I love how beautiful everything is shot despite all of the horror and gore. The motives and emotions are intricate and the acting is a thing to behold. Yeah, the third season could use a bit more plot to buff out the poetry but really, I can't fault it much. This is also one of the very few shows that has had a satisfactory ending!"
    },
    {
      "username": "ryanwinning1",
      "userUrl": "https://www.imdb.com/user/ur54433040",
      "reviewLink": "https://www.imdb.com/review/rw5892307",
      "warningSpoilers": false,
      "date": "9 July 2020",
      "rate": "10",
      "helpful": "24 out of 27 found this helpful.",
      "title": "Blows CSI away!",
      "content": "Before watching this series I wondered \"Why in the world would they try to recreate the Hannibal movie series? It's been done! It's over! No one can replace Anthony Hopkins as Hannibal!!\" Boy was I wrong. Mads Mikkelsen shows off some seriously unique acting chops throughout this entire series! I absolutely hated him in the Bond film Casino Royale(In a good way!) I hated him because he was so twisted, evil, smart and cunning as the villain and all those traits are magnified throughout the 39 episodes of this series. It's gruesome and horrifically violent and even though I was cringing because it seems so realistic I was simultaneously wildly-entertained all the while! There simply isn't enough time to tell the full Hannibal story over 3 movies and appreciate all the details so I realize now this 3 season series is entirely justified. As someone who's suffered with ADHD for most of my life I also appreciate the mental health aspect behind this series. with the time of a TV series you get a chance to go under the hood of Hannibal the psychiatrist and in a 2-hour hollywood movie there just isn't enough time to dig deep into mental health in what separates Special FBI agents, serial killers or average ordinary people. I found the whole series thought provoking and very interesting."
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw5476183",
      "warningSpoilers": false,
      "date": "11 February 2020",
      "rate": "10",
      "helpful": "34 out of 41 found this helpful.",
      "title": "Masterful crime/horror show",
      "content": "Visually arresting to watch especially with the soothing music and incredible acting! Hugh Dancy is electrifying, I love the way he solves crime scenes and the fact he seems to have Asperger's which I have too. The nightmares are spellbinding and visual effects are one of my favorite things ever done! Hannibal is written with brilliance throughout; I'm so hooked to this charming elegant show."
    },
    {
      "username": "gk303007",
      "userUrl": "https://www.imdb.com/user/ur102935740",
      "reviewLink": "https://www.imdb.com/review/rw5864178",
      "warningSpoilers": false,
      "date": "28 June 2020",
      "rate": "9",
      "helpful": "21 out of 24 found this helpful.",
      "title": "Mads Mikkelson... Scary antagonist",
      "content": "I remember watching this show while my friend and i used to commute. What started as a casual timepass soon turned out addict, and we couldn't wait watching a couple of episodes everyday.Good acting by primary and side casts. But its the antagonist who stole the show. Mads Mikkelson had surpassed everyone with his quirky acting and frantic skills. I mean we used to feel pity on his victims but that never changed our mind to hate him.A must watch."
    },
    {
      "username": "BladeSparkles",
      "userUrl": "https://www.imdb.com/user/ur23057983",
      "reviewLink": "https://www.imdb.com/review/rw5481943",
      "warningSpoilers": false,
      "date": "14 February 2020",
      "rate": "10",
      "helpful": "64 out of 73 found this helpful.",
      "title": "Magnificent",
      "content": "Truly superb writing, casting, acting, direction and editing. This show is a work of art. If you can, please watch in a quiet, intimate setting to truly appreciate the elegant horror being served. I have never been as impressed with a series as I am with this one. It's very surprising that a show this dark was on network television, I can't see the NBC viewer appreciating such darkness. I'm preparing for a second viewing of all the seasons. It was perfection to the very end."
    },
    {
      "username": "masters-mind-team",
      "userUrl": "https://www.imdb.com/user/ur57232823",
      "reviewLink": "https://www.imdb.com/review/rw3191598",
      "warningSpoilers": false,
      "date": "25 February 2015",
      "rate": "10",
      "helpful": "217 out of 257 found this helpful.",
      "title": "I proudly vote 10000000/10 for this Master Piece",
      "content": "First of all, this has the BEST script EVER! a script worth to be learned by heart, the delivery, the word choice are so aesthetic.Then, the story is compelling, the BRUTALITY is tempting, the Music is fascinating, the elegance is inspiring, the cooking is appetizing ...Hannibal characterizes the natural perfection, his facial expression is so cold and lifeless yet shines with an unearthly abnormal confidence. He's a multiskilled person who has an encyclopedic knowledge, He honors his carcasses by displaying them in an artful piece and also by not wasting their organs.This series will make you have several EYEGASMS and EARGASMS ! This is not for the simple minded half wits of course !!!"
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw3308639",
      "warningSpoilers": false,
      "date": "31 August 2015",
      "rate": "9",
      "helpful": "25 out of 31 found this helpful.",
      "title": "grotesque beauty",
      "content": "FBI agent Jack Crawford (Laurence Fishburne) recruits profiler Will Graham (Hugh Dancy) to return to work on a serial killer case. Will gets counseling from renown psychiatrist Dr. Hannibal Lecter (Mads Mikkelsen). Dr. Alana Bloom (Caroline Dhavernas) is concerned about the effects of the case on her friend Will's psyche. Bryan Fuller brings the characters created by Thomas Harris onto the TV screen.I love this show from the very beginning. The first season is part police procedural and part disturbing psycho drama. Mads is fearfully intense. Hugh Dancy is compelling damaged goods. It's visually stunning. Dead bodies have never looked so beautiful. That's not to say that everything ran smoothly. The slow moody scenes take some getting used to. I still think the psychotherapy scenes with Hannibal are too static. The dialogue couldn't make up for its slow flat tone. By the second season, the show settles into the beauty of the violence and the darkness of the psychological warfare. The show breaks new ground especially for network TV."
    },
    {
      "username": "chancenconnect",
      "userUrl": "https://www.imdb.com/user/ur81531834",
      "reviewLink": "https://www.imdb.com/review/rw5838533",
      "warningSpoilers": false,
      "date": "20 June 2020",
      "rate": "9",
      "helpful": "44 out of 56 found this helpful.",
      "title": "Season 3???",
      "content": "Ummm how did season 3 get so poorly done? After the masterpiece assembled in season 1-2. Am I missing something?"
    },
    {
      "username": "filthyfrank-65045",
      "userUrl": "https://www.imdb.com/user/ur109176720",
      "reviewLink": "https://www.imdb.com/review/rw5811698",
      "warningSpoilers": false,
      "date": "9 June 2020",
      "rate": "10",
      "helpful": "16 out of 18 found this helpful.",
      "title": "Didn't know this show existed, thank god it does",
      "content": "This is one of the best shows I have ever seen the acting and script writing are on point but the best part of the show is the beautiful visual aesthetics its one of the best looking pieces of cinema ever"
    },
    {
      "username": "sharmuta666",
      "userUrl": "https://www.imdb.com/user/ur72290641",
      "reviewLink": "https://www.imdb.com/review/rw4499189",
      "warningSpoilers": false,
      "date": "7 December 2018",
      "rate": "10",
      "helpful": "22 out of 26 found this helpful.",
      "title": "A masterpiece",
      "content": "A truly amazing series, my all time favorite, i would watch it a hundred times and never get bored"
    },
    {
      "username": "ahmedgorshy",
      "userUrl": "https://www.imdb.com/user/ur106582401",
      "reviewLink": "https://www.imdb.com/review/rw6269065",
      "warningSpoilers": false,
      "date": "14 November 2020",
      "rate": "8",
      "helpful": "29 out of 38 found this helpful.",
      "title": "Hannibal Review",
      "content": "Hannibal Review I will not talk long, it is an exceptional series that requires some episodes until you get it strong and if you get it it will be one of your favorites. The first season's rating is 9.0 / 10 Second season 9.9 / 10 Third season 9.0"
    },
    {
      "username": "troydg84",
      "userUrl": "https://www.imdb.com/user/ur24390222",
      "reviewLink": "https://www.imdb.com/review/rw4841026",
      "warningSpoilers": false,
      "date": "10 May 2019",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "Mads",
      "content": "Hannibal is a truly remarkable series. The acting is as good as it gets in television or film and the story is very engrossing. I'm not someone that typically appreciates art the way many do but it is shot in the most beautiful and haunting way. It is too bad that the show didn't get the seasons it deserved but the three they gave us are gold."
    },
    {
      "username": "eapplebaum",
      "userUrl": "https://www.imdb.com/user/ur8497880",
      "reviewLink": "https://www.imdb.com/review/rw3496975",
      "warningSpoilers": false,
      "date": "1 July 2016",
      "rate": "10",
      "helpful": "20 out of 24 found this helpful.",
      "title": "Visual Masterpiece and Gruesome yet compelling story",
      "content": "This show was a masterpiece in that it was a visual visual art form with quite unexpected writing and plot twists. The acting was superb and the story was extremely disturbing and sophisticated. Opinions are just that, opinions; and if one looks at the content of this series and bases their opinion of the execution of story and production value on the fact that a reviewer hates gruesome violence and serial killers, they're not going to \"get\" this show, at all. Everything about this series should be viewed as an art form and at the same time commentary of our Society. it's quite profound and deep. To understand the genius of this series better one must read the brilliant review of the series by Emily Nussbaum in The New Yorker."
    },
    {
      "username": "cgray5605",
      "userUrl": "https://www.imdb.com/user/ur20509861",
      "reviewLink": "https://www.imdb.com/review/rw5872630",
      "warningSpoilers": false,
      "date": "1 July 2020",
      "rate": "10",
      "helpful": "22 out of 25 found this helpful.",
      "title": "Absolutely phenomenal",
      "content": "Blown away; the acting, writing, cinematography, just perfect!! Mads Mikkelsen is a genius."
    },
    {
      "username": "Manal1987",
      "userUrl": "https://www.imdb.com/user/ur12938855",
      "reviewLink": "https://www.imdb.com/review/rw3309247",
      "warningSpoilers": true,
      "date": "1 September 2015",
      "rate": "8",
      "helpful": "34 out of 46 found this helpful.",
      "title": "A Feast for the Eye and Soul Not the Mind",
      "content": "The number of I-hate-you-then-I-love-you moments I have had during watching NBC's Hannibal since it started in 2013 until it sadly (for us viewers) ended last Saturday is too great to count. However, the disappointment I am feeling right now because I will see no more of Hannibal is a success in and of itself. At first I did not know how to go about this review in the most logical way possible (it is really hard to convince my mind to do so!) so I came up with the 'ingenious' idea of putting my remarks into points as randomly as they jump to my head:-Bryan Fuller is brilliant, there is no doubt. His decisions to carry Thomas Harris's novels to the surreal and metaphysical realm and to focus on the complicated/mind-twisting/homoerotic relationship between Hannibal Lecter and Will Graham are very bold. Nonetheless, Fuller delved so deep into surreality it sometimes cost the show its sense of realness. Do not get me wrong, I am and always be pro adaptation of all sorts and kinds, but Harris's Hannibal saga is basically a unique study of the human psyche and its psychological dimensions – something you cannot tackle without having at least one foot in reality. What makes Hannibal Lecter a truly frightening character is that he feels very real and if you drop that, all you have is a mythical character no different than Sisyphus or Medusa. This is my only problem with the show. The result was unmistakable pretentiousness in storyline and dialogue, especially in season 1. It is smart, I admit, but in which universe would a dialogue like that take place? It feels pompous and forced. Same can be said about some turns of events; each of the series primary characters has been stabbed, burned, or shot at least three times over the course of the show, yet they miraculously managed to come back to life! As a result I lost my sense of surprise. By the time I reached season 3, I was like \"Oh, X lost his head. No problem, he'll somehow find his way back to the show.\" In Egyptian Arabic there is a saying that describes inexplicable events in films and it goes \"el mokhreg ayez keda\" which roughly translates to \"because the director wants it so!\" Fuller definitely wants it so.-If you get over the above mentioned problem you will find the show utterly phenomenal. The dynamics between Hannibal and Will especially in seasons 2 and 3 are captivating and make up for the sometimes awkward dialogue. In the last two seasons events move faster and become more focused on the Hannibal-Will relationship which gets compellingly more rounded. It is by far the most twisted and gripping romance of the 21st century. Season 3 is remarkable too with the introduction of the Red Dragon which pumps new blood in the aesthetics-invested season.-Want to know more about the aesthetics of voyeurism? Watch Hannibal. The imagery picks on the surreal side of the story and turns it into a feast for the eyes indeed. I will never forget the sinister Wendigo, the dying stag, and the wings of the Red Dragon. In spite of the gory nature of some scenes, the literally breathtaking cinematography transforms them into surreal sensuous/sensual paintings that you would want to see again and again. That effect is greatly aided by the artistic editing and the choice of music – end result is transcendental. The murder scene in season 3 finale \"The Wrath of the Lamb\" is an example. Imagine with me this stomach- churning scene: two men covered in blood trying to kill another man by stabbing, slashing and biting him. Naturally, nothing pleasant or aesthetic can come out of it; however, it turns out to be the most beautiful thing I have seen in a very long time. Surreal. Horrifying. Mesmerizing. Heart- wrenching. Also, Siouxsie Sioux' song \"Love Crime\" makes it hit deeper in the heart.-Everyone on the show did a brilliant job, even though Hugh Dancy (Will Graham) was overdoing it sometimes, but once you get used to his performance you can sit back and enjoy the chemistry between him and Mads Mikkelsen (Hannibal Lecter) play out. Richard Armitage was one hell of a pleasant surprise.The only person that was unbearably annoying is Gillian Anderson playing Bedilia Du Maurier. As a character, I couldn't wrap my head around her motives and development – I think Fuller put her there only to serve as a receiver of Hannibal's and Will's mind contents. As an actor, her poker face and slow articulation made me want to slit my wrists every time she was on screen.-Saving the best for last, let's talk some Mads Mikkelsen. I will try my best to put his overwhelming sex appeal and my apparent subjectivity aside.. but heck with objectivity! Objectivity is a delusion, so just let me take a deep breath and start rambling about this Danish talent. Anthony Hopkins' name is forever linked to Hannibal Lecter because of his legendary performance in the cinematic adaptation with no prospects of anyone even coming close. Mikkelsen did it. I am not saying he is better than Hopkins, all I am saying is he was smart enough to decide to play a different tune and show us a new side of Hannibal.. the charmer, the mind player, and the vulnerable as well. Thanks to Bryan Fuller and Mikkelsen, Hannibal Lecter's character becomes alive again with so much vigor and articulate details missing in previous adaptations. His clothes, his movements, his choice of words, his highly controlled facial expressions – everything he does unpretentiously and effortlessly oozes menace.If this show was a living being, Mikkelsen would definitely be the heart of it.Seriously, who would have thought that watching a cannibal kill people and cook them for meals would be that yummy?"
    },
    {
      "username": "getuliohf",
      "userUrl": "https://www.imdb.com/user/ur63518105",
      "reviewLink": "https://www.imdb.com/review/rw5495487",
      "warningSpoilers": false,
      "date": "19 February 2020",
      "rate": "10",
      "helpful": "21 out of 27 found this helpful.",
      "title": "Intense, suberb and very dark",
      "content": "This show is quite good and very intense. It's one of most disturbing stories I ever watched. It shows how far a disturbed but genious and dark mind can go. Weak people should not watch it, I think, because many fears can be triggered when seeing some situations depicted in the episodes, and could be even traumatic."
    },
    {
      "username": "zactac",
      "userUrl": "https://www.imdb.com/user/ur22232001",
      "reviewLink": "https://www.imdb.com/review/rw2960387",
      "warningSpoilers": false,
      "date": "13 February 2014",
      "rate": "10",
      "helpful": "31 out of 42 found this helpful.",
      "title": "A macabre world filled with intelligent twists.",
      "content": "I have to say I am very impressed with how the spin-off series of Hannibal Lector has turned out. While I was a little worried at first after hearing the idea to create a series based on the most famous cannibal in the history of film, the series have placed my fears to rest.The series follows Will Graham, a profiler for the FBI, and his journey into the minds of the darkest criminals. It is his daily job to think like the psychopaths they deal with and this has left a great toll on his mind. To protect what sanity he had left, he decided to leave. However, once he is manipulated into coming back to the FBI, he must learn new ways to protect himself from the dangerous profession he is involved in. So along comes Dr. Hannibal Lector, a psychiatrist who Will becomes close to. While Will confides in Dr. Lector his deepest, darkest secrets, he has no idea that the man he is speaking to is actually one of the greatest serial killers (and cannibals) the FBI has ever searched for.With such a dark story leading the way for this show, the fear would be that NBC just isn't free enough to do the material justice. A show such as \"Hannibal\" would be more suitable for cable TV channels such as AMC or FX, that would be the thought at least. However, NBC proves naysayers otherwise by showing just how fearless they can be when the time calls for it. They truly dive deep into a world that is dark and macabre in ways that even match \"American Horror Story\" by creating an atmosphere that is chilling and disturbing. They especially do this with terrifyingly graphic imagery. Honestly, with how far the show seems to go at times I am amazed they didn't end up having to tone things down or risk getting booted. Happily though, the show is still going strong with its wonderfully macabre world still intact.But it is the chemistry between the two leading actors that really sells the show. Hugh Dancy and Mads Mikkelsen do fantastic work in the leads. Dancy shines as the poor Will Graham. You can really see the tragedy behind his eyes as he goes deeper and deeper into a dark world where he might never come back from. And that is what makes him very different from the team on CBS's \"Criminal Minds.\" Throughout the series you can see him as a truly broken man and what little of him that's holding together is also crumbling. All the while it almost seems he is entirely alone through this situation. However, he does have someone and that is Dr. Lector. Mikkelsen does some truly fantastic work as Lector. He brings the charisma and cultured intelligence that is Hannibal Lector to new life on screen. Of course he comes into the picture in the shadow of the great Anthony Hopkins who made this character what he is today but Mikkelsen does a great job at making this character his own. Both of these actors do great jobs at giving fresh spins to two very well-known characters. Fantastic work by the both of them.This is a great piece of television here. We find ourselves completely immersed into a world that is haunting on many levels and that is why this show works. The show succeeds by giving audiences an intelligent look into the mind of a man going slowly insane while giving us a look at one who has already gone insane."
    },
    {
      "username": "InternetOfZings",
      "userUrl": "https://www.imdb.com/user/ur9584397",
      "reviewLink": "https://www.imdb.com/review/rw2846585",
      "warningSpoilers": false,
      "date": "7 August 2013",
      "rate": "10",
      "helpful": "44 out of 60 found this helpful.",
      "title": "Creepy, unsettling and beautiful",
      "content": "Boy am I glad that I stumbled onto this series. I was pretty bored with all of the current TV shows which I've been watching (well, that's really only Dexter and True Blood at the moment) or they've been on break. Hannibal hooked me right from the first episode and after seeing the whole season I'd say it's right up there among my favorite TV shows. Mads Mikkelsen is a fantastic and charismatic screen presence and his portrayal of the understated and calm Hannibal is very unsettling and mesmerizing. I've loved his diverse roles in Casino Royale, After the Wedding, The Hunt and The Royal Affair and he doesn't disappoint in this show either. Hugh Dancy is also great as the tormented FBI profiler Will who can get inside the mind of a psychopath and imagine the crime occurring again. As time goes on this weighs on his psyche more and more. I loved his portrayal of a man with Asperger's Syndrome in Adam, he really seems to have a knack for portraying these kind of roles. The relationship between Will and Hannibal in the show is very interesting and filled with suspense as Hannibal subtly manipulates Will. The supporting cast is extremely solid as well. The visuals of the show are very arresting, some of the murder scenes are especially striking. I also really liked the scenes where Hannibal is preparing food and presenting it to his guests. Those scenes are really beautiful in a twisted way. One of the most critical parts about the show however is the sound design. The sound effects are tremendously creepy as is the music. They're used very effectively to create a creepy and disturbing atmosphere. There's an almost hypnotic feeling to the show's mood and tone. The killers Will faces in the show are very interesting and imaginative. I also liked that they weren't just \"killer of the week\" variety but that the killers are actually tied into the story in meaningful ways. Season 1 of Hannibal was really gripping and it's definitely my favorite of the newer TV shows. After such an intense season I'm really eager and excited to find out how they continue the story in season 2. However, I'm kind of hoping that the show won't go on for too many seasons because I have a feeling that it would get way too implausible. But so far so good."
    },
    {
      "username": "joleree",
      "userUrl": "https://www.imdb.com/user/ur23048030",
      "reviewLink": "https://www.imdb.com/review/rw3142189",
      "warningSpoilers": false,
      "date": "15 December 2014",
      "rate": "10",
      "helpful": "53 out of 65 found this helpful.",
      "title": "So good that I fear for it not getting renewed",
      "content": "We have come through the last couple of years with some excellent TV programming. dialog, writing, directing, acting some of the episodes if not entire seasons trashing anything that was showing at the local megaplex. Just like most here I was highly skeptical at the idea of a made for TV Hannibal, as Robert Downey is to Iron Man and Hugh Jackman is to Wolverine.......for me Anthony Hopkins was to Hannibal Lecter. Well no more. When telling people about this show, that's what I use as an approach. When you think of Hannibal Lecter you tend to think of Anthony Hopkins. Well not anymore, what a tribute to Mads Mikkelsen that he could take this amazing pop culture character and and so firmly attach his name to it. If you have been skeptical or just not \"seeing\" you're doing yourself a great disservice in not checking this out. I absolutely LOATHE that comcast now charges for past seasons of network shows, but this is the only one that I would ever say is worth purchasing and viewing before season 3 gets here. Hannibal is excellent television."
    },
    {
      "username": "akaichou-crimsonbutterfl",
      "userUrl": "https://www.imdb.com/user/ur11065158",
      "reviewLink": "https://www.imdb.com/review/rw2769046",
      "warningSpoilers": false,
      "date": "17 March 2013",
      "rate": "9",
      "helpful": "484 out of 645 found this helpful.",
      "title": "Psychological thriller at its finest.",
      "content": "If you're wondering, this drama does not follow the story line of the previous Hannibal film franchise. However, it does not mean that the series doesn't pack its own punch in terms of tension and suspense. (I'm in such awe, I feel inadequate trying to leave a review for this show. I won't reveal any more than what is available on the wikipedia page.)Following protagonist Agent Will Graham (Hugh Dancy) into his mind and peering into the distorted lives and actions of serial killers, he comes across as a highly intelligent but often conflicted man, tormented by his own imagination and yet has to live it each day for the greater good. This sense of vulnerability and instability caused by his personality (largely introverted and antisocial) is preyed upon by his psychiatrist, famed Hannibal Lecter, excellently portrayed by Mads Mikkelsen, and as all this is played out, the audience, privy to this knowledge will be gripped by suspense, and the never ending tension, even on scenes where nothing appears to be happening, the mood takes on a somber and tense tone. For those who are concerned with the relative 'low level of gore', be patient. It takes its time to build and slowly escalate, bringing Graham deeper into the shadows and mental torment.I can't emphasize how good the acting is, how vivid and artistic the abstract dream and killing sequences are. the fact that the soundtracks are well selected and not obnoxious all plays a part in creating one of the best viewing experiences ever. As a fan of psychological horror, I feel privileged to be able to take a small peek at this show ahead of broadcast."
    }
  ],
  "errorMessage": ""
}