{
  "imDbId": "tt2243973",
  "title": "Hannibal",
  "fullTitle": "Hannibal (TV Series 2013–2015)",
  "type": "TVSeries",
  "year": "2013",
  "episodes": [
    {
      "id": "tt2370419",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "Apéritif",
      "image": "https://m.media-amazon.com/images/M/MV5BMTYyMDQ0NTg0MV5BMl5BanBnXkFtZTcwMDUxOTMzOQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "4 Apr. 2013",
      "plot": "The head of the FBI Behavioral Science unit, Jack Crawford, calls on profiler Will Graham to assist them catch a serial killer. The killer has now kidnapped eight women, all similar in appearance and always on a Friday. His most recent victim is Elise Nichols. Graham has been teaching at the FBI academy and isn't too keen on going out into the field. He is particularly empathetic and has a tendency to get far too involved in these types of cases. Crawford arranges for a well-known psychiatrist, Hannibal Lecter, to work with him and ease the stress. It seems Lecter has...",
      "imDbRating": "8.3",
      "imDbRatingCount": "8112"
    },
    {
      "id": "tt2373027",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "Amuse-Bouche",
      "image": "https://m.media-amazon.com/images/M/MV5BOTk4NTc5Njg2OF5BMl5BanBnXkFtZTcwNjUxOTMzOQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "11 Apr. 2013",
      "plot": "Will and Jack hunt a killer who is burying his victims alive, so they will become fertilizer for his garden of fungus. While the tabloid journalist Freddie sets targets in on Will.",
      "imDbRating": "8.2",
      "imDbRatingCount": "6850"
    },
    {
      "id": "tt2373029",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "Potage",
      "image": "https://m.media-amazon.com/images/M/MV5BOGI5M2RiYzgtNzg4Mi00NTU2LWFjM2MtZDU1ZGRiNTNiZTcwXkEyXkFqcGdeQXVyMDgyNjA5MA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "18 Apr. 2013",
      "plot": "Determined to give Abigail closure, Will and Hannibal take Abigail back to the scene of her father's crimes. But things take a turn for the worse when the copycat killer strikes again.",
      "imDbRating": "8.1",
      "imDbRatingCount": "6382"
    },
    {
      "id": "tt2373031",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "Oeuf",
      "image": "https://m.media-amazon.com/images/M/MV5BNDQzMTcxMTYtZDljMS00ODVlLWEyNjQtY2JiNTk2MTc0NjJmXkEyXkFqcGdeQXVyMDgyNjA5MA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "29 Apr. 2013",
      "plot": "A series of family murders takes place, and Will determines they were conducted by each of the families' missing children, who were abducted and brainwashed into killing their old families for their \"new family.\" Against Alana's advice, Hannibal checks Abigail out of the hospital for some frightening psychiatric practices that ultimately align her loyalty with him.",
      "imDbRating": "7.8",
      "imDbRatingCount": "5656"
    },
    {
      "id": "tt2373033",
      "seasonNumber": "1",
      "episodeNumber": "5",
      "title": "Coquilles",
      "image": "https://m.media-amazon.com/images/M/MV5BNzkzMTkzMjQyMl5BMl5BanBnXkFtZTgwNTcxMjgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "25 Apr. 2013",
      "plot": "A murdered couple is found in a motel room, posed in praying positions with the flesh of their backs opened and strung to the ceiling to give them the appearance of wings. Using hairs collected from the motel pillow, the BAU team discover several medications used to treat brain tumors in the killer's bloodstream. Graham surmises that the killer is transforming his victims into guardian angels to watch over him because he is afraid of dying in his sleep.",
      "imDbRating": "7.9",
      "imDbRatingCount": "5882"
    },
    {
      "id": "tt2373035",
      "seasonNumber": "1",
      "episodeNumber": "6",
      "title": "Entrée",
      "image": "https://m.media-amazon.com/images/M/MV5BOWM4ODBiZWEtZmY4Mi00NGZjLTk2NjUtM2IyMzM0MGVmODRhXkEyXkFqcGdeQXVyMDgyNjA5MA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "2 May 2013",
      "plot": "A nurse at the Baltimore State Hospital for the Criminally Insane is brutally murdered by a patient, Dr. Abel Gideon, in a manner reminiscent of the \"Chesapeake Ripper\", who hasn't committed a murder in two years, the same number of years Gideon has been incarcerated. While Graham tries to discover whether Gideon truly is the Ripper, Crawford receives a phone call, apparently from the real Ripper, who plays the recorded voice of Miriam Lass, a trainee Crawford had consulting on the Chesapeake Ripper case two years previously when she suddenly disappeared.",
      "imDbRating": "8.5",
      "imDbRatingCount": "5754"
    },
    {
      "id": "tt2373037",
      "seasonNumber": "1",
      "episodeNumber": "7",
      "title": "Sorbet",
      "image": "https://m.media-amazon.com/images/M/MV5BMzAxNDk3NTUwMV5BMl5BanBnXkFtZTcwNTcwMzY0OQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "9 May 2013",
      "plot": "The BAU is called in when a man is found in a hotel room bathtub with his kidney removed and Graham must determine whether this is the act of an organ harvester or if the Chesapeake Ripper has claimed his first victim in two years. Meanwhile, Crawford continues to be haunted by the discovery of Miriam Lass's arm. Dr. Bloom suspects that Crawford has become obsessed with catching the Ripper, and is putting Graham in danger by making him chase the Ripper.",
      "imDbRating": "8.6",
      "imDbRatingCount": "5962"
    },
    {
      "id": "tt2373039",
      "seasonNumber": "1",
      "episodeNumber": "8",
      "title": "Fromage",
      "image": "https://m.media-amazon.com/images/M/MV5BODEwMTk2ODk0MF5BMl5BanBnXkFtZTcwNDgwMzY0OQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "16 May 2013",
      "plot": "Lecter's patient Franklin Froideveaux worries that his friend Tobias may be a psychopath, but Franklin's growing obsession with Lecter is what concerns the latter more. Graham investigates the murder of a Baltimore musician who had his throat opened and a cello neck inserted through his mouth. Graham, with Lecter's guidance, interprets this as one killer serenading another. Graham's mental stability deteriorates further when he begins having auditory hallucinations of animals in pain and when his romantic feelings for Alana Bloom are rejected.",
      "imDbRating": "8.9",
      "imDbRatingCount": "6144"
    },
    {
      "id": "tt2373041",
      "seasonNumber": "1",
      "episodeNumber": "9",
      "title": "Trou Normand",
      "image": "https://m.media-amazon.com/images/M/MV5BMjAwNzUxODA1Ml5BMl5BanBnXkFtZTgwMDgxMjgzMjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "23 May 2013",
      "plot": "A totem pole of human bodies ranging from freshly killed to decades old are found on a beach and while Graham is investigating the crime scene, he suddenly finds himself in Lecter's office, three and a half hours away, with no recollection of how he got there. Lecter theorizes that Graham's mind is trying to escape from having to investigate such brutal murders.",
      "imDbRating": "8.2",
      "imDbRatingCount": "5511"
    },
    {
      "id": "tt2373019",
      "seasonNumber": "1",
      "episodeNumber": "10",
      "title": "Buffet Froid",
      "image": "https://m.media-amazon.com/images/M/MV5BMTY0MTM2MTA3Nl5BMl5BanBnXkFtZTcwMzQ0OTE1OQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "30 May 2013",
      "plot": "Beth LeBeau is found murdered, having drowned in her own blood as a result of her face being cut into a Glasgow smile. Graham's mental state continues to sharply decline; he loses hours at a time and when a vivid hallucination causes Graham to contaminate the crime scene, Lecter refers him to a neurologist, an old residency colleague, Dr. Sutcliffe.",
      "imDbRating": "8.7",
      "imDbRatingCount": "5748"
    },
    {
      "id": "tt2373021",
      "seasonNumber": "1",
      "episodeNumber": "11",
      "title": "Rôti",
      "image": "https://m.media-amazon.com/images/M/MV5BNzE5Nzc2MzEtY2E3My00NjJkLTkzYWMtOGFmZDE0ZDFjOGVhXkEyXkFqcGdeQXVyMDgyNjA5MA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "6 Jun. 2013",
      "plot": "Dr. Abel Gideon escapes from custody and begins targeting the psychiatrists who attempted to treat him, displaying their bodies with a Colombian necktie. While Alana Bloom is put under protective custody, Gideon kidnaps Dr. Frederick Chilton and lures Freddie Lounds into a trap, forcing her to write an article about him. Meanwhile, Graham's undiagnosed Encephalitis drives his temperature up, causing severe hallucinations.",
      "imDbRating": "8.5",
      "imDbRatingCount": "5448"
    },
    {
      "id": "tt2373023",
      "seasonNumber": "1",
      "episodeNumber": "12",
      "title": "Relevés",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA0MDA5NzkzN15BMl5BanBnXkFtZTcwNTkxNTY2OQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "13 Jun. 2013",
      "plot": "Following an offhand comment by Graham, a comb left in the chamber of Georgia Madchen, who accidentally sparks a fire inside her hyperbaric chamber and is burned to death. Angered, Graham deduces that several recent murders were all the work of a copycat patterning after recent serial murders, and that Georgia was killed because she may have remembered the face of whoever had killed Dr. Sutcliffe.",
      "imDbRating": "8.8",
      "imDbRatingCount": "5543"
    },
    {
      "id": "tt2373025",
      "seasonNumber": "1",
      "episodeNumber": "13",
      "title": "Savoureux",
      "image": "https://m.media-amazon.com/images/M/MV5BNDRhM2QyYmEtZmI4OC00NjE4LTkxZDQtMWI5ZmI1ZThkNzgxXkEyXkFqcGdeQXVyMDgyNjA5MA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2013",
      "released": "20 Jun. 2013",
      "plot": "Following his strange trip to Minnesota, Graham is taken into custody by Crawford for the probable murder of Abigail Hobbs. They find her severed ear in his kitchen sink and her blood under his fingernails. Alana is left devastated by the arrest and is determined to find the cause of Graham's dementia, despite Crawford's insistence that there is no underlying cause. She has him draw a clock when he tells her that Dr. Lecter had him perform a similar test, and the results solidify her belief that there is a physical explanation for Graham's instability.",
      "imDbRating": "9.2",
      "imDbRatingCount": "6739"
    }
  ],
  "errorMessage": ""
}