{
  "imDbId": "tt2243973",
  "title": "Hannibal",
  "fullTitle": "Hannibal (TV Series 2013–2015)",
  "type": "TVSeries",
  "year": "2013",
  "language": "en",
  "titleInLanguage": "Hannibal (TV series)",
  "url": "https://en.wikipedia.org/wiki/Hannibal_(TV_series)",
  "plotShort": {
    "plainText": "Hannibal is an American psychological horror-thriller television series developed by Bryan Fuller for NBC. The series is based on characters and elements appearing in Thomas Harris' novels Red Dragon (1981), Hannibal (1999), and Hannibal Rising (2006) and focuses on the relationship between FBI special investigator Will Graham (Hugh Dancy) and Dr. Hannibal Lecter (Mads Mikkelsen), a forensic psychiatrist destined to become Graham's most cunning enemy and at the same time, the only person who can understand him.\r\nThe series received a 13-episode order for its first season. David Slade executive produced and directed the first episode. The series premiered on NBC on April 4, 2013. On May 9, 2014, NBC renewed Hannibal for a third season, which premiered on June 4, 2015. On June 22, 2015, NBC canceled Hannibal after three seasons because of low viewership. The series finale aired in Canada on City, on August 27, 2015, and aired two days later in the U.S. on NBC.\r\nThe series received critical acclaim, with the performances of the lead actors and the visual style of the show being singled out for praise. The first two seasons each won the Saturn Awards for Best Network Television Series, while both Mikkelsen and Dancy won Best Actor, with Laurence Fishburne winning Best Supporting Actor for season two. The third and final season won the inaugural Best Action-Thriller Television Series award, while guest star Richard Armitage won Best Supporting Actor. The show has garnered a cult following and is considered by critics and audiences as one of the best series of the horror genre, and one of the greatest network TV series of all time.",
    "html": "<p>Hannibal is an American psychological horror-thriller television series developed by Bryan Fuller for NBC. The series is based on characters and elements appearing in Thomas Harris' novels Red Dragon (1981), Hannibal (1999), and Hannibal Rising (2006) and focuses on the relationship between FBI special investigator Will Graham (Hugh Dancy) and Dr. Hannibal Lecter (Mads Mikkelsen), a forensic psychiatrist destined to become Graham's most cunning enemy and at the same time, the only person who can understand him.</p><p>The series received a 13-episode order for its first season. David Slade executive produced and directed the first episode. The series premiered on NBC on April 4, 2013. On May 9, 2014, NBC renewed Hannibal for a third season, which premiered on June 4, 2015. On June 22, 2015, NBC canceled Hannibal after three seasons because of low viewership. The series finale aired in Canada on City, on August 27, 2015, and aired two days later in the U.S. on NBC.</p><p>The series received critical acclaim, with the performances of the lead actors and the visual style of the show being singled out for praise. The first two seasons each won the Saturn Awards for Best Network Television Series, while both Mikkelsen and Dancy won Best Actor, with Laurence Fishburne winning Best Supporting Actor for season two. The third and final season won the inaugural Best Action-Thriller Television Series award, while guest star Richard Armitage won Best Supporting Actor. The show has garnered a cult following and is considered by critics and audiences as one of the best series of the horror genre, and one of the greatest network TV series of all time.</p>"
  },
  "plotFull": {
    "plainText": "Hannibal is an American psychological horror-thriller television series developed by Bryan Fuller for NBC. The series is based on characters and elements appearing in Thomas Harris' novels Red Dragon (1981), Hannibal (1999), and Hannibal Rising (2006) and focuses on the relationship between FBI special investigator Will Graham (Hugh Dancy) and Dr. Hannibal Lecter (Mads Mikkelsen), a forensic psychiatrist destined to become Graham's most cunning enemy and at the same time, the only person who can understand him.\r\nThe series received a 13-episode order for its first season. David Slade executive produced and directed the first episode. The series premiered on NBC on April 4, 2013. On May 9, 2014, NBC renewed Hannibal for a third season, which premiered on June 4, 2015. On June 22, 2015, NBC canceled Hannibal after three seasons because of low viewership. The series finale aired in Canada on City, on August 27, 2015, and aired two days later in the U.S. on NBC.\r\nThe series received critical acclaim, with the performances of the lead actors and the visual style of the show being singled out for praise. The first two seasons each won the Saturn Awards for Best Network Television Series, while both Mikkelsen and Dancy won Best Actor, with Laurence Fishburne winning Best Supporting Actor for season two. The third and final season won the inaugural Best Action-Thriller Television Series award, while guest star Richard Armitage won Best Supporting Actor. The show has garnered a cult following and is considered by critics and audiences as one of the best series of the horror genre, and one of the greatest network TV series of all time.\r\nPlot\r\nFBI profiler Will Graham is recruited by Jack Crawford, the head of Behavioral Sciences of the FBI, to help investigate a serial killer in Minnesota. With the investigation weighing heavily on Graham, Crawford decides to have him supervised by forensic psychiatrist Dr. Hannibal Lecter. Initially, Lecter—who is secretly a serial killer and a cannibal—works to manipulate the FBI from within. The bond Lecter builds with Graham begins to threaten his longevity. Lecter is fascinated by Graham's ability to empathize with psychopathic murderers and tries to push the boundaries of Graham's fragile sanity to turn him into a killer.\r\nCast and characters\r\nMain\r\nHugh Dancy as Will Graham, a gifted criminal profiler and hunter of serial killers. He visualizes himself committing the murders he investigates to understand the killers' behaviors; throughout the series, Graham's involvement with the investigations takes a toll on his psyche. The emotional relationship between Graham and Lecter forms the foundation of the series.\r\nMads Mikkelsen as Hannibal Lecter, a brilliant forensic psychiatrist and gourmet, who is also secretly a serial killer and a cannibal, known as the Chesapeake Ripper.\r\nCaroline Dhavernas as Alana Bloom, a professor of psychology and consultant profiler for the FBI who has professional relationships with both Graham and Lecter.\r\nHettienne Park as Beverly Katz, a crime scene investigator specializing in fiber analysis. (seasons 1–2)\r\nLaurence Fishburne as Jack Crawford, head of Behavioral Sciences at the FBI and Graham's boss.\r\nScott Thompson as Jimmy Price, a crime scene investigator specializing in latent fingerprints. (recurring season 1; also starring seasons 2–3)\r\nAaron Abrams as Brian Zeller, a crime scene investigator. (recurring season 1; also starring seasons 2–3)\r\nGillian Anderson as Bedelia Du Maurier, Lecter's psychotherapist, who was once attacked by one of Lecter's former patients. (recurring seasons 1–2; regular season 3)\r\nRecurring\r\nRaúl Esparza as Frederick Chilton, administrator of Baltimore State Hospital for the Criminally Insane.\r\nKacey Rohl as Abigail Hobbs, daughter and accomplice of serial killer Garrett Jacob Hobbs, who develops a complicated father-daughter relationship with Lecter.\r\nLara Jean Chorostecki as Fredricka \"Freddie\" Lounds, a tabloid blogger and journalist who runs the true crime website TattleCrime.\r\nEddie Izzard as Abel Gideon, a transplant surgeon institutionalized for killing his family, who is led to believe that he is the Chesapeake Ripper by Dr. Chilton.\r\nGina Torres as Phyllis \"Bella\" Crawford, Jack Crawford's wife, who is suffering from terminal lung cancer.\r\nVladimir Jon Cubrt as Garrett Jacob Hobbs, a serial killer known as the Minnesota Shrike.\r\nAnna Chlumsky as Miriam Lass, an FBI trainee and Jack Crawford's protégée. She mysteriously disappears while investigating the Chesapeake Ripper. (seasons 1–2)\r\nKatharine Isabelle as Margot Verger, one of Lecter's patients; she has suffered years of abuse at the hands of her twin brother. (seasons 2–3)\r\nMichael Pitt (season 2) and Joe Anderson (season 3) as Mason Verger, Margot's sadistic twin brother, who develops several plots to impregnate his sister and bring down Lecter.\r\nCynthia Nixon as Kade Prurnell, an investigator for the Office of the Inspector General. (season 2)\r\nJonathan Tucker as Matthew Brown, a psychopathic hospital orderly intrigued by Will who attempts to kill Hannibal. (season 2)\r\nRichard Armitage as Francis Dolarhyde, a serial killer known as The Tooth Fairy due to his unsightly habit of biting the skin of his victims. (season 3)\r\nFortunato Cerlino as Rinaldo Pazzi, an Italian inspector who teams up with Jack to search for Lecter. (season 3)\r\nTao Okamoto as Chiyoh, handmaiden to Lecter's aunt, Lady Murasaki. (season 3)\r\nGlenn Fleshler as Cordell Doemling, the creepy yet gentle and intelligent nurse to Mason Verger. (season 3)\r\nNina Arianda as Molly Graham, Will's wife, who helps him overcome his dark past. She continues to support Will when he is asked to return to the FBI. (season 3)\r\nRutina Wesley as Reba McClane, a blind woman and love interest of Dolarhyde. (season 3)\r\nProduction\r\nDevelopment\r\nNBC began developing a Hannibal series in 2011 and former head of drama Katie O'Connell brought in her long-time friend Bryan Fuller (who had previously served as a writer-producer on NBC's Heroes) to write a pilot script in November. NBC gave the series a financial commitment before Fuller had completed his script. On February 14, 2012, NBC bypassed the pilot stage of development by giving the series a 13-episode first season based solely on the strength of Fuller's script. The series went into production quickly thereafter.\r\nDavid Slade, who had previously directed the pilot for NBC's Awake, directed the first episode and served as an executive producer. José Andrés was the series' \"culinary cannibal consultant\" and advised the crew on proper procedure for preparing human flesh for consumption.\r\nFuller discussed the limited episode order and the continuing story arc he envisions for the series. \"Doing a cable model on network television gives us the opportunity not to dally in our storytelling because we have a lot of real estate to cover\". Speaking specifically about the Lecter character, Fuller said, \"There is a cheery disposition to our Hannibal. He's not being telegraphed as a villain. If the audience didn't know who he was, they wouldn't see him coming. What we have is Alfred Hitchcock's principle of suspense—show the audience the bomb under the table and let them sweat when it's going to go boom\". He went on to call the relationship between Graham and Lecter as \"really a love story\", saying, \"As Hannibal has said in a couple of the movies, 'You're a lot more like me than you realize'. We'll get to the bottom of exactly what that means over the course of the first two seasons\".\r\nFuller originally planned for the show to run for seven seasons: the first three consisting of original material, the fourth covering Red Dragon, the fifth The Silence of the Lambs, the sixth Hannibal, and the seventh an original storyline resolving Hannibal's ending. However, after the conclusion of the second season, Fuller stated he later envisioned the show to run six seasons, incorporating the books into the show in a different way than he originally planned. Season 3 would use material from Hannibal Rising as well as Red Dragon and include a different origin story for Dr. Lecter; the season ultimately also adapted Hannibal as well. Fuller had intended to include other characters from the book series (such as Jame Gumb and Clarice Starling) provided he could get the rights from MGM. Franklin Froideveaux and Tobias Budge were created because Fuller could not secure the rights to The Silence of the Lambs characters Benjamin Raspail and Jame Gumb. Fuller added they also tried to get the rights to Barney Matthews, an orderly at the Baltimore State Hospital, but were denied, thus a character based on Barney appeared in the second season, named Matthew Brown, but the character ended up being an antithesis to the original series' Barney. Dr. Bedelia Du Maurier is named after the character in Creepshow and author Daphne du Maurier.\r\nRegarding the series' influences, Fuller stated: \"When I sat down to the script, I was very consciously saying, 'What would David Lynch do with a Hannibal Lecter character? What sort of strange, unexpected places would he take this world?' I'm a great admirer of his work and his aesthetic and his meticulous sound design. Those were all components that I felt very strongly needed to be part of our Hannibal Lecter story. Between Lynch and Kubrick, there's a lot of inspiration.\" Fuller also cited David Cronenberg and Dario Argento as influences on the series. Fuller cited Tony Scott as an influence for the third season.\r\nCasting\r\nHugh Dancy was the first actor to be cast, taking on the role of FBI criminal profiler Will Graham, who seeks help from Lecter in profiling and capturing serial killers. In June 2012, Mads Mikkelsen was cast as Lecter. Soon after this, Laurence Fishburne was cast as FBI Behavioral Sciences Unit commander Jack Crawford. Caroline Dhavernas was later cast as Dr. Alana Bloom, a former student of Hannibal Lecter, and Hettienne Park was cast as CSI Beverly Katz. Lara Jean Chorostecki, Kacey Rohl, Scott Thompson and Aaron Abrams were cast in recurring roles.\r\nGina Torres, Laurence Fishburne's wife, had a recurring role as Phyllis \"Bella\" Crawford, Jack Crawford's terminally ill wife. Ellen Greene, Raúl Esparza and Gillian Anderson were later cast in recurring roles and appeared later in season one, though Greene actually appeared in only one episode. Molly Shannon, Eddie Izzard and Lance Henriksen guest-starred during the first season.\r\nSeveral of the actors on the series have worked with creator Bryan Fuller previously, including Dhavernas, who played the lead role in Wonderfalls, and Torres, Greene, Esparza and Shannon, who all appeared in the television series Pushing Daisies. Chelan Simmons reprised her role as Gretchen Speck-Horowitz from Wonderfalls in an episode of Hannibal. Ellen Muth, who starred in Fuller's Dead Like Me, guest-starred as a character named Georgia Madchen, a nod to her original character and a \"reinterpretation of that character\".\r\nDavid Bowie was approached for the role of Hannibal's uncle, Robert Lecter, for the second season, but was unavailable for the role. Gillian Anderson returned as Lecter's psychiatrist, Dr. Bedelia Du Maurier, in multiple episodes for the second season. Eddie Izzard returned as Dr. Abel Gideon for the second season. Cynthia Nixon joined the recurring cast as Kade Prurnell, an employee of the Office of the Inspector General, who is investigating Jack Crawford's role in the events of the first season. Katharine Isabelle joined the recurring cast as Margot Verger, who was originally described as a potential love interest for Graham, but Fuller later clarified that, as in the novel Hannibal, Margot \"... is a member of the LGBT community!\" Michael Pitt joined the recurring cast in the role of Mason Verger, Margot's abusive twin brother. Amanda Plummer guest-starred in the second season, playing Katherine Pimms, an acupuncturist. Jeremy Davies and Chris Diamantopoulos appear in two episodes.\r\nFuller stated in June 2014 after winning the Saturn Award for Best Network Television Series that they were told by Bowie's management to ask again for his availability for the third season. He also went on to list David Thewlis, Brad Dourif, Kristin Chenoweth, Lee Pace, and Anna Friel as actors he would like to appear on the series. For the third season, Anderson was promoted to series regular after recurring throughout the first two seasons. Tao Okamoto was announced to play Lady Murasaki, Hannibal's enigmatic aunt, in season three, however, Fuller later confirmed at a PaleyFest panel in New York that Okamoto would in fact be playing the role of Chiyoh, Lady Murasaki's handmaid. For the third season, Joe Anderson replaced Michael Pitt as Mason Verger, as Pitt decided not to return to the role. In December 2014, Fortunato Cerlino was announced as portraying Rinaldo Pazzi. In January 2015, several recurring roles were cast, including Richard Armitage as Francis Dolarhyde; Nina Arianda as Molly Graham, Will's wife; Rutina Wesley as Reba McClane; and Glenn Fleshler as Dr. Cordell Doemling. In March 2015, Zachary Quinto was cast in a guest-starring role as one of Dr. Du Maurier's patients. Izzard reprised the role of Gideon for the season three premiere, although she was initially hesitant about returning.\r\nFuller stated that should the series continue, whether for a fourth season or feature film, and should they obtain rights to adapt The Silence of the Lambs, Elliot Page would be his ideal casting for Clarice Starling.\r\nIn July 2020, Fuller confirmed that NBC executives were pushing for John Cusack or Hugh Grant to be cast as Lecter, solely based on attracting the most possible viewers for the series, while also saying that the casting of James Spader in The Blacklist that year was more akin to what they wanted as a series.\r\nFilming\r\nFilming of Hannibal took place in Toronto, Ontario, Canada. The first season began shooting on August 27, 2012. The series began production on the second season in Toronto in August 2013. Filming for season 3 began on October 20, 2014, in Toronto, and some filming of exterior and interior scenes were shot in Florence, Italy and Palermo.\r\nCancellation and possible revival\r\nOn June 22, 2015, NBC cancelled the series. Fuller initiated talks with Amazon Video and Netflix for a renewal. In July 2015, the cast were released after their contracts expired, but Mikkelsen and Dancy have expressed interest in reprising their respective roles if the series is acquired by a streaming service. However, the series has an exclusive streaming deal with Amazon, making finding a new distributor for the series difficult. On July 6, 2015, it was revealed that discussions with Amazon came to an end as a result of deadlines set by the service as a part of the deal, which Fuller felt would not allow for enough time to conceptualize and produce a new season. Meetings with Netflix were held, but largely due to the prior deal with Amazon, they also decided to pass on the series, and Fuller confirmed the series was still being shopped. On July 11, when asked to elaborate, Fuller commented that Netflix could not renew the series due to Amazon having the exclusive streaming rights, and that Amazon wanted to renew the series, but wanted an immediate debut, while Fuller wanted more time to work on the scripts in advance before shooting. Fuller also stated that he and the producers are exploring the possibility of a feature film. Fuller stated after the finale aired that financing for a film is being looked into, as well as divulging his planned Silence of the Lambs storyline and that Starz could serve as a potential renewal due to their relationship on American Gods. Fuller reunited with Anderson to direct a Hannibal-themed ad for PETA, which debuted on November 20, 2015. In December 2015, Mikkelsen stated his willingness to return for a potential fourth season, while also stating that everyone involved would be pleased with the run and success of the series if it does not come together.\r\nIn March 2016, De Laurentiis blamed online piracy of the series as part of the reason for cancellation. In May 2016, Mikkelsen commented on a possible revival, stating, \"It all depends on Bryan. He is the key, the base, the heart. We will wait and see what happens next in his career. But we all know that we can easily pick this up in two or three years, there are breaks in the stories. We could pick it up, say, four years later. If Bryan is up for it, we will all go for it.\" In June 2016, Fuller stated, \"The cast is game, I'm game, it's just a matter of finding the right time where everybody's schedules sync up, but I would love to continue to tell the story with Hugh Dancy and Mads Mikkelsen. They're such fantastic collaborators, and one of the most satisfying actor-showrunner relationships I've ever had in this industry. So I would love to continue this story.\" He also revealed other information dealing with rights: \"Two years after the last airing of the show, we can investigate our options August 2017 is when we can actually start talking about it. That's when we would have to see what the rights are for the character and for the story, and see who's interested and how we get it done. I have the story, and the cast is excited for the story, so we're ready to go if somebody wants to go.\" In December 2016, Fuller confirmed his plans for a Silence of the Lambs miniseries in an interview on the Blumhouse Productions podcast, stating, \"I think the film adaptation is a perfect film, but there are a lot of interesting nooks and crannies in that book to explore in a television series.\" In August 2017, formal conversations on the revival had begun. In January 2019, Mikkelsen exclusively revealed to Bloody Disgusting that he suspected Fuller to be securing rights to The Silence of the Lambs, saying in full, \"Yeah, I think there's always new hope. I haven't heard anything specific. I know Bryan is still working on some ideas where we can find a new home for this. I also have a strong feeling that everybody who was involved in it would gladly pick up the glove again if that happens I don't know where they looked. That is above my paycheck, but I know they've been talking to different studios. I know that was working to get the rights to Silence of the Lambs so he could get in there and use some of those characters for his own universe. I have a hunch that might be where we're going.\"\r\nEpisodes\r\nBroadcast\r\nEpisode order\r\nThe series' fourth episode, \"Oeuf\", which revolves around kidnapped children who have been brainwashed into murdering their own former families, was pulled from the United States broadcast schedule at the request of creator Bryan Fuller. The episode was still shown in other countries. This was not a result of the Boston Marathon bombing as some reports have indicated, but was actually decided just hours beforehand, and was more likely due to the Sandy Hook Elementary School shooting. Fuller said of the decision, \"With this episode, it wasn't about the graphic imagery or violence. It was the associations that came with the subject matter that I felt would inhibit the enjoyment of the overall episode. It was my own sensitivity... We want to be respectful of the social climate we're in right now\". In lieu of a traditional broadcast, a portion of the episode was broken into a series of webisodes, which was made available through various online media outlets. The complete episode was later made available via iTunes and Amazon Video on April 29, 2013, and the episode appears in the order intended on the DVD and Blu-ray release.\r\nRemoval by KSL-TV\r\nThe series was axed by Salt Lake City's KSL-TV (Channel 5) as of April 29, 2013, after four episodes were aired, and started airing in that market on KUCW, Utah's CW affiliate.\r\nInternational broadcast\r\nCity picked up broadcasting rights in Canada, where the show is filmed, as a mid-season debut. When Hannibal was moved to Saturdays on NBC in the middle of the third season, City continued to air the series in its regular Thursday time slot in Canada.\r\nIn Europe, one year before originally airing, on April 10, 2012, the ProSiebenSat.1 Media Group acquired the rights to broadcast the series in Germany, Austria, Switzerland, Sweden, Norway, and Denmark beginning in 2013. Sky Living started broadcasting the show in the UK and Republic of Ireland from May 7, 2013.\r\nIn the South Pacific, the series is also broadcast on the Seven Network in Australia, from mid-April 2013 and in New Zealand, the show premiered on TV3 on January 25, 2014. The series airs in Latin America through AXN. In Middle East and North Africa region, the series is broadcast on OSN.\r\nCensors in China working on the show replaced the word \"kill\" with the word \"suck\" in the subtitles which attracted attention for introducing sexual suggestively in a number of scenes for instance \"When you killed Randall, did you fantasize you were killing me?\" was rendered as \"When you sucked Randall, did you fantasize you were sucking me?\" This attracted derision and mocking from social media commentators. The swapping out of negative words is a common tactic used by Chinese censors.\r\nReception\r\nRatings\r\nCritical response\r\nSeason 1\r\nReviews for the first season were positive. On review aggregator website Rotten Tomatoes, the first season received an approval rating of 82% based on 66 reviews, with an average rating of 7.72/10. The site's critical consensus reads, \"Hannibal caters to an intellectual audience that prefers plenty of gore in its psychological thrillers, with a polished presentation of madness.\" On Metacritic, the first season scored 70 out of 100 based on 32 reviews, which constitutes \"generally favorable reviews\".\r\nJoanne Ostrow of The Denver Post praised the series as \"a well constructed, masterfully written piece,\" but stated that \" level of violent imagery is not my cup of tea\". She also had high praise for the characters, stating that they are \"so compelling, however, that you may give in to the gore-fest.\" Paul Doro of Shock Till You Drop gave Hannibal an 8/10 and said of the series, \"The stab at classy horror mostly succeeds due to excellent performances from the leads, genuine suspense and surprises, well-constructed short and long-term mysteries, and an appropriately disconcerting mood that permeates the action right from the start\", and praised Hugh Dancy in particular, saying he \"does an outstanding job of subtlety conveying how painful human interaction is for him, and despite being abrasive and unpleasant, you are always in his corner and really feel for the guy.\" Jeff Jensen of Entertainment Weekly gave the show an A- and called it \"finely acted, visually scrumptious, and deliciously subversive.\"\r\nBrian Lowry of Variety said Hannibal is \"the tastiest drama the network has introduced in awhile,\" and had particular praise for the central trio of Dancy, Mikkelsen and Fishburne. Eric Goldman of IGN gave the series a 9/10, which constitutes a score of \"Amazing\". He said, \"A prequel TV series about Hannibal Lecter has to overcome a lot of preconceptions...But guess what? None of that matters when you actually watch the show, because Hannibal is terrific.\" Linda Stasi of The New York Post gave the series two and a half stars out of four, praising the performances and called it \"the most beautifully shot and produced show on network TV, with many scenes simply and literally breathtaking\". Jeff Simon from The Buffalo News called Hannibal \"deeply sinister\" and \"brilliant\". The Chicago Sun Times' TV critic Lori Rackl said, \"Hannibal is a haunting, riveting...drama that has the look and feel of a show audiences have become more accustomed to seeing on cable than broadcast,\" and concluded that \"It's also extremely well executed...bound to leave viewers hungry for more.\" Alan Sepinwall of HitFix called Hannibal \"creepy, haunting, smart, utterly gorgeous\", and the best of this season's serial killer shows. Sepinwall also praised the character of Hannibal, writing he has been made into a believable supervillain without making the police force and others look incompetent. Reflecting on the completed first season, The A.V. Club's Emily VanDerWerff wrote that the series acts as a corrective to the \"empty\" violence on much of television and \"restores the seriousness of purpose to a genre long in need of it...Hannibal is interested in death and murder as a means to glance sidelong at some of life's largest questions. When not functioning as a cop drama, it's an intricately twisted serial-killer thriller, but it's also a surprisingly deep series about psychiatry and the state of the human mind.\" VanDerWerff concluded that Fuller had taken a series \"that had every reason to be a cheap cash-in and has, instead, turned into one of TV's best shows.\"\r\nOther reviews were less favorable. Glenn Garvin from The Miami Herald called it \"a fast-food hash of poor planning and worse execution\", referring to the writing as \"a mess of unmemorable dialogue and unworkable characterizations.\" Matthew Gilbert of The Boston Globe was similarly critical, calling the series \"rank and depressing,\" and concluded that it is \"shocking, gruesome, and, ultimately, hollow.\"\r\nSeason 2\r\nOn Metacritic, the second season scored 88 out of 100 based on 14 reviews, which constitutes \"universal acclaim\". On Rotten Tomatoes, the second season scored an approval rating of 98% with an average rating of 9.3/10 based on 45 reviews. The consensus reads: \"With powerful imagery and a strong, unpredictable story, season two of Hannibal continues to build on the first season's promise.\" On April 10, 2014, Hannibal was voted the winner for Hulu's \"Best in Show\" online competition.\r\nMark Peters of Slate called Hannibal \"an engrossing, psychologically dense show that is also visually stunning... the kind of gem seldom found on network TV.\" He did however note that the female characters were less developed. Matt Zoller Seitz, writing for New York magazine heaped praise on the show, calling it \"serenely unlike anything else on TV or anything that ever has been on TV.\" Alan Sepinwall of HitFix continued his praise of the series, highlighting the performances of the lead actors. The A.V. Club named it the best TV series of 2014, and wrote that Hannibal was \"the best, most elegantly designed thrill ride on TV in 2014\".\r\nThe season two finale was met with universal critical acclaim. Gathering a perfect rating of 10 out of 10 on IGN, reviewer Eric Goldman stated, \"Hannibal ended its fantastic second season with a thrilling, exciting and audacious series of events\" and praised the directing by David Slade. The finale also earned a perfect \"A\" grade by The A.V. Club, where reviewer Molly Eichel called it \"an entirely perfect cap to this season.\" Den of Geek reviewer Laura Akers labelled the episode \"simply divine\" and stated that she has \"rarely found looking forward to a show's return more\". Emma Dibdin of Digital Spy also heavily praised the episode, specifically Mikkelsen's performance, stating that he is \"so convincingly predatory...and so simultaneously scary and sad\". She also laid praise on the sound design of the episode by saying that \"the integration of a ticking clock worked so well not just in the usual 'time is running out' way, but also a subconscious reminder of Hannibal's manipulation of Will\". TV Guide named it the best TV episode of 2014.\r\nSeason 3\r\nSeason 3 of Hannibal received critical acclaim. On Rotten Tomatoes, season 3 has an approval rating of 98% with an average rating of 8.85/10 based on 46 reviews. The site's consensus reads: \"Bryan Fuller serves up another delightfully demented season of Hannibal, featuring a hearty helping of gorgeous gore, paired with a sweet side of twisted humor.\" On Metacritic, the season has a score of 84 out of 100 based on 15 reviews, indicating \"universal acclaim\". Joshua Rivera of Business Insider stated that \"Hannibal is a show that puts all of its chips on the table, blows up that table, and then builds something even more fascinating from what remains\", and hailed it as one of the best shows on television. Dominic Patten of Deadline Hollywood also gave the first few episodes positive reviews also stating the show returns better than ever. The acting of Mads Mikkelsen and Gillian Anderson was particularly praised, with Bloody Disgusting writing, \"Gillian Anderson's performance pushes Mads Mikkelsen in ways never thought possible,\" while also giving praise to creator and writer Bryan Fuller saying he creates \"meticulously detailed scripts that define his characters in completely unpredictable ways.\" The review concludes by stating season 3 \"re-establishes Hannibal as the best horror show on television.\" Chris Cabin of Slant Magazine gave it a very positive review, with four stars, and wrote that season 3 is \"even more incisively and ambitiously written than the last season, and sporting the most radically expressive imagery currently on television.\" Jeff Jensen of Entertainment Weekly rated it an \"A−\" and wrote, \"Hannibal remains the most engrossing (and gross) serial-killer drama on television, and the most beautiful.\"\r\nCritics' top ten list\r\nAccolades\r\nHome media releases\r\nThe first season, including all 13 episodes, was released on Blu-ray and DVD in region 2 on September 2, 2013, in region 1 on September 24, 2013, and in region 4 on September 25, 2013. The region 1 set includes two audio commentaries (by Bryan Fuller, David Slade and Hugh Dancy on \"Apéritif\" and \"Savoureux\"), deleted scenes, gag reel, pilot episode storyboards, four featurettes, and \"producer's cut\" versions of five episodes.\r\nThe second season, including all 13 episodes, was released on Blu-ray and DVD in region 1 on September 16, 2014. Bonus features include episode audio commentaries with cast and crew, several behind-the-scenes featurettes, a gag reel, deleted scenes and the \"Post Mortem\" webisodes hosted by Scott Thompson.\r\nThe third season, including all 13 episodes, was released on Blu-ray and DVD in region 1 on December 8, 2015. Bonus features include ten audio commentaries with cast and crew, producer's cut versions of seven episodes, several behind-the-scenes featurettes, a gag reel, deleted scenes, and the \"Post Mortem\" webisodes hosted by Scott Thompson.",
    "html": "<p>Hannibal is an American psychological horror-thriller television series developed by Bryan Fuller for NBC. The series is based on characters and elements appearing in Thomas Harris' novels Red Dragon (1981), Hannibal (1999), and Hannibal Rising (2006) and focuses on the relationship between FBI special investigator Will Graham (Hugh Dancy) and Dr. Hannibal Lecter (Mads Mikkelsen), a forensic psychiatrist destined to become Graham's most cunning enemy and at the same time, the only person who can understand him.</p><p>The series received a 13-episode order for its first season. David Slade executive produced and directed the first episode. The series premiered on NBC on April 4, 2013. On May 9, 2014, NBC renewed Hannibal for a third season, which premiered on June 4, 2015. On June 22, 2015, NBC canceled Hannibal after three seasons because of low viewership. The series finale aired in Canada on City, on August 27, 2015, and aired two days later in the U.S. on NBC.</p><p>The series received critical acclaim, with the performances of the lead actors and the visual style of the show being singled out for praise. The first two seasons each won the Saturn Awards for Best Network Television Series, while both Mikkelsen and Dancy won Best Actor, with Laurence Fishburne winning Best Supporting Actor for season two. The third and final season won the inaugural Best Action-Thriller Television Series award, while guest star Richard Armitage won Best Supporting Actor. The show has garnered a cult following and is considered by critics and audiences as one of the best series of the horror genre, and one of the greatest network TV series of all time.</p><br/><h3>Plot</h3><p>FBI profiler Will Graham is recruited by Jack Crawford, the head of Behavioral Sciences of the FBI, to help investigate a serial killer in Minnesota. With the investigation weighing heavily on Graham, Crawford decides to have him supervised by forensic psychiatrist Dr. Hannibal Lecter. Initially, Lecter—who is secretly a serial killer and a cannibal—works to manipulate the FBI from within. The bond Lecter builds with Graham begins to threaten his longevity. Lecter is fascinated by Graham's ability to empathize with psychopathic murderers and tries to push the boundaries of Graham's fragile sanity to turn him into a killer.</p><br/><h3>Cast and characters</h3><h4>Main</h4><ul><li>Hugh Dancy as Will Graham, a gifted criminal profiler and hunter of serial killers. He visualizes himself committing the murders he investigates to understand the killers' behaviors; throughout the series, Graham's involvement with the investigations takes a toll on his psyche. The emotional relationship between Graham and Lecter forms the foundation of the series.</li><li>Mads Mikkelsen as Hannibal Lecter, a brilliant forensic psychiatrist and gourmet, who is also secretly a serial killer and a cannibal, known as the Chesapeake Ripper.</li><li>Caroline Dhavernas as Alana Bloom, a professor of psychology and consultant profiler for the FBI who has professional relationships with both Graham and Lecter.</li><li>Hettienne Park as Beverly Katz, a crime scene investigator specializing in fiber analysis. (seasons 1–2)</li><li>Laurence Fishburne as Jack Crawford, head of Behavioral Sciences at the FBI and Graham's boss.</li><li>Scott Thompson as Jimmy Price, a crime scene investigator specializing in latent fingerprints. (recurring season 1; also starring seasons 2–3)</li><li>Aaron Abrams as Brian Zeller, a crime scene investigator. (recurring season 1; also starring seasons 2–3)</li><li>Gillian Anderson as Bedelia Du Maurier, Lecter's psychotherapist, who was once attacked by one of Lecter's former patients. (recurring seasons 1–2; regular season 3)</li></ul><h4>Recurring</h4><ul><li>Raúl Esparza as Frederick Chilton, administrator of Baltimore State Hospital for the Criminally Insane.</li><li>Kacey Rohl as Abigail Hobbs, daughter and accomplice of serial killer Garrett Jacob Hobbs, who develops a complicated father-daughter relationship with Lecter.</li><li>Lara Jean Chorostecki as Fredricka \"Freddie\" Lounds, a tabloid blogger and journalist who runs the true crime website TattleCrime.</li><li>Eddie Izzard as Abel Gideon, a transplant surgeon institutionalized for killing his family, who is led to believe that he is the Chesapeake Ripper by Dr. Chilton.</li><li>Gina Torres as Phyllis \"Bella\" Crawford, Jack Crawford's wife, who is suffering from terminal lung cancer.</li><li>Vladimir Jon Cubrt as Garrett Jacob Hobbs, a serial killer known as the Minnesota Shrike.</li><li>Anna Chlumsky as Miriam Lass, an FBI trainee and Jack Crawford's protégée. She mysteriously disappears while investigating the Chesapeake Ripper. (seasons 1–2)</li><li>Katharine Isabelle as Margot Verger, one of Lecter's patients; she has suffered years of abuse at the hands of her twin brother. (seasons 2–3)</li><li>Michael Pitt (season 2) and Joe Anderson (season 3) as Mason Verger, Margot's sadistic twin brother, who develops several plots to impregnate his sister and bring down Lecter.</li><li>Cynthia Nixon as Kade Prurnell, an investigator for the Office of the Inspector General. (season 2)</li><li>Jonathan Tucker as Matthew Brown, a psychopathic hospital orderly intrigued by Will who attempts to kill Hannibal. (season 2)</li><li>Richard Armitage as Francis Dolarhyde, a serial killer known as The Tooth Fairy due to his unsightly habit of biting the skin of his victims. (season 3)</li><li>Fortunato Cerlino as Rinaldo Pazzi, an Italian inspector who teams up with Jack to search for Lecter. (season 3)</li><li>Tao Okamoto as Chiyoh, handmaiden to Lecter's aunt, Lady Murasaki. (season 3)</li><li>Glenn Fleshler as Cordell Doemling, the creepy yet gentle and intelligent nurse to Mason Verger. (season 3)</li><li>Nina Arianda as Molly Graham, Will's wife, who helps him overcome his dark past. She continues to support Will when he is asked to return to the FBI. (season 3)</li><li>Rutina Wesley as Reba McClane, a blind woman and love interest of Dolarhyde. (season 3)</li></ul><br/><h3>Production</h3><h4>Development</h4><p>NBC began developing a Hannibal series in 2011 and former head of drama Katie O'Connell brought in her long-time friend Bryan Fuller (who had previously served as a writer-producer on NBC's Heroes) to write a pilot script in November. NBC gave the series a financial commitment before Fuller had completed his script. On February 14, 2012, NBC bypassed the pilot stage of development by giving the series a 13-episode first season based solely on the strength of Fuller's script. The series went into production quickly thereafter.</p><p>David Slade, who had previously directed the pilot for NBC's Awake, directed the first episode and served as an executive producer. José Andrés was the series' \"culinary cannibal consultant\" and advised the crew on proper procedure for preparing human flesh for consumption.</p><p>Fuller discussed the limited episode order and the continuing story arc he envisions for the series. \"Doing a cable model on network television gives us the opportunity not to dally in our storytelling because we have a lot of real estate to cover\". Speaking specifically about the Lecter character, Fuller said, \"There is a cheery disposition to our Hannibal. He's not being telegraphed as a villain. If the audience didn't know who he was, they wouldn't see him coming. What we have is Alfred Hitchcock's principle of suspense—show the audience the bomb under the table and let them sweat when it's going to go boom\". He went on to call the relationship between Graham and Lecter as \"really a love story\", saying, \"As Hannibal has said in a couple of the movies, 'You're a lot more like me than you realize'. We'll get to the bottom of exactly what that means over the course of the first two seasons\".</p><p>Fuller originally planned for the show to run for seven seasons: the first three consisting of original material, the fourth covering Red Dragon, the fifth The Silence of the Lambs, the sixth Hannibal, and the seventh an original storyline resolving Hannibal's ending. However, after the conclusion of the second season, Fuller stated he later envisioned the show to run six seasons, incorporating the books into the show in a different way than he originally planned. Season 3 would use material from Hannibal Rising as well as Red Dragon and include a different origin story for Dr. Lecter; the season ultimately also adapted Hannibal as well. Fuller had intended to include other characters from the book series (such as Jame Gumb and Clarice Starling) provided he could get the rights from MGM. Franklin Froideveaux and Tobias Budge were created because Fuller could not secure the rights to The Silence of the Lambs characters Benjamin Raspail and Jame Gumb. Fuller added they also tried to get the rights to Barney Matthews, an orderly at the Baltimore State Hospital, but were denied, thus a character based on Barney appeared in the second season, named Matthew Brown, but the character ended up being an antithesis to the original series' Barney. Dr. Bedelia Du Maurier is named after the character in Creepshow and author Daphne du Maurier.</p><p>Regarding the series' influences, Fuller stated: \"When I sat down to the script, I was very consciously saying, 'What would David Lynch do with a Hannibal Lecter character? What sort of strange, unexpected places would he take this world?' I'm a great admirer of his work and his aesthetic and his meticulous sound design. Those were all components that I felt very strongly needed to be part of our Hannibal Lecter story. Between Lynch and Kubrick, there's a lot of inspiration.\" Fuller also cited David Cronenberg and Dario Argento as influences on the series. Fuller cited Tony Scott as an influence for the third season.</p><h4>Casting</h4><p>Hugh Dancy was the first actor to be cast, taking on the role of FBI criminal profiler Will Graham, who seeks help from Lecter in profiling and capturing serial killers. In June 2012, Mads Mikkelsen was cast as Lecter. Soon after this, Laurence Fishburne was cast as FBI Behavioral Sciences Unit commander Jack Crawford. Caroline Dhavernas was later cast as Dr. Alana Bloom, a former student of Hannibal Lecter, and Hettienne Park was cast as CSI Beverly Katz. Lara Jean Chorostecki, Kacey Rohl, Scott Thompson and Aaron Abrams were cast in recurring roles.</p><p>Gina Torres, Laurence Fishburne's wife, had a recurring role as Phyllis \"Bella\" Crawford, Jack Crawford's terminally ill wife. Ellen Greene, Raúl Esparza and Gillian Anderson were later cast in recurring roles and appeared later in season one, though Greene actually appeared in only one episode. Molly Shannon, Eddie Izzard and Lance Henriksen guest-starred during the first season.</p><p>Several of the actors on the series have worked with creator Bryan Fuller previously, including Dhavernas, who played the lead role in Wonderfalls, and Torres, Greene, Esparza and Shannon, who all appeared in the television series Pushing Daisies. Chelan Simmons reprised her role as Gretchen Speck-Horowitz from Wonderfalls in an episode of Hannibal. Ellen Muth, who starred in Fuller's Dead Like Me, guest-starred as a character named Georgia Madchen, a nod to her original character and a \"reinterpretation of that character\".</p><p>David Bowie was approached for the role of Hannibal's uncle, Robert Lecter, for the second season, but was unavailable for the role. Gillian Anderson returned as Lecter's psychiatrist, Dr. Bedelia Du Maurier, in multiple episodes for the second season. Eddie Izzard returned as Dr. Abel Gideon for the second season. Cynthia Nixon joined the recurring cast as Kade Prurnell, an employee of the Office of the Inspector General, who is investigating Jack Crawford's role in the events of the first season. Katharine Isabelle joined the recurring cast as Margot Verger, who was originally described as a potential love interest for Graham, but Fuller later clarified that, as in the novel Hannibal, Margot \"... is a member of the LGBT community!\" Michael Pitt joined the recurring cast in the role of Mason Verger, Margot's abusive twin brother. Amanda Plummer guest-starred in the second season, playing Katherine Pimms, an acupuncturist. Jeremy Davies and Chris Diamantopoulos appear in two episodes.</p><p>Fuller stated in June 2014 after winning the Saturn Award for Best Network Television Series that they were told by Bowie's management to ask again for his availability for the third season. He also went on to list David Thewlis, Brad Dourif, Kristin Chenoweth, Lee Pace, and Anna Friel as actors he would like to appear on the series. For the third season, Anderson was promoted to series regular after recurring throughout the first two seasons. Tao Okamoto was announced to play Lady Murasaki, Hannibal's enigmatic aunt, in season three, however, Fuller later confirmed at a PaleyFest panel in New York that Okamoto would in fact be playing the role of Chiyoh, Lady Murasaki's handmaid. For the third season, Joe Anderson replaced Michael Pitt as Mason Verger, as Pitt decided not to return to the role. In December 2014, Fortunato Cerlino was announced as portraying Rinaldo Pazzi. In January 2015, several recurring roles were cast, including Richard Armitage as Francis Dolarhyde; Nina Arianda as Molly Graham, Will's wife; Rutina Wesley as Reba McClane; and Glenn Fleshler as Dr. Cordell Doemling. In March 2015, Zachary Quinto was cast in a guest-starring role as one of Dr. Du Maurier's patients. Izzard reprised the role of Gideon for the season three premiere, although she was initially hesitant about returning.</p><p>Fuller stated that should the series continue, whether for a fourth season or feature film, and should they obtain rights to adapt The Silence of the Lambs, Elliot Page would be his ideal casting for Clarice Starling.</p><p>In July 2020, Fuller confirmed that NBC executives were pushing for John Cusack or Hugh Grant to be cast as Lecter, solely based on attracting the most possible viewers for the series, while also saying that the casting of James Spader in The Blacklist that year was more akin to what they wanted as a series.</p><h4>Filming</h4><p>Filming of Hannibal took place in Toronto, Ontario, Canada. The first season began shooting on August 27, 2012. The series began production on the second season in Toronto in August 2013. Filming for season 3 began on October 20, 2014, in Toronto, and some filming of exterior and interior scenes were shot in Florence, Italy and Palermo.</p><h4>Cancellation and possible revival</h4><p>On June 22, 2015, NBC cancelled the series. Fuller initiated talks with Amazon Video and Netflix for a renewal. In July 2015, the cast were released after their contracts expired, but Mikkelsen and Dancy have expressed interest in reprising their respective roles if the series is acquired by a streaming service. However, the series has an exclusive streaming deal with Amazon, making finding a new distributor for the series difficult. On July 6, 2015, it was revealed that discussions with Amazon came to an end as a result of deadlines set by the service as a part of the deal, which Fuller felt would not allow for enough time to conceptualize and produce a new season. Meetings with Netflix were held, but largely due to the prior deal with Amazon, they also decided to pass on the series, and Fuller confirmed the series was still being shopped. On July 11, when asked to elaborate, Fuller commented that Netflix could not renew the series due to Amazon having the exclusive streaming rights, and that Amazon wanted to renew the series, but wanted an immediate debut, while Fuller wanted more time to work on the scripts in advance before shooting. Fuller also stated that he and the producers are exploring the possibility of a feature film. Fuller stated after the finale aired that financing for a film is being looked into, as well as divulging his planned Silence of the Lambs storyline and that Starz could serve as a potential renewal due to their relationship on American Gods. Fuller reunited with Anderson to direct a Hannibal-themed ad for PETA, which debuted on November 20, 2015. In December 2015, Mikkelsen stated his willingness to return for a potential fourth season, while also stating that everyone involved would be pleased with the run and success of the series if it does not come together.</p><p>In March 2016, De Laurentiis blamed online piracy of the series as part of the reason for cancellation. In May 2016, Mikkelsen commented on a possible revival, stating, \"It all depends on Bryan. He is the key, the base, the heart. We will wait and see what happens next in his career. But we all know that we can easily pick this up in two or three years, there are breaks in the stories. We could pick it up, say, four years later. If Bryan is up for it, we will all go for it.\" In June 2016, Fuller stated, \"The cast is game, I'm game, it's just a matter of finding the right time where everybody's schedules sync up, but I would love to continue to tell the story with Hugh Dancy and Mads Mikkelsen. They're such fantastic collaborators, and one of the most satisfying actor-showrunner relationships I've ever had in this industry. So I would love to continue this story.\" He also revealed other information dealing with rights: \"Two years after the last airing of the show, we can investigate our options August 2017 is when we can actually start talking about it. That's when we would have to see what the rights are for the character and for the story, and see who's interested and how we get it done. I have the story, and the cast is excited for the story, so we're ready to go if somebody wants to go.\" In December 2016, Fuller confirmed his plans for a Silence of the Lambs miniseries in an interview on the Blumhouse Productions podcast, stating, \"I think the film adaptation is a perfect film, but there are a lot of interesting nooks and crannies in that book to explore in a television series.\" In August 2017, formal conversations on the revival had begun. In January 2019, Mikkelsen exclusively revealed to Bloody Disgusting that he suspected Fuller to be securing rights to The Silence of the Lambs, saying in full, \"Yeah, I think there's always new hope. I haven't heard anything specific. I know Bryan is still working on some ideas where we can find a new home for this. I also have a strong feeling that everybody who was involved in it would gladly pick up the glove again if that happens I don't know where they looked. That is above my paycheck, but I know they've been talking to different studios. I know that was working to get the rights to Silence of the Lambs so he could get in there and use some of those characters for his own universe. I have a hunch that might be where we're going.\"</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">April 4, 2013</td><td style=\"padding:0 8px\">June 20, 2013</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 28, 2014</td><td style=\"padding:0 8px\">May 23, 2014</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">13</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 4, 2015</td><td style=\"padding:0 8px\">August 27, 2015 <span style=\"font-size:85%;\">(Canada)</span><br>August 29, 2015 <span style=\"font-size:85%;\">(U.S.)</span></td></tr></tbody></table><br/><h3>Broadcast</h3><h4>Episode order</h4><p>The series' fourth episode, \"Oeuf\", which revolves around kidnapped children who have been brainwashed into murdering their own former families, was pulled from the United States broadcast schedule at the request of creator Bryan Fuller. The episode was still shown in other countries. This was not a result of the Boston Marathon bombing as some reports have indicated, but was actually decided just hours beforehand, and was more likely due to the Sandy Hook Elementary School shooting. Fuller said of the decision, \"With this episode, it wasn't about the graphic imagery or violence. It was the associations that came with the subject matter that I felt would inhibit the enjoyment of the overall episode. It was my own sensitivity... We want to be respectful of the social climate we're in right now\". In lieu of a traditional broadcast, a portion of the episode was broken into a series of webisodes, which was made available through various online media outlets. The complete episode was later made available via iTunes and Amazon Video on April 29, 2013, and the episode appears in the order intended on the DVD and Blu-ray release.</p><h4>Removal by KSL-TV</h4><p>The series was axed by Salt Lake City's KSL-TV (Channel 5) as of April 29, 2013, after four episodes were aired, and started airing in that market on KUCW, Utah's CW affiliate.</p><h4>International broadcast</h4><p>City picked up broadcasting rights in Canada, where the show is filmed, as a mid-season debut. When Hannibal was moved to Saturdays on NBC in the middle of the third season, City continued to air the series in its regular Thursday time slot in Canada.</p><p>In Europe, one year before originally airing, on April 10, 2012, the ProSiebenSat.1 Media Group acquired the rights to broadcast the series in Germany, Austria, Switzerland, Sweden, Norway, and Denmark beginning in 2013. Sky Living started broadcasting the show in the UK and Republic of Ireland from May 7, 2013.</p><p>In the South Pacific, the series is also broadcast on the Seven Network in Australia, from mid-April 2013 and in New Zealand, the show premiered on TV3 on January 25, 2014. The series airs in Latin America through AXN. In Middle East and North Africa region, the series is broadcast on OSN.</p><p>Censors in China working on the show replaced the word \"kill\" with the word \"suck\" in the subtitles which attracted attention for introducing sexual suggestively in a number of scenes for instance \"When you killed Randall, did you fantasize you were killing me?\" was rendered as \"When you sucked Randall, did you fantasize you were sucking me?\" This attracted derision and mocking from social media commentators. The swapping out of negative words is a common tactic used by Chinese censors.</p><br/><h3>Reception</h3><h4>Ratings</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><style data-mw-deduplicate=\"TemplateStyles:r1152813436\">.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);clip-path:polygon(0px 0px,0px 0px,0px 0px);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px;white-space:nowrap}</style><span class=\"sr-only\">Viewership and ratings per season of <i>Hannibal</i></span></caption><tbody><tr><th scope=\"col\" rowspan=\"2\">Season</th><th scope=\"col\" rowspan=\"2\">Timeslot (<span>ET</span>)</th><th scope=\"col\" rowspan=\"2\">Episodes</th><th scope=\"col\" colspan=\"2\">First aired</th><th scope=\"col\" colspan=\"2\">Last aired</th><th scope=\"col\" rowspan=\"2\">TV season</th><th scope=\"col\" rowspan=\"2\"><abbr title=\"Average\">Avg.</abbr> viewers<br>(millions)</th></tr><tr><th scope=\"col\">Date</th><th scope=\"col\">Viewers<br>(millions)</th><th scope=\"col\">Date</th><th scope=\"col\">Viewers<br>(millions)</th></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>1</span></th><td rowspan=\"1\">Thursday 10:00 pm</td><td>13</td><td>April 4, 2013</td><td>4.36</td><td>June 20, 2013</td><td>1.98</td><td rowspan=\"1\"><span>2012–13</span></td><td rowspan=\"1\">2.90</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>2</span></th><td rowspan=\"1\">Friday 10:00 pm</td><td>13</td><td>February 28, 2014</td><td>3.27</td><td>May 23, 2014</td><td>2.35</td><td rowspan=\"1\"><span>2013–14</span></td><td rowspan=\"1\">2.54</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>3</span></th><td rowspan=\"1\">Thursday 10:00 pm <span style=\"font-size:85%;\">(1–6)</span><br>Saturday 10:00 pm <span style=\"font-size:85%;\">(7–13)</span></td><td>13</td><td>June 4, 2015</td><td>2.57</td><td>August 29, 2015</td><td>1.24</td><td rowspan=\"1\"><span>2014–15</span></td><td rowspan=\"1\">1.31</td></tr></tbody></table><h4>Critical response</h4><h4>Season 1</h4><p>Reviews for the first season were positive. On review aggregator website Rotten Tomatoes, the first season received an approval rating of 82% based on 66 reviews, with an average rating of 7.72/10. The site's critical consensus reads, \"Hannibal caters to an intellectual audience that prefers plenty of gore in its psychological thrillers, with a polished presentation of madness.\" On Metacritic, the first season scored 70 out of 100 based on 32 reviews, which constitutes \"generally favorable reviews\".</p><p>Joanne Ostrow of The Denver Post praised the series as \"a well constructed, masterfully written piece,\" but stated that \" level of violent imagery is not my cup of tea\". She also had high praise for the characters, stating that they are \"so compelling, however, that you may give in to the gore-fest.\" Paul Doro of Shock Till You Drop gave Hannibal an 8/10 and said of the series, \"The stab at classy horror mostly succeeds due to excellent performances from the leads, genuine suspense and surprises, well-constructed short and long-term mysteries, and an appropriately disconcerting mood that permeates the action right from the start\", and praised Hugh Dancy in particular, saying he \"does an outstanding job of subtlety conveying how painful human interaction is for him, and despite being abrasive and unpleasant, you are always in his corner and really feel for the guy.\" Jeff Jensen of Entertainment Weekly gave the show an A- and called it \"finely acted, visually scrumptious, and deliciously subversive.\"</p><p>Brian Lowry of Variety said Hannibal is \"the tastiest drama the network has introduced in awhile,\" and had particular praise for the central trio of Dancy, Mikkelsen and Fishburne. Eric Goldman of IGN gave the series a 9/10, which constitutes a score of \"Amazing\". He said, \"A prequel TV series about Hannibal Lecter has to overcome a lot of preconceptions...But guess what? None of that matters when you actually watch the show, because Hannibal is terrific.\" Linda Stasi of The New York Post gave the series two and a half stars out of four, praising the performances and called it \"the most beautifully shot and produced show on network TV, with many scenes simply and literally breathtaking\". Jeff Simon from The Buffalo News called Hannibal \"deeply sinister\" and \"brilliant\". The Chicago Sun Times' TV critic Lori Rackl said, \"Hannibal is a haunting, riveting...drama that has the look and feel of a show audiences have become more accustomed to seeing on cable than broadcast,\" and concluded that \"It's also extremely well executed...bound to leave viewers hungry for more.\" Alan Sepinwall of HitFix called Hannibal \"creepy, haunting, smart, utterly gorgeous\", and the best of this season's serial killer shows. Sepinwall also praised the character of Hannibal, writing he has been made into a believable supervillain without making the police force and others look incompetent. Reflecting on the completed first season, The A.V. Club's Emily VanDerWerff wrote that the series acts as a corrective to the \"empty\" violence on much of television and \"restores the seriousness of purpose to a genre long in need of it...Hannibal is interested in death and murder as a means to glance sidelong at some of life's largest questions. When not functioning as a cop drama, it's an intricately twisted serial-killer thriller, but it's also a surprisingly deep series about psychiatry and the state of the human mind.\" VanDerWerff concluded that Fuller had taken a series \"that had every reason to be a cheap cash-in and has, instead, turned into one of TV's best shows.\"</p><p>Other reviews were less favorable. Glenn Garvin from The Miami Herald called it \"a fast-food hash of poor planning and worse execution\", referring to the writing as \"a mess of unmemorable dialogue and unworkable characterizations.\" Matthew Gilbert of The Boston Globe was similarly critical, calling the series \"rank and depressing,\" and concluded that it is \"shocking, gruesome, and, ultimately, hollow.\"</p><h4>Season 2</h4><p>On Metacritic, the second season scored 88 out of 100 based on 14 reviews, which constitutes \"universal acclaim\". On Rotten Tomatoes, the second season scored an approval rating of 98% with an average rating of 9.3/10 based on 45 reviews. The consensus reads: \"With powerful imagery and a strong, unpredictable story, season two of Hannibal continues to build on the first season's promise.\" On April 10, 2014, Hannibal was voted the winner for Hulu's \"Best in Show\" online competition.</p><p>Mark Peters of Slate called Hannibal \"an engrossing, psychologically dense show that is also visually stunning... the kind of gem seldom found on network TV.\" He did however note that the female characters were less developed. Matt Zoller Seitz, writing for New York magazine heaped praise on the show, calling it \"serenely unlike anything else on TV or anything that ever has been on TV.\" Alan Sepinwall of HitFix continued his praise of the series, highlighting the performances of the lead actors. The A.V. Club named it the best TV series of 2014, and wrote that Hannibal was \"the best, most elegantly designed thrill ride on TV in 2014\".</p><p>The season two finale was met with universal critical acclaim. Gathering a perfect rating of 10 out of 10 on IGN, reviewer Eric Goldman stated, \"Hannibal ended its fantastic second season with a thrilling, exciting and audacious series of events\" and praised the directing by David Slade. The finale also earned a perfect \"A\" grade by The A.V. Club, where reviewer Molly Eichel called it \"an entirely perfect cap to this season.\" Den of Geek reviewer Laura Akers labelled the episode \"simply divine\" and stated that she has \"rarely found looking forward to a show's return more\". Emma Dibdin of Digital Spy also heavily praised the episode, specifically Mikkelsen's performance, stating that he is \"so convincingly predatory...and so simultaneously scary and sad\". She also laid praise on the sound design of the episode by saying that \"the integration of a ticking clock worked so well not just in the usual 'time is running out' way, but also a subconscious reminder of Hannibal's manipulation of Will\". TV Guide named it the best TV episode of 2014.</p><h4>Season 3</h4><p>Season 3 of Hannibal received critical acclaim. On Rotten Tomatoes, season 3 has an approval rating of 98% with an average rating of 8.85/10 based on 46 reviews. The site's consensus reads: \"Bryan Fuller serves up another delightfully demented season of Hannibal, featuring a hearty helping of gorgeous gore, paired with a sweet side of twisted humor.\" On Metacritic, the season has a score of 84 out of 100 based on 15 reviews, indicating \"universal acclaim\". Joshua Rivera of Business Insider stated that \"Hannibal is a show that puts all of its chips on the table, blows up that table, and then builds something even more fascinating from what remains\", and hailed it as one of the best shows on television. Dominic Patten of Deadline Hollywood also gave the first few episodes positive reviews also stating the show returns better than ever. The acting of Mads Mikkelsen and Gillian Anderson was particularly praised, with Bloody Disgusting writing, \"Gillian Anderson's performance pushes Mads Mikkelsen in ways never thought possible,\" while also giving praise to creator and writer Bryan Fuller saying he creates \"meticulously detailed scripts that define his characters in completely unpredictable ways.\" The review concludes by stating season 3 \"re-establishes Hannibal as the best horror show on television.\" Chris Cabin of Slant Magazine gave it a very positive review, with four stars, and wrote that season 3 is \"even more incisively and ambitiously written than the last season, and sporting the most radically expressive imagery currently on television.\" Jeff Jensen of Entertainment Weekly rated it an \"A−\" and wrote, \"Hannibal remains the most engrossing (and gross) serial-killer drama on television, and the most beautiful.\"</p><h4>Critics' top ten list</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td style=\"text-align: left; vertical-align: top;\"><table class=\"collapsible collapsed\"><tbody><tr><th style=\"width:14em; background:#C4C3D0; text-align:left\">2013</th></tr><tr><td colspan=\"\"><ul><li>No. 2 <i><span>Slant</span></i></li><li>No. 2 <i><span>Vulture</span></i></li><li>No. 4 <i><span>Filmmaker Magazine</span></i></li><li>No. 7 <i><span>Houston Chronicle</span></i></li><li>No. 8 <i><span>IndieWire</span></i></li><li>No. 9 <i><span>HitFix</span></i></li><li>No. 9 <i><span>TV Guide</span></i></li><li> – <i><span>IGN</span></i></li></ul></td></tr></tbody></table><p> </p></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td style=\"text-align: left; vertical-align: top;\"><table class=\"collapsible collapsed\"><tbody><tr><th style=\"width:14em; background:#C4C3D0; text-align:left\">2014</th></tr><tr><td colspan=\"\"><ul><li>No. 1 <i><span>The A.V. Club</span></i></li><li>No. 1 <i><span>IGN</span></i></li><li>No. 1 <i><span>TV Guide</span></i></li><li>No. 1 <i><span>Vulture</span></i></li><li>No. 2 <i><span class=\"mw-redirect\">Complex</span></i></li><li>No. 2 <i><span>Digital Spy</span></i></li><li>No. 2 <i><span>Vox</span></i></li><li>No. 2 <i>We Got This Covered</i></li><li>No. 3 <i><span>RogerEbert.com</span></i></li><li>No. 3 <i><span>Slant</span></i></li><li>No. 3 <i><span>TV.com</span></i></li><li>No. 5 <i><span>National Post</span></i></li><li>No. 6 <i><span>PopMatters</span></i></li><li>No. 7 <i><span>The Daily Beast</span></i></li><li>No. 8 <i><span>HitFix</span></i></li><li>No. 10 <i><span>Entertainment Weekly</span></i></li></ul></td></tr></tbody></table><p> </p></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td style=\"text-align: left; vertical-align: top;\"><table class=\"collapsible collapsed\"><tbody><tr><th style=\"width:14em; background:#C4C3D0; text-align:left\">2015</th></tr><tr><td colspan=\"\"><ul><li>No. 1 <i><span class=\"mw-redirect\">ScreenCrush</span></i></li><li>No. 1 <i><span>Slant</span></i></li><li>No. 1 <i><span>Vulture</span></i></li><li>No. 3 <i><span>IGN</span></i></li><li>No. 3 <i><span class=\"mw-redirect\">Time Out New York</span></i></li><li>No. 3 <i>We Got This Covered</i></li><li>No. 4 <i><span>Digital Spy</span></i></li><li>No. 4 <i><span>Rapid City Journal</span></i></li><li>No. 7 <i><span>The A.V. Club</span></i></li><li>No. 7 <i>Cinema Blend</i></li><li>No. 7 <i><span>Entertainment Weekly</span></i></li><li>No. 7 <i><span>RogerEbert.com</span></i></li><li>No. 9 <i><span class=\"mw-redirect\">Thompson on Hollywood</span></i></li><li>No. 10 <i>The Playlist</i></li><li> – <i><span class=\"mw-redirect\">Criticwire</span></i></li><li> – <i><span>Flavorwire</span></i></li><li> – <i><span>Variety</span></i></li><li> – <i><span>The Week</span></i></li><li> – <i><span>Wired</span></i></li></ul></td></tr></tbody></table><p> </p></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td style=\"text-align: left; vertical-align: top;\"><table class=\"collapsible collapsed\"><tbody><tr><th style=\"width:14em; background:#C4C3D0; text-align:left\">2010s</th></tr><tr><td colspan=\"\"><ul><li>No. 1 <i><span>Slant</span></i></li><li>No. 1 <i><span class=\"mw-redirect\">ComingSoon.net</span></i></li><li>No. 4 <i><span class=\"mw-redirect\">Slashfilm</span></i></li><li>No. 5 <i><span>IndieWire</span></i></li><li>No. 6 <i><span>RogerEbert.com</span></i></li><li>No. 7 <i><span>GamesRadar+</span></i></li><li>No. 7 <i><span>Screen Rant</span></i></li></ul></td></tr></tbody></table><p> </p></td></tr></tbody></table><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Awards and accolades for <i>Hannibal</i></caption><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th></tr><tr><td rowspan=\"4\">2013</td><td rowspan=\"3\">Online Film &amp; Television Association Awards</td><td>Best Guest Actress in a Drama Series</td><td><span>Gillian Anderson</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best New Theme Song in a Series</td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best New Titles Sequence</td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Royal Television Society Craft &amp; Design Awards</span></td><td>Graphic Design - Titles</td><td>Nic Benns, Andrew Popplestone, Rodi Kaya, David Slade</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"13\">2014</td><td rowspan=\"5\"><span>IGN Awards</span></td><td>Best TV Actor</td><td><span>Hugh Dancy</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best TV Horror Series</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best TV Villain</td><td><span>Mads Mikkelsen</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best TV Series</td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best New TV Series</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\"><span>Saturn Awards</span></td><td><span>Best Network Television Series</span></td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\"><span>Best Actor on Television</span></td><td>Hugh Dancy</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Mads Mikkelsen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Guest Star on Television</span></td><td><span>Gina Torres</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Critics' Choice Television Award</span></td><td><span class=\"mw-redirect\">Best Drama Actor</span></td><td>Hugh Dancy</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">EWwy Award</span></td><td>Best Drama Series</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Guest Actor, Drama</td><td><span>Michael Pitt</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Online Film &amp; Television Association Awards</td><td>Best Actor in a Drama Series</td><td>Mads Mikkelsen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"18\">2015</td><td rowspan=\"2\"><span>Satellite Awards</span></td><td><span>Best Actor – Television Series Drama</span></td><td>Mads Mikkelsen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Television Series – Drama</span></td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\">IGN Awards</td><td>Best TV Series</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best TV Horror Series</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best TV Villain</td><td>Mads Mikkelsen</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best TV Episode</td><td>\"Mizumono\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"7\"><span>Saturn Awards</span></td><td>Best Network Television Series</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"2\">Best Actor on Television</td><td>Hugh Dancy</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Mads Mikkelsen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Supporting Actor on Television</span></td><td><span>Laurence Fishburne</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>Best Supporting Actress on Television</span></td><td><span>Caroline Dhavernas</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Guest Star on Television</td><td>Michael Pitt</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best DVD or Blu-ray TV Series</td><td>Season 2</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"5\"><span>Fangoria Chainsaw Awards 2015</span></td><td>Best TV Series</td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\">Best TV Actor</td><td>Hugh Dancy</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Mads Mikkelsen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best TV Supporting Actress</td><td>Gillian Anderson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best TV Makeup/Creature FX</td><td>Francois Dagenais</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"18\">2016</td><td rowspan=\"2\"><span class=\"mw-redirect\">Critics' Choice Television Awards</span></td><td><span class=\"mw-redirect\">Best Drama Actor</span></td><td>Hugh Dancy</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Best Guest Performer in a Drama Series</span></td><td><span>Richard Armitage</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\">IGN Awards</td><td>Best TV Series</td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best TV Horror Series</td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best TV Villain</td><td>Richard Armitage</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best TV Episode</td><td>\"The Wrath of the Lamb\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"7\"><span>Fangoria Chainsaw Awards 2016</span></td><td>Best TV Series</td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\">Best TV Actor</td><td>Hugh Dancy</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Mads Mikkelsen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best TV Actress</td><td>Caroline Dhavernas</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best TV Supporting Actor</td><td>Richard Armitage</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best TV Supporting Actress</td><td>Gillian Anderson</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best TV Makeup/Creature FX</td><td>Francois Dagenais</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\"><span>Saturn Awards</span></td><td><span>Best Action-Thriller Television Series</span></td><td></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Actor on Television</td><td>Mads Mikkelsen</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Supporting Actor on Television</td><td>Richard Armitage</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Best Supporting Actress on Television</td><td>Gillian Anderson</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Emmy Awards</span></td><td><span>Outstanding Special Visual Effects</span></td><td>\"Primavera\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>2017</td><td><span>Saturn Awards</span></td><td><span>Best Television DVD Release</span></td><td><i>The Complete Series Collection</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr></tbody></table><br/><h3>Home media releases</h3><p>The first season, including all 13 episodes, was released on Blu-ray and DVD in region 2 on September 2, 2013, in region 1 on September 24, 2013, and in region 4 on September 25, 2013. The region 1 set includes two audio commentaries (by Bryan Fuller, David Slade and Hugh Dancy on \"Apéritif\" and \"Savoureux\"), deleted scenes, gag reel, pilot episode storyboards, four featurettes, and \"producer's cut\" versions of five episodes.</p><p>The second season, including all 13 episodes, was released on Blu-ray and DVD in region 1 on September 16, 2014. Bonus features include episode audio commentaries with cast and crew, several behind-the-scenes featurettes, a gag reel, deleted scenes and the \"Post Mortem\" webisodes hosted by Scott Thompson.</p><p>The third season, including all 13 episodes, was released on Blu-ray and DVD in region 1 on December 8, 2015. Bonus features include ten audio commentaries with cast and crew, producer's cut versions of seven episodes, several behind-the-scenes featurettes, a gag reel, deleted scenes, and the \"Post Mortem\" webisodes hosted by Scott Thompson.</p><br/>"
  },
  "errorMessage": ""
}