{
  "imDbId": "tt0092337",
  "title": "Dekalog",
  "fullTitle": "Dekalog (TV Series 1989–1990)",
  "type": "TVSeries",
  "year": "1989",
  "items": [
    {
      "username": "gga",
      "userUrl": "https://www.imdb.com/user/ur0190825",
      "reviewLink": "https://www.imdb.com/review/rw0239766",
      "warningSpoilers": false,
      "date": "10 October 2000",
      "rate": "10",
      "helpful": "161 out of 170 found this helpful.",
      "title": "Masterpieces",
      "content": "Written in little over a year and a half and done with a budget that any Hollywood production would consider ridiculous, Krysztof Kieslowski and Krysztof Piesiewicz created some of the most thought provoking and emotional films of all time with this miniseries. What was even more dramatic is that these pieces were unavailable on video for almost 15 years due to its distributor. Based on an original idea of Piesiewicz, Kieslowski's long time collaborator, the series was to be given to different directors each time. But Kieslowski fell in love with the project and ended up filming all of them. What makes these pieces unique is their rhythm, their unique images and their amazing scripts. Very little dialogue is used all along. Instead, Kieslowski gives you a full knowledge of his characters by little incidents in their lives, which end up having more resonance. Each one of the stories are linked by location, all occuring to different occupants of an apartment complex over the course of what's very likely one year. Each piece is an entity by itself and can be watched separately, although some of the characters do reappear in different episodes in bit parts. Most significant is that one who has been called \"the angel\", a mysterious figure whose gaze serves as a warning sign to the main characters. Since the films are loosely based on the ten commandments (and the different ways we break them every single day), the mood is one of anguish and solitude. And Warsaw and that inhumane apartment complex are a perfect setting for these desolate stories. Still, there's no need to be a Christian or even a religious person to enjoy these films. Most films deal with human issues and tough moral choices. Although the stories have received a subtitle to associate each of them with a commandment, these were not present in the original vision of the director and were added later by the Venice Film Festival's press office. Also, if you've seen two of the films in their longer versions: \"A short film about Killing\" and \"A short film about Love\", you should also watch them again here in their original versions, since they provide a small glimpse at the genius of Kieslowski who changes and adds small scenes that make the movies (specially \"a short film about love\") different experiences and almost vignettes of a people's lives."
    },
    {
      "username": "Hairy_Lime",
      "userUrl": "https://www.imdb.com/user/ur2819614",
      "reviewLink": "https://www.imdb.com/review/rw0239770",
      "warningSpoilers": false,
      "date": "22 January 2004",
      "rate": "10",
      "helpful": "124 out of 131 found this helpful.",
      "title": "If you love beautiful, heartbreaking, thoughtful movies, you'll thank me for this advice.",
      "content": "Kieslowski left us way too soon. But he did leave behind a handful of achievements that place him at the forefront of filmmakers of the last quarter of the 20th century. The Three Colors movies and The Double Life of Veronique - the movies for which he is probably best known - would be enough to ensure his reputation, but is this film - or ten films, if you wish - that elevate him.While the movies are based upon the Ten Commandments, they are not simple morality tales and illustrations. Kieslowski and his co-writer, Krzysztof Piesiewicz, create meditations that connect both intellectually and emotionally with the commandments instead. They explore the commandments' themes with the head and the heart. One great example is the first movie, in which a parent and his child use a computer to predict the freezing rate of a pond. Casting the computer and human knowledge as false Gods is not a new or unique idea, but in Kieslowski's hands, the idea expands and fills not only the mind but the heart. Man, I wish I had the vocabulary to express what moves in me every time I watch any one of these films.Everything about this film, from the cast - always nice to see the ubiquitous Daniel Olbrychski (ubiquitous for Polish films; I always wondered if Poles ever play six degrees of Daniel Olbrychski) - on. The cinematography for each episode is ideal; the look and feel of these movies, shot with the same director but different cinematographers, are all perfect.And who is that watchful, mute man who appears in the background of all or most of these films?Look, just see this. Find it, rent it. If you love beautiful, heartbreaking, thoughtful movies, you'll thank me for this advice."
    },
    {
      "username": "Benedict_Cumberbatch",
      "userUrl": "https://www.imdb.com/user/ur3417327",
      "reviewLink": "https://www.imdb.com/review/rw1757789",
      "warningSpoilers": false,
      "date": "3 November 2007",
      "rate": "",
      "helpful": "56 out of 62 found this helpful.",
      "title": "A truly magnificent project; perfect example of an actor's director, a poet & a master",
      "content": "Krzysztof Kieslowski's \"The Decalogue\" is one of the most powerful cinematic experiences you'll ever have, and probably the best ensemble cast I've ever seen (if you consider them a single film, like I do). I used to think Mike Nichols, Ingmar Bergman and Robert Altman were the supreme actor's directors, but I might consider Kieslowski (1941-1996) my #1 for this project alone. It helps that all the actors are unknown to most of us and not famous Hollywood stars, and that makes the experience even more real, but that wouldn't be much if they couldn't act. I had seen Kieslowski's \"Three Colors\" (which happens to be my all-time favourite trilogy), but I didn't think of him as a particular actor's director because Juliette Binoche or Julie Delpy don't necessarily need a great director to deliver a great performance (I'm not sure about Irène Jacob, though; I haven't seen \"The Double Life of Veronique\", in which she's supposed to be brilliant, and I do like her in \"Red\", but she never impressed me in any movie not directed by Kieslowski). Adrianna Bierdzynska (who looks like a cross between Jennifer Jason Leigh and Hilary Swank) and Olaf Lubaszenko, from segments 4 and 6, respectively, stand out; they're more Oscar-worthy than 90% of the nominees of the past decade; but every member of the cast did a terrific job. Stanley Kubrick described \"The Decalogue\" as the only masterpiece he could name in his lifetime - if that doesn't make you curious to watch this poignant, unique experience, then you're not a film lover. 10 out of 10 in my books."
    },
    {
      "username": "fubared1",
      "userUrl": "https://www.imdb.com/user/ur0337549",
      "reviewLink": "https://www.imdb.com/review/rw0239764",
      "warningSpoilers": false,
      "date": "13 July 2000",
      "rate": "9",
      "helpful": "49 out of 55 found this helpful.",
      "title": "Brilliant series",
      "content": "I would have hoped more people would have seen this superb collection of 10 short films, now that is available on video and DVD and has played on the Sundance channel. If you haven't, you are missing out on 10 superb masterpieces. Yes, they are slow-moving and some of them are very depressing, but what did you expect from this director, Adam Sandler? The acting, writing, direction, and music are all near perfection. 2 corrections to make from the earlier reviewer, these films are not in black and white, but in a very muted, monochromatic color. Also you should see them in sequence as 2 of the earlier episodes are referred to in the 8th and 10th episodes."
    },
    {
      "username": "Vincentiu",
      "userUrl": "https://www.imdb.com/user/ur13017201",
      "reviewLink": "https://www.imdb.com/review/rw1798854",
      "warningSpoilers": false,
      "date": "12 January 2008",
      "rate": "10",
      "helpful": "12 out of 13 found this helpful.",
      "title": "A masterpiece",
      "content": "Ten stories. About few people and their life. Crossing destinies and silences, pains and an \"deus otiosus\". Descriptions of a Communism Poland. And eternal values, everyday problems, scenes of an ordinary existence in gray nuances. Nothing special; only a deep view.A collections of details. Small gestures, some looks, a flower, one boy and his dream, a father front of an icon, a old doctor and a sad wife, a husband in Christmas Eve, a killer and a taxi driver, a daughter and a strange letter, a young mother and a child, a witness of Shoah, two brothers, corpse of love and a postman, a man and his life and the shadow of fear to be victim of bad feelings. And God. As master, witness, possibility, chance, pretext. A masterpiece of a great director. About an ordinary world, ordinary ash of beauty, desire and hope. A film about us. About sense of life before the errors, about the faces of sin and mercy, about time and expectations."
    },
    {
      "username": "Polaris_DiB",
      "userUrl": "https://www.imdb.com/user/ur5232724",
      "reviewLink": "https://www.imdb.com/review/rw1435557",
      "warningSpoilers": true,
      "date": "31 July 2006",
      "rate": "10",
      "helpful": "17 out of 19 found this helpful.",
      "title": "Very good and engaging",
      "content": "What I'm hoping to do with a review of the Decalogue is to use this review as a review of the overall effect of the series, with a separate and more in-depth review for each episode.The series itself is one of those works that bleeds profundity and symbolism in everything it does. A bunch of short--yet highly well-rounded and fully developed--character dramas dealing with Universal themes of ethics, love, passion, and guilt, Kieslowski's Decalogue is a continuing but heavy portion of art and cinema and classical music, among other things.While not all of theme are technically interwoven with each other, they do share visual and thematic motifs with uses of color, recurrent props and sets, and a distinctive wide-angle lens close-up framing that helps the audience really look and regard every aspect of the character the film is following. This recurrent use of cinematography is held despite the actual production involving nine different cinematographers, which helps show the power of Kieslowski's personal vision and how he's able to bring it out on screen.It's definitely not something that can, nor should, be watched in one sitting, but it is continually enjoyable throughout each episode.--PolarisDiB"
    },
    {
      "username": "minnow-6",
      "userUrl": "https://www.imdb.com/user/ur0435558",
      "reviewLink": "https://www.imdb.com/review/rw0239765",
      "warningSpoilers": false,
      "date": "25 July 2000",
      "rate": "",
      "helpful": "55 out of 63 found this helpful.",
      "title": "10 stories you'll want to talk about long after you've watched them",
      "content": "`Dekalog' **** There are some `movies' that are hard to describe. `Dekalog' is one. It's not really a movie. It is a ten part made-for-TV mini series. Don't remember seeing `Dekalog' when it was first shown on TV? Neither do I. `Dekalog' was made for made for Polish TV in 1987 by Krzysztof Kieslowski (`Blue', `White', `Red' and `Double Life Veronique'). Each segment of `Dekalog' is about one hour and is thematically driven by one of the 10 Commandments. All the stories take place in the same high rise apartment in Warsaw. The characters in each of the stories don't necessarily overlap, yet we see some of the characters from one story walk through another. This lack of overlap is also true of the stories and the commandments. Even knowing which commandment was the basis for a story, I couldn't always see a direct correlation. It's as if Kieslowski and his co-writer Krzysztof Piesiewicz view the 10 Commandments as a ruler to measure one's actions, a curb to provide bounds for one's choices or maybe a mirror to reflect on one's life. This reflective view of the commandments comes through in each of the stories. In \"I Am the Lord Our God\" a young boy and his father rely on a computer to decide whether or not it's safe to go out on the ice. \"Thou Shalt Not Commit Adultery\" is about a young boy who spies on and stalks the woman next door. Magda, his neighbor, is free and easy. And when she finds out about the young voyeur, she sets out prove there is no such things as love. Commandment by commandment Kieslowski provides us our own voyeuristic moment into the lives of the people in this one Warsaw apartment. This is truly a great movie. Buy a copy and watch the stories with another movie fan. Dekalog contains 10 stories that you'll want to talk about long after you've watched them."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3637258",
      "warningSpoilers": false,
      "date": "10 February 2017",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Something of a towering achievement",
      "content": "Of the work of Krzysztof Kieslowski seen thus far (\"The Three Colours Trilogy\", 'The Double Life of Veronique' and 'Dekalog'), it's 'Three Colours: Red' and 'Dekalog' that stand out as particularly masterful, though there is not a dud in the lot.'Dekalog' is simply put a towering achievement, one of the greatest mini-series ever made and a televisual masterpiece in its own right. There are not many mini-series around with a concept of this level of ambition, and 'Dekalog' executes its ambitious concept brilliantly. While some of the stories are better than others (Episodes 3 and 8 being two of the weaker ones), the weaker stories still have so many great merits that they are a long way from bad, which is testament to the brilliance of the best stories and how high-quality 'Dekalog' as an overall whole is.Kieslowski's work is all visually stunning. Despite being a mini-series, the production values, with scenery that is both unflattering and affectionate, and atmospheric (sometimes innovative) photography are so good that mistaking 'Dekalog' as a piece of cinema is understandable, especially when there is elegiac but elegant pacing and often cinematic flow to the storytelling. Actually had to frequently check as to whether it was a mini-series and not a huge epic film that it honestly felt more like. Episodes 1 and 6 were especially impressive.Another striking element of Kieslowski's work is the way music is composed and utilised. This is especially true in 'Three Colours: Blue' and 'The Double Life of Veronique', where it is very intricate, symbolic and like its own character. This intricate and symbolic approach to how music is written and utilised is evident in 'Dekalog' too, Episode 2 has music that is particularly mood-enhancing.There is some truly thought-provoking and poetic writing in 'Dekalog', even though dialogue generally is minimal. There are a wide range of emotions, rich and complex themes (murder and punishment, faithfulness, idolisation, jealousy, love and passion, truth, good and evil, sex and greed), human issues and moralistic ideals used to full potential. There is also a little room for humour, not just in the more screwball comedy feel of Episode 10 Episodes 1 and 5 also have the odd darkly funny moment.In all ten episodes, the stories are all absorbing in their own ways, with different moods (such as creepy for Episode 5, poignant for Episode 2, comedic for Episode 10, sombre for Episode 4 and spiritually resonant for Episode 8 for examples) and themes. Was really impressed at how stories were built around each of the ten commandments (although the only resemblance to them really is the episode titles, despite how it may sound upon hearing this is not to be dismissed as \"religious propaganda\" or anything like that), and done in a way that's somewhat deliberate in pace but gripping in atmosphere. While 'Dekalog' in no way rushes the storytelling, the power, intensity and poignancy of the stories told so intelligently makes it seldom dull.Characters are compelling in their realism and their conflicts/situations, they are remarkably well drawn and interesting for just ten episodes at only one hour each. Kieslowski's direction is superb, showing a truly gifted director who died too soon with more to give. One couldn't have asked for more ideal performances as well, some of them are remarkably complex and understated while always natural and genuine.Overall, a masterful towering achievement, in how much it does with its concept and for the viewer for getting so much out of a mini-series unlike any made before, during and since. 10/10 Bethany Cox"
    },
    {
      "username": "denis888",
      "userUrl": "https://www.imdb.com/user/ur11215533",
      "reviewLink": "https://www.imdb.com/review/rw1427635",
      "warningSpoilers": false,
      "date": "22 July 2006",
      "rate": "10",
      "helpful": "20 out of 24 found this helpful.",
      "title": "Undoubtedly, the work of art",
      "content": "Dekalog is a very difficult film. In fact, ten short films, about 50-60 minutes each. This is not yet a superficially complicated work where you have look for some hidden agenda or multi-layered symbols. No, all 10 series depict lives of simple people who all happen to dwell in Warsaw, around 1987, and who live within the same modern neighborhood. What is really striking is the sensation how similarly this place looks  very much like the dull, concrete blocks in my home-town in Russia or any large industrial city of the world. And what a constellation of stars! Almost all the best Polish actors are gathered here  Boguslaw Linda, Jerzy Stuhr, Zbigniew Zamachowski, Daniel Olbrychski, Janusz Gaios  among others. They look so young and so fresh in the film. But the way they act is simply second to none. What a thrilling, truthful performance! Each small nothing in their life breathes fully and vividly, thanks to their impeccable and outstanding play. So, why Dekalog is so difficult? Many reasons. First, it's the deliberate choice of colors. The series all made in almost no-color scheme, almost black and white. Then, very few dialogs. Sometimes, you have to watch closely and attentively for many long minutes, and yet in those mute scenes there is Life, true and naked. Each episode revolves around a certain God's Commandment, hence the name of the whole film. And each Commandment is explained so freshly and so unobtrusively wisely that there is no didactic tone or dull morals there. Common people live and die in common surroundings, and with their deeds they illustrate those rules from The Bible. What are my favorite episodes? Well, the 10th one, about two hapless brothers who try to make a fortune on their late Dad's priceless stamp collection, but then simply lose their money, a kidney and the whole collection. Or, the terribly cold and merciless series about a guy called Jacek Lazar, who killed a taxi driver and for that is hanged. The dearth penalty scene is so realistic that it will make you hate all the capital punishments for ages. Or, take the superb episode about a young man peeping at the beautiful woman nearby. He behaves like a dangerous maniac but turns up to be a weak one, ending up in a hospital. It's so much to describe there, but every short film, be it about a Dad who trusted his computer so much that it caused his son's tragic death; or the one about a Jewish lady who once was not saved by the Polish family  all of them are so touchingly deep, so exact, so surgically sophisticated that simply may be called masterworks. This is us there, this is our own life. If you feel shame, or fear, or sadness or pain  then Krzysztof Kislowski did his job well. He was and remains to be a master of realism, a carver of characters so deep and convincing that they may step out of the screen and right into our life. The serial demands all your time and attention, but if you have a chance  watch it carefully and think a bit about yourself, your life and your morality. If the film makes you think hard, then it has done its job. This is a labor of love, a grand achievement of Polish cinema and the essential choice for all the thinking people."
    },
    {
      "username": "frank.vandenblock",
      "userUrl": "https://www.imdb.com/user/ur0823992",
      "reviewLink": "https://www.imdb.com/review/rw0239767",
      "warningSpoilers": false,
      "date": "4 December 2000",
      "rate": "10",
      "helpful": "85 out of 95 found this helpful.",
      "title": "Don't read this review - watch the movie",
      "content": "If ever there was a good reason to start learning Polish, the Dekalog series is the definitive reason. The extent to which Kieslowski goes to show us what it is to be human, cannot be compared to the work of any film-maker. Yes, Ken Loach is the master of the social drama, and Lars Von Trier is without a doubt the best experimental melodramatist, but Kieslowski just manages to outclass them both in 10 powerful, striking and breath-taking stories losely based on the 10 Commandments. It's a must-see, don't take my word for it...go watch it !"
    },
    {
      "username": "MANU-13",
      "userUrl": "https://www.imdb.com/user/ur0175061",
      "reviewLink": "https://www.imdb.com/review/rw0239763",
      "warningSpoilers": false,
      "date": "3 May 1999",
      "rate": "",
      "helpful": "93 out of 104 found this helpful.",
      "title": "KIESLOWSKI- THE MASTERCRAFTSMAN",
      "content": "I am among those very fortunate few in this world to have seen the 'dekalog' series in a theater.And i am proud of it.I knew precious little about Kieslowski until i saw this series which was shown during the 29th international film festival of India, held at Trivandrum. ever since i have respected,admired and loved this man for his skills. Anybody can learn a lot from the these 10 little gems. Even a lot many contemporary so called serious movie makers have lots to learn from this extremely intelligent filmmaker.Shot mostly in stark black and white, the camera seems to have a knack to bring out the faintest of internal turmoils each of the characters undergo. This man has proved how good an observer of life he is. His way of putting across ideas in a simple but intense manner will leave an everlasting impression in our minds.'A short film about killing' and 'A short film about love' may have found its way to the theaters and gained more attention. But i strongly feel that one has to see all the 10 episodes (in any order and do note that) which covers issues from adultery to incest to treachery and what not. Even more amazing is the fact that all the episodes seem to have been shot in the same locality, covering the occupants of a large residential complex.There are very few characters in each episode(which is about an hour each)and they ALL seem to leave an imprint in our minds. Krzysztof Piesiewicz,the screenplay writer for all the episodes has done a marvellous job.But i am sure i have lost the essence of some of the dialogues as i saw only the subtitled versions.There are no grandiose attempts while making these episodes-say through utilisation of huge sets or big stars or slick camera movements. It is kept down to earth,realistic and bereft of too many cinematic elements.The camera moves snail pace but something keeps you alert because you realise that the man behind it is making an attempt to speak not just though dialogues. I wish i got a chance to see more of his works and keep away from the commercial crap we are being forced to view everyday.I sincerely hope more of Kieslowski's offerings find its way to my country and more people from all over the world get a chance to see the works of this genius. This man is SIMPLY BEAUTIFUL !!!"
    },
    {
      "username": "warisill",
      "userUrl": "https://www.imdb.com/user/ur1438509",
      "reviewLink": "https://www.imdb.com/review/rw1000762",
      "warningSpoilers": false,
      "date": "17 January 2005",
      "rate": "10",
      "helpful": "52 out of 60 found this helpful.",
      "title": "Made for TV, it's a masterpiece in any forum.",
      "content": "It's worth noting that about the same time this was airing on censored, Communist Poland TV, America was airing the \"Heart to Heart reunion\" and \"V\". Obviously, the Ten Commandments themes that it reportedly addressed in order are not actually in order, some of the shorts address two and even three commandments. No worries, though.This collection is a masterpiece. It's a major accomplishment with every film short being watchable, and some being unquestionable masterpieces. Kieszlowski is a master of presenting both sides of the argument; the pregnant, cheating wife and the cuckolded husband's doctor; the peeping Tom and the lonely woman; the atheist father and the religious sister.The final film centers on two brothers who inherit the stamp collection of their recently deceased father. They come to find that the collection is priceless and they scheme to sell it, mistrusting their father's former colleagues and ultimately one another. But despite their eventual downfall, the brothers find something of value from their folly. It's wonderfully affirming without being sentimental. That sentence probably describes most of these shorts."
    },
    {
      "username": "Artimidor",
      "userUrl": "https://www.imdb.com/user/ur16162453",
      "reviewLink": "https://www.imdb.com/review/rw2536960",
      "warningSpoilers": false,
      "date": "24 December 2011",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "At the very heart of the matter of moral dilemmas",
      "content": "With \"The Decalogue\" former documentary filmmaker Krzysztof Kieslowski and writer Krzysztof Piesiewicz tried their hands on an innovative TV concept for Polish television with the main focus on addressing moral issues the individual is facing. The result is a seminal series of ten small films where the protagonists are confronted with various dilemmas, forced to make decisions with ramifications on their own lives and the lives of others. Each of these films is a little gem in itself, and the entire lot put together provides even more weight. The episodes don't necessarily represent each of the ten Christian commandments as the title of the series might suggest, but rather it's a healthy mixture of them all, of universal value and accessible to everyone. Made in Poland in the eighties, before the time Kieslowski became known to a broader audience, the films' strong point is to show the lives of ordinary people living in the same block of buildings, doing their everyday business. Add in a dramatic ingredient dished out by fate or caused by human nature - death, illness, tragedy, hope, love to name examples - and a person's life takes another turn, gets unhinged or shifts focus. Paths formerly unexplored need to be considered and taken, often by the individual alone.One of the great things about these small films is that \"The Decalogue\" uses actors you'll probably never see anywhere else again (unless you explore Kieslowski's other works), a fact that makes all these stories look as if they are taken straight out of life, portrayed by and meant for actual living people. Also due to the more bleak East bloc environment where existence is at the forefront of people's concerns, the tales can actually focus on the people involved and their issues, they are down-to-earth, raw, gritty, sometimes quite simple, yet often deep and indefinitely thought-provoking. Thus \"The Decalogue\" contains everything that matters when it comes to moral decisions which Hollywood blockbusters with similar themes sorely lack."
    },
    {
      "username": "chaos-rampant",
      "userUrl": "https://www.imdb.com/user/ur17699578",
      "reviewLink": "https://www.imdb.com/review/rw3430947",
      "warningSpoilers": false,
      "date": "13 March 2016",
      "rate": "",
      "helpful": "6 out of 7 found this helpful.",
      "title": "Ten short ways to concatenation",
      "content": "I'd be lying if I said mounting the Dekalog was a breeze, it wasn't. But it was designed to be seen over a period of months, not days like I did, and I would probably dissuade you from watching it in a row. A significant obstacle for me lies with the format: ten different mini films that don't interconnect in meaningful ways, each one under an hour so it feels like a Sissyphian struggle of having to start again from the bottom just as you were getting to the top, and each time we go back down we start anew with a different set of characters and story.The upside of the TV format is that Kieslowski had the opportunity to work out different variations with a unifying form. The unifying idea across the 10 Dekalogs is potent; we leave with some insight on the destructiveness of what it means to inhabit a story when reality is more complex and elusive, as well as some measure of realization about this complexity of inter-dependent forces at work behind the stories. The form they developed was a narrative that is made concave and called into question. Time and again certainties of drama are blown away by revelations that demand a change in viewing. There are two tendencies at play in the work, one a filmmaker's, the other a writer's. Kieslowski's proclivity to visually recall edges, different ways of dreaming. The other tendency is that time and again this recollection is reduced to two characters forlornly baring themselves to each other in a room, explaining or avoiding to. Bergman. One releases emotional energy from characters into the air, the other drains it away in words and somnolent pauses. At times it feels like Kieslowski is just stylizing the morals of a script, but at other times it feels like he's writing his own paths with the camera.By itself it's no masterpiece in my estimation. Even with 10 hours to spare, it simply surrounds and repeats motifs. But if this is where Kieslowski apprenticed for the Three Colors by repetitively hitting the same limits and would be now ready to effect a real change in viewing in feature form, that would be time well spent. I came to this as preparation for those films myself, viewer apprenticeship you might say. I'll be going ahead there to find out."
    },
    {
      "username": "kasac",
      "userUrl": "https://www.imdb.com/user/ur0411478",
      "reviewLink": "https://www.imdb.com/review/rw1168669",
      "warningSpoilers": false,
      "date": "9 September 2005",
      "rate": "10",
      "helpful": "49 out of 61 found this helpful.",
      "title": "One of the Greatest",
      "content": "I first saw this amazing series at the San Francisco Film Festival, and so had the privilege of experiencing it on a large screen. The program was sold as a package deal, and in 1990, not much was known about the director and the work itself was completely unknown. From the first frame, those of us who took a chance knew we had really hit a winner early on. Every night, two episodes were screened. It proved to be a real binding experience. Each subsequent viewing provides fresh insight. Timeless, it continues to fascinate and illuminate. Each episode could possibly stand on its own, and the fact that it was a miniseries only enhances its power. On the basis of this experience, I chose to see Denmark's THE KINGDOM, PARTS I & II when the Film Festival ran them in the mid-90's."
    },
    {
      "username": "BasBen",
      "userUrl": "https://www.imdb.com/user/ur4233235",
      "reviewLink": "https://www.imdb.com/review/rw1255055",
      "warningSpoilers": false,
      "date": "4 January 2006",
      "rate": "10",
      "helpful": "44 out of 53 found this helpful.",
      "title": "Ten highly sophisticated moral plays",
      "content": "The Decalogue is without doubt a monument of movie history. The ten films are apparently based on the ten commandments, but this relationship is tentative. Kieslowski himself commented that \"the films should be influenced by the individual Commandments to the same degree that the Commandments influence our daily lives\". The amazing thing about them is that they are much more than a series of abstract cinematic emblems. Assisted by superlative acting, they acquire each their own depth, their own real personalities and complex dilemmas. Kieslowski presents a cinematic view of morality that is about as sophisticated as it gets. A grand achievement of one of the great film-makers of the twentieth century."
    },
    {
      "username": "Zoe-Trope",
      "userUrl": "https://www.imdb.com/user/ur2452654",
      "reviewLink": "https://www.imdb.com/review/rw0951746",
      "warningSpoilers": true,
      "date": "22 October 2004",
      "rate": "10",
      "helpful": "21 out of 24 found this helpful.",
      "title": "Fantastic",
      "content": "**Very Small Spoiler** I rented this on DVD recently (3 DVDs, 10 1-hour films) and was entranced. Very well done portrayals of people dealing with difficult situations. I noted that other comments indicate that each 1-hour film was later given a subtitle. The DVD I rented did not have this. The films were simply given numbers. It would be interesting to see how individual viewer interpretations compared to those subtitles. For example, the film about the peeping tom was apparently intended to be about adultery, whereas I interpreted it as relating to the commandment against coveting.A must-see for those who appreciate masterful film making."
    },
    {
      "username": "Kirpianuscus",
      "userUrl": "https://www.imdb.com/user/ur61197531",
      "reviewLink": "https://www.imdb.com/review/rw3277912",
      "warningSpoilers": false,
      "date": "16 July 2015",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "useful exercise",
      "content": "one of films who defines the viewer. not only at the religious level but for the image about the every day reality. because it is a film about Communist experience, roots of errors and about essence of truth. a masterpiece for define the Central Europe and Polish traditions but its great virtue is to transform the particular message in a wise manner, as universal one. a film like an art gallery. not for the beauty of scenes, not only for acting but for the science to explore the details and to define the characters as pieces of a large puzzle. a film who has the force to impress and change. because it has the rare gift to remind basic details who defines life . a fascinating film. and an useful exercise for each of its viewers."
    },
    {
      "username": "SmileyMcGrouchpantsJrEsqIII",
      "userUrl": "https://www.imdb.com/user/ur56998392",
      "reviewLink": "https://www.imdb.com/review/rw5539791",
      "warningSpoilers": true,
      "date": "9 March 2020",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "A masterpiece that will change your life!",
      "content": "If ever there was a reason to \"binge watch,\" this is it. You notice how much treacley and usual dramatic frames we put up with by how much they are *absent* in this film (series) -- there isn't a hint of \"have to lean that way so the audience will get it\" in the whole set of 'em, up to the last one, which is the most light-hearted. Viewing it from this far up the tracks, you can see how poorly people had to live, even when they were making the best of it, and how much Kieslowski and collaborator Piesiewicz did to consciously prioritize children, familial longing, choices that have no easy (or precedented) out. You're surprised at how moved you are, and how much you find out that you couldn't have guessed, and how much it's a question of pacing you might not be used to in this hectic day-to-day life. Worth adjusting to! A really good movie, and appropriate for adolescents -- it'll sear itself into their brains, and you can rest assured that they'll at least have *some* ballast that isn't South Park, or Seinfeld: forgiveness zones for more peanut butter."
    },
    {
      "username": "beirut28",
      "userUrl": "https://www.imdb.com/user/ur9270953",
      "reviewLink": "https://www.imdb.com/review/rw1769693",
      "warningSpoilers": false,
      "date": "25 November 2007",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Best 10 things to watch ever",
      "content": "Dekalog is a brilliant work by Krzysztof Kieslowski and i bet if there is any other movie/series more powerful. please don't read my review just go and watch it....you will enjoy it because you will experience feelings that you have never experienced before. It's just WONDERFUL by all means. Dekalog, based on the ten commandments in a very different way, offers ten short (each is slightly under an hour) scenarios, each scenario deals with one person in a critical situation which affects him/her and people around them. The acting is great, the story is masterfully written and directed. Dekalog 1 - \"Thou shalt have no other gods before me\" Between God and Computers. Dekalog 2 - \"Thou shalt not take the Lord's name in vain\" Death and delivery. Dekalog 3 - \"Thou shalt remember the Sabbath and keep it holy\" a family man who was forced to leave his wife and children on Christmas Eve and try to help his ex-girlfriend to find her missing husband. Dekalog 4 - \"Honour thy Father and Mother\" A complicated relationship between a girl and her father. Dekalog 5- \"Thou shalt not kill\" the most powerful segment. Dekalog 6 - \"Thou shalt not commit adultery\" a tale of a 19-year-old shy and quiet postal worker who peeps on (and later stalks) his beautiful, free-spirited neighbor. They meet later with tragic consequences. Fascinating and very clever. Dekalog 7 - \"Thou shalt not steal\" A family war. Dekalog 8 - \"Thou shalt not bear false witness\" An American woman returns to Poland to face a famed lecturer who during WWII refused to help her, a 6 year old girl at the time, to find a hiding place from the Nazis. Dekalog 9 - \"Thou shalt not covet thy neighbor's wife\" Infidelity and unfaithfulness. Dekalog 10 - \"Though shalt not covet thy neighbor's goods\" Greed and obsession."
    },
    {
      "username": "grapesofbutcher",
      "userUrl": "https://www.imdb.com/user/ur2591275",
      "reviewLink": "https://www.imdb.com/review/rw1485311",
      "warningSpoilers": false,
      "date": "28 September 2006",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "Where's the Politics?",
      "content": "Kieslowski's astonishing ability, identified by Kubrick as \"dramatizing ideas rather than just talking about them\" is the core of all energy which flows through each sequence. Thanks to his rare ability, he transforms a religious canon into a cinematic myth which almost has become a Kieslowskian cult. However, although he creates a micro cosmos of human conditions in a mass apartment site, his opus reflects almost any political ideas which can be interpreted as the suppression of politics by any mystic movement. Regarding Kieslowski's religious choice and his free adaptation of the ten commandments, is it an over interpretation or exaggeration? Maybe."
    },
    {
      "username": "Red-125",
      "userUrl": "https://www.imdb.com/user/ur0442119",
      "reviewLink": "https://www.imdb.com/review/rw3550842",
      "warningSpoilers": false,
      "date": "25 September 2016",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "A must-see series for anyone who loves movies",
      "content": "The Polish films entitled Dekalog (1989) were shown in the U.S. with the translated title \"Decalogue.\" All ten films were co-scripted and directed by Krzysztof Kieslowski. Dekalog is actually a series of ten films produced for Polish TV in 1988 - 1989. IMDb calls it a mini- series, because there's no good name for what Dekalog really is. A mini-series implies that each film in the series has the same protagonists, and the plot moves forward from film to film. That's not the case for Dekalog. Dekalog has ten episodes, each demonstrating--more or less--one of the Ten Commandments. Not only are the episodes not related--except sometimes tangentially--but Kieslowski used nine different cinematographers. That means that the episodes have a somewhat different look each time, although Kieslowski's touch is evident everywhere.Poland was just emerging from Soviet domination in this period. However, there's no direct reference to police, military, shortages, or the threat of martial law. If you knew nothing about Poland, you would assume that it was just another country, inhabited by people who had the same basic problems as people in any other European country.The acting in the films is extraordinary. Everyone on screen, without exception, does a creditable, professional job. Some--especially the children--do more than that. One actor, Artur Barcis is cast as \"the young man,\" and he appears in all but one episode. He always looks on the action with a very sad expression, but never interacts with any of the characters.Although the venues move around somewhat, most of the characters live in a large, anonymous apartment project. It's not a tenement. In fact, it's relatively luxurious. I can't tell if it's private, government owned, or government supported. People from various levels of society live there, although no one there lives in poverty.For whatever reason, director Kieslowski has chosen to feature milk in almost every episode. In some episodes, milk is mentioned in passing: \"I was just going out to buy milk.\" In others, it's central to the plot: one of the characters delivers milk to the apartment complex.As I mentioned, some of the plots are tangentially related. For example, the plot of Episode 2 is mentioned as an example of a moral dilemma in Episode 8. In Episode 6, one of the main characters works in the local post office. Episode 10 is about stamps, and we see one of the protagonists enter that post office and buy stamps from the post office worker from Episode 6.There are so many great actors in Dekalog, that I hesitate to single one out. However, Krystyna Janda, the protagonist in Episode 2, is absolutely brilliant. (She's a very famous actor in Poland, so she was an obvious choice for director Kieslowski.) Janda is utterly believable as a brilliant, mercurial violinist. (Incidentally, her appearance is striking. She's the Polish Jeanne Moreau!)Dekalog is available on DVD. Because the films were made for TV, they work well on the small screen. Realistically, you can't show them as a ten-hour movie, so theaters sometimes show five evenings of one pair of Dekalog episodes, each pair on a different night. That's exactly what was done by the outstanding Dryden Theatre in the George Eastman Museum, in Rochester, NY. My suggestion--get the DVD and watch one or two episodes each evening. These are not happy films. Watching more than two a night might leave you depressed.On the other hand, you should be depressed if you don't watch them all. Dekalog is one of the greatest film series of the 20th Century. That's not just my opinion--the overall IMDb rating is an incredible 8.1. See all ten episodes and savor them. Just space them out a little."
    },
    {
      "username": "Amyth47",
      "userUrl": "https://www.imdb.com/user/ur45390749",
      "reviewLink": "https://www.imdb.com/review/rw4906033",
      "warningSpoilers": false,
      "date": "2 June 2019",
      "rate": "10",
      "helpful": "3 out of 4 found this helpful.",
      "title": "Review # 500 : KIESLOWSKI'S MAGNUM OPUS. Absolute Must-See.",
      "content": "My Rating : 10/10 ♠ MASTERPIECE ♠Complex and fascinating, if flawed, 'Dekalog' is a 10-part film series made for Television illuminating the various subtle aspects of the Ten Commandments.The great American filmmaker Stanley Kubrick offered this treacle about 'Dekalog' saying: 'These films have the very real ability to dramatize their ideas rather than just talking about them....They do this with such dazzling skill, you never see the ideas coming and don't realize until much later how profoundly they have reached your heart.'What it conveys is not always the best it could be. Such is the lot of all art. The best episodes are 2, 3, and 9, with 1, 4, 6 and 10 having some good moments. Episodes 5, 7, and 8 are easily the weakest.An Absolute Must-See."
    },
    {
      "username": "griffinfinity",
      "userUrl": "https://www.imdb.com/user/ur1276055",
      "reviewLink": "https://www.imdb.com/review/rw2093592",
      "warningSpoilers": false,
      "date": "10 July 2009",
      "rate": "8",
      "helpful": "6 out of 8 found this helpful.",
      "title": "A Great Director Goes To Great Lengths...",
      "content": "Krzysztof Kieslowski was a Polish filmmaker from Warsaw (1941-1996) that brought great pride to a country that has had to overcome many hardships in order to survive. This is one of the reasons I love the Polish people. Another is that I grew up with them in my native Chicago, Illinois. They are a resilient, strong, and intelligent people. Above all, they are amongst the most caring and generous souls I have ever met. It is fitting then that they had a brilliant filmmaker who stayed in Poland through thick and thin to document their lives. I was thinking of how I might describe Krzysztof Kieslowski's 'The Decalogue'. My thoughts throughout kept coming back to the American series 'Twilight Zone'. We know it is a series of ten episodes. Each one is a loose study of one of the Ten Commandments. We are also aware that each episode has a character that resides in the same group of Warsaw apartment buildings. Yet, none are carried over into subsequent episodes. Finally, it is clear that the 'The Decalogue' was filmed in 1988. So let us go a bit deeper. It is something Kieslowski would insist upon based on his character studies.Krzysztof Kieslowski co-wrote each segment of 'The Decalogue'. His collaborator was Krzysztof Piesiewicz; a lawyer who Kieslowski felt added a different perspective to compliment his own style. Kieslowski directed every movie. I originally thought that he was consulted on every aspect of the filming, as like a Coppola might be. However, I found out that Kieslowski invited nine different Cinematographers to participate. He gave each one total freedom on their movie. He remarked in an interview that this brought freshness to each episode. He said that he was particularly concerned that the crew not be bored. The characters in the movies run the gamut from young to old, clever to naive, and intelligent to foolish. However, each has a common thread running through their lives. Each must make a decision that may change their lives. This is reflected in each of Zbigniew Preisner's dramatic and sensitive scores. The movies are intense and there is little in the way of action-based sequences. Some of the episodes may bring sadness, while others tend to make one reflect on the subject matter. I favored the first and last episodes. In particular, Decalogue X has a nice comedic touch throughout and it is a great way to end the series. Kieslowski certainly emphasizes that point with the last lines uttered in the Decalogue. It is his signature and a fond farewell to a wonderful project."
    },
    {
      "username": "pink_floyd_fan87",
      "userUrl": "https://www.imdb.com/user/ur10367420",
      "reviewLink": "https://www.imdb.com/review/rw1355780",
      "warningSpoilers": false,
      "date": "30 April 2006",
      "rate": "10",
      "helpful": "12 out of 15 found this helpful.",
      "title": "Great Films",
      "content": "I have only seen a few of the episodes of this mini-series and I can already say that this is one of the most thought provoking film I have ever seen. It is definitely worth anyones time to watch some of these films. There is always a deeper meaning in each episode and each time you watch it you get more out of it. The films question many of life's practices. Why do we feel the need to seek revenge; in that case why do we kill a killer? Why do we seek refuge in a religion? When you watch this films you start wondering about human nature. You question all the things you normally wouldn't think twice about. This \"mini-series\" is excellent and I recommend everyone to give it a chance and watch it."
    }
  ],
  "errorMessage": ""
}