{
  "imDbId": "tt0472954",
  "title": "It's Always Sunny in Philadelphia",
  "fullTitle": "It's Always Sunny in Philadelphia (TV Series 2005– )",
  "type": "TVSeries",
  "year": "2005",
  "items": [
    {
      "username": "MovieAddict2016",
      "userUrl": "https://www.imdb.com/user/ur1173088",
      "reviewLink": "https://www.imdb.com/review/rw1414654",
      "warningSpoilers": true,
      "date": "9 July 2006",
      "rate": "10",
      "helpful": "396 out of 441 found this helpful.",
      "title": "One of the best, funniest and most refreshing shows currently on television",
      "content": "Dennis (Glenn Howerton), Mac (Rob McElhenney), and Charlie (Charlie Day) are all the owners of an Irish bar in Philadelphia, and \"Sunny\" essentially follows their awkward lives - each episode revolving around some type of political or social issue such as gun control, abortion, steroids, underage drinking, health care, and the handicapped (just to touch on a few issues already addressed in the show).It begs comparison with \"Arrested Development,\" \"The Office,\" \"Seinfeld\" and \"South Park\" in its broad humor and wit, but it is completely original in its own right. The pilot was filmed on a low budget by a few friends and was picked up by FX after wards, so the show retains its low-budget feel - giving it a gritty, down-to-earth edge.\"Sunny\" does border on the edge of bad taste sometimes (hell, what am I saying - it crosses the line every time) but it contains enough satire and wit to get away with it. For example: in one episode Mac and Dennis decide to pick up girls at an abortion rally. Mac pretends to be pro-life just so he can be around an attractive woman, whom he ends up sleeping with. Later, she tells him she's pregnant. \"You need to get an abortion,\" he says. This type of irony runs throughout every episode.The banter between the characters in the show is what tends to be particularly funny. The actors - although novices - are all great. Charlie Day in particular has me laughing like crazy every episode. And his interaction with Danny DeVito (who's been brought in for season two) is hilarious. Season two is more polished so far in terms of the mechanics of the show - the characters have all been setup now and they know what they're doing - and in that regard it is seeming to get better and better with every episode.You do have to have a very sick sense of humor to like some of this - DeVito's character, Frank, is the father of Dennis and Dee, and his reason for being in the show is that he is getting a divorce and wants to relive his glory days as a youth. He tries to re-ignite a relationship with an old girlfriend of his from high school - but when he finds out she's a grandmother and not interested in doing anything wild, his attention instantly turns to the waitress and he tunes her out. It's cruel, sick and hilarious. DeVito is playing another ruthless character (same as in \"Taxi\" all those years ago) and it works splendidly.Overall this was a delightful blast of fresh air - after seeing so many stale sitcoms, this proved to me that FX really is becoming the new lead in character-driven comedy-dramas (such as the equally superb \"Rescue Me\" which isn't quite as funny, however).My only hope is that \"Sunny\" doesn't become so popular that it attracts controversy and sells out and dumbs down its humor. Right now it's on par with the early episodes of \"South Park\" and \"SNL\" in terms of how irreverent its humor is - and personally, in my opinion, its plots are better than most comedy films I've seen within the last few years.If you want to see something new, different, and funny, check this out. I have a feeling it could either become huge, like the next \"Seinfeld,\" or - more realistically - it will become a cult phenomenon. Either way, I'll be watching."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8858810",
      "warningSpoilers": false,
      "date": "7 February 2023",
      "rate": "10",
      "helpful": "52 out of 54 found this helpful.",
      "title": "Absolutely Hilarious!!",
      "content": "I don't even know how to describe how much I love this show. It's easily one of my favorite comedies in the history of television. I don't know anyone who's seen this show who hasn't loved it. This is one of those shows where you'll have to watch each episode more than once because you'll miss parts from laughing so much. I've seen every episode of every season a few times and it's just as funny rewatching it as it was the first time. The cast (Charlie Day, Rob McElhenney, Glenn Howerton, Kaitlin Olson and Danny DeVito) is perfect. They are all hilarious, as are all the supporting characters. I can't recommend this show enough, do yourself a favor and go watch it as soon as you can. I promise that you won't be disappointed."
    },
    {
      "username": "lnvicta",
      "userUrl": "https://www.imdb.com/user/ur30151001",
      "reviewLink": "https://www.imdb.com/review/rw3525516",
      "warningSpoilers": false,
      "date": "15 August 2016",
      "rate": "10",
      "helpful": "114 out of 122 found this helpful.",
      "title": "One of the funniest shows on television.",
      "content": "There hasn't been a show in the world that makes me laugh as hard or as often than It's Always Sunny in its prime. Seasons 1 through 5 have some of the best, sharpest comedy writing in ages. Since then, the show hasn't been as consistently brilliant, but there are gems in every season. The premise is very simple. It's about the life of four Philly bar owners. At least until season 2 brings in the father of siblings Dennis and Dee, Frank Reynolds, played to perfection by Danny DeVito, where it becomes a fearless fivesome of hilarity. The thing is, these aren't your ordinary people. They're delusional, narcissistic, borderline-psychotic idiots. The show has been described as \"Seinfeld on crack\" and that's about as good a descriptor you can get. The gang are always coming up with ridiculous schemes and stupid ideas which consistently result in awkwardness and belly laughs. One of the best parts of the show is the characters themselves. They come across as shallow douchebags most of the time, because for the most part, they are, but they each have their own distinct personality that mesh so well with the others. Dennis Reynolds is about as close to an everyman that you can get from the gang, and he's a manipulative, insecure, raving sociopath. His sister Dee is almost as depraved but with more self-loathing and less psychopathy. Their father Frank is a rich businessman who traded that life away for living in the slums as a lascivious alcoholic. Specifically, he shares a bed with Charlie, the illiterate, idiot savant wild card of the group. Dennis' roommate Mac is an oblivious closeted homosexual that favors badassery above all else. To put it lightly, they get themselves into some interesting scenarios. Whether they're all together or broken into various group combinations, you can guarantee laughs are to be had.The chemistry between the actors really sells the whole thing. Rob McElhenney, Glenn Howerton, and Charlie Day are geniuses. Their writing, their acting, it's all so natural and infectious that you can't help but get immersed into any zany idea they come up with just to see how the gang comes out the other side. Kaitlin Olson and Danny DeVito are just as much necessary pieces to the cast. The humor ranges from uncomfortable to terribly politically incorrect, and that's the beauty of the show. It takes these \"delicate\" topics and shines a light on them that many people are afraid to address. The first season alone deals with racism, abortion, transsexuals, and child molestation. And no matter the topic, they find a way to make it hard-to-breathe hysterical.I can boast about this show for days, but the fact is you either enjoy the humor or you don't. There's a lot of yelling and plenty of curse words, and it may be grating for newcomers to dip their toes into something like this, especially if they don't know what they're getting into. But for those who do and appreciate clever unrestrained comedy, treat yourself to It's Always Sunny in Philadelphia.Great intro episodes: (#3.9) Sweet Dee Is Dating a Retarded Person - (#2.4) Mac Bangs Dennis' Mom - (#2.3) Dennis and Dee Go on Welfare - (#4.10) Sweet Dee Has a Heart Attack - (#4.12) The Gang Gets Extreme: Home Make Over Edition - (#6.3) The Gang Buys a Boat"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8575164",
      "warningSpoilers": false,
      "date": "29 September 2022",
      "rate": "10",
      "helpful": "46 out of 49 found this helpful.",
      "title": "One of the best comedies ever created!",
      "content": "It's Always Sunny In Philadelphia is absolutely, without a doubt, the greatest comedy ever created! You would think that after 15 incredible seasons that it would start to get stale but it hasn't...EVERY season is just as hilarious as the others. It's amazing that show going into its 16th season hasn't gone stale yet but every year it's still as good as the one before and every year I still look forward to this wonderful show. The entire cast is so incredibly funny it's hard to say who's the best, they are all equally talented and equally hilarious. The 5 of them have literally become their characters and make it look so easy, you can tell they're all having a great time doing this show. That's why it's been on so long. Love this show so much!"
    },
    {
      "username": "UniqueParticle",
      "userUrl": "https://www.imdb.com/user/ur34836174",
      "reviewLink": "https://www.imdb.com/review/rw8510550",
      "warningSpoilers": false,
      "date": "3 September 2022",
      "rate": "10",
      "helpful": "34 out of 36 found this helpful.",
      "title": "I absolutely love this show!",
      "content": "Been awhile since I watched the show probably a couple years. Plenty of entertainment, brilliant comedy, perfect comedy, wonderful music and constant great scenes most of which are fun! Some of it is bonkers even weird at times but in a good way. I can't believe I stopped watching for awhile I love the main group pure blast. Charlie Day is magnificent any episode where he's in a lot is perfect. I wish I could hangout with anyone as fun as the cast. A little bit can be extreme yet works so well. Easily one of the funniest shows out there, I don't watch comedy enough it's really wholesome. I think it's great how Charlie Day is married to his crush in real life."
    },
    {
      "username": "I_saw_it_happen",
      "userUrl": "https://www.imdb.com/user/ur15744922",
      "reviewLink": "https://www.imdb.com/review/rw2268064",
      "warningSpoilers": false,
      "date": "22 June 2010",
      "rate": "9",
      "helpful": "196 out of 215 found this helpful.",
      "title": "The best 'dark comedy' on TV",
      "content": "This is a genuinely funny show, well worth watching, and deserving of it's high ratings on this site. It's compared to South Park for a number of reasons, most notably the enthusiasm with which it tackles socially sensitive issues and assaults them with the most extremist brands of political incorrectness --- but whereas South Park always tries to tidy up it's mess and make sure the audience knows the distinction between right and wrong, this show revels in the depravity and insanity of it's sociopathy. And it works amazingly well.Since it's a situational comedy, there's not much to say about it without giving away the goods, but the actors all work better than any cast I've seen in a long time. It really seems like half the show is improvised and that the cast is talented enough to make it work without a hitch. The first few episodes are definitely the weakest, but still stronger than just about any comedy out there.Highly recommended."
    },
    {
      "username": "jellyneckr",
      "userUrl": "https://www.imdb.com/user/ur0668022",
      "reviewLink": "https://www.imdb.com/review/rw1155159",
      "warningSpoilers": false,
      "date": "21 August 2005",
      "rate": "",
      "helpful": "184 out of 228 found this helpful.",
      "title": "The best show currently on cable TV!",
      "content": "I have said it before, but one of the joys of summer is watching summer shows , knowing that they aren't being given even the slightest chance of survival. In most cases, these shows are being deservingly dumped in the summer because most of them are terrible. Surprisingly, \"It's Always Sunny in Philadelphia\", which premiered earlier this month, is not terrible. Even though it seemed like it might have been, it ended up being one of the better shows to come along so far in the 2000s. The show is about four friends who own a bar in Philadelphia. At first glance, it doesn't seem like anything special. The owning a bar scenario has been done several times before in a variety of other sitcoms including \"Cheers\" and the recently canceled \"Grounded For Life\". However, since the show is more clever and much funnier than the previous sitcoms who have used the device, one can forgive the lack of originality.What makes \"It's Always Sunny in Philadelphia\" better than any other of the sitcoms that are on today is the clever writing. The writing on sitcoms these days is beyond awful. The writing on \"It's Always Sunny in Philadelphia\" is great. In fact, if the show doesn't receive an Emmmy nomination for writing, there is no justice in the world. The three episodes that have aired so far have been incredibly well written and unlike with most sitcoms, the dialogue doesn't seem like typical sitcom dialogue. The dialogue comes across as natural as opposed to coming across as forced like on network sitcoms and other cable comedies. The writers are also the stars and executive producers of the show, which gives them almost complete control. Let's hope the writing staff doesn't change. I'd give \"It's Always Sunny in Philadelphia\" 9/10. It's one of the best shows one is ever likely to see on cable."
    },
    {
      "username": "BoredMovieWatcher",
      "userUrl": "https://www.imdb.com/user/ur159206804",
      "reviewLink": "https://www.imdb.com/review/rw8694795",
      "warningSpoilers": false,
      "date": "25 November 2022",
      "rate": "10",
      "helpful": "31 out of 33 found this helpful.",
      "title": "The best sitcom ever made",
      "content": "This ain't your usual sitcom. No punchy plain jokes. No laugh track every 10 seconds. Just a comedic show about 5 losers who work at their own bar.IASIP is absolutely hilarious. Each character has their own delusional traits that really makes the show colorful. Dennis is narcissistic, Charlie is illiterate, Mac has a thing for Dennis and men's physique., Dee is a bird, and Frank is a millionaire who chose to live like a rat.The true comedic value in the show is how they interact with each other and somehow ruin other people's lives. I also think the show has its comedic value because they don't add any of those unnecessary laugh tracks to make the audience laugh."
    },
    {
      "username": "ambusched94",
      "userUrl": "https://www.imdb.com/user/ur149648255",
      "reviewLink": "https://www.imdb.com/review/rw8392029",
      "warningSpoilers": false,
      "date": "1 August 2022",
      "rate": "10",
      "helpful": "23 out of 25 found this helpful.",
      "title": "God I love this show so much. One of my top favorite sitcoms",
      "content": "Irreverent, cynical, and politically incorrect humor is my cup of tea. All the characters are a mix of likable and detestable. But that's the whole point. These five characters are supposed to be extremely flawed, shallow, narcissistic, nonsensical people, which is true to life for over half of the population if not more. They're also relatable and I love the social, political, cultural commentary in some of the episodes, where it's quite subtle and never borders on pandering. I love and enjoy each of the five characters, each bringing their own zany, humorous, pessimistic side to the gang. The cast chemistry is perfect as well!It's Always Sunny is in my top 5 favorite shows of all time. Highly recommended if you love irreverent, dark humor sitcoms!"
    },
    {
      "username": "Amthermandes",
      "userUrl": "https://www.imdb.com/user/ur9755277",
      "reviewLink": "https://www.imdb.com/review/rw7387581",
      "warningSpoilers": false,
      "date": "28 September 2021",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "Priceless antics of the biggest village idiots, and worst human beings in the Delaware valley",
      "content": "Tired of always rooting for the \"good guy\" in film and tv? Did you always wish the characters in \"Friends\" were all villainous, treacherous a-holes who would be willing to screw over their family members if it meant achieving something so petty as getting revenge against a frat house for a rivalry THEY THEMSELVES started? Do you enjoy \"instant karma\" videos, and videos of irony?If your answer if \"yes\" to any of that, then IASIP is YOUR show. Who needs protagonists? Hell, who needs ANTI-HEROES. This is a show all about the lowlifes, the thieves, the criminals, the idiotic rascals. This is a show where stupid plays \"chicken\" with ego. This is a satisfying, HILARIOUS show where terrible people constantly screw themselves over (as well as each other), so you have nobody really to root for, but just laugh at the absurdity that these morons get themselves into.The characters are ridiculous, but honestly not all that unrealistic. They share common traits with SO many people in society, including celebrities, politicians (the Clinton family, anyone?), co-workers, maybe even close friends or family members. It's relatable, and vicarious as you watch these freak-show hacks make the most pathetic and laughable attempts to impress those around them, only for their plans to usually backfire in their faces. It's satisfying, funny, and weirdly charming.The actors do an amazing job not taking it seriously, while taking their jobs seriously. You can't help but hate loving them. Or love hating them? The show may drive some people nuts, and that's totally understandable. But man, it's such a ridiculous show, if you know how to not take a show seriously, this is the greased watermelon. The show, where you love to see people fail.And man, the opening scenes that set up the episode titles are so fekkin SOLID! I laugh almost EVERY time that episode title pops up. This is like the modern-day, edgy Monty Python."
    },
    {
      "username": "gusdanjaq",
      "userUrl": "https://www.imdb.com/user/ur18240986",
      "reviewLink": "https://www.imdb.com/review/rw2528328",
      "warningSpoilers": false,
      "date": "5 December 2011",
      "rate": "10",
      "helpful": "138 out of 148 found this helpful.",
      "title": "Can sociopaths be considered as funny?",
      "content": "Well TV sociopaths can indeed. In the same fashion as Seinfeld and Arrested development, this show deals with a group of unlikeable misfits while they engage in moronic adventures based in equally moronic impulses. The difference with those spiritual predecessors is that Sunny takes it a step further. As the tagline of the show indicates (\"Seinfeld on a crack) the writers of this show not only embrace the selfishness of their characters but takes it a step further by completely severing their social awareness and empathy towards other human beings. The result, needless to say, is not only sometimes disturbing, but utterly hilarious. Here is a small introduction of each one of the characters:-Dennis Reynolds: A malignant narcissist in its truest form. Dennis believes he is the closest to physical perfection a human can achieve. A reputed ladies man, he is not above using alcohol, lies, emotional abuse and even the implication of danger (if they say no) to get girls in bed with him. He shows great amusement by watching how other people might get hurt by his actions, even if those people are his friends or his sister (who he constantly refers to as a bitch). -Mac: Dennis's best friend and roommate, he equally enjoys to be part of the gang's plans even if that means hurting or offending innocent people. He even benefits from Dennis's system to pick up and seduce girls, because Dennis let's Mac hit on them when he gets bored with them. Mac believes himself a skilled martial artist (Even if he has not taken one lesson in his whole life) and enjoys resolving problems with violence or vandalism.-Charlie: Although equally impulsive and alcoholic as the other's in the gang in many ways, he is the only one who has shown he has some empathy for his fellow human being. He spends his time drinking beer or huffing glue (yes, he huffs glue). Being the most naïve from the group he is easily manipulated by the others, although he has shown he isn't above manipulating them either. He is highly resentful and is prone to violent outbursts.-Deandra \"Sweet Dee\" Reynolds: Dee is as manipulative ad his brother and has been shown as only motivated by her own agenda. She is heavily picked on by the others on the gang because of their misogynistic views. Although as the other characters of the group, specially his brother, she shows no regard for how other people might be getting affected by her actions. She is highly vindictive and she goes to great lengths to make sure her schemes and her lies are being bought by the people involved.-Frank Reynolds: An impulsive, violent and eccentric ex-millionaire he is highly delusional and carries a gun all the time. His likes include prostitutes, drugs and ham (Yes, ham). He is highly irrational and is always looking to crazier and more idiotic ways to deal with the possible issues that might arise for the gang.This show appeals to your inner child in the way that this characters really have the mental development of a child, and you will find hilarious how they will impulsively engage in idiotic plans without showing any preoccupation of how the consequences could be for them, their friends or for the people unfortunate enough to get involved with them. Is a refreshing show because it is one of the first comedies that embraces the darkness of its characters and the comedic possibilities of having a group of alcoholic, impulsive, borderline criminal, but dim witted protagonists. These are highly unlikeable people, and their humor might offend you in one way or another, but mark my words: You will enjoy every minute of it."
    },
    {
      "username": "geeboy37",
      "userUrl": "https://www.imdb.com/user/ur6653338",
      "reviewLink": "https://www.imdb.com/review/rw5479371",
      "warningSpoilers": false,
      "date": "12 February 2020",
      "rate": "9",
      "helpful": "40 out of 45 found this helpful.",
      "title": "One of the best comedies of our lifetime",
      "content": "This is one of the most consistently funny shows I think I ever have seen and I say that after watching another hilarious season(14). I personally re watched the whole series recently over a course of a month and its even better when you have that kind of continuity since everything is connect. There are only two other shows that Ive seen(in my lifetime) that are this consistently funny; Seinfeld and Curb. But to Its Always Sunny's credit they have made way more seasons and compared to Curb in a shorter amount of time."
    },
    {
      "username": "dlracer2",
      "userUrl": "https://www.imdb.com/user/ur44298822",
      "reviewLink": "https://www.imdb.com/review/rw8223956",
      "warningSpoilers": false,
      "date": "10 June 2022",
      "rate": "10",
      "helpful": "21 out of 23 found this helpful.",
      "title": "A Timeless Treasure of Raunch",
      "content": "When Always Sunny first came out, I didn't quite \"get it\". It felt like improvisational sketch comedy where the performers were always trying to one-up each other and maybe that's what it is?This dysfunctional sitcom rarely hits without maximum impact and it's character performers have a chemistry that is a real gift to behold.Danny Devito relishes in experimenting with new and bizarrely wonderful shock comedy. The Gang is always reaching new levels of horrible behavior and it's perfect. This show is so far ahead of everything else that I wonder if anyone can ever top it.It's the funniest show ever made. And it's completely brilliant."
    },
    {
      "username": "kylebrown0209",
      "userUrl": "https://www.imdb.com/user/ur22249556",
      "reviewLink": "https://www.imdb.com/review/rw8467719",
      "warningSpoilers": false,
      "date": "19 August 2022",
      "rate": "9",
      "helpful": "24 out of 27 found this helpful.",
      "title": "Very funny TV series",
      "content": "As a big fan of this kind of general I have to tell you this is by far one of the funniest shows I've ever seen I highly recommend it It's definitely worth watching."
    },
    {
      "username": "blanbrn",
      "userUrl": "https://www.imdb.com/user/ur9927546",
      "reviewLink": "https://www.imdb.com/review/rw2177541",
      "warningSpoilers": false,
      "date": "20 December 2009",
      "rate": "9",
      "helpful": "27 out of 32 found this helpful.",
      "title": "Crude, rude, funny, hilarious and far out pushes the comedy limit. Shows you don't have to be serious in life, one of TV's best!",
      "content": "Over the years on FX I would tune in and catch an episode of \"It's Always Sunny in Philadelphia\" from time to time. Only eventually it would be just like getting hooked on something as now I'm a faithful viewer of the series it's just like a religion. And who wouldn't be hooked the series it pushes the envelope it's far out funny and crude and rude as it just doesn't give a hoot and all of the characters are risk takers and speak it like it is about the world as I agree with them it's time we come down on this society more as it's became to much of a yes man and politically correct one. And the chemistry between the actors and guest is top notch. As it's a watch for the legendary Danny Devito who shines here as he proves he's not to good to do a cable comedy sitcom after being in many big screen movies it doesn't affect his legendary status.Anyhow it was created by Rob McElhenney(who plays Mac)and many episodes were directed by Fred Savage(\"The Wonder Years\")as it's set in the city of brotherly love Philadelphia, PA. And always the opening sequences get you into the mood well by showing city landmarks from Market Street, the Rocky statue, and Lincoln Financial Field. So you feel that Philly freedom! The plot and storyline aside from just four grown friends having a ball of fun, is centered around Danny Devito who as Frank Reynolds is still in Philadelphia with his two grown kids Dennis(Glenn Howerton)and Dee(Kaitlin Olson)and they hang out with Charlie(Charlie Day)and Mac(Rob McElhenney)who are two grown slacker men who've been friends since childhood. And all four of the grown adults gets their kicks and meetings together at the Irish pub bar they run called \"Paddy's\".And thru the years the series has provided some funny and crazy moments of themes that center around road trips, medical problems, relationship problems, alcohol contests with rival bars, stalking, protest, crazy inventions, illegal immigration, and just down right good old funny fashioned fun with the gang pushing the limits and rules of not only just the law but society also. Overall this series is never boring or dull with it's wacky and crazy far out themes that's what makes it so watchable and likable is that it's different! Really a wonderful series one of the best on TV as it proves with it's comedy and raunchy fun that it's okay to be crude, rude, and outspoken in a crazy and envelope pushing way! Glad to see a show that speaks to society in a blunt and feel good fashion proving not to take life serious as it's okay to have fun your way. So be ready and remember \"It's Always Sunny in Philadlephia\" as it's good and nice to look at the cool and crummy side of life!"
    },
    {
      "username": "angelorwez",
      "userUrl": "https://www.imdb.com/user/ur150272282",
      "reviewLink": "https://www.imdb.com/review/rw8099270",
      "warningSpoilers": true,
      "date": "28 April 2022",
      "rate": "8",
      "helpful": "17 out of 19 found this helpful.",
      "title": "brilliant",
      "content": "It's pretty good...upto around the 6th seasonthat's when you start to feel like you've seen everything you need to have seenCharlie gets too dumb...the jokes don't land...it's gets a little too moronicthe first six seasons though...brilliant!!....comedy at its finest!!!"
    },
    {
      "username": "MuttleyAndTheHeliumGang",
      "userUrl": "https://www.imdb.com/user/ur68905245",
      "reviewLink": "https://www.imdb.com/review/rw8205848",
      "warningSpoilers": false,
      "date": "4 June 2022",
      "rate": "",
      "helpful": "16 out of 18 found this helpful.",
      "title": "This is the show I'd been missing",
      "content": "Have picked up on some \"It's Always Sunny in Philadelphia\", getting ready to indulge whatever it throws my way, until this point I'd seen episodes 1-4 back in 2019. Must have been before I turned to teetotalism or something cuz for the life of me I do not remember them. So I started with episode five but before six went back and watched 1-4 again. All I remember is the little things here and there, Netflix had me at the end of season one episode four that's how I knew where I was. Anyway, I've laughed a good amount, believe me when I say this is the perfect type of comedy for me. As someone who's quite critical of your generic laughtrack comedies and derivative humour devoid of actual substance and thought, the bland mediocre stuff churned out like poor man's butter, I'm please to write this is the new comedy for me. I'm now on episode one of season two, having finished season one which was so good especially those last couple episodes. Absolutely brilliant comedy. Danny DeVitos the icing on the cake, the cast is now complete, it is now whole. The characters, The Gang, are hilarious. They're vile, narcissistic, petty, and really funny. They're all so good that I struggle to even try and choose my favourite here. I was thinking maybe Charlie or Mac, but Dennis is great, Dee is great, and now we have Frank. These guys are way funnier and actually more likeable then those in Friends, the trash that is Everybody Loves Raymond, yes even you Seinfeld as well. Because this is more dark, shallow, offensive and human. Humans are great people but we're also selfish as**holes, are we not? The thing is, I like many out there deal physically and mentally everyday with my own problems and for lack of a better phrase, my own poorly subjected health, so I can relate to many of the daring and absurd and triggering things these dudes and gal are doing in order to get their own way, what they want, basically for them to win. It's typical dark comedy but as of right now I feel it's done right. No laugh track forced fake laughter, subtle dark comedy and subject matter but also aloud in a way that's amusing and hilarious without feeling contrived or stale or recycled, comedy that's both subtle and like an outburst of its own severe knows-no-bounds type, a likeable cast and they're doing morally wrong things but how they do it, and why they do it, is actually shown and not just tossed in as a means of \"we'd better mention something quick and not treat our audience like idiots,\" and isn't relying on bored, unfunny, tiresome, reference-mentioned-every-second like tBBT or something, it actually clearly is more plausible, realistic and bold. The egotistical gang surely outranks the gang of six in Friends, the very very obnoxious loud and unfunny gang of five to eight in tBBT, I'm starting to think they're gonna become my number one. The friends in HIMYM are pretty good gang of mostly funny characters, but this already takes it to new heights for me. I wish I'd started watching this years back, way back when like 2010 or something. But it's all fresh to me, excluding season one, and I've loved it thus far. Usually I enjoy British stuff, The IT Crowd, Father Ted, Only Fools and Horses, Fawlty Towers, Blackadder, The Inbetweeners, Black Books, Mr Bean, and The Office (UK) are all and I genuinely mean this, they're all fantastic. But the US has Curb Your Enthusiasm, My Name is Earl, Friends (I only like seasons 1-5 but it's worth mentioning), HIMYM and this, this masterpiece It's Always Sunny in Philadelphia. This show, which I have only seen eight episodes of (but the first 4 episodes as aforementioned I've seen twice each) is just terrific viewing. Excellent, really really great stuff."
    },
    {
      "username": "nicorip22",
      "userUrl": "https://www.imdb.com/user/ur47190847",
      "reviewLink": "https://www.imdb.com/review/rw6281357",
      "warningSpoilers": false,
      "date": "17 November 2020",
      "rate": "9",
      "helpful": "11 out of 12 found this helpful.",
      "title": "A hidden gem",
      "content": "I can't believe this TV show doesn't have more hype, it's incredibly good. It is much better than all the sitcoms out there in the loop. I can not stop laughing. All the actors do a very good role, but I have to highlight Charlie Day, it's great everything he does make you laugh and what to say about Danny DeVito, he's a genius of comedy. If you like black humor jokes, this TV show is for you. If you really liked it, let this know."
    },
    {
      "username": "jjcuccio",
      "userUrl": "https://www.imdb.com/user/ur88999407",
      "reviewLink": "https://www.imdb.com/review/rw8135917",
      "warningSpoilers": false,
      "date": "12 May 2022",
      "rate": "10",
      "helpful": "19 out of 20 found this helpful.",
      "title": "Hooked from the first episode",
      "content": "I was lucky enough to stumble upon this gem of a show when the first episode aired and have been hooked on it since. I am not a big comedy fan as too many shows either take themselves too seriously or they are too safe. This is just pure ridiculous comedy that helps you to sit back and disconnect from reality for a little bit.If you love this show, you need to watch the funny \"The Mick\""
    },
    {
      "username": "shanekraus",
      "userUrl": "https://www.imdb.com/user/ur90727779",
      "reviewLink": "https://www.imdb.com/review/rw8470599",
      "warningSpoilers": false,
      "date": "20 August 2022",
      "rate": "8",
      "helpful": "24 out of 29 found this helpful.",
      "title": "My favorite show of all time",
      "content": "This is the funniest tv show of all time. It's an AMAZING dark comedy! All of the characters are excellent (especially Dennis). Glenn Howerton is the best actor in the show. Always sunny has a hilarious first few seasons. Around season 10 the show drops in quality. It's always sunny in Philadelphia is amazing for seasons 2-4. The Nightman Cometh is the funniest thing I've ever seen. Season 13 is the worst season but mac's dance scene is one of the greatest moments in tv history. Overall, this is one of the most consistent shows ever in terms of quality. Still, the early seasons are better than the later ones."
    },
    {
      "username": "deloudelouvain",
      "userUrl": "https://www.imdb.com/user/ur58525162",
      "reviewLink": "https://www.imdb.com/review/rw3182620",
      "warningSpoilers": false,
      "date": "13 February 2015",
      "rate": "10",
      "helpful": "21 out of 26 found this helpful.",
      "title": "Best comedy ever!",
      "content": "This series is by far my all-time favorite show. Absolutely everything is good about this show. Every character is hilarious. The first season without Danny Devito started a little slow but was already good. But then when Danny Devito made his first appearance it all got even better. They make fun about absolutely everything, even the things that you are normally not supposed to laugh with. But the best humor is this kind of wrong humor and I think you should laugh with everything. Every year I am waiting with impatience for the new season to begin and I hope that they will never cancel this show. For some reason that is unknown to me here in Belgium not many people know about this series so I make sure to tell everybody about it because this is really a series that everyone should watch. I just wished that the McPoyles would appear a bit more in the episodes because the best episodes are the ones with them in it, especially the one about \"Bath Salts\". I can only recommend this series to everybody. This is a must watch!"
    },
    {
      "username": "sammielimehouse-84658",
      "userUrl": "https://www.imdb.com/user/ur131181825",
      "reviewLink": "https://www.imdb.com/review/rw7005243",
      "warningSpoilers": false,
      "date": "6 June 2021",
      "rate": "9",
      "helpful": "18 out of 21 found this helpful.",
      "title": "Definitely One of the Most Underrated Sitcoms of All-Time",
      "content": "I am so surprised this show isn't talked about more on the internet. I understand the show has a small audience, but this show is a amazing! While it definitely starts to slow down after season 12 or so, this show is still running strong after it's 14th season. I am honestly amazed this show is still pumping out good episodes, despite it's longevity. I can't wait for season 15, I hope it's great, and I hope this show gets more recognition.8.5/10."
    },
    {
      "username": "caitlinbromley",
      "userUrl": "https://www.imdb.com/user/ur107654363",
      "reviewLink": "https://www.imdb.com/review/rw8766310",
      "warningSpoilers": false,
      "date": "29 December 2022",
      "rate": "10",
      "helpful": "31 out of 32 found this helpful.",
      "title": "Best Comedy Series I've Watched In Years",
      "content": "This is by far the funniest Comedy sitcom I've seen in years, if your the type of person who isn't offended easily it's definitely worth watching either by yourself or your mates, I've just started binge watching it from the beginning as I'd only ever seen different episodes from the different series. I highly recommend this show to anyone who wants a good laugh or may need cheering up. It has stupid jokes, hilarious pranks & a great choice in cast, I'm so pleased I chose to watch this show, it's very addictive & I can't stop watching, I definitely have a fair few favourite episodes & everytime I watch it I can't stop laughing."
    },
    {
      "username": "ssvfolder-1",
      "userUrl": "https://www.imdb.com/user/ur18073308",
      "reviewLink": "https://www.imdb.com/review/rw2359467",
      "warningSpoilers": false,
      "date": "27 December 2010",
      "rate": "9",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Ingenious perverted show!!!",
      "content": "My god this show is brilliant. Despite its long run on TV, it did not get as much buzz as \"how I met you mother\" or \" The big bang theory\". I must admit that in a first look, this show is missing some kind Hollywood shine - as most of other comedy shows, but once you start to watch it, you get really addicted to this a bit perverted, black comedy. The best example of it is episode 4 from season 2, where they all trying to screw each others mind by using all means necessary. I like it how the show covers this black humor with day to day life. The cast is brilliant and suits perfectly to characters. Mac - semi psychopath with innocent face, Dennis - a bit snobby gang leader, Charlie - the idiot loser capable to the most elaborate schemes, D who tries to be better than the rest of the gang, yet still sinks to their level ever time. Let us not forget Frank , the father of D and Dennis. Despite the Danny DeVito's more conservative approach to comedy, his presence does adds up to the show, With his appearance, the show got much much better. In conclusion - watch it, love it, enjoy it because it's great!"
    },
    {
      "username": "ScottPilgrimReviews",
      "userUrl": "https://www.imdb.com/user/ur125018562",
      "reviewLink": "https://www.imdb.com/review/rw6161571",
      "warningSpoilers": false,
      "date": "9 October 2020",
      "rate": "10",
      "helpful": "186 out of 201 found this helpful.",
      "title": "Best show of all time",
      "content": "If this show doesn't blast your nips off we have nothing to talk about. Jabroni."
    }
  ],
  "errorMessage": ""
}