{
  "imDbId": "tt2100976",
  "title": "Impractical Jokers",
  "fullTitle": "Impractical Jokers (TV Series 2011– )",
  "type": "TVSeries",
  "year": "2011",
  "language": "en",
  "titleInLanguage": "Impractical Jokers",
  "url": "https://en.wikipedia.org/wiki/Impractical_Jokers",
  "plotShort": {
    "plainText": "Impractical Jokers is an American hidden camera reality show with improvisational elements. Produced by NorthSouth Productions, Impractical Jokers premiered on truTV on December 15, 2011, starring the members of The Tenderloins: James \"Murr\" Murray, Brian \"Q\" Quinn, Sal Vulcano, and Joe Gatto. Starting with the tenth season, the series airs concurrently on TBS.\r\nImpractical Jokers' tenth season premiered on February 9, 2023. The series' tenth season features a rotating group of guest comedians instead of Gatto, who left the show halfway through Season 9. A feature-length film was theatrically released on February 21, 2020.",
    "html": "<p>Impractical Jokers is an American hidden camera reality show with improvisational elements. Produced by NorthSouth Productions, Impractical Jokers premiered on truTV on December 15, 2011, starring the members of The Tenderloins: James \"Murr\" Murray, Brian \"Q\" Quinn, Sal Vulcano, and Joe Gatto. Starting with the tenth season, the series airs concurrently on TBS.</p><p>Impractical Jokers' tenth season premiered on February 9, 2023. The series' tenth season features a rotating group of guest comedians instead of Gatto, who left the show halfway through Season 9. A feature-length film was theatrically released on February 21, 2020.</p>"
  },
  "plotFull": {
    "plainText": "Impractical Jokers is an American hidden camera reality show with improvisational elements. Produced by NorthSouth Productions, Impractical Jokers premiered on truTV on December 15, 2011, starring the members of The Tenderloins: James \"Murr\" Murray, Brian \"Q\" Quinn, Sal Vulcano, and Joe Gatto. Starting with the tenth season, the series airs concurrently on TBS.\r\nImpractical Jokers' tenth season premiered on February 9, 2023. The series' tenth season features a rotating group of guest comedians instead of Gatto, who left the show halfway through Season 9. A feature-length film was theatrically released on February 21, 2020.\r\nOverview\r\nA typical episode is a series of competitive games of dares in which each cast member, or \"joker\", receives either a thumbs up or thumbs down for his performance. At the climax, the joker who tallied the most thumbs down is the loser and is thereby subjected to a \"punishment\". The games are contrived scenarios in which one joker is challenged to embarrass himself by engaging with unwitting members of the general public, receiving commands from the other jokers who are orchestrating and surveying the bizarre scenario from behind the scenes with covert surveillance equipment. The most common premise is that a joker will immediately lose a challenge if he refuses to follow any instructions given by the other three. Some games involve all four jokers competing at once to be the first to reach a stated goal.\r\nThe intro describes the show as \"scenes of graphic stupidity among (four) lifelong friends who compete to embarrass each other.\" The games are loosely structured, relying heavily upon improvisation. The show's comedic themes range from witty dialogue to slapstick routines, with the reactions of both the jokers and the members of the public serving as punchlines.\r\nDevelopment\r\nJoe Gatto, James \"Murr\" Murray, Brian \"Q\" Quinn and Sal Vulcano are four friends and former classmates from Monsignor Farrell High School in Staten Island, New York. Gatto, Murray and Vulcano were original members of the live improv and sketch comedy troupe the Tenderloins in 1999. They transitioned to producing more comedy material on the internet, with Quinn replacing former Tenderloin Mike Boccio in 2006. In 2007, the Tenderloins won the $100,000 grand prize in NBC's It's Your Show competition.\r\nIn 2008, they filmed a pilot episode for a scripted sitcom for Spike TV, but the show did not go to series. TruTV announced Impractical Jokers, originally slated to be named Mission: Uncomfortable, on April 12, 2011, eight months before the show's debut. Murray explained how the hidden camera format made sense based on the jokesters' skills. \"We needed to find the right format... thing is, we've been doing this for years, but when it's on camera, the embarrassment is amplified.\" Vulcano said \"We wanted to utilize our improv strengths … put ourselves into a situation where we know we can be funny and also ourselves. If we’re ourselves and also showcase our friendship, something might resonate there.\" The concept of feeding each other lines using an earpiece was inspired from talk show host David Letterman feeding neighboring storeowner Rupert Jee lines on Late Show with David Letterman. Quinn and Vulcano have said when they gave their pilot episode to TruTV, it was recorded on their iPhones. At the time that they pitched the idea to TruTV, Murray was VP of Development for NorthSouth Productions, the company that has produced the series since its inception. Murray describes the show as an \"upside-down hidden-camera show where the joke is on us, instead of the public. So it takes away the thing people hate about hidden-camera shows, which is, 'Oh, I feel bad for the people getting pranked.' We're messing with each other. The public is just there to witness our embarrassment.\"\r\nOn December 31, 2021, Joe Gatto announced on his Instagram that he would be leaving Impractical Jokers after nine seasons. Shortly thereafter, Quinn, on behalf of Murray and Vulcano, sent well wishes for Gatto and announced that Impractical Jokers would continue working despite Gatto's absence in 2022. Subsequently, Paste reported that TruTV and HBO Max had removed \"several episodes featuring Gatto in compromising situations\" from their platforms. On February 14, 2022, the show announced that the season would proceed with a lineup of various celebrity guests.\r\nChallenge format\r\nPrior to every challenge, the Jokers explain where they are, what the challenge is. Often (but not always) the cast member(s) performing the prank wears an earpiece, while the others have a mic in a covert location. Cameras are hidden near the area to capture the action. The challenge location is usually a public area in or around New York City such as a city park, or store. The criteria of each challenge are the same for each of the Jokers competing in the round. If the Joker cannot or refuses to complete their task, they get a thumbs-down. At the end of the episode, the Joker(s) with the most thumbs down receives a punishment. The punishments cannot be refused, lest they be kicked off the show, and are usually more embarrassing, humiliating, disgusting, painful, scary, or dangerous than any of the other challenges.\r\nEpisodes\r\nAs of the 2017–18 television season, the series is syndicated to American broadcast stations by Trifecta Entertainment & Media, with a clearance rate of 85% of television homes.\r\nCast\r\nThe cast consists of four long-time friends, collectively on the show referred to as \"Jokers\".\r\nMain\r\nBrian \"Q\" Quinn is an improvisational comedian from the New York City borough of Staten Island. He attended Monsignor Farrell High School, where he was involved in numerous activities, including drama and sports. He attended Brooklyn College and later went on to join the New York City Fire Department. He is the third host of the podcast Tell 'Em Steve-Dave!, which was formerly on SModcast.com.\r\nJames \"Murr\" Murray is an improvisational comedian from the New York City borough of Staten Island. He attended Monsignor Farrell High School there, and was also part of a community theatre. He continued his education at Georgetown University where he received a BA in English. He continues to work at NorthSouth Productions, where he is the Senior Vice President of Development. In 2018, he released a sci-fi/horror book called Awakened, which was co-written by Darren Wearmouth, and revolves around a monster that lives in the subways of New York City. Two sequels, called The Brink and Obliteration, were released on June 18, 2019 and June 23, 2020, respectively. He is married to Melyssa Davies.\r\nSal Vulcano is an improvisational and stand-up comedian from the New York City borough of Staten Island. He earned a degree in Finance from St. John's University. Vulcano is also an ordained minister, and officiated Gatto's 2013 wedding.\r\nJoe Gatto (seasons 1–9) is an improvisational comedian from the New York City borough of Staten Island, where he attended Monsignor Farrell High School. He studied at Long Island Post University where he received a degree in Accounting. He founded the Tenderloins comedy troupe in 1999 and worked at the baby retail store Giggle, until January 2012. He is the first married Joker (one of two), and has two children with his former wife Bessy. On December 31, 2021, Gatto announced on his Instagram that he was parting ways with the Tenderloins and Impractical Jokers to focus more on his personal life and family.\r\nGuest appearances\r\nCelebrities have made appearances in the series:\r\nImpractical Jokers staff have also made appearances:\r\nCasey Jost hosts the Inside Jokes segments, and some of the behind-the-scenes antics.\r\nRob Emmer is a production assistant and actor that appears in some of the challenges in different roles.\r\nJoe Imburgio is a producer on the show, and appears in some of the challenges and behind-the-scenes antics.\r\nInternational versions\r\nA British version of Impractical Jokers began airing in winter 2012 on BBC Three. It starred comedians Paul McCaffrey, Joel Dommett, Marek Larwood and Roisin Conaty. The pilot was filmed and placed online as part of \"The Comedy Kitchen\" in 2012. The first series included six episodes, which aired from November 15 to December 20, 2012. The second series also included six episodes, and aired from February 24 to April 2, 2014. It was produced by Yalli Productions. It was cancelled after Series 2 in April 2014, mainly due to its unpopularity. However, more recently, Comedy Central and Channel 5 picked up the rights to co-produce a third season of Impractical Jokers UK with Yalli Productions, starring Late Night Gimp Fight. It aired from 2016 - 2017.\r\nA Dutch version was broadcast on Veronica TV in 2012, called De Fukkers. In 2015 a new version started at RTL 5, named Foute Vrienden. The series ran for 5 seasons, ending in 2019. A third All-Female version started in 2018 called Foute Vriendinnen.\r\nA Belgian (Flemish) version broadcast on 2BE in the fall of 2012, titled Foute Vrienden. James Murray appeared in episode 5 of the first season. The second season, which started in March 2014, included 10 episodes.\r\nA Brazilian version is currently being broadcast on SBT titled Amigos da Onça. The series premiere aired on January 7, 2013 and ended on August 13, 2013. James Murray appeared in episode 3 of the second season.\r\nA Lebanese version was broadcast on Al Jadeed in the fall of 2013.\r\nA Mexican version broadcast on TBS Latin America started on May 20, 2015 with the title Impractical Jokers.\r\nA Greek version was broadcast on Ant1 in February 2014 with the title Wanted.\r\nA French-language Canadian version was broadcast on V on February 24, 2014 with the title Les Jokers.\r\nA Swedish version was broadcast on TV6 in April 2014 with the title Radiostyrd.\r\nA Spanish version was broadcast on Neox in 2014 with the title Sinvergüenzas.\r\nAn Egyptian version was released in 2015 with the title Al Mohayesoun.\r\nA Russian version was broadcast on Che in 2018 and 2019 with the title Shutniki (Шутники)\r\nCritical reception\r\nImpractical Jokers has been well received by most critics, with Linda Stasi of the New York Post calling it \"possibly the funniest, most ridiculous show I've seen in years.\"\r\nWhile it has been compared to earlier hit prank shows such as Candid Camera and Jackass, critics have offered praise for its unique twist on the genre, wherein the stars' reactions to the pranks are often equally as humorous as those of the innocent bystanders. Neil Genzlinger of The New York Times stated that \"the gag pays off twice: once in the reaction of the unsuspecting passer-by, once in the discomfort of the fellow doing the asking.\" He later wrote that the cast-members' occasional integrity \" these four clowns a little bit lovable.\" Dean Robbins of The Daily Page echoed this sentiment, stating that \"the friends are jovial rather than Jackass-obnoxious, even rejecting some dares as too offensive.\"\r\nThe series has been generally well received, garnering 1.5 million viewers during its December 15, 2011, premiere.\r\nThe review of the show by Variety's Brian Lowry was less positive, ending with this statement: \"Nobody will ever confuse Impractical Jokers with high art, certainly, but as low-brow, micro-cost comedy in the context of truTV's programming resources, it's actually quite practical—and occasionally funny.\"\r\nOn February 6, 2023, the borough of Staten Island officially declared the first Monday of every February \"Impractical Jokers Day\" in honor of the tenth season of the show.\r\nSpin-offs\r\nJokers Wild\r\nJokers Wild was a spin-off of the original series in which the guys filmed a different style of skits that differ from ones that they normally film for the show. These skits are story type as opposed to live interaction with people. The first episode of Jokers Wild aired on September 25, 2014. Only four episodes of the six that were filmed for this series ever aired on truTV as the show did not do well in the ratings and was cancelled after the 4 episodes aired.\r\nImpractical Jokers: Inside Jokes\r\nImpractical Jokers: Inside Jokes is a spin-off of Impractical Jokers in which episodes that have already aired are shown again with pop-up facts throughout, including behind-the-scenes stories and facts directly from the Jokers. The first episode of Impractical Jokers: Inside Jokes aired on July 14, 2016, following the mid-season British special.\r\nImpractical Jokers: After Party\r\nImpractical Jokers: After Party is an aftershow hosted by Joey Fatone, in which the Jokers and surprise guests go through a deep dive of challenges, special play-by-play punishment analysis from the latest episode, and bonus content from the latest episode or the whole show. The first episode of the series aired on August 3, 2017, after the episode \"The Q-Pay\" had aired. After Party is filmed at The Flagship Brewing Company bar in Staten Island. When the series came back on August 2, 2018, the series moved to The Mailroom Bar in Lower Manhattan.\r\nImpractical Jokers: Dinner Party\r\nImpractical Jokers: Dinner Party is a spin-off of Impractical Jokers, in which the Jokers do a video group chat while eating dinner and having guests visit one or more participants. The spin-off was created in response to the COVID-19 pandemic in the United States that prevented Impractical Jokers episodes from being produced. The show's theme song is \"Uzi (Pinky Ring)\" by Wu-Tang Clan. The first episode of the series aired on May 21, 2020. On August 5, 2020, the series was ordered 10 additional episodes and began airing on October 15, 2020. The first season ended on January 14, 2021. At the end of the episode, \"Don't Stop Believin' \" by Journey plays to commence the return of regular episodes.\r\nFilm\r\nOn March 7, 2018, truTV announced that Impractical Jokers was renewed for an eighth season and a feature-length film to begin development in spring 2018, directed by Chris Henchy and produced by Funny or Die. Production on the film began at the end of April 2018. A trailer was released on December 17, 2019, and the movie was released on February 21, 2020.\r\nOther media\r\nTruTV and Built Games developed a mobile game called Impractical Jokers: Wheel of Doom, released in 2018. Wilder Games developed a party game series including Impractical Jokers: Box of Challenges and Impractical Jokers: Ultimate Challenge Pack that were released in 2020.\r\nThe Official Impractical Jokers Podcast started in 2017, hosted by producers Casey Jost and James McCarthy. Episodes are usually released the day after new episodes have broadcast. Assistant director and producer Chá DeBerry joined the podcast as a host in 2021.",
    "html": "<p>Impractical Jokers is an American hidden camera reality show with improvisational elements. Produced by NorthSouth Productions, Impractical Jokers premiered on truTV on December 15, 2011, starring the members of The Tenderloins: James \"Murr\" Murray, Brian \"Q\" Quinn, Sal Vulcano, and Joe Gatto. Starting with the tenth season, the series airs concurrently on TBS.</p><p>Impractical Jokers' tenth season premiered on February 9, 2023. The series' tenth season features a rotating group of guest comedians instead of Gatto, who left the show halfway through Season 9. A feature-length film was theatrically released on February 21, 2020.</p><br/><h3>Overview</h3><p>A typical episode is a series of competitive games of dares in which each cast member, or \"joker\", receives either a thumbs up or thumbs down for his performance. At the climax, the joker who tallied the most thumbs down is the loser and is thereby subjected to a \"punishment\". The games are contrived scenarios in which one joker is challenged to embarrass himself by engaging with unwitting members of the general public, receiving commands from the other jokers who are orchestrating and surveying the bizarre scenario from behind the scenes with covert surveillance equipment. The most common premise is that a joker will immediately lose a challenge if he refuses to follow any instructions given by the other three. Some games involve all four jokers competing at once to be the first to reach a stated goal.</p><p>The intro describes the show as \"scenes of graphic stupidity among (four) lifelong friends who compete to embarrass each other.\" The games are loosely structured, relying heavily upon improvisation. The show's comedic themes range from witty dialogue to slapstick routines, with the reactions of both the jokers and the members of the public serving as punchlines.</p><br/><h3>Development</h3><p>Joe Gatto, James \"Murr\" Murray, Brian \"Q\" Quinn and Sal Vulcano are four friends and former classmates from Monsignor Farrell High School in Staten Island, New York. Gatto, Murray and Vulcano were original members of the live improv and sketch comedy troupe the Tenderloins in 1999. They transitioned to producing more comedy material on the internet, with Quinn replacing former Tenderloin Mike Boccio in 2006. In 2007, the Tenderloins won the $100,000 grand prize in NBC's It's Your Show competition.</p><p>In 2008, they filmed a pilot episode for a scripted sitcom for Spike TV, but the show did not go to series. TruTV announced Impractical Jokers, originally slated to be named Mission: Uncomfortable, on April 12, 2011, eight months before the show's debut. Murray explained how the hidden camera format made sense based on the jokesters' skills. \"We needed to find the right format... thing is, we've been doing this for years, but when it's on camera, the embarrassment is amplified.\" Vulcano said \"We wanted to utilize our improv strengths … put ourselves into a situation where we know we can be funny and also ourselves. If we’re ourselves and also showcase our friendship, something might resonate there.\" The concept of feeding each other lines using an earpiece was inspired from talk show host David Letterman feeding neighboring storeowner Rupert Jee lines on Late Show with David Letterman. Quinn and Vulcano have said when they gave their pilot episode to TruTV, it was recorded on their iPhones. At the time that they pitched the idea to TruTV, Murray was VP of Development for NorthSouth Productions, the company that has produced the series since its inception. Murray describes the show as an \"upside-down hidden-camera show where the joke is on us, instead of the public. So it takes away the thing people hate about hidden-camera shows, which is, 'Oh, I feel bad for the people getting pranked.' We're messing with each other. The public is just there to witness our embarrassment.\"</p><p>On December 31, 2021, Joe Gatto announced on his Instagram that he would be leaving Impractical Jokers after nine seasons. Shortly thereafter, Quinn, on behalf of Murray and Vulcano, sent well wishes for Gatto and announced that Impractical Jokers would continue working despite Gatto's absence in 2022. Subsequently, Paste reported that TruTV and HBO Max had removed \"several episodes featuring Gatto in compromising situations\" from their platforms. On February 14, 2022, the show announced that the season would proceed with a lineup of various celebrity guests.</p><br/><h3>Challenge format</h3><p>Prior to every challenge, the Jokers explain where they are, what the challenge is. Often (but not always) the cast member(s) performing the prank wears an earpiece, while the others have a mic in a covert location. Cameras are hidden near the area to capture the action. The challenge location is usually a public area in or around New York City such as a city park, or store. The criteria of each challenge are the same for each of the Jokers competing in the round. If the Joker cannot or refuses to complete their task, they get a thumbs-down. At the end of the episode, the Joker(s) with the most thumbs down receives a punishment. The punishments cannot be refused, lest they be kicked off the show, and are usually more embarrassing, humiliating, disgusting, painful, scary, or dangerous than any of the other challenges.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"3\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th><th scope=\"col\" style=\"padding:0 8px\">Network</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">16</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">December 15, 2011</td><td style=\"padding:0 8px\">May 3, 2012</td><td rowspan=\"9\"><span>TruTV</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">28</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">September 6, 2012</td><td style=\"padding:0 8px\">December 12, 2013</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">31</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 2, 2014</td><td style=\"padding:0 8px\">October 30, 2014</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 29, 2015</td><td style=\"padding:0 8px\">October 22, 2015</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 11, 2016</td><td style=\"padding:0 8px\">November 3, 2016</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 9, 2017</td><td style=\"padding:0 8px\">November 2, 2017</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>7</span></span></span></span></th><td colspan=\"2\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 1, 2018</td><td style=\"padding:0 8px\">December 6, 2018</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>8</span></span></span></span></th><td colspan=\"2\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">March 28, 2019</td><td style=\"padding:0 8px\">March 5, 2020</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>9</span></span></span></span></th><td colspan=\"2\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 4, 2021</td><td style=\"padding:0 8px\">August 4, 2022</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>10</span></span></span></span></th><td data-sort-value=\"\" class=\"table-na\" colspan=\"2\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\">TBA</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 9, 2023</td><td data-sort-value=\"\" class=\"table-na\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center; ;padding:0 8px\">TBA</td><td rowspan=\"1\">TruTV/<span>TBS</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>Specials</span></span></span></span></th><td colspan=\"2\">40</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">February 2, 2012</td><td style=\"padding:0 8px\"><small><span style=\"color: #2C2C2C\">TBA</span></small></td><td rowspan=\"1\">TruTV</td></tr></tbody></table><p>As of the 2017–18 television season, the series is syndicated to American broadcast stations by Trifecta Entertainment & Media, with a clearance rate of 85% of television homes.</p><br/><h3>Cast</h3><p>The cast consists of four long-time friends, collectively on the show referred to as \"Jokers\".</p><h4>Main</h4><ul><li>Brian \"Q\" Quinn is an improvisational comedian from the New York City borough of Staten Island. He attended Monsignor Farrell High School, where he was involved in numerous activities, including drama and sports. He attended Brooklyn College and later went on to join the New York City Fire Department. He is the third host of the podcast Tell 'Em Steve-Dave!, which was formerly on SModcast.com.</li><li>James \"Murr\" Murray is an improvisational comedian from the New York City borough of Staten Island. He attended Monsignor Farrell High School there, and was also part of a community theatre. He continued his education at Georgetown University where he received a BA in English. He continues to work at NorthSouth Productions, where he is the Senior Vice President of Development. In 2018, he released a sci-fi/horror book called Awakened, which was co-written by Darren Wearmouth, and revolves around a monster that lives in the subways of New York City. Two sequels, called The Brink and Obliteration, were released on June 18, 2019 and June 23, 2020, respectively. He is married to Melyssa Davies.</li><li>Sal Vulcano is an improvisational and stand-up comedian from the New York City borough of Staten Island. He earned a degree in Finance from St. John's University. Vulcano is also an ordained minister, and officiated Gatto's 2013 wedding.</li><li>Joe Gatto (seasons 1–9) is an improvisational comedian from the New York City borough of Staten Island, where he attended Monsignor Farrell High School. He studied at Long Island Post University where he received a degree in Accounting. He founded the Tenderloins comedy troupe in 1999 and worked at the baby retail store Giggle, until January 2012. He is the first married Joker (one of two), and has two children with his former wife Bessy. On December 31, 2021, Gatto announced on his Instagram that he was parting ways with the Tenderloins and Impractical Jokers to focus more on his personal life and family.</li></ul><h4>Guest appearances</h4><p>Celebrities have made appearances in the series:</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Season 2</th><th>Season 3</th><th>Season 4</th><th>Season 5</th><th>Season 6</th><th>Season 7</th><th>Season 8</th><th>Season 9</th><th>Season 10</th></tr><tr><td><ul><li><span>Rosie O'Donnell</span></li><li><span class=\"mw-redirect\">Dan Reynolds</span></li><li><span>Wayne Sermon</span></li></ul></td><td><ul><li><span>Joey Fatone</span></li><li><span>Tommy Dreamer</span></li><li><span>Iain Armitage</span><span></span></li></ul></td><td><ul><li><span>Soren Thompson</span></li><li><span>Danica McKellar</span></li><li><span>Byamba</span></li><li><span>Grant Marshall</span></li><li><span>Colin White</span></li><li><span>Howie Mandel</span></li></ul></td><td><ul><li>Joey Fatone</li><li><span>Alex Brightman</span></li><li><span>James Buckley</span></li><li><span>Travis Pastrana</span></li></ul></td><td><ul><li>Joey Fatone</li><li>Tommy Dreamer</li><li>Danica McKellar</li><li><span>Gary Busey</span></li><li><span>Bryan Johnson</span></li><li><span>Bully Ray</span></li><li><span>Velvet Sky</span></li><li><span class=\"mw-redirect\">Casey Jost</span></li><li><span>Jesse Bravo</span></li><li><span>Matthew Lewis</span></li><li><span>Noah Syndergaard</span></li><li><span>Kayla Harrison</span></li></ul></td><td><ul><li><span>Australia's Thunder from Down Under</span></li><li>Joey Fatone</li><li>Soren Thompson</li><li>Gary Busey</li><li>Kayla Harrison</li><li><span>Big Jay Oakerson</span></li><li><span>Doug McDermott</span></li><li><span class=\"mw-redirect\">Enes Kanter</span></li><li><span>Buddy Valastro</span></li><li>Bryan Johnson</li><li><span>Harry Connick Jr.</span></li><li>Danica McKellar</li><li><span>Mike Spano</span></li><li>Byamba</li><li><span>Guy Fieri</span> (via satellite)</li><li><span>Carlos Peña</span></li><li><span>Mark DeRosa</span></li><li><span>Randy Couture</span></li><li><span>Shawn Klush</span></li><li><span>Tino Martinez</span></li><li><span>David Zucker</span> (via satellite)</li></ul></td><td><ul><li><span>Tristin Mays</span></li><li><span>Yanni</span></li><li><span>Jay and Silent Bob</span></li><li><span>Steel Panther</span></li><li><span>Jeff Daniels</span></li><li><span>Dave Jacobs</span></li></ul></td><td><ul><li><span>Jameela Jamil</span></li><li><span>Eric André</span></li><li><span>Jillian Bell</span></li><li><span>Colin Jost</span></li><li><span>David Cross</span></li><li><span>Chris Jericho</span></li><li><span>Brooke Shields</span></li><li><span>Method Man</span></li><li><span>Adam Pally</span></li><li><span>Jon Gabrus</span></li><li><span>Rob Riggle</span></li></ul></td><td><ul><li><span>Bret Michaels</span></li><li><span>Paul Rudd</span></li><li><span>Post Malone</span></li><li><span>Steve Byrne</span></li><li><span>Anthony Davis</span></li><li><span>John Mayer</span></li><li><span class=\"mw-redirect\">MJF</span></li><li><span>Kesha</span></li><li><span>Eddie Jackson</span></li><li><span>Roy Wood Jr.</span></li><li><span>Paul Scheer</span></li><li><span>Kal Penn</span></li><li><span>Rosanna Scotto</span></li><li><span>Bruce Campbell</span></li><li><span>Blake Anderson</span></li></ul></td></tr></tbody></table><p>Impractical Jokers staff have also made appearances:</p><ul><li>Casey Jost hosts the Inside Jokes segments, and some of the behind-the-scenes antics.</li><li>Rob Emmer is a production assistant and actor that appears in some of the challenges in different roles.</li><li>Joe Imburgio is a producer on the show, and appears in some of the challenges and behind-the-scenes antics.</li></ul><br/><h3>International versions</h3><ul><li>A British version of Impractical Jokers began airing in winter 2012 on BBC Three. It starred comedians Paul McCaffrey, Joel Dommett, Marek Larwood and Roisin Conaty. The pilot was filmed and placed online as part of \"The Comedy Kitchen\" in 2012. The first series included six episodes, which aired from November 15 to December 20, 2012. The second series also included six episodes, and aired from February 24 to April 2, 2014. It was produced by Yalli Productions. It was cancelled after Series 2 in April 2014, mainly due to its unpopularity. However, more recently, Comedy Central and Channel 5 picked up the rights to co-produce a third season of Impractical Jokers UK with Yalli Productions, starring Late Night Gimp Fight. It aired from 2016 - 2017.</li><li>A Dutch version was broadcast on Veronica TV in 2012, called De Fukkers. In 2015 a new version started at RTL 5, named Foute Vrienden. The series ran for 5 seasons, ending in 2019. A third All-Female version started in 2018 called Foute Vriendinnen.</li><li>A Belgian (Flemish) version broadcast on 2BE in the fall of 2012, titled Foute Vrienden. James Murray appeared in episode 5 of the first season. The second season, which started in March 2014, included 10 episodes.</li><li>A Brazilian version is currently being broadcast on SBT titled Amigos da Onça. The series premiere aired on January 7, 2013 and ended on August 13, 2013. James Murray appeared in episode 3 of the second season.</li><li>A Lebanese version was broadcast on Al Jadeed in the fall of 2013.</li><li>A Mexican version broadcast on TBS Latin America started on May 20, 2015 with the title Impractical Jokers.</li><li>A Greek version was broadcast on Ant1 in February 2014 with the title Wanted.</li><li>A French-language Canadian version was broadcast on V on February 24, 2014 with the title Les Jokers.</li><li>A Swedish version was broadcast on TV6 in April 2014 with the title Radiostyrd.</li><li>A Spanish version was broadcast on Neox in 2014 with the title Sinvergüenzas.</li><li>An Egyptian version was released in 2015 with the title Al Mohayesoun.</li><li>A Russian version was broadcast on Che in 2018 and 2019 with the title Shutniki (Шутники)</li></ul><br/><h3>Critical reception</h3><p>Impractical Jokers has been well received by most critics, with Linda Stasi of the New York Post calling it \"possibly the funniest, most ridiculous show I've seen in years.\"</p><p>While it has been compared to earlier hit prank shows such as Candid Camera and Jackass, critics have offered praise for its unique twist on the genre, wherein the stars' reactions to the pranks are often equally as humorous as those of the innocent bystanders. Neil Genzlinger of The New York Times stated that \"the gag pays off twice: once in the reaction of the unsuspecting passer-by, once in the discomfort of the fellow doing the asking.\" He later wrote that the cast-members' occasional integrity \" these four clowns a little bit lovable.\" Dean Robbins of The Daily Page echoed this sentiment, stating that \"the friends are jovial rather than Jackass-obnoxious, even rejecting some dares as too offensive.\"</p><p>The series has been generally well received, garnering 1.5 million viewers during its December 15, 2011, premiere.</p><p>The review of the show by Variety's Brian Lowry was less positive, ending with this statement: \"Nobody will ever confuse Impractical Jokers with high art, certainly, but as low-brow, micro-cost comedy in the context of truTV's programming resources, it's actually quite practical—and occasionally funny.\"</p><p>On February 6, 2023, the borough of Staten Island officially declared the first Monday of every February \"Impractical Jokers Day\" in honor of the tenth season of the show.</p><br/><h3>Spin-offs</h3><h4>Jokers Wild</h4><p>Jokers Wild was a spin-off of the original series in which the guys filmed a different style of skits that differ from ones that they normally film for the show. These skits are story type as opposed to live interaction with people. The first episode of Jokers Wild aired on September 25, 2014. Only four episodes of the six that were filmed for this series ever aired on truTV as the show did not do well in the ratings and was cancelled after the 4 episodes aired.</p><h4>Impractical Jokers: Inside Jokes</h4><p>Impractical Jokers: Inside Jokes is a spin-off of Impractical Jokers in which episodes that have already aired are shown again with pop-up facts throughout, including behind-the-scenes stories and facts directly from the Jokers. The first episode of Impractical Jokers: Inside Jokes aired on July 14, 2016, following the mid-season British special.</p><h4>Impractical Jokers: After Party</h4><p>Impractical Jokers: After Party is an aftershow hosted by Joey Fatone, in which the Jokers and surprise guests go through a deep dive of challenges, special play-by-play punishment analysis from the latest episode, and bonus content from the latest episode or the whole show. The first episode of the series aired on August 3, 2017, after the episode \"The Q-Pay\" had aired. After Party is filmed at The Flagship Brewing Company bar in Staten Island. When the series came back on August 2, 2018, the series moved to The Mailroom Bar in Lower Manhattan.</p><h4>Impractical Jokers: Dinner Party</h4><p>Impractical Jokers: Dinner Party is a spin-off of Impractical Jokers, in which the Jokers do a video group chat while eating dinner and having guests visit one or more participants. The spin-off was created in response to the COVID-19 pandemic in the United States that prevented Impractical Jokers episodes from being produced. The show's theme song is \"Uzi (Pinky Ring)\" by Wu-Tang Clan. The first episode of the series aired on May 21, 2020. On August 5, 2020, the series was ordered 10 additional episodes and began airing on October 15, 2020. The first season ended on January 14, 2021. At the end of the episode, \"Don't Stop Believin' \" by Journey plays to commence the return of regular episodes.</p><br/><h3>Film</h3><p>On March 7, 2018, truTV announced that Impractical Jokers was renewed for an eighth season and a feature-length film to begin development in spring 2018, directed by Chris Henchy and produced by Funny or Die. Production on the film began at the end of April 2018. A trailer was released on December 17, 2019, and the movie was released on February 21, 2020.</p><br/><h3>Other media</h3><p>TruTV and Built Games developed a mobile game called Impractical Jokers: Wheel of Doom, released in 2018. Wilder Games developed a party game series including Impractical Jokers: Box of Challenges and Impractical Jokers: Ultimate Challenge Pack that were released in 2020.</p><p>The Official Impractical Jokers Podcast started in 2017, hosted by producers Casey Jost and James McCarthy. Episodes are usually released the day after new episodes have broadcast. Assistant director and producer Chá DeBerry joined the podcast as a host in 2021.</p><br/>"
  },
  "errorMessage": ""
}