{
  "imDbId": "tt1508238",
  "title": "Apocalypse: The Second World War",
  "fullTitle": "Apocalypse: The Second World War (TV Series 2009–2009)",
  "type": "TVSeries",
  "year": "2009",
  "items": [
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw2380612",
      "warningSpoilers": false,
      "date": "5 February 2011",
      "rate": "10",
      "helpful": "38 out of 45 found this helpful.",
      "title": "A revelation",
      "content": "I watched this six-part documentary series when it was first shown on British television back in November 2010. I was absolutely blown away by it.The main draw of this French-made series is the inclusion of colour film footage. The narration doesn't really tell us anything we don't already know about the war, but the colour footage, which plays constantly throughout the six hours, is tremendous and brings the era to life like never before.Fairly wide-ranging in scope, this one covers the Nazi invasions, the Russian front, the British perspective and the War in the Pacific. I was moved, intrigued and came away feeling like I'd attended an extremely good history class on the subject."
    },
    {
      "username": "stuka24",
      "userUrl": "https://www.imdb.com/user/ur4237030",
      "reviewLink": "https://www.imdb.com/review/rw2189469",
      "warningSpoilers": false,
      "date": "10 January 2010",
      "rate": "10",
      "helpful": "79 out of 95 found this helpful.",
      "title": "The best documentary on WWII you'll ever watch!",
      "content": "\"Perfection is rare to find\" is the favourite phrase of an aesthetic surgeon. This is just it.The text is superb. Informative, NEUTRAL, without concessions for any party, and with a subtler enough message of hope. The images are really unbelievable. Also unusual. If you think you've seen them all and docus on wars bore you, think again. Kassovitz's voice is just what's needed for the job: enthusiastic and yet dry enough so you get \"just the facts\". If you ever look for a good music equipments, when you read reviews you'll find that one of the best compliments writers do is: \"doesn't get in between you and the music\". You don't \"notice\" the direction, editor, the \"author\" who made this monumental work. Even with touchy topics like the Holocaust, they just deliver the facts. Their involvement is obvious, but they always give us the facts first. Whether you are cramming for a general education examination or if you want to be a bit less ignorant on probably the most relevant topic of the XX century, you'll find no better documentary. Engaging, painful to watch at times, showing us the consequences on the peasants and the \"little people\" as well as the general's feats and whims, this saga strikes the right balance at everything. From the Blitzkreig to the V2, from Normandie to the unlikely allies the Nazis got from the dominated Slav countries (and how they mistreated them for \"not being Aryan\", everything is here, and more. Even Hitler's madness. Just one example: him calling Churchill and Roosevelt \"jewizizing\" after another military setback. Surely history is staggering enough: the Islamists were one of the unlikely willful allies of the Nazis, \"combating the common Zionist enemy\".Words are not enough to describe the \"thirst for nothingness\" Hitler saw on the world, Japanese's pride, American altruism, British flame, the French way of failing so much, for so long, Italian's mistrust of government, Soviet power and blindness, German efficiency in devising the cruelest weapon (i.e. the mines with a \"click\") as the Berliner. performing yet another perfect rehearsal. If there's just one thing I'd have liked is less bias for the tiniest \"heroic French action\" completely irrelevant for the course of the war, and absent from any history manuals. Time being a scarce resource, it'd been useful to cover a bit more of the Pacific front, barely mentioned. It's also a bit Eurocentric in scope, but I suppose that's the price to pay. Nobody is perfect after all :(.Whatever is to be learned from wars must be here. Whatever can be learned is never enough, never too late, never enough. Churchill's famous prose give this documentary two of the most memorable moments, in which it was difficult for me not to cry. People may not learn, again. Yes, a documentary on such hay-necked topic can still do that to you."
    },
    {
      "username": "PhilippeIII",
      "userUrl": "https://www.imdb.com/user/ur0806266",
      "reviewLink": "https://www.imdb.com/review/rw2185962",
      "warningSpoilers": false,
      "date": "4 January 2010",
      "rate": "9",
      "helpful": "50 out of 57 found this helpful.",
      "title": "WWII explained with restored film archives",
      "content": "I recently viewed this 6 part series on WWII and I was literally captivated. It aired on TV5 (French speaking network) twice and I finally managed to view all 6 episodes. The war is explained in detail with actual footage filmed by all sides in the conflict. The films are enhanced (coloured) and restored making them even more actual. The conflicts In North Africa, in the Pacific and in Europe are all explained with maps and troop movements. The hardship and suffering of the populations and soldiers are seen and felt by the viewer.From the beginning of the German-Russian Nonaggression Pact to the surrender of Japan, all steps of the war are explained and shown with unbelievable detail. The complete DVD set is available but only in Europe for Zone 2 and Pal TV. However I think it should be made available everywhere, and all school children old enough to understand, should be shown this documentary."
    },
    {
      "username": "nicholas.rhodes",
      "userUrl": "https://www.imdb.com/user/ur0885866",
      "reviewLink": "https://www.imdb.com/review/rw2130895",
      "warningSpoilers": true,
      "date": "22 September 2009",
      "rate": "8",
      "helpful": "14 out of 20 found this helpful.",
      "title": "Interesting Documentary WW2",
      "content": "A documentary potted history of WW2, the novelty here is that most of the film has been \"colorized\". The maker does not like to use this word and prefers to say \"restored\" but to all intents and purposes it is seeing the war in colour that makes it more gory and emotional. Explosions, bodies, speeches, ruins, bombs, it's all there and by the end of the sixth and last episode you are completely drained ! It is difficult to imagine how so much grief, damage disaster horror can be caused at the beginning by such a small number of people. Apparently, over 700 hours of film were examined before selecting the final product which is 6 x 52 minute episodes."
    },
    {
      "username": "henrycoles9",
      "userUrl": "https://www.imdb.com/user/ur78573336",
      "reviewLink": "https://www.imdb.com/review/rw5839782",
      "warningSpoilers": false,
      "date": "20 June 2020",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "Riveting",
      "content": "I watched this series when it came out over a decade ago and I just had an urge to watch it again. It certainly feels more chilling now than when I was a teenager and the brilliant colors of the Second World War will forever be seared on my mind."
    },
    {
      "username": "engelbertfranssen",
      "userUrl": "https://www.imdb.com/user/ur37236865",
      "reviewLink": "https://www.imdb.com/review/rw2703598",
      "warningSpoilers": false,
      "date": "13 November 2012",
      "rate": "9",
      "helpful": "17 out of 21 found this helpful.",
      "title": "Maximum education about the WWII",
      "content": "The second world war ensured tons of documentaries. The information about this topic is overwhelming, but of course you don't want to watch every documentary ever made. But if you don't have a clue where to start, or if you just want a very nice summery of the second world war, then this documentary is a must see in my opinion.The documentary shows the development of the second world war in a chronological and interesting way. It is narrated from a very objective point of view and therefore the educational level is very high. And the amount of topics is very broad, so you get introduced with every aspect of this heinous period. Due this fact you can orientate what you find interesting and you can search for more documentaries about specific topics later.The capture my opinion in a short sentence: \"Please watch this amazing documentary\"!"
    },
    {
      "username": "wikipediacabal",
      "userUrl": "https://www.imdb.com/user/ur22815555",
      "reviewLink": "https://www.imdb.com/review/rw2866653",
      "warningSpoilers": false,
      "date": "9 September 2013",
      "rate": "9",
      "helpful": "10 out of 14 found this helpful.",
      "title": "Best looking of its kind",
      "content": "The high resolution film scans look great. They are the main attraction here so be sure to watch it in HD. The colorizing is good too, making the footage more powerful for today's audience, although I can imagine that future improvements will eventually make it look dated.The script repeats an old error about the Polish cavalry units in Ep. 1. A brief clip of men charging with sabers drawn is narrated \"The Polish cavalry charges the German tanks, and is slaughtered.\" This is nonsense and insulting. World War I taught every cavalry officer that cavalry charges were a thing of the past. Polish cavalry c.1939 were not classic cavalry. The were highly mobile infantry units which used horses to move but then fought dismounted. They were highly effective in that role."
    },
    {
      "username": "RealLiveClaude",
      "userUrl": "https://www.imdb.com/user/ur1622306",
      "reviewLink": "https://www.imdb.com/review/rw3351459",
      "warningSpoilers": false,
      "date": "8 November 2015",
      "rate": "9",
      "helpful": "5 out of 8 found this helpful.",
      "title": "A realistic view of World War II",
      "content": "This series followed \"Apocalypse: Hitler\", and explains with sometimes very crude and brutal images, the events of World War II.Narrated by Mathieu Kassovitz in French, it truly brings the war up to its exploits and its horrors. Some excerpts were shot by American directors John Ford and John Huston, right on the spot.Thus maybe one flaw was the fact that it showed mostly the war on the European front, Hitler's wanting to rule the world, the Soviets fighting back with strong forces. Only the fourth episode shows the Pacific War with the Japanese using \"Bushido\" to stand up to its enemies, mostly the Americans. It took atomic bombs to end it all...And in Europe, the crush on three sides: the Normandy Raid, the African defeats and the Soviet eastern push did end Nazi Germany and Fascist Italy dominations.This is a documentary not to be missed. Warning: some images can be disturbing..."
    },
    {
      "username": "heisenberg12",
      "userUrl": "https://www.imdb.com/user/ur57699719",
      "reviewLink": "https://www.imdb.com/review/rw6445395",
      "warningSpoilers": false,
      "date": "5 January 2021",
      "rate": "10",
      "helpful": "3 out of 4 found this helpful.",
      "title": "Phenomenal",
      "content": "This is an addictive series that covers all of the major players, strategies, and events of World War II: how the war developed, unfolded, and progressed in every theatre and the world leaders who dealt with the perils, in addition to firsthand accounts of pilots and soldiers who survived major battled like Midway, Pearl Harbor, Bridge on the River Kwai connecting the Japanese army to India, Guadalcanal near Papa New Guinea, Hong Kong, Singapore, the Suez, and of course Europe and Japan. Not only is it excellent and wickedly informative, it's mesmerizing and beautifully depicted, narrated, and edited. It really makes you feel like you are there in these major battles like Midway, Stalingrad, Europe, and others with the actual footage converted into color from black and white.10/10"
    },
    {
      "username": "harj-41-607090",
      "userUrl": "https://www.imdb.com/user/ur25955344",
      "reviewLink": "https://www.imdb.com/review/rw5129780",
      "warningSpoilers": false,
      "date": "19 September 2019",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Superbly constructed and very moving",
      "content": "This is a world war 2 documentary like no other. It contains a brilliant musical overture, often haunting but superbly executed. The narration is good, but the biggest plays is the colour footage which brings the war alive like no other documentary.Inevitably, comparisons will be drawn with the masterpiece \"The World at War\". These are unfair comparisons. This documentary had its own angle and story and special way of telling it."
    },
    {
      "username": "hypersonic8999",
      "userUrl": "https://www.imdb.com/user/ur22668032",
      "reviewLink": "https://www.imdb.com/review/rw3474613",
      "warningSpoilers": false,
      "date": "22 May 2016",
      "rate": "7",
      "helpful": "8 out of 14 found this helpful.",
      "title": "Good documentary but biased and very French-centric",
      "content": "This documentary series' strong point is the use of only WWII footage, often colorized. A lot of it is rarely seen in other documentaries, some of it none at all. So it's very interesting in that perspective.However, it's a French documentary and it's very French-centric and usually very biased. On several occasions I've caught it omitting important information/context or bringing up wrong information. For a documentary claiming to cover the whole of WW2 (which it does claim to do so), it's not a very good effort. It will mention several side-topics that are important for France (e.g. the politics of France before the war), but doesn't bother with important parts of WW2 that France had nothing to do with, e.g. the war in the Balkans.Most egregious is that it tries very heavily to paint the Soviets as bad or worse than the Nazis. It tries to paint Britain as the major obstacle to Germany and their main opponent. Just to be clear, ideally it shouldn't be biased at all for either side. It should be presenting history and commentary on the footage. Instead it sometimes uses footage to present a version of history that is favorable to the makers.Still, in the parts that concern Western Europe, it does a very good job on educating its viewers on important details that are not known by many. It gives a very good perspective of the civilian population. The footage taking a primary role, instead of a tool to transition between interview scenes (this documentary doesn't have any such scenes) keeps things interesting.I'd recommend watching it, but bearing in mind that it only does the rudimentary minimum for anything else aside from French and British affairs. As far as the Eastern Front goes and the War in the Pacific, you can find many better documentaries."
    },
    {
      "username": "djeezman",
      "userUrl": "https://www.imdb.com/user/ur23092759",
      "reviewLink": "https://www.imdb.com/review/rw2232444",
      "warningSpoilers": false,
      "date": "7 April 2010",
      "rate": "7",
      "helpful": "37 out of 63 found this helpful.",
      "title": "pleasant, but not perfect",
      "content": "It is a France 2 documentary and as such very french biased.Many french sensitive issues (Vichy.. only the top a disgrace, or whole french populations under Vichy a disgrace ?! ), liberation of France by active troops in terms of men, material..how much (or rather how little) was french, etc. are left under the carpet.All the world-war issues are looked upon with french interest/viewpoint..if there isn't one, then there is no attention to it or only as a 5 second footnote (Fights in Norway? Holland ? Belgium ? Convoy war at Atlantic ? Balkan fights Tito resistance, Soviet fights in Balkan countries ? MarketGarden ? Japan's fights and occupation in china,New Guinea,etc).However french issues which are marginal to the outside world are given broad attention (french ministers crisis 1940, negotiations Roosevelt with Gaulle en Vichy favoured representative in 1943, Bir Hakeim stand, LeClerc background (ahem Zjoekov's background ? Monty's Background? Alexander's background?), Indochine taken over by Japan, French resistance actions (no resistance elsewhere?), De Gaulle's return in France and focus on his political problems).Like before-mentioned text: Many films have been aired before..only a few are rare (from French sources). All are coloured in, which gives it a special touch-but not all are coloured in thoroughly (only face one colour, one colour for uniform, one colour for bushes, one colour for ground).It's nice to see, and it keeps you captivated...but it is not THE best documentary, and certainly not \"neutral\"(unbiased)."
    },
    {
      "username": "bttp",
      "userUrl": "https://www.imdb.com/user/ur24806833",
      "reviewLink": "https://www.imdb.com/review/rw2578847",
      "warningSpoilers": false,
      "date": "10 March 2012",
      "rate": "9",
      "helpful": "13 out of 19 found this helpful.",
      "title": "Great WW2 films I haven't seen before",
      "content": "Maybe the story is not 100% complete, and maybe it gets a little confusing because so many things happen simultaneously throughout the world, so it's understandable that they didn't cover every single aspect and that it's a little too much \"French biased\", after all it is a French documentary. For example they didn't cover the Balkans at all, and there was one of the most complicated situations in the whole WW2. Maybe not the most important, but certainly interesting, especially in Yugoslavia, where there was in effect a three-way civil war under Nazi occupation, between royalists, communists and quislings going on simultaneously with the armed resistance to Nazis. So that in itself is a situation that would require it's own documentary, and I can see that the authors maybe did not wan't to get into explaining those difficult circumstances when it may take too much time. But the sheer amount of film material shown, that I've never seen before, is astonishing to say the least. I watched every episode eyes wide open. And it's that WW2 video material itself that makes this documentary worth having in one's collection."
    },
    {
      "username": "mlynch5187",
      "userUrl": "https://www.imdb.com/user/ur50353664",
      "reviewLink": "https://www.imdb.com/review/rw2982888",
      "warningSpoilers": false,
      "date": "20 March 2014",
      "rate": "8",
      "helpful": "10 out of 23 found this helpful.",
      "title": "Great Footage",
      "content": "If you are looking for an accurate overview of the events of World War II, look elsewhere. The series is more or less told from a French perspective and exaggerates the role of France. For example covering small battles of hundreds of men involving the French, while overlooking or glossing through massive battles of hundreds of thousands of men in Russia and the Pacific. I hold a degree in history and have something of a World War II buff for many years and It pains me to say that this documentary is one of the most overtly biased World War II documentaries I've ever seen. If you are interested in history and looking for an relatively accurate, detailed, and neutral portrayal of the war, I suggest you watch \"World War II In Colour\" and stay far away from this series.On the other hand, if you are looking for interesting footage, look no further. The footage is some of the best you'll find. This isn't the same footage you see played over and over again on all the other documentaries. The footage refreshingly contains new, fresh images, that. Topics are wide and varied: civilian life, military battles, prisoners of war, the devastation of cities. All in all, the footage is the backbone of the documentary."
    },
    {
      "username": "jeffrey-nimmo-1",
      "userUrl": "https://www.imdb.com/user/ur20396553",
      "reviewLink": "https://www.imdb.com/review/rw2216520",
      "warningSpoilers": false,
      "date": "5 March 2010",
      "rate": "7",
      "helpful": "22 out of 43 found this helpful.",
      "title": "It has its good and bad points.",
      "content": "I take exception to the statements that this is the greatest WW2 documentary ever made. It's a fairly standard history from a French viewpoint, with the additional gimmick of being colorized. Yes, colorized, not \"restored,\" as the original was never in color in the first place. Some of the footage is new, but most has appeared in previous documentaries.Black & white footage is not easily colorized, and can often appear fake, even surrealistic. So, while it sometimes works, making certain scenes more vivid and realistic, it often works counter to its purpose.Much of the new footage has not appeared previously for a reason: it is extremely disturbing. Dead and decaying bodies abound. This is a war documentary and so is perfectly appropriate, but I would not allow small children to watch.The commentary avoids controversy by being rather simplistic. WW2 Buffs will learn nothing new. I was impressed however, by the statement in one of the episodes, that the French communists didn't begin resisting the German occupation until after the invasion of the Soviet Union, a full year after the fall of France. This statement of course is absolutely true, but it couldn't have made the French leftists very happy.In all, I would recommend this to WW2 and modern history buffs, only for the new footage, and to see what can and can't be done with colorization. However, for general viewers looking for a solid introduction to the war, I would recommend \"World at War.\" For those sad souls who cannot watch b&w footage, there are series for the US, Great Britain, Japan and the Anzacs, all showing original, not colorized, color footage."
    },
    {
      "username": "minister_of_silly_walks",
      "userUrl": "https://www.imdb.com/user/ur64212521",
      "reviewLink": "https://www.imdb.com/review/rw4471573",
      "warningSpoilers": false,
      "date": "21 November 2018",
      "rate": "10",
      "helpful": "2 out of 5 found this helpful.",
      "title": "The best WWII documentary I have ever seen",
      "content": "A must watch for every history buff and any fan of documentaries. It has never before seen color footage from all of the action in WWII as well as stories form behind the scenes as well as every day life. It is fascinating, interesting and terrifying all at the same time."
    },
    {
      "username": "colmhain",
      "userUrl": "https://www.imdb.com/user/ur69994704",
      "reviewLink": "https://www.imdb.com/review/rw8378432",
      "warningSpoilers": false,
      "date": "28 July 2022",
      "rate": "5",
      "helpful": "2 out of 3 found this helpful.",
      "title": "A Francophile's documentary.",
      "content": "An adequate, but sometimes misleading, docu-series about the Second World War. It doesn't outright lie, so much as omit or over emphasize. The demonization and lionization of combatants falls short of propaganda, but still feels a bit sycophantic. I love the use of authentic footage, colorized for the most part, but left entirely original for the Holocaust images.There are better documentaries of WWII.There are also worse."
    },
    {
      "username": "Ilan_Voyager",
      "userUrl": "https://www.imdb.com/user/ur18712287",
      "reviewLink": "https://www.imdb.com/review/rw2678080",
      "warningSpoilers": false,
      "date": "23 September 2012",
      "rate": "8",
      "helpful": "5 out of 10 found this helpful.",
      "title": "Excellent documentary more axed on the Europe operations theater.",
      "content": "Henri De Turenne and Daniel Costelle have a 40 years old record of documentaries about the WWII period. As it's made by French filmmakers for a French TV it seems normal that the documentary emphasizes on the French point of view. The excellent documentaries about the same subject by the BBC are also \"biased\"...No history work can pretend to be perfectly neutral, or it would be a long list of raw meaningless facts.Another comment makes the assertion that \"A greater number of Frenchmen bore arms for the Axis than for the Allies.\" Thats seems a pretty foolish assertion if you do very simple maths on the proved ciphers:-Resistance; At least 220 000 people (the historian Paxton estimates the numbers between 200 000 and 400 000). Not all were bearing arms as the 100 000 FFI in 1944, but all worked against the Nazis. -Italy Campaign 1943 130 000 French soldiers (American statistics). -At the time of Normandy Invasion 500 000 French regular soldiers (plus the 100 000 FFI). In May 1945 not far from the million...On the other side: - Milice (paramilitary organization) 25 000.(35 000 including part-time members and non-combatants). - In the Wehrmacht and later Waffen-SS; 7340 in 1944. Lets put at max 20 000 volunteers during all the war, and including the double entries with the Milice.The Alsatian people were drafted in the Wermacht as they were considered as German by the Nazis. So most were not volunteers and cannot be included.So how the pseudo historian has found that \"A greater number of Frenchmen bore arms for the Axis than for the Allies.\"???"
    },
    {
      "username": "chunkmeal",
      "userUrl": "https://www.imdb.com/user/ur35350652",
      "reviewLink": "https://www.imdb.com/review/rw2650543",
      "warningSpoilers": false,
      "date": "28 July 2012",
      "rate": "7",
      "helpful": "18 out of 42 found this helpful.",
      "title": "Overly condensed; France misrepresented",
      "content": "Six 45-minute episodes does no justice to what was truly the most devastating Apocalypse in human history. But yes this is pretty good given the very limiting length constraint.I am writing this review however, mostly so I can rant about the disproportionate amount of time devoted (in this already extremely short documentary) to what the French did. France is often caricatured as having, in WW2, done little more than surrender immediately, ship out Jews while waiting to be liberated, and be forever angry at their liberators (especially for speaking English while in France). This caricature is however probably closer to the truth than what this documentary suggests. Example: one bit talked at length about the mythical French Resistance, then went on to show 3-second clips of resistance movements around the continent, e.g. in Yugoslavia, Norway, etc. This was quite risible, given that the Yugoslav Resistance successfully liberated Yugoslavia by themselves, while Albert Speer replied \"What French Resistance?\" when asked about it.Example: The French Resistance and De Gaulle are depicted as having liberated Paris, but really they were (for lack of a common English expression) ribbon-cutters claiming the credit for work done by their true liberators---the English-speakers. An astonishing fact cited by Andrew Roberts in The Storm of War is this: A greater number of Frenchmen bore arms for the Axis than for the Allies. A French schoolchild who watches this documentary will however get the wrong impression that France was nearly equal to Britain or even the US/USSR in the struggle against the Nazis."
    },
    {
      "username": "ThisisJimik",
      "userUrl": "https://www.imdb.com/user/ur121136353",
      "reviewLink": "https://www.imdb.com/review/rw7194738",
      "warningSpoilers": false,
      "date": "4 August 2021",
      "rate": "10",
      "helpful": "1 out of 2 found this helpful.",
      "title": "Such a great one again ..",
      "content": "However there are thousands of nice and perfect documentaries bout ww1 and ww2 , but this one could be even called the best of em all.Alotsa work has been done on collecting colorizing and commentating which is appreciated.Thanks to imdb , @THISISJIMIK ."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw4451526",
      "warningSpoilers": false,
      "date": "11 November 2018",
      "rate": "7",
      "helpful": "0 out of 4 found this helpful.",
      "title": "old fashion doc in color",
      "content": "This is a six-part French documentary series on the Second World War. It's most notable for being in colour with some exceptions with the Holocaust footage. The colorization looks good and not too gaudy. Most of the war footage is familiar. There are some lesser seen civilian stuff especially early in the war. This is reminiscent of the old style documentaries that populate the TV leftover time slots way back when. The fact that it gets a new life in a nice concise package is commendable. I saw the version with narration by Jonathan Booth. He's not famous and has the echoing tones of the older documentaries which is comforting. Having a familiar voice like Martin Sheen could be jarring. This is an old fashion doc series."
    },
    {
      "username": "WesternOne1",
      "userUrl": "https://www.imdb.com/user/ur19202620",
      "reviewLink": "https://www.imdb.com/review/rw5071758",
      "warningSpoilers": false,
      "date": "20 August 2019",
      "rate": "2",
      "helpful": "3 out of 12 found this helpful.",
      "title": "The end of WWWII docs?",
      "content": "Is there a call for a new documentary series on World War Two? There certainly could be new ones, being there's so much to talk about. Perhaps it's time to make another \"World at War\" type series, now without so much naive acceptance of Soviet propaganda. But the trend, sadly, has become to make feeble and under motivated products like this. Since it was put together in France, it contains a lot Gallic bias, magnifying their importance. In the main, it blandly retells highlights of the war with the uneducated narration of fading film star Martin Sheen. (The guy has a phenominal gift for mispronouncing names of men and places- even ones you wouldn't think could throw anyone, like Bayeaux or El Alemein, General Huntziger or Marshal Göring!)There's virually no sound bytes and no newsreel art, and a dreary, lifeless music track. But Far and above, the worst thing about this series is the colorizing. Why is this done again and again? They did a WWI set a while back, too. Is this to insure copyrightable versions of uncopyrightable black and white footage? Are those born after 1999 unable to tolarate B&W, so this is done to get them to watch? Whatever the reason, it's immoral, because they are making a fantasy eyesore out of reality. It takes away a lot of truth, to see make believe colors slathered on a screen that never existed between the viewer and the subject until now."
    },
    {
      "username": "Bill-16",
      "userUrl": "https://www.imdb.com/user/ur0005879",
      "reviewLink": "https://www.imdb.com/review/rw4600368",
      "warningSpoilers": false,
      "date": "22 January 2019",
      "rate": "8",
      "helpful": "1 out of 2 found this helpful.",
      "title": "Stunted by narration in USA",
      "content": "I saw this originally with an Australian narration, could be English or NZ. Martin Sheen is a very intense guy when acting. I like that very much. BUT, his narration is pretty bad here when compared with other countries version. The series is awesome and cover many things not in other documentaries. The fact that it was mostly made by French artists really is obvious. Martin Sheen loves to come up with his own pronunciation of towns and places. Some are laughable. Try and watch the 25 part WWII series narrated by Laurence Olivier, that is the best. Most participants of the war are interviewed from all sides, even the losers got to speak."
    },
    {
      "username": "lataillade1957",
      "userUrl": "https://www.imdb.com/user/ur17107666",
      "reviewLink": "https://www.imdb.com/review/rw3103139",
      "warningSpoilers": false,
      "date": "12 October 2014",
      "rate": "",
      "helpful": "5 out of 12 found this helpful.",
      "title": "polish cavalry did fight mounted ,germans armored unit.",
      "content": "The Polish campaign of September 1939 counted fifteen significant cavalry actions Two were pure fast cavalry charges with spears and sabers, others were fought on foot. The Poles claimed twelve victories, including successful breakout attempts. The most striking Battle of Mokra pitted the Wołyńska Cavalry Brigade headlong against the 4th Panzer Division with 295 tanks. The Poles repelled waves of tank and infantry attacks for two days, giving the Germans \"a bloody drubbing\". although ,when in defensive position,polish cavalry,would fight dismounted,numerous charge where made against panzer,and,motorized unit,which themselves were taken by surprise,therefore ,fighting as infantry."
    },
    {
      "username": "tinytots2",
      "userUrl": "https://www.imdb.com/user/ur144605672",
      "reviewLink": "https://www.imdb.com/review/rw7942366",
      "warningSpoilers": false,
      "date": "12 March 2022",
      "rate": "7",
      "helpful": "0 out of 0 found this helpful.",
      "title": "A succinct visual portrayal of the major events of World War II",
      "content": "As far as World War II documentaries go, you could do worse than Apocalypse: The Second War. Despite only a runtime of a little over 5 hours, this mini-series covers many of the significant developments of the conflict. Its biggest boon is the usage of extensive recorded and recolorised film footage which serves to paint a lurid and visceral picture of the loss of life and widespread devastation that resulted from the worldwide hostilities. The narration too is laudable, and the use of patriotic musical pieces and varied sound effects further amplifies the viewing experience.However, the show has its share of shortcomings. Made as it was for the French audience, a lot of its informative content is France-centric at the cost of including many other countries' motivations, political ideologies, war contributions, and associated tribulations. Another consequence of this is that the importance of the Pacific war theater is diminished in the presentation. Also, some more time devoted to the immediate aftermath would have been beneficial to reinforce the catastrophic impacts of the war on all the participants.These criticisms notwithstanding, Apocalypse: The Second World War is nonetheless an instructive and stirring portrayal of those tragic times. For viewers searching for comprehensive details or context, other shows like The World at War would prove more appropriate. On the other hand, mini-series like Battlefield would be better able to highlight nuanced tactical aspects. Apocalypse strikes a good balance and should be appreciated by anyone who is keen on war documentaries."
    }
  ],
  "errorMessage": ""
}