{
  "imDbId": "tt0387764",
  "title": "Peep Show",
  "fullTitle": "Peep Show (TV Series 2003–2015)",
  "type": "TVSeries",
  "year": "2003",
  "items": [
    {
      "username": "Danny_G13",
      "userUrl": "https://www.imdb.com/user/ur1577474",
      "reviewLink": "https://www.imdb.com/review/rw0963493",
      "warningSpoilers": false,
      "date": "15 November 2004",
      "rate": "",
      "helpful": "169 out of 181 found this helpful.",
      "title": "Deliciously dark and absolutely hilarious",
      "content": "Peep Show is a highly original effort in the world of British Comedy, and the trick it uses aids it as one of the funniest comedies of the last 10 years. You do need to be slightly thick-skinned to appreciate it though...Mark and Jeremy are 2 loser flat-mates. One's got a turgid office job and is in love with a colleague, and the other, Jeremy, is the leech without a job and failing miserably to do anything worthwhile with his life.On the face of it sounds not unlike Men Behaving Badly, and there are the 2 women both guys respectively pine for; one being the aforementioned colleague of Mark, and the other being the next door neighbour who Jeremy is desperate to 'have'. However, Peep Show does 2 things which make it quite unique and laugh-out-loud funny. Firstly it adopts a first person perspective so we see the action not as a 3rd party, but from the very points of view of the characters. Not only this, but we hear their thoughts as well, which means we know what they're really thinking as opposed to only hearing what they actually say. This is a terrific twist and provides genuine hilarity throughout.The second aspect it adopts is adult humour, and by this I don't mean Viz. It uses sexual situations, drugs, booze, and political incorrectness as incredibly risqué and dark humour, and goes beyond anything I've ever seen before, certainly in sitcom land. It's plainly obvious why it gets an 18 certificate (UK).Furthermore, the acting itself is absolutely great, and is incredibly conducive to to the script. Because of the strength of the script and the supreme acting, there are many genuinely toe-curling embarrassing moments (But never fail to make you laugh, as opposed to just making you cringe), along with some awkward silences where, for a moment, you actually sympathise with the characters because you 'are' them. But normal hilarity resumes soon after...This is a terrific series, and genuinely funny. It will not be to everyone's taste, but if you can laugh at yourself you can laugh at this.Highly recommended."
    },
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw1248215",
      "warningSpoilers": true,
      "date": "27 December 2005",
      "rate": "",
      "helpful": "42 out of 47 found this helpful.",
      "title": "Fresh and funny comedy that quickly gets over the slightly gimmicky feel it has on first viewing",
      "content": "Having just hit the end of series three in the UK it is a bit of a mystery why Peep Show has failed to hit the heights of The Office for example. However the fact that it remains quite a \"cult\" sort of programme means that those of us that watch it are allowed to be a little bit smug about the fact that we do. The concept behind the programme is the live of flatmates Jeremy and Mark - the former being a bit of a student type and the latter being a bit middle-class and repressed. Rather than just follow the story in a normal way, we see the action through their eyes and, more importantly, get to hear their thoughts in between the dialogue.This approach doesn't sound that clever or unique but I can assure you that it works much better than it sounds. The simple story lines are based around the recognisability of the characters and many of their thoughts are actually not that exaggerated. They are to a point of course, but not to an extreme and it is the familiarity of the characters that makes it work for me. The script is regularly spot on, with a real ear for dialogue, mixing the convincing with the absurd well and producing plenty of funny lines - again surprising me that the suitability for trailers and adverts of the material hasn't brought it more success.particularly in the Friday night slot that has previously shown to be such a winner for dross such as Friends as well as genuinely good comedies.With good writing comes the need for good delivery and thankfully the lead two are on the ball. Webb wears Jeremy like a second skin and is totally convincing in his rather selfish character. Although he is less \"cool\" of a character, Mitchell is equally as good as Mark and again is easily able to carry off a rather podgy and repressed man who would rather suffer in silence than make a public scene (annoyingly a trait that I can recognise in myself). The support is good but with the script focusing on the actions and thoughts of Mark and Jez it is no surprise that Mitchell and Webb do deservedly dominate the programme.Overall a fresh and funny comedy. The \"point of view\" thing does feel like a gimmick for a while when you first watch it, but the humour of the thoughts/voiceovers means that it is worth while and I quickly bought into it. Quite why it hasn't set the world on fire I can't say but it is definitely worth checking out on DVD if you haven't had the chance to watch it yet."
    },
    {
      "username": "dmateris82-426-768434",
      "userUrl": "https://www.imdb.com/user/ur35128081",
      "reviewLink": "https://www.imdb.com/review/rw2650690",
      "warningSpoilers": false,
      "date": "28 July 2012",
      "rate": "10",
      "helpful": "123 out of 127 found this helpful.",
      "title": "The best comedy show ever.",
      "content": "Peep Show should be watched, studied and enjoyed many times through out for anyone who loves to laugh, love and get a hint as to how to write a well scripted comedy. The characters, the writing and the format is all so original and hilarious. I watch this show probably every day. There is always something new to discover watching and I just fall more in love with the characters each time. Although I am a single female living in America in her late 20's, I had no idea I could have so much in common with a couple of male Brits. The inner monologue is dead on and the emotions are raw but total human. Brilliant. Brilliant.Brilliant."
    },
    {
      "username": "tramsbottom",
      "userUrl": "https://www.imdb.com/user/ur1157937",
      "reviewLink": "https://www.imdb.com/review/rw0934799",
      "warningSpoilers": false,
      "date": "12 December 2003",
      "rate": "",
      "helpful": "77 out of 89 found this helpful.",
      "title": "Excellent British Comedy",
      "content": "This is a little gem I found sadly relegated to late-night TV. It's an innovative comedy about two losers who are trying to be cool and get the girls, shot entirely with point-of-view angles (characters talk to the camera as a person or the camera IS the character, depending on who's speaking).I cannot recommend this show highly enough. British comedy seemed to be on the wane, but this is one of the best written, funniest shows around.Expect copycat shows using the same style of shooting POV any time soon."
    },
    {
      "username": "Ruskington",
      "userUrl": "https://www.imdb.com/user/ur99782462",
      "reviewLink": "https://www.imdb.com/review/rw5749297",
      "warningSpoilers": false,
      "date": "18 May 2020",
      "rate": "10",
      "helpful": "22 out of 25 found this helpful.",
      "title": "Ten Stars? Ten? That's insane",
      "content": "Along with Ricky Gervais' The Office, Peep Show is my favourite TV show and arguably one of the best sitcoms ever made. The unique inner monologue and POV filming style works to perfection thanks to David Mitchell's dry cynicism and Robert Webb's sneering apathy.The show takes some getting used to and I would implore everyone to watch at least the first two seasons before giving up on it. It hits it's peak between the 2nd and 4th seasons yet maintains a very high standard right to the end. On top of two great lead performances from Mitchell and Webb, the supporting cast of Olivia Colman, Matt King and Paterson Joseph (amongst many others) are incredible. The show cycles quickly through different characters and storylines and as a result it stays fresh and creative from start to finish.Not only should you watch Peep Show, you should probably rewatch it 3 or 4 times as well. From there you can join the various online groups dedicated to Peep Show memes and quotes and let it slowly dominate your entire life. This is the gift that keeps on giving, not much comes close."
    },
    {
      "username": "garydiamond",
      "userUrl": "https://www.imdb.com/user/ur5807286",
      "reviewLink": "https://www.imdb.com/review/rw1672180",
      "warningSpoilers": false,
      "date": "11 June 2007",
      "rate": "9",
      "helpful": "43 out of 48 found this helpful.",
      "title": "Dry humour that'll make you laugh...",
      "content": "...and also consider how strange your own life can be, how unusual your own thoughts and reasoning seem when viewed through the eyes of another. The idea is much more than a gimmick; it forms the backbone and provides a lot of the most hilarious and often shocking moments of the show.Like all good concepts that are given a successful platform to work from, you wonder why the idea wasn't more popular beforehand. Webb and Mitchell have a dark, dry sense of humour that will appeal only to certain individuals not so bound by convention, somewhat bohemian if you will. People not afraid to admit that their own thoughts and actions can seem completely bizarre when given a different perspective.To really appreciate the show you definitely have to put yourself in the shoes of the two leads. You have to share in their shame, humiliations and triumphs - literally getting out what you put in. This is no soap opera that you tune into so that you can tune out, this is one that demands your full attention.Webb and Mitchell have a lot of calibre as actors as this show is obviously very difficult to film, being as it is almost entirely filmed through the eyes of the duo. A lot of tricky close camera situations and complex edits are used and work seamlessly.It certainly won't appeal to everyone - if it did it wouldn't be a very good show would it? - but those ready for challenging, dynamic television should buy the first two seasons on DVD and enjoy."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw3398600",
      "warningSpoilers": true,
      "date": "19 January 2016",
      "rate": "9",
      "helpful": "14 out of 16 found this helpful.",
      "title": "Hilarious and brilliant series.",
      "content": "I never watched Peep show when it originally went out, for the life of me I don't know why. I love it, it gets funnier as it goes along, so many uncomfortable and cringe worthy moments, but the dynamic between the two is utterly magical, they're a brilliant comic duo. Patterson Joseph, Olivia Colman, Sophie Winkleman and others all brilliant.The humour works so well because the two main characters are so different, Jezz is a total layabout, lazy, Mark is quite well motivated, just socially awkward, both share the same issues, both are totally dysfunctional.Some wonderful highlights include Holiday, University Challenge, Jeremy's Mummy. The wedding episode is perhaps my favourite, just wonderful.The whole show is just different, I love that we get to hear the inner thoughts of the characters, I can't think where it's been done before, it's original. 9/10"
    },
    {
      "username": "wellthatswhatithinkanyway",
      "userUrl": "https://www.imdb.com/user/ur0345596",
      "reviewLink": "https://www.imdb.com/review/rw1934153",
      "warningSpoilers": false,
      "date": "22 August 2008",
      "rate": "10",
      "helpful": "14 out of 16 found this helpful.",
      "title": "An inspired and very funny comedy series that's enjoyed a lot of well deserved success",
      "content": "STAR RATING: ***** Saturday Night **** Friday Night *** Friday Morning ** Sunday Night * Monday Morning Peep Show is driven largely by hearing the inner thoughts of the two main characters. \"Up-tight arsehole\" we hear Jeremy (Robert Webb) think of Mark (David Mitchell) in the first series. \"Work shy freeloader\" we hear him think back. This basically sums the pair up, but to delve in a bit deeper Mark gets up and goes to work at a loan lending company every day, where he works up a success-failure set up with co worker Sophie (Olivia Colman) who he fancies, while Jeremy fails to hold down any sort of job and keeps latching onto unrealistic ideas to make it big in life, usually with the help of his retro-hippie mate Super Hans. They are two social misfits who find themselves in various different capers each episode, their inner thoughts ribbling with embarrassment, desire and inner rage.I'm surprised to see this cult British series has now been running since 2003! That's as long as Little Britain and I was expecting it to have been a bit more recent. But there you go. This is just as good, if not a bit better than that show. The humour relies more on subtlety and dry wit, rather than silliness and straight out vulgarity, although it's never afraid to push boundaries. The stars are kind of more likable too. Mitchell and Webb are back to their setup with The Mitchell and Webb Show (which this actually came before...way before!) Mitchell is a reserved, stammering man who occasionally loses it while Webb lays it on thicker than raspberry jam, as the boundlessly wild, enthusiastic Jeremy, who wears his heart on his sleeve a lot more. I wouldn't say it's better than that show, or any worse, they are both great shows in their own right, and the two performers give it that unique air that only they can give it just as much so here. I get the feeling they're playing themselves really and trying to make their hang ups into the stuff of amusement.And yet despite them playing social rejects, they're strangely relatable, as the embarrassing situations they find themselves in and the paranoid, rationalizing thoughts they have just weirdly feel like things that could be happening to you if you were in the situations they find themselves in.Highly enjoyable, this'll end up getting more than just a peep out of you. *****"
    },
    {
      "username": "dreamingskychild",
      "userUrl": "https://www.imdb.com/user/ur93974309",
      "reviewLink": "https://www.imdb.com/review/rw4978223",
      "warningSpoilers": false,
      "date": "5 July 2019",
      "rate": "10",
      "helpful": "25 out of 28 found this helpful.",
      "title": "If there is ambrosia, this is it.",
      "content": "Peep Show is the holy grail of comedy and uniqueness. Seriously I really don't know of a better comedy show. It has made me laugh out loud so many times. I have watched it over and over, I never get bored or sick of it. Of all shows, I excitedly and proudly recommend it to others. I really want everyone to give it a go. So grateful for the whole production, the unique and hilarious script, amazing actors, and so many seasons. I love, love Peep Show! I'm actually going to go watch it now ^_^ Do yourself a favour, and watch it too!"
    },
    {
      "username": "bevo-13678",
      "userUrl": "https://www.imdb.com/user/ur76062573",
      "reviewLink": "https://www.imdb.com/review/rw5591192",
      "warningSpoilers": false,
      "date": "30 March 2020",
      "rate": "10",
      "helpful": "21 out of 26 found this helpful.",
      "title": "Binge",
      "content": "One of my favourite shows to binge watch. I've lost count of how many times"
    },
    {
      "username": "freemantle_uk",
      "userUrl": "https://www.imdb.com/user/ur17571044",
      "reviewLink": "https://www.imdb.com/review/rw1877679",
      "warningSpoilers": false,
      "date": "21 May 2008",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Compulsory Viewing for all Students",
      "content": "Peep Show is one the best comedy shows to come of Britain for a long time. The golden age of comedy from our isle have been long gone and the BBC having being looking for cheap programmes and sketch show which are poor quality and the other channels haven't been much better. Peep Show is different, it is an original idea which is well written and brilliant preformed by David Mitchell and Robert Webb, two individuals that are naturally quick witted and very funny. Peep Show focuses on the lives of Mark and Jeremy. Mark is a social outcast and a loner, he is awful in social situations and longs to find a relationship. Jeremy is a unemployed loser, who enjoys sex, music and drugs (in that order), who believes he is a talented musician and thinks he is God's gift to women. Throughout the show you see the world through their eyes and hear their inter most thoughts. You also see how their relationships with other characters develop. These include Sophie, the woman Mark longs for, Nancy and Big Suze, the women that Jeremy is most interested, Super Hans, Jeremy's bang mate, Johnson, Mark's boss and Jeff, a horrible bully boy from Mark's workplace.The program is intelligently written and has many cultural references. It has quick witted humour and dark humour. The characters also develop and you end up caring for them, I do feel sorry for Mark at times. As well as the two leading actors it also has a good support cast. It is never over done and tries to be as real as possible. It is a good show and I hope the Americans don't remake the show. This is a program designed for a British audience."
    },
    {
      "username": "geeboy37",
      "userUrl": "https://www.imdb.com/user/ur6653338",
      "reviewLink": "https://www.imdb.com/review/rw4198882",
      "warningSpoilers": false,
      "date": "11 June 2018",
      "rate": "9",
      "helpful": "9 out of 9 found this helpful.",
      "title": "Damn near perfect",
      "content": "In my opinion no show is a perfect 10 but Peep Show comes pretty damm close. There really aren't any other shows out there who use this kind of format so it's originality is brilliant."
    },
    {
      "username": "dominicwoods-37076",
      "userUrl": "https://www.imdb.com/user/ur100951155",
      "reviewLink": "https://www.imdb.com/review/rw4747546",
      "warningSpoilers": false,
      "date": "27 March 2019",
      "rate": "10",
      "helpful": "12 out of 12 found this helpful.",
      "title": "Don't pass away without seeing Peep show",
      "content": "My number 1 series of all time.If you like to laugh or need cheering up..... Just shaded Curb your enthusiasm..."
    },
    {
      "username": "hooleydavid",
      "userUrl": "https://www.imdb.com/user/ur78611182",
      "reviewLink": "https://www.imdb.com/review/rw3763560",
      "warningSpoilers": false,
      "date": "25 July 2017",
      "rate": "8",
      "helpful": "10 out of 10 found this helpful.",
      "title": "One of the Best Comedy Shows to Watch whilst Eating",
      "content": "One of the best compliments that I can give a show or a film is that I'd certainly watch it whilst eating a meal. Sounds odd, but it's true. If I can't get into something when I'm eating, I'm not going to enjoy it at all. I must have watched every episode of Peep Show over a meal, whether it was lunch or dinner.The constant mayhem, awkwardness and exaggeration is present from episode one, right through to episode 54. The awkward, messy lives that both Mark and 'Jez' lead, alongside drug-addicted pal Super Hans means that there is always an opportunity for disaster around every single corner.I can't quite remember one bad episode of this show. Each one is funny for one reason or another.I would certainly recommend this show to anybody who is looking for something to watch (Whether over a meal or not), perfect for long journeys, evenings in, or a winter day filler."
    },
    {
      "username": "emmarosepollard",
      "userUrl": "https://www.imdb.com/user/ur102025752",
      "reviewLink": "https://www.imdb.com/review/rw4797795",
      "warningSpoilers": false,
      "date": "23 April 2019",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Example of British comedy at its finest",
      "content": "I first saw Peep Show about 7 years ago and haven't stopped watching it since. It's a perfect example of British comedy at its finest (like Blsckadder) - it's easy watching and I can binge on episodes so easily! The characters and storyline are well thought out. The earlier series are quite nostalgic for me and when going through all the series to the later series, you really develop a bond with the characters. It has so many amazing actors and actresses; Olivia Coleman, Robert Webb, David Mitchell etc. Just amazing."
    },
    {
      "username": "paul-2369",
      "userUrl": "https://www.imdb.com/user/ur11050768",
      "reviewLink": "https://www.imdb.com/review/rw3660258",
      "warningSpoilers": false,
      "date": "12 March 2017",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Totally hilarious comedy that I'm only just finding out about",
      "content": "Why have I only just discovered this comedy... I found all 9 series on Netflix a couple of weeks ago and I can't get enough, I watch whenever I get a free 30 minutes, I'm addicted and don't know how I lived with the show before.It's hilarious, every character is brilliant not just Mark and Jeremy , Big Suze, Super Hans, Johnson are all crazy characters. I'm now on series 4 and it's still not getting old in fact each episode seems better than the last because the characters grow on you and start predicting what's going to happen (not in bad why).Enough of this, I'm off to watch some more Peep Show.."
    },
    {
      "username": "prancinpie_1",
      "userUrl": "https://www.imdb.com/user/ur3482374",
      "reviewLink": "https://www.imdb.com/review/rw0998243",
      "warningSpoilers": false,
      "date": "13 January 2005",
      "rate": "",
      "helpful": "109 out of 118 found this helpful.",
      "title": "The best Brirish Comedy in years",
      "content": "It is true that this show did not attract a lot of viewers. I watched it on its first airing but, to be honest, this was pure luck, there was nothing else on to watch so i decided to watch it. After the first episode i was hooked. It was wonderfully written and just brilliant overall. Nearly everything is funny from the things each person says to the looks on their faces in certain situations. (See Jeremy's face when he refers to \"the bad thing\")After seeing it i had to tell my friends. People can get very proud when they say that they switched a particular group of people onto a film or T.V show and i am no different. It is a comedy i am proud i stumbled upon and a show i'm sure you'll love once you've seen.After series 1 i was disappointed, i knew that they wouldn't be making anymore, it was on the late night T.V slot and never talked about, i was horrified to know that there would be no more Peep show.Then BANG, Series 2 came on. And no, it didn't get worse. In fact i find it improved upon the first and seemed more confident. I am A big fan of the office but i find peep show somehow, well, i find it a lot funnier, don't know about you. 5/5"
    },
    {
      "username": "pokemon_trainer_lucas",
      "userUrl": "https://www.imdb.com/user/ur89292005",
      "reviewLink": "https://www.imdb.com/review/rw4224770",
      "warningSpoilers": false,
      "date": "3 July 2018",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "The Best TV Show EVER",
      "content": "I've never been so hooked by a TV show. It's a very honest and daring comedy that is as timeless as it is clever! It aims to shock, yet does so in a hilarious way that leaves you craving more. Some scenes are so jam-packed with awkward situations that you'll actually find yourself cringing as the duo try to cope with everyday life! I highly recommend this to all."
    },
    {
      "username": "furnacefuneral",
      "userUrl": "https://www.imdb.com/user/ur110510418",
      "reviewLink": "https://www.imdb.com/review/rw5558357",
      "warningSpoilers": false,
      "date": "17 March 2020",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Binged every season about 5 times over the last decade",
      "content": "Only show I've ever enjoyed this much besides in betweeners and red dwarf who are both also british tele. Mark and jez are just about the funniest combo I've ever seen. the audacity of their every day situations is absolutely hysterical. The situation with the baby around season 6 made me laugh until I cried as personally I've been through that exact situation and the baby turned out to be mine lol. Hes 17 months old and the best thing that's ever happened to me. I love this show 🤣"
    },
    {
      "username": "jboothmillard",
      "userUrl": "https://www.imdb.com/user/ur4248714",
      "reviewLink": "https://www.imdb.com/review/rw1425759",
      "warningSpoilers": true,
      "date": "21 July 2006",
      "rate": "9",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Peep Show",
      "content": "People have always wondered what goes inside other people's minds, and this point-of-view comedy allows us to. Basically the two main characters, David Mitchell as the fantastic insecure Mark Corrigan and Robert Webb as the more confident, but just as weird Jeremy Osborne, are the two focused. Basically every episode they have a story going on, mostly about their relationships, i.e. Mark with Green Wing's Olivia Colman as Sophie Chapman, and 'Jez' with whoever he can get, e.g. Elizabeth Marmur as Toni, Rachel Blanchard as Nancy and Road Trip's Sophie Winkleman as Big Suze. With these stories, you see through the eyes of the characters having conversation, and the two main guys, you can hear their hilarious thoughts. A very funny programme with a very clever concept. It was nominated the BAFTA twice for Best Situation Comedy Award, and it won the British Comedy Award for Best TV Comedy. Mark Corrigan was number 12 on The World's Greatest Comedy Characters, and the programme was number 17 on The 100 Greatest TV Treats 2003 (when it started). Very good!"
    },
    {
      "username": "spungonet",
      "userUrl": "https://www.imdb.com/user/ur3714016",
      "reviewLink": "https://www.imdb.com/review/rw0934801",
      "warningSpoilers": false,
      "date": "18 July 2004",
      "rate": "",
      "helpful": "77 out of 83 found this helpful.",
      "title": "Top Stuff!",
      "content": "An utterly, blindingly funny show from Channel 4 (which was put out on E4, for some reason. Why do they do that? ) It is a terrible shame that more people can't see it. If you like shows like Bottom, BlackAdder, Fifteen Stories High, etc., you'll love this. (Its adult content, however, may preclude less prurient viewers from concurring.) Brief summary: the camera acts alternately as either of the central characters in this show - hence the title. They are both deeply flawed individuals, unable to grasp the causal origins of their unmitigated life-failure, let alone find the inner resources to affect any solution. The show is really about pain - and you won't enjoy it unless you are quite capable of laughing at your own.Can't praise its originality enough. 10/10."
    },
    {
      "username": "bgsmall",
      "userUrl": "https://www.imdb.com/user/ur55269065",
      "reviewLink": "https://www.imdb.com/review/rw4837495",
      "warningSpoilers": false,
      "date": "8 May 2019",
      "rate": "9",
      "helpful": "12 out of 14 found this helpful.",
      "title": "Car crash TV at its finest: Art imitating life.",
      "content": "Having watched some of the episodes at time of broadcast on CH4, I felt a need to view the entire series from beginning to end, and yesterday I achieved that aim!The 30-soon to be 40-something's Mark and Jeremy navigate their work and personal relationships in unsynchronized tandem across the entire run of episodes. However, their methods in managing the lows and highs are diametrically opposed. Within that lies the awful crass, stupid, ignorant and very funny responses they choose. The overall hilarity is aided by each characters thoughts being verbalised to the viewer. Car crash TV at its finest, difficult to not sometimes think 'oh but for the grace of God go I'...."
    },
    {
      "username": "DavidYZ",
      "userUrl": "https://www.imdb.com/user/ur74935180",
      "reviewLink": "https://www.imdb.com/review/rw3689258",
      "warningSpoilers": false,
      "date": "20 April 2017",
      "rate": "9",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Excellent sitcom",
      "content": "A very well-written and well-acted sitcom, set in Croydon, South London. The two leads are very good as chalk-and-cheese flatmates. There are many other characters who are also very good. I've marked it down one because: a) it's not credible that hardworking Mark would allow lazy, directionless Jeremy to live off him as a parasite for over a decade; b) we never find out how they met and why they moved into the flat together."
    },
    {
      "username": "VictorianCushionCat",
      "userUrl": "https://www.imdb.com/user/ur1416597",
      "reviewLink": "https://www.imdb.com/review/rw1567285",
      "warningSpoilers": false,
      "date": "8 January 2007",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Make Sure You Take a Peep",
      "content": "For some time friends were telling me that I'd love Peep Show, but I never seemed to catch it on TV. However the other week I was able to see pretty much all of Series One/Two/Three on DVD and I'm happy to say these friends were correct.Classic 2 blokes Mark and Jez living togehter, holding each other back comedy, which we've seen many a time but a great touch hearing what each one is thinking (usually contradicting what they are saying) Good supporting cast help and it's fair to say that this comedy often hits the all too rare 'laugh out loud' funny.As is the recent fashion since 'The Office' relies heavily on 'cringe' factor but you'll be laughing more than not. The humour is often social anxiety and sexual, but is not afraid to descend (thankfully) to the wonders of basic toilet humour.Observe and laugh!"
    },
    {
      "username": "elliotjeory",
      "userUrl": "https://www.imdb.com/user/ur69864183",
      "reviewLink": "https://www.imdb.com/review/rw6006554",
      "warningSpoilers": false,
      "date": "18 August 2020",
      "rate": "8",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Classic comedy",
      "content": "Excellent original comedy, it's messed up but hilarious. Seasons are too short which is a shame and you get through it quickly but otherwise some great scenes and funny moments."
    }
  ],
  "errorMessage": ""
}