{
  "imDbId": "tt0387764",
  "title": "Peep Show",
  "fullTitle": "Peep Show (TV Series 2003–2015)",
  "type": "TVSeries",
  "year": "2003",
  "episodes": [
    {
      "id": "tt1221733",
      "seasonNumber": "5",
      "episodeNumber": "1",
      "title": "Burgling",
      "image": "https://m.media-amazon.com/images/M/MV5BN2I4N2Y4N2MtMGYwMy00MTdmLTk2NzctYzIwY2UyZDlkM2U0XkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "2 May 2008",
      "plot": "Jeremy encourages Mark to start dating again and sets him up with Heather, whom he gets on well with and decides she's \"the one.\" Jeremy is told by an ex-girlfriend he may have chlamydia, but uses this as excuse to get close to the now single again Big Suze. Meanwhile a spate of burglaries might help Mark prove his manhood to Heather in a bid to convince her that he's \"the one\" for her.",
      "imDbRating": "8.0",
      "imDbRatingCount": "619"
    },
    {
      "id": "tt1231048",
      "seasonNumber": "5",
      "episodeNumber": "2",
      "title": "Spin War",
      "image": "https://m.media-amazon.com/images/M/MV5BZWNlMDc0NjQtYjRhZi00MjFlLTk5YzYtOGFhN2I5YzMyNzk0XkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "9 May 2008",
      "plot": "Mark and Sophie both return to work after their disastrous wedding day, with Mark determined to \"Mandleson\" her in proving who should get all the blame. His only sympathizer is new IT girl Dobby, who's looking for something far more adventurous than a USB stick in the stationary cupboard. Jeremy and Super Hans rope Sophie's nephew Barney into their band when they realize he's actually got some musical talent but their gig is destined to end in disaster when Super Hans goes too far with seeing how far they can push Barney.",
      "imDbRating": "8.3",
      "imDbRatingCount": "618"
    },
    {
      "id": "tt1234115",
      "seasonNumber": "5",
      "episodeNumber": "3",
      "title": "Jeremy's Broke",
      "image": "https://m.media-amazon.com/images/M/MV5BZDhkMWJjOTUtNDM4Yi00ZDIwLWI3NmUtYmRhNTU1ZjhkYzk0XkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "16 May 2008",
      "plot": "Mark is fed up with Jeremy and decides to evict him, installing an Australian woman named Saz in his place, hoping she'll become his new girlfriend so he can rub Sophie's nose in it at his forthcoming Birthday party. Jeremy is desperate for money and having exhausted the sperm bank, he resorts to stealing Johnson's credit card.",
      "imDbRating": "7.7",
      "imDbRatingCount": "560"
    },
    {
      "id": "tt1234116",
      "seasonNumber": "5",
      "episodeNumber": "4",
      "title": "Jeremy's Mummy",
      "image": "https://m.media-amazon.com/images/M/MV5BNWQzNzg4YmQtNmMxMS00NmI5LThlMDYtODhhNDZlMTc4YTJhXkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "23 May 2008",
      "plot": "When Jeremy's aunt dies, his mum agrees to give him half the inheritance to the tune of £20000. But his mum's new boyfriend, Martin, believes Jez needs to be taught how to use money properly and so his money will be governed by Mark. Martin's seemingly lesbian daughter Natalie takes a shine to Mark, when he begins working on her father's memoirs - and she won't take no for an answer.",
      "imDbRating": "8.1",
      "imDbRatingCount": "587"
    },
    {
      "id": "tt1234117",
      "seasonNumber": "5",
      "episodeNumber": "5",
      "title": "Jeremy's Manager",
      "image": "https://m.media-amazon.com/images/M/MV5BMWM3YTNiODMtODAwNy00Mzg5LWFiZDItNTA5ZDA3ZGIwZmEwXkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "30 May 2008",
      "plot": "Jeremy and Super Hans are thrilled when super-confident Cally agrees to be their manager, but less so when it turns out they're playing at a Christian rock festival. Mark, under the belief that Cally is \"the one\", joins up as roadie and finds her quite susceptible to his dubious charms. But when she decides Jeremy is holding Super Hans back, Mark has to decide between his new lover or his best friend's happiness.",
      "imDbRating": "8.1",
      "imDbRatingCount": "555"
    },
    {
      "id": "tt1234118",
      "seasonNumber": "5",
      "episodeNumber": "6",
      "title": "Mark's Women",
      "image": "https://m.media-amazon.com/images/M/MV5BODYxNDEyMjItYTM1MS00NTVkLTkwMDUtMmU4NjVlODNlYTQ2XkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2008",
      "released": "6 Jun. 2008",
      "plot": "Mark's promotion bolsters his confidence, he's getting closer to Dobby through a shared love of fantasy role-playing game and Sophie's ready to annul their marriage - but a drunken one night stand has life changing consequences. Jeremy decides that his life is going nowhere and joins a cult, which gives him a new outlook on life completely. With Mark and Jeremy's lives moving in different directions is this really the end of the El Dude brothers?",
      "imDbRating": "8.3",
      "imDbRatingCount": "574"
    }
  ],
  "errorMessage": ""
}