{
  "imDbId": "tt0387764",
  "title": "Peep Show",
  "fullTitle": "Peep Show (TV Series 2003–2015)",
  "type": "TVSeries",
  "year": "2003",
  "episodes": [
    {
      "id": "tt2128656",
      "seasonNumber": "8",
      "episodeNumber": "1",
      "title": "Jeremy Therapised",
      "image": "https://m.media-amazon.com/images/M/MV5BZDQxZWI2ZjUtNmU1Yy00NmVkLWJlMjctODBlMTk5N2MxOGVmXkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "25 Nov. 2012",
      "plot": "A month has passed. Dobby has still not said that she will move in with Mark and Jeremy has not said he will move out. Mark invites Dobby round to share a pizza and watch 'The Apprentice' but unfortunately Gerrard, her other admirer, dies of the flu that evening and Dobby feels guilty for not being with him. Jeremy decides to undergo therapy which, after an inauspicious start, he loves. Mark goes for a job with a bathroom fittings company but the final interview clashes with Gerrard's funeral so he has to make a brief oration before leaving. At the wake Mark again ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "553"
    },
    {
      "id": "tt2128657",
      "seasonNumber": "8",
      "episodeNumber": "2",
      "title": "Business Secrets of the Pharaohs",
      "image": "https://m.media-amazon.com/images/M/MV5BMzEyZWRlM2MtMWE4Yy00ZmI2LWI2ZTYtZTU5MzBkM2U3ZmZkXkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "2 Dec. 2012",
      "plot": "Now a big name in bathroom sales, though annoyed that Dobby has a new job in I.T., Mark writes a book, entitled 'Business Secrets of the Pharaohs' and even finds a publisher in Greg, who meets him at a refreshment stand. However Mark is told he must foot half the publishing costs. Jeremy decides to be a life coach and goes on a week's course but is the only candidate to fail - largely because he made such bizarre sexual demands of course leader Celia - though he does work out that Mark has been conned by Greg.",
      "imDbRating": "7.6",
      "imDbRatingCount": "515"
    },
    {
      "id": "tt2128658",
      "seasonNumber": "8",
      "episodeNumber": "3",
      "title": "The Love Bunker",
      "image": "https://m.media-amazon.com/images/M/MV5BNzZhMWJmMTYtMzVjNi00NGYyLTg2ZDEtN2Y4M2EwNmE1ZmU2XkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "9 Dec. 2012",
      "plot": "Simon,Dobby's ex-boyfriend,asks Mark,Jeremy and Super Hans to join him on the paint-balling day Dobby has bought as his birthday present. Simon puts Dobby and himself into the opposing team to Mark and Jeremy,leading Mark to believe it is all a ploy to win Dobby back. Dobby and Jeremy bond over a joint but Mark is stuck in a bunker with a stoned Hans. When Hans makes a break for it and aims his paint-gun at Dobby Jeremy gallantly steps into the line of fire to take one for her.",
      "imDbRating": "8.1",
      "imDbRatingCount": "530"
    },
    {
      "id": "tt2128659",
      "seasonNumber": "8",
      "episodeNumber": "4",
      "title": "Big Mad Andy",
      "image": "https://m.media-amazon.com/images/M/MV5BMjAzNDRjYWYtNDJmMi00NGYyLWE0ZGQtODNiNjhjMTVlNzQwXkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "16 Dec. 2012",
      "plot": "Jeremy agrees to move out of the flat and share with Super Hans but Dobby would prefer to go inter-railing across Europe than move in with Mark. To make things worse for Mark not only has Hans been promoted above him at work, making him Mark's boss but Jeremy has arranged for the unstable Big Mad Andy to decorate the flat - largely so that Jeremy can sign him up for life skills coaching. Mark finds solace in an MBA evening class, meeting the elegant Stephanie and Jeremy, strangely in love with Dobby, urges him to pursue her but Mark cops out when he gets a call from ...",
      "imDbRating": "7.5",
      "imDbRatingCount": "492"
    },
    {
      "id": "tt2128660",
      "seasonNumber": "8",
      "episodeNumber": "5",
      "title": "Chairman Mark",
      "image": "https://m.media-amazon.com/images/M/MV5BYWVlNWFmYjctZDUwYy00YzliLWI5ZmUtY2I3NWViODU1MjJiXkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "23 Dec. 2012",
      "plot": "Jeremy is moving again, to stay with Mark's sister Sarah and her five-year old son Joshy, for whom he is something of a toy. Despite Jeremy having taken all his chairs Mark hosts the residents association for the flat block and is elected chairman - though he does use the funds for his own repairs. On the down side he is less successful as a taps salesman despite Jeremy's efforts to help and Dobby tells him she will not be moving in with him. He will not be alone though, for, having had enough of Sarah and surviving an uncomfortable night at Big Mad Andy's, Jeremy ...",
      "imDbRating": "7.5",
      "imDbRatingCount": "477"
    },
    {
      "id": "tt2128661",
      "seasonNumber": "8",
      "episodeNumber": "6",
      "title": "Quantocking II",
      "image": "https://m.media-amazon.com/images/M/MV5BZGEzZmIzZWYtNmY0MS00MWZhLWIwZTMtODVmNjc4ZTM5N2VkXkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2012",
      "released": "24 Dec. 2012",
      "plot": "Mark is hoping Dobby will move in with him so Jeremy has to move back with Super Hans,who stays up all night and keeps snakes. Dobby has a job offer in New York from ex-boyfriend Simon so Mark decides he and Dobby should have a picnic in the country where he can declare his feelings for her. Sadly for him Jeremy,who is also in love with Dobby,turns up as well,leading Dobby to believe that they are gay as they are so inseparable. The two men start to fight over Dobby only to discover she has gone. Later she texts to say she is heading for New York.",
      "imDbRating": "7.8",
      "imDbRatingCount": "498"
    }
  ],
  "errorMessage": ""
}