{
  "imDbId": "tt0387764",
  "title": "Peep Show",
  "fullTitle": "Peep Show (TV Series 2003–2015)",
  "type": "TVSeries",
  "year": "2003",
  "episodes": [
    {
      "id": "tt0672481",
      "seasonNumber": "2",
      "episodeNumber": "1",
      "title": "Dance Class",
      "image": "https://m.media-amazon.com/images/M/MV5BMjQxZWM3MjktNWRhYi00NmFmLThjNTMtMjlmZDU3ZTNjNmYzXkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "12 Nov. 2004",
      "plot": "In order to pull Sophie away from Jeff, Mark hacks into her email account in order to find out her thoughts on him. This leads him into going to her \"Rainbow Rhythms\" dance class. Here Jeremy meets a sexually liberated American girl named Nancy who is determined to break the most bizarre sexual taboos, with the help of Jeremy. However Jeremy becomes jealous when Gwyn, another member of Rainbow Rhythms, begins to attract the nymphomaniacal attentions of Nancy.",
      "imDbRating": "8.5",
      "imDbRatingCount": "766"
    },
    {
      "id": "tt0672482",
      "seasonNumber": "2",
      "episodeNumber": "2",
      "title": "Jeremy Makes It",
      "image": "https://m.media-amazon.com/images/M/MV5BOTQwZjg2ZDktMDc5My00ODdlLTg2OGMtMDVlNzE3ZmY4YmM5XkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "19 Nov. 2004",
      "plot": "Jeremy runs into an old acquaintance from school who he used to pick on but has become successful now and hires Jeremy to make a soundtrack for a film he's making. Mark makes a new friend at work who turns out to hold a fair amount of prejudice. Meanwhile, Sophie spends time with Jeff.",
      "imDbRating": "8.2",
      "imDbRatingCount": "747"
    },
    {
      "id": "tt0672483",
      "seasonNumber": "2",
      "episodeNumber": "3",
      "title": "Local Zero",
      "image": "https://m.media-amazon.com/images/M/MV5BZWQ0ZmQ1OWQtMjc2OS00NTMyLWE2MDUtNzI1NzY5MzYzNjI1XkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "26 Nov. 2004",
      "plot": "Jeremy wants to get closer to Nancy so he tries to impress her by joining in her volunteer work for the homeless. However, to Jeremy's dismay, Nancy suggests that in order to break the last sexual taboo, they should stop having sex. Mark manages to get Johnson to pick him to go on a business trip with Sophie instead of Jeff, however trouble begins when embarrassing news footage of himself drinking in a public park makes all Johnson think he is an alcoholic.",
      "imDbRating": "7.7",
      "imDbRatingCount": "657"
    },
    {
      "id": "tt0672484",
      "seasonNumber": "2",
      "episodeNumber": "4",
      "title": "University Challenge",
      "image": "https://m.media-amazon.com/images/M/MV5BODA3ZjE2YzUtNWVjMS00YTVmLTkzYTgtODc3YmU1N2QxYzU2XkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "3 Dec. 2004",
      "plot": "Mark meets a girl called April working in a shoe shop with the ideal combination of good looks and low self esteem, and when he returns to see her again he discover that she has gone back to university, which happens to be the same university he and Jeremy went to. And Jeremy is also going there to do a gig with a band, so they both take a trip down to the university. Mark pretends he's signed up to the same history course as April in order to see more of her and begins to shine in his knowledge of the subject matter.",
      "imDbRating": "8.5",
      "imDbRatingCount": "748"
    },
    {
      "id": "tt0672485",
      "seasonNumber": "2",
      "episodeNumber": "5",
      "title": "The Man Show",
      "image": "https://m.media-amazon.com/images/M/MV5BMDMyZjRjODktNWJjMy00MGJiLTk5OWEtNzM5MWRhMGY5MDJjXkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "10 Dec. 2004",
      "plot": "When Sophie tells Mark that she and Jeff are moving in together, she tells him that Jeff wants her to spend less time with him. In a bid to get past this he tries to become friends with Jeff, but Jeremy ends up getting on with Jeff much better than he does. However, Mark gets Jeremy to reveal information about Jeff talking to other women and uses it to ruin his relationship with Sophie.",
      "imDbRating": "7.8",
      "imDbRatingCount": "636"
    },
    {
      "id": "tt0672486",
      "seasonNumber": "2",
      "episodeNumber": "6",
      "title": "Wedding",
      "image": "https://m.media-amazon.com/images/M/MV5BOTBjNjUxYTQtM2RkZS00NzIyLWE3M2YtNTQ5NDdkYmY1Nzg5XkEyXkFqcGdeQXVyMTgyMzEyNDY@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "17 Dec. 2004",
      "plot": "Jeremy agrees to marry Nancy in order to make her eligible for a visa, and whilst she insists it's purely an administrative procedure, Jeremy's sure it will be the happiest administrative procedure of their lives. Mark is pleased to see Sophie and Jeff breaking up but finds it hard to make his move and ends up being set up on a date with another woman. A jealous Toni starts an affair with Jeremy.",
      "imDbRating": "8.1",
      "imDbRatingCount": "655"
    }
  ],
  "errorMessage": ""
}