{
  "imDbId": "tt0387764",
  "title": "Peep Show",
  "fullTitle": "Peep Show (TV Series 2003–2015)",
  "type": "TVSeries",
  "year": "2003",
  "language": "en",
  "titleInLanguage": "Peep Show (British TV series)",
  "url": "https://en.wikipedia.org/wiki/Peep_Show_(British_TV_series)",
  "plotShort": {
    "plainText": "Peep Show is a British television sitcom starring David Mitchell and Robert Webb. It was written by Jesse Armstrong and Sam Bain, with additional material by Mitchell and Webb, among others. It was broadcast on Channel 4 from 2003 until 2015. In 2010, it became the longest-running comedy in Channel 4 history in terms of years on air.\r\nPeep Show follows the lives of Mark Corrigan (Mitchell) and Jeremy \"Jez\" Usbourne (Webb), two very different, dysfunctional best friends who share a flat in Croydon, South London. Mark is a socially awkward and despondent loan manager, while Jeremy is a childish slacker and unemployed musician who lives in Mark's spare room. Stylistically, the show uses point of view shots—giving the programme its title—with the thoughts of main characters Mark and Jeremy audible as voice-overs. The show is also noted for its veristic portrayal of human life through a general lack of conventional character development in Mark and Jeremy, and their purgatorial lifestyle together from their twenties to their forties as a result of their shared inability to change.\r\nThe show has been described Bain as portraying \"the stubborn persistence of human suffering\", and, through the exploration of existentialism and loneliness, as a realistic portrayal of \"why ordinary people are evil\", while Armstrong said it was \"about oddball male friendship, perhaps even 'masculinity'\".\r\nDespite never achieving high viewing figures during its original run, Peep Show received consistent critical acclaim and has since become a cult classic. In April 2019, three years after its final episode, the series was named the 13th greatest British sitcom in a poll by Radio Times. It has also been described as one of the best television programmes ever produced in the 21st century.",
    "html": "<p>Peep Show is a British television sitcom starring David Mitchell and Robert Webb. It was written by Jesse Armstrong and Sam Bain, with additional material by Mitchell and Webb, among others. It was broadcast on Channel 4 from 2003 until 2015. In 2010, it became the longest-running comedy in Channel 4 history in terms of years on air.</p><p>Peep Show follows the lives of Mark Corrigan (Mitchell) and Jeremy \"Jez\" Usbourne (Webb), two very different, dysfunctional best friends who share a flat in Croydon, South London. Mark is a socially awkward and despondent loan manager, while Jeremy is a childish slacker and unemployed musician who lives in Mark's spare room. Stylistically, the show uses point of view shots—giving the programme its title—with the thoughts of main characters Mark and Jeremy audible as voice-overs. The show is also noted for its veristic portrayal of human life through a general lack of conventional character development in Mark and Jeremy, and their purgatorial lifestyle together from their twenties to their forties as a result of their shared inability to change.</p><p>The show has been described Bain as portraying \"the stubborn persistence of human suffering\", and, through the exploration of existentialism and loneliness, as a realistic portrayal of \"why ordinary people are evil\", while Armstrong said it was \"about oddball male friendship, perhaps even 'masculinity'\".</p><p>Despite never achieving high viewing figures during its original run, Peep Show received consistent critical acclaim and has since become a cult classic. In April 2019, three years after its final episode, the series was named the 13th greatest British sitcom in a poll by Radio Times. It has also been described as one of the best television programmes ever produced in the 21st century.</p>"
  },
  "plotFull": {
    "plainText": "Peep Show is a British television sitcom starring David Mitchell and Robert Webb. It was written by Jesse Armstrong and Sam Bain, with additional material by Mitchell and Webb, among others. It was broadcast on Channel 4 from 2003 until 2015. In 2010, it became the longest-running comedy in Channel 4 history in terms of years on air.\r\nPeep Show follows the lives of Mark Corrigan (Mitchell) and Jeremy \"Jez\" Usbourne (Webb), two very different, dysfunctional best friends who share a flat in Croydon, South London. Mark is a socially awkward and despondent loan manager, while Jeremy is a childish slacker and unemployed musician who lives in Mark's spare room. Stylistically, the show uses point of view shots—giving the programme its title—with the thoughts of main characters Mark and Jeremy audible as voice-overs. The show is also noted for its veristic portrayal of human life through a general lack of conventional character development in Mark and Jeremy, and their purgatorial lifestyle together from their twenties to their forties as a result of their shared inability to change.\r\nThe show has been described Bain as portraying \"the stubborn persistence of human suffering\", and, through the exploration of existentialism and loneliness, as a realistic portrayal of \"why ordinary people are evil\", while Armstrong said it was \"about oddball male friendship, perhaps even 'masculinity'\".\r\nDespite never achieving high viewing figures during its original run, Peep Show received consistent critical acclaim and has since become a cult classic. In April 2019, three years after its final episode, the series was named the 13th greatest British sitcom in a poll by Radio Times. It has also been described as one of the best television programmes ever produced in the 21st century.\r\nCast and characters\r\nMain\r\nDavid Mitchell as Mark Corrigan, a loan manager at fictional company JLB Credit. Intelligent and hard-working, but also pessimistic and socially awkward, Mark is the owner of the flat in Croydon, which he shares with his friend from university, Jeremy.\r\nRobert Webb as Jeremy \"Jez\" Usborne, an unemployed aspiring musician and a \"work-shy freeloader\" who lives in the spare room of Mark's flat. He is selfish, juvenile, and arrogant, while considering himself to be immensely talented and attractive. Although superficially more socially skilled than Mark, his over-confidence and narcissism mean that in practice he is equally socially inept.\r\nRecurring\r\nOlivia Colman as Sophie Hortensia Chapman (series 1–7, 9), a co-worker at JLB, who becomes scruffy and unstable, and serves as a love interest for Mark (and occasionally Jeremy) throughout much of the series. She and Mark eventually marry but divorce shortly afterwards, and she later gives birth to his child.\r\nMatt King as Super Hans, Jeremy's bandmate and friend, and an untrustworthy fantasist who regularly uses recreational drugs. He appears in every series, appearing in 36 out of the 54-episode run. It is revealed in the second episode of the ninth series that his real name is Simon.\r\nElizabeth Marmur as Toni (series 1–2), Mark and Jeremy's neighbour and romantic interest.\r\nNeil Fitzmaurice as Jeff Heaney, a colleague and nemesis of Mark's at JLB. The two frequently clash over the affections of Sophie, with Jeff's manly, intimidating behaviour serving as a foil to Mark's mild-mannered persona.\r\nPaterson Joseph as Alan Johnson, a senior loan manager at JLB and Mark's boss for much of the series. He is suave, highly confident and exploitative of others, and maintains a particularly reckless approach to business and life. Mark is in awe of him.\r\nRachel Blanchard as Nancy (series 2, 4), a free-spirited, exceptionally beautiful but slightly dysfunctional American woman who Jeremy has a relationship with.\r\nSophie Winkleman as Big Suze (series 3–7), Jeremy's ex-girlfriend and frequent romantic interest. She is attractive but naive, and described by Mark as a \"mental posho\".\r\nJim Howick as Gerrard Matthew (series 4–8), Mark's sickly coworker and sometimes-friend at JLB, and later, his rival for Dobby's affections.\r\nIsy Suttie as Dobby (series 5–9), an IT worker at JLB and a self-confessed misfit, much like Mark, who quickly develops strong feelings for her and the couple have a dysfunctional relationship. She is frequently disappointed by Mark.\r\nProduction\r\nWriters Jesse Armstrong and Sam Bain met actors/writers Mitchell and Webb during a failed attempt to complete a team-written sitcom for the BBC. They had an old, unproduced script that they wanted to revive called All Day Breakfast and brought in Mitchell and Webb to help out. The show did not work out but the four developed as a partnership, and one idea eventually evolved into Peep Show for Channel 4. Peep Show was originally conceived as a sitcom in the style of Beavis and Butt-head revolving around two characters watching and discussing television. However, the idea was dropped due to the large expense that airing clips from other shows would bring as well as Mitchell and Webb's fear that, because their characters would only be watching television, \" wouldn't be in the show\".\r\nInstead, Armstrong and Bain opted to produce a more story-based sitcom with an unconventional filming style. The events of the two main characters' lives are seen almost exclusively from their own points of view with a voice-over providing their internal thoughts. Scenes in the show are sometimes filmed using cameras strapped to the actors' heads, or attached to a hat, to give the viewer a point of view identical to that of the protagonists. The quality of footage captured with this method is sometimes poor and the technique was used less and less in later series. When head-mounted cameras are not used, scenes are filmed with the camera being held over the actor's shoulder, or directly in front of their face; each scene is therefore shot multiple times from different angles. Armstrong and Bain's choice of the style was influenced by the 2000 Channel 4 documentary Being Caprice about the model Caprice Bourret which featured a similar technique that had in turn been copied from the 1999 film Being John Malkovich. Bain noted: \"So it's a third-hand steal, really. We thought it would be great for comedy, hearing someone else's thoughts. The voices give you a whole other dimension in terms of jokes.\" The idea for using voice-overs came from a scene in the Woody Allen film Annie Hall in which the true feelings of the characters are conveyed by subtitles. The POV technique separates Peep Show from other sitcoms and Mitchell claims that without it Peep Show would be similar to shows like Spaced and Men Behaving Badly.\r\nTwo pilots were filmed for the show, which allowed Armstrong and Bain to firmly develop and finalise the style of the show. Armstrong said, \"On the run of doing those two pilots, we really created the show in the way that you couldn't if you hadn't tried it out.\" In the original pilot, Olivia Colman's character Sophie Chapman had a voice-over as well as Mitchell and Webb's characters Mark and Jeremy. The POV technique was also restricted solely to the character thinking at the time; it was later expanded so that the view could come from a third party. Bain and Armstrong are the show's principal writers and Mitchell and Webb provide additional material. Many story lines come from experiences in the writers' lives, particularly Bain's. For example, the series 5 episode \"Burgling\" sees Mark apprehend a burglar by sitting on him, something Bain once did in a video shop before he was told to get off as he was scaring the customers. The writing for each series takes place seven to eight months before filming begins; once each episode is mapped out scene by scene they must be approved by the producer Andrew O'Connor and Channel 4. Rehearsals take two weeks and filming lasts for six to seven weeks.\r\nFor the first two series, the scenes set in Mark and Jeremy's flat were filmed in a real property in Croydon, where the show takes place. The flat's owners did not allow it to be used for series 3, so a replica was constructed in a carpet warehouse in Neasden. Further filming took place at West London Film Studios. Mark and Jeremy's flat was chosen to be in Croydon because pilot director, Jeremy Wooding, “liked the idea of there being trams”, but Channel 4 stopped him using trams in the series.\r\nThe theme tune for the first series was an original composition by Daniel Pemberton and is featured on his TVPOPMUZIK album, and can be heard on his Myspace page. From the second series onwards, the theme music is the song \"Flagpole Sitta\" by the American band Harvey Danger (although the original first series composition was still heard briefly during scene changes). A working title for the programme was POV, as noted by David Mitchell on the DVD commentary for the first episode of the first series.\r\nIn 2005, The Carsey-Werner Company created a pilot for a US remake starring Johnny Galecki as Mark. However, the pilot failed, and the series was never produced. Galecki went on to star in The Big Bang Theory shortly afterwards.\r\nSpike TV commissioned its own version in 2008, originally to be written and directed by Robert Weide, who is the executive producer of Curb Your Enthusiasm. It was to be written by Armstrong and Bain, but it never went to series.\r\nIn May 2019, Sam Bain, co-creator of the original Peep Show series, confirmed in a Guardian article that another US remake is in the works in collaboration with FX Networks. It was being written by Karey Dorenetto and would feature two female leads, but thus far has not come to fruition.\r\nSeries overview\r\nSeries 1\r\nMark and Jez start out with similar aims of sleeping with their next-door neighbour Toni (Elizabeth Marmur). Jez does this, while she is separating from her husband, Tony. Mark is obsessed with his colleague Sophie (Olivia Colman), who is more interested in their manly colleague Jeff. Mark has a one-night stand with a teenage goth girl. Mark and Jez endure awkward situations: Mark admires his boss, Alan Johnson (Paterson Joseph), and struggles to work out whether or not he is sexually attracted to him. Jez remembers engaging in fellatio with Super Hans (Matt King) during a drug binge. Sophie beats Mark to a promotion, so Mark and Jez desperately team up to prank call Sophie, which leads to her shooting them with a pellet gun. They also launch a pepper spray attack on Super Hans, who has begun a fling with Toni. Mark sees a therapist, and nearly succeeds in having sex with Sophie, but this chance is ruined by Jez's apparent drug overdose. Shortly afterwards, Jez claims to Toni that he has a terminal illness in order to persuade her to have sex with him.\r\nSeries 2\r\nTony moves back in with Toni. Super Hans develops a crack cocaine addiction. At Sophie's dance class, Jez meets, falls in love with and starts an relationship with Nancy (Rachel Blanchard), an attractive and happy-go-lucky American. They briefly enjoy a wild sex life, but tensions brew after she makes it clear that she believes in free love, announcing that she has no commitment to him in front of their friends without his consent. Jez is further humiliated by Nancy having sex with a member of the dance class in front of him, but he remains naively enamoured with her. Things make a turn for the worst for Jez after Nancy then decides to become celibate. Jez briefly appears to be having some success with his music career with Super Hans. Mark's life is falling apart, as Sophie plans to move in with Jeff. Mark forges a brief friendship with a colleague, Daryl, which he ends after he discovers that Daryl is a Neo-Nazi. Mark falls for a shy, attractive student in a shoe shop and makes an ill-judged visit to his old university, Dartmouth, where she studies. Mark finds out from Jez that Jeff has been cheating on Sophie, and when Mark informs Sophie of that, Sophie begins slowly to end the relationship. Nancy asks Jez to marry her, for visa reasons, and despite the fact she does not love him and he will get nothing out of the marriage, he accepts gleefully out of his own love of her. Out of concerns for Nancy arguably using him, Mark gets Super Hans to lie to Jez and say that the latter had sex with her, but after they see his reaction they cannot go through with it. Jez and Nancy do get married despite Mark's efforts, but after they decide to start having sex again Jez admits to Nancy, who is now his wife, that he hooked up with Toni. Despite her previously making it clear to Jeremy that their wedding would be just a meaningless \"administrative procedure\" – and her own infidelity – Nancy angrily leaves him.\r\nSeries 3\r\nThe series begins with Jez in a relationship with Michelle, of whom he is not fond but with whom he stays as they plan a threesome with another woman. Big Suze (Sophie Winkleman) re-enters Jez's life, but has a new boyfriend, Stu, whom Jez is both deeply jealous of and somewhat sexually attracted to. Despite Stu's benevolence towards him, Jez plans to punch him, which ends in him getting punched himself. Mark and Sophie have finally become a couple, but their relationship is made difficult by Mark's unwillingness both to be intimate with her and to do pleasurable things she has taken an interest in, such as clubbing and drug-taking. This hesitance is worsened when Mark is \"mugged\" by some unarmed street thugs (whom he non-forcibly gives his phone and wallet to out of cowardice), which, much to Sophie's horror, leads him to carry around an illegal knife. Things get worse for the couple when Mark is separated from Sophie once again when their employer relocates her to Bristol. Merry, Jez and Mark's friend from university, visits and Mark arranges for her to be sectioned. Jez and Super Hans attempt to run a pub. Jez holds a magic mushroom party in the flat. Jez has a fling with Mark's sister, whom he quickly grows to dislike, while Mark falls in love with Suze. Jez becomes extremely jealous with Mark and Suze's closeness, and outs his feelings for her in front of them both. Despite Big Suze seeming to have genuine mutual feelings for Mark, he ruins the opportunity due to his lack of self-esteem and feelings of obligation towards Sophie. Jez serves on a jury and has a date with the female defendant. In the last episode, Jez tries to get back together with Suze but is hindered somewhat by Super Hans attempting to go cold turkey. Meanwhile, Mark, having ruined his chances of starting a relationship with Big Suze, plans to propose to Sophie, and becomes obsessed and neurotic about doing so. He spends his saved-up Sunday Times \"mega-vouchers\" on taking her to a hotel in the Quantocks, a trip on which Jez, Big Suze and a withdrawing Super Hans accompany him. Despite it being apparent that Mark has privately begun to loathe Sophie, he nonetheless remains committed to proposing to her. Sophie gets lost out on the hills one night, forcing Mark and Jez to go and look for her. They then get even more lost themselves; it is only after Jez asks Mark what he truly likes about Sophie that he changes his mind about the proposal, upon coming to terms with the truth that they not only have nothing in common, but that he also finds her incredibly annoying. However, Sophie accidentally finds his engagement ring in his bag before he returns and \"says yes\", which Mark reluctantly accepts to avoid embarrassment.\r\nSeries 4\r\nRecently engaged Mark and Sophie visit Sophie's parents' house, where Jez has sex with Sophie's mother. Mark's attempt, at Johnson's request, to head a group of staff to formulate a merger between two departments is a failure, which leads to him being humiliated at JLB's conference. Big Suze breaks up with Jez once again after Johnson offers to pay him in order to have sex with her and he agrees. Despite being disgusted by the offer, she subsequently starts a relationship with Johnson claiming that he is an \"alpha male\". In an attempt to get away from Sophie, Mark joins a gym and discovers that Nancy is working there, after which Jez makes a failed attempt to reconcile. Sophie leaves on a business trip to Frankfurt, leaving Mark to consider a fling with a woman whom he recently met at his school reunion. Jez finds some well-paid work as a handyman for \"The Orgazoid\", one of his musical heroes, but discovers that his new employer expects him to give him \"a hand\". Mark and Sophie attend couples' counselling, which Mark hopes will unearth all their problems and end the engagement, but the sessions instead focus on his poor sexual performances. For Mark's stag do, he and Jeremy spend a weekend on a narrowboat on the Shropshire Union Canal, where they meet two sisters in a pub. After meeting the businessman father of the women, Mark attempts to secure a job with him in Bangalore as a means of escaping his upcoming wedding. The plan backfires when Jez accidentally kills the family's pet dog. They find out when a series of attempts to cover it up lead to him eating it. On Mark's wedding day, Mark has resigned himself to marrying Sophie. Meanwhile, Jez is having difficulty juggling a hungover Super Hans, his best man speech and Nancy's imminent return to America. On the way to the church, Mark impulsively proposes to a woman in a cafe and steps out in front of a car making him realise that he should call the wedding off. However, after hiding in the church with Jez while all the guests arrive, Mark, with visible reluctance, feels obliged to marry Sophie when Jez gives away their hiding place. However, realising he was trying to get out of marrying her by hiding, Sophie runs out on Mark after the ceremony, planning to seek an annulment because he is \"horrible\". Jez gets into the car with Mark after he sees Nancy kissing Super Hans.\r\nSeries 5\r\nMuch of the series revolves around Mark's search for \"the one\". His first date since his wedding is a double date which goes wrong due to going to a boring play, his date being uninterested in him and then returning to the house to find a burglar. He asks out the IT girl, Dobby (Isy Suttie), although the date ends badly when they find a vomiting Sophie in the toilets, who reveals to Dobby that she is married to him. Dobby remains interested, even when Mark rejects her offer to be his date at his upcoming birthday party to take a young Australian woman whom he had recently met whilst speed dating. Jez runs out of money and steals from Johnson's credit card and is temporarily evicted by Mark. Jez asks Big Suze if he can stay with her and Johnson, but is rejected. He tries to obtain money from his mother after his great aunt dies, which reveals their strained relationship. Mark, however, thrives in her company and is given the job of writing her boyfriend's military biography. Angry, Jeremy ruins Mark's ambitions by revealing how Mark was raped by the veteran's daughter, which she had initiated while he was asleep. Jeremy and Hans get a manager, Cally, for their band and go to a music festival. Jez and Mark both have sex with Cally, but she quickly rejects both of them. Mark fails to ask Dobby out and she finally moves on. Jez and Hans join a cult. Mark is promoted to Senior Credit Manager by Johnson but does not fire Sophie as ordered, after she reveals that she is pregnant with what may be his child. In the closing moments of the series, Jez tells Mark that he recently had sex with Sophie and that her baby might be his.\r\nSeries 6\r\nThe series begins with JLB Credit closing down. Sophie tells Mark and Jez that Jeff is also a possible father of her baby. The mystery is solved when Sophie reveals that Mark is the baby's father. Jez meets Elena, a beautiful young Eastern European woman and occasional marijuana dealer who lives in their building. Jeremy quickly falls in love with her, but things deteriorate when it is revealed that Elena has a long-term partner, Gail, who is returning to London. Mark looks for work, starting a company with an ill-equipped Johnson, almost landing his dream job as a guide for historic walks, then becoming a waiter in Gail's Mexican restaurant—all the while trying to get anywhere with Dobby. To resolve their woman troubles, Jeremy and Mark host a party, which ends in Jeremy trying to rekindle his love for Elena, Mark failing to win over Dobbie, and Gail and Elena deciding to enter into a civil partnership. Mark pledges to take driving lessons in order to drive Sophie to the hospital when the baby arrives, but lies to her when he fails his test. Jeremy is upset over losing Elena, especially after she reveals that she is moving to Quebec with Gail. Sophie goes into labour early, and with Mark forced to reveal he cannot drive, a drunk Jeremy attempts to drive Sophie to the hospital and nearly runs Gail over. Jeremy admits that he and Elena were having an affair, then Sophie drives herself to the hospital with the two boys in the back seat.\r\nSeries 7\r\nZahra and her boyfriend Ben are introduced, whom Jez meets while Sophie is giving birth. Jez is instantly attracted to Zahra and is selfishly pleased when he discovers that Ben is in a coma, potentially making Zahra single. However, Ben recovers fully, and, as thanks for being so friendly to Zahra, offers Jez a job with his record company, which Jez accepts as he hopes it will allow him to get closer to Zahra. The job does not go well, and his attempts to sign up his and Super Hans's band fails badly and ends up with him being fired from the band. Mark finally beats off competition from Gerrard to become Dobby's boyfriend, although he continues to behave awkwardly in her company. Gail sacks Mark from his job at the restaurant. Jez pretends to be an intellectual in order to impress Zahra, which enables him to have sex with her. When Mark comes to meet him the next morning the two find themselves locked in Zahra's flat, causing Ben to discover them and Mark to miss his son's christening. Jez, Hans, Dobby, Mark, Mark's sister and parents all have Christmas dinner at Jez and Mark's, with Mark pretending Dobby is a platonic friend rather than a girlfriend; Mark's father humiliates Dobby when he realises they are together, and she leaves, causing an enraged Mark to put his Christmas dinner through a paper shredder. After Zahra tells Jez that she has split from Ben, Jez accepts her offer to move in with her. Mark, needing to salvage his relationship with Dobby, asks her to move in with him, to which she agrees. Zahra rejects Jez after she learns he has been flirting with Super Hans's girlfriend, dumping him.\r\nSeries 8\r\nThe series begins with Mark waiting for Dobby to move in, while Dobby waits for Jez to move out. Mark suspects that Dobby will never move in, and that Gerrard is trying to steal her from him; however, Gerrard dies of flu. Jez and Super Hans amicably end their band, and this causes Jez to contemplate his life so far: he eventually agrees to undertake therapy sessions, which are paid for by Mark. Impressed by the therapy, Jez decides to become a life coach, but he fails a course of questionable value. Mark then gives Jez a fake life coach certificate and he begins \"coaching\" anyone who will let him, causing emotional and personal harm. Mark writes a book, which is published by an incompetent vanity publisher. Mark, Dobby, Jez and Hans go paintballing. Mark gets a job at the bathroom supplies company where Hans works, but is soon sacked. He also starts an evening course to gain an MBA. Jez falls in love with Dobby and declares his feelings, as does Mark. While Mark and Jez fight, Dobby leaves the scene and heads to New York, where she has a new job.\r\nSeries 9\r\nThe final series opens with Mark and Jez meeting for the first time since their fight over Dobby, with Mark still bearing a grudge over the role Jez played in his break-up with her. Jez is living in Super Hans's bathroom, while Mark has a new flatmate. After reconciling, Jez moves back in with Mark and they go back to their old ways. Jez begins a relationship with a younger man, Joe, and also has sex with Joe's girlfriend Megan. Mark seeks out April (Catherine Shepherd—previously seen only in a single episode in series 2), whom he always thought to be his perfect woman, despite her now being married. Dobby has moved to New York and has a new boyfriend. He beats up Mark when he discovers Mark had been tracking Dobby's movements. Hans marries Molly in Norfolk. Sophie turns up at the flat depressed and appears to have a drink problem. She is in a relationship with a man whom she thinks is having an affair. She offers Mark a chance to give their relationship another go, which he initially accepts, but Mark decides to try and break up April's marriage and start a new life with her. In the final episode, all the duo's past lies and selfish decisions catch up with them. Mark loses his job at a bank because of a loan he gave Jez previously (ironically, to exploit him) without asking for correct identification paperwork, and he is replaced by his rival Jeff. Joe leaves Jez after his lies about him being popular and young are caught out, and Jez claims he is tired of partying all the time. Super Hans's wife is upset because he is unwilling to stop his old disreputable lifestyle, and after he kidnaps and threatens April's husband, she finally leaves him. Super Hans ends up leaving for Macedonia to open a moped hire business and leaves Mark and Jez right back where they always end up due to their bad choices, with Mark losing his newest relationship and job, while Jez remains stuck in a rut with no prospects. It ends with the two watching TV together, asking and answering inane questions, with Jez thinking to himself how they both \"love each other really\" and Mark reminding himself that he \"simply must get rid of him\".\r\nReception\r\nThe series was met with critical acclaim, and is considered to be a cult television show. Early previews called it \"promising\" and noted it had \"the sniff of a cult favourite\"; Jane Simon of The Daily Mirror claimed that Peep Show in years to come will \"be seen as the pinnacle of comedy it obviously is.\" Peep Show won the titles \"The Best Returning British TV Sitcom 2007\" and \"Comedy of the Year 2008\" in The Comedy.co.uk Awards.\r\nThe Guardian newspaper described it as \"the best comedy of the decade\". The Times praised the show's \"scorching writing\" and named it the 15th best TV show of the 2000s.\r\nRicky Gervais has been cited as saying \"the last thing I got genuinely excited about on British TV was Peep Show, which I thought was the best sitcom since Father Ted\". While presenting an award at the 2005 British Comedy Awards, Gervais called it \"the best show on television today\" and said it was a \"debacle\" that it did not win an award.\r\nIn 2019, Peep Show was named the 13th greatest British sitcom of all time in a poll by Radio Times. In the same year, The Guardian ranked it 9th on its list of the 100 best TV shows of the 21st century. In 2021, the BBC ranked it 42nd on a list of the 100 greatest TV series of the 21st century.\r\nIn June 2020, a scene from series 2 episode 1 of Jeremy in blackface was removed from Netflix due to concerns over racism.\r\nRatings\r\nDespite the critical acclaim, Peep Show never garnered consistently high viewing figures. At the beginning of 2006 there were rumours that the show would not be commissioned for a fourth series due to insufficient ratings of just over a million viewers. However, due to the large DVD revenues of the previous series, a fourth series was commissioned. The premiere of the fourth series showed no improvement on the ratings of the previous one, continuing to attract its core audience of 1.3 million (8% of viewers). Despite the low viewing figures, the fifth series of the show was commissioned prior to the broadcast of series 4. Channel 4's decision to commission the show for a fifth series was said to be for a variety of reasons, including again the high DVD sales of the previous series (400,000 to date), the continued high quality of the show itself, and the rising profile of Mitchell and Webb due to the success of their BBC sketch show That Mitchell and Webb Look, their advertisements for Apple, and their feature film Magicians. The fifth series showed no improvement with 1.1 million viewers. Producer Andrew O'Connor cited the POV filming style as the reason for the low ratings: \"It made it feel original and fresh and got it commissioned for a second series, but it stopped it from being a breakout hit and stopped it finding a bigger audience.\" Bain and Armstrong agreed that the POV style stopped it from becoming mainstream.\r\nThe first episode of series 6 – the first to be shown in its new earlier time slot of 10pm – attracted Peep Show's highest ratings to date, with 1.8 million viewers (9.2% audience share), with a further 208,000 (1.8%) watching it on Channel 4 +1.\r\nAwards and honours\r\nOther awards:\r\nIn 2007, 2009 and 2010, Peep Show was voted \"Best Returning British TV Sitcom\" in the Comedy.co.uk Awards. In 2008 it was voted \"Comedy of the Year\".\r\nOther media\r\nA book entitled Peep Show: The Scripts and More, which featured the scripts of every episode from the first five series as well as an introduction from Mitchell and Webb, was released in 2008. To celebrate the show, Channel 4 aired a Peep Show Night on Christmas Eve in 2010, which included the documentary Peep Show and Tell and the fan-selected episodes \"Wedding\" (s4 e6) and \"Shrooming\" (s3 e3).\r\nIn 2018, a fan-hosted podcast was created, called ‘Podcast Secrets of the Pharaohs’, a play on words based on the book ‘Business Secrets of the Pharaohs', a fictional book in the show. Hosted by Rob Graham and Tom Harrison, the podcast reviewed episodes of the show, alongside guests, including David Mitchell, Robert Webb, Paterson Joseph, Vera Filatova, Sophie Winkleman and Paul Clayton. The podcast concluded in 2022.",
    "html": "<p>Peep Show is a British television sitcom starring David Mitchell and Robert Webb. It was written by Jesse Armstrong and Sam Bain, with additional material by Mitchell and Webb, among others. It was broadcast on Channel 4 from 2003 until 2015. In 2010, it became the longest-running comedy in Channel 4 history in terms of years on air.</p><p>Peep Show follows the lives of Mark Corrigan (Mitchell) and Jeremy \"Jez\" Usbourne (Webb), two very different, dysfunctional best friends who share a flat in Croydon, South London. Mark is a socially awkward and despondent loan manager, while Jeremy is a childish slacker and unemployed musician who lives in Mark's spare room. Stylistically, the show uses point of view shots—giving the programme its title—with the thoughts of main characters Mark and Jeremy audible as voice-overs. The show is also noted for its veristic portrayal of human life through a general lack of conventional character development in Mark and Jeremy, and their purgatorial lifestyle together from their twenties to their forties as a result of their shared inability to change.</p><p>The show has been described Bain as portraying \"the stubborn persistence of human suffering\", and, through the exploration of existentialism and loneliness, as a realistic portrayal of \"why ordinary people are evil\", while Armstrong said it was \"about oddball male friendship, perhaps even 'masculinity'\".</p><p>Despite never achieving high viewing figures during its original run, Peep Show received consistent critical acclaim and has since become a cult classic. In April 2019, three years after its final episode, the series was named the 13th greatest British sitcom in a poll by Radio Times. It has also been described as one of the best television programmes ever produced in the 21st century.</p><br/><h3>Cast and characters</h3><h4>Main</h4><ul><li>David Mitchell as Mark Corrigan, a loan manager at fictional company JLB Credit. Intelligent and hard-working, but also pessimistic and socially awkward, Mark is the owner of the flat in Croydon, which he shares with his friend from university, Jeremy.</li><li>Robert Webb as Jeremy \"Jez\" Usborne, an unemployed aspiring musician and a \"work-shy freeloader\" who lives in the spare room of Mark's flat. He is selfish, juvenile, and arrogant, while considering himself to be immensely talented and attractive. Although superficially more socially skilled than Mark, his over-confidence and narcissism mean that in practice he is equally socially inept.</li></ul><h4>Recurring</h4><ul><li>Olivia Colman as Sophie Hortensia Chapman (series 1–7, 9), a co-worker at JLB, who becomes scruffy and unstable, and serves as a love interest for Mark (and occasionally Jeremy) throughout much of the series. She and Mark eventually marry but divorce shortly afterwards, and she later gives birth to his child.</li><li>Matt King as Super Hans, Jeremy's bandmate and friend, and an untrustworthy fantasist who regularly uses recreational drugs. He appears in every series, appearing in 36 out of the 54-episode run. It is revealed in the second episode of the ninth series that his real name is Simon.</li><li>Elizabeth Marmur as Toni (series 1–2), Mark and Jeremy's neighbour and romantic interest.</li><li>Neil Fitzmaurice as Jeff Heaney, a colleague and nemesis of Mark's at JLB. The two frequently clash over the affections of Sophie, with Jeff's manly, intimidating behaviour serving as a foil to Mark's mild-mannered persona.</li><li>Paterson Joseph as Alan Johnson, a senior loan manager at JLB and Mark's boss for much of the series. He is suave, highly confident and exploitative of others, and maintains a particularly reckless approach to business and life. Mark is in awe of him.</li><li>Rachel Blanchard as Nancy (series 2, 4), a free-spirited, exceptionally beautiful but slightly dysfunctional American woman who Jeremy has a relationship with.</li><li>Sophie Winkleman as Big Suze (series 3–7), Jeremy's ex-girlfriend and frequent romantic interest. She is attractive but naive, and described by Mark as a \"mental posho\".</li><li>Jim Howick as Gerrard Matthew (series 4–8), Mark's sickly coworker and sometimes-friend at JLB, and later, his rival for Dobby's affections.</li><li>Isy Suttie as Dobby (series 5–9), an IT worker at JLB and a self-confessed misfit, much like Mark, who quickly develops strong feelings for her and the couple have a dysfunctional relationship. She is frequently disappointed by Mark.</li></ul><br/><h3>Production</h3><p>Writers Jesse Armstrong and Sam Bain met actors/writers Mitchell and Webb during a failed attempt to complete a team-written sitcom for the BBC. They had an old, unproduced script that they wanted to revive called All Day Breakfast and brought in Mitchell and Webb to help out. The show did not work out but the four developed as a partnership, and one idea eventually evolved into Peep Show for Channel 4. Peep Show was originally conceived as a sitcom in the style of Beavis and Butt-head revolving around two characters watching and discussing television. However, the idea was dropped due to the large expense that airing clips from other shows would bring as well as Mitchell and Webb's fear that, because their characters would only be watching television, \" wouldn't be in the show\".</p><p>Instead, Armstrong and Bain opted to produce a more story-based sitcom with an unconventional filming style. The events of the two main characters' lives are seen almost exclusively from their own points of view with a voice-over providing their internal thoughts. Scenes in the show are sometimes filmed using cameras strapped to the actors' heads, or attached to a hat, to give the viewer a point of view identical to that of the protagonists. The quality of footage captured with this method is sometimes poor and the technique was used less and less in later series. When head-mounted cameras are not used, scenes are filmed with the camera being held over the actor's shoulder, or directly in front of their face; each scene is therefore shot multiple times from different angles. Armstrong and Bain's choice of the style was influenced by the 2000 Channel 4 documentary Being Caprice about the model Caprice Bourret which featured a similar technique that had in turn been copied from the 1999 film Being John Malkovich. Bain noted: \"So it's a third-hand steal, really. We thought it would be great for comedy, hearing someone else's thoughts. The voices give you a whole other dimension in terms of jokes.\" The idea for using voice-overs came from a scene in the Woody Allen film Annie Hall in which the true feelings of the characters are conveyed by subtitles. The POV technique separates Peep Show from other sitcoms and Mitchell claims that without it Peep Show would be similar to shows like Spaced and Men Behaving Badly.</p><p>Two pilots were filmed for the show, which allowed Armstrong and Bain to firmly develop and finalise the style of the show. Armstrong said, \"On the run of doing those two pilots, we really created the show in the way that you couldn't if you hadn't tried it out.\" In the original pilot, Olivia Colman's character Sophie Chapman had a voice-over as well as Mitchell and Webb's characters Mark and Jeremy. The POV technique was also restricted solely to the character thinking at the time; it was later expanded so that the view could come from a third party. Bain and Armstrong are the show's principal writers and Mitchell and Webb provide additional material. Many story lines come from experiences in the writers' lives, particularly Bain's. For example, the series 5 episode \"Burgling\" sees Mark apprehend a burglar by sitting on him, something Bain once did in a video shop before he was told to get off as he was scaring the customers. The writing for each series takes place seven to eight months before filming begins; once each episode is mapped out scene by scene they must be approved by the producer Andrew O'Connor and Channel 4. Rehearsals take two weeks and filming lasts for six to seven weeks.</p><p>For the first two series, the scenes set in Mark and Jeremy's flat were filmed in a real property in Croydon, where the show takes place. The flat's owners did not allow it to be used for series 3, so a replica was constructed in a carpet warehouse in Neasden. Further filming took place at West London Film Studios. Mark and Jeremy's flat was chosen to be in Croydon because pilot director, Jeremy Wooding, “liked the idea of there being trams”, but Channel 4 stopped him using trams in the series.</p><p>The theme tune for the first series was an original composition by Daniel Pemberton and is featured on his TVPOPMUZIK album, and can be heard on his Myspace page. From the second series onwards, the theme music is the song \"Flagpole Sitta\" by the American band Harvey Danger (although the original first series composition was still heard briefly during scene changes). A working title for the programme was POV, as noted by David Mitchell on the DVD commentary for the first episode of the first series.</p><p>In 2005, The Carsey-Werner Company created a pilot for a US remake starring Johnny Galecki as Mark. However, the pilot failed, and the series was never produced. Galecki went on to star in The Big Bang Theory shortly afterwards.</p><p>Spike TV commissioned its own version in 2008, originally to be written and directed by Robert Weide, who is the executive producer of Curb Your Enthusiasm. It was to be written by Armstrong and Bain, but it never went to series.</p><p>In May 2019, Sam Bain, co-creator of the original Peep Show series, confirmed in a Guardian article that another US remake is in the works in collaboration with FX Networks. It was being written by Karey Dorenetto and would feature two female leads, but thus far has not come to fruition.</p><br/><h3>Series overview</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Series</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">19 September 2003</td><td style=\"padding:0 8px\">24 October 2003</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">12 November 2004</td><td style=\"padding:0 8px\">17 December 2004</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">11 November 2005</td><td style=\"padding:0 8px\">16 December 2005</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">13 April 2007</td><td style=\"padding:0 8px\">18 May 2007</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">2 May 2008</td><td style=\"padding:0 8px\">6 June 2008</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">18 September 2009</td><td style=\"padding:0 8px\">23 October 2009</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>7</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">26 November 2010</td><td style=\"padding:0 8px\">29 December 2010</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>8</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">25 November 2012</td><td style=\"padding:0 8px\">24 December 2012</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>9</span></span></span></span></th><td colspan=\"2\">6</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">11 November 2015</td><td style=\"padding:0 8px\">16 December 2015</td></tr></tbody></table><h4>Series 1</h4><p>Mark and Jez start out with similar aims of sleeping with their next-door neighbour Toni (Elizabeth Marmur). Jez does this, while she is separating from her husband, Tony. Mark is obsessed with his colleague Sophie (Olivia Colman), who is more interested in their manly colleague Jeff. Mark has a one-night stand with a teenage goth girl. Mark and Jez endure awkward situations: Mark admires his boss, Alan Johnson (Paterson Joseph), and struggles to work out whether or not he is sexually attracted to him. Jez remembers engaging in fellatio with Super Hans (Matt King) during a drug binge. Sophie beats Mark to a promotion, so Mark and Jez desperately team up to prank call Sophie, which leads to her shooting them with a pellet gun. They also launch a pepper spray attack on Super Hans, who has begun a fling with Toni. Mark sees a therapist, and nearly succeeds in having sex with Sophie, but this chance is ruined by Jez's apparent drug overdose. Shortly afterwards, Jez claims to Toni that he has a terminal illness in order to persuade her to have sex with him.</p><h4>Series 2</h4><p>Tony moves back in with Toni. Super Hans develops a crack cocaine addiction. At Sophie's dance class, Jez meets, falls in love with and starts an relationship with Nancy (Rachel Blanchard), an attractive and happy-go-lucky American. They briefly enjoy a wild sex life, but tensions brew after she makes it clear that she believes in free love, announcing that she has no commitment to him in front of their friends without his consent. Jez is further humiliated by Nancy having sex with a member of the dance class in front of him, but he remains naively enamoured with her. Things make a turn for the worst for Jez after Nancy then decides to become celibate. Jez briefly appears to be having some success with his music career with Super Hans. Mark's life is falling apart, as Sophie plans to move in with Jeff. Mark forges a brief friendship with a colleague, Daryl, which he ends after he discovers that Daryl is a Neo-Nazi. Mark falls for a shy, attractive student in a shoe shop and makes an ill-judged visit to his old university, Dartmouth, where she studies. Mark finds out from Jez that Jeff has been cheating on Sophie, and when Mark informs Sophie of that, Sophie begins slowly to end the relationship. Nancy asks Jez to marry her, for visa reasons, and despite the fact she does not love him and he will get nothing out of the marriage, he accepts gleefully out of his own love of her. Out of concerns for Nancy arguably using him, Mark gets Super Hans to lie to Jez and say that the latter had sex with her, but after they see his reaction they cannot go through with it. Jez and Nancy do get married despite Mark's efforts, but after they decide to start having sex again Jez admits to Nancy, who is now his wife, that he hooked up with Toni. Despite her previously making it clear to Jeremy that their wedding would be just a meaningless \"administrative procedure\" – and her own infidelity – Nancy angrily leaves him.</p><h4>Series 3</h4><p>The series begins with Jez in a relationship with Michelle, of whom he is not fond but with whom he stays as they plan a threesome with another woman. Big Suze (Sophie Winkleman) re-enters Jez's life, but has a new boyfriend, Stu, whom Jez is both deeply jealous of and somewhat sexually attracted to. Despite Stu's benevolence towards him, Jez plans to punch him, which ends in him getting punched himself. Mark and Sophie have finally become a couple, but their relationship is made difficult by Mark's unwillingness both to be intimate with her and to do pleasurable things she has taken an interest in, such as clubbing and drug-taking. This hesitance is worsened when Mark is \"mugged\" by some unarmed street thugs (whom he non-forcibly gives his phone and wallet to out of cowardice), which, much to Sophie's horror, leads him to carry around an illegal knife. Things get worse for the couple when Mark is separated from Sophie once again when their employer relocates her to Bristol. Merry, Jez and Mark's friend from university, visits and Mark arranges for her to be sectioned. Jez and Super Hans attempt to run a pub. Jez holds a magic mushroom party in the flat. Jez has a fling with Mark's sister, whom he quickly grows to dislike, while Mark falls in love with Suze. Jez becomes extremely jealous with Mark and Suze's closeness, and outs his feelings for her in front of them both. Despite Big Suze seeming to have genuine mutual feelings for Mark, he ruins the opportunity due to his lack of self-esteem and feelings of obligation towards Sophie. Jez serves on a jury and has a date with the female defendant. In the last episode, Jez tries to get back together with Suze but is hindered somewhat by Super Hans attempting to go cold turkey. Meanwhile, Mark, having ruined his chances of starting a relationship with Big Suze, plans to propose to Sophie, and becomes obsessed and neurotic about doing so. He spends his saved-up Sunday Times \"mega-vouchers\" on taking her to a hotel in the Quantocks, a trip on which Jez, Big Suze and a withdrawing Super Hans accompany him. Despite it being apparent that Mark has privately begun to loathe Sophie, he nonetheless remains committed to proposing to her. Sophie gets lost out on the hills one night, forcing Mark and Jez to go and look for her. They then get even more lost themselves; it is only after Jez asks Mark what he truly likes about Sophie that he changes his mind about the proposal, upon coming to terms with the truth that they not only have nothing in common, but that he also finds her incredibly annoying. However, Sophie accidentally finds his engagement ring in his bag before he returns and \"says yes\", which Mark reluctantly accepts to avoid embarrassment.</p><h4>Series 4</h4><p>Recently engaged Mark and Sophie visit Sophie's parents' house, where Jez has sex with Sophie's mother. Mark's attempt, at Johnson's request, to head a group of staff to formulate a merger between two departments is a failure, which leads to him being humiliated at JLB's conference. Big Suze breaks up with Jez once again after Johnson offers to pay him in order to have sex with her and he agrees. Despite being disgusted by the offer, she subsequently starts a relationship with Johnson claiming that he is an \"alpha male\". In an attempt to get away from Sophie, Mark joins a gym and discovers that Nancy is working there, after which Jez makes a failed attempt to reconcile. Sophie leaves on a business trip to Frankfurt, leaving Mark to consider a fling with a woman whom he recently met at his school reunion. Jez finds some well-paid work as a handyman for \"The Orgazoid\", one of his musical heroes, but discovers that his new employer expects him to give him \"a hand\". Mark and Sophie attend couples' counselling, which Mark hopes will unearth all their problems and end the engagement, but the sessions instead focus on his poor sexual performances. For Mark's stag do, he and Jeremy spend a weekend on a narrowboat on the Shropshire Union Canal, where they meet two sisters in a pub. After meeting the businessman father of the women, Mark attempts to secure a job with him in Bangalore as a means of escaping his upcoming wedding. The plan backfires when Jez accidentally kills the family's pet dog. They find out when a series of attempts to cover it up lead to him eating it. On Mark's wedding day, Mark has resigned himself to marrying Sophie. Meanwhile, Jez is having difficulty juggling a hungover Super Hans, his best man speech and Nancy's imminent return to America. On the way to the church, Mark impulsively proposes to a woman in a cafe and steps out in front of a car making him realise that he should call the wedding off. However, after hiding in the church with Jez while all the guests arrive, Mark, with visible reluctance, feels obliged to marry Sophie when Jez gives away their hiding place. However, realising he was trying to get out of marrying her by hiding, Sophie runs out on Mark after the ceremony, planning to seek an annulment because he is \"horrible\". Jez gets into the car with Mark after he sees Nancy kissing Super Hans.</p><h4>Series 5</h4><p>Much of the series revolves around Mark's search for \"the one\". His first date since his wedding is a double date which goes wrong due to going to a boring play, his date being uninterested in him and then returning to the house to find a burglar. He asks out the IT girl, Dobby (Isy Suttie), although the date ends badly when they find a vomiting Sophie in the toilets, who reveals to Dobby that she is married to him. Dobby remains interested, even when Mark rejects her offer to be his date at his upcoming birthday party to take a young Australian woman whom he had recently met whilst speed dating. Jez runs out of money and steals from Johnson's credit card and is temporarily evicted by Mark. Jez asks Big Suze if he can stay with her and Johnson, but is rejected. He tries to obtain money from his mother after his great aunt dies, which reveals their strained relationship. Mark, however, thrives in her company and is given the job of writing her boyfriend's military biography. Angry, Jeremy ruins Mark's ambitions by revealing how Mark was raped by the veteran's daughter, which she had initiated while he was asleep. Jeremy and Hans get a manager, Cally, for their band and go to a music festival. Jez and Mark both have sex with Cally, but she quickly rejects both of them. Mark fails to ask Dobby out and she finally moves on. Jez and Hans join a cult. Mark is promoted to Senior Credit Manager by Johnson but does not fire Sophie as ordered, after she reveals that she is pregnant with what may be his child. In the closing moments of the series, Jez tells Mark that he recently had sex with Sophie and that her baby might be his.</p><h4>Series 6</h4><p>The series begins with JLB Credit closing down. Sophie tells Mark and Jez that Jeff is also a possible father of her baby. The mystery is solved when Sophie reveals that Mark is the baby's father. Jez meets Elena, a beautiful young Eastern European woman and occasional marijuana dealer who lives in their building. Jeremy quickly falls in love with her, but things deteriorate when it is revealed that Elena has a long-term partner, Gail, who is returning to London. Mark looks for work, starting a company with an ill-equipped Johnson, almost landing his dream job as a guide for historic walks, then becoming a waiter in Gail's Mexican restaurant—all the while trying to get anywhere with Dobby. To resolve their woman troubles, Jeremy and Mark host a party, which ends in Jeremy trying to rekindle his love for Elena, Mark failing to win over Dobbie, and Gail and Elena deciding to enter into a civil partnership. Mark pledges to take driving lessons in order to drive Sophie to the hospital when the baby arrives, but lies to her when he fails his test. Jeremy is upset over losing Elena, especially after she reveals that she is moving to Quebec with Gail. Sophie goes into labour early, and with Mark forced to reveal he cannot drive, a drunk Jeremy attempts to drive Sophie to the hospital and nearly runs Gail over. Jeremy admits that he and Elena were having an affair, then Sophie drives herself to the hospital with the two boys in the back seat.</p><h4>Series 7</h4><p>Zahra and her boyfriend Ben are introduced, whom Jez meets while Sophie is giving birth. Jez is instantly attracted to Zahra and is selfishly pleased when he discovers that Ben is in a coma, potentially making Zahra single. However, Ben recovers fully, and, as thanks for being so friendly to Zahra, offers Jez a job with his record company, which Jez accepts as he hopes it will allow him to get closer to Zahra. The job does not go well, and his attempts to sign up his and Super Hans's band fails badly and ends up with him being fired from the band. Mark finally beats off competition from Gerrard to become Dobby's boyfriend, although he continues to behave awkwardly in her company. Gail sacks Mark from his job at the restaurant. Jez pretends to be an intellectual in order to impress Zahra, which enables him to have sex with her. When Mark comes to meet him the next morning the two find themselves locked in Zahra's flat, causing Ben to discover them and Mark to miss his son's christening. Jez, Hans, Dobby, Mark, Mark's sister and parents all have Christmas dinner at Jez and Mark's, with Mark pretending Dobby is a platonic friend rather than a girlfriend; Mark's father humiliates Dobby when he realises they are together, and she leaves, causing an enraged Mark to put his Christmas dinner through a paper shredder. After Zahra tells Jez that she has split from Ben, Jez accepts her offer to move in with her. Mark, needing to salvage his relationship with Dobby, asks her to move in with him, to which she agrees. Zahra rejects Jez after she learns he has been flirting with Super Hans's girlfriend, dumping him.</p><h4>Series 8</h4><p>The series begins with Mark waiting for Dobby to move in, while Dobby waits for Jez to move out. Mark suspects that Dobby will never move in, and that Gerrard is trying to steal her from him; however, Gerrard dies of flu. Jez and Super Hans amicably end their band, and this causes Jez to contemplate his life so far: he eventually agrees to undertake therapy sessions, which are paid for by Mark. Impressed by the therapy, Jez decides to become a life coach, but he fails a course of questionable value. Mark then gives Jez a fake life coach certificate and he begins \"coaching\" anyone who will let him, causing emotional and personal harm. Mark writes a book, which is published by an incompetent vanity publisher. Mark, Dobby, Jez and Hans go paintballing. Mark gets a job at the bathroom supplies company where Hans works, but is soon sacked. He also starts an evening course to gain an MBA. Jez falls in love with Dobby and declares his feelings, as does Mark. While Mark and Jez fight, Dobby leaves the scene and heads to New York, where she has a new job.</p><h4>Series 9</h4><p>The final series opens with Mark and Jez meeting for the first time since their fight over Dobby, with Mark still bearing a grudge over the role Jez played in his break-up with her. Jez is living in Super Hans's bathroom, while Mark has a new flatmate. After reconciling, Jez moves back in with Mark and they go back to their old ways. Jez begins a relationship with a younger man, Joe, and also has sex with Joe's girlfriend Megan. Mark seeks out April (Catherine Shepherd—previously seen only in a single episode in series 2), whom he always thought to be his perfect woman, despite her now being married. Dobby has moved to New York and has a new boyfriend. He beats up Mark when he discovers Mark had been tracking Dobby's movements. Hans marries Molly in Norfolk. Sophie turns up at the flat depressed and appears to have a drink problem. She is in a relationship with a man whom she thinks is having an affair. She offers Mark a chance to give their relationship another go, which he initially accepts, but Mark decides to try and break up April's marriage and start a new life with her. In the final episode, all the duo's past lies and selfish decisions catch up with them. Mark loses his job at a bank because of a loan he gave Jez previously (ironically, to exploit him) without asking for correct identification paperwork, and he is replaced by his rival Jeff. Joe leaves Jez after his lies about him being popular and young are caught out, and Jez claims he is tired of partying all the time. Super Hans's wife is upset because he is unwilling to stop his old disreputable lifestyle, and after he kidnaps and threatens April's husband, she finally leaves him. Super Hans ends up leaving for Macedonia to open a moped hire business and leaves Mark and Jez right back where they always end up due to their bad choices, with Mark losing his newest relationship and job, while Jez remains stuck in a rut with no prospects. It ends with the two watching TV together, asking and answering inane questions, with Jez thinking to himself how they both \"love each other really\" and Mark reminding himself that he \"simply must get rid of him\".</p><br/><h3>Reception</h3><p>The series was met with critical acclaim, and is considered to be a cult television show. Early previews called it \"promising\" and noted it had \"the sniff of a cult favourite\"; Jane Simon of The Daily Mirror claimed that Peep Show in years to come will \"be seen as the pinnacle of comedy it obviously is.\" Peep Show won the titles \"The Best Returning British TV Sitcom 2007\" and \"Comedy of the Year 2008\" in The Comedy.co.uk Awards.</p><p>The Guardian newspaper described it as \"the best comedy of the decade\". The Times praised the show's \"scorching writing\" and named it the 15th best TV show of the 2000s.</p><p>Ricky Gervais has been cited as saying \"the last thing I got genuinely excited about on British TV was Peep Show, which I thought was the best sitcom since Father Ted\". While presenting an award at the 2005 British Comedy Awards, Gervais called it \"the best show on television today\" and said it was a \"debacle\" that it did not win an award.</p><p>In 2019, Peep Show was named the 13th greatest British sitcom of all time in a poll by Radio Times. In the same year, The Guardian ranked it 9th on its list of the 100 best TV shows of the 21st century. In 2021, the BBC ranked it 42nd on a list of the 100 greatest TV series of the 21st century.</p><p>In June 2020, a scene from series 2 episode 1 of Jeremy in blackface was removed from Netflix due to concerns over racism.</p><h4>Ratings</h4><p>Despite the critical acclaim, Peep Show never garnered consistently high viewing figures. At the beginning of 2006 there were rumours that the show would not be commissioned for a fourth series due to insufficient ratings of just over a million viewers. However, due to the large DVD revenues of the previous series, a fourth series was commissioned. The premiere of the fourth series showed no improvement on the ratings of the previous one, continuing to attract its core audience of 1.3 million (8% of viewers). Despite the low viewing figures, the fifth series of the show was commissioned prior to the broadcast of series 4. Channel 4's decision to commission the show for a fifth series was said to be for a variety of reasons, including again the high DVD sales of the previous series (400,000 to date), the continued high quality of the show itself, and the rising profile of Mitchell and Webb due to the success of their BBC sketch show That Mitchell and Webb Look, their advertisements for Apple, and their feature film Magicians. The fifth series showed no improvement with 1.1 million viewers. Producer Andrew O'Connor cited the POV filming style as the reason for the low ratings: \"It made it feel original and fresh and got it commissioned for a second series, but it stopped it from being a breakout hit and stopped it finding a bigger audience.\" Bain and Armstrong agreed that the POV style stopped it from becoming mainstream.</p><p>The first episode of series 6 – the first to be shown in its new earlier time slot of 10pm – attracted Peep Show's highest ratings to date, with 1.8 million viewers (9.2% audience share), with a further 208,000 (1.8%) watching it on Channel 4 +1.</p><h4>Awards and honours</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th><th><abbr title=\"References\">Ref.</abbr></th></tr><tr><td rowspan=\"3\">2004</td><td><span>British Academy Television Awards</span></td><td><span>Best Situation Comedy</span></td><td><span>Phil Clarke</span>, <span>Andrew O'Connor</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>Rose d'Or</span></td><td>Best European Sitcom</td><td><i>Peep Show</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span>RTS Programme Awards</span></td><td>Situation Comedy and Comedy Drama</td><td><i>Peep Show</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"3\">2005</td><td><span class=\"mw-redirect\">British Comedy Awards</span></td><td>Best Comedy Newcomer</td><td>David Mithcell</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"2\"><span>RTS Programme Awards</span></td><td>Situation Comedy and Comedy Drama</td><td><i>Peep Show</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>Writer: Comedy</td><td>Sam Bain and Jesse Armstrong</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"6\">2006</td><td><span>British Academy Television Awards</span></td><td><span>Best Situation Comedy</span></td><td><span>Robert Popper</span>, <span>Tristram Shapeero</span>, <span>Sam Bain</span>, <span>Jesse Armstrong</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"3\"><span class=\"mw-redirect\">British Comedy Awards</span></td><td>Best TV Comedy</td><td><i>Peep Show</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"3\"></td></tr><tr><td rowspan=\"2\">Best TV Comedy Actor</td><td>David Mitchell</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>Robert Webb</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>RTS Programme Awards</span></td><td>Situation Comedy and Comedy Drama</td><td><i>Peep Show</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>Writer: Comedy</td><td>Sam Bain and Jesse Armstrong</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"3\">2007</td><td rowspan=\"2\"><span class=\"mw-redirect\">British Comedy Awards</span></td><td>Best TV Comedy</td><td><i>Peep Show</i></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\"></td></tr><tr><td>Best TV Comedy Actor</td><td>David Mitchell</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>RTS Craft &amp; Design Awards</span></td><td>Tape and Film Editing - Entertainment &amp; Situation Comedy</td><td>Mark Everson</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"9\">2008</td><td rowspan=\"2\"><span>British Academy Television Awards</span></td><td><span>Best Situation Comedy</span></td><td><span>Robert Popper</span>, <span>Becky Martin</span>, <span>Sam Bain</span>, <span>Jesse Armstrong</span></td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"2\"></td></tr><tr><td><span>Best Comedy Performance</span></td><td><span>David Mitchell</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"4\"><span class=\"mw-redirect\">British Comedy Awards</span></td><td>Best Television Comedy</td><td><i>Peep Show</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\"></td></tr><tr><td>Best Television Comedy Actor</td><td>David Mitchell</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Television Comedy Actress</td><td><span>Olivia Colman</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Best Female Comedy Newcomer</td><td><span>Isy Suttie</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span>RTS Programme Awards</span></td><td>Situation Comedy and Comedy Drama</td><td><i>Peep Show</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\"></td></tr><tr><td>Comedy Performance</td><td>David Mitchell and Robert Webb</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Writer: Comedy</td><td>Sam Bain and Jesse Armstrong</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"7\">2009</td><td rowspan=\"2\"><span>British Academy Television Awards</span></td><td><span>Best Situation Comedy</span></td><td>Becky Martin, Sam Bain, Jesse Armstrong, Izzy Mant</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\"></td></tr><tr><td><span>Best Comedy Performance</span></td><td>David Mitchell</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td><span>British Academy Television Craft Awards</span></td><td><span>Best Writer</span></td><td rowspan=\"2\">Sam Bain, Jesse Armstrong</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">British Comedy Awards</span></td><td>Best TV Sitcom</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>Best TV Comedy Actor</td><td>Robert Webb</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span>RTS Programme Awards</span></td><td>Situation Comedy and Comedy Drama</td><td><i>Peep Show</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td>Writer: Comedy</td><td>Sam Bain and Jesse Armstrong</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td rowspan=\"4\">2010</td><td rowspan=\"2\"><span>British Academy Television Awards</span></td><td><span>Best Situation Comedy</span></td><td>Sam Bain, Jesse Armstrong, Phil Clarke, Becky Martin</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td><span>Best Male Comedy Performance</span></td><td>David Mitchell</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>International Emmy Awards</span></td><td><span>Best Comedy Series</span></td><td><i>Peep Show</i></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span>RTS Craft &amp; Design Awards</span></td><td>Tape and Film Editing - Entertainment &amp; Situation Comedy</td><td>Mark Davies, Mark Everson</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"4\">2011</td><td rowspan=\"2\"><span>British Academy Television Awards</span></td><td><span>Best Situation Comedy</span></td><td>Sam Bain, Jesse Armstrong, Phil Clarke, Becky Martin</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\"></td></tr><tr><td><span>Best Male Comedy Performance</span></td><td>David Mitchell</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">British Comedy Awards</span></td><td>Best TV Sitcom</td><td>Sam Bain, Jesse Armstrong</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>RTS Programme Awards</span></td><td>Writer: Comedy</td><td>Sam Bain and Jesse Armstrong</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td rowspan=\"2\">2016</td><td><span>British Academy Television Awards</span></td><td><span>Best Scripted Comedy</span></td><td>Jesse Armstrong, Sam Bain, Becky Martin, Hannah Mackay</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td><span>British Academy Television Craft Awards</span></td><td><span>Best Writer: Comedy</span></td><td>Sam Bain, Jesse Armstrong</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr></tbody></table><p>Other awards:</p><ul><li>In 2007, 2009 and 2010, Peep Show was voted \"Best Returning British TV Sitcom\" in the Comedy.co.uk Awards. In 2008 it was voted \"Comedy of the Year\".</li></ul><br/><h3>Other media</h3><p>A book entitled Peep Show: The Scripts and More, which featured the scripts of every episode from the first five series as well as an introduction from Mitchell and Webb, was released in 2008. To celebrate the show, Channel 4 aired a Peep Show Night on Christmas Eve in 2010, which included the documentary Peep Show and Tell and the fan-selected episodes \"Wedding\" (s4 e6) and \"Shrooming\" (s3 e3).</p><p>In 2018, a fan-hosted podcast was created, called ‘Podcast Secrets of the Pharaohs’, a play on words based on the book ‘Business Secrets of the Pharaohs', a fictional book in the show. Hosted by Rob Graham and Tom Harrison, the podcast reviewed episodes of the show, alongside guests, including David Mitchell, Robert Webb, Paterson Joseph, Vera Filatova, Sophie Winkleman and Paul Clayton. The podcast concluded in 2022.</p><br/>"
  },
  "errorMessage": ""
}