{
  "imDbId": "tt0275137",
  "title": "Justice League",
  "fullTitle": "Justice League (TV Series 2001–2004)",
  "type": "TVSeries",
  "year": "2001",
  "items": [
    {
      "username": "jwhale9382",
      "userUrl": "https://www.imdb.com/user/ur2280638",
      "reviewLink": "https://www.imdb.com/review/rw1404079",
      "warningSpoilers": false,
      "date": "27 June 2006",
      "rate": "10",
      "helpful": "65 out of 69 found this helpful.",
      "title": "Awesome Superhero Show",
      "content": "This show is awesome. Not just as a cartoon, but as a TV show in general. Unlike like its predecessor, Superfriends, Justice League is a more accurate description of the DC Universe and the characters in it. One of the show's best qualities is that many of DC's best, brightest and unsung heroes and villains are represented in it, not just the really popular ones. I give credit to this show for introducing me to some of the Flash's toughest villains (Mirror Master, Captain Cold, Captain Boomerang, Trickster and Gorilla Grodd). Another great quality of the show is that it's for everyone. As a cartoon, you might think that this show is only for kids. But these characters are so iconic and the stories are so well written and action-packed, that you don't need to be a kid to appreciate it.My Rating: 10/10"
    },
    {
      "username": "voicemaster71",
      "userUrl": "https://www.imdb.com/user/ur5860628",
      "reviewLink": "https://www.imdb.com/review/rw1527355",
      "warningSpoilers": true,
      "date": "22 November 2006",
      "rate": "10",
      "helpful": "28 out of 29 found this helpful.",
      "title": "Best DC Animated Show in History! Never Again Will We Ever See Such Greatness!!",
      "content": "Of all the animated shows of DC Comics characters, never before has there been one as superb as Justice League/JLU. Now unlike lots of posters here, I loved the SuperFriends and you know what? I STILL love them. They represented the silver and bronze age period of comics and they served their purpose well in their time. BUT I WILL agree with everyone else that this series is what the SuperFriends should have been back then. JL/JLU blows the SuperFriends out of the water and out of the Hall of Justice so to speak. The biggest elements of the SuperFriends that I outgrew were those stupid teen tag along sidekicks and their even more stupid cartoon pets for comic relief. But I digress. Unlike the long running SuperFriends, the Justice League has superb animation and excellent story lines. I feel that the difference between the writing is this: On SuperFriends,the writers were probably all non comics readers who probably looked at them to give them ideas and they had to yield to the Broadcasts Standards and Practices. On JL, the writing is done by major comics fans and there is no holds barred!! We saw some serious butt kicking in this series. The first two seasons of Justice League consist of the original big seven. Batman is my all time favorite hero. Kevin Conroy is truly superb in this role and it was good to hear him as Batman again after voicing elder Bruce Wayne in Batman Beyond. While Batman was great in his own series, I loved him even better in this series as dark, grim, and aloof and I loved seeing which DC villains would encounter Bats. I got my wish seeing him go up against Kalibak and try to go up against Darkseid. The Flahs is my other favorite character and Smallville's Michael Rosenbaum really made this character so much fun with his hilarious one liners. Wonder Woman was superb. They couldn't have found anyone better than Susan Eisenberg to voice her over. Sounded like a college girl. As for Superman, I wasn't crazy about him in the beginning. I did not like Supes all powered down and I prefer Tim Daly for the voice, but Bruce Timm and company improved Supes and George Newbern started out lousy but got better with time and really did a great with Superman in the JLU seasons. The debut of J'onn J'onzz the Martian Manhunter was very well done. Carl Lumbly took J'onn from being one of the more kind, gentle, and sensitive members in JL to being a hard nose desk sergeant and dispatcher in the JLU seasons. The two most controversial to me were Green Lantern and Hawkgirl. It took a while, but I got used to John Stewart. Phil LaMarr used a great voice for a one time Marine Corp vet who is now a Green Lantern and he made a great leader. Hawkgirl had always been to me, a sidekick for Hawkman on SuperFriends, but here, she is a warrior from Thanagar and has the hot temper to go with it. It was great to see when she eventually took off her mask. Maria Canals gave an excellent performance. I also enjoyed the romantic relationship John and Shayera had as well as the hinted attraction between Batman and Wonder Woman. These big seven were awesome to watch in the first two seasons as Justice League and they were regarded as team leaders and founding members on JLU. I look at the pilot Secret Origins and the season two finale, Starcrossed as full animated movies as opposed to three parters. In Justice League Unlimited, we FINALLY get to see more heroes, like Green Arrow, who before that only had one guest appearance on the original 1973 SuperFriends series. Here, we see him as a liberal hero of the people, out for the little guy. And for the first time, we get to see Black Canary,and to a lesser extent, Red Tornado and Elongated Man, two members I was hoping would have had bigger roles. But Bruce Timm and co. outdid themselves and gave so many heroes that I had never heard of. I am a DC Comics fan, but even I head never heard of Vigilante, the Shining Knight, Stargirl & S.T.I.P.E., Fire and Ice, Gypsy, Vibe, Captain Atom, the Question, and even more obscure characters like Sand, the Ray, Nemsis, Obsidian, the Crimson Avenger, and the list goes on and on. Way too many to name. I loved the continuing story arc about the Cadmus organization and everyone's fear of the JL if they were to ever go rogue. They also had a nice tribute to the SuperFriends with the Ultimen who were ripoffs of the Wonder Twins, Black Vulcan, Samuraui, and Apache Chief. Too many great episodes to mention, but I recommend the Justice League for anybody. From Secret Origins to the finale of Alive and Destroyer, these shows are so good, it's actually hard to stop watching them. All WB has to do is release the final season with Hawkman and the Legion of Doom and the DVD library will be complete. I only wish they could have used Plastic Man and Firestorm as well as Aquaman and Black Manta (not Devil Ray) in the final season and I wish we could have seen Nightwing, not Robin. Though Timm and Co. are no longer involved with the DC Unvierse, I will never again see an animated DC project nearly as good as Justice League and Justice League Unlimited. 2 Thumbs Up!!"
    },
    {
      "username": "garrard",
      "userUrl": "https://www.imdb.com/user/ur2063901",
      "reviewLink": "https://www.imdb.com/review/rw1355874",
      "warningSpoilers": false,
      "date": "30 April 2006",
      "rate": "9",
      "helpful": "43 out of 49 found this helpful.",
      "title": "A 'toon for the BOOMER in all of us!",
      "content": "For those of us raised on George Reeves, Christopher Reeve, or \"Batman: The Animated Series,\" \"Justice League\" (or its latest incarnation, \"Justice League Unlimited\") is a god-send. It is a show that combines superhero daring-do with some witty dialog, intriguing story lines, and superb character interaction that is much more \"adult\" than most of the fare on Cartoon Network's prime time lineup.Now in its fifth (and final) year, \"Justice League,\" though often pitting the superheroes against invading aliens or super-villains bent on world destruction, has taken some departures from the typical cartoon by presenting some interesting romantic relationships between principal characters: the not-so-subtle romance between Green Lantern and Hawkgirl and the implied attraction between Wonder Woman and Batman. There has also been some rift between the heroes, on occasion between Batman and Superman. Like Superman, the Martian Manhunter has to deal with the loss of his home world and the death of his beloved and children. The Flash is along as the comic relief, as a superhero with a strong libido, always on the \"hunt\" for a female conquest.The writers get to show more of the human side of those that are considered \"super\". Even Superman got to show a little emotion when confronted with longtime enemy Darkseid\" in the two-parter \"Twilight\". The Man of Steel would've murdered the villain if Batman had not intervened. In an episode about a parallel universe, the Superman of that world even did away with Lex Luthor.The show has a stellar cast of actors supplying the major characters' voices with a roster of guest talent (CCH Pounder, Michael Ironside, Robert Picardo, Hector Elizondo, Mark Hamill, Clancy Brown, and others) that is second to none.The show, though not a ratings juggernaut (due to frequent changes in airing times), is a treat for the boomer generation and is a welcome addition to the mythos that DC Comics created over six decades ago."
    },
    {
      "username": "the_donnie",
      "userUrl": "https://www.imdb.com/user/ur69065143",
      "reviewLink": "https://www.imdb.com/review/rw4381131",
      "warningSpoilers": false,
      "date": "6 October 2018",
      "rate": "10",
      "helpful": "12 out of 12 found this helpful.",
      "title": "This is the true soul of DC heroes!",
      "content": "I watched it when I was 11-12 years old. Now I'm 28 and it continues to be the best heroes series out there. Two seasons of pure joy! :)"
    },
    {
      "username": "Figaro-8",
      "userUrl": "https://www.imdb.com/user/ur0674524",
      "reviewLink": "https://www.imdb.com/review/rw0790309",
      "warningSpoilers": false,
      "date": "26 November 2001",
      "rate": "",
      "helpful": "63 out of 75 found this helpful.",
      "title": "JUSTICE LEAGUE Rules. Period.",
      "content": "I knew this was going to be a good show, given the fact that Bruce Timm and the same team responsible for the WB/DC animated shows were doing it.Even so, this show TOTALLY blows me away every time I watch it. EVERYTHING about it is dead on PERFECT. Kevin Conroy, as always, is great as Batman, as is George Newbern as Superman. Hawkgirl is a great addition, and boy can she hold her own!! But the character that has emerged as my favorite is J'onn J'onnz, aka Martian Manhunter. I love the character design and animation of him, and I don't think they could have gotten a better actor to voice him than Carl Lumbly (who played Stalker in a few episodes of Batman Beyond).The composing team also does a great job with the music, and I REALLY hope that somewhere down the road, they release a CD of this music.I'm absolutely delighted that Cartoon Network airs JL in letterbox format as well as full-frame. I, for one, prefer letterbox as it gives the show a more epic and cinematic feel.Simply put, JUSTICE LEAGUE rules. Period.By thy side,Figaro"
    },
    {
      "username": "bombo918",
      "userUrl": "https://www.imdb.com/user/ur19422012",
      "reviewLink": "https://www.imdb.com/review/rw1884285",
      "warningSpoilers": false,
      "date": "31 May 2008",
      "rate": "",
      "helpful": "55 out of 56 found this helpful.",
      "title": "I Can't Believe It",
      "content": "I just started watching this cartoon and i think it is the best show i have ever seen. And now i find out that its been on for years and there is no more. Some of these episodes should be up for awards. No joke. I'm trying to think where i've been in the last 4 or 5 years. The episode Destroyer had the best writing for a cartoon. They put so much in a 30min show. And Justice League Unlimted puts some serious emotion in the writing, like when Superman goes off on on Darkside. That whole thing he says That man wont quit as long as he can still draw a breath, none of my teammate will.Me I have a different problem. I feel like I live in a world made of cardboard. Always taken constant care not to break something to break someone. Never allowing my self to lose control even for a moment because someone could die. but you can take it can't you big man. What we have here is rare opportunity for me to cut loose and show you just how powerful I really am...... That is the best thing ever in a cartoon."
    },
    {
      "username": "hypernode1",
      "userUrl": "https://www.imdb.com/user/ur2074550",
      "reviewLink": "https://www.imdb.com/review/rw0790325",
      "warningSpoilers": false,
      "date": "9 December 2002",
      "rate": "",
      "helpful": "63 out of 74 found this helpful.",
      "title": "Wow!",
      "content": "YTV in Canada has been re-running \"Superfriends\", the Wonder Twin era crap, at 1am (PST). I decided to watch it for old times sake and was wondering why no one had taken the time to do it right - the \"Batman:TAS\" approach? Suffering from insomnia, and not wanting to watch \"Thunderbirds\" I surfed for a half hour and went back to YTV to see what they had on next and I was NOT disappointed.\"Justice League\" is what I always wanted \"The Superfriends\" to be. No lousy sidekicks, no space monkey, no ludicrous plots involving Martian brain creatures. It was like watching the comic book. I like the way they have presented the characters and the fact that there is tension - they maybe friends, but those relationships get strained. A powered down Superman, excellent had to be done. A stand-offish Batman, perfect. Jon J'onzz? Yeah... great character, perfectly voiced too!However, I was happy to see that used the John Stewart GL- the DC universe's karmic kicking bag - and the Wally West Flash instead of using Hal Jordan and Barry Allen. Hal and Barry (especially Barry) were just too perfect too much of the time. I like them and they always have a special place in my comic book memories, but Stewart and West (as flawed heros) are better characters. In fact, I'd like to see them with their own shows someday. Wally West is a great character if you go in depth, rather than just leaving him as comic relief.I hope Warner Brothers keeps this up, superlative job!"
    },
    {
      "username": "broadfoot",
      "userUrl": "https://www.imdb.com/user/ur1492910",
      "reviewLink": "https://www.imdb.com/review/rw0790332",
      "warningSpoilers": false,
      "date": "15 October 2003",
      "rate": "",
      "helpful": "36 out of 48 found this helpful.",
      "title": "Gives The Hanna-Barbera Cartoons a Run For Their Money",
      "content": "This version of Justice League is much better than the now very dated Hanna Barbera cartoons of the 1970s. The way the characters are drawn are more faithful to the golden age comic books. Also, the Wonder Woman on this show is beautiful and rates second on my list to Lynda Carter's portrayal of the heroine. I'm surprised Lynda didn't add her voice to the show as Queen Hippolyte. As for the other characters, perhaps Batman is a bit of a know-it-all and The Flash is perhaps a few pumpkins short of a pie, but still this is the best cartoon to show up here on Canadian TV in a long time!JUSTICE LEAGUE, WE SALUTE YOU!!!Rating: ****"
    },
    {
      "username": "Op_Prime",
      "userUrl": "https://www.imdb.com/user/ur0199296",
      "reviewLink": "https://www.imdb.com/review/rw0790312",
      "warningSpoilers": false,
      "date": "18 November 2001",
      "rate": "",
      "helpful": "25 out of 35 found this helpful.",
      "title": "The Justice League is back for a new millennium.",
      "content": "There hasn't been a show featuring these mighty heroes since 1985, but this show ain't no Super Friends. Like the Superman and Batman shows of the 1990s, Justice League has action, humor, creativity and terrific animation. Justice League acts more like the current comic book incarnation. The show stars the most powerful and well known characters from those comic books. Other familiar characters are bound to pop up from time to time. The characters have separate and distinct personalities, which can lead to some conflict and disagreement. That's good since it would be very boring if all the heroes agreed on everything and got along.Congratulations to Bruce Timm and his team. This show is sure to be a winner."
    },
    {
      "username": "mhorg2018",
      "userUrl": "https://www.imdb.com/user/ur22761455",
      "reviewLink": "https://www.imdb.com/review/rw4230827",
      "warningSpoilers": false,
      "date": "8 July 2018",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "One of the best cartoons ever.",
      "content": "DC Animation is one of the best animation companies today. They consistently do the best Superhero toons, leaving all others in the dust. Great voices and stories, this is well worth watching again and again. It got even better when it became Unlimited."
    },
    {
      "username": "Karolynnkt",
      "userUrl": "https://www.imdb.com/user/ur9776646",
      "reviewLink": "https://www.imdb.com/review/rw1399463",
      "warningSpoilers": false,
      "date": "22 June 2006",
      "rate": "10",
      "helpful": "29 out of 34 found this helpful.",
      "title": "A Series with a Marvelous Script",
      "content": "I have been a Justice League fan since its premier on Cartoon Network. I considered it vastly superior to \"Superfriends\" and the episode plots are well written.One of my favorites is the episode with King Aquaman wherein all the Justice League members cannot do anything to persuade the would be assassin to confess and then Batman who possesses no super powers somehow gets the perpetrator to spill the beans. I thought that was simply awesome.My other favorite episode was when the League faced somewhat counterparts from a comic book world. Once again well written and thought provoking. The episode with the android who (no matter what the Justice League did) was no match for them really was great. I commend all the writers of the show for their creative style and talent and I want this show to go on forever."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2271419",
      "warningSpoilers": false,
      "date": "30 June 2010",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "I am running out of words to describe how good this show is!",
      "content": "I have a real interest in superheroes and in animation, with both together this had all the ingredients to be at least a good show. And it was, no more than that, it is a brilliant show, and one of the best superhero series ever made. Personally I think Batman:The Animated Series just beats it, but Justice League is without a doubt one of the most original, ambitious and deep animated shows out there.The production values are really detailed and rich. You can never go wrong with sophisticated colours, sharp and decisive character features, epic scope and crisp backgrounds, in all four of these areas Justice League succeeds. The music is consistently superb, haunting, rousing and dark, with a main theme that sticks in the mind for a long time.Even more impressive is the depth, story lines and the writing. The writing is brilliant, there are moments of humour but it does always have a focused tone, and it is all sophisticated and taut, a major step up with sappy one liners and clichés that some characters are made to utter in some shows now. I was so impressed with the story lines, even for an animated these story lines are quite deep and complex, but they never cease to be gripping and compelling. Plus the characters have so much depth to them. They aren't boring, useless or clichéd, they all have unique personalities, a purpose and are always well incorporated into the stories.I have always loved Batman, Superman, Hawkgirl, Green Lantern and Wonder Woman, and they are amazing characters here. I was also surprised at how much depth there was to J'onn J'onzz and in a good way, and the villains are interesting too and actually have motives that don't come across as absurd. The voice acting is outstanding too, Kevin Conroy IS Batman in my eyes especially. Overall, this show is fantastic, and I am actually running out of words to describe how truly good Justice League is other than to say if you love superheroes, characters and stories with depth and animation, this is a must see! 10/10 Bethany Cox"
    },
    {
      "username": "Angelus2",
      "userUrl": "https://www.imdb.com/user/ur8131454",
      "reviewLink": "https://www.imdb.com/review/rw1873664",
      "warningSpoilers": true,
      "date": "13 May 2008",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "\"What like super-friends?\"",
      "content": "I loved the three part of the pilot. The show united some of the great heroes of DC together. All the characters are lovable and seem to have great chemistry, the story lines are very 'grown-up' especially for a children's show. What amazes me is that even though this is a kids show it can easily attract older fans like me, who when this show was running was in his mid teens.The coupling between, Green Lantern and Hawkgirl is quite sweet while Batman and Wonderwoman's love life is hilarious to watch. But it is Flash that takes the cake, Michael Rosenbaum who plays Lex Luthor on Smallville adds the great comedy relief that is needed in a kids show; the animations are beautiful to watch and the fight scenes between villains and superheroes are brilliant.My personal favourite episode is 'The Greatest story never told' it focuses on Booster Gold, a superhero who is ignored and always sidelined by the other superheroes. But during a invasion, he meets a female scientist who needs help and so Booster Gold tries to help realising in the process he is nothing but a wannabe and eventually saves the day. And gets a date.I mean even Superman and Batman couldn't do that. Watching this cartoon is like watching a movie, the suspense is brilliant and the fight scenes are well worth the wait.One of the best cartoons from DC since Batman the animated series."
    },
    {
      "username": "Dream_seeker",
      "userUrl": "https://www.imdb.com/user/ur4371741",
      "reviewLink": "https://www.imdb.com/review/rw1639015",
      "warningSpoilers": true,
      "date": "16 April 2007",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "A great treat to the DC universe and a thrill ride animation....",
      "content": "I have to admit when looking at shows like X-men and X-men: Evolution, or Spiderman they are good but when compared to a show like DC's Justice league and JL: Unlimited which began on cartoon network around 2001-2006 and during these years they don't hold a candle to great story driven characters and superb action sequences that feels like you're right in the middle of watching a movie fitted just for T.V.Unlike marvel's animation(s), the Justice league is a bit more darker for most and there are some episodes that might in some cases be a bit deeper in the undertone of death and murder, heck even the villains are crazy and wickedly dangerous (I mean with deadly intent on getting rid of each and every single group)...later on in unlimited there are some certain sexual innuendos shown in some episodes not too bad for kids to not watch but just bits and pieces and hints...but all of this add up is NOT a bad thing reason being that it keeps up the pace to the story and adds not only tension but keeps all the characters different and unique without making them all the same unlike marvel's animation(s).Finally, When watching this show you get the feel of danger and sometimes hopelessness for the team; there are times where they are at their worst and feel that it can only get bad by the minute I mean they get the snot beaten, tortured, and possibly near death but they seem to come out on top and you see it point blank without hindrance to the violent display...kind of like life imitating art or comics again something most marvel animation series before JL tends to censored without putting reality at play JL and JL: unlimited pulls no punches and hold nothing back...the bad guys are bad guys and even sometimes the good guys can step over the line and again....truth in fiction and that's not a bad thing! My only grip to this show is that most of the coolest DC characters don't get much screen time (I.E. Steel, booster gold, etc.) They have their time on some episodes but after some time you rarely hear from them and then they become just figments in the background but who's to say that Green lantern isn't the bad-ass and batman is just in one word, \"awesome\" it just would be great to also see a connection with steel and superman which was only shown on Superman the animated series on here...not so much. but in the end, this show has a lot of merit to being one of the best thrill ride of animated series that I've seen in a long time so if I had to choose between X-men or JL hands down I'm going for JL for great stories, awesome action with great music, not to mention when having the stereo kicked up feels like you're in a movie theater watching awesome displays of adventure straight from the comics and in the end you can't go wrong...10/10"
    },
    {
      "username": "Animany94",
      "userUrl": "https://www.imdb.com/user/ur78948186",
      "reviewLink": "https://www.imdb.com/review/rw4791747",
      "warningSpoilers": false,
      "date": "20 April 2019",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "An unforgettable show.",
      "content": "I remembered watching Justice League back in the day. I wasn't more than 10 years old when I first saw it on the small screen, but even though so many years passed and I didn't have much to do with it or other superhero shows it still holds up and more to this day.First of all, the title sequence is one of the most catchy tunes ever to introduce a TV-show and it will stick in your head for days. It really sets up the grand scale of the show and really has this epic and heroic feel to it which has you invested from the start. The CGI characters though look terribly dated, but you can't really blame something for being released when it was quite new.These storylines have a real depth to them which is easier with the fewer characters from the DC Comics, but I think it was the best start to what later would become Justice League Unlimited which is an amazing show as well.Justice League's first season was really good at introducing each of the well known DC heroes in different situations wether it be an origin story like with J'onn J'onnz or an exploration of their homes and reasons for their mission like with Wonder Woman and Green Lantern. Season 2 focused more on the team and their fights against super villains, but it somehow managed to take the complexity of their characters up one more level which leads us to many amazing fights and great dilemmas between them.Justice League is an amazing show I recommend to anyone who likes engaging storytelling with enough unpredictability to keep ones interest through every two-parter or occasional three-parter."
    },
    {
      "username": "crazelord",
      "userUrl": "https://www.imdb.com/user/ur110076728",
      "reviewLink": "https://www.imdb.com/review/rw7885208",
      "warningSpoilers": false,
      "date": "21 February 2022",
      "rate": "10",
      "helpful": "2 out of 2 found this helpful.",
      "title": "Unpopular opinion: I like it better than JLU",
      "content": "Mind you, they're both excellent. I have JLU as a 9 and this is a 10. My reasoning is that once this show got it's stride (and stops nerfing Superman), it's just some of the best character writing I've ever seen in a show. Basically every story being a multiparter allows it to take it's time to build out the stakes and character motivations.What made this show, and all of Bruce Timm's DCAU is that it's not a superhero show with some good character writing. It's a character show about Superheroes and using world ending threats to tell these stories at high stakes levels.This is a show that deals with grief, loss, heroism, ideology, faith, race, gender roles, morality, patriotism, individuality, family, xenophobia, romance, politics, etc all in very mature and in depth ways, while also having our favorite super heroes kicking butt.And it's only a kids show in the sense that there's nothing overtly uncensored for kids (though I think this and JLU having less censorship than the 90s shows does help it expand the storylines comparitively) and that it's never edgy (which I think helps make it timeless).I honestly have trouble finding many other shows this mature made for adults while also being as upbeat and fun. It never panders to anyone, it respects its audience's intelligence regardless of age.Yes there are some less interesting storylines in the first season, but the amount of classic thought provoking high intensity stories are so much I can forgive the less memorable ones. And it's never bad, even at it's worst, it's always good. But the bar is set so high that anything less than brilliance is noticable.Also Batman isn't OP in this one. He gets jobbed way more often than people remember and needs the superpowers teammates to help him out a lot."
    },
    {
      "username": "kec_jesusfreak",
      "userUrl": "https://www.imdb.com/user/ur17438475",
      "reviewLink": "https://www.imdb.com/review/rw1764147",
      "warningSpoilers": true,
      "date": "15 November 2007",
      "rate": "",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Wow!",
      "content": "I've got to say, Justice League is probably one of the best cartoons out there. I love the way they portrayed all the characters; in fact, many of them were better than the originals. I especially liked Batman, J'onn, and Flash- The Bat's stand-offishness fit so well, J'onn's voice and manner of speech were wonderful, and Flash's mix of cockiness and airheadedness was perfect (not to mention *his* voice, which makes me squeal in fangirly joy, haha). The villains were well-done, and Wonder Woman and Hawk Girl just own'd. XD You wouldn't think a teenager would get much joy out of a cartoon, right? But I did. It had some surprisingly grown-up themes, pretty deep ideas. I only have one bad thing to say about this cartoon: It ended too soon."
    },
    {
      "username": "scottyent",
      "userUrl": "https://www.imdb.com/user/ur24874464",
      "reviewLink": "https://www.imdb.com/review/rw2829221",
      "warningSpoilers": false,
      "date": "10 July 2013",
      "rate": "7",
      "helpful": "7 out of 11 found this helpful.",
      "title": "Yeah it's pretty good if you accept it's a cartoon",
      "content": "Do I enjoy this show? Yes. It is the first cartoon like it that I have watched (in that it has many super heroes), so I can't compare it to something like Super Friends. However, when I started watching the show, perhaps I had the wrong expectation. After all, it is a kids show and a cartoon. I had grown somewhat used to the blockbuster movies such as Iron Man, Dark Knight, etc, that gave superheroes SOME level of consistency. To me, that is really the only thing that a superhero really needs: consistency.In this show, consistency is regularly thrown out of the window. The formula seems to be this...yes they are all super heroes, yes they all have super powers, but the second that becomes inconvenient for the plot they become weak. Almost every story pretty much revolves around...wow they got really beat down, how will they win!?...and resolves in...oh, exactly what they have been doing, but somehow their punches and strategy just figured things out this time around. That makes the show frustrating for me. Too often was I like, oh come on Superman (based on previous episodes) should easily be able to handle this..but he doesn't. Then at the end, he does without any explanation except you can assume he tried harder or something.Another irritating point is the fact that not all the super heroes are in every episode. I understand for plot development, there has to be more of a focus on some of them each episode, but the episodes where others just don't show up are annoying. This isn't SNL, this isn't a huge collaboration of people showing up for a live show.... were the animators that drew that cartoon sick that day? Were the voice actors not available to record so they left them out? There were too many times where I thought...man, you know who would be perfect for this situation? Green Lantern or Superman. Where are they? Who knows. End of the world scenario all the time, but they seem to be off taking a nap. All in all it's a good cartoon, but it is still a cartoon. It is very formulaic, and can get annoying in that respect. If you ever think about it logically, you'll get annoyed. Of course suspension of disbelief is necessary, but that suspension gets tough for me when these fictional super heroes are inconsistent with their own powers in the same episode or over many episodes. I would still recommend it to people, but only if it's casually on TV."
    },
    {
      "username": "Cuttheshit",
      "userUrl": "https://www.imdb.com/user/ur96863625",
      "reviewLink": "https://www.imdb.com/review/rw4750198",
      "warningSpoilers": false,
      "date": "29 March 2019",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "The Best Adaptation of DC Superhero mythology!",
      "content": "This was in my opinion best tv series in the entire DCAU Which spanned during 1992 -2006 ,It was full of adventure,action,great storytelling and suprisingly romance ,which I guess make this show a masterpiece among other animated tv series.Whtever Animation was impressive,cast was great,stories were wonderful.I mean the Finale of the show kept me in edge of my seat,it was one of the greatest episode I had seen in tv.If you haven't already checked this amazing show Please watch This tv series deserves Your valuble time for sure."
    },
    {
      "username": "mitsubishizero",
      "userUrl": "https://www.imdb.com/user/ur85976313",
      "reviewLink": "https://www.imdb.com/review/rw5141373",
      "warningSpoilers": false,
      "date": "25 September 2019",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "One of the greatest cartoons ever made",
      "content": "This's a great update of the Justice League. The animation's great, the stories are interesting and the characters are well developed and interesting to watch. They have great chemistry and when they interact with each other it's believable. I feel like the fight scenes are cool to watch though they can get a little repetitive (The hero fights a villian(s), gets defeated then has a rematch where they triumph afterwards). They may get injured a few times but still manage to get back up and continue fighting. The animation still holds up today. Sometimes the characters seem a little stiff when they talk or emote but the backgrounds and colors still look good and are cool to watch.As serious as the show was there was a balance between drama, action and even comedy and I think it's done well. One joke I still remember is when the Flash brags about being the fastest man on earth which causes Hawkgirl to quip that's why \"he can't get a date\". One episode I found really enjoyable was the episode where the Joker (Mark Hamill) took over the TV network and was holding the city hostage with various bombs hidden around the area. In addition to taking place on real time it also pokes fun a TV show cliches such as soap operas and how dramatic they are. Justice League is a great show that both kids and adults will enjoy. If you're a DC fan you'll definitely enjoy this. Fly in and see for yourself."
    },
    {
      "username": "angelorwez",
      "userUrl": "https://www.imdb.com/user/ur150272282",
      "reviewLink": "https://www.imdb.com/review/rw8793300",
      "warningSpoilers": false,
      "date": "11 January 2023",
      "rate": "8",
      "helpful": "1 out of 1 found this helpful.",
      "title": "nicely done",
      "content": "I can't help but compare this show to batman...they came out at around the same time...both very very fantastic shows...the animation is superb...the graphics and visuals are phenomenal...it looks fantastic...very easy on the eye...soo easy to watch...the story is interesting...the plot is sublime...it was directed at kids...but it is soo mature in the way it is told...again I'll compare it to batman...the events of story are compelling...not too childish not too watered-down not too dumb-down...most of the other shows like these make this mistake...this is done just right...there's really very few things wrong with this show...maybe coz it was directed at kids...it can't be as mature and strong as it could be...the writers really told the stories of these heroes in a way that did them justice...in a captivating believable way...very well done..."
    },
    {
      "username": "sundevilemily",
      "userUrl": "https://www.imdb.com/user/ur71137408",
      "reviewLink": "https://www.imdb.com/review/rw3775160",
      "warningSpoilers": false,
      "date": "7 August 2017",
      "rate": "10",
      "helpful": "3 out of 4 found this helpful.",
      "title": "I have always loved each episode of the Justice League since I was a kid",
      "content": "I remember every Saturday morning when I was a kid,Justice League always played a lot on Cartoon Network or on Boomerang.I was always a fan of the main seven of the Justice League(Superman,Batman,Wonder Woman,Green Lantern/John Stewart,The Flash/Wally West,Martian Manhunter,and Hawkgirl. The seven of them are my favorite version of the founding members of the Justice League.And the Batman and Wonder Woman romance is very cute and I loved how lots of the episodes of the show dived deep into how each of the characters have a tough backstory and when it came back to them,working as a team really helped them out.And the sequel series Justice League Unlimited I also really enjoyed,I felt like the show was just like it's predecessor except the Justice League expanded to become just like a sports league with different teams and players except it's of superheroes in a league where there are different episodes of team ups.And I love the Justice League(2001) series and it's sequel more than Young Justice which I am not that huge of a fan of that show anymore."
    },
    {
      "username": "galliotte-1",
      "userUrl": "https://www.imdb.com/user/ur11949756",
      "reviewLink": "https://www.imdb.com/review/rw2078557",
      "warningSpoilers": false,
      "date": "9 June 2009",
      "rate": "7",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Was good....could have been better",
      "content": "I, for one, was a committed fan of this show. I even collected the seasons, and I hope they come up with a new series picking up where the last episode ended. Why a 7 out of 10 rating? 1)Batman - Was obviously the writers favorite, maybe based on the fact that he was the only one without superhuman abilities at first. 2) Wonderwoman - Was half of the time a warrior born, and the other half a cheerleader going ga-ga over Batman 3) Superman - Seemed to always need Batman to tell him how to tie his shoes. Also his animated artwork could have been way better.Other than that, good action, voice actors were excellent, a good line of villains as well."
    },
    {
      "username": "amiranda-39274",
      "userUrl": "https://www.imdb.com/user/ur79825992",
      "reviewLink": "https://www.imdb.com/review/rw5481588",
      "warningSpoilers": true,
      "date": "13 February 2020",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "The Perfect Superhero show: Complete Series Analysis",
      "content": "For as long as I can remember, this show and these heroes have been apart of my life from childhood to my current 20s, and most likely for the rest of my life. This tv series stems from interconnected shows called the dc animated universe or DCAU for short. Starting from batman the animated series, which was the inception for this entire animated enterprise. It is honestly the gold standard for the dc universe in this media outside of its source material. Its what introduced me to numerous DC characters, and whether they were A list or D list they made me fall in love with this universe. This show displays passion for these characters and stories that elevates it far above just being a cartoon made for kids, it makes it an experience. This show is so good that if I even see a clip from it, I am immediately compelled to binge watch all of it. Which just happened since I watched J reviews on the entire DCAU, I decided to binge watch the show with some friends starting from batman the animated series to justice unlimited, and I will be giving my retrospective on it.Story: The majority of the DCAU is built on individual episodic adventures, but the longer story arcs show the true potential the story writers possessed and how creative they could be. They are fantastic! While I believe the 1st season of justice league is definitely the weakest in story ( And animation), it still has many impressive episodes. Justice league begins with an alien vision of earth and 7 superheroes coming together to save the planet, which are Superman, Batman, Wonder Woman, Green lantern, Jonn Jonez the Martian manhunter, Hawkgirl and the Flash, from then on they help protect the world together as a team. After the Thanagarian invasion, the justice league expands, creating a army of well organized superheroes. This however causes the governments of the world to be on edge, and a secret government group called Cadmus begin to devil methods and other superhumans to combat the league. The Cadmus arc is the most thematically powerful, it goes places you couldn't even imagine with the use of politics and authoritarian themes. And unlike the previous seasons, almost every episode in this season cultivates into a perfect finale. As a child,I couldn't truly appreciate this season until I was an adult. The show then continues into the last season called justice League unlimited, where villains lex Luthor and Gorilla grodd create their own group of supervillains called the secret society. The Secret society arc is not as impactful as the previous season, but it is a very entertaining watch and it leads up to the last finale. While the finale is nothing too grand in story, like the Cadmus arc was, it serves as one final epic spectacle as the justice league battles darkseid and his forces world wide. The show is truly something unique since important plot points are used from the batman and superman shows, not to mention everything is almost consecutive, which really weaves a larger overall story, that not many shows or even movies franchises can accomplish.Characters: The character writing in this show is so strong, that almost every character introduced is likeable and for those that are focused on are given an almost human personality that we the audience can relate to and admire. Even d list characters from the comics are given their moment to shine and become more dimensional. The show also takes the time to show us that the superheroes aren't always saving the day, and that they have lives too, they do this by showing their jobs, daily routines, their friendships and even romantic relationships. In fact the romantic dynamics used for some characters feels so genuine that it puts most rom coms to shame. Most characters are introduced into the story without prior introduction like it was done in the batman and superman shows, even 4 of the original 7 team were introduced in the first episode without any introduction and it worked because that's how effective this universe is, you know this is a world of superheroes, so the story organically has them be apart it, and its remarkable how well this works. It just shows how much the creative team understood the characters that were being used in this show. For me and im sure several others these are the definitive versions of these characters, their personalities, their voice acting, is just perfect and I am always found disappointed by other versions that don't even come close to the gold standard these versions set. In fact this universes batman is so amazing that he is considered among many, to be the best version of batman ever created. While the personalities of the characters are perfect their outward appearances can be off-putting at first, most of the men have box chests and chins, but with better animation, they become more impressive to look at. As for the women of the DCAU, let me just say, ever woman in this universe is 100% attractive, to the point I believe these are the hottest animated women ever created.Dialogue: The characters are given brilliant material to work with, that really fleshes out the characters, and despite their cartoony look you believe these are real people because of it. Some characters engage in regular daily conversations about relationships or work. Also infamously, this show possesses a lot of innuendo, it is hilariously used in a way that no child will understand it ( I know I didn't), but any adult will, and to be honest its more funnier being done like this, instead of being blunt like in current dc animated works. But there is still a lot of steamy moments in this show they will cause titillation. The humor used in this just gold and never fails to make me have a done grin on my face throughout the whole episode. But besides that, this show can be very deep at times, while discussing theological themes,there are many instances where you will feel almost enlightened by the dialogue used. For example, In The Return, Lex Luthor has to convince the god like android, amazo not to destroy the planet by giving him a speech on what his purpose in life is. The voice actors truly breathe life into these characters and I consider some of the voice acting and dialogue used in the show, as some of the greatest ever.Action: What can I say this is some of the best animated action ever, in every episode there is always a epic and unique fight, sure it can get repetitive at times but its always extremely entertaining. I love how the animation make each fight seem fast and full of energy, the movement and fluidity just keeps every fight exciting to watch. because of the animation style used, the characters can move freely without restraint. Despite being in a cartoon superhero universe, I admire that the animators never went too over the top, and tried to keep the action in a grounded reality, such as when you hear superman struggle to stop a plane, just hearing moans, grunts,and watching the struggle makes the action feel more believable and intense like you will feel the heroes are in danger. No character is ever completely powerful not even superman ( he even gives an epic speech in the finale on why he holds back) and it just makes each hero even more relatable by showing the effort they must put in to stop the threat. The action and storytelling works as a balance that provides the viewer with emotionally engaging and thrilling stories.Legacy: The finale of the series leaves me a wheeping mess as all the heroes come running down a flight of stairs to continue their duty of protecting the planet and everybody who lives on it, as the show comes to an end with the main trio of superman, wonder woman and batman,ending on batmans logo, which is fitting, since it was because of the batman the animated series that this show even exists. While there are many other good superhero shows even DC comic ones like young justice, I don't think any show or movie could ever top the greatness that is this show. What makes this show so unique is that it evolves from just the core group of heroes to a large cast of them, which could have ended in disaster, but this show demonstrated that it could be done with good writing and a well established universe. Most other shows that attempt this feel almost too messy, stale and artificial by comparison. This show is truly the highest bar that all other superhero related shows or movies should be measured up too, because this show is truly one of the greatest animated feats in history. While I don't think you need to watch every episode to enjoy the overall experience, there are specific episodes to watch in the batman, and superman shows that cultivate in your watch of this show. Such as when batman first meets superman in \" Worlds Finest\" and the superman show Finale, there are so many easter eggs and references to these shows, that you will have just as much fun recognizing them.This is truly one of the greatest animated shows ever made, that is so rewatchable that its addicting. But as much as I adore this show it is not perfect, it is still an action cartoon and therefore it has short stories and requires a lot of pointless action, not to mention the 1st season was very bland especially the animation, but like the animation the show improves considerably, until it turns into a gorgeous work of art. The writing is excellent and the character writing is even better making us care about each character and their struggles. Although I am saddened by the fact live action movies cannot surpass these cartoons, I believe its because this was the medium superheroes were destined to be portrayed in, the show serves as a broad canvas and is a perfect setting for great storytelling. I am eternally grateful to this show and these heroes for molding me from childhood in to a good man. If you haven't watched the entire DCAU please go do it. \"And the Adventure Continues\"..."
    },
    {
      "username": "TheMan3051",
      "userUrl": "https://www.imdb.com/user/ur1196715",
      "reviewLink": "https://www.imdb.com/review/rw0790326",
      "warningSpoilers": false,
      "date": "5 February 2003",
      "rate": "",
      "helpful": "5 out of 16 found this helpful.",
      "title": "Mixed Reaction!",
      "content": "This is in my opinion a television show which sometimes features a great episode and at other times a horrible episode. The reason I think this is because DC characters really aren't that good. Marvel Comics has a terrific gallery of great characters like Spider-Man, X-Men, Daredevil, Fantastic Four, Captain America, among others. DC comics however doesn't feature that great of a gallery. While characters like Batman, Superman, Flash, and Martian Manhunter are outstanding characters. The rest I don't consider to be that good! However, the show has managed to surprise me, in the episode featuring Aguaman I was surprised to see the major improvements done with the post crisis Aguaman. Now he's a cool character!"
    }
  ],
  "errorMessage": ""
}