{
  "imDbId": "tt0275137",
  "title": "Justice League",
  "fullTitle": "Justice League (TV Series 2001–2004)",
  "type": "TVSeries",
  "year": "2001",
  "language": "en",
  "titleInLanguage": "Justice League (TV series)",
  "url": "https://en.wikipedia.org/wiki/Justice_League_(TV_series)",
  "plotShort": {
    "plainText": "Justice League is an American animated television series which ran from November 17, 2001, to May 29, 2004, on Cartoon Network. The show was produced by Warner Bros. Animation. It is based on the Justice League of America and associated comic book characters published by DC Comics. It serves as a follow up to Batman: The Animated Series and Superman: The Animated Series and is the seventh series of the DC Animated Universe. After two seasons, the series was rebranded as Justice League Unlimited, a successor series which aired for three seasons.\r\nIt was the first show on Cartoon Network to be produced by Warner Bros. Animation, and was the last Cartoon Network show to be greenlit by Betty Cohen.",
    "html": "<p>Justice League is an American animated television series which ran from November 17, 2001, to May 29, 2004, on Cartoon Network. The show was produced by Warner Bros. Animation. It is based on the Justice League of America and associated comic book characters published by DC Comics. It serves as a follow up to Batman: The Animated Series and Superman: The Animated Series and is the seventh series of the DC Animated Universe. After two seasons, the series was rebranded as Justice League Unlimited, a successor series which aired for three seasons.</p><p>It was the first show on Cartoon Network to be produced by Warner Bros. Animation, and was the last Cartoon Network show to be greenlit by Betty Cohen.</p>"
  },
  "plotFull": {
    "plainText": "Justice League is an American animated television series which ran from November 17, 2001, to May 29, 2004, on Cartoon Network. The show was produced by Warner Bros. Animation. It is based on the Justice League of America and associated comic book characters published by DC Comics. It serves as a follow up to Batman: The Animated Series and Superman: The Animated Series and is the seventh series of the DC Animated Universe. After two seasons, the series was rebranded as Justice League Unlimited, a successor series which aired for three seasons.\r\nIt was the first show on Cartoon Network to be produced by Warner Bros. Animation, and was the last Cartoon Network show to be greenlit by Betty Cohen.\r\nOverview\r\nBruce Timm, who co-produced Batman: The Animated Series and Superman: The Animated Series in the 1990s, became producer on an animated series focusing on the Justice League. The roster consisted of Batman, Superman, Wonder Woman, Green Lantern (John Stewart), The Flash (Wally West), Martian Manhunter (J'onn J'onzz), and Hawkgirl.\r\nAccording to audio commentary on the DVD release of Season 2, the second-season finale \"Starcrossed\" was expected to be the final episode of the series. However, in February 2004, Cartoon Network announced a follow-up series, Justice League Unlimited, which premiered on July 31, 2004, and featured a larger roster of characters.\r\nIt is the first series in the DC Animated Universe to fully use digital ink and paint, also the first to be produced in widescreen starting in Season 2.\r\nProduction\r\nKevin Conroy reprised his voice role as Batman from Batman: The Animated Series (1992–1995), The New Batman Adventures (1997–1999), and Batman Beyond (1999–2001). Batman's costume was redesigned, but this time, his costume was a combination of his last three costumes. The same costume from The New Batman Adventures is retained, but with the blue highlights from the Batman: The Animated Series costume and the long-ears from the Batman Beyond costume are added to the costume.\r\nTim Daly, who voiced Superman in Superman: The Animated Series (1996–2000), was initially involved, but he was unable to continue his role due to involvement with The Fugitive. He was replaced by George Newbern.\r\nAlongside Kevin Conroy and George Newbern as Superman, joining the rest of the main cast is Susan Eisenberg as Wonder Woman, Maria Canals-Barrera as Hawkgirl, Phil Lamarr as John Stewart, Michael Rosenbaum as Wally West / The Flash and Carl Lumbly as J'onn J'onnz / Martian Manhunter.\r\nSuperman was initially redesigned to have a bit of a squint to his eyes as well as cheekbones that were meant to make him look older than he did in Superman The Animated Series. Fans did not like the older appearance and in the second season the squint, grey streak and cheekbones were removed, in essence reverting Superman to his earlier animated look. As an in-joke, Superman's season one facial designs are used for an older Jor-El in the Justice League Unlimited episode \"For the Man Who Has Everything\". Furthermore, a common complaint in the first season of Justice League was Superman's powers being toned down even more than in Superman: The Animated Series. He was portrayed as unnaturally weak and vulnerable to harm with most episodes showing him being defeated by foes he should not have a problem with. This was changed from the second season onwards, where his strength and durability were increased.\r\nSeveral actors in previous DCAU shows also reprise their roles, including Dana Delany as Lois Lane, David Kaufman as Jimmy Olsen, Efrem Zimbalist Jr. as Alfred Pennyworth, Shelley Fabares and Mike Farrell as Jonathan and Martha Kent, Mark Hamill as the Joker, Clancy Brown as Lex Luthor, Corey Burton as Brainiac, Ron Perlman as Clayface, Arleen Sorkin as Harley Quinn, Peri Gilpin as Volcana, Diane Pershing as Poison Ivy, Mark Rolston as Firefly, Ted Levine as Sinestro, Michael Ironside as Darkseid, Michael Dorn as Kalibak, Lisa Edelstein as Mercy Graves, and Brad Garrett as Lobo. Due to budgetary reasons in the episode \"Hereafter,\" Corey Burton served as a substitute for Bud Cort as Toyman and Malcolm McDowell as Metallo, although both Cort and McDowell would reprise their roles in Justice League Unlimited. Likewise, Maria Canals (who provides the voice for Hawkgirl) voiced Livewire in the same episode, instead of Lori Petty.\r\nMost of the characters retained their general comic book origins and continuity, with some notable changes. In the Justice League series continuity, the premiere story arc \"Secret Origins\" revises the plot of Diana's competition against her fellow Amazons to be the ambassador of peace to man's world, and she is referred to as a \"rookie\" superhero during her first encounter with the League. (Subsequent episodes touched on her attempts to adjust to her new world). In an interview segment on the Season One DVD, Bruce Timm stated that he initially ran into some legal issues in using the Wonder Woman character, but he was adamant that she be used in the series. Additionally, the character of The Flash was portrayed as somewhat younger and significantly more brash than his comic book counterpart, taking on a number of personality traits of Plastic Man, who provides a similar comic relief function in the JLA comics. Major changes were also made to the Hawkgirl character. She became romantically involved with the John Stewart Green Lantern as the series progressed. A romantic relationship between Batman and Wonder Woman was also hinted at by the show's creators, who disliked pairing Wonder Woman with Superman despite fan requests. Robin is not paired with Batman in this animated series like he was on Super Friends.\r\nAlthough the series itself is animated in traditional 2-dimensional style, the opening credits are rendered in 3D with toon shading. The intro is a \"stock\" intro used throughout the series until Justice League Unlimited premieres.\r\nEpisodes\r\nVoice cast\r\nMain cast\r\nKevin Conroy - Batman\r\nMaria Canals-Barrera - Hawkgirl\r\nSusan Eisenberg - Wonder Woman\r\nPhil LaMarr - Green Lantern\r\nCarl Lumbly - J'onn J'onzz\r\nGeorge Newbern - Superman\r\nMichael Rosenbaum - Flash\r\nHome media\r\nFrom 2006 to 2011, Warner Home Video (via DC Entertainment and Warner Bros. Family Entertainment) released the entire series of Justice League on DVD and Blu-ray, and presented in original broadcast version and story arc continuity order.\r\nSeason releases\r\nWarner Home Video also released another DVD set titled Justice League: The Complete Series. It contained all 91 episodes of Justice League and Justice League Unlimited on a 15-disc set with the 15th disc containing a bonus documentary. This was later re-packaged and sold as a 10-disc set without the bonus documentary.\r\nSoundtrack\r\nA 4-disc soundtrack of musical highlights from both seasons of Justice League was released by La-La Land Records in July 2016. It is a limited edition of 3000 units and can be ordered at the La-La Land Records website. The set includes tracks from fan-favorite episodes like A Better World, Hereafter, Wild Cards and Starcrossed.\r\nLa-La Land are hoping to release a soundtrack for Justice League Unlimited as well, provided that sales of the Justice League soundtrack improve significantly and that there is sufficient demand from fans. A second Justice League volume may also follow if fans support the existing release.\r\nBroadcast history\r\nThe series premiere on November 17, 2001, set a Cartoon Network record with over 4.114 million viewers. This made it the channel's highest rated premiere ever, a record it would keep until September 13, 2009, when the world premiere of Scooby-Doo! The Mystery Begins gathered over 6.108 million viewers.\r\nThe show was aired in the Republic of Ireland on TG4 in both Irish and English from 6 September 2002 to 2007.\r\nReception\r\nJustice League and Justice League Unlimited has received critical acclaim and is often listed as one of the best animated shows of all time, with praise for its stories, writing, character development, and voice acting. IGN named Justice League/Justice League Unlimited as the 20th best animated television series of all time. Similarly Indiewire also ranked Justice League as the 20th best animated show of all time.\r\nMany fans including the creative team felt that season one of Justice League was a mixed bag, with the crew admitting it was a learning curve for them. Producer Bruce Timm had remarked \"some of the first season episodes I think were really good, but we had so many challenges inherent in the show. So many balls juggling in the air, and inevitably some of them dropped.\" He further added \"I think we were making a conscious effort to make it a little more of a family-friendly show, but unfortunately by pulling back on some of the more adult storylines, we didn't really replace it with anything. Something of a blandness set in with the show. We made steps to remedy that situation in Season Two, and to the point where I think the Season Two episodes make a much better show across the board. We're constantly calling it new improved Justice League.\"\r\nThe second season of Justice League however, is considered to be one of the best seasons of the entire DC Animated Universe, with Oliver Sava from The A.V. Club writing \"good enough isn’t good enough.\" \"That’s the philosophy for Justice League season two, according to producer Bruce Timm on the DVD commentary, and this two-part season opener is the perfect example of that new attitude in action. Just as Batman: The Animated Series set a new standard for solo superhero cartoon excellence, Justice League season two is only eclipsed by Justice League Unlimited as the strongest superhero-team series. Everything is of higher quality this season: the direction, animation, music, sound effects, and most importantly, the stories.\"\r\nAccolades\r\nCancelled film and reboot\r\nCirca 2004, Bruce Timm announced that a direct-to-video Justice League feature film was being planned. The film was intended to make a bridge between the second season of Justice League to the first season of Justice League Unlimited. The film was planned to reveal how Wonder Woman acquired her Invisible-Jet, and also planned to feature the Crime Syndicate as the main antagonists, an idea that was originally conceived for the two-part episode \"A Better World\", until the Syndicate was replaced by the Justice Lords. Dwayne McDuffie wrote the script and Andrea Romano assembled the cast, but Warner Bros. finally scrapped the project. In 2010, however, the film's plot was used for the non-DCAU film Justice League: Crisis on Two Earths with all references to the continuity of the DC Animated Universe removed. Most notably of these changes is the replacement of John Stewart with Hal Jordan as the Justice League's Green Lantern.\r\nAdaptations\r\nJustice League Adventures\r\nDC Comics published a series of 34-issue numbered comics based on the television series, between 2002 and 2004.\r\n#34 (2004-08-04): Guardians Against Darkness!\r\nCompilations\r\nJustice League Adventures: The Magnificent Seven (2004-01-01): Includes #3, 6, 10–12.",
    "html": "<p>Justice League is an American animated television series which ran from November 17, 2001, to May 29, 2004, on Cartoon Network. The show was produced by Warner Bros. Animation. It is based on the Justice League of America and associated comic book characters published by DC Comics. It serves as a follow up to Batman: The Animated Series and Superman: The Animated Series and is the seventh series of the DC Animated Universe. After two seasons, the series was rebranded as Justice League Unlimited, a successor series which aired for three seasons.</p><p>It was the first show on Cartoon Network to be produced by Warner Bros. Animation, and was the last Cartoon Network show to be greenlit by Betty Cohen.</p><br/><h3>Overview</h3><p>Bruce Timm, who co-produced Batman: The Animated Series and Superman: The Animated Series in the 1990s, became producer on an animated series focusing on the Justice League. The roster consisted of Batman, Superman, Wonder Woman, Green Lantern (John Stewart), The Flash (Wally West), Martian Manhunter (J'onn J'onzz), and Hawkgirl.</p><p>According to audio commentary on the DVD release of Season 2, the second-season finale \"Starcrossed\" was expected to be the final episode of the series. However, in February 2004, Cartoon Network announced a follow-up series, Justice League Unlimited, which premiered on July 31, 2004, and featured a larger roster of characters.</p><p>It is the first series in the DC Animated Universe to fully use digital ink and paint, also the first to be produced in widescreen starting in Season 2.</p><h4>Production</h4><p>Kevin Conroy reprised his voice role as Batman from Batman: The Animated Series (1992–1995), The New Batman Adventures (1997–1999), and Batman Beyond (1999–2001). Batman's costume was redesigned, but this time, his costume was a combination of his last three costumes. The same costume from The New Batman Adventures is retained, but with the blue highlights from the Batman: The Animated Series costume and the long-ears from the Batman Beyond costume are added to the costume.</p><p>Tim Daly, who voiced Superman in Superman: The Animated Series (1996–2000), was initially involved, but he was unable to continue his role due to involvement with The Fugitive. He was replaced by George Newbern.</p><p>Alongside Kevin Conroy and George Newbern as Superman, joining the rest of the main cast is Susan Eisenberg as Wonder Woman, Maria Canals-Barrera as Hawkgirl, Phil Lamarr as John Stewart, Michael Rosenbaum as Wally West / The Flash and Carl Lumbly as J'onn J'onnz / Martian Manhunter.</p><p>Superman was initially redesigned to have a bit of a squint to his eyes as well as cheekbones that were meant to make him look older than he did in Superman The Animated Series. Fans did not like the older appearance and in the second season the squint, grey streak and cheekbones were removed, in essence reverting Superman to his earlier animated look. As an in-joke, Superman's season one facial designs are used for an older Jor-El in the Justice League Unlimited episode \"For the Man Who Has Everything\". Furthermore, a common complaint in the first season of Justice League was Superman's powers being toned down even more than in Superman: The Animated Series. He was portrayed as unnaturally weak and vulnerable to harm with most episodes showing him being defeated by foes he should not have a problem with. This was changed from the second season onwards, where his strength and durability were increased.</p><p>Several actors in previous DCAU shows also reprise their roles, including Dana Delany as Lois Lane, David Kaufman as Jimmy Olsen, Efrem Zimbalist Jr. as Alfred Pennyworth, Shelley Fabares and Mike Farrell as Jonathan and Martha Kent, Mark Hamill as the Joker, Clancy Brown as Lex Luthor, Corey Burton as Brainiac, Ron Perlman as Clayface, Arleen Sorkin as Harley Quinn, Peri Gilpin as Volcana, Diane Pershing as Poison Ivy, Mark Rolston as Firefly, Ted Levine as Sinestro, Michael Ironside as Darkseid, Michael Dorn as Kalibak, Lisa Edelstein as Mercy Graves, and Brad Garrett as Lobo. Due to budgetary reasons in the episode \"Hereafter,\" Corey Burton served as a substitute for Bud Cort as Toyman and Malcolm McDowell as Metallo, although both Cort and McDowell would reprise their roles in Justice League Unlimited. Likewise, Maria Canals (who provides the voice for Hawkgirl) voiced Livewire in the same episode, instead of Lori Petty.</p><p>Most of the characters retained their general comic book origins and continuity, with some notable changes. In the Justice League series continuity, the premiere story arc \"Secret Origins\" revises the plot of Diana's competition against her fellow Amazons to be the ambassador of peace to man's world, and she is referred to as a \"rookie\" superhero during her first encounter with the League. (Subsequent episodes touched on her attempts to adjust to her new world). In an interview segment on the Season One DVD, Bruce Timm stated that he initially ran into some legal issues in using the Wonder Woman character, but he was adamant that she be used in the series. Additionally, the character of The Flash was portrayed as somewhat younger and significantly more brash than his comic book counterpart, taking on a number of personality traits of Plastic Man, who provides a similar comic relief function in the JLA comics. Major changes were also made to the Hawkgirl character. She became romantically involved with the John Stewart Green Lantern as the series progressed. A romantic relationship between Batman and Wonder Woman was also hinted at by the show's creators, who disliked pairing Wonder Woman with Superman despite fan requests. Robin is not paired with Batman in this animated series like he was on Super Friends.</p><p>Although the series itself is animated in traditional 2-dimensional style, the opening credits are rendered in 3D with toon shading. The intro is a \"stock\" intro used throughout the series until Justice League Unlimited premieres.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">November 17, 2001</td><td style=\"padding:0 8px\">November 9, 2002</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">26</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">July 5, 2003</td><td style=\"padding:0 8px\">May 29, 2004</td></tr></tbody></table><br/><h3>Voice cast</h3><h4>Main cast</h4><ul><li>Kevin Conroy - Batman</li><li>Maria Canals-Barrera - Hawkgirl</li><li>Susan Eisenberg - Wonder Woman</li><li>Phil LaMarr - Green Lantern</li><li>Carl Lumbly - J'onn J'onzz</li><li>George Newbern - Superman</li><li>Michael Rosenbaum - Flash</li></ul><br/><h3>Home media</h3><p>From 2006 to 2011, Warner Home Video (via DC Entertainment and Warner Bros. Family Entertainment) released the entire series of Justice League on DVD and Blu-ray, and presented in original broadcast version and story arc continuity order.</p><p>Season releases</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Name</th><th>Disc</th><th>Release Date</th><th>Ep #</th><th>Notes</th></tr><tr><td>Season One</td><td><span>DVD</span></td><td>March 21, 2006</td><td style=\"text-align:center;\">26</td><td>Contains a set of 4 DVDs with all of the episodes from the first season as well as audio commentaries, interviews, and other special features.</td></tr><tr><td>Season One</td><td><span>Blu-ray</span></td><td>August 19, 2008</td><td style=\"text-align:center;\">26</td><td>Season One has been re-mastered and re-issued as a set of 3 Blu-ray Discs (in full 1080p and with Dolby Digital 5.1 surround sound) with everything included on the prior release.</td></tr><tr><td>Season Two</td><td><span>DVD</span></td><td>June 20, 2006</td><td style=\"text-align:center;\">26</td><td>Contains a set of 4 DVDs with all of the episodes from the second season as well as audio commentaries and a panel discussion involving the production team of the series (although the set packaging indicates a featurette hosted by voice actor Phil LaMarr, it is misprinted, the featurette is on Disc One instead of Disc Four). Despite the show having been produced in a widescreen format this release lacks anamorphic encoding.</td></tr><tr><td>Season Two</td><td><span>Blu-ray</span></td><td>July 26, 2011</td><td style=\"text-align:center;\">26</td><td>Warner Home Video released Season Two on a two-disc (50GB each) Blu-ray set.</td></tr></tbody></table><p>Warner Home Video also released another DVD set titled Justice League: The Complete Series. It contained all 91 episodes of Justice League and Justice League Unlimited on a 15-disc set with the 15th disc containing a bonus documentary. This was later re-packaged and sold as a 10-disc set without the bonus documentary.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>DVD name</th><th>Release date</th><th>Additional information</th></tr><tr><td><b><span class=\"mw-redirect\">Justice League</span></b></td><td>April 23, 2002</td><td>Contains all three parts of \"Secret Origins\". <br> A mini-DVD version of this disc has also been released.</td></tr><tr><td><b>Justice on Trial</b></td><td>April 22, 2003</td><td>Contains \"In Blackest Night\" and \"The Enemy Below\".</td></tr><tr><td><b>Paradise Lost</b></td><td>July 22, 2003</td><td>Contains \"Paradise Lost\" and \"War World\".</td></tr><tr><td><b><span class=\"mw-redirect\">Starcrossed The Movie</span></b></td><td>July 13, 2004</td><td>Contains \"Starcrossed\" in both widescreen and fullscreen.</td></tr><tr><td><b>The Brave and the Bold</b></td><td>October 19, 2004</td><td>Contains episodes \"The Brave and the Bold\" and \"Injustice For All\".</td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>DVD name</th><th>Release date</th><th>Additional information</th></tr><tr><td><b>The Justice League Collection</b></td><td>April 13, 2004</td><td>Contains previous \"Secret Origins,\" \"Paradise Lost,\" and \"Justice on Trial\" DVDs</td></tr><tr><td><b>Challenge of the Super Friends to Justice League:</b></td><td>April 13, 2004</td><td>Contains the previously released \"Justice League\" (Secret Origins) DVD <br> along with two <span>Super Friends</span> discs in a slip-case.</td></tr><tr><td><b>Justice League - The Complete Series</b></td><td>June 20, 2006</td><td>Contains Justice League seasons 1 &amp; 2 <br> along with  Justice League Unlimited seasons 1 &amp; 2. (Blu-ray/DVD release)</td></tr><tr><td><b>Justice League: 3-Pack Fun</b></td><td>July 19, 2011</td><td>Contains \"The Brave and the Bold\" and \"Injustice For All\" <br> As well as the <i><span>Justice League Unlimited</span></i> episodes: <br> * \"For The Man Who Has Everything\" <br> * \"The Return,\" <br> * \"The Greatest Story Never Told,\" <br>  the <i><span>Young Justice</span></i> episodes: <br> * \"Independence Day\" <br> * \"Fireworks,\" <br> * \"Welcome To Happy Harbor\" <br> * \"Drop Zone\".</td></tr></tbody></table><br/><h3>Soundtrack</h3><p>A 4-disc soundtrack of musical highlights from both seasons of Justice League was released by La-La Land Records in July 2016. It is a limited edition of 3000 units and can be ordered at the La-La Land Records website. The set includes tracks from fan-favorite episodes like A Better World, Hereafter, Wild Cards and Starcrossed.</p><p>La-La Land are hoping to release a soundtrack for Justice League Unlimited as well, provided that sales of the Justice League soundtrack improve significantly and that there is sufficient demand from fans. A second Justice League volume may also follow if fans support the existing release.</p><br/><h3>Broadcast history</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><td class=\"mbox-text\"><div class=\"mbox-text-span\">This section <b>needs expansion</b>. You can help by <span class=\"external text\">adding to it</span>.  <span class=\"date-container\"><i>(<span class=\"date\">July 2016</span>)</i></span></div></td></tr></tbody></table><p>The series premiere on November 17, 2001, set a Cartoon Network record with over 4.114 million viewers. This made it the channel's highest rated premiere ever, a record it would keep until September 13, 2009, when the world premiere of Scooby-Doo! The Mystery Begins gathered over 6.108 million viewers.</p><p>The show was aired in the Republic of Ireland on TG4 in both Irish and English from 6 September 2002 to 2007.</p><br/><h3>Reception</h3><p>Justice League and Justice League Unlimited has received critical acclaim and is often listed as one of the best animated shows of all time, with praise for its stories, writing, character development, and voice acting. IGN named Justice League/Justice League Unlimited as the 20th best animated television series of all time. Similarly Indiewire also ranked Justice League as the 20th best animated show of all time.</p><p>Many fans including the creative team felt that season one of Justice League was a mixed bag, with the crew admitting it was a learning curve for them. Producer Bruce Timm had remarked \"some of the first season episodes I think were really good, but we had so many challenges inherent in the show. So many balls juggling in the air, and inevitably some of them dropped.\" He further added \"I think we were making a conscious effort to make it a little more of a family-friendly show, but unfortunately by pulling back on some of the more adult storylines, we didn't really replace it with anything. Something of a blandness set in with the show. We made steps to remedy that situation in Season Two, and to the point where I think the Season Two episodes make a much better show across the board. We're constantly calling it new improved Justice League.\"</p><p>The second season of Justice League however, is considered to be one of the best seasons of the entire DC Animated Universe, with Oliver Sava from The A.V. Club writing \"good enough isn’t good enough.\" \"That’s the philosophy for Justice League season two, according to producer Bruce Timm on the DVD commentary, and this two-part season opener is the perfect example of that new attitude in action. Just as Batman: The Animated Series set a new standard for solo superhero cartoon excellence, Justice League season two is only eclipsed by Justice League Unlimited as the strongest superhero-team series. Everything is of higher quality this season: the direction, animation, music, sound effects, and most importantly, the stories.\"</p><h4>Accolades</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Year</th><th>Award</th><th>Category</th><th>Nominee(s)</th><th>Result</th><th>Ref.</th></tr><tr><td rowspan=\"3\"><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">2002</div></td><td><span>Golden Reel Awards</span></td><td><span>Best Sound Editing – Television Animated Series – Sound</span></td><td>Robert Hargreaves, Mark Keatts, George Brooks, and <br> Kelly Ann Foley <span style=\"font-size:85%;\">(for \"In the Blackest Night, Part II\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Primetime Emmy Awards</span></td><td><span>Outstanding Main Title Theme Music</span></td><td><span>Lolita Ritmanis</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Rondo Hatton Classic Horror Awards</span></td><td colspan=\"2\">TV Presentation of the Year</td><td style=\"background: #DFF; vertical-align: middle; text-align: center;\" class=\"table-cast\">Runner-up</td><td align=\"center\"></td></tr><tr><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">2003</div></td><td><span>Golden Reel Awards</span></td><td><span>Best Sound Editing – Television Animated Series – Sound</span></td><td>Robert Hargreaves, Mark Keatts, George Brooks, and <br> Kelly Ann Foley <span style=\"font-size:85%;\">(for \"Savage Time, Part I\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"2\"><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">2004</div></td><td><span>Annie Awards</span></td><td><span>Outstanding Writing in an Animated Television Production</span></td><td><span>Paul Dini</span> <span style=\"font-size:85%;\">(for \"Comfort &amp; Joy\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Golden Reel Awards</span></td><td><span>Best Sound Editing – Television Animated Series – Sound</span></td><td>Robert Hargreaves, Mark Keatts, George Brooks, Mark Keefer, <br> Kelly Ann Foley, and Kerry Iverson <span style=\"font-size:85%;\">(for \"Twilight, Part II\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td rowspan=\"2\"><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">2005</div></td><td><span>Primetime Emmy Awards</span></td><td><span>Outstanding Main Title Theme Music</span></td><td>Michael McCuistion</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><span>Writers Guild of America Awards</span></td><td><span>Animation</span></td><td><span>Rich Fogel</span>, <span>John Ridley</span>, and <span>Dwayne McDuffie</span> <span style=\"font-size:85%;\">(for \"Starcrossed\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">2006</div></td><td><span>Annie Awards</span></td><td><span>Outstanding Directing in a Television Production</span></td><td>Dan Riba <span style=\"font-size:85%;\">(for \"Clash\")</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">2007</div></td><td><span>Gold Derby Awards</span></td><td colspan=\"2\">Animated Series</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr><tr><td><div class=\"center\" style=\"width:auto; margin-left:auto; margin-right:auto;\">2009</div></td><td><span>Cinema Audio Society Awards</span></td><td>Outstanding Achievement in Sound Mixing for DVD Original Programming</td><td>Edwin O. Collins, Tim Borquez, Eric Freeman, and Doug Andorka</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td align=\"center\"></td></tr></tbody></table><br/><h3>Cancelled film and reboot</h3><p>Circa 2004, Bruce Timm announced that a direct-to-video Justice League feature film was being planned. The film was intended to make a bridge between the second season of Justice League to the first season of Justice League Unlimited. The film was planned to reveal how Wonder Woman acquired her Invisible-Jet, and also planned to feature the Crime Syndicate as the main antagonists, an idea that was originally conceived for the two-part episode \"A Better World\", until the Syndicate was replaced by the Justice Lords. Dwayne McDuffie wrote the script and Andrea Romano assembled the cast, but Warner Bros. finally scrapped the project. In 2010, however, the film's plot was used for the non-DCAU film Justice League: Crisis on Two Earths with all references to the continuity of the DC Animated Universe removed. Most notably of these changes is the replacement of John Stewart with Hal Jordan as the Justice League's Green Lantern.</p><br/><h3>Adaptations</h3><h4>Justice League Adventures</h4><p>DC Comics published a series of 34-issue numbered comics based on the television series, between 2002 and 2004.</p><ul><li>#34 (2004-08-04): Guardians Against Darkness!</li></ul><h4>Compilations</h4><ul><li>Justice League Adventures: The Magnificent Seven (2004-01-01): Includes #3, 6, 10–12.</li></ul><br/>"
  },
  "errorMessage": ""
}