{
  "imDbId": "tt0121955",
  "title": "South Park",
  "fullTitle": "South Park (TV Series 1997– )",
  "type": "TVSeries",
  "year": "1997",
  "items": [
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw3787404",
      "warningSpoilers": false,
      "date": "23 August 2017",
      "rate": "9",
      "helpful": "51 out of 54 found this helpful.",
      "title": "Animated satire at its finest",
      "content": "Initially was not sure as to whether 'South Park' would be my cup of tea at all, despite being a huge fan of animation for all my life (and still very much am). But there have been many instances of films and shows that gave me conflicted feelings before watching, but turned out far better than expected and actually being very good or more.Such is the case with 'South Park'. As of now, it is one of the highest rated shows on IMDb and was a huge ratings success when first aired, and no wonder. At its best, it's absolutely brilliant and one of the best and funniest shows there is to me. Thought that would never be said about a show known for dividing people with its controversial and \"offensive\" content, was not sure whether I would like it let alone love it and it ended up a favourite. Is it as good as it was? No, it's not as witty, daring or inventive now, but is still very funny and intelligent. That is only being said though because the earlier seasons are so good.To me, 'South Park' is much better than other popular shows like 'The Simpsons' (originally fantastic, now has declined rapidly) and 'Family Guy' and Seth Macfarlane's other shows, which never did anything for me.Can actually see though why some dislike it. A lot of the content is very controversial and not for the easily offended. The show is crude, extremely rude (possibly the rudest animated show ever), naughty, at times juvenile and less than subtle in its treatment of taboo subjects. At the same time, 'South Park' is hilarious, smart, witty and daring but also clever, sharp, irreverent and intelligent. The satirical humour is subversive and there are not many animated shows this daring, completely contradicting the tired and incredibly annoying cliché spouted constantly that animation is only for children (often by parents defending a panned family film).Often one is shocked at how much 'South Park' gets away with, everything. Every subject and every everyday issues is covered and satirised it seems, nothing escapes the writers. While subtlety completely goes out the window, so much of what 'South Park' says has a huge amount of truth and relevance (both when it first aired and still very much so now). Like good satire should it does it in a daring and perhaps divisive fashion, not holding back and taking no prisoners. This should sound like a recipe for disaster, but actually to me it was why the show is so loved and admired.There's more to 'South Park' than just the humour. The stories are very inventive, smartly constructed, cohesive, honest and relevant. The characters are some of the most memorable and iconic in recent animation, especially Cartman. Trey Parker and Matt Stone's voice work is a practical tour-De-force for both, both bringing so much individuality and personality to these characters and their writing.Not everybody seems to like the animation, personally liked the quirkiness of it myself and there are not many shows with visuals like 'South Park's'. The music is energetic and catchy.Overall, brilliant show that surprisingly became right up my street, even with the controversial content. 9/10 Bethany Cox"
    },
    {
      "username": "manuel_medeiros",
      "userUrl": "https://www.imdb.com/user/ur50417130",
      "reviewLink": "https://www.imdb.com/review/rw4443481",
      "warningSpoilers": false,
      "date": "7 November 2018",
      "rate": "10",
      "helpful": "196 out of 208 found this helpful.",
      "title": "Best social satire ever, yet rarely seen as such",
      "content": "South Park is probably the most misunderstood show in TV history.Sure, it does have fart jokes but what it has really involved into is a show that depicts a wide range of current events, pop cultures references, social problems through the lenses of a group of 10 year olds and all the wacky characters that surround them.The fact that the drawings are fairly simple also makes a lot of people shy away from it, but actually this show has a completely unique approach to several divisive or thought-provoking subjects. To name a few:'The Hobbit\" looks at how photoshopped photos makes society expectations of a woman's body hard to reach and the amount of pressure it may put on little girls (whilst taking hilarious jabs at Kanye West and Kim Kardashian)\"You're getting old\" takes you over the nightmare that is feeling like you might be mentally older than you friends and that may make left outConsole Wars episodes dive into the consumerism involving Black Friday, video games and the world's obsession with Game of ThronesThese are all great episodes and I think the show if anything has aged well with time.The other brilliant thing about South Park is that because each episode gets produced in the span of week, it can be more up to date than any scripted show - just this season it referenced Kavanaugh nomination controversy in an episode even before he was eventually confirmed.Second 10/10 I have given on IMDb and South Park is well deserving of it."
    },
    {
      "username": "liquidcelluloid-1",
      "userUrl": "https://www.imdb.com/user/ur3027087",
      "reviewLink": "https://www.imdb.com/review/rw0995231",
      "warningSpoilers": false,
      "date": "9 January 2005",
      "rate": "",
      "helpful": "420 out of 543 found this helpful.",
      "title": "Comedy Central's marquee series. The very best political, pop culture and current event satire on television.",
      "content": "Network: Comedy Central; Genre: Animated Comedy, Satire, Parody; Content Rating: TV-MA (for dark comic content and graphic language, sexual content, violence & animated gore); Available: DVD; Classification: Modern Classic (Star range expanded: 1 - 5);Season Reviewed: 10+ seasonsStan Marsh, Kyle Broflowfski, Eric Cartman and (sometimes) the ill-fated Kenny McCormick are 8-year-old boys growing up amid an adult world in the backward, frozen-over mountain town of South Park, Colorado. Their adventures, that make up creators Trey Parker and Matt Stone's animated comedy \"South Park\", include fending off everything from supernatural demons to the biggest names in the Hollywood intelligentsia. \"South Park\" is several things. It's rude, crude, shocking, smart, decidedly adult, completely original, and it is indulgent in the whims and imaginations of it's creators. It's also the very best political, pop culture and current event satire on television. The show started as something of a fad - the new vulgar, don't-let-the-kids-watch show on the block. But as real world events changed, \"Park\" evolved along with them. Standing as the kings on top of a soap box they constructed out of swearing kids, talking poo, homosexual hand puppets and hermaphroditic parents; Parker and Stone where blessed with the freedom of a hit series, hip status and a network that gave them the freedom to do whatever they want. As the show aged, they matured in their storytelling abilities and the show went from shock value fad to a barbed satire of American culture. \"Park\" is brought to life with oddly beautiful, vibrantly colored 2-dimensional cut-and-paste animation. The episodes are masterfully constructed. The writing a witty showcase of Parker and Stone's love for pop culture parody, graphic violence, pornography and a bold willingness to take on the hot button issues of the week. It is a free-for-all virtuoso where nothing and nobody is safe, every establishment media position gets flipped on it's head and every politically correct sacred cow gets eviscerated. Now that's comedy - if you can stomach a barrage of extreme scatological humor with your social satire. The vomit jokes and fat jokes on \"Park\" aren't there for the sake of it, but have substance behind them. And nobody does them better. Eric Cartman, Mr. Garrison and more recently Randy Marsh (stepping up as a reliably hilarious scene-stealer) are classic characters, but Parker and Stone have gone further and developed an entire town of colorful caricatures. They aren't made to be as endearing as those in \"The Simpsons\", but aren't supposed to be. The characters aren't just vacuous idiots, and the laughs of the show come from a very socially conscious place. Straight men Stan and Kyle are the show's most underdeveloped. They serve mostly as a mouthpiece for Parker and Stone's conservative libertarian philosophy, often literally giving a speech to a crowd in the show's finale. There is not a single other place on TV where you can see environmentalists, the anti-smoking lobby, illegal immigrants, trial lawyers, news media hysteria, elitist Hollywood liberals, abortion, sex ed in schools and every celebrity from Mel Gibson to Paris Hilton all get ripped to shreds. The show pulls it off because it has a unique ability to deconstruct and reconstruct current events better than anyone else (notably Comedy Central's overrated \"The Daily Show with Jon Stewart\"), giving them a hilarious or supernatural explanation without moralizing getting in the way of the laughs. They take their own messages to such loony extremes it's impossible to take seriously.The cherry on top is the seemingly endless quality of the original songs provided by the creator's cover band, DVDA. With a skeleton crew that writes, directs, animates, voices and scores the show, this is independent television in it's purest form. This means it often labors on Parker and Stone's geeky indulgences - episodes center around a full-length \"Star Wars\" parody, the class gerbil making it's way up a human bowel or Timmy, a handicapped student who can only say his name. Occasionally, their shock value execution creates a gagging reaction that obscures an otherwise brilliant point (\"Fat Camp\"). But I'd rather have a show that challenges me than one shackled to clichés and network mandates. When \"South Park\" goes for the shocking ending, you better believe it actually will shock. Still, \"South Park\" is almost impossible to recommend in a casual sense. The show is truly an acquired taste, but one I have to come to support whole-heartedly through the years despite (and because) I have absolutely no idea what to expect when sitting down for a new episode. How rare is that? Where so many other shows cower in the corner, begging for our approval \"South Park\" is constantly taking risks and re-inventing itself. We've got terrific stunt episodes, episodes built around one joke or building to a single knock-out punch line. They use the smash-cut ending better than anyone (\"There Goes the Neighborhood\"). Sometimes the experiments are to it's own detriment and the episode is a 22 minute bore, but even then it's almost unheard of to find a show in it's 10th season that is still water cooler television. \"South Park\" grabs us by the collar, shakes us around and dares even it's biggest fans to come back next week for more. The show is a monument of creative freedom with a wicked imagination, a true (and hilariously funny) sense of comic timing, and an insightful, socially conscious ear that smartly reflects a point of view starving for attention in mainstream television. It is a hugely entertaining, fiercely visceral, fire-breathing, red-blooded American satire made by, for (and most appreciated by) the most jaded and discriminating TV viewers. We just don't have shows like this on TV today. Anywhere. * * * * * / 5"
    },
    {
      "username": "Op_Prime",
      "userUrl": "https://www.imdb.com/user/ur0199296",
      "reviewLink": "https://www.imdb.com/review/rw0487219",
      "warningSpoilers": false,
      "date": "14 August 2000",
      "rate": "",
      "helpful": "486 out of 650 found this helpful.",
      "title": "Wake up! South Park rules!",
      "content": "I don't know why this show is getting such negative reviews. A lot of people (adults mainly) keep assuming South Park is nothing more than wall to wall curse words and gross out jokes. Far from it. Sure, they swear and there is an occasional gross out jokes, but the show is also filled with quality and classic humor. The plots are genius. So what if it's offensive. Big deal! For some reason, people assume that cartoons are just for little babies, and some people appear to have difficulty accepting the fact that times have changed and animation is not just for kids anymore. Face it, we are living in an age of shows like South Park. Can't deal with it? Then that's just too bad."
    },
    {
      "username": "Raven_Z",
      "userUrl": "https://www.imdb.com/user/ur2056627",
      "reviewLink": "https://www.imdb.com/review/rw0975742",
      "warningSpoilers": false,
      "date": "10 December 2004",
      "rate": "",
      "helpful": "1,162 out of 1,335 found this helpful.",
      "title": "Sadly Misunderstood",
      "content": "South Park is one of the most misunderstood, and also the most intelligent shows on television.South Park is a satirical look on most anything from Western society - politics, the media, today's youth, celebrities, violence in our society, and much much more. However, instead of presenting these issues as they are, they alternately project them through the exploits of four young boys in South Park, Colorado. Unfortunately, many people take the show solely at face value, refusing to see the intelligence in it - South Park is admittedly filled with racist and sexist jokes, along with other offensive material. The problem lies within the fact that most people don't seem to understand the concept of satire and self parody. I admit that I, myself, was one of these people - for years I refused to watch that \"garbage,\" until finally a friend forced me to actually watch a whole episode, and I realized that the show was actually making a point.So, if you haven't done so, go - watch an episode. You'll feel smarter when you're done."
    },
    {
      "username": "Bored_Dragon",
      "userUrl": "https://www.imdb.com/user/ur56005872",
      "reviewLink": "https://www.imdb.com/review/rw4532605",
      "warningSpoilers": false,
      "date": "24 December 2018",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "\"There is actually a lot of intelligent social commentary here - it's just masked under anything they could possibly offend someone with.\" - chthon2",
      "content": "16 October 2017For some reason, I stopped following this show a long time ago, even before the tenth season I think. Recently, again for some inexplicable reason, it came to my mind and I decided to start it all over, from season one, but this time I'm going to finish it, or better to say catch it, because I hope it will never end. This morning I finished the first season. There's nothing better than healthy laughter with morning coffee. After 20 years this season is still fresh and hilarious. One of the strongest tens I ever gave.10/10(I'm near the end of the 8th season now and it still kicks ass.)24 December 2018In the last year I have seen all 22 seasons of \"South Park\" and, although it had its ups and downs, overall it's one of the best TV shows of all time and definitely the ultimate animated one. I can't wait for the 23rd season."
    },
    {
      "username": "happipuppi13",
      "userUrl": "https://www.imdb.com/user/ur3329978",
      "reviewLink": "https://www.imdb.com/review/rw8298895",
      "warningSpoilers": true,
      "date": "4 July 2022",
      "rate": "9",
      "helpful": "7 out of 7 found this helpful.",
      "title": "An Updated Review and Perspective",
      "content": "Back on November 16th, 2005, I wrote a review of South Park here, having only seen maybe a season or 2 of syndicated reruns. At that time, edited versions were being played on my local WB affiliate after 11:30pm. (Now known as the CW).My viewpoint of the show at the time , I liked it okay but was very put off by the very adult themes and storylines, plus the 'bleeped' language. Eric Cartman especially disturbing , except when he ended up in prison.A few days ago, I re-read that review and I realized, it sounded judgemental, immature and really , like an over reactionary review. In short...it just wasn't who I am now. (I felt embarrased by what I read, so I ended up deleting it).Since that time, I've really gotten to know the series better on Comedy Central. (I know they've moved recently) . The characters and what they are all about and really seeing the reasons for a lot of the things that bothered me then.I wont kid you, there are still things (blooody or gory) that happen on the show that I just can't look at but, not as much as in 2005.Having seen practically all the shows now, I feel the series is very good and while I know there's others who may disagree, they are entitled to their opinion. Everyone can't like the same things.I've watched the storylines go from just being about the boys and the bizzare things that happen to them, as well as the adults who seem to either be loud and obnoxious or kind of immature for their age. Some even clueless or reckless. Thankfully writen in a very funny way.Despite what Trey said recently about wishing he could destroy Seasons 1 to 3 , I don't see why. Just because he and Matt were in their 20s then and 'thought' a certain way about humor? In my view, any kind of artist should stand by their work, regardless of mindset at the time. (My old review wasn't art, it was a half formed opinion).I know most South Park fans would agree, that those 3 seasons and the next 7 are very good to great. Not 'perfect' but, it was simply a work in progress. They were certainly doing something right , as not only did they get a theatrical movie out in 1999 (after only 2 seasons) ...in April 2006, they actually won The Peabody Award .(Peabody Award, in full George Foster Peabody Award, any of the awards administered annually by the University of Georgia's Grady College of Journalism and Mass Communication in recognition of outstanding public service and achievement in electronic media.)In short, their creativity, despite the things that offended people, was rewarded for at least having true purpose and meaning. ...and not just being Freshman humor or less , just to be shocking.They don't give that award to just 'any' TV show, to be sure. I know brilliant humor on the show, has served them well for a very long time.Emmy wins were kind of an icing on the cake for it. The boys and all the kids presented have had real, rich, meaningful storylines about them and while the adults can still be absurd, they're painted more human than they originally were.I now have a great many favorite epiosdes and like a lot more of the characters than I did years ago. Butters is my favorite above all, as his inital Naive' ways , reminded me of myself at ages 8, 9 and 10. (Minus the language and villainy. I was just a normal good kid too.I didn't even mind the story arc that they had a few years ago , although near the end , I kind of wanted them to get back to basics and be a bit less dramatic. They're good at being serious in their shows when it's called for but too much can be a bit of a drag.The show in 2020, when Covid hit South Park, was necessary but very difficult to get through. We were in the midst of lockdown in America, so whatever was funny n that show, I could not find funny then. Maybe in time, I could .With Trey and Matt's recent ...ah, \"donation\" of millions of dollars to stay in production, they have returned woith not only the 'futre' set South Park Shows but new ones with the boys still boys.The episode with the 'bruh' teens agains t the boys & their dads was hilarious, the funniest show in a long time. \"How do you make Ramen brah?\" That line sent me off my chair.Chef is missed on South Park and I still miss the character Pip, for sure but there's no way we'd want to replace Chef. Newwer characters are thankfully well thought out and played as well too.All the kid characters have atheir own unique personalities and quirks and the adults are far more fleshed out then they were at the beginning.In rating South Park as the whole entity, I now give it 9 stars. Only 1 off for a few shows that just didn't work (That's only an opinion, I do love the show). I was raised in a house where 'foul' language was grounds for, well, grounding. My older brothers were punished more than Butters!So, likely, I steered clear of that kind of talk for a long time, which is really why my old rating was 7. That and just culture shock i guess. South Park could only exost on a paid channel when it debuted. I grew up with standard big 3 network programming, with very little swearing. (I 'do' sometimes swear but only with good reason, not constantly.)None of those network shows could be like South Park of course, being an animated series , gave and still gives it the edge to be out there in creativity. Which now, 25 years later, has been refreshed and now in their early 50s, Trey and Matt seem to have their 'A' game back.I also thank my wife , a true South Park fan, for helpingme see there was more to it than I had originally thought. Oh...and My favorite episode is still the Bin Laden / 9/11 show. (END)"
    },
    {
      "username": "lambiepie-2",
      "userUrl": "https://www.imdb.com/user/ur0874373",
      "reviewLink": "https://www.imdb.com/review/rw0487304",
      "warningSpoilers": false,
      "date": "10 November 2003",
      "rate": "10",
      "helpful": "229 out of 339 found this helpful.",
      "title": "The Princes of Animation Comedy",
      "content": "I remember when these four little boys were nothing but private greeting card art. Now look at them!In all seriousness, I love this show. This is the funniest adult cartoon there is, and thank GOODNESS Comedy Central took this series and allowed the creators to do \"almost\" anything. If there was an alternate universe for \"Peanuts\", you've hit it in \"South Park\".There are very few (if none) episodes I didn't like. We all have our favorites, and my number one is still \"Cartman Gets an Anal Probe\". I laughed until I cried on that one. The next one that is very close to that is last years (2002) Christmas Special when Jesus was \"packing\" to rescue Santa out of Iraq after he was shot down. This was one of those episodes where I DARE you not to laugh and enjoy it.The supporting cast about South Park is also stellular. The lives (and minds) that intertwine with Stan, Cartman, Kenny and Kyle are just hilarious. Chef, Mr. Garrison. Kyles Mom and Dad, Cartman's Mother, Butters, Timmy!, Sherrif Bar Brady, Principal Victoria, Wendy, BeBe, and..Big Gay Al..etc....etc..you name it, they are just too much.Wonderful and ground-breaking (even though the animation isn't state of the art) nothing is out of bounds for these guys...South Park is an instant classic and a great time to be had by all."
    },
    {
      "username": "Muldwych",
      "userUrl": "https://www.imdb.com/user/ur4845458",
      "reviewLink": "https://www.imdb.com/review/rw1025980",
      "warningSpoilers": false,
      "date": "21 February 2005",
      "rate": "",
      "helpful": "274 out of 382 found this helpful.",
      "title": "An Excellent Program All Too Frequently Dismissed",
      "content": "Both cartoons and sci-fi have long been the only place where thought-provoking social commentary can take place, unmolested by censorship, and both are all too frequently dismissed because of their least important characteristics. South Park is an intelligent, humorous and thought-provoking show that is often ignored or decried by people who judge it only by the very things it deliberately throws in their face, such as profanity, simple animation, and graphic violence, because the creators know that people like this are easily offended by these things, and will always miss the point. The simplicity of the animation, for example, has been criticised by people who miss the point that it's deliberately meant to be simple, in the face of those high-budget major studio cartoons that are more concerned with using cgi and selling toys than having anything to say. Nope, this isn't a show for those who don't appreciate irony. The episodes tackle a wide range of issues, from 9/11 to violence on television to celebrity obsession to religion, through the use of comedy, which is usually the best way to handle such matters.The main characters are four children who are basically mouthpieces for their creator's opinions, expressing views that would sound arrogant coming from adults. Stan represents the liberal viewpoint, as does his friend Kyle, who as a practising Jew, allows opportunity for religious comment. Is the show anti-religious? No, but fundamentalists like to think it is. It has the essential message of 'believe what you like, but leave me alone'. And of course there's Eric Cartman, the ignorant foul-mouthed selfish redneck, and funny as hell. Sometimes I think he's there to remind us not to take anyone like him seriously. That and to provide a lot of the show's humour. Easily my favourite character. Other characters on the show usually represent majority/opposing views as the plot requires.Like any long-running show, some episodes are better than others, not all have something to say, and not all are funny. But creators Stone and Parker 'retool' the show periodically with new characters, and try to keep up with current events, and I enjoyed the latest series (8th) for these very reasons. I've watched since the beginning, but they're making an effort not to let South Park go stale.No doubt South Park will continue to be derided by those who think the most important social problem today is swearing, yet have probably never sat down to watch an episode. And beside them will be the offended parent brigade who still haven't learned that not all cartoons are for children. But the rest of us will still be here to enjoy it, hopefully exchanging righteous indignation for a few laughs and maybe a thought or two about the world we live in. If you've never seen South Park, don't listen to the hype. Watch it and decide for yourself. Hopefully you'll be glad you did."
    },
    {
      "username": "ericstevenson",
      "userUrl": "https://www.imdb.com/user/ur66601046",
      "reviewLink": "https://www.imdb.com/review/rw3544245",
      "warningSpoilers": false,
      "date": "14 September 2016",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Yeah, I love this",
      "content": "I remember back when \"South Park\" first came out and I thought to myself it was an awful show if only because of the animation. This is definitely something that's grown on me. Many people chastise this show for being mean spirited, but it honestly isn't. I love the episodes where they say that if you're a genuinely good person, it doesn't matter what your (religious) beliefs are. The important thing is to do the right thing and that's something my family always taught me. Contrast this with something like \"Family Guy\" where they say you're an idiot if you believe in God. Trey Parker said that of all the ridiculous things religion teaches, atheism is even worse as it teaches that things happen for no reason. This is a wonderfully original and insightful idea.It's weird how people can support other shows like Bill Maher. He outright says you're a bad person because of what you think. In this show, it simply says to live your life the way you want because your ideals work for you. Maybe religion will die, but the spirit of love will always live on. While you may argue that \"South Park\" does not have a consistent ideology, you could say the same for the Nostalgia Critic. I'm certain you'll be offended by at least one thing they say. Controversial jokes work great if they're done well. They need to be done with no real spite like this show does. Yes, the show is quite obscene, but it definitely makes you think more than most shows.It's hard to find a cartoon that is so topical. All you really have to do is just look at the world around you and imagine what the next episode of \"South Park\" will say about it. This is a great example of how pop culture reflects everyday life. The show used to be known for Kenny dying in every episode, but now rarely does it at all. This show has in fact changed for the better and it does treat the viewers with respect. My favorite character would have to be Butters. It's probably because he's the only kid who doesn't swear and he reminds me of how I was in the exact same position as a kid.Should kids watch this? No. We spend most of our lives as adults so we'll have a lot more time to watch shows like this. It's great that the show is developing more and more of an ongoing storyline. Trey Parker and Matt Stone are great people who want you to accept who you truly are. This show is a great source of entertainment, but might be hard to follow politically. It's nice how they make fun of everyone who exists, but don't resent them. If you think that characters like Cartman are supposed to be loved, you're missing the point. Cartman exists for the role of showing the creators' frustrations towards true bigots. It seems like you're missing out on a lot by rejecting this show, but that's fine. I personally find this to be the funniest and most relevant cartoon ever made. It's certainly dark, but lacks true malice. I do think it's important to make jokes that are relevant to a story, because it's just better written. I'm glad this show has gone on so long. ****"
    },
    {
      "username": "IonicBreezeMachine",
      "userUrl": "https://www.imdb.com/user/ur117926588",
      "reviewLink": "https://www.imdb.com/review/rw6996913",
      "warningSpoilers": false,
      "date": "4 June 2021",
      "rate": "7",
      "helpful": "8 out of 9 found this helpful.",
      "title": "One of those shows I respect more than I actually like",
      "content": "The series follows a group of four third grade boys(later fourth grade) in the town of South Park, Colorado consisting of Stan(The most grounded and \"normal\" one of the group usually characterized by his cynicism), Kyle (The town's lone Jewish child with a strong willed sense of moral and social responsibility), Cartman (a fat, racist, sexist, arrogant loudmouth who goes to great extremes to bring others misery) and Kenny (the oft-muffled and indiscernible one of the group whose interest include pornography or mischief when he's not being killed in an over the top fashion). Each week the group encounter over the top situations usually spawned from a fun house mirror image of a real world controversy or news cycle, with issues such as abortion, homosexuality, economic policy, racism, sexual politics, and many other taboo subjects with edge to spare.The brain child of creators Matt Stone and Trey Parker, South Park's humble beginnings stem from the creation of two shorts the duo made that served as prototypes for what would become the series (Jesus vs. Frosty). The shorts became early examples of viral media and was spread by notable figures such as George Clooney (who would later have a joke \"guest appearance\" giving guttural dog growls in the episode Big Gay Al's Big Gay Boat Ride). The series almost became a show on the Fox network during their early days having made contemporary envelope pushing content such as Simpsons, Cops, and The X-Files that all pushed the limits of what constituted \"broadcast acceptable\". While executives at the network were initially enthusiastic about the show, disagreements (particularly about Mr. Hankey the Christmas Poo) would end negotiations and shift the duo's efforts to Paramount with a choice of MTV or Comedy Central. Even prior to broadcast the show was faced with poor test screenings and nervous executives, but despite all this the series became a breakout hit generated buzz with taglines like \"this is why the invented the V-Chip\" and becoming a cultural phenomenon prior to airing with $30 million in T-Shirt sales and becoming one of the most watched shows on cable TV at the time and giving mainstream credibility to the network Comedy Central beyond their one respected property Mystery Science Theater 3000 which had mainly niche appeal. In the years since its rough around the edges first season the show has become a pop culture touch stone with many of its lines, characters, and visuals taking on a life of their own becoming cultural icons. The show also is known for its razor sharp bite, fearlessly satirizing politics, culture, society, entertainment, and anything else they can get their hands on.... I only wish I liked and enjoyed the show as much as I respected it.There's no individual element I can point to as when my enjoyment of South Park diminished as the series hasn't seen any noticeable dip in quality since its first season (in fact the writing and animation has only gotten better and better while retaining its minimalist amateur charms), but more with how and what the show satirized. I can understand and appreciate the show's satire of many elements as being both funny and valid, and even episodes with basic if any satire and more of a humor focus are quite good (The Red Badge of Gayness wherein Cartman tries and almost succeeds undoing the North victory of the Civil War simply so he can win a bet with Kyle and Stan is easily my favorite episode of the series) with the show's attacks on various societal inanities being both insightful and humorous.....but then there's the other times where not only did I feel they missed the mark, they went the complete opposite direction from the mark. Episodes like Butt Out, Smug Alert, Two Days Before the Day After Tomorrow, or Manbearpig are some of the most infuriating episodes of television I have ever witnessed. Butt Out plays devil's advocate for cigarette companies playing up a weird Willy Wonkaish image for the Cigarette companies while showing anti-smoking advocates as a coven of vampires willing to lie and murder. Not only does Butt Out use Cigarette Industry funded \"studies\" to say there's no evidence second hand smoke kills, this episode came out SEVEN years after Jeffrey Wigand blew the whistle on the Cigarette companies and was subjected to threats against himself and his family by third party thugs hired through backchannels by Brown & Williamson and created debunked dossiers filled with lies. There's nothing wrong with playing Devil's advocate, but this isn't Devil's Advocate, it's Devil's Cheerleader! If they didn't read the Vanity Fair article, fine, but there's a bloody movie by Michael Mann (The Insider) that covers it! This same approach is utilized in other episodes outside Butt Out with similar aggravating disregard for reality and utilizing other industry funded studies that of course look favorably upon the industry because if you're grading yourself, why grade yourself anything but an 'A'? And the fact that Stone and Parker don't bother pointing out that falicy in industry funded research shows a remarkable lack of self awareness in two individuals whose careers are built on \"Fearless Satire\"South Park earns my respect because it says what it wants without a filter. Agree or disagree, there's no attempt to paint their words to make them more appealing, and I can respect that. I can respect the show is made in lightning fast time in both writing and productions. I can respect their willingness to tackle subject matter that larger scale productions wouldn't go near with a 40 foot pole. Unfortunately I don't enjoy or get anything from South Park that I'm happy about. Each subsequent season of South Park left me feeling a greater ratio of sadness, anger, and frustration than humor or laughter. At the end of the day, South Park is about looking into the unflushed toilet that is society and meticulously pulling apart the leavings floating in the bowl for no other reason than to see what the leavings are made of and what makes them smell as bad as they do. I can't ding the show for this because that's exactly what it sets out for, and it's exactly what it accomplishes. Do with that what you will."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw0487205",
      "warningSpoilers": false,
      "date": "19 February 2000",
      "rate": "10",
      "helpful": "133 out of 219 found this helpful.",
      "title": "One of the funniest television shows on TV",
      "content": "South Park is a great cartoon, even with it's occasional pitfalls every season. It combines satire, music and comedy to create a terrific masterpiece of an animated show. Trey Parker and Matt Stone bring the weekly antics of a inbred mountain town in a way that has never been done before and it is drop dead funny. Sometimes it seems like the seasons get better, sometimes they seem to get worse for some. But episodes like \"Chinpokomon\", \"The Passion of the Jew\", \"Tolerance Camp\", and \"Clubhouse\" are classics. And most episodes get funnier every single time I see it and thanks to Comedy Central giving Parker and Stone full control for language, nothing is out of bounds."
    },
    {
      "username": "PartialMovieViewer",
      "userUrl": "https://www.imdb.com/user/ur12682317",
      "reviewLink": "https://www.imdb.com/review/rw2959530",
      "warningSpoilers": true,
      "date": "12 February 2014",
      "rate": "10",
      "helpful": "8 out of 9 found this helpful.",
      "title": "Grossest and Funniest and Most Honest Comedy",
      "content": "I started watching this show a couple of years ago. The first episode I watched had the \"Timmy\" character as the main star (?). Of course - I immediately thought to myself, \"Is there no shame is there?\" I was also - laughing so hard, I could not stop crying. This is a show for those who have no political allegiance and were born with that rarest of attributes thick skin. If you like this kind of humor (and I do) the laughs are non-stop, cutting edge and always outrageous. If you are offended easily, watch something else. Maybe a show like 'Friends' is right up your alley. You will hear the same overly-clichéd and acceptable hard-left jabs at conservatives, which are all reinforced by the tiring sounds of obvious laugh-tracks. These guys (on South Park not Friends) are no one's lapdog. They dig at everyone and anything. Nobody is holier-than-thou and everyone wears a comedic target on their back. Because of this approach, I feel the show is more honest about its humor (much like, 'Saturday Night Live', was in the '70s), where nothing is sacred and nothing is expected. The big difference is that you don't have to wait the entire show for a laugh. The writers are not a bunch of Suzy-suck-ups and write on strictly impulse now that is courage. Additionally, I think each one their little animated characters are destined to become cult-heroes or not. Fun show and thanks for the laughs. I cannot wait to see the spin these guys put on 'The 2014 Sochi – Olympics.\""
    },
    {
      "username": "SSJAniFan",
      "userUrl": "https://www.imdb.com/user/ur2391750",
      "reviewLink": "https://www.imdb.com/review/rw0487302",
      "warningSpoilers": false,
      "date": "24 October 2003",
      "rate": "",
      "helpful": "174 out of 264 found this helpful.",
      "title": "Extremely offensive, and beneath it lies huge laughs...",
      "content": "Matt and Trey need to be commended for this series. It takes shots at EVERYTHING, and it does it in really questionable taste. But that's why I love it. Because, beneath the crude language and vulgar humor, South Park contains one of most biting satires in existence. This show is hilarious, constantly taking current events, such as Stem Cell Research, or fads, like the infamous Poke'mon craze, and spinning their own view on them. Thank you, Matt Stone and Trey Parker. Thank you.BOTTOM LINE: One show I try to never miss on Wednesdays. This series gives me something to look for."
    },
    {
      "username": "Bored_Dragon",
      "userUrl": "https://www.imdb.com/user/ur56005872",
      "reviewLink": "https://www.imdb.com/review/rw3833270",
      "warningSpoilers": false,
      "date": "16 October 2017",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "The best offensive show ever made",
      "content": "For some reason I stopped following this show long time ago, even before tenth season I think. Recently, again for some inexplicable reason, it came to my mind and I decided to start it all over, from season one, but this time I'm gonna finish it, or better to say catch it, because I hope it will never end. This morning I finished first season. There's nothing better than healthy laughter with morning coffee. After 20 years this season is still fresh and hilarious. One of the strongest tens I ever gave.10/10\"There is actually a lot of intelligent social commentary here - it's just masked under anything they could possibly offend someone with.\" - chthon2"
    },
    {
      "username": "briancham1994",
      "userUrl": "https://www.imdb.com/user/ur5788055",
      "reviewLink": "https://www.imdb.com/review/rw6012905",
      "warningSpoilers": false,
      "date": "20 August 2020",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Outrageous satire",
      "content": "This cartoon series has a very outrageous style of humour that can put some people off, especially the very offensive character Cartman. Yet it is often done in the service of satire that mostly hits the mark. The plots are also very outrageous though I think they ran out of original ideas as the years went on and just started to parody themselves and popular culture like Family Guy."
    },
    {
      "username": "13Funbags",
      "userUrl": "https://www.imdb.com/user/ur68345682",
      "reviewLink": "https://www.imdb.com/review/rw4726974",
      "warningSpoilers": false,
      "date": "17 March 2019",
      "rate": "8",
      "helpful": "36 out of 54 found this helpful.",
      "title": "The season long stories ruined it.",
      "content": "The title of my review says it all. This show had great stories for over a decade and then they decided to get all silly and try to have a story arc every year. I have trouble watching an entire new episode now."
    },
    {
      "username": "martinsmarkss",
      "userUrl": "https://www.imdb.com/user/ur80853198",
      "reviewLink": "https://www.imdb.com/review/rw7464412",
      "warningSpoilers": false,
      "date": "20 October 2021",
      "rate": "10",
      "helpful": "9 out of 10 found this helpful.",
      "title": "S01-S17 was great after that pretty terrible ! S18-S19 still watchable",
      "content": "10* for S01-S18, 6* for S18-19, 4* for 20-24 & 1* for 25th !I absolutely love older South Park for its amazing humor ! Nowadays it' s just a stupid jokes about weed that were actually funny, but only the first 2 times, this show now after Season 17 is just not funny and actually kind a painful to watch. Such a sad downfall for once really great, edgy, dearing series !S25TH 1* STAR Now it has lost it's former magic and charm, it's all about weed/tegridy, PC, Woke blah blah blah.... It feels like Matt and Trey just don' t care anymore it's just for paycheck or something !"
    },
    {
      "username": "jessicagarnergirl",
      "userUrl": "https://www.imdb.com/user/ur65763652",
      "reviewLink": "https://www.imdb.com/review/rw3441701",
      "warningSpoilers": true,
      "date": "29 March 2016",
      "rate": "10",
      "helpful": "64 out of 72 found this helpful.",
      "title": "Hilarious!",
      "content": "This show always makes me laugh. I've been watching for almost my entire life....it was basically my childhood! This show has always been my favorite adult cartoon, and maybe even one of my all time favorite cartoons! All of the characters are likable in some way. This show was also a miracle for adult cartoons' reputation, along with Rick and Morty. While I feel like Family Guy isn't doing so well in its later seasons, along with the Simpsons, and American Dad has quite a couple of duds, I feel like South Park really stands out. South Park is also a very creative show. It has an art style that I've never seen before in a show. Also, it has such controversial jokes and plots that many adult shows wouldn't DARE to step into. If you enjoy controversial humor and hilarious shows, I'd highly recommend South Park. :)"
    },
    {
      "username": "bevo-13678",
      "userUrl": "https://www.imdb.com/user/ur76062573",
      "reviewLink": "https://www.imdb.com/review/rw6370832",
      "warningSpoilers": false,
      "date": "16 December 2020",
      "rate": "10",
      "helpful": "12 out of 16 found this helpful.",
      "title": "Has it all",
      "content": "Sex violence drugs racism all the funny things that people like"
    },
    {
      "username": "MonkyMangler",
      "userUrl": "https://www.imdb.com/user/ur87473999",
      "reviewLink": "https://www.imdb.com/review/rw4516212",
      "warningSpoilers": false,
      "date": "16 December 2018",
      "rate": "9",
      "helpful": "57 out of 74 found this helpful.",
      "title": "The Death of South Park?",
      "content": "Now listen, i'm giving this show a 9 because the previous seasons before season 19 were excellent. They really influenced many other hilarious shows, and part of the fun of my childhood was tuning in to South Park when my parents were gone, only to be caught watching it. But the thing that keeps me from giving this show a perfect 10 is because i think the show has changed for the worst.So like i said first 18 seasons of South Park we're excellent, even the bad episodes in there still had great memorable moments. I tuned in to Season 19 and i noticed they wanted to do a story season were everything is connected. But that season provided little laughs and the finale was disappointing. I had high hopes for Season 20 because i thought Trey and Matt (the show's creators) had listened to the feedback on Season 19, but Season 20 was even worse then the last one. Many characters went through unnecessary changes, they put so much political topics into the show to the point where it felt like overkill, they managed to make Gerald (Kyle's dad) the most unlikable character in the show, many things that the show sets up are quickly forgotten, and the ending was bad (not disappointing like season 19, but just bad). Season 21 was an improvement from Season 20 but the show was still missing something. And i think i know what killed South Park.It's no secret that South Park has many political and social commentary tones, but that was never the main point of the show, that was just a good addition to it. But it's like Matt and Trey forgot that, and they made the social commentary the MAIN point of the show.The sad thing about it is Trey and Matt really want to go back to the roots of South Park, but they forgot how to. They got so carried away with Politics that they forgot that the heart of the show was 4 foul mouthed kids in a small mountain town that find themselves in the dumbest of situations. They completely ditched that part of the show and i eagerly want it back."
    },
    {
      "username": "chthon2",
      "userUrl": "https://www.imdb.com/user/ur0973067",
      "reviewLink": "https://www.imdb.com/review/rw0487285",
      "warningSpoilers": false,
      "date": "20 May 2003",
      "rate": "",
      "helpful": "162 out of 262 found this helpful.",
      "title": "I Laughed Till' I Cried",
      "content": "This is the show about the four foul mouthed little kids in Colorado. Well, three now, with different kids rotating in and out to fill the spot that Kenny left.Matt Stone and Trey Parker are comedic geniuses. I think that people who simply brush this off as uninspired pandering to foul mouthed kids like the ones in this show aren't looking deep enough. There is actually a lot of intelligent social commentary here - it's just masked under anything they could possibly offend someone with."
    },
    {
      "username": "JayPatton88",
      "userUrl": "https://www.imdb.com/user/ur67826053",
      "reviewLink": "https://www.imdb.com/review/rw5257040",
      "warningSpoilers": false,
      "date": "14 November 2019",
      "rate": "10",
      "helpful": "9 out of 11 found this helpful.",
      "title": "Hilarious",
      "content": "From season one episode one to present, no holds barred, everyone gets a shot taken at them whoever they are wherever they are in this comedy series"
    },
    {
      "username": "movieman_kev",
      "userUrl": "https://www.imdb.com/user/ur1162550",
      "reviewLink": "https://www.imdb.com/review/rw1203729",
      "warningSpoilers": false,
      "date": "29 October 2005",
      "rate": "10",
      "helpful": "11 out of 15 found this helpful.",
      "title": "Better than the Simpsons overall after taking into account how bad that once great show has gotten",
      "content": "Stan. Kyle, Cartman, Kenny, are the funniest thing to ever come out of Comedy Central thus far, and I have a feeling that will remain true in the future as well. \"South Park\" is hilarious, thought-provoking sure, but mostly hilarious in it's profanity and outrages situations. From time to time it seems to ruffle the feathers of the ultra-thin skinned PC crowd due to the Libetarian philosophy that pervades in most of the episodes, but they're huge p%&sies anyway. Sure this had a few lame episodes, but never in a row of four and never enough to make a whole season not worth watching (yet the 8th season WAS trying at times). But overall it's a great show, and if Matt Stone & Trey Parker are able to keep the pace up for another year of great episodes then it'll have a better run than the Simpsons, in my mind, that had stopped being good at around Season 9 or 10 (I don't really see the first 2 seasons of that show being that great either, so that's 7 seasons of Simpson's genius hilarity against about 8 of South Park that were great) My Grade: A+"
    },
    {
      "username": "CheeseburgerRandy",
      "userUrl": "https://www.imdb.com/user/ur61621482",
      "reviewLink": "https://www.imdb.com/review/rw6679466",
      "warningSpoilers": false,
      "date": "10 March 2021",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Easily one of the best written satires in history",
      "content": "The writing, the critiques of current events, its all great (for the most part). And the fact that they do it ALL in a week, amazing. The past few years of serialized seasons has been up and down, sure, but overall the show is fantastic.Quest for Ratings is a sneaky good jab at the tv process and crazy expectations for hit shows and to \"always be original \""
    }
  ],
  "errorMessage": ""
}