{
  "imDbId": "tt0092324",
  "title": "Blackadder the Third",
  "fullTitle": "Blackadder the Third (TV Series 1987–1987)",
  "type": "TVSeries",
  "year": "1987",
  "items": [
    {
      "username": "bob the moo",
      "userUrl": "https://www.imdb.com/user/ur1002035",
      "reviewLink": "https://www.imdb.com/review/rw0239680",
      "warningSpoilers": false,
      "date": "29 March 2002",
      "rate": "",
      "helpful": "29 out of 29 found this helpful.",
      "title": "Intelligent sarcastic humour  the best of British!",
      "content": "In England 1790-1815 we follow the continued annals of the Blackadder family. Edmund Blackadder is now butler to Prince George  a man who is as `thick as a whale omelette'. Over 6 episodes his lot goes from the dizzying heights of ruin to disaster to opportunity with little or no help from his dogsbody the `mouse brained' Baldrick.The third in the Blackadder series is not the best (although it's a very close). The scripts are very sharp and typically British. Every word is hilarious and Blackadder is given plenty of juicy lines to throw at his below-average-intelligence master. The plots are ludicrous but inventive  Baldrick accidentally elevated to the house of lords, Blackadder saving the Scarlet Pimpernel, the destruction of the world's first dictionary etc, but they're all carried off with style and great humour.Rowan Atkinson is hilarious  Blackadder is one of his finest hours and he fits the character perfectly. Tony Robinson is cursed forever to be remembered for Baldrick (no matter how many Time Teams he does) and he is brilliant in a thankless role. Hugh Laurie is superb as the stupid Prince and brings inbred stupidity to life! But each episode is also underpinned by a wealth of talent including Helen Atkinson Wood, Robbie Coltrane, Kenneth Moore, Chris Barrie, Ben Elton, Stephen Fry etc. The casting is great.Overall Blackadder is one of the finest British comedy series for decades  it deserves to be up there with Monty Python and the like. Anyone who loves to laugh at intelligent sarcastic humour will love this. One of the best comedy series I've ever seen."
    },
    {
      "username": "Bucs1960",
      "userUrl": "https://www.imdb.com/user/ur1388629",
      "reviewLink": "https://www.imdb.com/review/rw0239695",
      "warningSpoilers": false,
      "date": "1 June 2004",
      "rate": "",
      "helpful": "37 out of 37 found this helpful.",
      "title": "Absolutely Brilliant!!!!!!!!!!!",
      "content": "Someone said that they thought the British humour of \"Blackadder\" might not be appreciated in the United States......WRONG!!!!! One would have to have the brain cell(s) of the Prince Regent not to enjoy this series. It is brilliant......sarcastic, cutting, witty, beautifully written, beautifully acted and generally outstanding. Rowan Atkinson is not the Mr. Bean we are used to......as Edmund Blackadder, he hits his comedy stride as the conniving butler to the Prince Regent. We miss the Percy character in the third series but Hugh Laurie, as Prince George more than makes up for his absence. Baldrick is still with us and still has \"cunning plans\" but his IQ has taken a definite drop in score.If you want to laugh until you weep, then catch BA3 on BBCAmerica or better yet, go out and buy the tapes and the book \"Blackadder, the Whole Damn Dynasty\". It will keep you amused for years to come as this type of humour does not date. Rowan Atkinson, we salute you!!!!"
    },
    {
      "username": "scifi_luv",
      "userUrl": "https://www.imdb.com/user/ur3801984",
      "reviewLink": "https://www.imdb.com/review/rw1497260",
      "warningSpoilers": false,
      "date": "14 October 2006",
      "rate": "10",
      "helpful": "31 out of 31 found this helpful.",
      "title": "The opposite of Baldrick's trousers!",
      "content": "Holy crap this is so hysterical! Why aren't American comedies written like this? For anybody who thinks comedy has to be dumb-- there is more wit and intelligence in the six episodes of this series than in a shelf of novels! Hugh Laurie is a complete hoot. I couldn't believe it was the same guy as House! There are so many great lines and gags in this series you could watch each show dozens of times and still pick up on new things each time. Rowan Atkinson is hilarious as the verbose and put upon butler Edmund. This is my favorite of all the Blackadder series. And Tony Robinson is wonderful as ever as the somewhat obtuse heart of the series, \"the oppressed mass\" Baldrick. Some of my favorite lines: \"When someone messes with a Wellington he really puts his foot in it\" and Baldrick explaining how he got his name and cousin Macadder \"the top kipper salesman\" and homicidal swordsman from Scotland."
    },
    {
      "username": "Sylviastel",
      "userUrl": "https://www.imdb.com/user/ur0033913",
      "reviewLink": "https://www.imdb.com/review/rw1509442",
      "warningSpoilers": false,
      "date": "29 October 2006",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Too Good for Television!",
      "content": "We could still use Black Adder even today. Imagine Rowan Atkinson resuming the role of assistant to the prime minister played by the wonderful Hugh Laurie. Hugh is sensational as the dimwit Prince George and Edmund as his brilliant assistant. I love the episode which Kenneth Connor guest stars as a British thespian. Every time, Edmund says Macbeth. The two thespians do a silly little act to ward off evil spirits. It's the funniest things that you will see. Of course, none of this brilliance and comedic genius could be without Ben Elton and Richard Curtis who are also behind the films like Love Actually, The Thin Blue Line, Four Weddings and A Funeral. Black Adder is funny and almost too good for television. Humor can be smart, sexy, and funny all at one. I was hoping last night on Saturday Night Live that Hugh Laurie would pay homage to his background in British humor. If the gang at SNL did some research, they would know what a treasure it was to have Hugh Laurie grace their stage."
    },
    {
      "username": "general-melchett",
      "userUrl": "https://www.imdb.com/user/ur11358844",
      "reviewLink": "https://www.imdb.com/review/rw1527371",
      "warningSpoilers": false,
      "date": "22 November 2006",
      "rate": "9",
      "helpful": "7 out of 7 found this helpful.",
      "title": "A forgotten yet great series!",
      "content": "Blackadder 3 is probably the Blackadder series that people have least heard of - it has basically the same principles as the second and fourth ones and has nothing revolutionary in it. But it is still great - a fiery Duke of Wellington and a fat foolish Dr Johnson (writer of the first dictionary in England) make this series one to be reckoned with. There are still more hilarious one-liners to be delivered in this series, and it brings out the humour in a lesser-known era - in historically accurate and enjoyable episodes. Blackadder's third outing is not the most famous and well-known of the lot, but Rowan Atkinson's role as a butler to a stupid prince is a funny and effectively done one, and Hugh Laurie is at his best in this series. Very good! 9/10"
    },
    {
      "username": "VictorianCushionCat",
      "userUrl": "https://www.imdb.com/user/ur1416597",
      "reviewLink": "https://www.imdb.com/review/rw1122424",
      "warningSpoilers": false,
      "date": "9 July 2005",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Absolute Class",
      "content": "The 3rd and in my view the best of the Blackadder series.The only downside is that there is no Lord Percy who was the funniest character from the previous series but Hugh Laurie's Prince Regent is suitably madcap laugh a line.As a package it's quality through and through with convincing regency sets, superb cutting sarcasm and little bits of the wacky, the 'macbeth' actors standing out and Prince Georges 'lucky us' chicken impression, and the missing words from Dr Johnson's dictionary.Few comedies have been quite as both clever as they are funny, okay the odd lame observation or line gets in but mostly it's a scream."
    },
    {
      "username": "worlok",
      "userUrl": "https://www.imdb.com/user/ur1055901",
      "reviewLink": "https://www.imdb.com/review/rw1022019",
      "warningSpoilers": false,
      "date": "16 February 2005",
      "rate": "",
      "helpful": "11 out of 11 found this helpful.",
      "title": "from an American fan",
      "content": "I own the DVD box set of all of the Blackadder series and this one and \"Goes Forth\" are my favorites, but I love them all. This series skips through history with tongue firmly planted in cheek and is just superb. I call it \"smart yet silly\" comedy. The British are, or were, pros at this. Seeing some more recent \"Britcoms\", as some of us Yanks call them, I lament that they are taking too much from our lame American sitcoms. The brilliance of the recent \"Coupling\" gives me hope for the future.I really enjoy Rowan Atkinson and the cast of Blackadder. They are all fabulous, but Steven Fry just cracks me up as the Field Marshall in the Fourth Series.To get back to the Third series I really enjoy the guest appearances of Tim McInnerny as Lord Topper/Le Comte de Frou Frou, Chris Barrie (of Red Dwarf and Brittas Empire fame) as the French Revolutionary Guard, and who can forget the role of Dr. Johnson played by the illustrious Robbie Coltrane (who later played Rubeus Hagrid in the Harry Potter series of movies).If you like \"smart\" comedy then check out Blackadder!!"
    },
    {
      "username": "arvie88",
      "userUrl": "https://www.imdb.com/user/ur5777023",
      "reviewLink": "https://www.imdb.com/review/rw1329519",
      "warningSpoilers": false,
      "date": "31 March 2006",
      "rate": "9",
      "helpful": "7 out of 7 found this helpful.",
      "title": "Edmund Blackadder, A Butler's Tale",
      "content": "I think 'Blackadder the Third' is the best one of the series.Actuelly all the episodes are funny, personally i really like the episode with the 'French invasion', but the one with the superstitious actors, in 'MACBETH' is also really funny, the way Rowan keeps playing on with them is really (English) Humor at the highest level.Actors: 'Never say that again, always call it the Scottish Play; Blackadder: Oh, So you want me to say the Scottish Play? Actors: YES Blackadder: Rather than MACBETH...!I am a big fan of Rowan and i have the majority of his work, but i think he did the series of Blackadder especially good.I Hope Rowan is going to continue his great style, but i think we can count on him, because he is already working on a Bean 2 Movie, that will be out this year, i can't wait...I Give this 3rd Blackadder a 9 out of 10 Rating."
    },
    {
      "username": "book addict",
      "userUrl": "https://www.imdb.com/user/ur1273434",
      "reviewLink": "https://www.imdb.com/review/rw0239683",
      "warningSpoilers": false,
      "date": "28 August 2002",
      "rate": "",
      "helpful": "10 out of 11 found this helpful.",
      "title": "Macbeth!",
      "content": "I love this series. No, scratch that, I ADORE this series! Rowan Atkinson is fantastic as Blackadder (Macbeth!), Tony Robinson is perfect as Baldrick (I'd buy a little turnip of my own), and Hugh Laurie is wonderful as the Prince Regent (Why is it, that however many socks I buy, I never seem to have enough)! It was a shame that Tim McInnery and Stephen Fry could only be in it for one episode - but hey, they made the most of that one episode! Dr. Johnson is a brilliant character (EVERY word), like Pitt the Younger (What kind of jelly?) and those actors! Hot potato, orchestra stalls, Puck will make amends!"
    },
    {
      "username": "snoozejonc",
      "userUrl": "https://www.imdb.com/user/ur120966602",
      "reviewLink": "https://www.imdb.com/review/rw6568918",
      "warningSpoilers": false,
      "date": "6 February 2021",
      "rate": "9",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Excellent third series with great dialogue and performances",
      "content": "The life and times of Edmund Blackadder, butler to the Prince Regent.This is a very strong third series of Blackadder, displaying more of the great Curtis and Elton writing partnership and fantastic performances. For me it is on par with Blackadder II, albeit containing a few recycled concepts.We see Blackadder in the services of a Prince who is characterised as a lazy, moronic yob. He frequently has to solve the Prince's problems, which indirectly impact him. This presents a number of hilarious situations that result in great comedy.The continued Blackadder theme of Edmond's place within power structures is the driving factor. His resentment for having intelligence and being in the servitude to such ignorance is constantly simmering. In the final episode we see the tables completely turn and the darkness come racing to the surface.Other themes tackled are poverty, class structures, revolution, anarchism, literature, politics, monarchy and war.All episodes for me are strong, with my favourites being Dish and Dishonesty, Ink and Incapability, and Duel and Duality.Rowan Atkinson, Tony Robinson and Hugh Laurie are brilliant in all episodes and there are several excellent cameos, the most memorable being Stephen Fry as Wellington, Robbie Coltrane as Dr Johnson and Kenneth Connor/Hugh Paddick as a pair of theatre actors."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2249742",
      "warningSpoilers": false,
      "date": "14 May 2010",
      "rate": "10",
      "helpful": "3 out of 4 found this helpful.",
      "title": "Not quite as good as the second and fourth series, but better than the first",
      "content": "Don't get me wrong I am one of those who loved the first series, but the three that proceeded it were better I feel as the humour is more sophisticated and the actors look more comfortable in their roles plus the characters are more likable than they were in the first series. This third series isn't quite as good as the second and fourth, which are as perfect as comedy can get, but it is still hugely enjoyable. Thanks to the superb period detail, goodness even Prince George's wig is immaculate. The opening credits once again are a delight, and the crude, cynical yet sophisticated and hilarious writing is still abundant. And once again the stories are well thought out. And the performances are superb. Rowan Atkisnon is once again superb as the intelligent yet cynical and conniving butler Edmund Black Adder, whose insults get better and better. As much as I love Black Adder though, I'll always have a soft spot for Baldrick, he is stupid and pathetic but he is utterly hilarious, Tony Robinson was perfect for that. Hugh Laurie is also wonderful as the equally stupid and somewhat naive Prince Regent(though he is much more naive in the fourth series), and the supporting cast of Stephen Fry, Ben Elton and Robbie Coltrane are just as brilliant. Overall, once again, a must see. 10/10 Bethany Cox"
    },
    {
      "username": "jboothmillard",
      "userUrl": "https://www.imdb.com/user/ur4248714",
      "reviewLink": "https://www.imdb.com/review/rw1082008",
      "warningSpoilers": true,
      "date": "17 May 2005",
      "rate": "10",
      "helpful": "6 out of 10 found this helpful.",
      "title": "Blackadder the Third",
      "content": "After the success of the second instalment, Richard Curtis and Ben Elton decided that Blackadder should have a third appearance. This time instead of Tudor times or Elizabethan times, Edmund Blackadder (BAFTA nominated Rowan Atkinson) is living in the time of the French Revolution. Accompanied by the now stupid but lovable Baldrick (Tony Robinson) Blackadder is the \"faithful\" butler to George, the Prince Regent of Wales (Hugh Laurie). Throughout this third series to the wonderfully written sitcom Blackadder tries everything he can to get rich and powerful. He tries electing a lord for a rotten borough, tries to sell a book, tries to win a bet about The Scarlet Pimpernel, tries to be a highway man and finally poses as the Prince. This is a very good instalment to the popular comedy. Includes appearances from Robbie Coltrane, Tim McInnerny, Miranda Richardson and Stephen Fry. It won the BAFTA for Best Comedy Series, and it was nominated for Best Design and Best Make Up. Rowan Atkinson was number 18 on The 50 Greatest British Actors, he was number 24 on The Comedians' Comedian, and he was number 8 on Britain's Favourite Comedian, Edmund Blackadder was number 3 on The 100 Greatest TV Characters, and he was number 3 on The World's Greatest Comedy Characters, and Blackadder (all four series) was number 2 on Britain's Best Sitcom. Outstanding!"
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw3374063",
      "warningSpoilers": false,
      "date": "18 December 2015",
      "rate": "10",
      "helpful": "3 out of 4 found this helpful.",
      "title": "Hilariously funny - the best of the Black Adder series, and that says a lot",
      "content": "Hilariously funny.Black Adder III finds our hero, played by Rowan Atkinson of course, the butler / assistant to Prince George during the reign of Mad King George. This season follows the same successful formula as in Black Adder II: intelligent plot and dialogue, clever use of actual historic events and characters, incredibly funny skits and situations. Baldrick (played by Tony Robinson) is still there. Hugh Laurie, who had a minor part in Black Adder II, is Prince George. Helen Atkinson Wood appears as Mrs Miggins, as does Stephen Fry as the Duke of Wellington and Robbie Coltrane as Dr Samuel Johnson.For me, this is the best of the four Black Adder series. All four were brilliant, but S3 is the pinnacle. Sharp, clever writing and dialogue with some wonderfully over-the-top scenes. Superb."
    },
    {
      "username": "planktonrules",
      "userUrl": "https://www.imdb.com/user/ur2467618",
      "reviewLink": "https://www.imdb.com/review/rw1908818",
      "warningSpoilers": false,
      "date": "11 July 2008",
      "rate": "9",
      "helpful": "3 out of 5 found this helpful.",
      "title": "Perhaps not as funny as BLACKADDER 1 and 2, but it sure ended brilliantly!",
      "content": "In this installment of the series, Edmund Blackadder is stuck in the Regency period in Britain (during the later portion of George III's rule). This time, Blackadder's prospects are much poorer--as instead of royalty, he's a servant to the very, very thick George IV (the price regent). Unlike the historical accounts of George IV, this one is about as bright as a tomato and as a result, Blackadder's able to take advantage of him and scheme to his heart's content. The only major difference in style between this one and earlier ones is that the series ends on a very, very, very different note--you just have to see it to believe it. Other than that, all the usual story elements are there and the show is hilarious. The only reservation I have (as always) is that this show is not appropriate for the kids due to its crude language and adult situations."
    },
    {
      "username": "Darkside-Reviewer",
      "userUrl": "https://www.imdb.com/user/ur100147162",
      "reviewLink": "https://www.imdb.com/review/rw4723821",
      "warningSpoilers": false,
      "date": "15 March 2019",
      "rate": "8",
      "helpful": "2 out of 2 found this helpful.",
      "title": "The Golden age of comedy",
      "content": "BlackAdder is simply comedy at its best it stood out even in the golden age of comedy when so many shows were at there peak BlackAdder was a different show every series and gave you something new and funny to laugh at every episode the cast are perfect and work well together if you watch this and don't laugh I'll send Boldrick round to clip you round the ear good sir."
    },
    {
      "username": "Sleepin_Dragon",
      "userUrl": "https://www.imdb.com/user/ur15311310",
      "reviewLink": "https://www.imdb.com/review/rw3543691",
      "warningSpoilers": false,
      "date": "14 September 2016",
      "rate": "10",
      "helpful": "1 out of 1 found this helpful.",
      "title": "How it should be done!!!!",
      "content": "From a comedy point of view, I don't think there are many better shows then Blackadder, in any of his guises. In the third run, he's at his most sarcastic, he's more cutting and nasty then ever before. Forced to buttle for the oafish and idiotic Prince Regent, he often takes out his frustrations out on the lowly Baldrick.I love the fact that we get to see Mrs Miggins as was often mentioned in the second series, and indeed see the pie shop.Every single episode is pure brilliance, if I had to chose a favourite, it would be Nob and Nobility, the writing was simply genius, totally hilarious and mad cap. Duel and Duality is also another favourite, largely due to the performance of Stephen Fry as Wellington, and his beating the Prince.I did miss Tim McInnerny and Miranda Richardson as regulars, but their appearances were excellent.Pure brilliance, love it 10/10"
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw3402421",
      "warningSpoilers": true,
      "date": "25 January 2016",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Regency Blackadder",
      "content": "After series set in the middle ages and Elizabethan era it is time to see how the Edmund Blackadder of the Regency period is getting on. The family is clearly on a downward track as the current Blackadder is butler to George, the Prince Regent. Inevitably Baldrick is also back; once again he is a dim-witted dogsbody. Over the course of the series Blackadder helps his master with a number of situations. These include the time they accidentally burn the only copy of Samuel Johnson's dictionary, the prince getting lessons on how to deliver a speech from a pair of snobbish actors, rescuing aristocrats from revolutionary France and fighting a duel against the Iron Duke.This series was a lot of fun; clearly following the pattern of series two with a quick-witted and sarcastic Blackadder dealing with the idiots around him. Rowan Atkinson and Tony Robinson have clearly got their characters settled and are great as Blackadder and Baldrick. Percy has left the series but is able replaced by Prince George who is played by Hugh Laurie; a welcome addition to the cast. There are some fine guest appearances from the likes of Robbie Coltrane, Miranda Richardson and Stephen Fry amongst others. The humour is similar to that of the previous series with silliness nicely mixed with some great wordplay. Overall I'd certainly recommend this to fans of the previous versions; I enjoyed it when it was first aired and enjoyed it just as much almost thirty years later."
    },
    {
      "username": "deloudelouvain",
      "userUrl": "https://www.imdb.com/user/ur58525162",
      "reviewLink": "https://www.imdb.com/review/rw6933346",
      "warningSpoilers": false,
      "date": "17 May 2021",
      "rate": "10",
      "helpful": "1 out of 1 found this helpful.",
      "title": "British humor at its best.",
      "content": "Another brilliant season of Black Adder. This time its set in the Regency Era where Rowan Atkinson is playing the character of Edmund Blackadder, as the butler to the Prince Regent played by Hugh Laurie. Hugh Laurie in something totally different than Doctor House like most people know him from. Totally different but great, which shows what a great sense of humor he has. Tony Robinson is still Baldrick, the dumb servant that is smarter than we want to admit. There are much more actors in this season, and they all bring something to the show. If you don't like British humor, or if you just don't get it, Black Adder isn't for you, but if you dig this kind of brilliant nonsense then you can't go wrong as Black Adder remains one of the best Brittish comedies ever."
    },
    {
      "username": "Mmyers2003",
      "userUrl": "https://www.imdb.com/user/ur2008457",
      "reviewLink": "https://www.imdb.com/review/rw0239684",
      "warningSpoilers": true,
      "date": "28 October 2002",
      "rate": "",
      "helpful": "2 out of 2 found this helpful.",
      "title": "\"I love you Dr Johnson and I want to have your babies\"",
      "content": "Definately shows that blackadder has still not died out in any way at all. There are no flaws in the third series and it still remains to make me laugh. There are quotes going through my head right now. This is one memorable bitSPOILERS FOLLOWDr Johnson: This book sir, contains every word of our beloved languageBlackadder: Every single one sirDr Johnson: Every single oneBlackadder: Oh well in that case your majesty, i hope you don't mind if i offer the Doctor my most enthusiastic \"Contrafibularities\".Dr Johnson: What?Blackadder: Contrafibularities sir? It is a common word down our way.Dr Johnson: Damn (begins to add word to dictionary)Blackadder: Oh I'm sorry sir. I'm anaspeptic, Transmotic even compunctuous to have caused you such pericobobulations.Dr Johnson: What? What?Prince: What are you talking about Blackadder. This all beginning to sound like dago talk to me.Blackadder: I was merely congratulating the doctor on not having missed out a single word. Shall I fetch the tea your highness?Prince: Yes, and get that damn fire in here would you.Blackadder: Certainly sir. I shall return \"Interfrastically\". (Blackadder leaves)"
    },
    {
      "username": "Mightyzebra",
      "userUrl": "https://www.imdb.com/user/ur14236266",
      "reviewLink": "https://www.imdb.com/review/rw1875829",
      "warningSpoilers": false,
      "date": "18 May 2008",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "The third part of this fabulous series - and my personal favourite!",
      "content": "Unlike many viewers, I enjoyed this series much more than the other parts of the series (although just a bit more than Blackadder Goes Forth). It has absolutely brilliant, memorable jokes, exciting plots, brilliant characters and in this you really come to know all of the characters. I prefer this to the first part of Blackadder because that part is too silly, I prefer this part to the second part because that has the annoying queen and nurse in it and I am afraid, \"Blackadder Goes Forth\", that I just prefer this series to you by a little fraction of a rating, because I prefer Baldrick in this one. I also very much like Blackadder, I prefer him as a butler rather than a prince or servant. Baldrick is as hilarious as ever - but better! Hugh Laurie as the prince is amazingly entertaining, I prefer him as a companion to Percy. There, I have stated why I like this, now for the incredible cast:The cynical, intelligent Blackadder: Rowan Atkinson. The brainless, gorgeous Baldrick: Tony Robinson. The (also) brainless, lazy George, Prince of Wales: Hugh Laurie. The mad Mrs. Higgins: Helen Atkinson-Wood.I recommend this to anyone who has enjoyed the previous Blackadder series but desires a slightly different cast, to people who just enjoy funny historical British TV programmes and for people who like comedy series with gripping plots that are NOT farce. Enjoy! :-)"
    },
    {
      "username": "Sonatine97",
      "userUrl": "https://www.imdb.com/user/ur0763923",
      "reviewLink": "https://www.imdb.com/review/rw0239682",
      "warningSpoilers": true,
      "date": "26 August 2002",
      "rate": "8",
      "helpful": "1 out of 1 found this helpful.",
      "title": "Majestic Comedy on a Regency Scale",
      "content": "Edmund Blackadder (Rowan \"Mr Bean\" Atkinson) is now butler to perhaps the most stupidist royal in English history, for this is now 1792, Regency England, King George is a looney in all but name, and his son, the Prince Regent (Hugh Lawrie) is the King-in-waiting and Blackadder is his servant.Not only does Edmund have to look after the welfare of the Prince but also has to tolerate his own servant, the mouse-brained dogs body, Baldrick (Tony Robinson), who hasn't got two brain cells to call his own. Blackadder is not only frustrated with the fact that he, by his own admission, is wasted amongst this pair of backward imbeciles and tries to trick, threaten, bribe or steal as much money as he can so that he can seek an escape from this lifetime of drudgery.We are treated to six wonderfully scripted episodes from Blackadder's diary and what a pleasure it is too (very mild spoilers):-SENSE & SENSIBILITY.The Prince Regent survives an assassination attempt by an anarchist. Disappointed by this recovery Blackadder suggests the Prince write a speech sympathetic to the poor of his land in order to win popular favour again.To help his cause, Blackadder hires two very amateur but egotistical actors to train the Prince in being stately, civil but also compassionate to his people. However, the Prince is also very irritated with his butler and insults him once to often before Blackadder decides enough is enough and walks out, leaving the dopey Baldrick in charge. Moments later Baldrick learns that the actors are planning to kill the Prince behind his back. Can the dumb servent save the day without Blackadder?INK & INCAPABILITYThe Prince wants to expand his mind and become one of the great intellectuals of the time. However, in order to do this miraculous achievement he decide to invite the great wordsmith, Dr Samuel Johnson around for tea in order for the Prince to review & patronise the Doctor's new book.However, the Prince hasn't quite grasped the fact that the book is in fact an English dictionary. All the Prince is really interested in is if there are any juicy murders in it.The arrival of the great intellectual is also a source of irritation to Blackadder, who has penned his own auto-biography crammed with \"sizzling gypsies\" and feels his own book is far more worthier than a tiresome dictionary. So the great Blackadder goes out of his way to mock not only the Doctor's book (which took him 10 years to compile) but also the Doctor himself. Irritated & impatient by these two buffoons, the Doctor stomps out in a huff, forgetting to take his dictionary with him.When Blackadder learns that Baldrick has burnt the dictionary and there is no copy he panics and decides to follow one of Baldrick's \"cunning plans\" and rewrites the entire book. The only trouble is that he has only the weekend to write it before the Doctor returns with some of his most admiring friends all swearing bloody murder if the book is not returned.DISH & DISHONESTYRemarkably the Prince is on the verge of bankruptcy from a hostile Prime Minister, Pitt The Younger. The only way to avoid this embarrassment is to make sure all the serving MPs vote in favour of retaining the Prince and ignoring the PM. To be sure of winning an overall majority Baldrick is made an MP but rather than voting for the Prince the dopey Baldrick votes the other way. Only the House of Lords can save the Prince from ignominy and Blackadder's luxury lifestyle off ripping off the Prince. So Blackadder decides to become a Lord himself and hopefully save the day.AMY & AMIABILITYThe Prince is almost broke thanks to a total misunderstanding in how to play a game of cards for money. As a consequence the only way out is for the Prince to marry a wealthy lady called Amy. Blackadder arranges a blind date but the thickish Prince isn't all that bothered about charming the young girl with sweet nothings, all he wants is to give her some his \"German Sausage\".Blackadder learns that Amy is a bit of a thicky herself and her father isn't quite so wealthy after all. The plan of marriage goes badly wrong and so Blackadder has no other choice but to turn to crime as a dashing Highway Man, in order to stave off the wolves(and squirrels) from the Prince's door.NOB & NOBILITYMuch to the irritation of Blackadder, there is a new hero in town. The great Scarlet Pimpernel, who is saving the heads of all the French aristocrats from the chop as the peasants have revolted against their king.Denouncing the Pimpernel Blackadder accepts a challenge from some of the Prince's friends. He has to sail to France, rescue an aristocrat and bring him home in order to win the bet.However, Blackadder has other ideas of rescuing a Frenchie, and it doesn't involve sailing to the \"hugely dangerous\" country of France.DUEL & DUALITYThe Prince really puts his foot in it by spending the night with the nieces of the greatest swordsman England has ever seen, the Duke of Wellington.The Prince thinks the Duke is still at war and will thus never know. But Blackadder reminds him that the war with the French ended six months ago and put it about town that he will duel to the death with anyone who takes advantage of his two nieces.In a panic the Prince offers Blackadder everything he owns if he will only fight the Duke instead of him. After some thought Blackadder agrees but to complete the masquerade they have to swap clothes and jobs in order for the deception to work.Six great episodes, all superbly written and performed. The only slight disappointment is the absence of both Stephen Fry & Tim Macinnery. It is true they appear in an episode each here, but unlike Series 2 & 4 where they were regulars, this series somehow isn't quite so complete and thus the comedic jousting between Blackadder, Baldrick and the Prince is rather restricting and repetitive.Apart from that minor grumble this third series is quality comedy, although I personally rank it third behind series 4 and series 2 respectively.****/*****"
    },
    {
      "username": "winstonfg",
      "userUrl": "https://www.imdb.com/user/ur10797344",
      "reviewLink": "https://www.imdb.com/review/rw2319024",
      "warningSpoilers": false,
      "date": "3 October 2010",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "I wish they'd done the whole thing 'below stairs'",
      "content": "Like many others, I rate this series ahead of 1, but slightly behind 2 and 4; however, the scenes in the kitchen are uniformly brilliant and pants-wettingly funny. How Tony Robinson manged to keep a straight face while ramming unspeakable things up the nether regions of some poor piece of poultry I will never know, but they make great viewing. Check out Blackadder's rant about Wales in 'Amy and Amiability' if you don't believe me.I suspect the reason I don't rate it quite as high as the 2nd and 4th series is that Prince \"thick as a whale omelette\" George was just too easy a mark, putting Blackadder basically in charge. In the other two, the comedy came from his being smarter than all his colleagues, but having no power to change events.Nevertheless, it's a darn good romp, and full of the usual piquant observations about the times. And there's no shame in running a close second to absolute classics."
    },
    {
      "username": "ericksonsam60",
      "userUrl": "https://www.imdb.com/user/ur26640395",
      "reviewLink": "https://www.imdb.com/review/rw2997190",
      "warningSpoilers": true,
      "date": "13 April 2014",
      "rate": "9",
      "helpful": "1 out of 1 found this helpful.",
      "title": "\"Don't Mention Macbeth\"",
      "content": "\"BlackAdder The Third\" isn't as highly regarded as other entries but it perhaps my personal favorite. It was this one that got me interested in the entire \"BlackAdder\" series to begin with. Not to mention that it is a fine showcase for two comedic talents, Rowan Atkinson and Hugh Laurie. It manages to be witty, cleverly written, wonderfully acted, and just first-class all around. Set during the Regency Period, Rowan Atkinson returns as Mr. E. Blackadder Esquire who is Butler to Prince Regent, the son of Mad King George. Many complain about not seeing Tim McInnerny's Percy but I think Hugh Laurie's delightfully dumb Prince of Wales more than makes up for it. We also get to see Tony Robinson's Baldrick again as his loyal and \"mousebrained\" sidekick who happens to be the dogsbody of the house.The writing team of Richard Curtis and Ben Elton continue their mastery of great sarcastic humor. The dialog remains razor sharp as it is full of one-liners every minute. The situations are also immensely funny too such as Baldrick getting elected as lord of a rotten borough, an important dictionary accidentally thrown in the fireplace, or when Blackadder rescues the Scarlet Pimpernel. I especially laughed hard when two thespian actors have wart off evil spirits every time they hear the word \"Macbeth\". The supporting actors that appear in the episodes are also a lot of fun such as Robbie Coltrane as Dr. Johnson and Stephen Fry as the Duke of Wellington (Fry played Melchett in BlackAdder II). Favorite episodes were \"Dish and Dishonesty,\" \"Sense and Senility,\" and \"Dual and Duality.\"With the strongest plots and the strongest laughs, \"Black Adder The Third\" is no doubt one of the most hysterical period pieces ever made as well as another shining example of how the \"BlackAdder\" series remains a masterpiece in British Comedy."
    },
    {
      "username": "TBJCSKCNRRQTreviews",
      "userUrl": "https://www.imdb.com/user/ur2093818",
      "reviewLink": "https://www.imdb.com/review/rw2115070",
      "warningSpoilers": false,
      "date": "22 August 2009",
      "rate": "7",
      "helpful": "1 out of 5 found this helpful.",
      "title": "Goofy and bitter",
      "content": "This time around, Blackadder is no longer royal(or even particularly close to being any such thing)... instead, rather a butler to the Prince Regent, portrayed by Hugh Laurie(who replaces Tim McInnerny, who presence is sorely missed, and that hole is never filled... his character had an innocent charm... while he was a bumbling and complete moron, we can't help but care for him, which isn't at all true of his replacement) as being intolerably daft(which he apparently was, according to the Trivia page), not to mention loud-mouthed and utterly non-threatening. Edmund can now do just about what he pleases, and does so. Why is he so frustrated and angry(honestly, it gets depressing at times)? Yes, his master is a buffoon, they always are. He doesn't seem to lack money, nor is he in any danger. In the second series, the Queen was mischievous and childish, and would cut off someone's head - or marry them - on a whim. Here there is simply never enough at stake for any of the conflict to be exciting and interesting. There is still commentary and even a little satire. Too often, it seems as if they thought that the history was funny enough on its own, so they merely restate it, not bothering to actually turn the facts into jokes or gags. And I can't tell you how many of them I figured out before they were done, literally more than a minute away. It's not usually a positive when you know the punchline before it is delivered. Baldrick doesn't change from last season... he's still rather pathetic and stupid, leading to \"silly\" humor. Frankly, the amount goes through the roof. Don't get me started on the gross-out stuff. The sarcastic, verbal wit can still be great, though much less of it is than before. I'd say about half of the episodes were rather amusing and downright funny, while the other three didn't really get me into them at all. I was disappointed in how predictable some of the plots and developments thereof were... I could see many of such coming a mile away. Some of the material tries way too hard to be funny and winds up coming across as incredibly forced. This continues with the tradition started by \"II\" of letting the plans work out occasionally. The theme is the worst of the bunch, the credits sequences the least creative. All in all, this is, by far, my least favorite of the four. I recommend it to fans of the franchise and of British comedy in general. 7/10"
    },
    {
      "username": "studioAT",
      "userUrl": "https://www.imdb.com/user/ur23359813",
      "reviewLink": "https://www.imdb.com/review/rw3843191",
      "warningSpoilers": false,
      "date": "28 October 2017",
      "rate": "2",
      "helpful": "1 out of 10 found this helpful.",
      "title": "I wanted to love it. Sadly I didn't.",
      "content": "New era, new version of Black-adder.Sadly this show didn't do a lot for me. I know, I know, it's a British institution and I feel I should love it because everyone else does, but sorry, I didn't.It's well written, I'll give you that, and well performed certainly, but comedy is subjective, and I can't remember laughing a lot at this brand of comedy."
    }
  ],
  "errorMessage": ""
}