{
  "imDbId": "tt2433738",
  "title": "Wentworth",
  "fullTitle": "Wentworth (TV Series 2013–2021)",
  "type": "TVSeries",
  "year": "2013",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8597909",
      "warningSpoilers": false,
      "date": "9 October 2022",
      "rate": "9",
      "helpful": "38 out of 39 found this helpful.",
      "title": "Such an underrated show!",
      "content": "I absolutely loved Wentworth. I don't think I've ever been more surprised by how much I've liked a show quite like this one. Every episode of every season is good. It's addicting. I binged the entire series as quickly as I could and I would dare to bet you would to if you haven't seen it yet. It takes a look at the lives of the women inmates and the staff at Wentworth prison. This show is intense, violent, gritty, intelligent, all of those. It's a pretty if cast and there's not a weak link among them. They all do a fantastic job. I can not recommend this show enough. Give it a chance and I promise you won't be disappointed."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw5946566",
      "warningSpoilers": false,
      "date": "27 July 2020",
      "rate": "9",
      "helpful": "60 out of 64 found this helpful.",
      "title": "So Good!",
      "content": "I cannot overstate just how good Wentworth really is! It will hook you from the first episode and keep you on the edge of your seat throughout the entire series. Like everyone else on here that has compare it to Orange is the New Black (which I liked) I have to agree that this is the far better show! It's a lot like Game of Thrones where no character is safe no matter who they are. Some of biggest characters on the show will die or leave but the quality stays the same season after season!"
    },
    {
      "username": "oscarjneklund",
      "userUrl": "https://www.imdb.com/user/ur154260428",
      "reviewLink": "https://www.imdb.com/review/rw8312028",
      "warningSpoilers": false,
      "date": "8 July 2022",
      "rate": "9",
      "helpful": "26 out of 26 found this helpful.",
      "title": "Fantastic!🔒",
      "content": "I was fifteen when I happened to come across an episode of season 2 on my tv, and man, I was rapt. Watched it all from season 1 and then waited, year after year for a new season, so damn good! Ferguson rules, a very remarkable villain! 🇭🇲"
    },
    {
      "username": "Dragonborn64",
      "userUrl": "https://www.imdb.com/user/ur86595662",
      "reviewLink": "https://www.imdb.com/review/rw6056301",
      "warningSpoilers": false,
      "date": "2 September 2020",
      "rate": "9",
      "helpful": "18 out of 18 found this helpful.",
      "title": "Love it!",
      "content": "Every season has been great and it just continues to get better. There are so many holes and unbelievable storylines and I couldn't care less. Sure it's more like a really strict high school than a prison but it's always entertaining. Characters come and go but there's always something new and juicy - highly recommended."
    },
    {
      "username": "katievfoxley",
      "userUrl": "https://www.imdb.com/user/ur100862845",
      "reviewLink": "https://www.imdb.com/review/rw8598488",
      "warningSpoilers": true,
      "date": "9 October 2022",
      "rate": "7",
      "helpful": "25 out of 25 found this helpful.",
      "title": "Brilliant",
      "content": "This show was absolutely brilliant. Did go down hill at the end but first 4 seasons were amazing. I do feel that they had a missed opportunity with Lou Kelly's character. The fear she brought was amazing and the \" I don't care attitude \" Kate Box was amazing. I do think a spin off series on lou Kelly's first prison sentence is definitely needed and on why boomer didn't trust her. One character I didn't get the point in was Judy Bryant, that was just a pointless story and it's a shame they made Ruby's character weak. You always knew when a top dog was going to die as they were tired and fed up. They killed reds character off to early as well. A lot could have been done with her!!!"
    },
    {
      "username": "Rajit_thebingewatcher",
      "userUrl": "https://www.imdb.com/user/ur47608563",
      "reviewLink": "https://www.imdb.com/review/rw7892154",
      "warningSpoilers": false,
      "date": "23 February 2022",
      "rate": "9",
      "helpful": "18 out of 18 found this helpful.",
      "title": "Prison, female lead , struggle makes a good recipe",
      "content": "Tv series set in prison are already a thing now. « Orange is the new black \" , \"viz a viz\" are quite a good series with Prison as a setup with female leads . So what makes wentworth different and a great viewing experience then?For me the story telling is different compared to other series because in this one there are many leads. The seasons choose those leads . The season chooses who is the antagonist and who is protagonist of that season. More than 7 season and it is still going strong . A great viewing experience."
    },
    {
      "username": "Br4ve-trave1or",
      "userUrl": "https://www.imdb.com/user/ur42927804",
      "reviewLink": "https://www.imdb.com/review/rw3362904",
      "warningSpoilers": false,
      "date": "28 November 2015",
      "rate": "7",
      "helpful": "25 out of 26 found this helpful.",
      "title": "I can't believe how incredible this gem is",
      "content": "This show is surgically executed. It builds and builds and when you least expect erupts like a violent volcano. I warn you it can be bloody and violent but that's the shock of it because you don't see it coming. Just when you think it's become stable BOOM. THIS is the best prison show hands down. The casting and acting is out of this world. Each of the seasons finales are staggering. I've watched all 3 seasons and each is a prize waiting to behold. This series is brilliant. The way the lead has grown and transgressed is so awesome. I love this show. Orange is the new black I can't even watch after I first saw this. It literally changed the game. You don't understand how much of a favor you'd be doing your self by watching this incredible show. Bravo"
    },
    {
      "username": "videorama-759-859391",
      "userUrl": "https://www.imdb.com/user/ur45707659",
      "reviewLink": "https://www.imdb.com/review/rw3241948",
      "warningSpoilers": false,
      "date": "20 May 2015",
      "rate": "9",
      "helpful": "31 out of 34 found this helpful.",
      "title": "Wentworth, worth all it's weight in watchability",
      "content": "Looking back now, Prisoner was a laugh riot. Dad and I were laughing when they repeated the original series, again, that seems so cheesy now, if of course unrealistic, judging by the larger than life plots, and some highly and insanely unlikely scenarios, that caused a bit of eye rolling. Oh, how times have changed. This new, better series is more modernized as now having security cameras with much better looking women and better actors, although the ones from the original must be praised too. Don't fault them, it's what they had to work with. We retain our chief characters from the original, though some, altered, here and there, especially Vera 'Vinegar Tits' Bennett, played wonderfully by a familiar Seachange face. Danielle McCormack holds her own, very strong as Bea, and a much hotter looking Frankie Doyle, is a very animated and absorbing character, wonderfully played by De Silva, up there by McCormack. Even the brief Jim Fletcher character is reprised by McCleod's Daughter's Aaron Jeffrey. But it's Pamela Rabe as the notorious Joan Ferguson, who's really scarring and creepy to the max. I was impressed and admired her take on the role, that's so creepily haunting, I prefer her to Maggie's Kirkpatrick's portrayal. It's great to see different actors do the same role, putting their own spin on it. Hey if they copied the other actors, it would be boring, and unwatchable, but when actors breath a lot of originality, life and traits into that role, you know it will be, and I'm not just saying that about Rabe's, but her performance was the one, who had the real effect on me, that sly smile, and those unreadable expressions in that steel gaze of hers, that only leaves you wanting more. This is one of those successful remakes, a much scarier and tougher Prisoner this time around, some women you don't want to mess with, the much younger ones, some real cuties. Hey, if you want laughs and escapism, just go back to the original, as this one, a much more serious and intense series, is far different from what went on 24 years earlier. Excellento."
    },
    {
      "username": "jquartemont-242-751784",
      "userUrl": "https://www.imdb.com/user/ur58712990",
      "reviewLink": "https://www.imdb.com/review/rw7918929",
      "warningSpoilers": false,
      "date": "5 March 2022",
      "rate": "9",
      "helpful": "19 out of 19 found this helpful.",
      "title": "Great series",
      "content": "Another great Aussie series. It seems to me, that it would be great being a guard at Wentworth. There is always things that are happening, and every day would be very interesting."
    },
    {
      "username": "jacob-olinger-89109",
      "userUrl": "https://www.imdb.com/user/ur84762975",
      "reviewLink": "https://www.imdb.com/review/rw5036420",
      "warningSpoilers": false,
      "date": "3 August 2019",
      "rate": "10",
      "helpful": "76 out of 81 found this helpful.",
      "title": "Blows Orange Is The New Black Out Of The Park!",
      "content": "I thought Orange was a great tv show. Very well done with good flow. But let's be honest. Wentworth brings you the truth nitty gritty of a women's prison. This is Orange on drugs and set on fire.This show is simply amazing! I wasn't so sure I was going to like this. But it's sucks you in and I binge this every single day. The waiting and chomping at the bits for the newest season to release.The acting, stories, characters, flow, scenes very much done with excellent execution! This show is a true prison show that just about our ranks all others.I've recommended this show more than I can remember. If you haven't watched then you need to. You will not be disappointed. (P.S: this is not for kids)"
    },
    {
      "username": "nancyldraper",
      "userUrl": "https://www.imdb.com/user/ur11523087",
      "reviewLink": "https://www.imdb.com/review/rw6473942",
      "warningSpoilers": false,
      "date": "14 January 2021",
      "rate": "8",
      "helpful": "16 out of 17 found this helpful.",
      "title": "A find",
      "content": "This is a series definitely binge worthy. Better than ORANGE IS THE NEW BLACK (in my humble opinion) and based on PRISONER, which ran on Network Ten (AU) from 1979 to 1986. I give this series an 8 (great) out of 10 and have become very attached to it's characters. {Drama and Intrigue in a Women's Prison}"
    },
    {
      "username": "tr91",
      "userUrl": "https://www.imdb.com/user/ur41569276",
      "reviewLink": "https://www.imdb.com/review/rw3514130",
      "warningSpoilers": true,
      "date": "29 July 2016",
      "rate": "10",
      "helpful": "22 out of 24 found this helpful.",
      "title": "Wentworth",
      "content": "Only started watching Wentworth Prison a few weeks ago and so far I have loved every minute of it as I have caught up to where its currently at (Series 4, episode 7). It's definitely one of my favourite TV shows right now and I'm glad it has already been renewed for a 5th series at least.The basic premise is the life of the inmates but after watching a few episodes you soon realise its much deeper than that. We see their lives inside and out as well as the prison guards who all add something a little different.The main characters all have strong development as the series goes on so it's important that you find some of the characters likable as you will certainly be learning a lot about them. The Freak is one of the greatest TV villains of all time & Bea is a character that we see evolve massively. The supporting characters are all great too.All of the story lines are captivating and most of the time I didn't want the episodes to end, I would usually watch 3 in one sitting. Each season seems to have one main story line but there is always something different going on elsewhere as well. Sometimes its shockingly violent but sometimes we just see the characters having a laugh. The tone of the show can change at any given moment.There is plenty of twists and turns as characters come and go and relationships are ever changing to the point where nobody knows who to trust.Overall I really liked the story lines and each character brought something unique to the show. Would recommend everyone to give this a chance. 10/10, top show."
    },
    {
      "username": "robfollower",
      "userUrl": "https://www.imdb.com/user/ur78277499",
      "reviewLink": "https://www.imdb.com/review/rw6529319",
      "warningSpoilers": false,
      "date": "26 January 2021",
      "rate": "10",
      "helpful": "15 out of 16 found this helpful.",
      "title": "Wentworth(2013-2021)",
      "content": "Fans of the iconic Prisoner series which pushed boundaries over three decades ago and still today boasts a loyal following worldwide, will remember Bea Smith as gutsy and fearless, ruling Wentworth Correctional Center with an iron fist. But who was Bea Smith before prison? How did a wife and mother from the suburbs become a top dog without rival? Wentworth is a dynamic, often confronting, drama series that begins with Bea's early days in prison. Set in the present day, it is a modern adaptation of Prisoner contemporizing legendary characters and their stories for today's audience. This ten-part series takes the viewer inside to an uncompromising environment exploring the politics of women in a world without men, and how such a threatening experience both challenges and often changes those confined and working behind the razor wire."
    },
    {
      "username": "joclarke76",
      "userUrl": "https://www.imdb.com/user/ur1456615",
      "reviewLink": "https://www.imdb.com/review/rw3112695",
      "warningSpoilers": false,
      "date": "28 October 2014",
      "rate": "10",
      "helpful": "81 out of 86 found this helpful.",
      "title": "This series gets better and better",
      "content": "I was a huge fan of the first season of Wentworth Prison when it was shown on Channel 5 in the UK last year. I thought the series proved to be a great 'standalone' drama with high quality production values, excellent writing and acting. The series at the same time also paid subtle and gracious homage to Prisoner, a special and ground breaking show. Well the second season doesn't disappoint, building on the quality of the first season, and it is mostly down to the clever introduction into the Wentworth mix of one character - Joan Ferguson. Pamela Rabe is simply brilliant as Joan Ferguson - taking on the mantle of one of the most iconic of TV characters and breathing a new 21st century life into her is no easy job, but Rabe achieves it, obviously relishing the opportunity to play such an unusual female character. Rabe's on screen presence, controlled physical stillness and a real glint in the eye hides an obvious wealth of feelings, which comes out in small doses throughout the season, in carefully played scenes where unexpected kindness and sincerity adds real depth to an already complicated individual. The 'new' Joan Ferguson has obvious OCD and abhors physical contact. Her compulsion to control every part of her environment (including her office) her staff and prisoners is wonderfully realised by Rabe, with a series of subtle physical ticks, cold stares and calculating mental games with everyone around her. Great use is made of prison security cameras which become Joan's 'All seeing eye'. Clever adaption of surgical gloves is used as a visual tease (and a wink) in the early episodes of what is to come from Joan later on. The writing, production and cast are universally excellent once again, with particular mention to Nicole da Silva and Danielle Cormack who play Frankie and Bea. As in the first season, the use of slow motion image capture and end sequence music is particularly effective. I for one can't wait for season three."
    },
    {
      "username": "ditziie",
      "userUrl": "https://www.imdb.com/user/ur61522058",
      "reviewLink": "https://www.imdb.com/review/rw3589404",
      "warningSpoilers": false,
      "date": "30 November 2016",
      "rate": "10",
      "helpful": "61 out of 65 found this helpful.",
      "title": "One of the best shows I've ever watched without a doubt!",
      "content": "I put off watching this for a long time, under the false impression that it would just be a different version of 'Orange Is The New Black' (which I do love, but am not really searching for shows similar to it because I don't particularly like jail/prison shows) but man was I wrong. It is NOTHING like OITNB. Their similarities begin and end with it being set in a female prison.When I finally gave in and started watching, I was instantly hooked. Each episode is filled with action and drama and plenty of moments that make you either laugh or cry. The characters are unique and truly wonderfully played, you will quickly grow to love or hate each of them (sometimes both!) and as you learn their backstories you get a sense of really knowing and understanding them. There are some scenes that will literally have you on the edge of your seat, with your heart racing, yelling at the TV. After finishing this, I had to go find 'Prisoner Cell Block H' and give it a try. While it's nowhere near as good as 'Wentworth' (in my opinion) it was definitely neat to see the differences between the two. I'd definitely recommend Wentworth to anyone, I can't think of anyone I know who wouldn't like it, all of my friends who have watched it agree that it is one of their all time favorites! You will be kicking yourself for waiting so long to watch it!"
    },
    {
      "username": "catfanatic888",
      "userUrl": "https://www.imdb.com/user/ur3513409",
      "reviewLink": "https://www.imdb.com/review/rw6144768",
      "warningSpoilers": false,
      "date": "3 October 2020",
      "rate": "10",
      "helpful": "13 out of 14 found this helpful.",
      "title": "Netflix's BEST SHOW HANDS DOWN! Fantastic!",
      "content": "This Australian prison show is SO FAR ABOVE our US Orange is the New Black. This show has a flat-out PERFECT CAST EVERY SEASON! The stories are fascinating and the characters are fleshed out so you really care about them and their lives. I can't say enough positive statements for this show. Thank you Australia for this gift! Please keep filming new seasons!"
    },
    {
      "username": "WebKinect",
      "userUrl": "https://www.imdb.com/user/ur16204714",
      "reviewLink": "https://www.imdb.com/review/rw2914065",
      "warningSpoilers": false,
      "date": "30 November 2013",
      "rate": "10",
      "helpful": "34 out of 38 found this helpful.",
      "title": "Brilliant prequel!",
      "content": "A brilliant prequel to the fantastic series Prisoner Cell Block H. The focus of this series is basically how the young, innocent and abused Bea Smith becomes the infamous 'Top Dog' and Prison Officer \"Vera 'Vinegar Tits' Bennett becomes the nasty biatch we all know and love from the original series. While the main focus is on telling the story of Bea Smith and Vera Bennett, each episode tells a different story about how the additional prisoners became imprisoned.If you loved Prisoner Cell Block H then you really will love this! Not only is it interesting to see how Bea and Vera become the infamous characters we love, the acting and stories is just fantastic. While this is a prequel it also stands proud in it's own right as a fantastic and powerful Australian drama. I definitely can't wait for season 2 to come to the UK!!To the reviewer complaining that the characters are a \"complete contradiction to their original\"...I don't think you understand that this is NOT A REMAKE of the original but a PREQUEL TO THE ORIGINAL! The characters are completely different because they are possibly 20 years younger than they are in the original! If you loved Prisoner Cell Block H and you're interested in how and why the characters you loved became those people then this is ESSENTIAL viewing!"
    },
    {
      "username": "faiza_khan",
      "userUrl": "https://www.imdb.com/user/ur58736332",
      "reviewLink": "https://www.imdb.com/review/rw3186954",
      "warningSpoilers": false,
      "date": "19 February 2015",
      "rate": "9",
      "helpful": "44 out of 49 found this helpful.",
      "title": "Underrated show",
      "content": "A tense, thrilling and grasping TV series. Very much underrated. I love prison based shows so i was a huge fan of this. It got straight to the point and doesn't disappoint. I cannot wait till its back. I also watch Orange is the new black but this concept is different because its more serious. You cannot compare the two even though both is based around womens prison unit. You do not have to like a certain genre to watch this or be super intelligent, you can simply enjoy it. I'm really upset hardly anyone I know doesn't watch it which is why i had to write this review as to why everyone should! Again like any other show there are characters you love and hate which is awesome I get so attached to them. It is not a typical storyline in an everyday prison is what i loved."
    },
    {
      "username": "sebpopcorn",
      "userUrl": "https://www.imdb.com/user/ur19836791",
      "reviewLink": "https://www.imdb.com/review/rw2859566",
      "warningSpoilers": false,
      "date": "28 August 2013",
      "rate": "",
      "helpful": "24 out of 28 found this helpful.",
      "title": "Gripping",
      "content": "The last thing I ever expected to appear in the TV listings was a new series based on the excellent Prisoner Cell Block H! Being a big fan of the original series I had to see what it was like.The acting is good and it has the same mix of tragedy and tension as the original. I think it's a good move that they didn't try to exactly copy the characters and stories of the original, instead opting for some familiar names and a whole new story with some reminders of Prisoner for the fans.You have to hand it to Australia, there are some genres of TV they do better than the rest of the world, namely soap opera and prison drama. Great stuff, I will definitely be tuning in next week. Well done to Channel 5 for buying in something worth seeing for a change."
    },
    {
      "username": "harrisonglazier",
      "userUrl": "https://www.imdb.com/user/ur62750503",
      "reviewLink": "https://www.imdb.com/review/rw8478723",
      "warningSpoilers": false,
      "date": "23 August 2022",
      "rate": "8",
      "helpful": "20 out of 20 found this helpful.",
      "title": "Not high art but it's a fun ride",
      "content": "The women in prison scenario . . . Such a cheesy, guilty pleasure. I love it. The acting is uneven, dialogue sometimes stiff, storylines silly but, that said, it's entertaining. It's not Orange is The New Black or Bad Girls but if you enjoyed those shows, I'd check this one out."
    },
    {
      "username": "vfultonk",
      "userUrl": "https://www.imdb.com/user/ur118365123",
      "reviewLink": "https://www.imdb.com/review/rw7811217",
      "warningSpoilers": false,
      "date": "29 January 2022",
      "rate": "10",
      "helpful": "10 out of 10 found this helpful.",
      "title": "Just one of the best",
      "content": "I have stuck with the show over the years, so bittersweet to say goodbye. I loved these characters. This show never got old. The suspense and the building of each season was just so top notch. Even when we lost main characters that were loved, they managed to bring in new ones that you quickly fell in love with and rooted for. I wish I could give it many more stars. Thank you Wentworth."
    },
    {
      "username": "alanpuzey",
      "userUrl": "https://www.imdb.com/user/ur0569179",
      "reviewLink": "https://www.imdb.com/review/rw7626053",
      "warningSpoilers": false,
      "date": "8 December 2021",
      "rate": "9",
      "helpful": "7 out of 7 found this helpful.",
      "title": "What a roller coaster ride over the years",
      "content": "30 or 40 years ago I watched most of the PRISONER - CELL BLOCK H series and was hooked. Just great entertainment, despite all the impossible scenes. So much to discuss and dissect after an episode. And laugh at!Much later, I watched all the WENTWORTH series and was so surprised at how they managed to follow PRISONER and yet expand it so much.Nine series, which improved constantly. Story lines were just as crazy and you just never knew what was coming next. Vixens turned into saints, and good guys became bad guys. Nothing like a prison to reveal that it's hard to recognize who are really the heroes and who are villains.Technical quality and effects constantly improved over time as well.Whilst it will never be considered 'high art' it was an excellent look at the lives and times - as only the like of film makers and cartoonists can do."
    },
    {
      "username": "gottaluvlinda",
      "userUrl": "https://www.imdb.com/user/ur66903598",
      "reviewLink": "https://www.imdb.com/review/rw7879911",
      "warningSpoilers": false,
      "date": "19 February 2022",
      "rate": "10",
      "helpful": "16 out of 16 found this helpful.",
      "title": "Aussies Do It Again!",
      "content": "I'm so freakin proud to be Australian with the calibre of television we put out!I just finished the final ever episode and am still crying! I need more so starting at the beginning again!Much grittier than Orange (which I love) Wentworth has been a fave in our house since episode 1 minute 1.The acting, writing etc is stellar! Typical of my much loved Aussie dramas.It's so very different to it's predecessor Prisoner, yet still breaking the rules and stereotypes just like the original. Even the original song pops up now and then! So many much loved characters we'll miss!Couldn't ask for more in a show."
    },
    {
      "username": "midnitepantera",
      "userUrl": "https://www.imdb.com/user/ur126619686",
      "reviewLink": "https://www.imdb.com/review/rw7206144",
      "warningSpoilers": false,
      "date": "8 August 2021",
      "rate": "8",
      "helpful": "6 out of 6 found this helpful.",
      "title": "These B****es will cut your throat for the smallest thing! :o",
      "content": "Great show, great cast and Ferguson is really plain EVIL INCARNATE, she's like Michael Meyers from Halloween, she just keeps getting back up. LOL I can't believe how quick some of theses woman's loyalties change, more than their under ware. Really interesting characters, back stories, and little cliques of women trying to act like families and have each others backs. Loved Bea, and was sad to see how she was transformed inside. If you haven't seen this show yet, what are you waiting for, Get to It! ;D."
    },
    {
      "username": "staisild",
      "userUrl": "https://www.imdb.com/user/ur19675614",
      "reviewLink": "https://www.imdb.com/review/rw3292063",
      "warningSpoilers": false,
      "date": "6 August 2015",
      "rate": "10",
      "helpful": "66 out of 68 found this helpful.",
      "title": "Couldn't stop watching!!!!!",
      "content": "When I read the summary for Wentworth I thought it was going to be an Orange is the New Black knock-off, but I was wrong. Australian prison drama Wentworth is a ruthlessly dark. It's tragic and gripping, it has a lot of characteristics of OZ. Wentworth's careful plotting is a great example of what can happen when a show actually tries. It's smart and well acted. I actually prefer this show to OITNB. It has more depth and character, it just more real and gritty, like OZ. After each episode I just wanted more and more. It nice to watch a show that isn't over advertised or filled with famous names to rely on viewer ship. Superb acting from all of the cast."
    }
  ],
  "errorMessage": ""
}