{
  "imDbId": "tt2433738",
  "title": "Wentworth",
  "fullTitle": "Wentworth (TV Series 2013–2021)",
  "type": "TVSeries",
  "year": "2013",
  "language": "en",
  "titleInLanguage": "Wentworth (TV series)",
  "url": "https://en.wikipedia.org/wiki/Wentworth_(TV_series)",
  "plotShort": {
    "plainText": "Wentworth is an Australian television drama series. It was first broadcast on SoHo on 1 May 2013, and it concluded on Fox Showcase with its 100th episode on 26 October 2021. The series serves as a contemporary reimagining of Prisoner, which ran on Network Ten from 1979 to 1986. Lara Radulovich and David Hannam developed Wentworth from Reg Watson's original concept. The series is set in the modern day and initially focuses on Bea Smith's (Danielle Cormack) early days in prison and her subsequent rise to the top of the prison's hierarchy. From the fifth season onward, the series shifted to emphasize more of an ensemble format.\r\nFor the first three seasons, Wentworth was filmed on purpose-built sets in the suburbs of Clayton, Victoria. Starting with the fourth season, production moved to Newport, Victoria. The show has received a mostly positive reception from critics, and the first episode became the most watched Australian drama series premiere in Foxtel history. The series was picked up by several countries, including New Zealand and the UK, where it is titled Wentworth Prison.\r\nWentworth was commissioned for an eighth and final season consisting of 20 episodes and airing in two parts; the first part from July to September 2020, and the second part from 24 August 2021, with its final episode on 26 October.",
    "html": "<p>Wentworth is an Australian television drama series. It was first broadcast on SoHo on 1 May 2013, and it concluded on Fox Showcase with its 100th episode on 26 October 2021. The series serves as a contemporary reimagining of Prisoner, which ran on Network Ten from 1979 to 1986. Lara Radulovich and David Hannam developed Wentworth from Reg Watson's original concept. The series is set in the modern day and initially focuses on Bea Smith's (Danielle Cormack) early days in prison and her subsequent rise to the top of the prison's hierarchy. From the fifth season onward, the series shifted to emphasize more of an ensemble format.</p><p>For the first three seasons, Wentworth was filmed on purpose-built sets in the suburbs of Clayton, Victoria. Starting with the fourth season, production moved to Newport, Victoria. The show has received a mostly positive reception from critics, and the first episode became the most watched Australian drama series premiere in Foxtel history. The series was picked up by several countries, including New Zealand and the UK, where it is titled Wentworth Prison.</p><p>Wentworth was commissioned for an eighth and final season consisting of 20 episodes and airing in two parts; the first part from July to September 2020, and the second part from 24 August 2021, with its final episode on 26 October.</p>"
  },
  "plotFull": {
    "plainText": "Wentworth is an Australian television drama series. It was first broadcast on SoHo on 1 May 2013, and it concluded on Fox Showcase with its 100th episode on 26 October 2021. The series serves as a contemporary reimagining of Prisoner, which ran on Network Ten from 1979 to 1986. Lara Radulovich and David Hannam developed Wentworth from Reg Watson's original concept. The series is set in the modern day and initially focuses on Bea Smith's (Danielle Cormack) early days in prison and her subsequent rise to the top of the prison's hierarchy. From the fifth season onward, the series shifted to emphasize more of an ensemble format.\r\nFor the first three seasons, Wentworth was filmed on purpose-built sets in the suburbs of Clayton, Victoria. Starting with the fourth season, production moved to Newport, Victoria. The show has received a mostly positive reception from critics, and the first episode became the most watched Australian drama series premiere in Foxtel history. The series was picked up by several countries, including New Zealand and the UK, where it is titled Wentworth Prison.\r\nWentworth was commissioned for an eighth and final season consisting of 20 episodes and airing in two parts; the first part from July to September 2020, and the second part from 24 August 2021, with its final episode on 26 October.\r\nPremise\r\nWentworth is set in modern-day Australia. It explores the life of Bea Smith (Danielle Cormack) when she first enters prison after being charged with the attempted murder of her husband. Bea is separated from her daughter and sent to Wentworth on remand, where she lives in \"an uncertain limbo\" until she is sentenced. Starting at the bottom of Wentworth's hierarchy, Bea is forced to learn how to survive in prison.\r\nEpisodes and seasons\r\nCast and characters\r\nMain\r\nDanielle Cormack as Bea Smith (seasons 1–4)\r\nNicole da Silva as Francesca \"Franky\" Doyle (main seasons 1–6, special guest season 7)\r\nKris McQuade as Jacqueline \"Jacs\" Holt (season 1, special guest season 8)\r\nLeeanna Walsman as Erica Davidson (season 1)\r\nKate Atkinson as Vera Bennett (seasons 1–8)\r\nCelia Ireland as Elizabeth \"Liz\" Birdsworth (seasons 1–7)\r\nShareena Clanton as Doreen \"Dor\" Anderson (seasons 1–5)\r\nAaron Jeffery as Matthew \"Matt\" Fletcher – \"Fletch\" (seasons 1–3)\r\nRobbie J. Magasiva as Will Jackson (seasons 1–8)\r\nCatherine McClements as Meg Jackson (season 1)\r\nKatrina Milosevic as Susan Jenkins – \"Boomer\" (recurring season 1, main seasons 2–8)\r\nPamela Rabe as Joan Ferguson – \"The Freak\" (main seasons 2–5, 8, special guest seasons 6–7)\r\nSocratis Otto as Maxine Conway (recurring seasons 2–3, main seasons 4–5)\r\nTammy MacIntosh as Karen \"Kaz\" Proctor (recurring season 3, main seasons 4–7)\r\nKate Jenkinson as Allie Novak (seasons 4–8)\r\nBernard Curry as Jake Stewart (season 4–8)\r\nSigrid Thornton as Sonia Stevens (special guest season 4, main seasons 5–6)\r\nLeah Purcell as Rita Connors (seasons 6–8)\r\nSusie Porter as Marie Winter (seasons 6–8)\r\nRarriwuy Hick as Ruby Mitchell (seasons 6–8)\r\nKate Box as Lou Kelly (season 8)\r\nJane Hall as Ann Reynolds (season 8)\r\nZoe Terakes as Reb Keane (season 8)\r\nVivienne Awosoga as Judy Bryant (season 8)\r\nSpecial guest\r\nMarta Dusseldorp as Sheila Bausch (season 8)\r\nTina Bursill as Eve Wilder (season 8)\r\nRecurring\r\nJacqueline Brennan as Linda Miles (seasons 1–8)\r\nRa Chapman as Kim Chang (seasons 1–5)\r\nMartin Sacks as Acting Governor Derek Channing (seasons 1–6)\r\nLucia Brancatisano as Peta Webb (seasons 1–8)\r\nReef Ireland as Brayden Holt (seasons 1–2)\r\nBenne Harrison as Rosalind \"Roz\" Jago (seasons 1–3)\r\nCassandra Magrath as Hayley Jovanka (seasons 1–3)\r\nRichard Sutherland as Alan Doyle (seasons 1, 4–6)\r\nGeorgia Flood as Debbie Smith (seasons 1–2, cameo season 4)\r\nLouise Harris as Ronnie Katsis (season 1)\r\nRondah Dam as Phillipa \"Pip\" Turner (season 1)\r\nJohn Bach as Vinnie Holt (season 1)\r\nMelitta St Just as Megan Summers (season 1–2)\r\nLynette Curran as Rita Bennett (seasons 1–2)\r\nJada Alberts as Toni Goodes (seasons 1–2)\r\nAnnie Jones as Rachel Sanger (seasons 1–2)\r\nScott Parmeter as Chris Bakula (seasons 1–3)\r\nJake Ryan as Harry Smith (recurring seasons 1–2; cameo season 3)\r\nAlly Fowler as Simone \"Simmo\" Slater (recurring seasons 1–2; cameo season 3)\r\nSteve Le Marquand as Colin Bates (season 2)\r\nTony Briggs as Steve Faulkner (season 2)\r\nKatherine Halliday as Sarah Briggs (season 2)\r\nKathryn Beck as Sky Pierson (season 2)\r\nKasia Kaczmarek as Lindsay Coulter (seasons 2–3)\r\nBessie Holland as Stella Radic (seasons 2–5)\r\nChristen O'Leary as Kelly Bryant (seasons 2–3)\r\nAlex Menglet as Ivan Ferguson (seasons 2–3)\r\nEdwina Samuels as Sophie Donaldson (seasons 2–3)\r\nMaggie Naouri as Rose Atkins (seasons 2–3)\r\nGeorgia Chara as Jess Warner (seasons 2–3)\r\nTony Nikolakopoulos as Nils Jesper (seasons 2–4)\r\nLuke McKenzie as Nash Taylor (seasons 2–5)\r\nMarta Kaczmarek as Marge Nowak (seasons 2, 5)\r\nMiles Paras as Cindy Lou (season 3)\r\nPia Miranda as Jodie Spiteri (season 3)\r\nDamien Richardson as Michael Mears (season 3)\r\nKaterina Kotsonis as Brenda Murphy (seasons 3–6)\r\nLibby Tanner as Bridget Westfall (seasons 3–6)\r\nSally-Anne Upton as Lucy \"Juicy Lucy\" Gambaro (season 3–6)\r\nCharli Tjoe as Tina Mercado (seasons 3–5)\r\nSteve Bastoni as Don Kaplan (seasons 4–5)\r\nHunter Page-Lochard as Shayne Butler (seasons 4–5)\r\nSophia Katos as Mel Barrett (seasons 4–5)\r\nMaddy Jevic as Lee Radcliffe (seasons 4–6)\r\nSarah Hallam as Jen \"Hutch\" Hutchins (seasons 5–8)\r\nDanielle Alexis as Dana Malouf (seasons 5)\r\nZahra Newman as Iman Farah (seasons 5)\r\nChloe Ng as Nurse Shen (seasons 6–8)\r\nEmily Havea as Mon Alston (seasons 6–8)\r\nShane Connor as Ray Houser (seasons 6–7)\r\nNatalia Novikova as Zara Dragovich (season 6)\r\nArtemis Ioannides as Vicky Kosta (seasons 6–7)\r\nDavid de Lautour as Dr. Greg Miller (seasons 7–8)\r\nMorgana O'Reilly as Narelle Stang (season 7)\r\nRick Donald as Sean Brody (season 7)\r\nAnni Finsterer as May Jenkins (Season 7)\r\nAlexandra Schepisi as Cynthia Rattray (season 8)\r\nLouisa Mignone as Zaina Saad (season 8)\r\nJennifer Vuletic as Mandy (season 8)\r\nKevin Harrington as Officer Roberts (season 8)\r\nTom Wren as Dominic Slade (season 8)\r\nBrian Vriends as Dr. Mendel (season 8)\r\nPeter O'Brien as Tony Cockburn (season 8)\r\nGreg Fryer as Blair Mitchell (season 8)\r\nHuw Higginson as Gavin Thompson (season 8)\r\nGuest\r\nAnne Charleston as Celeste Donaldson (season 1)\r\nAndrew Blackman as Oliver Donaldson (season 1)\r\nCarla Bonner as Manda Katsis (season 1)\r\nGloria Ajenstat as Georgia Henderson (season 1)\r\nMaria Angelico as Katrina \"Trina\" Jenkins (season 2)\r\nLiddy Clark as Hazel Fullagher (season 3)\r\nNeil Melville as Brendan Maddock (season 3)\r\nDebra Lawrance as Faith Proctor (season 4)\r\nGeraldine Hakewill as Kylee Webb (season 7)\r\nJackson Gallagher as Travis Kelly (season 8)\r\nProduction\r\nConception\r\nIn March 2012, it was announced that a contemporary re-imagining of Prisoner, an Australian soap opera of the late 20th century, had been commissioned by Foxtel. Brian Walsh, the executive director of television at Foxtel, said that Wentworth would not be a remake of Prisoner, which ran for 692 episodes on Network Ten from 1979 to 1986. He said:\r\n\"Wentworth will be a dynamic and very confronting drama series, developed and stylised specifically for subscription television audiences. We have told producers to push all boundaries and honestly depict life on the inside as it is in 2012.\"\r\nLara Radulovich and David Hannam developed Wentworth from Reg Watson's original concept. FremantleMedia and director of drama Jo Porter is producer. The first episode, and several subsequent episodes, were written by Pete McTighe. The idea for an \"Underbelly-style remake of Prisoner\" was first mooted by television critic Michael Idato, who went on to act as series consultant. Kerry Tucker acted as consultant on authenticity.\r\nProducer Jo Porter commented that the series would explore \"the politics of women in a world with few men, and how the experience both challenges and changes them, sometimes for the better\". Wentworth is set in the modern-day and explores Bea Smith's early days in prison. The storylines include a mix of original inmates and staff from Prisoner, with characters also developed especially for Wentworth.\r\nFoxtel told a reporter from The Sydney Morning Herald that the original characters from Prisoner would have a contemporary interpretation in the new series. It was initially reported that none of the original cast from Prisoner would appear in the first season of Wentworth, however, Anne Charleston, who had a number of small roles in the original series, made a cameo appearance as Liz Birdsworth's mother-in-law. Alex Menglet and Gloria Ajenstat, who played Ray Proctor and Tammy Fisher in the original series, will have guest roles in the new series. Foxtel revealed that the producers were looking at how they might incorporate the Prisoner theme tune, \"On The Inside\", into the new series.\r\nEight-season run\r\nOn 5 June 2013, it was confirmed that Wentworth had been renewed for a second season. A reporter for the Australian Associated Press said production would begin later in the year, and the season would air in 2014. Porter stated: \"We have assembled an extraordinary team of writers who can't wait to get started on series two. We have so many more stories to tell\". In January 2014, it was announced that a third season of Wentworth had been ordered, before the second had aired. In a similar manner, a 12-episode fourth season was announced before the airing of the third season on 27 February 2015. It began airing from 10 May 2016. Cormack confirmed a fifth season had been commissioned on 19 July. The twelve-part series premiered on 4 April 2017. On 9 May 2017, Showcase announced that the series had been renewed for a sixth season, which premiered on 19 June 2018. A seventh season was commissioned in April 2018, before the sixth-season premiere, with filming commencing the following week and a premiere set for 28 May 2019. On 5 December 2018, it was confirmed that a 20-episode eighth season had been commissioned, with production beginning in late October 2019, with Part 1, featuring the first 10 episodes, premiering on 28 July 2020 and Part 2 in 2021.\r\nIn October 2019, it was confirmed that the series would conclude following the second part of the eighth season in 2021, making it the longest-running hour drama series in Foxtel history, with a total of 100 episodes.\r\nCasting\r\nOn 4 October 2012, a reporter for The West Australian revealed that Celia Ireland and Kate Atkinson had joined the cast of Wentworth, while Shareena Clanton would make her acting debut as Doreen Anderson. Danielle Cormack was cast in the role of Beatrice \"Queen Bea\" Smith and she stated, \"I am absolutely rapt to be part of the reboot of such an iconic drama. Prisoner left an indelible mark on fans and I really hope that the re-imagining of this series will be just as popular with viewers now as it was back then.\" Actors Robbie Magasiva and Aaron Jeffery play corrections officers in the detention centre. David Knox from TV Tonight revealed that Nicole da Silva, Kris McQuade, Catherine McClements and Leeanna Walsman had also joined the cast.\r\nFollowing the end of the first season, it was revealed that iconic Prisoner character Joan \"The Freak\" Ferguson, a sadistic, lesbian prison officer, would be introduced in the second season. Porter commented, \"Prisoner offered up a very rich well of amazing characters to draw upon and the Wentworth writers are very excited about revisiting the character of prison officer Joan 'The Freak' Ferguson in our second season.\" On 21 September 2013, it was confirmed that Pamela Rabe had been cast as \"The Freak\". McQuade, McClements and Walsman did not reprise their respective roles of Jacs Holt, Meg Jackson and Erica Davidson for the second season. Katrina Milosevic, who portrays Susan \"Boomer\" Jenkins, was upgraded to the main cast.\r\nActresses Pia Miranda, Libby Tanner and Tammy MacIntosh joined the cast from the third season as inmate Jodie Spiteri, psychologist Bridget Westfall, and vigilante Karen \"Kaz\" Proctor, respectively. Sigrid Thornton, who played Ros Coulson on Prisoner, joined the cast for season four, not reprising her former role, but playing another Prisoner-based character, Sonia Stevens. In November 2015, Kate Jenkinson and Bernard Curry were announced to be appearing in the show as Allie Novak, an inmate, and Jake Stewart, a correctional officer, respectively.\r\nIn April 2018, it was announced that Indigenous Australian actress Leah Purcell had joined the cast as Rita Connors, a role originally played by Glenda Linscott in Prisoner. Also joining the cast were Susie Porter as criminal matriarch Marie Winter, a role originally played by Maggie Millar in Prisoner, and Rarriwuy Hick as young boxer Ruby Mitchell. Shane Connor also joined the cast in a recurring role.\r\nIn Season 7, Morgana O'Reilly, Rick Donald, and David de Lautour were introduced. In June 2020, it was announced that Marta Dusseldorp would be joining the cast of season 8 as Sheila Bausch, a lead figure in a cult who is charged with nine counts of murder.\r\nIn October 2019, it was announced that the eighth season would introduce three new cast members; Kate Box, Zoe Terakes, and Jane Hall have been cast as Lou Kelly, Reb Keane, and Ann Reynolds, respectively.\r\nFilming\r\nFoxtel confirmed that Wentworth would not be shot at the original ATV-10 studios in Nunawading, Victoria where Prisoner was filmed. Wentworth was instead filmed on a purpose-built set in the suburb of Clayton. The shoot employed 300 cast and crew. The ten-part season began filming for four months from 10 October 2012. Wentworth began airing on Foxtel's SoHo channel from 1 May 2013. Filming for the second season began on 23 September 2013 and wrapped on 13 February 2014. The second season began airing on 20 May 2014. Production for the third season resumed in March and filming was completed in late July. In the same month, it was announced that the property in which Wentworth was filmed had been sold, and the set would be knocked down. A new alternative was being sought and a TV Week reporter commented that it was unclear if the loss of the set would be written into future storylines. The third season began airing on 7 April 2015. Production on the fourth season began in the second half of 2015. The fifth season was filmed in Melbourne from August 2016. On 9 May 2017, Showcase announced that the series had been renewed for a sixth season, which began filming a week later.\r\nOn March 18, 2020, TV Tonight confirmed production of the second part of the eighth and final season was suspended due to the coronavirus outbreak. The 10-episode first part of eighth season is still scheduled to air from July 2020.\r\nFilming for the second part of the eighth and final season was completed on 4 September 2020.\r\nTheme song\r\nThe original Wentworth theme music was composed by rock musician Richard Pleasance for the show's instrumental opening theme to the first season. In season two, a new variant of the theme was composed with the introduction of lyrics comprising the theme song \"You Don't Know Me\", performed by Pleasantville, with the vocals supplied by Pleasance's wife Michelle. An orchestrated instrumental version, with differs from the opening theme, served as the ending theme throughout the show's run. For the eight season, a new updated variant of the original instrumental theme music, along with a new end theme will be introduced, while the lyrics will be dropped entirely.\r\nDirection\r\nA number of directors worked on the series over the eight seasons, with Kevin Carlin undertaking the direction of 32 episodes. Other directors included Steve Jodrell, Dee McLachlan and Beck Cole.\r\nRelease\r\nBroadcast\r\nWentworth has been sold to more than 90 countries. On 2 April 2013, it was confirmed that TVNZ had signed a deal to broadcast Wentworth in New Zealand. Later that month, it was announced that Wentworth would be broadcast on Channel 5 in the UK. The head of acquisitions for the channel, Kate Keenan, commented \"Wentworth will be a great addition to Channel 5's drama output this autumn. This compelling cast of female characters packs an emotional punch and will appeal to the Channel 5 viewers who love our range of crime output from dramas to factual series.\"\r\nA trailer for the series began airing on the channel and its website in August 2013 and premiered on Channel 5 on 28 August. Channel 5 also re-titled the show, Wentworth Prison. The second season began on Channel 5 on 3 September 2014 and season Three, which commenced broadcast on 22 July 2015, concluded with a two-hour season finale which consisted of episodes 11 and 12 of the season on 30 September 2015. Season four of Wentworth premiered on Channel 5 on 27 June 2016. In July, following declining ratings, the series was moved from its Monday night timeslot on Channel 5 to Tuesdays on sister channel 5Star. Season 5 premiered on 5Star on 23 May 2017. Season 6 of Wentworth premiered on 5Star on 23 June 2018, just four days following the Australian premiere; however, the series was moved to Saturday nights at 10:00 pm. The seventh season premiered on 8 June 2019 in the same Saturday night timeslot as the previous season. The eighth season will premiere on 5 August 2020 in a Wednesday night 10:00 pm timeslot. The second part of the season was scheduled to premiere on the same day as Australia, 24 August 2021, on 5STAR in the UK.\r\nThe series premiered in the Republic of Ireland broadcasting as Wentworth on TV3 from June 2014. Season 2 premiered on TV3 on 15 January 2015. In Canada the first two seasons broadcast on Aboriginal Peoples Television Network in late 2015.\r\nAlthough the series has a strong fan base in many countries, Angela Perez of Australia Network News said, in 2016, that Foxtel was considering cancelling the show due to audiences viewing new episodes via pirate websites following the Australian premiere. Foxtel stated that the piracy is \"a serious problem in terms of recouping money to help pay for future seasons\".\r\nABC 1 started broadcasting Wentworth from season 1 in April 2018, with repeats being aired through ABC Iview.\r\nStreaming\r\nIn December 2014, Wentworth first premiered on Netflix in the United States and added seasons one and two to its streaming service. In April 2016 the third season was released to US audiences via the platform. Season 4 was released on Netflix in July 2016, season 5 in June 2017, season 6 in September 2018, season 7 in July 2018, part one of season 8 in September 2020 and part two of season 8 in October 2021. The show features on the “50 Best TV Shows on Netflix” list according to Netflix Life. Seasons one to three are available to view via Amazon Video in the U.S.\r\nIn the United Kingdom, all nine seasons are available for streaming on Amazon Prime Video, while additional services include Google Play and YouTube.\r\nIn Australia, Foxtel Now provides a catch-up service for the Wentworth, while the series is made available for catch-up viewing via TVNZ OnDemand in New Zealand and My5 in the United Kingdom for a limited time following initial broadcast. As of 2021, all eight seasons are available to stream in the UK on Amazon Prime Video, and again via My5 where it holds unlimited streaming rights until 2023.\r\nHome media\r\nIn Australia, Wentworth is available on both DVD and Blu-ray formats. The first season was released via Shock Records, while subsequent seasons have been made available from its current distribution company, Roadshow Entertainment. Under the \"Wentworth Prison\" title, the series was initially available in the United Kingdom from Fremantle Home Entertainment for the first three seasons; after which, the British company Network acquired all rights to release the series. In the UK, the series was only available on DVD, however, it was, for the first time, made available on Blu-ray for its seventh season in 2019, and again for its eighth season in 2020. Additionally, multiple season sets are available on DVD and Blu-ray in Australia, and only on DVD in the UK. As of 2018, the multiple sets are only available on DVD in Australia and are no longer being released in the UK.\r\nIn the United States, Wentworth was released on DVD via Acorn Media. The first three seasons have been made available and it is currently not known if subsequent seasons will follow.\r\nReception\r\nThe show has received critical acclaim throughout its run. Following a screening of the pilot episode for the media in February 2013, Ben Pobjie from The Age called Wentworth \"a triumph\". He praised the writing and the cast, saying \"So rarely in Australian TV do we see well-written characters collide with dead-on casting and tense, atmospheric direction as they have here.\" He added that Wentworth is \"a powerful, almost cinematic drama\" with its own identity, that incorporates \"echoes\" of the original Prisoner series. Holly Byrnes, writing for the Herald Sun, quipped \"this brilliant retelling picks up where the pioneering series left off and then takes the kind of shocking plot detours contemporary TV viewers would expect from award-winning US dramas like Breaking Bad or Sons of Anarchy.\" Byrnes also praised the cast's performances, particularly Cormack.\r\nFollowing its North American debut the critics drew comparisons with US prison dramedy Orange Is the New Black, though Liz Raftery of TV Guide said she believed the show was more gritty and did not \"sugarcoat\" prison life. They branded it \"edge-of-your-seat television\" and singled out Sue 'Boomer' Jenkins as one of the show's standout characters and reasons to watch. Margaret Lyons from New York magazine called it a \"ruthlessly dark drama\" similar to Breaking Bad, a comparison which TV Guide's critics also made. Lyons added that Wentworth's careful plotting of storylines gave meaningful payoffs and triumphed into making it a \"smart and competent\" series.\r\nGerard O'Donovan from The Daily Telegraph opined that the show has a cast of \"fabulously strong, variably humane female characters.\" They believed it did not try to appeal to \"mainstream tastes\", adding \"the series sticks more closely to its violent, soapy, sexploitation Prisoner: Cell Block H roots than is strictly necessary in 2016.\" O'Donovan branded it a rare example of fictional work portraying lesbianism as \"not only normal, but the norm.\" He concluded the show depicts a world in which \"women hold virtually all the power, albeit to no obviously edifying ends.\" Matt Baylis from the Daily Express criticised the show for not being original and having a \"mandatory number of unnecessary scenes\". They preferred the original series Prisoner and accused Wentworth of being everything the original was not.\r\nThe first episode of Wentworth attracted 244,000 viewers, making it the most watched Australian drama series premiere in Foxtel history. The UK premiere of the show attracted 1.67 million viewers, a 10.3% share of the audience for the 10pm time slot.\r\nRatings\r\nAccolades\r\nWentworth has received several awards and nominations since its debut in 2013. The series has received 24 Logie Award nominations, winning seven in total, in which Danielle Cormack, Celia Ireland and Pamela Rabe have been recipients respectively, while the show has won the award for Most Outstanding Drama Series in 2015, 2018 and 2019 respectively, and for Most Popular Drama Program in 2018.\r\nThe shows has also received nominations and wins from the AACTA Awards, the ASTRA Awards, Australian Directors Guild Awards, and Australian Writers Guild Awards, while additional nominations have come from the Australian Screen Editors and the Equity Awards.\r\nAdaptations",
    "html": "<p>Wentworth is an Australian television drama series. It was first broadcast on SoHo on 1 May 2013, and it concluded on Fox Showcase with its 100th episode on 26 October 2021. The series serves as a contemporary reimagining of Prisoner, which ran on Network Ten from 1979 to 1986. Lara Radulovich and David Hannam developed Wentworth from Reg Watson's original concept. The series is set in the modern day and initially focuses on Bea Smith's (Danielle Cormack) early days in prison and her subsequent rise to the top of the prison's hierarchy. From the fifth season onward, the series shifted to emphasize more of an ensemble format.</p><p>For the first three seasons, Wentworth was filmed on purpose-built sets in the suburbs of Clayton, Victoria. Starting with the fourth season, production moved to Newport, Victoria. The show has received a mostly positive reception from critics, and the first episode became the most watched Australian drama series premiere in Foxtel history. The series was picked up by several countries, including New Zealand and the UK, where it is titled Wentworth Prison.</p><p>Wentworth was commissioned for an eighth and final season consisting of 20 episodes and airing in two parts; the first part from July to September 2020, and the second part from 24 August 2021, with its final episode on 26 October.</p><br/><h3>Premise</h3><p>Wentworth is set in modern-day Australia. It explores the life of Bea Smith (Danielle Cormack) when she first enters prison after being charged with the attempted murder of her husband. Bea is separated from her daughter and sent to Wentworth on remand, where she lives in \"an uncertain limbo\" until she is sentenced. Starting at the bottom of Wentworth's hierarchy, Bea is forced to learn how to survive in prison.</p><br/><h3>Episodes and seasons</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"3\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th><th scope=\"col\" style=\"padding:0 8px\">Network</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">1 May 2013</td><td style=\"padding:0 8px\">3 July 2013</td><td rowspan=\"4\"><span>SoHo</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">12</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">20 May 2014</td><td style=\"padding:0 8px\">5 August 2014</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">12</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">7 April 2015</td><td style=\"padding:0 8px\">23 June 2015</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>4</span></span></span></span></th><td colspan=\"2\">12</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">10 May 2016</td><td style=\"padding:0 8px\">26 July 2016</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>5</span></span></span></span></th><td colspan=\"2\">12</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">4 April 2017</td><td style=\"padding:0 8px\">20 June 2017</td><td rowspan=\"5\"><span class=\"mw-redirect\">Fox Showcase</span></td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>6</span></span></span></span></th><td colspan=\"2\">12</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">19 June 2018</td><td style=\"padding:0 8px\">4 September 2018</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>7</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">28 May 2019</td><td style=\"padding:0 8px\">30 July 2019</td></tr><tr style=\"height:100%\"><th scope=\"row\" rowspan=\"2\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>8</span></span></span></span></th><td colspan=\"1\" rowspan=\"2\">20</td><td colspan=\"1\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">28 July 2020</td><td style=\"padding:0 8px\">29 September 2020</td></tr><tr style=\"height:100%\"><td colspan=\"1\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">24 August 2021</td><td style=\"padding:0 8px\">26 October 2021</td></tr></tbody></table><br/><h3>Cast and characters</h3><h4>Main</h4><ul><li>Danielle Cormack as Bea Smith (seasons 1–4)</li><li>Nicole da Silva as Francesca \"Franky\" Doyle (main seasons 1–6, special guest season 7)</li><li>Kris McQuade as Jacqueline \"Jacs\" Holt (season 1, special guest season 8)</li><li>Leeanna Walsman as Erica Davidson (season 1)</li><li>Kate Atkinson as Vera Bennett (seasons 1–8)</li><li>Celia Ireland as Elizabeth \"Liz\" Birdsworth (seasons 1–7)</li><li>Shareena Clanton as Doreen \"Dor\" Anderson (seasons 1–5)</li><li>Aaron Jeffery as Matthew \"Matt\" Fletcher – \"Fletch\" (seasons 1–3)</li><li>Robbie J. Magasiva as Will Jackson (seasons 1–8)</li><li>Catherine McClements as Meg Jackson (season 1)</li><li>Katrina Milosevic as Susan Jenkins – \"Boomer\" (recurring season 1, main seasons 2–8)</li><li>Pamela Rabe as Joan Ferguson – \"The Freak\" (main seasons 2–5, 8, special guest seasons 6–7)</li><li>Socratis Otto as Maxine Conway (recurring seasons 2–3, main seasons 4–5)</li><li>Tammy MacIntosh as Karen \"Kaz\" Proctor (recurring season 3, main seasons 4–7)</li><li>Kate Jenkinson as Allie Novak (seasons 4–8)</li><li>Bernard Curry as Jake Stewart (season 4–8)</li><li>Sigrid Thornton as Sonia Stevens (special guest season 4, main seasons 5–6)</li><li>Leah Purcell as Rita Connors (seasons 6–8)</li><li>Susie Porter as Marie Winter (seasons 6–8)</li><li>Rarriwuy Hick as Ruby Mitchell (seasons 6–8)</li><li>Kate Box as Lou Kelly (season 8)</li><li>Jane Hall as Ann Reynolds (season 8)</li><li>Zoe Terakes as Reb Keane (season 8)</li><li>Vivienne Awosoga as Judy Bryant (season 8)</li></ul><h4>Special guest</h4><ul><li>Marta Dusseldorp as Sheila Bausch (season 8)</li><li>Tina Bursill as Eve Wilder (season 8)</li></ul><h4>Recurring</h4><ul><li>Jacqueline Brennan as Linda Miles (seasons 1–8)</li><li>Ra Chapman as Kim Chang (seasons 1–5)</li><li>Martin Sacks as Acting Governor Derek Channing (seasons 1–6)</li><li>Lucia Brancatisano as Peta Webb (seasons 1–8)</li><li>Reef Ireland as Brayden Holt (seasons 1–2)</li><li>Benne Harrison as Rosalind \"Roz\" Jago (seasons 1–3)</li><li>Cassandra Magrath as Hayley Jovanka (seasons 1–3)</li><li>Richard Sutherland as Alan Doyle (seasons 1, 4–6)</li><li>Georgia Flood as Debbie Smith (seasons 1–2, cameo season 4)</li><li>Louise Harris as Ronnie Katsis (season 1)</li><li>Rondah Dam as Phillipa \"Pip\" Turner (season 1)</li><li>John Bach as Vinnie Holt (season 1)</li><li>Melitta St Just as Megan Summers (season 1–2)</li><li>Lynette Curran as Rita Bennett (seasons 1–2)</li><li>Jada Alberts as Toni Goodes (seasons 1–2)</li><li>Annie Jones as Rachel Sanger (seasons 1–2)</li><li>Scott Parmeter as Chris Bakula (seasons 1–3)</li><li>Jake Ryan as Harry Smith (recurring seasons 1–2; cameo season 3)</li><li>Ally Fowler as Simone \"Simmo\" Slater (recurring seasons 1–2; cameo season 3)</li><li>Steve Le Marquand as Colin Bates (season 2)</li><li>Tony Briggs as Steve Faulkner (season 2)</li><li>Katherine Halliday as Sarah Briggs (season 2)</li><li>Kathryn Beck as Sky Pierson (season 2)</li><li>Kasia Kaczmarek as Lindsay Coulter (seasons 2–3)</li><li>Bessie Holland as Stella Radic (seasons 2–5)</li><li>Christen O'Leary as Kelly Bryant (seasons 2–3)</li><li>Alex Menglet as Ivan Ferguson (seasons 2–3)</li><li>Edwina Samuels as Sophie Donaldson (seasons 2–3)</li><li>Maggie Naouri as Rose Atkins (seasons 2–3)</li><li>Georgia Chara as Jess Warner (seasons 2–3)</li><li>Tony Nikolakopoulos as Nils Jesper (seasons 2–4)</li><li>Luke McKenzie as Nash Taylor (seasons 2–5)</li><li>Marta Kaczmarek as Marge Nowak (seasons 2, 5)</li><li>Miles Paras as Cindy Lou (season 3)</li><li>Pia Miranda as Jodie Spiteri (season 3)</li><li>Damien Richardson as Michael Mears (season 3)</li><li>Katerina Kotsonis as Brenda Murphy (seasons 3–6)</li><li>Libby Tanner as Bridget Westfall (seasons 3–6)</li><li>Sally-Anne Upton as Lucy \"Juicy Lucy\" Gambaro (season 3–6)</li><li>Charli Tjoe as Tina Mercado (seasons 3–5)</li><li>Steve Bastoni as Don Kaplan (seasons 4–5)</li><li>Hunter Page-Lochard as Shayne Butler (seasons 4–5)</li><li>Sophia Katos as Mel Barrett (seasons 4–5)</li><li>Maddy Jevic as Lee Radcliffe (seasons 4–6)</li><li>Sarah Hallam as Jen \"Hutch\" Hutchins (seasons 5–8)</li><li>Danielle Alexis as Dana Malouf (seasons 5)</li><li>Zahra Newman as Iman Farah (seasons 5)</li><li>Chloe Ng as Nurse Shen (seasons 6–8)</li><li>Emily Havea as Mon Alston (seasons 6–8)</li><li>Shane Connor as Ray Houser (seasons 6–7)</li><li>Natalia Novikova as Zara Dragovich (season 6)</li><li>Artemis Ioannides as Vicky Kosta (seasons 6–7)</li><li>David de Lautour as Dr. Greg Miller (seasons 7–8)</li><li>Morgana O'Reilly as Narelle Stang (season 7)</li><li>Rick Donald as Sean Brody (season 7)</li><li>Anni Finsterer as May Jenkins (Season 7)</li><li>Alexandra Schepisi as Cynthia Rattray (season 8)</li><li>Louisa Mignone as Zaina Saad (season 8)</li><li>Jennifer Vuletic as Mandy (season 8)</li><li>Kevin Harrington as Officer Roberts (season 8)</li><li>Tom Wren as Dominic Slade (season 8)</li><li>Brian Vriends as Dr. Mendel (season 8)</li><li>Peter O'Brien as Tony Cockburn (season 8)</li><li>Greg Fryer as Blair Mitchell (season 8)</li><li>Huw Higginson as Gavin Thompson (season 8)</li></ul><h4>Guest</h4><ul><li>Anne Charleston as Celeste Donaldson (season 1)</li><li>Andrew Blackman as Oliver Donaldson (season 1)</li><li>Carla Bonner as Manda Katsis (season 1)</li><li>Gloria Ajenstat as Georgia Henderson (season 1)</li><li>Maria Angelico as Katrina \"Trina\" Jenkins (season 2)</li><li>Liddy Clark as Hazel Fullagher (season 3)</li><li>Neil Melville as Brendan Maddock (season 3)</li><li>Debra Lawrance as Faith Proctor (season 4)</li><li>Geraldine Hakewill as Kylee Webb (season 7)</li><li>Jackson Gallagher as Travis Kelly (season 8)</li></ul><br/><h3>Production</h3><h4>Conception</h4><p>In March 2012, it was announced that a contemporary re-imagining of Prisoner, an Australian soap opera of the late 20th century, had been commissioned by Foxtel. Brian Walsh, the executive director of television at Foxtel, said that Wentworth would not be a remake of Prisoner, which ran for 692 episodes on Network Ten from 1979 to 1986. He said:</p><blockquote>\"Wentworth will be a dynamic and very confronting drama series, developed and stylised specifically for subscription television audiences. We have told producers to push all boundaries and honestly depict life on the inside as it is in 2012.\"</blockquote><p>Lara Radulovich and David Hannam developed Wentworth from Reg Watson's original concept. FremantleMedia and director of drama Jo Porter is producer. The first episode, and several subsequent episodes, were written by Pete McTighe. The idea for an \"Underbelly-style remake of Prisoner\" was first mooted by television critic Michael Idato, who went on to act as series consultant. Kerry Tucker acted as consultant on authenticity.</p><p>Producer Jo Porter commented that the series would explore \"the politics of women in a world with few men, and how the experience both challenges and changes them, sometimes for the better\". Wentworth is set in the modern-day and explores Bea Smith's early days in prison. The storylines include a mix of original inmates and staff from Prisoner, with characters also developed especially for Wentworth.</p><p>Foxtel told a reporter from The Sydney Morning Herald that the original characters from Prisoner would have a contemporary interpretation in the new series. It was initially reported that none of the original cast from Prisoner would appear in the first season of Wentworth, however, Anne Charleston, who had a number of small roles in the original series, made a cameo appearance as Liz Birdsworth's mother-in-law. Alex Menglet and Gloria Ajenstat, who played Ray Proctor and Tammy Fisher in the original series, will have guest roles in the new series. Foxtel revealed that the producers were looking at how they might incorporate the Prisoner theme tune, \"On The Inside\", into the new series.</p><h4>Eight-season run</h4><p>On 5 June 2013, it was confirmed that Wentworth had been renewed for a second season. A reporter for the Australian Associated Press said production would begin later in the year, and the season would air in 2014. Porter stated: \"We have assembled an extraordinary team of writers who can't wait to get started on series two. We have so many more stories to tell\". In January 2014, it was announced that a third season of Wentworth had been ordered, before the second had aired. In a similar manner, a 12-episode fourth season was announced before the airing of the third season on 27 February 2015. It began airing from 10 May 2016. Cormack confirmed a fifth season had been commissioned on 19 July. The twelve-part series premiered on 4 April 2017. On 9 May 2017, Showcase announced that the series had been renewed for a sixth season, which premiered on 19 June 2018. A seventh season was commissioned in April 2018, before the sixth-season premiere, with filming commencing the following week and a premiere set for 28 May 2019. On 5 December 2018, it was confirmed that a 20-episode eighth season had been commissioned, with production beginning in late October 2019, with Part 1, featuring the first 10 episodes, premiering on 28 July 2020 and Part 2 in 2021.</p><p>In October 2019, it was confirmed that the series would conclude following the second part of the eighth season in 2021, making it the longest-running hour drama series in Foxtel history, with a total of 100 episodes.</p><h4>Casting</h4><p>On 4 October 2012, a reporter for The West Australian revealed that Celia Ireland and Kate Atkinson had joined the cast of Wentworth, while Shareena Clanton would make her acting debut as Doreen Anderson. Danielle Cormack was cast in the role of Beatrice \"Queen Bea\" Smith and she stated, \"I am absolutely rapt to be part of the reboot of such an iconic drama. Prisoner left an indelible mark on fans and I really hope that the re-imagining of this series will be just as popular with viewers now as it was back then.\" Actors Robbie Magasiva and Aaron Jeffery play corrections officers in the detention centre. David Knox from TV Tonight revealed that Nicole da Silva, Kris McQuade, Catherine McClements and Leeanna Walsman had also joined the cast.</p><p>Following the end of the first season, it was revealed that iconic Prisoner character Joan \"The Freak\" Ferguson, a sadistic, lesbian prison officer, would be introduced in the second season. Porter commented, \"Prisoner offered up a very rich well of amazing characters to draw upon and the Wentworth writers are very excited about revisiting the character of prison officer Joan 'The Freak' Ferguson in our second season.\" On 21 September 2013, it was confirmed that Pamela Rabe had been cast as \"The Freak\". McQuade, McClements and Walsman did not reprise their respective roles of Jacs Holt, Meg Jackson and Erica Davidson for the second season. Katrina Milosevic, who portrays Susan \"Boomer\" Jenkins, was upgraded to the main cast.</p><p>Actresses Pia Miranda, Libby Tanner and Tammy MacIntosh joined the cast from the third season as inmate Jodie Spiteri, psychologist Bridget Westfall, and vigilante Karen \"Kaz\" Proctor, respectively. Sigrid Thornton, who played Ros Coulson on Prisoner, joined the cast for season four, not reprising her former role, but playing another Prisoner-based character, Sonia Stevens. In November 2015, Kate Jenkinson and Bernard Curry were announced to be appearing in the show as Allie Novak, an inmate, and Jake Stewart, a correctional officer, respectively.</p><p>In April 2018, it was announced that Indigenous Australian actress Leah Purcell had joined the cast as Rita Connors, a role originally played by Glenda Linscott in Prisoner. Also joining the cast were Susie Porter as criminal matriarch Marie Winter, a role originally played by Maggie Millar in Prisoner, and Rarriwuy Hick as young boxer Ruby Mitchell. Shane Connor also joined the cast in a recurring role.</p><p>In Season 7, Morgana O'Reilly, Rick Donald, and David de Lautour were introduced. In June 2020, it was announced that Marta Dusseldorp would be joining the cast of season 8 as Sheila Bausch, a lead figure in a cult who is charged with nine counts of murder.</p><p>In October 2019, it was announced that the eighth season would introduce three new cast members; Kate Box, Zoe Terakes, and Jane Hall have been cast as Lou Kelly, Reb Keane, and Ann Reynolds, respectively.</p><h4>Filming</h4><p>Foxtel confirmed that Wentworth would not be shot at the original ATV-10 studios in Nunawading, Victoria where Prisoner was filmed. Wentworth was instead filmed on a purpose-built set in the suburb of Clayton. The shoot employed 300 cast and crew. The ten-part season began filming for four months from 10 October 2012. Wentworth began airing on Foxtel's SoHo channel from 1 May 2013. Filming for the second season began on 23 September 2013 and wrapped on 13 February 2014. The second season began airing on 20 May 2014. Production for the third season resumed in March and filming was completed in late July. In the same month, it was announced that the property in which Wentworth was filmed had been sold, and the set would be knocked down. A new alternative was being sought and a TV Week reporter commented that it was unclear if the loss of the set would be written into future storylines. The third season began airing on 7 April 2015. Production on the fourth season began in the second half of 2015. The fifth season was filmed in Melbourne from August 2016. On 9 May 2017, Showcase announced that the series had been renewed for a sixth season, which began filming a week later.</p><p>On March 18, 2020, TV Tonight confirmed production of the second part of the eighth and final season was suspended due to the coronavirus outbreak. The 10-episode first part of eighth season is still scheduled to air from July 2020.</p><p>Filming for the second part of the eighth and final season was completed on 4 September 2020.</p><h4>Theme song</h4><p>The original Wentworth theme music was composed by rock musician Richard Pleasance for the show's instrumental opening theme to the first season. In season two, a new variant of the theme was composed with the introduction of lyrics comprising the theme song \"You Don't Know Me\", performed by Pleasantville, with the vocals supplied by Pleasance's wife Michelle. An orchestrated instrumental version, with differs from the opening theme, served as the ending theme throughout the show's run. For the eight season, a new updated variant of the original instrumental theme music, along with a new end theme will be introduced, while the lyrics will be dropped entirely.</p><h4>Direction</h4><p>A number of directors worked on the series over the eight seasons, with Kevin Carlin undertaking the direction of 32 episodes. Other directors included Steve Jodrell, Dee McLachlan and Beck Cole.</p><br/><h3>Release</h3><h4>Broadcast</h4><p>Wentworth has been sold to more than 90 countries. On 2 April 2013, it was confirmed that TVNZ had signed a deal to broadcast Wentworth in New Zealand. Later that month, it was announced that Wentworth would be broadcast on Channel 5 in the UK. The head of acquisitions for the channel, Kate Keenan, commented \"Wentworth will be a great addition to Channel 5's drama output this autumn. This compelling cast of female characters packs an emotional punch and will appeal to the Channel 5 viewers who love our range of crime output from dramas to factual series.\"</p><p>A trailer for the series began airing on the channel and its website in August 2013 and premiered on Channel 5 on 28 August. Channel 5 also re-titled the show, Wentworth Prison. The second season began on Channel 5 on 3 September 2014 and season Three, which commenced broadcast on 22 July 2015, concluded with a two-hour season finale which consisted of episodes 11 and 12 of the season on 30 September 2015. Season four of Wentworth premiered on Channel 5 on 27 June 2016. In July, following declining ratings, the series was moved from its Monday night timeslot on Channel 5 to Tuesdays on sister channel 5Star. Season 5 premiered on 5Star on 23 May 2017. Season 6 of Wentworth premiered on 5Star on 23 June 2018, just four days following the Australian premiere; however, the series was moved to Saturday nights at 10:00 pm. The seventh season premiered on 8 June 2019 in the same Saturday night timeslot as the previous season. The eighth season will premiere on 5 August 2020 in a Wednesday night 10:00 pm timeslot. The second part of the season was scheduled to premiere on the same day as Australia, 24 August 2021, on 5STAR in the UK.</p><p>The series premiered in the Republic of Ireland broadcasting as Wentworth on TV3 from June 2014. Season 2 premiered on TV3 on 15 January 2015. In Canada the first two seasons broadcast on Aboriginal Peoples Television Network in late 2015.</p><p>Although the series has a strong fan base in many countries, Angela Perez of Australia Network News said, in 2016, that Foxtel was considering cancelling the show due to audiences viewing new episodes via pirate websites following the Australian premiere. Foxtel stated that the piracy is \"a serious problem in terms of recouping money to help pay for future seasons\".</p><p>ABC 1 started broadcasting Wentworth from season 1 in April 2018, with repeats being aired through ABC Iview.</p><h4>Streaming</h4><p>In December 2014, Wentworth first premiered on Netflix in the United States and added seasons one and two to its streaming service. In April 2016 the third season was released to US audiences via the platform. Season 4 was released on Netflix in July 2016, season 5 in June 2017, season 6 in September 2018, season 7 in July 2018, part one of season 8 in September 2020 and part two of season 8 in October 2021. The show features on the “50 Best TV Shows on Netflix” list according to Netflix Life. Seasons one to three are available to view via Amazon Video in the U.S.</p><p>In the United Kingdom, all nine seasons are available for streaming on Amazon Prime Video, while additional services include Google Play and YouTube.</p><p>In Australia, Foxtel Now provides a catch-up service for the Wentworth, while the series is made available for catch-up viewing via TVNZ OnDemand in New Zealand and My5 in the United Kingdom for a limited time following initial broadcast. As of 2021, all eight seasons are available to stream in the UK on Amazon Prime Video, and again via My5 where it holds unlimited streaming rights until 2023.</p><h4>Home media</h4><p>In Australia, Wentworth is available on both DVD and Blu-ray formats. The first season was released via Shock Records, while subsequent seasons have been made available from its current distribution company, Roadshow Entertainment. Under the \"Wentworth Prison\" title, the series was initially available in the United Kingdom from Fremantle Home Entertainment for the first three seasons; after which, the British company Network acquired all rights to release the series. In the UK, the series was only available on DVD, however, it was, for the first time, made available on Blu-ray for its seventh season in 2019, and again for its eighth season in 2020. Additionally, multiple season sets are available on DVD and Blu-ray in Australia, and only on DVD in the UK. As of 2018, the multiple sets are only available on DVD in Australia and are no longer being released in the UK.</p><p>In the United States, Wentworth was released on DVD via Acorn Media. The first three seasons have been made available and it is currently not known if subsequent seasons will follow.</p><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Individual</caption><tbody><tr><th width=\"100\" rowspan=\"2\">Season</th><th colspan=\"4\">Release date</th><th rowspan=\"2\">Features</th></tr><tr><th width=\"200\"><span>Region 1</span> <span style=\"font-size:85%;\">(U.S.)</span></th><th width=\"215\"><span>Region 2</span>/<span class=\"mw-redirect\">B</span> <span style=\"font-size:85%;\">(UK)</span></th><th width=\"215\"><span>Region 2</span>/<span class=\"mw-redirect\">B</span> <span style=\"font-size:85%;\">(DE)</span></th><th width=\"215\"><span>Region 4</span>/<span class=\"mw-redirect\">B</span> <span style=\"font-size:85%;\">(AU)</span></th></tr><tr><td>1</td><td bgcolor=\"#DED\">15 November 2016</td><td bgcolor=\"#DED\">4 November 2013</td><td bgcolor=\"#DEF\">24 February 2017</td><td bgcolor=\"#DEF\">18 November 2013</td><td><style data-mw-deduplicate=\"TemplateStyles:r1127642053\">.mw-parser-output .hidden-begin{box-sizing:border-box;width:100%;padding:5px;border:none;font-size:95%}.mw-parser-output .hidden-title{font-weight:bold;line-height:1.6;text-align:left}.mw-parser-output .hidden-content{text-align:left}</style><div class=\"hidden-begin mw-collapsible mw-collapsed\" style=\"border:none;\"><div class=\"hidden-title\" style=\"text-align:center;\"><div style=\"float: left;\"></div></div><div class=\"hidden-content mw-collapsible-content\" style=\"\"><p><br><b>Distribution</b></p><ul><li><span class=\"mw-redirect\">Acorn Media</span> (Region 1)</li><li><span>Fremantle Home Entertainment</span> (Region 2 UK)</li><li>WVG Medien (Region 2/B Germany)</li><li><span>Shock Records</span> (Region 4/B)</li></ul><p><b>Set details</b> </p><ul><li>3-DVD set (Region 1)</li><li>3-DVD standard set (Region 2)</li><li>4-DVD Deluxe Edition (Region 2)</li><li>5-DVD set (Region 4)</li><li>3-Blu-ray set (Region B)</li><li>1.78:1 aspect ratio</li><li>Dolby Digital 5.1</li><li>DTS-HD Master Audio 5.1 (Blu-ray)</li></ul><p><b>Other releases</b></p><ul><li>Re-released via <span>Roadshow Entertainment</span> on DVD and Blu-ray – 28 September 2016 (Region 4/B)</li></ul><p><b>Rating</b></p><ul><li><span>ACB</span>: MA15+</li><li><span>BBFC</span>: 18</li><li><span>FSK</span>: 16</li></ul></div></div></td></tr><tr><td>2</td><td bgcolor=\"#DED\">7 March 2017</td><td bgcolor=\"#DED\">24 November 2014</td><td bgcolor=\"#DEF\">28 April 2017</td><td bgcolor=\"#DEF\">22 October 2014</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1127642053\"><div class=\"hidden-begin mw-collapsible mw-collapsed\" style=\"border:none;\"><div class=\"hidden-title\" style=\"text-align:center;\"><div style=\"float: left;\"></div></div><div class=\"hidden-content mw-collapsible-content\" style=\"\"><p><br><b>Distribution</b></p><ul><li><span class=\"mw-redirect\">Acorn Media</span> (Region 1)</li><li><span>Fremantle Home Entertainment</span> (Region 2 UK)</li><li>WVG Medien (Region 2/B Germany)</li><li><span>Roadshow Entertainment</span> (Region 4/B)</li></ul><p><b>Set details</b></p><ul><li>4-DVD set (region 1)</li><li>4-DVD Deluxe Edition (Region 2)</li><li>4-DVD set (Region 4)</li><li>3-Blu-ray set (Region B)</li><li>1.78:1 aspect ratio</li><li>Dolby Digital 5.1</li><li>DTS-HD Master Audio 5.1 (Blu-ray)</li></ul><p><b>Rating</b></p><ul><li><span>ACB</span>: MA15+</li><li><span>BBFC</span>: 18</li><li><span>FSK</span>: 16</li></ul></div></div> </td></tr><tr><td>3</td><td bgcolor=\"#DED\">6 June 2017</td><td bgcolor=\"#DED\">12 October 2015</td><td bgcolor=\"#DEF\">30 June 2017</td><td bgcolor=\"#DEF\">14 October 2015</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1127642053\"><div class=\"hidden-begin mw-collapsible mw-collapsed\" style=\"border:none;\"><div class=\"hidden-title\" style=\"text-align:center;\"><div style=\"float: left;\"></div></div><div class=\"hidden-content mw-collapsible-content\" style=\"\"><p><br><b>Distribution</b></p><ul><li><span class=\"mw-redirect\">Acorn Media</span> (Region 1)</li><li><span>Fremantle Home Entertainment</span> (Region 2 UK)</li><li>WVG Medien (Region 2/B Germany)</li><li><span>Roadshow Entertainment</span> (Region 4/B)</li></ul><p><b>Set details</b></p><ul><li>4-DVD set (Region 2)</li><li>4-DVD set (Region 4)</li><li>3-Blu-ray set (Region B)</li><li>1.78:1 aspect ratio</li><li>Dolby Digital 5.1</li><li>DTS-HD Master Audio 5.1 (Blu-ray)</li></ul><p><b>Rating</b></p><ul><li><span>ACB</span>: MA15+</li><li><span>BBFC</span>: 18</li><li><span>FSK</span>: 16</li></ul></div></div> </td></tr><tr><td>4</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBA</td><td bgcolor=\"#DED\">7 November 2016</td><td bgcolor=\"#DED\">25 March 2018</td><td bgcolor=\"#DEF\">5 October 2016</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1127642053\"><div class=\"hidden-begin mw-collapsible mw-collapsed\" style=\"border:none;\"><div class=\"hidden-title\" style=\"text-align:center;\"><div style=\"float: left;\"></div></div><div class=\"hidden-content mw-collapsible-content\" style=\"\"><p><br><b>Distribution</b></p><ul><li>Network (Region 2 UK)</li><li>WVG Medien (Region 2 Germany)</li><li><span>Roadshow Entertainment</span> (Region 4/B)</li></ul><p><b>Set details</b></p><ul><li>4-DVD set (Region 2)</li><li>4-DVD set (Region 4)</li><li>3-Blu-ray set (Region B)</li><li>1.78:1 aspect ratio</li><li>Dolby Digital 5.1</li><li>DTS-HD Master Audio 5.1 (Blu-ray)</li></ul><p><b>Other releases</b></p><ul><li>Released in Germany via WVG Medien on both DVD-only format – 25 March 2018</li></ul><p><b>Rating</b></p><ul><li><span>ACB</span>: MA15+</li><li><span>BBFC</span>: 18</li><li><span>FSK</span>: 16</li></ul></div></div> </td></tr><tr><td>5</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBA</td><td bgcolor=\"#DED\">9 October 2017</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBA</td><td bgcolor=\"#DEF\">4 October 2017</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1127642053\"><div class=\"hidden-begin mw-collapsible mw-collapsed\" style=\"border:none;\"><div class=\"hidden-title\" style=\"text-align:center;\"><div style=\"float: left;\"></div></div><div class=\"hidden-content mw-collapsible-content\" style=\"\"><p><br><b>Distribution</b></p><ul><li>Network (Region 2 UK)</li><li><span>Roadshow Entertainment</span> (Region 4/B)</li></ul><p><b>Set details</b></p><ul><li>4-DVD set (Region 2)</li><li>4-DVD set (Region 4)</li><li>3-Blu-ray set (Region B)</li><li>1.78:1 aspect ratio</li><li>Dolby Digital 5.1</li><li>DTS-HD Master Audio 5.1 (Blu-ray)</li></ul><p><b>Rating</b></p><ul><li><span>ACB</span>: MA15+</li><li><span>BBFC</span>: 18</li></ul></div></div></td></tr><tr><td>6</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBA</td><td bgcolor=\"#DED\">15 October 2018</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBA</td><td bgcolor=\"#DEF\">3 October 2018</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1127642053\"><div class=\"hidden-begin mw-collapsible mw-collapsed\" style=\"border:none;\"><div class=\"hidden-title\" style=\"text-align:center;\"><div style=\"float: left;\"></div></div><div class=\"hidden-content mw-collapsible-content\" style=\"\"><p><br><b>Distribution</b></p><ul><li>Network (Region 2 UK)</li><li><span>Roadshow Entertainment</span> (Region 4/B)</li></ul><p><b>Set details</b></p><ul><li>4-DVD set (Region 2)</li><li>4-DVD set (Region 4)</li><li>3-Blu-ray set (Region B)</li><li>1.78:1 aspect ratio</li><li>Dolby Digital 5.1</li><li>DTS-HD Master Audio 5.1 (Blu-ray)</li></ul><p><b>Rating</b></p><ul><li><span>ACB</span>: MA15+</li><li><span>BBFC</span>: 18</li></ul></div></div></td></tr><tr><td>7</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBA</td><td bgcolor=\"#DEF\">11 November 2019</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBA</td><td bgcolor=\"#DEF\">2 October 2019</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1127642053\"><div class=\"hidden-begin mw-collapsible mw-collapsed\" style=\"border:none;\"><div class=\"hidden-title\" style=\"text-align:center;\"><div style=\"float: left;\"></div></div><div class=\"hidden-content mw-collapsible-content\" style=\"\"><p><br><b>Distribution</b></p><ul><li>Network (Region 2/B UK)</li><li><span>Roadshow Entertainment</span> (Region 4/B)</li></ul><p><b>Set details</b></p><ul><li>3-DVD set (Region 2 &amp; 4)</li><li>2-Blu-ray set (Region B UK)</li><li>3-Blu-ray set (Region B Australia)</li><li>1.78:1 aspect ratio</li><li>Dolby Digital 5.1</li><li>DTS-HD Master Audio 5.1 (Blu-ray)</li></ul><p><b>Rating</b></p><ul><li><span>ACB</span>: MA15+</li><li><span>BBFC</span>: 18</li></ul></div></div></td></tr><tr><td>8 − <span style=\"font-size:85%;\">Part 1</span></td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBA</td><td bgcolor=\"#DEF\">23 November 2020</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBA</td><td bgcolor=\"#DEF\">25 November 2020</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1127642053\"><div class=\"hidden-begin mw-collapsible mw-collapsed\" style=\"border:none;\"><div class=\"hidden-title\" style=\"text-align:center;\"><div style=\"float: left;\"></div></div><div class=\"hidden-content mw-collapsible-content\" style=\"\"><p><br><b>Distribution</b></p><ul><li>Network (Region 2/B UK)</li><li><span>Roadshow Entertainment</span> (Region 4/B)</li></ul><p><b>Set details</b></p><ul><li>3-DVD set (Region 2 &amp; 4)</li><li>2-Blu-ray set (Region B UK)</li><li>3-Blu-ray set (Region B Australia)</li><li>1.78:1 aspect ratio</li><li>Dolby Digital 5.1</li><li>DTS-HD Master Audio 5.1 (Blu-ray)</li></ul><p><b>Rating</b></p><ul><li><span>ACB</span>: MA15+</li><li><span>BBFC</span>: 18</li></ul></div></div></td></tr><tr><td>8 − <span style=\"font-size:85%;\">Part 2</span></td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBA</td><td bgcolor=\"#DEF\">22 November 2021</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBA</td><td bgcolor=\"#DEF\">2 February 2022</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1127642053\"><div class=\"hidden-begin mw-collapsible mw-collapsed\" style=\"border:none;\"><div class=\"hidden-title\" style=\"text-align:center;\"><div style=\"float: left;\"></div></div><div class=\"hidden-content mw-collapsible-content\" style=\"\"><p><br></p><ul><li>1.78:1 aspect ratio</li><li>Dolby Digital 5.1</li><li>DTS-HD Master Audio 5.1 (Blu-ray)</li></ul><p><b>Rating</b></p><ul><li><span>ACB</span>: MA15+</li><li><span>BBFC</span>: TBA</li></ul></div></div></td></tr></tbody></table><table class=\"table table-responsive table-bordered table-hover w-100\"><caption>Multiple</caption><tbody><tr><th width=\"100\" rowspan=\"2\">Season</th><th colspan=\"3\">Release date</th><th rowspan=\"2\">Features</th></tr><tr><th><span>Region 2</span> <span style=\"font-size:85%;\">(UK)</span></th><th><span>Region 2</span> <span style=\"font-size:85%;\">(DE)</span></th><th><span>Region 4</span>/<span class=\"mw-redirect\">B</span> <span style=\"font-size:85%;\">(AU)</span></th></tr><tr><td>1–2</td><td bgcolor=\"#DED\">24 November 2014</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">No release</td><td bgcolor=\"#DEF\">22 October 2014</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1127642053\"><div class=\"hidden-begin mw-collapsible mw-collapsed\" style=\"border:none;\"><div class=\"hidden-title\" style=\"text-align:center;\"><div style=\"float: left;\"></div></div><div class=\"hidden-content mw-collapsible-content\" style=\"\"><p><br><b>Distribution</b></p><ul><li><span>Fremantle Home Entertainment</span> distribution (Region 2)</li><li><span>Roadshow Entertainment</span> distribution (Region 4/B)</li></ul><p><b>Set details</b></p><ul><li>8-DVD set (Region 2)</li><li>9-DVD set (Region 4)</li><li>6-Blu-ray set (Region B)</li></ul><p><span style=\"font-size:85%;\">(See individual releases for additional information)</span><b>Rating</b></p><ul><li><span>ACB</span>: MA15+</li><li><span>BBFC</span>: 18</li></ul></div></div></td></tr><tr><td>1–3</td><td bgcolor=\"#DED\">12 October 2015</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">No release</td><td bgcolor=\"#DEF\">14 October 2015</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1127642053\"><div class=\"hidden-begin mw-collapsible mw-collapsed\" style=\"border:none;\"><div class=\"hidden-title\" style=\"text-align:center;\"><div style=\"float: left;\"></div></div><div class=\"hidden-content mw-collapsible-content\" style=\"\"><p><br><b>Distribution</b></p><ul><li><span>Fremantle Home Entertainment</span> distribution (Region 2)</li><li><span>Roadshow Entertainment</span> distribution (Region 4/B)</li></ul><p><b>Set details</b></p><ul><li>12-DVD set (Region 2)</li><li>13-DVD set (Region 4)</li><li>9-Blu-ray set (Region B)</li></ul><p><span style=\"font-size:85%;\">(See individual releases for additional information)</span><b>Rating</b></p><ul><li><span>ACB</span>: MA15+</li><li><span>BBFC</span>: 18</li></ul></div></div></td></tr><tr><td>1–4</td><td bgcolor=\"#DED\">7 November 2016</td><td bgcolor=\"#DED\">11 December 2020</td><td bgcolor=\"#DEF\">5 October 2016</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1127642053\"><div class=\"hidden-begin mw-collapsible mw-collapsed\" style=\"border:none;\"><div class=\"hidden-title\" style=\"text-align:center;\"><div style=\"float: left;\"></div></div><div class=\"hidden-content mw-collapsible-content\" style=\"\"><p><br><b>Distribution</b></p><ul><li>Network (Region 2)</li><li>WVG Medien (Region 2/B Germany)</li><li><span>Roadshow Entertainment</span> distribution (Region 4/B)</li></ul><p><b>Set details</b></p><ul><li>16-DVD set (Region 2)</li><li>15-DVD set (Region 2 Germany)</li><li>17-DVD set (Region 4)</li><li>12-Blu-ray set (Region B)</li></ul><p><span style=\"font-size:85%;\">(See individual releases for additional information)</span><b>Rating</b></p><ul><li><span>ACB</span>: MA15+</li><li><span>BBFC</span>: 18</li><li><span>FSK</span>: 16</li></ul></div></div></td></tr><tr><td>1–5</td><td bgcolor=\"#DED\">9 October 2017</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">No release</td><td bgcolor=\"#DEF\">4 October 2017</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1127642053\"><div class=\"hidden-begin mw-collapsible mw-collapsed\" style=\"border:none;\"><div class=\"hidden-title\" style=\"text-align:center;\"><div style=\"float: left;\"></div></div><div class=\"hidden-content mw-collapsible-content\" style=\"\"><p><br><b>Distribution</b></p><ul><li>Network (Region 2)</li><li><span>Roadshow Entertainment</span> (Region 4/B)</li></ul><p><b>Set details</b></p><ul><li>20-DVD set (Region 2)</li><li>21-DVD set (Region 4)</li><li>15-Blu-ray set (Region B)</li></ul><p><span style=\"font-size:85%;\">(See individual releases for additional information)</span><b>Rating</b></p><ul><li><span>ACB</span>: MA15+</li><li><span>BBFC</span>: 18</li></ul></div></div></td></tr><tr><td>1–6</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">No release</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">No release</td><td bgcolor=\"#DED\">3 October 2018</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1127642053\"><div class=\"hidden-begin mw-collapsible mw-collapsed\" style=\"border:none;\"><div class=\"hidden-title\" style=\"text-align:center;\"><div style=\"float: left;\"></div></div><div class=\"hidden-content mw-collapsible-content\" style=\"\"><p><br><b>Distribution</b></p><ul><li><span>Roadshow Entertainment</span> (Region 4/B)</li></ul><p><b>Set details</b></p><ul><li>25-DVD set (Region 4)</li></ul><p><span style=\"font-size:85%;\">(See individual releases for additional information)</span><b>Rating</b></p><ul><li><span>ACB</span>: MA15+</li></ul><p><span style=\"font-size:85%;\">(See individual releases for additional information)</span><b>Rating</b></p><ul><li><span>ACB</span>: MA15+</li></ul></div></div></td></tr><tr><td>1–7</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">No release</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">No release</td><td bgcolor=\"#DED\">2 October 2019</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1127642053\"><div class=\"hidden-begin mw-collapsible mw-collapsed\" style=\"border:none;\"><div class=\"hidden-title\" style=\"text-align:center;\"><div style=\"float: left;\"></div></div><div class=\"hidden-content mw-collapsible-content\" style=\"\"><p><br><b>Distribution</b></p><ul><li><span>Roadshow Entertainment</span> (Region 4/B)</li></ul><p><b>Set details</b></p><ul><li>28-DVD set (Region 4)</li></ul><p><span style=\"font-size:85%;\">(See individual releases for additional information)</span><b>Rating</b></p><ul><li><span>ACB</span>: MA15+</li></ul></div></div></td></tr><tr><td>1–8 <span style=\"font-size:85%;\">(complete)</span></td><td bgcolor=\"#DED\">22 November 2021</td><td data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">TBA</td><td bgcolor=\"#DED\">2 February 2022</td><td><link rel=\"mw-deduplicated-inline-style\" href=\"mw-data:TemplateStyles:r1127642053\"><div class=\"hidden-begin mw-collapsible mw-collapsed\" style=\"border:none;\"><div class=\"hidden-title\" style=\"text-align:center;\"><div style=\"float: left;\"></div></div><div class=\"hidden-content mw-collapsible-content\" style=\"\"><p><br><b>Distribution</b></p><ul><li>Network (Region 2)</li></ul><p><b>Set details</b></p><ul><li>33-DVD set (Region 2)</li></ul><p><span style=\"font-size:85%;\">(See individual releases for additional information)</span></p></div></div> </td></tr></tbody></table><br/><h3>Reception</h3><p>The show has received critical acclaim throughout its run. Following a screening of the pilot episode for the media in February 2013, Ben Pobjie from The Age called Wentworth \"a triumph\". He praised the writing and the cast, saying \"So rarely in Australian TV do we see well-written characters collide with dead-on casting and tense, atmospheric direction as they have here.\" He added that Wentworth is \"a powerful, almost cinematic drama\" with its own identity, that incorporates \"echoes\" of the original Prisoner series. Holly Byrnes, writing for the Herald Sun, quipped \"this brilliant retelling picks up where the pioneering series left off and then takes the kind of shocking plot detours contemporary TV viewers would expect from award-winning US dramas like Breaking Bad or Sons of Anarchy.\" Byrnes also praised the cast's performances, particularly Cormack.</p><p>Following its North American debut the critics drew comparisons with US prison dramedy Orange Is the New Black, though Liz Raftery of TV Guide said she believed the show was more gritty and did not \"sugarcoat\" prison life. They branded it \"edge-of-your-seat television\" and singled out Sue 'Boomer' Jenkins as one of the show's standout characters and reasons to watch. Margaret Lyons from New York magazine called it a \"ruthlessly dark drama\" similar to Breaking Bad, a comparison which TV Guide's critics also made. Lyons added that Wentworth's careful plotting of storylines gave meaningful payoffs and triumphed into making it a \"smart and competent\" series.</p><p>Gerard O'Donovan from The Daily Telegraph opined that the show has a cast of \"fabulously strong, variably humane female characters.\" They believed it did not try to appeal to \"mainstream tastes\", adding \"the series sticks more closely to its violent, soapy, sexploitation Prisoner: Cell Block H roots than is strictly necessary in 2016.\" O'Donovan branded it a rare example of fictional work portraying lesbianism as \"not only normal, but the norm.\" He concluded the show depicts a world in which \"women hold virtually all the power, albeit to no obviously edifying ends.\" Matt Baylis from the Daily Express criticised the show for not being original and having a \"mandatory number of unnecessary scenes\". They preferred the original series Prisoner and accused Wentworth of being everything the original was not.</p><p>The first episode of Wentworth attracted 244,000 viewers, making it the most watched Australian drama series premiere in Foxtel history. The UK premiere of the show attracted 1.67 million viewers, a 10.3% share of the audience for the 10pm time slot.</p><h4>Ratings</h4><table class=\"table table-responsive table-bordered table-hover w-100\"><caption><style data-mw-deduplicate=\"TemplateStyles:r1152813436\">.mw-parser-output .sr-only{border:0;clip:rect(0,0,0,0);clip-path:polygon(0px 0px,0px 0px,0px 0px);height:1px;margin:-1px;overflow:hidden;padding:0;position:absolute;width:1px;white-space:nowrap}</style><span class=\"sr-only\">Viewership and ratings per season of <i>Wentworth</i></span></caption><tbody><tr><th scope=\"col\" rowspan=\"2\">Season</th><th scope=\"col\" rowspan=\"2\">Timeslot (<span class=\"mw-redirect\">Australian</span>)</th><th scope=\"col\" rowspan=\"2\">Episodes</th><th scope=\"col\" colspan=\"2\">First aired</th><th scope=\"col\" colspan=\"2\">Last aired</th><th scope=\"col\" rowspan=\"2\">Viewership<br>rank</th><th scope=\"col\" rowspan=\"2\"><abbr title=\"Average\">Avg.</abbr> viewers<br>(thousands)</th></tr><tr><th scope=\"col\">Date</th><th scope=\"col\">Viewers<br>(thousands)</th><th scope=\"col\">Date</th><th scope=\"col\">Viewers<br>(thousands)</th></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>1</span></th><td rowspan=\"1\">Wednesday 8:30 pm</td><td>10</td><td>1 May 2013</td><td>244</td><td>3 July 2013</td><td>125</td><td rowspan=\"1\">3</td><td rowspan=\"1\">114</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>2</span></th><td rowspan=\"8\">Tuesday 8:30 pm</td><td>12</td><td>20 May 2014</td><td>75</td><td>5 August 2014</td><td>103</td><td rowspan=\"1\">2</td><td rowspan=\"1\">84</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>3</span></th><td>12</td><td>7 April 2015</td><td>100</td><td>23 June 2015</td><td>113</td><td rowspan=\"1\">1</td><td rowspan=\"1\">107</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>4</span></th><td>12</td><td>10 May 2016</td><td>140</td><td>26 July 2016</td><td>95</td><td rowspan=\"1\">2</td><td rowspan=\"1\">107</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>5</span></th><td>12</td><td>4 April 2017</td><td>101</td><td>20 June 2017</td><td>119</td><td rowspan=\"1\">2</td><td rowspan=\"1\">87</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>6</span></th><td>12</td><td>19 June 2018</td><td>101</td><td>4 September 2018</td><td>102</td><td rowspan=\"1\">2</td><td rowspan=\"1\">90</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>7</span></th><td>10</td><td>28 May 2019</td><td>89</td><td>30 July 2019</td><td>110</td><td rowspan=\"1\">2</td><td rowspan=\"1\">92</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>8 <small>(A)</small></span></th><td>10</td><td>28 July 2020</td><td>107</td><td>29 September 2020</td><td>65</td><td rowspan=\"1\">5</td><td rowspan=\"1\">67</td></tr><tr><th scope=\"row\" style=\"text-align:center;\"><span>8 <small>(B)</small></span></th><td>10</td><td>24 August 2021</td><td>55</td><td>26 October 2021</td><td>73</td><td rowspan=\"1\">4</td><td rowspan=\"1\">61</td></tr></tbody></table><h4>Accolades</h4><p>Wentworth has received several awards and nominations since its debut in 2013. The series has received 24 Logie Award nominations, winning seven in total, in which Danielle Cormack, Celia Ireland and Pamela Rabe have been recipients respectively, while the show has won the award for Most Outstanding Drama Series in 2015, 2018 and 2019 respectively, and for Most Popular Drama Program in 2018.</p><p>The shows has also received nominations and wins from the AACTA Awards, the ASTRA Awards, Australian Directors Guild Awards, and Australian Writers Guild Awards, while additional nominations have come from the Australian Screen Editors and the Equity Awards.</p><br/><h3>Adaptations</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th>Country</th><th>Local title</th><th>Network</th><th>Seasons</th><th>Episodes</th><th>Original release</th></tr><tr><td><span>Netherlands</span></td><td><i><span>Celblok H</span></i></td><td><span>SBS6</span></td><td>4</td><td>46</td><td>3 March 2014 - 27 March 2017</td></tr><tr><td><span>Germany</span></td><td><i><span class=\"extiw\">Block B – Unter Arrest</span></i></td><td><span class=\"mw-redirect\">RTL</span></td><td>1</td><td>10</td><td>12 March - 30 April 2015</td></tr><tr><td><span>Belgium</span></td><td><i><span class=\"new\">Gent-West</span></i></td><td><span class=\"mw-redirect\">VIER</span>/<span class=\"mw-redirect\">Telenet</span></td><td>2</td><td>22</td><td>7 February 2018 - 19 April 2019</td></tr><tr><td><span>Turkey</span></td><td><i><span class=\"new\">Avlu</span></i></td><td><span>Star TV</span></td><td>3</td><td>54</td><td>29 March 2018 - 30 May 2019</td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}