{
  "imDbId": "tt2356777",
  "title": "True Detective",
  "fullTitle": "True Detective (TV Series 2014– )",
  "type": "TVSeries",
  "year": "2014",
  "items": [
    {
      "username": "A_Different_Drummer",
      "userUrl": "https://www.imdb.com/user/ur44112735",
      "reviewLink": "https://www.imdb.com/review/rw3189635",
      "warningSpoilers": false,
      "date": "23 February 2015",
      "rate": "10",
      "helpful": "375 out of 394 found this helpful.",
      "title": "Matthew McConaughey OWNS this gem!",
      "content": "If you want to skip this review just jump to the IMDb list of awards and nominations, and you're done.If you want the skinny, let me say this is one of the most perfect dramas ever to grace your flat screen.Harrelson, you need to understand, is no slouch. He does crazy better than crazy people. And he usually steals any scene not nailed down.But Matthew McConaughey operates at such a level here -- not to mention the astonishing makeup which makes him appear to be playing his own father -- that he walks off with this production. Mesmerizing.Everyone is pitch perfect, which I believe explains the casting awards. Even Michelle Monaghan, usually known for getting by on her amazing looks, does more acting her than anytime in her career((Designated \"IMDb Top Reviewer.\" Please check out my list \"167+ Nearly-Perfect Movies (with the occasional Anime or TV miniseries) you can/should see again and again (1932 to the present))"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8577273",
      "warningSpoilers": false,
      "date": "30 September 2022",
      "rate": "9",
      "helpful": "78 out of 79 found this helpful.",
      "title": "Season one is brilliant!",
      "content": "The first season of True Detective is among the best television I've ever seen. Just read through the reviews to see how loved that first season was. This show is an anthology series and every season is different in quality. Season 1 is BY FAR the best and again some of the best tv of all-time, Season 2 was not good despite a great cast and Season 3 was back to be watchable again. Now about that first season...it sucks you into the story from the beginning of the first episode and holds onto you throughout the season until that phenomenal ending. Matthew McConaughey and Woody Harrelson are so amazing in this that you forget that they're A-list actors and actually become the characters they are playing. Both of their performances are as good as anything you'll see from a television show. They're about to start filming season 4 and it should be out some time in late 2023. If you haven't seen this series yet then make time as soon as you can (except you can skip Season 2)."
    },
    {
      "username": "gogoschka-1",
      "userUrl": "https://www.imdb.com/user/ur15794099",
      "reviewLink": "https://www.imdb.com/review/rw2940872",
      "warningSpoilers": false,
      "date": "13 January 2014",
      "rate": "10",
      "helpful": "990 out of 1,095 found this helpful.",
      "title": "Dark, brooding cinema - outstanding, but probably not for action fans",
      "content": "Right when the opening credits start and you hear that morbidly beautiful song 'Far From Any Road' by 'The Handsome Family', you know that this isn't going to be your usual cop show. Now, if you're more into action films, avoid this at all costs - but if you like amazing performances and dark, brooding cinema peppered with some black humour and a slight psychedelic touch, you're going to love this. The atmosphere and the southern ambiance of this show are so rich and the cinematography is so beautiful, I can hardly think of anything in recent TV-history that compares to this. To make a musical analogy: if the crazy, creative energy of 'Breaking Bad' felt like 'Led Zeppelin', this feels more like 'The Doors'. The slow, bluesy, hypnotic pulse of this show draws you in and hooks you - and then it doesn't let go. By the way, the original music is also excellent (T-Bone Burnett) and fits the mood perfectly. As far as the actors are concerned, there's nothing but great performances. Even the smaller parts are perfectly cast and the two leads: wow, just - wow! Harrelson (freshly returned from 'The Hunger Games'), plays the \"normal\", more down to earth character, while McConaughey (still marked by his own personal hunger games) nails the part of his slightly mad, highly intelligent but nihilistic and severely depressed partner. Watching them play off each other (again, after 'Edtv' and 'Surfer, Dude') while their conflicted - and conflicting - characters try to solve a ritual murder is so captivating (and so much fun) I honestly don't care that much if they are ever going to solve that crime.So for the moment, I'm giving this 10 stars (I can still take back a few if it all goes downhill from here), because in my opinion, there wasn't a single note out of key so far. The writing is top notch, and if the creative team behind this can keep it up, this could turn out to be HBO's next 'Wire' in terms of quality. Cary Fukunaga ('Sin Nombre','Jane Eyre'), who will hopefully one day adapt Stephen King's 'It', proves once more that he's a very accomplished director and a talent to look out for in the future. My verdict: if you like a well told, character driven story (that might lead you to some very dark places) and if you're not put off by a rather considerate pace, I can't recommend this show enough - this is some great television.Favorite films: IMDb.com/list/mkjOKvqlSBs/Lesser-Known Masterpieces: imdb.com/list/ls070242495/Favorite Low-Budget and B-Movies: imdb.com/list/ls054808375/Favorite TV-Shows reviewed: imdb.com/list/ls075552387/"
    },
    {
      "username": "ricochet93-369-308802",
      "userUrl": "https://www.imdb.com/user/ur33693994",
      "reviewLink": "https://www.imdb.com/review/rw4560521",
      "warningSpoilers": false,
      "date": "4 January 2019",
      "rate": "10",
      "helpful": "355 out of 387 found this helpful.",
      "title": "Season One is Perfection",
      "content": "Season one is a beautiful thing.Then Vince Vaughan happened and the less said about that the better."
    },
    {
      "username": "Tweekums",
      "userUrl": "https://www.imdb.com/user/ur13977076",
      "reviewLink": "https://www.imdb.com/review/rw5571934",
      "warningSpoilers": false,
      "date": "23 March 2020",
      "rate": "10",
      "helpful": "46 out of 49 found this helpful.",
      "title": "Thoughts on Season One",
      "content": "This crime drama is centred on two Louisiana detectives, Marty Hart and Rust Cohle and their investigation of a particularly disturbing murder. A woman's naked body was found at a remote location; posed with a stag's antlers on her head and with strange 'stick sculptures' nearby. This crime took place in 1995 and we are shown it in flashback as other officers interview them about the case in 2012. Inevitably as the season progresses the plot deepens, more potential victims emerge along with various suspects.If you like your crime drama to be fast paced and action packed then this might not be for you; it moves at a fairly slow pace. This doesn't mean it is boring though; quite the opposite. I was gripped from start to finish. While there isn't a lot of action there is some and occasionally there are sudden moments of shocking violence. As much as the story is about solving a crime it is about its effects on our two protagonists; Woody Harrelson and Matthew McConaughey really impress in these roles. The latter is particularly good as Cohle is so different in 1995 and 2012. The series has a great look with the Louisiana scenery almost being another character... it looks as if nature is just waiting to take over. As the story approaches its conclusion it employs tropes one might expect in a horror film leading me to wonder about the safety of Marty and Rust. Overall I'd definitely recommend watching this; this season has a proper conclusion so it can be enjoyed on its own; on the strength of this I'll watch further seasons given the chance."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw6631181",
      "warningSpoilers": false,
      "date": "24 February 2021",
      "rate": "9",
      "helpful": "62 out of 69 found this helpful.",
      "title": "S1 was great, S2 bad despite a great cast, S3 was worth watching!",
      "content": "True Detective was an absolutely incredible crime series! Like most others here have already said...this is mostly based off Season 1. Season 2, even though it had an amazing cast, was not that good at all & Season 3 was better and absolutely worth watching! There has never been nothing like Season 1 in the history of TV. I'm not saying it's the best show I've ever seen but it's on the list!"
    },
    {
      "username": "grantss",
      "userUrl": "https://www.imdb.com/user/ur2860723",
      "reviewLink": "https://www.imdb.com/review/rw3294419",
      "warningSpoilers": false,
      "date": "10 August 2015",
      "rate": "7",
      "helpful": "46 out of 52 found this helpful.",
      "title": "Great first season, but lacklustre since then",
      "content": "(Review updated after Season 3).A murder-mystery series with each season set in a different location, with different characters, and independent from the others.Season 1 of True Detective was great. A slow-burning, incredibly intriguing crime-drama. Viewers were fed pieces of information regarding the crime, complete with a few red herrings and sudden bursts of action. All this was interspersed with the private lives and dramas of the two detectives (played superbly by Matthew McConoughey and Woody Harrelson). Plus, the finale was an incredible adrenaline rush of action. This all made for a highly intriguing, engaging and entertaining season.In Season 2 creator Nic Pizzolatto tried the same thing: a slow-burn, with a rush of action towards the end. However, the first half of the season is too unfocused to be engaging. You have whole 50- minute episodes where you feel you really only got maybe 10 minutes of entertainment or information out of it. So many scenes with people staring blankly at each other for minutes on end...I understand what he was trying to do: develop the characters, give us small pieces of information, build the background and intrigue. However, this time the story develops too slowly to maintain, or even develop, any engagement with the characters.By the time you reach the climax of the season, you are so disengaged you hardly care who the characters are. e.g. Someone dies. You're pretty sure you're supposed to know the character and their relevance to the story but you were zoned out whenever their character was mentioned or had screen time. Thus, a piece of the puzzle dissolves.All this leads to a massive dissipation of intrigue, and watching is just a chore - you're in this far, might as well see it through.Add in some terrible miscasting and performances - Vince Vaughan should stick to B-grade comedies and Taylor Kitsch should stick to whatever he does best (this isn't it) - and a damp squib of a finale and Season 2 is very disappointing.Season 3, released 3½ years after Season 2, initially looked very promising and had the potential to see a return to the form of Season 1. Puzzling mystery and a 3-time period storyline made for intriguing and engaging drama.However, the mystery soon dissipated as the 3-time period formula gave away much of where the mystery was heading. Rather than being a murder mystery it became a human/relationship drama, and not a very interesting one. Nic Pizzolatto did his best to recreate the dark, brooding atmosphere that permeated Season 1 but it can't hide the lack of genuine intrigue or of character engagement. Good ending though.Season ratings: S1 - 9/10, S2 - 5/10, S3 - 6/10."
    },
    {
      "username": "redroominparis",
      "userUrl": "https://www.imdb.com/user/ur19956326",
      "reviewLink": "https://www.imdb.com/review/rw4583266",
      "warningSpoilers": true,
      "date": "14 January 2019",
      "rate": "8",
      "helpful": "57 out of 62 found this helpful.",
      "title": "Revisits season 1",
      "content": "Slow paced but well acted, True Detective season 3 returns to its roots. Incorporating a plot point touched on in season 1, the series becomes familiar in its surroundings as two back country detectives attempt to locate missing children in a town where truth lies below the surface. The Cinematography and Score are fantastic, making for and eagerly anticipated re-do that erases the inadequacy of season 2."
    },
    {
      "username": "normaxjean-23753",
      "userUrl": "https://www.imdb.com/user/ur153280076",
      "reviewLink": "https://www.imdb.com/review/rw8352306",
      "warningSpoilers": false,
      "date": "20 July 2022",
      "rate": "10",
      "helpful": "26 out of 26 found this helpful.",
      "title": "Season 1 = Masterpiece",
      "content": "Season 1 still remains the greatest television I've ever seen. McConaughey's best performance to date and Harrelson goes toe-to-toe with him. Everything from the acting (including every minor character) to the writing to the cinematography to the score is phenomenal."
    },
    {
      "username": "bsamad-50088",
      "userUrl": "https://www.imdb.com/user/ur92838604",
      "reviewLink": "https://www.imdb.com/review/rw5273211",
      "warningSpoilers": false,
      "date": "22 November 2019",
      "rate": "9",
      "helpful": "18 out of 19 found this helpful.",
      "title": "Truly amazing!!",
      "content": "I only rated 9 because i didn't like season 2 that much , but season 1 and 3 are just a masterpieces !! Specially the acting of Matthew and Ali , the story and the script , the atmosphere they created in this show is attractive ,i fell in love with the show , one of the best i ever seen"
    },
    {
      "username": "sammybeno",
      "userUrl": "https://www.imdb.com/user/ur56852143",
      "reviewLink": "https://www.imdb.com/review/rw6518293",
      "warningSpoilers": false,
      "date": "23 January 2021",
      "rate": "10",
      "helpful": "115 out of 118 found this helpful.",
      "title": "Masterpiece",
      "content": "Season 1 of True Detective may be the best television I've ever seen. Its written brilliantly and has some of the best performances I've ever witnessed with Woody and Matthew. They were robbed by not winning an Emmy or Golden Globe."
    },
    {
      "username": "ladnerlowery",
      "userUrl": "https://www.imdb.com/user/ur124391906",
      "reviewLink": "https://www.imdb.com/review/rw6759547",
      "warningSpoilers": false,
      "date": "30 March 2021",
      "rate": "10",
      "helpful": "40 out of 41 found this helpful.",
      "title": "Does a series ever get any better than TD Season 1?",
      "content": "I watched season 1 again last week and I am still in awe of every element of this masterpiece. The pace, the acting, everything is so perfect it is mindblowing. I remember the excitement of waiting for season 2, which evaporated after episode 1. Vince Vaughan seems to always carry the can for this seasons issues but they were far larger than one man. I was astounded how bad the second was to the first. The third season, I watched it, I can't remember it. Other than to say it was better than the stinker in the middle."
    },
    {
      "username": "mlynch5187",
      "userUrl": "https://www.imdb.com/user/ur50353664",
      "reviewLink": "https://www.imdb.com/review/rw3335896",
      "warningSpoilers": false,
      "date": "15 October 2015",
      "rate": "7",
      "helpful": "197 out of 241 found this helpful.",
      "title": "Season 1: A Masterpiece ..... Season 2: A Disaster",
      "content": "Last spring (2014) while surfing IMDb for a new show to watch I came across True Detective, a show that had received rave reviews across the board. I'm not a particular fan of crime mysteries, but I figured I'd give the show a shot. After all, IMDb ratings had been pretty reliable in giving me an idea of good a show would be. I thoroughly enjoyed Season 1. In fact, I'd say it's one of the best pieces of television I've ever seen. Yes, one of those rare masterpieces that stick out from the usual assembly of cheesy sitcoms and thrillers.Season 1 verdict: If I had to give only season 1 a rating, I would give it a 9/10 with no hesitation, and possibly even a 10/10. The show was everything I had hoped for and more.Needless to say, I was excited for season 2. I waited for the entire show to air so that I could binge watch it without having to wait a week between episodes. I eagerly turned on the first episode of season 2, but as the episode dragged on it became apparent that this episode was a real let down. It was a series of of plots that all seemed to have no relation to each other. It was hard to even follow what was going on. \"Hey, that's okay\" I said to myself. I figured it was just a necessary lackluster episode that would set the stage for all of the glory of True Detective that I knew and loved. Instead, I continued to be disappointed by episode after episode. Sadly, it became very clear that Season 2 sucks. I don't use that word too often, unless it's warranted, but in this case it surely is. During the middle of episode 4 of Season 2 I just turned it off. It was so poor that I couldn't even watch it anymore. I came back the next morning hoping to try again and got the same result. Season 2 is basically unwatchable.Most of Season 2 involves a few seriously depressed brooding alcoholics staring at each other with sad serious faces uttering dark cheesy lines like \"Those moments, they stare back at you, you don't remember them, they remember you\". I mean, come on, really? The whole thing is just cheesy and I lost all interest in the problems of these people. I want to give Vince Vaughn some credit here, because he did some fantastic acting, but that couldn't come close to redeeming this season.Season 2 verdict: Don't even bother with season 2 unless you like being disappointed. It sucks, plain and simple."
    },
    {
      "username": "ksgillihan",
      "userUrl": "https://www.imdb.com/user/ur53713622",
      "reviewLink": "https://www.imdb.com/review/rw8856323",
      "warningSpoilers": false,
      "date": "6 February 2023",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "Season 1 is as close to perfect as you can get",
      "content": "Before season one aired I had never seen anything so compelling in storytelling or filmmaking in my entire life. The following two seasons are watchable and well-made but nowhere near as phenomenal as season one. This is a paint-by-numbers example of how to do a gripping and unique story. There is nothing negative I can say about season one. Everything is top-notch. The acting, the story, the camera work, the music, the mood, everything.We see through the relationship of the two main characters a complicated and sometimes volatile relationship. They aren't enemies but they aren't exactly friends either. The dialogues they share together are some of the most interesting filmmaking I've ever seen. They aren't good men or bad men either. They exist in the grey area. They are just good enough to not be bad but bad enough to not be good. They are stark contrasts of one another as well. The relationship Rust and Marty have evolves constantly throughout the series and is the highlight of the entire show. I cannot recommend this season enough."
    },
    {
      "username": "prabhat_kataria",
      "userUrl": "https://www.imdb.com/user/ur37731726",
      "reviewLink": "https://www.imdb.com/review/rw2940950",
      "warningSpoilers": false,
      "date": "13 January 2014",
      "rate": "10",
      "helpful": "649 out of 760 found this helpful.",
      "title": "Stellar cast , super interesting plot , brilliant direction , well written dialogs....now thats what i call Good Television!",
      "content": "When i first heard about the show , i thought to myself that with a premise and cast like that , what could go wrong with this show? Well there could have been a lot of things. For example the plot may have been overdone or under thought , direction may have been all over the place , but the first episode proved that it was not to be so.The plot looks delicious...yes it does and the neat direction just purely compliments the smooth design of the show. Even though story telling is non linear at times , but it has been managed very well with subtle dialogue and the growing suspense. It does get dark at times but handles all its complications with ease.The casting is clever...very clever. Both Matthew McConaughey and Woody Harrelson are brilliant actors and at the same time have a certain mystery about them that is Perfect for the show. They have a firm grip of their respective characters and seem dissolved in them.This show is NOT just a regular cop drama or a clichéd murder mystery. It is much much more and has already proved so in the first episode. Much is expected from it and the future looks bright for True Detective.UPDATE ( Episode 2-6 ) - Now 6 episodes have gone by and i believe my views have changed a little. The richness of the show in the first couple of episodes completely PALES in comparison to the speed, smoothness and uniqueness in the latter episodes. From the 4th episode is when the show actually picked even more momentum and proved its worth as possibly the greatest thing on television at the moment. McConaughey is truly having the golden period of his career. The future (probable) Academy Award winner (For DBC) is at his freaking best as Rust Cohle. Harrelson is brilliant as the angry and flawed Marty Hart. I liked this show. But now i am addicted to it.With 2 more episodes of the season to go , one can only expect the best from this fast-paced , beautifully crafted show.So far, an obvious 10/10.Final update: ( Episode 7 & 8 )-- Well the series ended last night on a very thoughtful note. Up until the 7th episode, the show had picked up so much speed and given us so much to think about that i was expecting a little too much from the last couple of episodes. Who wasn't.*********** If you haven't seen the series , please Don't read on*********The 7th episode was truly amazing as it set the stage for Rust and Marty's final adventure of the series. There was too much anticipation for the final episode, but did it deliver. Yes and No, depending entirely on how you look at it. There were no unusual shocking twists and there were no unrealistic happenings. It was quiet a daring and a brilliant end to a show that explored beyond any other show's reach. But to be very honest, as a single episode , the finale wont stand out. But as an entire series , i believe we have been treated to one of the best television series ever made. The writing and direction have been top notch. Acting has been flawless. Am gonna miss it.10/10"
    },
    {
      "username": "tomhg38",
      "userUrl": "https://www.imdb.com/user/ur44177098",
      "reviewLink": "https://www.imdb.com/review/rw2940765",
      "warningSpoilers": false,
      "date": "13 January 2014",
      "rate": "",
      "helpful": "386 out of 477 found this helpful.",
      "title": "Another masterfully made HBO classic",
      "content": "This is a show which almost bathes in success before it's begun. With it's cast and their pedigree of work i cant see many people interested in this type of television not seeing it.Regardless the pilot grips you with non-linear suspense driven story telling. Vaguely some kind of serial killer murders young women in a ritualistic manner and our 2 protagonists catch the case. What follows is a tantalising taste of what I'm sure will become one of the most well wrought shows of the year, as is the norm for HBO. Teased with mystery and the promise of a story worth hearing being told in a superb manner, Its hard not to fully recommend every mature adult checking this show out.The only demographic that wont be thoroughly satisfied with this work are people looking for lighter \"easy watching\" style programs. This isn't an episodic cop show, True Detective is dark and unapologetically twisted."
    },
    {
      "username": "Funkaairo",
      "userUrl": "https://www.imdb.com/user/ur77711277",
      "reviewLink": "https://www.imdb.com/review/rw8873465",
      "warningSpoilers": false,
      "date": "16 February 2023",
      "rate": "10",
      "helpful": "16 out of 16 found this helpful.",
      "title": "Season 1 is a masterpiece",
      "content": "Cohle and Hart play off eachother so amazingly well, and I was stunned by the constant wisdom on humanoids thrown out by Cohle constantly in the first episodes. I've never felt such a deep connection to a characters' thoughts ever and was taken aback by how deeply I could resonate to these thoughts on humanoids.These constant spurts of wisdom sold me on S1 from the first episode. It was amazingly depicted and I had to calm down through the dialogue and replay some bits because there was just so much stuff being said which required processing. I'll return to S1 in a couple of years to understand the wisdom bits deeper, and enjoy this masterfully created piece again.There was not a single dull moment in this series, despite being a slow-burner if that's what you want to call it. I'd say it's similar to mindhunter S1 but they're not really comparable in that way. You'll understand once you see it.Hart and Cohle played their characters ridiculously well and built this incredible depth to their stories and personalities that I have never seen before in TV. It made the series feel extremely mature in a sense that only people with proper understanding of their own emotions could understand the thought processes depicted in the series. Maggie was such a perfect character to make sure these thought processes were fished out. Amazing performance! I really have nothing but praise for S1.Just like Maggie said, Hart did not know what he wanted, and Cohle knew what he wanted. It is such a small line but it says so incredibly much. This world is divided like this and you can see it in all adults of all ages. Some people know who they are and therefore content with themselves, with integrity (just like Cohle) and some people are figuring things out at their own pace, but never really reaching the destination in terms of self actualization (Hart). Maggie was much more similar to Cohle and it was depicted masterfully.Either way I'm just going off on nothing here. Best Series I've watched and I feel like I evolved as a person after S1. Thank you!I'm not mentioning S2 and S3 and will not watch them as other reviews have made it clear I shouldn't. Haha."
    },
    {
      "username": "ericnottelling",
      "userUrl": "https://www.imdb.com/user/ur45421202",
      "reviewLink": "https://www.imdb.com/review/rw2941270",
      "warningSpoilers": false,
      "date": "13 January 2014",
      "rate": "10",
      "helpful": "219 out of 292 found this helpful.",
      "title": "wow",
      "content": "Wow. That is seriously all I can say after watching the first episode. The episode is amazing. Will definitely be tuning in again and so will you. Woody Harrelson and Matthew McConaughey do a great job. The script is very well written and drives the story hard. This show is all about the story. It has the feel of a mini series not a TV show so it will be interesting to see where it goes. But it is one powerful script that is acted out great. This is the first 10/10 I think I have given on IMDb. Once you watch it you will know why. I will be shocked it this show does not win awards. It may be the best show on HBO now and I would say it's up there with orphan black with it's ability to grab your attention and keep you glued."
    },
    {
      "username": "shanghaihorvath",
      "userUrl": "https://www.imdb.com/user/ur120054745",
      "reviewLink": "https://www.imdb.com/review/rw5972963",
      "warningSpoilers": false,
      "date": "7 August 2020",
      "rate": "10",
      "helpful": "140 out of 150 found this helpful.",
      "title": "Only for S1",
      "content": "The first season is an amazing"
    },
    {
      "username": "TheFarscapeProject747",
      "userUrl": "https://www.imdb.com/user/ur26430634",
      "reviewLink": "https://www.imdb.com/review/rw2941970",
      "warningSpoilers": false,
      "date": "14 January 2014",
      "rate": "",
      "helpful": "179 out of 238 found this helpful.",
      "title": "Dark, Gritty, excellent",
      "content": "I don't know why but I can't enter my how many stars review, so I'll just write it here as 10From the opening credits, which seemed like a combo of the credits of 'Six Feet Under\" and \"The Killing\" with a little James Bond\" look all with this ominous song, to the end I think this is going to be something great. It will not be for everyone, I already have seen reviews of people hating on it for not having action and being slow, well this show like many others is going to be a \"Slow Boil\" type of show. For those of you who don't know this story arc and actors/characters will not be continuing after this season, i just read that it will be a total of 8 epiodes with a solid conclusion and than will move on to another story in season 2 making it an anthology season series like American Horror Story. I'm really glad another show has decided to do that format and hope that there will be others in the future"
    },
    {
      "username": "s-50307-95732",
      "userUrl": "https://www.imdb.com/user/ur134739541",
      "reviewLink": "https://www.imdb.com/review/rw8883326",
      "warningSpoilers": false,
      "date": "20 February 2023",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "Until now, I have never seen anything like this series, especially the first season, in the history of television and serial production.100/100",
      "content": "This show is a work of art in every sense, that is, the first season of the series starring Matthew McNahy and Wood Harrelson is an acting class. You can't see the masterpiece of the first season anywhere, in my opinion, its impression on me is better than Shawshank Redemption or even GODFATHER. Also, this series is more in the season of a surprised and infatuated world. Woody Harrelson and Matthew McConaughey should have won the best actor Emmy for this masterful performance. The first season is about the murder of a girl in Louisiana. The story of the first season immerses you so that you don't stop watching it, and it is also very dark and black. Although the second season is very far from the meaning of the story and charm, in my opinion, it is good and watchable and has a significant acting. Well, Mahersha Ali, Steven Dorff and Dasani are more attractive than the previous season, but they could not repeat the popularity of the first season, but overall, this series is a must-watch for everyone, and I am eagerly waiting for season 4 with Jodie Foster."
    },
    {
      "username": "Xenophorm12",
      "userUrl": "https://www.imdb.com/user/ur97086164",
      "reviewLink": "https://www.imdb.com/review/rw6903502",
      "warningSpoilers": false,
      "date": "11 May 2021",
      "rate": "8",
      "helpful": "26 out of 28 found this helpful.",
      "title": "I'm giving 9 for the sake of first season",
      "content": "S1: 10/10 easily, best first season of any series, period!S2: 7/10, plot was too confusing and I couldn't even remember anyone's name even after finishing the season.S3: 8/10, they tried to imitate S1, although they weren't quite successful at least it was better than S2."
    },
    {
      "username": "ben-harbak",
      "userUrl": "https://www.imdb.com/user/ur46695424",
      "reviewLink": "https://www.imdb.com/review/rw6417147",
      "warningSpoilers": false,
      "date": "28 December 2020",
      "rate": "9",
      "helpful": "139 out of 147 found this helpful.",
      "title": "Don't Listen to Me, or Anyone Else",
      "content": "Watch the show and make up your own mind. I've seen too many people regurgitating the same \"SEASON 1 IS AMAZING, SEASON 2 IS THE WORST OF ALL TIME\" junk, and it's simply not true.Fact of the matter is this is an anthology series. Different people, different stories, different feels. If they wanted a show with 3 seasons of Matthew McConaughey and Woody Harrelson, they would have done that.Some detective stories are eerie and disturbing. Some are broody and slow burning. Season 2 is the latter, and all the hate it gets for basically not being exactly like the first season detracts from the performances and character arcs within.There are also a lot of complaints about Vince Vaughn? Aside from some stiff writing, I hardly see the issue. He's got some great scene-chewing moments as a brutal crime boss!I honestly can't believe some publications labeled this as one of the worst seasons of television in 2015. Just goes to show that some people have no clue how to manage their expectations, and this site is no different. Look at what I've said, and now put it up against so many here...it's ridiculous.Like I said: watch it and make up your own mind. I avoided it for 5 years because of this site and I regret it. Season 2 isn't season 1, just like season 3 isn't 1 or 2. If you want the same thing over and over again, watch CSI."
    },
    {
      "username": "bobzmcishl",
      "userUrl": "https://www.imdb.com/user/ur4998475",
      "reviewLink": "https://www.imdb.com/review/rw4688880",
      "warningSpoilers": false,
      "date": "27 February 2019",
      "rate": "6",
      "helpful": "62 out of 82 found this helpful.",
      "title": "Season 3 a Letdown at End",
      "content": "I intensely dislike series that tidy up all the loose ends of a mystery in the last 30 minutes of a series that lasted 8+ hours and that had little to do with almost all of episodes leading up to the grand finale. In most mysteries the cast of characters are identified early on in the series so we the audience can wonder about their guilt or innocence. No such luck here. We are left instead with a drama involving a troubled relationship between one of the lead detectives and his wife which dragged on too long and involved way too many flashbacks which often left the viewer mystified about the timeline of events taking place."
    },
    {
      "username": "muhammadshah-57953",
      "userUrl": "https://www.imdb.com/user/ur142883720",
      "reviewLink": "https://www.imdb.com/review/rw8959063",
      "warningSpoilers": false,
      "date": "29 March 2023",
      "rate": "10",
      "helpful": "11 out of 11 found this helpful.",
      "title": "Season 1 is 10 stars",
      "content": "I haven't seen the last two seasons but I can see by reading few of the reviews that season 1 is the best among the three. Perhaps, I can assure you that, yes! Season 1 is perfection.This is a season anthology series which means that each season has a different story. So, you don't have to watch all three seasons (if you don't want to) but I'll highly recommend watching season 1.Every season has a different cast and a different story. In season 1, two main characters are \"Marty and Rust\" played by Mathew McConaughey and Woody Harrelson, respectively. I reckon that season 1 has the best cast and the best story.So, basically all I wanna say is that if you haven't seen it already, or if you are deciding whether to watch this show or not, then I wanna tell you that season 1 is recommended from my side and I cannot speak for the other two seasons. You might've to read more reviews to know about the other two seasons."
    }
  ],
  "errorMessage": ""
}