{
  "imDbId": "tt2356777",
  "title": "True Detective",
  "fullTitle": "True Detective (TV Series 2014– )",
  "type": "TVSeries",
  "year": "2014",
  "language": "en",
  "titleInLanguage": "True Detective",
  "url": "https://en.wikipedia.org/wiki/True_Detective",
  "plotShort": {
    "plainText": "True Detective is an American anthology crime drama television series created and written by Nic Pizzolatto. The series, broadcast by the premium cable network HBO in the United States, premiered on January 12, 2014. Each season of the series is structured as a self-contained narrative, employing new cast ensembles, and following various sets of characters and settings.\r\nThe first season, starring Matthew McConaughey, Woody Harrelson, Michelle Monaghan, Michael Potts, and Tory Kittles, takes place in Louisiana and follows a pair of Louisiana State Police detectives, and their pursuit of a serial killer with occult links over a 17-year period. The second season aired in 2015, starring Colin Farrell, Rachel McAdams, Taylor Kitsch, Kelly Reilly, and Vince Vaughn, is set in California, and focuses on three detectives from three cooperating police departments and a criminal-turned-businessman as they investigate a series of crimes they believe are linked to the murder of a corrupt politician. The third season aired in 2019, starring Mahershala Ali, Carmen Ejogo, Stephen Dorff, Scoot McNairy, and Ray Fisher, and takes place in the Ozarks over three time periods as a pair of Arkansas State Police detectives investigate a macabre crime involving two missing children.\r\nThe first season received widespread acclaim from critics and earned high ratings for HBO. It was nominated for and won numerous awards and other accolades, chiefly for its acting, cinematography, writing, and direction. Reception to the second season was more divided, although the show maintained high viewership for HBO. The third season received positive reviews, but saw a drop in viewership.\r\nA fourth season situated in Alaska, titled True Detective: Night Country, is set to premiere in 2023. It stars Jodie Foster and Kali Reis, with Issa López and Barry Jenkins producing.",
    "html": "<p>True Detective is an American anthology crime drama television series created and written by Nic Pizzolatto. The series, broadcast by the premium cable network HBO in the United States, premiered on January 12, 2014. Each season of the series is structured as a self-contained narrative, employing new cast ensembles, and following various sets of characters and settings.</p><p>The first season, starring Matthew McConaughey, Woody Harrelson, Michelle Monaghan, Michael Potts, and Tory Kittles, takes place in Louisiana and follows a pair of Louisiana State Police detectives, and their pursuit of a serial killer with occult links over a 17-year period. The second season aired in 2015, starring Colin Farrell, Rachel McAdams, Taylor Kitsch, Kelly Reilly, and Vince Vaughn, is set in California, and focuses on three detectives from three cooperating police departments and a criminal-turned-businessman as they investigate a series of crimes they believe are linked to the murder of a corrupt politician. The third season aired in 2019, starring Mahershala Ali, Carmen Ejogo, Stephen Dorff, Scoot McNairy, and Ray Fisher, and takes place in the Ozarks over three time periods as a pair of Arkansas State Police detectives investigate a macabre crime involving two missing children.</p><p>The first season received widespread acclaim from critics and earned high ratings for HBO. It was nominated for and won numerous awards and other accolades, chiefly for its acting, cinematography, writing, and direction. Reception to the second season was more divided, although the show maintained high viewership for HBO. The third season received positive reviews, but saw a drop in viewership.</p><p>A fourth season situated in Alaska, titled True Detective: Night Country, is set to premiere in 2023. It stars Jodie Foster and Kali Reis, with Issa López and Barry Jenkins producing.</p>"
  },
  "plotFull": {
    "plainText": "True Detective is an American anthology crime drama television series created and written by Nic Pizzolatto. The series, broadcast by the premium cable network HBO in the United States, premiered on January 12, 2014. Each season of the series is structured as a self-contained narrative, employing new cast ensembles, and following various sets of characters and settings.\r\nThe first season, starring Matthew McConaughey, Woody Harrelson, Michelle Monaghan, Michael Potts, and Tory Kittles, takes place in Louisiana and follows a pair of Louisiana State Police detectives, and their pursuit of a serial killer with occult links over a 17-year period. The second season aired in 2015, starring Colin Farrell, Rachel McAdams, Taylor Kitsch, Kelly Reilly, and Vince Vaughn, is set in California, and focuses on three detectives from three cooperating police departments and a criminal-turned-businessman as they investigate a series of crimes they believe are linked to the murder of a corrupt politician. The third season aired in 2019, starring Mahershala Ali, Carmen Ejogo, Stephen Dorff, Scoot McNairy, and Ray Fisher, and takes place in the Ozarks over three time periods as a pair of Arkansas State Police detectives investigate a macabre crime involving two missing children.\r\nThe first season received widespread acclaim from critics and earned high ratings for HBO. It was nominated for and won numerous awards and other accolades, chiefly for its acting, cinematography, writing, and direction. Reception to the second season was more divided, although the show maintained high viewership for HBO. The third season received positive reviews, but saw a drop in viewership.\r\nA fourth season situated in Alaska, titled True Detective: Night Country, is set to premiere in 2023. It stars Jodie Foster and Kali Reis, with Issa López and Barry Jenkins producing.\r\nProduction\r\nDevelopment\r\nBefore developing True Detective, Nic Pizzolatto worked as a literature professor for the University of Chicago, the University of North Carolina at Chapel Hill, and DePauw University. He also delved into fiction writing, having developed a fascination for it as a graduate student at the University of Arkansas. His first published work was the short story collection Between Here and the Yellow Sea, released in 2006. The author published his debut novel, titled Galveston, four years later and around the same time began preparing to branch out into the television industry (earlier attempts were never realized due to lack of capital).\r\nIntended to be Galveston's follow-up, Pizzolatto felt True Detective was more suited to film. Pizzolatto shopped the novel to two TV executives, and, once he secured a deal in May 2010, drafted six screenplays, including the pilot episode (\"The Long Bright Dark\") script, which ran 90 pages. He devoted another script for the series shortly after his departure from The Killing's writing staff in 2011, thanks to the support of Anonymous Content. The final copy, amounting to 500 pages, was written without the aid of writing staff. By this time, Pizzolatto secured a development deal with HBO, and by April 2012, the network commissioned True Detective on an order of eight episodes. Set up as an anthology series, each season will feature a different cast of characters and self-contained narratives in various time periods and locations.\r\nFilming\r\nThe initial location for principal photography of True Detective's first season was Arkansas, but Pizzolatto later opted to film in Louisiana, which was cheaper due to its generous film-tax incentive program. Production lasted 100 consecutive days, and each episode was shot on 35mm film. The crew filmed exterior shots of various constructed sets, including a remote sugarcane field outside of Erath, in addition to real life locations such as Fort Macomb, a nineteenth-century fort located outside of New Orleans.\r\nCalifornia was selected as the setting for True Detective's sophomore season. Producers were urged to avoid filming in Los Angeles and, instead, focus on the more obscure regions of the state to \"capture a certain psycho-sphere ambiance\". Production began in November 2014.\r\nThe third season was filmed at various locations throughout Northwest Arkansas, including Fayetteville, Bentonville, Lincoln, Rogers and Springdale. Filming began in February 2018 and was wrapped in August of the same year.\r\nOpening sequence\r\nLed by creative director Patrick Clair, True Detective's title sequences were developed by a collaborative team consisting of three motion-design studios: Santa Monica-based Elastic, Antibody and Breeder, both based in Australia. For the first season, Clair and his team took a variety of photos of the Louisiana scenery, which became the sequence's backbone. They superimposed these images onto low poly meshes, thanks to the use of various animation and special effects techniques. This was a meticulous process for production, since they wanted to avoid creating a digitized look for the sequence. Once its final cut took form, the team polished it by employing optical glitching and motion distortion technique. True Detective's season one opening theme is \"Far from Any Road\", an alternative country song originally composed by The Handsome Family for their 2003 album Singing Bones. The Sydney Morning Herald included season one's opening sequence in their list of the \"Ten of the Best\" title sequences on television.\r\nClair took a similar approach to creating the title sequence for True Detective's second season. Production used material from a number of photographers, including aerial shots captured by David Maisel. However, unlike season one, season two's title sequence incorporates deep, vivid gold and red color, thereby presenting \"that more complicated view of California\". Leonard Cohen's \"Nevermind\" is the season two opening theme, which is a song from Cohen's 2014 album Popular Problems. The theme song's lyrics change with every episode, incorporating different verses from Cohen's song.\r\nCast and crew\r\nSeason 1\r\nThe first actor to be cast for True Detective was Matthew McConaughey, who acted as Detective Rustin \"Rust\" Cohle. McConaughey came to Pizzolatto's attention for his performance in the 2011 thriller film The Lincoln Lawyer, and was contracted before the series was commissioned by HBO. He and Woody Harrelson were among a pool of candidates Pizzolatto had in mind for star billing. Although the actor was to play Detective Martin \"Marty\" Hart, he later convinced Pizzolatto to cast him as Cohle. Instead, Harrelson was assigned the role of Hart at McConaughey's request. Michelle Monaghan played the female lead Maggie Hart, while Michael Potts and Tory Kittles were given the roles of Detectives Maynard Gilbough and Thomas Papania, respectively. Major recurring roles in the first season include Kevin Dunn as Major Ken Quesada and Alexandra Daddario as Lisa Tragnetti.\r\nCary Joji Fukunaga was appointed as director of True Detective's first season. He competed with Alejandro González Iñárritu for the position, but Iñárritu dropped out because of other film commitments. To prepare, Fukunaga conducted research with a real-life homicide detective of the Louisiana State Police's Criminal Investigations Division. The director brought on Adam Arkapaw as the project cinematographer, and hired Alex DiGerlando, who he worked with on Benh Zeitlin's Glory at Sea (2008), as the production designer.\r\nSeason 2\r\nIn January 2014, Pizzolatto signed a two-year contract extension with HBO, effectively renewing the series for two additional seasons. Much like its predecessor, season 2 of True Detective consists of eight episodes, all written by Pizzolatto. However, the responsibility of directing was assigned to several people. Justin Lin directed the first two episodes. Fukunaga, who directed all of season one, did not return as director; he remains, however, an executive producer, as do McConaughey and Harrelson. Pizzolatto hired fellow novelist Scott Lasser to help develop and write stories for the second half of the season.\r\nThe season's first significant casting was Colin Farrell as Detective Raymond \"Ray\" Velcoro. Vince Vaughn, playing the role of criminal and entrepreneur Frank Semyon, was officially cast toward the end of the month. By November, True Detective's principal cast expanded to include Rachel McAdams as Detective Antigone \"Ani\" Bezzerides, Taylor Kitsch as California Highway Patrol Officer Paul Woodrugh, and Kelly Reilly as Jordan Semyon, Frank's wife.\r\nSeason 3\r\nIn August 2017, HBO officially greenlit a third season, which takes place in the Ozarks over three decades. The first two episodes were directed by Jeremy Saulnier; he had been expected to direct the third episode, but had to exit the series due to scheduling conflicts. In March 2018, it was announced that Daniel Sackheim was added as director and that he and Pizzolatto would direct the remaining six episodes. Pizzolatto is the sole writer, with the exceptions of episodes 4 and 6 which he co-wrote with David Milch and Graham Gordy, respectively. Mahershala Ali was cast as the lead character, playing Wayne Hays, a state police detective from northwest Arkansas. Ray Fisher plays Wayne's son, Henry Hays; Carmen Ejogo plays Amelia Reardon, an Arkansas schoolteacher with a connection to two missing children in 1980; Stephen Dorff plays Roland West, an Arkansas State Investigator; Scoot McNairy plays Tom Purcell, the father of the missing children; and Mamie Gummer plays Lucy Purcell, the mother of the missing children.\r\nSeason 4\r\nAs of January 2019, Pizzolatto was developing a storyline for a potential fourth season; however, in April, he abandoned that storyline—saving it for another series or film—and started working on a new storyline that he had discussed with an undisclosed actor.\r\nPizzolatto signed a new first-look deal with FX Productions in January 2020, with HBO reportedly considering proceeding with future installments of True Detective with other writers. In February 2021, HBO head of programming Casey Bloys confirmed that the network was working with a group of writers on a new direction for the series, possibly including Lucía Puenzo and Sam Levinson.\r\nIn March 2022, it was reported that True Detective: Night Country was in development, with Issa López writing a pilot episode and Barry Jenkins as executive producer. López would also direct the pilot if HBO moves forward with the project. In May 2022, it was reported that Jodie Foster would star in a lead role for the fourth season. The season is set in Alaska, and follows detectives Liz Danvers (Foster) and Evangeline Navarro as they investigate the disappearance of six men from a research station. In June 2022, HBO officially greenlit the series and Kali Reis was cast in the lead role of Evangeline Navarro. The season was filmed in Iceland on an estimated budget of $60 million. In September 2022, John Hawkes, Christopher Eccleston, Fiona Shaw, Finn Bennett, and Anna Lambe joined the cast. Further cast additions were announced in October 2022, including Aka Niviâna, Isabella Star LaBlanc and Joel D. Montgrand, while also confirming that the new season would be the first not written by Pizzolatto, who will turn over primary writing and showrunning duties to López. HBO confirmed on November 8, 2022, that production on the fourth season had commenced.\r\nEpisodes\r\nReception\r\nCritical response\r\nSeason 1\r\nTrue Detective's first season received widespread acclaim from television critics, with several naming it among the best television dramas of the year. On the review aggregation website Rotten Tomatoes, the first season garnered a rating of 87%, based on 208 reviews, with an average rating of 8.85/10. The site's critical consensus reads, \"In True Detective, performances by Woody Harrelson and Matthew McConaughey reel the viewer in, while the style, vision and direction make it hard to turn away.\" On Metacritic, season one scored an 87 out of 100, based on 41 critics, indicating \"universal acclaim\".\r\nReviewers from The Daily Beast, The Atlantic, and The Daily Telegraph cited True Detective as the strongest show in recent memory. Tim Goodman from The Hollywood Reporter said the acting, dialogue, and sleek production were the series' most redeeming qualities. HitFix's Alan Sepinwall agreed, and believed that these attributes \"speak to the value of the hybrid anthology format Pizzolatto is using here ... points to a potentially fascinating shift in dramatic series television.\" Richard Lawson, writing for Vanity Fair, said that Pizzolatto and Fukunaga's sensibilities produce \"a captivating and offbeat tweak of a well-worn genre\". Despite its critical regard, some critics were not as enthusiastic in their reviews of season one. The New York Times journalist Mike Hale thought the script too readily deferred to religion as its narrative backbone, as did Chris Cabin from Slant Magazine. Hank Steuver of The Washington Post wrote that True Detective failed to realize its own ambition.\r\nThe ensemble performances, namely McConaughey and Harrelson, were frequently mentioned in review for the show. Robert Bianco in USA Today wrote that the duo met, and even exceeded occasionally, the \"enormously high\" performance expectations of the \"golden age of TV acting\". David Wiegand of the San Francisco Chronicle and Los Angeles Times journalist Robert Lloyd singled out the two men for their work in the series; The Boston Globe did the same for Monaghan. Variety's Brian Lowry said the True Detective cast consisted of \"fine players on the periphery\".\r\nSeason 2\r\nTrue Detective's second season received mixed reviews. Praise was given to the performances of Farrell, McAdams and Kitsch, cinematography, and action sequences. However, many critics felt it was weaker than the first season. Most criticism focused on the convoluted plot and dialogue. On Rotten Tomatoes, the season has a rating of 62%, based on 325 reviews, with an average rating of 6.75/10. The site's critical consensus reads, \"True Detective's second season stands on its own as a solid police drama, with memorable moments and resonant relationships outweighing predictable plot twists.\" On Metacritic, the season has a score of 61 out of 100, based on 41 critics, indicating \"generally favorable reviews\".\r\nDavid Hinckley of the New York Daily News gave it a very positive review, and wrote: \"It's still the kind of show that makes TV viewers reach for phrases like 'golden age of television drama'\" and \"the second installment of True Detective goes out of the way not to echo the first.\" Hank Stuever of The Washington Post gave it a generally positive review, praising the performances, and wrote: \"There is something still lugubrious and overwrought about True Detective, but there's also a mesmerizing style to it — it's imperfect, but well made.\"\r\nA mixed review came from Brian Lowry of Variety, who wrote: \"Although generally watchable, the inspiration that turned the first into an obsession for many seems to have drained out of writer Nic Pizzolatto's prose.\"\r\nSean T. Collins of Rolling Stone gave it a negative review and described the season as having \"emerged as the year's most passionately disliked show,\" and described it as a \"squandered opportunity\" for Nic Pizzolatto.\r\nSeason 3\r\nThe third season received positive reviews, in comparison to the mixed reception of the second season.\r\nOn Rotten Tomatoes, the season has a rating of 86%, based on 235 reviews, with an average rating of 7.45/10. The site's critical consensus reads, \"Driven by Mahershala Ali's mesmerizing performance, True Detective's third season finds fresh perspective by exploring real world events – though it loses some of the series' intriguing strangeness along the way.\" On Metacritic, the season has a score of 72 out of 100, based on 35 critics, indicating \"generally favorable reviews\".\r\nRatings\r\nWith an average gross audience of 11.9 million viewers, the first season of True Detective was HBO's most-watched show in its first year of airing, surpassing Six Feet Under’s 11.4 million viewers in 2001. This rating system counts all airings of a show in its average audience rating, no matter how many times a viewer watches the show during the report period (including DVR recordings, reruns, and streaming on HBO Go). The season averaged 2.33 total million live plus same day viewers, with the viewership numbers keeping a generally upward trend over the course of the season. The premiere was the second most-watched series debut for the network with 2.3 million viewers, behind Boardwalk Empire's 4.8 million in 2010. The sixth episode of the season was watched by 2.6 million viewers, and became the first episode to surpass the premiere, while the season-finale was watched by 3.5 million viewers, which is a 50% increase over the premiere's ratings.\r\nThe second-season premiere sustained the viewership numbers of the first season, as the episode was watched by 3.2 million viewers. However, the season's ratings kept a generally downward trend, as the season-finale was watched by 2.7 million viewers, a 22% drop in comparison to the final episode of the first season. Nevertheless, it was the most-watched telecast for the day it aired, drawing an additional 550,000 total viewers from the season's penultimate episode. Overall, the second season of the series averaged 2.61 million total viewers, and 11.3 million viewers in gross audience numbers which is only slightly below the first season's 11.9 million.\r\nAccolades\r\nFor the 30th TCA Awards, True Detective won for Outstanding Achievement in Movies, Miniseries, and Specials and received nominations for Outstanding New Program and Program of the Year; and McConaughey won for Outstanding Individual Achievement in Drama. For the 4th Critics' Choice Television Awards, the series was nominated for Best Drama Series, and McConaughey won for Best Actor in a Drama Series. For the 66th Primetime Emmy Awards, the series was nominated for Outstanding Drama Series, Harrelson and McConaughey were both nominated for Outstanding Lead Actor in a Drama Series, Pizzolatto was nominated for Outstanding Writing for a Drama Series for \"The Secret Fate of All Life\", and Fukunaga won for Outstanding Directing for a Drama Series for \"Who Goes There\".\r\nFor the 66th Primetime Creative Arts Emmy Awards, the series was nominated for seven awards, and won four, including Outstanding Cinematography for a Single-Camera Series and Outstanding Main Title Design. For the 67th Writers Guild of America Awards, the series won for Best Drama Series and Best New Series. For the 21st Screen Actors Guild Awards, Harrelson and McConaughey both received nominations for Best Drama Actor. For the 72nd Golden Globe Awards, the series was nominated for Best Miniseries or Television Film, Harrelson and McConaughey were both nominated for Best Actor – Miniseries or Television Film, and Monaghan was nominated for Best Supporting Actress – Series, Miniseries or Television Film. For the 67th Directors Guild of America Awards, Fukunaga was nominated for Outstanding Directing – Drama Series for the episode \"Who Goes There\".\r\nHome media",
    "html": "<p>True Detective is an American anthology crime drama television series created and written by Nic Pizzolatto. The series, broadcast by the premium cable network HBO in the United States, premiered on January 12, 2014. Each season of the series is structured as a self-contained narrative, employing new cast ensembles, and following various sets of characters and settings.</p><p>The first season, starring Matthew McConaughey, Woody Harrelson, Michelle Monaghan, Michael Potts, and Tory Kittles, takes place in Louisiana and follows a pair of Louisiana State Police detectives, and their pursuit of a serial killer with occult links over a 17-year period. The second season aired in 2015, starring Colin Farrell, Rachel McAdams, Taylor Kitsch, Kelly Reilly, and Vince Vaughn, is set in California, and focuses on three detectives from three cooperating police departments and a criminal-turned-businessman as they investigate a series of crimes they believe are linked to the murder of a corrupt politician. The third season aired in 2019, starring Mahershala Ali, Carmen Ejogo, Stephen Dorff, Scoot McNairy, and Ray Fisher, and takes place in the Ozarks over three time periods as a pair of Arkansas State Police detectives investigate a macabre crime involving two missing children.</p><p>The first season received widespread acclaim from critics and earned high ratings for HBO. It was nominated for and won numerous awards and other accolades, chiefly for its acting, cinematography, writing, and direction. Reception to the second season was more divided, although the show maintained high viewership for HBO. The third season received positive reviews, but saw a drop in viewership.</p><p>A fourth season situated in Alaska, titled True Detective: Night Country, is set to premiere in 2023. It stars Jodie Foster and Kali Reis, with Issa López and Barry Jenkins producing.</p><br/><h3>Production</h3><h4>Development</h4><p>Before developing True Detective, Nic Pizzolatto worked as a literature professor for the University of Chicago, the University of North Carolina at Chapel Hill, and DePauw University. He also delved into fiction writing, having developed a fascination for it as a graduate student at the University of Arkansas. His first published work was the short story collection Between Here and the Yellow Sea, released in 2006. The author published his debut novel, titled Galveston, four years later and around the same time began preparing to branch out into the television industry (earlier attempts were never realized due to lack of capital).</p><p>Intended to be Galveston's follow-up, Pizzolatto felt True Detective was more suited to film. Pizzolatto shopped the novel to two TV executives, and, once he secured a deal in May 2010, drafted six screenplays, including the pilot episode (\"The Long Bright Dark\") script, which ran 90 pages. He devoted another script for the series shortly after his departure from The Killing's writing staff in 2011, thanks to the support of Anonymous Content. The final copy, amounting to 500 pages, was written without the aid of writing staff. By this time, Pizzolatto secured a development deal with HBO, and by April 2012, the network commissioned True Detective on an order of eight episodes. Set up as an anthology series, each season will feature a different cast of characters and self-contained narratives in various time periods and locations.</p><h4>Filming</h4><p>The initial location for principal photography of True Detective's first season was Arkansas, but Pizzolatto later opted to film in Louisiana, which was cheaper due to its generous film-tax incentive program. Production lasted 100 consecutive days, and each episode was shot on 35mm film. The crew filmed exterior shots of various constructed sets, including a remote sugarcane field outside of Erath, in addition to real life locations such as Fort Macomb, a nineteenth-century fort located outside of New Orleans.</p><p>California was selected as the setting for True Detective's sophomore season. Producers were urged to avoid filming in Los Angeles and, instead, focus on the more obscure regions of the state to \"capture a certain psycho-sphere ambiance\". Production began in November 2014.</p><p>The third season was filmed at various locations throughout Northwest Arkansas, including Fayetteville, Bentonville, Lincoln, Rogers and Springdale. Filming began in February 2018 and was wrapped in August of the same year.</p><h4>Opening sequence</h4><p>Led by creative director Patrick Clair, True Detective's title sequences were developed by a collaborative team consisting of three motion-design studios: Santa Monica-based Elastic, Antibody and Breeder, both based in Australia. For the first season, Clair and his team took a variety of photos of the Louisiana scenery, which became the sequence's backbone. They superimposed these images onto low poly meshes, thanks to the use of various animation and special effects techniques. This was a meticulous process for production, since they wanted to avoid creating a digitized look for the sequence. Once its final cut took form, the team polished it by employing optical glitching and motion distortion technique. True Detective's season one opening theme is \"Far from Any Road\", an alternative country song originally composed by The Handsome Family for their 2003 album Singing Bones. The Sydney Morning Herald included season one's opening sequence in their list of the \"Ten of the Best\" title sequences on television.</p><p>Clair took a similar approach to creating the title sequence for True Detective's second season. Production used material from a number of photographers, including aerial shots captured by David Maisel. However, unlike season one, season two's title sequence incorporates deep, vivid gold and red color, thereby presenting \"that more complicated view of California\". Leonard Cohen's \"Nevermind\" is the season two opening theme, which is a song from Cohen's 2014 album Popular Problems. The theme song's lyrics change with every episode, incorporating different verses from Cohen's song.</p><br/><h3>Cast and crew</h3><h4>Season 1</h4><p>The first actor to be cast for True Detective was Matthew McConaughey, who acted as Detective Rustin \"Rust\" Cohle. McConaughey came to Pizzolatto's attention for his performance in the 2011 thriller film The Lincoln Lawyer, and was contracted before the series was commissioned by HBO. He and Woody Harrelson were among a pool of candidates Pizzolatto had in mind for star billing. Although the actor was to play Detective Martin \"Marty\" Hart, he later convinced Pizzolatto to cast him as Cohle. Instead, Harrelson was assigned the role of Hart at McConaughey's request. Michelle Monaghan played the female lead Maggie Hart, while Michael Potts and Tory Kittles were given the roles of Detectives Maynard Gilbough and Thomas Papania, respectively. Major recurring roles in the first season include Kevin Dunn as Major Ken Quesada and Alexandra Daddario as Lisa Tragnetti.</p><p>Cary Joji Fukunaga was appointed as director of True Detective's first season. He competed with Alejandro González Iñárritu for the position, but Iñárritu dropped out because of other film commitments. To prepare, Fukunaga conducted research with a real-life homicide detective of the Louisiana State Police's Criminal Investigations Division. The director brought on Adam Arkapaw as the project cinematographer, and hired Alex DiGerlando, who he worked with on Benh Zeitlin's Glory at Sea (2008), as the production designer.</p><h4>Season 2</h4><p>In January 2014, Pizzolatto signed a two-year contract extension with HBO, effectively renewing the series for two additional seasons. Much like its predecessor, season 2 of True Detective consists of eight episodes, all written by Pizzolatto. However, the responsibility of directing was assigned to several people. Justin Lin directed the first two episodes. Fukunaga, who directed all of season one, did not return as director; he remains, however, an executive producer, as do McConaughey and Harrelson. Pizzolatto hired fellow novelist Scott Lasser to help develop and write stories for the second half of the season.</p><p>The season's first significant casting was Colin Farrell as Detective Raymond \"Ray\" Velcoro. Vince Vaughn, playing the role of criminal and entrepreneur Frank Semyon, was officially cast toward the end of the month. By November, True Detective's principal cast expanded to include Rachel McAdams as Detective Antigone \"Ani\" Bezzerides, Taylor Kitsch as California Highway Patrol Officer Paul Woodrugh, and Kelly Reilly as Jordan Semyon, Frank's wife.</p><h4>Season 3</h4><p>In August 2017, HBO officially greenlit a third season, which takes place in the Ozarks over three decades. The first two episodes were directed by Jeremy Saulnier; he had been expected to direct the third episode, but had to exit the series due to scheduling conflicts. In March 2018, it was announced that Daniel Sackheim was added as director and that he and Pizzolatto would direct the remaining six episodes. Pizzolatto is the sole writer, with the exceptions of episodes 4 and 6 which he co-wrote with David Milch and Graham Gordy, respectively. Mahershala Ali was cast as the lead character, playing Wayne Hays, a state police detective from northwest Arkansas. Ray Fisher plays Wayne's son, Henry Hays; Carmen Ejogo plays Amelia Reardon, an Arkansas schoolteacher with a connection to two missing children in 1980; Stephen Dorff plays Roland West, an Arkansas State Investigator; Scoot McNairy plays Tom Purcell, the father of the missing children; and Mamie Gummer plays Lucy Purcell, the mother of the missing children.</p><h4>Season 4</h4><p>As of January 2019, Pizzolatto was developing a storyline for a potential fourth season; however, in April, he abandoned that storyline—saving it for another series or film—and started working on a new storyline that he had discussed with an undisclosed actor.</p><p>Pizzolatto signed a new first-look deal with FX Productions in January 2020, with HBO reportedly considering proceeding with future installments of True Detective with other writers. In February 2021, HBO head of programming Casey Bloys confirmed that the network was working with a group of writers on a new direction for the series, possibly including Lucía Puenzo and Sam Levinson.</p><p>In March 2022, it was reported that True Detective: Night Country was in development, with Issa López writing a pilot episode and Barry Jenkins as executive producer. López would also direct the pilot if HBO moves forward with the project. In May 2022, it was reported that Jodie Foster would star in a lead role for the fourth season. The season is set in Alaska, and follows detectives Liz Danvers (Foster) and Evangeline Navarro as they investigate the disappearance of six men from a research station. In June 2022, HBO officially greenlit the series and Kali Reis was cast in the lead role of Evangeline Navarro. The season was filmed in Iceland on an estimated budget of $60 million. In September 2022, John Hawkes, Christopher Eccleston, Fiona Shaw, Finn Bennett, and Anna Lambe joined the cast. Further cast additions were announced in October 2022, including Aka Niviâna, Isabella Star LaBlanc and Joel D. Montgrand, while also confirming that the new season would be the first not written by Pizzolatto, who will turn over primary writing and showrunning duties to López. HBO confirmed on November 8, 2022, that production on the fourth season had commenced.</p><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Season</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th><th scope=\"col\" rowspan=\"2\" style=\"padding:0 8px\">Average viewers<br>(in millions)</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>1</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 12, 2014</td><td style=\"padding:0 8px\">March 9, 2014</td><td>2.33</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>2</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">June 21, 2015</td><td style=\"padding:0 8px\">August 9, 2015</td><td>2.61</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span>3</span></span></span></span></th><td colspan=\"2\">8</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">January 13, 2019</td><td style=\"padding:0 8px\">February 24, 2019</td><td>1.25</td></tr></tbody></table><br/><h3>Reception</h3><h4>Critical response</h4><h4>Season 1</h4><p>True Detective's first season received widespread acclaim from television critics, with several naming it among the best television dramas of the year. On the review aggregation website Rotten Tomatoes, the first season garnered a rating of 87%, based on 208 reviews, with an average rating of 8.85/10. The site's critical consensus reads, \"In True Detective, performances by Woody Harrelson and Matthew McConaughey reel the viewer in, while the style, vision and direction make it hard to turn away.\" On Metacritic, season one scored an 87 out of 100, based on 41 critics, indicating \"universal acclaim\".</p><p>Reviewers from The Daily Beast, The Atlantic, and The Daily Telegraph cited True Detective as the strongest show in recent memory. Tim Goodman from The Hollywood Reporter said the acting, dialogue, and sleek production were the series' most redeeming qualities. HitFix's Alan Sepinwall agreed, and believed that these attributes \"speak to the value of the hybrid anthology format Pizzolatto is using here ... points to a potentially fascinating shift in dramatic series television.\" Richard Lawson, writing for Vanity Fair, said that Pizzolatto and Fukunaga's sensibilities produce \"a captivating and offbeat tweak of a well-worn genre\". Despite its critical regard, some critics were not as enthusiastic in their reviews of season one. The New York Times journalist Mike Hale thought the script too readily deferred to religion as its narrative backbone, as did Chris Cabin from Slant Magazine. Hank Steuver of The Washington Post wrote that True Detective failed to realize its own ambition.</p><p>The ensemble performances, namely McConaughey and Harrelson, were frequently mentioned in review for the show. Robert Bianco in USA Today wrote that the duo met, and even exceeded occasionally, the \"enormously high\" performance expectations of the \"golden age of TV acting\". David Wiegand of the San Francisco Chronicle and Los Angeles Times journalist Robert Lloyd singled out the two men for their work in the series; The Boston Globe did the same for Monaghan. Variety's Brian Lowry said the True Detective cast consisted of \"fine players on the periphery\".</p><h4>Season 2</h4><p>True Detective's second season received mixed reviews. Praise was given to the performances of Farrell, McAdams and Kitsch, cinematography, and action sequences. However, many critics felt it was weaker than the first season. Most criticism focused on the convoluted plot and dialogue. On Rotten Tomatoes, the season has a rating of 62%, based on 325 reviews, with an average rating of 6.75/10. The site's critical consensus reads, \"True Detective's second season stands on its own as a solid police drama, with memorable moments and resonant relationships outweighing predictable plot twists.\" On Metacritic, the season has a score of 61 out of 100, based on 41 critics, indicating \"generally favorable reviews\".</p><p>David Hinckley of the New York Daily News gave it a very positive review, and wrote: \"It's still the kind of show that makes TV viewers reach for phrases like 'golden age of television drama'\" and \"the second installment of True Detective goes out of the way not to echo the first.\" Hank Stuever of The Washington Post gave it a generally positive review, praising the performances, and wrote: \"There is something still lugubrious and overwrought about True Detective, but there's also a mesmerizing style to it — it's imperfect, but well made.\"</p><p>A mixed review came from Brian Lowry of Variety, who wrote: \"Although generally watchable, the inspiration that turned the first into an obsession for many seems to have drained out of writer Nic Pizzolatto's prose.\"</p><p>Sean T. Collins of Rolling Stone gave it a negative review and described the season as having \"emerged as the year's most passionately disliked show,\" and described it as a \"squandered opportunity\" for Nic Pizzolatto.</p><h4>Season 3</h4><p>The third season received positive reviews, in comparison to the mixed reception of the second season.</p><p>On Rotten Tomatoes, the season has a rating of 86%, based on 235 reviews, with an average rating of 7.45/10. The site's critical consensus reads, \"Driven by Mahershala Ali's mesmerizing performance, True Detective's third season finds fresh perspective by exploring real world events – though it loses some of the series' intriguing strangeness along the way.\" On Metacritic, the season has a score of 72 out of 100, based on 35 critics, indicating \"generally favorable reviews\".</p><h4>Ratings</h4><p>With an average gross audience of 11.9 million viewers, the first season of True Detective was HBO's most-watched show in its first year of airing, surpassing Six Feet Under’s 11.4 million viewers in 2001. This rating system counts all airings of a show in its average audience rating, no matter how many times a viewer watches the show during the report period (including DVR recordings, reruns, and streaming on HBO Go). The season averaged 2.33 total million live plus same day viewers, with the viewership numbers keeping a generally upward trend over the course of the season. The premiere was the second most-watched series debut for the network with 2.3 million viewers, behind Boardwalk Empire's 4.8 million in 2010. The sixth episode of the season was watched by 2.6 million viewers, and became the first episode to surpass the premiere, while the season-finale was watched by 3.5 million viewers, which is a 50% increase over the premiere's ratings.</p><p>The second-season premiere sustained the viewership numbers of the first season, as the episode was watched by 3.2 million viewers. However, the season's ratings kept a generally downward trend, as the season-finale was watched by 2.7 million viewers, a 22% drop in comparison to the final episode of the first season. Nevertheless, it was the most-watched telecast for the day it aired, drawing an additional 550,000 total viewers from the season's penultimate episode. Overall, the second season of the series averaged 2.61 million total viewers, and 11.3 million viewers in gross audience numbers which is only slightly below the first season's 11.9 million.</p><h4>Accolades</h4><p>For the 30th TCA Awards, True Detective won for Outstanding Achievement in Movies, Miniseries, and Specials and received nominations for Outstanding New Program and Program of the Year; and McConaughey won for Outstanding Individual Achievement in Drama. For the 4th Critics' Choice Television Awards, the series was nominated for Best Drama Series, and McConaughey won for Best Actor in a Drama Series. For the 66th Primetime Emmy Awards, the series was nominated for Outstanding Drama Series, Harrelson and McConaughey were both nominated for Outstanding Lead Actor in a Drama Series, Pizzolatto was nominated for Outstanding Writing for a Drama Series for \"The Secret Fate of All Life\", and Fukunaga won for Outstanding Directing for a Drama Series for \"Who Goes There\".</p><p>For the 66th Primetime Creative Arts Emmy Awards, the series was nominated for seven awards, and won four, including Outstanding Cinematography for a Single-Camera Series and Outstanding Main Title Design. For the 67th Writers Guild of America Awards, the series won for Best Drama Series and Best New Series. For the 21st Screen Actors Guild Awards, Harrelson and McConaughey both received nominations for Best Drama Actor. For the 72nd Golden Globe Awards, the series was nominated for Best Miniseries or Television Film, Harrelson and McConaughey were both nominated for Best Actor – Miniseries or Television Film, and Monaghan was nominated for Best Supporting Actress – Series, Miniseries or Television Film. For the 67th Directors Guild of America Awards, Fukunaga was nominated for Outstanding Directing – Drama Series for the episode \"Who Goes There\".</p><br/><h3>Home media</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th colspan=\"2\" rowspan=\"2\" style=\"padding-left:.8em; padding-right:.8em;\">Season</th><th colspan=\"3\" style=\"padding-left:.8em; padding-right:.8em;\"><span>DVD</span> release date</th><th colspan=\"2\" style=\"padding-left:.8em; padding-right:.8em;\"><span>Blu-ray</span> release date</th><th rowspan=\"2\" style=\"padding-left:.8em; padding-right:.8em;\"><abbr title=\"References\">Ref.</abbr></th></tr><tr><th scope=\"col\" style=\"padding-left:.8em; padding-right:.8em;\"><span>Region 1</span></th><th scope=\"col\" style=\"padding-left:.8em; padding-right:.8em;\"><span>Region 2</span></th><th scope=\"col\" style=\"padding-left:.8em; padding-right:.8em;\"><span>Region 4</span></th><th scope=\"col\" style=\"padding-left:.8em; padding-right:.8em;\"><span>Region A</span></th><th scope=\"col\" style=\"padding-left:.8em; padding-right:.8em;\"><span>Region B</span></th></tr><tr><td style=\"background:#9aaaa5; width:10px;\"></td><th scope=\"row\">1</th><td>June 10, 2014</td><td>June 9, 2014</td><td>June 25, 2014</td><td>June 10, 2014</td><td>June 9, 2014</td><td></td></tr><tr><td style=\"background:#4f270c; width:10px;\"></td><th scope=\"row\">2</th><td>January 5, 2016</td><td>January 11, 2016</td><td>January 6, 2016</td><td>January 5, 2016</td><td>January 11, 2016</td><td></td></tr><tr><td style=\"background:#5bc6cc; width:10px;\"></td><th scope=\"row\">3</th><td>September 3, 2019</td><td>September 2, 2019</td><td>September 4, 2019</td><td>September 3, 2019</td><td>September 2, 2019</td><td></td></tr></tbody></table><br/>"
  },
  "errorMessage": ""
}