{
  "imDbId": "tt0103359",
  "title": "Batman: The Animated Series",
  "fullTitle": "Batman: The Animated Series (TV Series 1992–1995)",
  "type": "TVSeries",
  "year": "1992",
  "items": [
    {
      "username": "grendelkhan",
      "userUrl": "https://www.imdb.com/user/ur1997252",
      "reviewLink": "https://www.imdb.com/review/rw0301723",
      "warningSpoilers": false,
      "date": "10 September 2003",
      "rate": "",
      "helpful": "149 out of 154 found this helpful.",
      "title": "The series that finally got it right!",
      "content": "We longtime (read \"old\") fans of Batman have been waiting for a cinematic Batman that reflects the greatness of the comic books. Unfortunately, we have had to put up with the worst attempts to realize this great character. The movie serials were atrocious, the Adam West show, although entertaining, treated the character as a joke. The Filmation cartoons and the Superfriends were watered down. The more recent movies are a mixed bag. Then, along came BTAS, and we were finally satisfied.Everything, from the look and tone of the animation, to the stories and voicework was first-rate. Batman is the Dark knight Detective. He's not a guy in a rubber suit. He is skilled, intelligent, obsessed, tortured, and dedicated. The villains are evil, psychotic, and just plain loopy. We have Paul Dini's wonderful creation of Harley Quinn, the first inspired and interesting character, since Denny O'Neil created Ra's al Ghul.The creators took their cue from the legendary Flesicher Bros. version of Superman, with it's Art Deco stylings and darker color palette. It took its story concepts from the work of Bill Finger, Denny O'Neil, Frank Miller, and Steve Engelhart. The music was inspired by the wonderful Danny Elfman music from the Tim Burton film. The voicework featured outstanding actors, with mature direction from Andrea Romano.The only criticism I can level at the show is that they avoided doing a complete episode revolving around Batman's origin. Granted, the broadcast standards and practices limited how much they could show, but they found a way to present Robin's origin, without sacrificing story. They did present elements, but I would have liked to have seen a complete episode, with his training and \"year one\" adventures. The Superfriends episode, \"The Fear\" presented more of the origin than BTAS ever depicted. Still, it didn't detract from the overall effectiveness of the series.The series even improved on some of the elements of the comics. Personally, I never thought much of Bane, but I enjoyed the BTAS version, complete with the Lucha Libre stylings; Bane as luchador hitman, classic! The Joker was far more interesting here than he had been for some time in the comics. The Riddler came across as deadly, rather than a joke. Alfred provided more than window dressing.This is the series that set the standard for all other cinematic Batman efforts. Thankfully, it removed the bitter taste of Joel Schumacher."
    },
    {
      "username": "TheLittleSongbird",
      "userUrl": "https://www.imdb.com/user/ur20552756",
      "reviewLink": "https://www.imdb.com/review/rw2116310",
      "warningSpoilers": false,
      "date": "24 August 2009",
      "rate": "10",
      "helpful": "26 out of 27 found this helpful.",
      "title": "What a FANTASTIC animated series!",
      "content": "I loved every minute of this superb animated series, and I am not afraid to say that out of all the animated shows based on the character, this series is without doubt the best of the lot. The animation was fantastic, no better way to describe it really, very dark and fluid instead of the Saturday- morning-cartoon standard that has marred animation recently. The theme tune by Danny Elfman was haunting and memorable, the same Danny Elfman who composed the music for Edward Scissorhands, which coincidentally is one of my all-time favourite movie scores. Also the plot lines and teleplays are very interesting, and I loved the characters, especially Batman, who was dark, brooding and complex like he is supposed to be. And what about the villains? Harvey Two Face, Mr Freeze, the scarecrow, Penguin, and my favourite the joker, who Mark Hamill voiced superlatively, making him sinister and fun at the same time. Though I was wondering, if the producers hadn't replaced their 1st choice for the character Tim Curry, he would've done just as well. I happily award Batman: The Animated Series a 10/10. Bethany Cox"
    },
    {
      "username": "Chiron1987",
      "userUrl": "https://www.imdb.com/user/ur0110881",
      "reviewLink": "https://www.imdb.com/review/rw0301705",
      "warningSpoilers": false,
      "date": "10 December 1998",
      "rate": "10",
      "helpful": "177 out of 183 found this helpful.",
      "title": "The Pinnacle of Animation on Television",
      "content": "It has been a long hard journey to mainstream media for comic book characters, but finally Batman made it with time to spare in Batman: The Animated Series (later renamed The Adventures of Batman & Robin). Groundbreaking animation, superior voice-over work, and top-notch stories have made this series into a creation too stupendous to call a \"cartoon.\" Each episode was a wondrous, albeit dark, trip through Batman's world, and how he faces each and every obstacle Gotham City gives him. Much like an amalgam of all of Batman's two-dimensional incarnations, this series' Dark Knight is tortured and driven, but not requite enough to give his enemies pithy comebacks and display romantic charms. Definitely, this is the way the Batman should and always be depicted."
    },
    {
      "username": "TheMan3051",
      "userUrl": "https://www.imdb.com/user/ur1196715",
      "reviewLink": "https://www.imdb.com/review/rw0301713",
      "warningSpoilers": false,
      "date": "28 June 2002",
      "rate": "",
      "helpful": "83 out of 89 found this helpful.",
      "title": "The real Batman",
      "content": "This program thanks to people like Alan Burnett, Paul Dini, and Bruce W. Timm made this show the most faithful adaption of the Dark Knight ever. This show was brilliant!!!! It had terrific animation, story line, character development, and action sequences. Regardless of weather you're a Batman fan or not this is a show not to be missed."
    },
    {
      "username": "wsheit",
      "userUrl": "https://www.imdb.com/user/ur3766810",
      "reviewLink": "https://www.imdb.com/review/rw0301731",
      "warningSpoilers": false,
      "date": "19 September 2004",
      "rate": "",
      "helpful": "190 out of 196 found this helpful.",
      "title": "A True Masterpiece- the greatest body of animated work ever!",
      "content": "When Batman: the animated series came around, it didn't take people long to see that it was something different. Here was a \"cartoon\" that was written for adults. It could be viewed by older kids, but it had great depths for the adults who took any time with it. Each episode (or couple of episodes) acts as its own mini-movie. The structuring of the story in each one is just so well executed. As well, the animation (for its time) was quite good, and still holds up well enough today. Another difference from other animation, is that the color palette is quite dark- which, again, only makes it more interesting. All of the great villains are here (and others you may not have heard of), but they get a very serious and, at times, philosophical explication. One of my favorite things about the series, is that every episode has its own orchestral score- meaning, the music that you hear is tailored to fit the exact moment you are watching. Shirley Walker manages to come up with so many sub-themes and variations on the main theme- and works them in so well with the happenings on screen. For those of you that have seen the series and remember it fondly, you might be interested to know that a box-set of the first 28 episodes was recently released- you can get it just about anywhere."
    },
    {
      "username": "Tenchi64589",
      "userUrl": "https://www.imdb.com/user/ur2303003",
      "reviewLink": "https://www.imdb.com/review/rw1092897",
      "warningSpoilers": false,
      "date": "1 June 2005",
      "rate": "",
      "helpful": "66 out of 76 found this helpful.",
      "title": "The way Batman is supposed to be!",
      "content": "When this series first came out, I was at least eight years old; so of course I wouldn't really understand most of it with this being a drama and all... now I realize that this is the most accurate retelling of the Batman legacy EVER! Starting off, compare this to the horrid series they have created now: \"The Batman,\" where they treat Batman like Superman by wondering who he is... it just doesn't measure up... allow me to explain the differences: one of which being the presence of Ethan Bennet. Who you ask? I rest my case... there is none that I can remember.Secondly, this one is perfectly parallel to the comics. There's no such thing as the bat-wave in the original, but there will always be the bat signal! Finally, the animation looks as it should. Joker is not in a straight jacket, The Riddler doesn't look like Bono from U2, and every voice actor sounds just like they should.To sum it all up, this series was everything that \"The batman\" isn't... and that's a good thing."
    },
    {
      "username": "Son_of_Mansfield",
      "userUrl": "https://www.imdb.com/user/ur2415124",
      "reviewLink": "https://www.imdb.com/review/rw1047297",
      "warningSpoilers": true,
      "date": "26 March 2005",
      "rate": "9",
      "helpful": "19 out of 21 found this helpful.",
      "title": "A near perfect Gothic, comic book, superhero, detective series.",
      "content": "Batman comes to life in his best incarnation yet with stellar voice work, stunning visuals, rich stories, and the perfect emphasis on the dark knight's detecting skills and humanity. Kevin Conroy, sporting a preppy high voice for Bruce Wayne and a scary low voice for Batman, nails the duality of the dark night. He gives the character edge, heart, brains, and wit. Surrounding Conroy are some great actors with distinct voices who follow his lead. Adrienne Barbeau(The Fog, Escape From New York), Ron Perlman(Hellboy), Ed Asner(Elf, also two other great, but short livid animated series: Spider-Man and Gargoyles), John Glover(Gremlins 2: The new Batch, Scrooged), Roddy McDowell(Planet of the Apes), Richard Moll(House, Night Court, Spider-Man), John Vernon(Animal House), and David Warner(The Ballad of Cable Hogue, The Omen, Gargoyles, Spider-Man) are perfect in their roles as is every other actor. The only major problem with the series is that it is too rich for a half hour. The best episodes are the two part episodes like Heart of Steel, The Cat and The Claw, Feat of Clay, and Two-Face. The series could have used more continuity as well. The bottom line is that this is about as good as can be and a real treat for any fan of Batman."
    },
    {
      "username": "Kai-18",
      "userUrl": "https://www.imdb.com/user/ur0311836",
      "reviewLink": "https://www.imdb.com/review/rw0301710",
      "warningSpoilers": false,
      "date": "17 August 2000",
      "rate": "",
      "helpful": "42 out of 48 found this helpful.",
      "title": "The best superhero cartoon ever.",
      "content": "This is every thing an adventure show should be. It has action, drama, comedy, tragedy and a truly Gothic feel (fitting that it takes place in Gotham). The interesting thing about the Batman character is that the only reason he becomes Bruce Wayne is to make enough money to fund his Batman work and to help the less fortunate. He's such a tragic character as he's given up a personal life for his parents dream. The stories are wonderfully intelligent and fun at the same time. There are very few poor episodes in this series (but note that their are some). Even lame villains like the Clock King and Mr. Freeze are made engaging and exciting. Ignore the movies and watch the series. Heck, at times it can even be much more realistic than the movies (like in \"I am the Night\") Some recommended episodes are: \"Almost Got 'Im\" (a poker game where Bat-Villain recount how they almost killed him), \"His Silicon Soul\" (a robot clone of Batman is a little too much like Batman too do a computers evil bidding) and \"the Man who killed Batman\" (in which a small time crook has seemingly killed Batman... by accident)"
    },
    {
      "username": "ilike69ing",
      "userUrl": "https://www.imdb.com/user/ur1115925",
      "reviewLink": "https://www.imdb.com/review/rw0301703",
      "warningSpoilers": false,
      "date": "13 March 2002",
      "rate": "",
      "helpful": "123 out of 131 found this helpful.",
      "title": "They Don't Make Them Like This Anymore",
      "content": "Perhaps the best animated series ever. It provides great accuracy in the stories and characters, while allows innovation and imagination. They \"pull no punches\" and didn't try to make this a kiddy show. It became the trend setter for \"Superman\" and \"Batman: Beyond\", even though neither can compare."
    },
    {
      "username": "dee.reid",
      "userUrl": "https://www.imdb.com/user/ur0892646",
      "reviewLink": "https://www.imdb.com/review/rw1896303",
      "warningSpoilers": false,
      "date": "20 June 2008",
      "rate": "10",
      "helpful": "12 out of 14 found this helpful.",
      "title": "A great \"Batman\"",
      "content": "I'm a comic book reader. I also watch a lot of television. \"Batman\" is one of the great shows that has everything we love about the DC Comics character created by Bob Kane and Bill Finger combined with the visual aesthetics of modern-day television. I'm not much a reader of DC's material (Marvel Comics and their Spider-Man and X-Men are my main interests), but Batman ranks as my favorite character from that particular company. While I'll agree that Batman has had a troubled history in terms of television and film (Tim Burton's 1989 \"Batman\" is my #7 movie of all time and is what got me interested in movies in the first place), I've also noticed that he has a massive base of overly rabid fans, many of whom become sore at the slightest change of the character. Well, this animated series appears to be an animation vision that they can finally be pleased with. Of course, Gotham City billionaire Bruce Wayne witnessed the murder of his parents as a child, and grew up to become the mythical \"Batman,\" the masked vigilante prowling the city's rooftops and taking out crime wherever it rears its ugly head. He's aided in his crime-fighting endeavors by his faithful butler Alfred while also nursing many personal demons. \"Batman\" carried over the 1989 film's dark and grim tone, the same tone as the comics that inspired it, as well as the revisionist re-workings of Frank Miller (like his epic \"The Dark Knight Returns\" and \"Batman: Year One\"), and proved to be a hit with fans and those eager to forget the campy Adam West show from the 1960s. With this darker approach to the character, it's quite easy to forget that this is a children's show, even though it's also quite obvious that it's aimed at a slightly older audience as well.Regardless, this is a \"Batman\" that we can all be proud of.10/10"
    },
    {
      "username": "hcl-1",
      "userUrl": "https://www.imdb.com/user/ur1643538",
      "reviewLink": "https://www.imdb.com/review/rw0301702",
      "warningSpoilers": false,
      "date": "11 March 2002",
      "rate": "",
      "helpful": "60 out of 62 found this helpful.",
      "title": "Finally, someone got Batman right.",
      "content": "Forget the camp & cheese of the previous Batman cartoons...this is a masterpiece! The depiction of Batman fighting both the psychos of Gotham City and his inner demons spawned from the murder of his parents years ago is superb. For years Anime had proved that animation need not be just for kids. Batman: The Animated Series solidifies that conclusion.Kevin Conroy has the perfect voice for both Batman and Bruce Wayne (there is a very obvious distinction). Mark Hamill gives the Joker sadism, sarcasm, and lunacy without resorting to goofiness. Efram Zimblast Jr. makes an excellent Alfred by being loyal, yet openly concerned about his employer's choice of career.This series is coming to DVD soon - I'm getting in line!"
    },
    {
      "username": "rebeccaajclarke",
      "userUrl": "https://www.imdb.com/user/ur148505644",
      "reviewLink": "https://www.imdb.com/review/rw7799376",
      "warningSpoilers": false,
      "date": "25 January 2022",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Awesome 1990's Animated Series based on DC Comics",
      "content": "I find Batman The Animated Series is very splendid, Because of the storylines are very dark, edgy and gritty in the good and awesome way, The Characters are very good, The Animation is very well done, I'm giving this a 10/10."
    },
    {
      "username": "jerekra",
      "userUrl": "https://www.imdb.com/user/ur18257075",
      "reviewLink": "https://www.imdb.com/review/rw1942504",
      "warningSpoilers": false,
      "date": "7 September 2008",
      "rate": "10",
      "helpful": "11 out of 13 found this helpful.",
      "title": "Batman at his best.",
      "content": "Batman the animated series is one of the best cartoon series ever. Originally aimed at young viewers it also is a series that is watched just as much by adults.This cartoon is different than most other cartoons. It is not just non stop action with no plot. The plots of the episodes from this series were amazingly good, good enough to be used for drama series. The dialogue and voice over work was amazing and the animation always remains the same through much of the series, spectacular.Batman is well portrayed in this series. He has no tolerance for anyone who violates the law. Relentless, he will not stop until he has accomplished what he sets out to accomplish. Batman has no fear in this cartoon. Bruce Wayne is also well portrayed in this show. He is a more than capable heir who keeps Wayne Enterprises running. Has a great sense of who to trust and what to do.One of the best things about Batman in general has been his villains. That is true here as well; Batman's villains in \"Batman the animated series\" are awesome. The Joker and his diabolical evil schemes. The Penguin and his various umbrella weapons. Poison Ivy and how she uses her evil plants against Batman. Two-Face(my personal favorite) and his good heads bad head coin that decides if he does evil deeds or not. The Mad Hatter and his obsession with controlling others minds. Scarecrow and his constant use of fear. Catwoman and her stealth not to mention her feelings for Batman. The Riddler and his mind twisting puzzles. Other great villains in this series are Killer Croc, Harley QUinn, Rupert Thorne, Clay face, and Mr. Freeze.I found it awesome how Mark Hamill and Roddy Mcdowell are the voices of the Joker and The Mad Hatter respectfully. I have the utmost respect for Hamill and his role in Star Wars and Mcdowell and his role in Planet of the Apes. So it is good to see such notable actors as characters in this show.In this D.V.D. (volume one) there are numerous great episodes, many of them two parters. Ones that I really like are \"Two-Face\", a part episode that explains the origin of how Harvey Dent became Two-Face. Also great is another two part episode titled \"Feat of Clay\", another two parter telling the tragic story of Matt Hagen who became Clayface. But you really cant go wrong with any episodes. They are all great.This is a great show. Must see. Check out Batman the Animated Series. After watching a few episodes you will see how good it is."
    },
    {
      "username": "Stefan_Loves_Movies",
      "userUrl": "https://www.imdb.com/user/ur116311545",
      "reviewLink": "https://www.imdb.com/review/rw7448302",
      "warningSpoilers": false,
      "date": "16 October 2021",
      "rate": "9",
      "helpful": "6 out of 6 found this helpful.",
      "title": "The Dark Knight",
      "content": "Batman: The Animated Series (1992-1995) is one of the critically acclaimed popular shows from the 90s for a good reason. The show was released close to 30 YEARS AGO as we speak, but despite all that, it's still holding up to today's standards! Kevin Conroy, OH BOY! This man is the embodiment of Batman! He managed to find the perfect balance between Bruce's voice and Batman's voice. Kevin Conroy, you're the MAN! The action isn't excessively violent, most of the episodes have a well-crafted narrative with a positive moral at the end. The only thing that's missing, in my opinion, is more continuity between the episodes. I feel like a stronger connection between them would have made the story more appealing, also it lacks a solid ending."
    },
    {
      "username": "Foreverisacastironmess123",
      "userUrl": "https://www.imdb.com/user/ur26149494",
      "reviewLink": "https://www.imdb.com/review/rw7911814",
      "warningSpoilers": false,
      "date": "2 March 2022",
      "rate": "10",
      "helpful": "6 out of 7 found this helpful.",
      "title": "This is my childhood, this is awesomeness, this is Batman the Animated Series, and I will always love it",
      "content": "In the nineties animated series came in all shapes and sizes, but the ones were few and far between that could truly stand the test of time and remain special and beloved to this day, and this was a show that was better than most of them! In fact I'd even say that it retains its magic and holds up far better than most of its nineties peers. As a kid I took to it probably from whatever episode I saw first, I seem to vaguely remember it being Christmas With The Joker.. Anyway I still love it quite simply because it's awesome, and the writing is so great, as is the characterisation that included real emotional complexity and imbued heroes and villains alike with a depth and frequent poignancy that I don't think I've ever seen done quite as well. The creative minds behind it all really used the mood and character appeal to full effect with all of the main characters. There was endless rich atmospheric moments and touches to take in and enjoy in and a lot of the episodes, especially the early ones have many beautifully gothic shadowy silhouettes and images that are so visually striking they are like artwork, the near monochromatic visual style and the way the characters move almost gave it the look of a comic book in motion, and the result was again, so very awesome! There are so many top episodes to choose from and positively countless nuances and moments, from the heartbreaking Heart of Ice and Baby Doll, Mad Love, to mind-bending and plain thrilling fun such as with Perchance To Dream and The Last Laugh and The Laughing Fish, those are just some of my favourites but any given episode will have certain touches of greatness in it, although not even this fine show was free of the odd stinker! Kevin Conroy and Mark Hamill, what can I even say, together it was they who were the lynchpins of this show. Their masterfully voiced hero and archvillain were always so engaging and entertaining to listen to, and they each embodied those iconic characters so perfectly that for a lot of people, me included, they have come to be the ideal versions of them. They both got to fantastically shine in such different ways many times, and they played off each other in that excellent way that Batman and his biggest nemesis should have, and Hamill was so freaking good that I think his Joker must have stolen every scene he was in and all of the Joker episodes are a lot of fun, even that dodgy one with the Joker themed casino! In closing I can't say enough good things about this show, it is incredibly deserving of an ideal ten in my eyes. It's a series that inspired a generation and was a fun part of many a childhood, and it remains riveting and wonderful to watch and more than holds up, to me it's a supreme animated series that will be forever classic."
    },
    {
      "username": "Terryfan",
      "userUrl": "https://www.imdb.com/user/ur6305926",
      "reviewLink": "https://www.imdb.com/review/rw3292171",
      "warningSpoilers": false,
      "date": "6 August 2015",
      "rate": "9",
      "helpful": "6 out of 7 found this helpful.",
      "title": "I am Veneance I am the night I am Batman",
      "content": "Batman: The Animated Series the greatest animation series that came from DC Comics.Many call the show the greatest animation series based off a super hero and it is with strong reason to believe too.Batman The Animated Series is a hit with both kids and adults that apply to every fan of the Dark Knight.The show just showcase what Batman is suppose to be and they did a phenomenal job with giving the characters of Batman justice. It also helps to have a superb cast and crew behind the series to make it one of the greatest animation series of the 1990sKevin Conroy as Batman/Bruce Wayne. When you listen to his performance to this day no one else has brought a more excellent job then Kevin Conroy he was born to voice Batman and no one has even come close to his performance he knows the character perfectly.Efrem Zimbalist Jr as Alfred Pennyworth was the right choice and he made Alfred a important figure in the series. Bob Hastings as Commissioner Gordon was the smart choice for the role because he brought the character to attention.As for the villains there was a excellent collection of villains many fan favorites too that made the show. Mark Hamill as The Joker without question Mark was born to voice The Joker and the fact he really puts his whole being into the character makes you respect his performance he just made the villain a more powerful legend. Richard Moll as Harvey Dent/ Two-Face just his voice work along makes you go WOW. Arleen Sorkin as Harley Quinn this character was original created for this series but has since become a fan favorite and with good reason. Adrienne Barbeau as Catwoman/Selina Kyle she was the perfect woman for the job. Diane Pershing as Poison Ivy she help bring a legend to life and make her a hit with the fans.The show also feature a well done job with Mr.Freeze (my favorite Batman Villain), Clayface, Man-Bat, The Penguin and others. The voice acting is just phenomenal you can tell in the voice performances that each actor really wanted to give it their all in their performances and it shows too. The cast really brought the characters to life The Animation is dark and matches the story line for the series each episode raise the bar to try and outdo each other. So many great episodes came from this series some of my favorites would be \"Heart of Ice\" \"Feat of Clay\" \"Joker's Favor\" \"Pretty Poison\" \"The Last Laugh\" \"The Clock King\" \"Fear of Victory\" \"Two- Face\" \"Tyger Tyger\" \"Beware the Gray Ghost\" \"Terror in the Sky\" \"Joker's Wild\" \"Almost Got 'im\" The intro for the series also was the brilliant way to set up the show and it work like a charm. The writers really brought the series to life along with many quotes that are regard as masterpiece quotes Trust me Batman: The Animated Series is a masterpiece a real classic and a series that really does a great justice for Batman and the fans. Check out Batman The Animated Series you'll love it I am Vengeance I am The Night I Am Batman!"
    },
    {
      "username": "Mysterygeneration",
      "userUrl": "https://www.imdb.com/user/ur104853183",
      "reviewLink": "https://www.imdb.com/review/rw7678038",
      "warningSpoilers": false,
      "date": "24 December 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Want to get to know Batman without being sadistic? Watch this cartoon.",
      "content": "Batman: The Animated Series stands out from the throng of Batman adaptations thanks to its stylized animation, dark stories, and sophisticated character development. Amazing show, I appreciate how different characters and suits are introduced throughout the course of the five seasons, by far the best Batman television show in my view. Bane, like Catwoman and Penguin, is denied an origin episode, and while Batman briefly describes the events that led to Bane's change, we never see Bane's emotional response to those events. Though Batman has always dabbled in the dark, this particular program combines Bruce Wayne's gothic grit with the quirky extremes of a notable rogue's gallery. Overall, I think this is a fairly nice series with a few great episodes and only a few absolutely uninteresting episodes. Essentially, it is a big season that continues the animated series, and both programs are worth viewing together."
    },
    {
      "username": "Tobeshadow",
      "userUrl": "https://www.imdb.com/user/ur139567100",
      "reviewLink": "https://www.imdb.com/review/rw7438799",
      "warningSpoilers": false,
      "date": "13 October 2021",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Simply the best!",
      "content": "My number one Saturday morning cartoon as a child and totally responsible for my love of the Batman character.The dedication put into this series sets it far above pretty much any other cartoon of its type. Drawing heavily on the 'live action' Batman of Tim Burton, but with a greater canvas to explore expressionistic and gothic style, the animation is completely unique with marvellously grand music to match. There's a timeless quality here, everything feels strangely familiar and storied, yet at the same time bold and new. Utterly brilliant."
    },
    {
      "username": "Quinoa1984",
      "userUrl": "https://www.imdb.com/user/ur0453068",
      "reviewLink": "https://www.imdb.com/review/rw1738770",
      "warningSpoilers": false,
      "date": "30 September 2007",
      "rate": "10",
      "helpful": "6 out of 8 found this helpful.",
      "title": "one of the most entertaining cartoons on TV in the 90s, and not simply for kids!",
      "content": "The first Batman animated series of the 90s was simple and direct: a TV show not just for kids looking for a good fix with their cereal watching Saturday morning toons, but for fans of the comic books, die hard ones to a fault. Every villain one could want, or maybe even forget to think of, is featured- Joker, Two-Face, Riddler, Mr. Freeze, Penguin, Catwoman, Scarecrow, Harley Quinn, et all- and for much of the show with really captivating single stories &/or continuing story-lines. And for one who still is in love with the original Tim Burton films, Joker especially is given great showcasing in his episodes (i.e. Christmas with the Joker, the Last Laugh), and always with a sense of true gallows humor. But in every episode, as perils come and go and characters get added on like Robin or Vicki Vale, there's depth to what are essentially loose-to-tight translations of what came in the comics.What's impressive too is that, as an adult now, I still respect and enjoy the episodes from the original series very much, maybe even on a slightly differed planed than when I was younger and it was only a casual interest. There's a pulp quality to the show that is brought to a richer point by the artistic nature of it- it's not only about bringing in the cash with the franchise, but expanding and fleshing out the graphic nature of the comics. While we don't get too much that would probably put off the little ones (only once or twice did a Frank Miller comic get adapted for the series), there's enough to keep the older fans captivated, the ones who were around to see the Adam West Batman series (probabbly the king of campy 60s TV) and wonder if there's more than just the movies or the new & improved. In fact, it's the kind of series that will likely appeal, if only in small spurts or on the occasional viewing, to those who aren't big Batman fans.As for me, the entire series on DVD will be the only way to go, to catch up on all the good times with the Dark Knight."
    },
    {
      "username": "Christopherreferee",
      "userUrl": "https://www.imdb.com/user/ur43837891",
      "reviewLink": "https://www.imdb.com/review/rw3697831",
      "warningSpoilers": false,
      "date": "1 May 2017",
      "rate": "10",
      "helpful": "16 out of 17 found this helpful.",
      "title": "Greatest cartoon series of all time!",
      "content": "This was a show I watched as a kid and I remember the dark beginning intro that used to start and the breathtaking episodes that are action packed and always leaving me wanting more. That is the reason this deserves a 10/10 and is the greatest cartoon series of all time. It's great to have a show that is not just for kids as a lot of adults have grown up watching this and still do now, that is what makes it wonderful as you can enjoy it at any age! With great voices like Kevin Conroy and Mark Hamill what is there not to love. If you are wanting to start watching a superhero cartoon show then I must point you towards batman the animated series as it is something you can watch over and over again and never grow tired of it."
    },
    {
      "username": "refresh_daemon",
      "userUrl": "https://www.imdb.com/user/ur0812631",
      "reviewLink": "https://www.imdb.com/review/rw1976344",
      "warningSpoilers": false,
      "date": "16 November 2008",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "A definitive work in television animation; a legacy that might remain unmatched",
      "content": "\"Batman\", later dubbed \"The Adventures of Batman and Robin\" and then rebooted to \"The New Adventures of Batman\" after a couple years of absence, is probably the most significant animated incarnation of the Caped Crusader there ever was. To some, it is the definition of who the Batman is, stripped of the extremely complex and often retconned story lines in the comic. And while some comic book purists may scoff at the PG nature of the show, I think that most viewers, both child and adult, found a lot to appreciate in its surprisingly mature storytelling, gorgeous animation and its lasting impact on both animation and well as the overall legacy of the Dark Knight.\"Batman\" was the birthplace of the DC Comics animated universe, which would later spawn additional shows featuring the Man of Steel as well as the Justice League. A far cry from the more lighthearted version of Batman found in the campy old television show, this Batman had a lot more in common with the 1989 film, including its early scoring. However, it wasn't a cartoon take on the movie, rather, it was a synthesized take on Batman, bringing in characters from all over Batman's history and sometimes rewriting their history as well as creating all new characters, some of which proved to be so popular they ended up entering the comic book's universe.The stories are primarily anthology, with a few two-parters here and there. However, this format works pretty well for the show and somehow, it avoids becoming a \"villain of the week\" premise by creating some very unique stories even while presenting a villain each week. Even early on, Batman provided a Rashomon-style tale in \"P.O.V.\" with three cops providing their take on what happened when the Batman showed up at a crime scene. Later stories include extended nightmares, fantasies, epics, romances as well as stories that introduce Batman's allies, such as Robin. And although the show is titled Batman, it often is willing to make the Bat a supporting character in exploring the other characters in its universe, to great result.\"Batman\" also can't be mentioned without talking about the amazing art. Here is a take on Batman, setting it in a gorgeous strongly art-deco inspired world, which is immediately eye-catching and sets a remarkably consistent tone for the series. Furthermore, one thing you'll quickly notice is that the show is dark. Perhaps in themes sometimes, but especially in color. In the DVD commentary, you learn that the show is actually painted on black instead of white, which leads it to have an incredibly dark overall look, which further helps paint the grim world that the Batman inhabits.And then there's the acting. Kevin Conroy essentially created what would become what we know as the Batman's voice, alternating between the lighter playboy Bruce Wayne and the gruff growl of Batman. Mark Hamill (yes, Luke Skywalker) also helped create one of the definitive versions of the Joker with a laugh that can't be forgotten. Almost all the acting over the show's long run is remarkable, making it hard to replace these versions of the characters with others, even from the movies.Halfway through its first run, the show's title was changed and reflected the stronger incorporation of Robin and other supporting characters, but outside of a less interesting title sequence, the show pretty much stayed the same. Then the show ended and the team went on to work on the \"Superman\" series, but revived \"Batman\" again in the \"New Adventures\". This incarnation revamped the art style to be more angular, simpler and sometimes much darker--the Scarecrow especially became rather creepy. The show also changed even more to incorporate extended allies into the story, including a young Tim Drake as Robin, the persistent presence of Barbara Gordon as Batgirl and even the older Dick Grayson makes several appearances as Nightwing. Although I was hesitant to embrace the new incarnation at first, it become clear to me that the storytelling as well as the presentation remained strong, with some great episodes that would stand with the best of its previous incarnation.Because of its impact on animation and the titular character, its willingness not to dumb down for children, its wise storytelling, its amazing art and the inescapable legacy of entertainment in my life, \"Batman\" remains one of the greatest animated series that I have ever witnessed. Even today, though its been well over a decade since the show debuted and almost a decade since the \"New Adventures\" ended, the show remains incredibly engaging. This is definitely a series that endures and perhaps one that I would continue to watch over the years, as an adult to appreciate the depth of the stories and the gorgeous art, and a series that I would not hesitate to share with appropriately aged children. Recommended without reservation. 10/10."
    },
    {
      "username": "adamsmith-51004",
      "userUrl": "https://www.imdb.com/user/ur61456303",
      "reviewLink": "https://www.imdb.com/review/rw6744363",
      "warningSpoilers": false,
      "date": "26 March 2021",
      "rate": "10",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Possibly the best version of Batman",
      "content": "This series is outstanding and quite rightly deserves all the pluadits. I remember watching Batman The Animated Series from around the age of 5 or 6 in the early 90's and it has to be considered the pinnacle of cartoon animation. The animation design is beautiful, writing is high quality (better than anything else around at that time and possibly still 25 years later), and the character voice work is perfect. Everything about this series is first class and the producers and writers clearly understood who Batman is and the world he inhabits."
    },
    {
      "username": "Aaron1375",
      "userUrl": "https://www.imdb.com/user/ur1111192",
      "reviewLink": "https://www.imdb.com/review/rw2533786",
      "warningSpoilers": false,
      "date": "17 December 2011",
      "rate": "9",
      "helpful": "4 out of 5 found this helpful.",
      "title": "A series sparked by the success of the first Batman film and was better than all the Batman films of the 90's.",
      "content": "I saw this show on occasion back in the day and have to say, like the Superman cartoon that was made during this same era this was a very good show as well. It was a much better representation of the corny Batman live action show of the 60's with Adam West and Burt Ward and it never got as strangely dark or corny as the films of the 90's. You got to see many of Batman's best foes on the show with the Joker of course taking the lead and this show actually introduced a new villain who became so successful that she made her way into the comics, Harley Quinn. I never knew she was first introduced in this series until reading some stuff as her character is so polished and well done it just seems that she would have been introduced in comic format first. However, a couple of Batman's villains kind of drew the short straw and were vastly underused in this series too. Bane is one of these, however at the time he was a new character in the comics so I can see why they did not use him quite as much as others. Though if they can do such a good job with a all new character you would think they could write for a character that had been in a number of comics near the end of this show's run. Another character that was underused and there really is less excuse is the Riddler. I enjoy this character and I think he may of had three or four episodes and none of them really did a good job of using him. However, they did a wonderful job on Mr. Freeze, certainly compared to the horrid way he was portrayed in the movie \"Batman and Robin\". Mr. Freeze became my favorite villain during this show's run aside from the Joker. Speaking of the Joker, Mark Hamill does an outstanding job of doing the Joker's voice as does the man doing Batman. This is also the best Batman as it is just easier to make a person look in excellent shape and still have him not sound dumb as a rock. Michael Keaton looks to dorky as Wayne, Christian Bale looks the part, but some times you simply cannot understand what the man is saying. This one looks the part and sounds the part, to bad they can't find a guy who looks and sounds half as good as the one depicted in this show. Very good cartoon, they do not make them like this anymore."
    },
    {
      "username": "griffolyon12",
      "userUrl": "https://www.imdb.com/user/ur6136793",
      "reviewLink": "https://www.imdb.com/review/rw1609451",
      "warningSpoilers": false,
      "date": "1 March 2007",
      "rate": "10",
      "helpful": "5 out of 6 found this helpful.",
      "title": "The Best Show Ever!",
      "content": "I love this show.I remember waking up early every Saturday morning to go downstairs to watch this show.I loved it back then because of the amazing action and I was a huge Robin fan as a child.Now as I've gotten older I've bought every episode of the show on DVD to take a nice trip down memory lane,but I have found something more than just memories.When I was younger I didn't fully appreciate the stories and animation,but now that I re-watch this show I notice all of the shows amazing production values.The stories are superb,very well thought out and well orchestrated.There are very few shows on in Prime Time television now with such amazing and well written stories.And the animation was very fluent and realistic,but the art style is what ultimately steals the show and makes it unique.The Art Deco look just suits the character of Batman and his world perfectly.But what holds the whole show together and adds that extra ounce of flavoring to it is the music,voice acting,and sound effects.Each fight features some new sound effect you've never heard before,and the music sells the mood of each scene(and I believe the shows theme songs,because there are two,are the best theme songs ever).And the voice acting is top notch,they cast these voices to their respective characters perfectly(Kevin Conroy IS Batman).Now about 14 years or so later,I went back to watch this show to take a nice trip down memory lane and came out loving the show just as much maybe even better than when I was a kid.I love this show and it is definitely one of my favorite T.V. Shows of all-time,a perfect 10 out of 10!!!!!!!!"
    },
    {
      "username": "Mr-Fusion",
      "userUrl": "https://www.imdb.com/user/ur1994077",
      "reviewLink": "https://www.imdb.com/review/rw3340314",
      "warningSpoilers": false,
      "date": "22 October 2015",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "It set the bar",
      "content": "\"Batman: The Animated Series\" made its indelible mark on me when I was a kid and it's no secret why this show's still my favorite interpretation of the Dark Knight. You can look at an episode like 'Heart of Ice' or 'Almost Got 'im' and immediately get what this series is about: pathos, but also a playful spin on the rogues gallery (which is extensive); it spends some time on Bruce's inner torment but also has plenty to offer fans of all ages.And just look at the laundry list of character actors they got for these roles. Feels like I'm always hearing someone new even after watching this show for more than twenty years. And there's a reason why Kevin Conroy and Mark Hamill still appear in modern movies and video games (as Batman and The Joker, respectively): they're ideal. The proof is right there. And this is the show that introduced Harley Quinn, a character so good DC assimilated her into comics continuity.Like any show, it's not without its clunkers ('Christmas with the Joker', anyone?), but this is a brilliant TV show, with one foot in noir aesthetics and the other in old Hollywood entertainment (you can frame and wall-mount any of those title cards).It is exemplary.10/10"
    }
  ],
  "errorMessage": ""
}