{
  "imDbId": "tt0384766",
  "title": "Rome",
  "fullTitle": "Rome (TV Series 2005–2007)",
  "type": "TVSeries",
  "year": "2005",
  "items": [
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8697842",
      "warningSpoilers": false,
      "date": "27 November 2022",
      "rate": "10",
      "helpful": "52 out of 53 found this helpful.",
      "title": "Incredible!!",
      "content": "Rome is a very detailed and historically accurate show that will keep you hooked throughout the series. It really is one of the most underrated tv shows ever created and a true masterpiece that is pretty much loved by anyone who has ever seen it. Just read through the reviews to see how loved this show really is! It's only two seasons long but those two seasons were damn near perfect! The acting, writing, directing, cinematography, production, etc. Are all fantastic. It doesn't get nearly the recognition it deserves because it wasn't advertised that much when it was on and pre social media so word of mouth was hard back then. I really can't say anything more that hasn't already been said about this terrific show except to just go watch it!"
    },
    {
      "username": "jacksflicks",
      "userUrl": "https://www.imdb.com/user/ur0060066",
      "reviewLink": "https://www.imdb.com/review/rw1182388",
      "warningSpoilers": false,
      "date": "28 September 2005",
      "rate": "10",
      "helpful": "546 out of 594 found this helpful.",
      "title": "The Best Yet?",
      "content": "I Claudius was maybe the best miniseries ever. Now, there's Rome, and it's even better. I agree with another reviewer, that quibbles about historical inaccuracies, such as accents or how old so-and-so should be, are silly pedantry. I've been a Roman history buff ever since my own high school triumvirate of Caesar, Cicero and Virgil, and I say that this historical fiction is both exciting AND quite accurate with the important stuff.So far, every player has been terrific, in particular Ciarán Hinds as Caesar and Max Pirkis as Octavian. Julius Caesar was perhaps the most complex \"great\" figure in history. Was he a great populist, trying to champion the people against the Optimates, or was he an ambitious demagogue, who was using the Roman mobs to attain the imperium? Hinds depicts this complexity perfectly, while projecting a steely will that is shared by Caesar's emerging protégé, Octavian. Thanks to Max Pirkis's brilliant portrayal, we can already see the no-nonsense pragmatism, ruthlessness and brilliance that will propel this boy into becoming the greatest despot in history. And what about that dissolute Mark Anthony? We can already see Actium in his face. And with Atia, I think Livia (as depicted in I Claudius) and Messalina have met their match.And midst the struggle for mastery of Rome, we see the struggle of more common folk just to make a living. Rome makes the parallel stories of the Optimates and Centurian, now Prefect, Vorenus and Legionnaire Pullo a perfect vehicle for comparing the travails of different classes  their love lives, social lives, how they treated the servants, how they practiced their faiths, how they fought. Seen from these different perspectives (which we did not get with I Claudius), we get a three-dimensional view and, for me, the closest to feeling like one is actually there of any historical fiction ever produced.And look at the production values. Is it any wonder, when we see who's behind the camera  Michael Apted and John Milius  that we have an immaculately crafted work?By their commitment to quality of production and integrity of story, HBO and BBC are demonstrating what television can be. This is a wonderful, wonderful series. Anyone with a love of history, drama and spectacle should be devouring it with delight."
    },
    {
      "username": "cchase",
      "userUrl": "https://www.imdb.com/user/ur0541468",
      "reviewLink": "https://www.imdb.com/review/rw1160374",
      "warningSpoilers": true,
      "date": "28 August 2005",
      "rate": "",
      "helpful": "249 out of 282 found this helpful.",
      "title": "\"ROME\" If You Want To...",
      "content": "And if the premiere episode is any indication, you WILL want to. Leave it to HBO, to replace the dearly departed SIX FEET UNDER with a worthy substitute already. And considering how outstanding that series was, that's saying something for ROME, that it may be able to measure up to how far the bar has been raised for dramatic series in a premium cable format. Ten years in the planning and production, as lavish, sprawling, deep, dark and deviously, deliciously decadent as anything of its like, ROME combines historical figures with equally compelling fictional side characters, many of whom show us what it was like through their eyes, to bear witness to the heady rise and staggeringly shocking fall of one of the greatest empires in history.For those who like their summaries simple, you only need to know that the core of the doings in ROME is comprised of three major stories: the contentious relationship between Roman movers and shakers Magnus Pompey (Kenneth Cranham) and Gaius Julius Caesar (Ciaran Hinds), which grows even more fractious when Pompey's wife Julia, also Caesar's daughter, dies in childbirth. Then there's Roman centurions Lucius Vorenus (Kevin McKidd) and Titus Pullo (Ray Stevenson), two complex men struggling to do their duty and buck their fates as pawns in the machinations of the two leaders to which each is separately loyal, while testing the bond of their own tentative friendship, as much as the complications within their lives will allow.And, oh yes, what would any man be without the support of a good woman behind him...hopefully not with a dagger in her hand? In this case the women would be Atia (Polly Walker), an ambitious socialite and political strategist who makes Lady Macbeth look like a rank amateur, and Servilia (Lindsay Duncan), whose sweet and civilized demeanor more than likely hides the cunning and ruthlessness of a cobra. Oh, and does it bode well that Caesar is her secret lover, and that his confidant and friend, Cassius Brutus is also Servilia's son?Webs are being woven and plots are being planned even in the first few moments, and the mostly British cast is well up to the task (the series is produced in conjunction with the BBC). It's also a great sign that not all the heavy hitters are among the cast of characters, but also behind-the-scenes as well, (Michael Apted and John Milius are vital parts of the creative team, and directorial chores are being handled by everyone from Allen Coulter (THE SOPRANOS) to Alan Poul (SIX FEET UNDER).) Plus the sets which dominate the bulk of the world-renowned Cinecitta Studios in Rome itself have a startlingly authentic feel. Every penny of the $100 million-plus budget is apparent on screen and was well worth spending.Speaking of which, my TiVo is already set for the next episodes. Looks like Sundays will be well worth spending here, too."
    },
    {
      "username": "Leofwine_draca",
      "userUrl": "https://www.imdb.com/user/ur0482513",
      "reviewLink": "https://www.imdb.com/review/rw2518352",
      "warningSpoilers": false,
      "date": "14 November 2011",
      "rate": "10",
      "helpful": "89 out of 102 found this helpful.",
      "title": "The best TV series ever made",
      "content": "I've become so bored of mainstream television over the last decade that I now make a point of only watching series that are history-related, given my huge love of the subject matter. I missed ROME when it was first shown, but heard so much good about it that I caved in and bought the box set on Blu-ray. I'm so glad I did; believe the hype, ROME is the ultimate in costume drama.The series only lasted for two seasons before cancellation, but every episode is a winner. There are two story strands running through: the big story and the little story. The big story is concerned with the legendary figures of history - in the first season Julius Caesar and his cohorts, and in the second Mark Antony. The little story looks at the minor characters, the soldiers and families involved with the politics of their era.The script crackles with realistic dialogue and the characters are superb. Not just Pullo and Vorenus, but also Atia and her offspring, Brutus and his mother, even the minor players who are awarded little dialogue. Every actor is amazing, with Ciaran Hinds stealing the show in the first series and James Purefoy in the second.I'm pleased that the producers went all-out in making an adult drama, not skimping on the sexual content or the violence. It's hard to pick highlights in a series that never puts a foot wrong, but Pullo's diversion in the gladiator arena is hard to beat in terms of its sheer power. The ending of season two, with Antony descending into madness, is chilling and moving in equal measure.It took a good few years, but I'm pleased to report that TV producers are finally capitalising on ROME's success and beginning to make similar products as they realise a market for adult-focused historical drama. Already we're seeing the likes of SPARTACUS (three series and counting), CAMELOT, GAME OF THRONES, THE BORGIAS and THE TUDORS, each of them indebted to ROME in some way. I'll enjoy watching them, but I doubt any will equal the quality of this."
    },
    {
      "username": "tkdlifemagazine",
      "userUrl": "https://www.imdb.com/user/ur88886235",
      "reviewLink": "https://www.imdb.com/review/rw8519596",
      "warningSpoilers": false,
      "date": "6 September 2022",
      "rate": "8",
      "helpful": "27 out of 28 found this helpful.",
      "title": "One of the Best Historical Series",
      "content": "This was one of the most exciting and historically interesting series on HBO. It was a shame that it only lasted two seasons. This look at the Rise and Fall of Julius Caesar during the Roman Empire was so interesting, historically accurate, and attended to details. The series was framed as being seen through the eyes of two Roman Centurians mentioned in a speech of Julius Casear in real life is engaging from moment one. It is also filled with explicit sex and violence. The Direction and cinematography are worthy of any motion picture. The costumes are wonderful. The acting is top notch by the lead and supporting cast. This is how historical series should be done."
    },
    {
      "username": "Ed-Shullivan",
      "userUrl": "https://www.imdb.com/user/ur31328960",
      "reviewLink": "https://www.imdb.com/review/rw8140246",
      "warningSpoilers": false,
      "date": "13 May 2022",
      "rate": "8",
      "helpful": "24 out of 25 found this helpful.",
      "title": "The hierarchy of the Roman empire and the political strategies used to remain the superior leader are being challenged in each and every episode",
      "content": "Mrs. Shullivan and I watched this series about 15 years ago so we decided to just watch the first episode once again to refresh our memories of the series. Boy was that a GOOD decision as we then proceeded to binge watch the two (2) seasons series over the following several days. We remembered certain moments within the series where the main characters were under pressure to either maintain their current political and/or hierarchal status either winning and sometimes losing the inevitable battle on the field(s) or in the political arena of the Roman congress.The two characters that really stood out for me were Ray Stevenson who plays Titus Pullo, the bravest and strongest man of the 13th Legion army, and the political savvy young genius Gaius Octavian played by Max Pirkis. Both Mrs. Shullivan and myself enjoyed the scenes whenever Titus Pullo and/or Gaius Octavian the so called boy Caesar were involved in. Titus at one point is assigned the role of teacher to the young Gaius Octavian to ensure he understands the risk and reward of field battle.Through time though it is actually the brute Titus Pullo who has to have his head right on his shoulders as he is continually placed in awkward situations representing both friend and foe at different intervals in the series episodes.The women in this series certainly also have their moments where they upstage the men and without giving away any spoilers suffice to say that hell hath no fury than a woman's scorn.This is an excellent dramatic, edgy, action filled two season series consisting of 22 episodes all of which have some intriguing story lines. If you are not comfortable with full nudity than this series is not for you as the debauchery of the Roman empire is also in full view, with minimal censorship and sometimes gross blood and gore.I give the series after watching the 22 episodes for a second time in two decades a well deserved 8 out of 10 IMDb rating."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw7244344",
      "warningSpoilers": false,
      "date": "19 August 2021",
      "rate": "10",
      "helpful": "49 out of 53 found this helpful.",
      "title": "Brilliant!",
      "content": "Rome really is one of the most underrated tv shows ever created and a true masterpiece that is pretty much loved by anyone who has ever seen it! Just read through the reviews to see how loved this show really is! It's only 2 seasons long but those 2 seasons were damn near perfect! The acting, writing, directing, cinematography, production, costumes, etc. Are all fantastic. It doesn't get nearly the recognition it deserves because it wasn't advertised that much when it was on and pre social media so word of mouth was hard back then. I really can't say anything more that hasn't already been said about this terrific show except to just go watch it!"
    },
    {
      "username": "angelorwez",
      "userUrl": "https://www.imdb.com/user/ur150272282",
      "reviewLink": "https://www.imdb.com/review/rw8103427",
      "warningSpoilers": true,
      "date": "30 April 2022",
      "rate": "8",
      "helpful": "24 out of 25 found this helpful.",
      "title": "fantastic",
      "content": "Am not so sure am sad about this show being cancelled...i kept watching even though i already knew all the plot points...i knew what would happen to ceasar to cleopatra to Anthony...but i still wanted to watch...but eventually i guess you no longer can...and two seasons was the perfect endinghow the plot unfolds is done so incredibly well...the pacing is marvelous...the character building is phenomenal...the idea to use the soldiers as plot drivers was fantasticvery good show...very few can rival its storytelling quality."
    },
    {
      "username": "TaylorYee94",
      "userUrl": "https://www.imdb.com/user/ur102296684",
      "reviewLink": "https://www.imdb.com/review/rw8847071",
      "warningSpoilers": true,
      "date": "2 February 2023",
      "rate": "9",
      "helpful": "28 out of 30 found this helpful.",
      "title": "Great and almost perfect mixture of historical events and fictional characters.",
      "content": "Timeline of Roman history is framework, and imaginary additions of characters and stories are furniture and interior design. Caesar's rise and fall, Octavian's journey to an emperor, and even politics of Roman republic are well-researched and presented with reality. Because audience has knowledge of major events, they know where they are in chronological sense. On the other hand, the relationship between Anthony and Atia, Caesarian's birth, and Vorenus & Pullo's adventure are totally unexpected but so captivating. Two parts are complementary; because of intriguing storyline, I wanted to know more about actual events and researched the history myself, and the framework provides safe place for imagination to flourish. Plus the last episode is perfection: great reveal, well-deserved ending for villain, karma, and reunion."
    },
    {
      "username": "J5iftY5iveXtreme",
      "userUrl": "https://www.imdb.com/user/ur4771145",
      "reviewLink": "https://www.imdb.com/review/rw1177388",
      "warningSpoilers": false,
      "date": "21 September 2005",
      "rate": "",
      "helpful": "345 out of 372 found this helpful.",
      "title": "a feast for the eyes!",
      "content": "HBO's \"Rome\" is perhaps one of the best historical TV shows there ever was and one of the best HBO has ever produced.Set during the first century B.C., this TV show tells the tale of two Romans serving in the army, Lucius Vorenus and Titus Pollo. Vorenus in a strict, humorless and hard-working centurion, expecting his troops to obey him and is a loyal citizen of Rome. Pollo is muscular, carefree, party-loving, and womanizing, yet he is also a faithful, trustworthy friend, loyal companion, and overall lovable character. These two military men serve in Julius Caesar's army and live during a time of turmoil in Rome.Originally planned as a TV miniseries, \"Rome\" has become an actual TV show. This TV show is mostly fictional, but it incorporates historical characters like Caesar, Pompey, Cato, Mark Anthony, and Atia, the most of Octavian, soon to become Rome's first emperor, Augustus. It is a time when the Roman Republic is corrupt, and high-ranking Romans like Julius Caesar and Pompey fight for power. The historical events in Rome are told thru the eyes of Vorenus and Pollo.The script is intelligent and realistic, with some profanity, violence, and decadence. Unlike most portrayals of Rome, which tend to be clean and sanitize things, this is a graphic portrayal of Ancient Rome, complete with drunkards, brawlers, womanizers, prostitutes, adulterers, fornication, and loads of sexual acts. This TV series do not attempt to hide the dirty aspects of the Roman Empire. Rather, it is a honest depiction of the Empire, portraying its decadence and wickedness.As for the production, one word - great! The sets are huge and realistic, with the viewer feeling as if he/she is in the middle of the scene. The costumes, too, are realistic and accurate. The sets, props, and costumes, etc. show signs of research. The actors and actresses did a great job, too, portraying their characters realistically.Overall, this is a great series. I will be expecting more seasons of this."
    },
    {
      "username": "bemyfriend-40184",
      "userUrl": "https://www.imdb.com/user/ur101021599",
      "reviewLink": "https://www.imdb.com/review/rw7489686",
      "warningSpoilers": false,
      "date": "28 October 2021",
      "rate": "10",
      "helpful": "27 out of 30 found this helpful.",
      "title": "Guardians of the Galaxy",
      "content": "A couple of years ago, I saw Marvel's Guardians of the Galaxy. It was kind of childish. Then, out of curiosity, I watched a clipping of HBO's Game of Thrones, on YouTube. It was so much more mature and intelligent than the Marvel film. I borrowed the Game of Throne series DVD's, from my local public library; and binged all eight seasons. At the time, I thought it was the best series to ever be shown on TV. That is, until I saw Rome, on Tubi; the free streaming site. Sorry this isn't a helpful review. But Rome is great. I loved this series. Binge-watch it, if you can."
    },
    {
      "username": "Unknownian",
      "userUrl": "https://www.imdb.com/user/ur4413828",
      "reviewLink": "https://www.imdb.com/review/rw8735916",
      "warningSpoilers": false,
      "date": "14 December 2022",
      "rate": "9",
      "helpful": "29 out of 31 found this helpful.",
      "title": "Season 1 vs Season 2",
      "content": "This Roman history lesson is all you will ever get from Hollywood that is anywhere close to the truth. However, it still took artistic license too far in my opinion.It's one thing to have fictitious characters in a story to see it from a misanthropic perspective, or to help move it along, and it's another thing to mix fictitious characters into real events to make it more convenient for the story tellers.Writers, directors, and producers have a responsibility to their audience when they are presenting productions based on history...especially Roman history, because of the length of time they ruled the world, and how all other governments on this planet took some of Rome's example.Three things bothered me about this series: First, our two fictitious friends whose family, and enemies are so beautifully written to keep us all wanting more, should not be mingled in with the actual history itself. It's pandering, and misleading.Second: The new Octavian can't hold a candle to the original actor. I'm beginning to think that the first actor who played Octavian was too likable, and in history Octavian was not a likeable character. Or, perhaps he was just too young to play an adult leader. In either case, they did a terrible job replacing him. The the new actor had none of the seriousness, or smarts the original actor had, and he smiled in all the wrong places. I don't think I can even remember a scene in the 1st season where Octavian cracks a smile. He was all business, and damn good at it. The change almost ruined the 2nd season for me.Third: I loved the first season. It was glorious, and well done though the gratuitous sex, and violence may have been overdone a bit ...even though it was a big part of Rome... it's a big part of 'everywhere' and 'every time'. My main beef with season 2 besides the new Octavian character, is that it felt like they changed whomever was in charge of everything. It was slower, more repetitive, and edited like a drawn out soap opera.The film makers definitely lost some of their creative talent in season two. Still...this is about as good as it gets on television."
    },
    {
      "username": "Kirpianuscus",
      "userUrl": "https://www.imdb.com/user/ur61197531",
      "reviewLink": "https://www.imdb.com/review/rw3347652",
      "warningSpoilers": false,
      "date": "2 November 2015",
      "rate": "",
      "helpful": "13 out of 14 found this helpful.",
      "title": "more than good intentions",
      "content": "recreating Rome. its smells, people, hidden fights, great names. to understand the Roman life style. to imagine a world who has its rules and its moral code. that is the the key for discover that ambitious series who ignores taboos and give the flavor of an ancient society without seductive clichés. a gem not for - only- artistic virtues, costumes or script. but for a realistic portrait of the world from Latin/History class. not heroes. only people in delicate situations. not changes. only special forms of survive. adventures. sex. and the need of power. nothing new, at the first sigh. but the mixture is strange and not easy to accept. because the series has the strange idea to give a honest image about an ambiguous world."
    },
    {
      "username": "MajBlade2",
      "userUrl": "https://www.imdb.com/user/ur47115801",
      "reviewLink": "https://www.imdb.com/review/rw7525687",
      "warningSpoilers": false,
      "date": "7 November 2021",
      "rate": "10",
      "helpful": "22 out of 24 found this helpful.",
      "title": "Best story out there",
      "content": "Im going to keep this short and sweet. Best version of Rome during that time Ive ever seen As one with a masters in History with a emphasis on Ceasers Gallic conquest Yes some things are fictionalized of course they are. But so much they got right. You can read through tomes of dry roman history or my suggestion read the books Master of Rome by Colleen McCullough.One last thing Polly walker in first episode man that woman has a pair of ......"
    },
    {
      "username": "mlynch5187",
      "userUrl": "https://www.imdb.com/user/ur50353664",
      "reviewLink": "https://www.imdb.com/review/rw7126866",
      "warningSpoilers": false,
      "date": "16 July 2021",
      "rate": "10",
      "helpful": "25 out of 27 found this helpful.",
      "title": "Epic",
      "content": "Simply put, this is one of the most underrated shows of all time. The attention to detail is absolutely astounding. The story arcs are captivating. Although only two seasons long, Rome is like reading a gripping novel!"
    },
    {
      "username": "CelluloidRehab",
      "userUrl": "https://www.imdb.com/user/ur2812098",
      "reviewLink": "https://www.imdb.com/review/rw1205945",
      "warningSpoilers": false,
      "date": "31 October 2005",
      "rate": "8",
      "helpful": "46 out of 55 found this helpful.",
      "title": "When in Rome ....... remember to cross the Rubicon",
      "content": "HBO does it again. I got my start with the network back in 1990 with a sitcom called Dream On. From there, I have followed the yellow brick road through Sex and the City, Sopranos, Six Feet Under, Band of Brothers, From the Earth to the Moon and Deadwood (not to mention hours and hours of boxing, documentary specials and tons of movies).HBO now presents a miniseries about the Roman Empire, appropriately called \"Rome\". The story revolves around the time Julius Ceasar conquers Gaul, and the subsequent years following that (Ceasar's rise to dictator). The series delves into historical and archaeological records, with a dash of artistic licensing to create an environment that seems so real. For the most part the series is divided into 3 parts :1) Julius Caesar's rise to unanimous political power.2) The exploits (in the field and at home) of a Roman officer, Luscious Vorenus, and one of the soldiers under his command (whom becomes his friend), Titus Pollo.3) The various political and social interactions and manipulations of Caesars relatives, namely Atia and her two offspring, Octavian and Octavia.4) Post Caesarian Rome. The production of this series is quite breathtaking. It seems like they took into account so many of the variables ; costumes, jewelry, architecture, religious practices, mannerism, military units, social venues, politics, class structure,etc. to bring the empire back to life in the 21st century. They went as far as to train the extras portraying the Roman soldiers in boot camp fashion. All were to sleep in tents outside and were provided with no modern amenities.This series has something for everyone with a strong stomach and inclination towards the graphic. The show is going for authenticity. This is not Rome seen through the eyes of 21st century people, but rather through they eyes of 1st century BC Romans. It has action, graphic violence, sex, incest, betrayal, murder, Machiavellian scheming, politics, family bonding, war,etc. I just can't begin to describe just how authentic the show feels and how hypnotically captivating it is to watch (especially in High Definition). I can't help but feel that John Milius (as a writer and executive producer) has brought some of the same grit and grime from Conan (albeit with a more historic flavor). Also on the writing credits is work from Entourage, Sex and the City, Band of Brothers and Desperate Housewives.The acting core is quite good, consisting mostly on an English cast with theatrical experience. Their performances are quite good and contains many veterans and some newcomers (at least to me). Such standouts would include : Indira Varma (of Kama Sutra fame) who plays Luscious' wife Niobe, Kerry Condon (whom I first saw in Jet Li's Danny the Dog) as Atti's daughter Octavia, Kenneth Cranham (Jimmy from Layer Cake) as Pompey, Kevin McKidd (from Trainspotting and Dog Soldiers) as Luscious, Polly Walker as Atia and Ray Stevenson as Titus.To add to the authenticity, the series was shot at Cinecitta Studios in Rome. This gives the series an extra flavor. I highly recommend this series, but only for those that can stomach graphic sex, violence and a lot of the Queen's English. It is currently my favorite show, and wishing it could last 1000 years.-Celluloid Rehab"
    },
    {
      "username": "jestak",
      "userUrl": "https://www.imdb.com/user/ur21218802",
      "reviewLink": "https://www.imdb.com/review/rw8071845",
      "warningSpoilers": false,
      "date": "18 April 2022",
      "rate": "9",
      "helpful": "22 out of 23 found this helpful.",
      "title": "Very well done",
      "content": "I loved this series. It was well written, well acted, and fairly close to historically accurate as possible, everything considered. It was an expensive series, and you can tell. The quality of the sets, the exterior scenes...so well done. I laugh at the detractors, I mock them.This is NOT a documentary. Get over it. I loved this production, from start to finish. Well worth watching, and I've seen it probably 20 times."
    },
    {
      "username": "auuwws",
      "userUrl": "https://www.imdb.com/user/ur118977607",
      "reviewLink": "https://www.imdb.com/review/rw6195814",
      "warningSpoilers": false,
      "date": "22 October 2020",
      "rate": "9",
      "helpful": "26 out of 31 found this helpful.",
      "title": "Rome",
      "content": "A very excellent series and a very good acting performance by most of the actors, especially those who played the role of August Cesar in the second part"
    },
    {
      "username": "wolfeE-leet",
      "userUrl": "https://www.imdb.com/user/ur37577543",
      "reviewLink": "https://www.imdb.com/review/rw7496617",
      "warningSpoilers": true,
      "date": "31 October 2021",
      "rate": "9",
      "helpful": "20 out of 21 found this helpful.",
      "title": "Worth It",
      "content": "This series hits hard. Despite Antony being an unlikable brute, the portrayal of his sorrow after being told Cleopatra was dead moved me to tears. Flawless acting from all characters involved."
    },
    {
      "username": "bcnkor",
      "userUrl": "https://www.imdb.com/user/ur132136228",
      "reviewLink": "https://www.imdb.com/review/rw7766152",
      "warningSpoilers": true,
      "date": "16 January 2022",
      "rate": "10",
      "helpful": "20 out of 23 found this helpful.",
      "title": "The best series about the life of Rome",
      "content": "Perfect adaptation of life in ancient Rome, seen from the soldier, the mafia, and the senators. A great job from the entire team of actors from the director and the writer."
    },
    {
      "username": "fatfackface",
      "userUrl": "https://www.imdb.com/user/ur35405382",
      "reviewLink": "https://www.imdb.com/review/rw8023634",
      "warningSpoilers": false,
      "date": "1 April 2022",
      "rate": "10",
      "helpful": "21 out of 22 found this helpful.",
      "title": "My personal best tv show of all time",
      "content": "I saw it first when it released back in 2005, I saw it again in 2010, and again in 2015 and now again in 2022 (just finished it). I am a person that never watches a tv show or a movie again, but Rome is one of a kind, no tv show or movie has ever made me so invested in its characters, greatest tv show of all time, to me."
    },
    {
      "username": "kjs99",
      "userUrl": "https://www.imdb.com/user/ur3240028",
      "reviewLink": "https://www.imdb.com/review/rw1161039",
      "warningSpoilers": false,
      "date": "29 August 2005",
      "rate": "",
      "helpful": "180 out of 206 found this helpful.",
      "title": "Rome for the First Time",
      "content": "Great. Loving classical literature and history, and the sometimes ridiculous film genre known as Sword and Sandal, I was thrilled by the first episode - I really feel like I'm getting something very like the grit and feel of the place and the politics for the first time. I've read some stupid comments here that somehow the series is less than authentic because these Romans speak English - and most absurd - that the actors are all too old because the average male died in his 40's. That figure - If true - is skewed tremendously by the fact that many died of childhood maladies that are easily treated today. Many men lived in to their 70's and 80's, especially in the aristocracy. Pompey - one of the oldest in the series - died at something like 58, and his death was anything but natural. Look, some suspension of disbelief is required every time you turn the TV on. I think they've done a great job with this series and I look forward to future episodes."
    },
    {
      "username": "bednarski-adrian",
      "userUrl": "https://www.imdb.com/user/ur50300568",
      "reviewLink": "https://www.imdb.com/review/rw7372739",
      "warningSpoilers": false,
      "date": "23 September 2021",
      "rate": "9",
      "helpful": "16 out of 17 found this helpful.",
      "title": "I hate TV video series...",
      "content": "... but this is genius of art and direction. I can't wait for the next one and the next one... For me it hasn't a small piece of boring. It is great!"
    },
    {
      "username": "Andy-296",
      "userUrl": "https://www.imdb.com/user/ur0305809",
      "reviewLink": "https://www.imdb.com/review/rw2544913",
      "warningSpoilers": true,
      "date": "6 January 2012",
      "rate": "10",
      "helpful": "16 out of 19 found this helpful.",
      "title": "A considerable achievement",
      "content": "HBO's Rome two seasons (originally shown in the years 2005-2007) covers in twenty two episodes the twenty two year period between the battle of Alesia in 52 BC and the aftermath to the battle of Actium in 30 BC (Julius Caesar's assassination in 44 BC is shown at the end of the first season and the beginning of the second season). While several plot threads runs through the series, basically the first season is about how Caesar rose to hold absolute power (defeating rivals like Pompey) just before being murdered, while the second season tell us how after Caesar's death, a struggle began between Octavian (later emperor Augustus) and Mark Antony to fill the power void generated by Caesar's death.The series is centered round the lives of two friends and comrades from the campaign in Gaul, the hot tempered Vorenus (played by Kevin McKidd, who looks a lot like Daniel Craig) and the more amiable Pullo (played by Ray Stevenson, who looks a bit like Mel Gibson and another bit like Russell Crowe) They both existed historically (two centurions bearing those names are mentioned in Caesar's Commentaries on the War in Gaul), but little else is known about them, so most of what is shown in the TV series is invented. The rest of the cast is mostly British, none of them very famous (most of them come from a BBC high drama/theatrical background) but they mostly acquit themselves fine: James Purefoy particularly excels as the slimy, edgy Mark Antony; David Bamber is a fine Cicero, so is Polly Walker as the scheming matron Attia. The gorgeous Kerry Condon impresses as the young, promiscuous Octavia, while Ciaran Hinds is good in his understated performance as Julius Caesar.With the obvious exception of having the Romans speak in English (there is always something ridiculous about movies where Romans deliver obscenities in a Cockney accent) real care was taken by the filmmakers to make this series as historically accurate as possible.The production values are considerable. Still, since they didn't have an enormous budget, the filmmakers decided not to film huge crowd scenes, concentrating instead on smaller, more intimate scenes. Thus Mark Antony's funeral oration of Caesar is referred to but not shown, and with the exception of the battle of Philippi none of the other battles of the era is recreated. Despite this smaller scope, this miniseries represents a considerable achievement, a triumph both of popular and intelligent entertainment and scholarship."
    },
    {
      "username": "robey-24125",
      "userUrl": "https://www.imdb.com/user/ur72533177",
      "reviewLink": "https://www.imdb.com/review/rw6526872",
      "warningSpoilers": false,
      "date": "25 January 2021",
      "rate": "10",
      "helpful": "26 out of 28 found this helpful.",
      "title": "Best show HBO ever had",
      "content": "I only wish there was more seasons. It has it all, love, war, death"
    }
  ],
  "errorMessage": ""
}