{
  "imDbId": "tt0384766",
  "title": "Rome",
  "fullTitle": "Rome (TV Series 2005–2007)",
  "type": "TVSeries",
  "year": "2005",
  "episodes": [
    {
      "id": "tt0854006",
      "seasonNumber": "2",
      "episodeNumber": "1",
      "title": "Passover",
      "image": "https://m.media-amazon.com/images/M/MV5BOGUwN2E5NjQtYzcwZS00ZTBlLTlhMjctMDEzYmM4NGIxNThmXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "14 Jan. 2007",
      "plot": "In the wake of Caesar's death, Mark Antony considers a move north, while Vorenus issues a curse he soon regrets.",
      "imDbRating": "8.7",
      "imDbRatingCount": "2121"
    },
    {
      "id": "tt0901369",
      "seasonNumber": "2",
      "episodeNumber": "2",
      "title": "Son of Hades",
      "image": "https://m.media-amazon.com/images/M/MV5BNzUwYTg5YTAtZmZmMC00OTliLWI0YzMtYWJlODYzZTE2NDJmXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "21 Jan. 2007",
      "plot": "Even though his wife and children are avenged by the Erastes killing, Lucius Vorenus keeps mourning for over a month till Pullo gets Marc Antony who scolds him for Caesar's death and the continuing bloody Aventine gang riots that have resulted in the gangs wanting to fill the void left by Erastes sudden demise. Octavian is losing patience with Marc Antony for payment of Caesar's inheritance. Meanwhile, Queen Cleopatra of Egypt arrives in Rome to pay her respects to Caesar and she also negotiates with Antony's military protection for her Pharaonic throne in exchange ...",
      "imDbRating": "8.4",
      "imDbRatingCount": "1948"
    },
    {
      "id": "tt0901371",
      "seasonNumber": "2",
      "episodeNumber": "3",
      "title": "These Being the Words of Marcus Tullius Cicero",
      "image": "https://m.media-amazon.com/images/M/MV5BZGQzOTdlZWMtYmJmYy00NjkxLWE2ZjEtODlkZGYwYjY5ZmFlXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "28 Jan. 2007",
      "plot": "Lucius Vorenus, the power-hungry \"Son of Hades\", controls the Aventine but practices a pointless, beastly reign of terror, coming down hard on gang captains for futilities, and nearly ruins his friendship with Pullo, whose efforts to calm things down are mistaken for disrespect and disobedience, even starts a fight once he learns the truth about Niobe; Pullio leaves Rome disgusted. After Atia convinces Marc Antony the governorship of ghastly Macedonia after his consulate would not only be unpleasant but leave him exposed to his dangerous enemies, he puts the heat on ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "1874"
    },
    {
      "id": "tt0901370",
      "seasonNumber": "2",
      "episodeNumber": "4",
      "title": "Testudo et Lepus (The Tortoise and the Hare)",
      "image": "https://m.media-amazon.com/images/M/MV5BMWIxNDc1ZmUtN2FkZC00N2FiLWE2NWQtNjliZjRlZmJjYTQwXkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "4 Feb. 2007",
      "plot": "Having learned that Vorenus' children are alive, Pullo sets off to find him in Gaul where he is again a serving soldier in Mark Antony's army. He had hoped to arrive before Octavian and Antony's armies meet in battle. Too late however, he is forced to find what is left of Antony's army in the mountains. He finds Vorenus alive and well, if somewhat battle worn, and they set off to find the children. The victorious Octavian plans his return to Rome. In Western Turkey, Brutus and Cassius amass their own army, now 9 Legions strong. In Rome, Servilia's attempt to kill Atia...",
      "imDbRating": "8.4",
      "imDbRatingCount": "1894"
    },
    {
      "id": "tt0901368",
      "seasonNumber": "2",
      "episodeNumber": "5",
      "title": "Heroes of the Republic",
      "image": "https://m.media-amazon.com/images/M/MV5BZmJjM2Y2NzgtZjA1MS00MDI2LTg4YzUtNTFjOWQ0NDVlNTkyXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "11 Feb. 2007",
      "plot": "Vorenus and Pullo return to the Collegium in Rome with Vorenus' family, but some of the \"changes\" that Pullo had warned him about regarding his two daughters Vorena both the Elder and Younger, as well as his wife's son, begin to manifest themselves into hostility and resentment. But Vorenus is completely oblivious to this, and is too blissfully happy to return to the role of 'father'. Meanwhile, Octavian finally returns and manages to negotiate the Senate Consul's seat from a scheming Cicero, but in spite of his promise to 'faithfully follow' the older man's counsel, ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "1829"
    },
    {
      "id": "tt0836442",
      "seasonNumber": "2",
      "episodeNumber": "6",
      "title": "Philippi",
      "image": "https://m.media-amazon.com/images/M/MV5BYzBjNzVkNTgtMjY2Yi00MWY0LWEyYmYtMTUxZDhmYTZlN2FmXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "18 Feb. 2007",
      "plot": "Cicero is finally undone by his duplicity in the form of Titus Pullo, acting upon Octavian's request to assassinate all supporters of Brutus in Rome. Pullo and Vorenus enjoy a happy if counterfeit outing with their families in the countryside to hide their assassin mission. Vorena the Elder's dangerous dalliance with one of Mimeo's men continues, and the torrid affair between Octavia and Agrippa escalates. Atia's casual cruelty to ask for the assassination of people she doesn't like results in complete disaster for Octavia's friend Jocasta. Elsewhere, the headstrong ...",
      "imDbRating": "8.7",
      "imDbRatingCount": "1972"
    },
    {
      "id": "tt0901366",
      "seasonNumber": "2",
      "episodeNumber": "7",
      "title": "Death Mask",
      "image": "https://m.media-amazon.com/images/M/MV5BNmZjNjczMzktODkwNi00ZWQ4LWEwYWUtNWNjNzU3ZGU0NzYxXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "4 Mar. 2007",
      "plot": "Inconsolable at the death of Brutus at Philippi, Servilia makes her final bid to gain the ultimate vengeance against Atia. Meanwhile, Eirene and Gaia have a major falling-out, prompting Eirene to demand that Pullo properly chastise the slave. When he does, the dynamic between the two of them changes in a violent and unexpected fashion. King Herod engages Mark Antony as a reluctant ally by offering a generous gift of 20,000 pounds of gold, and when Posca is excluded from sharing in the windfall, he engineers a move behind-the-scenes that will once again strain the ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "1814"
    },
    {
      "id": "tt0901364",
      "seasonNumber": "2",
      "episodeNumber": "8",
      "title": "A Necessary Fiction",
      "image": "https://m.media-amazon.com/images/M/MV5BOWEzOGFhNjAtMTIyYS00MmEzLWIxOTktNzFhZDNkYTFkZjYzXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "11 Mar. 2007",
      "plot": "Octavian takes a new bride, Livia, and then introduces her to his family in a startling way... by having her witness the punishment he metes out to Atia and Octavia, for secretly defying the social constraints established through the facade of Octavia's \"marriage\" to Mark Antony. The vengeful Gaia carries out her plan to poison Eirene, which produces most dire consequences for Pullo, and no one else is the wiser. Meanwhile, Octavian, Antony, Maecenas, and their associates barely maintain their relationships of congenial contempt and hypocrisy, as everyone tries to ...",
      "imDbRating": "8.6",
      "imDbRatingCount": "1846"
    },
    {
      "id": "tt0901367",
      "seasonNumber": "2",
      "episodeNumber": "9",
      "title": "Deus Impeditio Esuritori Nullus (No God Can Stop a Hungry Man)",
      "image": "https://m.media-amazon.com/images/M/MV5BYTE5Mjg4YjMtMmFhZi00YmY5LTliZjYtMzg1NmQ0NTRhOTRlXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "18 Mar. 2007",
      "plot": "Seven years have passed since Antony's departure from Rome, and the former commander, dissipated and debauched - held in thrall by the charms and sexual prowess of his new bride, Cleopatra, withholds precious shipments of grain from Rome, where people die in the streets from hunger. Unable to incite a war with Antony and Egypt without committing political suicide, Octavian sends Atia and Octavia to Alexandria to mediate and reason with Antony; a strategy which proves predictably unsuccessful. However, former Roman senator Posca and his wife, Jocasta, flee Alexandria ...",
      "imDbRating": "8.7",
      "imDbRatingCount": "1860"
    },
    {
      "id": "tt0901365",
      "seasonNumber": "2",
      "episodeNumber": "10",
      "title": "De Patre Vostro (About Your Father)",
      "image": "https://m.media-amazon.com/images/M/MV5BYTZkNTQ3NmMtNjc1ZC00M2I4LTg5ZDUtYTkzZjdkYWVlMGFlXkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2007",
      "released": "25 Mar. 2007",
      "plot": "With the defeat of the Egyptian fleet at Actium, Mark Antony and Cleopatra retreat to their palace and await their fate. Believing that Cleopatra has taken her life, Mark Antony decides follow her into the afterlife. She has other plans however and is quite prepared to negotiate with Octavian if there is any possibility her life and those of her children will be spared. Cleopatra asks Vorenus to take her son Caesarian to safety and Octavian sends Pullo after them. The old friends are soon together again but are waylaid by bandits. With Vorenus severely wounded, Pullo ...",
      "imDbRating": "9.0",
      "imDbRatingCount": "2211"
    }
  ],
  "errorMessage": ""
}