{
  "imDbId": "tt0384766",
  "title": "Rome",
  "fullTitle": "Rome (TV Series 2005–2007)",
  "type": "TVSeries",
  "year": "2005",
  "episodes": [
    {
      "id": "tt0688358",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "The Stolen Eagle",
      "image": "https://m.media-amazon.com/images/M/MV5BN2UyNTNiN2EtNjEwMy00ZDc2LWFkMzEtYWJiNmZiNThhZmE4XkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "28 Aug. 2005",
      "plot": "In Gaul in 52 B.C., two Roman soldiers, Legionary Titus Pullo and Centurion Lucius Vorenus, are tasked with recovering Julius Caesar's personal Eagle, stolen from his camp in the dead of night. With his campaign in Gaul coming to a successful conclusion, Caesar's popularity is continuing to grow. He's saddened however when he receives news from his good friend Pompey Magnus that his daughter, Pompey's wife, has died in childbirth. In the Senate, Pompey must defend the prolonged absence of his friend and co-Consul Caesar against charges of corruption and of waging an ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "2870"
    },
    {
      "id": "tt0688352",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "How Titus Pullo Brought Down the Republic",
      "image": "https://m.media-amazon.com/images/M/MV5BYmY0ZDJlYzctZDAyMS00NzZjLTk2NjMtOTVlNzRhNDMyOWY0XkEyXkFqcGdeQXVyMDI2NDg0NQ@@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "4 Sep. 2005",
      "plot": "Caesar winters his army in Gaul near the Italian border while his enemies in Rome fear that he will do something no Roman General has done: cross the Rubicon with his army. To counter-balance his opponents, Caesar puts his friend Mark Antony up for office as the people's Consul. Vorenus and Pullo accompany Mark Antony and Octavian to Rome. For Pullo, it's an opportunity to get drunk and ravish every woman in sight. He also loses all of his money in a crooked dice game leading to a major brawl. For Vorenus, he will have a reunion with his wife Niobe who he has not seen...",
      "imDbRating": "8.2",
      "imDbRatingCount": "2477"
    },
    {
      "id": "tt0688349",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "An Owl in a Thornbush",
      "image": "https://m.media-amazon.com/images/M/MV5BOWQ5MTA4ZGMtMmI1NS00YTU3LTk2ZjQtNmRkOWZlMGFlNmNkXkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "11 Sep. 2005",
      "plot": "With Caesar quickly advancing toward Rome, Pompey begins ordering a retreat and forces his citizens to pick sides. Timon does Atia's dirty work and Vorenus cannot understand why no one is resisting while on a scouting mission.",
      "imDbRating": "8.0",
      "imDbRatingCount": "2288"
    },
    {
      "id": "tt0688354",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "Stealing from Saturn",
      "image": "https://m.media-amazon.com/images/M/MV5BM2U3OTFjOGQtMDBkMy00ZTg3LTkzYWItMzRhNWZlOTVmMmQ1XkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "18 Sep. 2005",
      "plot": "Atia and her family have stayed behind when Pompey and others fled and she now throws a party for her triumphant uncle, Julius Caesar. She clearly has her sights set on the great leader and is puzzled when he sends her a guest list that includes Servilia of the Junii. She soon finds out why. Pompey wants to find out what happened to the gold from the Roman Treasury and sends his son Quintus to Rome to find out what happened. They go directly to Vorenus' home but he has no idea what they are talking about. Pullo arrives however and Vorenus tells him to go directly to ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "2207"
    },
    {
      "id": "tt0688356",
      "seasonNumber": "1",
      "episodeNumber": "5",
      "title": "The Ram Has Touched the Wall",
      "image": "https://m.media-amazon.com/images/M/MV5BZWJlMmRmZWQtMzViYy00YWMzLTllMDUtZTcwZjZmOGZmYTE0XkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "25 Sep. 2005",
      "plot": "Caesar contemplates Pompey's counteroffer. Vorenus continues to struggle as a businessman and must reevaluate his career choice. Atia schemes to come between Caesar and Servilia and Pullo seeks Octavian's help.",
      "imDbRating": "8.1",
      "imDbRatingCount": "2203"
    },
    {
      "id": "tt0688351",
      "seasonNumber": "1",
      "episodeNumber": "6",
      "title": "Egeria",
      "image": "https://m.media-amazon.com/images/M/MV5BM2U5MDQwNTgtOTVhZC00MzljLWI0NWQtNGZhNTQxYzFiNTNiXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "2 Oct. 2005",
      "plot": "Caesar pursued Pompey to Greece but the tide has turned and it's Caesar who is on the run. He contacts Mark Antony, who he left in charge in Rome, to come and join him with the 13th Legion but Antony seems to be in no hurry. Vorenus has re-enlisted in Antony's Legion and he and Niobe have begun to renew their marital relationship. The presence of Niobe's sister is the only sour note in their house. Pullo meanwhile continues to train young Octavian in the use of arms and the boy's mother Atia is so pleased with his development that she decides he should take another ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "2117"
    },
    {
      "id": "tt0688353",
      "seasonNumber": "1",
      "episodeNumber": "7",
      "title": "Pharsalus",
      "image": "https://m.media-amazon.com/images/M/MV5BOTAyNDc2ZGItYjAwMi00YTUyLWIyMzItYjJkMDA5Y2JmOWQzXkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "9 Oct. 2005",
      "plot": "As they try to reach Caesar in Greece, the shipwrecked Vorenus and Pullo confront an unexpected dilemma. Back in Rome, Atia again sends Octavia to beg protection from Servilia, who complies readily to encourage her growing friendship with Octavia. As they prepare their counterattack against Caesar, Pompey's Republicans begin to squabble over both the anticipated spoils and the method of finishing Caesar off. Niobe's sister Lyde comes back to see her and comforts her over Vorenus's disappearance. Badly outnumbered, Caesar and Antony make their stand at Pharsalus. On ...",
      "imDbRating": "8.4",
      "imDbRatingCount": "2100"
    },
    {
      "id": "tt0688350",
      "seasonNumber": "1",
      "episodeNumber": "8",
      "title": "Caesarion",
      "image": "https://m.media-amazon.com/images/M/MV5BNGE1YjJmMTMtOGUwNy00NTY4LWFiZDMtOTY4YTk3NjczMzRlXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "16 Oct. 2005",
      "plot": "Brutus gets a chilly reception from Servilia when he returns home from Greece. In Egypt, Caesar rebukes the advisers of the boy king, Ptolemy XIII, for their presumption in eliminating Pompey and demands the man who killed him. Caesar decides to intervene in the dispute between Ptolemy and his sister-wife, Cleopatra, to ensure both Rome's grain supply and his own access to Egypt's treasure. Antony, in an unusual show of prudence, advises against this with only half a legion in Alexandria and Cato and Scipio still at large in Africa. Caesar sends Vorenus and Pullo to ...",
      "imDbRating": "8.4",
      "imDbRatingCount": "2122"
    },
    {
      "id": "tt0688360",
      "seasonNumber": "1",
      "episodeNumber": "9",
      "title": "Utica",
      "image": "https://m.media-amazon.com/images/M/MV5BYjZkZDhmOTYtYTQ1Yi00MDcwLWEwMDYtODk4NDc5ZWUzNDk5XkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "30 Oct. 2005",
      "plot": "The defeated Cato and Scipio fall back on the African city of Utica after the Battle of Thapsus where they decide to end it all. Caesar, after two years of fighting in Greece and Egypt, returns to Rome and receives a hero's welcome. Meanwhile, Servilia's cold rage against the Julii clan makes Brutus's submission to Caesar even more painful. Octavian returns home from military school and Caesar, impressed with his nephew's incisive political acumen, appoints him a pontiff despite his youth. Having opened and operated a profitable butcher shop, Niobe and Lyde get the ...",
      "imDbRating": "8.3",
      "imDbRatingCount": "2032"
    },
    {
      "id": "tt0688359",
      "seasonNumber": "1",
      "episodeNumber": "10",
      "title": "Triumph",
      "image": "https://m.media-amazon.com/images/M/MV5BMTFmZWMyOGUtYmQ4My00NzI2LWI3YTktZTBiY2QxMWY3YjZlXkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "6 Nov. 2005",
      "plot": "The price of Caesar's mercy: Cicero nominates Caesar to an unprecedented ten-year dictatorship and Brutus speaks in support of the motion. With martial authority and Niobe at his side, Vorenus campaigns for magistrate under Posca's advice, but is shocked to learn from Posca that Caesar has already fixed the election in Vorenus's favor. Meanwhile, Atia continues her humiliation of Servilia while denying any involvement in her assault. But Atia becomes troubled by the silent depression of Octavia after Octavian compels her to return home from the cloister where she had ...",
      "imDbRating": "8.3",
      "imDbRatingCount": "2004"
    },
    {
      "id": "tt0688357",
      "seasonNumber": "1",
      "episodeNumber": "11",
      "title": "The Spoils",
      "image": "https://m.media-amazon.com/images/M/MV5BMjZjZjM4MjQtYjNhMC00NmE5LTk0NWYtMWVhMzFlMmQzMWExXkEyXkFqcGdeQXVyNDIzMzcwNjc@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "13 Nov. 2005",
      "plot": "Rejected by Vorenus and Eirene and racked by guilt for the killing of Eirene's fiancé out of a jealous rage, Pullo has sunk to working as an assassin for the gangster Erastes. When Pullo gets arrested for killing one of Caesar's popular opponents, he condemns himself by refusing to name who hired him, despite Octavian's attempts to defend him. Meanwhile, Vorenus finds his new official duties as magistrate tedious, especially when he gets caught between Caesar and the demands made by veterans' spokesman Mascias. Niobe revels in the prestige of Vorenus's office until ...",
      "imDbRating": "8.9",
      "imDbRatingCount": "2325"
    },
    {
      "id": "tt0688355",
      "seasonNumber": "1",
      "episodeNumber": "12",
      "title": "Kalends of February",
      "image": "https://m.media-amazon.com/images/M/MV5BNTlmOWMwZTktYTY2My00NjVhLWI5MDctZTU2ZDI0ZjQxMGNlXkEyXkFqcGdeQXVyNTQ0NjQzNTE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "20 Nov. 2005",
      "plot": "Vorenus' defense of Caesar lands him in an unexpected position of power within Rome. Meanwhile, Servilia hurls the final obstacle in her ambitious and complex revenge plan against Atia.",
      "imDbRating": "9.1",
      "imDbRatingCount": "2491"
    }
  ],
  "errorMessage": ""
}