{
  "imDbId": "tt0384766",
  "title": "Rome",
  "fullTitle": "Rome (TV Series 2005–2007)",
  "type": "TVSeries",
  "year": "2005",
  "language": "en",
  "titleInLanguage": "Rome (TV series)",
  "url": "https://en.wikipedia.org/wiki/Rome_(TV_series)",
  "plotShort": {
    "plainText": "Rome is a historical drama television series released 2005-2007 created by John Milius, William J. MacDonald, and Bruno Heller. The series is set in the 1st century BC, during Ancient Rome's transition from Republic to Empire. The series features a sprawling cast of characters, many based on real figures from historical records, but the lead protagonists are ultimately two soldiers named Lucius Vorenus and Titus Pullo, who find their lives intertwined with key historical events.\r\nAn international co-production between Italy, the United Kingdom and the United States, the series was filmed in various locations, but most notably in the Cinecittà studios in Rome, Italy. The show, consisting of two seasons for a total of 22 episodes, aired on HBO, and BBC Two from 28 August 2005 to 25 March 2007, and was later released on DVD and Blu-ray.\r\nRome received largely positive reviews and had a high number of viewers. It received substantial media attention from the start, becoming a ratings success for HBO and the BBC (although the numbers declined considerably in the second season) and being honoured with numerous awards, including four Emmy Awards, seven Primetime Emmy Awards, and a Visual Effects Society Award. The series ran for two seasons out of the planned five due to high production cost; much of the material for the third and fourth seasons was telescoped into the second season.",
    "html": "<p>Rome is a historical drama television series released 2005-2007 created by John Milius, William J. MacDonald, and Bruno Heller. The series is set in the 1st century BC, during Ancient Rome's transition from Republic to Empire. The series features a sprawling cast of characters, many based on real figures from historical records, but the lead protagonists are ultimately two soldiers named Lucius Vorenus and Titus Pullo, who find their lives intertwined with key historical events.</p><p>An international co-production between Italy, the United Kingdom and the United States, the series was filmed in various locations, but most notably in the Cinecittà studios in Rome, Italy. The show, consisting of two seasons for a total of 22 episodes, aired on HBO, and BBC Two from 28 August 2005 to 25 March 2007, and was later released on DVD and Blu-ray.</p><p>Rome received largely positive reviews and had a high number of viewers. It received substantial media attention from the start, becoming a ratings success for HBO and the BBC (although the numbers declined considerably in the second season) and being honoured with numerous awards, including four Emmy Awards, seven Primetime Emmy Awards, and a Visual Effects Society Award. The series ran for two seasons out of the planned five due to high production cost; much of the material for the third and fourth seasons was telescoped into the second season.</p>"
  },
  "plotFull": {
    "plainText": "Rome is a historical drama television series released 2005-2007 created by John Milius, William J. MacDonald, and Bruno Heller. The series is set in the 1st century BC, during Ancient Rome's transition from Republic to Empire. The series features a sprawling cast of characters, many based on real figures from historical records, but the lead protagonists are ultimately two soldiers named Lucius Vorenus and Titus Pullo, who find their lives intertwined with key historical events.\r\nAn international co-production between Italy, the United Kingdom and the United States, the series was filmed in various locations, but most notably in the Cinecittà studios in Rome, Italy. The show, consisting of two seasons for a total of 22 episodes, aired on HBO, and BBC Two from 28 August 2005 to 25 March 2007, and was later released on DVD and Blu-ray.\r\nRome received largely positive reviews and had a high number of viewers. It received substantial media attention from the start, becoming a ratings success for HBO and the BBC (although the numbers declined considerably in the second season) and being honoured with numerous awards, including four Emmy Awards, seven Primetime Emmy Awards, and a Visual Effects Society Award. The series ran for two seasons out of the planned five due to high production cost; much of the material for the third and fourth seasons was telescoped into the second season.\r\nPlot overview\r\nThe series primarily chronicles the lives and deeds of the rich, powerful, and historically significant, but it also focuses on the lives, fortunes, families, and acquaintances of two common men: Lucius Vorenus and Titus Pullo, fictionalized versions of a pair of Roman soldiers mentioned in Caesar's Commentarii de Bello Gallico. The fictional Vorenus and Pullo manage to witness and often influence many of the historical events presented in the series, although some dramatic license is taken.\r\nThe first season depicts Julius Caesar's civil war of 49 BC against the traditionalist conservative faction in the Roman Senate (the Optimates), his rise to dictatorship over Rome, and his fall, spanning the time from the end of his Gallic Wars (52 BC or 701 ab urbe condita) until his assassination on 15 March 44 BC (the infamous Ides of March). Against the backdrop of these cataclysmic events, we also see the early years of the young Octavian, who is destined to become Augustus, the first Emperor of Rome. The second season chronicles the power struggle between Octavian and Mark Antony following Caesar's assassination, spanning the period from Caesar's death in 44 BC to the suicide of Antony and Cleopatra in 30 B.C. after their defeat at the Battle of Actium.\r\nCast\r\nKevin McKidd as Lucius Vorenus – A staunch, traditional Roman officer who struggles to balance his personal beliefs, his duty to his superiors, and the needs of his family and friends. The basis for this character is the historical Roman soldier of the same name, who is briefly mentioned in Julius Caesar's De Bello Gallico 5.44.\r\nRay Stevenson as Titus Pullo – A friendly, upbeat, devil-may-care soldier with the morals of a pirate, the appetites of a hedonist, and a total lack of personal responsibility, who discovers hidden ideals and integrity within himself.\r\nCiarán Hinds as Julius Caesar (season 1; guest season 2) – Caesar is ambitious but his aims and motives are often kept ambiguous to further complicate the plot and test the personal loyalties of other characters. He advertises himself as a reformer who sides with the Plebeians, though he is himself a Patrician. He is also merciful to his beaten enemies, genuinely distressed by their deaths, and relieved at their willingness to make peace where a more vindictive individual would have simply killed them.\r\nKenneth Cranham as Pompey Magnus (season 1) – A legendary general, past the days of his prime, who tries to recapture the glories of his youth as well as to do what is right for the Republic. The real Gnaeus Pompeius Magnus was a Roman general and politician who was as ambitious as Caesar and just as unorthodox in his youth. He chose to ally himself with the optimates in opposing Caesar and supporting the traditional Roman Republic.\r\nPolly Walker as Atia of the Julii – The niece of Julius Caesar and mother of Octavian and Octavia. She is depicted as a cheerfully amoral and opportunistic manipulator. Her family connections and sexual liaisons have brought her into contact with some of the most powerful individuals in Rome, making her a highly influential figure in Roman society. Atia is very loosely based on the historical figure Atia about whom little detail is known. Rome historical consultant Jonathan Stamp identifies the historical figure Clodia as the primary basis for the character of Atia.\r\nJames Purefoy as Mark Antony – A very popular and cunning Roman general and politician and a close supporter of Julius Caesar in Season 1. In Season 2, he is in a power struggle with the power hungry and unaccomplished Octavian.\r\nTobias Menzies as Marcus Junius Brutus – Portrayed as a young man torn between what he believes is right, and his loyalty and love of a man who has been like a father to him. The real Marcus Junius Brutus was the most famous of Julius Caesar's assassins, and one of the key figures in the civil wars that followed the assassination.\r\nMax Pirkis (season 1; guest season 2) and Simon Woods (season 2) as Gaius Octavian (Augustus) – Son and younger child of Atia, Octavian is presented as a cold, self-entitled student of power and politics. He is eager to enter political life and follow in Caesar's footsteps – an ambition more easily achieved when Caesar posthumously adopts him. The basis for this character is the early life of Augustus, the first Roman Emperor.\r\nLindsay Duncan as Servilia of the Junii – The mother of Marcus Junius Brutus, lover of the married Julius Caesar, and enemy of Atia of the Julii. Servilia is depicted as a sophisticated and regal Roman matron who follows her heart to her detriment, betrayed by love, and hungering for revenge. Slowly she becomes as cold, calculating, and cruel as those whom she would destroy. Servilia is loosely based on the historical personage of Servilia, mother of Marcus Junius Brutus, and famous lover of Julius Caesar.\r\nLyndsey Marshal as Cleopatra – The hedonistic co-Pharaoh of Egypt, she plots to seduce Caesar in order to obtain his aid and protection to depose her brother. After Caesar's death, she seeks Mark Antony's protection, thus also becoming Atia's rival.\r\nIndira Varma as Niobe (season 1; guest season 2) – A woman, Niobe is a proud Plebeian from a large clan. After marrying Lucius Vorenus and giving birth to their two daughters, she functioned as a single parent when Lucius went off to war. After being told (incorrectly) by the army that Vorenus is dead, she embarks on a love affair with her sister's husband, giving birth to a son a few months before a very much alive Vorenus returns home. Convinced he will kill her and all the children should he learn of the affair, she tells Vorenus that the baby Lucius is his grandson by their older daughter and her lover.\r\nNicholas Woodeson as Posca – A Greek slave of Julius Caesar, and also his friend, aide-de-camp, and confidant in most things personal and professional. As a slave, he will seldom receive credit, but it appears that some of the simpler and more elegant solutions to Caesar's problems come from the mind of Posca. Posca is freed and given a stipend in Caesar's will at the start of the second season. He throws his support behind Antony, but later strategically defects to Octavian.\r\nKerry Condon as Octavia of the Julii – The character is based on the Roman matron Octavia Thurina Minor, sister of Roman Emperor Augustus, born to one of the most powerful families in Rome, the Julii. Octavia is the only daughter and elder child of Atia of the Julii, who is the niece of Gaius Julius Caesar. In Season 2, for political reasons she is married to Mark Antony. This is something she did in real life when Antony was newly a widower in 40 BC as part of the Pact of Brundisium, having been ordered by the Senate to set aside the mandatory ten-month term of widowhood after the death of her first husband, Claudius Marcellus.\r\nRick Warden as Quintus Pompey – The son of Pompey. There is no basis for this character, but he may be meant to represent the younger of Pompey's historical sons Sextus Pompeius.\r\nKarl Johnson as Cato the Younger (season 1) – An extreme traditionalist, against political, social, and moral decay, and a staunch defender of the Roman Republic. The real Cato the Younger was a Roman orator, author and politician who committed suicide to avoid living under Caesar's tyranny.\r\nDavid Bamber as Marcus Tullius Cicero – A moderate politician and scholar, faced with trying to save the traditional Republic from the ambitions of the various characters on the show. He is depicted as craven and willing to take any position to save his own skin. The real Cicero was a Roman politician, writer and orator.\r\nLee Boardman as Timon – A Jewish horse trader who serves as a loyal assassin and bodyguard for Atia. He accepts money as payment but prefers sex with Atia.\r\nPaul Jesson as Quintus Metellus Scipio - Comrade and follower of Cato.\r\nEpisodes\r\nProduction\r\nDevelopment\r\nWilliam J. MacDonald and John Milius pitched the idea to HBO as a miniseries, but the network made it a full-fledged series. In 2002, HBO and the BBC agreed to co-produce the series, committing a US$100–110 million (£62.7 million) budget to the production of twelve 1-hour episodes, with HBO contributing $85 million, and the BBC contributing $15 million. The BBC contributed £800,000 to every episode of Rome in its first season. Rome is the largest co-produced series with the American film market in the BBC's history. The series also marked the first series on which HBO and the BBC worked together as co-producers, although the two companies had worked together in other roles in earlier series, including Band of Brothers and The Gathering Storm.\r\nTranter from the BBC has said this about the development of Rome: \"It felt like something that could have been developed by us, and HBO felt like natural partners for the BBC\". On 20 April 2006, Carolyn Strauss, president of HBO announced the development of a second season for Rome.\r\nThe filmmakers stressed that they wanted to portray Rome as a gritty and realistic city as opposed to what they call the \"Hollyrome\" presentation that audiences are used to from other films, with \"cleanliness and marble and togas that looked pressed.\"\r\nFilming\r\nBetween March 2004 and May 2005 Rome was filmed in co-production with Rai Fiction in the Italian countryside on Cinecittà studios' six sound stages in Rome. A collection of massive sets in Cinecittà studios' back lots comprised an elaborate \"period reconstruction\" of sections of ancient Rome. It was a huge undertaking, with an international crew of 350, and more than 50 local Italian interns.\r\nThe production is regarded as one of the most expensive in the history of television. Funding was generously employed to recreate an impressively detailed set featuring a number of Roman Villas, the Forum, and a vast slum area of the ancient city of Rome. A significant part of this set was later destroyed by a fire that burned down a portion of the Cinecittà Studios in 2007. According to HBO, the fire started after they had finished filming the second season. A portion of the set was also used in late 2007 by the crew of the long-running BBC sci-fi drama series Doctor Who, for the fourth-season episode \"The Fires of Pompeii\".\r\nAudio commentary on the Season 1 DVD indicates that many of the background performers used in the series were also their true professional counterparts. One example is that the actor shown in the series working as a butcher on the streets of Rome was in fact a real-life butcher.\r\nEditing\r\nIn a separate move, the BBC also decided to re-edit the first three episodes (all directed by Michael Apted) into two episodes. The BBC claimed that this was because the British audience were more familiar with the history of Rome than their American counterparts and so much of the history was unnecessary; however, Apted claims that the purpose was to boost the ratings by increasing the prominence of the scenes of sex and violence. In an interview with The Times, Apted said:\r\nI'm really pissed off with the BBC for bringing down my first three episodes to two and, in doing so, taking out much of the vital politics. What also makes me very grumpy is that I was told that the cuts had been introduced by the BBC because they thought British viewers already knew the historical background. But all that's happened as far as the viewer is concerned is that it has made Rome hard to follow.\r\nApted also said that he only learned of the edits by accident, \"...a couple of weeks ago when one of the actors told me\". Since then, the original uncut Season 1 episodes aired on UKTV Drama, coincident with the UK broadcast of Season 2 on BBC Two.\r\nThe Italian broadcast of the series was also marred by controversy. Strong language was removed in the Italian dubbing process; as for the more explicit sex scenes and disturbing violence, they were replaced by \"safe\" alternative versions shot during production especially for the Italian market. Rai 4 began showing the \"complete version\" of the series on Italian TV in September 2009.\r\nMusic\r\nComposer Jeff Beal was invited to audition for Rome after he completed work on HBO's Carnivàle. The producers sent him a short edit of season 1 episode 7. From that, Beal began writing a demo score. Based on head writer Bruno Heller's desired gritty pre-Christian feel for the series, and HBO's interest in a non-modern sound, Beal chose to compose and record with live instruments from across the ancient Roman world. For each episode, Beal had about two weeks to work: in the first, he composed for – and recorded – the instruments he performed on the soundtrack. In the second week, he incorporated producer's notes, and orchestrated and recorded the other live instrumental sections.\r\nBroadcast and DVD releases\r\nRome's first season originally aired on HBO in the United States between 28 August and 20 November 2005, subsequently being broadcast on the United Kingdom's BBC Two between 2 November 2005 and 4 January 2006. The second season aired on HBO in the US from 14 January 2007 to 25 March 2007.\r\nInternational syndication\r\nThe series was launched in the United States on 25 August 2005, at Wadsworth Theatre in Los Angeles. HBO broadcast the series pilot \"The Stolen Eagle\" four days later. According to the Nielsen ratings system, the pilot broadcast was seen by 3.8 million viewers and achieved a 9.1 household rating for Sunday primetime. HBO re-aired the pilot 11 times in the week following 28 August 2005 premiere, garnering a total viewership of 8.9 million for all 11 airings. After the broadcast of only three first-season episodes, HBO announced plans to produce a second season of Rome in 2006, for release in March 2007. HBO aired each episode multiple times a week, and by the end of the first season, the total weekly audience for all airings exceeded seven million viewers. The second season premiered in January 2007, with the first episode attracting 1.5 million viewers. The final episode aired 25 March 2007 in the US, garnering 2.4 million viewers.\r\nIn total, HBO spent about $10 million US$ to promote Rome. HBO enlisted the Mozilla Firefox web browser in its marketing campaign for the series by designing a downloadable custom Rome Firefox theme. BBC Two premiered Rome in the United Kingdom on 2 November 2005, attracting 6.6 million viewers (27%); viewing figures declined in future episodes, with the season finale only attracting 3 million viewers (13%). The first episode of the second season aired on BBC Two on 20 June 2007.\r\nA \"sanitized\" version of the first series of Rome – with toned-down nudity and violence – aired on Rai 2 in Italy, garnering only a meager 10% audience share. RAI also stated to have co-produced the show, whereas HBO listed only itself and BBC as co-producers. The Italian newspaper, Corriere della Sera called it a \"prime example of historical misinformation\", and called actor Ciarán Hinds (Julius Caesar) a \"parody\". The paper also called the relationship between Atia of the Julii (Polly Walker) and Mark Antony (James Purefoy) \"ridiculous\". The second series was never broadcast at all on analog TV; however, starting from October 2009, digital-only channel Rai 4 broadcast the original uncut version of the first series and went on to broadcast the second series unaltered as well.\r\nCancellation and future\r\nHBO Chairman Chris Albrecht announced in a July 2006 news conference that season two of Rome would be its last, citing the fact that the series (called \"notoriously expensive\" by Broadcasting & Cable) had been developed under a two-year contract with the BBC that would have been difficult for the BBC to extend due to the series' cost. Of the storyline, co-creator Heller said:\r\nI discovered halfway through writing the second season the show was going to end. The second was going to end with the death of Brutus. Third and fourth season would be set in Egypt. Fifth was going to be the rise of the Messiah in Palestine. But because we got the heads-up that the second season would be it, I telescoped the third and fourth season into the second one, which accounts for the blazing speed we go through history near the end. There's certainly more than enough history to go around.\r\nPotential film\r\nIn a February 2008 interview with Movieweb.com, actor Ray Stevenson stated that a Rome film was in development, with Heller working on a script. Heller confirmed in December that there was \"talk of doing a movie version\", adding that \"It's moving along. It's not there until it is there. I would love to round that show off\". In an April 2009 interview with the Associated Press, actor Kevin McKidd stated the Rome film was \"in development\", and Lucius Vorenus would likely be a part of it. McKidd said in a later 2009 interview, \"There is a script that is being shopped and it's supposedly very good, I haven't seen it, but I am definitely going to be a part of the movie... He is very much alive, so that should be a fun story to tell.\" In March 2010, Entertainment Weekly stated that Heller had completed the script for Morning Light Productions, the film's financiers, and was now awaiting a director and a studio, since HBO Films \"won't be involved\". However, in a 2011 interview with Entertainment Weekly, Heller indicated the project had stalled – \"I'm not holding my breath.\"\r\nHome media\r\nRome: The Complete First Season was released as a six-disc Region 1 DVD box set in the United States in 2006, distributed by HBO Home Video. Featuring all 12 episodes, it included features such as episode commentaries, behind-the-scenes footage and making-of features. The set (without the episodic previews and recaps) was also released in Region 2, with the same title.\r\nSeason 2 was released in North America in 2007 and soon after in Region 2. Rome: The Complete Series was released in November 2009 on Blu-ray in North America.\r\nImpact\r\nReception\r\nRome garnered mostly positive reviews. Sean Woods from Rolling Stone called the series \"masterful\" and \"epic\", and gave the series 3.5 out of 4. Alessandra Stanley from The New York Times said: \"But behind all that gritty squalor the glory that was Rome gets lost\", while reviewing season 2. Lisa Schwarzbaum from Entertainment Weekly gave season 2 a B and commented on the \"spectacular\" clothing design. Michael Ventre from Variety magazine was positive towards the series and was intrigued by the \"complex\" character of Atia of the Julii. James Poniewozik from Time magazine commented on the \"slow start\" but further stated that the series \"draws you\" to the ancient city of Rome.\r\nEmpire magazine reviewer Helen O'Hara said: \"Not as good-looking as Gladiator, perhaps, but richer in (reasonably accurate) history and texture\", and gave season 1 of Rome four out of five stars. Robert Bianco from USA Today called season 2 \"the fall of Rome\", commenting that season 2 was not as good as season 1 citing \"off-key characterizations and plot absurdities\". Linda Stasi from The New York Post called herself a \"slave\" to the show. Melanie McFarland from Seattle Post-Intelligencer called season 2 \"at top of its form\" and said it was as good as the former season. Historian Robin Lane Fox, writing in The Guardian, called the series \"splendidly ambitious\". Eric Neigher from Slant Magazine called season 1 of Rome \"good art\". Robert Abele from LA Weekly called it the \"most lavish dramatic series yet\" released by HBO.\r\nOn review aggregator Rotten Tomatoes, the first season has an approval rating of 83% based on 36 reviews, with an average score of 8.62/10; the critical consensus reads: \"Rome builds slowly, but a laborious start delivers rich rewards in the form of decadent sets, delicious drama and a surprising amount of intimacy\". The second season has an approval rating of 89% based on 28 reviews, with an average score of 8.05/10; the critical consensus reads: \"Pulp meets prestige in Rome’s sensational second season -- though its style sometimes outweighs its substance\".\r\nAwards and nominations\r\nCapping its successful first season, Rome won four Emmy Awards out of eight nominations in 2006, for the episodes \"Caesarion\", \"Triumph\", \"Kalends of February\" and \"Stealing from Saturn\". The series also won an Art Directors Guild (ADG) in the category \"Excellence in Production Design – Single-Camera Television Series\" for the pilot episode \"The Stolen Eagle\". Michael Apted won the Directors Guild of America (DGA) in the category \"Outstanding Directing – Drama Series, Night\" for \"The Stolen Eagle\". The series itself was nominated for a Golden Globe Award in the category \"Best Television Series – Drama\", and Polly Walker who portrayed Atia of the Julii was nominated in the category \"Best Performance by an Actress In A Television Series – Drama\". The series was also nominated for three Satellite Awards, two for season 1 and the last for season 2. The pilot episode \"The Stolen Eagle\" won a Visual Effects Society (VES) award in the category \"Outstanding Visual Effects – Broadcast Series\". Writers Guild of America (WGA) nominated the series for the category \"Best Writing – New Television Series\" in 2005. The series was also nominated for four British Academy Television Awards (BAFTA), three in season 1 (2006) and one in season 2 (2008). In 2005, the series was nominated for a Cinema Audio Society Award (CAS) in the category \"Outstanding Achievement in Sound Mixing for Television Series\" for the episode \"The Spoils\". The British award ceremony nominated the series for the Royal Television Society (RTS) award in the category \"Best Visual Effects – Digital Effects\". For season 2 (2007) Alik Sakharov won the Primetime Emmy Award for Outstanding Cinematography for a Single-Camera Series, for the episode \"Passover\".\r\nHistorical accuracy\r\nThe series' major details, like who won each battle, are generally historically accurate, but many of the minor details were fabricated. The show is generally told from the perspective of Lucius Vorenus and Titus Pullo, and while they were real people who were briefly mentioned in Caesar's Commentarii de Bello Gallico, almost all of their adventures in the series are fictional.\r\nCo-creator Bruno Heller has said, \"We try to balance between what people expect from previous portrayals and a naturalistic approach ... This series is much more about how the psychology of the characters affects history than simply following the history as we know it\". Series Historical Consultant Jonathan Stamp also notes that the show aims for \"authenticity\" rather than \"accuracy\":\r\nWe did everything we could to make these episodes historically authentic, which meant researching and incorporating every kind of detail we could about the way our characters behaved, the way they interacted, how they dressed and gestured, the kind of streets they walked down, the way they conducted their private and public lives. We were not, however, making a documentary. We were striving for authenticity because it enriches the experience of the drama for the viewer.",
    "html": "<p>Rome is a historical drama television series released 2005-2007 created by John Milius, William J. MacDonald, and Bruno Heller. The series is set in the 1st century BC, during Ancient Rome's transition from Republic to Empire. The series features a sprawling cast of characters, many based on real figures from historical records, but the lead protagonists are ultimately two soldiers named Lucius Vorenus and Titus Pullo, who find their lives intertwined with key historical events.</p><p>An international co-production between Italy, the United Kingdom and the United States, the series was filmed in various locations, but most notably in the Cinecittà studios in Rome, Italy. The show, consisting of two seasons for a total of 22 episodes, aired on HBO, and BBC Two from 28 August 2005 to 25 March 2007, and was later released on DVD and Blu-ray.</p><p>Rome received largely positive reviews and had a high number of viewers. It received substantial media attention from the start, becoming a ratings success for HBO and the BBC (although the numbers declined considerably in the second season) and being honoured with numerous awards, including four Emmy Awards, seven Primetime Emmy Awards, and a Visual Effects Society Award. The series ran for two seasons out of the planned five due to high production cost; much of the material for the third and fourth seasons was telescoped into the second season.</p><br/><h3>Plot overview</h3><p>The series primarily chronicles the lives and deeds of the rich, powerful, and historically significant, but it also focuses on the lives, fortunes, families, and acquaintances of two common men: Lucius Vorenus and Titus Pullo, fictionalized versions of a pair of Roman soldiers mentioned in Caesar's Commentarii de Bello Gallico. The fictional Vorenus and Pullo manage to witness and often influence many of the historical events presented in the series, although some dramatic license is taken.</p><p>The first season depicts Julius Caesar's civil war of 49 BC against the traditionalist conservative faction in the Roman Senate (the Optimates), his rise to dictatorship over Rome, and his fall, spanning the time from the end of his Gallic Wars (52 BC or 701 ab urbe condita) until his assassination on 15 March 44 BC (the infamous Ides of March). Against the backdrop of these cataclysmic events, we also see the early years of the young Octavian, who is destined to become Augustus, the first Emperor of Rome. The second season chronicles the power struggle between Octavian and Mark Antony following Caesar's assassination, spanning the period from Caesar's death in 44 BC to the suicide of Antony and Cleopatra in 30 B.C. after their defeat at the Battle of Actium.</p><br/><h3>Cast</h3><ul><li>Kevin McKidd as Lucius Vorenus – A staunch, traditional Roman officer who struggles to balance his personal beliefs, his duty to his superiors, and the needs of his family and friends. The basis for this character is the historical Roman soldier of the same name, who is briefly mentioned in Julius Caesar's De Bello Gallico 5.44.</li><li>Ray Stevenson as Titus Pullo – A friendly, upbeat, devil-may-care soldier with the morals of a pirate, the appetites of a hedonist, and a total lack of personal responsibility, who discovers hidden ideals and integrity within himself.</li><li>Ciarán Hinds as Julius Caesar (season 1; guest season 2) – Caesar is ambitious but his aims and motives are often kept ambiguous to further complicate the plot and test the personal loyalties of other characters. He advertises himself as a reformer who sides with the Plebeians, though he is himself a Patrician. He is also merciful to his beaten enemies, genuinely distressed by their deaths, and relieved at their willingness to make peace where a more vindictive individual would have simply killed them.</li><li>Kenneth Cranham as Pompey Magnus (season 1) – A legendary general, past the days of his prime, who tries to recapture the glories of his youth as well as to do what is right for the Republic. The real Gnaeus Pompeius Magnus was a Roman general and politician who was as ambitious as Caesar and just as unorthodox in his youth. He chose to ally himself with the optimates in opposing Caesar and supporting the traditional Roman Republic.</li><li>Polly Walker as Atia of the Julii – The niece of Julius Caesar and mother of Octavian and Octavia. She is depicted as a cheerfully amoral and opportunistic manipulator. Her family connections and sexual liaisons have brought her into contact with some of the most powerful individuals in Rome, making her a highly influential figure in Roman society. Atia is very loosely based on the historical figure Atia about whom little detail is known. Rome historical consultant Jonathan Stamp identifies the historical figure Clodia as the primary basis for the character of Atia.</li><li>James Purefoy as Mark Antony – A very popular and cunning Roman general and politician and a close supporter of Julius Caesar in Season 1. In Season 2, he is in a power struggle with the power hungry and unaccomplished Octavian.</li><li>Tobias Menzies as Marcus Junius Brutus – Portrayed as a young man torn between what he believes is right, and his loyalty and love of a man who has been like a father to him. The real Marcus Junius Brutus was the most famous of Julius Caesar's assassins, and one of the key figures in the civil wars that followed the assassination.</li><li>Max Pirkis (season 1; guest season 2) and Simon Woods (season 2) as Gaius Octavian (Augustus) – Son and younger child of Atia, Octavian is presented as a cold, self-entitled student of power and politics. He is eager to enter political life and follow in Caesar's footsteps – an ambition more easily achieved when Caesar posthumously adopts him. The basis for this character is the early life of Augustus, the first Roman Emperor.</li><li>Lindsay Duncan as Servilia of the Junii – The mother of Marcus Junius Brutus, lover of the married Julius Caesar, and enemy of Atia of the Julii. Servilia is depicted as a sophisticated and regal Roman matron who follows her heart to her detriment, betrayed by love, and hungering for revenge. Slowly she becomes as cold, calculating, and cruel as those whom she would destroy. Servilia is loosely based on the historical personage of Servilia, mother of Marcus Junius Brutus, and famous lover of Julius Caesar.</li><li>Lyndsey Marshal as Cleopatra – The hedonistic co-Pharaoh of Egypt, she plots to seduce Caesar in order to obtain his aid and protection to depose her brother. After Caesar's death, she seeks Mark Antony's protection, thus also becoming Atia's rival.</li><li>Indira Varma as Niobe (season 1; guest season 2) – A woman, Niobe is a proud Plebeian from a large clan. After marrying Lucius Vorenus and giving birth to their two daughters, she functioned as a single parent when Lucius went off to war. After being told (incorrectly) by the army that Vorenus is dead, she embarks on a love affair with her sister's husband, giving birth to a son a few months before a very much alive Vorenus returns home. Convinced he will kill her and all the children should he learn of the affair, she tells Vorenus that the baby Lucius is his grandson by their older daughter and her lover.</li><li>Nicholas Woodeson as Posca – A Greek slave of Julius Caesar, and also his friend, aide-de-camp, and confidant in most things personal and professional. As a slave, he will seldom receive credit, but it appears that some of the simpler and more elegant solutions to Caesar's problems come from the mind of Posca. Posca is freed and given a stipend in Caesar's will at the start of the second season. He throws his support behind Antony, but later strategically defects to Octavian.</li><li>Kerry Condon as Octavia of the Julii – The character is based on the Roman matron Octavia Thurina Minor, sister of Roman Emperor Augustus, born to one of the most powerful families in Rome, the Julii. Octavia is the only daughter and elder child of Atia of the Julii, who is the niece of Gaius Julius Caesar. In Season 2, for political reasons she is married to Mark Antony. This is something she did in real life when Antony was newly a widower in 40 BC as part of the Pact of Brundisium, having been ordered by the Senate to set aside the mandatory ten-month term of widowhood after the death of her first husband, Claudius Marcellus.</li><li>Rick Warden as Quintus Pompey – The son of Pompey. There is no basis for this character, but he may be meant to represent the younger of Pompey's historical sons Sextus Pompeius.</li><li>Karl Johnson as Cato the Younger (season 1) – An extreme traditionalist, against political, social, and moral decay, and a staunch defender of the Roman Republic. The real Cato the Younger was a Roman orator, author and politician who committed suicide to avoid living under Caesar's tyranny.</li><li>David Bamber as Marcus Tullius Cicero – A moderate politician and scholar, faced with trying to save the traditional Republic from the ambitions of the various characters on the show. He is depicted as craven and willing to take any position to save his own skin. The real Cicero was a Roman politician, writer and orator.</li><li>Lee Boardman as Timon – A Jewish horse trader who serves as a loyal assassin and bodyguard for Atia. He accepts money as payment but prefers sex with Atia.</li><li>Paul Jesson as Quintus Metellus Scipio - Comrade and follower of Cato.</li></ul><br/><h3>Episodes</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr style=\"text-align:center\"><th scope=\"col\" rowspan=\"2\" style=\"min-width:50px;padding:0 8px\">Series</th><th scope=\"col\" rowspan=\"2\" colspan=\"2\" style=\"padding:0 8px\">Episodes</th><th scope=\"col\" colspan=\"2\">Originally aired</th></tr><tr><th scope=\"col\">First aired</th><th scope=\"col\">Last aired</th></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span class=\"mw-redirect\">1</span></span></span></span></th><td colspan=\"2\">12</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">28 August 2005</td><td style=\"padding:0 8px\">20 November 2005</td></tr><tr style=\"height:100%\"><th scope=\"row\" colspan=\"1\" style=\"height:inherit;padding:0\"><span style=\"text-align:center;float:left;width:100%;height:100%\"><span style=\"height:100%;width:calc(100% - 14px - 8px);display:flex;vertical-align:middle;align-items:center;justify-content:center;padding:0 4px\"><span class=\"nowrap\"><span class=\"mw-redirect\">2</span></span></span></span></th><td colspan=\"2\">10</td><td colspan=\"1\" style=\"padding:0.2em 0.4em\">14 January 2007</td><td style=\"padding:0 8px\">25 March 2007</td></tr></tbody></table><br/><h3>Production</h3><h4>Development</h4><p>William J. MacDonald and John Milius pitched the idea to HBO as a miniseries, but the network made it a full-fledged series. In 2002, HBO and the BBC agreed to co-produce the series, committing a US$100–110 million (£62.7 million) budget to the production of twelve 1-hour episodes, with HBO contributing $85 million, and the BBC contributing $15 million. The BBC contributed £800,000 to every episode of Rome in its first season. Rome is the largest co-produced series with the American film market in the BBC's history. The series also marked the first series on which HBO and the BBC worked together as co-producers, although the two companies had worked together in other roles in earlier series, including Band of Brothers and The Gathering Storm.</p><p>Tranter from the BBC has said this about the development of Rome: \"It felt like something that could have been developed by us, and HBO felt like natural partners for the BBC\". On 20 April 2006, Carolyn Strauss, president of HBO announced the development of a second season for Rome.</p><p>The filmmakers stressed that they wanted to portray Rome as a gritty and realistic city as opposed to what they call the \"Hollyrome\" presentation that audiences are used to from other films, with \"cleanliness and marble and togas that looked pressed.\"</p><h4>Filming</h4><p>Between March 2004 and May 2005 Rome was filmed in co-production with Rai Fiction in the Italian countryside on Cinecittà studios' six sound stages in Rome. A collection of massive sets in Cinecittà studios' back lots comprised an elaborate \"period reconstruction\" of sections of ancient Rome. It was a huge undertaking, with an international crew of 350, and more than 50 local Italian interns.</p><p>The production is regarded as one of the most expensive in the history of television. Funding was generously employed to recreate an impressively detailed set featuring a number of Roman Villas, the Forum, and a vast slum area of the ancient city of Rome. A significant part of this set was later destroyed by a fire that burned down a portion of the Cinecittà Studios in 2007. According to HBO, the fire started after they had finished filming the second season. A portion of the set was also used in late 2007 by the crew of the long-running BBC sci-fi drama series Doctor Who, for the fourth-season episode \"The Fires of Pompeii\".</p><p>Audio commentary on the Season 1 DVD indicates that many of the background performers used in the series were also their true professional counterparts. One example is that the actor shown in the series working as a butcher on the streets of Rome was in fact a real-life butcher.</p><h4>Editing</h4><p>In a separate move, the BBC also decided to re-edit the first three episodes (all directed by Michael Apted) into two episodes. The BBC claimed that this was because the British audience were more familiar with the history of Rome than their American counterparts and so much of the history was unnecessary; however, Apted claims that the purpose was to boost the ratings by increasing the prominence of the scenes of sex and violence. In an interview with The Times, Apted said:</p><blockquote>I'm really pissed off with the BBC for bringing down my first three episodes to two and, in doing so, taking out much of the vital politics. What also makes me very grumpy is that I was told that the cuts had been introduced by the BBC because they thought British viewers already knew the historical background. But all that's happened as far as the viewer is concerned is that it has made Rome hard to follow.</blockquote><p>Apted also said that he only learned of the edits by accident, \"...a couple of weeks ago when one of the actors told me\". Since then, the original uncut Season 1 episodes aired on UKTV Drama, coincident with the UK broadcast of Season 2 on BBC Two.</p><p>The Italian broadcast of the series was also marred by controversy. Strong language was removed in the Italian dubbing process; as for the more explicit sex scenes and disturbing violence, they were replaced by \"safe\" alternative versions shot during production especially for the Italian market. Rai 4 began showing the \"complete version\" of the series on Italian TV in September 2009.</p><h4>Music</h4><p>Composer Jeff Beal was invited to audition for Rome after he completed work on HBO's Carnivàle. The producers sent him a short edit of season 1 episode 7. From that, Beal began writing a demo score. Based on head writer Bruno Heller's desired gritty pre-Christian feel for the series, and HBO's interest in a non-modern sound, Beal chose to compose and record with live instruments from across the ancient Roman world. For each episode, Beal had about two weeks to work: in the first, he composed for – and recorded – the instruments he performed on the soundtrack. In the second week, he incorporated producer's notes, and orchestrated and recorded the other live instrumental sections.</p><br/><h3>Broadcast and DVD releases</h3><p>Rome's first season originally aired on HBO in the United States between 28 August and 20 November 2005, subsequently being broadcast on the United Kingdom's BBC Two between 2 November 2005 and 4 January 2006. The second season aired on HBO in the US from 14 January 2007 to 25 March 2007.</p><h4>International syndication</h4><p>The series was launched in the United States on 25 August 2005, at Wadsworth Theatre in Los Angeles. HBO broadcast the series pilot \"The Stolen Eagle\" four days later. According to the Nielsen ratings system, the pilot broadcast was seen by 3.8 million viewers and achieved a 9.1 household rating for Sunday primetime. HBO re-aired the pilot 11 times in the week following 28 August 2005 premiere, garnering a total viewership of 8.9 million for all 11 airings. After the broadcast of only three first-season episodes, HBO announced plans to produce a second season of Rome in 2006, for release in March 2007. HBO aired each episode multiple times a week, and by the end of the first season, the total weekly audience for all airings exceeded seven million viewers. The second season premiered in January 2007, with the first episode attracting 1.5 million viewers. The final episode aired 25 March 2007 in the US, garnering 2.4 million viewers.</p><p>In total, HBO spent about $10 million US$ to promote Rome. HBO enlisted the Mozilla Firefox web browser in its marketing campaign for the series by designing a downloadable custom Rome Firefox theme. BBC Two premiered Rome in the United Kingdom on 2 November 2005, attracting 6.6 million viewers (27%); viewing figures declined in future episodes, with the season finale only attracting 3 million viewers (13%). The first episode of the second season aired on BBC Two on 20 June 2007.</p><p>A \"sanitized\" version of the first series of Rome – with toned-down nudity and violence – aired on Rai 2 in Italy, garnering only a meager 10% audience share. RAI also stated to have co-produced the show, whereas HBO listed only itself and BBC as co-producers. The Italian newspaper, Corriere della Sera called it a \"prime example of historical misinformation\", and called actor Ciarán Hinds (Julius Caesar) a \"parody\". The paper also called the relationship between Atia of the Julii (Polly Walker) and Mark Antony (James Purefoy) \"ridiculous\". The second series was never broadcast at all on analog TV; however, starting from October 2009, digital-only channel Rai 4 broadcast the original uncut version of the first series and went on to broadcast the second series unaltered as well.</p><h4>Cancellation and future</h4><p>HBO Chairman Chris Albrecht announced in a July 2006 news conference that season two of Rome would be its last, citing the fact that the series (called \"notoriously expensive\" by Broadcasting & Cable) had been developed under a two-year contract with the BBC that would have been difficult for the BBC to extend due to the series' cost. Of the storyline, co-creator Heller said:</p><blockquote>I discovered halfway through writing the second season the show was going to end. The second was going to end with the death of Brutus. Third and fourth season would be set in Egypt. Fifth was going to be the rise of the Messiah in Palestine. But because we got the heads-up that the second season would be it, I telescoped the third and fourth season into the second one, which accounts for the blazing speed we go through history near the end. There's certainly more than enough history to go around.</blockquote><h4>Potential film</h4><p>In a February 2008 interview with Movieweb.com, actor Ray Stevenson stated that a Rome film was in development, with Heller working on a script. Heller confirmed in December that there was \"talk of doing a movie version\", adding that \"It's moving along. It's not there until it is there. I would love to round that show off\". In an April 2009 interview with the Associated Press, actor Kevin McKidd stated the Rome film was \"in development\", and Lucius Vorenus would likely be a part of it. McKidd said in a later 2009 interview, \"There is a script that is being shopped and it's supposedly very good, I haven't seen it, but I am definitely going to be a part of the movie... He is very much alive, so that should be a fun story to tell.\" In March 2010, Entertainment Weekly stated that Heller had completed the script for Morning Light Productions, the film's financiers, and was now awaiting a director and a studio, since HBO Films \"won't be involved\". However, in a 2011 interview with Entertainment Weekly, Heller indicated the project had stalled – \"I'm not holding my breath.\"</p><h4>Home media</h4><p>Rome: The Complete First Season was released as a six-disc Region 1 DVD box set in the United States in 2006, distributed by HBO Home Video. Featuring all 12 episodes, it included features such as episode commentaries, behind-the-scenes footage and making-of features. The set (without the episodic previews and recaps) was also released in Region 2, with the same title.</p><p>Season 2 was released in North America in 2007 and soon after in Region 2. Rome: The Complete Series was released in November 2009 on Blu-ray in North America.</p><br/><h3>Impact</h3><h4>Reception</h4><p>Rome garnered mostly positive reviews. Sean Woods from Rolling Stone called the series \"masterful\" and \"epic\", and gave the series 3.5 out of 4. Alessandra Stanley from The New York Times said: \"But behind all that gritty squalor the glory that was Rome gets lost\", while reviewing season 2. Lisa Schwarzbaum from Entertainment Weekly gave season 2 a B and commented on the \"spectacular\" clothing design. Michael Ventre from Variety magazine was positive towards the series and was intrigued by the \"complex\" character of Atia of the Julii. James Poniewozik from Time magazine commented on the \"slow start\" but further stated that the series \"draws you\" to the ancient city of Rome.</p><p>Empire magazine reviewer Helen O'Hara said: \"Not as good-looking as Gladiator, perhaps, but richer in (reasonably accurate) history and texture\", and gave season 1 of Rome four out of five stars. Robert Bianco from USA Today called season 2 \"the fall of Rome\", commenting that season 2 was not as good as season 1 citing \"off-key characterizations and plot absurdities\". Linda Stasi from The New York Post called herself a \"slave\" to the show. Melanie McFarland from Seattle Post-Intelligencer called season 2 \"at top of its form\" and said it was as good as the former season. Historian Robin Lane Fox, writing in The Guardian, called the series \"splendidly ambitious\". Eric Neigher from Slant Magazine called season 1 of Rome \"good art\". Robert Abele from LA Weekly called it the \"most lavish dramatic series yet\" released by HBO.</p><p>On review aggregator Rotten Tomatoes, the first season has an approval rating of 83% based on 36 reviews, with an average score of 8.62/10; the critical consensus reads: \"Rome builds slowly, but a laborious start delivers rich rewards in the form of decadent sets, delicious drama and a surprising amount of intimacy\". The second season has an approval rating of 89% based on 28 reviews, with an average score of 8.05/10; the critical consensus reads: \"Pulp meets prestige in Rome’s sensational second season -- though its style sometimes outweighs its substance\".</p><h4>Awards and nominations</h4><p>Capping its successful first season, Rome won four Emmy Awards out of eight nominations in 2006, for the episodes \"Caesarion\", \"Triumph\", \"Kalends of February\" and \"Stealing from Saturn\". The series also won an Art Directors Guild (ADG) in the category \"Excellence in Production Design – Single-Camera Television Series\" for the pilot episode \"The Stolen Eagle\". Michael Apted won the Directors Guild of America (DGA) in the category \"Outstanding Directing – Drama Series, Night\" for \"The Stolen Eagle\". The series itself was nominated for a Golden Globe Award in the category \"Best Television Series – Drama\", and Polly Walker who portrayed Atia of the Julii was nominated in the category \"Best Performance by an Actress In A Television Series – Drama\". The series was also nominated for three Satellite Awards, two for season 1 and the last for season 2. The pilot episode \"The Stolen Eagle\" won a Visual Effects Society (VES) award in the category \"Outstanding Visual Effects – Broadcast Series\". Writers Guild of America (WGA) nominated the series for the category \"Best Writing – New Television Series\" in 2005. The series was also nominated for four British Academy Television Awards (BAFTA), three in season 1 (2006) and one in season 2 (2008). In 2005, the series was nominated for a Cinema Audio Society Award (CAS) in the category \"Outstanding Achievement in Sound Mixing for Television Series\" for the episode \"The Spoils\". The British award ceremony nominated the series for the Royal Television Society (RTS) award in the category \"Best Visual Effects – Digital Effects\". For season 2 (2007) Alik Sakharov won the Primetime Emmy Award for Outstanding Cinematography for a Single-Camera Series, for the episode \"Passover\".</p><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th style=\"background:#eedd82;\">Award</th><th style=\"background:#eedd82;\">Year</th><th style=\"background:#eedd82;\">Category</th><th style=\"background:#eedd82;\">Nominee/Nominated Episode</th><th style=\"background:#eedd82;\">Result</th><th style=\"background:#eedd82;\"><abbr title=\"References\">Ref.</abbr></th></tr><tr><td><span class=\"mw-redirect\">Art Directors Guild Award</span></td><td><span>2005</span></td><td>Excellence in Production Design – Single-Camera Television Series</td><td>\"<span>The Stolen Eagle</span>\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span class=\"mw-redirect\">Directors Guild of America Award</span></td><td><span>2005</span></td><td>Outstanding Directing – Drama Series, Night</td><td><span>Michael Apted</span> for \"The Stolen Eagle\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"15\"><span class=\"mw-redirect\">Primetime Emmy Award</span></td><td rowspan=\"8\"><span>2006</span></td><td>Outstanding Art Direction for a Single-Camera Series</td><td>\"<span class=\"mw-redirect\">Caesarion</span>\"; \"<span class=\"mw-redirect\">Triumph</span>\"; \"<span class=\"mw-redirect\">Kalends of February</span>\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"3\"></td></tr><tr><td>Outstanding Costumes for a Series</td><td>\"Triumph\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Hairstyling for a Series</td><td>\"<span class=\"mw-redirect\">Stealing from Saturn</span>\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Main Title Design</td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\"></td></tr><tr><td>Outstanding Makeup for a Series (Non-Prosthetic)</td><td>\"Caesarion\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Music Composition for a Series (Dramatic Underscore)</td><td>\"Triumph\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Main Title Theme Music</td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Outstanding Special Visual Effects for a Series</span></td><td>\"The Stolen Eagle\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td rowspan=\"7\"><span>2007</span></td><td>Outstanding Art Direction for a Single-Camera Series</td><td>\"<span class=\"mw-redirect\">Heroes of the Republic</span>\"; \"<span class=\"mw-redirect\">Philippi</span>\"; \"<span class=\"mw-redirect\">Deus Impeditio Esuritori Nullus (No God Can Stop a Hungry Man)</span>\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td rowspan=\"3\"></td></tr><tr><td>Outstanding Cinematography for a Single-Camera Series</td><td>Alik Sakharov for \"<span class=\"mw-redirect\">Passover</span>\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Hairstyling for a Series</td><td>\"<span class=\"mw-redirect\">De Patre Vostro (About Your Father)</span>\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td></tr><tr><td>Outstanding Costumes for a Series</td><td>\"De Patre Vostro (About Your Father)\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"4\"></td></tr><tr><td>Outstanding Makeup for a Series (Non-Prosthetic)</td><td>\"De Patre Vostro (About Your Father)\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Music Composition for a Series (Dramatic Underscore)</td><td>\"Philippi\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td>Outstanding Visual Effects for a Series</td><td>\"Philippi\"</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"2\"><span class=\"mw-redirect\">Golden Globe Award</span></td><td rowspan=\"2\"><span>2005</span></td><td><span>Best Performance by an Actress In A Television Series – Drama</span></td><td><span>Polly Walker</span> as <span class=\"mw-redirect\">Atia of the Julii</span></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"2\"></td></tr><tr><td><span>Best Television Series – Drama</span></td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td rowspan=\"3\"><span class=\"mw-redirect\">Satellite Award</span></td><td rowspan=\"2\"><span>2005</span></td><td>Outstanding Supporting Actress – Series, Miniseries or Television Film</td><td>Polly Walker as Atia of the Julii</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td rowspan=\"3\"></td></tr><tr><td>Outstanding Television Series – Drama</td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span>2007</span></td><td>Best DVD Release of a TV Show</td><td>Season 2</td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td></tr><tr><td><span class=\"mw-redirect\">Screen Actors Guild Award</span></td><td><span>2007</span></td><td>Outstanding Stunt Cast – Television Series</td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr><tr><td><span class=\"mw-redirect\">Visual Effects Society Award</span></td><td><span class=\"mw-redirect\">2005</span></td><td>Outstanding Visual Effects – Broadcast Series</td><td>\"The Stolen Eagle\"</td><td style=\"background: #9EFF9E; color: #000; vertical-align: middle; text-align: center;\" class=\"yes table-yes2 notheme\">Won</td><td></td></tr><tr><td><span class=\"mw-redirect\">Writers Guild of America Award</span></td><td><span class=\"mw-redirect\">2005</span></td><td>Best Writing – New Television Series</td><td></td><td style=\"background: #FFE3E3; color: black; vertical-align: middle; text-align: center;\" class=\"no table-no2 notheme\">Nominated</td><td></td></tr></tbody></table><h4>Historical accuracy</h4><p>The series' major details, like who won each battle, are generally historically accurate, but many of the minor details were fabricated. The show is generally told from the perspective of Lucius Vorenus and Titus Pullo, and while they were real people who were briefly mentioned in Caesar's Commentarii de Bello Gallico, almost all of their adventures in the series are fictional.</p><p>Co-creator Bruno Heller has said, \"We try to balance between what people expect from previous portrayals and a naturalistic approach ... This series is much more about how the psychology of the characters affects history than simply following the history as we know it\". Series Historical Consultant Jonathan Stamp also notes that the show aims for \"authenticity\" rather than \"accuracy\":</p><blockquote>We did everything we could to make these episodes historically authentic, which meant researching and incorporating every kind of detail we could about the way our characters behaved, the way they interacted, how they dressed and gestured, the kind of streets they walked down, the way they conducted their private and public lives. We were not, however, making a documentary. We were striving for authenticity because it enriches the experience of the drama for the viewer.</blockquote><br/>"
  },
  "errorMessage": ""
}