{
  "imDbId": "tt1795096",
  "title": "Behzat Ç.: Bir Ankara Polisiyesi",
  "fullTitle": "Behzat Ç.: Bir Ankara Polisiyesi (TV Series 2010–2019)",
  "type": "TVSeries",
  "year": "2010",
  "items": [
    {
      "username": "popnruss",
      "userUrl": "https://www.imdb.com/user/ur71913888",
      "reviewLink": "https://www.imdb.com/review/rw3749428",
      "warningSpoilers": true,
      "date": "8 July 2017",
      "rate": "10",
      "helpful": "24 out of 24 found this helpful.",
      "title": "Episode 78",
      "content": "I have thoroughly enjoyed watching this series. When I have reached the final episode it will feel as though I am saying farewell to friends. This is an incredibly written, directed, and acted series. It is so realistic in many instances, to me, who knew very little of Turkish culture. I have learned so much having watched this series through 78 episodes. The characters are so dynamic, unpredictable, funny, loyal, and likable despite their flaws. I particularly enjoyed Episode 78 due to how incredibly honest it was. Vulture painfully recalling why the woman he had loved for so long committed the murders she did and Behzat admitting that Sule is his daughter. How many times have we sat with friends, drinking, recalling past stories that have made our lives what they are? I felt as if I was sitting with Behzat, Harun,Vulture, Ghost, and Cevdet sharing their pain , yet on the outside,able to laugh at their expressions and antics. I will miss you, Homicide Bureau and all those characters who have made this a remarkable series. I have come to the end of this incredible series that has captured my attention and heart through 96 episodes. To me, the finest police drama I have seen to date. Thank you, Behzat and all the members of your world."
    },
    {
      "username": "ahmetkozan",
      "userUrl": "https://www.imdb.com/user/ur48829349",
      "reviewLink": "https://www.imdb.com/review/rw3440645",
      "warningSpoilers": false,
      "date": "28 March 2016",
      "rate": "10",
      "helpful": "49 out of 54 found this helpful.",
      "title": "The Legend Series Behzat Ç.",
      "content": "Through this series I liked Ankara. Behzat Ç is a rough, violent and morally ambiguous police officer who is the head of the homicide department in Ankara. Behzat Ç and his team usually work together with the public prosecutor Esra, who later becomes his love interest. I wish though that all police officers.A series of very sincere. All the characters in the series so good. They complement each other. Array doing different from other series. 'La' word stuck in my mouth. Unfortunately, the series it was finished. I wish I had not been this way. Very more should be done like this series. It became one of the series will not be forgotten. So at least for me... 10/10"
    },
    {
      "username": "titiboirok",
      "userUrl": "https://www.imdb.com/user/ur42533170",
      "reviewLink": "https://www.imdb.com/review/rw4043033",
      "warningSpoilers": false,
      "date": "25 January 2018",
      "rate": "10",
      "helpful": "18 out of 18 found this helpful.",
      "title": "widening understanding",
      "content": "Cinema and series from all parts of this world can entertain,enlighten,help understanding a country and its people...Behzat does that,yes a \"cop show\" of all things!The characters are real it seems,we get glimpses of life in Turkey/Ankara,we have a taste of levels of government,police structures,modern and more traditional aspects of a country portrayed by some media(all!?)in a over simplistic manner....amazing show,thank you to the Turkish People!"
    },
    {
      "username": "hectorthegreat",
      "userUrl": "https://www.imdb.com/user/ur24307002",
      "reviewLink": "https://www.imdb.com/review/rw4438278",
      "warningSpoilers": false,
      "date": "4 November 2018",
      "rate": "10",
      "helpful": "16 out of 16 found this helpful.",
      "title": "Best show made for TV - most clever and intense scenario",
      "content": "Best because it is daily life.. it is sincere.. they are not acting, it is like a window to someone's real life.. so intense, so sincere, so real.. You can find friendship, sacrifice, pain, empathy, understanding, passion, intelligence unlike modern series.. I wish I was one of them.you must know that series can be found in youtube, and if you are a real fan of these guys and their dialouges, you should also check cep dizi series..movies are also nice, completing the missing parts in TV episodes..as my last words, I could say that, I cried and laughed with the series for the last 6 years... I keep restarting from the first episode and everytime I watch one more time, I see what I have missed in the previous time I watched. .definitely helpful for your psyhcology.. especially if you are emotional..remember to buy beer or raki before you start, believe me you will need that!"
    },
    {
      "username": "doofuzzdudes",
      "userUrl": "https://www.imdb.com/user/ur119423733",
      "reviewLink": "https://www.imdb.com/review/rw5803031",
      "warningSpoilers": false,
      "date": "6 June 2020",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Best Series Ever",
      "content": "Although this series takes a whole chunk of your life since each of the 97 or so episodes is between 1.5 to 2 hours long, you will enjoy watching it much more than doing anything else in the same amount of time. The characters are very well rounded and the acting is brilliant. The actor who plays Behzat really lives the role. He is totally believable and although I could have lived without every second word being an F word (and very creatively used F words to boot!), the bad language did suit the characters' characters. The story line was very well crafted with unexpected twists. Two of the writers' triumphs were the characters of Bashgat Memdez (spelling undoubtedly wrong) and the psychopathic Ercüment Çözer. I just loved the humorous lines they were given as they killed right, left and centre. Another favourite of mine was Behzat's brother, Sevket. He was annoying in a very entertaining way. Harum was more difficult to handle but well you can't choose your co-workers I suppose. There was only one ridiculous episode and that was a dream sequence which really was a waste of time, but the rest of the series was absolutely first class and if they brought out another series I'd be happy to spend another 200 hours watching it!"
    },
    {
      "username": "stanleyhongxia",
      "userUrl": "https://www.imdb.com/user/ur87196470",
      "reviewLink": "https://www.imdb.com/review/rw4370326",
      "warningSpoilers": false,
      "date": "1 October 2018",
      "rate": "10",
      "helpful": "96 out of 96 found this helpful.",
      "title": "I am from the US and loved the Series",
      "content": "Saw this on NETFLIX. Gave me a great view on what Turkish life and customs and political issues . I was sad to see it end at 96 episodes as I felt like I was loosing friends. I know they are only TV characters, but still I wonder what happened to them, how their lives went. That is what a great TV series should do it should make you feel the characters are real and care about them."
    },
    {
      "username": "specialistoflight",
      "userUrl": "https://www.imdb.com/user/ur46845003",
      "reviewLink": "https://www.imdb.com/review/rw3750209",
      "warningSpoilers": false,
      "date": "9 July 2017",
      "rate": "9",
      "helpful": "31 out of 31 found this helpful.",
      "title": "Impressive series",
      "content": "The series is about a homicide detective, the people around him and his mental state.This series is very well executed, all questions get answers. There are even a few plot twists that I didn't see coming. The characters are believable, and they are acted skillfully. It captures the social conflicts in Turkey well. The murder cases are usually interesting. It is one of the best shows I've ever watched, a list that includes many expensive Hollywood productions. It was actually very surprising that I'd like a show from Turkey this much.There are a few negative points however, for which people who consider watching this should prepare themselves. First, there is a lot of swearing. This is made worse by the censorship enforced by Turkish TV. All the swearing is bleeped out, so sometimes it feels like you are listening to a voice-over by R2D2. Some visual elements are censored as well, such as alcoholic drinks later in the show. As the last point, English subtitles are not very well translated. You'll get the point, but sometimes how something is said is important to capture the depth of the scene, which is typically lost.All in all, I'd recommend this to anyone who are interested in a police drama."
    },
    {
      "username": "amokachi",
      "userUrl": "https://www.imdb.com/user/ur0513192",
      "reviewLink": "https://www.imdb.com/review/rw2393818",
      "warningSpoilers": true,
      "date": "4 March 2011",
      "rate": "10",
      "helpful": "101 out of 122 found this helpful.",
      "title": "Best TV series ever in Turkey",
      "content": "Behzat Ç. is basically about the adventures of a homicide detective and his squad in Ankara, the capital city of Turkey. The series are adapted from the novels of Emrah Serbes (Her Temas İz Bırakır and Son Hafriyat) and directed by famous Turkish film director Serdar Akar, known with his movies Gemide, Dar Alanda Kısa Paslaşmalar, Barda and Kurtlar Vadisi Irak. Erdal Besikcioglu is the star of the series. He previously performed in Turkish movies Vali, Eve Giden Yol and Bal as well as various TV series (Ayrılık, Köprü, Es Es) although he is originally a theater actor. The series enjoyed a widespread popularity especially among the Turkish youth because of its realistic dialogs (also including the use of slang) showing the injustices and controversies in juridical system and law enforcement agency. Stories also touch upon some political discussions and criticize chauvinism."
    },
    {
      "username": "mmancini222",
      "userUrl": "https://www.imdb.com/user/ur25591690",
      "reviewLink": "https://www.imdb.com/review/rw6195655",
      "warningSpoilers": false,
      "date": "22 October 2020",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "Behzat Ç is the Best Turkish language series ever!",
      "content": "Spoiler Alert: I finished and am completely spent emotionally. I sobbed along with Ghost as his tears fell and for Behzat's tormented soul, this man is Everyman - my son committed suicide two years ago this Friday, my husband died a horrible death by throat cancer a year ago, I have suffered immeasurable pain and yet I can empathize with Behzat and his immense, deep soulful pain. The writers deserve our gratitude for creating such complete characters, including their many quirks and faults. The actors - what can I say? All brilliant in their own way but of course our Captain, Erdal Besikcioglu, must be singled out as a truly gifted actor. His immersion into the role of Behzat is nothing short of genius. All in all, one if the finest works of film art I have ever been privileged to view."
    },
    {
      "username": "EVON1TY",
      "userUrl": "https://www.imdb.com/user/ur47939660",
      "reviewLink": "https://www.imdb.com/review/rw5380831",
      "warningSpoilers": false,
      "date": "4 January 2020",
      "rate": "8",
      "helpful": "4 out of 4 found this helpful.",
      "title": "A really good crime, drama tv serie.",
      "content": "This is one of the good Turkish series. It has good complex story and it is worth to see absolutely."
    },
    {
      "username": "buraksafab",
      "userUrl": "https://www.imdb.com/user/ur116879057",
      "reviewLink": "https://www.imdb.com/review/rw5651679",
      "warningSpoilers": false,
      "date": "18 April 2020",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "The scenario is unique",
      "content": "Really good scenario. I've never watched a series of characters and actors so compatible before. Selected good actors. Akbaba is amazing. This serie is unique. I am \"Memduh Baskan\" fan."
    },
    {
      "username": "elifnasitealaca",
      "userUrl": "https://www.imdb.com/user/ur106832942",
      "reviewLink": "https://www.imdb.com/review/rw5070221",
      "warningSpoilers": false,
      "date": "19 August 2019",
      "rate": "10",
      "helpful": "6 out of 6 found this helpful.",
      "title": "Legend",
      "content": "Well, here we see a damn Turkish TV legend and guess what? It's coming back!!!"
    },
    {
      "username": "ofaruksevim",
      "userUrl": "https://www.imdb.com/user/ur100768078",
      "reviewLink": "https://www.imdb.com/review/rw4927442",
      "warningSpoilers": false,
      "date": "10 June 2019",
      "rate": "9",
      "helpful": "9 out of 9 found this helpful.",
      "title": "OMG",
      "content": "Finally it comes back. Thanks to blutv, (it's kinda Turkish Netflix) we'll meet with our captain on July 2019. I've missed all characters so much. They're like my family. Every Turkish boy had crush on Sule while serie was on screen."
    },
    {
      "username": "broonzrule",
      "userUrl": "https://www.imdb.com/user/ur83478891",
      "reviewLink": "https://www.imdb.com/review/rw6437540",
      "warningSpoilers": false,
      "date": "3 January 2021",
      "rate": "8",
      "helpful": "3 out of 3 found this helpful.",
      "title": "Different cop show",
      "content": "I really liked this series, too bad Netflix only played the 1st season. It was like a cross between dirty harry and barney Miller. Loved it. It was extremely realistic and not PC which I liked. The captain and his sidekicks usually had me laughing my head off. He is sharp as a tack though no matter how much he drank."
    },
    {
      "username": "skyway3131",
      "userUrl": "https://www.imdb.com/user/ur29254639",
      "reviewLink": "https://www.imdb.com/review/rw2772091",
      "warningSpoilers": false,
      "date": "24 March 2013",
      "rate": "10",
      "helpful": "23 out of 38 found this helpful.",
      "title": "A great combination of reality and fiction",
      "content": "Behzat Ç.one of the best realistic shows in Turkey maybe the best.As writers says:what's happening in life it must be in Behzat Ç. to because of that the show has pressures from a lot of different organizations so producers decided to end the show in 100 episodes.You can see reality in everywhere from Actors's language to extras-es.Behzat Ç. is fiction part of the show.He's a police who doesn't care politic,religion,ideology.He's just want to do his job.He also just watch documentaries in TV(i guess there's a joke behind it to) but in that job you can't escape from politics and some dark relationships when show gone forward Behzat finds himself a lot of dirty jobs,danger,puzzles and of course murders.It's really hard to review about Behzat Ç. but in the end I just can say a great Drama including great writers,actors and great puzzles.I don't know what more can i say but i know a year later from now.We all feel emptiness of Behzat Ç. its very special and hard to fill its spot."
    },
    {
      "username": "user-547-709050",
      "userUrl": "https://www.imdb.com/user/ur38302862",
      "reviewLink": "https://www.imdb.com/review/rw2740618",
      "warningSpoilers": false,
      "date": "20 January 2013",
      "rate": "10",
      "helpful": "34 out of 49 found this helpful.",
      "title": "Too Good For Turkey",
      "content": "This show airs in Turkey where there are a lot of censorship. The committee is really conservative and they tend to censor all kinds of sexual activity(mostly even kissing), insulting, blood etc. Yet, life's itself has a lot of these situations. And this show clearly has the purpose of being natural. They use insultive words just as all Turkish people do. The characters are all like one of us. They are not made up nor irrational. And this novel based show, is the best of it's genre in Turkey by far. The leading role is quite charismatic, reckless, smart and good-hearted character but he's still perfectly natural. he doesn't use unrealistically expensive phones, he doesn't wear different clothes in each scene. They focus on the story which consists of crime scenes with secrets and enigmas in Behzat C's psychological situation and history."
    },
    {
      "username": "ilir_osmani",
      "userUrl": "https://www.imdb.com/user/ur24045882",
      "reviewLink": "https://www.imdb.com/review/rw6087800",
      "warningSpoilers": false,
      "date": "12 September 2020",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Behzat @ Ercüment ( Batman & Joker)",
      "content": "The best turkish tv show, the quality of cinematography is not good but the screenplay is perfect. The reality of Turkey."
    },
    {
      "username": "p_mete",
      "userUrl": "https://www.imdb.com/user/ur25903396",
      "reviewLink": "https://www.imdb.com/review/rw2419628",
      "warningSpoilers": true,
      "date": "25 April 2011",
      "rate": "10",
      "helpful": "49 out of 69 found this helpful.",
      "title": "When it is too good",
      "content": "I am probably writing this because of the last scene on the 30th episode. However by itself the 30th episode could not be the reason. Constant quality of the work delivered by this group of artist had been bewitching me to the point that nothing else could satisfy my taste for crime drama. I used to be a fan of Law and Order Criminal Intent, now it seems all too fictionalized for me. The fact may or may not be seen by watching the broken life of Behzat C, his love interests or his bizarre roommate Sule, not even his crew who consists of a Ghost, a Vulture and a Tosun Pasa. However they are so close to the fact, they make you think about them even can visualize them in your life. And the Expert of Crimes Against Life continues on living and solving those crimes, while he lives, more or less like anyone of us."
    },
    {
      "username": "esatesen-134-126602",
      "userUrl": "https://www.imdb.com/user/ur55849504",
      "reviewLink": "https://www.imdb.com/review/rw5774616",
      "warningSpoilers": false,
      "date": "26 May 2020",
      "rate": "9",
      "helpful": "7 out of 7 found this helpful.",
      "title": "A must-see production.",
      "content": "The best part of the series is that it tells the whole story with all its naturalness.The best example of how to deal with American TV series with a simple budget."
    },
    {
      "username": "j-flower-38556",
      "userUrl": "https://www.imdb.com/user/ur71526935",
      "reviewLink": "https://www.imdb.com/review/rw3728847",
      "warningSpoilers": false,
      "date": "12 June 2017",
      "rate": "8",
      "helpful": "17 out of 20 found this helpful.",
      "title": "Fascinating Turkish Crime Soap Opera",
      "content": "This series is interesting to view in terms of an insight into the Turkish way of life. The story lines are sometimes good and sometimes totally crazy. The characters are extremely well acted but at times annoying to watch which is what they are supposed to be and is a tribute to the professionalism of the actors. To complete the series is a marathon. Individual episodes are complete in themselves but there are several continuing story lines which attract you to the next episode to see what happens. What is fascinating is portrayal of the way policing operates in Turkish Muslem society and how citizens and police have to be wary of potentially corrupt entities within a highly authoritarian state. With potentially 150 hours of watching time I suspect not many people will make it to the end."
    },
    {
      "username": "caglarsonmez",
      "userUrl": "https://www.imdb.com/user/ur22348038",
      "reviewLink": "https://www.imdb.com/review/rw2653912",
      "warningSpoilers": true,
      "date": "4 August 2012",
      "rate": "10",
      "helpful": "15 out of 27 found this helpful.",
      "title": "A Psychological Politic TV Series",
      "content": "What makes Behzat Ç Bir Ankara Polisiyesi such a great series not only its' story, but also its' characters and their depth. None of the characters are shallow, they all have their own past and they are all played by great actors and actresses. Erdal Beşikçioğlu as Behzat Ç, and Canan Ergüder as Savcı Esra are the most notable of these examples. Origins of characters shown from time to time by flashbacks usually, especially if they are related with the topic of the episode. Almost every episode starts with a homicide, and because our main characters works as homicidal investigations; they try to find the murderer. But also there is a greater plot per season. Behzat Ç even has a nemesis whose past and his motives for hostility against Behzat Ç has not been revealed completely. Political side of the series is also highly controversial; some episodes attracted attention from officials, representatives and even from ministers because they contain serious criticism against the current administration."
    },
    {
      "username": "marsilo",
      "userUrl": "https://www.imdb.com/user/ur53746455",
      "reviewLink": "https://www.imdb.com/review/rw4857611",
      "warningSpoilers": false,
      "date": "16 May 2019",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Best of Turkey.",
      "content": "This is one of the great series of Turkey. If u like 'maverick style', u need watch this."
    },
    {
      "username": "jpicken-03846",
      "userUrl": "https://www.imdb.com/user/ur89585034",
      "reviewLink": "https://www.imdb.com/review/rw4807172",
      "warningSpoilers": true,
      "date": "27 April 2019",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "Sad to come to the end.",
      "content": "Today I finished the final episode of Behzat Ç. It is such a good series. I enjoy the development of each character: Harun matures, Cevdet loses his naïve innocence. We learn more about Akbaba's background. Eda's character becomes more influential and central. Hayalet holds it all together.Behzat's dedication to truth matches Prosecutor Esra's. I was surprised that the series was able to survive her death, but it did. The final season had strange psychological moments. The plot is increasingly twisted. Will justice be satisfied?I felt satisfaction at the end, but real sadness to say goodbye to these characters who have somehow become my friends!"
    },
    {
      "username": "faruk-2",
      "userUrl": "https://www.imdb.com/user/ur1784551",
      "reviewLink": "https://www.imdb.com/review/rw2751835",
      "warningSpoilers": false,
      "date": "6 February 2013",
      "rate": "10",
      "helpful": "22 out of 38 found this helpful.",
      "title": "Something rotten in Ankara",
      "content": "IMHO,this TV series makes more damage to the ruling party in Turkey than the total damage made by all opposition parties. I observe that the criticism directed by Behzat Ç toward the ruling AKPARTİ and the system in general has a great influence on ordinary people. In this respect, it should be acknowledged as an epitome of social impact made by a quality artwork. Moreover this impact is not limited to those who detest the government. For example, I never refrain pressing people to watch Behzat Ç. which contains numerous issues disturbing for a conservative, though I am an ardent conservative and supporter of AKPARTİ. Interestingly, I know many Erdogan (premier) admirers who disconnect home phones and close cellphones on Friday nights. What allures me and the others in Behzat Ç. is the property that nothing seems phony in it. The unification of genuineness, and heartfelt and balanced criticism turned out to be a shattering source of strength. Hence, its impact ratio is massive, however Behzat ç. is not a rating monster."
    },
    {
      "username": "ratbetovich",
      "userUrl": "https://www.imdb.com/user/ur32080659",
      "reviewLink": "https://www.imdb.com/review/rw2575192",
      "warningSpoilers": true,
      "date": "3 March 2012",
      "rate": "10",
      "helpful": "20 out of 36 found this helpful.",
      "title": "Truly an Ankara thriller",
      "content": "The series, now in its second season, is a scripted show that is shot over the general scenery of Ankara, Turkey's capital. It employs local people, amateur actors, students, local celebrities and man off the street for walk-on roles. Shooting the episodes mostly in popular local venues and people's homes, the series has a rather short list of permanent shooting sets: only the the homes of the main characters and the offices for the Homicide Squad is kept as a shooting set. The scores generally belong to local bands or artists, Pilli Bebek being the most frequently featured.The characters support local teams, share Bohemian flats, get drunk, enjoy paid female company in shady night clubs and swear consistent with authentic local slang and swear words instead of sanitized versions usually preferred on Turkish TV. Supplemented with excellent, authentic dialog, these provide an authentic realism to the stories and allows the series to delve deep into the personal demons of the characters. The top brass detective in the Homicide Squad, Behzat C., (the series' namesake), is an anti-hero with the worst (and most) personal demons.The series has a definitive \"left\" stance and frequently delves into the superstructure of crime, crime organizations and the state-within-a-state.Each episode (usually 9o minutes long) starts with a homicide and the case is normally resolved by the end. Each season also has a background story of a long running case.It's an exhilarating production, aired late night on Sunday."
    }
  ],
  "errorMessage": ""
}