{
  "imDbId": "tt0080306",
  "title": "Yes Minister",
  "fullTitle": "Yes Minister (TV Series 1980–1984)",
  "type": "TVSeries",
  "year": "1980",
  "episodes": [
    {
      "id": "tt0751811",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "Open Government",
      "image": "https://m.media-amazon.com/images/M/MV5BM2Y1OTZlMjYtNjgwNy00ZWJhLTg4ODctYzZkNzRkZjY1ZDU5XkEyXkFqcGdeQXVyNjg5MjUzNDE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1987",
      "released": "11 Jan. 1987",
      "plot": "With his party now ready to form the government, Jim Hacker anxiously awaits a call from the Prime Minister offering him a Cabinet post. When the call does come, he is named Minister of Administrative Affairs. He meets his new Permanent Secretary, Sir Humphrey Appleby and his Permanent Private Secretary, Bernard Woolley. As his first act, the new Minister decides to make good on his party's election promise to have open and transparent government by publicly canceling a major contract issued by the previous government to an American computer firm. Sir Humphrey ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "403"
    },
    {
      "id": "tt0751822",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "The Official Visit",
      "image": "https://m.media-amazon.com/images/M/MV5BMTUxNjE0MjE4N15BMl5BanBnXkFtZTgwMzA4MjU1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1987",
      "released": "18 Jan. 1987",
      "plot": "The Minister finds himself in charge of an official visit from the President of Buranda, a newly independent former British colony. Hacker decides that they should all travel to Balmoral rather than have the Queen travel to London. Only a week before the visit, the President is overthrown in a coup and against Sir Humphrey's advice, the Minister insists that the visit go ahead. When he sees what the new President has to say in his formal speech about the yoke of British rule and his support for a free Scotland and Ireland, he realizes that the government is on the ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "383"
    },
    {
      "id": "tt0751818",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "The Economy Drive",
      "image": "https://m.media-amazon.com/images/M/MV5BODk0MTZkZWYtOTBkZi00MTFkLTk5YjQtY2I3NzMzYjJhZmMxXkEyXkFqcGdeQXVyNjg5MjUzNDE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1987",
      "released": "25 Jan. 1987",
      "plot": "The Minister decides there is far too much waste in government and decides the time has come to launch an economy drive. Sir Humphrey suggests to the Minister that he should lead by example and cut back on his own staff. He soon finds himself without a driver or a secretary and chaos ensues. He immediately gets into trouble with the trade unions and the press take advantage of the situation.",
      "imDbRating": "8.1",
      "imDbRatingCount": "359"
    },
    {
      "id": "tt0751807",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "Big Brother",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA4ODM4NGQtNjI3Ny00NzcyLThmZmItM2VkYzM5Y2Y2M2EwXkEyXkFqcGdeQXVyNjg5MjUzNDE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1987",
      "released": "1 Feb. 1987",
      "plot": "The Minister wants to give citizens access to their files on a new national database, but Sir Humphrey is at his obfuscating best. Accused by his political advisor and his wife of being a mouthpiece for the civil service, Hacker decides that he is going to get his way on this one. Taking the advice of his predecessor, now an Opposition MP, he successfully anticipates all of Sir Humphrey's roadblocks but, in the end, uses the civil servants' own tactics to get his way.",
      "imDbRating": "8.8",
      "imDbRatingCount": "394"
    },
    {
      "id": "tt0751827",
      "seasonNumber": "1",
      "episodeNumber": "5",
      "title": "The Writing on the Wall",
      "image": "https://m.media-amazon.com/images/M/MV5BMGJjOTU4NDAtZTIxYi00OGI3LTlhNzktMDc5YzhjYjQwNTEwXkEyXkFqcGdeQXVyNjg5MjUzNDE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1987",
      "released": "8 Mar. 1987",
      "plot": "The Minister's frustrations with the civil service continue when Sir Humphrey, at his bureaucratic best, doesn't quite deliver the policy paper the Minister is seeking. Hacker wants to announce a cut of 200,000 civil servants and so decides to write the paper himself. He takes it a step further when he announces the planned cuts during a TV interview. The whole thing blows up in his face when the Prime Minister decides that the first cut will be Hacker's own Department. Suddenly, he and Sir Humphrey are on the same side fighting to keep their jobs.",
      "imDbRating": "8.3",
      "imDbRatingCount": "337"
    },
    {
      "id": "tt0751824",
      "seasonNumber": "1",
      "episodeNumber": "6",
      "title": "The Right to Know",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ4NjQ1NzQ5OV5BMl5BanBnXkFtZTgwNDQ4MjU1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1987",
      "released": "15 Feb. 1987",
      "plot": "Once again, the Minister, Jim Hacker and the permanent Secretary, Sir Humphrey Appleby, clash over the Minister's role in running the Department. The Minister instructs his senior civil servant to keep nothing from him and he is promptly flooded with everything under the sun. For Sir Humphrey, the Minister's meeting with constituents concerned about saving a local den of badgers is exactly the kind of work he should be doing. When he learns that Hacker's daughter will stage a nude protest over her father's decision on the badgers, Appleby must come to the rescue.",
      "imDbRating": "8.2",
      "imDbRatingCount": "324"
    },
    {
      "id": "tt0751810",
      "seasonNumber": "1",
      "episodeNumber": "7",
      "title": "Jobs for the Boys",
      "image": "https://m.media-amazon.com/images/M/MV5BMzAzNTAxNDUwMl5BMl5BanBnXkFtZTgwNTI3MjU1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1987",
      "released": "22 Feb. 1987",
      "plot": "The Minister goes on the BBC to extol the virtues of a public-private partnership project but when he learns that the private firm involved may soon go bankrupt, it is up to Sir Humphrey to see exactly what can be done to salvage the situation. He approaches a banker, Sir Desmond Glazer, who also happens to be interested in a part-time government appointment. The Minister's political advisor however is advising that all such Ministerial patronage appointments be abolished.",
      "imDbRating": "8.0",
      "imDbRatingCount": "315"
    }
  ],
  "errorMessage": ""
}