{
  "imDbId": "tt0080306",
  "title": "Yes Minister",
  "fullTitle": "Yes Minister (TV Series 1980–1984)",
  "type": "TVSeries",
  "year": "1980",
  "episodes": [
    {
      "id": "tt0751815",
      "seasonNumber": "2",
      "episodeNumber": "1",
      "title": "The Compassionate Society",
      "image": "https://m.media-amazon.com/images/M/MV5BMjM2MTg1MzcyOV5BMl5BanBnXkFtZTgwODk4MjU1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1987",
      "released": "1 Mar. 1987",
      "plot": "When the opposition challenges the Minister's claims in the House that administrative personnel in the health sector have been reduced by 11%, he too quickly agrees to an independent inquiry. Sir Humphrey's solution is to offer the chairmanship of the inquiry to someone hoping to score brownie points with the government. The Minister is concerned when he learns that a brand new hospital has been open for 15 months and has yet to admit a patient despite having over 500 administrative personnel on staff. His attempts to either open the hospital to the public or cut the ...",
      "imDbRating": "8.4",
      "imDbRatingCount": "321"
    },
    {
      "id": "tt0751808",
      "seasonNumber": "2",
      "episodeNumber": "2",
      "title": "Doing the Honours",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA1NjUwMTA1M15BMl5BanBnXkFtZTgwMDM4MjU1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1987",
      "released": "8 Mar. 1987",
      "plot": "The Minister is appalled when, on the advice of his civil servants, he can't make a modest 5% to his department's budget. To Sir Humphrey's great disbelief, the Minister decides to recommend only those civil servants for the Queen's honors list who can find the 5% cut in their budgets. On another matter, Appleby is approached by the Master of his Oxford college who is finding it impossible to enroll students now that the Minister has instructed that all foreign students must pay the full cost of their studies. Hoping for an exemption from the requirement, they invite ...",
      "imDbRating": "8.3",
      "imDbRatingCount": "294"
    },
    {
      "id": "tt0751816",
      "seasonNumber": "2",
      "episodeNumber": "3",
      "title": "The Death List",
      "image": "https://m.media-amazon.com/images/M/MV5BMTAxODc3ODU5NjBeQTJeQWpwZ15BbWU4MDc1ODI1NTIx._V1_Ratio1.7778_AL_.jpg",
      "year": "1987",
      "released": "15 Mar. 1987",
      "plot": "The Minister is appalled to learn that while in Opposition, he was under government surveillance. Now that he is in government, he finds that his Department is responsible for purchasing all of the government's surveillance equipment and orders an end to it. The Minister makes a point of leaking his views to the press and his stand makes for considerable public support. When he learns that he is on a death list intercepted by the security agencies however, he has second thoughts.",
      "imDbRating": "8.0",
      "imDbRatingCount": "287"
    },
    {
      "id": "tt0751819",
      "seasonNumber": "2",
      "episodeNumber": "4",
      "title": "The Greasy Pole",
      "image": "https://m.media-amazon.com/images/M/MV5BMTUzMDgzNjE1N15BMl5BanBnXkFtZTgwODI4MjU1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1987",
      "released": "22 Mar. 1987",
      "plot": "Sir Humphrey Appleby is approached the head of the British Chemical Corporation to secure the Minister's support for the production of proponol, also known as metadioxin. Although the chemical is harmless, the BCC is concerned that the word \"dioxin\" would raise unwarranted fears among the uninformed public. Appleby convinces the Minister that there is absolutely nothing to worry about but as protests against the chemical contract begin to mount - and as 10 Downing Street has clearly indicated to the Minister that he is not to proceed - Minister Hacker must move ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "276"
    },
    {
      "id": "tt0751817",
      "seasonNumber": "2",
      "episodeNumber": "5",
      "title": "The Devil You Know",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA1MTE2MDQ1N15BMl5BanBnXkFtZTgwNTA4MjU1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1987",
      "released": "29 Mar. 1987",
      "plot": "The Minister and Sir Humphrey debate the merits of UK membership in the European Community with Hacker definitely negative about interference from Brussels. He dislikes the constant steam of rules and regulations and sees European civil servants living a lavish lifestyle. Sir Humphrey on the other hand disagrees and suggests there are many benefits to UK participation. Their views take a considerable turn however when the rumors of a Cabinet shuffle also reveal that Hacker may be offered a senior position in Brussels. When Sir Humphrey learns who the new minister ...",
      "imDbRating": "8.3",
      "imDbRatingCount": "276"
    },
    {
      "id": "tt0751823",
      "seasonNumber": "2",
      "episodeNumber": "6",
      "title": "The Quality of Life",
      "image": "https://m.media-amazon.com/images/M/MV5BZTRmYTExYmUtMmQ2YS00MjQ1LWFkODYtNjkzNGUyNWQ2OTc4XkEyXkFqcGdeQXVyNjg5MjUzNDE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1987",
      "released": "5 Apr. 1987",
      "plot": "The Minister has become concerned over the general quality of life and is not too keen to approve a six-story extension to new high-rise office building banker Sir Desmond Glazebrook is proposing. In fact, he has recently spoken out again the ever uglier skyline. Problems arise however when a city farm often visited by school children has its lease canceled. Perhaps Sir Desmond can help the Minister out by making available some vacant land that they have on hand? Not surprisingly, it's Sir Humphrey who has manipulated the entire situation to his advantage.",
      "imDbRating": "8.0",
      "imDbRatingCount": "275"
    },
    {
      "id": "tt0751806",
      "seasonNumber": "2",
      "episodeNumber": "7",
      "title": "A Question of Loyalty",
      "image": "https://m.media-amazon.com/images/M/MV5BMTg4MzY3NDk4OF5BMl5BanBnXkFtZTgwMTA3MjU1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1987",
      "released": "12 Mar. 1987",
      "plot": "The Minister and Sir Humphrey must appear before a Select Committee looking into government waste. Sir Humphrey suggests a number of ways the Minister can evade difficult questions but Hacker is blindsided by an MP who has in her possession the draft of a book by a former civil servant outlining huge waste in his Department. When Hacker is called to a meeting at 10 Downing St., he realizes there is only one solution, much to Sir Humphrey's dismay.",
      "imDbRating": "8.7",
      "imDbRatingCount": "291"
    }
  ],
  "errorMessage": ""
}