{
  "imDbId": "tt2049116",
  "title": "Gomorrah",
  "fullTitle": "Gomorrah (TV Series 2014–2021)",
  "type": "TVSeries",
  "year": "2014",
  "items": [
    {
      "username": "ferdinand1932",
      "userUrl": "https://www.imdb.com/user/ur2735453",
      "reviewLink": "https://www.imdb.com/review/rw3762536",
      "warningSpoilers": false,
      "date": "24 July 2017",
      "rate": "9",
      "helpful": "81 out of 88 found this helpful.",
      "title": "Virtuoso",
      "content": "At the end of each episode there is a music track which announces the end of that show and it's a hypnotic piece of music which alerts the viewer, not just to the end of the show, but that this drama goes on; the simple melody and beat makes that clear, and in the phrase that Kurt Vonnegut used in \"Slaughterhouse 5\" , which was 'so it goes', it is a sigh, a refrain for the madness of human action, and for the terrible waste of their lives.This quality is exemplified too in the exteriors of the series: the Giorgio de Chirico exterior spaces, the dogs barking, the ugly 1960s architecture intended to make their lives better, but which is like a brutalist prison for them. No nice tree lined suburban streets for them. For the characters their daily drama is pointless and savage but its their only way to make something of the little they have.To say this series is 'dark' is an understatement; it breathes the worst of human behavior, but the manner is not to exploit, instead it shows the extent of what people endure. In this sense it is akin to 'The Wire' and its journey through Baltimore's underworld.To seek a character to 'root for' is to misjudge the value of drama: it is not a simple parable in which we can attach our aspirations to one character. If it was, Greek drama and Shakespeare, and much more besides, would have no value and most of the dross that mainstream TV and movies serve up would be the paragon of good writing. And it is not.This series may seem to glorify the savagery but it does not: it makes it clear as to the losses suffered, the moral failures, and the social divisions exposed. In this way the writers have done great work as they have with the characters.This series is quite remarkable in all the obvious production areas: it has a distinct look, the actors are all excellent without a miss, the casting choices have a reality too, and the dialect is a real pleasure too, though very hard to follow, it adds texture and depth."
    },
    {
      "username": "ljboden",
      "userUrl": "https://www.imdb.com/user/ur118979063",
      "reviewLink": "https://www.imdb.com/review/rw5774547",
      "warningSpoilers": false,
      "date": "26 May 2020",
      "rate": "10",
      "helpful": "79 out of 81 found this helpful.",
      "title": "It's Ruined TV",
      "content": "A good friend of mine said to me, 'it was the best thing he'd ever seen, and it would change my life'. I'd never even heard of it, so that was a big statement. Turns out, he wasn't lying. Me and the wife watched all 4 seasons and then the movie in less than 4 weeks and now that it is finished, I am gutted. It's left a big hole in our TV life. It has completely ruined TV for me because nothing else comes close to how good it is. We put 'Gangs of London' on straight after it, hoping it would fill a hole. We barely got to the end of Episode One, it was pathetic. Good if you're a 12-year-old boy who thinks one man can kill 15 hardened Albanian criminals in a pub like a cockney Chuck Norris! Gamorrah has none of that rubbish and is really realistic. No fighting or over the top car chases- just a bullet in the chest. The acting is beyond brilliant, the grim backdrop is dramatic, and the characters are encapsulating. I've been told by an Italian mate of mine that the area it is set in falls into the top ten of most dangerous places in the world. The programme does it justice. It is brilliantly and cleverly written; teasing you to like a character and then snatching them away from you. No one can be trusted, not even family. I've been pining for it so much since it ended that I've even been watching youtube interviews in Italian! The subtitles can sometimes be difficult to follow because the dialogue moves so fast, but it is never overly important. It is way beyond anything I have ever seen. Pure brilliance. Anyone who would give this less than 10/10 would probably enjoy Gangs of London or Ninja Turtles."
    },
    {
      "username": "paul2001sw-1",
      "userUrl": "https://www.imdb.com/user/ur2082018",
      "reviewLink": "https://www.imdb.com/review/rw3654443",
      "warningSpoilers": false,
      "date": "5 March 2017",
      "rate": "10",
      "helpful": "49 out of 58 found this helpful.",
      "title": "Poetry and evil",
      "content": "Mafia dramas are very common things, but Gomorra, inspired by Roberto Saviano's expose of the Neapolitan Camorra, is very good indeed, although beautiful Naples has surely never been filmed so uglily. It resembles 'The Godfather' more than it does 'The Sopranos', with its broad-arc, (soap)-operatic tone, as it tells the tale of the fall of the all-powerful Savastono clan. It's horrific, and one strength is the way its most sympathetic characters are shown to commit acts of utterly unjustifiable evil; and yet one is drawn along in a grand story arc nonetheless. The closest point of comparison is perhaps 'The Wire'; in comparison, 'Gomorra' is more poetic, less didactic, but also less multi-layered, focusing solely on the criminals and only in passing on other elements of civil society. We're two series in now, and one has to wonder if the quality will be maintained; at this point, the story lines that have driven the plot so far appear to have reached their natural ends. But to date, this has been television of the highest order."
    },
    {
      "username": "tha-13",
      "userUrl": "https://www.imdb.com/user/ur13565417",
      "reviewLink": "https://www.imdb.com/review/rw3013104",
      "warningSpoilers": false,
      "date": "10 May 2014",
      "rate": "9",
      "helpful": "182 out of 195 found this helpful.",
      "title": "Bravo",
      "content": "This series developed from the masterfully gloomy movie of the same title puts Italian production up close and center. This is very well crafted, with a impressive camera precision even though it's within the Gritty-style of modern cinema. Here and there you'll see some very inventive camera directing (a motorcycle-crash comes close to the best vehicle-scene I have seen since the first \"Mad Max\"). It is a rough and gray view of mob-crime in a dystopia Italy, but even though the setting is the same ghetto as the movie \"Gomorra\" the social-realism of the movie is toned down by the producers, in order for a more character-driven narrative to emerge - that is good. This is a brilliant authentic-Italian and promising series, that recalls Sergio Leones \"Once upon a time in America\" just without wide angel and widescreen. And again it contains some of the technically best non-computer generated action-sequences I have seen since Michael Mann. BRAVO! Forza Italia! from Denmark."
    },
    {
      "username": "horrorules",
      "userUrl": "https://www.imdb.com/user/ur12436802",
      "reviewLink": "https://www.imdb.com/review/rw6088117",
      "warningSpoilers": false,
      "date": "12 September 2020",
      "rate": "9",
      "helpful": "19 out of 21 found this helpful.",
      "title": "one of the BEST tv show ever made, but.....",
      "content": "....They must absolutely respect their word and definitely close with the fifth season. The series is a masterpiece, direction, cinematography, actors, screenplay and above all the characters are something legendary, something that will remain in the hearts and memories of us fans as long as the series ends with the fifth season, I absolutely do not want that the series becomes a kind of sleazy endless soap opera. The best series are always the short ones."
    },
    {
      "username": "Supermanfan-13",
      "userUrl": "https://www.imdb.com/user/ur6387867",
      "reviewLink": "https://www.imdb.com/review/rw8829301",
      "warningSpoilers": false,
      "date": "27 January 2023",
      "rate": "8",
      "helpful": "13 out of 14 found this helpful.",
      "title": "Very good gangster/crime drama!",
      "content": "Gomorrah is one of the better crime series I've ever seen in some time. It's not the best but it's definitely worth watching. It has a 8.7 rating for a reason. I started watching it because of all the great reviews/ratings I've seen over the years and it has not disappointed! You never know what is going to happen and is like Game of Thrones in a way by the fact that they don't shy away from killing off main characters. It's not for everyone because it's a very gritty, violent, realistic show! Just a warning, once you start watching it it's hard to stop. You'll find yourself binge watching the entire series as fast as possible!"
    },
    {
      "username": "DiCaprioFan13",
      "userUrl": "https://www.imdb.com/user/ur115536310",
      "reviewLink": "https://www.imdb.com/review/rw8574785",
      "warningSpoilers": false,
      "date": "29 September 2022",
      "rate": "8",
      "helpful": "13 out of 14 found this helpful.",
      "title": "Great Italian gangster show!",
      "content": "Gomorroh was so much better than I expected it to be. It's so good I'm actually mad at myself for putting it off for so long. I've read about how good this series is for years but still out it off for some reason. Well, it definitely lived up to all the hype and then some. I was hooked from the very first episode to the last. If you're a fan of crime dramas involving drug cartels then give this a try, you won't be disappointed. It is an Italian show so you'll either have to watch with subtitles or watch it dubbed in American. You'll get used to it pretty quick and forget all about it so don't let that deter you from watching it. This is seriously one of the better shows I've seen in years."
    },
    {
      "username": "leftbanker-1",
      "userUrl": "https://www.imdb.com/user/ur20309759",
      "reviewLink": "https://www.imdb.com/review/rw3490177",
      "warningSpoilers": false,
      "date": "18 June 2016",
      "rate": "10",
      "helpful": "53 out of 68 found this helpful.",
      "title": "Gomorra: Highly Original, Gritty with Great Locations, Actors, and Dialogue",
      "content": "Make no mistake, Gomorra is no copycat version of some other gangster film or series; it is the evolution of the genre, something we haven't seen perhaps since Un Prophète (2009) by Jacques Audiard.Gomorra makes The Sopranos look as phony as Happy Days. With the feel of a filmed-on-location documentary, in this Italian series everyone looks exactly like who they are supposed to be. The locations in Napoli are grimy and gritty—hardly the Under the Tuscan Sun vision of Italy and definitely not the invented suburban fantasy gangster-land of The Sopranos. The gun battles have an air of realistic mayhem seldom seen in movies and almost never on TV. Gomorra is desperate shootouts, filthy prisons, and a penetrating look at the Southern Italian underworld. What more could you ask for? I didn't mean to disrespect The Sopranos because this series borrows heavily from that American original as well as the works of Tarantino. In the first scene there is a banal conversation between two hoods as one of them complains about his daughter's obsession with Facebook, a matter the middle-aged hit-man and parent knows nothing about. Even in this mundane and seemingly innocuous bit of dialogue we get a glimpse of the vision of Ciro, a mid-level thug. And off we go into the night, both literally and figuratively.Gomorra doesn't fall into the black hole like The Sopranos of going into the lives of the family members, a mistake now made in countless new TV series in what I call the Meadow Soprano Effect. The mafia guys all have families, as we are shown, but they don't bother much with the details and good for that. If I wanted to watch a show about family life I wouldn't be watching a crime series. In addition, there are no half hour blocks of boredom like when Tony talked with his doctor.My big regret is that I don't speak Italian, or whatever version of that language these guys speak in the streets of Napoli. Instead I had to get by on French subtitles. Thankfully, my street French had already got a big shot in the arm with the French series Braquo.The series avoids the gangster movie clichés and instead invents of few new ones which will probably soon be repeated by other filmmakers. Centering on Ciro, the mob boss's top henchman, we get an insider's view of the daily operations of the crime world of this city, sometimes glamorous, other times mundane, but always fascinating.Whoever was responsible for the locations needs a place in film heaven. The portrayal of the family life in the mob is done well without the annoying side-tracks of The Sopranos with episodes dedicated to their tedious children. Just enough for verisimilitude and that's all.Constructive Criticism. I won't back down from my rating of 10 because the series deserves that just on appearance. It looks so real and few movies I have seen come anywhere close to the verisimilitude of Gomorra. With that said there is little or no exposition for most of the violence portrayed. There is simply a paroxysm of gun blasts and someone (or many people) is dead. There is little in the way of \"why\" for a lot of the action sequences. I'd rather have a lot less violence with a better story to explain what is there. In addition, there needs to be someone approaching the part of likable, someone we actually care about. I gave up on Ciro after the murder of the young girl."
    },
    {
      "username": "LouieInLove",
      "userUrl": "https://www.imdb.com/user/ur53576145",
      "reviewLink": "https://www.imdb.com/review/rw3319659",
      "warningSpoilers": true,
      "date": "19 September 2015",
      "rate": "10",
      "helpful": "37 out of 46 found this helpful.",
      "title": "The Best Crime Series Of Its Generation",
      "content": "Simply put: Gomorra is fantastic.Gomorra is a tale of monsters making money & more monsters. It shows the curse of Naples in as true a light as it has ever been shown. Naples has the best of Italy, but without doubt also possesses the worst of Italy in abundance. Neapolitans are some of the kindest & funniest people on the planet, they remind me a bit of Glaswegians & I know they are embarrassed by the corruption prevalent in Naples. I wouldn't give a Neapolitan official my pish as it would end up in his bank account or some thug's pocket & therein lies the story of this show, as it is about the dark-side of this city.The acting is excellent, there are no hams insight. The storytelling is sublime (although it does have lots of source-material, nevertheless, converting that to the screen is no easy feat). I can't praise this show enough. It holds no punches & doesn't glamourise the life of those it portrays, which in-part, is key to its success. They kill & torture everyone, men, women & children & the series shows this.Well done to everyone involved. There are only a few countries in the world where a show of this uncompromising quality could be made & thank God Italy is one of them. This could not be made in England (nor the US any more) due to the PC-class that tampers away from reality for fear of offence."
    },
    {
      "username": "robertemerald",
      "userUrl": "https://www.imdb.com/user/ur73668075",
      "reviewLink": "https://www.imdb.com/review/rw4692271",
      "warningSpoilers": false,
      "date": "1 March 2019",
      "rate": "10",
      "helpful": "20 out of 24 found this helpful.",
      "title": "Fascinating crime drama",
      "content": "Everything about this production is top shelf. It's unpredictable, much like the Sopranos. But it's got more grit and is faster paced than The Sopranos. The dread story weaves and surprises with violent deaths around every corner. There are what seems to be hundreds of locations, Naples revealed. The colour and understanding of colour is brilliant, movie quality. The characters are decidedly unpleasant and truly bad, but one is drawn into their fates as if by magic, testimony to the quality of the actors and their direction. The soundscape is modern and sharp, heightening the tension. If you have a soft spot for Europe and European drama, then you have possibly just found television nirvana."
    },
    {
      "username": "qui_j",
      "userUrl": "https://www.imdb.com/user/ur68519886",
      "reviewLink": "https://www.imdb.com/review/rw3809545",
      "warningSpoilers": false,
      "date": "19 September 2017",
      "rate": "7",
      "helpful": "18 out of 22 found this helpful.",
      "title": "A story of pure evil without redemption!",
      "content": "This is a very, very dark series that follows a Mafia clan as they do business in Naples. There are no good characters in this series as like the Biblical city of \"Gomorrah\", the inhabitants and the area of the city portrayed are just full of evil. Father is pitted against son, husband against wife, brother against brother. There is no redemption offered in the series, neither is it sought! People live their lives in evil, and die in gruesome, hideous ways. The series wont do much for tourism like other series e.g Detective Montalbano. The viewer does get very involved with each character, and follows them to their demise. Some of the scenes are beyond belief as it shows that human life has no value in the business at hand. This is not as twisted or cerebral as a Scandinavian Noir might be, it just all about the evil men do! It's worth watching if you have the stomach to do so.Season 5 has been a huge disappointment! It destroys the tradition and quality of all the previous seasons. There seems to be no script, and most of the time the actors just seem to stare and one another, saying nothing. The mood becomes more like an Art house production, and less like a Mafia series. Extremely disappointing! This has caused the rating to drop from a 9 to a 7/10."
    },
    {
      "username": "s3276169",
      "userUrl": "https://www.imdb.com/user/ur49392790",
      "reviewLink": "https://www.imdb.com/review/rw5032908",
      "warningSpoilers": false,
      "date": "1 August 2019",
      "rate": "10",
      "helpful": "20 out of 25 found this helpful.",
      "title": "Colosseum of crime.....",
      "content": "A Colosseum of crime, that's how I describe Gomorra.Naples crime world is a place for fast living, high stakes and sudden, violent death. Gangs known collectively as Comorra fight incessant, endless wars of attrition, to rise above petty crimes of poverty and desperation. Most die but a few become gang leaders and Godfathers of crime only in turn to be bloodily betrayed and replaced. Its an endless cycle that's reminiscent of the Roman arena.The acting is simply put excellent with plots and sub plots that cleverly and subtly interweave. You get to know characters personally, see their lives intersect, understand how poverty or some other need make them what they are. You see them grow and often die.There are tales of genuine sadness and sacrifice in the personal stories found in Gomorra. People doing the wrong things for the right reasons. To keep family afloat, put food on tables and roofs over heads.I can't say enough about this series and look forward to season five which I believe will be airing in 2020.10/10 from me."
    },
    {
      "username": "danielcereto",
      "userUrl": "https://www.imdb.com/user/ur29002389",
      "reviewLink": "https://www.imdb.com/review/rw7689293",
      "warningSpoilers": false,
      "date": "26 December 2021",
      "rate": "10",
      "helpful": "20 out of 25 found this helpful.",
      "title": "One of the best series ever",
      "content": "There are several good crime series out there, The Wire is great, The Sopranos excellent, The Shield memorable but what makes Gomorrah be over top is the superb realistic acting and a marvelous twisted script based on a great book.Gomorrah crosses all the red lines several times without following the usual and boring Hollywood predictable script. It's brutal, dark, impressive, and addictive from begining till the end. A masterpiece. One of the best series ever, and probably, overall, the best crime drama."
    },
    {
      "username": "ajs709",
      "userUrl": "https://www.imdb.com/user/ur23046582",
      "reviewLink": "https://www.imdb.com/review/rw3208364",
      "warningSpoilers": false,
      "date": "25 March 2015",
      "rate": "10",
      "helpful": "57 out of 64 found this helpful.",
      "title": "Fantastic Series",
      "content": "I began watching this as I remembered watching the film and reading the Saviano book a few years ago. Both are excellent, but I feel the series is quite different and is perhaps only loosely based on the original source material. But that didn't bother me; this is a superb series. I found myself so immersed in the characters, the setting and the whole world that I had to keep reminding myself while I was at work that I wasn't a Neapolitan gangster. Every episode of the series is different, the characters are all so compelling and some of the twists and turns are gut-wrenching. Every episode ends perfectly and each one makes you feel differently - one made me weep with sentiment, another took me to such a dark place that I considered not watching any more because I realised \"even the good guys are really really bad guys\". But I'm glad I continued watching because the end of the series is phenomenal and makes me hungry for more. I have been truly blown away (excuse the pun) by this series and can pick no faults with it at all...and if you don't agree with me, I know some guys who know where you live and might be able to \"change your mind\"! Also acting - amazing. All the actors are spot on. Special mention for Vincenzo Sacchettino (Danielino) who has got to be one of the best teenage actors I've seen for a long while."
    },
    {
      "username": "searchanddestroy-1",
      "userUrl": "https://www.imdb.com/user/ur17559480",
      "reviewLink": "https://www.imdb.com/review/rw7689046",
      "warningSpoilers": true,
      "date": "26 December 2021",
      "rate": "10",
      "helpful": "19 out of 25 found this helpful.",
      "title": "Hell of a series",
      "content": "Among the best about gangs and mafia, and there is a batch of those topics, many of them but this one belongs to the five tops. The pure Italian trade mark, in the line of ROMANZO CRIMINALE. Poignant, gripping, violent but no cliché ridden; for instance always meetings among hoods in improbable places - sometimes five different in the same episode: empty warehouse, abandoned harbor, deserted terrasse, remote workshop, windy rooftop... - and always those sentencious tones in voices when they speak to each other.... I can understand that some folks - including females - can get tired of this; but I guess that's the way gangsters choose their meeting places or talk to each other. No length in this series, it is suspenseful, tense, sharp, helped by a terrific acting and directing. The only weak point are the gunfights battles, they are lousy, at the level of a common tv junk, or worst. And the Gennaro's character is also very hard to understand, especially concerning his behavior towards Ciero. It is also a point where many audiences renounce to watch further or dislike the story; they don't understand this character who kills his best friend then reproaches this very same friend to have left him alone.... Then when he finds out that he is still alive, decides to make him die slowly, this friend that sacrified his own life for Gennaro. Admit that is \"special\", very special.... And that makes the final minutes even more unbelievable. But it is and will remain a real must see in the mafia genre TV shows, all countries confounded."
    },
    {
      "username": "azitromax",
      "userUrl": "https://www.imdb.com/user/ur20851538",
      "reviewLink": "https://www.imdb.com/review/rw3051792",
      "warningSpoilers": false,
      "date": "17 July 2014",
      "rate": "10",
      "helpful": "103 out of 114 found this helpful.",
      "title": "Brilliant Mafia Series",
      "content": "In my opinion this is an absolutely brilliant TV-series. In the beginning you get to know the characters and the Mafia business in general, but as the series develop you get a deeper insight into all the personalities, their psychology, the choices that they make and how/why their actions lead to all kinds of different sequences of events that are tragic, sad, action packed, exciting and entertaining. The environment that it's shot in suits the series perfectly and I must say that the series is better than the movie Gomorrah (which is also good). If you're a fan of series such as The Sopranos, or movies like the Godfather and Scarface, I'll guarantee you that you'll love Gomorra!"
    },
    {
      "username": "markbradfordupvc",
      "userUrl": "https://www.imdb.com/user/ur21201651",
      "reviewLink": "https://www.imdb.com/review/rw3067134",
      "warningSpoilers": false,
      "date": "11 August 2014",
      "rate": "10",
      "helpful": "90 out of 114 found this helpful.",
      "title": "very realistic , maybe better than sopranos",
      "content": "I have just watched episode 2 and I am addicted. Was not sure what to expect, I had not heard of the book or the 2008 film of the same name. After 10 minutes I could tell it was going to be well made, the setting in Naples in Italy ,the home of the camorra crime family,(changed to Gamorra by the author) and the base of the story came from a book written by Roberto savino , who lived in Naples. I say lived because at the moment he has had to move away with a bodyguard for all the fuss he has caused. His book was a best seller but that did not go down well with everyone especially the local mafia he wrote about. According to Savino the camorra nor dwarf\"s the mafia of Sicily.In the first episode we get to meet the crew and family and are soon in the backstreet\"s where deals are done and beatings are dished out. The story keeps you hooked ,although everything is spoken in Italian with English subtitles I instantly got into the show and remarked to a friend it was like watching a documentary rather than actors.The second episode carries on the excitement mixed with excellent acting and a strong script. I cant wait for episode 3, and would give a IMDb score of 9/10"
    },
    {
      "username": "chudson-89486",
      "userUrl": "https://www.imdb.com/user/ur85192618",
      "reviewLink": "https://www.imdb.com/review/rw4054870",
      "warningSpoilers": false,
      "date": "6 February 2018",
      "rate": "10",
      "helpful": "27 out of 31 found this helpful.",
      "title": "One Of the Best TV Shows Ever!!",
      "content": "This is the first time I've written a review on IMDB but I just had to tell the world how amazing this show is. If you have even a passing interest in crime drama, the Mafia or just good quality television and you are not squeamish, then you owe to yourself to watch this show. I have watched all of season 1 and 2 and every episode has been outstanding. It has everything..... An amazing story, full of twists and turns. A very realistic and incredibly gritty setting, nothing like the American gangster films or TV shows. Outstanding acting from every cast member, you will grow to love, hate and mourn. Beautiful camera work and cinematography. It reminds of me of The Wire, in it's realistic depiction of drug dealing at the street level. Like The Wire, it is not for the faint hearted. The violence is brutal and realistic but that is the nature of the beast. If you do decide to watch it, please watch it in this original Italian, the performances are too good to be spoilt by watching a dubbed version.A big thank you to everyone involved in the making of this series. Amazing work."
    },
    {
      "username": "s-50307-95732",
      "userUrl": "https://www.imdb.com/user/ur134739541",
      "reviewLink": "https://www.imdb.com/review/rw8771786",
      "warningSpoilers": false,
      "date": "1 January 2023",
      "rate": "10",
      "helpful": "8 out of 8 found this helpful.",
      "title": "Eternal masterpiece",
      "content": "If you want to see a really interesting mafia series that will amaze you from moment to moment (not like some watery and tasteless TV series now), don't hesitate to watch this masterpiece. A series that does not have a positive character, a series that, in my opinion, is one of the masterpieces in the history of serialization. The series is full of blood and It's a bullet. I'm actually finishing season 5, I'm really sad that this legend is ending. In my opinion, if you don't watch this series, you made a big mistake. It is a series that you will definitely enjoy watching. In the last words, a series full of darkness to the end and a lot of sadness at the same time is wonderful, thank you very much."
    },
    {
      "username": "andydunseath",
      "userUrl": "https://www.imdb.com/user/ur88761440",
      "reviewLink": "https://www.imdb.com/review/rw6514890",
      "warningSpoilers": false,
      "date": "22 January 2021",
      "rate": "10",
      "helpful": "47 out of 47 found this helpful.",
      "title": "I watched it twice!!",
      "content": "Do not let the subtitles put you off this incredible show. This show is easily the best tv series i have ever watched. I blitzed 4 seasons recently and then watched them all again. Im now left with a tv void and has pretty much ruined any other show. I found myself obsessed, scrolling through user reviews and google maps of Naples. The acting is impecible and the scenes are realistic and brutal. Do yourself a huge favour and watch if you haven't already."
    },
    {
      "username": "alexnesovic",
      "userUrl": "https://www.imdb.com/user/ur41348333",
      "reviewLink": "https://www.imdb.com/review/rw3032362",
      "warningSpoilers": false,
      "date": "11 June 2014",
      "rate": "9",
      "helpful": "104 out of 111 found this helpful.",
      "title": "Awesome",
      "content": "A very well-made TV series about the Camorra mafia in Naples. The director is not holding back on the dirty and gruesome details that classifies this organization. I must say that i'm very impressed with the crew shooting the series at the actual drug-ghetto as their location of choice. It gives a more authentic feel to the viewer. If you haven't seen the movie Gomorrah from 2008 i must recommend that you see it first. But i do feel that the 2014 series is of much better standards. Thumbs up! Alexx"
    },
    {
      "username": "wizo-22944",
      "userUrl": "https://www.imdb.com/user/ur59121312",
      "reviewLink": "https://www.imdb.com/review/rw6379877",
      "warningSpoilers": false,
      "date": "19 December 2020",
      "rate": "10",
      "helpful": "9 out of 9 found this helpful.",
      "title": "all time classic",
      "content": "Sollima is the best director for crime drama of this generation, period. The fact someone could possibly give this gem 1 or 2 stars only speaks volume about the general dumbing down of the human population, you need to be at least not cognitively impaired to understand this masterpiece, if you are then there's michael bay for you."
    },
    {
      "username": "oscarjneklund",
      "userUrl": "https://www.imdb.com/user/ur154260428",
      "reviewLink": "https://www.imdb.com/review/rw8311631",
      "warningSpoilers": true,
      "date": "8 July 2022",
      "rate": "9",
      "helpful": "7 out of 8 found this helpful.",
      "title": "Italiano mafioso at its finest! 🔞",
      "content": "Great Tv-series with frightening and cruel characters, the street gangs, fighting for territory and has great actors. Genna (Salvatore Esposito) is my absolute favourite character, no mercy and have a style of a real Italian gangster. Ciro (Marco D'Amore) wow, a great actor who's the most frightening one, cold as ice. Great and memorable theme song plays at the end of every single episode, will bring you anxiety, beacuse something is always gonna go wild! Italians definetly knows how to make mafia real, I mean, we are in Italia, right? 😉 🇮🇹"
    },
    {
      "username": "stijnmanruud",
      "userUrl": "https://www.imdb.com/user/ur85987480",
      "reviewLink": "https://www.imdb.com/review/rw5225959",
      "warningSpoilers": false,
      "date": "31 October 2019",
      "rate": "9",
      "helpful": "52 out of 54 found this helpful.",
      "title": "My first and probably last review - because of Gomorra's season 3 finale",
      "content": "My review is not going to add a lot to most that are already written here. But I just had to write this. I'm 52, and I've seen a lot of movies, series and theatre/plays in my life. Hundreds. Thousands maybe.With that in mind, I am convinced that S3E12 is the best piece of acting, cinematography and screenwriting that I have ever seen. By far. I'm aware this is a matter of taste, not a fact, but I just have to share this, hoping to convince readers to go with Gomorra's flow and let it blow you away. For days or even weeks after watching it.I won't share the (essential) spoiler in the season 3 finale. In the episode's final 15 minutes, the dark side of mankind, deep compassion, unbelievable cinematography, death, deep hate and love come together... I can't find the words. It's even erotic in a disturbing way. Have watched it a dozen times now and I just have to watch it again and again. Can't get it out of my head.Have seen all four seasons (and the fourth season is a bit weaker than the previous three, therefore 9 out of 10) and all 48 episodes are outstanding (seriously), with the 36th as the series' magnificent highlight. Can't wait for the fifth season. I wish I could thank the creators and actors in person. Unbelievable.Finally: the moment at the end of each episode, when 'that track' starts again, and you know it's going to happen. What's going to happen? Start watching and you'll know what I mean"
    },
    {
      "username": "lachezarmatneshliev",
      "userUrl": "https://www.imdb.com/user/ur133468248",
      "reviewLink": "https://www.imdb.com/review/rw8324409",
      "warningSpoilers": false,
      "date": "11 July 2022",
      "rate": "9",
      "helpful": "7 out of 8 found this helpful.",
      "title": "L'Immortale è tornat",
      "content": "By all means Rome. We believed it once. Make us believe it again. An authentic holiday spirit infuses in screenplay alive with the stories of a legendary city and the hospitality of its remarkable cast and crew, directing and writers. Explore the depths of history from the height of luxury. Our local knowledge will take you to the traditional heart of ancient and beautiful city Naples. Ultimate contributors range in the art of imagination making unique screenplay and substitute the places, quite his own right to showcasing beautiful content. \"I'm the money. Every penny of it.\" Great city swathing the film, in a layers of dewy love and glossy chic. Storied of legendary saga completely incomparable design Extraordinary script inspiring association ''Cavalleria Rusticana'' show's early years of the wealth family Savastano in Scampia neighbourhood of Naples agains the difficult life situations. The visual feast of Italian art A carefully curated selection of art adorns details in gold. An elevated experience of magnificent pleasure of music send by Deborah De Luca."
    }
  ],
  "errorMessage": ""
}