{
  "imDbId": "tt0200276",
  "title": "The West Wing",
  "fullTitle": "The West Wing (TV Series 1999–2006)",
  "type": "TVSeries",
  "year": "1999",
  "items": [
    {
      "username": "Zen Bones",
      "userUrl": "https://www.imdb.com/user/ur0286445",
      "reviewLink": "https://www.imdb.com/review/rw0649980",
      "warningSpoilers": false,
      "date": "5 December 2003",
      "rate": "",
      "helpful": "273 out of 294 found this helpful.",
      "title": "Long Live the Big Block of Cheese!",
      "content": "As mentioned in a couple of episodes, Andrew Jackson kept a two-ton block of cheese in the foyer of the White House for the public. It was to remind everybody that The White House belongs to the people, and that their voice should always be heard and represented. Well, \"West Wing\" is a love poem to the ideals of a portion of America that has not had a voice in a long, long time. Be forewarned, this show is not a docudrama watered down or dumbed down in order not to offend the sensibilities of the mainstream. It is unabashedly - dare I say in these reactionary times - ultra-liberal and proud of it. President Bartlet and his staff represent the spirit, courage, depth and imagination that many (but obviously not all) faithful Americans feel this country was founded on: a spirit that they would like to see in their political candidates, but rarely find anymore. It is the stuff of dreams. Check that twice; this isn't reality TV so don't go ballistic if certain \"facts\" about the official processes of White House machinery are incorrect. The show isn't meant to provide documentation of life in the west wing. It's meant to give us an idea of the complexities of the political process, as well as a look at the dedication and personal sacrifice most politicians and staffers have to endure. Most importantly though, the show is meant to be a springboard for ideas and values. Is President Bartlett in any way realistic? Hell, no! He's a wild composite of every liberal politician and scholar that ever positively influenced this country, as well an authority on antiquated history, philosophy, mythology, national parks, chess, and virtually every nation in the world. What makes him especially endearing is that all of these qualities are rolled up in a homespun charm that could make Garrison Keillor positively green with envy. Some people don't seem to get the joke: he has every single element that has been absent in politicians - Democrat and Republican alike - for a longgggg time. The fact that he is so unreal is THE element of social satire that this program propagates. Frankly, I find it thrilling because as much as I love other political satires like \"Bob Roberts\" and \"Wag the Dog\", it seems wonderfully refreshing to see satire being directed from politicians rather than at them. There will never be a real president like Jed Bartlet in the White House, but every American can get a healthy dose of inspiration from fictional Jed Bartlet, 'man of the people'. [I'd include other nationalities in that statement, but there's something about Bartlet that is quintessentially American. I can't quite put my finger on it, but I visualize it along the lines of reading the Constitution while eating a bowl of chili. Other nationalities will have to come up with their own particular mixture of homespun idealism.]. I should include his staff in that statement too, since any of those in the West Wing (with the exception of Ainsley Hayes, sweet as she is) would make a fantastic president.As for the other elements of this show... On first watching it, I was very aware of the fact that the White House staff seemed to spend more time holding conversations while walking in corridors, than actually sitting in their offices. I was also aware of how the cameras twirled around them unceasingly. And I often found the dialogue in both quality and delivery to be something along the lines of Spalding Gray meets Gore Vidal; i.e. extremely quick, witty and brilliant, but how many people really talk that way? Well, by the third episode I became so attached to the fascinating qualities and idiosyncrasies of each character that in my ears, their dialogue seemed to flow quite naturally. By the forth episode I was tickled pink to follow them anywhere. And by the fifth episode, my inner gyroscope finally synched up with the show's steadicam. I'm hooked- what else can I say! All the characters/performers of \"West Wing\" are excellent, and the \"what if\" scenarios in each show cleverly cover situations that we're all familiar with, with just the right touch of emotional depth (or in some cases, levity. The show's humor is always delicious!).`West Wing' is simply brilliant through and through. The only bad thing about it is when it's over, we all have to face reality once again. Damn!"
    },
    {
      "username": "cormac_zoso",
      "userUrl": "https://www.imdb.com/user/ur19511692",
      "reviewLink": "https://www.imdb.com/review/rw2821774",
      "warningSpoilers": true,
      "date": "28 June 2013",
      "rate": "10",
      "helpful": "27 out of 29 found this helpful.",
      "title": "As good as it gets",
      "content": "As many, many other reviewers have said (and others have agreed with) this is as good as TV gets ... period. I don't think there is a better show ever to tell the truth and perhaps that's because Aaron Sorkin's newest show only has one season under its belt so far. Perhaps after seven years it will top even this monumental achievement in television but it has quite a challenge ahead of it.This series set a standard for sharp rhetoric and quick, clever interplay between characters as well as creating the \"walk and talk\" scene where often short meetings take place between characters as they walk from their office (or other location) to a scheduled meeting. This gave the scenes a physical rhythm to go with the verbal rhythm of the witty \"patter\" (for lack of a better word to portray the beautifully rhythmic feel of the scripted lines). The lines nearly could be song lyrics as the syllabic beat and witty wordplay made for fast and tightly-filled scenes that sometimes could almost need two viewings from which to pull all the information you needed.And while this show is listed as a drama, which it is, it could also be very funny on many levels. Often the level of embarrassment set at the heights of the White House are used as comedic tools and thinking of how embarrassing a simple error on our every day level can be (assuming we're not in the daily international eye), placing the same error on a White House level certainly can make you cringe yet laugh as you watch one unfold in the show (Donna Moss was often a wonderful character for this to happen to). But also, as in the episode \"Galileo\" when contact with a Mars space probe is lost that has been tied into a televised \"classroom\" hosted by President Bartlet, the President explains that if someone wanted to see a real screwup, they should \"come up here and see how the big guys really do it\" (for a rather close paraphrase I believe).It's also another nice aspect of the show that they show these people to be human. I know they're human in real life but how many times do we think of them that way? Not many really ... at least not in the way The West Wing showed them to be and really, that is how they are (unless they are to ungodly pompous and arrogant to be believed ... which of course those offices are filled with somewhat regularly and unfortunately). Also however and unfortunately, the concern and humanity of this administration is not shown nearly enough in the real political arena. I know, I know, there are many ways in which they simply cannot be in real life. Or at least cannot seem to be in real life. But that's another conversation I suppose.I watch this entire series through every couple years or so it seems, perhaps more often even. It really is that good. If you haven't watched it or haven't watched it in some times or didn't watch consistently the first time it was broadcast, I encourage you to treat yourself to a television show that is every bit as good as the best film you've ever seen ... imho at least. :)"
    },
    {
      "username": "MaxBorg89",
      "userUrl": "https://www.imdb.com/user/ur5156288",
      "reviewLink": "https://www.imdb.com/review/rw1795476",
      "warningSpoilers": false,
      "date": "7 January 2008",
      "rate": "10",
      "helpful": "21 out of 24 found this helpful.",
      "title": "Funny, moving and consistently superb - one of the best TV shows ever produced!",
      "content": "Most of the time, Hollywood depicts American politicians, and the President in particular, as either buffoons or unlikely action heroes. Exhibits A, B and C: Independence Day, Air Force One and Deep Impact. Thank God, then, for television, which finally enabled people to see these powerful men in a more realistic light. Real-time thriller 24, to name one show, painted a compelling, if somewhat dark portrait of US politics, and the interesting but short-lived Commander in Chief went as far as imagining what would happen if a woman became President of the United States. Neither series, however, comes close to the genius of The West Wing, which dealt with domestic and foreign problems with more precision than most news shows. Most importantly, though, it achieved the impossible: it made politics fun to watch.Created by Aaron Sorkin (A Few Good Men), who also wrote almost every episode in the show's first four seasons (more on that later), The West Wing can be seen as a small-screen continuation of The American President, since they both combine an accurate analysis of what could happen in the White House with a colorful yet believable cast of characters who are in charge of keeping audiences hooked, thanks to foolproof acting and Sorkin's trademark razor-sharp, quick-fire dialogue.What sets the series apart from the writer's team-up with Rob Reiner, though, is the fact that it focuses less on the POTUS than it does on his staff and their attempts to solve personal problems and the latest political crisis at the same time. This narrative choice is shown at its best in the very first episode, where President Josiah Bartlet (Martin Sheen) doesn't appear until the last five minutes, the preceding 35 having been carried effortlessly by Chief of Staff Leo McGarry (John Spencer) and his employees, all of whom have some defect that helps provide the fun in the show: speech-writer Toby Ziegler (Richard Schiff) is a bitter man who seems to find no real pleasure in life outside his office; his \"sidekick\" Sam Seaborn (Rob Lowe) accidentally slept with a call girl in the pilot; Press Secretary C. J. Cregg (Allison Janney) finds it hard to occasionally be elusive when talking to reporters; Deputy Chief of Staff Josh Lyman (Bradley Whitford) has trouble keeping his mouth shut; Leo himself is a recovering alcoholic. Even the President, as it turns out, has some secrets that could undermine the administration.That these flaws were treated with a light approach was the main joy of the show's first four years: the typical episode had the characters walk through hallways and exchange fast, usually witty opinions on the most recent problem. With very little room for subplots, the series was entirely in Sorkin's hands, his endless conversations covering any lapses in dramatic construction at a killer pace. After all, who needed suspenseful cliffhangers (mostly employed only in the season finales) when there were the countless arguments between Toby and Josh, or the latter's impeccable chemistry with Donna Moss (Janel Moloney), or Bartlet's \"loving\" confrontations with the First Lady (Stockard Channing)?Problems ensued at the end of Season Four: prior to that, the only real misstep in the otherwise perfectly oiled machinery had been an out-of-continuity, 9/11-referencing episode which has no significance if deprived of its context. That, however, was and is nothing compared to Sorkin's decision to quit: the remaining three seasons failed to win the Best Drama Emmy (losing out to The Sopranos, Lost and 24 respectively), seemingly confirming that The West Wing was powerless without its creator. The fifth year did little to prove this theory wrong, and only some juicy guest spots (Mary-Louise Parker and Lily Tomlin above all) had the energy to compensate the writing staff's poor attempts to spice the generally good stories with something even vaguely similar to the traditional comedy-inclined dialogue. The difficulty was eventually dealt with at the end of the season, when the producers realized a format change was necessary: the chaotic, verbose style was abandoned in favor of a more plot-centric approach, which made the main story of the last two seasons (the choice of the new President) more poignant and the acting more affecting (Janney and Spencer in particular benefited from this transformation), making Seasons 6 and 7 the best in the show's run. The most vital shot in the arm came from television veteran Alan Alda: as the determined and charismatic Senator Arnold Vinick, he stole the entire sixth season, despite appearing in only six episodes, and won a deserved Emmy for his contribution to the final year, which saw the series at its most endearing and heart-breaking (not least because of the mandatory script changes that were made after Spencer died halfway through production of the last batch of episodes).Starting splendidly, suffering a midlife crisis and then improving, The West Wing is one of the smartest, wittiest TV programs of all time. If it weren't for the likes of Six Feet Under, The Sopranos and Twin Peaks, it could even be THE best show ever made. Such is the power of the expert writing and spot-on ensemble cast that gave life to the best presidency America never had."
    },
    {
      "username": "Philby-3",
      "userUrl": "https://www.imdb.com/user/ur0123856",
      "reviewLink": "https://www.imdb.com/review/rw1641701",
      "warningSpoilers": false,
      "date": "21 April 2007",
      "rate": "9",
      "helpful": "49 out of 61 found this helpful.",
      "title": "A series to savour",
      "content": "Now that the last episode has been shown in Australia, and having very much enjoyed the show despite seeing it out of order in several different countries, I'd like to make a few general comments. Thankfully the ABC showed series six and seven weekly in blocks of two episodes without commercials; thus the pleasure was undiluted.1. Whatever inaccuracies there may have been in the depiction of White House procedure (apparently Clinton adviser Dick Morris was not impressed) and however impossibly smart everybody seemed, \"West Wing\" caught the essential flavour of politics, US style, where a squillion issues, some great, others trivial, all compete for attention in a complex legalistic and ponderous system.2. There is a lot of emphasis on the trappings of the \"imperial presidency\"- flitting around the countryside in Air Force One at a cost of about $10,000 an hour, the amazing White House protocol for almost everything, the veneration of the public for the office. Louis XIV never had it so good. But then I was brought up in a country where until recently the Prime Minister's phone number was in the phone book and he used to walk the 800 metres to work. Of course the security measures don't require much justification in the land of guns for all.3. President Jed Bartlet is indeed the liberal ideal (the show could well be called \"Left Wing\") but he is also a patriot, and to those of us who have to put up with the US heaving its weight around abroad this is a problem, not a matter for praise.4. The \"walking heads\" delivering rapid-fire dialogue are off-putting at first, but do give the show pace; compare \"Commander in Chief\" which is leadenly slow (and otherwise dire) by comparison. It no doubt helps to know something about how the US political system works but generally there is enough information provided to at least follow the story.5. The internal politics of the White House are downplayed; Bartlet's team are portrayed as uniformly bright, keen and loyal, both to the president and each other, and not interested in internecine conflict. Lucky Jed.6. The acting from the main players is all that one could ask for  they emerge as real people, but then they get a lot of air time, sometimes with most of an episode to themselves. Some of the minor roles tended to be written and played as stereotypes. My favourite was Lily Tomlin as the Pres's secretary  she acted as if she could do his job herself, although Allison Janney as CJ ran a close second.7. It must have been a fun series to create and we must thank Aaron Sorkin for the effort he made in developing this show from his \"The American President\" which was a piece of fluff by comparison. He got away with what must be about the talkiest show on television. Alas, things did tail off a bit after he left (after the fourth series) but the show had enough momentum to make it entertaining right to the end of Bartlet's second term, though the last few shows were rather limp."
    },
    {
      "username": "inkslave",
      "userUrl": "https://www.imdb.com/user/ur0294647",
      "reviewLink": "https://www.imdb.com/review/rw0649991",
      "warningSpoilers": false,
      "date": "21 May 2004",
      "rate": "",
      "helpful": "105 out of 127 found this helpful.",
      "title": "The Best. Period",
      "content": "This is the finest show ever produced for TV. Each episode is a triumph. The casting, the writing, the timing are all second to none. This cast performs miracles. The secret to this show is that it is, at heart, a comedy, even when tragic things are happening. That gives Martin Sheen, Allison Janney, Bradley Whitford, Richard Schiff et al. the room to work. And do they ever.It works because it is deep, the characters are well-drawn. Early in the first season, CJ gets a root canal and walks around for the rest of the episode with cotton stuffed in her mouth, yelling things like\" The Pwesident must be bweefed!\" This has to be seen to be believed. It had me literally on the floor, laughing until I feared I would hurt myself. I don't know how many shows have tried cheap stunts like that and they are just that, cheap. On \"The West Wing\" it works because we know CJ, we know how unlike her, and yet like her, that moment is. And Toby's slow-burn reaction is pitch perfect. Bravo."
    },
    {
      "username": "suzy q123",
      "userUrl": "https://www.imdb.com/user/ur0983941",
      "reviewLink": "https://www.imdb.com/review/rw0649920",
      "warningSpoilers": false,
      "date": "15 May 2001",
      "rate": "",
      "helpful": "51 out of 65 found this helpful.",
      "title": "A great show.",
      "content": "This is what all television used to be like, in the 'good old days'- well written, well acted (even by Rob Lowe!) and beautifully directed.The plots are thick and interesting and the people are smart and pretty and I just can't get enough of it. I wish Aaron Sorkin would write another movie (he wrote A Few Good Men) and also be as prolific as David E. Kelly- Sorkins work is by far the superiour, and I could watch it day in and day out. Tune in, you won't be disappointed......."
    },
    {
      "username": "Hancock_the_Superb",
      "userUrl": "https://www.imdb.com/user/ur1835386",
      "reviewLink": "https://www.imdb.com/review/rw0649999",
      "warningSpoilers": false,
      "date": "13 August 2004",
      "rate": "10",
      "helpful": "119 out of 168 found this helpful.",
      "title": "Sorkin or no Sorkin, still the best show on TV!",
      "content": "I first caught \"The West Wing\" for two reasons: 1) our school was AGAIN on strike and 2) I had a crush on Annabeth Gish from \"The X-Files\", and I'd heard she was going to be in the Season 5 premiere. I watched a few eps on Bravo to get a little background so I wouldn't come in completely cold (my very first ep was \"Let Bartlet Be Bartlet\", which is still in my top ten). It took me awhile to get used to Aaron Sorkin's writing style, but by this point, it's my absolute favorite show.I think that the idiot Republicans who b**** about the \"liberal bias\" are, well, idiots. The show is written by a very openly liberal guy, so why are you surprised? It's not like AS is a Republican, and NBC forced him to write a \"liberal\" show. THEN you might have a case for complaining. Besides, very few Republican characters are presented as \"evil\". Besides the obvious (Ainsley Hayes and Cliff Calley), most of the other guys are presented as against the president's agenda, which DOES NOT EQUATE WITH EVIL, unless maybe you are an intolerant far-right Republican who thinks people against the war in Iraq like Martin Sheen are \"evil\" and \"un-American\" (I was for the war personally, and I'm not saying ALL Republicans). There are a few guys, like John Diehl's Claypool, or the congressman from \"Bartlet For America\", or Bruce Weitz and Paul Provenza, who are portrayed as rather unlikeable, but they are an aberration on this show. And most Republican view points are given a fair airing, at least. That said, there's not a whole lot I can say about this show that hasn't already been said a hundred times over. The writing, acting, and direction is arguably the best in television history, and I now prefer it to \"The X-Files\". Besides the marvelous starring cast (save Moira Kelly and Joshua Malina), there's also an excellent supporting cast as well, and fantastic guest casting. Tim Matheson is my favorite non-regular character as the egotistical, self-serving yet intelligent and likable Vice President Hoynes. Then there Timothy Busfield, Anna Deveare Smith, Marlee Matlin, Roger Rees, Emily Procter, and John Amos, and many other very memorable characters. My favorite one-shot guest star has to Karl Malden's Father Cavanaugh from \"Take This Sabbath Day\" (the death penalty episode).I think that all of the main characters do outstanding jobs. Martin Sheen is really the glue that holds the show together, so I'm glad they decided to make him a regular. He isn't THE star, but he is simply wonderful, and his interaction with the cast is a focal point of the show.The whole cast, indeed, provides us with one of the best ensembles in television history. Rob Lowe did a much better job than I expected he would with his role as Sam, the deputy communications director. Stockard Channing simply blows the doors off the place as the First Lady. Dule Hill never has a whole lot of screen time as Charlie, Bartlet's personal aide, but he usually injects a fun shot in the arm. Janel Moloney is really cute and side-splittingly hilarious as Donna, Josh eager-beaver assistant. Allison Janney as CJ, the press secretary, is a bit of a sore spot for me, however. In the first few seasons she was great, a character with intelligence and a great sense of humor. However, in recent years (and this I blame on the writing) her character has devolved into a whiny feminazi (see \"The Women of Qumar\"), just a notch above Mary-Louise Parker's Amy Gardner (a character I like, but most people don't). However, Janney is a talented enough actress to largely overcome this. Richard Schiff is fantastic as Toby Ziegler, the prickly, mumbly Communications Director. And then there's John Spencer as my favorite character, chief of staff Leo McGarry, a recovering alcholic, drug addict, and Vietnam vet who represses his emotions very well, but has a very deep sense of loyalty to all his friends and employees. Spencer gives a bravura performance week after week, and he is totally believable in the role. His greatest moments were his dialogue with the fired White House staffer in \"Take Out The Trash Day\", and the very end of \"Bartlet For America\" (of course). Wonderful actor. And then there's Bradley Whitford, as the egotistical but good-natured Josh Lyman, Leo's deputy, who is as every bit as loyalistic as Leo. (BTW, I hope that Josh and Donna NEVER get together; remember Mulder and Scully on \"The X-Files\", anyone?) Whitford starred one of the best episodes ever, \"Noel\", where he overcame his bout with PTSD. And of course, Martin Sheen I've already commented on. Moira Kelly and Joshua Malina are fine actors, but they were given rather poor characters to work with, and just didn't fit in to the fabric of the show. As to the departure of Sorkin: certainly the show has declined in quality, is less humorous, and there have been a good amount of stinky episodes this past year (\"Access\", anyone?), but Season Five of \"The West Wing\" is still almost infinitely better than anything else on TV. \"7A WF 83429\", \"The Stormy Present\", \"The Warfare of Genghis Khan\", \"An Khe\", the rightfully well-loved, Sorkinesque \"The Supremes\", \"Gaza\", and \"Memorial Day\". BTW, quit ragging on Gary Cole as the new VPOTUS, guys, just because he was in \"Office Space\". Tim Matheson was Otter in \"Animal House\", and I didn't any of you bring that up when he first showed up.My favorite episodes are \"Take This Sabbath Day\", \"And It's Surely To Their Credit\", \"Lord John Marbury\", \"A Proportional Response\", and \"Noel\". I'm sorry I didn't too much deeper, but really, what could I say about this show that everyone else here hasn't already.A bazillion stars for the greatest show in television history IMO."
    },
    {
      "username": "Son_of_Mansfield",
      "userUrl": "https://www.imdb.com/user/ur2415124",
      "reviewLink": "https://www.imdb.com/review/rw1671851",
      "warningSpoilers": true,
      "date": "10 June 2007",
      "rate": "10",
      "helpful": "18 out of 22 found this helpful.",
      "title": "Why can't we have a White House like this?",
      "content": "That's right, people like this would never be put in the White House. The West Wing is an idealistic presidency where a group of people come together under the Barlett administration to, like, better the world they live in. Imagine that. The show deftly avoids being sappy or sentimental. These people know that it isn't all sunshine and roses, that they will have to fight every day and lose a lot of the time. All through this is the kind of quick witted verbal assaults that people wish they were capable of, highlighted by several different relationships. The cute and playful Allison Janney and Timothy Busfield, the excitable Bradley Whitford and the more restrained John Spencer, and the abrasive, but frequently right, Richard Schiff. The entire cast is phenomenal. At the head is Martin Sheen who plays a tough president who isn't afraid to get his hands dirty, but, more often than not, will use his well rounded speech skills to great effect."
    },
    {
      "username": "liquidcelluloid-1",
      "userUrl": "https://www.imdb.com/user/ur3027087",
      "reviewLink": "https://www.imdb.com/review/rw0649993",
      "warningSpoilers": false,
      "date": "20 May 2004",
      "rate": "",
      "helpful": "78 out of 110 found this helpful.",
      "title": "\"Wing\" is a beautifully written, cinematically packaged series that satisfies the audience's desire to see behind these particular closed doors",
      "content": "Network: NBC; Genre: Drama; Content Rating: TV-PG; Available: DVD and syndication; Perspective: Modern Classic (star range: 1- 5); Seasons Reviewed: Complete Series (7 seasons) Created out of the ashes of the tragic failure that ABC befell his neo-classic \"Sports Night\" (which I also highly recommend), Aaron Sorkin's next effort aims at nothing short of the most powerful office in the world. \"The West Wing\" takes us behind the scenes of the Bartlet (Martin Sheen) administration and his staff, which includes special counselor Leo (John Spencer), the dryly spunky Press Secretary C.J. (Allison Janney), Chief of Staff Josh (Bradley Whitford) and his model-like assistant Donna (Janel Moloney), morose Communications Director Toby (Richard Schiff), aid Charlie (Dule Hill) and Deputy Comm Director Will (Josh Malin, \"Sports Night\").To best enjoy \"Wing\", with its occasionally maddening bouts of self indulgence and nose-in-the-air intellectual showboating, is to understand how purposefully different it is from just about anything else on TV. It lacks the kind of compelling situational drama you'd expect. Most of the real action occurs off screen, with us simply hearing that a crisis was solved. This show is about conversations, history and civics lessons and an ambitious deconstruction of wedge issues that you never heard spoken of so thoughtfully in entertainment television. \"Wing's\" vision of politics is an old-fashioned fantasy of a noble grass roots attempt, guided by history and the framers, where the political process is a necessary tool, o do what's right for the common man.The political right has taken the show out to the woodshed for spouting liberal propaganda (every character is a vocal Democrat), but in my experience with it, it has been nothing but honest and fair with it's topics, unlike the blunt object beating we get from David E. Kelley and Dick Wolf shows. You have to be quick to catch inferences to tax cuts creating service cuts and women's lives being ruined by having a child and not an abortion. Free from a need to create simplistic sound-bytes or follow poll numbers of real-world politicians, Sorkin's world depicts the kind of well reasoned discourse lost in the modern, media-driven political climate.Back to the dialog and the most important thing. This is a show that can be written with such lyrical beauty and directed with such cinematic majesty that it elevates it from a conceptually tedious concept and static stories. Sorkin brings back the snappy, lightening-fast \"His Girl Friday\" conversations of \"Night\". A man in love with his dialog (I can't fault him for that), he crams very syllable of every crisp monologue in the running time.Satisfying the audience's desire to see behind these particular closed doors, \"Wing\" consciously maintains a fly-on-the-wall quality as we follow the White House staff through hallways and offices discussing everything from the most frivolous everyday annoyances and grammatical idiosyncrasies to weighty issues of domestic and foreign policy. It gives us the wonderful illusion we are seeing the real nit and grit behind the political process - from getting enough votes to pass a bill to keeping piece in the Middle East. This is C-SPAN stuff, packaged with beautiful, epic pageantry.At series' end my initial reaction to the show still holds water. By comparison it doesn't have the heart or the laughs of \"Sports Night\". It has a rich look and feel but, for all its philosophizing and linguistic gymnastics, I still remain detached from the characters and any emotional core at all. Spencer is terrific and Janney and Whitford make TV stars of themselves with what are for the most part mechanical characters with just enough quirks to get them banging against each other nicely. That said, Whitford and Moloney have an engaging chemistry that draws us in and lets us root for them. A chemistry that the show takes a smart 7 years to pay off.Sorkin and Sheen's president is a Frank Capra fantasy the melds together the most idealistic elements of politics and Americana into someone who can represent the best of his ideology and is still human enough to display the worst. Granted, this is Sorkin's fantasy so the latter is rare and Bartlet gets the last wise word most of the time.After the 4th season, Sorkin leaves the show amid rumors of drug use and studio hack John Wells is brought on board. Wells is a network hack who took over \"ER\" when Michael Crichton stepped away and turned it into a soap opera, and then did the same with his own \"Third Watch\". The show slowly changes under Wells and while he resists his usual urge to sadistically kill of major characters, Sorkin's trademark dialog is slowed down and the show gets more traditionally exciting, but the intellectual substance remains and Wells gels with the show well.I don't love \"The West Wing\" as much as others. Each episode starts strong and ends strong, but almost always looses steam in the long 2nd act. So goes entire seasons, which can bring us in and go out with an assassination, a kidnapping, terrorist attack or some other exciting peril for a main character and stall for entire hours in the winter.Under Wells' control, the series ends with a spectacular bang. The final season brings an end to the Bartlet administration and follows the feverish presidential campaign of both parties race to win the election and instill their candidate - either Republican Senator Vinick (liberal He-man Alan Alda) or Democrat congressman Santos (Jimmy Smitts) - in as his successor. After 7 seasons the show goes out as rewarding and classy as it came in. A behind-the-scenes celebration of the American political process. It is an exceptional final season for a classy and classic show.* * * * / 5"
    },
    {
      "username": "whiteotter",
      "userUrl": "https://www.imdb.com/user/ur2448738",
      "reviewLink": "https://www.imdb.com/review/rw0649973",
      "warningSpoilers": false,
      "date": "27 August 2003",
      "rate": "",
      "helpful": "166 out of 182 found this helpful.",
      "title": "Brilliant",
      "content": "I couldn't get into the West Wing when it began its run. The people spoke too quickly, I didn't get most of the references, and where the heck were they powerwalking to? I just didn't get it. After an episode or two, I just forgot about it.On a recent weekend, though, I heard the pilot was being broadcast and thought I'd give it a try. Watching this show from the beginning - and being able to see episodes over again - makes all the difference. This time, I realized that I wasn't *supposed* to understand what they were referring to right out of the gate; it would be explained before the episode ended. After watching the pilot, I also realized that unlike most TV shows, The West Wing episodes are visual manifestations of great books. Both force the viewer to ask questions, challenging simple answers, refusing to provide easy, fixed-in-60-minutes situations, and providing sudden, unexpected plot twists.As excellent as the actor's performances are, it's the writing that makes the show so good. It doesn't shy away from moral ambiguity, it rarely takes the easy way out, and it compels you to believe in your government despite all the reasons it gives you to despair of it.Some might think that only jingoistic supernationalists enjoy the West Wing, but neither of those words describe me. I feel very comfortable questioning the decisions my government makes, and I appreciate how the West Wing has broadened my understanding of how it operates. For that reason alone, it deserves the accolades it receives. It's one of the best shows in the history of television."
    },
    {
      "username": "scud_muffin",
      "userUrl": "https://www.imdb.com/user/ur2841637",
      "reviewLink": "https://www.imdb.com/review/rw0995674",
      "warningSpoilers": false,
      "date": "9 January 2005",
      "rate": "10",
      "helpful": "63 out of 79 found this helpful.",
      "title": "this show is AWESOME!",
      "content": "I just started watching this show 5 days ago. My family received the first 3 seasons on DVD and I put it in and started watching. I'm on the 14th episode of the third season now, and having sat here for 36+ hours watching, I must say this show is intelligent, witty, funny, reasonable, has wonderful acting and actors, writing, and is a great look into the White House and the government of this country.I'm only on the 3rd season and I don't know how long it will take for the others to come out on DVD (as i won't be watching the show on TV, since i don't want to miss anything) but up to this point, I LOVE this show, the characters and will continue to watch it at any opportunity available to me."
    },
    {
      "username": "reece-611-649478",
      "userUrl": "https://www.imdb.com/user/ur22552480",
      "reviewLink": "https://www.imdb.com/review/rw2568708",
      "warningSpoilers": true,
      "date": "19 February 2012",
      "rate": "10",
      "helpful": "49 out of 55 found this helpful.",
      "title": "Everyone forgets about John Spencer...",
      "content": "I am a student and my field id English creative writing. Apart from my classes and all of the material that is given to me I do dabble by following contemporary writers and studying their methods.After seeing the films: \"A Few Good Men\" \"Charlie Wilson's War\" and \"The Social Network\" I. having been too young to watch \"The West Wing\" when it was on TV noticed a pattern in these films and made the link, the connection that made me find these films interesting, compelling and entertaining, Aaron Sorkin.I have since, and this is just for the past two years, found and watched everything that Sorkin has produced. His fast-paced overly intelligent yet humbled (in many humorous ways, think of Josh meeting Jzoey Lucas with a mad hangover) characters capture and interest me to no end. I have spent many hours reading his scripts and studying his methods of building and creating characters to be some of the most intelligent people in America (story form) while also giving them \"the human element\" Now that I have gotten the nerd fanatics out I must say that I love, oh wait, sorry: LOVE \"The West Wing\". I have watched the entire series through twice, however I must admit a fall off when John Wells took over the reigns however, he did have an excellent foundation to work with.I have been a member of IMDb for about three years now and I have never written a review. I read them all the time to see what other people thought about certain films or what they got out of a story, I find that many of these reviews compliment Martin Sheen's fantastic portrayal of President Josiah Bartlett but I am hard pressed to find reviews that compliment John Spencer! The real love story of this series is the relationship between Josiah Bartlett and Leo McGarry. John Spencer brings such a powerful presence and a stimulating performance to every scene that demands such an abundance of respect from the other characters. John Spencer cuts through the other characters with such precise and direct morality that there is no doubt that when he has spoken that he is correct and the argument is over. (I am not taking anything away form any of the other actors I simply don't see enough respect being paid to Mr. Spencer).Specifically I will direct your attention to the scene where Leo is talking to Vice President Hoynes and Hoynes refers to Bartlett as Leo's \"friend\". An amazingly powerful scene and within that statement Leo confesses his adoration, support and love for his best friend and The President.Sorry it is so long, Thanks for reading, Eric"
    },
    {
      "username": "freemantle_uk",
      "userUrl": "https://www.imdb.com/user/ur17571044",
      "reviewLink": "https://www.imdb.com/review/rw1839577",
      "warningSpoilers": false,
      "date": "14 March 2008",
      "rate": "10",
      "helpful": "16 out of 22 found this helpful.",
      "title": "My Favourite Television Programme",
      "content": "I have nothing but praise for the West Wing. As a self-confide politics nut this programme easily appealed to me. It had a fantastic cast, including Martin Sheen who is one of my favourite actors, and the production values could easily match most movies being made. Programmes like the West Wing are a sign American Television can challenge modern cinema.As already mention the programme has a brilliant cast, and has some of America's best. As well as Martin Sheen, they are actors such as Bradley Whitmore, John Spencer, Allison Janney and the programme did reboot Rob Lowe's career. The programme has also had some excellent guest stars, such as Glenn Close, Christian Slater and Mary-Louise Parker.The drama offered in the programme is fantastic, you can see how American government works and how deals are made a broken. It is very intellectual and never attempt to dumb down. It is also has moments of comedy and can be very lighthearted which is a nice and refreshing, compared to say 24 which is never lighthearted. As the programme progressed you can also how the relationship and change and evolute.The West Wing also tackles contemporary issues, ranging from abortion, taxation, terrorism, torture etc. The West Wing is obviously political, but it still gives Republicans a fair say and show how they can argue their case. It does show good Republicans and bad Democratic, as well as Dogmatic Republicans and intelligent Democrats. My personal view in American politics is that America needs a Democratic president and I totally support Barack Obama. I also have a hatred for George W. Bush and his team.The programme also takes the most realistic approach possible, compared to 24, which can be very silly. Many political experts felt that the programme was true to real live and you can see who characters are based on, for example President Barrett was base on Bill Clinton and JFK, whilst Sam Seaborn was based on George Steponotplis. It was also very useful to me because it helped me understand American politics more and was useful during my Politics A-Level.I think it was a shame that this programme had to end and I hope that Hollywood can make more programmes of this quality."
    },
    {
      "username": "csm-78119",
      "userUrl": "https://www.imdb.com/user/ur98341434",
      "reviewLink": "https://www.imdb.com/review/rw4611245",
      "warningSpoilers": false,
      "date": "27 January 2019",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "A Magnificent TV Series",
      "content": "It really doesn't get any better than this. Universally excellent performances from every major cast member. Beautifully written, with exquisitely drawn characters each with their own human frailties. A show that deals intelligently with serious political issues but is as much about the nuanced relationships of its central characters than the wider political background. That said - how much better would the world be now if the White House had a Bartlett administration, or if there was a little more idealism and a little less febrility around in the political world! So many unforgettable scenes; how Toby deals with the return of his coat, (\"In Excelsis Deo\"); Leo's speech to Josh about the man in the hole (\"Noel\"); Bartlett turning up to speak to Josh at the Airport; numerous Donna and Josh exchanges; and \"Two Cathedrals\" remains the best episode of any tv series that I have ever seen. If you haven't seen it yet you have much to look forward to!"
    },
    {
      "username": "meri",
      "userUrl": "https://www.imdb.com/user/ur0017740",
      "reviewLink": "https://www.imdb.com/review/rw0649942",
      "warningSpoilers": false,
      "date": "28 May 2002",
      "rate": "10",
      "helpful": "26 out of 32 found this helpful.",
      "title": "Quality drama with a good dose of humor.",
      "content": "Allow me to gush. I absolutely love this show. I can't really convey how much I like this show. To say that I think that it's the best show I've ever seen would not be exaggerating. For those who haven't seen it, The West Wing is about the administration of President Jeb Bartlett (D, NH). What makes this show special is an amazing combination of writing and a perfect ensemble cast. Before I get into the detailed character rundown, let me say this: there is something common to all of these characters, something that is a large part of what makes this show great: All of these characters are extraordinarily intelligent (well, compared to the common person; maybe all White House staffers are like this), have incredible recall, and have wonderful senses of humor and timing. (Yes, I know. We can thank the writers for that. That's the point here, though, isn't it?) Martin Sheen (playing President Bartlett) makes, in balance, quite the likeable President. I say \"in balance\" because there are times when you find him annoying or condescending. But, well, you'd kind of expect that of a President, no? He is brilliant, sarcastic, funny, and has a great dry sense of humor. He is, of course, compassionate (I mean, he's a Democrat, right?). He's been shot. His Vice President doesn't like him much. Oh yeah, and he also has MS. Leo McGarry is the White House Chief of Staff. John Spencer seems to land a lot of these roles, probably because he's perfect for them. Looking at him, you just know he's a good authoritative man who's worked in the government in some capacity for most of his life. He's a solid man, one you can always run to, who will provide guidance and leadership. Sounds like a perfect Chief of Staff, doesn't it? Leo's Deputy Chief is Josh Lyman, portrayed by Bradley Whitford. Josh is the... softest... person of the staff, in my assessment. That doesn't mean he's a wuss. It just means that he seems to lack the harder edges that most of the rest of the staff has. This doesn't diminish his passion or his dedication or his willingness to fight in the least. It's very hard to explain. Toby Ziegler is the Communications Director, and is played by Richard Schiff. You might recognized Mr. Schiff as one of those \"that guy\" actors. This is by far his biggest role, and damn, he's good at it. Toby crafts the President's words, and is one of the major players in the White House staff. He is also the brooder of the staff. If there is something deeply troubling about which to worry and fret and develop angst, Toby's going to be the one to do it best. Rob Lowe, making an impressive comeback from his unfortunate incident, makes a brilliant Sam Seaborn, Deputy Communications Director, Toby's second-in-command. In a cast of characters which all possess an impressive memory and ability for recall, Sam stands out. He has a near encyclopedic memory. He's also the geekiest character on the show, and I mean that in the endearing way. Allison Janney plays CJ Cregg, the White House Press Secretary. She fills her role in the White House administration with an amazing amount of grace under pressure. (Trust me, in this administration, the White House Press Secretary is almost always under pressure.) I can't even begin imagining doing her job, much less doing it as well as she does. I'd fly off the handle about 9,000 times a day. Dule Hill portrays Charlie Young, who is quite possibly my favorite character on the show. Charlie is President Bartlett's aide, and as such, doesn't have the impressive pedigree that the rest of the crew has. In fact, he showed up at the White House looking for a job as a courier when he got tossed upstairs. But, just because Charlie doesn't have a wall full of degrees, don't write him off. Charlie has expressed amazing integrity and fortitude, and regarding his intelligence... well, Sam was once so impressed by hints of Charlie's mental aptitude that he asked, \"Charlie, just how smart are you?\" (To which Charlie responded, \"I got some game.\") Even the supporting characters are amazing. Emily Proctor plays Ainsley Hayes, the token Republican on staff. She's flighty, she talks a mile a minute, she's constantly flustered... and she's insanely intelligent, and she can outtalk Sam. Stockard Channing plays Mrs. Abigail Bartlett, the First Lady. Or perhaps I should say Dr. Abigail Bartlett. The First Lady's got some game of her own. Janel Maloney is Donna Moss, Josh Lyman's assistant. She's got a great sense of humor, and I keep hoping she and Josh will figure out they're supposed to be together (though, I'm also hoping they don't, you know?). Anna Deveare Smith (an amazing woman in real life) plays Nancy McNally, the National Security Advisor. She fills this historically male role with a wonderful competence. Joey Lucas, the primary political consultant used for polls, is beautifully portrayed by Marlee Matlin. Oh yeah! Oliver Platt as Oliver Babish, White House Counsel! Wonderful stuff. Oh yeah, and the show itself. Wow. This show has tension and comedy and hints of romance, and tension and comedy and... And the writing. Genius. Check out some of the quotes. And really, just give the show a chance. The next time someone tells you that there's nothing worth watching on TV, you'll have a rebuttal."
    },
    {
      "username": "Sonatine97",
      "userUrl": "https://www.imdb.com/user/ur0763923",
      "reviewLink": "https://www.imdb.com/review/rw5594806",
      "warningSpoilers": false,
      "date": "31 March 2020",
      "rate": "8",
      "helpful": "4 out of 4 found this helpful.",
      "title": "What's Next?",
      "content": "I have been a fan of TWW for at least 20 years, and up until recently a year didn't go by without me having a TWW DVD marathon of all seven seasons more or less back2back over a period of a couple of months or so.When I first started to watch the show back in the early 00s, I thought it was quite excellent in terms of the writing and of course the acting. I realise there was a period of instability when Sorkin left at the backend of S4, and S5 suffered for it with its uneven and improbably storylines. But by and large the show was a extremely well done, and still remains relevant even today.Personally I am more of a moderate Conservative with my politics, and there were many times throughout the show where the rather liberal ideology would grate. But I managed to take a more objective pov, and the show didn't suffer for it.And the funny thing is, when I first started watching the show I would always rank the first 4 seasons as the very best. But now I much prefer seasons 6 & 7 over 1 and possibly 4. Seasons 2 and 3 were the pinnacle years for the show, in my opinion, but season 7 was a real highlight, not least because it moved us away from the familiar tedium of The White House, to the far more interesting presidential election campaign, and the wonderful performances from Alda, Spencer and Whitford.A little dated now perhaps, but it still stands the test of time and excellent writing.What's next?"
    },
    {
      "username": "wamweri",
      "userUrl": "https://www.imdb.com/user/ur3820367",
      "reviewLink": "https://www.imdb.com/review/rw0973119",
      "warningSpoilers": false,
      "date": "6 December 2004",
      "rate": "",
      "helpful": "36 out of 46 found this helpful.",
      "title": "Making real drama out of politics",
      "content": "So much political reporting seems to be an attempt to fake a drama out of little material. I missed the West Wing when it started, but am catching up now, and find that it turns the specifics of politics into gripping human drama with a fast pace. The camera seems to move as quickly as the people, following one conversation, then picking up another as two corridors intersect, and going off after that conversation instead. It's a remarkably effective dramatic device, that helps generate a sense of many topics, issues and personalities all being constantly on the move in response to events.The acting is uniformly good, and often not on screen, Martin Sheen's president remains a constant presence shaping every story."
    },
    {
      "username": "p_probert",
      "userUrl": "https://www.imdb.com/user/ur0654656",
      "reviewLink": "https://www.imdb.com/review/rw0649902",
      "warningSpoilers": false,
      "date": "16 May 2000",
      "rate": "",
      "helpful": "68 out of 82 found this helpful.",
      "title": "Charming and intelligent drama - a joy to watch",
      "content": "This gem of a series really took me by surprise. Observing the world of American politics and the lives of those working in the White House could be an extremely dull concept. But thanks to an outstanding script and the wonderful skills of the experienced cast, The West Wing effortlessly draws the viewer in and provides top quality drama in every action-packed episode.Following the trials and triumphs of those working behind-the-scenes in and around the Oval Office, this series perfectly portrays the shrewdness that the president and his staff require to do their jobs and the way they inter-relate in a manic environment to get those jobs done, while still managing to maintain a personal life. Combining a subtle mix of poignancy, humour and dramatic tension with varying degrees of pace, it is a joy to watch.Each episode is relatively self-contained with running storylines developing throughout the series. The characters are perfectly rounded, the script continually sharp, and credit goes to the directors and editors who ensure such slick movement and spot-on timing on screen.Singling out any particular member of the cast is difficult as each one of them is truly first-rate. However, Martin Sheen is excellent as President Bartlet, a fiercely intelligent and discerning man with a genuine passion for his job. Rob Lowe is a revelation as Sam Seaborn, the wise and witty deputy communications director, and Allison Janney, as the astute press secretary, CJ, is far removed from her almost unrecognisable role as Barbara Fitts in American Beauty.Whether White House life is in reality as appealing as this remains to be seen. It would, however, be very reassuring to believe that those who actually do hold such influential positions are as unashamedly charming as The West Wing brilliantly depicts them."
    },
    {
      "username": "SnoopyStyle",
      "userUrl": "https://www.imdb.com/user/ur2898520",
      "reviewLink": "https://www.imdb.com/review/rw2873093",
      "warningSpoilers": false,
      "date": "21 September 2013",
      "rate": "9",
      "helpful": "6 out of 8 found this helpful.",
      "title": "Aaron Sorkin's crowning jewel",
      "content": "Aaron Sorkin has created one of the best written shows of all times. It is powerful wishfulfilment TV of a moral president trying to navigate the political system. The dialog is written in Aaron's fast flowing musicality. However the show loses its center when Martin Sheen leaves and the story no longer compelling.It's a stroke of genius to have Martin Sheen as the president. And it reintroduce Rob Lowe as a major star now more than just a teen heartthrob. The great thing about the acting is that a lot of great lesser known actors Allison Janney, John Spencer, Bradley Whitford get to shine."
    },
    {
      "username": "studioAT",
      "userUrl": "https://www.imdb.com/user/ur23359813",
      "reviewLink": "https://www.imdb.com/review/rw3545049",
      "warningSpoilers": false,
      "date": "16 September 2016",
      "rate": "6",
      "helpful": "11 out of 17 found this helpful.",
      "title": "Fantastic...for the most part",
      "content": "The first two (maybe three) seasons of this show are as good as you'll ever see on television. Largely scripted by Aaron Sorkin and adeptly performed by a fantastic ensemble cast it manages to make American politics entertaining for the masses.It's difficult to single out one episode or one cast member that shines best because the consistency of the show is unrivalled. Now it's almost common place to see film actors dip their toe into TV but back then it was unheard of. 'The West Wing' though had a cast of film actors bringing their A game, week in, week out.In the first two (maybe three) seasons that is. Because after Sorkin left at the end of season four this show went downhill fast. The writing tried and failed to be Sorkin-esque, the characters became unlikeable and this made for a very poor fifth season. In my opinion it never truly recovered.For two years though 'The West Wing' stood head and shoulders above everything else on TV."
    },
    {
      "username": "Matti-Man",
      "userUrl": "https://www.imdb.com/user/ur1896032",
      "reviewLink": "https://www.imdb.com/review/rw1495381",
      "warningSpoilers": true,
      "date": "12 October 2006",
      "rate": "10",
      "helpful": "10 out of 14 found this helpful.",
      "title": "Best episode?",
      "content": "\"In Excelsis Deo\" (First Season, Ep 10)It's almost impossible to review an entire series, so I won't try. But suffice it to say that I consider West Wing to be pretty much as good as episodic television can get. The first four seasons (guided, creatively, by the towering talent that is Aaron Sorkin) were simply stratospheric in their achievement, as evidenced by the shower of Emmys that cascaded on the show during those four years. And while John Wells is no slouch in the writing department (boy, if I had half his talent, I could win an Oscar!) there's no disputing that Sorkin was too tough an act to follow. Consequently, Seasons Five to Seven pale (unfairly) in comparison.So let's talk about the best of the best ... There are many genuinely superlative episodes of this show, especially during the first four seasons. I've lost track of the times that I have watched a scene in an episode and had to pause the DVD while I digest the brilliance of what I've just seen. I know many would vote for \"Isaac and Ishmael\" - a damn fine piece of writing which should be compulsory viewing for schoolkids all over the world, of every culture and faith.And you have to love the series pilot, \"Pilot\", when Jed tears into the rude \"representatives\" from the religious right ... other honourable mentions go to \"Indians in the Lobby\", the Josh.com episode \"The U.S. Poet Laureate\" and the two-parter \"20 Hours in America\". And I have a special affection for the episode \"The Mid-Terms\" in which Jed Bartlett dresses down right-wing talk-radio host Dr Jenna Jacobs for using the Bible to justify her offensive beliefs.But for me it has to be \"In Excelsis Deo\". Everything about that episode just ticks like a well- oiled watch. The sobering speech given by Mrs Landringham to Charlie about why she feels down during the holiday season sets us up for the heart-wrenching moment when she offers to accompany Toby to the funeral. Jed \"rebuking\" Toby for using his name to engineer a military funeral for a homeless ex-serviceman, then patting him on the shoulder. And how could anyone not be moved by that fabulous montage of the choir in the White House singing \"The Little drummer Boy\" as the immaculate US Marines perform as honour guard at Arlington for the military funeral.Writing rarely comes this sublime ..."
    },
    {
      "username": "kosmasp",
      "userUrl": "https://www.imdb.com/user/ur5876717",
      "reviewLink": "https://www.imdb.com/review/rw1595870",
      "warningSpoilers": false,
      "date": "10 February 2007",
      "rate": "10",
      "helpful": "10 out of 16 found this helpful.",
      "title": "The Best Wing",
      "content": "It was hard to find a summary line and it's not the best, but at least there is one. I want to explain why I like this show so much, in a similar fashion/way that I've described movies that I don't like. I did put a lot of effort in those comments, so I want to take my time with this one too, because the show deserves it.I won't spoiler anything story-wise, I won't even mention what role Martin Sheen plays. That was one of the few things I knew when I started watching West Wing. And I imagine that it must have been a great beginning for those who didn't knew what was about to hit them! The show has a fast pace, so that will be something you have to get used to, but it's not like it's impossible or too much (story) in one episode. That brings us to the writing of the show. Which is fabulous! I'm not only talking about each storyline (some/many explored in more than one episode), but also the fleshed out characters. And they come with witty and intelligent dialogue. Here's a point where you could criticize the show for not being realistic. Who would talk like that and also why would they do that, while they're walking? Although I can imagine, that it would be possible, to do just that, just to save (valuable?) time! That's not enough though for a great television show/series. You have to have great actors too. And they're here. Very well casted and of course very well acted too. After watching the show you can see why many have asked Martin Sheen, why he's only acting and not doing his TV-Series Character for real! After watching only one episode, you could be excused for thinking, that it can work.The episodes are also very well directed. They're shot in a very smooth and nice way. Long camera movements and shots are included which are a testament to the actors, because that means they have to stay longer focused on the role they're playing and also have to remember (without any mistakes) their text! It is very well edited (see fast pace), so that leaves not really many points to criticize! There will be people who will objectify to a few things. Such as the pace (for some it might be too long), the fact that it's more drama than action (although often very funny, but also very touching), some will hate the dialogue (either because it's too quick or because it's not \"real\" enough) ... That's about everything I could think of ...... Although I can assure you that I absolutely adore the show. I fell in love with it. I can't describe it with words, but judging by the many people who have voted here (mostly like myself a high vote), most of them feel the same way. If you haven't watched it yet, shame on you! ;o) Go ahead rent/buy it and enjoy the show! :o)"
    },
    {
      "username": "billyl-10881",
      "userUrl": "https://www.imdb.com/user/ur62121221",
      "reviewLink": "https://www.imdb.com/review/rw7988149",
      "warningSpoilers": false,
      "date": "20 March 2022",
      "rate": "10",
      "helpful": "5 out of 5 found this helpful.",
      "title": "The. Best. Show. Ever.",
      "content": "Just started re watching this amazing series again, which may be a mistake as I can now see several weeks of zero sleep coming up! Brilliantly written, acted, produced and directed. Faultless from the very first introduction. Would and have reccomended this to anyone who has any sort of interest in quality TV."
    },
    {
      "username": "wisewebwoman",
      "userUrl": "https://www.imdb.com/user/ur0509769",
      "reviewLink": "https://www.imdb.com/review/rw1542555",
      "warningSpoilers": false,
      "date": "11 December 2006",
      "rate": "9",
      "helpful": "10 out of 16 found this helpful.",
      "title": "Consistent",
      "content": "With the odd series bumps.I wait always for the series to be complete before writing about it. It seems fairer to me, as sometimes these multi-year dramas start out with a bang and limp away in a shameful and ill-written manner, beaten to death by the money grubbing studios. I don't watch cable TV but purchase complete sets of DVDs when issued, thus safeguarding my own time to watch when and where I want.To me, this series remains up there with the best of all time. The punch through of multiple story lines, the camera angles, the engaging \"everyday\" appearing stars (no one was exceptionally beautiful), the consistent wit of the script, the daring \"live\" broadcast, the intelligence of the actors, and the liberal slant of the White House - eight years of truth and honor, highlighting courage and peace in our time.Martin Sheen, is, as usual, brilliant, as was John Spencer and Allison Jenney, Richard Schiff, I would go on and on. For this consistent engagement of the senses of the viewer is a rare attribute in a series of this genre. 7 Seasons of it.Some of it seemed over-written at the time (Bradley Whitford's screaming at the White House comes to mind)but his subsequent near nervous breakdown would seem to explain that. The run up to the election seemed elongated, due to other star commitments, perhaps.The part of Charlie seemed forced and odd at times, one of the characterizations that seemed to amble in and out of episodes with no particular purpose apart from the *gasp* shock of being Zoe's sort of boyfriend, otherwise he appeared monk/eunuch-like.A very \"white\" White house, no visible minority (and I exclude Nancy McNally) in a major part apart from Jimmy Smits at the end, no gay/lesbian/trans-gendered characters, it would have been good to see John Spencer as an \"out\" chief of staff.These are minor points and I don't wish to diminish a fabulous and engaging series full of the promise of a U S of A that alas, we can only hope for. 9 out 10. Spell-binding, intelligent and gripping. Bravo to all."
    },
    {
      "username": "harry-76",
      "userUrl": "https://www.imdb.com/user/ur0239428",
      "reviewLink": "https://www.imdb.com/review/rw0649979",
      "warningSpoilers": false,
      "date": "14 November 2003",
      "rate": "",
      "helpful": "13 out of 23 found this helpful.",
      "title": "Dream Duo",
      "content": "Martin Sheen's and Stockard Channing's being cast together is a dream come true. Both are super actors perfectly suited to one another's style and temperament and play off one another with great flair. Interestingly, I caught both actor's interviews this week. Channing on \"Biography\" revealed her incredible up-and-down career, with many times almost giving up her profession. Sheen revealed on \"Inside Actor's Studio\" his tenacity for total commitment to both his roles and social causes, the later of which landed him in a state of incarceration on dozens of occasions.Both actors represent the finest in their profession: dependable, engaged, hard working--resulting in products of the highest caliber.Sheen's volume of credits is staggering, and his approach to life as revealed on the \"Actor's Studio\" interview is as open and honest as his pro work. Channing matches him tooth and nail, and the two make as cool a pair as any that has ever graced a tv series. May \"The West Wing\" continue as long as its creative writers continue crafting their fine scripts and its \"dream team\" lead actors their heavenly collaboration."
    }
  ],
  "errorMessage": ""
}