{
  "imDbId": "tt0200276",
  "title": "The West Wing",
  "fullTitle": "The West Wing (TV Series 1999–2006)",
  "type": "TVSeries",
  "year": "1999",
  "episodes": [
    {
      "id": "tt0745667",
      "seasonNumber": "1",
      "episodeNumber": "1",
      "title": "Pilot",
      "image": "https://m.media-amazon.com/images/M/MV5BNjllYTQxNzUtM2VlYy00MjBlLWJmNTAtYTU3MWEzNzhkMTk4XkEyXkFqcGdeQXVyMDgyNjA5MA@@._V1_Ratio1.7778_AL_.jpg",
      "year": "1999",
      "released": "22 Sep. 1999",
      "plot": "The West Wing staffers are introduced as each learns via phone or pager that the President was in a cycling accident. Josh faces the possible loss of his job after an on-air insult of a political opponent, which Toby tries to prevent by having Josh make a personal apology. Sam's fling the previous night with Laurie, who unbeknownst to Sam is a call girl, puts him in hot water, which he compounds when ineptly lecturing a class of 4th-graders about the White House and then asking their teacher which child is Leo's daughter. Leo must deal with the fallout from Josh's ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "1883"
    },
    {
      "id": "tt0745669",
      "seasonNumber": "1",
      "episodeNumber": "2",
      "title": "Post Hoc, Ergo Propter Hoc",
      "image": "https://m.media-amazon.com/images/M/MV5BMzA2NzcxOTc3OV5BMl5BanBnXkFtZTgwMDMwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1999",
      "released": "29 Sep. 1999",
      "plot": "Josh trumps a potential Democratic challenger in a masterful political move and then hires the challenger's chief of staff and ex-girlfriend Mandy Hampton. Toby tries to warn Sam away from his friendship with the call girl, but to Toby's horror, Sam seems intent on reforming her. CJ tries to spin the latest clash between President Bartlet and Vice President Hoynes. After an American plane is shot down carrying Bartlet's physician, Bartlet's response leaves Leo worried about the President's response.",
      "imDbRating": "8.0",
      "imDbRatingCount": "1358"
    },
    {
      "id": "tt0745591",
      "seasonNumber": "1",
      "episodeNumber": "3",
      "title": "A Proportional Response",
      "image": "https://m.media-amazon.com/images/M/MV5BMzQ0NzQ3MDkzMl5BMl5BanBnXkFtZTgwNTcxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1999",
      "released": "6 Oct. 1999",
      "plot": "After being offered \"a proportional response\" to the Syrian military's downing of a U.S. military plane on a medical mission (and carrying his newly named personal physician), the president demands an option that will have greater impact. Leo gradually must talk him down, while Bartlet snipes at everyone, including Abby. The president ultimately agrees to the initial option, but is not happy about it. Charlie Young is introduced as an applicant for a messenger job whom Josh decides to hire as President Bartlet's personal aide.",
      "imDbRating": "8.6",
      "imDbRatingCount": "1336"
    },
    {
      "id": "tt0745620",
      "seasonNumber": "1",
      "episodeNumber": "4",
      "title": "Five Votes Down",
      "image": "https://m.media-amazon.com/images/M/MV5BNDEyODAyMTUxMF5BMl5BanBnXkFtZTgwMTYxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1999",
      "released": "13 Oct. 1999",
      "plot": "After a speech touting the success of a gun control bill, the team learns they are actually five votes short. The fight to get them back puts a strain on Leo's marriage and Josh's relationship with numerous Senators. Toby finds out he may have accidentally participated in insider trading.",
      "imDbRating": "8.1",
      "imDbRatingCount": "1221"
    },
    {
      "id": "tt0745690",
      "seasonNumber": "1",
      "episodeNumber": "5",
      "title": "The Crackpots and These Women",
      "image": "https://m.media-amazon.com/images/M/MV5BMjQwNjg1MjI1NF5BMl5BanBnXkFtZTgwOTEwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1999",
      "released": "20 Oct. 1999",
      "plot": "On the series' first \"Big Block of Cheese\" Day (nicknamed \"Total Crackpot Day\" by Josh), staffers meet with reps of various organizations causes, e.g., C.J. hosts a group that wants $900 million for a \"wolves only\" highway. The president has everyone to the residence for a homemade chili party, we learn about Mrs. Landingham's past, and Zoey is introduced to the group.",
      "imDbRating": "8.5",
      "imDbRatingCount": "1367"
    },
    {
      "id": "tt0745659",
      "seasonNumber": "1",
      "episodeNumber": "6",
      "title": "Mr. Willis of Ohio",
      "image": "https://m.media-amazon.com/images/M/MV5BNzU0OTA3ODM5Nl5BMl5BanBnXkFtZTgwNzAxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1999",
      "released": "3 Nov. 1999",
      "plot": "In the first of several episodes throughout the series' run that portrays ordinary Americans and how they interact with and ultimately affect the W.H., an Ohio middle school social studies teacher, a widower who has recently filled the brief remaining term of his late wife in the House, joins two other reps to meet with Toby and Mandy about changes to unfair rules in the U.S. Census written into the latest federal budget. The other two, career politicians, are completely resistant to the changes, but Mr. Willis is swayed by a potent argument Toby makes regarding \"...",
      "imDbRating": "8.6",
      "imDbRatingCount": "1332"
    },
    {
      "id": "tt0745706",
      "seasonNumber": "1",
      "episodeNumber": "7",
      "title": "The State Dinner",
      "image": "https://m.media-amazon.com/images/M/MV5BMjIxMTk2Mjk5N15BMl5BanBnXkFtZTgwNzQyMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1999",
      "released": "10 Nov. 1999",
      "plot": "While preparing for (and enduring) a state dinner for the newly-elected president of Indonesia, staff deal with a multitude of other problems: Josh and Mandy argue over the best way to handle an FBI standoff with militants in Idaho; Leo (and eventually Bartlet) intervenes in a negotiations between the Teamsters Union and national reps for the trucking industry; Toby tries to convince an Indonesian cabinet member to release a friend of his, an activist or incites anti-government protests, from prison; Sam witnesses Laurie at work as a call girl, serving as the state ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "1151"
    },
    {
      "id": "tt0745615",
      "seasonNumber": "1",
      "episodeNumber": "8",
      "title": "Enemies",
      "image": "https://m.media-amazon.com/images/M/MV5BMjAwNzIyMTkxN15BMl5BanBnXkFtZTgwNjUxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1999",
      "released": "17 Nov. 1999",
      "plot": "A crucial banking bill is at risk when political rivals of environmentally sensitive President Bartlet attach a land-use rider to it that would allow strip-mining some of the Montana wilderness. C.J. tries to stamp out rumors that the Chief Executive chastised the Vice President during a cabinet meeting. An overworked Leo isn't too keen on his independent daughter Mallory dating the handsome Sam. C.J. continues to fend-off the romantic charms of a perceptive reporter with a knack for sniffing out juicy stories. Former lovers Mandy and Josh clash over the ...",
      "imDbRating": "7.9",
      "imDbRatingCount": "1094"
    },
    {
      "id": "tt0745704",
      "seasonNumber": "1",
      "episodeNumber": "9",
      "title": "The Short List",
      "image": "https://m.media-amazon.com/images/M/MV5BNTgxODMwNTAwMF5BMl5BanBnXkFtZTgwMjQyMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1999",
      "released": "24 Nov. 1999",
      "plot": "When a Supreme Court justice retires, President Bartlet has a golden opportunity to impact the court's composition by nominating a favorite judge but when further study reveals the candidate's conflicting ideology, the President might change his mind and opt for another judge. In addition, a headline seeking congressman on the House Government Oversight Committee accuses the White House staff of substance abuse -- a dicey issue for one important member.",
      "imDbRating": "8.6",
      "imDbRatingCount": "1170"
    },
    {
      "id": "tt0745635",
      "seasonNumber": "1",
      "episodeNumber": "10",
      "title": "In Excelsis Deo",
      "image": "https://m.media-amazon.com/images/M/MV5BMjE5MjAzNjI3MV5BMl5BanBnXkFtZTgwODgwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "1999",
      "released": "15 Dec. 1999",
      "plot": "When a homeless veteran dies on the National Mall and his body remains uncollected for hours, Toby becomes fixated on getting him a proper burial.",
      "imDbRating": "9.1",
      "imDbRatingCount": "1737"
    },
    {
      "id": "tt0745652",
      "seasonNumber": "1",
      "episodeNumber": "11",
      "title": "Lord John Marbury",
      "image": "https://m.media-amazon.com/images/M/MV5BMTYyODI3Mjk5Ml5BMl5BanBnXkFtZTgwMjAxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2000",
      "released": "5 Jan. 2000",
      "plot": "When India sends troops into Kashmir, President Bartlett calls for a British former ambassador to India to help out - over Leo's strong objections.",
      "imDbRating": "8.1",
      "imDbRatingCount": "1108"
    },
    {
      "id": "tt0745631",
      "seasonNumber": "1",
      "episodeNumber": "12",
      "title": "He Shall, from Time to Time...",
      "image": "https://m.media-amazon.com/images/M/MV5BNDA0MTc4MjE3MV5BMl5BanBnXkFtZTgwMjExMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2000",
      "released": "12 Jan. 2000",
      "plot": "When the President collapses on the eve of his State of the Union, it's diagnosed as the flu. But when the First Lady cancels a trip and rushes home to look after him, Leo suspects the first family is hiding something about Bartlett's medical condition.",
      "imDbRating": "8.6",
      "imDbRatingCount": "1117"
    },
    {
      "id": "tt0745682",
      "seasonNumber": "1",
      "episodeNumber": "13",
      "title": "Take Out the Trash Day",
      "image": "https://m.media-amazon.com/images/M/MV5BMzQyODEyNzA4M15BMl5BanBnXkFtZTgwMTUwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2000",
      "released": "26 Jan. 2000",
      "plot": "In preparation for the Friday night briefing for the Saturday papers and news broadcasts -- nicknamed \"take out the trash day\" because it disposes of all the stories the White House doesn't want heavy coverage on, and because Saturday is the least read paper of the week -- the staff take on a variety of chores: C.J. prepares to meet with the family of a Matthew Shepard-type victim of murder just because he was gay, and discovers something unexpected about the young man's reticent father; Josh and Sam contend with an angry Republican house committee leader who wants to...",
      "imDbRating": "8.3",
      "imDbRatingCount": "1068"
    },
    {
      "id": "tt0745683",
      "seasonNumber": "1",
      "episodeNumber": "14",
      "title": "Take This Sabbath Day",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc4MDI2OTM4N15BMl5BanBnXkFtZTgwMjUwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2000",
      "released": "9 Feb. 2000",
      "plot": "A drug dealer's appeal of the federal death penalty is rejected by the Supreme Court, which upholds the death sentence with execution scheduled for the following Monday. One of the defense lawyers on the case is Sam's old high school bully, and he appeals directly to Sam to involve the president. During a weekend in which he was supposed to be in a yacht race, Sam opts to stay at the W.H. and try to convince his fellow staffers and ultimately Bartlet that the president should commute the sentence. Meanwhile Josh, after a night of heavy drinking at a bachelor party, ...",
      "imDbRating": "8.8",
      "imDbRatingCount": "1328"
    },
    {
      "id": "tt0745602",
      "seasonNumber": "1",
      "episodeNumber": "15",
      "title": "Celestial Navigation",
      "image": "https://m.media-amazon.com/images/M/MV5BMzQ0Njg5MzkxMl5BMl5BanBnXkFtZTgwNzMxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2000",
      "released": "16 Feb. 2000",
      "plot": "In a lecture at Georgetown, Josh recalls the previous week at the White House, during which he replaced a dentally impaired C.J. in the press room and gave a memorably disastrous briefing, responding to a reporter's question (sarcastically, although taken quite seriously) that the White House had a secret plan to fight inflation. Meanwhile, he's intermittently on the phone with Toby and Sam, who have flown to Connecticut and are now lost in a rental car on the Connecticut Turnpike. They've gone on critical business: the president's nominee for the Supreme Court, ...",
      "imDbRating": "8.9",
      "imDbRatingCount": "1333"
    },
    {
      "id": "tt0745585",
      "seasonNumber": "1",
      "episodeNumber": "16",
      "title": "20 Hours in L.A.",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ5ODIxMDIwMF5BMl5BanBnXkFtZTgwMDgxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2000",
      "released": "23 Feb. 2000",
      "plot": "The President meets Zoey's new bodyguard on a 20-hour trip to California; Josh tries to keep a fund raiser from being canceled; Leo needs the VP to break a 50-50 tie in the Senate.",
      "imDbRating": "7.8",
      "imDbRatingCount": "1052"
    },
    {
      "id": "tt0745716",
      "seasonNumber": "1",
      "episodeNumber": "17",
      "title": "The White House Pro-Am",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA1MzM2MjU4M15BMl5BanBnXkFtZTgwMDYyMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2000",
      "released": "22 Mar. 2000",
      "plot": "When the Federal Reserve Chairman dies, Bartlet must quickly choose a successor in order to avoid financial chaos. However, he is reluctant to pick the obvious choice for Fed Chair, who used to be Abby's boyfriend. The matter is worsened when Danny Concanon receives a quote from the first lady saying she supports her ex-boyfriend, leaving Bartlett more irate. Meanwhile, Josh and Toby are courting congressman in order to get more votes for a bill they already won. However, a congresswoman, who felt 'betrayed' by Abby, poses a threat to the bill.",
      "imDbRating": "7.7",
      "imDbRatingCount": "984"
    },
    {
      "id": "tt0745677",
      "seasonNumber": "1",
      "episodeNumber": "18",
      "title": "Six Meetings Before Lunch",
      "image": "https://m.media-amazon.com/images/M/MV5BMTgwMDE4NDg3M15BMl5BanBnXkFtZTgwNjMwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2000",
      "released": "5 Apr. 2000",
      "plot": "The morning after Mendoza's confirmation, various staff members are brought back to earth by difficult meetings.",
      "imDbRating": "8.1",
      "imDbRatingCount": "1049"
    },
    {
      "id": "tt0745648",
      "seasonNumber": "1",
      "episodeNumber": "19",
      "title": "Let Bartlet Be Bartlet",
      "image": "https://m.media-amazon.com/images/M/MV5BMjI1MjU1ODQ0N15BMl5BanBnXkFtZTgwMDIxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2000",
      "released": "26 Apr. 2000",
      "plot": "The West Wing staff are feeling malaise as it seems they never get anything accomplished. Meanwhile, a leaked memo is a land mine that could embarrass the administration.",
      "imDbRating": "8.9",
      "imDbRatingCount": "1224"
    },
    {
      "id": "tt0745655",
      "seasonNumber": "1",
      "episodeNumber": "20",
      "title": "Mandatory Minimums",
      "image": "https://m.media-amazon.com/images/M/MV5BMTUyMzM1MTU2Ml5BMl5BanBnXkFtZTgwMzAxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2000",
      "released": "3 May 2000",
      "plot": "A newly energized administration prepares to take on soft money, increase addiction treatment, and remove mandatory minimum sentencing.",
      "imDbRating": "8.2",
      "imDbRatingCount": "1012"
    },
    {
      "id": "tt0745649",
      "seasonNumber": "1",
      "episodeNumber": "21",
      "title": "Lies, Damn Lies and Statistics",
      "image": "https://m.media-amazon.com/images/M/MV5BMjE5MTQ2NzY2OV5BMl5BanBnXkFtZTgwMDExMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2000",
      "released": "10 May 2000",
      "plot": "The staff waits for a poll to tell them if their new, activist policies are moving them in the right direction. C.J. feels like her opinions are being discounted.",
      "imDbRating": "8.5",
      "imDbRatingCount": "1033"
    },
    {
      "id": "tt0745728",
      "seasonNumber": "1",
      "episodeNumber": "22",
      "title": "What Kind of Day Has It Been",
      "image": "https://m.media-amazon.com/images/M/MV5BMjEzMzE2NjAzNF5BMl5BanBnXkFtZTgwNDEyMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2000",
      "released": "17 May 2000",
      "plot": "A stealth fighter is shot down over Iraq, leading to Bartlet ordering a military rescue as Toby worries about his brother trapped on a space shuttle orbiting the Earth. CJ deals with the ramifications of misleading the press about the rescue as the staff prepares for a town hall meeting that night. The town hall meeting goes well until the President leaves...and shots ring out.",
      "imDbRating": "9.2",
      "imDbRatingCount": "1359"
    }
  ],
  "errorMessage": ""
}