{
  "imDbId": "tt0200276",
  "title": "The West Wing",
  "fullTitle": "The West Wing (TV Series 1999–2006)",
  "type": "TVSeries",
  "year": "1999",
  "episodes": [
    {
      "id": "tt0745660",
      "seasonNumber": "6",
      "episodeNumber": "1",
      "title": "N.S.F. Thurmont",
      "image": "https://m.media-amazon.com/images/M/MV5BNjQ1NzY4MjQ0OV5BMl5BanBnXkFtZTgwNjkwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "20 Oct. 2004",
      "plot": "Josh maintains a vigil beside Donna's bed in hospital, and needles Colin over his background and relationship with Donna. President Bartlet is determined to reject the unanimous demands of Congress, the American public, and his entire staff to retaliate for the roadside bombing. Leo tries to find a way to talk the President around while Kate tries various long-shot attempts at getting the Israelis and Palestinians to negotiate at Camp David.",
      "imDbRating": "8.0",
      "imDbRatingCount": "650"
    },
    {
      "id": "tt0745687",
      "seasonNumber": "6",
      "episodeNumber": "2",
      "title": "The Birnam Wood",
      "image": "https://m.media-amazon.com/images/M/MV5BMzE1OTUzNTMwNl5BMl5BanBnXkFtZTgwMDQwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "27 Oct. 2004",
      "plot": "Josh returns from Germany in time to voice concerns about Leo; the Israelis and Palenstinians meet at Camp David with little chance of an agreement; the President and Leo's differences over the Middle East crisis reach a breaking point.",
      "imDbRating": "8.3",
      "imDbRatingCount": "657"
    },
    {
      "id": "tt0745719",
      "seasonNumber": "6",
      "episodeNumber": "3",
      "title": "Third-Day Story",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU1OTg2OTM0N15BMl5BanBnXkFtZTgwNzYyMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "3 Nov. 2004",
      "plot": "Leo is found in the woods and rushed to the hospital; the staff struggle to hold the peace deal together without a Chief of Staff; the President neglects his duties out of loyalty and guilt towards Leo; Donna arrives back in the USA.",
      "imDbRating": "8.0",
      "imDbRatingCount": "605"
    },
    {
      "id": "tt0745651",
      "seasonNumber": "6",
      "episodeNumber": "4",
      "title": "Liftoff",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ4NzQ4MDQyNV5BMl5BanBnXkFtZTgwODExMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "10 Nov. 2004",
      "plot": "C.J.'s first day as Chief of Staff gives her a new appreciation for Leo's skill in the role. While struggling to keep up with her hectic schedule, she must handle the sudden appearance of abandoned Soviet nuclear material, counter political maneuvering within the Cabinet, and assert her authority with the staff and the President. Toby conducts a press briefing after which C.J. orders him to quickly find someone to fill the role permanently. The Democratic Party enlists Josh's help to talk Congressman Matt Santos out of taking an early retirement.",
      "imDbRating": "8.3",
      "imDbRatingCount": "644"
    },
    {
      "id": "tt0745695",
      "seasonNumber": "6",
      "episodeNumber": "5",
      "title": "The Hubbert Peak",
      "image": "https://m.media-amazon.com/images/M/MV5BMjEyNDkxMDA1NF5BMl5BanBnXkFtZTgwMDMyMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "17 Nov. 2004",
      "plot": "Josh visits a car dealership and is seduced by both a hybrid and a monster SUV, despite knowing that Congress is unlikely to raise fuel efficiency standards. For political cover as well as genuine concern, he meets with representatives of the alternative energy industries. Charlie has graduated from college and is reluctant to keep his promise to the President of finding a \"real\" job. Following press complaints about Toby he agrees to take deportment lessons from Annabeth. C.J. visits Leo at his hotel and finds out why he's so insistent that the President play chess ...",
      "imDbRating": "7.6",
      "imDbRatingCount": "596"
    },
    {
      "id": "tt0745692",
      "seasonNumber": "6",
      "episodeNumber": "6",
      "title": "The Dover Test",
      "image": "https://m.media-amazon.com/images/M/MV5BMTkyODYzNTQwMF5BMl5BanBnXkFtZTgwNTUwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "24 Nov. 2004",
      "plot": "The glow of the Middle East peace deal begins to fade once the hard reality of implementing change begins. Josh becomes involved in the Patient's Bill of Rights, which is becoming a political football as the Vice President and Congressman Santos both try to out-maneuver each other and the Republicans. C.J. continues to be unimpressed with Toby's performance as press secretary when he gets into a difficult position during a briefing. While working to recover from his heart attack, Leo receives a job offer from the corporate world.",
      "imDbRating": "7.6",
      "imDbRatingCount": "565"
    },
    {
      "id": "tt0745589",
      "seasonNumber": "6",
      "episodeNumber": "7",
      "title": "A Change Is Gonna Come",
      "image": "https://m.media-amazon.com/images/M/MV5BMTEyMzQ5NDczNjZeQTJeQWpwZ15BbWU4MDY4MTI2NTIx._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "1 Dec. 2004",
      "plot": "After spending months negotiating a difficult summit with China, Josh is dismayed to learn that the President accepted a flag symbolizing Taiwanese independence. Vice President Hoynes appears on television to promote his book and indicates a desire to return to politics. With the Iowa caucuses only a few months away, Vice President Russell and others begin positioning themselves to win the Democratic presidential nomination. President Bartlet finds tying his bow tie unexpectedly difficult.",
      "imDbRating": "7.7",
      "imDbRatingCount": "571"
    },
    {
      "id": "tt0745638",
      "seasonNumber": "6",
      "episodeNumber": "8",
      "title": "In the Room",
      "image": "https://m.media-amazon.com/images/M/MV5BMjEzNjE3ODIxOV5BMl5BanBnXkFtZTgwNTgwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "8 Dec. 2004",
      "plot": "Magicians Penn and Teller give a controversial performance at Zoey's birthday party in the White House that threatens to drown out the news of the impending China trip. President Bartlet goes to New Orleans on his way to China after unexpectedly requesting briefings be postponed until they are in the air. Josh tries to decide which Democratic presidential candidate he wants to support, and is alarmed that Bartlet wants to appoint California Republican Senator Arnold Vinick to be Ambassador to the United Nations.",
      "imDbRating": "8.3",
      "imDbRatingCount": "618"
    },
    {
      "id": "tt0745634",
      "seasonNumber": "6",
      "episodeNumber": "9",
      "title": "Impact Winter",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU5NjM5ODkwOV5BMl5BanBnXkFtZTgwMDkwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2004",
      "released": "15 Dec. 2004",
      "plot": "President Bartet's attack of multiple sclerosis requires hasty reorganization of the summit in China. Unable to endure the long meetings, he becomes frustrated when the Chinese take advantage of his absence to drag their feet over North Korea. Back at the White House, Josh is told by NASA that a large asteroid is on a collision course with earth; staffers are unsure whether to prepare for the end of the world or not. Donna becomes frustrated when Josh continually postpones what she says is an important conversation. With the New Hampshire primary looming and Vinick ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "626"
    },
    {
      "id": "tt0745619",
      "seasonNumber": "6",
      "episodeNumber": "10",
      "title": "Faith-Based Initiative",
      "image": "https://m.media-amazon.com/images/M/MV5BMTAwMDIxNzc1OTleQTJeQWpwZ15BbWU4MDA2MTI2NTIx._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "5 Jan. 2005",
      "plot": "On the same day that an anti-gay-marriage amendment is attached to the federal budget, an Internet rumor surfaces that C.J. is a lesbian. Josh and Toby attempt to kill the amendment without forcing the President to publicly take a position on this unwinnable issue. Congressman Santos considers Josh's proposition that he run for President despite having told his wife that he's done with politics. Donna begins her new job while Josh struggles to cope with her difficult replacement. Abby and C.J. meet with the President's doctors to decide how to adapt his schedule to ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "596"
    },
    {
      "id": "tt0745666",
      "seasonNumber": "6",
      "episodeNumber": "11",
      "title": "Opposition Research",
      "image": "https://m.media-amazon.com/images/M/MV5BMTUwMjgzMDA5OV5BMl5BanBnXkFtZTgwMDUwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "12 Jan. 2005",
      "plot": "Josh and Santos visit New Hampshire to launch the presidential campaign. Josh has experience running national campaigns and has a clear idea about what candidates should and shouldn't do to get elected, but Santos's approach differs dramatically: he believes in talking about big ideas rather than saying whatever he needs to do in order to win votes. This difference in opinion combined with conventional wisdom that says Santos has no chance of winning threaten to sink the campaign before it's begun. Will and Donna are also in New Hampshire, running Vice President Bob ...",
      "imDbRating": "7.8",
      "imDbRatingCount": "606"
    },
    {
      "id": "tt0745587",
      "seasonNumber": "6",
      "episodeNumber": "12",
      "title": "365 Days",
      "image": "https://m.media-amazon.com/images/M/MV5BMjA4NjE4MzEyOV5BMl5BanBnXkFtZTgwODgxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "19 Jan. 2005",
      "plot": "Leo returns to the White House to help bolster the administration, which is suffering from the loss of Josh, Donna, Will, and the Vice President to the next election campaign. Leo's first day back follows President Bartlet's last State of the Union address, and unlike in previous years there appears to be little momentum on bold, large-scale initiatives. Amidst numerous distractions that dilute the focus of the staff (kidnappings in Colombia, the First Lady's appearance at a NASCAR race, and petulant Congressmen), he challenges the administration on their agenda for ...",
      "imDbRating": "7.7",
      "imDbRatingCount": "572"
    },
    {
      "id": "tt0745646",
      "seasonNumber": "6",
      "episodeNumber": "13",
      "title": "King Corn",
      "image": "https://m.media-amazon.com/images/M/MV5BMjEzNjgwMjgxMF5BMl5BanBnXkFtZTgwNjExMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "26 Jan. 2005",
      "plot": "A day in the lives of presidential candidates Bob Russell, Matt Santos, and Arnold Vinick, who are in Iowa trying to gain support for their campaigns. Iowa is the first state in the nation to hold their presidential caucuses, and issues affecting farmers and rural areas are the focus. The most important issue on the table is the large federal subsidies for ethanol fuel given to corn growers, which is supported by Iowa residents but seen as naked pandering by the rest of the country. Josh continues to clash with Santos over winning votes instead of proposing radical ...",
      "imDbRating": "7.9",
      "imDbRatingCount": "637"
    },
    {
      "id": "tt0745712",
      "seasonNumber": "6",
      "episodeNumber": "14",
      "title": "The Wake Up Call",
      "image": "https://m.media-amazon.com/images/M/MV5BMjMxNTMxMTc3MF5BMl5BanBnXkFtZTgwMjUyMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "9 Feb. 2005",
      "plot": "CJ and Abbey go twelve rounds on how to handle President Bartlett and his disease. Lord Marbury makes his return to the White House after a British commercial plane gets shot down by Iran. Toby splits his time between helping write a Belarus constitution and the yearly meeting with Miss World",
      "imDbRating": "7.6",
      "imDbRatingCount": "608"
    },
    {
      "id": "tt0745621",
      "seasonNumber": "6",
      "episodeNumber": "15",
      "title": "Freedonia",
      "image": "https://m.media-amazon.com/images/M/MV5BMTUzODM3MzU2M15BMl5BanBnXkFtZTgwNzUxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "16 Feb. 2005",
      "plot": "Five days before the New Hampshire Democratic primary, the Santos campaign risks extinction as Matt has not been invited to the last debate. Josh proposes a number of strategies to get Santos into the debate, including deal-making, legal challenges, attack ads, and publicity stunts - but the Congressman is reluctant to play along. With Josh scrambling to keep the campaign alive, Santos calls in help from Washington to tune his message. Hoynes and Russell launch attack ads on each other's records, and Josh realizes that a desperate long-shot is needed to keep Santos in...",
      "imDbRating": "8.2",
      "imDbRatingCount": "595"
    },
    {
      "id": "tt0745610",
      "seasonNumber": "6",
      "episodeNumber": "16",
      "title": "Drought Conditions",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU4NjE5MDYyMV5BMl5BanBnXkFtZTgwNzIxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "23 Feb. 2005",
      "plot": "Back in Washington briefly, Josh visits the White House and is surprised to discover that as a campaign manager he is no longer part of the inner circle in an administration that wants to remain neutral in the Democratic primary. Toby is the focus of some concern after being more withdrawn than usual and also because he is nursing a cut on his face that he doesn't want to talk about. Charlie tells Kate that a guy at his gym has been asking about her, but she's unsure if she's ready to date again. A multi-state water rights fight pitches C.J. against lobbyist Cliff ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "655"
    },
    {
      "id": "tt0745590",
      "seasonNumber": "6",
      "episodeNumber": "17",
      "title": "A Good Day",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU5MDgxNDg0OV5BMl5BanBnXkFtZTgwNDcxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "2 Mar. 2005",
      "plot": "The Speaker of the House deliberately calls a vote on stem cell research when he knows that Democrats will be away from Washington; Donna, Cliff, Matt, and Josh must put aside their differences to foil the plan. Kate is shocked when a minor hunting mishap on the Canadian border threatens to become a major international incident. A Japanese economist who has been President Bartlet's arch-rival since college is attending a formal dinner at the White House, creating a potentially explosive situation. Toby tries to avoid meeting with a group of middle school children who ...",
      "imDbRating": "8.4",
      "imDbRatingCount": "665"
    },
    {
      "id": "tt0745647",
      "seasonNumber": "6",
      "episodeNumber": "18",
      "title": "La Palabra",
      "image": "https://m.media-amazon.com/images/M/MV5BODkyNjY3NDQxMl5BMl5BanBnXkFtZTgwMzMxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "9 Mar. 2005",
      "plot": "Hoynes and Russell are campaigning in New York, confident of their prospects in the California primary. Santos needs to do unexpectedly well in California in order to stay financially afloat; another third place finish will see his donors shift their money elsewhere, finishing his campaign. Santos's message of education and health care is overshadowed when California passes a law prohibiting drivers licenses for illegal immigrants. Despite the bill being widely supported by most voters, Matt cannot publicly endorse it as he's counting on the support of Latino voters, ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "588"
    },
    {
      "id": "tt0745662",
      "seasonNumber": "6",
      "episodeNumber": "19",
      "title": "Ninety Miles Away",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc3NTg1NzU5M15BMl5BanBnXkFtZTgwOTIwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "16 Mar. 2005",
      "plot": "Rumors circulate in Washington yet again about the state of Fidel Castro's health. As C.J. begins to look into the issue she uncovers some dark secrets regarding the United States' relationship with Cuba which appear to involve Leo, the President, and Kate Harper. Despite how closely guarded and potentially explosive this information is, a startlingly large number of government agencies and officials appear to know bits and pieces of the story. This results in undercover political maneuvering to avoid what is expected to be an enormous political disaster. Meanwhile, ...",
      "imDbRating": "7.1",
      "imDbRatingCount": "592"
    },
    {
      "id": "tt0745636",
      "seasonNumber": "6",
      "episodeNumber": "20",
      "title": "In God We Trust",
      "image": "https://m.media-amazon.com/images/M/MV5BMjM1NzkwNjI1NV5BMl5BanBnXkFtZTgwNzgwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "23 Mar. 2005",
      "plot": "Senator Arnold Vinick easily wins the Republican nomination on the night of the New Jersey primary, but has difficulty picking a running mate. Choosing Reverend Don Butler would virtually guarantee him the presidency, but their differing views on abortion and religion would make it a political union rather than one based on shared ideology. The Democratic nomination is a toss-up between Santos and Russell; Hoynes is running a distant third. With no clear nominee going into the convention, the Democratic party risks appearing unsure about both Santos and Russell - a ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "606"
    },
    {
      "id": "tt0745718",
      "seasonNumber": "6",
      "episodeNumber": "21",
      "title": "Things Fall Apart",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU5MTExNzYyMF5BMl5BanBnXkFtZTgwODYyMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "30 Mar. 2005",
      "plot": "While Vinick and the Republicans deliver a flawless albeit predictable convention, the Democratic convention looks to be more like a pie fight as there is no clear favorite. Russell tries to preempt the floor vote by hinting offers of the vice presidential nomination to both Santos and Governor Baker of Pennsylvania. Charlie and Zoey's relationship is becoming more serious, resulting in different reactions from the President and the First Lady. An air leak on the International Space Station will kill all three astronauts unless a rescue mission can be launched. NASA ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "576"
    },
    {
      "id": "tt0745586",
      "seasonNumber": "6",
      "episodeNumber": "22",
      "title": "2162 Votes",
      "image": "https://m.media-amazon.com/images/M/MV5BOTY3Nzg5MDc1N15BMl5BanBnXkFtZTgwOTgxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2005",
      "released": "6 Apr. 2005",
      "plot": "WHO WILL BE THE DEMOCRATIC PRESIDENTIAL CANDIDATE? - It's the Democratic National Convention and the race to become the Democratic Presidential candidate has narrowed to three candidates: Russell, Baker and Santos. Also, Bartlet must wrestle with the decision to launch the super-secret defense shuttle to rescue the astronauts trapped at the space station and risk national security or let them die.",
      "imDbRating": "8.9",
      "imDbRatingCount": "720"
    }
  ],
  "errorMessage": ""
}