{
  "imDbId": "tt0200276",
  "title": "The West Wing",
  "fullTitle": "The West Wing (TV Series 1999–2006)",
  "type": "TVSeries",
  "year": "1999",
  "episodes": [
    {
      "id": "tt0745644",
      "seasonNumber": "3",
      "episodeNumber": "1",
      "title": "Isaac and Ishmael",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU4MjE5NzcyNV5BMl5BanBnXkFtZTgwNzcwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "3 Oct. 2001",
      "plot": "The West Wing goes under lock down as a suspected terrorist is found to be working at the White House. Stuck with a group of high school students who were visiting the White House, the staffers, President Bartlet, and the First Lady all debate the issues regarding terrorism. Meanwhile, Leo sits in on the questioning of the terrorist suspect and learns a lesson about our perceptions of terrorists.",
      "imDbRating": "8.2",
      "imDbRatingCount": "1244"
    },
    {
      "id": "tt0745653",
      "seasonNumber": "3",
      "episodeNumber": "2",
      "title": "Manchester: Part I",
      "image": "https://m.media-amazon.com/images/M/MV5BNjA4MDU0MTQ2M15BMl5BanBnXkFtZTgwOTAxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "10 Oct. 2001",
      "plot": "The staff is hunkered down in the Bartlets' hometown of Manchester, N.H., where they work with political consultants Bruno, Doug and Connie on the president's official announcement that he'll be seeking a second term; meanwhile, they all lament various W.H. events of the previous four weeks, including a huge strategic mistake by Josh, a pivotal FDA announcement scheduled for the same day as the president's speech, an ongoing battle between then president and first lady, and a major press room gaffe by C.J.",
      "imDbRating": "8.1",
      "imDbRatingCount": "864"
    },
    {
      "id": "tt0745654",
      "seasonNumber": "3",
      "episodeNumber": "3",
      "title": "Manchester: Part II",
      "image": "https://m.media-amazon.com/images/M/MV5BMTc2Mjk5MzQ5N15BMl5BanBnXkFtZTgwMTExMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "17 Oct. 2001",
      "plot": "With the staff all bickering with one another in Manchester, especially adversarial speech writers Toby and Doug, who angrily disagree about whether Bartlet should make a public apology for lying about his MS, and with the president sniping at everyone, the second-term announcement speech is locked. Abby ultimately forgives the president for deciding to run again without discussing it with her, and he ultimately apologizes to the staff in private for keeping his condition from them, which they expect will soon lead to a whole slew of grand jury subpoenas.",
      "imDbRating": "8.1",
      "imDbRatingCount": "828"
    },
    {
      "id": "tt0745725",
      "seasonNumber": "3",
      "episodeNumber": "4",
      "title": "Ways and Means",
      "image": "https://m.media-amazon.com/images/M/MV5BMjEwMjgzODExOV5BMl5BanBnXkFtZTgwOTYyMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "24 Oct. 2001",
      "plot": "Special prosecutor Clem Rollins announces the grand jury subpoenas in the case of president's failure to disclose his MS to the public, and the list includes pretty much every West Wing staffer and Bartlet family member; Sam and Connie meet with an important Latino activist from Calif. who is considering supporting a primary challenger to Bartlet; C.J. convinces everyone that the special prosecutor is too reasonable, and that the W.H. needs a \"better enemy\" in the investigation, prompting the staff to provoke a Congressional inquiry.",
      "imDbRating": "7.8",
      "imDbRatingCount": "779"
    },
    {
      "id": "tt0745665",
      "seasonNumber": "3",
      "episodeNumber": "5",
      "title": "On the Day Before",
      "image": "https://m.media-amazon.com/images/M/MV5BMTU5NzA0OTg4NV5BMl5BanBnXkFtZTgwMTQwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "31 Oct. 2001",
      "plot": "While the W.H. is hosting a gala dinner for Nobel Prize winners, Leo and the president learn of a suicide bomb in an Israeli cafe that took the lives of two American students in Tel Aviv for a soccer match, and the staff attempts to manage the president's first veto, of a House bill eliminating the estate tax, and the threat of an override the same night. Sam and Toby first try to sway a contentious Dem. From Tennessee who wants a whole list of farming and ranching concessions in exchange for his vote and three proxies; after a pep talk from Leo, they devise a ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "757"
    },
    {
      "id": "tt0745724",
      "seasonNumber": "3",
      "episodeNumber": "6",
      "title": "War Crimes",
      "image": "https://m.media-amazon.com/images/M/MV5BMjE0ODgwMDM0Ml5BMl5BanBnXkFtZTgwMTcyMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "7 Nov. 2001",
      "plot": "After a fatal shooting in Texas, the president asks Hoynes to go down there and speak out for gun control, in spite of his history opposing it. Donna makes a gaffe in front of the Congressional committee. Leo argues with an old friend about the creation of an international war crimes tribunal.",
      "imDbRating": "8.0",
      "imDbRatingCount": "762"
    },
    {
      "id": "tt0745626",
      "seasonNumber": "3",
      "episodeNumber": "7",
      "title": "Gone Quiet",
      "image": "https://m.media-amazon.com/images/M/MV5BMjE0OTUwMzU1NV5BMl5BanBnXkFtZTgwNjMxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "14 Nov. 2001",
      "plot": "When the military loses contact with a submarine in hostile waters, the President must choose between risking the lives of the crew and provoking North Korea. CJ relishes the Majority Leader's flubbing of an interview. Babbish informs Abby that she is the weak link in the President's legal defense.",
      "imDbRating": "7.9",
      "imDbRatingCount": "760"
    },
    {
      "id": "tt0745696",
      "seasonNumber": "3",
      "episodeNumber": "8",
      "title": "The Indians in the Lobby",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ0MzQ4MTAyMV5BMl5BanBnXkFtZTgwNTIyMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "21 Nov. 2001",
      "plot": "On the day before Thanksgiving, CJ has to deal with two Stockbridge-Munsee Indians who won't leave the lobby until they get an answer on an application their tribe submitted 15 years ago. Josh tries to arrange the extradition of an underage boy whose parents sent him to Italy after he killed his teacher. The President learns why Abby wants to have Thanksgiving at Camp David this year, and places an anonymous call to the Butterball Hotline.",
      "imDbRating": "8.2",
      "imDbRatingCount": "818"
    },
    {
      "id": "tt0745717",
      "seasonNumber": "3",
      "episodeNumber": "9",
      "title": "The Women of Qumar",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ2NjQ0NjE5OV5BMl5BanBnXkFtZTgwOTUyMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "28 Nov. 2001",
      "plot": "CJ cannot control her outrage when the US agrees to an arms sale to Qumar, a country that brutally abuses women. Josh meets with Amy Gardner, a leading women's group lobbyist. The content of a Smithsonian exhibit draws protest from a veteran's group. Leo and the President discuss options when the possibility of a Mad Cow infection strikes the US beef industry.",
      "imDbRating": "8.0",
      "imDbRatingCount": "809"
    },
    {
      "id": "tt0745599",
      "seasonNumber": "3",
      "episodeNumber": "10",
      "title": "Bartlet for America",
      "image": "https://m.media-amazon.com/images/M/MV5BNTQ0MDg0MTQwM15BMl5BanBnXkFtZTgwMDQxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2001",
      "released": "12 Dec. 2001",
      "plot": "In an episode dotted with flashbacks, Leo and his attorney Jordon Kendall (Joanna Gleason) face a Congressional inquiry into whether the president lied to the American people regarding his MS, but this particular day of hearings concerns itself more with Abby and her secretly medicating Jed, and later with Leo's having fallen off the wagon during the campaign (a politically motivated Republican rep on the committee witnessed Leo drunk in his room three days before the nomination); we see the meeting in which Leo talked N.H. Governor Bartlet into running for president,...",
      "imDbRating": "9.1",
      "imDbRatingCount": "1074"
    },
    {
      "id": "tt0745628",
      "seasonNumber": "3",
      "episodeNumber": "11",
      "title": "H. Con-172",
      "image": "https://m.media-amazon.com/images/M/MV5BMjMyMTgzNjA2MV5BMl5BanBnXkFtZTgwNDQxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "9 Jan. 2002",
      "plot": "In a private, late-night meeting, Cliff Calley informs Leo and Jordon he has negotiated a settlement in the Congressional witch hunt over Bartlet's MS: Bartlet can accept a joint congressional censure (House Concurrent Resolution 172, or H.Con. 172); Leo initially refuses to bring it to the president, insisting it will devastate the president and affect him for the rest of his life, but he does mull it over, and consults with Josh and repeatedly with Jordon about it; Josh begins his romantic pursuit of women's issues advocate Amy Gardner, but flubs it a couple of ...",
      "imDbRating": "8.1",
      "imDbRatingCount": "759"
    },
    {
      "id": "tt0745580",
      "seasonNumber": "3",
      "episodeNumber": "12",
      "title": "100,000 Airplanes",
      "image": "https://m.media-amazon.com/images/M/MV5BMjI3MDM2MjQxMV5BMl5BanBnXkFtZTgwOTYxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "16 Jan. 2002",
      "plot": "On the night of the State of the Union, Sam has to explain the process of writing the speech and grading reaction to it to a magazine reporter (Traylor Howard) throughout the evening; C.J. arranged the coverage aware that the reporter, Lisa Sherbourn, is Sam's ex-fiancée; flashing back to the speechwriting process, we see the president dining with several of Abbey's medical colleagues, and they ponder the future of cancer research, motivating Bartlet to ask that a section be added to the SOTU in which he calls for U.S. scientists to find a cancer cure by 2012; the ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "1093"
    },
    {
      "id": "tt0745710",
      "seasonNumber": "3",
      "episodeNumber": "13",
      "title": "The Two Bartlets",
      "image": "https://m.media-amazon.com/images/M/MV5BMjEyMjMyNDUyNV5BMl5BanBnXkFtZTgwNzUyMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "30 Jan. 2002",
      "plot": "Toby is concerned when President Bartlett forgoes an opportunity to speak out in favor of affirmative action during the Iowa caucuses and confronts the President on the real reasons underlying his Dr. Jekyl & Uncle Fluffy personality shifts. Meanwhile Josh makes plans for a vacation with Amy and then must cancel them.",
      "imDbRating": "7.9",
      "imDbRatingCount": "758"
    },
    {
      "id": "tt0745661",
      "seasonNumber": "3",
      "episodeNumber": "14",
      "title": "Night Five",
      "image": "https://m.media-amazon.com/images/M/MV5BODUzNTA0OTU1Nl5BMl5BanBnXkFtZTgwNjAxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "6 Feb. 2002",
      "plot": "Josh covertly brings a psychiatrist to the white house to meet with the President who has been unable to sleep for five days.",
      "imDbRating": "8.2",
      "imDbRatingCount": "830"
    },
    {
      "id": "tt0745630",
      "seasonNumber": "3",
      "episodeNumber": "15",
      "title": "Hartsfield's Landing",
      "image": "https://m.media-amazon.com/images/M/MV5BMTUyNjg4MDI3Nl5BMl5BanBnXkFtZTgwNTkwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "27 Feb. 2002",
      "plot": "A small town in N.H. is the site of the first presidential primary vote, and the results from Hartsfield's Landing, announced at 12:07 a.m., will dominate the news all day until the final tally. Josh wants favorable press for the president, prompting him to ask Donna to persuade a local couple she knows to reconsider their vote. Elsewhere, Bartlet has just returned from India with a collection of antique chess sets he gives as gifts to the staff. He plays Toby while they discuss their recent blow-up, Bartlet's insomnia and Toby's fervent belief that the president's ...",
      "imDbRating": "8.5",
      "imDbRatingCount": "845"
    },
    {
      "id": "tt0745606",
      "seasonNumber": "3",
      "episodeNumber": "16",
      "title": "Dead Irish Writers",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ1NzIzNjk5Ml5BMl5BanBnXkFtZTgwNjIxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "6 Mar. 2002",
      "plot": "A lavish W.H. party for Abbey's birthday the night before a N.H. medical board begins hearings on whether to suspend her license over her secret treatment of her husband's MS. Abbey returns to the residence with C.J. and Amy Gardener to get blitzed on wine and discuss her concerns about her medical career. Donna is restricted from joining the party because a decades-old cartography error puts her birthplace in Canada. Toby and U.K. Ambassador Lord John Marbury (Roger Rees) go to a nearby bar to share a bottle of very rare Scotch and to discuss a planned W.H. visit by ...",
      "imDbRating": "8.2",
      "imDbRatingCount": "801"
    },
    {
      "id": "tt0745711",
      "seasonNumber": "3",
      "episodeNumber": "17",
      "title": "The U.S. Poet Laureate",
      "image": "https://m.media-amazon.com/images/M/MV5BMTQ5ODY5MTIxMV5BMl5BanBnXkFtZTgwNTUyMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "27 Mar. 2002",
      "plot": "Poet laureate Tabitha Fortis visits D.C. to attend a White House dinner in her honor, and Toby develops a bit of a crush on her, but he also must admonish the somewhat flighty beauty against publicly criticizing the president for his refusal to sign an international anti-land mine treaty; Donna discovers a website devoted to Josh, and he soon becomes sucked into the online chat about his activities and ego; speaking via remote to a local morning show in Philadelphia and unaware that the mike is on, Bartlet makes a stray comment impugning opponent Robert Richie's ...",
      "imDbRating": "8.0",
      "imDbRatingCount": "773"
    },
    {
      "id": "tt0745680",
      "seasonNumber": "3",
      "episodeNumber": "18",
      "title": "Stirred",
      "image": "https://m.media-amazon.com/images/M/MV5BMjIyNDgyNjcxM15BMl5BanBnXkFtZTgwODYwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "3 Apr. 2002",
      "plot": "On a typical night in the west wing, Sam returns from a hockey game and Josh asks him to meet with V.P. Hoynes about saving an education bill. Back at the W.H., Josh, Toby, Leo, C.J., Larry and Ed all meet about the prospect of replacing Hoynes on the ticket in the next campaign. Bartlet helps Charlie do his federal taxes, and while both think Charlie should expect a refund, thanks to last year's so-called economic stimulus, he instead owes money to the IRS. A security emergency occurs when two trucks, one stolen and containing nuclear waste, crash in a tunnel in ...",
      "imDbRating": "8.3",
      "imDbRatingCount": "739"
    },
    {
      "id": "tt0745616",
      "seasonNumber": "3",
      "episodeNumber": "19",
      "title": "Enemies Foreign and Domestic",
      "image": "https://m.media-amazon.com/images/M/MV5BMjQwNTAwNTc0NV5BMl5BanBnXkFtZTgwMDUxMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "1 May 2002",
      "plot": "A meeting with the new Russian president becomes politically dangerous when surveillance photos show Russia building a nuclear reactor in Iran. C.J. is assigned Secret Service protection after receiving death threats.",
      "imDbRating": "8.4",
      "imDbRatingCount": "782"
    },
    {
      "id": "tt0745688",
      "seasonNumber": "3",
      "episodeNumber": "20",
      "title": "The Black Vera Wang",
      "image": "https://m.media-amazon.com/images/M/MV5BMTExOTMyNjA4NzZeQTJeQWpwZ15BbWU4MDc1MDI2NTIx._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "8 May 2002",
      "plot": "The President and Leo deal with reports of a planned terrorist attack, but more shocking is who is behind it. Sam receives an anonymous package with bad implications for the campaign. C.J. chafes under her Secret Service protection.",
      "imDbRating": "8.1",
      "imDbRatingCount": "769"
    },
    {
      "id": "tt0745726",
      "seasonNumber": "3",
      "episodeNumber": "21",
      "title": "We Killed Yamamoto",
      "image": "https://m.media-amazon.com/images/M/MV5BMTkyMjg0MDA3NF5BMl5BanBnXkFtZTgwMTEyMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "15 May 2002",
      "plot": "Bartlet and Leo debate on how to deal with the impending visit of the Qumari Defense Minister, whom U.S. intelligence officers have conclusively linked to terrorists. Sam dismisses an ingenious idea to trap Republican presidential opponent Robert Ritchie in an unsavory position over the Everglades, but comes around after talking to Toby. C.J. begins to develop a relationship with Secret Service agent assigned to her, Simon Donovan. Josh and Amy are locked into a battle over a welfare reform bill, which could end their relationship.",
      "imDbRating": "8.3",
      "imDbRatingCount": "766"
    },
    {
      "id": "tt0745668",
      "seasonNumber": "3",
      "episodeNumber": "22",
      "title": "Posse Comitatus",
      "image": "https://m.media-amazon.com/images/M/MV5BMjAyNTE0MjQxMF5BMl5BanBnXkFtZTgwNjUwMjY1MjE@._V1_Ratio1.7778_AL_.jpg",
      "year": "2002",
      "released": "22 May 2002",
      "plot": "Bartlet, Leo, Sam, Toby, and C.J. travel to New York City for a Catholic fund raiser at a long Broadway play called \"The War of the Roses\". Josh steps up his efforts to beat his girlfriend, Amy, in their struggle over the welfare reform bill, which leads to her forced resignation. C.J. and Secret Service agent Simon Donavon have grown closer, but a tragic event cuts short their relationship. At the play, Bartlet comes face to face with Republican Presidential candidate Rob Ritchie and faces the decision of whether or not to assassinate the Qumari Defense Minister.",
      "imDbRating": "9.0",
      "imDbRatingCount": "1162"
    }
  ],
  "errorMessage": ""
}