{
  "imDbId": "tt0268093",
  "title": "Ramayan",
  "fullTitle": "Ramayan (TV Series 1987–1988)",
  "type": "TVSeries",
  "year": "1987",
  "items": [
    {
      "username": "DrEbert",
      "userUrl": "https://www.imdb.com/user/ur0763433",
      "reviewLink": "https://www.imdb.com/review/rw1849483",
      "warningSpoilers": false,
      "date": "30 March 2008",
      "rate": "10",
      "helpful": "98 out of 111 found this helpful.",
      "title": "It brought India to a standstill!",
      "content": "When \"Ramayan\" aired, India (even then having a population over 900 million) came to a standstill. Buses stopped running, religious services (Hindu and non-Hindu) were rescheduled, and everyone stopped what they were doing for 30 minutes every Sunday morning to watch the ancient Indian epic brought to life on television. It's hard to believe that something like that is possible, but it really happened. Despite being dismissed by some as a cheap production with garish sets, cheesy special effects, and melodramatic dialogue, \"Ramayan\" was and continues to be a phenomenon.True, the production is quite obviously very low budget and it shows in the special effects and sets. (Tollywood director Bapu's \"Seeta Kalyanam\" a.k.a. \"Seeta Swayamvar\" shows a much better production, even though it, too, was low-budget.) Some of the same actors are used repeatedly for various minor roles and voices. At times, it does look like a high school production. But, what Ramanand Sagar (who, in my opinion, is otherwise a mediocre filmmaker) has done here is spectacular. Despite all of the above, \"Ramayan\" works incredibly well because one can sense that a great deal of devotion went into making it. This is a series that really has a heart and soul. Every time I watch \"Ramayan,\" I have a religious experience.The dialogue might sound melodramatic to some (and sometimes it is), but the script is extremely faithful to the original texts that it is based off of. Sometimes, lines are directly quoted from Valmiki or Tulsidas and translated into Hindi. \"Ramayan\" takes very little dramatic license and so what is presented on screen is an accurate presentation of the source texts. This gives \"Ramayan\" value not only to devout Hindus but also to students of Hindu religion and Indian epic poetry, both of whom can watch the series and get a good understanding of the works of Valmiki, Tulsidas, and others. The feeling conveyed in the television series is the feeling conveyed from a recital of the epic itself.What also helps this series tremendously is the music by Ravindra Jain. Indian storytelling in general (both in film and in religious sermons) has a tradition of mixing dialogue with songs. Here, Ravindra Jain uses music to its fullest advantage. There are plenty of songs throughout the series, but they are placed in perfect situations. This is not the typical Bollywood style of breaking into song and dance at random and inappropriate places. Instead, rather than boring the audience with a long battle scene filled with cheap special effects, the battle is shown with a song describing the battle. Scenes of devotion naturally have devotional music with them. Transition scenes are accompanied by lines of Tulsidas. In fact, Jain sometimes cleverly and seamlessly merges his own lyrics with the poetry of Tulsidas, creating songs that are modern masterpieces of music.I'm generally satisfied with the casting choices. Arun Govil and Deepika do well as Rama and Sita. Dara Singh is not an incredibly talented actor (he is originally a wrestler), but it worked for me to have him as Hanuman. My three favorite performances, though, are Sunil Lahri as Lakshmana (he's got Lakshmana's angry look down perfectly), Vijay Arora as Indrajit (he's got the boisterous personality down), and veteran character actress Lalita Pawar as Manthara (a perfect choice, as Pawar made a career out of playing literally hundreds of Manthara-like characters). Arvind Trivedi is not bad as Ravana, but he does not have the physically dominating presence that Ravana would need to have. Ravana should be tall, dark, muscular, and handsome, and Trivedi is none of those things. Still, not a bad performance on his part. (As an aside, the single worst casting choice is the actor picked to play Parshurama in one episode early on in the series; they picked somebody less than 5 feet tall to play a domineering character and it completely doesn't work.)We tend to put all of that aside, though, because of just how well the story works for us. \"Ramayan\" made religion fashionable on Indian television. This is why some scholars list Ramanand Sagar (who, I reiterate, was an otherwise mediocre filmmaker) as one of 4 men (along with Valmiki, Tulsidas, and Kamban) who has shaped modern interpretations of the Ramayana story. That is quite an achievement, to be one of the four main forces that guide a tradition that dates back thousands of years, all on a budget (I'm told) of Rs. 100,000 per episode.Really, I've already said more than needs to be said. All that really needs to be said is that \"Ramayan\" brought India to a STANDSTILL!"
    },
    {
      "username": "nitin_raj1989",
      "userUrl": "https://www.imdb.com/user/ur67650320",
      "reviewLink": "https://www.imdb.com/review/rw5591581",
      "warningSpoilers": false,
      "date": "30 March 2020",
      "rate": "10",
      "helpful": "18 out of 21 found this helpful.",
      "title": "Epic episode remind childhood",
      "content": "We used to sit with family and watch now this serial started again in the lock down of india and same we are sitting and watching, what a lovely moment. Coming to ramcharitmanas version, many tried to do but this never created again. All character are masterpiece. Thanks to ramanand sagar and team"
    },
    {
      "username": "vipin88",
      "userUrl": "https://www.imdb.com/user/ur19492939",
      "reviewLink": "https://www.imdb.com/review/rw2661005",
      "warningSpoilers": false,
      "date": "19 August 2012",
      "rate": "10",
      "helpful": "36 out of 43 found this helpful.",
      "title": "Its not about Religion but about moral values",
      "content": "I saw this series in my childhood and could associate myself only from the religious point of view . Now that I am aware of a little bit working of this world , when I am watching this series again on DVD , I can understand why Ramayana as a epic is so relevant in modern times . It gives a message of love, peace , harmony and dutifulness with the right dose of righteousness in all our actions . The narrative is simple and the characters very true to life .Most of us in India at least understand religion as a sacred duty and not in day to day affairs of life , which ideally it should be. This series , had for the first time explained , with warmth the importance and fun to be righteous and humble in every sphere of daily life . Whoever wishes to improve his life a little more must see and understand from Ramayana."
    },
    {
      "username": "harshitnayan",
      "userUrl": "https://www.imdb.com/user/ur115759532",
      "reviewLink": "https://www.imdb.com/review/rw5599749",
      "warningSpoilers": false,
      "date": "2 April 2020",
      "rate": "10",
      "helpful": "26 out of 32 found this helpful.",
      "title": "A classic masterpiece",
      "content": "The re telecast of this series certainly once again affirms the belief that this show is a truly an amazing creation with a perfect blend of acting, screenplay, music. The verses from Ramcharitamanas have also been used at the most suitable points.It will continue to hold the title of best Ramayan ever adapted on screen"
    },
    {
      "username": "abtheboss",
      "userUrl": "https://www.imdb.com/user/ur80370095",
      "reviewLink": "https://www.imdb.com/review/rw5588323",
      "warningSpoilers": false,
      "date": "29 March 2020",
      "rate": "",
      "helpful": "21 out of 28 found this helpful.",
      "title": "Best adaption of one of the greatest epics in the world",
      "content": "Sagar's original Ramayana was literally brilliant. The show had ensemble cast. Everyone just nailed it in their respective roles. But my favorite performance was Sunil Lahri's performance as Lakshman. I think no one has given such an impressive performance in Laxman's character till date. What can I say about Arvind Trivedi's performance as Ravana? He just nailed it. Arun Govil and Dipika will remain Godly figures for people. But above all big thanks to late Ramanand Sagarji for creating this Gold.Doesn't matter how many versions of Ramayana will come but this Ramayan will remain Gold. If you are fan of Mythological/Devotional shows than you will never get bored of watching Sagar's Ramayan and B.R. Chopra's Mahabharat."
    },
    {
      "username": "ups-36964",
      "userUrl": "https://www.imdb.com/user/ur90946878",
      "reviewLink": "https://www.imdb.com/review/rw5883284",
      "warningSpoilers": true,
      "date": "5 July 2020",
      "rate": "9",
      "helpful": "4 out of 4 found this helpful.",
      "title": "Jai Shree Ram",
      "content": "The best serial on Ramayana. The acting of Ram, Sita, Lakshman and Hanuman were the best. The only flaw is that it's too slow and boring and also VFX is very bad, as compared to Mahabharata by BR Chopra. Other than that, do encourage youngsters to watch this and know more about our Dharma, our ancient Bharath, our Aryavarta Jai Shree Ram."
    },
    {
      "username": "rupanisp",
      "userUrl": "https://www.imdb.com/user/ur1374657",
      "reviewLink": "https://www.imdb.com/review/rw0777748",
      "warningSpoilers": false,
      "date": "30 September 2001",
      "rate": "",
      "helpful": "19 out of 28 found this helpful.",
      "title": "Very Very Excellent !!!",
      "content": "His Holiness, His Divine Grace, Maharishi Ramanand Sagar has done excellent job.From all the characters in the epic, I like His Divine Grace Ram and Her Divine Grace Sita.I would like to add that in reality Ram or sita could not have been better than they appear in epic.Thank you very much for your kind considerations.With Very Best Regards."
    },
    {
      "username": "mrdeezer",
      "userUrl": "https://www.imdb.com/user/ur37476705",
      "reviewLink": "https://www.imdb.com/review/rw2820983",
      "warningSpoilers": false,
      "date": "27 June 2013",
      "rate": "10",
      "helpful": "21 out of 31 found this helpful.",
      "title": "A Great show on Real Events",
      "content": "Ramanand sagar's Sampoorna Ramayana is the best show on Ramayana ever. I liked this show a lot. It has the best presentation of Bhagwan Shri Ramchandra Ji. If you love devotion then you must watch this show. This show must broadcast worldwide with regional languages. The Bhajans in the show increases devotion. This show was made in 80's but the animation and visual effects looks realistic. The acting is superb and script too. The show left an impact on our society. Ramanand Sagar tried his best to bring best presentation of Shri Valmiki's Ramayana. Everyone must buy the DVD of this show if he likes show's on real events. It is world's most viewed show."
    },
    {
      "username": "dr-rohitsharma21",
      "userUrl": "https://www.imdb.com/user/ur38312216",
      "reviewLink": "https://www.imdb.com/review/rw5595073",
      "warningSpoilers": false,
      "date": "31 March 2020",
      "rate": "10",
      "helpful": "18 out of 23 found this helpful.",
      "title": "Must watch",
      "content": "This show is masterpiece and is recommended to each and everyone. Thankful to makers of the show that we were witness of the era."
    },
    {
      "username": "cseabhi",
      "userUrl": "https://www.imdb.com/user/ur58232116",
      "reviewLink": "https://www.imdb.com/review/rw5609013",
      "warningSpoilers": false,
      "date": "5 April 2020",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Epic story of humanity and moral values",
      "content": "I watched this show as a kid, re watched this several times on DVDs, and now watching it again because Doordarshan is bringing this show back to TV.This is by far the bestest adaptation of Ramayana on Indian Television. Those days technical aspects were limited but then also Ramamand Sagar made a masterpiece.The portray of Arun Govil as Ram was the masterstroke. For almost all the Indian, Arun Govil symbolises Ram. His smile, his every expression is so pure and calm, Its as if you are seeing the real Ram on screen. The portray of Dipika and Sunil Lahrii as Sita and Laxman were also spot on. Dara Singh as Hanuman was a epic choice. He fits brilliantly in the role of Hanuman.The script and all the dialouges, the shlokas are extremely faithful to the original Ramayana and every efforts have been made the story sticks to originality.One of the other main highlights of the show is the music by Ravindra Jain. He is just brilliant in this department. All the songs, bhajanas are so soulful and divine.This series is a collective effort of brilliant direction, dedicated team work, brilliant acting by almost all the lead actors, great music and story with full conviction.Ramayana stands out as one of the greatest story ever told."
    },
    {
      "username": "sharmambd",
      "userUrl": "https://www.imdb.com/user/ur115421252",
      "reviewLink": "https://www.imdb.com/review/rw5584312",
      "warningSpoilers": false,
      "date": "28 March 2020",
      "rate": "10",
      "helpful": "14 out of 17 found this helpful.",
      "title": "Best demonstration of human character",
      "content": "Rama, was such a figure who never went out of the limit. Even he maintained dharma, in even bad and worse time.This is great learning for the world to understand that in any worse situation, we should not loss control and should not be self centric..."
    },
    {
      "username": "subhashu",
      "userUrl": "https://www.imdb.com/user/ur112407253",
      "reviewLink": "https://www.imdb.com/review/rw5590038",
      "warningSpoilers": false,
      "date": "30 March 2020",
      "rate": "10",
      "helpful": "13 out of 16 found this helpful.",
      "title": "Superb",
      "content": "Superb, Amazing Enjoying the Ramayana with family Bachpan ki yaaden"
    },
    {
      "username": "ixtab9",
      "userUrl": "https://www.imdb.com/user/ur2840145",
      "reviewLink": "https://www.imdb.com/review/rw0777751",
      "warningSpoilers": false,
      "date": "12 December 2003",
      "rate": "",
      "helpful": "14 out of 24 found this helpful.",
      "title": "Worth checking out for anyone who loves mythology!",
      "content": "This lengthy television adaptation of THE RAMAYANA is entertaining as long as the viewer has a working familiarity with Hindu mythology and is patient enough to enjoy the liesurely pace. I don't think it's likely to win over anyone who comes to the material cold or who comes to it expecting Spielberg-level special effects.It's refreshing to see a visual realization of something other than Graeco-Roman mythology since, fascinating as that subject is, it's already gotten sizeable exposure in movies and on television. Rama and Sita come alive nicely in this production and unsurprisingly Hanuman manages to steal a few scenes. The style is faithful to the original epic so anyone who loves the story doesn't have to fear that it's been transformed into a slam-bang all-action blockbuster."
    },
    {
      "username": "armaandhakad",
      "userUrl": "https://www.imdb.com/user/ur76997205",
      "reviewLink": "https://www.imdb.com/review/rw5596321",
      "warningSpoilers": false,
      "date": "1 April 2020",
      "rate": "10",
      "helpful": "14 out of 20 found this helpful.",
      "title": "It's beyond the ratings",
      "content": "To be honest 'This is what be came for' isse acha historical serial apko nae milega this is it."
    },
    {
      "username": "MuviFan73",
      "userUrl": "https://www.imdb.com/user/ur57213624",
      "reviewLink": "https://www.imdb.com/review/rw6875748",
      "warningSpoilers": false,
      "date": "3 May 2021",
      "rate": "",
      "helpful": "2 out of 2 found this helpful.",
      "title": "family show!",
      "content": "Childhood memories: other children found it boring, I watched it with thirst along with my family.There was hardly any episode i missed.It stayed true to its time.Although waiting for a brand new make."
    },
    {
      "username": "prashantku-34214",
      "userUrl": "https://www.imdb.com/user/ur95844147",
      "reviewLink": "https://www.imdb.com/review/rw5609457",
      "warningSpoilers": false,
      "date": "5 April 2020",
      "rate": "10",
      "helpful": "6 out of 9 found this helpful.",
      "title": "All characters are best in their roles",
      "content": "Best Ramayan made till date in History of Indian entertainment history. Everyone should watch it."
    },
    {
      "username": "tp-marshallmathers",
      "userUrl": "https://www.imdb.com/user/ur35197098",
      "reviewLink": "https://www.imdb.com/review/rw5605969",
      "warningSpoilers": false,
      "date": "4 April 2020",
      "rate": "10",
      "helpful": "4 out of 5 found this helpful.",
      "title": "Flawlessly Made !! And it's our HISTORY NOT MYTHOLOGY!!",
      "content": "This is by far the best TV series created by Ramanand Sagar ji. You just can't get tired of watching it, No matter how many times you watch it, you will always get satisfaction, and new knowledge/wisdom every time. Our rich History is forgotten by people nowadays, every household used to watch this and people today should also watch this, show it to our new generation so that they don't forget our rich culture and history. And stay connected to the roots of our beautiful country. Bharat"
    },
    {
      "username": "samyaksambuddha",
      "userUrl": "https://www.imdb.com/user/ur85477871",
      "reviewLink": "https://www.imdb.com/review/rw4139889",
      "warningSpoilers": false,
      "date": "23 April 2018",
      "rate": "9",
      "helpful": "4 out of 6 found this helpful.",
      "title": "Old is gold",
      "content": "Who has not heard of the epic series of the epic Ramayana. Celebrated series of its time is still a gem. The roles of Rama by Arun Govil and Sita by Deepika was still mentioned now and then. A great watch for lovers of mythology and religion. This series is a culmination of ethics and fantasy. A great educator and entertainer."
    },
    {
      "username": "bhargavaaniroodh",
      "userUrl": "https://www.imdb.com/user/ur115385774",
      "reviewLink": "https://www.imdb.com/review/rw5582601",
      "warningSpoilers": false,
      "date": "27 March 2020",
      "rate": "10",
      "helpful": "12 out of 16 found this helpful.",
      "title": "JAI SHREE RAM",
      "content": "Sampoorn ramayan by ramanand sagar made my childhood filled with moral values , faith and ethics . this is a must watch series which can be watched by every age groups . It helps to filter the way of aproach to a problem and shows the right way to deal with it .No matter what PRABHU SHRI RAM always is an ideal potrait of MAN . Characters like ravan meghnaad have made their best in showing how greed changes a King to nothing .."
    },
    {
      "username": "agrawalanupam",
      "userUrl": "https://www.imdb.com/user/ur58145207",
      "reviewLink": "https://www.imdb.com/review/rw3169322",
      "warningSpoilers": false,
      "date": "24 January 2015",
      "rate": "10",
      "helpful": "31 out of 42 found this helpful.",
      "title": "Classic - best version of Ramayan ever made",
      "content": "Ramanand Sagar researched many versions of the countless Ramayan written by countless poets in the journey to produce this masterpiece. This version of the Ramayan is mainly based on Goswami Tulsidas Shree Ramcharitmanas. Even after almost 30 years and many follow-on versions and attempts by others, the depiction and narration by Ramanand Sagar is on a different plane. The music, visuals and singers are all enchanting due to the innocence and the type of cinema of the 1980s. Ramanand Sagar managed to extract near perfect performances from all the characters of his cast. Thank you to Ramanand Sagar for producing this masterpiece."
    },
    {
      "username": "ixtab9",
      "userUrl": "https://www.imdb.com/user/ur2840145",
      "reviewLink": "https://www.imdb.com/review/rw0777750",
      "warningSpoilers": false,
      "date": "11 December 2003",
      "rate": "",
      "helpful": "6 out of 10 found this helpful.",
      "title": "Worth checking out for anyone who loves mythology!",
      "content": "This lengthy television adaptation of THE RAMAYANA is entertaining as long as the viewer has a working familiarity with Hindu mythology and is patient enough to enjoy the liesurely pace. I don't think it's likely to win over anyone who comes to the material cold or who comes to it expecting Spielberg-level special effects.It's refreshing to see a visual realization of something other than Graeco-Roman mythology since, fascinating as that subject is, it's already gotten pretty sizeable exposure in movies and on television. Rama and Sita come alive nicely in this production and unsurprisingly Hanuman manages to steal a few scenes. The style is faithful to the original epic so anyone who loves the story doesn't have to fear that it's been transformed into a slam-bang all-action blockbuster."
    },
    {
      "username": "ghoshjibanananda",
      "userUrl": "https://www.imdb.com/user/ur115411334",
      "reviewLink": "https://www.imdb.com/review/rw5583952",
      "warningSpoilers": false,
      "date": "28 March 2020",
      "rate": "10",
      "helpful": "8 out of 10 found this helpful.",
      "title": "All time Favorite....",
      "content": "Ramayana is one of best serial ever broadcasted in India and the world. It's created the blueprint of of Many Many successful and popular serial today. Ramayana is full of moral and necessary knowledge which needs today's world. I can remember those days when I only 3 years. My mother took me with her to watch this serial in a neighbor's house at Asansol, West Bengal. Even today I used to watch this serial's particular episode when feel depressed and tense. I think that everyone should watch this serial at least once in his/her life"
    },
    {
      "username": "divyanka",
      "userUrl": "https://www.imdb.com/user/ur58907622",
      "reviewLink": "https://www.imdb.com/review/rw4637064",
      "warningSpoilers": false,
      "date": "10 February 2019",
      "rate": "9",
      "helpful": "6 out of 11 found this helpful.",
      "title": "The Most Excellent Series of History Ever Made",
      "content": "Ramanand Sagar's Ramayana is absolutely stunning and wonderful in every way. The acting, the scripting, the calm and peaceful pace at which life should run, is all included in this wonderful Ramayana. The actors have done such a good job that one can relate the real people of Treta Yuga to these characters and see them in the characters. The absolute height of religious and Godly devotion is portrayed with such utter perfection that no words can describe how wonderful the viewing experience is. It is a lengthy and detailed series with accurate information (for the most part, as can be assumed) and there are many episodes for one to enjoy.9/10"
    },
    {
      "username": "cydenar",
      "userUrl": "https://www.imdb.com/user/ur110522782",
      "reviewLink": "https://www.imdb.com/review/rw5585372",
      "warningSpoilers": false,
      "date": "28 March 2020",
      "rate": "10",
      "helpful": "6 out of 9 found this helpful.",
      "title": "Few shows are made exactly perfect, Ramayan tops this list",
      "content": "(This review is written after the starting of re-telecast during the lockdown of corona virus) Ramayan stands beyond par of a television show. Being a mythological story on popular Hindu belief, it embodied the character to such a level that the actors lost their identity in real life. In comparison to the age of GOT, Black Mirror & Breaking Bad where we see fandom to the extreme, people in the era of Ramayan actually started worshipping the actors, putting their pictures besides deity idols. I have seen the age from CRT box to the digital and have never seen anything as awestrucking as the Ramayan. It had the power to bring a nation at standstill. The CGI might be age old and it is not only to entertain you, it might help you tap into the better personality inside you, It might help you answer some psychological questions which you always wanted the answer of but never knew what to ask. Of course remake were tried but it is truly said \"some masterpiece are not meant to be recreated\"."
    },
    {
      "username": "ankushpratap",
      "userUrl": "https://www.imdb.com/user/ur89236523",
      "reviewLink": "https://www.imdb.com/review/rw5595374",
      "warningSpoilers": false,
      "date": "31 March 2020",
      "rate": "10",
      "helpful": "15 out of 19 found this helpful.",
      "title": "Best possible adaptation",
      "content": "This was by far the best adaptation of Ramcharitra Manas. The cast was apt. Arun Govil as Lord Rama was great. His smile and expressions were enough to create the magic and persona of Lord Ram."
    }
  ],
  "errorMessage": ""
}