{
  "imDbId": "tt0268093",
  "title": "Ramayan",
  "fullTitle": "Ramayan (TV Series 1987–1988)",
  "type": "TVSeries",
  "year": "1987",
  "language": "en",
  "titleInLanguage": "Ramayan (1987 TV series)",
  "url": "https://en.wikipedia.org/wiki/Ramayan_(1987_TV_series)",
  "plotShort": {
    "plainText": "Ramayan (also known as Ramanand Sagar's Ramayan) is an Indian Hindi-language epic television series based on ancient Indian Sanskrit Epic Ramayana. The show was created, written, and directed by Ramanand Sagar. It originally aired between 1987 and 1988 on DD National and it was narrated by Ashok Kumar and the director Ramanand Sagar. The music was composed by Ravindra Jain. During its run, the show became most watched television series in the world, it had a viewership of 82 percent. The repeat telecast was aired on 20 different channels in 17 countries on all the five continents at different times.The success of the series was documented well by the media. According to BBC, the serial has been viewed by over 650 million viewers. Each episode of the series reportedly earned DD National ₹40 Lakh.\r\nThe show is primarily based on Valmiki's Ramayan and Tulsidas' Ramcharitmanas. Other sources used were: Tamil Kamb Ramayan, Marathi Bhavarath Ramayan, Bengali Krutivas Ramayan, Telugu Shri Rangnath Ramayan, Kannada Ramchandra Charit Puranam, Malayalam Adhyatma Ramayan, Urdu Ramayan by Chakbast. Ramayan was the most expensive TV show produced during at the time with a budget ₹9 Lakhs per episode.\r\nWhen the series was telecast every Sunday morning, as one journalist recalled, \"streets would be deserted, shops would be closed and people would bathe and garland their TV sets before the serial began.\" The series was reaired during the 2020 Coronavirus Lockdown and broke several viewership record globally which includes show sets a record for most watched TV show in the world with 77 million viewership on 16th April, 2020.",
    "html": "<p>Ramayan (also known as Ramanand Sagar's Ramayan) is an Indian Hindi-language epic television series based on ancient Indian Sanskrit Epic Ramayana. The show was created, written, and directed by Ramanand Sagar. It originally aired between 1987 and 1988 on DD National and it was narrated by Ashok Kumar and the director Ramanand Sagar. The music was composed by Ravindra Jain. During its run, the show became most watched television series in the world, it had a viewership of 82 percent. The repeat telecast was aired on 20 different channels in 17 countries on all the five continents at different times.The success of the series was documented well by the media. According to BBC, the serial has been viewed by over 650 million viewers. Each episode of the series reportedly earned DD National ₹40 Lakh.</p><p>The show is primarily based on Valmiki's Ramayan and Tulsidas' Ramcharitmanas. Other sources used were: Tamil Kamb Ramayan, Marathi Bhavarath Ramayan, Bengali Krutivas Ramayan, Telugu Shri Rangnath Ramayan, Kannada Ramchandra Charit Puranam, Malayalam Adhyatma Ramayan, Urdu Ramayan by Chakbast. Ramayan was the most expensive TV show produced during at the time with a budget ₹9 Lakhs per episode.</p><p>When the series was telecast every Sunday morning, as one journalist recalled, \"streets would be deserted, shops would be closed and people would bathe and garland their TV sets before the serial began.\" The series was reaired during the 2020 Coronavirus Lockdown and broke several viewership record globally which includes show sets a record for most watched TV show in the world with 77 million viewership on 16th April, 2020.</p>"
  },
  "plotFull": {
    "plainText": "Ramayan (also known as Ramanand Sagar's Ramayan) is an Indian Hindi-language epic television series based on ancient Indian Sanskrit Epic Ramayana. The show was created, written, and directed by Ramanand Sagar. It originally aired between 1987 and 1988 on DD National and it was narrated by Ashok Kumar and the director Ramanand Sagar. The music was composed by Ravindra Jain. During its run, the show became most watched television series in the world, it had a viewership of 82 percent. The repeat telecast was aired on 20 different channels in 17 countries on all the five continents at different times.The success of the series was documented well by the media. According to BBC, the serial has been viewed by over 650 million viewers. Each episode of the series reportedly earned DD National ₹40 Lakh.\r\nThe show is primarily based on Valmiki's Ramayan and Tulsidas' Ramcharitmanas. Other sources used were: Tamil Kamb Ramayan, Marathi Bhavarath Ramayan, Bengali Krutivas Ramayan, Telugu Shri Rangnath Ramayan, Kannada Ramchandra Charit Puranam, Malayalam Adhyatma Ramayan, Urdu Ramayan by Chakbast. Ramayan was the most expensive TV show produced during at the time with a budget ₹9 Lakhs per episode.\r\nWhen the series was telecast every Sunday morning, as one journalist recalled, \"streets would be deserted, shops would be closed and people would bathe and garland their TV sets before the serial began.\" The series was reaired during the 2020 Coronavirus Lockdown and broke several viewership record globally which includes show sets a record for most watched TV show in the world with 77 million viewership on 16th April, 2020.\r\nPremise\r\nAdapted and based on the ancient Hindu epic Ramayana, the series follows the journey of Ram who goes to an exile of 14 years along with Sita and Lakshman.\r\nLord Vishnu decides to incarnate on earth as Ram, the son of King Dashrath and Queen Kaushalya of Ayodhya to kill Ravan, the evil king of Lanka and establish dharma whereas Goddess Lakshmi would incarnate as his wife Sita. In Ayodhya, a childless Dashrath conducts a yagna for children and as a result, his three wives gives birth to 4 sons. Kaushalya to Ram, Kaikeyi to Bharat and Sumitra to Lakshman and Shatrughan. The 4 boys grow up to be excellent warriors under Guru Vashista's training. Lord Ram is an ideal and perfect son and brother and is a role model to his three younger brothers and always respects his parents and their affection towards him.\r\nAfter the brothers return after completing their education, Rishi Vishvamitra arrives at Ayodhya for help as his yagna is disturbed by some demons and asks Dashrath to send Ram to him to kill those demons. Dashrath reluctantly agrees and Lakshman also accompanies Ram. Shri Ram succeeds in killing Taraka and her son Subahu and also protects the yagnas. Rishi Vishvamitra later teaches him about many things required for future.\r\nLater, he takes the two brothers to Mithila to seek the blessings of Lord Shiva's bow at the swayamvar of Princess Sita. Rishi Vishvamitra tells them about the birth of Sita from earth. On their way Ram frees Ahalya of her curse by her husband Rishi Gautama.\r\nCast\r\nMain\r\nArun Govil as Ram, Lord Vishnu's 7th incarnation of the Dashavatar; Dasharatha and Kaushalya's son; Sita's husband; Bharat, Lakshman And Shatrughan's elder brother.\r\nDeepika Chikhalia as Sita/Lakshmi, Goddess Lakshmi's incarnation; Janak and Sunaina's elder adoptive daughter; Bhumi Devi's daughter; Urmila's elder adoptive sister; Ram's wife\r\nSunil Lahri as Lakshman, Sheshnaag's incarnation; Dasharatha And Sumitra's elder twin son; Urmila's husband; Ram And Bharat's younger brother And Shatrughan's elder twin\r\nArvind Trivedi as Ravana / Vishrava, Vishrava And Kaikesi's eldest son; Kumbhakarna, Vibhishan and Surpanakha's elder brother, Indrajit's father, Mandodari's husband.\r\nDara Singh as Hanuman, Lord Shiva's incarnation; Lord Ram's devotee, Anjani and Kesari's son, Vayu's son.\r\nRecurring\r\nSanjay Jog as Bharat, the incarnation of Panchajanya, the conch held by Lord Vishnu'; Dasharatha and Kaikeyi's son; Mandavi's husband; Ram's younger brother, and Lakshman and Shatrughan's elder brother\r\nSameer Rajda as Shatrughna, the incarnation of Lord Vishnu's Sudarshana; Dasharatha and Sumitra's younger twin son; Shrutakirti's husband, and Ram, and Bharat's younger brother, Lakshman's younger twin\r\nBal Dhuri as Dasharatha, King Aja and Queen Indumati's son; Kausalya, Kaikeyi, and Sumitra's husband; Ram, Bharat, Laxman and Shatrughan's father, King of Kosala\r\nJayshree Gadkar as Kausalya, Dasharatha's first wife; Ram's mother\r\nPadma Khanna as Kaikeyi, Dasharatha's second wife; Bharat's mother, Ram's foster Mother.\r\nRajnibala as Sumitra, Dasharatha's third wife; Lakshman and Shatrughan's mother\r\nLalita Pawar as Manthara, Kaikeyi's evil maid\r\nVijay Arora as Indrajit, Ravan and Mandodari's first son; Sulochana's husband; slayen by Lakshman.\r\nNalin Dave as Kumbhakarna, Vishrava and Kaikesi's second son; Ravana, Vibhishan and Surpanakha brother; slayen by Ram.\r\nMukesh Rawal as Vibhishana, Vishrava and Kaikesi's third son; Ravana, Kumbhakaran and Surpanakha's brother; King of Lanka.\r\nAparajita Bhushan as Mandodari, Ravan's first wife; Mayasura and Apsara Hema's daughter; Mayavi and Dundubhi's sister; Meghanaad, and Akshayakumara's mother.\r\nShyam Sundar Kalani as Sugriva Sugriva-Vali's brother; Ruma's husband. Also Vali, Sugriva's brother and also played role of Yamraj God of death.\r\nSudhir Dalvi as Vasishtha, Raghukul brothers' teacher\r\nChandrashekhar as Sumantra, Dasrath's minister\r\nRenu Dhariwal as Shurpanakha, Vishrava and Kaikesi's daughter; Ravana, Kumbhakaran and Vibhishan's sister. Her Nose was Cut by Lakshman.\r\nRadha Yadav as Tara, Vali's wife and Angad's mother\r\nMulraj Rajda as Janaka, Kushadhwaja's brother; Sunaina's husband; Sita and Urmila's father King of Mithila\r\nUrmila Bhatt as Sunaina, Janak's wife; Sita and Urmila's mother, Queen of Mithila\r\nRajshekar Upadhyay as Jambhava,\r\nBashir Khan as Angad, Tara and Vali's son / Vajramushti (Lankan General)\r\nAnjali Vyas as Urmila, Goddess Naga Lakshmi's incarnation; Janak and Sunaina's younger daughter; Sita's sister; Lakshmana's wife\r\nSulakshana Khatri as Mandavi, Goddess Lakshmi's flower avatar; Kushadhwaja and Chandrabhaga's elder daughter; Shrutakirti's elder sister; Bharat's wife; Sita's cousin\r\nPoonam Shetty as Shrutakirti, Goddess Lakshmi's flower; Kushadhwaja and Chandrabhaga's younger daughter; Mandavi's younger sister; Sita's cousin; Shatrughan's wife\r\nVijay Kavish as Shiva, Parvati's husband/ Mayasura Mandodari's father, Ravan's father in law/Maharshi Valmiki, author of Ramayan\r\nPushpa Verma as Sulochana, Meghanaad's wife.\r\nRamesh Chapaneri as Malyavan and Agastya\r\nChandrakant Pandey as Nishad\r\nGirish Seth as Nal, Neel's brother / Gandharva\r\nGiriraj Shukla as Neel, Nal's brother/Prahasta\r\nVibhuti Dave as Trijata, Sita's caretaker\r\nSarita Devi as Shabari, Ram's devotee\r\nAslam Khan as Samudra Dev and various roles\r\nBandini Mishra as Parvati, Shiva's wife\r\nMurari Lal Gupta as Akampana.\r\nMahesh Bhatt as Shatanand, Ahilya Devi & Gauatam Rishi's son, priest of Janak\r\nShrikant Soni as Vishwamitra\r\nKaustubh Trivedi as Kewat\r\nBhushan Lakandari as Vishnu\r\nSunil Verma as Garuda/Indra/Jatayu/Narantak\r\nRamesh Goyal as Maarich\r\nKapil Kumar as Akshayakumara, Ravan and Mandodari's Second son; Meghnath's brother\r\nMadhu Priya as Apsara Avtar of Shurpanakha\r\nRajendra Jain as Kalanemi\r\nMayuresh Kshetramhade as Luv, Ram and Sita's younger son; Kush's twin\r\nSwapnil Joshi as Kush, Ram and Sita's elder son; Luv's twin\r\nRandhir Singh as Viradh/Rakshas/Sursa/Atikaye\r\nEpisodes\r\nEpisode 1 – Birth and childhood of Lord Ram\r\nEpisode 2 – Ram going to Gurukul\r\nEpisode 3 – Continuing Gurukul\r\nEpisode 4 – Vishwamitra comes to Ayodhya and Ram kills Taraka Rakshasi\r\nEpisode 5 – Ganga Redemption of Ahilya\r\nEpisode 6 – Ram meets Sita\r\nEpisode 7 – Sita's Swayamvara\r\nEpisode 8 – Sita's Swayamvara and Parashuram\r\nEpisode 9 – Marriage Preparations\r\nEpisode 10 – Ram and Sita's Marriage\r\nEpisode 11 – Sita's arrival at Ayodhya\r\nEpisode 12 – Discussion on Dasharatha's heir\r\nEpisode 13 – Manthra poisons Kaikeyi's mind\r\nEpisode 14 – Kaikeyi Demands Her Boons from Dasharatha\r\nEpisode 15 – Shri Ram, Sita and Lakshman preparing for the Journey to the Forest\r\nEpisode 16 – Shri Ram, Sita and Lakshman leave Ayodhya\r\nEpisode 17 – Shri Ram, Sita and Lakshman meet Nishadraj Guha\r\nEpisode 18 – Bharadwaja's Ashram\r\nEpisode 19 – Valmiki's Ashram and Chitrakoot\r\nEpisode 20 – King Dasharath's Death and story of Shravan Kumar\r\nEpisode 21 – Bharath Returns to Ayodhya\r\nEpisode 22 – Bharath rejects to become King\r\nEpisode 23 – Bharat vows to bring back Shri Ram\r\nEpisode 24 – Reunion of Ram and Bharat\r\nEpisode 25 – Bharath returns to Ayodhya with Shri Ram's sandals\r\nEpisode 26 – Shri Ram's sandals installed on the throne of Ayodhya\r\nEpisode 27 – Shri Ram, Sita and Lakshman meet Sage Atri & Mother Anusuya\r\nEpisode 28 – Shri Ram vows to destroy demons, meets Sage Agastya\r\nEpisode 29 – First meeting with Jatayu.\r\nEpisode 30 – Shurpanaka Encounter\r\nEpisode 31 – Sita Kidnap Plan by Raavan\r\nEpisode 32 – Sita Haran and Ravana kills Jatayu\r\nEpisode 33 – Shri Ram & Lakshman meet wounded Jatayu\r\nEpisode 34 – Shri Ram & Lakshman encounter Kabandh and reach Shabari's ashram\r\nEpisode 35 – Hanuman meets Shri Ram\r\nEpisode 36 – Friendship between Shri Ram & Sugriv\r\nEpisode 37 – Sugriv tells Shri Ram about Bali\r\nEpisode 38 – Shri Ram kills Bali\r\nEpisode 39 – Sugriv becomes king\r\nEpisode 40 – Sugriv and Angad come to Shri Ram for his blessings\r\nEpisode 41 – Lakshman enters Kishikindha in a fury\r\nEpisode 42 – Search for Sita begins\r\nEpisode 43 – Jambubant reminds Hanuman of his dormant strength. Hanuman flies to Lanka\r\nEpisode 44 – Hanuman meets Sita in Ashok Vatika\r\nEpisode 45 – Hanuman ravages Ashok Vatika and kills Akshay Kumara\r\nEpisode 46 – Hanuman meets Ravana and Lanka Dahan\r\nEpisode 47 – Hanuman takes leave of Sita\r\nEpisode 48 – Hanuman returns and tells Shri Ram about Sita\r\nEpisode 49 – Vibhishana is expelled from Lanka\r\nEpisode 50 – Vibhishana meets Shri Ram\r\nEpisode 51 – Sukh meets Sugriv\r\nEpisode 52 – Ram Setu bandhan\r\nEpisode 53 – The construction of the bridge is completed\r\nEpisode 54 – Shri Ram's arrow fells Ravan's crown\r\nEpisode 55 – Ravana and Sugriv duel against each other\r\nEpisode 56 – Shri Ram sends Angad as an peace ambassador to Ravan's court\r\nEpisode 57 – Angad's challenge\r\nEpisode 58 – Mandodari appeals to Ravan to listen to the advice of his elders\r\nEpisode 59 – Battle Starts\r\nEpisode 60 – Ravan comes to the battlefield\r\nEpisode 61 – Kumbhakaran is woken up\r\nEpisode 62 – Kumbhakaran vadh\r\nEpisode 63 – Devantak, Narantak, Trishira and other warriors are killed\r\nEpisode 64 – Lakshman fights and kills Atikaya\r\nEpisode 65 – Shri Ram & Lakshman are bound by Indrajit's Nagapasha\r\nEpisode 66 – Garuda frees Shri Ram and Lakshman from Nagapasha\r\nEpisode 67 – Lakshman get injured by Indrajit's 'shakti' weapon.\r\nEpisode 68 – Hanuman brings Sushen Vaidya\r\nEpisode 69 – Hanuman brings Sanjeevani mountain from Himalayas and Lakshman is cured\r\nEpisode 70 – Indrajit goes to perform a tantrik yajna\r\nEpisode 71 – Indrajit Vadh\r\nEpisode 72 – Ravana enters battlefield and fights Shri Ram\r\nEpisode 73 – Ravan attacks Shri Ram\r\nEpisode 74 – Indra sends his chariot for Shri Ram\r\nEpisode 75 – Ravan vadh and end of battle\r\nEpisode 76 – Sita Agni-pariksha\r\nEpisode 77 – Shri Ram heads for Ayodhya\r\nEpisode 78 – The coronation of Shri Ram\r\nProduction\r\nRamayan was regarded as the most expensive TV show produced during the time with a budget ₹9 Lakhs per episode.\r\nDevelopment\r\nWriting for the Indian Express upon completion of the airing of the series' final episode, former bureaucrat S. S. Gill wrote that it was during his tenure as the secretary with the Ministry of Information and Broadcasting in September 1985 that he contacted Ramanand Sagar in association with the project.\r\nGill added that in a letter to Sagar, he had written about the Ramayana as a subject for the television series was ideal in that it was \"a repository of moral and social values\" and that its message was \"secular and universal\".\r\nHe added that he had noted in the letter that Sagar's \"real challenge would lie in seeing the epic \"with the eyes of a modern man and relating its message to the spiritual and emotional needs of our age\".\r\nGill added that he also wrote a similar letter to B. R. Chopra over the production of the series Mahabharat based on another epic of the same name, and mentioned that both he and Sagar accepted to his suggestions and constituted panels of experts and scholars to conceptualize the production.\r\nThe series was initially conceptualized to run for 52 episodes of 45 minutes each. But, owing to popular demand it had to be extended thrice, eventually ending after 78 episodes.\r\nInitially, Both Ramayan and Mahabharat was planned to air together, but later it was decided to air Ramayan first which was followed by Mahabharat after its end.\r\nCasting\r\nI remember I had given an audition for Ram and I failed initially. I don’t know what happened. The photoshoot happened with the look and make-up but I wasn’t looking like Lord Ram... Then we thought of adding a smile and then everything got sorted.— Arun Govil\r\nGovil expressed his desire to play Rama and appeared for a screen test. Initially, he was considered to be inappropriate for the role. He then appeared for the screen test again wearing a smile on his face and got finalized for the role. Since Govil's collaboration with Debashree Roy in Kanak Mishra's Jiyo To Aise Jiyo (1981) was adulated, the actress was approached to play Sita but due to her hectic schedule in Bengali cinema, she failed to appear for the screen test.\r\nSeveral other famous actresses were approached as well but all of them backed off due to the prevalent premonition that playing the role of Lady Sita would blemish their romantic appeal resulting doom to their on-screen career. Deepika Chikhalia was then summoned to appear for the screen test. She had to undergo rigorous screen tests and was finalized then.\r\nSanjay Jog was originally approached for the role of Lakshmana but he refused since he was unable to give bulk dates. Sagar then urged him to play Bharata since the role would not require bulk dates. The role of Lakshmana then went to Sunil Lahiri.\r\nArvind Trivedi went to audition for the role of a boatman where Ramanand Sagar chose him as Ravan. However, when Trivedi rejected the offer, Paresh Rawal convinced him for playing the role. Vijay Kavish played three roles in the series which were Shiva, Valmiki and Mayasura.\r\nBroadcast\r\nIn India, the series was originally broadcast on DD National from 25th January, 1987 to 31st July, 1988 with widespread acclaim. BBC recorded that it had a viewership of 82 percent, highest viewership in the world.\r\nReruns of the series aired on Star Plus and Star Utsav in 2000s. It was re-telecast again between March and April 2020 during the 2020 coronavirus lockdown in India on DD National and broke all records for viewership globally for any TV show. Hundreds of millions of viewers have watched the series during the 2020 coronavirus lockdown in India.\r\nDD National said on 16 April 2020 the show created world record, 77 million people watched the show in 1 day. It was again telecasted on StarPlus from 4 May 2020. The show is dubbed in Kannada, Marathi, Bengali, Telugu and Tamil which aired on Star Suvarna, Star Pravah, Star Jalsha, Star Maa and Star Vijay respectively.\r\nReception and legacy\r\nAfter just few episodes had been released, the show received widespread critical acclaim for Ramanand Sagar's writing and direction as well as its casting and Ravindra Jain's music.\r\nD. K. Bose, the media director of Hindustan Thompson Associates, remarked, \"The unique thing about the Ramayana was its consistency. Other programs like Buniyaad and even Hum Log did achieve viewership of around 80 percent and more, on occasion. In the case of Ramayana, that figure had been maintained almost from the beginning.\"\r\nHe added, “Starting at around 50 percent the 80 percent figure was reached within a few months and never went down. The viewership was more than 50 percent even in the predominantly non-Hindi speaking southern Indian States of Tamil Nadu, Kerala and Karnataka. The show's popularity spanned across religions and people of the Islam faith watched in high numbers as well. It was common among people threatening to burn down the local electricity board headquarters during a power outage.\"\r\nThe success of the series was documented well by the media. Soutik Biswas of BBC recalled that when the series was telecast every Sunday morning, \"streets would be deserted, shops would be closed and people would bathe and garland their TV sets before the serial began.\"\r\nWriting for the Telegraph, William Dalrymple noted, \"In villages across south Asia, hundreds of people would gather around a single set to watch the gods and demons play out their destinies. In the noisiest and most bustling cities, trains, buses and cars came to a sudden halt, and a strange hush fell over the bazaars. In Delhi, government meetings had to be rescheduled after the entire cabinet failed to turn up for an urgent briefing.\"\r\nPolitical\r\nRegarding initial apprehensions about the series being aired by a government-owned broadcaster, it's hitherto producer Sharad Dutt said that \"a lot of people within the channel's office weren't supportive of the idea, to begin with. But it had no motivation with what was going on politically. The Congress was in power and it had no agenda of the sort.\". Sharma noted that the political clout the series held could be adjudged by the fact that Sagar and Arun Govil (who played Rama) \"were repeatedly courted by both the Congress and the BJP to campaign for them\", and that Deepika Chikhalia (Sita) and Arvind Trivedi (Ravana) went on to become members of parliament.\r\nArvind Rajagopal in his book Politics After Television: Hindu Nationalism and the Reshaping of the Public in India (2000) wrote that with the series, the government \"violated a decades-old taboo on religious partisanship, and Hindu nationalists made the most of the opportunity.\" It confirmed to the idea of Hindu awakening and the rise of the Bharatiya Janata Party capitalizing on this.\"\r\nManik Sharma of Hindustan Times voiced similar views in that the series \"played in the backdrop of a Hindutva shift in Indian politics, under the aegis of the Rashtriya Swayamsevak Sangh (RSS) and its political outfit, the Bharatiya Janata Party (BJP). While the media and cultural commentators struggled to consider Sagar's epic one way or the other, there were some who saw it as a catalyst, even if unintended, to the turmoil that the movement resulted in.\"\r\nThe series was re-telecast from 28 March 2020 with one hour episode during the morning and one hour episode during the night during the lockdown of 21 days due to coronavirus on DD National.\r\nRatings\r\nRamayan notably broke viewership for any Indian television series during that time. It was telecast in 55 countries and at a total viewership of 650 million and re-telecast (24 March - 18 April 2020) nearly 2500 million viewership alone in 25 days, it became the highest watched Indian television series by a distance, and one of top watched television series in world. It entered in the Limca Book of Records as the most watched historical series. On its first telecast (1987), it had 40 million viewership in India. That brought ₹23 crore revenue for the channel.\r\nThe viewership during lockdown garnered record highest ratings for a Hindi GEC (general entertainment channel) show since 2015 making DD National as the most watched Indian channel since its premiere.\r\nRamayan garnered a total of 170 million viewers in first 4 shows during which DD National became the most watched Indian television channel after many years. The following week it garnered 580 million impressions in morning slot and 835 million impressions in night slot.\r\nIn week 14 2020, it garnered 61.397 million impressions and the following week it got 67.4 million impressions.\r\nEven the Wall Street Journal acknowledged the huge popularity of Ramayan's re-telecast during 2020\r\nSequel and remake\r\nA follow-up series Luv Kush based on the last chapter of Ramayana Uttara Kanda, aired in October 1988 on DD National. A remake series Ramayan produced by Sagar Arts aired on NDTV Imagine in 2008.",
    "html": "<p>Ramayan (also known as Ramanand Sagar's Ramayan) is an Indian Hindi-language epic television series based on ancient Indian Sanskrit Epic Ramayana. The show was created, written, and directed by Ramanand Sagar. It originally aired between 1987 and 1988 on DD National and it was narrated by Ashok Kumar and the director Ramanand Sagar. The music was composed by Ravindra Jain. During its run, the show became most watched television series in the world, it had a viewership of 82 percent. The repeat telecast was aired on 20 different channels in 17 countries on all the five continents at different times.The success of the series was documented well by the media. According to BBC, the serial has been viewed by over 650 million viewers. Each episode of the series reportedly earned DD National ₹40 Lakh.</p><p>The show is primarily based on Valmiki's Ramayan and Tulsidas' Ramcharitmanas. Other sources used were: Tamil Kamb Ramayan, Marathi Bhavarath Ramayan, Bengali Krutivas Ramayan, Telugu Shri Rangnath Ramayan, Kannada Ramchandra Charit Puranam, Malayalam Adhyatma Ramayan, Urdu Ramayan by Chakbast. Ramayan was the most expensive TV show produced during at the time with a budget ₹9 Lakhs per episode.</p><p>When the series was telecast every Sunday morning, as one journalist recalled, \"streets would be deserted, shops would be closed and people would bathe and garland their TV sets before the serial began.\" The series was reaired during the 2020 Coronavirus Lockdown and broke several viewership record globally which includes show sets a record for most watched TV show in the world with 77 million viewership on 16th April, 2020.</p><br/><h3>Premise</h3><p>Adapted and based on the ancient Hindu epic Ramayana, the series follows the journey of Ram who goes to an exile of 14 years along with Sita and Lakshman.</p><p>Lord Vishnu decides to incarnate on earth as Ram, the son of King Dashrath and Queen Kaushalya of Ayodhya to kill Ravan, the evil king of Lanka and establish dharma whereas Goddess Lakshmi would incarnate as his wife Sita. In Ayodhya, a childless Dashrath conducts a yagna for children and as a result, his three wives gives birth to 4 sons. Kaushalya to Ram, Kaikeyi to Bharat and Sumitra to Lakshman and Shatrughan. The 4 boys grow up to be excellent warriors under Guru Vashista's training. Lord Ram is an ideal and perfect son and brother and is a role model to his three younger brothers and always respects his parents and their affection towards him.</p><p>After the brothers return after completing their education, Rishi Vishvamitra arrives at Ayodhya for help as his yagna is disturbed by some demons and asks Dashrath to send Ram to him to kill those demons. Dashrath reluctantly agrees and Lakshman also accompanies Ram. Shri Ram succeeds in killing Taraka and her son Subahu and also protects the yagnas. Rishi Vishvamitra later teaches him about many things required for future.</p><p>Later, he takes the two brothers to Mithila to seek the blessings of Lord Shiva's bow at the swayamvar of Princess Sita. Rishi Vishvamitra tells them about the birth of Sita from earth. On their way Ram frees Ahalya of her curse by her husband Rishi Gautama.</p><br/><h3>Cast</h3><h4>Main</h4><ul><li>Arun Govil as Ram, Lord Vishnu's 7th incarnation of the Dashavatar; Dasharatha and Kaushalya's son; Sita's husband; Bharat, Lakshman And Shatrughan's elder brother.</li><li>Deepika Chikhalia as Sita/Lakshmi, Goddess Lakshmi's incarnation; Janak and Sunaina's elder adoptive daughter; Bhumi Devi's daughter; Urmila's elder adoptive sister; Ram's wife</li><li>Sunil Lahri as Lakshman, Sheshnaag's incarnation; Dasharatha And Sumitra's elder twin son; Urmila's husband; Ram And Bharat's younger brother And Shatrughan's elder twin</li><li>Arvind Trivedi as Ravana / Vishrava, Vishrava And Kaikesi's eldest son; Kumbhakarna, Vibhishan and Surpanakha's elder brother, Indrajit's father, Mandodari's husband.</li><li>Dara Singh as Hanuman, Lord Shiva's incarnation; Lord Ram's devotee, Anjani and Kesari's son, Vayu's son.</li></ul><h4>Recurring</h4><ul><li>Sanjay Jog as Bharat, the incarnation of Panchajanya, the conch held by Lord Vishnu'; Dasharatha and Kaikeyi's son; Mandavi's husband; Ram's younger brother, and Lakshman and Shatrughan's elder brother</li><li>Sameer Rajda as Shatrughna, the incarnation of Lord Vishnu's Sudarshana; Dasharatha and Sumitra's younger twin son; Shrutakirti's husband, and Ram, and Bharat's younger brother, Lakshman's younger twin</li><li>Bal Dhuri as Dasharatha, King Aja and Queen Indumati's son; Kausalya, Kaikeyi, and Sumitra's husband; Ram, Bharat, Laxman and Shatrughan's father, King of Kosala</li><li>Jayshree Gadkar as Kausalya, Dasharatha's first wife; Ram's mother</li><li>Padma Khanna as Kaikeyi, Dasharatha's second wife; Bharat's mother, Ram's foster Mother.</li><li>Rajnibala as Sumitra, Dasharatha's third wife; Lakshman and Shatrughan's mother</li><li>Lalita Pawar as Manthara, Kaikeyi's evil maid</li><li>Vijay Arora as Indrajit, Ravan and Mandodari's first son; Sulochana's husband; slayen by Lakshman.</li><li>Nalin Dave as Kumbhakarna, Vishrava and Kaikesi's second son; Ravana, Vibhishan and Surpanakha brother; slayen by Ram.</li><li>Mukesh Rawal as Vibhishana, Vishrava and Kaikesi's third son; Ravana, Kumbhakaran and Surpanakha's brother; King of Lanka.</li><li>Aparajita Bhushan as Mandodari, Ravan's first wife; Mayasura and Apsara Hema's daughter; Mayavi and Dundubhi's sister; Meghanaad, and Akshayakumara's mother.</li><li>Shyam Sundar Kalani as Sugriva Sugriva-Vali's brother; Ruma's husband. Also Vali, Sugriva's brother and also played role of Yamraj God of death.</li><li>Sudhir Dalvi as Vasishtha, Raghukul brothers' teacher</li><li>Chandrashekhar as Sumantra, Dasrath's minister</li><li>Renu Dhariwal as Shurpanakha, Vishrava and Kaikesi's daughter; Ravana, Kumbhakaran and Vibhishan's sister. Her Nose was Cut by Lakshman.</li><li>Radha Yadav as Tara, Vali's wife and Angad's mother</li><li>Mulraj Rajda as Janaka, Kushadhwaja's brother; Sunaina's husband; Sita and Urmila's father King of Mithila</li><li>Urmila Bhatt as Sunaina, Janak's wife; Sita and Urmila's mother, Queen of Mithila</li><li>Rajshekar Upadhyay as Jambhava,</li><li>Bashir Khan as Angad, Tara and Vali's son / Vajramushti (Lankan General)</li><li>Anjali Vyas as Urmila, Goddess Naga Lakshmi's incarnation; Janak and Sunaina's younger daughter; Sita's sister; Lakshmana's wife</li><li>Sulakshana Khatri as Mandavi, Goddess Lakshmi's flower avatar; Kushadhwaja and Chandrabhaga's elder daughter; Shrutakirti's elder sister; Bharat's wife; Sita's cousin</li><li>Poonam Shetty as Shrutakirti, Goddess Lakshmi's flower; Kushadhwaja and Chandrabhaga's younger daughter; Mandavi's younger sister; Sita's cousin; Shatrughan's wife</li><li>Vijay Kavish as Shiva, Parvati's husband/ Mayasura Mandodari's father, Ravan's father in law/Maharshi Valmiki, author of Ramayan</li><li>Pushpa Verma as Sulochana, Meghanaad's wife.</li><li>Ramesh Chapaneri as Malyavan and Agastya</li><li>Chandrakant Pandey as Nishad</li><li>Girish Seth as Nal, Neel's brother / Gandharva</li><li>Giriraj Shukla as Neel, Nal's brother/Prahasta</li><li>Vibhuti Dave as Trijata, Sita's caretaker</li><li>Sarita Devi as Shabari, Ram's devotee</li><li>Aslam Khan as Samudra Dev and various roles</li><li>Bandini Mishra as Parvati, Shiva's wife</li><li>Murari Lal Gupta as Akampana.</li><li>Mahesh Bhatt as Shatanand, Ahilya Devi & Gauatam Rishi's son, priest of Janak</li><li>Shrikant Soni as Vishwamitra</li><li>Kaustubh Trivedi as Kewat</li><li>Bhushan Lakandari as Vishnu</li><li>Sunil Verma as Garuda/Indra/Jatayu/Narantak</li><li>Ramesh Goyal as Maarich</li><li>Kapil Kumar as Akshayakumara, Ravan and Mandodari's Second son; Meghnath's brother</li><li>Madhu Priya as Apsara Avtar of Shurpanakha</li><li>Rajendra Jain as Kalanemi</li><li>Mayuresh Kshetramhade as Luv, Ram and Sita's younger son; Kush's twin</li><li>Swapnil Joshi as Kush, Ram and Sita's elder son; Luv's twin</li><li>Randhir Singh as Viradh/Rakshas/Sursa/Atikaye</li></ul><br/><h3>Episodes</h3><p>Episode 1 – Birth and childhood of Lord Ram</p><p>Episode 2 – Ram going to Gurukul</p><p>Episode 3 – Continuing Gurukul</p><p>Episode 4 – Vishwamitra comes to Ayodhya and Ram kills Taraka Rakshasi</p><p>Episode 5 – Ganga Redemption of Ahilya</p><p>Episode 6 – Ram meets Sita</p><p>Episode 7 – Sita's Swayamvara</p><p>Episode 8 – Sita's Swayamvara and Parashuram</p><p>Episode 9 – Marriage Preparations</p><p>Episode 10 – Ram and Sita's Marriage</p><p>Episode 11 – Sita's arrival at Ayodhya</p><p>Episode 12 – Discussion on Dasharatha's heir</p><p>Episode 13 – Manthra poisons Kaikeyi's mind</p><p>Episode 14 – Kaikeyi Demands Her Boons from Dasharatha</p><p>Episode 15 – Shri Ram, Sita and Lakshman preparing for the Journey to the Forest</p><p>Episode 16 – Shri Ram, Sita and Lakshman leave Ayodhya</p><p>Episode 17 – Shri Ram, Sita and Lakshman meet Nishadraj Guha</p><p>Episode 18 – Bharadwaja's Ashram</p><p>Episode 19 – Valmiki's Ashram and Chitrakoot</p><p>Episode 20 – King Dasharath's Death and story of Shravan Kumar</p><p>Episode 21 – Bharath Returns to Ayodhya</p><p>Episode 22 – Bharath rejects to become King</p><p>Episode 23 – Bharat vows to bring back Shri Ram</p><p>Episode 24 – Reunion of Ram and Bharat</p><p>Episode 25 – Bharath returns to Ayodhya with Shri Ram's sandals</p><p>Episode 26 – Shri Ram's sandals installed on the throne of Ayodhya</p><p>Episode 27 – Shri Ram, Sita and Lakshman meet Sage Atri & Mother Anusuya</p><p>Episode 28 – Shri Ram vows to destroy demons, meets Sage Agastya</p><p>Episode 29 – First meeting with Jatayu.</p><p>Episode 30 – Shurpanaka Encounter</p><p>Episode 31 – Sita Kidnap Plan by Raavan</p><p>Episode 32 – Sita Haran and Ravana kills Jatayu</p><p>Episode 33 – Shri Ram & Lakshman meet wounded Jatayu</p><p>Episode 34 – Shri Ram & Lakshman encounter Kabandh and reach Shabari's ashram</p><p>Episode 35 – Hanuman meets Shri Ram</p><p>Episode 36 – Friendship between Shri Ram & Sugriv</p><p>Episode 37 – Sugriv tells Shri Ram about Bali</p><p>Episode 38 – Shri Ram kills Bali</p><p>Episode 39 – Sugriv becomes king</p><p>Episode 40 – Sugriv and Angad come to Shri Ram for his blessings</p><p>Episode 41 – Lakshman enters Kishikindha in a fury</p><p>Episode 42 – Search for Sita begins</p><p>Episode 43 – Jambubant reminds Hanuman of his dormant strength. Hanuman flies to Lanka</p><p>Episode 44 – Hanuman meets Sita in Ashok Vatika</p><p>Episode 45 – Hanuman ravages Ashok Vatika and kills Akshay Kumara</p><p>Episode 46 – Hanuman meets Ravana and Lanka Dahan</p><p>Episode 47 – Hanuman takes leave of Sita</p><p>Episode 48 – Hanuman returns and tells Shri Ram about Sita</p><p>Episode 49 – Vibhishana is expelled from Lanka</p><p>Episode 50 – Vibhishana meets Shri Ram</p><p>Episode 51 – Sukh meets Sugriv</p><p>Episode 52 – Ram Setu bandhan</p><p>Episode 53 – The construction of the bridge is completed</p><p>Episode 54 – Shri Ram's arrow fells Ravan's crown</p><p>Episode 55 – Ravana and Sugriv duel against each other</p><p>Episode 56 – Shri Ram sends Angad as an peace ambassador to Ravan's court</p><p>Episode 57 – Angad's challenge</p><p>Episode 58 – Mandodari appeals to Ravan to listen to the advice of his elders</p><p>Episode 59 – Battle Starts</p><p>Episode 60 – Ravan comes to the battlefield</p><p>Episode 61 – Kumbhakaran is woken up</p><p>Episode 62 – Kumbhakaran vadh</p><p>Episode 63 – Devantak, Narantak, Trishira and other warriors are killed</p><p>Episode 64 – Lakshman fights and kills Atikaya</p><p>Episode 65 – Shri Ram & Lakshman are bound by Indrajit's Nagapasha</p><p>Episode 66 – Garuda frees Shri Ram and Lakshman from Nagapasha</p><p>Episode 67 – Lakshman get injured by Indrajit's 'shakti' weapon.</p><p>Episode 68 – Hanuman brings Sushen Vaidya</p><p>Episode 69 – Hanuman brings Sanjeevani mountain from Himalayas and Lakshman is cured</p><p>Episode 70 – Indrajit goes to perform a tantrik yajna</p><p>Episode 71 – Indrajit Vadh</p><p>Episode 72 – Ravana enters battlefield and fights Shri Ram</p><p>Episode 73 – Ravan attacks Shri Ram</p><p>Episode 74 – Indra sends his chariot for Shri Ram</p><p>Episode 75 – Ravan vadh and end of battle</p><p>Episode 76 – Sita Agni-pariksha</p><p>Episode 77 – Shri Ram heads for Ayodhya</p><p>Episode 78 – The coronation of Shri Ram</p><br/><h3>Production</h3><p>Ramayan was regarded as the most expensive TV show produced during the time with a budget ₹9 Lakhs per episode.</p><h4>Development</h4><p>Writing for the Indian Express upon completion of the airing of the series' final episode, former bureaucrat S. S. Gill wrote that it was during his tenure as the secretary with the Ministry of Information and Broadcasting in September 1985 that he contacted Ramanand Sagar in association with the project.</p><p>Gill added that in a letter to Sagar, he had written about the Ramayana as a subject for the television series was ideal in that it was \"a repository of moral and social values\" and that its message was \"secular and universal\".</p><p>He added that he had noted in the letter that Sagar's \"real challenge would lie in seeing the epic \"with the eyes of a modern man and relating its message to the spiritual and emotional needs of our age\".</p><p>Gill added that he also wrote a similar letter to B. R. Chopra over the production of the series Mahabharat based on another epic of the same name, and mentioned that both he and Sagar accepted to his suggestions and constituted panels of experts and scholars to conceptualize the production.</p><p>The series was initially conceptualized to run for 52 episodes of 45 minutes each. But, owing to popular demand it had to be extended thrice, eventually ending after 78 episodes.</p><p>Initially, Both Ramayan and Mahabharat was planned to air together, but later it was decided to air Ramayan first which was followed by Mahabharat after its end.</p><h4>Casting</h4><blockquote>I remember I had given an audition for Ram and I failed initially. I don’t know what happened. The photoshoot happened with the look and make-up but I wasn’t looking like Lord Ram... Then we thought of adding a smile and then everything got sorted.— Arun Govil</blockquote><p>Govil expressed his desire to play Rama and appeared for a screen test. Initially, he was considered to be inappropriate for the role. He then appeared for the screen test again wearing a smile on his face and got finalized for the role. Since Govil's collaboration with Debashree Roy in Kanak Mishra's Jiyo To Aise Jiyo (1981) was adulated, the actress was approached to play Sita but due to her hectic schedule in Bengali cinema, she failed to appear for the screen test.</p><p>Several other famous actresses were approached as well but all of them backed off due to the prevalent premonition that playing the role of Lady Sita would blemish their romantic appeal resulting doom to their on-screen career. Deepika Chikhalia was then summoned to appear for the screen test. She had to undergo rigorous screen tests and was finalized then.</p><p>Sanjay Jog was originally approached for the role of Lakshmana but he refused since he was unable to give bulk dates. Sagar then urged him to play Bharata since the role would not require bulk dates. The role of Lakshmana then went to Sunil Lahiri.</p><p>Arvind Trivedi went to audition for the role of a boatman where Ramanand Sagar chose him as Ravan. However, when Trivedi rejected the offer, Paresh Rawal convinced him for playing the role. Vijay Kavish played three roles in the series which were Shiva, Valmiki and Mayasura.</p><br/><h3>Broadcast</h3><p>In India, the series was originally broadcast on DD National from 25th January, 1987 to 31st July, 1988 with widespread acclaim. BBC recorded that it had a viewership of 82 percent, highest viewership in the world.</p><p>Reruns of the series aired on Star Plus and Star Utsav in 2000s. It was re-telecast again between March and April 2020 during the 2020 coronavirus lockdown in India on DD National and broke all records for viewership globally for any TV show. Hundreds of millions of viewers have watched the series during the 2020 coronavirus lockdown in India.</p><p>DD National said on 16 April 2020 the show created world record, 77 million people watched the show in 1 day. It was again telecasted on StarPlus from 4 May 2020. The show is dubbed in Kannada, Marathi, Bengali, Telugu and Tamil which aired on Star Suvarna, Star Pravah, Star Jalsha, Star Maa and Star Vijay respectively.</p><br/><h3>Reception and legacy</h3><p>After just few episodes had been released, the show received widespread critical acclaim for Ramanand Sagar's writing and direction as well as its casting and Ravindra Jain's music.</p><p>D. K. Bose, the media director of Hindustan Thompson Associates, remarked, \"The unique thing about the Ramayana was its consistency. Other programs like Buniyaad and even Hum Log did achieve viewership of around 80 percent and more, on occasion. In the case of Ramayana, that figure had been maintained almost from the beginning.\"</p><p>He added, “Starting at around 50 percent the 80 percent figure was reached within a few months and never went down. The viewership was more than 50 percent even in the predominantly non-Hindi speaking southern Indian States of Tamil Nadu, Kerala and Karnataka. The show's popularity spanned across religions and people of the Islam faith watched in high numbers as well. It was common among people threatening to burn down the local electricity board headquarters during a power outage.\"</p><p>The success of the series was documented well by the media. Soutik Biswas of BBC recalled that when the series was telecast every Sunday morning, \"streets would be deserted, shops would be closed and people would bathe and garland their TV sets before the serial began.\"</p><p>Writing for the Telegraph, William Dalrymple noted, \"In villages across south Asia, hundreds of people would gather around a single set to watch the gods and demons play out their destinies. In the noisiest and most bustling cities, trains, buses and cars came to a sudden halt, and a strange hush fell over the bazaars. In Delhi, government meetings had to be rescheduled after the entire cabinet failed to turn up for an urgent briefing.\"</p><h4>Political</h4><p>Regarding initial apprehensions about the series being aired by a government-owned broadcaster, it's hitherto producer Sharad Dutt said that \"a lot of people within the channel's office weren't supportive of the idea, to begin with. But it had no motivation with what was going on politically. The Congress was in power and it had no agenda of the sort.\". Sharma noted that the political clout the series held could be adjudged by the fact that Sagar and Arun Govil (who played Rama) \"were repeatedly courted by both the Congress and the BJP to campaign for them\", and that Deepika Chikhalia (Sita) and Arvind Trivedi (Ravana) went on to become members of parliament.</p><p>Arvind Rajagopal in his book Politics After Television: Hindu Nationalism and the Reshaping of the Public in India (2000) wrote that with the series, the government \"violated a decades-old taboo on religious partisanship, and Hindu nationalists made the most of the opportunity.\" It confirmed to the idea of Hindu awakening and the rise of the Bharatiya Janata Party capitalizing on this.\"</p><p>Manik Sharma of Hindustan Times voiced similar views in that the series \"played in the backdrop of a Hindutva shift in Indian politics, under the aegis of the Rashtriya Swayamsevak Sangh (RSS) and its political outfit, the Bharatiya Janata Party (BJP). While the media and cultural commentators struggled to consider Sagar's epic one way or the other, there were some who saw it as a catalyst, even if unintended, to the turmoil that the movement resulted in.\"</p><p>The series was re-telecast from 28 March 2020 with one hour episode during the morning and one hour episode during the night during the lockdown of 21 days due to coronavirus on DD National.</p><br/><h3>Ratings</h3><table class=\"table table-responsive table-bordered table-hover w-100\"><tbody><tr><th rowspan=\"2\">Week and Year</th><th colspan=\"2\"><span>BARC</span> viewership (Hindi GEC overall)</th><th colspan=\"2\"><span>BARC</span> viewership (Hindi GEC free)</th><th colspan=\"2\"><span>BARC</span> viewership (Hindi GEC pay)</th><th colspan=\"2\"><span>BARC</span> viewership (Hindi GEC rural)</th><th colspan=\"2\"><span>BARC</span> viewership (Hindi GEC urban)</th><th rowspan=\"2\">Ref.</th></tr><tr><th>Impressions (millions)</th><th>Ranking</th><th>Impressions (millions)</th><th>Ranking</th><th>Impressions (millions)</th><th>Ranking</th><th>Impressions (millions)</th><th>Ranking</th><th>Impressions (millions)</th><th>Ranking</th></tr><tr><td>Week 14 of 2020</td><td>61397</td><td>1</td><td rowspan=\"2\" colspan=\"4\" data-sort-value=\"\" style=\"background: #ececec; color: #2C2C2C; vertical-align: middle; text-align: center;\" class=\"table-na\">—</td><td>27169</td><td>1</td><td>34228</td><td>1</td><td></td></tr><tr><td>Week 15 of 2020</td><td>67473</td><td>1</td><td>30619</td><td>1</td><td>36854</td><td>1</td><td></td></tr><tr><td>Week 16 of 2020</td><td>68687</td><td>1</td><td>17693</td><td>1</td><td>50994</td><td>1</td><td>30887</td><td>1</td><td>37800</td><td>1</td><td></td></tr></tbody></table><p>Ramayan notably broke viewership for any Indian television series during that time. It was telecast in 55 countries and at a total viewership of 650 million and re-telecast (24 March - 18 April 2020) nearly 2500 million viewership alone in 25 days, it became the highest watched Indian television series by a distance, and one of top watched television series in world. It entered in the Limca Book of Records as the most watched historical series. On its first telecast (1987), it had 40 million viewership in India. That brought ₹23 crore revenue for the channel.</p><p>The viewership during lockdown garnered record highest ratings for a Hindi GEC (general entertainment channel) show since 2015 making DD National as the most watched Indian channel since its premiere.</p><p>Ramayan garnered a total of 170 million viewers in first 4 shows during which DD National became the most watched Indian television channel after many years. The following week it garnered 580 million impressions in morning slot and 835 million impressions in night slot.</p><p>In week 14 2020, it garnered 61.397 million impressions and the following week it got 67.4 million impressions.</p><p>Even the Wall Street Journal acknowledged the huge popularity of Ramayan's re-telecast during 2020</p><br/><h3>Sequel and remake</h3><p>A follow-up series Luv Kush based on the last chapter of Ramayana Uttara Kanda, aired in October 1988 on DD National. A remake series Ramayan produced by Sagar Arts aired on NDTV Imagine in 2008.</p><br/>"
  },
  "errorMessage": ""
}