{
  "imDbId": "tt1305826",
  "title": "Adventure Time",
  "fullTitle": "Adventure Time (TV Series 2010–2018)",
  "type": "TVSeries",
  "year": "2010",
  "items": [
    {
      "username": "FilmFreak94",
      "userUrl": "https://www.imdb.com/user/ur25979927",
      "reviewLink": "https://www.imdb.com/review/rw2495585",
      "warningSpoilers": false,
      "date": "28 September 2011",
      "rate": "10",
      "helpful": "107 out of 126 found this helpful.",
      "title": "One of the Best Shows of This Generation",
      "content": "Adventure Time is the story of an almost normal 12-13 year old human boy named Finn, and his magical dog Jake(voiced by John Di Maggio). They live in the enchanted land of Ooo and have many strange adventures exploring dungeons, saving princesses(most commonly Princess Bubblegum of the Candy Kingdom)and meeting many strange inhabitants of the world, some friendlier than others.The plot sounds simple enough, but Adventure Time is one of the most surreal kid's shows to come out of Cartoon Network for a long time. And I love every minute of it.While I find the earlier episodes of the show ranged from good to OK, the later episodes got really great with the animation and jokes improving as the series went on. The characters are all very likable with unique personalities and quite a few have very memorable and hilarious one-liners. Every time I sit down and watch this show, I am greatly entertained.That doesn't mean it's for everyone though. While some, like me, may like the surreal appeal others may not. I don't recommend this show to the younger audience(younger then 8) as this show may unintentionally give them nightmares at times. Parents more used to family friendly cartoons may also not like the jokes geared towards the older crowd(and trust me there's a lot of them).Either way, this show has great writing, animation, voice acting everything to me is near perfection. I recommend it to anyone who enjoys a different kind of kid show."
    },
    {
      "username": "BustedBlock",
      "userUrl": "https://www.imdb.com/user/ur117501204",
      "reviewLink": "https://www.imdb.com/review/rw5686238",
      "warningSpoilers": false,
      "date": "28 April 2020",
      "rate": "10",
      "helpful": "21 out of 22 found this helpful.",
      "title": "What can I say that hasn't already been said",
      "content": "This is one of those cartoons that I feel like will never be forgotten, as it is truly an iconic masterpiece. It's characters are beyond great (at least most of them), it's setting is just so creative, the animation is top notch and pleasing to my eyes, and it's story is also pretty amazing. This cartoon will always have a special place in many of our hearts."
    },
    {
      "username": "CamdenGregware",
      "userUrl": "https://www.imdb.com/user/ur63609836",
      "reviewLink": "https://www.imdb.com/review/rw4831205",
      "warningSpoilers": false,
      "date": "6 May 2019",
      "rate": "10",
      "helpful": "30 out of 32 found this helpful.",
      "title": "Quite possibly my favorite show of all time!",
      "content": "Adventure Time is near perfect. I have a personal connection to this show, as it was my favorite show to watch growing up. I decided to revisit this show and binge it start to finish, and i was not disappointed. I love everything about this show, the characters are incredible, the story arcs are amazing, the writing is great, and the world building is extremely captivating. Adventure Time isn't for everyone, and for most it might be tough to get through so many episodes, since so many episodes are useless filler, especially towards the middle of the show, but everything that this show does bad is absolutely shadowed by what it does good. The show gets better and better and more watchable as it progresses, despite a few rough patches. I've never seen character development as incredible as this in any other cartoon. I absolutely LOVE the three miniseries they threw together in the final few seasons. I love how much depth and backstory there is to every character. I could go on and on about what this show does right, but i think you should just go and see for yourself."
    },
    {
      "username": "patrickfilbeck",
      "userUrl": "https://www.imdb.com/user/ur105082429",
      "reviewLink": "https://www.imdb.com/review/rw7548459",
      "warningSpoilers": false,
      "date": "14 November 2021",
      "rate": "10",
      "helpful": "23 out of 27 found this helpful.",
      "title": "A grotesquely psychedelic affair, a cartoon for fun, depth and reflection",
      "content": "Adventure Time is an absurd series, a cartoon that makes use of Dadaist motifs, uses classic heroic doors and themes as a carpet for the stories and does not forget to develop a contemporary relevance. A work of art that often seems misunderstood, fun that should not be missed. Oh yes, the theme song is just fantastic and very, very funny."
    },
    {
      "username": "FairlyAnonymous",
      "userUrl": "https://www.imdb.com/user/ur25126113",
      "reviewLink": "https://www.imdb.com/review/rw2441411",
      "warningSpoilers": false,
      "date": "10 June 2011",
      "rate": "10",
      "helpful": "72 out of 98 found this helpful.",
      "title": "The greatest TV show on cartoon network",
      "content": "First of all I really don't like cartoon network... or at least when they keep on showing stupid kid shows. This is what makes Adventure Time so special is that it is pretending to be a kid's show in appearance but in reality it is quite mature and isn't really for kids. All of the episodes I have seen are funny except for one. The characters are all likable and there seems to be a dark side to every character. Finn is the main character and is the ONLY human in the entire show. There are hints that this is the far future, and humanity was destroyed (you see destroyed cities under water, or a river of garbage). Finn is tries his best at being a good hero, but sometimes they he seems to hurt some innocent people. Jake is his side kick dog who is really great because his voice is perfect, and he is just laid back and relaxed. Princess Bubblegum is the good princess who Finn likes, and she is super smart and is ruler of the candy kingdom. She seems to have a dark side that appears every once in a while. The Ice King is a common protagonist. It bothers me that everyone hates him, and kind of attacks him for no reason. It is often seen that he steals princesses because he only wants to be happy, and basically the reason he does anything is because he is so lonely.Some people may not like this show for its very smooth animation style. The animation is a bit cheap but it is sort of based off of video games and some Japanese animation. It is important to realize this show is trying to be weird. Some people do not appreciate its random and off the wall humor. Like where Finn is offered to run with wolves, so him and his vampire friend start running on all fours chasing wolves at night, and they start to look really scary and foam at the mouth. Finn starts biting the wolves and fighting them, and a whole bunch of random stuff. This entire scene is only about 30 seconds long and seems out of the blue. What makes this show great is also how something insanely funny will happen but it goes by so fast you won't notice it. Like when a friendly Peppermint candy does Jake and Finn a favor, and later he says \"Well now I want your skin!\" and Jake and Finn laugh at his joke and then he says \"I will rip it off of you while you're asleep\" and he gives a demonic smile. Their smiles fade quickly. Every episode has a funny ending which always makes you leave even a boring episode on a high note.I cannot wait to see more of this show since I have seen every episode and it is a great show. Do not judge this show from only one or two episodes. Watch a lot of them and you will realize how great it is."
    },
    {
      "username": "Nemsi",
      "userUrl": "https://www.imdb.com/user/ur23537571",
      "reviewLink": "https://www.imdb.com/review/rw4149922",
      "warningSpoilers": true,
      "date": "1 May 2018",
      "rate": "10",
      "helpful": "46 out of 51 found this helpful.",
      "title": "Adventure Time is often misunderstood",
      "content": "You might get a wrong idea about AT:1 - It can seem very childish because of it's vibrant colors, silly moments here and there (that is one of many characteristics of the show) BUT The show is not typical in any way including childishness and silliness - those qualities enrich the show.2 - AT might seem dull and random because of how weird it can get. BUT The weird part is all in favor of originality (which is limitless on this show). Large portion of crazy elements of Adventure Time are purposeful smart ideas and in most cases these ideas come from pure artistic statements and not just random thoughts anyone can have.To sum up what I wrote so far - Adventure Time is not what it seems. That goes to show on the characters: For instance: Ice King is not a two dimensional crazy villain he seems at first - He's a former scientist with a tragic past and you really empathize with him. Marceline is not just a cool vampire - she has the most tragic backstory. Princess Bubblegum is not just pretty and cute princess with cold exterior - she is one of the most complex characters on the show and you find out more and more about her... I could go on but the characters are/get extremely developed as the show goes on (Finn is the best example of that considering how much he's grown and matured).3 - AT is not for a limited age group IN FACT as an adult, I enjoy the show more than any child can ever enjoy - that's thanks to the smart writing. The writers on this show manage to fit a great story (90%/95% of the times) in 11 minute episodes and it's for all ages - it's adventurous, deep, smart and funny.4 - Don't expect AT to be a typical Cartoon Network show. Furthermore, if you're an adult please don't watch Adventure Time on CN as lots of moments are censored (cut/altered) on the network and you may enjoy the show better without those changes in place.5 - There might be a bad episode Yea, no show is 100% perfect and because of the difficult task the writers have on this show. (I need to explain why: let's compare this show to Regular Show, Family Guy or Rick and Morty - the writing structure is less evident on Adventure Time as it doesn't quite have a typical structure like Family Guy has for instance - being comedy-based characters being cynical most of the time, or having random cuts for loughs, AT doesn't have a structure like Rick and Morty that has the smartest character in control every episode and being predictable and it doesn't have a typical tone every single time like FG and R&M by going for comedy over drama most the time... I write all this not because I hate on any of these shows but it's a simple fact - Adventure Time (while not perfect either) has way less cliche writing and way more depth than most cartoons out there). Because Adventure Time makes sense, has depth and a developing story instead of on-timer episodes, it's difficult to make every single episode great. So be sure to give Adventure Time a chance to grow on you and most importantly - don't judge the show on few episodes. P.S: Adventure Time starts as being a little silly but it matures - slowly getting smarter and deeper so keep that in mind as well.I can't get into someones head and clearly, we're all subjective here no matter how hard we try but by telling people what to expect and giving them the idea why they might enjoy a certain film/animation and making them aware of what to expect is what's important rather than saying this show is awesome or that it sucks. As for me: I am happy I get to live in the age when there's Adventure Time to watch - that is how much this show means to me. And as a summery:This show is not an entertainment, Adventure Time is art and I mean it both as a regular fan and also as someone having degree in Animation and History of Modern Art. Adventure Time is all a person like me needs in a world full of nonsensical shows and movies that aim at entertainment and money. So please keep an open mind and give this show a chance, you might end up thinking this show is pure genius and not some over-hyped thing some simple minded people tell you it is."
    },
    {
      "username": "danielgeng-44221",
      "userUrl": "https://www.imdb.com/user/ur90494228",
      "reviewLink": "https://www.imdb.com/review/rw5071419",
      "warningSpoilers": false,
      "date": "20 August 2019",
      "rate": "9",
      "helpful": "55 out of 58 found this helpful.",
      "title": "It's Awesome",
      "content": "For a kids show, Adventure Time has surprising mature and deep themes, making it a joy to watch for all ages. The characters are all so diverse and unique and the voice acting is perfect. For the most part they are light hearted and funny, but as the show gradually reveals their backstories and flaws, it adds quite a bit of depth and even sadness at times. This allows them to feel real and relatable despite the supernatural setting. What I enjoy most about Adventure Time is that even though the episodes seem random and disconnected, they all help build up a rich and diverse world and reveal many subtle ideas and story arcs that are massively paid of in the future. It is a show that leaves me smiling every time I watch it, with a heartwarming display of friendship, morality and forgivenss. In addition, it is also hilarious and full of clever, memerable one liners. For me, the only thing holding this show back from being a masterpiece is that it has a few boring and even uncomfortable episodes that I don't feel like are representative of how good the show normally is. Despite this, I love this show and quite simply, its awesome."
    },
    {
      "username": "StastyRain",
      "userUrl": "https://www.imdb.com/user/ur130441944",
      "reviewLink": "https://www.imdb.com/review/rw7270221",
      "warningSpoilers": false,
      "date": "26 August 2021",
      "rate": "9",
      "helpful": "9 out of 9 found this helpful.",
      "title": "Amazing show",
      "content": "This show was a part of my childhood. I decided to rewatch it recently and still holds up as one of my favorite cartoon shows of all time."
    },
    {
      "username": "bigstarexplosion",
      "userUrl": "https://www.imdb.com/user/ur137200781",
      "reviewLink": "https://www.imdb.com/review/rw7352031",
      "warningSpoilers": false,
      "date": "17 September 2021",
      "rate": "10",
      "helpful": "14 out of 15 found this helpful.",
      "title": "Pretty much the only tv show I need.",
      "content": "I'm pretty young so I'm really biased but this show has pretty much grown with me as I have grown, even the characters themselves have grown with me because they age as the show progresses, this show really has a special place in my heart no other one does, it's fun, it's emotional (sometimes), and it's engaging, I wouldn't call it the funniest of shows, especially since the earlier seasons are a lot more juvenile compared to the \"mature\" later seasons, it's funny enough to get a good chuckle out, I must say the earlier seasons are a lot more \"childish\", but they are also very nostalgic and i feel is a great way to introduce the show to a child, so I really consider it a great show, watch it bruh."
    },
    {
      "username": "Charons_Nightmare",
      "userUrl": "https://www.imdb.com/user/ur50615829",
      "reviewLink": "https://www.imdb.com/review/rw4322823",
      "warningSpoilers": true,
      "date": "5 September 2018",
      "rate": "10",
      "helpful": "22 out of 25 found this helpful.",
      "title": "Good bye, old friend!",
      "content": "What a ride it was. The first seasons seemingly light entertainment with a slice of life part here and there, building up to some quiet serious mini series in the series in the later Seasons, that were really well put together and thought out. Al culminating to a big finale. Was it worth waiting 8 Years for it? I don't know, somehow yes, but I don't thin kthat that was the goal anyway. The Goal was the way all along and I can't wait to jump on this ride again, to say goodbye to the end and greet the beginning!"
    },
    {
      "username": "sproutman",
      "userUrl": "https://www.imdb.com/user/ur66519838",
      "reviewLink": "https://www.imdb.com/review/rw5920020",
      "warningSpoilers": false,
      "date": "20 July 2020",
      "rate": "",
      "helpful": "19 out of 19 found this helpful.",
      "title": "The fun will never end!",
      "content": "Adventure Time, like many other shows of its genre, often gets misinterpreted as simple entertainment for children. However, it's also a thoughtful piece of art with a vibrant aesthetic, great humor and silly characters.Furthermore, it´s very light-hearted and easy to get into, no matter which episode you start watching from. It works as a semi-chronological collective, with each one centered around a simple lesson, theme or fun story.There is passion put into every frame of animation, line of dialogue and song. Anybody can enjoy this show for what it is, and that is kind of the point. \"You don't just read the poetry to understand it, you got to feel it.\""
    },
    {
      "username": "Sayuraisani",
      "userUrl": "https://www.imdb.com/user/ur108521469",
      "reviewLink": "https://www.imdb.com/review/rw5172541",
      "warningSpoilers": false,
      "date": "8 October 2019",
      "rate": "10",
      "helpful": "11 out of 12 found this helpful.",
      "title": "One of my favourite animation series...",
      "content": "I became absolutely obsessed with Adventure Time... and for good reason! It is one of the most creative and amazing shows of all time."
    },
    {
      "username": "poke_a_polk",
      "userUrl": "https://www.imdb.com/user/ur11391828",
      "reviewLink": "https://www.imdb.com/review/rw2241214",
      "warningSpoilers": false,
      "date": "25 April 2010",
      "rate": "10",
      "helpful": "187 out of 217 found this helpful.",
      "title": "One of the best things on TV at the moment",
      "content": "I first saw Adventure Time on youtube some years ago. Now it's TV show. I loved it when it was a one-shot video. And I love each episode I've seen on Cartoon Network even more.Yes, the characters are silly. Yes, there is a fair amount of \"OMG, that's so random!\" going on. But while shows like Chowder may fail at times using this model, Adventure Time succeeds.It does so thanks to wonderful voice acting, clever dialog and most of all, unusually mature themes. Not in a risqué sense, but...it doesn't rely on cookie cutter stories and it's comfortable leaving some endings ambiguous. It's also comfortable making characters believable (despite its fantasy setting).This show is deserves attention."
    },
    {
      "username": "saraaorabi",
      "userUrl": "https://www.imdb.com/user/ur98337912",
      "reviewLink": "https://www.imdb.com/review/rw5283351",
      "warningSpoilers": false,
      "date": "27 November 2019",
      "rate": "10",
      "helpful": "13 out of 14 found this helpful.",
      "title": "One of the best cartoons of this decade",
      "content": "Adventure time is one of the best cartoons of this decade, it's one of those cartoons that any age can enjoy. it has great morals to it and many episodes are amazing to watch. I've loved adventure time as a kid and always will. Sure, some episodes weren't as good, but this show is a masterpiece and many episodes were amazing to watch with great messages behind them, even emotional ones that will make you cry and relate to. It's also very hilarious. This show never tries to disappoint in any way. It has amazing songs as well !"
    },
    {
      "username": "bregund",
      "userUrl": "https://www.imdb.com/user/ur2021461",
      "reviewLink": "https://www.imdb.com/review/rw2590378",
      "warningSpoilers": true,
      "date": "1 April 2012",
      "rate": "10",
      "helpful": "26 out of 38 found this helpful.",
      "title": "Smart enough for adults",
      "content": "I am consistently surprised at how well written this show is; it takes a lot for me to become dedicated to a TV show, to the point where I watch every episode. Though this show is just as bizarre as Pee Wee's Playhouse or anything from Sid and Marty Krofft, its strength lies in its consistency and continuity, its identifiable humanity, its striking contrasts, and its irreverent, multi-level humor.I wouldn't call this a children's show, since a lot of the one-liners are obviously aimed at adults. There are certain scenes that I have rewound to watch several times because they are so fresh and new, bringing to mind the observational humor of Gary Larson; for example, in one episode, a small bird lands on a window sill. When you expect it to chirp, instead it makes a sound like an alarm clock. This particular episode (about a snow goblin?) it so well written and animated that it should be in the museum of modern art. We see the goblin getting up in the morning, adjusting his eye, putting on a circle of sticks, and eating a bowl filled with a pear and acorns. It sounds strange, but the way the action plays out is such an odd but charming parallel to everyone's morning routine that you can't help smiling.For anyone who wants to see a completely and fully formed world, filled with characters who develop from one episode to the next just like a non-animated program, and writing better than any reality show, check out Adventure Time. It's not just for kids!"
    },
    {
      "username": "daaaaarrin",
      "userUrl": "https://www.imdb.com/user/ur136783122",
      "reviewLink": "https://www.imdb.com/review/rw7337831",
      "warningSpoilers": false,
      "date": "12 September 2021",
      "rate": "10",
      "helpful": "10 out of 11 found this helpful.",
      "title": "It's literally perfect",
      "content": "Amazing, best cartoon show in existence along side Regular Show."
    },
    {
      "username": "Nnnk-1",
      "userUrl": "https://www.imdb.com/user/ur18183678",
      "reviewLink": "https://www.imdb.com/review/rw2237553",
      "warningSpoilers": false,
      "date": "16 April 2010",
      "rate": "10",
      "helpful": "153 out of 181 found this helpful.",
      "title": "Every Bit As Great as We Hoped",
      "content": "\"It's Adventure Time! C'mon grab your friends. We'll go to very distant lands. With Jake the Dog and Finn the Human the fun will never end. It's Adventure Time!\" Adventure Time was an animated short made by Pen Ward and his team a few years back. The short was full of comedy, off the wall jokes, chocked full of hilarious one-liners and even an entertaining fight scene. And now, years later it is a full blown television series. The only thing people were concerned about was that the adaption could never live up to the original.Well I'm here to say it has. In. Every. Aspect.The only thing different is the characters and world have been expanded upon, and Penn's name is now Finn.Adventure Time with Finn and Jake is Cartoon Network's newest cartoon. Similarly to the pilot, it is full to the brim with humor (some which is directly aimed at the adult audience, THANK GOD) There are still many one liners (most of which have been stolen from the pilot but I'm hoping that as the series goes on this will diminish. The music isn't very memorable, but it isn't supposed to be. It's a show about Finn, Jake and all of their friends and the stupid situations they find themselves in.Cartoon Network has finally found a gem, and I hope for their sake that they keep this show running and start funding more shows like this instead of obviously cheap-made flash cartoons (Johnny Test anyone?) It is a show like this that was needed to get CN back on top, and I hope it'll stay that way What time is it? ADVENTURE TIME!"
    },
    {
      "username": "annikaalexis",
      "userUrl": "https://www.imdb.com/user/ur56308079",
      "reviewLink": "https://www.imdb.com/review/rw5641547",
      "warningSpoilers": false,
      "date": "15 April 2020",
      "rate": "10",
      "helpful": "7 out of 8 found this helpful.",
      "title": "one of my favorite shows",
      "content": "A great, heart-warming, action-packed and funny show. great characters with lots of depth. even finn, the main character, is awesome, which is unusual in my opinion. he respects women and despite being this manly hero, he knows its okay to like, cry and stuff, which is all great to teach kids and adults alike. great animation and wacky story as well. a well made and entertaining show that will forever be very dear to me. i used to watch with my friends and family as a kid and had many toys and games, so this show is important to me."
    },
    {
      "username": "devinbrown-19091",
      "userUrl": "https://www.imdb.com/user/ur101742934",
      "reviewLink": "https://www.imdb.com/review/rw5271952",
      "warningSpoilers": false,
      "date": "21 November 2019",
      "rate": "10",
      "helpful": "10 out of 13 found this helpful.",
      "title": "Amazing",
      "content": "One of the most beautiful shows I have ever seen. Hands down, in sad it's over but the ending is so beautiful."
    },
    {
      "username": "simiagon",
      "userUrl": "https://www.imdb.com/user/ur103927026",
      "reviewLink": "https://www.imdb.com/review/rw5043827",
      "warningSpoilers": false,
      "date": "6 August 2019",
      "rate": "8",
      "helpful": "6 out of 6 found this helpful.",
      "title": "a strange fun and mysterious universe",
      "content": "I love this show as a kid..some times creepy...I love creepy..mysterious I love it...one of the best cartoons"
    },
    {
      "username": "saintbeacon",
      "userUrl": "https://www.imdb.com/user/ur55267706",
      "reviewLink": "https://www.imdb.com/review/rw3087496",
      "warningSpoilers": false,
      "date": "16 September 2014",
      "rate": "8",
      "helpful": "17 out of 22 found this helpful.",
      "title": "Anyone who needs some Understanding, Read this",
      "content": "There was a time when I disliked this show. Now, I view it as one of the best animated series of all time, and one of the most creatively and boldly non-pandering shows in cartoon history, and this is why:Adventure Time does not pander to traditional or accessible story structures, payoffs, exposition, or plot constructs. It does not use traditional or accessible cartoon character archetypes. It does not use traditional or accessible humor. It does not use traditional music or voice-acting. It doesn't even always use traditional emotions or dialogue. As a result, the show feels more original than anything else seen on cartoon network since Samurai Jack. Much like Samurai Jack, this show is very immersing and has a style all its own.Also like Samurai Jack, the show takes place in a strange world, where almost anything can happen, or any kind of character can show up, and it will still feel believable and consistent. Recommended for anyone who is into experimental storytelling and music. In fact, most of the soundtrack consists of formless ambient music or IDM.Nothing about this show feels forced or phony. There are no traditional payoffs or unneeded exposition. There are lots of silent moments and strange scenes that do nothing but establish the characters and their varying types of insanity. There's lots of dialogue that can be taken a number of ways. There are no trumpet-blasts or dinky piano tunes to let the viewer know when he should laugh or be excited. The show makes it YOUR job to be entertained. It's like going to visit another world and have fun watching these characters live their day-to-day lives. No, better yet, it's like being a man from one- thousand years ago watching our daily lives. He finds them a novelty, and is intrigued, but he does not understand everything we do, or the way we talk. The characters in this show will not stop to explain anything for the benefit of the audience. For them, most of the weirdness is just commonplace. They know more than we do, but they have no reason to tell us what they know. If you are used to shows with super-tight writing where everything is conveyed to the audience, look elsewhere. This is a more challenging, atmospheric sort of show.That being said, this is also one of the only cartoons that has succeeded in making me cry multiple times. As a warning, you will not like every episode. You may not even like every season. I don't, and unless you have very broad tastes, you won't. This show has numerous fans who like it for totally different reasons. Some are their for the back-stories and mythos, some for the adventure episodes, some for the comedy, some for the romance plots, and some for the tragedies. This show does basically everything.Animation: Minimal, using bright colors and simple, easy designs. The animation may seem lackluster, but it's a pretty immersing style if you give it the chance, and some of the art direction and creativity is admirable. The simple style allows for an endless amount of characters, backgrounds, and stories without too much expense needed. The colors and production value get better over the course of the show. They won't look the best in the first few episodes.Characters: The characters here are diverse and numerous. Some of the them are annoying, but most of them have depth and dimension that will slowly reveal itself over the course of the show. Many of them are immature, and most of them are insane to varying degrees, but they often have to make hard decisions or go through strange dilemmas. Anyone who SEEMS like typical archetypes will prove otherwise. My expectations were challenged by some of them. Simon Petrikov is my favorite character. Writing and Storytelling: As I said, this is a low-conveyance show. The stories are done in a freestyle, storyboard-driven manner. The writers seem to draw from Nintendo- style fantasy games like \"The Legend of Zelda\" or the \"Paper Mario\" series. The early episodes are a bit more focused on simple fun, randomness, and adventure, but things don't get interesting (for me at least) until the show reveals its true colors a bit later on. Pieces start to come together, and the viewer realizes that the randomness actually isn't as random as he might think. Without spoiling much, let's just say that the world of Ooo has a bittersweet back-story to it that makes the show infinitely more interesting once they start hinting at it. Some of the individual characters also have mysterious, semi-disturbing origins. It's what made me curious in the first place. The show deals with its various characters and plot threads at a respectable pace, often juggling many at once and becoming more complex. The \"Billy's Bucket List/Wake Up/Escape from the Citadel\" three- parter is what I would recommend for people who want to see the show do some more tight, well-crafted writing. This series features passage of time, continuity, and the aging of characters.Audio: The deadpan, naturalistic voice acting can be either welcoming, or annoying, depending on the viewer or character. I like how the casting is handled. Music is experimental electronica. Musical numbers sound realistically unrehearsed, which makes them more heartfelt when used in episodes like \"I Remember You\" and \"Lemonhope Story\".You don't have to like the show, but I at least want it to be acknowledged for the risks it takes and the creativity it encourages. People who have worked on the show have gone on to make other series like that are good for similar reasons and have helped give Frederator and Cartoon Network more of an identity again, bringing them more respect from longtime fans. Also, to warn you, this show is surprisingly not for young kids. Make sure you're at least around 12 before you watch it. Trust me."
    },
    {
      "username": "dmedinagimenez",
      "userUrl": "https://www.imdb.com/user/ur89409666",
      "reviewLink": "https://www.imdb.com/review/rw4292765",
      "warningSpoilers": false,
      "date": "19 August 2018",
      "rate": "10",
      "helpful": "13 out of 17 found this helpful.",
      "title": "¡¡Amazing!!",
      "content": "This is without a doubt the best animated series that has been created for a long time. The animation, the dark plot that it has, the characters, and many other things. It is a very intelligent series and above all a series with which you can enjoy a lot, I recommend it a lot10 out of 10"
    },
    {
      "username": "ericstevenson",
      "userUrl": "https://www.imdb.com/user/ur66601046",
      "reviewLink": "https://www.imdb.com/review/rw3464179",
      "warningSpoilers": false,
      "date": "5 May 2016",
      "rate": "10",
      "helpful": "13 out of 21 found this helpful.",
      "title": "Yep, Cartoon Network's best show ever",
      "content": "Okay, I guess \"Rick And Morty\" is technically a better show, but you get the idea. In terms of regular CN shows, this one takes the cake...and all the candy and treats with him. I remember back when I first saw the pilot episode of this show on \"Nickelodeon\" and I immediately thought to myself that this was going to become the next big thing and that people would love it. I had no idea it would even be a full fledged cartoon at the time. Lo and behold, it's a massive hit and deserves every bit of popularity. This is yet ANOTHER Cartoon Network show where almost every character is some distinct animal or object or whatever. If I'm allowed to have a favorite character, it would probably be Marceline. I love her voice, her powers, her personality, just everything about it. Thank you for giving her one of the most multi-part episodes in the history of television.At this point, it seems like Finn has had bad luck with literally every single female character in the entire show. At least Dipper has Pacifica by process of elimination. I wouldn't be surprised if he didn't end up with anyone at the end of the show. What's great is that the show is wonderfully surreal and nonsensical, but it still has an ongoing story! This isn't like the cartoons of old where it would just show the characters dying or whatever all the time but instead one that truly builds on itself in the most subtle ways. With such a huge cast of characters, it's great to see how every individual story arc is going with them. They really do work hard to make everyone important and include every character in on the details.The animation style is just fun too. I just think the dot eyes beckons back to the \"Peanuts\" comic. Seriously, I sometimes think of Charlie Brown just by looking at Finn. It's sad how he broke up with Flame Princess. I guess you could say nowadays, she's an \"old flame\"! Hee hee! I think my favorite episode would be \"Betty\". It shows the Ice King's very old girlfriend back when he was human traveling through time to try to restore his sanity. Anything serious with that guy is very well done and it's great to see such a goofy looking show teach us some really valuable life lessons. Even the minor characters are allowed to be developed and fleshed out.Character studies are always good and that's just what this show does. The Lich is probably the best villain and I do wish they would use him more. Anyone voiced by Ron Perlman is going to be awesome. It seems like they are similar to \"My Little Pony: Friendship Is Magic\" in that most villains just appear for a few episodes. I still find that show better as it has the best animation. It's great to hear a lot of talented voice actors too. When you watch as many cartoons as I do, you tend to recognize the voices. I think Lumpy Space Princess is the funniest character, but even she gets her well deserved limelight.It's also great how the show has a mythology that gets developed more as the series go on. A lot of shows don't really delve into it that much. Then again, the stuff they do have is mostly subtle and hinted at, which ends up working the best for it. Thank you \"Adventure Time\" for saving Cartoon Network in its darkest days as this was probably the show that saved the network from all those awful live-action shows. May it live on forever! Or at least as long as the creator wants it too. Perfect ****."
    },
    {
      "username": "he_is_sparticus",
      "userUrl": "https://www.imdb.com/user/ur23933362",
      "reviewLink": "https://www.imdb.com/review/rw2314332",
      "warningSpoilers": false,
      "date": "22 September 2010",
      "rate": "10",
      "helpful": "80 out of 103 found this helpful.",
      "title": "Cartoons like this come once in a decade!",
      "content": "I very rarely find anything on TV or in film that makes me laugh as frequently and unexpectedly as this show. Adventure Time is a well needed breath of life into cartoons. What impresses me most is that the humour is very mature but unlike other shows of that nature, for example Ren & Stimpy, it's still completely for the children. That's where the magic lies. When watching you become a kid again, immersing you in the imagination all of us shared as a youngster. The simple, but I think fantastic, hand drawn animation cements the feeling that this is no ordinary cartoon. It oozes with great characters and settings. Everything about Adventure Time shows all the love and care invested it by Pen Ward. I'd recommend this show to any cartoon lover and anyone who's still a kid at heart."
    },
    {
      "username": "Th3Cure",
      "userUrl": "https://www.imdb.com/user/ur6443641",
      "reviewLink": "https://www.imdb.com/review/rw2496382",
      "warningSpoilers": false,
      "date": "30 September 2011",
      "rate": "10",
      "helpful": "79 out of 97 found this helpful.",
      "title": "I love this show.",
      "content": "Adventure time is a strange animal. It's on cartoon network. Not adult swim; but on during the regular hours. The shows target audience is children. But nonetheless, this show is the best cartoon I've ever seen. I saw the pilot a couple years back and finally saw the show and i was blown away. Adventure Time does not teach lessons per se. It starts off supposedly trying to teach you something, but instead saysscrew it and veers off into AWESOME. Its random, hilarious, and perfect. The characters are messed up in the best way possible. If any lesson can be taken from this show it's that nobody is perfect; everyone has their flaws. Everyone messes up, a lot. Everyone makes mistakes. Even though Finn is the only human in the show, everyone in the show makes human mistakes. It doesn't matter who or what you are, you're still going to mess up. But no matter what flaws you may have or how much you screw up, at the end of the day your friends will be there for you; especially when you're there for your friends. If your friend is in trouble, destroy the problem with sword, song, reason, or love. I'd recommend this show for humans 1-200."
    }
  ],
  "errorMessage": ""
}